{
    "id": "HoYgPlmOZgo",
    "title": "tshark and Termshark tutorial: Capture and view wireshark captures in a console",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-07-08T19:22:00Z",
    "video_url": "https://www.youtube.com/watch?v=HoYgPlmOZgo",
    "category": "Education",
    "tags": [
        "wireshark",
        "tshark",
        "termshark",
        "wireshark tutorials",
        "wireshark 2019",
        "wireshark download",
        "wireshark filters",
        "wireshark basics",
        "tshark cli",
        "tshark tutorial",
        "termshark tshark",
        "wireshark tshark",
        "tshark vs wireshark",
        "hacking",
        "linux",
        "wireshark tutorial",
        "ethical hacking",
        "ethical hacking course",
        "kali linux",
        "kali",
        "kali linux tutorial",
        "kali linux install",
        "kali linux course",
        "gns3",
        "CCNA",
        "INE",
        "CBT Nuggets",
        "CCNA Study",
        "Cisco Training",
        "cisco ccna",
        "ccna 2019",
        "gns3 wireshark",
        "packets",
        "tcp",
        "ccnp",
        "ccna"
    ],
    "views": 44261,
    "likes": 1010,
    "comments_count": 41,
    "description": "Get the course for $10 on Udemy:  or GNS3 Academy:  This is a tshark and Termshark tutorial: It is now possible to capture and view Wireshark captures directly in a console window. No need for a graphical user interface (GUI) - you can do all of this directly within a Linux terminal or console.   tshark and Termshark installation: ============================== tshark: apt-get install tshark  Termshark: wget  tar -xf termshark_1.0.0_linux_x64.tar.gz cd termshark_1.0.0_linux_x64 install termshark /usr/local/bin  How to use:  tshark -w tshark1.pcap  termshark -r tshark1.pcap   Help: termshark UserGuide:   Course overview: Do you know network protocols? Do you know how to hack? Want to learn wireshark and have some fun with Ethical hacking? This is the course for you:   Learn Wireshark practically. Wireshark pcapng files provided so you can practice while you learn! There is so much to learn in this course:  - Capture Telnet, FTP, TFTP, HTTP passwords. - Replay VoIP conversations. - Capture routing protocol (OSPF) authentication passwords. - Troubleshoot network issues. - Free software. - Free downloadable pcapng files. - Answer quiz questions.  The course is very practical. You can practice while you learn!  Learn how to analyze and interpret network protocols and leverage Wireshark for what it was originally intended: Deep Packet Inspection and network analysis.  Protocols we capture and discuss in this course include: - Telnet - FTP - TFTP - HTTP - VoIP - OSPF - EIGRP - DNS - ICMP  Who this course is for: Network Engineers Network Architects Ethical hackers Networking Students  #wireshark #termshark #tshark",
    "description_links": [
        "http://bit.ly/2IXZnn8",
        "http://bit.ly/2J4PzIb",
        "https://github.com/gcla/termshark/releases/download/v1.0.0/termshark_1.0.0_linux_x64.tar.gz",
        "https://github.com/gcla/termshark/blob/master/docs/UserGuide.md"
    ],
    "transcript": "- Now this is a sample from my Wireshark course. You can buy the course using the link below for only $10. So you could buy it from Udemy, GNS3 Academy, as an example. For only $10, you'll be able to access my Wireshark course, but I'm gonna show you something that I think is really cool in this video, which is namely tshark and Termshark. I'm gonna show you how you can capture packets off the network and view those packets without a graphical user interface. So you can now open PCAP files simply through a console. You don't need a graphical user interface to do that. So let's get started. (upbeat techno music) In this video, I'm gonna show you how to use tshark as well as Termshark. tshark to capture traffic off the wire, and Termshark to view Wireshark captures through a terminal. Sometimes, you don't have access to a GUI interface. Sometimes you want to be able to capture packets off the wire using a terminal, and tshark is great for doing that. As an example, you may run a capture application on a Linux server or a Linux host, which doesn't have a graphical user interface installed. You could, as an example, run it on a Raspberry Pi, so capture traffic off the wire, using a Raspberry Pi, but do that without a graphical user interface. So simply using a console, capture the traffic. And you may wanna be able to view those Wireshark captures through a console, so that's what I'm gonna demonstrate in this video. In this GNS3 topology, I've got an Ubuntu host. This Ubuntu host does not have a graphical user interface, so if I type clear, all I get is a console connection. There is no graphical user interface. So as an example, if I want to view the interfaces on this device, I'm doing that through a CLI. I'm not doing it through a graphical user interface. All I have is a console connection. So as an example, I'll edit this file so that the host gets an IP address from a DHCP server. What I'll do is close that console connection down, or terminal down, stop the Ubuntu client, start it up again, open up a console. Notice here I now have an IP address that has been allocated to me via DHCP. The NAT cloud is allocating IP addresses to the Ubuntu client. This is a built-in GNS3 switch. This is a Cisco switch. This is a Cisco router running within GNS3. So the problem here is I can't run a graphical Wireshark application. I need to run Wireshark directly through the console. So the first thing I'm gonna do is, so the first thing I'm gonna do is type apt-get update to update my Ubuntu references. Okay, now that my Ubuntu references have been updated through apt-get update, what I'm gonna do is install tshark. So to do that I type apt-get install tshark. Say yes to install the application. So what this is doing is connecting to the Ubuntu cloud and essentially downloading and installing tshark on this Ubuntu client. I'm asked, \"Should non-superusers \"be able to capture packets?\" I'm gonna say yes, but in this example I'm actually logged in as root, so I'm simply gonna capture using root. So I've now installed tshark. I can start it by simply typing tshark. And notice it's capturing packets on ethernet zero. It's essentially capturing packets on this interface and what we're seeing at the moment are spanning tree messages that are sent by the switch. What I'll do on the router is enable OSPF, and we should be able to see OSPF updates. So we'll get this device to use DHCP, and then enable OSPF on all interfaces. It's now received an IP address through DHCP. Notice we can see information such as spanning tree ARP messages and so forth. Now that's not great, that's just showing me the updates in real time. So I can see, as an example, DHCP Offer, DHCP Request. So what you may find more useful is to push that to a file, so write it to a file, in this case tshark1.pcap, as an example. So that's capturing the traffic, and dumping it into that file. So as an example, show IP OSPF interface brief. We're running OSPF on this router now. If I type clear, IP OSPF process and clear all the OSPF processes, OSPF messages will be captured. Let's enable EIGRP. So E-I-G-R-P, and I'll enable that on all interfaces. Hopefully this tshark application is now capturing messages including spanning tree, including CDP, DTP, EIGRP, OSPF and so forth. So I'll stop that by pressing Control + C, and notice I now have a tshark.pcap file. Now I want to be able to view that. I could copy that to my Windows computer, as an example, or my Mac, or a Linux computer with a GUI, and then open that up with Wireshark, but let's view the files directly through this console. Okay, so let's install Termshark. The first thing I'm gonna do is install Wget. This is gonna allow me to download an application from GitHub. I could use Git, but I'm simply gonna use Wget. What I'm gonna do now is use Wget and connect to GitHub and download Termshark. I'll put the links below this video. This is essentially a GitHub page, and I'm downloading Termshark from GitHub. So here's the GitHub page for Termshark, a terminal UI for tshark, and we can see a little bit of information about the application. You can also do a clone or download. So I'm simply downloading this file from GitHub. So ls shows me that I've got the file downloaded. The next thing I'm gonna do is unzip or untar that file, so untar the file. There it is. I'm gonna move to that directory, and I see Termshark. So what I'm gonna do is install Termshark to user local bin, and then I'm gonna go back to my home directory, so back in my home directory of root. I'll clear the screen. Notice I've got this file which I previously created by capturing traffic off the network, so what I can do now is type Termshark read tshark PCAP file. So I'm gonna read my PCAP file. And what you can see through a terminal window now is the traffic that's being captured. So as an example, I could filter for OSPF and apply my filter. Notice I see my OSPF messages. So as an example, this is the source MAC address of the router. Show interface gigabit zero zero. Notice MAC address of router. IP address of router. And that's what we see over here. Destination is 224.0.0.5, which is the multi-cast address for OSPF. There's the layer two MAC address. Open up the IP header. I can use my Up and Down Arrow keys. Use Enter to open this up. Notice DSCP is set to CS6, very important traffic. Scrolling down I can see that the protocol is 89, which is OSPF. So at layer four, notice we have OSPF, press Enter there. Press Enter here. The version of OSPF is version two. This is a hello packet. Source IP address is this, as we saw over here. IP address of router. Area is the backbone area. So I can see all the traffic that I would normally see through a graphical user interface directly through a terminal. Notice once again, if I quit outta here, I am in a terminal. There's no graphical user interface here. It's a simple terminal. But Termshark allows me to read what Wireshark captures through a terminal window. I'll filter for EIGRP. Notice there's our EIGRP messages. I can go up and down through my messages, use the Up and Down Arrows if I like. I can press Tab to jump from one window to another. So Tab takes me down here. Tab to the first window, second window. Press Enter to collapse that, Enter to open it up. I can press Forward Slash, and that'll allow me to change the protocol, so to STP as an example. Now I can see spanning tree messages. Once again, click any if I like, EIGRP, click Apply. There's my EIGRP messages, once again. Source IP address, destination, 224.0.0.10. Well-known multi-cast address for EIGRP. So I'm using my mouse but I could use a keyboard, so Up and Down keys, Enter key, Enter key again, Enter key here to see parameters. Notice they're my K values. Enter key to see software version information. Enter, Up key, Enter, press Tab, and now I can go up and down through the protocols. Forward Slash, I could specify, let's say STP again, and click Apply. Here's my spanning tree protocol, so I can see the root identifier, et cetera et cetera. So I'm not gonna bore you through all the options in this application. Have a look on GitHub, load of good examples and documentation on GitHub, but I'm hoping this has shown you a really nice application. You can run Termshark through a console and read tshark messages. tshark is great because I could put sniffers in different parts of my network and not have to use a application with a graphical user interface. I can also schedule it, so I could use cron just to schedule tshark to capture traffic if I wanted to. There are a lot of options with tshark, and Termshark is great because is allows you to view the tshark captures directly through a console. Okay, so I hope you've learned something. I hope you've enjoyed this video. If you have, please like this video, and please subscribe to my YouTube channel. That really does help me. (upbeat techno music)",
    "transcript_keywords": [
        "graphical user interface",
        "OSPF",
        "Termshark",
        "user interface",
        "graphical user",
        "tshark",
        "Enter",
        "interface",
        "Wireshark",
        "Ubuntu",
        "graphical",
        "user",
        "Wireshark captures",
        "EIGRP",
        "file",
        "console",
        "address",
        "Notice",
        "capture",
        "DHCP"
    ],
    "transcript_entity_values": [
        "first",
        "only $10",
        "Linux",
        "STP",
        "UI",
        "Mac",
        "EIGRP",
        "router",
        "Cisco",
        "GNS3",
        "two",
        "four",
        "Wireshark",
        "Wireshark",
        "Udemy, GNS3 Academy",
        "224.0.0.5",
        "zero",
        "PCAP",
        "NAT",
        "Tab",
        "second",
        "YouTube",
        "Git",
        "89",
        "IP",
        "Notice MAC",
        "Down Arrows",
        "224.0.0.10",
        "one",
        "OSPF",
        "Down Arrow",
        "GNS3",
        "MAC",
        "GitHub",
        "GUI",
        "Termshark",
        "Wireshark",
        "Windows",
        "DHCP",
        "CLI",
        "Forward Slash",
        "Control + C",
        "a Raspberry Pi",
        "CDP",
        "DTP"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.04795088246464729,
        0.017346885055303574,
        -0.11143949627876282,
        -0.09552568197250366,
        0.0639854297041893,
        -0.024628594517707825,
        0.059936486184597015,
        0.014648533426225185,
        -0.03631977364420891,
        0.08135845512151718,
        0.00472221989184618,
        -0.08550599962472916,
        -0.0004974356852471828,
        0.007828749716281891,
        -0.03379920870065689,
        -0.054853655397892,
        -0.02475125715136528,
        0.01238545123487711,
        0.08721208572387695,
        -0.0672757625579834,
        0.05303679034113884,
        0.0004468100378289819,
        0.036050084978342056,
        -0.08423322439193726,
        0.02019411139190197,
        -0.008398710750043392,
        -0.012570536695420742,
        0.01876496896147728,
        0.0018639253685250878,
        0.007703467272222042,
        -0.037658121436834335,
        0.01599254459142685,
        -0.014638406224548817,
        0.06003929302096367,
        -0.005637777503579855,
        -0.032832834869623184,
        -0.010461591184139252,
        0.07278493046760559,
        -0.03044905513525009,
        -0.05600685998797417,
        -0.007133136969059706,
        0.03406082093715668,
        -0.04988811910152435,
        -0.019735602661967278,
        -0.07203538715839386,
        -0.04944103583693504,
        -0.06721517443656921,
        0.002910951152443886,
        0.05469173938035965,
        0.03469796106219292,
        -0.053152211010456085,
        -0.0270843505859375,
        -0.005278317257761955,
        0.04750831797719002,
        0.05902722105383873,
        -0.030545532703399658,
        -0.10217307507991791,
        -0.01701001264154911,
        -0.03597000613808632,
        -0.01007357519119978,
        -0.0990888848900795,
        0.001847688457928598,
        -0.06997253745794296,
        0.03929752856492996,
        -0.0036471309140324593,
        0.12503503262996674,
        -0.009052135981619358,
        0.13809801638126373,
        0.06701187789440155,
        -0.09098191559314728,
        -0.16388973593711853,
        0.0024391235783696175,
        -0.043515611439943314,
        -0.07045914232730865,
        -0.07283610105514526,
        -0.024217452853918076,
        0.0050350031815469265,
        0.03950256109237671,
        -0.08970259130001068,
        -0.08798564225435257,
        0.020951014012098312,
        0.07368989288806915,
        -0.008876536041498184,
        0.09390662610530853,
        -0.018327072262763977,
        0.08934402465820312,
        -0.051801957190036774,
        -0.002860703971236944,
        0.05083586275577545,
        -0.003991501405835152,
        0.020167091861367226,
        -0.030834121629595757,
        -0.010384556837379932,
        -0.02774996869266033,
        0.0016871251864358783,
        -0.0175529383122921,
        0.044161006808280945,
        0.013036525808274746,
        -0.01993779093027115,
        0.07567273825407028,
        -0.03145219385623932,
        -0.04706137254834175,
        -0.01586805284023285,
        -0.11532561480998993,
        -0.05810530483722687,
        0.022715862840414047,
        0.004668766632676125,
        -0.06852632015943527,
        0.11254061013460159,
        0.06432744860649109,
        -0.08320628851652145,
        0.04670967161655426,
        -0.02987002395093441,
        -0.07512469589710236,
        0.06848496198654175,
        0.0632084459066391,
        -0.02671058475971222,
        -0.005710258148610592,
        0.02494053915143013,
        -0.025019308552145958,
        0.03762274235486984,
        0.04069703444838524,
        -0.03564704954624176,
        0.04027695953845978,
        0.09162779897451401,
        -0.01441888976842165,
        0.12393660098314285,
        6.1347294274728644e-33,
        0.03994700312614441,
        0.058341581374406815,
        -0.006247540935873985,
        0.04851686954498291,
        0.024200046434998512,
        -0.007295135408639908,
        0.11548794060945511,
        0.02936483919620514,
        -0.07146216183900833,
        0.07721590250730515,
        -0.07110657542943954,
        0.05706767365336418,
        -0.048575546592473984,
        -0.0701308399438858,
        0.02645738236606121,
        -0.040345449000597,
        -0.049952007830142975,
        0.019732140004634857,
        -0.0013262293068692088,
        0.07986746728420258,
        -0.02001567929983139,
        -0.018777402117848396,
        0.065125472843647,
        -0.012065690942108631,
        0.012426248751580715,
        0.034442853182554245,
        0.014645835384726524,
        -0.004666630644351244,
        0.09641464054584503,
        0.02469661459326744,
        -0.026676800101995468,
        0.01015092246234417,
        -0.026960285380482674,
        0.019346129149198532,
        0.041742656379938126,
        -0.026586392894387245,
        -0.06399860233068466,
        -0.03126644715666771,
        0.023596379905939102,
        -0.01170487329363823,
        -0.09161946177482605,
        -0.04873841255903244,
        -0.03608265891671181,
        -0.06801044940948486,
        -0.05219161510467529,
        -0.09725377708673477,
        -0.014182975515723228,
        -0.029981296509504318,
        0.03610986843705177,
        0.07257220894098282,
        -0.000778426299802959,
        -0.020616766065359116,
        -0.041503213346004486,
        -0.023674864321947098,
        -0.003675855929031968,
        0.009054752998054028,
        0.0243784599006176,
        -0.008820693008601665,
        0.03134822100400925,
        0.035072244703769684,
        -0.011073882691562176,
        0.06968260556459427,
        0.005452531389892101,
        -0.010039432905614376,
        -0.016263922676444054,
        -0.025997132062911987,
        -0.057100553065538406,
        0.02319815754890442,
        -0.016470329836010933,
        0.02562902867794037,
        -0.09259901195764542,
        0.02465011365711689,
        0.003598726587370038,
        0.016389263793826103,
        0.08461012691259384,
        0.09447958320379257,
        -0.005141837522387505,
        0.03955201432108879,
        -0.0293499194085598,
        -0.0016593430191278458,
        -0.029516955837607384,
        -0.022217534482479095,
        0.04664592444896698,
        -0.021420041099190712,
        0.008100844919681549,
        -0.02975314110517502,
        0.04000261798501015,
        -0.07248429954051971,
        0.01921502687036991,
        -0.010587646625936031,
        -0.05124394968152046,
        -0.005800093989819288,
        -0.06437306851148605,
        -0.005226431414484978,
        0.008533854968845844,
        -8.759389377036192e-33,
        0.10279827564954758,
        -0.020320167765021324,
        -0.0201732087880373,
        -0.02376079559326172,
        -0.03915097564458847,
        0.001787263434380293,
        -0.022778863087296486,
        0.04494909197092056,
        -0.022335387766361237,
        0.012002105824649334,
        0.009038226678967476,
        0.05029162019491196,
        -0.06174072250723839,
        0.003698066808283329,
        0.15222324430942535,
        0.009349226951599121,
        0.021236781030893326,
        0.04975175857543945,
        -0.0636240690946579,
        -0.03507356718182564,
        -0.028939563781023026,
        0.029692014679312706,
        -0.023380890488624573,
        -0.03100799210369587,
        0.0016990175936371088,
        -0.005800720304250717,
        0.0853932723402977,
        0.08246777206659317,
        0.0607990026473999,
        0.002201032591983676,
        0.0023746625520288944,
        0.029070265591144562,
        -0.057509444653987885,
        0.010803650133311749,
        0.05931845307350159,
        0.015021226368844509,
        0.13034895062446594,
        0.06854438781738281,
        -0.017657961696386337,
        0.024716852232813835,
        0.08051500469446182,
        0.019429154694080353,
        -0.05356086790561676,
        -0.036863528192043304,
        0.03385002166032791,
        -0.09879422932863235,
        -0.08487914502620697,
        0.038571521639823914,
        -0.05115562304854393,
        0.007134410552680492,
        0.09403581917285919,
        -0.06863443553447723,
        -0.0011043697595596313,
        -0.037811074405908585,
        -0.020715659484267235,
        0.0881546139717102,
        0.11806943267583847,
        -0.008287387900054455,
        -0.012377933599054813,
        -0.0712815597653389,
        -0.019065428525209427,
        -0.10473747551441193,
        -0.09915131330490112,
        -0.09005718678236008,
        0.0017120297998189926,
        -0.011805138550698757,
        0.007749090902507305,
        -0.004106434993445873,
        0.007548657711595297,
        0.006333245895802975,
        -0.017884302884340286,
        -0.0872981995344162,
        0.022471515461802483,
        -0.041687291115522385,
        0.06281600147485733,
        -0.007101956754922867,
        -0.011487884446978569,
        0.014989725314080715,
        -0.035061899572610855,
        -0.008557967841625214,
        0.057102423161268234,
        0.053004439920186996,
        0.07390341907739639,
        -0.016983719542622566,
        0.05913105234503746,
        0.05645532160997391,
        -0.0015341787366196513,
        0.09254711121320724,
        0.019351763650774956,
        -0.08870674669742584,
        -0.04096921533346176,
        0.0050127157010138035,
        0.014886060729622841,
        0.08891116082668304,
        0.11101307719945908,
        -4.7587551676997464e-08,
        -0.07780090719461441,
        -0.014335992746055126,
        -0.09361094236373901,
        0.012684917077422142,
        -0.005845789797604084,
        0.05072767287492752,
        -0.024763500317931175,
        -0.0685029849410057,
        -0.06516403704881668,
        -0.05337125062942505,
        0.08594316989183426,
        -0.008194953203201294,
        -0.052004583179950714,
        0.010572465136647224,
        -0.034318942576646805,
        0.08339640498161316,
        -0.04696308448910713,
        -0.026419252157211304,
        -0.03204430639743805,
        0.0109635628759861,
        0.027116846293210983,
        -0.03657453879714012,
        -0.035581015050411224,
        0.006662807893007994,
        -0.05858583003282547,
        -0.05263124778866768,
        0.014477004297077656,
        0.08471022546291351,
        -0.02732083760201931,
        -0.07310423254966736,
        -0.0077004702761769295,
        0.024459438398480415,
        -0.036402199417352676,
        -0.04050428792834282,
        0.01268788892775774,
        0.031343523412942886,
        -0.10024071484804153,
        -0.020642301067709923,
        0.05661066621541977,
        0.01674644835293293,
        -0.09316212683916092,
        0.012697733007371426,
        -0.006655829027295113,
        0.0053243511356413364,
        -0.03084752894937992,
        -0.00685583520680666,
        0.00797225721180439,
        0.004985936917364597,
        0.03789948299527168,
        -0.04620887339115143,
        -0.03124731220304966,
        0.01660161279141903,
        -0.021996671333909035,
        0.04645046591758728,
        -0.01703071780502796,
        0.021680016070604324,
        -0.017287060618400574,
        -0.08095455169677734,
        -0.038530465215444565,
        -0.03827055171132088,
        0.05418136715888977,
        -0.022625012323260307,
        -0.011817394755780697,
        0.0834527239203453
    ]
}