{
    "id": "hp1uI4D7NRQ",
    "title": "How Strong is my NEW Electric Hummer Motor? - EV Conversion!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-08-11T13:45:05Z",
    "video_url": "https://www.youtube.com/watch?v=hp1uI4D7NRQ",
    "category": "Howto & Style",
    "tags": [
        "Electric hummer",
        "UQM 220+",
        "UQM",
        "Danfoss",
        "Electric vehicle conversion",
        "Electric truck",
        "hummer ev",
        "electric hummer",
        "ev humvee",
        "HMMWV",
        "rivian",
        "hummer",
        "gm",
        "tesla",
        "ford lightning",
        "cybertruck",
        "Jerryrig",
        "ev conversion",
        "electric motor",
        "electric vehicle",
        "EV"
    ],
    "views": 1794980,
    "likes": 95047,
    "comments_count": 5100,
    "description": "Its time to build my own electric truck. How much stronger will my electric motor be? By upgrading my Hummer to an all-electric drive train, we make everything WAY more efficient. No gear shifting, no emissions, just pure electric energy. From 0 mph all the way to 80 mph. This Humvee will morph from a gas guzzler to a green machine ;-)   Watch all of my Hummer EV Conversion Videos HERE:   This video is not sponsored. Links for reference below.   My Atlas Transfer Case:  My Torque Trends Torquebox:  And the UQM 220+:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.advanceadapters.com/products/atlas-transfer-case-builder-pro-series/",
        "https://www.torquetrends.com/ev-torquebox",
        "https://evolveelectrics.com/products/uqm-danfoss-pphd-220-motor-controller",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The reason H1 Hummers and military humvees have such a wide stance is so that they can fit in the tracks left by military tanks. Behind me I have a 1995 military humvee that I'm turning into an electric vehicle. You've seen everything that I've already, you know, taken out of the vehicle in the previous video, but you haven't seen everything that I'm going to be putting into it. I'm pretty excited about this one. Let's get started. [Intro] So here are all of the components that I'll be putting into the humvee to make it electric. I'll explain a little bit more about these as we install them. Over here I have the batteries. These were taken out of a Tesla Model X, and we have 90 kilowatt hours worth of energy. I'll explain more about the batteries in another video. Right now let's start with the motor. This is the motor. It's a UQM220 Plus, which has an impressive 700nuton meters of torque and 300 horsepower. Those are some pretty big numbers to throw out, but the most impressive thing is the size. For instance, this is my hand covering up pretty much end to end on the motor. And let's take a look at the actual motor we took out of the humvee. This guy right here. My hand barely covers up the air intake. And the embarrassing thing is that little guy is more powerful than this by almost double. This is the same electric motor that is used to push around the massive jets on the airplane tarmacs The problem though is that this guy spins at 6,000 RPMs. So if I just throw this in the hummer as it is, the hummer's going to have a top speed of 125 miles an hour, and it just wasn't designed to go that fast. The only time a hummer should be going 125 miles an hour is when it's falling out of an airplane, which the military does quite often, intentionally. I'll tell you how I solved the speed problem, but first let me talk a little bit about how this works. This is an AC motor, but we know batteries are DC. The thing that takes the power from all of these DC batteries, about 400 volts, is this guy, an inverter. We can see the two inputs for the DC power here. It changes the power into AC and brings 3 wires out of this plug. Those three wires will go into the top of the motor here and give us the more efficient AC motor to move the vehicle. Edison and Westinghouse are finally getting along. Plus, the nice thing about AC is that we get the regenerative braking, which means that we can bring power and put it back into the batteries as we're slowing down. Which also takes a load off of the brakes, but we'll save that for another video. Back to our problem though. Old Whisper back here will vibrate itself into pieces if it ever goes 125 miles an hour. And the way to fix that and limit it to 80, what it was designed for and what the speedometer says it can do, is with something called an EV torque box, which is this deceivingly tiny object right here. This adds a gear ratio of 1.58, which means it can take the 120 miles an hour and bring it down to 80. It kind of acts like a transmission except for that it only has 1 speed. It's kind of heavy, but I just want to see it side by side with the other transmission from the original humvee. And there it is. My transmission next to the transmission from the hummer. This transmission has 4 gears inside, which is a little less efficient. And this can do 0-80 with just one. Now you might be like, 'Hey Jerry, why would you hold back or throttle your motor like that and keep it from its full potential?' And it might seem like that, but when I add this torque box to the motor to limit the speed, we are increasing the torque. This little guy can take the 700 newton meters of torque we get from the motor and turn it into 1100, or 815 pound feet of torque, which is a lot. Just for reference, my Toyota Tacoma has 265 pound feet of torque, which means that this electric beast will be over 3 times more powerful than my gas powered truck. And the power will be instant instead of waiting for the high RPMs. And this little guy isn't the only thing increasing the torque. The hummer does a lot of that on it's own. Let me show you. Some things that I'm leaving installed on the humvee are these the portal axles. And these are good for two things: one, it gets the axle up and out of the way so we have a lot more ground clearance. And two, there's a gear reduction in there which gives us more torque. Long story short, factoring in the portal hub and differential, two things I'm leaving inside of the humvee, we will have 4,275 pound feet of torque at the wheels while driving. And that's not even factoring in the low range. Once we drop into 4 low for trail riding, we will have over 12,000 pound feet of torque. To get that extra low gear and the 4 wheel drive, there's the last component. Since the original hardware of the humvee is nowhere near strong enough to handle this new setup, I had to get a new transfer case. This is called an Atlas transfer case from Advanced adapters. And this has the ability to put this in 4 wheel drive. So imagine this...so obviously we're getting the power from the batteries, we're driving the motor, the motor's turning the torque box, and the torque box is turning this shaft here. This shaft can spit directly out to the rear tires and just be rear wheel drive. But if we want to go into front wheel drive, we flip the level here and then this starts spinning the front tires, which go out this direction. It'll make more sense when we start installing stuff. But this guy can also give us front wheel drive only. And I'll have to show you why that's cool once we get this thing rolling. This will also allow us to flip into a 4 low for a super slow crawl. Because remember, each time we gear down the speed, we increase the torque to an insane number. This truck is going to shred itself apart before it comes to an obstacle that it can't overcome. So I'm pretty sure the real hummer EV is still on track to come out before the end of this year. Pretty sure I'll still beat them. The hummer EV has 11,200 pound feet of torque, and I don't know if that's in high or low gear but we can just pretend for a second that mine wins in the torque department. If anyone hears otherwise, let's just not talk about it. So how does all of this hardware from 1995 compare to my new setup? Well this can produce about half of the power with two major pitfalls, additional to the producing half the power part. The first one is that internal combustion engines have about 2,000 moving parts, many of which can break at any time, especially as the vehicle gets over. Electric vehicles, like the one we're building, have about 20 moving parts. Less to break, less to go wrong, and less to keep maintained over the years. The second thing is that not only is this half power, but it's also half power half of the time. Because in order to get it's full potential it needs to be revved up to high RPM range, which is why you see race cars gun their engines before taking off so they can be in that optimal area of power at the high RPMs. And not only that, there's a lot of gears to shift to stay in that optimal range. And each time you shift gears you lose efficiency. Electric vehicles don't have all those pitfalls or caveats because they have all of the power all of the time from the very first RPM. Combine that with their ability not needing to shift, and you get some pretty crazy 0-60 times. I think the 0-60 of this older machine was about 18 seconds, and 0-60 of my new machine that I'm building is about 6 or 7, but don't hold me to that because I don't math real good. Now I think you can see why I'm looking forward to getting this thing running on electrons. But I also think I'm talking a little too much at this point. Let's get these things mounted. Let's start with the inverter. Lucky for us the interior of the humvee is pretty spacious so we can kind of put things wherever we want, and the shelf along the front where the radiator used to sit is the perfect spot for the inverter. We still have to make room for a lot of other smaller components, but it would be good to have the big things set in place. I don't officially have the weight of these components yet, but I can move them around by hand so they're not too bad. A rough estimate is that I think we'll be putting about as much weight into the humvee as we took out in the previous video when factoring in batteries because those are super heavy. Right now I'm taking this mounting plate which connects the motor to the torque box. And the mounting plate will help me position the motor better inside. The 220 kilowatt motor also needs a home. Luckily it's considerably smaller than the last engine I took out. I'll be dropping it in next to the motor mounts while keeping the driveshaft about level with the rear differential. So when I get to the drive lines they won't be too far out of alignment. The straighter things are for the drivetrain mean that the less vibration and wobble we'll get down the road. -[Mom] I brought you a little baby loaf of bread. -Nice. -Looks harder just filming this than it is to make it. -Right? Thanks mom. My mom makes some really good bread. So, the trick with motor mounts is a few things. One, obviously it needs to support the motor in place and be strong enough and unflexing enough that it doesn't move out of place. And it also needs to be rubber isolated, meaning that there's no metal on metal contacts where it joins to the frame. There's rubber absorbing any vibrations, whether it's the motor making the vibrations or the vibrations coming from the road. We are inside that center hump of the humvee right now between the two frame rails. And this is the driveshaft heading up to the front two tires. And, of course, we have our motor right here. So I'm planning on using the motor mounts for this frame and this frame where the old motor used to sit, with a little rubber bushing here and over here to keep it from tilting left or right. And maybe one additional mount back here to keep it from tilting forward or backward. That way it's stabilized on three different points. Sitting here in the driver's seat, this thing is going to look sweet through this doghouse. Of course the torque trans torque box is going to be sitting right there on the splinds. It's going to look super high tech in here. All of the design work for these mounts is happening in a program called fusion, which is free. It's a very popular program for anyone who wants to create in a 3D space and turn those projects into a reality. Personally, I'm not very good at it, but I do know people who are. It's definitely the future though, so learning to create in a digital space is going to have pretty good drop security. But how do we take that computer design and then transition it into reality? The answer is with lasers. And you'll be seeing all of that next week. I'm super excited about this setup. It's a lot of power in a super small package. In the next video we should be able to get the whole drive train mounted and finished, and then we can get onto the more complicated stuff like the electrical wiring. Thanks a ton for coming along with me on this project. Leave any questions you have down in the comments. Hit that subscribe button if you haven't already. Turn on notifications. And come hang out with me on Instagram and Twitter. We have fun over there. Thanks a ton for watching. And I'll see you around.",
    "transcript_keywords": [
        "motor",
        "torque",
        "power",
        "torque box",
        "thing",
        "humvee",
        "things",
        "hummer",
        "pretty",
        "motor mounts",
        "guy",
        "batteries",
        "wheel drive",
        "military",
        "drive",
        "feet of torque",
        "time",
        "military tanks",
        "electric",
        "pound feet"
    ],
    "transcript_entity_values": [
        "0-60",
        "Edison",
        "the end of this year",
        "125 miles an hour",
        "220 kilowatt",
        "Atlas",
        "about 2,000",
        "the 120 miles an hour",
        "4,275 pound feet",
        "over 12,000 pound feet",
        "Instagram",
        "about 18 seconds",
        "two",
        "three",
        "Jerry",
        "about half",
        "700nuton meters",
        "one",
        "AC",
        "1",
        "DC",
        "Westinghouse",
        "half",
        "700",
        "4",
        "Toyota",
        "90 kilowatt hours",
        "next week",
        "0-80",
        "EV",
        "1100",
        "1.58",
        "80",
        "first",
        "second",
        "1995",
        "815 pound feet",
        "11,200 pound feet",
        "300 horsepower",
        "265 pound feet",
        "about 20",
        "3",
        "One",
        "about 6",
        "about 400 volts",
        "6,000",
        "Tacoma",
        "Twitter",
        "the years"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.05011751502752304,
        0.06556715071201324,
        -0.031486619263887405,
        -0.05717712640762329,
        0.02567475475370884,
        -0.009362954646348953,
        0.012011510320007801,
        0.025193743407726288,
        -0.05600934103131294,
        -0.010244526900351048,
        0.05992657691240311,
        -0.033112093806266785,
        0.018166568130254745,
        -0.04121466353535652,
        -0.017792513594031334,
        0.04366769641637802,
        0.11052926629781723,
        -0.06886342167854309,
        -0.06715104728937149,
        0.06272450089454651,
        0.001075908076018095,
        0.04311416670680046,
        0.0703505426645279,
        -0.05961070582270622,
        -0.0037740443367511034,
        0.027489669620990753,
        -0.0762890875339508,
        0.07264858484268188,
        -0.0882423147559166,
        -0.14258067309856415,
        -0.011806339025497437,
        -0.058845553547143936,
        -0.06912118196487427,
        -0.009280776605010033,
        0.020096082240343094,
        0.05289142578840256,
        0.020925186574459076,
        -0.031485505402088165,
        0.029706887900829315,
        -0.006629553623497486,
        -0.000592798984143883,
        -0.08725877106189728,
        0.059062410145998,
        -0.07720508426427841,
        -0.008938174694776535,
        0.01745057851076126,
        0.04073982313275337,
        -0.04446618631482124,
        0.07124818861484528,
        -0.017733542248606682,
        -0.1092526987195015,
        -0.08982545137405396,
        0.0796915739774704,
        -0.040478337556123734,
        -0.015565485693514347,
        0.03606726974248886,
        0.03035556711256504,
        -0.02077319100499153,
        -0.04572503641247749,
        -0.07713834196329117,
        -0.02435394562780857,
        0.03353323042392731,
        0.018337996676564217,
        0.021783463656902313,
        0.0037255079951137304,
        -0.10315990447998047,
        0.03238484635949135,
        -0.061880648136138916,
        -0.08373762667179108,
        0.009959892369806767,
        -0.01809394359588623,
        -0.0573800764977932,
        -0.111234150826931,
        -0.04433562979102135,
        0.017259877175092697,
        0.031917210668325424,
        0.01749526336789131,
        0.003961311653256416,
        0.022853421047329903,
        -0.035317085683345795,
        -0.006148659158498049,
        0.011420968919992447,
        -0.03661591187119484,
        -0.0788312628865242,
        0.0063665760681033134,
        0.0049474225379526615,
        0.03234125301241875,
        0.03284896910190582,
        -0.03332090377807617,
        0.009595461189746857,
        0.04804319143295288,
        -0.037971802055835724,
        -0.010774423368275166,
        0.045745670795440674,
        0.0708010122179985,
        0.07224356383085251,
        -0.09779796004295349,
        0.006343041080981493,
        -0.016354430466890335,
        -0.021890833973884583,
        0.04165684059262276,
        0.03457217663526535,
        -0.058068711310625076,
        -0.10372360050678253,
        -0.0602143220603466,
        0.053596287965774536,
        -0.006600688677281141,
        0.03702990338206291,
        0.006310442462563515,
        -0.020896097645163536,
        0.06151863560080528,
        0.02638889104127884,
        -0.10152238607406616,
        -0.02020113915205002,
        -0.008856352418661118,
        0.01755823940038681,
        -0.10109841823577881,
        0.06110772117972374,
        -0.025231000036001205,
        0.06008515879511833,
        0.04058871418237686,
        -0.025647634640336037,
        0.011944146826863289,
        0.09552866965532303,
        0.06207383796572685,
        -0.0004372360708657652,
        -0.07000682502985,
        3.2742362911178e-33,
        -0.05775674432516098,
        0.06337571889162064,
        0.04736363887786865,
        0.011760858818888664,
        -0.027484385296702385,
        0.03926704823970795,
        -0.0012213411973789334,
        0.09710212796926498,
        -0.013570909388363361,
        0.07482034713029861,
        0.0046517751179635525,
        0.05332253500819206,
        0.006988496985286474,
        0.03963720425963402,
        -0.03514992818236351,
        -0.09981652349233627,
        -0.03009788505733013,
        -0.07923582941293716,
        -0.037535276263952255,
        -0.04420924559235573,
        0.0420314222574234,
        -0.008507060818374157,
        0.01744975708425045,
        0.09702254086732864,
        0.06986880302429199,
        0.002405828330665827,
        0.09222287684679031,
        -0.001350405509583652,
        -0.011239324696362019,
        0.039779216051101685,
        -0.022346103563904762,
        -0.00489234970882535,
        -0.006734209135174751,
        -0.011460311710834503,
        -0.05332707613706589,
        -0.030162587761878967,
        -0.06353021413087845,
        -0.04549803212285042,
        -0.06270842999219894,
        0.018241064622998238,
        -0.008087452501058578,
        -0.022082632407546043,
        -0.08026285469532013,
        -0.07860849052667618,
        -0.045873697847127914,
        0.013277677819132805,
        0.034584857523441315,
        -0.02079123631119728,
        0.007772653363645077,
        0.02921169064939022,
        -0.006567438133060932,
        -0.08649586141109467,
        0.03103453479707241,
        0.025675350800156593,
        -0.02701510488986969,
        0.038463957607746124,
        0.015908587723970413,
        0.00762280635535717,
        -0.01670761965215206,
        0.026689186692237854,
        -0.0349707268178463,
        0.013385857455432415,
        0.043094225227832794,
        -0.04092363268136978,
        -0.03602282702922821,
        0.058935631066560745,
        0.0014159514103084803,
        -0.004745435435324907,
        -0.039697181433439255,
        0.0932970643043518,
        0.07141216844320297,
        -0.06606916338205338,
        0.01269677933305502,
        -0.0315842442214489,
        0.10154634714126587,
        0.03216032311320305,
        -0.04681335389614105,
        0.040782537311315536,
        0.053278274834156036,
        -0.03190407529473305,
        -0.12428849935531616,
        0.11926840990781784,
        -0.013478416949510574,
        -0.02936318889260292,
        0.00962790660560131,
        -0.04106329008936882,
        -0.022915124893188477,
        0.05877620726823807,
        0.08103267848491669,
        0.062010932713747025,
        0.05045529827475548,
        0.008050121366977692,
        -0.09526827931404114,
        -0.07300266623497009,
        -0.048611365258693695,
        -4.9025802897027736e-33,
        0.040355172008275986,
        0.10152610391378403,
        0.02387218177318573,
        0.05659552663564682,
        0.049881044775247574,
        -0.029369166120886803,
        0.13500794768333435,
        0.11641155928373337,
        0.028456101194024086,
        -0.030004749074578285,
        -0.018199391663074493,
        0.006739893462508917,
        -0.04176190122961998,
        -0.012933789752423763,
        0.06512004137039185,
        -0.011082299053668976,
        -0.07235051691532135,
        -0.05826161429286003,
        0.018150225281715393,
        0.06472248584032059,
        0.0345018208026886,
        0.11868807673454285,
        0.10469287633895874,
        0.06469392776489258,
        0.024499058723449707,
        0.001816850621253252,
        -0.07671821862459183,
        -0.017741965129971504,
        0.06560762226581573,
        -0.019314322620630264,
        -0.03723767027258873,
        -0.010153285227715969,
        -0.0009576090960763395,
        0.03216565027832985,
        -0.08700286597013474,
        0.03152713179588318,
        -0.006436435040086508,
        0.03979675471782684,
        0.009587184526026249,
        -0.04469432309269905,
        -0.04600570350885391,
        -0.04316449537873268,
        -0.013902535662055016,
        0.0014803905505686998,
        -0.0198159571737051,
        -0.06594625860452652,
        -0.04829311743378639,
        -0.04537834972143173,
        0.04254832863807678,
        0.11167159676551819,
        0.010846012271940708,
        0.016889192163944244,
        0.05812472105026245,
        0.03964695706963539,
        -0.013110039755702019,
        -0.05808321759104729,
        0.052949074655771255,
        -0.06904780119657516,
        -0.03415469080209732,
        0.02882012352347374,
        -0.012285120785236359,
        0.03761801868677139,
        0.004175289999693632,
        0.014589667320251465,
        0.0010672917123883963,
        -0.08213631063699722,
        0.0399835929274559,
        -0.033947981894016266,
        0.02710307389497757,
        0.0055457293055951595,
        0.03326084837317467,
        0.004410047084093094,
        0.05368470773100853,
        -0.061765898019075394,
        -0.06299188733100891,
        0.000456833018688485,
        0.05634704977273941,
        -0.018765559419989586,
        0.06810019165277481,
        -0.053650204092264175,
        -0.01660810224711895,
        0.008650456555187702,
        -0.008673314936459064,
        0.033520009368658066,
        0.032216742634773254,
        0.03127126395702362,
        -0.013084404170513153,
        0.021077396348118782,
        0.03932274505496025,
        0.03237709775567055,
        0.008790693245828152,
        -0.007851752452552319,
        0.01906447485089302,
        0.06636503338813782,
        -0.06604350358247757,
        -5.8972148053726414e-08,
        -0.029517821967601776,
        0.07938914000988007,
        0.027634620666503906,
        0.019870862364768982,
        0.10951701551675797,
        0.04198114573955536,
        -0.02198101207613945,
        0.06514330953359604,
        -0.005381632596254349,
        0.020879488438367844,
        0.12634910643100739,
        -0.04137717932462692,
        0.06656841188669205,
        0.04155738651752472,
        -0.05757506936788559,
        -0.030400242656469345,
        0.01216620858758688,
        0.035001907497644424,
        0.00017952737107407302,
        -0.05671767517924309,
        -0.050462592393159866,
        0.028132185339927673,
        -0.028912140056490898,
        0.02416926622390747,
        0.02473236620426178,
        0.04150540754199028,
        -0.07488924264907837,
        -0.019302545115351677,
        -0.04446318373084068,
        -0.04256782680749893,
        -0.06304372847080231,
        -0.017756324261426926,
        -0.0003250567242503166,
        0.03266938403248787,
        -0.0435224287211895,
        -0.061385951936244965,
        -0.14275002479553223,
        0.026406817138195038,
        0.06965037435293198,
        0.055603593587875366,
        -0.0020543832797557116,
        -0.051669780164957047,
        0.017722127959132195,
        -0.00928640179336071,
        -0.0631345734000206,
        -0.014019046910107136,
        -0.08137521892786026,
        -0.16344571113586426,
        -0.05970926582813263,
        0.0477423295378685,
        -0.024660684168338776,
        -0.018697606399655342,
        0.0005110339843668044,
        0.046084124594926834,
        0.03474900871515274,
        0.057277314364910126,
        -0.03345215693116188,
        -0.0069815777242183685,
        -0.0353698767721653,
        -0.005005843471735716,
        0.07720297574996948,
        -0.0919666737318039,
        -0.020272282883524895,
        0.023124298080801964
    ]
}