{
    "id": "hUBsxCcJeUc",
    "title": "iPad Pro Bend Test! - Be gentle with Apples new iPad...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-11-16T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=hUBsxCcJeUc",
    "category": "Howto & Style",
    "tags": [
        "iPad Pro",
        "Apple iPad Pro",
        "iPad pro durability test",
        "scratch test",
        "apple",
        "iphone",
        "new iphone",
        "new ipad",
        "iPad Pro bend test",
        "iPad scratch",
        "spiderman ipad",
        "2018 ipad",
        "iphone x",
        "iphone xs",
        "iphone xr",
        "iphone 10",
        "tablet",
        "apple tablet",
        "best tablet",
        "portable computer"
    ],
    "views": 21177259,
    "likes": 335903,
    "comments_count": 62543,
    "description": "Protect your iPad or phone with dbrand!:  Thanks to dbrand for sponsoring this iPad Pro Bend Test. Apple says their New iPad Pro is a magical piece of glass that does everything you need, any way you hold it. (As long as you are gentle of course.) Today we are going to find out how durable Apples new piece of glass really is. How good is the drawing on the iPad? We'll be testing that out with Art Class With Jerry. (Which side did Apple want us to draw on again? I forget...) And finally we will finish off with the New iPad Pro Bend test, this will tell us realistically how much force the iPad Pro can withstand while it is in your backpack or book bag, or while being accidentally sat on.   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:  Music is from HERE:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/hero",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://share.epidemicsound.com/pcGGf",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The all new iPad Pro. Plenty of new design changes, thinner bezels, and no home button or headphone jack. It's time to see if this massive tablet is durable. The iPad Pro is basically the same price as the iPhone XR, and appears to actually be one of the more reasonably priced Apple products. It even comes with a standard USB-C charging port. Apple's moving in the right direction. Let's get started. [Intro] This is the smaller of the two iPads the 11 inch version. Perfect size for a backpack or book bag. Apple has also released an updated version of the Apple pencil, which is good. Last year's design included plenty of stupid...poking out the bottom of the iPad while charging, like an elephant trunk just waiting to snap off. This year it's held onto the side of the iPad with magnets and charges wirelessly. Not quite as smooth as the integrated Note 9 s-pen which charges internally in seconds with a super capacitor. Apple doesn't include this pencil in the box...probably out of respect to Steve Jobs. [Steve] Who wants a stylus? You have to get them and put them away, and you lose them. Yuck. Nobody wants a stylus. [Zack] But let's be honest, they mostly just want you to pay extra for it. The tip of the pristine clean white pencil does not appear to be replaceable like they are on Samsung's s-pen. So if you want a finer tip, you'll just have to sharpen it manually. We all know it's what's inside the Apple pencil that matters most though. Dead center is the weakest point. Probably a tad stronger than your average wooden pencil This immediately gives us unrepairable access to the wireless charging component. These copper coils absorb energy wirelessly through the induction field on the side of the iPad. I'll skin the rest of the pencil. It has a pressure sensitive tip and a row of strong magnets along the flat side of the writing utensil. The upper half is a bit harder to get inside. The super white plastic coating is not meant to come off. Inside of the upper half of the stiff metal frame is where the battery resides. I tried opening up the metal to get a better look at the battery size and information, but after it squirted battery acid at me, I decided it was not a fun activity. Let's start with the scratch test. We know glass is glass at this point, but we still got to check and make sure Apple isn't pulling a fast one on anyone and using less durable materials than what we're used to. It is interesting to see how thin the glass is though. Each scratch of my picks leaves major temporary impressions on the pixels. We get the standard scratching at level 6, with deeper grooves at a level 7. So the screen is still made from glass and not plastic, but it's super thin. There is a front facing camera. It does the whole face ID thing now that the home button is gone. The volume buttons up in the right hand corner are made from metal, along with the whole right side of the iPad. Except for this little patch of plastic in the middle for the wireless charging. Induction can happen through metal, so Apple cut out the metal and added this little plastic layer that allows the power to flow through to the pencil Hopefully the plastic doesn't compromise any structural integrity later on. Down at the bottom we get our two large speaker grilles. We'll have to see if these are decoration or not during the teardown video. And we also have our USB-C port which can be used to charge other devices. Pretty cool. Hopefully Apple makes this port the standard across all their devices in the future. That would be an awesomely beneficial move for the customer. The left side of the iPad is blank except for one little microphone hole right smack dab in the center. You know how easy it is to rip your jeans after a hole has already been started? The same thing applies to metal. That hole is a weak point and I can see this probably being a problem in the future. There are 2 more microphone holes up at the top of the iPad in between the two ginormous speaker grilles. There's also the power button all metal. The back of the iPad Pro is also metal. Apple focused quite a bit on how well people can draw on the iPad Pro, but they never really specified on which side of the iPad the drawings need to occur. This is the biggest Art Class with Jerry canvas I've ever had. And the anodized aluminum makes a perfect surface. As an artist, I definitely have to agree with that on this one. The iPad is really good for drawing. Yeah, the front has liquid retina with a 120 Hertz touch sensitivity. But the back has a 120 hurts-your-ears sensitivity. And you can't beat that. If you guessed I was drawing Spider Man, I'm impressed with your creative thinking, or maybe the iPad Pro just makes me look better at drawing than I actually am. Hopefully Stan Lee approves. The Apple logo does kind of distract from the overall appearance though, so it's good to know if you ever want to get rid of the Apple logo, or hide any accidental scratches, dbrand has you covered quite literally. This textured Black Matrix feels more professional than just the bare aluminum. But the best news is that with dbrand, the Apple pencil now looks like an actual pencil, and still connects and charges wirelessly. It doesn't get any better than that. I'll leave a link down in the video description if you want to customize your own phone or iPad, and thanks to dbrand for sponsoring this video. We already know the result of our next test. Apple is once again touting sapphire camera lens covers on their iPad Pro. And as we know, sapphire should scratch at a level 8, making it a very premium, durable, scratch resistant product, more so than glass. Glass scratches at a level 6. But Apple's sapphire is not the same quality we've seen in other places, like HTC's or Tissots. Apple's sapphire scratches like glass at a level 6. Super annoying when Apple is bragging about premium materials that don't actually perform like they should. It makes real sapphire look bad. You would think Apple would be able to afford real sapphire, but maybe next time. The massive 11 inch display is using Apple's liquid retina technology, which is just an LCD, and lasted 10 seconds under the heat from my lighter before turning off. I'm still impressed that I can buy this whole iPad Pro for basically the same price as a XR...which is probably just another example of that phone being incredibly over priced. Like always with my durability test, it's time for the bend test. I doubt this tablet will ever end up in a back pocket, but it will be in backpacks and book bags. Or laying around unnoticed on a couch cushion, chair or bed, before someone sits down. Structural integrity is still important, and the iPad Pro just doesn't have any of that structural integrity stuff. A tablet the size of a piece of paper, folds like a piece of paper. I do feel bad for Spider Man though. I'll try to straighten him out. Perfect. It looks like the 2 weakest points are right dead center on either side of the iPad Pro. The cracked frame happened right at the poorly placed microphone hole. And again over here on the poorly supported wireless charging dock for the pencil. The thin glass screen isn't helping out structurally. And neither are the loose uncompartmentalized pouch style lithium ion batteries. The iPad Pro is a thin, ridge-less aluminum sack with no structure holding things together. Like tin foil wrapped around mashed potatoes. There are 4 massive speakers inside, which is pretty impressive. At least now I don't have to make a teardown video. Apple focused on making the thinnest iPad they could without putting much thought into structure or weak points in the frame. So make sure if it's ever in a backpack, you don't lean up against a chair or a wall and make sure grandma doesn't accidentally sit on it because it won't survive. Poor Spider Man. Customize your own phone or protect your tablet with the dbrand link in the description. Hit that subscribe button if you haven't already. And let me know what else you want to see constructively durability tested in the comments. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "iPad Pro",
        "Apple",
        "iPad",
        "Pro",
        "Apple pencil",
        "pencil",
        "metal",
        "Apple sapphire",
        "glass",
        "side",
        "Spider Man",
        "Apple logo",
        "Apple focused",
        "sapphire",
        "Apple makes",
        "charging",
        "level",
        "plastic",
        "make",
        "makes"
    ],
    "transcript_entity_values": [
        "HTC",
        "The iPad Pro",
        "iPhone",
        "Stan Lee",
        "9",
        "6",
        "the iPad Pro",
        "two",
        "120",
        "Spider Man",
        "jack",
        "Glass",
        "Jerry",
        "6",
        "8",
        "half",
        "4",
        "This year",
        "Tissots",
        "ridge",
        "Last year's",
        "iPad",
        "XR",
        "Hertz",
        "Apple",
        "10 seconds",
        "iPads",
        "seconds",
        "XR",
        "Hopefully Apple",
        "Steve",
        "Black Matrix",
        "Steve Jobs",
        "Samsung",
        "LCD",
        "Zack",
        "Yuck",
        "iPad Pro",
        "11 inch",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.06629534810781479,
        0.031375180929899216,
        0.008348111994564533,
        -0.02894614264369011,
        0.04553085193037987,
        -0.06480039656162262,
        0.06469272822141647,
        0.07608138769865036,
        -0.012812045402824879,
        0.037409424781799316,
        0.031178580597043037,
        0.02067525126039982,
        -0.07113227993249893,
        0.0755738690495491,
        0.009255819953978062,
        -0.014671817421913147,
        0.010033223778009415,
        0.0015019847778603435,
        -0.06173206493258476,
        0.1138329729437828,
        0.06367603689432144,
        -0.03276000916957855,
        0.07620855420827866,
        -0.055706046521663666,
        -0.01623157039284706,
        0.0549786239862442,
        0.03231637924909592,
        -0.0059667290188372135,
        -0.022695695981383324,
        -0.04273296147584915,
        -0.03758024424314499,
        -0.04174235463142395,
        -0.10675208270549774,
        0.06361372768878937,
        -0.043919000774621964,
        -0.04706093668937683,
        0.028680594637989998,
        0.018285172060132027,
        -0.07089594006538391,
        -0.09233391284942627,
        -0.07688648998737335,
        0.0018833075882866979,
        -0.01948302984237671,
        0.06533297896385193,
        0.07795317471027374,
        0.029386727139353752,
        0.05848189443349838,
        0.02085890620946884,
        0.03353129327297211,
        0.018343765288591385,
        -0.0006895856931805611,
        -0.027470337226986885,
        -0.005643235053867102,
        -0.033646076917648315,
        -0.006653548683971167,
        0.0002727492246776819,
        0.05416512489318848,
        -0.04029189795255661,
        0.04828684777021408,
        0.0939020961523056,
        0.10073742270469666,
        -0.04129448160529137,
        0.023484807461500168,
        0.07233937084674835,
        -0.02558021992444992,
        -0.016066383570432663,
        0.008558421395719051,
        -0.01836768351495266,
        0.00030892237555235624,
        0.001605224795639515,
        -0.05536802485585213,
        0.013803121633827686,
        0.0015370395267382264,
        -0.019703079015016556,
        0.06897721439599991,
        -0.017731882631778717,
        -0.02389686368405819,
        -0.033840566873550415,
        -0.06628773361444473,
        0.018493302166461945,
        -0.011274910531938076,
        0.029286274686455727,
        0.019983341917395592,
        0.0678362101316452,
        -0.02427728846669197,
        0.0071447608061134815,
        0.00715309102088213,
        0.06674550473690033,
        -0.058250658214092255,
        0.011768566444516182,
        0.031011898070573807,
        0.08711426705121994,
        -0.07594563066959381,
        0.05859501287341118,
        -0.013044269755482674,
        -0.04078857973217964,
        -0.057701222598552704,
        -0.10500945150852203,
        -0.13437916338443756,
        0.019569212570786476,
        0.009157108142971992,
        0.035807352513074875,
        0.07467946410179138,
        0.005910811480134726,
        0.0203880462795496,
        -0.05373692139983177,
        -0.012783574871718884,
        -0.10052002221345901,
        0.019268715754151344,
        0.0862133726477623,
        0.04861581325531006,
        -0.0014173449017107487,
        -0.018570175394415855,
        0.046762481331825256,
        0.0025612872559577227,
        -0.05987965315580368,
        -0.04315071552991867,
        0.12087705731391907,
        0.04884893819689751,
        0.02183384634554386,
        -0.02941051498055458,
        0.08625467121601105,
        0.02495856210589409,
        -0.05169649049639702,
        -0.022070705890655518,
        0.022671516984701157,
        -0.03940797224640846,
        3.1068289978294135e-33,
        -0.005087718833237886,
        0.10876201838254929,
        0.0017678032163530588,
        0.0296691432595253,
        0.0019018511520698667,
        -0.1367146521806717,
        0.0034989635460078716,
        0.11371736973524094,
        -0.0038313891272991896,
        0.03269105777144432,
        0.015048541128635406,
        -0.0533130019903183,
        -0.05965546891093254,
        0.005590006243437529,
        0.06366133689880371,
        -0.03126002848148346,
        -0.02992204762995243,
        -0.02450866997241974,
        -0.05944926664233208,
        0.039996203035116196,
        -0.06904811412096024,
        -0.13810035586357117,
        0.005648734979331493,
        0.0053665791638195515,
        0.003906824626028538,
        0.026571568101644516,
        0.0342135913670063,
        0.030042119324207306,
        0.020627105608582497,
        0.02302624098956585,
        -0.1345917284488678,
        -0.010695348493754864,
        -0.05076437070965767,
        -0.01816883496940136,
        -0.040986318141222,
        -0.004294407553970814,
        0.017122099176049232,
        -0.06539416313171387,
        0.02441542223095894,
        0.03361746296286583,
        -0.15945588052272797,
        0.010568469762802124,
        0.09829086810350418,
        0.007303495891392231,
        0.051937781274318695,
        0.016274098306894302,
        -0.015417727641761303,
        0.07269921153783798,
        -0.06770868599414825,
        -0.061384908854961395,
        -0.057846907526254654,
        -0.06281783431768417,
        0.01605815999209881,
        -0.03459492698311806,
        -0.08694904297590256,
        -0.014514484442770481,
        0.0202475618571043,
        -0.03848247602581978,
        0.03580397740006447,
        0.06356968730688095,
        -0.005735671613365412,
        0.042367592453956604,
        -0.03585280850529671,
        0.0455157570540905,
        -0.12171383947134018,
        0.0415075346827507,
        -0.08117817342281342,
        0.007448236923664808,
        -0.07089134305715561,
        -0.02763231098651886,
        -0.05070693418383598,
        0.030825648456811905,
        -0.014920307323336601,
        -0.037897687405347824,
        -0.07656735181808472,
        0.0014975040685385466,
        0.04942238703370094,
        -0.0021295722108334303,
        0.0226853396743536,
        -0.029433349147439003,
        -0.0504935160279274,
        0.014418630860745907,
        0.061176151037216187,
        -0.04644453898072243,
        -0.10698004066944122,
        -0.00926546473056078,
        0.0070465076714754105,
        -0.11878565698862076,
        -0.00821733195334673,
        -0.03058003820478916,
        -0.022290080785751343,
        -0.02722794935107231,
        -0.005572034046053886,
        -0.07917715609073639,
        -0.03175093233585358,
        -3.872837320148865e-33,
        0.03323782607913017,
        -0.019199049100279808,
        0.009225418791174889,
        0.026716699823737144,
        0.07581353932619095,
        -0.07480795681476593,
        0.05122115835547447,
        0.04798406735062599,
        -0.007689076010137796,
        -0.08750994503498077,
        -0.001354722655378282,
        0.008434390649199486,
        -0.02454589679837227,
        -0.010879996232688427,
        0.05388401448726654,
        0.006650286726653576,
        -0.07261710613965988,
        -0.05181214585900307,
        -0.03144896775484085,
        0.04035106673836708,
        0.0681053027510643,
        0.06250925362110138,
        0.059364959597587585,
        0.012792179360985756,
        0.015735212713479996,
        -0.01166235376149416,
        0.022855259478092194,
        -0.06627687811851501,
        0.009668011218309402,
        0.009169906377792358,
        0.0687040314078331,
        -0.11063984036445618,
        -0.0033459332771599293,
        0.06210852414369583,
        0.02004414051771164,
        0.02912897802889347,
        0.06724044680595398,
        -0.04976099729537964,
        -0.0035113063640892506,
        -0.08268073946237564,
        0.07594060152769089,
        0.09995578229427338,
        -0.032116614282131195,
        -0.03352329134941101,
        -0.022358747199177742,
        0.036627162247896194,
        0.018953103572130203,
        0.06985775381326675,
        3.1459912861464545e-05,
        -0.024093426764011383,
        -0.008256301283836365,
        0.03506842255592346,
        -0.04462871700525284,
        -0.007013838738203049,
        -0.01357810664921999,
        0.011390747502446175,
        0.06483039259910583,
        -0.07138342410326004,
        -0.057284604758024216,
        -0.004492525476962328,
        -0.04860459640622139,
        0.05520087853074074,
        -0.018552735447883606,
        -0.02489139512181282,
        -0.01596333459019661,
        -0.029475141316652298,
        0.013641183264553547,
        0.055688660591840744,
        0.011166715994477272,
        0.043607790023088455,
        0.02388761006295681,
        0.016225315630435944,
        0.05978688225150108,
        -0.03426613286137581,
        0.07713279128074646,
        0.07258688658475876,
        0.11729878187179565,
        -0.01286318153142929,
        -0.03333475440740585,
        -0.010011270642280579,
        0.013997193425893784,
        0.038593340665102005,
        -0.013866884633898735,
        0.0353756882250309,
        0.06866519153118134,
        -0.012079507112503052,
        0.023935260251164436,
        -0.01206939946860075,
        -0.07842942327260971,
        0.10544408857822418,
        -0.03793693706393242,
        0.036622948944568634,
        -0.031117858365178108,
        0.058090656995773315,
        0.009532948955893517,
        -4.595225533421399e-08,
        -0.05416570603847504,
        0.05298393592238426,
        0.037701576948165894,
        -0.045782558619976044,
        0.009321672841906548,
        0.012411839328706264,
        0.06366284191608429,
        -0.04332221299409866,
        0.002215077169239521,
        -0.09300277382135391,
        -0.049318134784698486,
        -0.029529239982366562,
        -0.03971727192401886,
        0.089315265417099,
        -0.06719280779361725,
        0.08831509202718735,
        -0.01620115526020527,
        0.0901632085442543,
        -0.024804502725601196,
        -0.04330447316169739,
        -0.023813903331756592,
        -0.05861012265086174,
        0.026234162971377373,
        0.020310230553150177,
        -0.030984988436102867,
        0.05502064898610115,
        -0.11901039630174637,
        -0.021780123934149742,
        0.036807842552661896,
        0.07290275394916534,
        -0.041378267109394073,
        -0.046776168048381805,
        -0.010335564613342285,
        0.055323276668787,
        0.034070249646902084,
        -0.0202648863196373,
        -0.0704529657959938,
        0.021008005365729332,
        -0.0022015105932950974,
        0.10525354743003845,
        -0.009016206488013268,
        -0.10065514594316483,
        0.01877634972333908,
        0.04098071902990341,
        0.026852143928408623,
        -0.060570765286684036,
        0.015072156675159931,
        -0.03695748373866081,
        -0.050168659538030624,
        0.0879649743437767,
        0.024068515747785568,
        -0.04924943670630455,
        0.029779022559523582,
        0.08275522291660309,
        0.0204605795443058,
        0.054158665239810944,
        0.033469852060079575,
        -0.04042796790599823,
        -0.054739803075790405,
        0.026598328724503517,
        0.02328481525182724,
        -0.0432644784450531,
        -0.0036121986340731382,
        0.07713039219379425
    ]
}