{
    "id": "hWl9Wux7iVY",
    "title": "The VHS cassette was more clever than Beta",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-11-08T16:56:04Z",
    "video_url": "https://www.youtube.com/watch?v=hWl9Wux7iVY",
    "category": "Science & Technology",
    "tags": [
        "beta",
        "betamax",
        "betacam",
        "videotape format war",
        "technology connections",
        "vhs",
        "home video",
        "videotape",
        "sony beta"
    ],
    "views": 1125627,
    "likes": 44794,
    "comments_count": 4441,
    "description": "You can support this channel on Patreon! Link below   Oh nooo! Betah! In this video, we discuss the endlessly discussed rivalry betwixt the Victorious VHS and the Bent-outa-shape Beta, but from an entirely new angle!  Speaking of angles, heres a link to the videos on the Format War:   In that playlist is also a video on Betamovie, but if youre lookin fer just that thar video heres a differn link!   And still! More links! Technology Connections on Twitter:  The TC Subreddit  Technology Connections 2 (the channel where I sometimes talk about stuff and generally dont prepare for anything):   You can support this channel on Patreon! Thanks to contributions from viewers like you, Technology Connections can continue being as weird and unpredictable as it is. If youd like to join the cool people who bring these totally rad videos to you (Im hip and with it!), you can find out how at the link below. Thank you for your consideration!  And thank you to the following patrons! William Astle, Zufalligeule, John Plasket, Don Eitner, Adam Belebczuk, Nick Huwe, Matt, Karol Koziol, Matthew Hirst, Matt Lawrence, Matthew Krajnak, James Fuhrman, Erik Welander, Mark Majewicz, Logan Shelts, Ryan Dean, Arcanox, Matt Beard, Yaniv, Francis Fisher, The War Academy, Conor Killeen, Jay, Dave Anderson, Noah McCann, Eric Hansen, Dane Peterson, Jeremy Kitchen, Steven First, Audin Malmin, Adam D. Ruppe, Rafa Wiosna, Matthew Giraitis, Kevin Landrigan, Carl Yazbek, Logan Kriete, Hunter Schwisow, Matt Falcon, Kieran Cox, Eric Wood, Paul Williams, Brent LaRowe, Lurker239, Felix Freiberger, James Ryan, Lukas Komischke, h.drew foy, Jason Nevins, Jeffrey, BlancoGrande, Stephen Pick, Technicalleigh, John McLusky, Adam Coddington, Lolucoca, Steven Metcalf, Justin Talbot, Christopher Jett, SovietBear, Mike Mason, Techmoan, Kotanu, Christopher Luna, Paul Mills, Brian G. Shacklett, Chris Hartl, Andre N, Tony, Matthew Baron, Mark Critchley, Andres Plaza, Charlie Hankin, Craig Leverenz, Casey Kikendall, Sebi Jecklin, Warmo, The8TrackKid, Drew McClain, Michael Snowden, Ed Hall, Julian Rapoport, Christopher Bassett, Ryan Cozzubbo, Marcus Schwartz, Johan Schoeman, Matt Taylor, Patrick Musson, Lars JJ, Richard Lindsey, Kollin O'Dannel, Peek, blouerat, Robert Toth, Joseph Hill, Marc Ethier, Giacomo Scaparrotti, Thijs Dortmann, Brady Brown, Stein Strindhaug, foophoof, Ernie Smith, Christopher Dickey, Denver Alexander, Mitchel J. Mullin II, Matthew Razza, Trix Farrar, Marco Anastasi, Pavlo Pravdiukov, Howard Kraut, Mike Bailey, Michael Bernstein, Kevin Strehl, Yona, neko, Grayson Lang, Jeffery Grajkowski, Eric Merrill, Stefan Berndtsson, Michael Sims, Christopher Leidich, Mike Friedman, Andr Waage Srensen, Sam Redfern, Tully, fussel, Corey A Hudson, EpicLPer, Luc Ritchie, Eric Romero, Ryan Hardy, Taylor Martin, thefanification, Ewen McNeill, Henrik Ripa, Albin Flyckt, Shane Zamora, John Bailey, Alex Ilyin, Andrew \"FastLizard4\" Adams, Avi Drissman, Phil Taprogge, Sam Witney, Jonathan Skowronek, Tim Grov, Pieter van der Eems, Brian Condron, Reto Jost, Vince Terranova, Andrew Montagne, David Scott, Mike Nichols, Brandon Enright, James Fialho, Christian Torelli, The Paul Allen, toasterking, Jason Brady, ce keen, Jake Shep83, Nick Pollard, David Grossman, Manalope, Andy S, Robert, Johan Greefkes, Jacob Dixon, Rob Kefford, Benjamin A., Nathaniel, Michel Sievers, Colin Cogle, Aaron Rennow, Bee Jay, Countzero, Kodapan, Eli Krumholz, Guillaume Tremblay-Beaumont, Sha Nasti, Laria, Stephen B Hinton, thegeoffreak, scott b, Elliot Clark, Bob Slovick, Jason Burgett, Jib Systems, Andrew Rosenwinkel, Grazer, Bob B, Mike Noe, Scott Rowland, Joshua Doades, Steve Kralik, Your name, Kirill Polstainen, Felix Winkelnkemper, BoostCookie, 98abaile, Rennix, Charles, Sebastian Sparrer, Matt Mullett, Andreas Kuzma, Paul Moffat, Max, Alessandro Robert Nilsen, Ryan Benson, Neil Forker, Vincent Beelte, James Pinakis, Johnni Winther, Mark Hesse, Nathan Blubaugh, lululombard, Armando Fox, Nelson, Angelo van der Sijpt, William Evans, VilleS, Anton Afanasev, Kilrah, Ray, Liam O'Flynn, Gideon Ritter, Oliver Lee, Lennart Sorensen, Mitch Radoll, Will Wren, Viorel, Reaghan Kekeis, lohphat, Vivian Pypher, Brandon Whiting, Scott Herron, Marlo Delfin Gonzales, Zachary Hazlett, Peter Stewart, Patrick Barry, Robin Johnsen, Nomad, Eric, Phia Westfall, Jeremey Hastings, Mark Wayt, Matthew Reynolds, Arthur Robillard, Sonic the Anonymous Hedgehog, Lee Tustain, Ramon Gamez, Marcel de Jong, Vaughn B., Breunie Ploeg, Braden McDorman, Julien Oster, Jake Hickman, Trae Palmer, Gary Hampson, Lennart Rosam, Chris Wallace, Matt Shea, Jason Baker, Galimaufry",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLv0jwu7G_DFUrcyMYAkUPODENwP4gYCmf",
        "https://youtu.be/9uZ13I2zvfM",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Hello! And welcome to the first video of No-Effort November! A series of videos for the month of November where no effort is made. Today, we are doing another Beta and VHS comparison. But, unlike ye olde format war, were not focusing on things like recording time, picture quality, or silliness of their respective names. Instead, we are going to look at their actual videocassettes, and I think youll find that the VHS cassette is a fair bit cleverer than that of Beta. Ive made a lot of videos covering the format war which can you check out through the card that should be popping up right about now, though YouTube seems to have problems lately getting the card to -- oh, there it is. See, that joke might not have worked for some of you because it actually didnt appear! Anyway, theres also a link in the description for the inevitable case of the card not appearing. Now we just have to hope that I remembered to put it there. Moving on then, I have a pair of almost-randomly-selected videocassette recorders in front of me. One of them is, of course, a VHS machine. And the other, is a Beta machine. Now, the age difference between these two doesnt matter because what were after in this here video is a closer look at the way their tape transport mechanisms interact with the tape in the cassettes. Take a look at the bottom of a Beta cassette, and youll see two sprocket holes, and a gaping triangular hole carving a nice little canyon down towards the center. It annoys me very much that they didnt go all the way and instead made a trapezoid. Oh well. By the way, in North American English it is indeed pronounced bay-da. Not bee-tah.\" Feel free to comment on why were wrong. Youll find the write-protect tab down here, as well as a notch in the upper right which contains this little wedgey thing that unlocks the lid of the cassette. A pokey thing inside the VCR pushes the wedgey thing in, which unlocks the lid, and the action of the lid opening unlocks the spools of the tape and allows them to rotate. This locking device makes it rather difficult to open the lid with ones hands, which arguably makes it a better design for protecting the tape, but comes with the tragic downside of making the cassette a terrible fidgeting device. Look at the bottom of a VHS cassette and youll also find a pair of sprocket holes which I realize... sprocket holes is not the correct word. I believe I meant cogs for the tape reels. Anyway. And, youll also see a larger and wider variety of other holes, including this one that you may have never even noticed before. Such subtlety. Notice how these two both have curves. This one accommodates the absolutely chunky tape reels that JVC crammed in here because they, rightly, knew that recording time was gonna be important. But this one is way more subtle. Youre gonna love what that curve is for when I tell you. Now, weve also got this hole, which a spike inside the VCR will rudely insert itself into, and that unlocks the tape reels, and this bigger one is for lightbulbs on sticks which help the VCR detect when the end of the tape has been reached. VHS cassettes have the lid unlocker placed here, which is excellent because it makes the cassette a much better fidgeting device. Now, if youve drunk the Kool-Aid, youll have undoubtedly been told that Beta was a much more well-engineered product, and that VHS was just a sloppy knock-off. Well, I dont know about you, but this gaping hole sure seems to leave more of the tape exposed and vulnerable. Yeah there are these half-width guards that help, a little, and you could totally still stick your fingers in the two larger holes of a VHS cassette, but on the whole (pause with an obnoxious smirk) the VHS cassette seems to do a better job protecting the precious tape. And all those holes are there for specific purposes. Lets now take a look at the VCRs. The first thing to know is that all videocassette recorders will contain some sort of device that makes your heads spin. Thats the shiny silver drum here, and here. Of note is that the Beta drum is a fair bit larger, which means that the speed the heads travel at is a little bit higher than that of VHS, because both drums spin at the same rotational speed. This is one of the many reasons people would tell you back in the 80s that Beta had a better picture quality. Which, from my admittedly decades-down-the-road experience I find to be a fairly dubious claim (or at the very least, largely insignificant) But ya know, better point it out! There are people out there who are still mad that Beta didnt win the format war, and its a fair bet theyll let you know about it in the space below this video. Anyway, while I do love pressing buttons, lets move on. dubious and largely insignificant music One thing that inevitably comes up whenever I or presumably anybody makes a video comparing Beta and VHS is the fact that Beta continued to be used in the professional market for decades. So, yes it failed in the consumer market but because the professional market continued to use Beta we know that it was truly the better product and consumers were idiots for backing VHS. Now, I will agree that consumers often make silly choices. However! You are not talking about Betamax. Youre talking about Betacam. Betacam was the professional version of Betamax which continued to be used for many decades after the format war ended. Now, I understand why you would confuse the two. Theyre both called Beta something and in fact Betacam cassettes look an awful lot like this, some are identical in fact (they just say Betacam, not Betamax) but theyre not the same formats. You cant play a Betacam tape in a home Beta VCR and expect anything good to come out of it, if anything at all. Betacam continued to be updated through the years, in fact it was eventually moved to HD and even digital signals. So, yes, Betacam did keep going in the professional realm but it is very much only tangentially related to Betamax. Anyway, lets continue. Both of these machines have to get the tape out of the cassette, and make sure it touches a laundry list of items. Of course, it needs to wrap at least 180 degrees around the head drum, but it also needs to pass by the erase head, the audio and tracking heads, and in the case of the Beta machine, these two sensors (which I will explain shortly). Now, with a cassette in place, but not yet threaded, youll immediately see a few differences between these formats. First is that the head drum on the Beta machine is quite a bit farther away from the cassette than the VHS drum. Youll also notice that theres a not-insignificant amount of space behind it as well. The VHS transport was always a fair bit more compact than that of Beta, and while in the early days of the format war its not like that mattered at all since the machines were massive, in our soon-to-happen lust for miniaturization this would prove kind of annoying for Sony. While their Betamovie camcorder solved that problem in a very clever (though incredibly compromised) fashion, VHS enjoyed a more compact mechanism from day one, perhaps somewhat ironic when you consider that the cassette itself is significantly larger. But then again, that larger cassette allowed them to create the VHS-C format and use simple adapters for use in full-size VCRs. Anyway, the component I deliberately left out of the discussion of all the things the tape needs to pass through so I could save that for right now is the capstan. Tape-based formats generally use Captain Stan over here to move the tape through the transport at a steady speed. A rubber pinch roller will squeeze the tape between itself and the capstan, and the constant rotational speed of the capstan in turn causes the tape to move through the transport at a constant linear speed. Now, lets look at where the Capstans Quarters are for both of these machines. VHS puts it right here, and youll see its accompanying pinch roller right next to it. On Beta, its way the frick over there for some reason. And its pinch roller is nowhere to be found. Ah! Now were getting to the point of this video. See, Beta and VHS used entirely different methods of removing the tape from the cassette shell. VHS uses whats called an M-load. The two largest holes on the bottom of the cassette (manages to completely miss) -- those two -- allow these two moveable tape guides to slip behind the tape when its lowered on top of them. When the transport is engaged, these move towards the rear of the machine, looping the tape around the drum, and a little helper will usually swing out once the guides have passed it to pull the tape against the erase head. Since this kinda-sorta forms the shape of the letter M, the name M-load was chosen. Now, going back to Beta, look around a little harder and youll eventually find the pinch roller here. Nowhere near the capstan. In a Beta machine, the pinch roller does double duty. Just as the VHS cassette gets lowered on top of the tape guides, the Beta cassette is lowered on top of the pinch roller. When its time to get the tape out of the cassette, it (along with the tape guides flanking it on either side) YANKS OUT about a mile of tape and makes a very, and literal, roundabout trip to the capstan. Once its there, a little lever dude will put pressure on the pinch roller, pushing it against the capstan, and now the tape can be moved through the mechanism. This loading mechanism is essentially just a miniaturized version of the U-load system Sony devised for their earlier U-matic. You see, if you look at this from overhead, youll find that the tape makes the shape of the letter U. Now, somehow, this got named the B-load system when it was moved to Betamax, and its said that the name Betamax came from the fact that this resembles the greek letter Beta. I am to this day baffled by that anecdote, as I cannot seem, no matter how I try, to imagine this shape as reminiscent of that shape. But whatever. So, there are two things worthy of note, or noteworthy. First is this explains why the hole on the Beta cassette is so fricken big as the rather large pinch roller and those tape guides all need to fit behind the tape in that space. And second is that once the tape has been removed from the cassette, none of the tape transport components are very close to it at all. Sony designed the Beta cassette as just a container of tape. The machine removes it from the box, and from that point on it might as well not exist. But the VHS cassette is much more clever. It is designed to become *part* of the tape transport. The fact that the head drum is closer to the cassette is no coincidence. Everything is closer to the cassette. And some things are even inside of it. That small hole up there is designed to accommodate the capstan. When the cassette falls down into the loaded position, the capstan is already behind the tape. And that curve in the plastic is there so that the pinch roller can squeeze the capstan without rubbing against the cassette itself. Such an elegant solution! In this particular machine we find a rather small pinch roller, and an additional tape guide occupies the curved space. And of course, lets not forget about the lightbulb on a stick! If youve got much of any experience with a VHS cassette youll have undoubtedly noticed that the tape leaders, thats the bit of tape at each end thats meant to be a little stronger to protect it from breaking, are clear. The cassette is designed with a light path between the center of this big hole and these two smaller holes hiding under the cassette lid. Light sensors that sit right next to these holes will see the light pass through the cassette when the end of the tape has (been) (but he didn't say been) reached. Thats pretty clever, if you ask me. A newer machine like this will instead use a couple of infrared LEDs on a stick. Still. Same concept. Beta, meanwhile, went much more old-school. The tape leaders on a Beta cassette are not clear, but metallic. Located near both ends of the tape transport are what basically amount to metal detectors, and these sense the end of the tape. Let the record state that Sony used the technology of the 8-track to signal the end of the tape in Betamax. While were talking about the differences in tape handling, Id like to address a claim made by some of the Betamax loyalists out there. It was often claimed that the Beta transport was more gentle to the tape, as unlike in a VHS machine where the tape has to make two 180 degree turns, there are no sharp curves in Beta. Excuse me, but what is this? That looks darn near like a 180 to me. And up here in a VHS machine, the tape makes two 90 degree turns, not a 180. Sure, maybe you wanna call that a 180, but lets count the places where the tape touches something. First, beta; One. Two. Three. Four. Five. Six. Seven. Eight. Nine. Ten. Eleven. Twelve. Thirteen. Fourteen. And now VHS; One. Two. Three. Four. Five. Six. Seven. Eight. Nine. Ten. Eleven. Now. Are each of the things the tape touches gonna put the same amount of wear on the tape? No. And does the number of things the tape touches change from VCR to VCR within the same format? Yes. But this claim seems so incredibly backwards to me that I felt I needed to bring it up. Also of note is that on a VHS machine, the entire top half of the drum spins, whereas on a Beta machine, only the heads spin and the drum itself remains motionless. This was another thing brought up in favor of Beta, since obviously thats better for the tape. But I think this is actually wrong. It may be counterintuitive, but the spinning drum of a VHS machine can create an air curtain, meaning that the tape actually just floats above it. Now, obviously only the top half of the drum spins so the tape does rub against the motionless bottom part during some of its travel, particularly at the end of the drum, but you can clearly see on this Beta machine that, after years of tape dragging across the motionless drum, its surface has actually been polished a little bit. That cant be good for the tape. Regardless of the particulars, there is certainly a delicious irony to the fact that the Beta transport works like this. Beta cassettes are smaller, right? And they contain less tape, right? Thats the main reason Beta failed, as it just never had the recording time of VHS. And no, it wasnt pornography, thats a myth. You could get porn on Beta, Sony had no control over what content was being distributed so stop saying Sony wouldnt allow porn because thats nonsense and easily disproved. Anyway. For a system so short on tape, youd think that this lets just yank out all the tape! method would have been avoided. Want to see exactly how much more tape the Beta machine needs just to make it through the transport? Great! So do I! Lets just do a little snip snip and compare. Just look at the difference! The Beta machine needs (obviously recorded later) TWELVE more inches of tape! Thats about (again, recorded later) THIRTY centimeters! Keep in mind that this entire length here can never be used, so while the actual distance from the first head to the last might not be all that different compared to VHS, this whole return path can never be recorded onto at the start of a tape. Now, since thats obviously a tiny portion of the overall tape in the cassette, does it really matter? No! Of course not! None of this matters! Were talking about two dead formats here as if their pros and cons matter in the slightest in 2019! They dont! Its over! Its done! Its history! If you bought a Beta machine, feel free to keep being smug about it. But you backed the wrong horse, oh well, life sucks sometimes. Now, wheres my HD-DVD player? second-rate smooth jazz Hey there. So, I just wanted to add here at the end that history is weird and there were indeed some VHS machines that used a U-load system like Betamax. If memory serves they were all made by Philips. Whether there were any Beta machines that used an M-load, Im not sure. But I kinda doubt it, given how reluctant Sony would be to change things up, and given how few third-party manufacturers there were making Beta machines compared to VHS. In a similar vein, its worth nothing that not all VHS machines (or indeed Beta machines) would put all the components in the same places. Some VHS machines used this rather odd arrangement whereby the pinch roller would be lifted up and out of the way so that the capstan could be placed in front of the cassette. I have no idea why this arrangement was used as it seems like it offers no practical advantage and also comes with increased mechanical complexity, but it serves as an example of the fact that just because the standard of the format never changed, doesnt mean those specifications werent achieved in weird and wacky ways. But this one is a way more subtle. Is a way more subtle curve. Thats how the line should have been written. ...they rightly knew that tape recording /time/... Tape /recording/ time. /Recording/ time. /Recording/ time. ...that mattered at all because since because since! Because since! I said because and since! Thats because Im not reading the line as I wrote it. It YANK (awkward pause). Oh. No I needed to read that! *silly noise* A light bulb on a steck. If... ON A STECK ...the heads move and the drum remains the motionble eugh bleugh ble Usually I'd put a joke or something here, but it's No Effort November and I can't be bothered. Oooh, but is this a joke, then? That's an interesting conundrum. Not as interesting as, say, air travel though. That's some interesting stuff.",
    "transcript_keywords": [
        "Beta",
        "tape",
        "Beta machine",
        "VHS",
        "VHS cassette",
        "Beta cassette",
        "cassette",
        "VHS machine",
        "machine",
        "tape transport",
        "pinch roller",
        "Beta transport",
        "drum",
        "Beta VCR",
        "Betamax",
        "machines",
        "Beta and VHS",
        "holes",
        "pinch",
        "making Beta machines"
    ],
    "transcript_entity_values": [
        "2019",
        "many decades",
        "third",
        "the Capstans Quarters",
        "JVC",
        "TWELVE more inches",
        "half",
        "the years",
        "Three",
        "Nine.",
        "Fourteen",
        "the early days",
        "Sony",
        "years",
        "the 80s that Beta",
        "Four",
        "two 90 degree",
        "two",
        "at least 180 degrees",
        "Thirteen",
        "the month of November",
        "the Kool-Aid",
        "November",
        "Stan",
        "U-matic",
        "8",
        "Betamax",
        "Eight",
        "180",
        "Betamax",
        "decades",
        "Beta",
        "YouTube",
        "Seven",
        "THIRTY centimeters",
        "Five",
        "North American",
        "two 180 degree",
        "English",
        "greek",
        "Today",
        "VHS",
        "about a mile",
        "Betacam",
        "first",
        "Betacam",
        "day one",
        "U",
        "One",
        "Two",
        "First",
        "YANKS",
        "second",
        "Twelve",
        "Ten",
        "Six",
        "Philips",
        "Eleven"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "LANGUAGE",
        "NORP",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.11798883974552155,
        -0.05969567224383354,
        0.021050214767456055,
        -0.14983412623405457,
        0.00929442048072815,
        0.07423315197229385,
        -0.03340310603380203,
        0.049333300441503525,
        -0.010050900280475616,
        -0.04566828906536102,
        -0.06587690860033035,
        0.057694800198078156,
        -0.01685924641788006,
        0.01093258149921894,
        -0.07312671095132828,
        -0.050392117351293564,
        0.023684997111558914,
        -0.05453239381313324,
        0.0009067450882866979,
        -0.014952835626900196,
        -0.00812721811234951,
        -0.023692172020673752,
        0.049947675317525864,
        0.017808422446250916,
        -0.005153808742761612,
        0.058435216546058655,
        -0.06128092110157013,
        0.018279433250427246,
        -0.00781332328915596,
        -0.060742273926734924,
        -0.07774127274751663,
        0.05775297433137894,
        -0.041246261447668076,
        -0.023776842281222343,
        -0.024422312155365944,
        -0.07596239447593689,
        0.004018882755190134,
        -0.0189589224755764,
        -0.07899174094200134,
        -0.006328088231384754,
        0.015915697440505028,
        -0.02261330746114254,
        0.03307155892252922,
        0.02752590924501419,
        -0.011838134378194809,
        0.012284872122108936,
        0.0469740591943264,
        -0.12555401027202606,
        -0.0030587201472371817,
        0.021199557930231094,
        -0.058257970958948135,
        -0.03848038241267204,
        0.07841081917285919,
        -0.012636743485927582,
        -0.05148090422153473,
        -0.01843399554491043,
        0.059881746768951416,
        0.03415561094880104,
        0.06103100627660751,
        0.01710844598710537,
        0.048120055347681046,
        -0.06258048862218857,
        -0.06179243326187134,
        0.023347778245806694,
        0.019926318898797035,
        -0.020671380683779716,
        0.043460212647914886,
        0.11683472990989685,
        -0.03775171563029289,
        -0.03933735564351082,
        -0.0778537467122078,
        0.07881868630647659,
        -0.00424580043181777,
        0.014667072333395481,
        0.007959350943565369,
        -0.01336866244673729,
        0.05292477086186409,
        -0.0078474385663867,
        0.012691525742411613,
        -0.017249014228582382,
        0.08536099642515182,
        -0.05928735435009003,
        -0.030273910611867905,
        -0.08775218576192856,
        -0.030444441363215446,
        0.03505317494273186,
        0.0009453577804379165,
        -0.014265579171478748,
        0.026103388518095016,
        0.0009719601948745549,
        -0.0800519809126854,
        0.0800960436463356,
        0.07239468395709991,
        0.01841210387647152,
        0.017800208181142807,
        -0.015213338658213615,
        -0.02062736265361309,
        -0.05960705131292343,
        0.0256789717823267,
        0.0836232528090477,
        0.030960872769355774,
        0.027091089636087418,
        0.030722230672836304,
        -0.016292214393615723,
        -0.011558807455003262,
        -0.025016725063323975,
        -0.023152804002165794,
        0.08346401154994965,
        0.0782497301697731,
        -0.033775653690099716,
        -0.03253075107932091,
        0.04291790723800659,
        0.0026272141840308905,
        -0.019396409392356873,
        -0.00804990530014038,
        -0.00517249433323741,
        -0.04540613666176796,
        0.05101450905203819,
        0.008187119849026203,
        -0.02037968300282955,
        0.05572903901338577,
        -0.05213082581758499,
        -0.03885439783334732,
        -0.0039047906175255775,
        0.043277811259031296,
        -0.06643086671829224,
        -0.06334148347377777,
        4.520310996183304e-33,
        0.025598786771297455,
        0.07910555601119995,
        -0.019381828606128693,
        0.06627409160137177,
        0.024304384365677834,
        0.03485909104347229,
        -0.05397651717066765,
        0.05325254425406456,
        -0.09850861877202988,
        -0.018454138189554214,
        -0.005366737488657236,
        -0.0026035457849502563,
        -0.08609172701835632,
        0.014702651649713516,
        -0.007784119341522455,
        -0.045763686299324036,
        -0.1207314133644104,
        -0.018915945664048195,
        -0.027872812002897263,
        -0.02679254300892353,
        -0.03631049394607544,
        0.022729123011231422,
        0.009883946739137173,
        -0.01242040004581213,
        0.033939726650714874,
        -0.0749550610780716,
        -0.024264058098196983,
        -0.008876360952854156,
        0.0659463107585907,
        0.02592192403972149,
        -0.030393121764063835,
        -0.033524591475725174,
        -0.017586592584848404,
        -0.04609781876206398,
        0.0678614005446434,
        -0.014050278812646866,
        -0.10296115279197693,
        -0.14075501263141632,
        -0.02786075696349144,
        0.041275326162576675,
        0.061507731676101685,
        0.02352200448513031,
        -0.09448371827602386,
        0.0498732253909111,
        0.008906813338398933,
        -0.013299522921442986,
        0.12767547369003296,
        0.01715919002890587,
        0.04185343533754349,
        0.010808786377310753,
        -0.016953222453594208,
        0.030025821179151535,
        -0.08667618781328201,
        -0.11284355819225311,
        0.018392518162727356,
        0.05776365101337433,
        -0.010314478538930416,
        0.00556078040972352,
        0.0066004786640405655,
        -0.04546521604061127,
        0.026756737381219864,
        0.06217332184314728,
        0.04073496162891388,
        -0.0533406063914299,
        -0.10103267431259155,
        0.03121371939778328,
        0.00042731635039672256,
        0.0032581910490989685,
        0.017800234258174896,
        0.022067446261644363,
        -0.04192489758133888,
        0.040211502462625504,
        -0.0031535380985587835,
        -0.14866681396961212,
        0.03006724826991558,
        0.06999088823795319,
        -0.0596882700920105,
        -0.005428459029644728,
        0.04185578227043152,
        -0.046684082597494125,
        -0.04271387681365013,
        -0.01367473416030407,
        0.039839304983615875,
        -0.04821636155247688,
        0.035284046083688736,
        0.011790060438215733,
        0.07280807197093964,
        -0.091974176466465,
        0.07892823219299316,
        0.0337248332798481,
        0.003356012748554349,
        -0.031027518212795258,
        0.00032637547701597214,
        0.007185322232544422,
        0.05258418247103691,
        -4.769782488838472e-33,
        -0.015999482944607735,
        0.024923985823988914,
        0.01271854992955923,
        -0.03222933039069176,
        0.04033591225743294,
        -0.08056855946779251,
        0.003479977836832404,
        0.01291678287088871,
        0.0590931698679924,
        -0.0470089316368103,
        0.025402531027793884,
        -0.003878035582602024,
        -0.04891417548060417,
        -0.054006196558475494,
        -0.040977444499731064,
        -0.10797440260648727,
        0.06558416783809662,
        -0.008013315498828888,
        0.016331424936652184,
        -0.06286341696977615,
        0.11531314253807068,
        0.0005717460880987346,
        -0.01844954490661621,
        0.008187896572053432,
        -0.03112502582371235,
        0.016537761315703392,
        0.04604344442486763,
        0.03919509798288345,
        0.1272512823343277,
        0.03934046998620033,
        0.05365394800901413,
        -0.02003565803170204,
        -0.00903976522386074,
        -0.014351376332342625,
        0.02563839592039585,
        0.06959590315818787,
        0.1560327410697937,
        -0.006848059128969908,
        -0.019560355693101883,
        -0.07359959185123444,
        -0.02497009001672268,
        0.07529153674840927,
        -0.11318352073431015,
        -0.018186984583735466,
        -0.03250960260629654,
        0.0006303821573965251,
        -0.0294518880546093,
        0.055177122354507446,
        -0.05024183169007301,
        -0.029861312359571457,
        0.06251247227191925,
        -0.01891241781413555,
        0.038441915065050125,
        -0.052124474197626114,
        0.01637290231883526,
        0.0076093669049441814,
        -0.02496696636080742,
        0.06020541861653328,
        0.044834449887275696,
        0.057060956954956055,
        0.021241242066025734,
        -0.01790042035281658,
        -0.06740617752075195,
        -0.014030497521162033,
        0.030061066150665283,
        0.011168732307851315,
        0.07246258109807968,
        0.09006107598543167,
        -0.0473918654024601,
        0.03962526097893715,
        -0.02254069223999977,
        0.01732776314020157,
        -0.04539850354194641,
        -0.05606089159846306,
        0.06080750748515129,
        -0.03397617116570473,
        0.0061558750458061695,
        -0.027290334925055504,
        -0.045096784830093384,
        0.019762607291340828,
        -0.12209158390760422,
        0.06144373491406441,
        0.012829954735934734,
        0.013715963810682297,
        0.04199712350964546,
        0.10879196971654892,
        0.08859189599752426,
        0.047985948622226715,
        -0.03148068115115166,
        0.020133931189775467,
        0.011064589954912663,
        -0.013928379863500595,
        0.034779295325279236,
        0.0691554918885231,
        0.05120563134551048,
        -5.4709186514401154e-08,
        0.02124669961631298,
        0.008513846434652805,
        -0.038225360214710236,
        0.009153969585895538,
        -0.012016616761684418,
        -0.04975706338882446,
        0.052126772701740265,
        0.01639682427048683,
        0.008055349811911583,
        0.021751534193754196,
        -0.06725938618183136,
        0.009525288827717304,
        0.0029416275210678577,
        0.04407234489917755,
        0.09483852237462997,
        0.09181308001279831,
        -0.08110557496547699,
        -0.025876741856336594,
        -0.06476449221372604,
        -0.011932026594877243,
        0.08268018811941147,
        -0.025494588539004326,
        0.12407417595386505,
        0.0003868098428938538,
        -0.034842029213905334,
        0.04422396793961525,
        0.010307575576007366,
        0.008985158987343311,
        -0.006642994005233049,
        -0.026196010410785675,
        -0.04437582939863205,
        0.024540359154343605,
        -0.0964326411485672,
        -0.1393222212791443,
        -0.00508875073865056,
        -0.05010329559445381,
        0.02894417569041252,
        0.03294302895665169,
        0.05029354989528656,
        0.07940457761287689,
        0.013106975704431534,
        -0.08452831953763962,
        0.05656876042485237,
        0.0919845774769783,
        0.03431738168001175,
        0.0584704652428627,
        0.01356577966362238,
        -0.03209652006626129,
        -0.002295862650498748,
        -0.09533598273992538,
        0.0015028915368020535,
        -0.004918059334158897,
        -0.05629577860236168,
        0.012138569727540016,
        0.02918870560824871,
        0.02986595593392849,
        0.04982050135731697,
        0.06565816700458527,
        -0.032606806606054306,
        0.03928525000810623,
        0.09801054000854492,
        -0.04778197035193443,
        0.036463890224695206,
        -0.039367664605379105
    ]
}