{
    "id": "hxf-fIubkMs",
    "title": "The Worlds Most Advanced Wheelchair! - (It Climbs Stairs!?!)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-07-13T13:45:02Z",
    "video_url": "https://www.youtube.com/watch?v=hxf-fIubkMs",
    "category": "Howto & Style",
    "tags": [
        "stair wheelchair",
        "stair climbing wheelchair",
        "electric wheelchair",
        "wheelchair",
        "wheelchair user",
        "cambry kaylor",
        "cambry",
        "best wheelchair",
        "mobility",
        "accessibility",
        "stairlift",
        "most advanced wheelchair",
        "off road wheelchair",
        "power wheelchair",
        "high tech wheelchair",
        "balancing wheelchair"
    ],
    "views": 9032617,
    "likes": 187719,
    "comments_count": 11512,
    "description": "Its been awhile since real innovation has happened in the wheelchair space. Scewo is here to change that with the worlds most advanced self balancing stair climbing wheelchair.  This high tech wheelchair has been on my radar for a few years now - its amazing to finally see it in action. Climbing stairs - going off road... see for yourself! Nice work Scewo! (This video is not sponsored)   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.scewo.com/en/",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "-[Cambry] It's blowing my mind and making me nervous all at the same time! [Music] It goes forward when I lean forward just a bit, and it goes back just a bit as well. [upbeat electronic music] Ahh! That's so cool! -[Zack] So you know those videos sometimes you see on Facebook and you're like, yeah, that'll never actually be a real product. That's what I thought about this two-wheeled stair climbing wheelchair. But it turns out it's actually legit. And today Cambry's going to take it for a spin. -Let's get started. [Intro] -So Cambry, what's one of the biggest obstacles to being in a wheelchair? -Stairs. -Every time it's always the stairs. So how long have you been in a chair...as of today? -I think it's 17 years. -Wow. Is it today? -Yeah, today's my anniversary. -Whoa. -That's wild. -We did not plan that one. -Okay. I'm one year shy of being in a wheelchair as long as I wasn't in a wheelchair. And all 17 years, stairs have been hard. -But today we're going to be actively searching for places with stairs. I legit saw this exact wheelchair on Facebook a couple years ago after we started dating, and I thought to myself, it's too futuristic to ever be real. But it turns out they're actually selling these overseas, not so much here in the United States just yet, but hopefully that changes soon. -And I'm really sitting in it. -Shall we go on a stroll? -Let's. -This futuristic contraption is called the Scewo BRO, and it kind of balances just like you would see on a Segway, except for it does have those mechanical tracks underneath which we'll be trying out in a second. The tracks are hovering suspended above the ground, not touching anything quite yet since the two main wheels on the side are doing all the balancing by themselves. The Scewo BRO has a weight limit of 260 pounds. The large wheels on the side can handle a 10% slope and easily handle an obstacle up to two inches high, which means we can take it off the pavement. -Whoa. So I'm a T10/11 complete spinal cord injury, which makes me a paraplegic, and I use a manual wheelchair for most of my day to day stuff. Don't get me wrong, I love my manual chair. It collapses so I can get it in and out of the car by myself. It's lightweight, gets through most doorways. It's pretty great, but it does have some limitations, stairs being number one. I can go down stairs. -Yikes. -Not very safely! But going up, I have to get out of my chair, physically try and crawl up the stairs. And if it's more than 3 or 4, there's no way I'm getting the wheelchair over. -So you are currently in a wheelchair with two wheels. How does it feel? -It feels like I'm sitting in a chair that's in a wheelie, like it's got some dynamic motion beneath me. It feels really cool. Like I feel like I'm riding a horse. Maybe it's more relatable to say it's like riding a bike. It turns on a dime. It goes forward when I lean forward just a bit. And it goes back just a bit as well. It really feels like it's a part of me and I'm digging it. -The part I'm interested in is these guys down here. It's interesting that they turn at the same time as the wheels. Can you go into that tripod stance thing? -And you want me to go up or down? -Um, come down. -One of the things I noticed first is that I'm a little bit higher than I normally am when I'm in this chair. In order to transfer back into my manual chair, the Scewo does get low enough for me to be able to transfer at a level surface. How do I do it? Just a little harder? Oh! And I'm told it gets super tall, but we'll try that in a minute. Easy little transfer. -The thing that's bothered me most about accessible equipment is that the technology hasn't changed in a really long time. We see power wheelchairs still using brush motors, and lead acid batteries, which all seems kind of archaic, especially when you consider now we have vacuum cleaners with digital mapping, lasers, cameras, and even lidar, while accessible devices, you know, things people spend the majority of their day in, are still using antiquated technology from 20 or 30 years ago. Just, you know, outdated. The Scewo BRO though is a very refreshing take on what modern technology is capable of. Cambry, I see a milk chocolate bar up on the top shelf, do you think you could get it for me? -Sure. This one? -Perfect, yes. Now you're as tall as I am. So Cambry's going to try out the max speed. You ready? Let's go. Full acceleration. It's not tipping over which is cool. -I can feel the wind in my hair! -Wish I could say the same. Legit. Do full brake. -Whoa. -And it still didn't tip. -Yeah, I feel like Xavier from X-men in this thing. -That's the perfect analogy. Are you ready to finally try some stairs? -Yeah, feeling comfortable. -Okay, staircase right here. Conveniently located. -So, you don't go forward to go up the stairs, you gotta go backwards. Psych. -The Scewo has 4 lasers, two ultrasonic sensors in the back and a backup camera, all of which are used for driving, but especially to keep someone safe on the stairs. -So I'm going to back it up to the stairs. I am a newbie. Am I getting a thumbs up? -Backing up to the stairs we have to switch from two wheeled mode into track mode by dropping down the two center tracks so they can take over. The large teeth on the tracks engage with the stairs and take Cambry to the next level...literally. Adios. -This is unreal. It says too much side tilt. -You gotta go the other direction. -Which way? -The other direction. -This way? -Yeah. -Okay. It's nice that it tells me that. Ultrasonic sensor detected the end of the stairs. -Nice. -Alright. Ah! That's so cool! Oh my gosh. I'm so focused on looking at this so I didn't even realize that I was up here until I was up here. Feels a little bit like I'm in one of those gurney chairs where they go up backwards a little bit, so I'm like am I supposed to do anything? Don't move! That's wild. What's cool is that this device allows you to be interactive in your environment without the environment changing. Like you adapt to the environment, whereas when you're in the manual chair, I feel like the environment has to be adapted to you. -You can smile a little bit if you want. -I'm really focused. It's so wild. Anything like a steep incline, reaching something up high, stairs, or the terrain is a little bit bumpy, it's difficult. Whereas this, to me, feels like it works well in non-wheelchair friendly places. -Yeah, more places. -You know what it kind of feels like? -What? -Like I'm strapped on a roller coaster and we're starting to go up and we're about to do the big drop. How's the weather down there? -Think you could have done that in your regular chair? So now we know that it can go up stairs, but I think the sketchy part is going down stairs. -This is the scary part. Are you sure I'm doing this right? Oh my gosh. This really feels like I'm on a roller coaster right now. We chose the tallest stairs to try this on. -How are you doing up there? -I'm a little nervous. -Crazy how quiet it is. Looks like we have chains inside, tracks, actuators... -It's blowing my mind and making me nervous all at the same time! -It's fun how it just raises those tracks and puts you right back on two wheels. -I still feel like a 15 year old with their learners permit, but this is fun. Last couple of stairs are fine, it's the first couple that are nerve wracking. -Now Cambry is motoring down to a lower level. -Oh, my seat belt! Rookie. -So obviously this Scewo isn't ours, they just let us borrow it for the afternoon to test it out. What are your thoughts? -I really enjoyed it. I was a little nervous at first. Like you can see my face when we're climbing up and down those stairs. I was super nervous, but I got the hang of it by the end of it and I thought it was really fun. I really enjoyed it. I felt like it gave me new freedoms. Thumbs up for me. -It does have a range of around 20 miles I think, which is pretty far. I also tried it out, and my impression is that it kind of feels like a boat at first. I've never been on a Segway either. So it was my first time being balanced on two wheels and you would roll forward and back and it would kind of rock as it stabilized you. Super solid, but still kind of felt like a boat as I started out. -I just kind of felt like I was in a wheelie the whole time. And I think, if you've not lived in a wheelchair and then you end up in a wheelchair, there's a learning curve there, so I feel like it's similar to that. Once you get into it, it just takes a minute to figure out your center of gravity and how it works and how to go in all the different settings. And once you do it's way fun. -And I'm excited about where the future's headed. You know like we mentioned earlier, currently accessible equipment is not very... -Smart. -Smart....and I think the Scewo team is doing a great job of modernizing it and including all of the technology that we appreciate in everything else, and bringing it into the accessible world. The only downside of the Scewo BRO is the price, which right now is around $40,000 US dollars. Now obviously insurance should come in and help pay for that a little bit, but at the same time, like all technology, the first versions are the most expensive. But also, like all technology, the price will decrease over time and I expect in 5 or 10 years, hopefully, it's a little bit more cost effective. But either way, I'm happy to see it here. -With the way that they made this Scewo, I think it's just going to get better and better in the future. Like they're really working to figure out all the little things that people need and how to make it really do what it's meant to do, which is create an accessible world for people. -Their team seems genuine and nice and we had a fun afternoon. I'll leave a link for the Scewo website down below with all the specs and current pricing if you're curious and want to learn more. -Thanks a ton for watching. We'll see you around. -Perfect.",
    "transcript_keywords": [
        "Stairs",
        "Scewo BRO",
        "Scewo",
        "bit",
        "wheelchair",
        "feels",
        "feel",
        "time",
        "Cambry",
        "chair",
        "back",
        "kind",
        "yeah",
        "wheels",
        "tracks",
        "forward",
        "BRO",
        "years",
        "technology",
        "today"
    ],
    "transcript_entity_values": [
        "around 20 miles",
        "their day",
        "260 pounds",
        "Scewo",
        "10%",
        "Cambry",
        "20 or 30 years ago",
        "two",
        "Facebook",
        "17 years",
        "a minute",
        "Segway",
        "a fun afternoon",
        "4",
        "two inches",
        "around $40,000 US dollars",
        "the United States",
        "one year",
        "all 17 years",
        "first",
        "second",
        "today",
        "5 or 10 years",
        "15 year old",
        "more than 3",
        "Scewo",
        "Xavier",
        "a couple years ago"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "GPE",
        "PERCENT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "GPE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.13230200111865997,
        0.028583571314811707,
        -0.06505830585956573,
        -0.0621577613055706,
        -0.005586778279393911,
        -0.023713702335953712,
        0.0458688959479332,
        0.07570014894008636,
        -0.05053301528096199,
        0.06507373601198196,
        0.05973553657531738,
        0.033151235431432724,
        0.041630759835243225,
        0.02344949170947075,
        0.001861296477727592,
        0.0386502631008625,
        0.007715960964560509,
        0.005047234240919352,
        -0.044091805815696716,
        0.07654377818107605,
        0.006469526328146458,
        -0.0242315586656332,
        0.01743697002530098,
        0.02921491488814354,
        -0.11496240645647049,
        0.02808273583650589,
        -0.02017951011657715,
        0.030843932181596756,
        -0.06474068760871887,
        -0.07136768847703934,
        -0.009268214926123619,
        0.033651307225227356,
        -0.11180105060338974,
        -0.017649024724960327,
        0.010636691935360432,
        0.03118857741355896,
        0.020945364609360695,
        -0.004985380452126265,
        -0.0726754367351532,
        -0.06566102802753448,
        -0.04961709305644035,
        -0.06400169432163239,
        0.024550465866923332,
        -0.0557233989238739,
        -0.003460837062448263,
        0.04160115495324135,
        0.06119871139526367,
        -0.11687098443508148,
        -0.004060213454067707,
        -0.007568524219095707,
        -0.07556040585041046,
        -0.03100316785275936,
        0.1134895384311676,
        0.007703324779868126,
        -0.050011783838272095,
        0.00043539077159948647,
        0.013901461847126484,
        -0.02764040045440197,
        -0.0024348001461476088,
        -0.07658541947603226,
        0.036145612597465515,
        -0.03699091076850891,
        -0.018262622877955437,
        0.03821973502635956,
        -0.013485018163919449,
        -0.002116680843755603,
        -0.014438661746680737,
        -0.1553366333246231,
        -0.020357828587293625,
        -0.0023138532415032387,
        -0.07346560806035995,
        -0.03201102837920189,
        0.04641159623861313,
        0.01083991676568985,
        -0.0066298143938183784,
        -0.022362036630511284,
        0.03479883074760437,
        0.0056348927319049835,
        0.043031152337789536,
        0.005733489990234375,
        0.04917893931269646,
        0.041004739701747894,
        0.0034128818660974503,
        0.05606928840279579,
        0.02952900528907776,
        0.09143157303333282,
        -0.057290442287921906,
        0.10940991342067719,
        -0.04383152350783348,
        -0.007969247177243233,
        0.017453506588935852,
        -0.026763074100017548,
        -0.0010014065774157643,
        -0.03731395676732063,
        -0.0317523367702961,
        -0.06425734609365463,
        -0.0833810567855835,
        -0.10442724823951721,
        -0.06394559144973755,
        0.035652950406074524,
        -0.00947902537882328,
        0.030153650790452957,
        0.11183874309062958,
        0.012384665198624134,
        0.06398452818393707,
        -0.010778139345347881,
        0.022189553827047348,
        0.025122148916125298,
        0.05370933189988136,
        0.06407348066568375,
        0.004723326303064823,
        -0.038858890533447266,
        0.01687796413898468,
        -0.016744259744882584,
        -0.051465146243572235,
        0.06549236178398132,
        -0.10695966333150864,
        0.0547628216445446,
        0.0356849767267704,
        -0.03038153424859047,
        0.07423833012580872,
        0.0034298687241971493,
        -0.006060073152184486,
        0.026085592806339264,
        0.044469259679317474,
        0.017019426450133324,
        -0.05436320975422859,
        3.255171242115401e-33,
        0.009248020127415657,
        0.07738012820482254,
        0.05113065987825394,
        -0.0040779802948236465,
        0.05115027725696564,
        -0.03482775017619133,
        -0.012893659994006157,
        0.06553933024406433,
        -0.016996189951896667,
        0.008634382858872414,
        -0.013345898129045963,
        0.03387170284986496,
        0.015208425931632519,
        -0.013879545032978058,
        -0.01556176133453846,
        -0.029318008571863174,
        -0.03257792815566063,
        -0.0350654311478138,
        -0.08223661780357361,
        -0.027964284643530846,
        0.043712068349123,
        -0.028811609372496605,
        0.052437618374824524,
        0.07168039679527283,
        0.0461333766579628,
        0.058114562183618546,
        0.01434867363423109,
        -0.012879103422164917,
        0.05916735902428627,
        0.036988891661167145,
        -0.07346253097057343,
        0.0360335037112236,
        -0.03552247956395149,
        -0.024707309901714325,
        -0.025203702971339226,
        -0.028664279729127884,
        -0.08059092611074448,
        -0.12381461262702942,
        -0.06938949227333069,
        -0.004353344906121492,
        0.0036091189831495285,
        -0.03131960332393646,
        0.035551946610212326,
        -0.0635848343372345,
        -0.04940008372068405,
        -0.019823554903268814,
        0.002287029754370451,
        -0.0061066909693181515,
        -0.01979437656700611,
        -0.008013905957341194,
        -0.05358254536986351,
        0.027121160179376602,
        -0.03833134472370148,
        -0.08185756951570511,
        -0.07112691551446915,
        -0.06449762731790543,
        -0.02096448466181755,
        -0.004228187259286642,
        0.04617248475551605,
        0.0381319485604763,
        0.03231353685259819,
        -0.0008460590615868568,
        0.0028415690176188946,
        0.058063313364982605,
        -0.04854845628142357,
        -0.09342233091592789,
        0.0077866544015705585,
        0.009591864421963692,
        -0.010730397887527943,
        0.03787881135940552,
        -0.00165918271522969,
        0.05321623384952545,
        0.030398642644286156,
        -0.003733102697879076,
        0.0032172189094126225,
        0.029322022572159767,
        -0.03088223561644554,
        -0.035798393189907074,
        0.05224836245179176,
        -0.06778895854949951,
        -0.08292576670646667,
        0.005299684125930071,
        0.026484092697501183,
        0.003523071762174368,
        0.06149200722575188,
        -0.043419089168310165,
        -0.03630911186337471,
        -0.0979371890425682,
        -0.06931565701961517,
        -0.045645855367183685,
        -0.049558285623788834,
        -0.04923233389854431,
        -0.06505570560693741,
        0.023096304386854172,
        -0.03947195038199425,
        -6.665133784398989e-33,
        0.006603833753615618,
        0.042044106870889664,
        0.05981549248099327,
        -0.04543493315577507,
        0.08573631197214127,
        -0.029150070622563362,
        0.06319259852170944,
        -0.004209693055599928,
        0.07430776208639145,
        -0.01776869408786297,
        -0.07122696936130524,
        0.06842939555644989,
        -0.029424184933304787,
        -0.0276593379676342,
        0.13612021505832672,
        -0.01791314408183098,
        -0.029250316321849823,
        -0.07284868508577347,
        0.02528398111462593,
        0.018762709572911263,
        0.1009971871972084,
        0.10422666370868683,
        -0.011038511991500854,
        0.060894083231687546,
        -0.004349483177065849,
        0.004782681353390217,
        0.05390974134206772,
        -0.00019954815797973424,
        0.05109783634543419,
        0.03339124098420143,
        -0.0520714670419693,
        -0.08742021024227142,
        0.005047089420258999,
        0.011520883068442345,
        -0.02034250646829605,
        0.039143986999988556,
        -0.01975001022219658,
        -0.019420938566327095,
        -0.028845421969890594,
        -0.06826838105916977,
        0.05546163022518158,
        0.02139807492494583,
        0.04069841653108597,
        -0.0010976752964779735,
        0.023937879130244255,
        -0.15086857974529266,
        -0.12510032951831818,
        0.04711093753576279,
        -0.03357800841331482,
        -0.06435641646385193,
        -0.05245475471019745,
        0.012414954602718353,
        0.015570901334285736,
        0.012716623023152351,
        -0.0021062083542346954,
        0.05495886504650116,
        0.04803949221968651,
        -0.04422789067029953,
        -0.03976308926939964,
        -0.026773516088724136,
        -0.020975463092327118,
        0.07156126201152802,
        -0.06665945053100586,
        0.04596612975001335,
        -0.003598259761929512,
        0.01675468496978283,
        0.0388556644320488,
        -0.03606349229812622,
        -0.06677427142858505,
        0.008594385348260403,
        0.016774697229266167,
        -0.03848415985703468,
        0.04588828980922699,
        -0.06411665678024292,
        0.060637589544057846,
        -0.03193914517760277,
        0.04340232163667679,
        0.02859475277364254,
        0.04364274814724922,
        -0.056047406047582626,
        0.05099635198712349,
        -0.1234220489859581,
        0.11204635351896286,
        0.08667248487472534,
        -0.0022397974971681833,
        0.0012378105893731117,
        0.01898357644677162,
        0.010203792713582516,
        -0.011796421371400356,
        0.004514978267252445,
        0.012626947835087776,
        0.05433665215969086,
        -0.013868642039597034,
        0.09257503598928452,
        0.019762177020311356,
        -6.402366636848456e-08,
        0.014498898759484291,
        0.044889118522405624,
        -0.054300639778375626,
        -0.05477231368422508,
        0.031269535422325134,
        -0.0654299259185791,
        0.04556380584836006,
        0.06803610920906067,
        -0.0990108847618103,
        -0.03822402283549309,
        0.04089822247624397,
        -0.009511400945484638,
        0.04948592558503151,
        0.11207100749015808,
        -0.00048375327605754137,
        0.0816371813416481,
        -0.10329963266849518,
        0.09480851143598557,
        -0.0603308267891407,
        0.025455333292484283,
        -0.0941116139292717,
        -0.08203214406967163,
        0.06565553694963455,
        -0.03605632483959198,
        -0.05784737691283226,
        0.024128224700689316,
        -0.11254847049713135,
        -0.04221204295754433,
        0.005880269221961498,
        -0.00019464714569039643,
        -0.001866314560174942,
        -0.0006093160482123494,
        0.003965461626648903,
        0.04100271686911583,
        -0.053221624344587326,
        -0.028777077794075012,
        -0.034894607961177826,
        -0.029963068664073944,
        0.019924137741327286,
        0.07140079885721207,
        0.05823115259408951,
        -0.03303248807787895,
        0.04372987896203995,
        0.06782294809818268,
        -0.025917407125234604,
        -0.0043794563971459866,
        -0.06296876072883606,
        -0.0867273211479187,
        -0.031046811491250992,
        0.02695804461836815,
        -0.047847043722867966,
        -0.006228022277355194,
        -0.010338864289224148,
        0.035983383655548096,
        0.0061309803277254105,
        0.056103527545928955,
        0.0760076642036438,
        -0.045522574335336685,
        -0.03117740899324417,
        0.06625881046056747,
        0.13766469061374664,
        0.012789655476808548,
        0.03655654191970825,
        0.024734845384955406
    ]
}