{
    "id": "HyimfcY6Z-4",
    "title": "BlackBerry KEYone Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-05-04T13:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=HyimfcY6Z-4",
    "category": "Science & Technology",
    "tags": [
        "blackberry keyone review",
        "blackberry keyone camera",
        "blackberry keyone",
        "blackberry 2017",
        "new blackberry review",
        "blackberry mercury review",
        "mrmobile",
        "michael fisher",
        "crackberry",
        "android central",
        "best keyboard phone",
        "best phone keyboard",
        "keyboard phone 2017"
    ],
    "views": 420292,
    "likes": 12360,
    "comments_count": 1192,
    "description": "The BlackBerry KEYone is more than just another anachronistic appeal to nostalgia. It's the best BlackBerry on shelves today, bearing the best keyboard you can find on an Android phone in 2017. Lest you think I'm damning the BlackBerry KEYone with faint praise, remember that MrMobile values smartphones that stand out from the crowd  sometimes even more than he values phones with great battery life and outstanding build quality. The BlackBerry KEYone has all three of those assets in abundance ... but is it enough to make up for its slight software stumbles? Find out in MrMobile's BlackBerry KEYone Review!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  BlackBerry KEYone:    [STUDIO DECOR COURTESY OF THINKGEEK]  Light Cube:   Supernova Sphere:   Light up bluetooth speaker:   Borg cube rug:   Ganymede plush:    [ABOUT THE BLACKBERRY KEYONE REVIEW]  MrMobile's BlackBerry KEYone review was produced following 12 days with a BlackBerry KEYone review device on loan from BlackBerry Mobile. This handset replaced an earlier BlackBerry KEYone review unit that was deemed defective. It received two software updates during MrMobile's time with it: most of the review was performed on software build AAK831, and an update to AAL093 arrived on the evening before BlackBerry KEYone review publication.   SPECIAL NOTE: Although CrackBerry does have a marketing relationship with BlackBerry Mobile, MrMobile is an independent entity within Mobile Nations. He was given the same amount of time with the KEYone as every other reviewer granted early access under the embargo agreement, and he received no compensation of any kind from BlackBerry Mobile or CrackBerry for this review (or any other piece of BlackBerry coverage). More on CrackBerry's relationship with BlackBerry Mobile can be found here:    [FURTHER READING]  Android Central's BlackBerry KEYone review:   CrackBerry's BlackBerry KEYone review:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  Home Organ by Zach Nicita, available at Premium Beat:   No Major Delays by Julian Bell, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/22e",
        "http://mrmobile.tech/1lf",
        "http://mrmobile.tech/228",
        "http://mrmobile.tech/229",
        "http://mrmobile.tech/22c",
        "http://mrmobile.tech/22b",
        "http://crackberry.com/editors-desk-few-awesome-announcements",
        "http://www.androidcentral.com/blackberry-keyone",
        "http://crackberry.com/blackberry-keyone-review",
        "https://www.premiumbeat.com/royalty_free_music/songs/home-organ",
        "https://www.premiumbeat.com/royalty_free_music/songs/no-major-delays",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] Is there any need for this in a world that's mostly gotten use to this? Well, it's not gonna outsell Samsung or unseat Apple but for some, a physical keyboard on a phone is still hugely important, and yes, so is the Blackberry name. But is it worth the price you'll pay for the privilege? Let's find out, this is the Blackberry Key One and this is the Mr. Mobile Review. (upbeat music) I have a special place in my heart for Blackberry. My first smartphone over a decade ago was a 7520. And the Key One brings the best of Blackberry's design legacy to the modern age. - Black finish, silver highlights. - Dax. - Sorry. - When you hold the Samsung Galaxy S8, it feels like you're handling a beautiful sculpture. When you grab the Key One, it feels like you're picking up a tool. Cold aluminum on the sides, stippled soft touch on the back, gorilla glass four up front, and 180 grams of solid, reassuring heft. This is one of those phones that makes a thunk when you drop it in your pocket, one that gets a little heavy on long voice calls. Those calls are very clear, though, and when your arm gets tired, you've got earbuds in the box and one of the loudest mono speakerphones around which makes it easier to forgive its bottom edge positioning. If there's one ergonomic fail, it's this. If you're right-handed, the shortcut key is where the power button should be, and vice versa. You do eventually get used to it, though, and fortunately, that convenience key lives up to its name. I set it to launch Google voice search so I can give the phone voice commands with the push of a button instead of using a key phrase. But you can set it to do almost anything you want. On phone calls, this doubles as a mute switch and it's not the only button doing some doubling. The space bar is also a fingerprint sensor, which is very fast. The keyboard surrounding that space bar is best in class. It's clickier than the mushy keys on the Priv, though it does feel narrower. I also tend to prefer a matte finish on my thumb boards but Blackberry wanted visual consistency with the display glass so it made the keys glossy. Also, the shiny plastic is easier to drag a finger across. That matters because the keyboard doubles as a track pad, so you can scroll long lists or reposition a cursor or confirm an auto-complete suggestion without ever touching the screen. Now, it is a little wonky at points, and yes, you will accidentally hit those tool bell buttons above the keyboard on your first couple tries. But kick it over to landscape and it's awesome for scrolling because your finger never gets in the way of what you're looking at. Oh and if you need a keyboard while you're sideways, yes, a virtual one is available. One day I really wanted to put the keyboard through the ringer so I left my laptop at home, grabbed the Key One and a power pack, more on that in a second, and headed out to a couple cafes to bang out some scripts on the Blackberry. And after, what, eight years typing on virtual keyboards, yeah, it took me a few minutes to adjust. It's physically harder to type on mechanical buttons, for one thing, and a virtual keypad is just better in some ways, it's easier for one-handed use, it's less noisy, and so on, but something I think a lot of people don't remember is that a physical keyboard has perks too. You can type more accurately when you're not looking, for one, you can type by feel. And you can use any of the letter keys to jump right to an app or a specific person. If you really wanna get nerdy, the shift toggles can even emulate control keys, so you can do things like control C and control X and control V to copy and paste. And the space bar takes on even more roles depending on which app you have open. In Kindle, it flips pages. In most apps, it pages down, and in the camera, it's an extra shutter button. So don't let anyone tell you there's no reason for a physical keyboard in 2017. This isn't just a nostalgia play, it's actually useful. Also useful to some, the Blackberry Hub, which is great if you wanna distill all your notifications into one list. The level of control for email is staggering, you can set a different ring, different vibrate pattern, a different LED color for specific people or specific groups or specific keywords, even the snooze options are elaborate. And that's just scratching the surface. But all those features make for a heavy, lumbering app. When my Android Central colleagues pointed out that the Hub uses a lot of system memory, I disabled it and ran the Key One more like a stock Android phone. Then there's those capacitive keys, which seem harder to press than on other phones. This seems like a nitpick but think about it, how many times do you press your home key every day? The Key One still has a ton going for it. For one thing, Blackberry's version of Android is about as secure as you can get with verified boot, hardware root of trust, and a solid track record for timely security updates. And remember that battery pack I grabbed on my cafe day? Well I never had to use it. I typed out two full scripts over six hours and I still had half a charge when I was done. Over my 12 days with the phone, I never once depleted it before bedtime. When you do plug in, you've got Quick Charge 3.0 and a special boost mode for faster recharge if you're willing to snooze on your notifications. Long story short, battery promise kept, big time. Finally, there's the display and camera. As for the former, it's just passable, it can't get particularly bright or very dim and its odd resolution makes for minor scaling issues in some apps. Flipping around to the camera, much has been made of the Key One using the same sensor as the excellent Google Pixel, but a good sensor is only part of a great picture. The lens, the image signal processor, it's all different on the Key One. Still, in many settings, the Blackberry manages to hold its own. I mean, it's definitely the best Blackberry camera I've ever shot with. I'll have more samples available on the Mr. Mobile Facebook page if you want a closer look, link in the description. As for the Pixel comparison, it's only in darker environments that the Pixel's advantage becomes obvious as it pulls more light from a scene but I'm still gonna call this camera a win, especially given the difference in price between the Pixel and the Key One. That price is $549 unlocked, and that's almost $200 less than the Galaxy S8 and about 100 less than the iPhone 7. But when you consider that the Moto Z Play offers the same excellent battery life and a smoother software experience for about 100 bucks less, well it all comes down to one question, just how badly do you want that keyboard? If virtual buttons just won't do, this is the best keyboard you're gonna find on Android. And it's backed up by secure software and a big battery to boot. So if you want is a Blackberry that does its forerunners proud, look no further, the Key One is it. If what you want instead is just a solid Android phone, well there are plenty of other options out there for the same price or less. There's lots more to know about the Key One that I only had time to touch on here. Both Crackberry and Android Central have tons of coverage, so check 'em out and be sure to subscribe to Mr. Mobile on YouTube. Until next time, thanks for watching, and stay mobile, my friends. You're not in the shot, but you're creeping me out, you're creeping me out. Yes, this is Dog. (laughs)",
    "transcript_keywords": [
        "Key",
        "Blackberry",
        "keyboard",
        "keys",
        "Blackberry Key",
        "Android",
        "phone",
        "Android phone",
        "Android Central",
        "physical keyboard",
        "Pixel",
        "Blackberry Hub",
        "Mobile",
        "control keys",
        "control",
        "camera",
        "button",
        "unseat Apple",
        "Blackberry camera",
        "solid Android phone"
    ],
    "transcript_entity_values": [
        "about 100 bucks",
        "a ton",
        "3.0",
        "2017",
        "Kindle",
        "the iPhone 7",
        "7520",
        "half",
        "about 100",
        "the Galaxy S8",
        "Samsung",
        "almost $200",
        "549",
        "Priv",
        "Apple",
        "Hub",
        "Moto Z Play",
        "four",
        "Google Pixel",
        "Mobile",
        "Android Central",
        "Pixel",
        "Quick Charge",
        "a few minutes",
        "the Blackberry Key One",
        "first",
        "One",
        "Mobile Facebook",
        "Michael",
        "Google",
        "two",
        "180 grams",
        "a decade ago",
        "the Blackberry Hub",
        "second",
        "six hours",
        "eight years",
        "Blackberry",
        "Samsung Galaxy S8",
        "my 12 days",
        "one",
        "Android",
        "YouTube"
    ],
    "transcript_entity_types": [
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "GPE",
        "EVENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "EVENT",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "FAC",
        "ORDINAL",
        "TIME",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE"
    ],
    "vector": [
        -0.10277701169252396,
        -0.033856313675642014,
        0.035482700914144516,
        -0.07619964331388474,
        -0.0743427649140358,
        -0.004503436386585236,
        -0.013090049847960472,
        -0.006810583174228668,
        -0.05969315767288208,
        0.010892839170992374,
        0.054960012435913086,
        0.15609879791736603,
        0.09974109381437302,
        -0.0241197869181633,
        0.015198085457086563,
        0.03526435047388077,
        0.09805335104465485,
        -0.03942584618926048,
        -0.02980874851346016,
        0.01876216195523739,
        -0.03382459655404091,
        -0.06837420165538788,
        0.08771008253097534,
        -0.02516031824052334,
        0.02100202813744545,
        -0.020085500553250313,
        -0.023137908428907394,
        0.02259998396039009,
        -0.04061106964945793,
        -0.006709638051688671,
        -0.03417282551527023,
        0.10260925441980362,
        0.06366303563117981,
        0.02308736741542816,
        -0.09930469840765,
        -0.05677853152155876,
        0.034336257725954056,
        0.05355307087302208,
        -0.02918759360909462,
        -0.026811107993125916,
        -0.08581884950399399,
        -0.028648898005485535,
        0.025036891922354698,
        0.11644994467496872,
        0.06554730236530304,
        0.007784885820001364,
        0.023544423282146454,
        -0.006437073927372694,
        -0.04232480749487877,
        -0.02473563514649868,
        -0.010380714200437069,
        -0.006164128892123699,
        0.02273956872522831,
        -0.027705280110239983,
        -0.08237853646278381,
        0.06290233135223389,
        0.006232142448425293,
        0.0383368618786335,
        0.07935760915279388,
        0.024043956771492958,
        0.001636435859836638,
        0.02055714838206768,
        -0.04152876138687134,
        -0.052951160818338394,
        0.02392308972775936,
        0.042392682284116745,
        -0.052458830177783966,
        -0.0978391021490097,
        0.029725128784775734,
        -0.014948410913348198,
        0.0653398409485817,
        -0.06459465622901917,
        0.004624822176992893,
        -0.039401087909936905,
        -0.06966883689165115,
        0.07296252995729446,
        0.004309576470404863,
        -0.013148818165063858,
        0.00681098410859704,
        0.031091824173927307,
        -0.01692691631615162,
        -0.04207027330994606,
        0.025311367586255074,
        -0.036744989454746246,
        0.0628889873623848,
        -0.00019834576232824475,
        0.008660770021378994,
        0.08048900216817856,
        -0.11083181202411652,
        0.045272424817085266,
        0.0332113653421402,
        0.10061933100223541,
        -0.026653731241822243,
        -0.005834149196743965,
        -0.006266054697334766,
        0.03336554393172264,
        -0.020894730463624,
        -0.042735714465379715,
        -0.06348522007465363,
        -0.0055001722648739815,
        0.07960548996925354,
        0.04863857105374336,
        -0.03896888718008995,
        -0.09257867187261581,
        0.0311451256275177,
        -0.035133056342601776,
        0.031601812690496445,
        -0.014465604908764362,
        0.0018218568293377757,
        0.011519498191773891,
        0.025510922074317932,
        0.026842353865504265,
        -0.058041270822286606,
        -0.012190140783786774,
        -0.06043587252497673,
        0.00892005953937769,
        0.009686015546321869,
        0.10967803001403809,
        0.0789896622300148,
        0.051537808030843735,
        -0.014778414741158485,
        0.042266055941581726,
        -0.034329354763031006,
        -0.08739399164915085,
        -0.06411265581846237,
        0.0478232316672802,
        -0.02153705060482025,
        6.264500330383799e-33,
        -0.06684017181396484,
        0.0904664695262909,
        -0.08171314746141434,
        0.013072306290268898,
        -0.08842909336090088,
        0.05779590457677841,
        -0.026005413383245468,
        0.03227610141038895,
        -0.011676907539367676,
        -0.04282327741384506,
        -0.05268606171011925,
        -0.003645082702860236,
        -0.07299870997667313,
        -0.0492260567843914,
        0.05323097109794617,
        -0.10453808307647705,
        -0.045194778591394424,
        0.012109673582017422,
        0.010942227207124233,
        -0.04096733406186104,
        0.0015137058217078447,
        -0.05703774467110634,
        0.0075696553103625774,
        -0.0005738645559176803,
        0.008288752287626266,
        0.044539958238601685,
        0.06290362775325775,
        -0.010947635397315025,
        0.07235150784254074,
        0.0115132387727499,
        -0.037021901458501816,
        0.01973618194460869,
        -0.014801349490880966,
        -0.03861460089683533,
        -0.02693117782473564,
        -0.0038004436064511538,
        -0.016227634623646736,
        -0.05656637251377106,
        -0.003070409409701824,
        -0.11570852249860764,
        -0.08837634325027466,
        -0.004259897395968437,
        -0.03848325088620186,
        0.011897152289748192,
        0.011451792903244495,
        -0.05981745570898056,
        0.016035594046115875,
        0.04152928292751312,
        0.02562430314719677,
        -0.05079119652509689,
        -0.02430018037557602,
        -0.03494896739721298,
        0.009811317548155785,
        0.014883764088153839,
        -0.060038674622774124,
        0.0076772128231823444,
        0.0362611822783947,
        0.031122691929340363,
        0.0721370205283165,
        0.03190334141254425,
        -0.008656661957502365,
        0.02990756556391716,
        0.0025879093445837498,
        0.025184230878949165,
        0.0007469223928637803,
        0.057700015604496,
        0.018951822072267532,
        0.02898462489247322,
        -0.01960175298154354,
        0.06782004982233047,
        0.08021201938390732,
        -0.062715083360672,
        -0.017732035368680954,
        -0.030018175020813942,
        -0.04378115385770798,
        0.0332053042948246,
        0.02844938077032566,
        -0.030318796634674072,
        -0.05297490954399109,
        -0.05356425791978836,
        -0.06462862342596054,
        0.02804035134613514,
        0.03420710191130638,
        0.0154626639559865,
        -0.026380930095911026,
        0.03426578640937805,
        -0.03383303061127663,
        -0.11228330433368683,
        0.034984346479177475,
        0.09682103246450424,
        -0.03247828409075737,
        0.021526426076889038,
        -0.06901583820581436,
        0.04936358332633972,
        0.024974729865789413,
        -5.969476962266329e-33,
        -0.06527852267026901,
        -0.07784587144851685,
        0.01626632548868656,
        0.0032560713589191437,
        -0.042913977056741714,
        -0.023876408115029335,
        -0.07886845618486404,
        -0.039249811321496964,
        -0.008210532367229462,
        -0.017506297677755356,
        -0.047349750995635986,
        -0.006345347501337528,
        0.04613706097006798,
        -0.09148917347192764,
        -0.02420402131974697,
        -0.023149006068706512,
        0.005022109020501375,
        -0.071073979139328,
        0.05100343003869057,
        0.019706351682543755,
        -0.06079947575926781,
        0.05133473500609398,
        -0.03335409238934517,
        0.12295518815517426,
        -0.020678037777543068,
        0.040604110807180405,
        -0.02545231208205223,
        0.00748377526178956,
        0.0834481343626976,
        -0.0003645979450084269,
        0.08079967647790909,
        0.016263751313090324,
        -0.0010384013876318932,
        0.032820653170347214,
        0.0468229316174984,
        0.029412366449832916,
        0.06130395084619522,
        0.010783481411635876,
        0.06369181722402573,
        0.05100762099027634,
        0.06935717165470123,
        0.027483249083161354,
        -0.00017695690621621907,
        -0.01534105185419321,
        0.05100065469741821,
        -0.022837087512016296,
        0.024052631109952927,
        -0.01744159497320652,
        -0.020079661160707474,
        0.07428283989429474,
        0.08276073634624481,
        0.0016371876699849963,
        -0.059725072234869,
        -0.005391201004385948,
        -0.06318193674087524,
        -0.01290957536548376,
        -0.0157307181507349,
        -0.035279057919979095,
        0.07445359975099564,
        -0.04981096088886261,
        0.06656409800052643,
        -0.011261112056672573,
        0.001269799773581326,
        0.02433326095342636,
        -0.027591407299041748,
        0.04278070479631424,
        0.11659543216228485,
        0.01802823320031166,
        -0.004169481340795755,
        0.012259556911885738,
        0.0018530545057728887,
        -0.03437606617808342,
        -0.004225027281790972,
        -0.017619628459215164,
        0.06750108301639557,
        0.06191111356019974,
        -0.052943143993616104,
        -0.01812288723886013,
        -0.0848846286535263,
        -0.09692256897687912,
        0.04847633093595505,
        0.04498928785324097,
        0.017048973590135574,
        -0.032892752438783646,
        0.030770648270845413,
        -0.0475008524954319,
        0.024367647245526314,
        0.03144148737192154,
        -0.07402747869491577,
        0.0411326065659523,
        -0.01891707070171833,
        -0.00885095540434122,
        -0.1054002195596695,
        0.023001285269856453,
        0.013904903084039688,
        -5.013606596548925e-08,
        0.08491328358650208,
        0.10309907793998718,
        0.07342178374528885,
        -0.05301330238580704,
        -0.02862963080406189,
        -0.10998643934726715,
        0.008874692022800446,
        0.04313009977340698,
        0.11346173286437988,
        -0.004513215273618698,
        -0.041621170938014984,
        -0.11160294711589813,
        -0.09464424848556519,
        0.013322343118488789,
        0.017993228510022163,
        0.060627877712249756,
        -0.031029244884848595,
        0.011188769713044167,
        -0.0007643134449608624,
        0.054073259234428406,
        0.04394468665122986,
        0.03837842494249344,
        0.003592453431338072,
        -0.047352686524391174,
        -0.04896114766597748,
        -0.010627112351357937,
        -0.06863155215978622,
        0.05040130764245987,
        0.05145507678389549,
        -0.04576585069298744,
        0.09463779628276825,
        0.023144908249378204,
        0.09703990072011948,
        -0.1055259183049202,
        -0.11603172868490219,
        -0.008018303662538528,
        0.07744763046503067,
        -0.031487297266721725,
        0.08612803369760513,
        0.010228745639324188,
        -0.03274491801857948,
        -0.12695159018039703,
        -0.07389450073242188,
        0.001500540878623724,
        -0.09850922226905823,
        -0.05454690381884575,
        0.027347415685653687,
        -0.019691545516252518,
        -0.020937956869602203,
        0.09001225978136063,
        -0.003162670647725463,
        -0.005461036693304777,
        0.00018542619363870472,
        -0.031930338591337204,
        0.052645012736320496,
        0.028192326426506042,
        0.05418625846505165,
        -0.0016786649357527494,
        0.0685557946562767,
        -0.05257425457239151,
        0.019602147862315178,
        -0.08956442773342133,
        0.00745324045419693,
        0.022988397628068924
    ]
}