{
    "id": "hYycQhSnvmU",
    "title": "This cost more than my car… - Osaki Platinum Ai Xrest 4D+",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-10-09T17:44:44Z",
    "video_url": "https://www.youtube.com/watch?v=hYycQhSnvmU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "massage chair",
        "osaki",
        "xrest",
        "4d+",
        "expensive",
        "luxury",
        "cool",
        "chair",
        "massage"
    ],
    "views": 331391,
    "likes": 10194,
    "comments_count": 615,
    "description": "Get deep discounts on Nextorage SSDs and Memory at Newegg. Check out some products below!  Nextorage Internal SSDs:  Nextorage Portable SSDs:  Nextorage Micro SD Cards:   Purchases made through some store links may provide some compensation to Linus Media Group.  Dennis loves the finer things in life, but massages are definitely near the top, so when Osaki offered to send their Platinum XRest 4D+ Massage chair for us to check out, he knew he had to host. With help from Colton, will they be able to get it working without breaking it? Will Alex Clarke be impressed by its built-in speakers? Find out in today's episode of ShortCircuit!  Buy an Osaki Platinum XRest 4D+ Massage Chair and use code CIRCUITSPECIAL for $5,000 off:   Buy an Osaki OP-4D Master Massage Chair and use code CIRCUITSPECIAL for $5,000 off:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 We've got something big planned... 0:35 Unboxing 1:31 Setup 2:45 Sponsor - Newegg 3:14 Colton's first massage ft. many warnings 5:30 Massager features, colours, and size 7:49 Dennis' massage  9:30 Health Pro pain sensor 11:13 Built-in speakers 11:48 App features 12:15 Alex Clark shares his thoughts on speakers and pricing 14:03 Overall thoughts 14:27 Outro",
    "description_links": [
        "https://lmg.gg/neweggnextoragessd",
        "https://lmg.gg/neweggnextorageportablessd",
        "https://lmg.gg/neweggnextoragemicrosd",
        "https://lmg.gg/xrest4d",
        "https://lmg.gg/op4dmaster",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Today we're going to unbox this giant massage chair from Osaki with our favorite Colton. This is Xrest 4D and from this picture you can tell like it's a huge chair with a little cover on top. I've never seen a chair like this before which is kind of interesting so let's unbox it. Dennis do you know how much this thing costs? I have no idea. Dollars. I am so ready to look at this thing it's gonna be sick. That's more than my car. Your car doesn't give you massages though. Colton this is almost taller than you. Legitimately yes. I had to stand on my tippy toes for the intro. Disclaimer I've never had a massage and I've never used a massage chair. You never had a massage? I don't like people touching me. When we go back to Taiwan actually my parents have a massage chair it's very basic and this is probably the first modern massage chair I'll try on because we did try a massage gaming chair last year and this one is literally just a for real massage chair. Oh my god. This thing's nuts. Oh this thing looks sick. Look at this helmet. And here's another small box. Foot rest. Oh get careful careful. How much does this weigh? You just need to have some friends at home. Looks like a box of chocolates. Reveal. It's a manual. Oh you got tools. Nice. If you don't have the lttstore.com screwdriver you get this one. Before use we need to install the helmet part the hood. So if you want to look at this yeah so there's two connectors one of them goes here and then one of them goes to the speaker that I've got here. This is not speakers the action is just an indication light. Oh my gosh are these left and right? Okay maybe that's for this one. Yes that's left here in Chinese. What does that say? Left. You just saved this video. Now it makes sense. Hey let's go. There you go. Perfect easy. So now you have this little hood you can hide yourself inside. Foot rest installation connect the air connector A2. This is A2 and this is B1. Yeah oh good. Okay now we just need to do step two. Make sure there's enough space. We're good. Make sure there is no person pet or other object close to the product. Make sure there's no foreign objects like we disconnected everything everything should be good. So it's very straightforward very easy installation. Oh it's on now. Oh my gosh. It's activating. In the menu it actually says make sure the massage wheels are retracted. So that's just it. And before we sit in this chair we need to let you know some message from our sponsor. Okay but before we start the massage session I got to tell a little secret to save money. Newegg our sponsor that team up with NextStorage and now does deep deep discounts on their storage solutions. I'm talking about more than 60% off. 6-0% off on internal SSDs and up to 50% off micro SD cards. So if you're looking to upgrade your storage check out NextStorage products on sale at Newegg down below. Go save yourself some money. Let me sit down. Come on sit down. All right am I supposed to take my shoes off? Yeah. Sorry gosh. How do you feel? My feet feel very comfortable. My back is comfortable now that I'm moving into it. Your arms go there. Oh check the following cautions before starting the massage chair. Stop. Do not leave infants and pets around the massage chair. Dennis get away from the chair. Do not wear any accessories necklets bracelet ring or watch. No ring. What? Okay goodbye. Please remove the head pad and auxiliary pad before using the massage chair. There is a magnet attached to the upper part for fixing the pad so those have medical devices in their body. Should consult a doctor before using the massage chair. Okay I should be okay. Before starting your massage please all long hair people make sure that your hair won't be and won't get involved in the roller. Okay. Oh the whole thing is moving. The whole thing is moving. What if it kills me? Oh things are happening my friends. Colton it's supposed to be relaxed. It's going up my back though. Shoulder scanning. Relax. Oh no. What if it crushes my shoulders? This is pretty cool. Okay shoulder scanning. Do you know I have shoulders? Kate we're good. So now it'll let me adjust a little bit. If shoulder position is incorrect use the up or down arrows. It didn't let me press anything. Oh my feet. It tickles so much. So there are pads here both you're on your calf and your feet. It's gonna strangle me. This is my first time seeing a massager comes with this shoulder massaging over the body. You just just the back or the foot or your lower body but this is kind of cool. This goes for 13 minutes? It's got rollers against the bottom of your feet? It takes a second to get used to. What's happening? I'm not doing anything. Colton you're going to the space. What's happening? Guys this is crazy. If I wasn't so filled with anxiety my entire life maybe. Looks really nice. It is. There's a lot of pressure points happening and I think that's a good thing for massages from what I know. This is a positive experience. Dennis you need to try this. The cool thing about this chair apparently is their shoulder massage they simulate the hand massage movement like this. They have 20 air bags in each of them and you can adjust them individually. So it looks kind of like a hand. So this is basically like your thumb and your four fingers like this. And if you keep pushing now there are two massage balls here to go up and down from your lower back to your upper back up to your shoulder. And you put your arm in this little pocket and they have air tighten pad so tighten your arm. So you have two pads here by your calf and little small motion massage balls here in the back here as well. Again more pad down here to your feet and that's pretty much it. So this massage chair comes with three different colors taupe brown and black and this one I believe is brown. So obviously this machine is huge but compared to other bigger massager is it's sizable but it's not huge. It has 16 auto massage program that's the choice health pro and signature all the way to evening. They also have six manual program that can go to your shoulder upper back lower back and full back with four different technique. 4D rolling for your neck 4D rolling for your shoulder and 4D kneading for your neck and 4D shiatsu for your shoulder. Oh one thing really cool is so when I close the this dome you can probably see the light will turn on. You see it? The red light will turn on. Apparently it's a light therapy. They have wireless charging here and also a USB charging here. The other thing here is negative oxygen ion. What is negative oxygen ion? So I could look it up on their website. It says assist in relieving stress and boosting energy. A negative air ionization therapy. Kind of cool but I have to try it to know. So it's basically you press this button and will come out from here. It's pretty minimal but I don't smell anything really but I don't think I can smell any the ion. Okay let's see what I want. They have auto neck lower back manual advanced air position. Of course I'm gonna choose advanced. Once you go to auto they have 16 options. If you don't know what to do with your body they just set up a menu for you. Master choice helpful pro signature sleeping stretch spine mobile mode relax Chinese Chinese. I'm going to try Chinese. Shoulder scanning. Literally start from my butt. I don't know. Yeah I know it scared me. Why's is starting on my butt? It's just checking. Dennis how often do you get massages? Once two months. I still use my shoulder massage at home. Oh this thing is coming now. It's starting from my foot. Oh now it's doing a vibrating thing. The vibrating was pretty cool. I have to say the shoulder one is really nice. Okay let's try different mode. One thing caught my eyes in the master's choice. Who can be more master than me? Oh I like this one more than the Chinese mode. Oh that's the spot. On the little screen they show you where they are working on. I'm gonna try the manual just to adjust it every option by myself and see how it works out. This time let's try the individual options. Oh wow. You can also choose the focus. You can change the strength, intensity, speed. The screen is actually very helpful because you're not gonna be able to see it from here right? You are like just look at look at here. Either use this screen or you can use the app which we're gonna show you in a bit. Yes this is detachable. There are so many settings. Once you start using you kind of get used to it but it does have a lot of options which is good. So one cool option they have here is the health pro. Place lean back and hold the body against the pain sensor to make sure the testing points are covered. Press the button to start detection. Oh it's scanning and see how's your fatigue up level and muscle tension level. You can see on the screen it's red. It's interesting how they can sensor it. How intense your muscle is because by pushing it I guess it's done the scanning. Now look at oh my god fatigue level maximum muscle tension level maximum heavy heavy oh no fatigue level light what it just what I even get to see it it just went away so fast did you see it a little bit that was too fast. Oh my god actually fallen asleep. See you in two minutes. What that's it? I mean you don't even want to put me down? They end it and just leave me like this? How do I get out? What? We actually email the brand like we wonder how come it doesn't go back to normal so people can get out of the seat. It's actually a pretty good idea for some people. They said all chairs stay in the position when the massage ends so it doesn't startle people who want to stay asleep. We have left it like this for all chairs as majority of people want it that way. So if you finish your massage they just leave you at peace. You can sleep here until you wake up or you can end it just turning off. They also have two speakers in the back so when you are getting massage you can play whatever music you want to listen to. For me personally I love to listen to you hear it's coming from here with the dome close it's like a little mini concert in here. Wow it's a totally different experience. Wow look at the feeling. I can turn on the heat on my lower back and the feet on the app they have smart speaker function you have to connect to the bluetooth you can connect to the chair to wi-fi. We tried three four different phones and we couldn't make it work. What this is my third attempt. It stressed me out before I get to distress. Is that part of marketing otherwise you can use voice command turning on turning off pause stop massage continue zero gravity on and all kind of command come on Alex let's try it so you can see the two hands here right shoulder scanning you can feel two balls moving from the bottom going up you look really tense like relaxed why would I be relaxed when it's just not a nice experience just wait just wait because I've been in a lot of fancy chairs and fancy cars and they're way more comfortable than this and they also have massagers really and they also have like a car I don't I really doubt that okay how about now the the shoulder massaging like it's fine but I'm uncomfortable like it's just not a good chair to begin with I need like lumbar adjustment I need a different seat cushion like it isn't comfy enough you can adjust the position right in here it's just not wide enough it's like what here I don't get it the bolsters I keep do you know what the bolster of a chair is Dennis no it's like the side bits that clamp you in I actually I I didn't feel that I was really focused on massaging okay now how about shoulder shoulder shoulder okay that feels kind of good so for the speakers we have almost no low-end extension and probably most egregiously the entire image is behind you you have this really cool thing that comes up above your head where you could either put speakers or bounce the sound off of for quite an immersive experience and they completely missed the mark on all regards for that so instead you just have what sounds like a couple of speakers behind you that are not particularly good and for the price of this thing you should be able to have higher sound quality but Alex I feel you're just too spoiled it's a massage chair it's not that it's a fifteen thousand dollar massage chair Dennis not everything needs to be perfect that's pretty much about this massage chair for me I'm not 100% sure if I want a fifteen thousand dollars massage chair for myself because it's quite a lot of money it's more than my car if you want a massage chair like this with two hands at home give you a free massage all the time we got five thousand dollars off coupon code with circuit special at the link below you can get one for yourself and now I'm gonna go back to my massage you still here",
    "transcript_keywords": [
        "massage chair",
        "massage",
        "chair",
        "Shoulder",
        "back",
        "thing",
        "giant massage chair",
        "good",
        "massage chair Dennis",
        "shoulder massage",
        "cool",
        "Make",
        "Osaki",
        "Chinese",
        "Shoulder scanning",
        "Dennis",
        "kind",
        "shoulder shoulder shoulder",
        "shoulder shoulder",
        "lower back"
    ],
    "transcript_entity_values": [
        "6",
        "Chinese Chinese",
        "100%",
        "last year",
        "three",
        "fifteen thousand dollar",
        "One",
        "one",
        "USB",
        "Newegg",
        "20",
        "micro SD",
        "Alex",
        "up to 50%",
        "Today",
        "Colton",
        "more than 60%",
        "13 minutes",
        "second",
        "A2",
        "Colton",
        "Dennis",
        "Kate",
        "Colton",
        "two minutes",
        "third",
        "first",
        "Chinese",
        "16",
        "two",
        "four",
        "4D",
        "two months",
        "Taiwan",
        "Xrest",
        "B1",
        "4D",
        "six",
        "fifteen thousand dollars",
        "NextStorage",
        "zero",
        "five thousand dollars"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "NORP",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "DATE",
        "GPE",
        "PERCENT",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY"
    ],
    "vector": [
        -0.06449376046657562,
        -0.020169954746961594,
        0.009886081330478191,
        -0.02885562554001808,
        -0.02062721736729145,
        -0.028849216178059578,
        0.013910050503909588,
        0.030431972816586494,
        -0.05538385733962059,
        -0.006170919630676508,
        0.05764538794755936,
        0.048949725925922394,
        0.016529768705368042,
        -0.002981801051646471,
        0.05515243113040924,
        0.02280248887836933,
        0.12920710444450378,
        0.0051099262200295925,
        -0.009397411718964577,
        0.07946034520864487,
        0.03529313579201698,
        -0.0465775690972805,
        2.3113964289223077e-06,
        0.008160876110196114,
        0.015541727654635906,
        0.0017473965417593718,
        -0.021163882687687874,
        -0.059567179530858994,
        -0.02708149328827858,
        0.014633400365710258,
        -0.012180866673588753,
        0.00886041484773159,
        0.012493312358856201,
        -0.034305039793252945,
        0.031492624431848526,
        -0.01100935135036707,
        0.07218693196773529,
        -0.06936874985694885,
        -0.16865377128124237,
        -0.05888191610574722,
        -0.06921695172786713,
        0.006339798215776682,
        -0.026303570717573166,
        -0.013930447399616241,
        -0.005765813868492842,
        -0.021253926679491997,
        -0.0003294324560556561,
        -0.08556623011827469,
        -0.01793147251009941,
        -0.026358211413025856,
        -0.026681095361709595,
        -0.07877781987190247,
        0.1060381531715393,
        -0.03904241696000099,
        -0.07765122503042221,
        -0.005962935276329517,
        -0.004754722584038973,
        0.013392582535743713,
        -0.03439359739422798,
        0.06698200851678848,
        0.10197675973176956,
        -0.13748577237129211,
        0.024823473766446114,
        0.05069589987397194,
        0.043466269969940186,
        -0.005012995097786188,
        -0.04328053444623947,
        0.0014400372747331858,
        -0.06245129555463791,
        -0.01943815127015114,
        0.06047533079981804,
        -0.026149900630116463,
        0.07470928132534027,
        0.02298283576965332,
        0.06594022363424301,
        0.011117808520793915,
        0.1054704412817955,
        -0.04585752636194229,
        0.06095946952700615,
        -0.02050567977130413,
        0.0298896636813879,
        0.010364610701799393,
        -0.06039118021726608,
        -0.04519582539796829,
        0.034575387835502625,
        0.007604024838656187,
        -0.015337107703089714,
        -0.016217537224292755,
        -0.07788830995559692,
        -0.007985351607203484,
        0.06988312304019928,
        -0.016899069771170616,
        -0.05820221081376076,
        -0.05321645736694336,
        -0.03253789618611336,
        -0.014374466612935066,
        -0.01726013608276844,
        -0.012405226938426495,
        -0.03984525799751282,
        0.054453421384096146,
        0.0150463180616498,
        0.08595163375139236,
        0.02058330550789833,
        -0.09537390619516373,
        -0.1038830429315567,
        -0.06876001507043839,
        0.05558513477444649,
        0.07630813866853714,
        -0.069544218480587,
        0.020234424620866776,
        -0.033317144960165024,
        -0.018406080082058907,
        -0.03019934520125389,
        0.06179190054535866,
        -0.04383867606520653,
        0.07965120673179626,
        -0.061668504029512405,
        0.0542287677526474,
        0.0974244698882103,
        -0.011941816657781601,
        -0.023612916469573975,
        -0.06529206037521362,
        7.040053606033325e-05,
        0.09836781769990921,
        -0.011986169964075089,
        0.044439367949962616,
        -0.04856712371110916,
        9.546437211525439e-33,
        -0.011608051136136055,
        0.09837407618761063,
        -0.042136482894420624,
        -0.06910483539104462,
        -0.024526510387659073,
        -0.04325460270047188,
        0.01636028103530407,
        0.04731287062168121,
        0.020823953673243523,
        0.03748387098312378,
        -0.026824867352843285,
        0.011532414704561234,
        0.008003192953765392,
        -0.055252887308597565,
        -0.015432512387633324,
        -0.08313031494617462,
        -0.04953267425298691,
        0.011715400964021683,
        0.006962927524000406,
        -0.05394978076219559,
        0.04697755351662636,
        0.0016018745955079794,
        0.0026138490065932274,
        0.01349995844066143,
        0.048604536801576614,
        0.030696678906679153,
        0.024476472288370132,
        -0.07886320352554321,
        0.09606264531612396,
        0.03974837064743042,
        -0.13900122046470642,
        -0.03385896980762482,
        -0.02381223626434803,
        -0.01420436892658472,
        0.00838687364012003,
        0.06466132402420044,
        -0.058955151587724686,
        -0.053017545491456985,
        3.922876203432679e-05,
        -0.06907541304826736,
        -0.055538855493068695,
        0.019397005438804626,
        -0.037965063005685806,
        -0.003541036043316126,
        -0.010126075707376003,
        -0.03908057138323784,
        0.054831888526678085,
        0.04929853975772858,
        0.04339289665222168,
        -0.041340675204992294,
        -0.12217141687870026,
        0.06066875904798508,
        -0.0779958963394165,
        0.039126649498939514,
        0.0030738171190023422,
        -0.06287304311990738,
        0.04593217745423317,
        -0.020052999258041382,
        0.11392603814601898,
        0.007813147269189358,
        0.01517883874475956,
        -0.03823253512382507,
        0.029574239626526833,
        -0.058577392250299454,
        -0.0864739790558815,
        0.08136125653982162,
        0.0242459699511528,
        -0.07653478533029556,
        0.005453797522932291,
        -0.007252514827996492,
        0.021208547055721283,
        -0.03127571567893028,
        0.00018707936396822333,
        -0.0016279079718515277,
        0.013779443688690662,
        0.023051336407661438,
        0.013141456060111523,
        0.020069828256964684,
        0.016556862741708755,
        0.001126043382100761,
        -0.05813809111714363,
        0.012135748751461506,
        0.0141889164224267,
        0.12825509905815125,
        0.0793040320277214,
        0.07483267784118652,
        0.05845746770501137,
        -0.043416015803813934,
        -0.03543408215045929,
        0.04827263578772545,
        0.03286440297961235,
        -0.038169439882040024,
        -0.0009920112788677216,
        0.017565598711371422,
        0.01892934925854206,
        -9.299750171113781e-33,
        0.0075104027055203915,
        0.03951480984687805,
        -0.0037846395280212164,
        -0.054933056235313416,
        -0.009059973061084747,
        0.006073986645787954,
        -0.06504557281732559,
        0.02022327296435833,
        -0.02496309019625187,
        0.012380730360746384,
        -0.01605888269841671,
        -0.01804104633629322,
        -0.020491231232881546,
        0.002617018064484,
        -0.03119826689362526,
        -0.011874298565089703,
        0.04957104101777077,
        -0.03927851468324661,
        0.08107852935791016,
        0.02426084876060486,
        0.06531902402639389,
        0.1501307189464569,
        0.04889770969748497,
        0.053193721920251846,
        -0.006348139140754938,
        0.01562589406967163,
        0.01027438323944807,
        0.001460763276554644,
        -0.049798619002103806,
        0.020468944683670998,
        -0.011796906590461731,
        -0.10022026300430298,
        -0.05771749094128609,
        0.058022547513246536,
        0.035831376910209656,
        -0.003548191860318184,
        0.018964719027280807,
        0.05725987255573273,
        -0.06286033987998962,
        0.022522490471601486,
        0.024996284395456314,
        -0.02904636599123478,
        -0.013459873385727406,
        0.07076305896043777,
        0.05178123340010643,
        -0.069436214864254,
        -0.08965407311916351,
        0.005615920294076204,
        0.011239510960876942,
        0.0011882929829880595,
        0.05646807700395584,
        -0.06543336808681488,
        0.017189625650644302,
        -0.037207938730716705,
        -0.06345513463020325,
        -0.05272390693426132,
        0.020739518105983734,
        -0.026186522096395493,
        -0.11903460323810577,
        0.010967304930090904,
        0.02706826664507389,
        -0.04814467206597328,
        0.044433850795030594,
        -0.06987379491329193,
        0.01665855199098587,
        -0.06252017617225647,
        0.014405624009668827,
        0.00037918658927083015,
        -0.020735913887619972,
        0.029265278950333595,
        -0.04523351415991783,
        -0.0026036903727799654,
        -0.019481370225548744,
        -0.028815288096666336,
        -0.02795494720339775,
        0.06933517754077911,
        0.03598538786172867,
        -0.04976942390203476,
        0.07069763541221619,
        -0.07542053610086441,
        -0.0791497454047203,
        0.026471389457583427,
        0.1020951122045517,
        -0.020646145567297935,
        0.057293906807899475,
        0.0305526964366436,
        0.0901927575469017,
        -0.007468984462320805,
        -0.05707547068595886,
        0.020362427458167076,
        -0.058023035526275635,
        0.1244278997182846,
        0.0807986631989479,
        0.02613900601863861,
        -0.00088751275325194,
        -5.492504939752507e-08,
        -0.01643913798034191,
        0.04421224072575569,
        -0.009114384651184082,
        0.04056412726640701,
        -0.027340691536664963,
        -0.11222799122333527,
        -0.021456144750118256,
        -0.005211827345192432,
        -0.017435479909181595,
        0.020101595669984818,
        0.020457027480006218,
        -0.05139639601111412,
        0.023124104365706444,
        -0.02722475305199623,
        -0.013189476914703846,
        0.045170944184064865,
        0.01755743846297264,
        0.08526784926652908,
        -0.06576704978942871,
        -0.043954771012067795,
        0.07065267860889435,
        0.025983598083257675,
        0.0360666885972023,
        -0.021002886816859245,
        -0.009610293433070183,
        0.022293733432888985,
        0.04429161548614502,
        0.032993484288454056,
        0.06448669731616974,
        -0.07671870291233063,
        -0.08345609903335571,
        -0.04574637487530708,
        -0.020841464400291443,
        0.042391128838062286,
        0.04859616979956627,
        -0.056935276836156845,
        -0.10777125507593155,
        0.028866523876786232,
        0.0031549783889204264,
        0.03244229406118393,
        -0.0502035915851593,
        -0.04324473813176155,
        -0.0739637240767479,
        0.05501769483089447,
        0.014868599362671375,
        -0.030865365639328957,
        -0.06263604760169983,
        -0.09322826564311981,
        -0.017009906470775604,
        0.12518228590488434,
        -0.015570985153317451,
        -0.056119922548532486,
        0.0027122332248836756,
        0.04677490144968033,
        0.07204390317201614,
        0.005432328209280968,
        0.01678464561700821,
        0.05597217008471489,
        -0.09338513016700745,
        0.1071072667837143,
        0.007371504791080952,
        -0.07554062455892563,
        -0.056412819772958755,
        0.07993950694799423
    ]
}