{
    "id": "hZf2rQQ0TPE",
    "title": "Rare Macintosh TV - Failing with Style - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-03-25T18:00:14Z",
    "video_url": "https://www.youtube.com/watch?v=hZf2rQQ0TPE",
    "category": "Science & Technology",
    "tags": [
        "Rare Macintosh TV Failure - Krazy Ken's Tech Talk",
        "Rare Mac",
        "Macintosh TV",
        "Motorola 68K",
        "Vintage Mac",
        "Mac OS",
        "Apple",
        "Apple Computer",
        "Mac TV",
        "Apple TV",
        "Steve Jobs",
        "System 7",
        "RCA",
        "VCR",
        "MARCHintosh",
        "Krazy Ken's Tech Talk",
        "Tech",
        "Computer",
        "Computer Clan",
        "Krazy Ken",
        "Macintosh LC 520",
        "Interactive Television",
        "Apple ITV",
        "ITV",
        "ITV Prototype",
        "Apple Prototype"
    ],
    "views": 119955,
    "likes": 4941,
    "comments_count": 360,
    "description": "The Macintosh TV is another rare gem from the Apple world which has earned its title as a collector's item. But why didn't it succeed when it was originally released? (Hey, it still looks good in black. At least it failed with style.)  Check out another rare Mac (the TAM)   Download our epic wallpapers   5 Rare Apple Prototypes    Support our channel and get cool stuff   Subscribe and listen to our podcast   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Rare Macintosh TV - Failing with Style - Krazy Ken's Tech Talk  Special thanks to Steve from Mac84 for helping with this episode! Check out his retro Apple channel here: @Mac84   Special thanks to Brian for selling me this Macintosh TV, and including a free Mystic board! Check out his Apple repair and training services here:    Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #MARCHintosh #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtu.be/JUGhZqs6AsQ",
        "https://thecomputerclan.com/wallpapers",
        "https://youtu.be/cB4PM4QGcLw",
        "https://Patreon.com/KrazyKen",
        "https://anchor.fm/computerclan",
        "https://subscribe.thecomputerclan.com",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://macnician.com",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "https://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Behold the first black Macintosh computer or as I like to call it the Blackintosh (upbeat synth music) Hey guys, how are you all doing? If you're new here, welcome, my name is Krazy Ken and welcome to #MARCHintosh. The tech month dedicated to retro Apple Macintosh hardware and software. And for my contribution today, we're gonna be diving into a rare Macintosh computer that only sold about 10,000 units The Macintosh TV. So what's so special about this computer. Why did it become rare? Why did it fail? Well, we'll talk about all that stuff and more today. So Apple really, isn't a stranger to the television world. They've done plenty of things with it in regards to products and services such as Apple TV+, the iTunes Store and the Apple TV hardware itself. But all of that stuff was from the two thousands. Apple was actually tinkering with television ideas as far back as the 90s, maybe even earlier I'm not even sure, but I can tell you for sure the Apple Interactive Television box was being developed but that never made it to retail. And we'll cover that rare thing in a future episode. But for today, we'll focus on this guy which actually did make it to retail. So now let's dive into the Mac TV's history. In the fall of 1991, Apple wasn't planning to keep the all-in-one form factor alive. Thankfully Larry Barbera spoke up and investigated ways to create a 10th anniversary Macintosh that's right, not a 20th Anniversary Macintosh a 10th anniversary Macintosh. This resulted in the Mondo project which featured a new all-in-one design inspired by frogdesign's, BigMac concept, ultimately much of the industrial design group at Apple didn't like it. And the project was shelved. But then in the fall of 1992, Apple CEO John Sculley examined the Mackintosh Color Classic a product that Apple was about to release. The screen's too small. He said, make it 14 inches. Oh, and give it a CD-ROM drive, stereo speakers. And hey, can you have it done in six months? Thanks. Yes, enter Eric Xanthopoulos, a Product Design Manager at Apple. Eric thought, where can we get a computer like that? So he picked up the Mondo project and moved it into development. This resulted in a tweet case design, which debuted with the Macintosh LC 520 codenamed Hook in July, 1993. And it was a hit. Now some of you may be thinking, we paid to hear you talk about the Macintosh TV what's it's going on? Well, first of all, no, you didn't pay me to talk about it unless you wanna support my Patreon. And second, this computer is based on the LC 520s new case. So I think it was necessary to cover that brief history. Just take a 520 painted black put an infrared sensor up here shove a tune inside, cripple the performance. Wait, what? And Bob's your uncle! So the Mackintosh TV went on sale in October, 1993 for $2079. And it was primarily marketed toward first time Mac buyers and college students who just wanted the best of both worlds combined into a hybrid computer. But we're getting a little ahead of ourselves. Let's slow down a little bit and observe the design and the features. And frankly, I don't even care what kind of functionality this thing has. I just liked that it's black. Seriously, my favorite part of this design is the black color and this was the first Mac desktop to actually be in black and throughout Apple's history. Only a handful of Mac desktops were sold in black slash space gray. So this is a rare occurrence, but there's one design feature that kind of sticks out. And you could probably already tell the whole computer is beautiful and black, except for the CD drive. Why isn't the CD drive black, but everything else is black. Well, apparently there's a story behind it. And my source is a guy who knows a guy who used to work at Apple. So take this with a grain of salt. Apparently certain people that were working on this computer didn't think it was going to sell very well. And because they already had this part for the CD drive in that color, they thought, okay, we'll just use that because if they have to make a black one that's just gonna increase cost. So they kept it that way. And that was it. They ignored it. You can tell Steve Jobs, wasn't at the company at that time he would've whooped someone's ass . Color choices is side, the design is very curvy which follows the espresso design language that Apple was pushing at the time and for easy access to the motherboard and the hard disk you could pop off the back panel, sometimes their screws in there. Go ahead and take those out. And then you pull on these tabs and the panel pops off. Now let's talk about that display. It's a 14 inch Sony Trinitron running at 640 by 480 resolution with 8-bit color for the computer graphics and 16-bit color for the TV. This Mac also features a built-in microphone, stereo speakers, a two-time CD ROM drive and a 1.44 megabyte floppy drive. But the biggest feature of course is the built-in TV functionality. This was the first Mac with a TV tuner and it was also the first Mac to ship with the remote which is a feature that reoccurred in future Apple products even all the way down into the Intel era with Steve Jobs certain Mac sold with the remote. So you could use the front row feature. The TV tuner was pre-installed on the logic board and an F-type coax connector was accessible on the back. So you could screw in your antenna or whichever device you used for your TV signal. And this Mac also featured RCA jacks. So you could plug in a VCR, game console, etc. Now, this Mac didn't have a ton of horsepower which we'll talk more about later. So it couldn't do TV and computer stuff at the same time, you could either view one or the other. And the way you would do that is you would press a keyboard shortcut. You can assign your own keyboard shortcut, and it would fade out to the TV mode and then fade back into the desktop. However, even though you couldn't see the TV mode while in the Macintosh environment you could at least still hear it. So there's that. You can also use the remote to switch between the TV and desktop. Heck even my modern Sony remote still works with this Mac TV perfectly. And as a little bonus feature you can press Shift-Command-3 while in TV mode and a screenshot of the video will save to your hard disk. So this thing sounds pretty cool, right? What's the problem. We're gonna review the specs quickly. And then the limitations will become more apparent. Let's have a look. The Mackintosh TV used a Motorola 68030 processor clocked at 32 megahertz. It shipped with a 160-megabyte hard disk and five megabytes of RAM, four megabytes built into the motherboard plus one megabyte in the 72-pin SIMM slot. Now you could upgrade the RAM if you want but this computer could only handle eight megabytes maximum. So in effect with the four built into the board you could only install a four megabytes stick into the SIMM slot. For the I/O, we have two Apple desktop bus ports, two serial ports one DB-25 SCSI port, a headphone jack on the front. And again, the F-type connector and the RCA jacks. This Mac shipped with System 7.1 but it could be upgraded to Mac OS 7.6.1 if you'd like. The specs maybe weren't that great for most people especially at the time for an over $2,000 computer. So let's dive into a little more detail. The first big problem is the 68030. Remember how this Mac could only display the TV or the desktop at one time, you couldn't use both simultaneously. And that was primarily due to the 68030 restrictions. If this Mac were equipped with an 040, this feature would be a lot more possible to implement. In addition, despite the processor running at 32 megahertz, the system bus was only clocked at 16. So the processor was fast but because of that slow system, the bus data flowing between the components was overall much slower which brings everything down. So on paper, even though this 32 megahertz computer may look faster than a 25 megahertz Mac, in practice, it was actually slower. Another shortcoming is the RAM limit. This Mac could only address eight megabytes for perspective the Mackintosh classic too which was released two years earlier has a 10-megabyte limit. Another limitation was the lack of an expansion slot. Many other Macs at the time have at least one Processor Direct Slot or PDS, but here's something you couldn't do. Remember how the logic board just slides out. Well, the good news is you can use a mystic board upgrade. The board is the same size it'll slide right in and you can get a 68040 processor and a much higher RAM limit. So you can get more functionality and speed out of a mystic board upgrade. But for your average consumer, especially back then this was not a practical option. It's also worth noting there's no recording functionality. And according to some other old reviews, I read playback wasn't always the smoothest through the coax connection. I can't test that myself with my current equipment. So I'm taking that with a grain of salt but just keep that in mind. Now, if I'm a college student and I see this marketed toward me, I might go, wow, this is awesome. It's two and one, I can save space in my dorm. I don't have to carry as much with me when I move around. On the surface it looks great, but when you dive into it a little bit more it just kinda seems like the Mackintosh TV is a Jack of all trades, but master of none. And that's likely a big reason why it failed and only sold about 10,000 units. But there's always a silver lining. It wasn't a 100% fail. In fact, the TV tuner option was available in future Mac models. And that all started with this computer and the remote was killed off eventually but the remote was still a feature that came with the Mac and you could use it for Front Row. That aside, it was still a pretty big flop but because of its limited supply, unique features and a really awesome black color it's really turned into a cool collector's item now. So let me know what you think about the Macintosh TV and feel free to subscribe for more tech episodes coming all the time from rhe Computer Clan and feel free to share this episode on social media with #MARCHintosh and more importantly feel free to share your own retro Mac stuff with that hashtag as well. And if you'd like to help fund the future of The Computer Clan, plus get some awesome perks along the way, feel free to pledge to my Patreon. Thanks in advance for your support. And hey, if you like this episode, you know what to do. Thanks for sticking with me, catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Mac",
        "Apple",
        "Macintosh",
        "computer",
        "Apple Macintosh hardware",
        "black Macintosh computer",
        "Blackintosh Hey guys",
        "retro Apple Macintosh",
        "Macintosh computer",
        "Apple Macintosh",
        "anniversary Macintosh",
        "rare Macintosh computer",
        "black",
        "Blackintosh Hey",
        "Apple Interactive Television",
        "design",
        "Krazy Ken",
        "Apple CEO John",
        "Color",
        "time"
    ],
    "transcript_entity_values": [
        "14 inch",
        "Motorola",
        "five megabytes",
        "LC",
        "160-megabyte",
        "two",
        "640",
        "four megabytes",
        "the fall of 1991",
        "Larry Barbera",
        "jack",
        "Bob",
        "four",
        "one",
        "Front Row",
        "Eric",
        "480",
        "eight megabytes",
        "20th",
        "John Sculley",
        "520",
        "Apple Macintosh",
        "rhe Computer Clan",
        "July, 1993",
        "10-megabyte",
        "Sony",
        "Apple",
        "the fall of 1992",
        "Mackintosh",
        "8",
        "an over $2,000",
        "the Mackintosh TV",
        "Mac",
        "RCA",
        "at least one",
        "100%",
        "Apple TV",
        "first",
        "the Apple Interactive Television",
        "Mac TV",
        "Eric Xanthopoulos",
        "16",
        "the iTunes Store",
        "Mac TV's",
        "72",
        "7.1",
        "Macs",
        "October, 1993",
        "two years earlier",
        "Mondo",
        "the 90s",
        "10th",
        "68040",
        "MARCHintosh",
        "25 megahertz",
        "Patreon",
        "32 megahertz",
        "today",
        "Krazy Ken",
        "7.6.1",
        "one megabyte",
        "Steve Jobs",
        "1.44 megabyte",
        "Jack",
        "a ton",
        "Processor Direct Slot",
        "six months",
        "040",
        "DB-25 SCSI",
        "The tech month",
        "Mac",
        "Macintosh",
        "SIMM",
        "The Computer Clan",
        "Blackintosh",
        "Product Design",
        "16",
        "14 inches",
        "RAM",
        "about 10,000",
        "MARCHintosh",
        "2079",
        "Trinitron",
        "520s",
        "second",
        "Intel"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.03998022526502609,
        -0.08172325044870377,
        0.09466278553009033,
        -0.11244149506092072,
        0.02787601761519909,
        0.023356879130005836,
        0.030853981152176857,
        -0.02707643248140812,
        -0.029813086614012718,
        0.013404695317149162,
        0.021863004192709923,
        0.0167961735278368,
        0.012106548063457012,
        -0.04650377482175827,
        -0.0016197904478758574,
        -0.05711530148983002,
        0.10380607843399048,
        -0.12282921373844147,
        0.012912780977785587,
        0.036902137100696564,
        -0.029972853139042854,
        -0.05856902897357941,
        -0.019633840769529343,
        0.00414423318579793,
        0.040437135845422745,
        0.04099082574248314,
        0.015762200579047203,
        -0.01722240075469017,
        -0.0044765532948076725,
        -0.08143603801727295,
        -0.03932083398103714,
        0.0027319365181028843,
        0.03492407873272896,
        0.012241337448358536,
        0.03888830542564392,
        -0.11064504832029343,
        0.06403988599777222,
        -0.018530437722802162,
        -0.15656974911689758,
        0.0019523705122992396,
        -0.0819341391324997,
        0.025158103555440903,
        0.00025337201077491045,
        0.08174185454845428,
        0.030933739617466927,
        -0.05158014968037605,
        0.09823118895292282,
        -0.13763411343097687,
        0.05403071641921997,
        0.003650436643511057,
        -0.05418580397963524,
        -0.0345894917845726,
        0.07816507667303085,
        0.014249073341488838,
        0.023202192038297653,
        0.013918534852564335,
        -0.009150726720690727,
        0.015745343640446663,
        0.08831977099180222,
        -0.020843209698796272,
        0.02032560482621193,
        -0.10392498224973679,
        0.004585144110023975,
        -0.019580144435167313,
        0.0212395116686821,
        -0.06817243993282318,
        0.05351565033197403,
        0.03640124574303627,
        0.005491840187460184,
        -0.043841343373060226,
        0.0029545947909355164,
        0.018550759181380272,
        0.024246159940958023,
        0.06075896695256233,
        -0.004492937587201595,
        0.007964893244206905,
        0.0874270498752594,
        -0.13037653267383575,
        0.009622283279895782,
        -0.02821315824985504,
        0.00230440148152411,
        -0.014814097434282303,
        -0.08937334269285202,
        -0.0036352225579321384,
        0.03174100071191788,
        -0.017807602882385254,
        -0.05758707970380783,
        -0.10425972938537598,
        -0.06051068753004074,
        0.05142368748784065,
        -0.024908389896154404,
        0.10843328386545181,
        0.056228648871183395,
        -0.03575466200709343,
        0.044708166271448135,
        -0.0216541551053524,
        0.017845969647169113,
        -0.0729963406920433,
        0.0247507207095623,
        0.09500192850828171,
        -0.01698256842792034,
        -0.001119979191571474,
        0.04562651365995407,
        -0.03186804801225662,
        0.01914151757955551,
        -0.07171192020177841,
        0.07201181352138519,
        0.05959409847855568,
        0.03603191673755646,
        0.07892686873674393,
        0.009157874621450901,
        0.014067876152694225,
        -0.06504711508750916,
        0.054578687995672226,
        0.05862405151128769,
        0.07333993166685104,
        -0.01748885028064251,
        0.029589418321847916,
        0.08352285623550415,
        -0.05629785731434822,
        0.06863752752542496,
        -0.01612108014523983,
        -0.031136561185121536,
        0.021888645365834236,
        0.029014119878411293,
        0.021141432225704193,
        0.011923743411898613,
        3.315497979541586e-33,
        -0.0628323033452034,
        0.02791367471218109,
        -0.11174631118774414,
        0.007849234156310558,
        0.03727668151259422,
        -0.049571357667446136,
        0.0008469030726701021,
        0.0336342491209507,
        -0.0532107949256897,
        0.015895413234829903,
        -0.011697175912559032,
        -0.03869108855724335,
        -0.09114288538694382,
        -0.0015614692820236087,
        0.006438056472688913,
        -0.0695556029677391,
        -0.03080778382718563,
        -0.0163528211414814,
        -0.07368383556604385,
        0.05038806051015854,
        0.05259612947702408,
        0.029715145006775856,
        0.014517013914883137,
        -0.08266530185937881,
        -0.08125649392604828,
        0.022484969347715378,
        0.012632022611796856,
        -0.012581349350512028,
        0.11317549645900726,
        0.023316578939557076,
        -0.07828322052955627,
        0.0134336082264781,
        0.08956678211688995,
        -0.04820649325847626,
        -0.003614598186686635,
        -0.0940963476896286,
        -0.023493127897381783,
        -0.0719195008277893,
        0.042357493191957474,
        0.06137639656662941,
        -0.09496210515499115,
        0.007065493613481522,
        -0.035185106098651886,
        -0.018184076994657516,
        -0.005961468908935785,
        -0.014513267204165459,
        0.0518011711537838,
        -0.00470841396600008,
        -0.04396861046552658,
        0.04815082252025604,
        -0.03995295614004135,
        0.0004472323053050786,
        0.053033582866191864,
        0.021415550261735916,
        0.009430954232811928,
        -0.007257914636284113,
        0.04521636292338371,
        -0.03720198571681976,
        0.03599371761083603,
        0.01348169706761837,
        0.07763492316007614,
        0.0814252719283104,
        0.06623201072216034,
        0.0020515730138868093,
        -0.04568634554743767,
        0.018698642030358315,
        0.08548752218484879,
        0.04653015732765198,
        -0.03961959108710289,
        0.0035399203188717365,
        -0.05749690160155296,
        0.009646430611610413,
        -0.018686573952436447,
        -0.10812036693096161,
        0.007072046399116516,
        -0.07914575934410095,
        -0.10212276130914688,
        0.04588459059596062,
        -0.03942345827817917,
        0.02232443168759346,
        -0.0023393528535962105,
        -0.03481330722570419,
        -0.0204403568059206,
        0.05906784534454346,
        -0.009977642446756363,
        0.08461017161607742,
        0.06486701220273972,
        0.02205987088382244,
        -0.0014783631777390838,
        -0.009143360890448093,
        0.011197054758667946,
        -0.03487498313188553,
        0.04876571521162987,
        0.007856396958231926,
        -0.02275969088077545,
        -4.6829648841905534e-33,
        0.06862779706716537,
        -0.006257725413888693,
        -0.01477576419711113,
        -0.02890266850590706,
        -0.02560933120548725,
        0.0016002233605831861,
        -0.005779821425676346,
        -0.04089852795004845,
        -0.0477624386548996,
        -0.05647044628858566,
        0.03490746393799782,
        0.0015698774950578809,
        -0.08853307366371155,
        -0.08034571260213852,
        0.005957863759249449,
        -0.011840433813631535,
        -0.02105371095240116,
        0.017957599833607674,
        -0.009981886483728886,
        -0.06078687682747841,
        0.08053428679704666,
        -0.028910620138049126,
        -0.03838836029171944,
        0.0273413248360157,
        0.05726800113916397,
        -0.04403951019048691,
        0.04376021772623062,
        0.09058278053998947,
        0.006694380659610033,
        0.005475257523357868,
        -0.035136956721544266,
        0.005727117415517569,
        -0.00700649619102478,
        0.0020153261721134186,
        0.08234747499227524,
        0.05358412489295006,
        0.015887971967458725,
        0.011935969814658165,
        -0.10116743296384811,
        -0.030324507504701614,
        0.07624585181474686,
        0.036522503942251205,
        -0.07043955475091934,
        0.049320269376039505,
        -0.038757458329200745,
        0.043598566204309464,
        -0.07213634252548218,
        0.015848670154809952,
        0.007552961353212595,
        -0.031893130391836166,
        0.07671503722667694,
        -0.05641668662428856,
        0.05041572079062462,
        -0.037660203874111176,
        -0.0717727541923523,
        0.011047682724893093,
        -0.004930270370095968,
        0.13446155190467834,
        0.042864203453063965,
        0.04126875102519989,
        -0.04565809294581413,
        -0.06343331933021545,
        -0.03803829103708267,
        -0.11624123901128769,
        0.06274323910474777,
        -0.005386728793382645,
        0.036086633801460266,
        0.029790952801704407,
        0.02242003008723259,
        0.02213575877249241,
        -0.010556371882557869,
        0.010692055337131023,
        0.0019142702221870422,
        -0.06389015913009644,
        0.04794509336352348,
        0.06540180742740631,
        -0.03389089182019234,
        -0.04322335124015808,
        -0.006294190417975187,
        0.04003378003835678,
        -0.0264554712921381,
        0.04926019161939621,
        0.053871989250183105,
        0.060439907014369965,
        0.05335966497659683,
        0.09307606518268585,
        0.04111359640955925,
        0.08275296539068222,
        -0.011631311848759651,
        0.02519971691071987,
        -0.00025085359811782837,
        -0.02715052291750908,
        0.016821129247546196,
        0.0504278801381588,
        -0.030068645253777504,
        -6.033953070527787e-08,
        -0.05318785458803177,
        -0.011350038461387157,
        -0.019397137686610222,
        -0.0012143290368840098,
        0.04051678255200386,
        -0.03917312249541283,
        -0.04444863647222519,
        -0.0381176583468914,
        0.037793759256601334,
        0.013807626441121101,
        -0.037438079714775085,
        -0.03630970045924187,
        -0.023699160665273666,
        0.020396698266267776,
        0.026147035881876945,
        0.0385487899184227,
        -0.08723801374435425,
        0.11601006239652634,
        -0.02859603241086006,
        -0.0359409861266613,
        -0.00989275798201561,
        -0.02457362785935402,
        0.05318191275000572,
        -0.030655890703201294,
        -0.07048983126878738,
        0.058208439499139786,
        -0.061299651861190796,
        0.052613385021686554,
        0.022670965641736984,
        -0.04709753766655922,
        -0.05551471188664436,
        -0.04890669882297516,
        -0.07583672553300858,
        -0.07211307436227798,
        0.014778491109609604,
        -0.029842691496014595,
        -0.034055016934871674,
        0.05749163776636124,
        0.05897307023406029,
        0.018063243478536606,
        -0.036643221974372864,
        -0.1542527675628662,
        0.022623838856816292,
        -0.026095809414982796,
        -0.06875208765268326,
        0.04034437611699104,
        -0.07583721727132797,
        0.028897494077682495,
        -0.019268948584794998,
        0.003768410999327898,
        0.08283167332410812,
        -0.034995920956134796,
        -0.047166500240564346,
        0.04454118013381958,
        -0.004622335080057383,
        -0.05433335527777672,
        0.07813013345003128,
        -0.017192978411912918,
        0.006475227419286966,
        0.03982044383883476,
        0.08266954869031906,
        -0.0035602576099336147,
        -0.0721307173371315,
        0.04921584576368332
    ]
}