{
    "id": "i5xnD2XLxyo",
    "title": "Motorola Razr 5G Review: This Is My Next Phone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-09-19T16:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=i5xnD2XLxyo",
    "category": "Science & Technology",
    "tags": [
        "moto razr review",
        "razr 2020 review",
        "razr 5g review",
        "razr vs flip",
        "razr 5g vs galaxy z flip 5g",
        "motorola vs samsung",
        "best folding phone 2020",
        "flip phone 2020",
        "motorola flip phone",
        "folding screen"
    ],
    "views": 625465,
    "likes": 19226,
    "comments_count": 1051,
    "description": "Its a tired trope of the tech world to say that the sequel is what version one should have been. But in the case of one of the most famous brands in mobile phone history, you cant help but wonder what might have happened if last years Motorola Razr  had been the Motorola Razr 2020 instead.   In last weeks Motorola Razr 2020 Hands-On I took you through the differences between the Razr 5G and its 2019 predecessor, so you already know that the spec sheet upgrades and hardware tweaks Motorola made to modernize this model  well, they worked. The Razr 2020 / Razr 5G feels less like a first-generation folding phone, more like a fully-realized fashion flip phone  and that added polish now puts it within striking distance of Samsungs Galaxy Z Flip.  Those improvements are more than enough to make me commit to the Motorola Razr 5G as one of my two everyday-carry devices for 2020  but $1399.99 is a lot to spend for anyone who doesn't have a device-review budget. Is the Razr 2020 good enough for you to finally cross the foldable phone divide? Find out in MrMobile's Motorola Razr 5G Review!    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES MOTOROLA RAZR 5G REVIEW / RAZR 2020 REVIEW]  MrMobile's Motorola Razr 5G Review / Motorola Razr 2020 Review was produced following ten days with a Motorola Razr 2020 / Razr 5G review sample provided by Motorola. Preproduction device running launch-day software, tested on T-Mobile in and around Brooklyn, NY.   MrMobile does not produce paid or sponsored reviews; Motorola provided no compensation and was afforded no preview or copy approval rights concerning this content.    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #motorola #razr5g #razr #razr2020 #foldingphone #motorazr #foldable",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- One of the tech world's tiredest tropes is to say that the sequel of something is what version one should have been. But in the case of probably the most famous reboot in mobile phone history, you can't help but wonder what might've happened if last year's Motorola RAZR had been this year's instead. (upbeat music) In last week's first look at the RAZR 5G, I took you through the differences between it and its 2019 forerunner so you already know that the spec sheet upgrades and hardware tweaks Motorola made to modernize this model, well, they worked. The RAZR 5G feels less like a first generation folding phone, more like a fully realized fashion flip phone. And that added polish, now puts it within striking distance of Samsung's Galaxy Z Flip. While this video isn't meant to be a direct comparison between the two, the fact that they're so close in price and positioning means you have to consider them in context. First and foremost, when it comes to the cameras. The RAZR's gotten a big upgrade on its optics. With a new 48 megapixel camera outputting at 12 megapixels, you get more dramatic natural bokeh when you really wanna do justice to that breakfast sandwich. And with optical stabilization, it's easier to keep the river traffic in the frame. The viewfinder has been cleaned up and sped up, now with artificial horizon. And if you want, you can use that big outer display to show your subject what the shot looks like. As for the photos, (shutter clicks) the new RAZR has kept me company at sunsets, at delicious dinners. It's accurately captured my girlfriend's cat's default mood. And I wouldn't have made it my date to this backyard socially distanced wedding if I didn't trust it. It's a competent camera with some fun toys, like Spot Color for sassing up your socials, which now works in video mode as well. And even when I brought in the Z Flip for a side-by-side, the RAZR hung in there enough to go punch-for-punch, matching or outpacing the Samsung often enough that as you can probably hear, I needed to rerecord this segment of the VO because of how surprised I was at frankly how well the Moto did. That is, until the night mode test, which as you can see, Samsung still runs away with. And you also have to consider that with a standard and a wide angle camera, the Z Flip is just more useful. On a trip to check out a potential new studio location, I didn't even bother taking out the RAZR because I knew I needed a wider lens than it could provide. When you factor in the Z Flip's ability to act as its own tripod with Flex Mode, it's definitely the more versatile of these two cameras, even if it's not always the best. If you're fine with the RAZRs camera, then there's an awful lot to like here, and you don't even have to open the flip to see it. In an effort to improve the battery life, that we'll talk about at the end of the video, Motorola has unlocked the potential of this cover display. In addition to using it to dial frequent contact and take selfies, you can now also use it to open any app that will fit. Yeah, of course, some just won't run out here and others will nobly try and then fail, but doing a speed test on your cover display as a party trick, you try once. Answering a Telegram or a tweet with a quick reply? That's something I've been doing a few times an hour every day. This is crucial because people often ask me if I get annoyed by how often I need to open a clamshell foldable to use it. On the Z Flip, with it's microscopic ticker tape screen, I feel like I do need a smartwatch. On the RAZR, but I can use a quarter of the phone's features out here, or try for a new high score in Astro Odyssey without even opening it. Fun fact: that game is so named because Odyssey was this device's code name. Now there are still hinky bits I'd like Motorola to smooth out, well, the company has made progress blending its new software approach with the classic Moto display, there's still two distinctly different styles and it sometimes feels like you're using two different phones out here. Also gestures aren't quite as consistent as they could be. Sometimes I can dismiss a message by swiping down and sometimes I can't. When you do open the phone, two things: first, many apps will let you pick up on the full screen right where you left off on the cover screen, and second, that upgraded hinge and tightened display make this a much easier one-handed opener than even the first RAZR. Aside from the soft sound of the screen material unfolding, there's none of last year's creaks or pops, even when you run a thumb over the hinge area, which feels a lot smoother now as well. The screen itself is the same one as last year with its distinctive triple crease. Whether you prefer this to the smaller but deeper Samsung gutter is up to you. And the improvements just keep coming once you settle into it. These bezels that some commenters have lamented are here for a reason. They combine with a slightly countersunk display to make back gestures much smoother than they were on the last RAZR. I'm talking physically under your thumb smoother. The side keys are click here and better positioned. The fingerprint sensor is fast and hidden in plain sight as a Motorola logo on the back. Voice calls are more satisfying than on other phones because Motorola has never forgotten how important side tone is to the comfort of a phone call, nearly as satisfying as snapping it shut afterwards. And only the RAZR can claim any kind of water resistance on any foldable, a water repellent nano coating that protects the internal components from splashes. Speaking of components, no, spec nerds, the Snapdragon 765G never kept me waiting. Though I do wonder why Motorola couldn't shave more off the price tag given the money they're supposedly saving on silicon versus Samsung. About the only real regression I can point to is the speakerphone, which is loud, but seems tinnier than last year's. If there's one miss to point to here, it's one I covered in the hands-on. With a battery this small, you can omit wireless or quick charging, but particularly, if you're increasing the thickness anyway, you've got to give me one. The phone may say turbo charging, but it maxes out at 15 watts. For context, the OnePlus Nord charges at 30 watts, which means you can get from 0 to almost 70 in a half hour. The same half hour on the RAZR only got me to 40%. And you will be charging more often. The new RAZR lasts longer than the first one, about 14 to 15 hours on a moderate workday. But crank that up to heavy with an afternoon of mobile hotspot, and you're down to 12 hours. Now that's not atypical for this form factor, but a newcomer to foldables should know that most conventional smartphones in this price range get me between 16 and 18 hours even with heavy use. At that price of 1399, the RAZR 5G isn't gonna be for everyone, but it's such an improvement over the last model that the clamshell space is no longer a one-horse race. Fashion forward fans have pocket-friendly phones, you now have an option that doesn't lock you into a carrier like the 2019 RAZR did. Folding phone fans, you now have an alternative to the super minimalist aesthetic of the Galaxy Z Flip. And hopeless nostalgics pining for the mid-ops but unwilling to give up a full smartphone, the new RAZR's juxtaposition of throwback design and bleeding edge technology might just be irresistible. It certainly is for me. First time I saw this thing leaked in its Liquid Mercury colorway, I said, \"That's my next phone.\" So I will be buying it when it goes on sale this fall, and I'll let you know how it ages. Whether it's slows down, speeds up, or starts squeaking as I slowly chip away at that 200,000 fold guarantee that Motorola promises for this hinge. Stay tuned to my Into The Fold series for that. Subscribe to theMrMobile on YouTube so you don't miss it. And let me know if you'd like to see an episode of When Phones Were Fun based on the first RAZR sequel, the RAZR2 from 2007, currently on loan from Avi Greengart. This video was made possible by a RAZR 5G review sample provided by Motorola but Mr. Mobile works for you, not the manufacturers. Motorola provided no compensation for this coverage, nor did it receive any copy approval rights or an early preview of this video. They're seeing it right alongside you for the first time. Until next time, thanks for watching, and remember to stay safe and mask up while you stay mobile, my friends.",
    "transcript_keywords": [
        "RAZR",
        "tech world tiredest",
        "world tiredest tropes",
        "year Motorola RAZR",
        "Motorola",
        "flip",
        "phone",
        "Motorola RAZR",
        "tech world",
        "world tiredest",
        "tiredest tropes",
        "Samsung",
        "RAZRs camera",
        "fashion flip phone",
        "display",
        "flip phone",
        "Galaxy Z Flip",
        "phones",
        "video",
        "screen"
    ],
    "transcript_entity_values": [
        "First",
        "Into The Fold",
        "year",
        "Telegram",
        "Avi Greengart",
        "last year's",
        "12 megapixels",
        "about 14",
        "the night",
        "RAZR2",
        "Samsung",
        "40%",
        "Flex Mode",
        "765",
        "RAZR 5G review",
        "last year",
        "Spot Color",
        "12 hours",
        "YouTube",
        "Moto",
        "RAZR 5G",
        "30 watts",
        "Mobile",
        "Motorola",
        "16 and 18 hours",
        "almost 70",
        "The same half hour",
        "polish",
        "Snapdragon",
        "first",
        "a quarter",
        "workday",
        "two",
        "last week's",
        "Odyssey",
        "0",
        "15 watts",
        "afternoon",
        "second",
        "5",
        "RAZR",
        "2019",
        "Liquid Mercury",
        "48 megapixel",
        "200,000 fold",
        "Galaxy Z Flip",
        "RAZR",
        "1399",
        "Astro Odyssey",
        "this fall",
        "RAZR",
        "VO",
        "2007",
        "one",
        "the Galaxy Z Flip",
        "OnePlus Nord",
        "a half hour"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "LAW",
        "QUANTITY",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "NORP",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "EVENT",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.1353476196527481,
        0.050222188234329224,
        0.04833059757947922,
        0.006252402905374765,
        0.04298671334981918,
        -0.050179965794086456,
        -0.017164308577775955,
        0.09216441214084625,
        -0.10212881863117218,
        0.04719606786966324,
        0.0022778259590268135,
        0.09870656579732895,
        0.053761109709739685,
        0.019476458430290222,
        0.004894545767456293,
        0.06027514860033989,
        0.05313573405146599,
        -0.04523053765296936,
        -0.029852408915758133,
        -0.01286388374865055,
        -0.04112019017338753,
        -0.015623967163264751,
        0.01328076422214508,
        -0.04209784418344498,
        0.01058477908372879,
        0.012856816872954369,
        -0.05250486731529236,
        0.006177602335810661,
        0.0004088882706128061,
        0.018654419109225273,
        0.031589824706315994,
        0.14876225590705872,
        0.0053806304931640625,
        -0.03296029940247536,
        -0.07919730991125107,
        -0.07804404199123383,
        0.0293838270008564,
        -0.007332018576562405,
        -0.073158860206604,
        -0.002580879954621196,
        -0.03668329864740372,
        -0.02703845128417015,
        0.006090051960200071,
        0.03350787237286568,
        -0.013319166377186775,
        -0.030713843181729317,
        -0.0023518307134509087,
        -0.017292749136686325,
        -0.03879537433385849,
        -0.018423881381750107,
        0.03515231981873512,
        -0.03939923271536827,
        0.00671760831028223,
        -0.05168812721967697,
        -0.07885139435529709,
        0.11054044961929321,
        -0.024658894166350365,
        0.008849847130477428,
        0.012746991589665413,
        -0.0068743000738322735,
        0.03823109343647957,
        -0.07798353582620621,
        -0.10038387030363083,
        -0.0028195572085678577,
        0.010524984449148178,
        -0.007267832290381193,
        0.005352606065571308,
        -0.07586435973644257,
        -0.0365016795694828,
        0.04642903432250023,
        -0.01788836158812046,
        -0.00046421322622336447,
        0.04855184629559517,
        -0.015287970192730427,
        -0.0418216846883297,
        0.03458831086754799,
        0.11941465735435486,
        0.03151676058769226,
        -0.017892582342028618,
        0.0070229945704340935,
        0.04402666538953781,
        -0.07175615429878235,
        -0.0041472711600363255,
        -0.13476704061031342,
        0.05536295846104622,
        -0.013259639032185078,
        -0.0009586421074345708,
        0.03398546203970909,
        2.1583471607300453e-05,
        -0.04442187398672104,
        -0.0003826604806818068,
        0.09811098128557205,
        -0.010549687780439854,
        0.013531580567359924,
        -0.08067978918552399,
        0.0622238963842392,
        -0.03491511568427086,
        -0.0007160449749790132,
        -0.002637880388647318,
        -0.006107659079134464,
        0.07074873894453049,
        0.02008524350821972,
        0.10541700571775436,
        -0.02593081071972847,
        0.026224099099636078,
        -0.056504834443330765,
        0.0670316219329834,
        -0.0144531624391675,
        -0.07701867818832397,
        0.07092444598674774,
        -0.011037273332476616,
        0.04917793720960617,
        -0.027316266670823097,
        -0.011594085022807121,
        -0.006789550185203552,
        0.007813791744410992,
        -0.04966568574309349,
        0.02179141715168953,
        0.11589942872524261,
        0.007210434414446354,
        -0.03670904040336609,
        -0.010593894869089127,
        -0.037871796637773514,
        -0.09596613794565201,
        0.0211503766477108,
        0.0001957056374521926,
        -0.06538189947605133,
        5.58217655292534e-33,
        -0.11249826103448868,
        0.15455593168735504,
        -0.126155287027359,
        0.012462247163057327,
        -0.04402837157249451,
        0.0982721745967865,
        0.03767741471529007,
        0.09416716545820236,
        -0.05117837339639664,
        0.024701843038201332,
        0.0009554416174069047,
        0.01666191779077053,
        0.00036805967101827264,
        -0.007378730457276106,
        0.03743816167116165,
        -0.050448376685380936,
        -0.06305624544620514,
        -0.002604420529678464,
        -0.07485228031873703,
        -0.01388994138687849,
        0.02016758918762207,
        -0.002951130736619234,
        -0.05857676640152931,
        -0.05596402287483215,
        0.006983314175158739,
        -0.014598776586353779,
        0.06791313737630844,
        -0.0728289857506752,
        -3.2909822493820684e-06,
        -0.009446639567613602,
        -0.0705990418791771,
        0.02414005622267723,
        0.0546843484044075,
        -0.02415257878601551,
        -0.018207265064120293,
        0.03756214678287506,
        -0.025035405531525612,
        -0.07163244485855103,
        0.010728598572313786,
        -0.08919956535100937,
        -0.025630829855799675,
        0.013469409197568893,
        -0.11410535871982574,
        0.053766265511512756,
        0.044060710817575455,
        -6.579204637091607e-05,
        0.028916221112012863,
        0.01449016947299242,
        -0.04597949609160423,
        -0.005574030801653862,
        -0.027191389352083206,
        -0.011375216767191887,
        -0.08835957944393158,
        0.04950365424156189,
        -0.0374407134950161,
        -0.029535841196775436,
        0.0472685769200325,
        -0.028497276827692986,
        0.05146370455622673,
        0.01928502507507801,
        0.023134402930736542,
        0.02953183278441429,
        -0.09302802383899689,
        -0.021926110610365868,
        -0.002970852656289935,
        0.017108788713812828,
        0.03868541121482849,
        -0.04154197871685028,
        -0.0011212474200874567,
        0.067337766289711,
        0.05833476409316063,
        -0.03126205876469612,
        0.02869277261197567,
        0.04100518301129341,
        0.0891333818435669,
        0.011066940613090992,
        0.0649111345410347,
        -0.012566315941512585,
        -0.0019382252357900143,
        0.009863728657364845,
        0.009920421987771988,
        0.06335312873125076,
        0.01424318365752697,
        0.035591527819633484,
        0.033400002866983414,
        -0.013300608843564987,
        0.0563223734498024,
        -0.027189048007130623,
        0.05717979744076729,
        0.0535866878926754,
        0.07037871330976486,
        -0.0554666742682457,
        -0.021159734576940536,
        0.004212146624922752,
        0.017732542008161545,
        -5.1669945196088004e-33,
        -0.012995727360248566,
        0.05118008330464363,
        0.03607671707868576,
        0.08525988459587097,
        0.037417709827423096,
        -0.06941693276166916,
        0.05796446278691292,
        0.010516359470784664,
        0.013536496087908745,
        -0.17321383953094482,
        0.05531023070216179,
        0.030777905136346817,
        0.038293518126010895,
        0.0036714933812618256,
        0.00980739202350378,
        -0.006894448306411505,
        -0.036275945603847504,
        -0.12496773898601532,
        0.04270229861140251,
        -0.007712758611887693,
        -0.0034849923104047775,
        0.09332521259784698,
        -0.0018757866928353906,
        0.046407587826251984,
        -0.09369228035211563,
        -0.007522213272750378,
        0.016560392454266548,
        -0.00016209285240620375,
        0.029724877327680588,
        0.02907404862344265,
        -0.026624897494912148,
        -0.06687957793474197,
        0.07939380407333374,
        -0.00029636765248142183,
        0.06984994560480118,
        -0.010009380988776684,
        0.023445026949048042,
        -0.0029660805594176054,
        -0.0010651336051523685,
        -0.03021247126162052,
        0.024958480149507523,
        0.05031651630997658,
        0.010231605730950832,
        -0.017034873366355896,
        0.01972382143139839,
        -0.019979368895292282,
        -0.00636018393561244,
        -0.008053182624280453,
        0.007488026283681393,
        -0.03067537397146225,
        0.03945883736014366,
        -0.011688432656228542,
        -0.035007163882255554,
        0.016332507133483887,
        -0.04879157617688179,
        0.01051237341016531,
        -0.002217342611402273,
        -0.06531376391649246,
        0.031029103323817253,
        0.010931751690804958,
        0.047785427421331406,
        0.050797633826732635,
        0.008661771193146706,
        -0.022891109809279442,
        0.007658736314624548,
        -0.0028641684912145138,
        0.06930337846279144,
        -0.025947099551558495,
        0.011310195550322533,
        0.03774851933121681,
        -0.10767761617898941,
        0.020386893302202225,
        -0.0022930665872991085,
        -0.05288011208176613,
        0.026607070118188858,
        0.10075318068265915,
        0.0026402538642287254,
        0.03198254480957985,
        -0.03867000713944435,
        -0.06295530498027802,
        -0.0129966726526618,
        0.03442423790693283,
        0.025686243548989296,
        -0.0362737774848938,
        0.01635711081326008,
        -0.017851367592811584,
        -0.053332507610321045,
        -0.06600995361804962,
        -0.03717081993818283,
        -0.019708015024662018,
        -0.07068753242492676,
        -0.02788221649825573,
        -0.1083415225148201,
        0.07057849317789078,
        0.0640832781791687,
        -4.977657042104511e-08,
        0.0024949435610324144,
        0.04937318339943886,
        -0.021510329097509384,
        -0.00867418758571148,
        0.050752583891153336,
        0.0033014612272381783,
        -0.033642448484897614,
        -0.05569378286600113,
        0.09796902537345886,
        0.12066050618886948,
        -0.02184107154607773,
        -0.020288977771997452,
        -0.039779823273420334,
        0.08507265895605087,
        -0.04449263960123062,
        0.09064382314682007,
        -0.004522840492427349,
        -0.016873562708497047,
        0.01629539206624031,
        0.06824855506420135,
        0.02377552166581154,
        0.06804579496383667,
        0.022290371358394623,
        -0.02100309170782566,
        0.04579824581742287,
        0.040974557399749756,
        -0.08387315273284912,
        0.022678768262267113,
        0.08124212920665741,
        -0.07955264300107956,
        0.008426351472735405,
        0.010626659728586674,
        0.06167410686612129,
        0.04103955999016762,
        -0.0103215416893363,
        -0.04930049926042557,
        -0.025815514847636223,
        -0.026090916246175766,
        0.06777533143758774,
        -0.017986882477998734,
        0.11649877578020096,
        -0.03965486213564873,
        -0.05359707027673721,
        0.07319588214159012,
        -0.053463440388441086,
        -0.15151438117027283,
        -0.016299914568662643,
        -0.12803584337234497,
        -0.03279002010822296,
        -0.026880605146288872,
        -0.028650734573602676,
        -0.0004314903053455055,
        -0.043377913534641266,
        -0.0671221911907196,
        0.10448712855577469,
        -0.048933371901512146,
        -0.030505500733852386,
        0.028793994337320328,
        -0.05577464774250984,
        0.06226927042007446,
        0.00293477694503963,
        -0.10374443233013153,
        -0.02073829062283039,
        0.06812810897827148
    ]
}