{
    "id": "i9TJWsuzBLU",
    "title": "I Made a Wifi Cracking Van",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-03-23T16:55:15Z",
    "video_url": "https://www.youtube.com/watch?v=i9TJWsuzBLU",
    "category": "Science & Technology",
    "tags": [
        "wifi",
        "hacking",
        "cracking",
        "diy pc",
        "networking",
        "home network",
        "router",
        "wireless",
        "infosec",
        "network security",
        "security",
        "blackhat",
        "whitehat",
        "hashcat",
        "pwnagotchi"
    ],
    "views": 1439860,
    "likes": 59846,
    "comments_count": 2599,
    "description": "Visit  and use offer code LTT for 10% off  Grab your very own set of LTT Keycaps with free US Shipping! Go to   Did you know that you can get the internet wirelessly now? Well, you can, and while it might be amazing, it comes with a certain level of risk, especially if you are using a simple password and happen to run afoul a person with a van full of RTX 4090s. Just how fast can a nefarious van dweller with a bottomless budget gain access to your precious shared network drive? The answer might shock you. Big shout out to Comino for letting us borrow this absolute leaf blower of a server, it's been so much fun to play with.  Discuss on the forum:   Check out Comino Grando RM Workstations:    Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:07 Phone numbers aren't good passwords 1:59 History of WiFi Security 2:45 WPA2 and how to break it 4:45 A look inside the Comino Grando RM 8:08 WPA3 and how to break it 10:16 Dictionary attacks 11:54 What you can do about it & conclusion",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://apos.io/ltt-keycaps",
        "https://linustechtips.com/topic/1563955-i-made-a-wifi-cracking-van/",
        "https://lmg.gg/ZCjcq",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Hey, get over here. On the count of three, your Wi-Fi password's gonna appear on this monitor. Ready, one, two, got 'em! Pretty neat trick, huh? And sure, maybe I didn't get it for all of you, but a shocking number of people are still either using the default password that came with their device or their phone number or a loved one's phone number, which you may already know is a huge security problem. How easy is it to crack these passwords? Well, with the Crackinator Password Stealmatron, aka this van, I can do it in seconds, which would give me access to any shared resources on your network, would allow me to use up your data limit, and would even allow me to engage in illegal activities that would ultimately be traced back to you. I'm going to show you how we built it, and I'm going to give you guys the tools to stop people like me. And today's video is brought to you by APOS, LTT keycaps. Yes, they're real. And yes, you can get them right now. Check them out at the link down below where you can get free U.S. shipping. Wi-Fi security historically has been a bit lacking. In fact... And if you're thinking that was a dramatic reenactment, surely it's not that bad. You're right because it's worse than you think. Whether we get chased off or not doesn't even matter. We can grab everything we need from a target's network in the 30 seconds that it takes them to spot us outside their house and walk out to confront us. So if they're using any kind of phone number password I should be able to break through it. This easily. And so that was it. Yep. While it may shock you to learn how easy it was to crack that network's password, it might also shock you to know that for the majority of Wi-Fi's life, it's kind of been this way. WEP was the first generation of Wi-Fi password protection to find widespread adoption. And at first, it was good enough, especially compared to the alternative of your data just raw-dogging it through the air unencrypted, but it took technology only a few years to advance to the point where WEP could be cracked in under a minute. The attack method was pretty straightforward. Every packet of data contained the password in some manner, so if enough packets could be intercepted, they could all be compared to find out what they had in common. This was the reason for the switch to WPA2, or Wi-Fi Protected Access, which ditched the constant sending of the password, simplifying the process down to a four-part handshake. First, the device tells the router it wants to connect, then the router sends back a challenge key, the device then mixes the challenge key with the password and returns it to the router. Finally, the router sends back a session key, and that gets used for the remainder of the time the device is connected. For an observer then, this is kind of like having a picture of the lock, and knowing that a standard looking key opens the lock, but having no idea what the exact shape of that key needs to be. Now they could attempt to brute force it, but it would take forever, and they would risk detection because they would need to be in range of the lock at all times. This ended up being pretty effective for a while. But wait a minute, what if, instead of just knowing what the lock looks like, the hacker possessed a collection of exact replicas of the lock, allowing them to try key after key after key without detection? Well, that is exactly what we did. By stealing the complete handshake packet, we've obtained the challenge key and the result of mixing it with the password. Well, at that point, we can take that information to a safe location, brute force it with the power of our Crackenator, and then return to do our shady business. Making things even simpler for ne'er-do-wells, encryption cracking plays real nice with multiple cores, with each core of a processor hypothetically being able to try a different key in unison. And this might not mean that much for CPUs that have only a handful of cores, or at most, what, 128, 192? Well, when it comes to GPUs, we are talking thousands of cores. So while we obviously could put hardware with this kind of password cracking capability into a mobile hacking station like this, we don't even need to. All right, let's finally properly meet the Comino Grando RM. Now, just so you remember, the RTX 4090 has 16,000 CUDA cores in it, and this has six of those. I haven't seen one of these for about two years. Every time Comino sends over a system, they are so. nice. Actually, before I'm even in, I can see something that is a huge improvement over the last one. Previously, they were using SFX-L power supplies, three of them, which is not the best if you want to have a server. This time we have proper server grade power supplies and there are four of them. So I am kind of curious if it will just keep on running if you take one of them out, maybe even two of them out. I have never seen a 4090 like this. This is strange. So we have our power connectors right here, which are not connected to anything at all, because Comino have put power connectors on the back of these GPUs. I have seen some PCBs with the pads for these power connectors, but never anything actually installed like this. It looks like Comino has made their own custom PCB for 12-volt high power connectors right here. You can see that we have a couple extra, and if they wanted, they could have heaps, absolute gobs and gobs of GPUs in this thing. I take it this computer's extraordinarily loud. Yes, very. That's loud. These run much quieter. Yeah, and they also can't run any AI workload worth a damn compared to this thing. They're quiet. In the past, Comino have had their servers set up so that you can kind of just put it in like your office and it would be fine. We'd have like Noctua fans set up here that blow across the power supplies. and the radiator at the same time. This right here is clearly a lot more server grade with these absolutely chonktastic cut your finger off fans right here. What hasn't changed though is how impressive their water cooling is. In here we have a great big water cooling manifold that's distributing in parallel water to our CPU and all of our GPUs and then it's taking all of that heat and dumping it into this great big radiator with those massive fans. It looks like all of the water blocks are completely custom for Comino. We've got these beautiful GPU ones that are just nice and small. Just look at how beautiful this VRM heatsink is over here. It's just machined out of copper. Everything in here is just absolutely beautiful. 32 gigabytes. I think the last one that we had, all of them are 64. So not too much RAM. 256 is still a lot though. So Tanner, have you done everything that you need to do with this for the video? Yeah. Have you tested the power supply redundancy? No. Should we? We can do that. All right, let's see if these power supplies are redundant. This is a very simple test. The computer is on. The computer is still on. Good job, guys. One thing that isn't very server-like with this is the I/O. We have heaps of USB ports right here. Normally on a server board you only get like two. We also have two 10-gig and Intel AX200 Wi-Fi, which will get you Wi-Fi 6E, and WPA3 for that good, good high security Wi-Fi. Ah, yes. While hackers and crackers were working to defeat it, WPA was doing some leveling up of its own. And it's a pretty safe bet that any Wi-Fi 6 device will be using WPA3 encryption. What's changed? Well, the new Dragonfly handshake method aims to make it much more difficult to observe the handshake process and crack the password offline. But along with a few smaller vulnerabilities, it does have one major flaw that still persists. If your network contains any devices that were made before WPA3 or one of the few devices made after that, then it's likely that you'll be using WPA3 that just doesn't support it. Like say for example, an HP printer, your router will fall back to WPA2 for that device unless it is explicitly told not to. That is our entry point. Wow. Thanks Linus. Yeah, no problem. See you later, buddy. Let's hope things go a little better with victim number two. About a week ago, I gave them an HP printer and as long as they didn't get far enough in the setup process to realize HP requires them to have a subscription just to use the ink in the box, they're gonna have that on their network. Doesn't that come with like a trial or something? Yeah, but I kept that for myself. What, I'm gonna pay for my own printer subscription? I'm a hacker. Are you done? Yeah, I'm done. Okay, got the handshake data, let's go. All right, let's go. Okay, this is not going so well. And that's because even with our stolen lock, the cracking difficulty of one Wi-Fi password compared to the next can be dramatically different. A traditional lock and key might have only five or six values that differ and five or six possible heights for the teeth. WPA passwords, by contrast, can use any of the printable ASCII characters and be up to 63 characters long. That means that the total number of different passwords that could exist is... very high, or at least it would be if people weren't so gosh darn predictable. When you are expected to share a password with others, you are much less likely to select one that looks like this, and you are much more likely to select one that looks like this. So with a dictionary attack, where a list of words is used instead of random strings of characters, hackers can drastically reduce the number of passwords that they need to attempt down from 20 quadrigentillion apparently yes that is a real number to only hundreds of millions which might still sound like a lot until you consider that a single rtx 4090 can attempt over 2 million wpa2 passwords per second let's tackle a pretty typical 12 character password then with a number and a special character and yeah Armed with only a dictionary of a million common words combined with a mask of any non letter ASCII character I can take down your super secure, but still easy to say password in just seconds All right, then Linus if full sentence passphrases don't work. What do I do now? Well, you might try creating a password with a string of random Upper and lowercase letters with numbers and punctuation, which is actually great in theory but unfortunately, once again, people are predictable and they tend to do things like use mnemonic phrases for easier memorization. According to researchers at Carnegie Mellon, these phrases often tend to be based on popular media like Shakespeare or, more commonly, apparently, the Oscar Mayer Wiener jingle, making them susceptible to dictionary attacks all the same. You could use a password generator to create a long string of truly random characters and then only share your Wi-Fi credentials through QR codes. This has the benefits of being both secure and easy to use in most scenarios, but it can be a huge pain as soon as you need to connect a device that doesn't happen to have a camera. Or at least it would be a huge pain if you allowed those devices on your network at all. As it turns out, you don't really have to if you just make a new network for obnoxious devices that compromise your security. If all they need is internet access, a really great and fairly noob-friendly way to deal with this is to put them on your router's guest SSID. If they need more though, then you might have to learn about VLANs. Network security doesn't end at Wi-Fi security, and Wi-Fi security doesn't end at a strong password. Many routers do include an option to limit networks to WPA3 only, and while this does break backwards compatibility with older or less secure devices, having a second WPA2 network using a different password and with much stricter network access rules is a great option if you're willing to put in the time to learn about it. In fact, at that point, why stop at two networks? You could have one for your main devices, one for your IoT devices, and then a limited guest network for your visitors. It's a great way to really improve your network security, usually without having to purchase any additional hardware. Just like this is a great way to segue to our sponsor, Squarespace. Are you looking to create a website but lack the technical expertise? Squarespace is here to help. Their all-in-one platform simplifies the process of getting your website up and running quickly. With Squarespace, you can grow your business online through their marketing features, which include SEO support, email campaigns, and social tools. They offer a wide selection of award-winning, mobile-optimized templates, and their commerce platform provides everything you need for merchandising to check out. You can also access Analytic Insights to optimize your website's performance and identify areas that need improvement. If you require assistance, Squarespace has help guides and a 24/7 support team. So visit squarespace.com/ltt to receive 10% off your first purchase. If you guys enjoyed this video and you want a more detailed guide on how to improve your home network security, check out the time that I separated my main network from my IoT devices.",
    "transcript_keywords": [
        "password",
        "network",
        "WiFi",
        "key",
        "WiFi password",
        "power",
        "number",
        "Crackinator Password Stealmatron",
        "devices",
        "Comino",
        "security",
        "passwords",
        "device",
        "lock",
        "great",
        "Network security",
        "WiFi security",
        "power connectors",
        "time",
        "kind"
    ],
    "transcript_entity_values": [
        "just seconds",
        "one",
        "20",
        "Tanner",
        "One",
        "under a minute",
        "WPA2",
        "10%",
        "the last one",
        "GPU",
        "Crackenator",
        "AI",
        "LTT",
        "thousands",
        "Wi-Fi 6",
        "three",
        "Intel AX200 Wi-Fi",
        "Linus",
        "Wi-Fi",
        "256",
        "Stealmatron",
        "a million",
        "about two years",
        "64",
        "Wi-Fi",
        "4090",
        "Wi-Fi's",
        "first",
        "the 30 seconds",
        "APOS",
        "the Crackinator Password",
        "First",
        "seconds",
        "VRM",
        "only five",
        "32 gigabytes",
        "Squarespace",
        "CPU",
        "Wi-Fi 6E",
        "WPA",
        "six",
        "Carnegie Mellon",
        "192",
        "12-volt",
        "four",
        "Dragonfly",
        "HP",
        "About a week ago",
        "ASCII",
        "16,000",
        "Comino",
        "five",
        "12",
        "Wi-Fi",
        "only hundreds of millions",
        "two",
        "PCB",
        "second",
        "IoT",
        "128",
        "2 million",
        "WEP",
        "U.S.",
        "Wi-Fi Protected Access",
        "Oscar Mayer Wiener",
        "today",
        "4090",
        "CUDA",
        "only a few years",
        "Analytic",
        "Upper",
        "Shakespeare",
        "USB",
        "a minute",
        "SSID",
        "63",
        "Noctua"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "LOC",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORG",
        "LAW",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.06761694699525833,
        0.015551377087831497,
        0.05046314746141434,
        -0.04797406494617462,
        0.06510760635137558,
        0.0002869199961423874,
        -0.028613628819584846,
        0.10542531311511993,
        -0.05939215421676636,
        0.022675326094031334,
        0.035159170627593994,
        0.09640876948833466,
        0.043576937168836594,
        -0.028469396755099297,
        0.025155095383524895,
        -0.03722037747502327,
        0.041232217103242874,
        -0.1358429193496704,
        -0.007647835183888674,
        -0.035719409584999084,
        -0.00047560984967276454,
        -0.008287368342280388,
        0.041074238717556,
        -0.10220295190811157,
        0.0915990024805069,
        -0.036646392196416855,
        0.059648297727108,
        -0.035603318363428116,
        -0.024454472586512566,
        0.0006432119407691061,
        -0.004897544626146555,
        0.016628220677375793,
        -0.13033080101013184,
        -0.022358963266015053,
        -0.06935694068670273,
        -0.06092396378517151,
        -0.028527799993753433,
        0.018027804791927338,
        0.051816973835229874,
        -0.014856092631816864,
        -0.021070396527647972,
        -0.0496203787624836,
        -0.04039660096168518,
        0.06111908704042435,
        -0.05898107588291168,
        -0.017211629077792168,
        0.04156190901994705,
        -0.0034074257127940655,
        0.016823654994368553,
        -0.0646061971783638,
        0.07195522636175156,
        0.03444637730717659,
        0.04332219064235687,
        0.023302441462874413,
        -0.06903733313083649,
        -0.05233808234333992,
        -0.0640721321105957,
        0.015882685780525208,
        0.004350540228188038,
        -0.016808059066534042,
        0.04865286871790886,
        0.009394865483045578,
        -0.004251223988831043,
        0.008394598960876465,
        -0.0041766478680074215,
        -0.010428758338093758,
        0.03352421522140503,
        0.04927333444356918,
        0.005021486897021532,
        0.016877401620149612,
        -0.005263429135084152,
        0.0004859394393861294,
        -0.048921406269073486,
        0.09406706690788269,
        0.025672728195786476,
        0.04173964262008667,
        0.07473214715719223,
        -0.05300568789243698,
        -0.0020407296251505613,
        0.03719688951969147,
        0.047040633857250214,
        0.03341534733772278,
        0.0379982627928257,
        -0.060079239308834076,
        -0.018442481756210327,
        -0.021930228918790817,
        0.0003729090094566345,
        0.09076566994190216,
        0.051958922296762466,
        -0.036341343075037,
        -0.006050693336874247,
        0.025948237627744675,
        0.030614623799920082,
        0.0386168472468853,
        -0.014226478524506092,
        0.012982627376914024,
        0.01014790404587984,
        -0.03075261414051056,
        -0.14663678407669067,
        0.039900168776512146,
        -0.004800066351890564,
        0.020271144807338715,
        -0.017823539674282074,
        -0.08259321749210358,
        -0.060868412256240845,
        -0.02278973162174225,
        0.07155349105596542,
        0.034921739250421524,
        0.006193381734192371,
        -0.06674209237098694,
        -0.06381326168775558,
        0.03236469253897667,
        -0.06441899389028549,
        0.014467679895460606,
        -0.04838064685463905,
        -0.03539290279150009,
        -0.047705553472042084,
        -0.029154710471630096,
        0.0267686378210783,
        -0.03582092374563217,
        -0.02292361482977867,
        -0.029585376381874084,
        0.0102870287373662,
        0.017444731667637825,
        0.0699007660150528,
        0.03728798031806946,
        0.0007538722711615264,
        4.931363370908611e-33,
        -0.0556340366601944,
        0.10920862853527069,
        -0.08457200229167938,
        -0.05314324051141739,
        0.05627737566828728,
        -0.01981073059141636,
        0.0356711708009243,
        0.00394017668440938,
        -0.024832364171743393,
        0.06883908063173294,
        -0.059505999088287354,
        -0.018144529312849045,
        -0.05042680725455284,
        -0.07118538022041321,
        -0.004325056914240122,
        -0.04964123293757439,
        -0.010949613526463509,
        0.01900660991668701,
        -0.0028524689842015505,
        -0.015615832060575485,
        -0.022027339786291122,
        -0.04741420969367027,
        0.022844616323709488,
        -0.03325238823890686,
        0.04431039094924927,
        -0.09159546345472336,
        -0.01772129535675049,
        -0.07313773036003113,
        0.13405348360538483,
        0.02509826235473156,
        -0.12307795882225037,
        0.018967000767588615,
        -0.027410337701439857,
        -0.01465617399662733,
        -0.030375322327017784,
        -7.55576475057751e-05,
        -0.1021614521741867,
        -0.10886110365390778,
        -0.013149023987352848,
        -0.051974374800920486,
        0.02104870416224003,
        -0.01051716972142458,
        -0.06383422017097473,
        -0.03442348539829254,
        -0.048367470502853394,
        -0.03261996805667877,
        0.011214382946491241,
        0.06469367444515228,
        -0.038585364818573,
        0.07592535018920898,
        -0.06044214218854904,
        0.053972188383340836,
        -0.1279250979423523,
        0.030567821115255356,
        -0.037263814359903336,
        0.10448797792196274,
        0.09689237922430038,
        0.002917465753853321,
        0.11945205926895142,
        0.060985591262578964,
        0.04433035850524902,
        -0.05370095372200012,
        0.027386106550693512,
        -0.0012299822410568595,
        -0.012621430680155754,
        -0.02788340114057064,
        -0.03464796766638756,
        -0.028667036443948746,
        -0.02025207132101059,
        0.05748846009373665,
        -0.005594367161393166,
        -0.0316653698682785,
        0.012773500755429268,
        -0.11049125343561172,
        0.11440376192331314,
        0.04669121280312538,
        0.002287492388859391,
        0.028523240238428116,
        0.018845155835151672,
        -0.012071891687810421,
        -0.010963196866214275,
        -0.017154496163129807,
        0.0364980511367321,
        0.03531159833073616,
        0.09073884040117264,
        0.008913343772292137,
        -0.04791560769081116,
        -0.05466422066092491,
        -0.03725295886397362,
        0.08159685879945755,
        0.02290603518486023,
        -0.0046910750679671764,
        -0.047812990844249725,
        -0.011809497140347958,
        -0.02899670973420143,
        -4.697873091294857e-33,
        -0.03685177117586136,
        0.008049475029110909,
        0.023851053789258003,
        -0.01104792021214962,
        0.06719858199357986,
        -0.011146866716444492,
        -0.05868036299943924,
        0.02615959756076336,
        -0.07767815887928009,
        -0.018985237926244736,
        -0.002748345723375678,
        -0.035815827548503876,
        -0.008777384646236897,
        -0.02865605615079403,
        0.04374205693602562,
        -0.13220512866973877,
        0.11544768512248993,
        -0.03383570909500122,
        -0.03385996073484421,
        0.014705241657793522,
        0.0667644813656807,
        0.019079657271504402,
        0.05481693521142006,
        0.019242338836193085,
        0.016970019787549973,
        0.003038513008505106,
        -0.0014746986562386155,
        0.11804738640785217,
        -0.03468398377299309,
        0.021975310519337654,
        -0.019071344286203384,
        0.019140062853693962,
        0.07561321556568146,
        -0.02814958058297634,
        0.07133465260267258,
        0.01745137944817543,
        0.13281390070915222,
        0.05924778804183006,
        -0.039799127727746964,
        -0.035778749734163284,
        0.11706143617630005,
        -0.038463983684778214,
        -0.05765644460916519,
        -0.03237706050276756,
        -0.050441186875104904,
        -0.07051610946655273,
        -0.03485118970274925,
        -0.12652233242988586,
        -0.011473432183265686,
        0.04777562618255615,
        0.08726280182600021,
        -0.029615556821227074,
        0.03961624950170517,
        0.05239586532115936,
        0.037766553461551666,
        0.03280576318502426,
        0.011658530682325363,
        -0.014019405469298363,
        0.05274251848459244,
        0.014572951942682266,
        0.020122559741139412,
        -0.0029818015173077583,
        -0.027799036353826523,
        0.03939227759838104,
        0.029862437397241592,
        -0.13249531388282776,
        0.018236959353089333,
        0.014589706435799599,
        -0.04552575945854187,
        0.06157735735177994,
        -0.00404814537614584,
        -0.007694132626056671,
        0.029649965465068817,
        -0.027730930596590042,
        0.027759943157434464,
        -0.07447658479213715,
        0.07626526802778244,
        -0.01052977703511715,
        0.0069790552370250225,
        -0.08244247734546661,
        -0.017260272055864334,
        0.03091658093035221,
        -0.021858753636479378,
        -0.062104493379592896,
        0.03711308166384697,
        -0.0052932919934391975,
        0.01954697258770466,
        -0.020865555852651596,
        0.03250560164451599,
        -0.016051527112722397,
        -0.01649576798081398,
        -0.02736363187432289,
        -0.03432954102754593,
        0.08724863827228546,
        0.07334182411432266,
        -6.0373629651167e-08,
        -0.06629899144172668,
        0.05849400907754898,
        0.010312946513295174,
        0.06357327848672867,
        -0.0053217546083033085,
        -0.03208671510219574,
        0.04917815700173378,
        -0.01753576658666134,
        -0.010320103727281094,
        0.06839289516210556,
        0.09169072657823563,
        -0.08189765363931656,
        -0.02952319011092186,
        0.00934712402522564,
        -0.01798967272043228,
        0.003174970392137766,
        -0.060230553150177,
        0.005422917660325766,
        -0.034349557012319565,
        0.03326702117919922,
        -0.01676361821591854,
        -0.01194146927446127,
        0.06837701797485352,
        0.055582571774721146,
        0.07438556104898453,
        0.053109850734472275,
        0.037652637809515,
        0.060461945831775665,
        0.09841852635145187,
        -0.05389590933918953,
        -0.1466328501701355,
        0.05345680192112923,
        -0.043884240090847015,
        0.055187515914440155,
        -0.06676274538040161,
        -0.0412079282104969,
        -0.07214800268411636,
        0.06478431820869446,
        -0.0141653036698699,
        0.12264435738325119,
        -0.008916621096432209,
        0.048442594707012177,
        0.002729431027546525,
        0.019582053646445274,
        0.008844295516610146,
        0.02357056364417076,
        -0.09610976278781891,
        -0.011591850779950619,
        0.011749186553061008,
        -0.05021263659000397,
        0.018826067447662354,
        0.010087694972753525,
        -0.006955953314900398,
        0.0541110560297966,
        0.012069308198988438,
        -0.0012819922994822264,
        0.005415326450020075,
        0.027048619464039803,
        -0.049692291766405106,
        0.062059804797172546,
        -0.028272688388824463,
        -0.019455736503005028,
        -0.05489864572882652,
        0.029772816225886345
    ]
}