{
    "id": "IBOB-wS19yE",
    "title": "Are Glass Mousepads BETTER? ...Maybe - Skypad",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-09T19:18:32Z",
    "video_url": "https://www.youtube.com/watch?v=IBOB-wS19yE",
    "category": "Science & Technology",
    "tags": [
        "Mousepads",
        "Glass",
        "Skypad 2.0",
        "Skypad 3.0 XL",
        "Accuracy",
        "Performance",
        "Tracking",
        "Smooth",
        "Sliding",
        "Sizes",
        "Are glass mousepads better?",
        "Is glass better than cloth?"
    ],
    "views": 514153,
    "likes": 18757,
    "comments_count": 1311,
    "description": "Get 20% OFF + Free Shipping @Manscaped at    Mousepads are very important for your setup, be it a PC or Mac, but it's almost critical for gaming. Unfortunately, there have been a lot of snake oil products out there that say they are the ultimate way to get better accuracy. So we check out these glass ones from Skypad.  Buy Skypad Gaming Mouse Pad 2.0 On Amazon:   Check out the lttstore.com desk pads at   Buy Logitech G303 Shroud Edition On Amazon:  On Best Buy:  On Newegg:   Buy ASUS Zephyrus Gaming Laptop On Amazon:  On Best Buy:  On Newegg:   Buy Fnatic Mousepad On Amazon:  On Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------  0:00 - Do mousepads materials matter? 1:25 - Unboxing 1:36 - Physical first impressions 3:31 - Available sizes 4:10 - Price thoughts 5:00 - LTT Labs coming soon 5:22 - Mouse sliding impressions 5:45 - Riley's thoughts 6:30 - Colors available 7:51 - Sponsor - Manscaped! 8:40 - Gaming impressions! 10:45 - Final thoughts 14:16 - Outro",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://geni.us/TVKdxgP",
        "https://lmg.gg/If9Ny",
        "https://geni.us/H4cBjkr",
        "https://geni.us/Yf7YA",
        "https://geni.us/ExqOBG",
        "https://geni.us/s1KX",
        "https://geni.us/L5oBQq9",
        "https://geni.us/WH85v",
        "https://geni.us/YPAdd7I",
        "https://geni.us/fyzuR",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Have you ever been gaming on a mousepad and it just feels like garbage? You know, it snags a little bit like it's getting old or it's too smooth and you push your mouse and it goes all the way over? I mean, that's not usually much of a problem because you want no fraction. But you wanna upgrade, but what do you get? Well. - [Man] KY Jelly. (laughing) - The Skypad, professional gaming gear. So this is a tempered glass mousepad. I haven't used glass before but I have used a lot of like hard countertops as well as like metal. - [Man] Also textbooks help. - Yeah, textbooks. You know, if you're really poor you can just use a textbook 'cause that's what you spend all your money on. They sent us a whole bunch. This is the XL on the bottom. And these are the regular guys. They come in a lot of colors which is pretty cool. They come in black, white, green, red and blue. So they claim that it's like incredibly accurate and it's super smooth, so there's like zero friction. They actually sell extra mouse feet, so you gotta get the Teflon footpads and pop those at 'em. Really feel the glide. They've also got another product on their page, the gaming arm sleeve. That's what I'm set on. 'Cause honestly, you know, not gonna lie, there's been times, especially in the summer where you're gaming like all day and then your arm starts to hurt. It shouldn't and that should be a sign that you should maybe stop playing games. But it just chaves a little bit from the material. - [Man] It wouldn't fit on those guns. - Yeah, it wouldn't fit on these guns. I'm getting fat, my T-shirts are starting to get a little tight on me. - [Man] Just go play badminton with Linus. - No, no, I'll just game more. That'll solve my problem. That's how I'll lose weight, I'll just game more. These are supposed to be super thin as well, they're really low profile. Yeah, that's glass, all right. It's tempered glass. - [Man] Don't drop it. - I won't drop it 'cause it will probably break. I don't know if it's these guys or the new XL one but the feet are supposed to be like point five millimeter and then it's supposed to be 3.2 millimeter for the rest of the pad. So it should sit about 3.7 millimeters above your desk, which isn't too bad. 'Cause our mousepad is probably pretty close. So it's basically just a little bit higher than the stitched edge of our own mat. Yeah, that feels okay. Like if I just hold my hand here, we've got a wrist rest. Ah, but see that's the thing, what if I was wearing-- Yeah, I kind of want the gaming sleeve already. It doesn't slide all that much, but the problem is we don't have one with proper Teflon feet. We do have a G303. This is actually the Shroud mouse as well. I mean, that really just changes the shape of it a little bit, 'cause it's molded for Shroud or whatever. But like, I don't know, it slides okay. This doesn't seem, I don't know. So I've tried hard mouse pads in the past and there's something that's not the same as a cloth pad and part of it's the silence. You can hear this. That is so much quieter. It's still audible. But like-- I wish we had the Teflon feet. - [Man] So that one, the 2.0 XL-- - Yeah. - [Man] Is on Amazon for 97 US dollars. - Like honestly, considering how much a proper cloth desk pad can cost you and the fact that this is like a hard material. Like it's super stain resistant, super spill resistant. You're not gonna ruin it unless you drop it on like a tile or ceramic or concrete or something. Even if you drop this on wood. Like I could probably drop this on laminate and it would probably be okay. I'm not going to. 'Cause in case it's not. But you can get away with a few things. So just for a quick size comparison, this is a small one, this is the 2XL. And they should have-- Yeah, so the small guys are 300 by 350 millimeters or 30 by 35 centimeters. And then the big guy, though is 370 by 450 or 37 by 45 centimeters, which is pretty big. This is, even the small one-- That's big enough to be a mousepad. I really hate when you get those super tiny ones that are like this size that barely cover anything and you gotta keep your DTI super high. So you can do just wrist movements and stuff. God, I hate even moving around in this 'cause you're gonna hear it. So now the question is, these are like what, 30, 40 bucks for a mousepad? How much do we charge for the desk pads? Yeah, we charge 30 US dollars for the desk pads every size, which is crazy. But Linus likes giving away super huge mouse pads at 30 dollars. This is a 100 bucks for the big one. - [Man] And also you have to buy the feet. - You have to buy the feet too? - [Man] I think it's separate now. - Oh, for the mouse? Yeah, yeah. So you've gotta spend 30 bucks just for the mousepad and then if you really want it to be as good as it's supposed to be, you've then gotta pay 20 or 30 bucks. - [Man] Nah, it's $8.50-- - 8.50. - [Man] For a set of two. - You gotta pay an extra 8.50 for a set of two feet. - [Man] I think your feet will ware out fast on glass? - You think so? I'm honestly not sure. If you're interested in that and you wanna see how quickly mouse feet actually degrade, then get subscribed to LTT and check out our upcoming labs content because we're gonna have a lot of testing on stuff like that. Stuff that takes hours and hours and hours and hours to actually test properly. - [Man] And people vastly smarter than us. - Yeah, and people vastly smarter than us operating all of those tasks to make sure it's all above board. Yeah, I don't know, it feels okay. I still think I prefer cloth. Like if I had to choose right now, I would take the cloth mat over-- - [Man] Can you push the mouse and just see like what's the-- - Like it slides. But it slides on the cloth too. Like pretty good, honestly. And I mean, it's not super scientific, I'm just pushing this thing along, but-- - [Riley] I think you're a scientist. - Hi Riley. - [Riley] That's science. - That's science, right? I moved the thing and then I'm like, yeah, I think that's faster. That's how science works. - [Riley] Yeah, I think you're doing a randomized control trial right now. (laughing) - Do you like how this sounds? - [Riley] Not at all. - You don't like that? - [Riley] I can hear it from over here. This is a problem. - What about this? - [Riley] That's nice. Ittstore.com. - That being said, if noise isn't a factor, you know, this might be for you. And if you've got the really cool Teflon feet that they sell, maybe it's actually not even this loud at all. Maybe there's a bunch of dust on here. I don't think so 'cause I just wiped it all off. And it still sounds about the same. Yeah, it's like two bananas, almost. Like 1.8 bananas or so, so it's pretty long. It comes in a bunch of different colors. They sent us a few boxes but I don't know how many colors they actually sent us. I'm a color guy. I'm not into like minimalism and black and white aesthetics for everything. Oh, they're labeled! Okay, so this is white. We've already seen the white one. This is red. I'm not really into red, but you know what, that's a really nice red though. Yeah, it's a little orangy. Oh, the green looks good. They're all just really primary. This is kind of a dark green, not super dark. But yeah, it's like they're beautiful. I do really appreciate the colorful aesthetic on the colored ones. My problem is I don't know if I wanna spend a 100 dollars on this, 'cause if I do, if I'm looking to spend that much money do I go for something really artisanal and I get like a 100 plus dollar Japanese cloth gaming pad? I don't use those personally, it's too much money. But I've got friends who play Esports professionally or used to at least. And they kind of swear by those. So I don't even know if they would like these. So it's a 100 bucks for the large one and then the small one is a little cheaper probably. And then they've got their 3.0-- These are all 2.0. They've got their 3.0 up for pre-order right now as well. Cool. We know that it doesn't feel super great and we know it doesn't sound super great, but does it game super great? We'll find out after our word from our sponsor Manscaped. Their Performance Package 4.0 kit is designed to contain everything you need to make grooming below the waist easy. It includes the updated lawnmower 4.0 with its wireless charging, Wheatwacker nose trimmer for the tricky areas plus some other goodies like the Crop Preserver and Crop Reviver sprays for deodorizing and toning. Get 20% off plus free international shipping using the link in the description below. I'd love to get some actual data for you and run it through the tracking machine system that we used for the desk pads, but John is not gonna give me any time to do that, so-- Bug Linus and maybe we'll do it in the future. Yeah, do you need to spend a 100 dollars on a mousepad? Well, I kinda did but it's a big mousepad. That one's like 50. Yeah that one was like 50 with shipping. Just to make this kinda fair we're gonna have new warmup on the LTT desk pad. I'm gonna do a test on the glass sky pad and then I'm gonna go back and do a third final test on the LTT desk pad. And we'll see what I like the most. I haven't done an aim lab in Counterstrike in like forever. I don't know how this one works. To be fair, this is a mouse that I never use, probably great for Shroud. Not great for me. - [Man] Excuses. - Yeah, it's pretty much excuses, 100%. Took me like five shots. Hey, that guy hit twice, that's not bad. I'm getting there and that's why this is the warmup. 'Cause I haven't played Counterstrike in forever. Cool. Counter terrace win. I've got like three head shots. Okay. Let's see how precise it is. And like I said, we can't-- It looks good. It feels like it's pretty bang on. But I don't feel like the LTT desk pad wasn't bang on, you know what I mean? And it does feel a little lighter. It actually does feel a little easier to slide. Sorry, I was kinda busy toying with the keyboard and trying to shoot these guys in the head. Totally hit that guy in the face. Now that I'm not doing big circles, like it's pretty quiet. When I'm just doing these small movements. Do you guys hear it? Like you heard it before? I don't think so. - [Man] I'm hearing the fan. - Yeah, the laptop fan doesn't help. Don't get me wrong. Yeah, that's still quieter. It's not bad though. Like, I could deal with this. Yeah, it's not enough to really take you out of the game. And especially, because you're probably gonna be wearing headphones or have like speakers blasting game audio. I don't remember the patterns anymore. I used to have the M4A1 pattern kinda memorized. Yeah, I don't know. It's not that I dislike the glass. I think it's perfectly fine. It's just that I kinda like the desk pad a little better. It's a little quieter. It feels just about as smooth. And I do feel like we're doing it a bit of injustice by not giving the feet a replacement. But that's-- - [Man] It's consistent. - It's consistent, yeah. I don't know if it was the razor one, it was basically a copycat of the razor. That was just like a metal and plastic mousepad and it was okay. It was perfectly fine. But I had the same problems that I'm getting with this in that whenever you do bigger sweeping motions, frankly it's just kinda loud. And if you're gaming and you're trying to be quiet, you know, you're off in the corner of a living room or something and your family or whoever is watching TV next to you, they're gonna be-- You know, they're already kinda mad about all the clicking and stuff going on. They don't want to hear this as well. That being said, it's okay. I think with their cool Teflon feet that they're offering for like eight bucks, if you're already spending a 100 dollars on this, you might as well go for the extra and get the eight dollar Teflon feet. That might fix things a little bit. But yeah, that's just gonna help with like how it sounds with moving and stuff. We can't tell if this is perfectly accurate when it comes to tracking. It feels about as accurate as ours. But this is pretty accurate. It's not as accurate as the Fanatic mousepad is what we kind of base as our gold standard. But it's pretty close. As for this, like I said, we can't tell without a lot more testing. But just feeling like it felt pretty accurate to me. But my problem is twofold. One, I'm not crazy about the logo. It's not even a bad logo. I just, I tend to-- Just design. I love how this is just blue. Give me a logoless version that has like more blue and I'll be even more happy. But my other really big problem, it comes down to the feel and the sound. It sounds like there's kinda something scraping. Even though we wiped down both the mouse feet and the desk pad multiple times. And it also kind of feels like it too. Whereas where if there's stuff on a desk pad, you don't really feel it unless it's like a piece of fabric snagging on feet that are so worn away that you should probably replace them at that point anyway. - [Man] Or Doritos. - Or yeah, maybe you eat a lot of Doritos and it gets covered real quick. But you know, on that case, you should spend more money on Doritos and less money on professional gaming peripherals. Would I buy it? Probably not. If you're going for a very specific aesthetic, you like the logo, you like the way it feels, this is probably the one for you. I mean, I don't think you're going to get another hard surface gaming mousepad that is this accurate, supposedly. But, you can find a cloth one for much cheaper, right. Like LTT, 30 bucks. Not even LTT. Get somewhere else. You know, I'm not trying to be biased. Get any other desk pad for like 30 to 50 dollars in a much larger size, you know. You can cover your whole desk. I don't hate this thing. I think it's okay. I just probably wouldn't go out and buy it myself. John has just checked for me, Fanatic is selling their mousepad for like 55 dollars. How big was that one? So that's the Dash mousepad and that's 950 by 500. So like, that's way bigger than this thing and you're paying about half the price. I think, you know, unless you're looking for a hard surface, you can find something else. - [Man] Skip it! - Yeah. I hate saying skip it. I feel like someone always wants something. I like finding the silver lining in stuff and it's a little difficult for me to find the silver lining in this one, I think. - [Man] It's easy to clean! - Yeah, it's easy to clean, you got that right. It's easy to clean, you know. If you're in a spill proof kind of desk environment you wanna create then get this. It's never gonna wreck-- You know, maybe just don't drop it on the floor, you're probably okay. If you like this SE, check out the one where Linus unboxed all of the LTT desk pads and then you can kind of see the other sizes and quality and material that we're offering here. And then you can make a more informed decision. - [Man] We didn't cheat vote, we did a lot of testing. - Yeah, we didn't cheat vote. We did a ton of testing. Thanks for watching.",
    "transcript_keywords": [
        "Yeah",
        "desk pad",
        "LTT desk pad",
        "feet",
        "desk",
        "Teflon feet",
        "kind",
        "pad",
        "mousepad",
        "super",
        "LTT desk",
        "pretty",
        "feel",
        "desk pads",
        "LTT",
        "mouse",
        "feels",
        "Teflon",
        "gaming",
        "dollars"
    ],
    "transcript_entity_values": [
        "30 dollars",
        "1.8",
        "30 US dollars",
        "two feet",
        "45 centimeters",
        "DTI",
        "M4A1",
        "30 to 50 dollars",
        "100%",
        "all day",
        "40 bucks",
        "three",
        "One",
        "a ton",
        "Shroud",
        "one",
        "Riley",
        "20%",
        "100 plus dollar",
        "37",
        "Counterstrike",
        "the summer",
        "2XL",
        "Esports",
        "Fanatic",
        "35 centimeters",
        "Amazon",
        "2.0 XL-- - Yeah",
        "97 US dollars",
        "8.50",
        "Fanatic",
        "eight bucks",
        "LTT",
        "Japanese",
        "hours and hours and hours and hours",
        "John",
        "a 100 dollars",
        "Wheatwacker",
        "Skypad",
        "Ittstore.com",
        "eight dollar Teflon",
        "50",
        "third",
        "20 or 30 bucks",
        "about 3.7 millimeters",
        "XL",
        "100 bucks",
        "Dash",
        "Teflon",
        "3.0",
        "370",
        "100 dollars",
        "55 dollars",
        "8.50",
        "two",
        "950",
        "4.0",
        "3.2 millimeter",
        "300 by 350 millimeters",
        "30",
        "30 bucks",
        "500",
        "450",
        "about half",
        "Doritos",
        "Counterstrike",
        "Linus",
        "five",
        "30",
        "zero"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERCENT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "NORP",
        "MONEY",
        "ORG",
        "NORP",
        "TIME",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.017215747386217117,
        -0.10140381753444672,
        0.001539986697025597,
        -0.11099249869585037,
        0.06778134405612946,
        -0.0347452312707901,
        0.057338159531354904,
        0.029956085607409477,
        -0.028349176049232483,
        0.04017932713031769,
        0.018543219193816185,
        0.03444588929414749,
        -0.04348280280828476,
        -0.006950817070901394,
        0.06317271292209625,
        -0.01042200531810522,
        0.09724540263414383,
        0.019741060212254524,
        0.03713425248861313,
        -0.04450814425945282,
        0.0077915675938129425,
        -0.030866188928484917,
        0.05408831685781479,
        -0.02538645640015602,
        -0.0029572886414825916,
        0.012600313872098923,
        -0.002989634871482849,
        -0.09173130244016647,
        -0.06186051666736603,
        0.027776198461651802,
        -0.04503913223743439,
        -0.014170126058161259,
        -0.07255786657333374,
        -0.03596576303243637,
        -0.035248249769210815,
        -0.1005609855055809,
        -0.0471775084733963,
        -0.0855427011847496,
        -0.016319049522280693,
        -0.0748600959777832,
        -0.059797585010528564,
        -0.01104443334043026,
        0.058895450085401535,
        0.0031227441504597664,
        0.03606073185801506,
        -0.014291261322796345,
        0.07826519757509232,
        0.007254326716065407,
        0.009593290276825428,
        0.06220076605677605,
        0.019111068919301033,
        -0.06415414810180664,
        0.05045466870069504,
        -0.07308271527290344,
        -0.05723591148853302,
        0.06501063704490662,
        -0.017804203554987907,
        -0.0206131674349308,
        0.03341161832213402,
        0.04640738666057587,
        0.057367511093616486,
        -0.03076772578060627,
        -0.05754661560058594,
        0.01284126564860344,
        -0.0027259273920208216,
        -0.04367470368742943,
        0.0638168528676033,
        0.012031849473714828,
        0.05178329721093178,
        -0.007378567010164261,
        -0.06502804905176163,
        0.06489268690347672,
        0.025855984538793564,
        0.05832365155220032,
        -0.06761281192302704,
        -0.03450815752148628,
        0.0288870669901371,
        0.030510954558849335,
        0.05237497389316559,
        0.014463573694229126,
        0.014754527248442173,
        0.012535491958260536,
        0.002680652542039752,
        -0.006168136838823557,
        0.07641127705574036,
        -0.07507109642028809,
        0.026668064296245575,
        0.08866304159164429,
        0.00708577036857605,
        -0.059003137052059174,
        0.09062696248292923,
        0.07394460588693619,
        -0.04909104108810425,
        -0.016336949542164803,
        -0.012807751074433327,
        -0.02156933769583702,
        0.0826825425028801,
        -0.003203981788828969,
        -0.10468600690364838,
        0.004884797614067793,
        0.010725511237978935,
        -0.01884753257036209,
        0.046867936849594116,
        -0.023227490484714508,
        -0.010383603163063526,
        -0.03596613183617592,
        -0.0003622194053605199,
        -0.032305844128131866,
        -0.05497276410460472,
        0.01948467083275318,
        -0.07473612576723099,
        -0.06825286895036697,
        -0.1362563669681549,
        0.03693001717329025,
        0.023430515080690384,
        0.010454509407281876,
        0.02215600199997425,
        -0.011772455647587776,
        0.07763068377971649,
        -0.009715117514133453,
        -0.03242037817835808,
        -0.04002659395337105,
        0.011800484731793404,
        -0.03344370424747467,
        0.024442091584205627,
        0.05565020442008972,
        -0.05210394784808159,
        4.072866785724478e-33,
        -0.007059731520712376,
        0.09215348958969116,
        -0.03762829303741455,
        -0.1322525441646576,
        -0.019548196345567703,
        -0.009929983876645565,
        0.021630382165312767,
        0.005041787866503,
        0.048980165272951126,
        0.04614666476845741,
        -0.07478344440460205,
        -0.0762791782617569,
        -0.0905994102358818,
        -0.002774495631456375,
        0.09949745237827301,
        -0.05825201794505119,
        -0.022640757262706757,
        0.01609530858695507,
        -0.03253975883126259,
        0.022158322855830193,
        -0.010014865547418594,
        0.01661309227347374,
        -0.009754250757396221,
        0.011198772117495537,
        0.0568414106965065,
        -0.024609556421637535,
        -0.038273170590400696,
        0.01858304627239704,
        -0.024838095530867577,
        0.04180178418755531,
        -0.01267984788864851,
        -0.0577094592154026,
        -0.041601281613111496,
        -0.02121114172041416,
        -0.01866046153008938,
        -0.02317272499203682,
        -0.09536795318126678,
        -0.09894053637981415,
        0.0686267837882042,
        -0.049342744052410126,
        -0.12276209890842438,
        0.1076120063662529,
        0.032339908182621,
        -0.0893595963716507,
        0.03426629677414894,
        0.04066278785467148,
        -0.03631434589624405,
        0.010776576586067677,
        0.012972800992429256,
        -0.07172881066799164,
        -0.0582507960498333,
        0.01830046996474266,
        -0.06577227264642715,
        -9.480989683652297e-05,
        -0.03707592189311981,
        -0.0772261992096901,
        0.0631188228726387,
        0.023820120841264725,
        0.024679752066731453,
        0.057617876678705215,
        -0.002367800334468484,
        -0.08050593733787537,
        0.038344547152519226,
        -0.024226736277341843,
        -0.031100021675229073,
        0.056018419563770294,
        0.04597121477127075,
        0.034658171236515045,
        -0.07637306302785873,
        -0.04721210524439812,
        0.04593940079212189,
        -0.08603116869926453,
        0.053280387073755264,
        0.020817110314965248,
        0.023426609113812447,
        -0.014041819609701633,
        -0.004790282342582941,
        0.0022785565815865993,
        -0.09723568707704544,
        -0.04000401869416237,
        -0.01778159663081169,
        0.07483385503292084,
        -0.02224934846162796,
        0.014980819076299667,
        -0.006726057268679142,
        0.0076011535711586475,
        -0.019421959295868874,
        -0.005077817477285862,
        0.007440116256475449,
        -0.07597712427377701,
        0.020413300022482872,
        -0.013492466881871223,
        0.007075591012835503,
        -0.014486169442534447,
        -0.05718651041388512,
        -5.061277537193552e-33,
        -0.06633753329515457,
        0.0033450983464717865,
        0.031482916325330734,
        0.07627737522125244,
        -0.022226404398679733,
        0.021677127107977867,
        0.03933705389499664,
        -0.03814634308218956,
        0.038780536502599716,
        -0.10696765035390854,
        -0.022758271545171738,
        0.08911881595849991,
        -0.06198379397392273,
        0.019277876242995262,
        0.012555455788969994,
        0.026298848912119865,
        -0.03460075706243515,
        -0.01901240646839142,
        0.06847193092107773,
        -0.10178039968013763,
        0.20064355432987213,
        -0.014301931485533714,
        0.050924867391586304,
        0.018760351464152336,
        0.03053911216557026,
        -0.08697406202554703,
        0.0351174958050251,
        -0.013843889348208904,
        -0.052933868020772934,
        0.047681428492069244,
        0.0025599387008696795,
        0.07582562416791916,
        0.09557092934846878,
        0.0063684722408652306,
        0.1263313889503479,
        -0.06160168722271919,
        0.06333328783512115,
        -0.019418656826019287,
        -0.029675304889678955,
        0.002560641150921583,
        0.07083594799041748,
        0.052477963268756866,
        0.09362711012363434,
        -0.037025000900030136,
        0.03219395875930786,
        -0.039864953607320786,
        -0.07668455690145493,
        -0.008432834409177303,
        0.030864665284752846,
        0.04071107506752014,
        -0.030904443934559822,
        -0.030616765841841698,
        -0.02376762218773365,
        -0.03228403255343437,
        -0.02479465864598751,
        -0.052544672042131424,
        -0.005164615344256163,
        -0.007005834951996803,
        -0.05719398334622383,
        -0.00782052893191576,
        -0.07536724954843521,
        0.1039319708943367,
        -0.029431510716676712,
        -0.007214176468551159,
        0.03446068987250328,
        -0.0051831877790391445,
        0.03879326581954956,
        0.0749814584851265,
        0.07153557986021042,
        0.036478348076343536,
        -0.07267395406961441,
        -0.0642230212688446,
        0.03859364986419678,
        0.04756731167435646,
        0.008999796584248543,
        0.04632609710097313,
        0.10524774342775345,
        0.011908524669706821,
        0.0340515673160553,
        0.014242482371628284,
        0.025486836209893227,
        0.04903092235326767,
        0.06321125477552414,
        0.07586440443992615,
        -0.02049240469932556,
        -0.001917288638651371,
        0.03152550011873245,
        -0.034324079751968384,
        -0.060719870030879974,
        -0.005205798894166946,
        0.05544865131378174,
        -0.0038860130589455366,
        0.006906556431204081,
        0.04777044057846069,
        -0.0063018701039254665,
        -4.939942499504468e-08,
        -0.007707463577389717,
        0.04548383504152298,
        0.06277666240930557,
        0.031097857281565666,
        -0.04824809357523918,
        0.01187860406935215,
        -0.01304967887699604,
        0.055661365389823914,
        0.008627159520983696,
        -0.04961937665939331,
        -0.005119056440889835,
        -0.046709708869457245,
        0.04751886799931526,
        0.007852770388126373,
        0.044333018362522125,
        0.056289732456207275,
        0.013613143004477024,
        0.0833631381392479,
        -0.05991654843091965,
        -0.03371863439679146,
        0.08853454142808914,
        -0.015939917415380478,
        0.10717329382896423,
        -0.013519295491278172,
        0.010332716628909111,
        0.022539697587490082,
        -0.10793639719486237,
        0.05649184435606003,
        0.013350537978112698,
        0.009962196461856365,
        -0.01297121774405241,
        -0.0034243599511682987,
        0.10549057275056839,
        0.048343949019908905,
        0.015389698557555676,
        -0.041341084986925125,
        -0.05116967484354973,
        0.014808040112257004,
        -0.02270413562655449,
        0.057467952370643616,
        -0.050495464354753494,
        -0.11751079559326172,
        -0.00862786266952753,
        -0.025472644716501236,
        0.017288681119680405,
        -0.07078570872545242,
        0.011371683329343796,
        -0.09917451441287994,
        -0.03935196250677109,
        0.05996966361999512,
        0.03141191229224205,
        0.02105158008635044,
        0.05470522493124008,
        -0.02297224849462509,
        0.03906995803117752,
        -0.028095668181777,
        -0.05843113362789154,
        0.029328742995858192,
        0.07073454558849335,
        0.015424965880811214,
        -0.022617774084210396,
        -0.03700660169124603,
        -0.03754562512040138,
        0.12411455810070038
    ]
}