{
    "id": "IbOO2t1Ng-E",
    "title": "Target vs Walmart Tech CHALLENGE!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-06-13T15:03:23Z",
    "video_url": "https://www.youtube.com/watch?v=IbOO2t1Ng-E",
    "category": "Science & Technology",
    "tags": [
        "walmart",
        "target",
        "tech",
        "vs",
        "unboxing",
        "this is",
        "matt",
        "matt ansini",
        "austin",
        "austin evans"
    ],
    "views": 335075,
    "likes": 10599,
    "comments_count": 512,
    "description": "Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Walmart+ vs Target Circle 360 1:51 Delivery Issues 3:00 Tablet 5:12 Budget Headphones 6:27 Premium Headphones 8:10 Streaming Box 9:40 Audio 11:30 Wild Card 14:31 Car Tech",
    "description_links": [
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- Walmart and Target are unlikely places to buy tech, but today, we're going to find out is it actually worth it? So this all stemmed from a This Is that Matt and I did a few months ago. - It's like a year ago man. - [Austin] Was it? We have looked at Target versus Walmart Tech in the past or at least we looked at them individually. - [Matt] Individually. - And there's a surprising amount of stuff. So what we're going to do is we're going to sign up for the top tier Walmart Plus versus Target Circle 360. We're gonna try to get all the tech we can and we're gonna evaluate what's better, Walmart or Target. I'm gonna start out by signing up for Walmart Plus. $0 delivery fees, the same low prices as in stores, I don't think that's a selling point. I also have Paramount Plus essential. Oh, so let's just see what mom needs, what kind of tech I need from mom? An onn tablet? Now if you're unfamiliar onn with two Ns is the Walmart house brand for tech. - [Matt] I'm gonna shop deals that are specifically for Target Circle and immediately looking at it, it is definitely more household. - What? That makes sense though. - Yeah. First of all it's tech and entertainment is the category and most of them are magazine subscriptions. I will be honest, this is really disappointing. I can get a Hyundai refurbished tablet- - [Austin] Oh god. - [Matt] For $60. Also, speaking of onn, they have a 4K Google TV streaming box for 20 bucks. I'm gonna look specifically then for Target branded stuff, which is heyday. - [Austin] How about a $29 soundbar? I'm actually kind of down with that. - So I'm jealous of what you're able to find over there. It's because, again, the stuff I'm finding here is just not great. - The only shot that Target has here is that you're gonna get a bunch of cool looking stuff that's gonna show up faster. 'Cause a lot of your items do look like they're gonna show up faster than mine, but like I feel very confident in the stuff that I have found here on Walmart. Like there's a lot of really good stuff. So we have placed our orders, we have our items, but before we actually unbox them, the delivery process was interesting- - Janky. - So for Walmart, I ended up having two items that were delivered same day, took about five hours, but it wasn't too bad and everything showed up, it was fine. Pretty straightforward, no problems. - So, I put everything in a cart and I hit order and it's like hey, your order was successful. It just didn't checkout like half of my items. A bunch of it showed up at your house and not the office. - That is true. Now I heard a rumor- - Yep. - That your free delivery was in fact not free. My free delivery was a lie. So the difference between Walmart and Target is what I'm learning is that Walmart at no point asked me to tip to do anything like that. It was just, you know, the stuff got delivered, the end. But Target not only did the person, the delivery person actually text saying, hey, I'm about to leave the store, is there anything else you want? Which is very nice. But it got me thinking of either you gotta expect to pay the tip on the free delivery which can quickly add up to way more than the price or alternatively, on Walmart the person's not making any money? Maybe there's a tip screen somewhere that I missed. So I've got- - I have- - An onn Android tablet, - A Hyundai My tab. - [Austin] Isn't it Hy tab? - Yeah, I couldn't read that font. - [Austin] So what kind of spec are you looking at? Because I've got a seven inch display, a 2.2 gigahertz, octa-core processor with three gigs of RAM. - Mine is a quad-core with one gig of RAM. - Well, I will say that I am feeling actually pretty good about mine. So this was a $60 tablet, that's pretty cheap. That's pretty much on par with like the very low end like Fire tabs. Oh, look at that orange. - [Matt] Yo, that looks nice. - That actually looks like not a garbo tablet. Yours looks like a Fisher-Price toy from 2012. Yours also smells bad. Yeah, smell the difference between the two. - Yeah. Oh. - I got a mess. - Mine comes- - You got a case? - Mine comes with a floppy case. - That's for kids, man. Don't make that noise. So when you turn it on, does it start playing Cocomelon or- - I dunno, I'm not gonna use this case. - This is an actual mess, like I'm trying to get all this off. It is gonna take me a while and it's very crumbly. You actually have 3G on that, that's kind of wild. - [Matt] SIM and SD card slot. - [Austin] Wow. You have, I mean not that you're gonna wanna do it, but you- - Well is 3G even still active? - Oh, right. Yeah. - Well, in America. - Aye! - [Joanna] It's onn. - It's onn. My screen's pretty bright though, I'll tell you that. Like it's actually, you know, it's low res, actually looks pretty good. I bet this will be fine for video. - The fact that the animation just starred up at about two FPS is not a good sign. - Can I just say that the keyboard is themed so it's slightly orange just like my tablet. You see that? It's pretty good, right? - Mine turned off. On one end, we're gonna be building the most- Speakers are bad. - [Matt] They're not good. Oh look at, look how zoomed in the front facing camera is. You know what though? This thing for 60 bucks. - This is not a fair comparison though because I mean I look good on everything. - If this is how we're starting for Walmart, man, this is impressive. - I'm nervous now. - You should be. Next up, we've got some headphones. So these are what the? What? What the? What? What are? What do? What do? Wait, did you not get the memo that was supposed to be wireless? Is that a wire on this? - [Matt] I went for style, right? - Yeah. I will say that mine actually pretty good, so they have the earbuds as well as the case. So I'm gonna pair mine up with my tablet, of course, to properly evaluate it. - So here's my problem. - You don't have anything with AUX? - I was planning on using my tablet. - Is it still not charged? - No. (upbeat music) - Wow, these actually have some real bass. These are like one, they're really comfy, like really comfortable to wear, and then you could just see how there's nothing inside of them because of it's, 'cause of how... Do you want me to show you how to twerk? You're like, what you do is... These are pretty good too. - [Austin] Both of them are bassy, which is kind of normal for like a cheap headphone. - [Matt] Yeah. - Like you crank the bass up to kind of make them punch a little bit more. I would probably lean on more towards the Bluetooth earbuds, I think that's gonna be more common for more people, but actually, I say, this is a draw. - Oh- - These look- - This is never gonna run out of battery- - True. - And this lets you express yourself in ways that this one doesn't. - So for round two, do we should give Walmart and Target both a pass here? - [Matt] A draw. - Let's take the budget up a little bit with round three. I have some active noise cancellation over ear headphones. - [Matt] I also have some active noise cancellation headphones, but they're earbuds. - Obviously, there are a lot of very expensive over ear headphones, but these have a lot of the similar specs for way, way less. Yo actually, those look expensive, right? It's got like the matte finish on them, yo, dude. - [Matt] These are looking pretty good. - [Austin] Yeah? - Look at these. Look, the sleek it's- - Those just look like earbuds though. I don't, there's nothing special about the way they- - Okay, I'm trying to compete with yours. - Well you can't compete with Walmart. Some call it Goatmart. - Pass out, wake up, faded, faded. We might be the two whitest people on the planet right now. - [Joanna] I was just thinking that. - Thank you. - [Austin] I would almost argue that it's a little bit more of a neutral sound, but it's actually not that much better, but I do have ANC, so if I toggle it on. - Are you able to hear me when it's on? Hello? - So here's the thing, it is like the lightest, most basic version of all these things. Like listen to the ambient sound on that. - Okay, this. Wow. Oh, this just sounds echoy. - Okay, these actually pretty good. They actually sound the best out of all the headphones we've tried, these are good in almost every single way. For 50 bucks you're getting a comfortable, stylish, they don't feel super cheap, they do have okay ANC, the biggest problem is really just down to the audio quality being, I would say- - You mean the number one thing that a headphone needs to do? Have I tied it up with my Target finds? - Yeah, I think Target wins this one. - And you've been fading on that one. - No, no this is, dude, your tablet's still not even charged. It's been like an hour already. - That's fair, that's fair. - Next up we're going to go with something a little different. So both Walmart and Target have a variety of streaming boxes available. Mine, I'm actually really excited for, this is an onn Google TV streaming box for only $20. What you got over there with your Fire TV that's already set up? You just said up because you knew it was gonna take a long time. - Yeah, I did. - Do you see like JPEG artifacts? - Yeah. - Like why does it look so like- - [Matt] Yep, 100%. - [Austin] Like compressed or something. - I'll say the Prime Video one is the worst, which is ironic 'cause like- - It's just very like- - [Matt] Someone googled Prime logo and then just- - [Austin] Yeah. - [Matt] Copy pasted. - Mine is like an actual little like streaming box. It just has micro USB and HDMI. I'll give them a pass for the micro USB because you'll plugging in to your TV and never look at it again. Oh you don't even have YouTube pre-installed. Well, to be fair that, no, that's fine, that's fine. - Okay, yeah, that's fine. - That's one click for the first time. - Though, but like here's my, here's my pet peeve, if it's right there on the home screen- - [Austin] It should be installed. - It should be installed. - [Austin] Yeah. Wait, what is? Dude, this is too slow, man. This is really slow. - This yes. - Yes, you know what my favorite comedy \"80 for Brady.\" A true cinema masterpiece. Now I've got the onn set up, and I'll tell you that I actually really like Google TV. At home I actually use a Chromecast and this is basically the same thing and like you see the interface actually like pretty snappy. - That is much snappier. - Look at that, look. And there's a lot more stuff on screen too, like I'm just flying through this. While you might be a little bit sus on Walmart branded tech, so far everything we've gotten has been fairly ad free, not a lot of bloatware. I mean the tablet had basically nothing, this has basically nothing like. Is there any downside? Why would you not pick this? I'm not compensating, it's fine. An onn soundbar. So you got Bluetooth, HDMI and it is Roku TV ready. I will say that for optimal audio quality, normally, you wouldn't use Bluetooth to connect your soundbar. Yes, there's gonna be no cables, but you're gonna be losing a little bit of audio quality. However, the actual monitor that we're using here, 'cause this is not a TV, doesn't have HDMI out, so this is the best way we've got it, but, we'll do it to give them like a fair shot. - I also have- - [Austin] What? What? - [Matt] A speaker. - I got 140 watts, what do you got over there, five? - [Matt] I got, well it doesn't really tell me, because, again, they don't put the specs on here. And welcome to This Is. iPad. - This is legitimately not bad. For 30 bucks, man, you could actually just treat this as a big, nice sounding Bluetooth speaker. - Oh, who wants to do that? You're at the beach with your friends. - [Austin] I take this to the beach with me. - [Matt] What we have here is a tiny boy. - [Austin] Oh, okay, I will give you- - [Matt] And- - [Austin] It's still clear. It's the same as the headphones, it looks very nice. There's a brand new Apple event that just wrapped up this morning. - That sounds pretty good. - It's not bad. - It's quiet, it's not the loudest thing in the world. - Surprise, surprise, little thing is not as loud as a big thing. I still think my onn, I would make the argument that this is a better overall value just because of the sheer watts per dollar is off the charts. Obviously, we're comparing apples to oranges here. - No, here's my apple to orange comparison. How does yours sound now? - Not good. How do we decide this? I'm literally like to keep to pick onn here. - I think I'll just give myself the point on that. - Or wait, how about y'all help? Which one of you, which one do y'all prefer? - Right now, I am more so in need of a Bluetooth speaker, like a small form. - Joanna's got it. - [Alex] I think I would also pick the Bluetooth. - Ah! - Woo-hoo! - So for this next item, Matt and I decided that we would each get a wild card because I found something on Walmart that I had to get and there was no Target equivalent. So, I know what you have, but I've got an onn gaming monitor. - Okay. - This is an curve, ultra wide, 1440P, 100 hertz monitor and it was a low, low price of $199. - What? I have not one, but two Moto G unlocked phones for also 159, but then they were no longer on sale when I went to go buy them. So I believe they were 199. One of these is the one that went to your house, I'm gonna need you to return it for me. It is 5000mAh batteryz and 6.5\" 90 hertz display. - Matt, you give me some specs. It's a smartphone, I need to know what am I getting here?- - What did I just, I literally just told you the specs. Can we rewind that real quick? - What specs did- - You, editors can you rewind that? It's 5000mAh battery and 6.5\" 90 hertz display. - Can you just take a look at my curve? That is an aggressive curve. Hello, it is me, on onn the beans my friends. Look at the beautiful 34 inch WQHD, 100 hertz curved gaming monitor. Everyone ready for a 100 hertz of 34 inches? Whoa! Wow! This is the biggest thing I've ever seen. Austin, what do you got there? Are you selfieing it? - Yeah. - Turn it around to the rear facing. What are you doing? - Because I'm vlogging like a, that is, that does look. Oh. - That's actually not bad for front facing camera. - That's a pimple. - I'll tell you that you are kind of getting what you pay for, just looking at this panel. It is big, it is curved, it is a 100 hertz. The problem though is the image quality is quite low. I mean, if you're just in a game and you don't care about like the color, like this doesn't look bad. The problem is though, is that like you've got banding here, which doesn't look great for most things. - [Matt] Yeah. - But, I would challenge you to find another large format, high resolution, high frame rate gaming display for anywhere near this kind of price, like, I mean- - Just adjust your definition of a gaming display because this is high resolution, high refresh rate. This is only 10 hertz less than this one. - If you lower your expectations just a little bit on the pure raw image quality, I still think that this is the winner here because the Moto G Play is fine, there's nothing wrong with this phone. It's a perfectly reasonable little unlocked $150 phone, it's great. The problem though is that at this kind of price point, in a lot of cases you should probably just get something refurbished. You can get a pretty decent like couple of year old like Galaxy S21 or something at this kind of price point. Whereas you are gonna be hard pressed to find any kind of big, curved, ultra wide, high res, high resolution, high frame rate monitor in anywhere near $200, right? It's better, it's just a better, look, it's not perfect but it's good. - I'm gonna get mad about something I'm not really invested in. - What if we settled this with the final item that we have purchased from both Walmart and Target and weirdly enough we actually got similar and yet distinctly very different things. So for these items we've come out to the car because we've gotten some unique car accessories. This is the onn FM Bluetooth dongle. It has not only the ability to charge your phone. Oh, yes. You also have the ability to turn Bluetooth into FM radio. - So I got a Motorola wireless Android Auto adapter, so- - You actually use, you used to use one of these, right? - I still do. - The way that that works is, my understanding at least, is that you need a car that still supports Android Auto- - [Matt] Android Auto. - But this just turns it to wireless. - Yeah. So what this will do is it does depend on what the, whether the phone can handle that or not. - This is high quality in action. It is plastic, it is 12 volt outlet shaped. And I've got myself a variety of things, I have a couple of USB-As, a one amp and a 3.1 amp, and a USB-C. And importantly, you've got all of your options, including you got a microphone here. So now, that I've got my party mode here, which is real great, although I can hit the button and I can change the mode. So I get a little bit of RGB, in my 1997 Cutlass. - I see R and G, I don't see any B. - [Austin] So I need to find a frequency that's completely open, so if I go to station list, can I actually do that manually? - Have you ever used one of these before? - I don't listen to radio. I'm telling you 89, like this is usually what it is. - I review tech for a living yet I've never used tech ever before in my life. - I don't use FM radio. Why would I use FM radio? All right, so now, I have paired via Bluetooth. So my phone is now charging with that lovely 3.1 amp connector. I am connected via Bluetooth to that and then that is now transferring on 89.9 FM radio to the car. - [Matt] 89.7. - [Austin] 89.7, whatever. - [Matt] Hello and welcome to This Is. Today we are feeling- - That doesn't sound bad. - No. - For literally $10, yeah, you heard me right, $10, you've got yourself not only a Bluetooth and FM radio, you got your party mode and importantly, you can just use this as a charger. You got USB-A and USB-C. - Mine was a little bit more expensive, just a little bit. - Okay, why don't we even see if yours works. - Yeah. - So I'm gonna unplug this. Oh, hey, \"Welcome to Android Auto.\" - [Matt] Yeah! - Wait, wait, Matt. - Oh. - It uses Wifi, you don't have a SIM card in this phone, so, so basically- - So, yeah. It wouldn't work because your Wifi is stuck using Android Auto. So this only works if you've got a cell signal. - Okay. - Or something downloaded on the phone. - Okay. - Normally, you would, if you had actually put a SIM card in here. - Yeah. - Okay, so the one in your car that you use every day is 200? - Yeah, it's 200. - How much was your Android Auto only Motorola guy? - [Matt] 70 bucks. - You mean seven times more than mine? - Yeah. - I don't know man. I think this would be okay if it did CarPlay as well, but because it only works with Android Auto, like mine works with anything with Bluetooth. - Well, it's Motorola. - Yeah. - Since when does Motorola make iPhones? - Mine is one seventh the price, has charging. How are you gonna charge your phone? Because guess what? The USB port is now taken up so you have no way to charge your phone. I have three ports. - [Matt] I can use your device to charge my phone now. - Yeah, when you buy mine because mine's superior. I think that Walmart takes the win here. Walmart items, I think, were still on the whole slightly better. And importantly, the Walmart shipping was also better. But I will say is that when we're going head to head with Walmart Plus versus Target Circle 360, I'm pretty sure Walmart gets the win this time. - So where I think that Target does pull ahead is not with electronics. Realistically, like what we, Target 360 was for was for like groceries. - [Austin] Sure. - Toilet paper, stuff like that. So I think we might have had a, like a little bit different of an outcome if we had tried things like those, but we don't look at those on this channel, we look at at tech stuff. - Also, importantly, I have a free subscription to Paramount Plus now. But, let us know what you think in the comments below. Not only about these subscription services, but also just about the items we got. Like, subscribe, follow. You can watch Matt on This Is where we make videos that are just the same kind of energy. So if you like this, you'll like This Is, and, I don't know, Walmart. (techno music)",
    "transcript_keywords": [
        "Walmart",
        "Target",
        "Yeah",
        "Android Auto",
        "Bluetooth",
        "Target versus Walmart",
        "pretty good",
        "Target Circle",
        "mine",
        "Pretty",
        "good",
        "versus Target Circle",
        "onn",
        "tech",
        "Walmart and Target",
        "kind",
        "Android",
        "stuff",
        "Android Auto Android",
        "Auto Android Auto"
    ],
    "transcript_entity_values": [
        "a few months ago",
        "Roku",
        "America",
        "only $20",
        "Walmart Plus",
        "ANC",
        "iPad",
        "first",
        "Welcome to Android Auto",
        "two",
        "Matt",
        "0",
        "80",
        "60",
        "one",
        "WQHD",
        "Ns",
        "a year ago",
        "an hour",
        "Galaxy S21",
        "5000mAh",
        "$60 tablet",
        "USB-C. - Mine",
        "Cocomelon",
        "Cutlass",
        "159",
        "seventh",
        "CarPlay",
        "iPhones",
        "30 bucks",
        "only 10",
        "Walmart",
        "6.5",
        "Target 360",
        "Paramount",
        "USB",
        "hertz",
        "Austin",
        "34 inch",
        "199",
        "Matt] Yo",
        "YouTube",
        "Bluetooth",
        "seven inch",
        "90",
        "Joanna",
        "Moto G",
        "100 hertz",
        "3.1",
        "Target",
        "Yo",
        "12 volt",
        "same day",
        "Goatmart",
        "seven",
        "today",
        "K Google TV",
        "1997",
        "Fire TV",
        "1440P",
        "Target Circle 360",
        "like half",
        "10",
        "2.2 gigahertz",
        "about five hours",
        "RGB",
        "Apple",
        "HDMI",
        "100%",
        "this morning",
        "60 bucks",
        "199",
        "200",
        "Target",
        "89",
        "89.9",
        "SD",
        "Android Auto",
        "One",
        "Paramount Plus",
        "First",
        "Fisher",
        "29",
        "100",
        "70 bucks",
        "three",
        "50 bucks",
        "onn",
        "20 bucks",
        "Motorola",
        "Android",
        "RAM",
        "Chromecast",
        "Hyundai",
        "150",
        "140",
        "Target Circle",
        "about two",
        "Bluetooth and FM",
        "4",
        "Today",
        "2012",
        "Google TV",
        "five",
        "like couple of year old",
        "200",
        "Brady",
        "the onn FM Bluetooth",
        "34 inches",
        "Walmart Tech",
        "3"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "TIME",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.04809170216321945,
        -0.025344185531139374,
        0.039581213146448135,
        -0.07017921656370163,
        0.11548255383968353,
        0.0682801753282547,
        0.06033066660165787,
        0.04807927832007408,
        -0.045740269124507904,
        -0.00340748718008399,
        0.0051252711564302444,
        0.025378473103046417,
        0.03526841476559639,
        -0.04821900650858879,
        0.10443603992462158,
        -0.060605645179748535,
        0.0726236030459404,
        -0.07634181529283524,
        -0.0012758898083120584,
        -0.03385833650827408,
        -0.04140397906303406,
        -0.06584154069423676,
        0.008944072760641575,
        0.03795787692070007,
        -0.05235833302140236,
        0.05968090519309044,
        -0.0491698682308197,
        -0.06692273914813995,
        -0.06653722375631332,
        -0.01140510756522417,
        -0.03983215242624283,
        0.05031479522585869,
        0.009484278038144112,
        -0.03785393387079239,
        -0.057283539324998856,
        -0.09782451391220093,
        -0.023579003289341927,
        -0.04466012492775917,
        -0.01008308120071888,
        -0.04616450145840645,
        -0.03783506527543068,
        -0.05711330845952034,
        -0.04925759881734848,
        -0.018892984837293625,
        -0.05650642141699791,
        -0.06994525343179703,
        0.03344805911183357,
        -0.039688486605882645,
        0.005956152454018593,
        0.01379355788230896,
        0.03943001478910446,
        -0.06821779906749725,
        0.05023164302110672,
        -0.040350474417209625,
        -0.030152253806591034,
        0.07212991267442703,
        0.0013293531956151128,
        -0.009139305911958218,
        0.04283194616436958,
        0.006027940660715103,
        -0.025317499414086342,
        -0.159243643283844,
        -0.02694042958319187,
        -0.011908959597349167,
        0.010151496157050133,
        0.00012540318130049855,
        -0.0051662311889231205,
        0.04310185834765434,
        0.028392525389790535,
        -0.022857191041111946,
        0.0009565189247950912,
        0.06068550795316696,
        0.03480420634150505,
        0.032361917197704315,
        0.09444669634103775,
        0.004501735791563988,
        0.048249129205942154,
        -0.018205683678388596,
        0.06892397254705429,
        0.0344405397772789,
        -0.0032167809549719095,
        -0.06101318821310997,
        -0.04424654692411423,
        -0.04244304448366165,
        -0.02706312946975231,
        0.042267851531505585,
        0.06411749124526978,
        0.03458614647388458,
        -0.02176998183131218,
        -0.05478515848517418,
        -0.01690545305609703,
        0.052618514746427536,
        -0.011666540056467056,
        0.0011416836641728878,
        0.02324870228767395,
        0.016118459403514862,
        -0.07399672269821167,
        -0.05716538429260254,
        -0.03216397389769554,
        -0.028049958869814873,
        0.05744347348809242,
        0.04345012456178665,
        0.06885816901922226,
        -0.07947258651256561,
        -0.002892987336963415,
        -0.10770308971405029,
        -0.08612067252397537,
        0.03545096889138222,
        0.0735587552189827,
        0.02492493763566017,
        -0.006500832736492157,
        0.0022062778007239103,
        0.0036812657490372658,
        0.054037436842918396,
        -0.06274822354316711,
        0.059011779725551605,
        -0.03102654218673706,
        0.027561509981751442,
        0.09659034013748169,
        -0.022968171164393425,
        0.03771558403968811,
        0.026830045506358147,
        0.01945081353187561,
        0.005479726474732161,
        -0.04000311344861984,
        0.04028661176562309,
        -0.08401746302843094,
        6.249673673200083e-33,
        -0.03269131854176521,
        0.18128976225852966,
        -0.04717991501092911,
        -0.07019593566656113,
        0.008660132065415382,
        -0.05724966153502464,
        -0.010318510234355927,
        0.07739471644163132,
        0.0003885359619744122,
        0.025827305391430855,
        -0.07102012634277344,
        0.06702464073896408,
        -0.07909247279167175,
        0.062307607382535934,
        0.07229021191596985,
        -0.05483817681670189,
        -0.0649833157658577,
        0.01904059201478958,
        -0.07688415050506592,
        0.00969558022916317,
        -0.029699811711907387,
        0.02428441122174263,
        -0.020631538704037666,
        0.013725291937589645,
        0.06352432072162628,
        -0.010055423714220524,
        -0.03680311515927315,
        0.05747081711888313,
        0.02405150607228279,
        -0.0013573974138125777,
        -0.06856992095708847,
        0.006723344791680574,
        0.026204345747828484,
        0.05744608864188194,
        -0.02649522013962269,
        -0.05554146319627762,
        -0.03022928722202778,
        -0.07942351698875427,
        -0.025524314492940903,
        -0.07946643233299255,
        -0.1300601363182068,
        0.07302723824977875,
        -0.06484964489936829,
        0.00148017518222332,
        0.06154158338904381,
        0.012167094275355339,
        0.0255435798317194,
        -0.0484938845038414,
        0.005801110994070768,
        0.037781499326229095,
        -0.0876762792468071,
        0.06042869761586189,
        -0.01022589672356844,
        -0.010294499807059765,
        -0.05426422879099846,
        -0.09157621115446091,
        0.00920430663973093,
        -0.0677018091082573,
        0.03627339005470276,
        0.034167367964982986,
        0.1021551564335823,
        -0.025345541536808014,
        0.058425284922122955,
        -0.023776883259415627,
        -0.043677520006895065,
        0.03738212212920189,
        0.051833875477313995,
        0.0059134382754564285,
        0.05198637396097183,
        0.07947732508182526,
        0.04273056238889694,
        0.01688409224152565,
        0.06421742588281631,
        -0.008155856281518936,
        0.06098714470863342,
        0.03434007614850998,
        -0.06164635345339775,
        0.0749821588397026,
        -0.012482762336730957,
        -0.054117124527692795,
        -0.02025018446147442,
        0.07287397235631943,
        0.04489533230662346,
        0.0019321085419505835,
        -0.00195110437925905,
        0.026974232867360115,
        0.014789607375860214,
        -0.007733087055385113,
        -0.04655132442712784,
        -0.0009271502494812012,
        -0.024484610185027122,
        0.09787578880786896,
        -0.04894106462597847,
        0.08821241557598114,
        0.03562960401177406,
        -7.195101004363402e-33,
        0.00702003575861454,
        -0.01974404789507389,
        0.03645242005586624,
        0.03567924723029137,
        0.0312186386436224,
        -0.017081081867218018,
        0.053103361278772354,
        -0.08925335109233856,
        0.08059024810791016,
        -0.029888616874814034,
        -0.04816695675253868,
        0.03895308077335358,
        -0.04161977767944336,
        0.011495753191411495,
        0.00650691706687212,
        -0.062236931174993515,
        0.014765367843210697,
        -0.0970974937081337,
        0.02491716481745243,
        -0.06078407168388367,
        0.0398733876645565,
        0.011822214350104332,
        -0.11149398237466812,
        0.01505865529179573,
        -0.01690641976892948,
        0.0037067821249365807,
        -0.022886354476213455,
        -0.012726793065667152,
        0.0007807002984918654,
        -0.01309561263769865,
        -0.012793145142495632,
        -0.026598257943987846,
        0.014864659868180752,
        0.08052916079759598,
        0.07221643626689911,
        -0.00473523885011673,
        0.05482926592230797,
        0.02217303030192852,
        0.056904640048742294,
        -0.059509944170713425,
        0.03836316242814064,
        -0.023992929607629776,
        0.051306575536727905,
        -0.03761013597249985,
        0.05716373398900032,
        -0.03521168977022171,
        0.026161454617977142,
        0.0017956200754269958,
        -0.017330588772892952,
        0.02997584268450737,
        0.0018229889683425426,
        -0.012785700149834156,
        -0.011717933230102062,
        -0.06760355830192566,
        -0.08433539420366287,
        0.017055736854672432,
        0.033123064786195755,
        -0.01518118754029274,
        0.00589224137365818,
        -0.01772792637348175,
        -0.0313936211168766,
        0.03581899777054787,
        0.015314913354814053,
        0.046345051378011703,
        -0.09937303513288498,
        0.014387545175850391,
        0.11519763618707657,
        0.007685605902224779,
        -0.027208318933844566,
        0.013296416960656643,
        -0.09666622430086136,
        0.07187078148126602,
        0.05282789096236229,
        -0.08325181901454926,
        -0.09376846253871918,
        0.0712701603770256,
        0.01020052284002304,
        0.009083653800189495,
        -0.06976828724145889,
        -0.06201469153165817,
        0.03196318447589874,
        0.03312348946928978,
        0.001628818572498858,
        0.04089886322617531,
        0.013905825093388557,
        0.12691642343997955,
        -0.007678245194256306,
        0.0030073581729084253,
        -0.049256209284067154,
        -0.032369159162044525,
        -0.0660601407289505,
        0.013421219773590565,
        -0.07031600922346115,
        0.02431512624025345,
        -0.014895807951688766,
        -6.183670819837062e-08,
        0.051397353410720825,
        -0.027431681752204895,
        -0.04870342090725899,
        -0.02356945350766182,
        0.043320950120687485,
        0.017113594338297844,
        -0.02071482501924038,
        0.03251940384507179,
        0.0032689347863197327,
        0.022601105272769928,
        0.005543243605643511,
        -0.009608879685401917,
        -0.08626344054937363,
        0.09941551834344864,
        -0.027630416676402092,
        0.04960111156105995,
        -0.05861169844865799,
        0.016194874420762062,
        -0.04689899832010269,
        -0.01483939215540886,
        -0.06152729317545891,
        0.08400288969278336,
        0.02907724678516388,
        -0.02304195985198021,
        0.008148743771016598,
        0.07102075219154358,
        -0.030646424740552902,
        0.08980190753936768,
        0.04349350184202194,
        0.01712648943066597,
        -0.01036318764090538,
        -0.02485828660428524,
        -0.10694201290607452,
        -0.0020244428887963295,
        0.07714086025953293,
        -0.12240603566169739,
        -0.003954221960157156,
        0.04613908380270004,
        0.040034860372543335,
        0.05556555464863777,
        0.03639873489737511,
        -0.04224930331110954,
        -0.03041701391339302,
        0.02329106442630291,
        0.014253447763621807,
        -0.09843000024557114,
        -0.07203295826911926,
        -0.05425603687763214,
        -0.01040161494165659,
        0.06397988647222519,
        0.018694059923291206,
        -0.04503153637051582,
        -0.0018075203988701105,
        -0.004295947030186653,
        0.06720927357673645,
        -0.04504565894603729,
        -0.02096332423388958,
        -0.0635291337966919,
        -0.030442649498581886,
        0.10451539605855942,
        0.06411321461200714,
        -0.09876488149166107,
        0.04887770116329193,
        0.09638610482215881
    ]
}