{
    "id": "icxtwYS25aM",
    "title": "How well do you know Cisco IOS?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-09-24T14:53:01Z",
    "video_url": "https://www.youtube.com/watch?v=icxtwYS25aM",
    "category": "Science & Technology",
    "tags": [
        "linux",
        "linux cisco",
        "ccna",
        "linux commands",
        "ccna study",
        "ccna training",
        "cisco ccna",
        "cisco ccna certification",
        "cisco training",
        "comptia linux plus",
        "comptia",
        "comptia it fundamentals",
        "comptia linux+",
        "comptia linux+ certification",
        "information technology",
        "kali linux",
        "linux for beginners",
        "linux tutorial",
        "linux+ exam",
        "lpic 1",
        "raspberry pi",
        "DevNet",
        "cisco devnet",
        "cisco ios",
        "cisco ios commands",
        "gns3",
        "gns3 david bombal",
        "gns3 2.2",
        "gns3 tutorial",
        "cbt nuggets",
        "ine",
        "ccnp",
        "10x engineer",
        "10x"
    ],
    "views": 21521,
    "likes": 943,
    "comments_count": 158,
    "description": "Do you know these time saving Cisco IOS commands? Did you know this was possible traditional Cisco IOS? Use /, +, -, grep, include, section, exclude and lots more directly on Cisco IOS. Be a 10x engineer and show the world your Cisco and Linux skills.  ================================= Menu: ================================= Documentation Reference: 0:00 Network Topology: 0:59 Cool IOS commands: / + - : 1:35 Linux options on Cisco IOS: 10:17 Personalized sections using grep: 12:30  ================================= More information here:  ================================= Cisco IOS Fundamentals:  Linux Shell:   ================================= Books: ================================= Cisco Press Book:  Good O'Reilly Book:   You don't need a linux shell or linux virtual machine to use these commands. You can use them directly in classic Cisco IOS!  10x Engineer Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  DevNet LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   #linux #ccna #DevNet",
    "description_links": [
        "http://bit.ly/2mTmnfL",
        "http://bit.ly/2kwMyYN",
        "https://amzn.to/2LpaU1a",
        "https://amzn.to/2Lpbw6Z"
    ],
    "transcript": "- How well do you know the Cisco IOS? Hopefully, in this video, I'm gonna teach you some commands that you don't know. 'Cause we both deserved it all (techno pop music) - In this video, I'm gonna show you some tips and tricks with regards to the Cisco IOS. Hopefully, this will make you a better Cisco network engineer. A lot of these commands are available in the Configurations Fundamentals Configuration Guide. Cisco had multiple examples of this guide that show you, for instance, the basics, like context-sensitive help, CLI editing shortcuts and features, but I'm gonna show you some more advanced stuff. Please, comment below this video and let me know at which point in the video you learned something. So let's see how far you can get through this video without learning something new. I'm running a GNS3 typology here, there are two routers and a switch. These are traditional Cisco routers as in they run traditional, classic Cisco IOS. Show Version shows me that the version of operating system that this router is using is 15.6 2T. So, classic, traditional Cisco IOS, nothing spectacular or exceptional about the Cisco IOS. These are Cisco viral images that I'm running within GNS3. Okay, so let's start with something straight away. show question mark. Now, show here shows me a whole bunch of commands, and I can scroll, and scroll, and scroll, but notice, show question mark, I see more as an option. So I've simply typed, show question mark. When more is displayed, I can use multiple options like forward slash. This allows me to filter, for instance for a keyword such as class. So that's what I've typed. IOS is filtering the output of this show command to class-map. More is displayed once again. I can use forward slash. And for instance, search for rad as in radius. So all I did was type show question mark, and notice the output is being filtered. Forward slash again, the VPN. Output is filtered to webvpn. Now, you can use this with many commands such as show run. So when I type show run, more is displayed, forward slash, type something such as face. The output is filtered until face is found, as in interface Loopback100. More is displayed. Forward slash, let's look for something such as network. This is filtering the output until the first network statement. Now, I've purposely used a sub-command here rather than something such as router. So as an example, I could filter for vty. Now, some people have said when I've shown them this previously, that you could just type show run, pipe, section, and let's say router slash vty as an example, and that will show you the router configuration and the vty configuration, and that's true. I'm not trying to tell you which command is better than another. I'm trying to show you different options. This shows me the router sections as in router eigrp, router bgp, router ospf, and here I've got vty, but notice when I type show run, I could, as an example, filter the config for one keyword such as face. So that's a section of configuration but then I could filter for a different keyword which could be a sub-command, such as 0.0. So that's filtering to that which is actually a regular expression. So let's do forward slash again and say zero backslash dot zero. So this is a regular expression saying escape the spatial meaning of a dot. A dot is any single character, so that matched to there. But here, I'm gonna actually look for 0.0 and that's filtered down to here. So it's not a section of code, it's a sub-command. And then I can filter for something else, let's say login. This is showing me the configuration from a certain point in this example, banner login. But what you might have noticed is I've used four different search criteria in one show command. So I'm looking at output and I'm doing multiple searches on that output. The closest that you can get is perhaps begin. So, show run, pipe, begin, and let's say login. That will show me the running configuration from the word login, as in banner login, but that's all it's gonna give me. But note, I have more here. So I could do a search for vty or some other keyword. It's not showing anything here because vty was already displayed and there's no vty in the remaining config. But what I could do is type show run, pipe, begin, face, something further up in the configuration, as in interface, and then I could search for router, and then search for something else, vty. So, the forward slash command is fantastic. It doesn't just work with show run, it basically works with any command where you've got more displayed. So here, I've typed show ip route, more is displayed, so what I can do is use forward slash, and let's search for 172. The show ip route output is filtered to 172, and then I could filter for something else. Let's say 192.168.105. Output is filtered to that point in the ip route command. So forward slash, really useful. Another one that you could use, note please, I'm gonna just do show question mark here. Now, I'm gonna use plus and let's search for rou. This is filtering all that output to only show me show commands with rou in them. Now, you might say, well, David, this is kinda pointless, but don't restrict your imagination. Look at what this command can do and then play around with different options and see what works for you. The moral of the story is with a command showing more, you could either use forward slash or you could use plus, and another option is minus where I don't wanna see certain commands. I wanna remove everything let's say with rou in it. Now, that's not a great example, so let's do that with a routing command like show ip route. So show ip route, I don't wanna see, let's say, 192 routes. The routing table here has been filtered to remove 192. Now, let me just show you the whole routing table to make the point. Show ip route, no filtering. We've got two routes, we've got 10 routes, we've got 172 routes, we've got 192 routes in the routing table here. But if I type show ip route, I could say minus, don't show me 172, don't show me 192. I don't wanna see those routes in the output of this command. Now, again, you could type show ip route, pipe, include, or let's do exclude, which is similar to minus, 172, 192. You could do it that way and that will show you equivalent output. In this method, you are doing the command before showing the output. In the other method, I'm typing a command, when I see more, then I'm deciding what to exclude, and I can do that multiple times with a backslash but I can't do that with a minus or plus. But with a backslash, I could filter multiple times. Okay, so show, run, pipe. Begin is similar to forward slash, include is similar to plus, exclude is similar to minus. Okay, so that's some basic commands. Plus, minus, forward slash. You, once again, can do that with any command, so I'll show you one more example and then wrap it up. Here in bgp, I've can use question mark. Bgp question mark gives me the options. I could say bgp question mark plus max. This only shows me commands with the max keyword in them. I filtered the output. And again, wherever you are, and you use question mark, and I shouldn't be using show there. Let me just use question mark in global config mode with no options. Wherever you are here, you can use forward slash, plus, minus. So rou, as an example here, shows me all commands in global config mode that have rou in them either as the command or as the description of the command. So if you can just slightly remember what a command should give you, but you can't remember the exact command, you can filter that way if you want to. Okay, but let's step it up a notch. Let's enable a Linux command directly on the Cisco IOS. Now, I've discussed this command, shell processing full, in this video. If you wanna see more details, have a look at this playlist. You can either enable this globally or you can just enable it on the current terminal. But what this allows me to do is it allows me to use Linux commands such as cat. So, show shell functions shows me options, grep is a great one, which I'm gonna show you right now. We've also got interface which I'll show you in a moment. We've also got nl, which numbers any line in the output. Basically, there's a whole bunch of things we can do now that you can't typically do with Cisco IOS. So, include, exclude, commands like that are very limited. Here, we can do nested greps, all kinds of interesting things. So as an example, show ip interface brief gives me a list of interfaces on this router. So there's the command again, show ip interface brief, bunch of output on the router. So, I'll just do that again. There's the command. Here are all the interfaces. But what I could do now is say grep and only show me interfaces that are up. So, all those interfaces are up. This command shows me all up interfaces. Scrolling up to the previous command, show ip interface brief shows me interfaces but also shows me interfaces that are down. So these interfaces are currently down. But I can do nested greps now. Remove loopbacks from that output. So show me all interfaces that are up but remove loopback interfaces. Now, you could perhaps just do it this way, show me all interfaces except loopback interfaces. But notice those interfaces are administratively down. Again, use your imagination. This is a positive match. This is an exclusion, so we're basically doing an include and then an exclude. Now, let me show you some more commands that I haven't discussed in other videos. How about this? Show me the running configuration but begin with 0/0. This is similar to begin, but I'm going to make it more complex in a moment, and let me push that to more because this is like Linux, so you can use more to show one page at a time. So that command that I ran there shows the running configuration from this point, but it's showing the entire running configuration, and it went by very quickly. If I push it to more, it's gonna show me one page at a time. So there's the command showing one page of output at a time. But you could say, well, I could just do that with begin. Okay, but how about this? Show me the running configuration beginning at this point, but ending at router. So in other words, scrolling up, we're gonna start at this point, but only show me until this point. When we see router, stop the output. Okay, so let's try that. Show run, pipe, grep, begin, 0/0, grep u router. There's the output, interface Gigabit 0/0, and notice it ended at the point specified, ended at router. Now, again, if you don't wanna just scroll past, if you got a lot of output, you can use more, so we're doing double greps here and pushing it to more to only show certain parts of the configuration. But you could say, David, I could just use section, like section interface. But notice the difference. With section interface, I am seeing the loopback interfaces, and then I'm seeing my gigabit interfaces. What I'm doing with grep here is I'm deciding which section of code I wanna see. Could be a small piece of code, could be a long piece of code, and I'm not restricted by what I can search on. I could, for instance, search on a exclamation, so show me the output from 0/0 until exclamation. Basically, you search on anything you want. Okay, so there you go, that did it. Didn't do it previously. Notice it started at Gigabit 0/0, ended at exclamation y, because when you do show run, I'll use my forward slash again, I like forward slash, I showed the config from this point until this point. You basically have the power here to do what you want, to search for whichever output you want. So let's do it from grep 'til login. I wanna see all the output from 0/0 until login. So, all the output from 0/0, so zero slash zero, interface Gigabit 0/0 until login. So I'll see my interfaces, I see router, and when I see login, it ends. So actually, I should have done control-plane there. So let's do plane because I don't wanna get the banner. So show me all the configuration from 0/0 until plane, so there's interface Gigabit 0/0 scrolling all the way down until plane. The plane, control plane command, is too big to be shown here in the output. I don't wanna see that. I just wanna see up 'til that point. Okay, but grep is even more powerful. How about this? Typically, commands are case-sensitive, but I could say i. So Face, I'm gonna put in uppercase. Notice, please, that face here is lowercase, but I'm gonna say ignore case. When you use section or include or one of those commands, it's case-sensitive. So commands such as show run, pipe, include, exclude, are case-sensitive, but here, I've told it, show me the running configuration from face, face being uppercase or lowercase, don't care, until plane. So I'm seeing all my loopback interfaces and then I'm seeing gigabit interfaces up 'til plane. Now, if you're not sure about options, notice man, which is a Linux command for manual, grep shows me options. So there's b, match everything in a file after pattern, dash i or hyphen i, ignore case, u, match everything until a certain pattern, v is invert. So typically, when you do show run, pipe, include, you have to match the case here. But with grep, you don't have to. So show run, pipe, include, face, this matches all lines with the word face in it. I could say grep i and then my face can be any case I want. Doesn't matter what the case is here. That wouldn't work with include. So output is the same, but let's say I wanna exclude my loopbacks. So let's use a negative grep. So, v says exclude LoopBack interfaces. So I'll use -v Loop. So show me the ethernet interfaces, but exclude the loopback interfaces. And there you go, I'm only seeing gigabit interfaces. So that's a really powerful option. Now, this video is unfortunately getting quite long so I'm gonna have to put the more advanced stuff that I wanted to show you in a separate video, but hopefully you've found this useful. Again, please comment below and let me know what you've learned. At what timestamp did you actually learn something? Which commands did you learn? And, as always, please, would you subscribe to my YouTube channel? Please, would you like this video if you found it useful? Please click on the bell to give notifications when I post a new video. 'Cause we both deserved it all (techno pop music)",
    "transcript_keywords": [
        "show",
        "Cisco IOS",
        "command",
        "output",
        "show run",
        "Cisco",
        "interfaces",
        "commands",
        "forward slash",
        "shows",
        "IOS",
        "slash",
        "Configuration",
        "router",
        "forward",
        "type show",
        "run",
        "interface",
        "show question",
        "point"
    ],
    "transcript_entity_values": [
        "first",
        "the Cisco IOS",
        "Linux",
        "rou",
        "LoopBack",
        "nl",
        "IOS",
        "Cisco",
        "Gigabit 0/0",
        "172",
        "VPN",
        "the Configurations Fundamentals Configuration Guide",
        "two",
        "four",
        "10",
        "vty",
        "bgp",
        "Gigabit 0/0",
        "0.0",
        "zero",
        "192.168.105",
        "192",
        "YouTube",
        "David",
        "Linux",
        "15.6",
        "one",
        "GNS3",
        "Gigabit 0/0",
        "0/0",
        "vty",
        "CLI",
        "Cisco IOS"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.026369929313659668,
        0.022579729557037354,
        -0.011980454437434673,
        -0.0276754442602396,
        -0.019263705238699913,
        -0.0064829555340111256,
        0.028465894982218742,
        0.0024813602212816477,
        -0.05710551142692566,
        -0.0963243767619133,
        0.07497019320726395,
        -0.025281894952058792,
        -0.06704964488744736,
        -0.011125678196549416,
        0.008165654726326466,
        -0.06344766169786453,
        -0.015613624826073647,
        -0.043879661709070206,
        -0.01754298433661461,
        -0.11957820504903793,
        0.06935403496026993,
        0.006740905344486237,
        0.03850015252828598,
        -0.010674457997083664,
        0.012794957496225834,
        0.03167516738176346,
        0.0017446540296077728,
        -0.031960975378751755,
        0.04456908628344536,
        -0.022145729511976242,
        -0.04298946261405945,
        0.1504555344581604,
        0.04417191445827484,
        0.09782347828149796,
        0.00990973599255085,
        -0.09269449859857559,
        0.03554926812648773,
        0.023939596489071846,
        0.05525035038590431,
        -0.046905290335416794,
        -0.046047281473875046,
        -0.014782708138227463,
        -0.00384805747307837,
        0.03686952963471413,
        -0.020732223987579346,
        -0.053959913551807404,
        -0.029617035761475563,
        -0.020137613639235497,
        -0.039125218987464905,
        -0.013530892319977283,
        0.0009293725015595555,
        0.013828154653310776,
        -0.028765035793185234,
        0.025261489674448967,
        0.12993411719799042,
        0.09063263982534409,
        -0.06141931191086769,
        -0.011819814331829548,
        0.04099763557314873,
        -0.0251260157674551,
        -0.049494266510009766,
        0.01719278283417225,
        -0.034923359751701355,
        0.03958146646618843,
        -0.004228712525218725,
        0.06077166274189949,
        -0.09480337053537369,
        0.05016374588012695,
        0.026927847415208817,
        -0.03317655995488167,
        -0.07294471561908722,
        -0.031060995534062386,
        0.014435665681958199,
        0.071283720433712,
        -0.00931859016418457,
        0.06229110807180405,
        0.03778868541121483,
        -0.016177749261260033,
        -0.09060021489858627,
        -0.1164766401052475,
        0.038767993450164795,
        0.038477156311273575,
        -0.01090400479733944,
        0.053443316370248795,
        0.09145459532737732,
        0.003316211514174938,
        0.011252655647695065,
        0.013146517798304558,
        -0.008243344724178314,
        -0.06989844143390656,
        0.007323096040636301,
        -0.06204898655414581,
        -0.013667859137058258,
        -0.09741426259279251,
        0.007837641052901745,
        0.05742096155881882,
        0.0007928663399070501,
        -0.050030916929244995,
        -0.0660267174243927,
        0.04780185595154762,
        0.01982722245156765,
        -0.03828686103224754,
        -0.0163933876901865,
        0.024143140763044357,
        -0.046525031328201294,
        0.022928709164261818,
        0.07139331102371216,
        0.010153498500585556,
        -0.02497539483010769,
        0.10633138567209244,
        -0.050963375717401505,
        0.1015653908252716,
        -0.08436676114797592,
        -0.10799022018909454,
        0.08187951892614365,
        0.007909703068435192,
        0.02856215089559555,
        0.08969241380691528,
        0.10975029319524765,
        0.0917564108967781,
        -0.048053961247205734,
        0.00725631695240736,
        -0.09666500985622406,
        0.016598137095570564,
        -0.04525988921523094,
        0.0003719875239767134,
        0.09443866461515427,
        8.053556447245257e-33,
        -0.0005842889659106731,
        -0.010764949955046177,
        -0.1208282932639122,
        -0.01081806980073452,
        0.058299481868743896,
        -0.03597508370876312,
        0.06270737946033478,
        0.026503341272473335,
        -0.011533396318554878,
        0.04241508990526199,
        -0.01084581483155489,
        0.011769423261284828,
        -0.07124914228916168,
        0.02848837338387966,
        -0.03721458837389946,
        0.0067857070825994015,
        -0.0002772416628431529,
        -0.034633614122867584,
        0.020464958623051643,
        -0.03205743059515953,
        0.03156231716275215,
        -0.05812189355492592,
        -0.02529902197420597,
        -0.05367644503712654,
        0.14319315552711487,
        0.0008822613162919879,
        -0.02102702111005783,
        -0.045255981385707855,
        0.024207545444369316,
        0.02641555480659008,
        -0.00940379686653614,
        0.013852477073669434,
        -0.012097474187612534,
        -0.0062584104016423225,
        0.04710318148136139,
        0.018831701949238777,
        -0.022141171619296074,
        -0.021046478301286697,
        0.011763195507228374,
        -0.0432145893573761,
        -0.09153381735086441,
        0.002495573600754142,
        -0.03866912052035332,
        -0.04545355215668678,
        0.008805706165730953,
        -0.024066708981990814,
        -0.06776105612516403,
        0.0028173348400741816,
        0.006124232430011034,
        -0.0034394082613289356,
        0.015776198357343674,
        0.020468125119805336,
        -0.07034312188625336,
        -0.08217135071754456,
        0.013404550962150097,
        -0.06899537146091461,
        0.022766079753637314,
        -0.009426837787032127,
        0.022127721458673477,
        0.061908237636089325,
        -0.04993845149874687,
        0.06174526736140251,
        -0.07140247523784637,
        0.025897642597556114,
        -0.03751659393310547,
        0.06239829957485199,
        -0.03969905897974968,
        -0.02320690080523491,
        0.017312342301011086,
        0.05912262573838234,
        -0.12771013379096985,
        -0.0507793128490448,
        -0.015348811633884907,
        0.012632693164050579,
        0.021241065114736557,
        -0.026071900501847267,
        -0.012314574792981148,
        -0.07621622085571289,
        0.0008446697029285133,
        -0.01708815060555935,
        0.0028440523892641068,
        0.03123345598578453,
        0.034107502549886703,
        0.03230877220630646,
        0.08122886717319489,
        -0.06107631325721741,
        0.03608220815658569,
        -0.034799229353666306,
        -0.038474153727293015,
        0.054625172168016434,
        -0.06181585043668747,
        -0.02549584023654461,
        0.019839733839035034,
        0.02205818146467209,
        -0.07847057282924652,
        -1.1903464280713394e-32,
        0.0905672013759613,
        0.05129756033420563,
        0.023337973281741142,
        -0.10745977610349655,
        -0.09197700768709183,
        -0.08516345918178558,
        0.03548014536499977,
        0.04801049083471298,
        -0.018509553745388985,
        -0.013078237883746624,
        0.01569090224802494,
        0.014382617548108101,
        0.011193816550076008,
        -0.069419726729393,
        -0.0306097362190485,
        -0.023033199831843376,
        -0.11167795956134796,
        -0.050296664237976074,
        0.005062839016318321,
        -0.010191376321017742,
        -0.015354344621300697,
        0.04096145182847977,
        -0.01877106912434101,
        0.012692675925791264,
        -0.023240573704242706,
        -0.010150008834898472,
        0.07228585332632065,
        0.08749006688594818,
        0.027079246938228607,
        -0.06958790868520737,
        -0.01880900003015995,
        -0.08178582042455673,
        -0.09251716732978821,
        -0.016017716377973557,
        -0.02453412115573883,
        -0.0035306233912706375,
        0.029518967494368553,
        0.15394628047943115,
        -0.06299391388893127,
        -0.0332396924495697,
        0.058966077864170074,
        0.028219079598784447,
        -0.05881190299987793,
        0.0004351593379396945,
        -0.059023309499025345,
        0.0422944650053978,
        0.025645311921834946,
        0.056423693895339966,
        -0.13807837665081024,
        -0.05585424602031708,
        0.0420752577483654,
        -0.018033577129244804,
        -0.03440086916089058,
        -0.004801599774509668,
        0.0020882191602140665,
        0.07037827372550964,
        0.05986693128943443,
        -0.08324560523033142,
        -0.04140947386622429,
        -0.057019561529159546,
        0.031893905252218246,
        -0.055089715868234634,
        0.015956507995724678,
        -0.023081092163920403,
        0.05312268063426018,
        -0.14014433324337006,
        -0.030339188873767853,
        -0.017948083579540253,
        -0.0023245473857969046,
        0.0028012231923639774,
        0.02556939236819744,
        -0.04293715953826904,
        -0.04199155420064926,
        0.002461907919496298,
        -0.06690680235624313,
        -0.011621788144111633,
        -0.0035137487575411797,
        -0.023390719667077065,
        -0.011603356339037418,
        0.03892423212528229,
        -0.035487495362758636,
        0.085010826587677,
        -0.08753986656665802,
        0.08207664638757706,
        0.022266384214162827,
        0.0915144830942154,
        0.0028885314241051674,
        0.08272743970155716,
        0.10809718817472458,
        0.02977251447737217,
        -0.045616265386343,
        0.03958360478281975,
        -0.04123380035161972,
        0.061000797897577286,
        -0.08317209780216217,
        -5.919838130807875e-08,
        -0.018688427284359932,
        -0.0008513814536854625,
        -0.03597509115934372,
        0.019911782816052437,
        -0.021089738234877586,
        0.013618831522762775,
        -0.025873525068163872,
        -0.07514827698469162,
        0.05417444184422493,
        -0.07621972262859344,
        0.05094490200281143,
        0.010355917736887932,
        -0.12286694347858429,
        0.032173480838537216,
        -0.006099281366914511,
        0.018069032579660416,
        0.024818055331707,
        -0.060068532824516296,
        -0.014044681563973427,
        -0.04179248958826065,
        0.0076035563834011555,
        0.015620457008481026,
        -0.005737294442951679,
        0.025763919577002525,
        -0.04527074471116066,
        0.0398067831993103,
        -0.0001707484625512734,
        0.04736962541937828,
        -0.05773739144206047,
        0.038531217724084854,
        0.013173681683838367,
        -0.017275596037507057,
        0.03417106717824936,
        -0.02162056788802147,
        0.10405269265174866,
        0.04390764608979225,
        0.004611274227499962,
        -0.03838036209344864,
        -0.013171461410820484,
        -0.025637546554207802,
        -0.011099179275333881,
        -0.09382104873657227,
        -0.013203161768615246,
        0.03213377669453621,
        0.022469190880656242,
        -0.09454401582479477,
        -0.014986908994615078,
        -0.030630316585302353,
        0.0976790338754654,
        -0.004830801859498024,
        -0.0024126002099364996,
        -0.07009656727313995,
        -0.02522408962249756,
        -0.0012356976512819529,
        0.03671847656369209,
        -0.041223153471946716,
        -0.009346907958388329,
        -0.09649419039487839,
        -0.02569025196135044,
        -0.00792726781219244,
        0.04230310767889023,
        -0.0352555587887764,
        -0.010139213874936104,
        0.06259820610284805
    ]
}