{
    "id": "IeOd4_6kI30",
    "title": "The Ultimate Xbox MYSTERY TECH",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-02-19T19:05:04Z",
    "video_url": "https://www.youtube.com/watch?v=IeOd4_6kI30",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "unboxing",
        "xbox",
        "xscreen",
        "xbox series s",
        "series s",
        "xbox screen",
        "tv",
        "tesla cyberquad",
        "cyber quad",
        "austin",
        "austin evans",
        "amazon",
        "how to waste"
    ],
    "views": 1408159,
    "likes": 40898,
    "comments_count": 1000,
    "description": "Kamikoto has a special sale going on with an extra USD50 off on any purchase made at  Don't forget to SUBSCRIBE my friends  Tesla Cyberquad for kids:  Xbox Series S xScreen:  FAO Schwarz piano mat on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://www.kamikoto.com/austin",
        "https://shop.tesla.com/product/cyberquad-for-kids",
        "https://upspecgaming.com/products/xscreen",
        "https://austin.tech/piano",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Oh my God (grunts). - Is that a cyber quad? (Crowd Cheering) (Thud sound) - Ooh. (Laughing) (Thud sound) - [Ken] So this is not the real cyber quad. This is like the, we went to Toys\"R\"Us and found like the miniature version. - Rest in peace. - [Ken] But Tesla still sells it. MSRP $1,900. - Oh my God, I don't think I can get this up by myself. - [Matt] I believe in you. - I don't. - [Matt] To rephrase, I believe in watching you struggle. - [Ken] Yes. That. - Ready and. Okay, I can't. I'm just gonna open the box. Just that I'm gonna open the box. - [Matt] What if we have to return it? - I'm opening the box. All right. One cyber quad has been assembled. How fast is this supposed to go? - [Ken] 10 miles an hour. Okay. - Oh. Oh, okay. It has lights. That's cool. All right. Onward. (Quad electric motor sound) Wait, this is gonna be. (Squeaking noises) (Door opening) - [Ken] Oh, he is really going for it. (Beeping sound) There he goes. (Explosion sound effect) (Accelerating sound) (Excited Laughter) - Oh, oh, oh, oh, oh, oh, oh, okay. (Warped voices) - [Austin] How does 10 miles an hour feel, huh? (Chill music) - How's it going? Getting some cardio in? (Laughs) (Chill music) (Rewind tape sound) - [Josh] Can you pop a wheelie? - [Ken] Do you want to? - I can't do a wheelie, but I can definitely put it sideways. - Oh! OH! Ohhh! - [Austin] Keep it going! - [Josh] Wow! - I believe in myself. - Yo, if you just got the power of friendship and belief you can do anything. That's what anime has taught me. - [Austin] Good advice. Ken, I'll race you! - Feels very weird on my body. (Shouting gibberish) - Vroom vroom Mother (beep) (Laughing) (Breathing heavily) - Hello and welcome friends to Austin catching boxes for the first time in his life. Oh. Oh, this is my item. Thanks. All right. So this is something that I backed on Indiegogo, I think a year ago. So the Xbox Series S is a great little console but, you know what's missing? Portability, which is where the xScreen comes in. Do you remember the PS one with the display that you attached to the top? Yeah. It's that same idea for the Series S. However, while this is not an officially licensed Microsoft product. From what I've seen from the many many Indiegogo backer updates, I've gotten over email the last year, they put a lot of serious time and effort into developing something which will actually make sense. - [Ken] Serious time? - Serious development. Now, I'll be honest. I backed this long enough ago that I don't remember how much I spent on it. [Ka-Ching] You plugged this into the Series S, it takes advantage of the HDMI and the USB. However, you are gonna be losing your second USB as well as your ethernet. I guess it's fair enough. But you do still have access to your storage expansion and your power. And to be fair, you still do have an additional USB port on the front, so you can charge your controller and whatnot. - Yeah. That's just not lining up right. Mm. - [Matt] If you get a running start, I'm sure you could. - Oh, I got it. I got it. Okay. Took a little bit of persuasion. First thing, the color match is very close, but not perfect. This I would say is a very tiny shade of white off, it's a touch more sort of beige versus white. How does it look when you close it? I mean, that actually. - [Ken] That's really good. - That's not bad. - [Ken] I like that. - What's the stand for? So open the xScreen flat, lift front of Xbox and attach feet. Ohhh. So it's like this. - [Matt] Yeah. So you can. - That's, that's cool! - [Matt] It gets to eye level. - I'm now much more convinced that this is totally cool - [Ken] Oh that is awesome. It's like a little kiosk. - [Matt] You are blowing hot air directly into your face but. - Ah, that's fine, dude. The Series S, it's warm air. All right. Does this fit in here altogether? - [Ken] I would hope so. - It does nicely actually. And then I guess you could put your extra power cables and whatnot here. - [Ken] Oh, that is, that is a cool package. Whoa. - All right. Let's turn on the Xbox. I mean, I will say the viewing angles are not bad. Also, it's a, it's a matte display. It's not glossy. I haven't played the game yet. I'm looking. I think this is this, this this is feeling like a good product to me right now. - 2JZ, you can't go wrong. - [Game Character] Turn around if it is safe to do so. - [Ken] Ooh, the sound! An 11.6 inch display completely will mask any of the deficiencies in the performance of the Series S because 1080p on a display that's this small is gonna look super, super sharp. - [Ken] The pixel density is way high on this. - Yeah. I will say this layout does blow hot air towards you. I actually didn't think it was that noticeable but when you have the Series S directly facing towards you, you do notice it. - Huh? - Okay. Hang on. Let's try it in the standard configuration. Huhhh! The Series S laptop! (racing car engine) - I'm not used to playing games like this close so it actually feels a little bit weird. It does work though. - [Ken] But it's good. The screen it's good that the screen will go back a little more. Yeah. - Yeah. I could definitely like lean it back. And honestly, the fact that it's anti glare, especially here in the studio where we have so many studio lights actually does help quite a bit. Supposedly if I close this screen and if I've set it up correctly, it will turn off the Xbox. So there's the only way to find out. Right? And (Power off sound) - Oh That's cool. This video is sponsored by Kamikoto. Living life on the cutting edge has never been easier than with Kamikoto. Nothing is more frustrating in the kitchen than dealing with a dull knife, making dinner a bigger hassle than it can already be. Kamikoto fixes this with extremely high quality Japanese steel knives built on legacy of 800 years of Japanese craftsmanship, using only Japanese sourced steel. It really doesn't get better than this. Each knife is individually inspected and comes with a lifetime guarantee. And Kamikoto knives are used by Michelin star chefs all over the world. With Kamikoto, there's a knife for everything. From their seven inch vegetable knife or their five inch utility knife, you'll be prepared for any upcoming meal. We love using them, especially with the beautiful Ash wood box that gives a convenient place to store the knives when not in use. And also it makes a great gift box as well. Uh-huh, wink wink. Don't forget to get your loved one's gifts - [Jared] Like you did. - I didn't forget. Kamikoto is having a special sale right now so you can get $50 off any purchase with code Austin just head over to Kamikoto.com/Austin. And of course, huge thank you to Kamikoto for sponsoring this episode of Mystery Tech. Right. (drops box) You definitely just gave me a paper cut. (soft piano music) This is the FAO Schwartz step to your own tune, giant dance on piano. Is this just an excuse for me to dance for mystery tech? Because I'm all about that right now. All right. This is a lot of, oh my God. - [Ken] Wow. Most importantly it comes with the alphabet. (laughing) - That's not the alphabet. Do not know music theory, Kenneth? - [Ken] So this is an FAO Schwarz staple. - [Austin] FAO Schwarz is some New York store, right? - [Ken] It's a New York toy store. It's yeah. It's the toy store that everyone thinks of when they think of toy stores. - [Matt] It's the one from Home Alone 2. (piano notes) - Yeah. You know, piano notes? (Alternating piano notes) - My Pokemon's low on HP. What am I gonna do? (\"Twinkle Twinkle Little Star\" on piano) - Does it do chords? - I don't know. Try it. (out of tune piano sound) (Laughing) - Okay. This is gonna sound really racist but I wanna learn how to play chopsticks and I've never done that before. - [Jared] Why's that racist? (random piano notes) (Descending piano notes) - No, no, no, no. - Oh. How are you? What? Whoa. He almost. Wait a minute. - That's racist. - Wait, what happens if you hit this? (higher pitch on piano) (\"Fr Elise\" - Beethoven) - Do it! - Oh my god! (Clapping) - Virtuoso! - Wait, wait. Get outta the way. Lemme try this. Lemme try this (classical piano music) - [Matt] Maybe, you just need to know the rhythm? Which you're still messing up on. (Sped up classical piano music) Oh! (Fast classical piano) - Aw! Why did I try to catch that? Ow! - [Ken] You did that yourself. - I just put my hand underneath it to catch it and it just squashed my hand. - [Ken] What's next, you're gonna sniff it too? Just a disclaimer for this one. We've been sitting on this box for a while. We haven't shot mystery tech since before the end of last year. When did Halo Infinite come out? - December. So it's been sitting around since December. Oh, it's a Halo thing. Okay. - [Ken] No way, shock. Oh really? Did you really ask that? I just, I gave you the hint. - Just a side note with Halo Infinite, Weapon is better than Cortana. - [Austin] Who? - Weapon. - [Austin] Oh. - I thought you played the game, but apparently not. There's a lock on this crate. - [Matt] I feel a little like with Microsoft, you always have to check those pieces of cardboard. - Don't think I needed the lock. (laughing) - [Ken] To be fair. That, that I definitely opened it beforehand. - (in disbelief) What?! - [Ken] I needed to. I needed to sniff it out and make sure that it wasn't poison. It's not poison. - [Austin] Box number two. Oh God. - [Matt] Bro. - [Jared] Dude. (Breathing in heavily) - Found an elite controller. - [Matt] Why is it that everything I plan on taking you drop - Yo. Okay. Even this sleeved cable. Oh my God. Yo, this is absolutely sick. - [Ken] Okay. I love the gold D Pad. The gold D Pad is really good. - [Austin] Yeah. That is ridiculous. I mean, look, the elite controller, (gibberish) shut up. (Laughing) Shut up. - [Ken] We get it. English is hard. It's all right. - Ohhh. - [Ken] Yeah. Yeah. - Don't, don't peek. The audience. They, they can see that. They're all very impressed. - [Ken] People think we have a studio audience - Studio audience. If you wanna join the studio audience, just send your mother's maiden name and your credit card number. - [Ken] Oh my God is that Chief? Chief? Looks like a, looks about 150 pounds too light, but - [Austin] Where's the Arbiter? I didn't know that 1 1 7 stood for inches. (Laughing) - [Austin] Wait's still pretty good. I'll be 117 inches. - Yeah. That's still pretty good. You know, I've gotta say the helmet like that kind of looks like Master Chief's head and I don't really like that. - [Ken] It's kind of like, you actually beat him in person. and this is just your. - We defeated the Spartans. Oh my God. Oh wow. You guys actually got the mini fridge? So as a joke, when the Xbox Series X first got announced everyone made fun of it because it looked like a fridge. So the mad lads at Xbox they didn't take a joke laying down. They made an actual legitimate working Xbox. It's a mini fridge. And yet it is one to 0.5 to 1 scale. So it's even bigger than a Series X. Behold my friends, something wiggled inside. I don't like that. Behold, the Xbox Series XXL. Wow. It's even got the fake ports on the back. Do you see this? You got the mega USB. This is now 1.5 to 1 scale. That's way bigger than USB. That's huge. Yeah. That's oh - [Ken] Oh my God. Yo. Oh my, I can't believe they included that in there. - Did you really put our Series X inside the fridge? - [Ken] No. Yes.",
    "transcript_keywords": [
        "Series",
        "Xbox Series",
        "Yeah",
        "God",
        "Xbox",
        "cyber quad",
        "Xbox Series XXL",
        "Kamikoto",
        "Good",
        "USB",
        "box",
        "Wait",
        "studio",
        "cool",
        "put",
        "knife",
        "real cyber quad",
        "cyber",
        "quad",
        "FAO Schwarz"
    ],
    "transcript_entity_values": [
        "Kamikoto.com/Austin",
        "2",
        "1,900",
        "Twinkle Twinkle Little Star",
        "the Series S",
        "Matt] Bro",
        "First",
        "Chill",
        "Spartans",
        "Ka-Ching",
        "New York",
        "117 inches",
        "the Xbox Series X",
        "the end of last year",
        "Kenneth",
        "xScreen",
        "first",
        "Fr Elise\" - Beethoven",
        "the Series S",
        "Ken] People",
        "Ken",
        "USB",
        "Austin",
        "Xbox",
        "1",
        "two",
        "Indiegogo",
        "Mm",
        "Matt",
        "Xbox",
        "HDMI",
        "50",
        "Halo Infinite",
        "Tesla",
        "800 years",
        "Alternating",
        "FAO Schwarz",
        "Halo Infinite",
        "second",
        "seven inch",
        "Quad electric motor sound",
        "HP",
        "Pokemon",
        "about 150 pounds",
        "a year ago",
        "Microsoft",
        "one to",
        "Indiegogo",
        "Ken] Ooh",
        "Kamikoto",
        "five inch",
        "Yo",
        "11.6 inch",
        "English",
        "the last year",
        "Kamikoto",
        "a minute",
        "1.5",
        "Rewind",
        "PS",
        "10 miles an hour",
        "One",
        "Mystery Tech",
        "Michelin",
        "Japanese",
        "the Xbox Series S",
        "the Series S. However",
        "the FAO Schwartz",
        "0.5",
        "Cortana",
        "December",
        "The Series S",
        "Josh"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "LOC",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "NORP",
        "PERSON",
        "GPE",
        "QUANTITY",
        "LAW",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "EVENT",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "LANGUAGE",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.06015678122639656,
        -0.05792143568396568,
        0.002048362512141466,
        -0.13366343080997467,
        -0.002677751937881112,
        0.04567256197333336,
        0.04711492732167244,
        0.02647843025624752,
        0.06509499996900558,
        0.04812755063176155,
        0.04565151035785675,
        0.007684744894504547,
        0.04869598150253296,
        0.004807450342923403,
        0.021933913230895996,
        -0.022935716435313225,
        0.09485495835542679,
        -0.019292866811156273,
        -0.009919651784002781,
        0.0026814593002200127,
        -0.02432253398001194,
        -0.05875992774963379,
        -0.01888144388794899,
        -0.003544857259839773,
        -0.01622103527188301,
        0.058152686804533005,
        -0.07844939827919006,
        -0.03769763186573982,
        -0.037018559873104095,
        -0.017697347328066826,
        -0.023981479927897453,
        0.05214698240160942,
        0.0029813910368829966,
        -0.04327363520860672,
        0.03937457129359245,
        -0.006676396820694208,
        0.03173480182886124,
        0.00354556180536747,
        -0.06469214707612991,
        -0.08636912703514099,
        -0.07626403868198395,
        -0.06001502275466919,
        0.005771962460130453,
        -0.05732482299208641,
        0.02333875000476837,
        -0.01711912825703621,
        -0.032708413898944855,
        -0.130653977394104,
        0.005672390107065439,
        0.018805792555212975,
        -0.0603364072740078,
        -0.07553201913833618,
        0.11526414006948471,
        0.04387062042951584,
        0.041350219398736954,
        0.02115839347243309,
        0.05155593156814575,
        0.00790803786367178,
        0.06823889911174774,
        0.010323092341423035,
        -0.0017317988676950336,
        -0.12283747643232346,
        0.01254594512283802,
        0.03510431945323944,
        -0.0019719067495316267,
        0.008528148755431175,
        -0.06351885944604874,
        -0.03831852599978447,
        -0.07735131680965424,
        0.04742933809757233,
        0.021864155307412148,
        -0.006577128544449806,
        0.04508371278643608,
        0.02279493398964405,
        0.012050808407366276,
        0.029606392607092857,
        0.05985662713646889,
        -0.067503422498703,
        0.04745601490139961,
        0.029861707240343094,
        0.013411056250333786,
        -0.008162179030478,
        -0.09610426425933838,
        -0.04902764782309532,
        -0.06503769010305405,
        0.09877525269985199,
        0.04511375352740288,
        0.019542651250958443,
        0.002155725145712495,
        -0.005374535918235779,
        -0.05597592145204544,
        0.017619870603084564,
        0.013779353350400925,
        0.02781219780445099,
        -0.04259708151221275,
        -0.08129830658435822,
        0.02581409551203251,
        -0.02592470869421959,
        -0.055932678282260895,
        0.030963320285081863,
        0.06279999762773514,
        0.034304920583963394,
        0.07890967279672623,
        -0.07397016882896423,
        -0.0002219727757619694,
        -0.11073478311300278,
        -0.05374099314212799,
        0.11997079849243164,
        0.05033814534544945,
        -0.020004479214549065,
        -0.06941889226436615,
        -0.03185954689979553,
        -0.05790654942393303,
        0.044542789459228516,
        -0.01182632613927126,
        0.04475364834070206,
        -0.008944825269281864,
        0.03963380679488182,
        0.05106377229094505,
        -0.04533701390028,
        0.05606093257665634,
        -0.021548986434936523,
        -0.01714143715798855,
        0.009799560531973839,
        0.09386005997657776,
        -0.05893589183688164,
        -0.07714912295341492,
        2.351632835814627e-33,
        0.017834650352597237,
        0.09370343387126923,
        0.018148072063922882,
        -0.052323438227176666,
        0.052675098180770874,
        -0.10355748236179352,
        0.00934526789933443,
        0.09526693820953369,
        -0.04764552786946297,
        0.07472078502178192,
        -0.06171371042728424,
        0.08579601347446442,
        -0.05210909619927406,
        0.008332403376698494,
        0.028662409633398056,
        -0.044137779623270035,
        -0.08505737781524658,
        -0.09164631366729736,
        -0.008399596437811852,
        -0.010801702737808228,
        0.054753515869379044,
        0.0165676511824131,
        0.05354532599449158,
        0.020067520439624786,
        0.021084023639559746,
        -0.0028324227314442396,
        0.009629928506910801,
        0.0028501569759100676,
        0.07781895995140076,
        0.05387691408395767,
        -0.13141517341136932,
        -0.0008717989549040794,
        -0.006271818187087774,
        0.005953571759164333,
        0.0035303051117807627,
        -0.03090827725827694,
        -0.02684512920677662,
        -0.0952070951461792,
        -0.052896518260240555,
        0.08440188318490982,
        -0.01865055039525032,
        -0.024450521916151047,
        -0.09792424738407135,
        -0.05150792375206947,
        0.02080138958990574,
        -0.024899214506149292,
        0.04111623764038086,
        -0.013731242157518864,
        0.05451050028204918,
        0.03298911079764366,
        -0.04787196218967438,
        0.08314565569162369,
        -0.00841636024415493,
        -0.012997720390558243,
        -0.000740286719519645,
        -0.06627693772315979,
        0.01759895496070385,
        0.036864519119262695,
        0.0632033720612526,
        0.046311888843774796,
        0.02881450206041336,
        -0.0641559511423111,
        0.06657637655735016,
        -0.026456622406840324,
        -0.10252781957387924,
        0.027551822364330292,
        0.0854654386639595,
        -0.047665998339653015,
        -0.03428325057029724,
        0.04058729484677315,
        -0.027673467993736267,
        -0.04228422790765762,
        0.01622646674513817,
        -0.05826220661401749,
        0.10403911024332047,
        -0.08110811561346054,
        -0.08227680623531342,
        -0.00709795905277133,
        0.023033486679196358,
        -0.0006854600505903363,
        -0.028884638100862503,
        0.004104762803763151,
        -0.03557288646697998,
        0.09703308343887329,
        0.01252523623406887,
        -0.03894532844424248,
        -0.026283428072929382,
        0.006940268911421299,
        -0.05547217279672623,
        -0.04964645206928253,
        -0.11237185448408127,
        -0.07582760602235794,
        -0.04309309646487236,
        0.019977029412984848,
        -0.012548784725368023,
        -4.0793118008448456e-33,
        0.02047872170805931,
        -0.02434513531625271,
        -0.005393643397837877,
        0.07819994539022446,
        0.043430499732494354,
        0.008129245601594448,
        0.013920889236032963,
        0.0456882007420063,
        0.04756435379385948,
        -0.00042551246588118374,
        0.04005515202879906,
        0.06782526522874832,
        -0.014145341701805592,
        0.02429134212434292,
        0.05621415004134178,
        -0.04616807773709297,
        -0.045565929263830185,
        -0.03363629803061485,
        0.09363505244255066,
        -0.03351916745305061,
        0.08397669345140457,
        -0.04778682813048363,
        -0.005329629871994257,
        0.036333587020635605,
        0.04035433009266853,
        0.0971851497888565,
        0.03740493208169937,
        0.06439948081970215,
        0.006429208442568779,
        0.05701673775911331,
        -0.027150359004735947,
        -0.030076637864112854,
        -0.03622762858867645,
        0.03867936506867409,
        0.011358452029526234,
        0.002587617142125964,
        0.025240011513233185,
        -0.013604582287371159,
        -0.05111274495720863,
        -0.025334974750876427,
        -0.0060000247322022915,
        0.010817070491611958,
        0.006002054549753666,
        0.057053375989198685,
        0.02510310336947441,
        -0.0633639320731163,
        -0.030301395803689957,
        0.03716506436467171,
        0.07470003515481949,
        0.029232589527964592,
        0.06730014085769653,
        -0.006542405113577843,
        -0.023209210485219955,
        -0.05314772576093674,
        -0.1189151182770729,
        -0.0004127824504394084,
        -0.03428760543465614,
        0.05092168226838112,
        -0.028267687186598778,
        0.04055885225534439,
        0.023984503000974655,
        -0.030769910663366318,
        -0.021252619102597237,
        0.004497447982430458,
        -0.024985279887914658,
        0.038765426725149155,
        0.11817756295204163,
        0.0673258975148201,
        -0.03655882552266121,
        0.023843685165047646,
        -0.018965229392051697,
        0.007102241739630699,
        -0.0436260960996151,
        -0.09350284188985825,
        -0.011729706078767776,
        0.001539331511594355,
        -0.045041270554065704,
        -0.03693951293826103,
        0.0691019743680954,
        -0.033951859921216965,
        0.04445906728506088,
        0.022177567705512047,
        0.16227500140666962,
        0.03105221316218376,
        0.05357791483402252,
        0.061808180063962936,
        -0.07001528143882751,
        0.08234264701604843,
        -0.09634502232074738,
        0.025328993797302246,
        -0.015406891703605652,
        0.08993736654520035,
        0.019641423597931862,
        0.07114829868078232,
        -0.010544740594923496,
        -7.036207705368724e-08,
        0.04241083189845085,
        0.0562424510717392,
        -0.017938774079084396,
        -0.040428079664707184,
        0.08824038505554199,
        -0.02969255857169628,
        -0.010012241080403328,
        -0.027667537331581116,
        0.0014791577123105526,
        0.008886674419045448,
        -0.0020366478711366653,
        -0.06093260273337364,
        -0.01186116598546505,
        0.04677332937717438,
        0.0032395878806710243,
        0.04097047075629234,
        -0.09802697598934174,
        0.023848148062825203,
        -0.048476267606019974,
        -0.03777207061648369,
        0.015200832858681679,
        0.01676485687494278,
        0.031543880701065063,
        -0.0749129056930542,
        -0.0414348840713501,
        0.032172251492738724,
        -0.049872200936079025,
        0.04662462696433067,
        0.02244989201426506,
        -0.0008458076626993716,
        -0.11184866726398468,
        -0.036853354424238205,
        -0.036134008318185806,
        -0.04110085964202881,
        0.013141432777047157,
        -0.10863382369279861,
        -0.05592351406812668,
        0.02518618479371071,
        0.02520170249044895,
        -0.06012236699461937,
        0.014989744871854782,
        -0.06643307954072952,
        -0.025516396388411522,
        0.0034316214732825756,
        -0.022587763145565987,
        0.043359264731407166,
        -0.09064871817827225,
        -0.12669019401073456,
        -0.003717060200870037,
        0.051946405321359634,
        -0.013923312537372112,
        0.020730316638946533,
        -0.07599514722824097,
        0.04040836542844772,
        0.06145244836807251,
        0.008689980953931808,
        -0.013057148084044456,
        -0.018929099664092064,
        -0.009104558266699314,
        0.06523481756448746,
        0.007686097174882889,
        -0.05771346762776375,
        0.003934970125555992,
        0.025644570589065552
    ]
}