{
    "id": "If0ISjRjcBo",
    "title": "Smartphone Durability Awards 2021!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-01-07T16:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=If0ISjRjcBo",
    "category": "Howto & Style",
    "tags": [
        "smartphone awards",
        "best smartphone 2021",
        "smartphone durability awards",
        "iphone",
        "android",
        "folding phone",
        "best smartphone",
        "worst smartphone",
        "most durable phone",
        "phone wont break",
        "unbreakable phone",
        "unbreakable smartphone"
    ],
    "views": 814718,
    "likes": 39544,
    "comments_count": 1405,
    "description": "Its time to review the durability of 2021. Go to  to get a 2-year plan plus 1 additional month with a huge discount. Its risk-free with Nords 30 day money-back guarantee! 2021 was NOT a good year for smartphone durability. Lets take a look at some of the winners... Spoilers below:  Most repairable smartphone of 2021 Fairphone 4:  Least repairable smartphone of 2021 iPhone 13 pro Max:   Most innovative Smartphone Flip 3:   Best looking smartphone on the inside Legion Duel 2:   Least durable smartphone Legion Duel 2:   Most Delusive Smartphone: Not this year.  Most durable smartphone Duraforce Ultra:   2020 Smartphone Durability Awards:  2019 Smartphone Durability Awards:  2018 Smartphone Durability Awards:  2017 Smartphone Durability Awards:  2016 Smartphone Durability Awards:   Watch all the EV Humvee build videos in order HERE:    Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://NordVPN.com/JRE",
        "https://youtu.be/v-ZAMsMO-7c",
        "https://youtu.be/wpWFV41U5Wk",
        "https://youtu.be/7G62pp8gstQ",
        "https://youtu.be/iVixsjxdwCs",
        "https://youtu.be/Jz_vxrm8rjM",
        "https://youtu.be/7PW8I-LUJzE",
        "https://youtu.be/8XuexCeeaqg",
        "https://youtu.be/YqxrcEiFJtI",
        "https://youtu.be/QkuAvC3zHEc",
        "https://youtu.be/Uvh3v1BkJ-A",
        "https://youtu.be/0oChYfB96lo",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It's time for the 2021 Smartphone Durability Awards. It feels good to finally close out 2021. Not quite as crazy as 2020, but still, you know, good to put it behind us. It's been a pretty big year. We installed some off-grid solar panels on my barn. Plugged some fruit trees into the ground. Introduced two new JerryRig knife flavors. And introduced JerryRig Jr. into the world...all while pulling the guts out of a military Humvee, installed an electric motor, building batteries, and getting it rolling under its own electric power. It's been a busy year, but we've also had a lot of time to durability test and tear down plenty of smartphones. Unfortunately though, it has not been a good year for smartphone durability. We've had more phones break this year than any other year. The ROG Phone 5 catastrophically kicked the bucket, [The sound of chips in your mouth] along with the Legion Dual 2...just snapped in half. [The sound of burning money] And a brand-new phonecalled the Carbon 1 MK II lived out it's few minutes of life right here on my desk. [Crunch of small rodent bones] We've had a lot of smartphones break this year, but what makes it a little awkward is that none of the folding phones, which you would expect to be fragile, ended up breaking. Along with the iPad, which we would also expect to be fragile, survived the durability test. So today we'll be giving out the Smartphone Durability Awards of 2021. Should be pretty interesting. Let's get started. [Intro] Let's start things off with the most repairable smartphone of 2021, and that goes to, no one's surprise, the Fairphone 4, which is actually designed to be taken apart, has a removable battery, and replacement parts available directly from the manufacturer. Fairphone is miles ahead of everyone else when it comes to repairability. Interestingly enough though, Apple announced a new program starting in 2022 called self service repair where people can start to fix their own iPhones. So it'll be interesting to see how that goes. But as for 2021, the Fairphone 4 takes first place. Runner up though would probably be the Pixel 6 Pro with just some adhesive, one screw and one little ribbon holding the screen to the body. A screen repair could probably be done in about 60 seconds. So runner up for most repairable phone goes to the Pixel 6 Pro. Now as far as the least repairable smartphone of 2021, that has to go to the iPhone 13 Pro Max. While the screen repair itself is relatively easy, the problem comes with the different screws of different sizes, as well as the digitally locked parts. But the biggest issue in what wins this phone the lease repairable smartphone of 2021 is the rear glass replacement. The glass is permanently installed onto the phone and impossible to replace. And Apple charges $599 for them to fix it. And it's one of the most common things that would ever break on an iPhone. Of course if the rear glass ever does break, instead of paying $599 for the replacement, you can just grab a Teardown Skin. Far easier, and after all, pretending not to be broken is what life is all about. It'll be interesting to see if Apple's repair program does include these pieces of glass and hopefully someday Apple will build their phones in a way that can be repaired. Until then though, this glass ridiculousness is what earns them the least repairable smartphone of 2021. The most innovative smartphone of 2021 was a hard one. We didn't have the craziness of last year with the LG Wing, as it would flip out in a T-shape with its dual screens. Everyone here kind of played it safe. Samsung, however, managed to do something relatively unique...waterproofing their folding phones both the Flip 3 and the Fold 3, all while building it strong enough that they survived the durability test and I could completely disassemble the Flip and put it back together in one working piece. So even though it's been around for a few generations now, those improvements make the Samsung Galaxy Flip 3 the most innovative smartphone of 2021. But what about the best looking smartphone on the inside? The Galaxy Flip 3 does look pretty sweet with it's gold contact pad and multicolored motherboards. Along with the iPhone 13's magnets on the back surrounding its copper coil. It was pretty hard to decide this year because we also have the Microsoft Duo 2 which looks pretty stealthy inside with it's black motherboards and long batteries. Stuff we don't normally see inside of smartphones. But if I had to pick just one, it would probably be the Legion Duel 2 which probably had the most packed inside of it of any other phone this year. With its dual internal cooling fans, copper ductwork, RGB lights, ultrasonic triggers, and a stepper motor with a popup camera. It was just a super cool all-around phone. I mean, yeah, it did kind of open up unintentionally during the bend test, and didn't exactly live very long. But other than that, I think the Legion Duel 2 is the best looking smartphone from the inside, even if it was dead, and that sounds kind of creepy. Which brings us to the least durable smartphone of 2021. Now we did have a lot to pick from, but if I had to pick one it would again go to the Legion Duel 2. This thing started off heavy and solid and I just thought, you know, it gave me no indication that it was going to snap in half...until it snapped in half. And it might very well be the easiest phone to snap in half of all time, giving the Nextbit Robin from back in 2016 a run for its money. And that phone was plastic. So while this might be the coolest looking phone from the inside, it doesn't help a whole lot when you can't survive on the outside. The Legion Duel 2 wins the least durable smartphone of 2021. I also have another award called the delusive award which is given to a smartphone manufacturer who kind of had some misleading advertising. But I think so far this year, 2021, most smartphones arrived as they were advertised, so we'll put that award on the back burner and save it for maybe next year. It's not an award you want to win. As far as the most durable smartphone of 2021, it comes to no one's surprise yet again that it goes to the Kyocera Duraforce Ultra 5G. This guy is a tank with a rubberized plastic body that can survive 5 foot drops onto concrete. It also has a pure sapphire display which is scratch resistant to a level 8 on Mohs scale of hardness. Exponentially harder than a tempered glass Mohs 6. It's also not just water resistant, it's waterproof and liquid damage is covered under warranty. Since it has a sticky rubber gasket inlaid between the two halves of the phone to keep water out. It's protections like that that we usually see in underwater drones. So while it might not be the sleekest looking phone of 2021, it is by far hands down the most durable. Remember that any one of these smartphones on my desk, including the one in your pocket could be considered the most durable as long as it has a case and a screen protector. Personally I always have a case on my own phone which is the Galaxy Note 10 from back in 2019...you know, in the before-times. Smartphones these days are really good and end up lasting for a really long time so it's a good idea to protect your investment. You don't have to buy a new phone if your current phone isn't broken. And that concludes the smartphone durability awards of 2021. I'm curious though, you know, obviously these are my opinions. I'm curious to hear yours. Do you think a different phone should have won a particular award? Let me know down in the comments. Up to this point in the video I've been talking about physical protection for your smartphones, but what about digitally protecting yourself online? Huge thanks to NordVPN for sponsoring this video. A VPN or virtual private network allows you, with one click, to create a tunnel that's encrypted for all of your internet traffic. And no one can see into this tunnel to get your IP address or physical location. This is especially important when you're on public wi-fi. NordVPN works on all of your devices whether you're on Windows, Mac, the three of you on Linux, or Androids and iPhones. You can have simultaneous VPNs running on up to 6 devices at a time. Don't take my word for it though. With over 14 million users worldwide and a 30-day money back guarantee, it's worth trying out. NordVPN.com/JRE. Plus NordVPN is super fast with over 5,200 servers in over 60 different countries, you can browse the interest from anywhere around the world while you're sitting on your own couch. Along with creating an encrypted tunnel for your data, a VPN is good for accessing content that's not available in your country. NordVPN.com/JRE. You can get a 2 year plan with a huge discount, plus one free month. Huge thanks to NordVPN for supporting the channel. Link is down in the description. Like always, come hang out with me on Instagram, and Twitter. Hit that subscribe button and turn on notifications so you can make sure to see when your future phone gets tested. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Smartphone Durability Awards",
        "Smartphone",
        "Phone",
        "Smartphone Durability",
        "year",
        "Legion Duel",
        "repairable smartphone",
        "Durability",
        "Durability Awards",
        "durable smartphone",
        "Legion",
        "good",
        "flip",
        "durability test",
        "Galaxy Flip",
        "phones",
        "award",
        "glass",
        "inside",
        "back"
    ],
    "transcript_entity_values": [
        "2022",
        "2019",
        "iPhone",
        "2020",
        "Flip",
        "a busy year",
        "one free month",
        "30-day",
        "the Legion Dual 2",
        "about 60 seconds",
        "8",
        "Instagram",
        "2 year",
        "two",
        "Nextbit Robin",
        "Pro Max",
        "three",
        "Humvee",
        "Linux",
        "the Fairphone 4",
        "14 million",
        "miles",
        "JerryRig",
        "VPN",
        "RGB",
        "half",
        "599",
        "Androids",
        "JerryRig Jr.",
        "iPad",
        "next year",
        "this year",
        "5 foot",
        "5",
        "Apple",
        "iPhones",
        "the LG Wing",
        "Samsung Galaxy Flip 3",
        "few minutes",
        "the Microsoft Duo 2",
        "Galaxy Note 10",
        "first",
        "last year",
        "over 60",
        "a good year",
        "Samsung",
        "today",
        "2016",
        "these days",
        "the Smartphone Durability Awards",
        "the Kyocera Duraforce Ultra",
        "Windows, Mac",
        "Fairphone",
        "the Pixel 6 Pro",
        "2021",
        "13",
        "one",
        "Twitter",
        "up to 6",
        "5,200"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "FAC",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.1778109073638916,
        0.038044773042201996,
        0.09733770042657852,
        -0.05534869059920311,
        0.007225207053124905,
        -0.04441716894507408,
        0.022690750658512115,
        0.04435762017965317,
        -0.05760399252176285,
        0.024349939078092575,
        0.030758917331695557,
        -0.012943807989358902,
        0.07880048453807831,
        0.01598431169986725,
        0.04561658948659897,
        -0.006468184757977724,
        0.06604379415512085,
        -0.07192959636449814,
        -0.0006707014981657267,
        0.01833219639956951,
        -0.023188380524516106,
        -0.00041746586794033647,
        0.005381121300160885,
        -0.0029239486902952194,
        0.011003128252923489,
        0.030113806948065758,
        -0.08953545987606049,
        -0.007614842616021633,
        -0.09601647406816483,
        -0.07966333627700806,
        -0.0001423657377017662,
        0.1196613758802414,
        -0.05109488219022751,
        0.011782445944845676,
        -0.01148000918328762,
        -0.06320367753505707,
        -0.01607753522694111,
        -0.00953686237335205,
        -0.07616687566041946,
        -0.024241095408797264,
        -0.08994703739881516,
        -0.1161714568734169,
        -0.05990631878376007,
        0.0107507836073637,
        0.029513368383049965,
        -0.041681159287691116,
        0.06105572730302811,
        -0.02832106314599514,
        0.018180662766098976,
        0.01127873919904232,
        0.045653048902750015,
        -0.03195067122578621,
        0.11226429045200348,
        -0.03454214334487915,
        -0.04728647321462631,
        0.025517312809824944,
        -0.044435445219278336,
        0.035634059458971024,
        0.04745582118630409,
        -0.0009821908315643668,
        0.042556896805763245,
        0.010334542021155357,
        -0.023316022008657455,
        0.06846877932548523,
        0.01284798700362444,
        -0.01867120899260044,
        0.0066186594776809216,
        -0.02381777949631214,
        -0.035325534641742706,
        0.04128725081682205,
        0.010136116296052933,
        -0.023217614740133286,
        0.001885184203274548,
        -0.017518673092126846,
        0.0474708192050457,
        0.10683497041463852,
        0.03998976945877075,
        -0.019910341128706932,
        -0.0770210400223732,
        -0.026904070749878883,
        0.023153049871325493,
        -0.08333400636911392,
        0.005257362499833107,
        0.008293457329273224,
        0.06825070083141327,
        -0.029632115736603737,
        -0.00598697317764163,
        0.019170738756656647,
        -0.04733743891119957,
        -0.08196195960044861,
        0.0024581891484558582,
        0.11642555147409439,
        -0.023814383894205093,
        0.02409980446100235,
        -0.021304238587617874,
        -0.008984949439764023,
        -0.0630377009510994,
        -0.060383111238479614,
        -0.07323601841926575,
        0.05019272491335869,
        0.0020023721735924482,
        0.04981637001037598,
        0.03492061048746109,
        0.0038579413667321205,
        0.026306036859750748,
        -0.06411062926054001,
        -0.02216334082186222,
        -0.024451419711112976,
        0.017650682479143143,
        0.019696753472089767,
        0.021290021017193794,
        0.004257639870047569,
        -0.005462111905217171,
        -0.0012543685734272003,
        -0.04671049118041992,
        0.047305792570114136,
        -0.11953219771385193,
        0.07763589173555374,
        0.18557104468345642,
        0.014208159409463406,
        0.022360140457749367,
        0.012151800096035004,
        -0.04034150764346123,
        -0.0735117644071579,
        0.0463743694126606,
        0.024830341339111328,
        0.01112299133092165,
        9.015915305164232e-33,
        -0.040831103920936584,
        0.10020987689495087,
        -0.027143385261297226,
        0.041086990386247635,
        -0.06084481626749039,
        -0.017902961000800133,
        0.01879805140197277,
        0.042455900460481644,
        -0.07488219439983368,
        -0.03182878717780113,
        -0.023498153313994408,
        0.059676848351955414,
        -0.06098072975873947,
        0.05463626980781555,
        0.07855143398046494,
        -0.05168469250202179,
        -0.03839099034667015,
        -0.06753882020711899,
        -0.06318958103656769,
        -0.022858276963233948,
        -0.0012838823022320867,
        -0.042218323796987534,
        0.023755449801683426,
        0.02161535620689392,
        0.07503208518028259,
        0.05092395097017288,
        0.12017663568258286,
        -0.045110251754522324,
        0.06432285159826279,
        0.05583890527486801,
        -0.094810850918293,
        -0.013987645506858826,
        0.023061884567141533,
        -0.019762424752116203,
        -0.06648966670036316,
        0.06369281560182571,
        -0.05129178613424301,
        -0.07989344745874405,
        -0.0451086163520813,
        -0.014824415557086468,
        -0.08673353493213654,
        0.0029378742910921574,
        -0.08516065776348114,
        -0.06473852694034576,
        0.0122846569865942,
        -0.03027108497917652,
        0.026369977742433548,
        0.014406376518309116,
        -0.022874725982546806,
        -0.003425711067393422,
        -0.08356323838233948,
        -0.01173937227576971,
        -0.05768708884716034,
        -0.04466467723250389,
        -0.06261394172906876,
        -0.05210939422249794,
        0.01570259779691696,
        -0.05455255135893822,
        0.03894766420125961,
        0.05452576279640198,
        0.027093902230262756,
        0.052389275282621384,
        -0.0593576580286026,
        -0.010971018113195896,
        -0.04570357874035835,
        0.06980642676353455,
        0.018951531499624252,
        0.0005844428087584674,
        -0.07182982563972473,
        0.043208979070186615,
        0.022086720913648605,
        -0.013748275116086006,
        0.023539938032627106,
        -0.03348207846283913,
        0.0752800852060318,
        0.006351233460009098,
        0.011888762935996056,
        -0.004551072604954243,
        0.036984123289585114,
        -0.050656307488679886,
        -0.09797170758247375,
        0.005762307904660702,
        0.05665016174316406,
        0.03460179269313812,
        0.03630099073052406,
        -0.05920618027448654,
        -0.004131937399506569,
        -0.10263911634683609,
        -0.0522458590567112,
        0.06012515723705292,
        -0.00745405862107873,
        -0.02588108368217945,
        0.0539868026971817,
        0.0005177374114282429,
        -0.006953931413590908,
        -1.0486224373856718e-32,
        -0.02089112065732479,
        0.01379241980612278,
        0.06144965812563896,
        0.04480128735303879,
        0.04745054617524147,
        -0.055850666016340256,
        0.013758353888988495,
        0.12990447878837585,
        -0.019737377762794495,
        -0.06225408986210823,
        -0.015576434321701527,
        0.08053290843963623,
        0.001834218855947256,
        -0.035962872207164764,
        0.01856338605284691,
        -0.03158329054713249,
        -0.04426829516887665,
        -0.10826808959245682,
        0.006048812065273523,
        0.01969001814723015,
        0.13959333300590515,
        0.05117259547114372,
        0.02031736448407173,
        0.08048024773597717,
        -0.022669997066259384,
        0.007521501742303371,
        -0.02348805032670498,
        -0.04084983095526695,
        0.03894167020916939,
        -0.03197191283106804,
        -0.049214527010917664,
        -0.06979970633983612,
        -0.0031429503578692675,
        0.04712122306227684,
        0.09319029003381729,
        0.047175753861665726,
        0.03273061662912369,
        0.022785307839512825,
        -0.023371851071715355,
        -0.02637353725731373,
        0.02632022462785244,
        -0.025026792660355568,
        -0.006926168221980333,
        0.021067624911665916,
        0.06605584174394608,
        -0.08426515012979507,
        -0.0934840589761734,
        -0.03411667421460152,
        0.04971807077527046,
        -0.009611365385353565,
        0.05252832546830177,
        0.0054353573359549046,
        -0.017229419201612473,
        0.012622429057955742,
        -0.052380118519067764,
        0.02253507263958454,
        0.05374501273036003,
        -0.019475020468235016,
        -0.0386362262070179,
        -0.03487236052751541,
        0.033363331109285355,
        0.022725693881511688,
        -0.00866212509572506,
        0.01978856883943081,
        -0.013679079711437225,
        -0.058127179741859436,
        0.044024065136909485,
        0.01318997424095869,
        -0.013252324424684048,
        0.00462437653914094,
        -0.046877458691596985,
        -0.017254533246159554,
        -0.041320230811834335,
        -0.10409772396087646,
        -0.02591424062848091,
        0.039062559604644775,
        -0.03691823035478592,
        -0.02039196714758873,
        -0.027873286977410316,
        -0.049140460789203644,
        0.00156605604570359,
        0.04189685732126236,
        0.0028348525520414114,
        0.013938424177467823,
        0.05853179842233658,
        -0.014774169772863388,
        0.01918616332113743,
        -0.01701757311820984,
        -0.028842976316809654,
        0.05303381383419037,
        -0.047431737184524536,
        0.007300229277461767,
        -0.06843770295381546,
        0.1381569355726242,
        -0.02787012979388237,
        -6.230824567410309e-08,
        0.06914404034614563,
        0.11500553041696548,
        -0.05662570148706436,
        -0.02872638590633869,
        0.03436829894781113,
        -0.09266644716262817,
        0.014893281273543835,
        -0.030227819457650185,
        0.05227471888065338,
        0.0025126952677965164,
        0.04051649942994118,
        -0.06669523566961288,
        -0.025537773966789246,
        0.06321492046117783,
        0.00756864296272397,
        0.06501764804124832,
        -0.048658210784196854,
        0.06847190111875534,
        -0.045852433890104294,
        -0.0013426666846498847,
        0.020480521023273468,
        0.02289670892059803,
        0.0354573018848896,
        -0.041076723486185074,
        -0.02279742620885372,
        0.003283595433458686,
        -0.09141745418310165,
        -0.03899240121245384,
        0.063213050365448,
        -0.026475006714463234,
        -0.04575600102543831,
        -0.013441106304526329,
        0.006824278272688389,
        -0.023363687098026276,
        -0.003811928443610668,
        -0.0027931760996580124,
        -0.008268436416983604,
        -0.031120315194129944,
        0.08085465431213379,
        0.023267162963747978,
        0.011021248064935207,
        -0.08518128842115402,
        0.024274231866002083,
        0.06505508720874786,
        0.04833059757947922,
        -0.09394756704568863,
        0.0005631333333440125,
        -0.12177347391843796,
        -0.029586125165224075,
        0.023754658177495003,
        -0.04839898645877838,
        -0.06652811914682388,
        -0.008304139599204063,
        -0.00854757335036993,
        0.04100095108151436,
        0.06905770301818848,
        0.021515775471925735,
        -0.02606070600450039,
        0.02343044988811016,
        0.01901479996740818,
        0.10463355481624603,
        -0.12211334705352783,
        0.020585166290402412,
        0.11382182687520981
    ]
}