{
    "id": "IflG3vEtgAA",
    "title": "Galaxy S21 Ultra review: third time’s a charm",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-01-21T16:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=IflG3vEtgAA",
    "category": "Science & Technology",
    "tags": [
        "galaxy s21 ultra",
        "galaxy s21 ultra review",
        "The verge",
        "Verge",
        "Dieter Bohn",
        "Samsung",
        "Apple",
        "S21 Ultra camera test",
        "S21 ultra vs iPhone 12 Pro Max",
        "S21 ultra top features",
        "S21 plus",
        "S21 camera",
        "S21 ultra camera",
        "Galaxy s21",
        "Samsung S21",
        "Samsung galaxy",
        "samsung galaxy s21 ultra",
        "s21 ultra camera",
        "samsung galaxy s21 ultra vs iphone 12 pro max",
        "galaxy s21 ultra s pen",
        "galaxy s21 ultra vs iphone 12 pro max",
        "s21 ultra vs note 20 ultra",
        "s21 5g",
        "s21 s pen",
        "one ui 3.0"
    ],
    "views": 519442,
    "likes": 12305,
    "comments_count": 908,
    "description": "The Samsung Galaxy S21 Ultra is a huge, powerful Android phone with no fewer than five cameras. The main 108-megapixel sensor is the best Samsung has ever shipped  promises were made and, for once, kept. Dieter Bohn reviews the newest flagship phone from Samsung featuring the new Snapdragon 888, 120hZ refresh rate screen, and all its much-improved cameras.   Read the full review here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2XYx5AH",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - This is the Samsung Galaxy, hold on. Yeah, that's better. This is the Samsung Galaxy S21 Ultra. And I know what you're thinking. Another year, another big Samsung phone, am I right? Well, actually, no, this year's first big Samsung phone is the Galaxy S21 Ultra. And it's different because this is our third Ultra phone. There was the S20 Ultra the Note 20 Ultra and now this. And three iterations means that Samsung has had time to work out all of the kinks. Now in Samsung world Ultra means that it should be the biggest and best version that you can get. And last year, the original S 20 Ultra was not that much better than the regular S 20s. The camera had issues, and it was a lot more expensive. This year the Galaxy S21 Ultra is much better. The camera's improved, and the price has dropped by 200 bucks. So it starts at $1,200. So I guess third time's a charm. So we have to start with the obvious thing about Ultra phones. They are huge. The screen on the Galaxy S21 Ultra is 6.8 inches diagonally. And if you're keeping count and you know that Samsung is keeping count, that makes this phone 0.1 inches bigger than the iPhone 12 Pro Max screen. But the S21 is taller and narrower than the Max and therefore to me, it's just much easier to hold. See, Samsung has kept the curved edges on the screen and actually don't mind it here, I think it works. And it means that the bezels are that much smaller and the phone can be that much narrower. The iPhone 12 Pro Max just feels way bigger, because it's wider. As long as we're comparing the Samsung phone to the iPhone let's just get it all out of the way right at the top. Right now I think some of you are going to disagree with me but I think the Galaxy looks better. I do love the new squared off edges on the iPhone, but you know what? The camera bump here is one of those things that we forgot looks weird, because we got so used to camera bumps, but it is it's weird. And so Samsung's fix for the camera bump is to make the metal rails on the side curve right into it. And I actually think it looks slick as hell. And it means that the camera glass here is just a little bit recessed. Although yes, there are just a lot of camera holes here and that, that does look weird. Speaking of the back it's Gorilla Glass Victus also same on the front, and it has this matte finish, which is pretty nice. And yes, it is Phantom black, and it does look very black in person. It also resists fingerprints pretty well, but it might be a little bit more delicate than I would want it to be. We just set this down a concrete to get a shot and it's already got a little bit of scratch on it, where you can see silver underneath. Maybe that was a dumb idea, but, now you know. Anyway, look you're only getting this phone if you love big phones and Samsung is just better at making big phones than Apple is. They've been doing it for way longer. Samsung's version of Android lets you size text how you want. It can have a little side rail on the side that you can swipe in for extra functions. It makes it fairly simple to split screen apps, lets you turn apps into little pop-up windows that shrink down to floating bubbles. You can just do a lot more with these phones. Look, the size of these phones they're basically tablets and Samsung is just better at putting tablet options into its software. So big phone, good, right? Well sure but, honestly it's not that hard to find a big Android phone. The point of the S 21 Ultra is to be the most powerful and capable Android phone, price be damned and right now, yeah, this is that. Let's come back to the screen. It's 3,200 by 1440 pixels and you can set it to have an adaptive refresh rate so it can dynamically change from 10 to 120 Hertz. That makes scrolling and animation smooth but it saves battery life when there's nothing moving on the screen. And on the S 21 Ultra for the first time, you can have both maximum resolution, and higher refresh rate at the same time. You don't have to pick one or the other. Actually a funny story about the screen, usually when Samsung launches a big new phone, it will talk for like an hour about it's screen tech but with this one, they're just like, yep, this is the best screen. And yep, it is. I mean hell sometimes I would even switch the color from natural which I usually prefer to vivid just to feel more alive. I think the screen looks great. This is also the first mass market phone with a new Snapdragon 888 processor from Qualcomm. So it has Wi-Fi 6E both kinds of 5G, has better graphics, and of course it's fast. It benchmarks really well, though of course the iPhone still beats it. But to me, the important thing is that feels fast and there's never any lag. And for the first time in an S series phone, there's support for Samsung styluses, the S pen they're separate and I assume they'll work fine. Samsung didn't send us one. So I can't test it. But looking at the demos, if you've ever used a Note, it's going to probably be about the same experience here, minus support for Bluetooth. Now the $1,200 base model has 128 gigs of storage and 12 gigs of RAM. For 50 bucks more, you can step up to 256 gigs of storage and there's a 512 model that has 16 gigs of RAM and it's 180 bucks more. And really you should get one of those models with more storage because in order to cut the price on this phone down from where it was last year, Samsung had to take some stuff out. So, you know, we know they took the AC adapter out of the box, because Apple did so of course Samsung is going to do it, but they also cut the micro SD card slot. And that move felt inevitable, but it is kind of a bummer to not have expandable storage, especially for a phone that can shoot 8K video and let you take 108 megapixel photos if you want to. But for me, none of the specs that I've just rattled off, the positive or the negative were as important to my experience of using this phone as the next spec. It has Qualcomm's newest, fastest and biggest fingerprint sensor in the screen. There's a much bigger area that you can tap to unlock. And I do mean just tap. It's just like boop, unlocked. Boop, unlocked. Boop. It's great. And also, you know, it works if you're wearing a mask. And speaking of great, battery life. On this phone for the review, I turned on all the bells and whistles. I had max resolution adaptive refresh rate, always on screen, I had the brightness cranked all the way up most of the time, and then I spent days and days shooting tons of photos, and testing out 4K and a little bit of 8K video and I never killed the battery until basically halfway through day two. There's a 5,000 milliAmp battery in this thing, and I think it's enough. (upbeat music) Really though the thing that Samsung wants to separate the Ultra Galaxy phones from the other Galaxy phones are the cameras. The Ultras are the ones that get Samsung's 108 megapixels sensor, and they're also the ones that get longer telephoto lenses. So, okay. What do we got here? Five cameras. There's the main 108 megapixel sensor at F 1.8, which kicks out 12 megapixel images by default, there is a 12 megapixel ultra wide. Then there are not one but two 10 megapixel telephoto lenses, one at a 3 X zoom in one at a 10 X zoom. And the other hole here is for the laser auto focus sensor. Then the fifth camera is the 40 megapixel selfie camera on the front, which does 6.5 megapixels by default but you can get the full 40 megapixels if you want. So let's start with that 108 megapixel camera, because it is the heart of this whole system. It is a second generation Samsung sensor. The first one was in the original Galaxy S 20 Ultra and that 108 megapixel sensor was a whiff. It had focus problems which Samsung later had to fix on the Note 20 Ultra with a laser for autofocus, which is also here but other than that though, it just wasn't really worth the hype. Samsung's regular cameras on the regular S 20s were almost as good. Now with the Galaxy S 21 ultra, well now it's good. I haven't had any shutter lag. I haven't had any misfocus issues and things like the narrowed plane of focus seemed a little bit better too. It is a noticeable step up from last year. In fact, there's really only one other smartphone camera that's even in the same league as his phone. And it is not the Pixel 5 which I gotta say has really fallen behind this year. Now the other phone that's worth talking about here is the iPhone 12 Pro Max which also has a larger sensor compared to the other iPhone. So, you know what? Let's just look at some samples. So I think this first photo is a really good representative example of what the S 21 Ultra can do. I set the focus point through the fence and I love that it grabs sharpness, and detail of everything behind the fence, whole lighting of the fence itself had a little bit of blur. Plus the colors here are super accurate to what I was seeing during that shoot. Here's a night mode shot, and let's just get into the S21 Ultra versus the 12 Pro Max. I prefer how Samsung exposed the bike here, but I think both are good. And just look at the detail on the tire thread in the shot. Mwah! Here's another comparison photo, and you can start to see how these cameras have different opinions on how to expose things. Samsung still wants to make things just a little bit brighter than I like while Apple has honestly learned its lesson and is happy to leave contrast and shadows in. Now here's comparing portrait mode, and again, Samsung kind of just over does it with the colors a little bit, but I do think it has slightly better sharpness. Comparing ultra wides, both seem fine. I think it comes down to just choices and preferences and color and exposure. On the whole, I do think the iPhone has a very slight edge in these comparisons, but it's very slight. On the other hand, the S 21 has a bunch of other tricks and this year I think they're more than just gimmicks. So let's talk about zoom. There's both a 3X zoom and a 10X optical zoom here, which means that you can get better images in zoom, and that sort of sub 10 X range without having to resort to weird crop shucks that Samsung sometimes does. So here's an example, starting at the main sensor going in at 3X and then 10 X, all very good. Then Samsung still has this space zoom feature that's supposed to let you get to 100 X I guess it's better than last year. You can kinda get something decent at 30X and very good light, but of course at a 100 X, it's still a mess. But that 10 X zoom with its Periscope lens, it really does yield better results that you can get from other cameras and the iPhone specifically. So if you start here, this is a very challenging low light shot, but then you zoom in at 10 X and yeah the galaxy definitely wins at that zoom level. Then there's video and there's a bunch of Samsung camera tricks here as well. So for example, it can now shoot 4K 60 out of every single camera lens, that seems gimmicky but I've noticed a significant improvement in quality shooting out of the ultra wide camera. It can also still do 8K video, but now you can pull out a slightly better still out of the 8K if you want. It also has a director's mode built in so you can get a preview of what's happening from every single lens and switch between them as you're shooting. I wish you could record them all as separate streams and edit them in post but that's probably too much to ask for. As for the results, well, we're very happy with the stabilization how to adjust exposure on the fly during a shot and the sharpness. This is a very good video camera. And I also have, I have to say I love Samsung's pro modes for both photo and video. It's nice to have them built into the main camera. Samsung's also got a raw option for photos too but you know what? I'm going to save talking about that until we can look a little bit closer at it versus Apple's pro raw some other time. Oh yeah, Samsung also does other gimmicks. So here's me goofing with single take two, which combines all of Samsung's gimmicks into one single button that you can press. Keep doing stuff. Here's where I'm landing. The camera system on the Galaxy S 21 Ultra is very good I think the best you can get on Android right now. But you probably wanna know what I think of it compared to the iPhone 12 Pro Max. Well, look, if you took 50 photos of each of the main cameras on these phones, I think that 30 would be a toss up based on your personal preference. Then the S 21 would be clearly better on, I don't know seven or eight or nine and the iPhone 12 Pro Max would be clearly better on like 11, 12 or 13. So very, very close, and I think the story is about the same on video, but the Galaxy S21 has a bunch of other stuff that you can do built into the camera, and unlike in previous years with Samsung, some of those new tricks are really good. One last thing with the camera and to me, one of the most important things, here's a selfie portrait mode shot with the wind making my hair go nuts. The S 21 handles the portrait stuff fine, but pay attention to the lines on my face. What you are seeing here is that you can finally, finally turn all of the face smoothing off. I mean, it makes me look like an old man now, but that's what I am. So, thank you. All right, let's talk software. Here's how Samsung's versions of Android work. They get way too messy and complicated, and then we all complain and then eventually Samsung simplifies things and then the cycle starts again. And right now we are heading towards the land of Samsung complication. One UI is still good for big screens, but there's just too many options. I mean, look at quick settings. Most of this stuff doesn't mean anything to the average person. And then I don't know. Let's check on the default weather widget on the home screen. Oh, look, there's an ad built into the software. Cool. Then there's Bixby, which is Samsung's digital assistant, and it is surprisingly not total trash. If you set it up and you set smart things up for your home and you just live that whole Samsung life it's totally passable, but it's also not necessary. The Google assistant is still here on this phone and it's still better. You do have to use some third-party software to remap the button, but look it up, it's totally worth it. Then there's the texting situation. Here in the US for whatever reason Samsung is being made to ship Samsung messages by default, whereas everybody else gets Android messages and therefore RCS directly from Google. Now, some US carriers do support RCS in Samsung messages but only kinda so, AT&T doesn't do RCS that works with other carriers for example. There's also this cross carrier messaging initiative which doesn't seem like it's doing anything and it's still a mess so look RCS problems aren't Samsung's fault, but as the biggest seller of Android phones in the US you would think Samsung would be trying harder to fix this problem. But if you know, you can install Android messages and you'll be fine. And that's the story with every Samsung phone. If you know your way around Android, you can make this S21 Ultra, an amazing and powerful and efficient phone. You can set the left of the homescreen feed to Google, instead of Samsung's weird content deals feed. You've got all those multitasking options. You've got wireless desks to turn this into a desktop computer. You just have to know how to do it all. And if you do, it's great. And if you don't, it's a little confusing. So that is the Samsung Galaxy S 21 Ultra. It has the fastest speeds, the best camera system and the nicest screen of any Android phone right now. It has a battery that lasts more than a full day. It has a new beautiful design, and some iffy software choices. Look, I don't think it's going to convince anybody to switch away from something like an iPhone 12 Pro Max but it is basically an equivalent phone if you prefer Android to iOS. And if you're wondering how the smaller Galaxy S 21 phones compared to this thing, that review is coming up next week, But I will just tell you this It is a little bit disappointing but if you want the best Galaxy phone, you do have to get the biggest one. And make no mistake, this is the best Android phone if you're willing to deal with the screen size and the price. I don't know how long the Galaxy S 21 Ultra can hold on to that best Android phone crown, but it definitely has it right now. Everybody, thanks so much for watching. Let me know do you think the S 21 ultra is for you? Do you love the Phantom black? Talk about that in the comments and also ask me what you want to know about the regular smaller Galaxy S 21, because I am working on that review right now.",
    "transcript_keywords": [
        "Samsung",
        "Ultra",
        "Samsung Galaxy",
        "Samsung phone",
        "Ultra Galaxy phones",
        "phone",
        "Galaxy",
        "big Samsung phone",
        "Android phone",
        "Pro Max",
        "camera",
        "Android",
        "Samsung world Ultra",
        "Galaxy phones",
        "phones",
        "screen",
        "Ultra Galaxy",
        "Max",
        "big Samsung",
        "Pro"
    ],
    "transcript_entity_values": [
        "Android",
        "108",
        "S21",
        "6.8 inches",
        "128",
        "three",
        "the S 21 Ultra for the",
        "3X",
        "5",
        "Galaxy S 20",
        "20",
        "UI",
        "One",
        "This year",
        "12 megapixel",
        "50",
        "sub 10",
        "200 bucks",
        "RAM",
        "180 bucks",
        "5,000",
        "Galaxy S 21",
        "more than a full day",
        "third",
        "888",
        "Snapdragon",
        "Google",
        "1440",
        "Five",
        "the Galaxy S21 Ultra",
        "RCS",
        "Qualcomm",
        "Phantom",
        "Samsung",
        "Galaxy",
        "6.5 megapixels",
        "12",
        "Another year",
        "3,200",
        "this year",
        "10 megapixel",
        "first",
        "the Samsung Galaxy",
        "40",
        "10",
        "last year",
        "11",
        "the Galaxy S21",
        "30",
        "Periscope",
        "AT&T",
        "50 bucks",
        "Boop",
        "the S 21",
        "Pro Max",
        "AC",
        "8",
        "US",
        "0.1 inches",
        "512",
        "10 X",
        "F 1.8",
        "13",
        "Ultras",
        "256",
        "4",
        "SD",
        "second",
        "the Galaxy S 21 Ultra",
        "fifth",
        "the S 21 Ultra",
        "one",
        "Apple",
        "days",
        "previous years",
        "Bixby",
        "eight",
        "year",
        "108 megapixels",
        "Hertz",
        "Wi-Fi 6E",
        "3",
        "1,200",
        "40 megapixels",
        "two",
        "The S 21",
        "next week",
        "seven or",
        "Max",
        "iPhone",
        "100",
        "16",
        "108 megapixel"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "EVENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "FAC",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "LOC",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.13086819648742676,
        -0.07674440741539001,
        0.02197626419365406,
        -0.06678306311368942,
        0.02229314111173153,
        -0.031544316560029984,
        -0.03829088434576988,
        0.056167155504226685,
        0.014007525518536568,
        -0.008853458799421787,
        0.02948824129998684,
        0.030593303963541985,
        0.048843398690223694,
        -0.0007042367942631245,
        0.05177229270339012,
        -0.10717607289552689,
        0.09151990711688995,
        -0.10806319862604141,
        -0.07370010018348694,
        0.00435319310054183,
        0.019386842846870422,
        0.002052614465355873,
        0.03208790346980095,
        0.02617594599723816,
        -0.01330164261162281,
        -0.004150589928030968,
        -0.08626995980739594,
        -0.05900668352842331,
        0.009955822490155697,
        -0.027486495673656464,
        0.04780062288045883,
        0.16949443519115448,
        0.06698966026306152,
        0.035428911447525024,
        -0.02677295356988907,
        -0.12976230680942535,
        -0.007846822030842304,
        -0.013941380195319653,
        -0.009486470371484756,
        -0.020125102251768112,
        -0.046684566885232925,
        -0.020791463553905487,
        0.039098311215639114,
        -0.028304448351264,
        0.02352699637413025,
        -0.08027144521474838,
        0.02914520725607872,
        -0.08091084659099579,
        0.002750424901023507,
        -0.007627285085618496,
        -0.014990892261266708,
        -0.06811115145683289,
        0.026853136718273163,
        0.06618422269821167,
        -0.025064488872885704,
        0.03602372482419014,
        -0.03625621646642685,
        -0.03195495530962944,
        0.0853695347905159,
        -0.012147539295256138,
        0.08076026290655136,
        -0.06096980348229408,
        0.025014368817210197,
        0.005350012332201004,
        0.021871665492653847,
        0.023726101964712143,
        -0.005700329784303904,
        -0.050401318818330765,
        -0.01007875707000494,
        -0.018277538940310478,
        0.0072771357372403145,
        0.049404554069042206,
        0.045175641775131226,
        0.06443430483341217,
        -0.006979632191359997,
        0.0005717746680602431,
        0.058739326894283295,
        0.025880787521600723,
        -0.015854567289352417,
        -0.07379660755395889,
        0.07157266139984131,
        -0.10418851673603058,
        -0.05265086516737938,
        -0.035414762794971466,
        0.03922911360859871,
        -0.04703841730952263,
        -0.03769750893115997,
        0.0398264043033123,
        -0.12949518859386444,
        -0.01980162225663662,
        -0.034308288246393204,
        0.04973919317126274,
        -0.04291605204343796,
        0.009892070665955544,
        -0.04969073086977005,
        0.02586885169148445,
        -0.09603787958621979,
        -0.04442756995558739,
        0.0009590443805791438,
        0.013945273123681545,
        0.05293189734220505,
        0.06601458787918091,
        0.07897728681564331,
        -0.0004036557802464813,
        0.08520924299955368,
        -0.05973644554615021,
        -0.0024747729767113924,
        -0.001401551067829132,
        0.018400706350803375,
        0.034781597554683685,
        -0.007114939391613007,
        0.03075573407113552,
        -0.02081398293375969,
        0.039309218525886536,
        -0.07904580235481262,
        -0.022055817767977715,
        -0.0002497321111150086,
        0.03763812035322189,
        0.056658197194337845,
        0.017801282927393913,
        -0.0043882569298148155,
        0.02447718381881714,
        -0.07294495403766632,
        -0.10383031517267227,
        0.03778062388300896,
        0.057713381946086884,
        -0.024618186056613922,
        3.159162006328022e-33,
        0.028024891391396523,
        0.11813024431467056,
        -0.022068465128540993,
        -0.0024036152753978968,
        -0.01656191796064377,
        0.04095333069562912,
        -0.025825167074799538,
        0.05592333525419235,
        -0.02457531727850437,
        -0.017289550974965096,
        -0.05686413124203682,
        0.027293559163808823,
        0.016595622524619102,
        0.04662725701928139,
        0.04516037553548813,
        -0.07767529040575027,
        -0.08438962697982788,
        -0.05836397409439087,
        -0.028780462220311165,
        -0.0145645746961236,
        0.030822034925222397,
        0.009761410765349865,
        0.04142536595463753,
        -0.03568286448717117,
        0.07294295728206635,
        -0.006663020234555006,
        0.12130987644195557,
        0.03440484777092934,
        0.03219905123114586,
        0.013107450678944588,
        -0.07345951348543167,
        -0.022364923730492592,
        0.036591287702322006,
        -0.01145669724792242,
        0.005439594388008118,
        -0.02651164121925831,
        0.0358261875808239,
        -0.101163350045681,
        0.06101936101913452,
        -0.01423819363117218,
        -0.024333864450454712,
        0.06924710422754288,
        -0.1210385262966156,
        0.014116733334958553,
        0.041001249104738235,
        0.05665590614080429,
        -0.026064807549118996,
        0.05771039426326752,
        -0.029199928045272827,
        -0.012541464529931545,
        0.0030307872220873833,
        -0.02734876237809658,
        -0.026674171909689903,
        -0.02170128934085369,
        -0.05752921476960182,
        -0.0008519035764038563,
        -0.0012394016375765204,
        -0.011241160333156586,
        0.01483359094709158,
        0.04743363708257675,
        0.015069682151079178,
        -0.014243507757782936,
        -0.03699398413300514,
        0.12303505837917328,
        -0.020357215777039528,
        0.11545751988887787,
        0.024315301328897476,
        0.07863953709602356,
        -0.028024666011333466,
        0.06333712488412857,
        0.01762891560792923,
        -0.06384582072496414,
        0.0904141366481781,
        -0.04656987637281418,
        0.1452380120754242,
        -0.014523878693580627,
        -0.006371524650603533,
        -0.0021286015398800373,
        -0.014390758238732815,
        0.01787765882909298,
        -0.0863490179181099,
        0.01919763721525669,
        0.03798779100179672,
        0.035980548709630966,
        -0.03383270278573036,
        -0.026119086891412735,
        -0.0010459523182362318,
        -0.026763927191495895,
        -0.015236200764775276,
        0.010712088085711002,
        -0.009147735312581062,
        0.00951560027897358,
        0.06562399119138718,
        0.07476145774126053,
        -0.04911809414625168,
        -2.6233264981591133e-33,
        -0.005583800841122866,
        0.05634989216923714,
        0.021585026755928993,
        -0.020179683342576027,
        0.022711297497153282,
        -0.04574461653828621,
        0.033335935324430466,
        0.07889942824840546,
        -0.03139929473400116,
        -0.03603046014904976,
        0.0688493400812149,
        0.0033330556470900774,
        -0.0006134037394076586,
        -0.06845268607139587,
        -0.007288659922778606,
        -0.02978234924376011,
        0.037203337997198105,
        -0.15798820555210114,
        -0.023624079301953316,
        -0.014941868372261524,
        0.04020440950989723,
        0.029062405228614807,
        -0.034718144685029984,
        0.07153749465942383,
        -0.013737845234572887,
        0.040019333362579346,
        -0.011081012897193432,
        0.04936141148209572,
        0.002511836588382721,
        -0.024784117937088013,
        -0.03293047472834587,
        -0.08748123049736023,
        0.007604803889989853,
        -0.007290189620107412,
        0.021445557475090027,
        0.025360694155097008,
        0.04634522646665573,
        -0.07263640314340591,
        -0.03155696764588356,
        -0.013688159175217152,
        -0.0031090809497982264,
        0.014209437184035778,
        0.018629400059580803,
        -0.002043562475591898,
        0.02799268439412117,
        -0.006370845716446638,
        -0.015444956719875336,
        0.02613556943833828,
        -0.03906618431210518,
        -0.03955937549471855,
        0.03087916038930416,
        -0.010362598113715649,
        0.004335783421993256,
        0.02991028130054474,
        -0.015231139026582241,
        -0.024833232164382935,
        -0.0170440636575222,
        -0.03827488049864769,
        0.0014471907634288073,
        -0.027501316741108894,
        0.12618909776210785,
        -0.008470017462968826,
        -0.049534689635038376,
        -0.028986431658267975,
        -0.05872003734111786,
        -0.02654801867902279,
        0.019645512104034424,
        -0.06581752747297287,
        0.01048739068210125,
        0.04477742314338684,
        -0.028051745146512985,
        -0.020756421610713005,
        -0.09576202183961868,
        -0.030137503519654274,
        -0.014481891877949238,
        0.07442683726549149,
        -0.05482814088463783,
        -0.0759926587343216,
        -0.018984394147992134,
        -0.041314747184515,
        0.004471964202821255,
        0.01915709301829338,
        0.07139737904071808,
        0.06272441148757935,
        0.09247274696826935,
        0.016393205150961876,
        -0.020252427086234093,
        -0.021972183138132095,
        -0.027997706085443497,
        0.009118587709963322,
        -0.1299586445093155,
        -0.005492952186614275,
        -0.07976368069648743,
        0.047806017100811005,
        0.019068848341703415,
        -5.629504329363044e-08,
        0.07408390194177628,
        0.00930769369006157,
        0.002719918033108115,
        -0.015596170909702778,
        0.018061809241771698,
        -0.09634605795145035,
        -0.03010871633887291,
        0.05116363987326622,
        0.0821840912103653,
        -0.008846186101436615,
        0.0187991876155138,
        -0.0850820541381836,
        -0.018663844093680382,
        0.0037489295937120914,
        0.05516165494918823,
        0.04742235690355301,
        0.01840059645473957,
        -0.019591907039284706,
        -0.01702176220715046,
        0.012165856547653675,
        0.003955570049583912,
        0.08725017309188843,
        0.04795539751648903,
        -0.036803022027015686,
        0.08260080963373184,
        0.025524603202939034,
        -0.03157849982380867,
        -0.0019414988346397877,
        0.062450166791677475,
        -0.060342900454998016,
        -0.003122875466942787,
        -0.08579527586698532,
        -0.004578875843435526,
        0.011045561172068119,
        -0.003896227804943919,
        -0.06648769974708557,
        0.02718866989016533,
        -0.003871506778523326,
        0.15557965636253357,
        0.020694658160209656,
        0.03967003524303436,
        -0.03761623799800873,
        -0.02547488547861576,
        0.07779382914304733,
        -0.032571375370025635,
        -0.12168040871620178,
        -0.014476585201919079,
        -0.07695389539003372,
        0.003134249709546566,
        0.039579808712005615,
        -0.028309520334005356,
        -0.10041875392198563,
        0.005675383377820253,
        -0.00016272436187136918,
        0.025088783353567123,
        0.021153723821043968,
        -0.017018115147948265,
        -0.0079901572316885,
        -0.0718393474817276,
        0.09953174740076065,
        0.15523618459701538,
        -0.026116041466593742,
        -0.048976313322782516,
        0.13072322309017181
    ]
}