{
    "id": "iFXPfRYkiOo",
    "title": "This Laptop SLAPS!!! - Apple MacBook Air 2020",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-04-10T18:11:07Z",
    "video_url": "https://www.youtube.com/watch?v=iFXPfRYkiOo",
    "category": "People & Blogs",
    "tags": [
        "Apple",
        "MacBook Air",
        "Laptop",
        "Retina",
        "REsolution",
        "Finger Print",
        "Intel",
        "Processor",
        "i5",
        "i3",
        "High Definition",
        "Audio",
        "Speakers",
        "Sound",
        "Quality",
        "Metal",
        "Stiff",
        "Passive",
        "USB-C",
        "Dongle",
        "Retina Display",
        "Performance",
        "Magic Keyboard"
    ],
    "views": 559464,
    "likes": 21432,
    "comments_count": 2424,
    "description": "Has Apple actually been able to fix all the flaws of the last MacBook Air?  Buy Apple MacBook Air 2020 On Amazon (Paid Link):  On BHPhoto (Paid Link):   Buy Dell XPS 13 On Amazon (Paid Link):  On BHPhoto (Paid Link):   On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/K075N",
        "https://geni.us/e7B7Elq",
        "https://geni.us/2I51n",
        "https://geni.us/yVBvqP",
        "https://geni.us/0mCSXnI",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This right here is the brand new MacBook Air and I am really excited to check it out because the last model I actually liked a lot. I kind of considered switching to it for a little bit actually, but it had two really big problems. For one, it only came with a dual core processor. So like multitasking, you can basically just write it off, you know like you go to screen record something you guys probably don't try and do that, but I try and do that all the time and it just doesn't do it. You open too many tabs and the whole thing gets kind of bogged down in general multitasking, just not a great time. It's also has their new magic keyboard, which apparently solves the problem of the last one, which for one it was just bad no one liked it. And for two it was really unreliable and like, you know a speck of dust gets in there and it breaks. So let's take a look at this one. We ended up going for the i5 model, so that's a quad core. The entry is at $1,000 which is going to be tempting for a lot of people, but I think you should stay away from it cause you get an i3 that's only a dual core, which you know you can do it, but you're going to have such a better experience if you just go with the quad core. So here it is. I believe that this model right here costs us $1,400 U S. We also went with the 16 gigabyte upgrade and 512 gigs of storage. So it should be a very competent little machine assuming you know it's cooled well and lives up to my expectations. Let's check it out. So we have this little tab here. I was actually hoping to slay this open with a knife, but that feels good too. I don't normally have to actually take the wrapping off of these things. Normally the shipping and receiving guys do it. It's a real treat. (paper wrapping) (box shaking) Oh that smells really good. I don't know what it is, but certain like materials that different manufacturers use for their laptop packaging. This one just smells fantastic. Got the lock. Actually, let's leave that for a second. Laptops, they're designed by Apple in California. Welcome to your MacBook Air. MacBook Air automatically starts up when you lift the lid. Set up assistant helps you get up and running. I believe that this is just 30 Watts, which at the same time this thing is just going to sip power anyway, so I imagine it's fine. USBC, I quite like that they've gone with USBC for these. Like they've done it for a really long time, but you know it's always nice that they keep on doing it. MagSafe was of course awesome, but it's not standard so take your battles where you can win on my guess One of those things that Apple just really nails like the feel of this cable is just so good. Like there's just some rubber on it really like it. It's probably my favorite. Well it's my favorite since the HP Spectre. That one was braided and also really good. Get this plugged in. Actually probably don't even need to plug it in. This thing probably has battery already in it. Apple just always absolutely nails the look of their laptops. I don't know what it is about this. There's like really nothing going on with the design, but it just really exudes like premium quality. All of the metals are so solid. Like you can press here, you can press up here. It's not moving at all no matter what you do. I think that they even patented the type of unibody design that there is on this. So you actually can't get that kind of build quality no matter what you do. Can you one hand it, yes (upbeat music) Some in here it's already starting up. Oh, just look so good. The bezels are a lot larger than what you'd find on like the x360 or the new Dell XPS 13 it's not a deal breaker and I actually kind of like the slightly more bezel, not because of the look of the bezels but because of the amount of wrist rest area that you yet. So like if we look here actually... - Choose english as the main language - hey press the return key actually. - okay I guess we're setting it up. Okay, well we'll be back in a second when this is a set up laptop. To run a setting up touch ID, which is one of those things where I really like it, but also I kind of don't. So on windows machines, the best that you can get right now is IR face detection. So you open it up, it's sees your face and then boom, you're in. Like on the new XPS 13 it has both touch and IR and I've never used the touch at all. Like maybe once that said touch ID does have some stuff that windows machines just don't have. So like if you're using Apple Pay you can just hit touch ID, you don't have to enter a password or anything like that or say that like you have several people using the computer, one of them can just go up, touch the touch ID and next thing that you know you're logged in, you don't have to worry about actually signing in and out. It's a pretty awesome system. I just wish that they also had facial recognition. The stiffness of the screen is great. Like in one of the videos that I did recently, I kind of moved the screen like this and it was like, it's really wobbly, but who does that? And I saw it in the comments someone was like, why do you even do that test? We have to do that test because people like Apple get it right. You can try and do as much as you can do this and it's just not going to flex the whole chassis no matter where you press. There's no deflection at all. This thing is just a freaking beast. Well, it's really small. It's not really a beast, but it's very solid. (keyboard typing) Based off like several seconds of typing, I have to say actually like this quite a bit. I do kind of wish that there is a bit more than the one millimeter of travel, but that's it, I'm pretty sure that I could get used to it really fast. The old switches that they had there were like snappy, but in a way that made you kind of have to bottom out and I found that my fingers were getting tired really fast. Whereas this right here, it's a bit softer and I feel like that I could really get motoring on it. Again, Apple just always nails the build quality things. So one thing that a lot of laptop manufacturers don't quite get right is the key consistency between like all the different switches. So maybe like say the J key might move just a tiny bit more than like K or L or whatever or the amount of force required to hit it is just a tiny bit different. From what I've seen here, every single switch feels exactly the same and that's the sort of thing that you need if you want to like really get typing fast without any errors. As for the trackpad, it's just great. It's absolutely massive and Apple always pushes trackpads forward, which I guess at this point the kind of have to, because they don't have any touch screens, which is pretty unfortunate these days. Getting used to Mac OS just kind of sucks. The last time that I did it, I actually had no problems at all after like three days. It's one of those things where you think it's going to matter until you actually do it and then you realize that it's just a computer. You just kind of do your work once you've gotten used to it. Let's just take a look at the screen here. I have the XPS 13 this has actually been my daily driver for about the last week. I'm going to really face these two off in the full review cause they both seem freaking awesome. Looking at both of these screens they both seem really awesome. The one on the Dell is not the highest end model that you can get there is a 4K version for this, but why do you need 4K screen on a 13 inch laptop? I do really like the tiny bit of extra crispness that you get with the MacBook Air though. So it's a 2560x1600 p display, which is just a bit more than 1080 but not quite to 4k. So it's a really nice middle ground where you get that extra little bit of resolution without it just being totally stupid where you have to have your face like here for it to make a difference. The last thing that I want to check out here are the speakers. So according to Apple they kick ass and if the MacBook Pro 16 inches, anything to do off the probably really do. Those ones in the MacBook pro are really good. Let's just boot up some crab rave here, the good old classic sound test. Now try and sync these two. (Dell classic music) (MacBook Air classic music) So those sound really good. Just listening to it right now. Let's switch it over to the XPS 13 Oh, those are just worse. These aren't bad speakers, but there's just so much more depth and detail in the Macs going back. (MacBook Air classic music) (MacBook Air classic music) Oh yeah. This just has a bit of refinement to it that you really don't get on the Dell. (MacBook Air classic music) There's the MacBook air. (Dell classic music) Oh no, no, absolutely not. Okay, the MacBook Air absolutely takes it for speakers. Wow, that's crazy though, there's just these little little speakers here. How do they make that much noise with them? It's amazing (MacBook Air classic music) They're going to kill Bluetooth speaker sales if they keep on getting this good jeez. So I'm really excited to really put this through the paces. I think that the one thing that might be lacking is power, but at the same time, how much do you care if like you're thin and light can blaze through, I don't even know what you're trying to do on this. That would need a whole bunch of power. So I think it's going to be a pretty intense competition. So I'm really excited to test out the new MacBook Air, the new Dell XPS 13 the new Spectre x360 because really if any single one of these had dropped a year ago, it would have been without a doubt the best thin and light on the market. Yeah so yes, that's the one thing that this might have problems with are just thermals. I think it's entirely passively cooled. So if it can't quite keep the CPU in check, maybe you have to get the MacBook Pro 13 inch depending on when that comes out and if it has the magic keyboard and stuff, it probably will, but we don't know yet. Anyway, I'm really excited for this comparison, so get subscribed to the Linus tech tips for that. Get subscribed to short circuit for more of these and I don't know, have a good day. See you later.",
    "transcript_keywords": [
        "MacBook Air",
        "thing",
        "kind",
        "Apple",
        "bit",
        "MacBook",
        "good",
        "Air",
        "touch",
        "things",
        "XPS",
        "Dell XPS",
        "MacBook Pro",
        "time",
        "Dell",
        "screen",
        "tiny bit",
        "core",
        "MacBook Air absolutely",
        "model"
    ],
    "transcript_entity_values": [
        "USBC",
        "the MacBook Pro 16 inches",
        "a year ago",
        "XPS 13",
        "4",
        "one",
        "4k",
        "the MacBook Pro 13",
        "x360",
        "several seconds",
        "MacBook",
        "english",
        "second",
        "Watts",
        "13",
        "13 inch",
        "Spectre",
        "1,000",
        "daily",
        "K or L",
        "Macs",
        "a good day",
        "these days",
        "two",
        "us $1,400",
        "more than 1080",
        "California",
        "Mac",
        "the HP Spectre",
        "512",
        "the MacBook Air",
        "Linus",
        "XPS",
        "CPU",
        "MacBook Air",
        "16 gigabyte",
        "MacBook",
        "Dell",
        "Apple",
        "IR",
        "about the last week",
        "MacBook Air"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "PRODUCT",
        "LANGUAGE",
        "ORDINAL",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT"
    ],
    "vector": [
        -0.02437244914472103,
        -0.06712176650762558,
        0.06281350553035736,
        0.04048812761902809,
        0.07342123240232468,
        -0.01149365771561861,
        0.0002885341818910092,
        0.007201959379017353,
        -0.010891375131905079,
        0.026695726439356804,
        0.03943580016493797,
        0.027399033308029175,
        -0.004880642052739859,
        -0.03745953366160393,
        0.07385873049497604,
        0.03641693666577339,
        0.04888300597667694,
        -0.08199920505285263,
        -0.04119070619344711,
        -0.022054383531212807,
        0.015188261866569519,
        -0.02975771576166153,
        -0.049823202192783356,
        -0.02327008731663227,
        -0.0009252179879695177,
        -0.00954378116875887,
        0.025866450741887093,
        -0.08456500619649887,
        -0.09661915153265,
        -0.05092167481780052,
        0.030678486451506615,
        0.026793552562594414,
        -0.04687638580799103,
        -0.004815061576664448,
        0.09346495568752289,
        -0.07999739795923233,
        0.024233611300587654,
        -0.03735310211777687,
        -0.021561304107308388,
        -0.11928686499595642,
        -0.08566546440124512,
        -0.04003031924366951,
        0.036400217562913895,
        0.05410990118980408,
        0.03527727723121643,
        -0.046449288725852966,
        0.03810512274503708,
        -0.017507178708910942,
        0.04381424933671951,
        0.03223281353712082,
        -0.04835224896669388,
        -0.0785783901810646,
        0.0230523981153965,
        -0.017539380118250847,
        0.00036246282979846,
        0.08608099073171616,
        -0.022396672517061234,
        -0.06253638863563538,
        0.002360533457249403,
        -0.06099124252796173,
        0.02498621493577957,
        -0.08657872676849365,
        -0.01721864752471447,
        0.03265491500496864,
        0.05270255357027054,
        0.006353085394948721,
        0.01547666173428297,
        -0.05234679952263832,
        -0.030694231390953064,
        0.04388290271162987,
        0.04908781498670578,
        -0.014761622063815594,
        0.0073052034713327885,
        0.06963127851486206,
        -0.012246604077517986,
        -0.026688285171985626,
        0.020357664674520493,
        -0.1092279776930809,
        -0.002277164254337549,
        0.015578816644847393,
        -0.0010156655916944146,
        -0.029032528400421143,
        -0.011775070801377296,
        -0.04400767385959625,
        0.015777086839079857,
        -0.053302865475416183,
        -0.01683783531188965,
        -0.010777551680803299,
        0.02752717025578022,
        0.012270313687622547,
        -0.008945993147790432,
        0.034617435187101364,
        0.06533615291118622,
        -0.000883923377841711,
        0.008147052489221096,
        -0.03857794776558876,
        0.09732119739055634,
        0.030141327530145645,
        -0.028626220300793648,
        0.019227540120482445,
        0.008764130063354969,
        0.05631719157099724,
        0.13597361743450165,
        -0.07978539168834686,
        -0.035467129200696945,
        -0.04449305310845375,
        0.05525030940771103,
        0.013791377656161785,
        -0.040548864752054214,
        -0.02194555662572384,
        0.0037410438526421785,
        0.027570242062211037,
        -0.017850065603852272,
        -0.015760600566864014,
        0.06805486232042313,
        0.03530801087617874,
        0.0010685583110898733,
        -0.0539020411670208,
        0.03494972363114357,
        0.06175479292869568,
        -0.007911193184554577,
        0.02020983211696148,
        -0.014225414022803307,
        0.030793417245149612,
        0.014901498332619667,
        0.004469807725399733,
        -0.0734383836388588,
        7.027786281255142e-33,
        -0.032793257385492325,
        0.011756575666368008,
        -0.02860504947602749,
        -0.04556896910071373,
        0.015179531648755074,
        -0.027313852682709694,
        0.047875210642814636,
        0.011781436391174793,
        -0.05871931463479996,
        0.08245593309402466,
        -0.07775893807411194,
        -0.02930920384824276,
        -0.06894969940185547,
        0.03953855112195015,
        0.08268805593252182,
        -0.03335953131318092,
        -0.10657183825969696,
        -0.03469806909561157,
        -0.04287397861480713,
        0.0807410255074501,
        0.07865124195814133,
        -0.029052548110485077,
        -0.03689875453710556,
        -0.038886524736881256,
        -0.024936677888035774,
        0.01433736551553011,
        0.040374670177698135,
        -0.034099679440259933,
        -0.01756659522652626,
        0.045033298432826996,
        -0.06027431786060333,
        0.002828919095918536,
        -0.06918173283338547,
        -0.056778229773044586,
        -0.09037840366363525,
        -0.04512528330087662,
        -0.010741889476776123,
        -0.036476511508226395,
        0.044781338423490524,
        -0.04680570960044861,
        -0.1411406248807907,
        0.08519836515188217,
        -0.034036170691251755,
        -0.005317831411957741,
        0.0375371091067791,
        0.03630262240767479,
        -0.04530820995569229,
        0.08108058571815491,
        -0.04674886539578438,
        0.06543715298175812,
        -0.04788590595126152,
        0.0017868464346975088,
        0.06064856797456741,
        0.02404998242855072,
        -0.09018095582723618,
        0.057526446878910065,
        0.022496746852993965,
        -0.05962488055229187,
        0.1009485274553299,
        0.07672898471355438,
        0.05521870777010918,
        -0.0345786027610302,
        -0.06996123492717743,
        -0.0158220287412405,
        -0.06257180869579315,
        0.07911509275436401,
        0.11972139030694962,
        0.03093797340989113,
        -0.005340802017599344,
        0.04086275026202202,
        -0.08250903338193893,
        -0.016641678288578987,
        0.026024650782346725,
        -0.0963863655924797,
        0.03192838281393051,
        -0.04234403371810913,
        -0.04958280920982361,
        -0.04629085958003998,
        -0.08406399935483932,
        0.002778970869258046,
        0.09060070663690567,
        0.05521083623170853,
        0.1045704334974289,
        -0.027183091267943382,
        -0.008529606275260448,
        0.03305880352854729,
        0.0009766110451892018,
        0.05145843327045441,
        -0.038196247071027756,
        0.08243373781442642,
        -0.00331295607611537,
        0.03463079780340195,
        -0.010198552161455154,
        0.03774500638246536,
        0.0015878037083894014,
        -6.075172271504484e-33,
        0.00553161883726716,
        -0.08156493306159973,
        -0.03504534810781479,
        0.03390749171376228,
        -0.04490649700164795,
        0.06775427609682083,
        -0.04435665160417557,
        0.036011964082717896,
        -0.036334529519081116,
        -0.09494839608669281,
        -0.035973649471998215,
        0.081488698720932,
        -0.02943315915763378,
        -0.01870090141892433,
        0.014718499965965748,
        -0.051170941442251205,
        -0.07329040765762329,
        -0.057936735451221466,
        0.027056166902184486,
        -0.027510184794664383,
        0.03189847990870476,
        0.0022545757237821817,
        -0.003404965391382575,
        -0.0722435712814331,
        -0.03844430297613144,
        0.020073382183909416,
        -0.1050090342760086,
        0.045090168714523315,
        0.05562547966837883,
        0.0324760340154171,
        0.03208288177847862,
        0.04180403798818588,
        0.10000009089708328,
        0.05157238245010376,
        0.0940825492143631,
        0.011498265899717808,
        -0.017080558463931084,
        0.008966552093625069,
        0.0566495880484581,
        0.05943731963634491,
        0.06215745955705643,
        0.029279613867402077,
        0.02498604916036129,
        -0.0031772686634212732,
        0.06300059705972672,
        0.07018435746431351,
        -0.06670209765434265,
        -0.1294412761926651,
        -0.026228243485093117,
        -0.053222090005874634,
        -0.015252641402184963,
        -0.07192325592041016,
        -0.018926851451396942,
        0.013022179715335369,
        0.05099409818649292,
        -0.043449170887470245,
        -0.04736388847231865,
        0.01118047721683979,
        0.023451518267393112,
        -0.04975072667002678,
        -0.023664547130465508,
        0.028857940807938576,
        0.04925303906202316,
        -0.046962298452854156,
        0.09894431382417679,
        -0.027511730790138245,
        0.009843663312494755,
        -0.0043980954214930534,
        0.02320767194032669,
        0.06524568796157837,
        -0.11931031942367554,
        0.006288821343332529,
        -0.011333588510751724,
        -0.10009820014238358,
        0.044188037514686584,
        0.0802619606256485,
        0.004377411678433418,
        -0.04235599562525749,
        -0.0856468603014946,
        0.022217588499188423,
        -0.05006985366344452,
        -0.00803320948034525,
        0.02611917071044445,
        0.02817840687930584,
        -0.02820134162902832,
        0.07519090175628662,
        0.014434115961194038,
        -0.00430081645026803,
        -0.057901691645383835,
        0.021309057250618935,
        -0.025725333020091057,
        0.010067719966173172,
        -0.02546432800590992,
        -0.023591937497258186,
        -0.037314917892217636,
        -5.329444618951129e-08,
        -0.05810362473130226,
        0.007698743138462305,
        0.026190413162112236,
        0.10894825309515,
        0.0174051932990551,
        -0.03696819767355919,
        0.007562803104519844,
        -0.003232591785490513,
        0.13801321387290955,
        0.06425024569034576,
        0.08845308423042297,
        -0.1025836244225502,
        0.03984905406832695,
        0.020855868235230446,
        -0.006336050573736429,
        0.018779583275318146,
        -0.05476241558790207,
        0.11195255815982819,
        9.061848686542362e-05,
        -0.018922090530395508,
        0.0062432074919342995,
        0.06487414240837097,
        0.0821361169219017,
        -0.02025328204035759,
        -0.003980107139796019,
        0.016657600179314613,
        -0.01879110559821129,
        0.0174242053180933,
        0.06797192990779877,
        0.002065793378278613,
        -0.12107544392347336,
        -0.01698710024356842,
        -0.02853178046643734,
        -0.005149657838046551,
        -0.04975956305861473,
        -0.10065887123346329,
        0.015623758547008038,
        0.025732355192303658,
        0.07422497123479843,
        0.027910809963941574,
        -0.009463582187891006,
        -0.019141944125294685,
        -0.06290902197360992,
        0.002137164119631052,
        0.04519063979387283,
        -0.019272714853286743,
        -0.022089039906859398,
        -0.0698571503162384,
        -0.010955004952847958,
        0.05338800325989723,
        0.015121733769774437,
        -0.00313332281075418,
        0.03314055874943733,
        0.030784303322434425,
        -0.002444253535941243,
        0.019451091066002846,
        0.006634160410612822,
        0.026381362229585648,
        0.01712815649807453,
        0.059118907898664474,
        0.08242130279541016,
        -0.09827733039855957,
        -0.11395766586065292,
        0.10340619832277298
    ]
}