{
    "id": "IGBakb5crHQ",
    "title": "How To Stop Spam Calls!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-08-17T23:16:50Z",
    "video_url": "https://www.youtube.com/watch?v=IGBakb5crHQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Verizon Call Filter",
        "Robocalls",
        "Spam Calls",
        "How to stop spam calls"
    ],
    "views": 167959,
    "likes": 6800,
    "comments_count": 753,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine. And today is gonna be a little bit different of a review. (phone chimes) Oh, shoot. God. Oh my God, I just keep getting freaking phone calls. Like, how am I ever gonna get anything done? Hello? - Hi. This is your doctor calling, wondering- - Hello? - If you've got the test results in that we sent to- - No. - Your email about... - (sighs) Spam calls, it's a freaking problem. Like, spam calls are such a problem, that- (phone chimes) (sighs) Oh, shoot, wait. Let me just answer this really quick. This may be a delivery I'm expecting. Hello? - Hello, this is Sam from Insurance Rock. - Who's this? - [Sam] I would like to know, are you happy with your coverage, because if you're not, we're running a special today only. - Hello? - If you call in the next- - Oh! - 24 hours, we will give you- - You're just- - The lowest rates- - You're talking over me, because you're not a real person! - Please call us back at- (phone thuds) - It's so frustrating. Where was I? I don't even know. Look, this is no joke. I think for the past couple of years, I honestly hardly ever even answer my phone. Like, why would I? Most of the calls are spam. All of the calls that I'm doing now are usually conference calls, and they're planned, so if somebody is calling me, it's either, one, an emergency, two, potentially food is at the door, or three, it's a delivery. So it's like, do I answer it? Do I risk maybe talking to a spam robot person? It's really hard to say. But today's video, I'm really excited, because I'm partnering with Verizon, and they've been the leader in the fight against robocalls. And I'm really excited to show you guys this Call Filter app, which is a free solution that is available to all Verizon customers to help you battle these annoying calls. It's funny, because my sister actually told me about this, and she's like, wait, you haven't downloaded this yet. What is wrong with you? So she's been using it for quite a while, and now, since I've been using it, I have been so much less likely to answer a spam call, like I did in the beginning of this video, 'cause clearly, that was scripted and fake and not real. Acting! Wow! So in this video today, we're gonna be going over how to tell if a call is spam, what Verizon is doing to help, and some other tips and tricks that you can use to protect yourself. Now a lot of these things may be second-nature to you, but maybe your parents or your grandparents could use some of these tips. Feel free to send this video to somebody who you think it may help. (phone chimes) (Justine sighs) - Oh, look. - Namaste. - Another- - If you have- - Spam call. - [Man] Tired all the time, wondering whether or not the chronic pain your feeling in your back can be relieved. - Stop. - [Man] Well, let me tell you- - I'm gonna battle these robocalls the only way that I know how. - [Man] You just let us know, and we'll deliver it to you, free of charge, (light saber thuds) because hipping is free when- - Whoa! Scene! - [Man] Namaste here forever in your belly. Please call and send for- - My light is moving, and I think I might've shaved off a few leaves of my fake plant. I'm gonna put this away. Maybe this will do the trick? (solemn rock music) Maybe I'll just stick to the Call Filter app. So how can we tell if a call is actually spam? The thing is, is it's not always the stereotypical IRS or the car warranty scammers. They are getting really smart now. They're actually tricking us into thinking that it's the doctor's or a health care provider, which is really uncool. Here are my top seven things to look out for. Number one, if they're calling from some generic-sounding organization, like Health Central 2020, the government, or not even bothering to identify their organization, then guess what? Scam. Number two, if there's pressure to act now. Like, this is an immediate thing. We have to do it now. Give me all of your money. Yeah, it's probably safe to say, it's a scam. Number three, those recorded generic calls from marketing agencies or random unknown numbers, yeah, you guessed it. Number four, if the caller claims to know you, but doesn't actually know your name, oh, hey, wonder what that could be? Scam! Number five, if the caller claims to have some sort of preexisting relationship with you, yet they can't even cite an account number, or they can't even prove who they say they are. Scam! Number six, this is really important, because remember, a legit business callin you should already know everything that they need to know about you. You should not provide any information to the caller at all. Scam! Number seven, if the caller wants money, cash cards, social security numbers, credit card, bank account numbers, your freakin' shoe size, your mother's maiden name, I could go on. Yeah, you better believe, it's a scam. I would love to hear from you guys, though. Are there any of these calls that have actually almost tricked you into thinking that they're real. Leave those in the comments below. I would love to hear them. So now let's check out the Call Filter app. This is the free version, and it has all kinds of features, like spam detection, spam filter, blocked call log, and one of my favorite features is the neighborhood filter. So this is fairly new, and it's super easy to use, and this scam gets me all the time, because I always like to answer phone calls when it's from my area code. And I only answer it, because I think that it might be a friend, or a family member, or there might be an emergency from my hometown. And guess what? No! They're just wondering if I want to extend my car warranty. And do you know what I don't want to do? Well, actually, I might, in some scenarios, actually want to extend my car warranty, so that's not really entirely valid. I will go to the dealership, and I will say, let me speak to a representative who can actually extend my car warranty. You can upgrade to the Filter Plus for 2.99 a month that has more features like Caller Name ID, Spam Lookup, Personal Block List, and Spam Risk Meter. But the free version still has so many great features that it will definitely make a difference in helping you stop these calls. This is really awesome, because Verizon is actually working with other wireless network providers to exchange authenticated calls using STIR/SHAKEN, which is an industry-wide technology that helps verify that the calls are coming from the number on the caller ID and not being spoofed. You're even able to report calls that have not been marked as spam easily through the Call Filter app or by going to voicespamfeedback.com. Since I found out about this, I feel like I'm on some personal mission to report all of these calls when they don't get flagged. They're also working to identify legal robocall campaigns and work with other carriers to trace them back to the source and notify law enforcement. Using this handy auto-block feature, this will save you guys so much time, and hopefully, it'll keep you from ever even bothering to answer these calls in the first place. So the real question is, what can you do to protect yourself? So I'd say the first thing is if you're a Verizon customer, definitely download their Call Filter app. And once you have it, you can report a number as spam, which helps them improve the overall spam detection service. Also, please do not share your personal information, including personal identification numbers, account numbers, any financial info, absolutely nothing. Do not share! Scam! Be aware of spoofed phone numbers that try and make you think that it's legit or someone that you might know. Again, did I mention don't click on any links? I mean, just do not click on any links, even if it says, hey, you have a package waiting for you. Don't click on it. If it says that you're getting money through a text, you gotta click it, don't! And last but not least, you can register your phone number at donotcall.gov. Okay, so I know that was a lot, but I was really excited to see all of the things that Verizon is doing to help battle these robocalls for their customers, that I honestly couldn't wait to make this video. And I know this is a problem that so many of us hare having, and it's so obnoxious and so annoying that I'm so excited that I feel like I'm a small part of that, reporting spam calls as they come in. Like, Verizon, you might wanna, like, think about maybe, like, starting, like, some sort of super hero squad, and if you are, can I please volunteer as tribute? I'm here! Again, if you think this video might help someone who has potentially fallen victim to scammers who have called or texted, please send them this video, and hopefully, together, we can stop this once and for all. I will put a link in the description where you guys can learn more about the Call Filter app and how you could download it. Check it out in the description. And I will see you guys in my next video. In the meantime, I need to work on some saber skills. I think I need more room. Definitely need, (light saber thuds) definitely need more room and more practice. Okay, bye. (mellow jazz music)",
    "transcript_keywords": [
        "Call Filter app",
        "Call Filter",
        "calls",
        "call",
        "Spam",
        "Filter",
        "Filter app",
        "Spam calls",
        "Number",
        "Verizon",
        "spam call",
        "video",
        "Scam",
        "Justine",
        "answer",
        "numbers",
        "caller",
        "free",
        "app",
        "guys"
    ],
    "transcript_entity_values": [
        "second",
        "Number seven",
        "Justine",
        "three",
        "the Filter Plus",
        "Health Central 2020",
        "the past couple of years",
        "Number five",
        "Call Filter",
        "Insurance Rock",
        "Verizon",
        "the Call Filter",
        "Sam",
        "six",
        "today",
        "Verizon",
        "two",
        "seven",
        "Number four",
        "24 hours",
        "2.99 a month",
        "first",
        "IRS"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.045891277492046356,
        -0.05349883809685707,
        -0.004550527315586805,
        -0.09520300477743149,
        -0.00904348585754633,
        -0.010829797945916653,
        0.1070689707994461,
        -0.042164601385593414,
        0.03381732478737831,
        9.509734809398651e-05,
        0.011930497363209724,
        -0.012178384698927402,
        -0.019755396991968155,
        -0.0244453065097332,
        -0.010687494650483131,
        0.05668674409389496,
        -0.01241198182106018,
        -0.02959963120520115,
        -0.004957196768373251,
        0.010521521791815758,
        -0.012254842557013035,
        0.028788603842258453,
        0.0037549829576164484,
        0.0344507060945034,
        -0.031004754826426506,
        0.002900265157222748,
        -0.03963236138224602,
        0.035618141293525696,
        -0.05284655839204788,
        -0.062487270683050156,
        0.03923696652054787,
        0.01203917060047388,
        0.06379614770412445,
        0.021979551762342453,
        0.013968135230243206,
        -0.03776675835251808,
        -0.04025721922516823,
        0.058358825743198395,
        -0.018699822947382927,
        0.0007591680041514337,
        0.0323660634458065,
        -0.05004417151212692,
        -0.05581056326627731,
        -0.02544482797384262,
        -0.010445867665112019,
        -0.05096249282360077,
        -0.0033303832169622183,
        -0.03306955471634865,
        0.08984405547380447,
        0.05713772401213646,
        -0.048050012439489365,
        0.033567409962415695,
        0.01397738792002201,
        0.018779246136546135,
        -0.05485115200281143,
        -0.04297799617052078,
        -0.007049716543406248,
        0.08836637437343597,
        0.039974916726350784,
        -0.03797222673892975,
        -0.01588672585785389,
        -0.03805575892329216,
        -0.023733897134661674,
        0.018286431208252907,
        -0.11692330986261368,
        0.04812818393111229,
        -0.0003616393369156867,
        0.06603267043828964,
        0.0010596656939014792,
        0.08466075360774994,
        -0.038839537650346756,
        0.0613672211766243,
        -0.033902958035469055,
        0.05140334740281105,
        0.009538773447275162,
        0.10791274905204773,
        -0.04714599996805191,
        -0.10232139378786087,
        -0.0029761362820863724,
        0.040345821529626846,
        0.08670653402805328,
        -0.061726704239845276,
        -0.026783062145113945,
        -0.03945404663681984,
        0.03643132001161575,
        0.05360625684261322,
        0.06285379827022552,
        -0.04710002988576889,
        0.035321395844221115,
        -0.06384238600730896,
        -0.10559298098087311,
        0.02836185321211815,
        -0.004470088519155979,
        0.03598140552639961,
        -0.06364908814430237,
        -0.04587657377123833,
        -0.04538958892226219,
        -0.08383173495531082,
        -0.018798865377902985,
        0.06381049007177353,
        0.033925611525774,
        -0.086615651845932,
        -0.03102543205022812,
        -0.009793118573725224,
        -0.011813833378255367,
        -0.13388243317604065,
        -0.03689999878406525,
        0.048753686249256134,
        0.021866649389266968,
        0.047632861882448196,
        -0.051972512155771255,
        0.056423477828502655,
        -0.05780840665102005,
        -0.07637989521026611,
        -0.024164855480194092,
        0.10789651423692703,
        0.0880681648850441,
        0.07393329590559006,
        0.02766132541000843,
        -0.017258673906326294,
        0.02567882463335991,
        -0.03337181359529495,
        -0.01480082981288433,
        -0.009853938594460487,
        0.03488100692629814,
        0.030590001493692398,
        0.006730366963893175,
        1.2923749296188984e-32,
        -0.0046010687947273254,
        0.04766450822353363,
        -0.02484358660876751,
        0.01701492816209793,
        -0.02891252189874649,
        -0.01649048738181591,
        0.022851889953017235,
        0.16979312896728516,
        0.001955414656549692,
        -0.002141396515071392,
        -0.01787165179848671,
        -0.00489977328106761,
        0.06298305839300156,
        -0.0020408343989402056,
        0.032978784292936325,
        -0.04898114129900932,
        0.0597357340157032,
        -0.05488995462656021,
        -0.04715173691511154,
        -0.05965296924114227,
        0.026896502822637558,
        -0.05068527162075043,
        0.031640682369470596,
        0.08923693001270294,
        0.1271647959947586,
        0.02530786767601967,
        0.03494439274072647,
        -0.03846555948257446,
        0.08224219083786011,
        0.008146291598677635,
        -0.036333732306957245,
        -0.04356598109006882,
        -0.007725495845079422,
        0.01600482314825058,
        0.05582975596189499,
        0.009116103872656822,
        -0.07347794622182846,
        0.027106087654829025,
        -0.00700403330847621,
        -0.07826684415340424,
        -0.02480417862534523,
        -0.007499723229557276,
        -0.12963560223579407,
        -0.022699227556586266,
        0.04631507396697998,
        0.011664027348160744,
        -0.009279867634177208,
        -0.02958907000720501,
        -0.052105050534009933,
        0.016550499945878983,
        0.0024427357129752636,
        0.021866831928491592,
        -0.020088916644454002,
        0.11903349310159683,
        -0.04812440276145935,
        -0.07507853209972382,
        -0.014629228040575981,
        -0.015256484970450401,
        0.00019388725922908634,
        -0.019001653417944908,
        0.04087609797716141,
        -0.024672741070389748,
        -0.0021734486799687147,
        -0.02749350294470787,
        -0.024257568642497063,
        0.022563520818948746,
        0.045978620648384094,
        -0.0008165084291249514,
        -0.023628411814570427,
        -0.0028289612382650375,
        0.02145516313612461,
        -0.022958476096391678,
        0.030358094722032547,
        0.07239848375320435,
        -0.08134199678897858,
        0.0032478636130690575,
        -0.08530109375715256,
        -0.0018588707316666842,
        0.017286857590079308,
        -0.022394422441720963,
        0.015484797768294811,
        -0.009006212465465069,
        -0.013434755615890026,
        0.007227701600641012,
        -0.01164625957608223,
        -0.05130007863044739,
        0.03779027611017227,
        -0.018193112686276436,
        -0.017258621752262115,
        0.07838992774486542,
        -0.03835718706250191,
        0.1369130164384842,
        -0.1237487643957138,
        0.013360880315303802,
        -0.07389724999666214,
        -1.272944007999806e-32,
        -0.06840246915817261,
        0.01941976323723793,
        -0.023226063698530197,
        -0.001953159226104617,
        -0.01770870015025139,
        -0.039188940078020096,
        0.02616829052567482,
        0.10034378618001938,
        0.06079457327723503,
        -0.060856375843286514,
        0.028965188190340996,
        -0.07582907378673553,
        -0.029832899570465088,
        -0.011720304377377033,
        -0.0580674484372139,
        -0.055088479071855545,
        -0.03828122466802597,
        -0.007015025243163109,
        -0.02236984483897686,
        0.041469037532806396,
        -0.0054245321080088615,
        0.09057357162237167,
        0.06052035093307495,
        0.017032943665981293,
        -0.03223356232047081,
        -0.0017178228590637445,
        -0.01851612702012062,
        0.07027118653059006,
        0.11064646393060684,
        0.0019812756218016148,
        -0.006778891198337078,
        0.04084829241037369,
        -0.005462275817990303,
        -0.038633283227682114,
        0.04601775482296944,
        0.014461737126111984,
        0.011122326366603374,
        0.14403513073921204,
        0.042884521186351776,
        -0.05374067276716232,
        0.0916639119386673,
        0.01909732073545456,
        -0.014544281177222729,
        0.0070858788676559925,
        0.03601595014333725,
        -0.16364729404449463,
        -0.08153751492500305,
        -0.02818950079381466,
        -0.07760173827409744,
        -0.006961633451282978,
        -0.057753629982471466,
        -0.08209627866744995,
        0.059605568647384644,
        0.03290622681379318,
        -0.0692586824297905,
        -0.02690386213362217,
        -0.011240101419389248,
        -0.06763023883104324,
        0.07402390241622925,
        0.007637027185410261,
        0.06907488405704498,
        -0.05514644458889961,
        -0.06694667786359787,
        -0.08825436234474182,
        0.0630086213350296,
        -0.034792687743902206,
        0.11788628995418549,
        0.014336186461150646,
        0.059393055737018585,
        -0.024517999961972237,
        -0.007513562683016062,
        0.043596554547548294,
        -0.01581806130707264,
        0.005266901105642319,
        0.006767123471945524,
        -0.048429761081933975,
        -0.11872480809688568,
        -0.03393417224287987,
        -0.007588554639369249,
        -0.02826470136642456,
        0.05384436249732971,
        0.014350754208862782,
        0.027277158573269844,
        0.09670544415712357,
        -0.0009298503864556551,
        0.10455082356929779,
        0.07199695706367493,
        -0.02096077986061573,
        -0.04707973450422287,
        0.012814375571906567,
        0.04774688184261322,
        0.009512605145573616,
        0.05680977925658226,
        0.09631796926259995,
        -0.10395701229572296,
        -6.680191688701598e-08,
        0.06277084350585938,
        -0.03688088431954384,
        0.023161321878433228,
        0.028940372169017792,
        0.03946349769830704,
        -0.023258106783032417,
        -0.028195034712553024,
        0.06354669481515884,
        0.03154158964753151,
        -0.08056872338056564,
        0.07645508646965027,
        0.02050183340907097,
        -0.018393469974398613,
        0.08796246349811554,
        0.038590118288993835,
        0.007948237471282482,
        -0.03416195511817932,
        0.03400488197803497,
        -0.03844166919589043,
        -0.022613367065787315,
        -0.05168246105313301,
        0.02685135416686535,
        -0.007618018891662359,
        -0.02285761572420597,
        0.03483157232403755,
        -0.025129355490207672,
        0.06694062799215317,
        -0.009925740770995617,
        -0.007332629058510065,
        -0.02369627356529236,
        -0.09366340935230255,
        -0.03229890391230583,
        -0.007694445550441742,
        -0.024474602192640305,
        -0.11201707273721695,
        0.06355497241020203,
        -0.0748608261346817,
        -0.09651950746774673,
        -0.005292715970426798,
        -0.005949284415692091,
        0.007559226360172033,
        -0.10333498567342758,
        -0.027613701298832893,
        0.008192229084670544,
        0.008292380720376968,
        -0.01773327961564064,
        0.007648659870028496,
        -0.1005307137966156,
        0.061086803674697876,
        -0.013197226449847221,
        0.006796047557145357,
        0.021151600405573845,
        0.0721035823225975,
        0.015172130428254604,
        -0.01608402281999588,
        -0.04629367217421532,
        0.036442991346120834,
        -0.004328316077589989,
        0.02325797826051712,
        0.008474765345454216,
        0.022671574726700783,
        -0.021921992301940918,
        -0.06956897675991058,
        0.06392741203308105
    ]
}