{
    "id": "iGXB5NanUK4",
    "title": "Python WiFi DoS  (Denial of Service) attack",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-03-25T17:05:28Z",
    "video_url": "https://www.youtube.com/watch?v=iGXB5NanUK4",
    "category": "Science & Technology",
    "tags": [
        "wifi dos",
        "wifi doser",
        "wifi",
        "python",
        "scanner",
        "wifi scanner",
        "python scan",
        "hacking",
        "hackers",
        "ethical hacker",
        "ethical hacking",
        "hacker",
        "hacking course",
        "hacking tutorial",
        "black hat hacking",
        "learn hacking",
        "ethical hacking tutorial",
        "ceh",
        "kali linux",
        "oscp certification",
        "elearnsecurity",
        "ine",
        "ctf",
        "how to hack",
        "learn ethical hacking",
        "cyber security course",
        "windows 10 python",
        "python wifi",
        "wifi password",
        "wifi tips",
        "python tutorial",
        "python 3",
        "learn python",
        "denial of service",
        "ddos attack",
        "dos"
    ],
    "views": 446724,
    "likes": 19011,
    "comments_count": 887,
    "description": "Python WiFi DoS (Denial of Service) attack script. It's very easy to destroy a wifi network using this simple Python script. Learn Python today. It will change your life. This script uses Wi-Fi deauthentication messages to stop all users from accessing a wifi network. In the background, we are using airmon-ng and airodump-ng to launch our attack.  Script1:  Direct GitHub link:   Script2:  Direct GitHub link:   Menu: Python WiFi DOS Attack: 0:00 Network Adapter: 1:05 Script demonstration: 1:56 Connect WiFi adapter: 2:35 Create python script: 3:23 Run Python script: 4:25 Select WiFi Network: 5:35 Kill WiFi network (deauth Wifi): 6:10 Break script: 7:09 Run script again to deauth Wifi: 7:36 Recommendations and coolness: 7:56 Requirements: 8:44 Two versions of the script: 9:37 Python script explanation: 10:21 Second Python script: 15:44  ================ Network Adapters: ================ Alfa AWUS036NHA:  Alfa AWUSO36NH:   ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    ================ Support me: ================ DavidBombal.com: CCNA ($10):   Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   wifi wifi dos wifi doser wifi hacking python hacking python python wifi python network scan python scanner python scan oscp  ddos elearnsecurity  oscp certification ethical hacking ceh oscp ine try hack me hack the box hacking ethical hacker ctf for beginners  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #wifi #python #hacking",
    "description_links": [
        "https://bit.ly/3vYsbng",
        "https://github.com/davidbombal/red-python-scripts/blob/main/wifi_dos_type1.py",
        "https://bit.ly/3clToZ4",
        "https://github.com/davidbombal/red-python-scripts/blob/main/wifi_dos_type2.py",
        "https://amzn.to/3qbQGKN",
        "https://amzn.to/3moeQiI",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10"
    ],
    "transcript": "- In this video, I'm going to show you a simple Python script that runs a denial service attack or DoS attack against a WiFi network. So once you run this Python script that I've written and linked below, which you can find on my GitHub page it will basically destroy a WiFi network. Now, before we get started, only use the script on networks that you personally own, or have permission to attack. Please don't use this Python script that I'm gonna demonstrate in this video in a coffee shop, please don't use it on your parents or on a network that you don't have authorization to run the Python script against. So again, don't use this on your neighbor if they playing loud music, as an example, such as other people have done on YouTube. In this example, I'm attacking this a WiFi router. So the network that I'm gonna attack is this little TP Link WiFi router. In this example, I've got a Windows computer that's gonna be the client that we're gonna knock off the network. And then I'm running Kali or Kali Linux if you prefer within a virtual machine on my Mac. Now for this attack to work, you need a WiFi adapter such as this. This is an Alfa network adapter. It supports both monitor and injection mode. So you don't have to use an external WiFi adapter like this but you need one that supports injection and monitor mode if you really wanna attack a WiFi networks, this Alpha network adapter works really well. The disadvantage of this one is it only supports 2.4 gigahertz WiFi not five gigahertz. So you could buy a more expensive adapter that supports both 2.4 and five but this is a great WiFi adapted to start with because Kali Linux automatically picks it up. (upbeat music) Okay, so let me demonstrate the script and then I'll go through the script in more detail so that you can see how the script works. It's really well worth your time learning Python because it gives you a lot of options, fantastic programming language. So on my Windows computer, I'll open up a Command Prompt, and what I'll do here is ping Google with -T so that the pink doesn't time out. So you can see the ping is continuing to run. And what I can do as an example is go to a website such as Facebook so I'm able to connect to the internet. Okay, so my ping is continuing but what I'll do on Kali is open up a terminal. I'll make this slightly bigger. Okay, so iwconfig shows me that I have a WiFi network connected. I'll disconnect this WiFi adapter from my Mac and then I'll plug it back in again. I'm asked, do I wanna connect this to my Mac or to Linux? I'm going to connect it to Linux. And once again you can see that my WiFi adapter is connected, it's currently in managed mode. Now, if you're not sure how to do that, have a look at this video where I'll show you how to install Kali on a Windows computer as an example. I also showed you in this video, how to manually do what I'm demonstrating here but just to make it more interesting, I've created a Python script that speeds things up and makes it a lot simpler. So on Kali, I'm gonna create a file called wifidos.py. Nano is a basic text editor, you could use Vi if you prefer. But I'm basically creating a file called wifidos.py. This is my Python script which is pre-written. So I've created this Python script, and I've also put a lot of comments in the Python script so that you can see exactly what's happening. So unlike some other examples that are found online which are really complicated and don't have a lot of comments, I've put a lot of comments in this code. I'm really hoping that it makes it easier for you to learn Python and explains what this code is doing. So what I'll do at this point is simply copy that code, and I'll paste it into nano on Kali. Press Control X to exit press Y to save, script is saved. So LS shows me that I've got my wifidos.py script. So if I run Python, and in this case I'll run Python3 and run that script. Now, in this example, Kali is remembering previous commands that I've typed. So I've simply use the right arrow key to complete the command. You'll probably have to manually type the command out. But Python3, wifidosdot.py, you can see here that an error display is telling me that I need to run this as pseudo. So pseudo basically allows me to run the script with root privileges. So pseudo Python3 wifidos.py, have to put my password in, so I'll put in my password of Kali, and it's now picked up the WiFi adaptor to use. Now, if I didn't have that WiFi adapter connected, the script would tell me that I need to connect it. So in the script, I've added options such as if you're not running the script as pseudo, the script will break. If no wifi, adapters connected, we're told to connect to the WiFi adapter. So I've tried to add various problems that you may encounter to the script to make sure that it runs successfully. In this example, I've only got one WiFi adapter. So I'm gonna use zero to select that WiFi adapter. The script destroys any processes that could conflict with putting this adapter into monitor mode. You need an adapter once again, that supports monitor mode like this Alpha adapter. So it kills any conflicting processes and then it puts the adapter into monitor mode and then it discovers the WiFi networks around. This is the WiFi network that I want to attack. On my Windows computer, you can see that that's the network that the Windows computer is connected to. So I wanna attack that WiFi network, so I'm gonna press Control C and then use zero to select this WiFi network and press Enter. What's happening now is deauthentication messages are being sent to the WiFi adapter which will stop this device from connecting to the internet. So you can see that pings are starting to time out. And if I open up another tab on my web browser and try and go to facebook.com, you'll notice that there's a problem with a network. If I go to another website, let's say google.com, the device is not able to connect to the internet because I'm basically deauthenticating all clients on this network. So, as an example, if I try and play some music here from a website, nothing happens. The music can't play because I'm breaking this network. If I press Control C on my script to stop a deauthentications, ping start working, and back on my PC, I should hopefully be able to connect to various websites, so I can connect to Facebook, I can connect to Google, I can connect to LinkedIn. And let's try different music file, the music starts playing. So if I run that script again, select my WiFi adapter, select my WiFi network that I wanna attack, start attacking the network. What you'll notice here on the pings is that they'll start to time out. So the pings timeout while de-authentication messages are being sent to the WiFi network. Now it is recommended that you attack a single client rather than just sending Dos messages to everyone on the WiFi network. And I'll cover that in a separate video. So I'll show you how to adapt the script so that you can select an individual client and just attack that. So, as an example, well you may just wanna attack an iPhone or you may wanna just attack a music system, so you can attack a specific device on a WiFi network. Now what's amazing about this is you don't have to know the password of the WiFi network that you're attacking, you can attack any WiFi network as long as you're within the vicinity, in other words, you are seeing the WiFi network, you can attack it. Now again, you don't have to be connected to the WiFi network to run the denial of service attack against that WiFi network, you simply have to be in the vicinity. You have to basically be able to see the WiFi network in the air. So your WiFi adapter has to be able to pick up that that WiFi network is there. So again, if I run that script, these are the WiFi networks that I'm currently seeing around me. So my WiFi adapter can pick up these WiFi networks. So if you're too far away from the WiFi network, you wouldn't be able to run the attack, but as long as you're within the vicinity and can see it in the air, then you'll be able to attack it, you don't need to know the password of the WiFi network. Now I'm hoping you enjoying these types of videos. I'm hoping you enjoying these kinds of scripts. Python is a really powerful language. If you learn Python, you can do a lot of things, including stuff like this. Now, with that being said if you enjoyed this video, please like it, please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I'm hoping to reach a million subs in this year, so please help me do that. Now, please note, when I break the script by using control C as an example, we get trace back messages. I've created two versions of the script. In the script, you can actually see the output of the commands that you're running. So we can see the DoS messages going to the access point. In a separate script, I'm using a sub-process. So I'm pushing that to a sub-process so you don't see that output, but what it does allow me to do is to use a Control break or control C on the Python script and do some clear up after the script is run. This first script doesn't do that, but I've put both scripts below this video, so you have two different versions of the Python script. The first script I think is the simplest to use, but if you wanna take it a little bit further, you can have a look at the second script as well. I'm gonna show you what the Python script does, but again, I've put a lot of comments in the Python script so that I don't have to make this video extremely long to explain every single line of code. Have a look at the Python script, which you can once again download using my GitHub link below. But as always, only use this kind of code for ethical hacking purposes, only attack a network that you own or have permission to attack. We're importing a whole bunch of modules here including sub-process or regular expressions, CSV, and others, what are we gonna do is create an empty list of WiFi networks, and then we going to do a test to see if a SSID is already in the list. So we are checking if an SSID already exists. If it doesn't exist in our list, we're going to add it. I've got a basic user interface, you could delete all of this if you don't want it. We are checking to see that the user's using pseudo privileges, if not, we tell the user to run the program with pseudo. We remove any CSV files before we run our script. We are breaking the script at the end so we can clear up the CSV files. You could do that using the second script that I've created and put below. But in this first script, it's kind of like a heartbreak of the script, so the CSV file remains there. So before we run the script, again, we do a clear up of any CSV files. So we basically make a backup directory. If it already exists, we simply move the files to that directory, but if it doesn't exist, we create it and then move the files to that subdirectory. Then we check for the WiFi interfaces. In our example, we assuming that the WiFi interfaces will be wlan zero or wlan one or wlan two, et cetera. And then we're going to use a sub-process. So we running an additional process to check the WiFi interfaces using iwiconfig. If a network adapter is not fond we tell the user to plug a network adapter in, but if it is found, then we ask them to select the relevant WiFi network interface. You could have multiple WiFi interfaces connected to Kali, so we ask the user to select one. We making sure that they select one that actually exists, then we store that in a variable for easy reference. We tell the user that we're gonna kill any conflicting processes. You need to do this when running the commands. In this video I showed you how to manually run all these commands. So if you wanna see it step by step, then have a look at this video. But here we basically taking that knowledge and putting it into a script which makes it much easier rather than manually doing things over and over again. It's much better just to automate it to using a script like this. So we kill the processes, we put the WiFi network adept into monitor mode, we use popen to check for WiFi networks. So we basically using airodump-ng, and we're gonna check the WiFi networks running around us, that basically gives us this output here so we can see the various WiFi networks. So this is actually showing us the output. We clear the screen before printing the interfaces and then we display all that information. So we can see our SSID information. We create a nice, pretty menu showing all that information. So basically with airodump-ng, it puts the output to a CSV file, and then reading that CSV file, and then displaying it to the user. So this information is actually being displayed from a CSV file. Airmon-ng writes the information to CSV file and then we display it here. So every second that's updated, when the user presses Control C, we tell them to make a choice. So if I press Control C here, I need to make a choice, and the network that I wanna attack is this one. So I'm going to select 14. If I did select some random number like 45, we would be told to do that again. So I select 14, and now the deauths are sent to the WiFi network. So we ensure that it's a valid choice, if it's not, we ask them to try again. We make it easier to read the code by specifying the hack B SSID and the hack channel. We run this command to specify the channel that we're gonna hack on. So that was picked up previously when we saw the output of the WiFi networks, we could determine the WiFi channel. So we run airmon-ng to specify the channel, and then we run aireplay-ng with the deauth command. And this is unlimited deauth to just de-authenticte any clients on the network, and that's what you can see here on the Windows computer, it's being deified indicated from the WiFi network. And then the user needs to press Control C to break the script. So once again, if I press Control C there, keyboard interrupt, script ends. Now, LS shows us that we've got the CSV file. So when we run the script again, that's gonna be moved to the backup directory so that the script can run without additional CSV files interfering with what we're trying to read. Okay so that's the one script, the other script is very, very similar. The differences at the end. At the end of the script, we're gonna use popen to a D authentic Kate clients. And now, because we doing that, we can still control the script. So we can print out that clients have being deauthenticated. Press Control C to stop. And then when you press Control C, we tell the user that we stopping monitoring mode. So we stop monitoring mode on the WiFi adapter, and we exit the script. Now you should actually which I'll add here is start the network services again. But the script allows you to do a proper cleanup, you could if you like reboot your virtual machine or your Kali Linux installation. if you don't wanna do that, we'll just type the commands manually to start these services. So, as an example, using the first script, the one that I've demonstrated, iwiconfig shows me that the adapter is in monitor mode, so I wanna use this command airmon-ng stop wlan zero mon, and I need to do that as route to now put the WiFi adapter into managed mode. I couldn't do that with the first script once again because I press control C to break it and then the script ended. But in the second script, I did that. And what you can do as well is start network manager. Okay, so there you go. Hopefully you've enjoyed this video. If you did, please consider subscribing to my YouTube channel, please like this video and click on the bell to get notifications. I'm hoping to reach a million subs this year, so please help me do that. I'm David Bombal, wanna wish you all the very best. (upbeat music)",
    "transcript_keywords": [
        "WiFi network",
        "Python script",
        "WiFi",
        "script",
        "network",
        "WiFi adapter",
        "Python",
        "adapter",
        "run",
        "attack",
        "Control",
        "Kali",
        "Press Control",
        "CSV",
        "CSV file",
        "networks",
        "Kali Linux",
        "simple Python script",
        "network adapter",
        "CSV files"
    ],
    "transcript_entity_values": [
        "first",
        "airmon-ng",
        "five gigahertz",
        "Facebook",
        "Control C",
        "Kate",
        "Press Control C",
        "CSV",
        "Alpha",
        "five",
        "Control",
        "2.4 gigahertz",
        "two",
        "14",
        "airodump-ng",
        "Y",
        "wlan one",
        "zero",
        "Alfa",
        "second",
        "Airmon-ng",
        "YouTube",
        "this year",
        "iPhone",
        "Google",
        "Nano",
        "google.com",
        "Python",
        "Kali",
        "Mac",
        "SSID",
        "one",
        "Linux",
        "DoS",
        "Google",
        "CSV",
        "GitHub",
        "LinkedIn",
        "Python",
        "45",
        "Kali Linux",
        "million",
        "LS",
        "Windows",
        "2.4",
        "David Bombal",
        "Vi"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.10415451973676682,
        0.0458502434194088,
        -0.003788383910432458,
        0.036017369478940964,
        0.02248309552669525,
        -0.08340342342853546,
        0.07871218025684357,
        -0.04655076935887337,
        0.020590221509337425,
        0.04552937299013138,
        0.05096106603741646,
        0.08121581375598907,
        0.06971141695976257,
        -0.0116177499294281,
        0.019636038690805435,
        0.06240605562925339,
        0.007045157719403505,
        -0.0965261161327362,
        0.000977955525740981,
        -0.10913193970918655,
        0.00480709969997406,
        0.11784607917070389,
        0.03208108991384506,
        -0.02767503634095192,
        0.06547456979751587,
        -0.02004183456301689,
        0.01609266921877861,
        0.009172060526907444,
        -0.060494810342788696,
        -0.00955480057746172,
        0.06713400036096573,
        0.02632037363946438,
        -0.006063078064471483,
        -0.05819917097687721,
        0.031002279371023178,
        -0.04897480830550194,
        0.009535104967653751,
        0.10073777288198471,
        0.008932295255362988,
        -0.002090234775096178,
        0.02402116358280182,
        -0.022326521575450897,
        -0.004922835621982813,
        0.02954757772386074,
        -0.09165535122156143,
        -0.020083066076040268,
        -0.1711392104625702,
        0.048191461712121964,
        0.03655867651104927,
        -0.013456752523779869,
        0.001975058577954769,
        0.047507479786872864,
        0.012444204650819302,
        0.015184737741947174,
        0.050635356456041336,
        -0.08990824222564697,
        -0.025141553953289986,
        0.04222423583269119,
        0.02948698401451111,
        -0.05921632796525955,
        -0.09134984016418457,
        0.05003959685564041,
        -0.02473420463502407,
        -0.016438286751508713,
        0.04658433422446251,
        0.019959960132837296,
        -0.004796591587364674,
        0.04251896217465401,
        0.03660060092806816,
        0.13016463816165924,
        -0.04318713769316673,
        0.021732434630393982,
        -0.02221119962632656,
        0.022643186151981354,
        0.05994822829961777,
        -0.0038588447496294975,
        0.004618114326149225,
        -0.07532895356416702,
        -0.037076860666275024,
        -0.02169388346374035,
        0.004432576708495617,
        -0.04083225503563881,
        0.04075367748737335,
        0.0018348045414313674,
        -0.016434701159596443,
        -0.010936588048934937,
        -0.05606262385845184,
        0.005489114671945572,
        0.10056917369365692,
        -0.01467594038695097,
        -0.0776800662279129,
        0.07444215565919876,
        0.053634095937013626,
        0.022953081876039505,
        0.04208061099052429,
        0.07537700980901718,
        -0.053264327347278595,
        -0.02706727758049965,
        -0.09284894913434982,
        0.06049099192023277,
        0.003453299170359969,
        -0.057870350778102875,
        -0.05982133746147156,
        -0.0214777123183012,
        0.03101152367889881,
        -0.04259564355015755,
        0.015871070325374603,
        -0.052045512944459915,
        0.058854226022958755,
        0.010392344556748867,
        -0.03718777000904083,
        -0.04590083286166191,
        0.0028600995428860188,
        -0.04632095247507095,
        0.027127090841531754,
        0.08217612653970718,
        0.07602430880069733,
        0.10795758664608002,
        -0.02303377166390419,
        -0.002611099509522319,
        0.016681620851159096,
        -0.004893233068287373,
        -0.014001992531120777,
        -0.02475465089082718,
        0.014505939558148384,
        0.01159563846886158,
        0.0381290540099144,
        6.749305057389619e-33,
        0.006264164112508297,
        0.005453817080706358,
        -0.05656426399946213,
        -0.019061308354139328,
        0.0766192078590393,
        -0.09442459046840668,
        0.03541221097111702,
        0.0045674750581383705,
        -0.033191099762916565,
        0.02960081212222576,
        -0.12794217467308044,
        -0.06647391617298126,
        0.006307706236839294,
        0.02095191553235054,
        0.058994993567466736,
        -0.06381984055042267,
        0.08525300770998001,
        0.04427115246653557,
        0.06214284524321556,
        0.061058808118104935,
        0.050065670162439346,
        -0.05430063605308533,
        -0.010406170971691608,
        -0.0038969109300523996,
        0.032472874969244,
        -0.015824299305677414,
        -0.08198006451129913,
        0.0726543441414833,
        0.040893394500017166,
        0.009063106030225754,
        -0.04119792580604553,
        0.02586175873875618,
        -0.07864744961261749,
        -0.04165486618876457,
        0.0018659208435565233,
        -0.11250708997249603,
        -0.11336985975503922,
        -0.03164491057395935,
        -0.0329684317111969,
        -0.06131821870803833,
        -0.06011125445365906,
        -0.0007837117300368845,
        -0.13604991137981415,
        0.042330361902713776,
        0.06492865085601807,
        -0.05836149677634239,
        -0.11127522587776184,
        -0.0015532693360000849,
        0.03121582604944706,
        0.09150118380784988,
        -0.01932671293616295,
        0.007172886747866869,
        0.06870982050895691,
        -0.049570366740226746,
        -0.010894659906625748,
        0.01576114259660244,
        5.666168362949975e-05,
        -0.002872044686228037,
        0.0825916975736618,
        0.0008206511265598238,
        0.050910741090774536,
        0.00421220762655139,
        0.003671052400022745,
        0.004468959756195545,
        0.013987822458148003,
        -0.04634839668869972,
        -0.004707254469394684,
        0.011979716829955578,
        -0.05127102509140968,
        0.08586244285106659,
        -0.04388565197587013,
        0.017436573281884193,
        -0.03711709380149841,
        -0.0010893283179029822,
        -0.02154313400387764,
        -0.06272774189710617,
        0.06289010494947433,
        0.030439527705311775,
        -0.019229596480727196,
        -0.0023408308625221252,
        0.10084887593984604,
        -0.04032937437295914,
        -0.03088580071926117,
        -0.07074377685785294,
        -0.04000956192612648,
        -0.04604492709040642,
        -0.01385457906872034,
        -0.07701041549444199,
        -0.056816067546606064,
        0.040882132947444916,
        -0.029190922155976295,
        0.015060393139719963,
        -0.010905124247074127,
        -0.0001794929412426427,
        0.012057600542902946,
        -8.117780315786402e-33,
        0.04111010208725929,
        0.05816349759697914,
        0.01789064146578312,
        -0.043405674397945404,
        -0.0846172571182251,
        -0.059446319937705994,
        0.004153184127062559,
        0.05339865759015083,
        0.010603866539895535,
        0.03232956305146217,
        0.05373755097389221,
        -0.017616795375943184,
        -0.00019008471281267703,
        0.010109883733093739,
        0.07148634642362595,
        -0.05519865080714226,
        0.009378057904541492,
        0.021283969283103943,
        -0.06291169673204422,
        0.05066584423184395,
        -0.04715462774038315,
        0.08606825768947601,
        -0.015690019354224205,
        -0.07095426321029663,
        -0.08797439932823181,
        -0.01758265681564808,
        -0.033906713128089905,
        0.0619894340634346,
        -0.011707727797329426,
        0.028907805681228638,
        -0.042150355875492096,
        0.03229862451553345,
        0.0012533069821074605,
        0.020282970741391182,
        0.03741609305143356,
        0.014938440173864365,
        0.05150699242949486,
        0.04853362217545509,
        -0.03311476111412048,
        -0.03145566210150719,
        0.07657856494188309,
        0.05239063873887062,
        -0.03916909918189049,
        0.016789991408586502,
        0.003861106699332595,
        -0.03988008573651314,
        0.07860024273395538,
        -0.033323027193546295,
        -0.09234435856342316,
        -0.11059557646512985,
        0.07342103868722916,
        0.01298105251044035,
        0.057387370616197586,
        0.051928967237472534,
        -0.026902059093117714,
        -0.011275898665189743,
        0.07795418798923492,
        -0.04978978633880615,
        0.01294137816876173,
        -0.030962377786636353,
        0.04391844943165779,
        -0.0947202518582344,
        -0.0009768359595909715,
        0.07378318160772324,
        0.030944347381591797,
        -0.02692394144833088,
        -0.08423805981874466,
        0.04785778746008873,
        -0.02149050496518612,
        -0.03732813522219658,
        -0.020464664325118065,
        -0.0610392689704895,
        0.006725990679115057,
        0.05565612390637398,
        -0.024820521473884583,
        -0.021305857226252556,
        0.023404836654663086,
        0.04868575185537338,
        -0.11390792578458786,
        0.08366979658603668,
        -0.0467994399368763,
        0.04282955080270767,
        -0.10677611082792282,
        -0.020626038312911987,
        -0.07545069605112076,
        -0.020176777616143227,
        -0.022467613220214844,
        -0.00978020578622818,
        0.04249768704175949,
        0.07612507790327072,
        -0.06062904745340347,
        -0.03574882820248604,
        0.05061967670917511,
        0.11078885942697525,
        -0.02101079560816288,
        -4.7346219389510225e-08,
        -0.03981725871562958,
        -0.0004948875866830349,
        0.03082229569554329,
        0.044395044445991516,
        -0.03301319107413292,
        0.054404355585575104,
        -0.033907175064086914,
        -0.10823362320661545,
        -0.023952215909957886,
        0.0016947928816080093,
        0.03633996471762657,
        0.08963392674922943,
        -0.026322104036808014,
        0.03466760367155075,
        0.01859337091445923,
        0.029867157340049744,
        -0.06210486963391304,
        -0.03729136660695076,
        0.03780285641551018,
        0.013016315177083015,
        0.021549785509705544,
        -0.046201642602682114,
        0.004628337454050779,
        0.04159075394272804,
        -0.010734458453953266,
        0.08713025599718094,
        0.044134560972452164,
        -0.015329073183238506,
        -0.050483547151088715,
        0.026851681992411613,
        -0.07038728147745132,
        -0.038259655237197876,
        -0.012160529382526875,
        0.011386374942958355,
        -0.06275074183940887,
        0.08601173013448715,
        -0.052553799003362656,
        -0.0684044361114502,
        -0.0341331772506237,
        0.04101329296827316,
        -0.12065436691045761,
        0.052336111664772034,
        -0.07024684548377991,
        0.015772255137562752,
        0.05870605260133743,
        0.024427928030490875,
        -0.026532290503382683,
        0.025783564895391464,
        -0.006165166851133108,
        -0.034426089376211166,
        -0.027388786897063255,
        -0.03353378549218178,
        -0.012164594605565071,
        -0.03898169845342636,
        0.017174776643514633,
        0.013273154385387897,
        0.003447371069341898,
        -0.11257670074701309,
        -0.05089821666479111,
        0.05719488114118576,
        0.05936366692185402,
        0.050997115671634674,
        0.015051936730742455,
        -0.04645732417702675
    ]
}