{
    "id": "iJesKFx42b8",
    "title": "Is an ALL AMD Gaming PC Worth It?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-07-27T15:05:42Z",
    "video_url": "https://www.youtube.com/watch?v=iJesKFx42b8",
    "category": "Science & Technology",
    "tags": [
        "amd",
        "radeon",
        "pc",
        "gaming pc",
        "fidelityfx",
        "fidelity fx",
        "radeon super resolution",
        "rsr",
        "fsr",
        "upscale",
        "graphics card",
        "cpu",
        "6950xt",
        "6750xt",
        "6650xt",
        "ryzen",
        "ryzen 7 5800x3d",
        "5800x3d",
        "5700x",
        "5600",
        "ryzen 7",
        "ryzen 5",
        "austin",
        "austin evans",
        "this is",
        "denki",
        "pc build"
    ],
    "views": 508953,
    "likes": 12057,
    "comments_count": 842,
    "description": "Check out AMD deals:  I bought the biggest SCAMS at GameStop:  The WEIRDEST products on GameStop:   Subscribe to Ken's channel @Denki!  More shenanigans on @thisis:   Subscribe for more!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://amd.ryukyu/3OclBBw",
        "https://youtu.be/64IMh2Tp3Oc",
        "https://youtu.be/m5CzFyt_fMA",
        "https://www.youtube.com/denkitime",
        "https://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- It's a brave new world when it comes to building gaming PCs. But is it time for you to go with an all AMD system? Well, AMD reached out and not only wanted to sponsor this video and give us some hardware, we actually have three different computers to take a look at today. First of all, we have this, which I'm almost done building, which is focused on 4K, but it's got the most high-end AMD stuff that I can get my hands on. A Radeon 6950 XT for the graphics card and the latest Ryzen 7 5800X3D, a gaming focused CPU that I'm very excited about. On top of that, we also have another build which is focused on 1440p and 1080p, but this is all to find out the simple question, is it better to build an all AMD gaming PC depending on your budget, or is it better to go with the... competition? So for the high-end 4K system, I've got basically all the fun toys. Now this is the first time I've built with this HYTE Y60 case, and it actually is really nice. So you can see, I've got like the panorama view with the glass all the way around. It's also got like all of your I/O on the bottom here, which is kind of interesting. We've also got a fairly subtle look. So we've got the Ryujin II 240 mil cooler from ASUS here. The ROG cooler does come with these industrial PPC fans from Noctua which I think is gonna look really rad. On top of that, it also has the vertical GPU mount built into the case, which means that we get to display our 6950 XT, pretty much filling up the entire case. That plus the screen and this Strix motherboard, which is ridiculously high-end. I feel this is gonna be a nice looking system, but the aesthetic isn't the most important part. There are a few AMD technologies, which theoretically will give you more performance, essentially for free, when you have both an AMD CPU and an AMD GPU. So to test, I have three computers. This one up here is the highest end. So the HYTE system, this is really designed for 4K. Now take a step over here, and what we've got is something that's a little bit more designed for 1080p. So inside this, we have a Ryzen 5 5600 as well as we've got a Radeon 6650 XT in this system. And then down here, once I actually make room on the table, we have our mid-range 1440p system. So this is rocking a Ryzen 7- - As you just crush things. - It's fine. A Ryzen 7 5700X and a 6750 XT. So with all three of our systems built, I have a couple of questions. Of course, the big one is really just, how much does the fully enhanced AMD CPU plus GPU experience give you? So for the best, perfect optimal results, I wanna do everything and the kitchen sink on versus everything off. There are obviously a number of different AMD technologies that you can play around with. Something like Smart Access Memory, which you enable via the BIOS, is something which should pretty much universally give you a little bit of extra gaming performance pretty much no matter what kind of game you're throwing at it. If it's remotely CPU bound, that will give you a little bit of that performance. But on top of that, there are also a bunch of graphics level things that could theoretically give you a lot of extra performance without hurting that image quality. So one of the games we're going to try is Assassin's Creed Valhalla, specifically here we're going to be using Radeon Super Resolution, which is not game dependent, but instead it is actually based in the driver settings. So this is something that you can turn on, again, should work with most games, and theoretically that will give us a boost in performance without a huge hit to image quality. We're also going to be testing with Horizon Zero Dawn, which does have that full FidelityFX built into the game, meaning that this is sort of that best case scenario for a game which has been deeply optimized to work, again, with both the AMD CPU and the AMD GPU. And because we have all three systems here, we're going to be testing at different resolutions. So this white system is running at 1080p. The '90s looking colorway system is running at 1440 and the black system is running at 4K, to give us a good idea of in the best case scenario what kind of performance you could get and is it really worth it to go with an all AMD setup or maybe not? So we are first up loaded into Assassin's Creed Valhalla. The first thing we're going to do is run both this as well as Horizon completely stock on all three systems. So you see we're running at 4K. Hop into the graphics and you will see that everything is set to default ultra high. No upsampling, no FSR, RSR, none of the extra goodies are on right now. And as you can see on our 4K system, Ryzen 7 5800X3D as well as the 6950 XT. So let's start by running the benchmark here and seeing what our base level performance is with none of the goodies turned on. You can see GPU is pretty much maxed out. Our baseline on Assassin's Creed is an average of 63 FPS. So that is the benchmark that we're going to go for. What we're gonna do is we're gonna restart the computer and gonna hop into the BIOS. Inside the BIOS, there is one thing we need to do and one thing only, we need to turn on the resize BAR feature. I literally click on and that's it. But essentially what this allows it to do is the CPU and the GPU can talk directly without having to do a bunch of extra loops back and forth. This is one of those things that's essentially free performance. Like, you just turn this on. On top of that, let's go and play with some of the settings in the actual drivers and in the games which should give us some additional performance without really impacting the image quality. But Smart Access Memory, resize BAR, turn that on. Now, let's see what kind of extra performance we have unlocked. So there are two different technologies that we're going to play around with. When it comes to Assassin's Creed Valhalla, we're gonna do Radeon Super Resolution. So before I do this next test, I'm going to hit Alt + R, which is gonna pull up my Radeon settings. What I care about is in the graphics side. All I care about right now though, is turning on this, Radeon Super Resolution. So essentially it will allow you to lower the resolution of the game and it will do the upscaling with the driver and the GPU and allow you to get extra performance while not making a huge difference to the actual image quality, but it's going to do that upscaling itself. With the Radeon Super Resolution turned on. We're gonna close this out. I'm gonna go into the options. By default, we need to set the resolution somewhere low. Essentially what you're doing is, normally if you lower the resolution of a game, obviously you're gonna soften your image quality, but you will get that extra performance. The higher resolution that you can give it to work with, it is always gonna give you better results, but I'm gonna start out with just 1800p and let's see what we can get here. This time we are up to 90 FPS in Valhalla. All we did was enable that AMD Smart Access Memory and turn on the Radeon Super Resolution which is upscaling from 1800p to the full 4K. Next up, we have Horizon Zero Dawn. We're going to run everything maxed out with the system. So 4K, but no upscaling or anything like that on and graphics running at ultimate. You kids are lucky these days. There's built-in benchmarks in a lot of games, you press one button you're done. I just have to line up like, kind of, okay, I need to walk, walk, walk, walk, walk, turn, stand, look at this thing. One, two, three, walk, walk, walk, go over here. I had to do my own benchmarks. I'm just saying, I used to walk back and forth to school uphill both ways. So for Horizon, we've got an average of 84 FPS on the 4K system. So now let's actually take a look to see what we need to do to get a little bit more of that secret sauce. So with Horizon and FidelityFX turned on, we've got ourselves 135 FPS. So on our 1440p system running an Assassin's Creed without any enhancements, our base result is 81 FPS. That is the number to beat. Turning on both Smart Access Memory, as well as Radeon Super Resolution does give us a pretty noticeable bump to performance on the 1440p system. So we went from about 80, 81 FPS in Valhalla up to 100. And I'll say, while there is a slight difference in quality since we are upscaling 1080p, honestly, it's not that big. And that is a very noticeable amount of performance difference. Hey, okay, so Horizon running on the 1440p system completely native, we've got 97 frames per second. Now it's time to turn everything on and see what the 1440p system can give us with that special sauce. The... - [Cameraman] Is that how you put sauce on? - Yeah, this is the fancy way. - [Jared] You like, cover your fingers in sauce and just let it drip. - Yeah, it's like the salt. So with Horizon Zero Dawn on the 1440p system, we're seeing some pretty solid performance improvements. We're all the way up to 122. That is a very playable frame rate. For our 1080p system, we've got Valhalla running at ultra high settings and the results are pretty solid. We've got 90 FPS without any enhancements whatsoever. So with that AMD Smart Access Memory as well as running Radeon Super Resolution, we're getting a big jump in performance. So this is running at 900p being upscaled to that 1080p inside the driver. And we went from 90 to 116 FPS. Hopping into Horizon Zero Dawn, again, running ultimate quality at 1080p, We're getting 101 FPS out of this system with zero extra work or modifications or anything. Ooh! - Oh wow. - 147 FPS, that is over a 40% gain in performance just by turning on the resizable BAR in the BIOS and by turning on the FidelityFX Super Resolution, that is incredibly impressive. So to be clear, AMD did sponsor this video. They did ask us to look at these specific configurations with these games, so of course you have to take everything with a little bit of a grain of salt. These are the best case scenarios. However, that being said, the results that we've seen and the logic behind it makes sense to me. If you are buying a AMD GPU, you should probably put it together with an AMD CPU. There are a lot of things that work together to give you better performance. I'm not gonna sit here and tell you that there's no such thing as another driver-based way of upscaling your games to get a little bit more performance or that resizable BAR support doesn't exist on some other platform. What I can tell you is that the seamlessness of this AMD integration does make a difference. So take from it what you will, but from what we've seen today, some of the performance gains you've gotten with a very, very minor trade off are really pretty impressive.",
    "transcript_keywords": [
        "Radeon Super Resolution",
        "AMD",
        "Super Resolution",
        "Radeon Super",
        "Smart Access Memory",
        "AMD CPU",
        "AMD Smart Access",
        "AMD GPU",
        "Assassin Creed Valhalla",
        "system",
        "performance",
        "Resolution",
        "Radeon",
        "Assassin Creed",
        "FPS",
        "give",
        "Smart Access",
        "Access Memory",
        "AMD Smart",
        "Super"
    ],
    "transcript_entity_values": [
        "Valhalla",
        "Ryzen 7 5800X3D",
        "Assassin",
        "Ryzen 5 5600",
        "63",
        "AMD",
        "three",
        "Radeon",
        "1440p and 1080p",
        "Radeon Super Resolution",
        "HYTE",
        "Noctua",
        "101",
        "first",
        "6950",
        "Strix",
        "Ryzen",
        "1440",
        "122",
        "ASUS",
        "81",
        "RSR",
        "two",
        "AMD",
        "Super Resolution",
        "up to 100",
        "ROG",
        "XT",
        "900p",
        "84",
        "about 80",
        "AMD Smart Access Memory",
        "4",
        "these days",
        "one",
        "1080p",
        "second",
        "up to",
        "6750",
        "Horizon",
        "FSR",
        "90",
        "4K. Now",
        "Horizon Zero Dawn",
        "Next",
        "'90s",
        "CPU",
        "Assassin's Creed Valhalla",
        "just 1800p",
        "1080p",
        "Horizon",
        "zero",
        "Horizon Zero Dawn",
        "40%",
        "Assassin's Creed",
        "1800p",
        "Radeon 6950 XT",
        "FPS",
        "116 FPS",
        "One",
        "97",
        "GPU",
        "today",
        "Valhalla",
        "First",
        "CPU",
        "135",
        "Smart Access Memory"
    ],
    "transcript_entity_types": [
        "GPE",
        "NORP",
        "PERSON",
        "LAW",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        0.00112757901661098,
        0.00828544981777668,
        0.041699279099702835,
        -0.015480129979550838,
        0.017898045480251312,
        0.003465646179392934,
        -0.005495172459632158,
        0.047689288854599,
        -0.0021590262185782194,
        0.0650206133723259,
        -0.13086776435375214,
        -0.0022375951521098614,
        -0.01053585484623909,
        -0.00548222241923213,
        -0.0449058935046196,
        0.06674746423959732,
        0.11730588972568512,
        -0.03895337134599686,
        -0.005789640825241804,
        -0.018091648817062378,
        -0.06322645395994186,
        -0.07473954558372498,
        0.007549917791038752,
        -0.06012705713510513,
        0.058387428522109985,
        0.08600948750972748,
        0.043499335646629333,
        -0.03601518273353577,
        -0.02113202027976513,
        0.05015239864587784,
        0.04552830010652542,
        0.0014245914062485099,
        0.011967678554356098,
        -0.015689481049776077,
        -0.013077695854008198,
        0.007128963712602854,
        0.11477011442184448,
        -0.09845893085002899,
        -0.05020241066813469,
        -0.017963126301765442,
        -0.02478918619453907,
        0.017337175086140633,
        -0.0036950705107301474,
        0.06330419331789017,
        0.002700359094887972,
        0.01366776879876852,
        0.02967815101146698,
        -0.0882917046546936,
        0.05761069804430008,
        -0.0410294346511364,
        0.012143291532993317,
        -0.057340070605278015,
        -0.00998543668538332,
        -0.04187994450330734,
        -0.09518091380596161,
        0.10156084597110748,
        -0.026018938049674034,
        -0.07896199822425842,
        -0.0012530056992545724,
        0.02818244695663452,
        0.03818864747881889,
        -0.046777866780757904,
        0.07650600373744965,
        0.06604712456464767,
        0.05368361994624138,
        -0.02990492805838585,
        0.007534263655543327,
        0.025349678471684456,
        0.017877334728837013,
        -0.04194629564881325,
        0.030027389526367188,
        0.05124283581972122,
        0.03375719487667084,
        -0.02962031587958336,
        0.014650082215666771,
        -0.0035162956919521093,
        0.028065500780940056,
        -0.09832144528627396,
        0.062119483947753906,
        0.027511686086654663,
        0.04300239309668541,
        -0.010656996630132198,
        0.0027712821029126644,
        -0.13119074702262878,
        0.032037459313869476,
        -0.02803119644522667,
        0.0019157537026330829,
        0.023212188854813576,
        0.024159356951713562,
        -0.08145835250616074,
        0.012091739103198051,
        0.041762903332710266,
        0.07499376684427261,
        -0.007312318775802851,
        0.07010341435670853,
        0.08792036771774292,
        -0.012276300229132175,
        -0.04660385102033615,
        -0.030796973034739494,
        0.012636039406061172,
        -0.005741399712860584,
        -0.02972080372273922,
        0.041737526655197144,
        0.03252062201499939,
        -0.03752249851822853,
        0.029552727937698364,
        -0.05411757156252861,
        0.037079885601997375,
        -0.030629873275756836,
        -0.007753669284284115,
        -0.0340939536690712,
        0.036130115389823914,
        -0.015671636909246445,
        0.037133924663066864,
        0.058838795870542526,
        0.03315097093582153,
        -0.044535666704177856,
        -0.015085236169397831,
        0.09751604497432709,
        0.04924504831433296,
        -0.04790840297937393,
        -0.055609263479709625,
        0.03146203234791756,
        0.08638770878314972,
        0.08716943114995956,
        0.01793387345969677,
        -0.08617037534713745,
        3.853027301601632e-33,
        -0.050785407423973083,
        0.12381833046674728,
        -0.05935626104474068,
        -0.01910056546330452,
        -0.030320100486278534,
        0.019702989608049393,
        0.08966732025146484,
        0.003134781727567315,
        -0.01921563223004341,
        0.01503313984721899,
        -0.03335922211408615,
        -0.008392063900828362,
        -0.023607052862644196,
        0.043309155851602554,
        0.07822813838720322,
        -0.04746828228235245,
        0.02588987536728382,
        -0.021075351163744926,
        -0.0332355871796608,
        -0.0265791192650795,
        0.029804982244968414,
        0.01624586433172226,
        0.015016471035778522,
        0.021541200578212738,
        0.03702389821410179,
        -0.14182575047016144,
        -0.05319521948695183,
        0.009963231161236763,
        -0.03758684918284416,
        -0.016180718317627907,
        -0.038158029317855835,
        -0.051658667623996735,
        -0.050023153424263,
        0.015381485223770142,
        -0.03268604725599289,
        0.0064902231097221375,
        -0.07299485802650452,
        -0.062496062368154526,
        -0.047695331275463104,
        0.018932662904262543,
        -0.12001967430114746,
        0.10835620015859604,
        -0.046751804649829865,
        -0.09093117713928223,
        -0.010002288967370987,
        0.0880662202835083,
        -0.016322117298841476,
        -0.049848783761262894,
        -0.08552016317844391,
        -0.06127907335758209,
        -0.05203951150178909,
        0.04568859189748764,
        0.0410015769302845,
        -0.023626860231161118,
        0.014602835290133953,
        -0.08275992423295975,
        0.05936237797141075,
        -0.01912306435406208,
        0.10759628564119339,
        0.10435695201158524,
        -0.061972521245479584,
        -0.07359132915735245,
        -0.06660429388284683,
        0.05028717219829559,
        -0.04718839004635811,
        0.07725110650062561,
        0.11083292216062546,
        0.08653301000595093,
        -0.00457492470741272,
        0.0406099297106266,
        0.036384228616952896,
        -0.035244476050138474,
        0.052329033613204956,
        -0.05735953897237778,
        0.09444825351238251,
        0.06908644735813141,
        -0.0025073899887502193,
        -0.028958862647414207,
        -0.07829321920871735,
        -0.005877070128917694,
        0.033924877643585205,
        0.07127497345209122,
        -0.0674256831407547,
        0.031581755727529526,
        0.058607835322618484,
        0.07292583584785461,
        0.005664981435984373,
        -0.028445713222026825,
        0.06087714806199074,
        0.03742337226867676,
        -0.045324016362428665,
        0.014864952303469181,
        0.008721885271370411,
        0.044044289737939835,
        -0.021096933633089066,
        -2.626704575049789e-33,
        -0.031778059899806976,
        0.014753960072994232,
        0.004961033351719379,
        0.06882313638925552,
        0.01418435387313366,
        0.017917204648256302,
        0.060732774436473846,
        -0.05509711802005768,
        0.03885936364531517,
        -0.10036741942167282,
        -0.009994883090257645,
        -0.0004998184740543365,
        0.021533558145165443,
        0.02857039123773575,
        -0.051656052470207214,
        -0.0071315704844892025,
        -0.006346846930682659,
        -0.10499585419893265,
        0.05932144075632095,
        -0.05377786234021187,
        -0.00029877101769670844,
        0.06008059158921242,
        -0.07062874734401703,
        -0.03203577175736427,
        0.005714052356779575,
        0.013781175017356873,
        -0.06910546869039536,
        -0.08107449114322662,
        0.021812936291098595,
        0.026225270703434944,
        0.010866661556065083,
        0.017890699207782745,
        0.0653970018029213,
        0.0198694858700037,
        0.04119439423084259,
        0.04474158585071564,
        0.05653272569179535,
        0.017541734501719475,
        -0.013322976417839527,
        0.05855431407690048,
        0.01650628075003624,
        0.044589243829250336,
        -0.029168501496315002,
        0.034435171633958817,
        0.008119882084429264,
        0.04634510725736618,
        -0.024518778547644615,
        -0.03780624270439148,
        0.08103752881288528,
        -0.020680610090494156,
        -0.04940613731741905,
        -0.021446628496050835,
        0.06916717439889908,
        -0.07213471829891205,
        -0.01725810393691063,
        -0.07844505459070206,
        -0.0618072971701622,
        0.037025514990091324,
        -0.03169429302215576,
        -0.05082038789987564,
        0.015364824794232845,
        -0.002875009784474969,
        0.005777524318546057,
        -0.02069983445107937,
        0.03486243635416031,
        -0.0025797116104513407,
        0.0664343312382698,
        0.014983398839831352,
        -0.020380517467856407,
        -0.1066640168428421,
        -0.1214691549539566,
        -0.0825745090842247,
        -0.04812852293252945,
        -0.024445584043860435,
        0.0019836293067783117,
        0.03095070831477642,
        0.07977433502674103,
        0.0007211702759377658,
        0.009092193096876144,
        0.03523402661085129,
        -0.06655991822481155,
        -0.05383259803056717,
        -0.0025303445290774107,
        -0.035278405994176865,
        0.023706356063485146,
        -0.010080915875732899,
        0.017638379707932472,
        -0.0868990495800972,
        -0.021196290850639343,
        -0.0945318341255188,
        -0.007285713218152523,
        0.09093634784221649,
        -0.042161475867033005,
        -0.0389561653137207,
        0.08375190198421478,
        -4.773977835270671e-08,
        0.04905729368329048,
        -0.08223281800746918,
        0.008985204622149467,
        -0.01883877068758011,
        0.021101772785186768,
        -0.017236923798918724,
        0.017678411677479744,
        0.02893516793847084,
        0.006121492944657803,
        0.016314880922436714,
        0.03882809355854988,
        -0.03408483788371086,
        -0.032278724014759064,
        -0.01224283967167139,
        -0.01151413656771183,
        0.042539987713098526,
        -0.01522786170244217,
        -0.021410804241895676,
        0.006758301518857479,
        0.017130263149738312,
        0.017660047858953476,
        0.06092485040426254,
        0.06911439448595047,
        -0.06241859868168831,
        -0.10267844796180725,
        0.010934540070593357,
        0.020664045587182045,
        -0.020565873011946678,
        0.036864329129457474,
        0.014990000985562801,
        0.006791450548917055,
        -0.01783343218266964,
        0.06455029547214508,
        -0.05447198078036308,
        0.058189503848552704,
        -0.12845216691493988,
        0.04480285570025444,
        0.1040692999958992,
        0.08438190817832947,
        0.0467752180993557,
        -0.0091934185475111,
        -0.012006268836557865,
        0.03358634188771248,
        0.0331844724714756,
        -0.006780600640922785,
        -0.0297399815171957,
        -0.07030143588781357,
        -0.10042926669120789,
        -0.016802161931991577,
        -0.011690792627632618,
        0.0019650061149150133,
        -0.011891535483300686,
        0.03856981173157692,
        0.01355687528848648,
        0.08248577266931534,
        -0.0761064663529396,
        -0.015348508954048157,
        0.07325956970453262,
        0.04067457467317581,
        -0.005279958248138428,
        0.04340263456106186,
        -0.15141552686691284,
        -0.028609871864318848,
        0.019301481544971466
    ]
}