{
    "id": "ILBjnZq0n8s",
    "title": "The GFCI/RCD: A Simple but Life-Saving Protector",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-08-17T13:01:35Z",
    "video_url": "https://www.youtube.com/watch?v=ILBjnZq0n8s",
    "category": "Science & Technology",
    "tags": [
        "GFCI",
        "ground fault circuit interrupter",
        "ground fault",
        "electrical safety",
        "electrical outlet",
        "recepticle",
        "RCD",
        "GFI",
        "circuit breaker",
        "electricity"
    ],
    "views": 1369204,
    "likes": 47143,
    "comments_count": 3487,
    "description": "You can support this channel on Patreon!  Link below    These devices are a common sight in homes and businesses around the US and around the world.  But what are they for?  Why do we need them?  This video explores the life-saving potential of the GFCI (known alias: RCD) and explains how they work.  Do you like videos like this?  Why not support the channel on Patreon!  Funny, that last sentence was a question, but its said like an exclamatory statement.  Odd, this English.  Anyway, Patrons of the channel have enabled me to make this my job, and its really neat!  Id love to be able to make bigger and more elaborate videos, and with your help I can.  If youre interested in supporting the channel with a voluntary pledge, please check out my Patreon page.  Thanks for your consideration!   And thank you to the following Patrons! Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Thomas Fuchs, Callum Brieske, Tomas, Chuck Floyd, Eitan Tal, Emil Gilliam, Andy Copsey, Bitcore, Filip, Per 'Zapro' Jensen, Ward Sutherland, rn Arnarson, Alberto Amatucci, etho624, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, TeaChest Media, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Kelly Rose, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, TM, Mark Nicholas Wales, T.J. Steckbeck, Pavlo Pravdiukov, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Staval, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Matt Sackett, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug  Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "If you live in North America, youre probably familiar with electrical outlets that have a test and reset button. Older ones would have red and black buttons, but newer ones are usually matched to the color of the receptacle. If youve ever messed about with one of these and pressed the TEST button, youll have noticed it sort of POP with the RESET button sticking out a bit, and now the outlet is dead. To be fair, it told you to test it. But now you have to exert quite of bit of force to shove that reset button back in place before the outlet will work again. What is this for? Why are they usually only found in kitchens and bathrooms? Will I ask a fourth question? And how are they, as the title suggests, life-saving? Well, this is called (in Americaspeak) a ground-fault circuit interrupter, or GFCI. Sometimes theyre just called Ground-Fault Interrupters, or GFIs. The rest of the world calls them Residual Current Devices, or RCDs, and usually they arent found in the bathroom but in the service panel protecting the entire circuit (and sometimes the entire house). These simple devices use a fundamental principle of electricity to detect when an electric shock might be in progress, and can nearly instantly cut power to the circuit to stop said electric shock. The US electric code requires these outlets to be fitted when they are within a certain distance of a water source. Thats why theyre usually found in the kitchen and bathrooms, though electrical outlets found in other potentially wet locations, such as exterior outlets or those in a laundry room or garage, will usually require protection as well. The theory is that youre much more likely to experience an electric shock near water, cause water tends to conduct electricity pretty well and thus if your hands are wet or a power cord is wet, youre at a significantly higher risk of electric shock when touching anything remotely electrical. Anyway, how do these devices determine if a shock might be happening, and thus how do they know they need to break the circuit? Well, part of the answer is in the name. The Americaspeak version, ground-fault circuit interrupter, suggests it can detect some problem related to the ground. The most-other-places name, Residual Current Device, suggests current is going somewhere it shouldnt. Ive always felt that both of these names compliment the other and make the issue easier to understand, but on their own theyre somewhat inadequate. Residual current is kinda the result of a ground fault, but what does that even mean? Well, in any ordinary circumstance, the current flowing out of one side of the outlet will exactly match the current flowing back into the other. There should always be a balance in an electric circuit between the hot supply and the neutral return. If you plug in a toaster, then for every unit of current flowing towards the toaster in this wire, there is an equal unit of current flowing away from it in the other. The same holds true for the reverse polarity of the A/C cycle. But if I were to get an electric shock from the toaster, perhaps by being a complete fool and sticking a knife down there like you should never ever do, kids, then some of the current coming from the outlet gets diverted through my body. Now, the current leaving the outlet is greater than the current returning, because some of it doesnt actually return. There is now an imbalance between the current flowing out of the hot wire and back through the neutral wire. This fault condition is, from the outlets perspective, a ground fault. Some of the current is not returning to ground, or the neutral side. Somewhere outside the circuit, there is residual current. See, both names work, but they describe the problem differently. With a ground-fault detected, With residual current detected, the device needs to interrupt the circuit. So its a ground fault circuit interrupter. So its a residual current device. As a side note, I like the term ground-fault circuit interrupter better because it describes both what it detects and what it does. Even the 25% discount term, Ground Fault Interrupter, describes both the problem and the action. Residual current device is a little incomplete in describing its mission, but I will grant that residual current seems like a less-technical description than ground-fault. But whatever. Now, Ive always found the best way to show how devices do what they do is to tear one apart. Off to the hardware store! Im back! So lets take a look at this thing. Like any electrical outlet, is has terminals for incoming hot and neutral, as well as a separate ground. But these ones here are a little interesting. See, most standard outlets have two pairs of terminals as well, but theyre connected by this little tab. This electrically joins the two halves together, so connecting just one pair of wires powers both sides of the outlet, and you easily can daisy-chain outlets together within a circuit. However, if you break the tabs off, now each outlet is wired separately. This is often done so that one pair of plugs can have two functions, with one side on a light switch for a lamp, and the other on all the time. But the second set of terminals on a GFCI is protected by its internal circuitry. Thats why they are labeled LINE and LOAD. Incoming power goes into the LINE terminals, and any outlets farther down the circuit that are attached to the LOAD terminals will also become ground-fault protected. The practical upshot of this is that in a chain of outlets on one circuit, only the first needs to be a GFCI receptacle. The rest downstream will all get protection, though there is a limit to how many you can string along depending on national and local electric codes. One little curiosity is that most outlets of this type can interrupt 20 amps, so although this is only a 15 amp receptacle, it can be placed in a 20 amp circuit and provide protection for other 20 amp receptacles. So, lets open it up. With everything removed we find the four screw terminals mounted to a circuit board. These braided copper wires are carrying current from the line side through to the load side, and the top pair of switch contacts would normally energize the pins of the actual receptacle, which when assembled lie far above the circuit board. This nylon bracket can move back and forth, and it forms the actual switch that will break the circuit in a fault condition. It rests in the closed condition with the help of a latch, and a spring down below will keep it in the open position once enough force is exerted on it to overcome the latch. Now, this black cylinder piece is a tightly wound coil of wire called a solenoid, and when current is passed through it it creates a magnetic field which will force an iron plunger out of it in this direction. This plunger isnt visible but it is what breaks the circuit. When the electronics detect a ground fault, they divert power into the solenoid which will push the plunger forward and thus kill the power. But how does it detect current leakage? Well, look closely at the path the electricity takes from the line connections through to the switch contacts. It goes via these busbars through a round doo-dad, and if we move this varistor out of the way we can see that inside is a coil of wire. This is the sense coil, and if you look on the bottom you find that this is what is being monitored. You can see that IC1 has its pins connected to the output of the coil, with some support components peppered in. And now we go back to school for a moment. You were likely taught that when current passes through a wire, it generates a magnetic field. Likewise, when a magnetic field encounters a wire, it induces a current in the wire. Basic stuff, but this is exactly the principle that makes the GFCI work. See, in a normal condition, whatever unit of current is going up through this side is also going down through that side. The current going to the toaster as before, goes up this side, and the current coming back from it goes down that side. Of course thats constantly switching back and forth due to the fact that were dealing with A/C electricity, but they are always opposite directions. Both bus bars generate a pretty sizeable magnetic field around them depending of course on the load, but because they are going in opposite directions the fields cancel each other out. That means that normally, no current is actually induced in the sense coil. Even though there are two magnetic fields being generated, they are of equal amount and opposite polarity, so the net result is zero. But if theres any imbalance at all between the current going up one side and down the other, now the magnetic fields are no longer in equal opposition and they dont entirely cancel out. A tiny imbalance generates enough current in the sense coil for the electronics to detect, and as soon as they do so the solenoid fires and disconnects the circuit. Most devices like this are designed to break the circuit in 30 milliseconds or less, and in the US they are designed to trip with only 5 milliamps of leakage current. So whats the real-world use of this? Let me show you. A word of caution for the following demonstrations. What Im doing is pretty dangerous. Energizing exposed terminals at line voltage is not something you should casually do. Let me do the dangerous stuff, and please dont try this at home. Ive wired up this naked GFCI to a plug and Ive put a few of things on its output. First, a standard light socket with a standard bulb. Second, the same light socket but with an adapter for an itty bitty bulb, and this ones wired correctly. And third, the same light socket and adapter, but this time its wired incorrectly. So right now, everything looks good. The current exiting the plug always matches the current returning, so the electronics dont intervene and the light stays lit. Now Im going to screw this little 5 watt bulb into the top light socket. Nothing happens, it just comes on. But now Ill tighten the light on the bottom. As soon as it makes contact, the electronics in the GFCI intervene, firing the solenoid, and breaking the circuit. But why? Well, the second light socket was wired with a deliberate ground fault. I attached its hot wire to the monitored output of the GFCI just like the the first one, but its neutral wire was hooked into the supply neutral of the outlet, therefore bypassing the sense coil. This meant that the current that flowed out through this wire and into the bulb didnt take the same path back to the outlet. It leaked out somewhere (in this case just to here), and the outlet could detect the resulting current imbalance through the sense coil. Even though this lamp is really small, passing only 41 milliamps when its lit, the GFCI could immediately detect the fault and broke the circuit. The second lamp is analogous to someone getting an electric shock. Current flowed out of the outlet, but it didnt make its way back in. If this were a human body rather than a light bulb, said human could be in for a shocking experience. But thanks to the GFCI, the fault condition was immediately detected and the current flow was stopped. Let me show you how fast this happens. Ive disconnected the return wire so I can just push it against the contacts. If I go to this contact nothing happens because the current is taking the correct path to ground. The current returning from the bulb goes through the sense coil. But if I just barely brush against the incoming neutral connection, causing the return current to flow outside the sense coil, it detects the imbalance imperceptibly quickly. And thats why these are life savers. Imagine youve plugged your hair dryer into the outlet in your bathroom, and the cord is frayed. You might have never noticed it, but if you touched that wire with a wet hand youd be in for a nasty shock. But if plugged into a ground fault interrupter, almost immediately the current flow would be stopped and your life may very well have been saved. And thats why most modern devices that are going to be used in the bathroom, like a hair dryer, are required to have a GFCI built into their power plugs here in the US. There are plenty of older homes without GFCI equipped receptacles, and for these your-hands-will-definitely-be-wet scenarios, its better safe than sorry. And now, some other things! First, in the US, these generally are NOT circuit breakers. OK, yes they are, but I mean they dont protect against short circuits or excessive current. They are not a replacement for a traditional circuit breaker but are instead a supplement to them. They do not duplicate the overcurrent protection of your standard circuit breaker or fuse. Many GFCI receptacles here in the US have an LED to indicate... something. The state that is being indicated is entirely nonstandard. Many, such as these, have a light indicating that its working. Presumably that light would go out if the protection has failed. But Ive also seen plugs where the light is normally out, but comes on when the outlet has tripped! And these ones in my kitchen are normally green and are off when tripped, but when you reset them, they briefly illuminate red. So probably, they would light up red if the protection circuit had failed. Which does happen. Thats why they are all labeled TEST MONTHLY. And the neat thing about the test is that this actually creates a ground fault! You might have noticed this resistor apparently randomly sticking up from the circuit board. This resistor creates a path to the incoming neutral, and pressing the TEST button shunts this resistor to the monitored hot. So by pressing the TEST button, you are for real testing its ability to detect a ground fault because you actually are creating a ground-fault internally. Even better, the resistor is sized to roughly match the minimum leakage its designed to detect. So definitely test these periodically, especially since leaving them in the non-tripped position for a couple of dozen years might make them mechanically seized up and prevent them from doing their job should the need arise. You might be wondering why we in the US put these in outlet boxes when others put them in service panels. Well theres pros and cons to each method. Doing it in the US fashion makes it obvious if any installation is up to code, as a lack of GFCI outlets in a bathroom or kitchen means an obvious fail. It also probably encourages testing if the device is easy to access rather than being part of a circuit breaker panel. However, there is a benefit to having this protection in all areas of the home. Sure, an electric shock is more likely in wet places, but its not like no one has ever received a shock in their bedroom or whatever. Plus, in many countries, residual current devices are combined with circuit breakers, forming one device called an RCBO, for Residual Current circuit-Breaker with Overcurrent protection. But putting the protection in the service panel makes troubleshooting a whole lot harder. If something malfunctions and causes a ground fault anywhere in the circuit, you might be spending a long time determining what device is actually causing the fault. Putting the protection at the outlet makes it rather obvious. One thing that I discovered when tearing this apart is that the internal contacts are able to accomodate a NEMA 5-20 plug. Normally US devices that require 20 amps will have this plug where one pin is sideways, thus preventing you from plugging it into a 15 amp circuit. The fact that this device has internal pins capable of accepting this plug, plus the fact that it can break 20 amps as most GFCI outlets can, means the only thing preventing this receptacle from actually being a 20 amp receptacle is the shape of the holes on the plastic faceplate. Which means that, in the case of this particular model anyway, they charge you $3 more for the same product with a slightly different piece of plastic on the front. Yay. And finally, though these are super helpful at reducing the chance of injury or death due to an electric shock, they shouldnt be seen as an excuse to be reckless around electricity. They are a very effective safety net, but why risk falling in the first place? That said, if youre a tinkerer who likes to work on electronics, installing one of these in your workshop might be a very good investment. At the very least, it might spare you the pain of a zap. Thanks for watching, I hope you enjoyed the video! If this is your first time coming across the channel and you liked what you saw, please consider subscribing! As always, thank you to everyone who supports this channel on Patreon, especially the fine folks that are scrolling up your screen. Patrons of the channel are what keep these videos coming, and if youre interested in pledging some support for the channel and helping it to grow, please check out my Patreon page. Thank you for your consideration, and Ill see you next time!",
    "transcript_keywords": [
        "Current",
        "North America",
        "Residual Current",
        "circuit",
        "Residual Current Device",
        "ground fault",
        "GFCI",
        "outlet",
        "outlets",
        "Current Device",
        "fault",
        "groundfault circuit interrupter",
        "current flowing",
        "ground",
        "live in North",
        "electric shock",
        "circuit interrupter",
        "wire",
        "GFCI outlets",
        "light"
    ],
    "transcript_entity_values": [
        "Ground-Fault Interrupters",
        "zero",
        "third",
        "MONTHLY",
        "Second",
        "a couple of dozen years",
        "North America",
        "GFCI",
        "Ground Fault Interrupter",
        "NEMA 5-20",
        "two",
        "only 41 milliamps",
        "RCBO",
        "20",
        "solenoid",
        "Patreon",
        "fourth",
        "this little 5 watt",
        "30 milliseconds",
        "US",
        "Overcurrent",
        "first",
        "one",
        "four",
        "25%",
        "One",
        "15",
        "3",
        "Residual Current Devices",
        "bitty",
        "First",
        "second",
        "Americaspeak",
        "only 5 milliamps"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "LOC",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "LOC",
        "QUANTITY"
    ],
    "vector": [
        -0.0977552980184555,
        -0.07199955731630325,
        0.0037573601584881544,
        -0.13416779041290283,
        0.09632891416549683,
        0.03443700447678566,
        0.0225908774882555,
        0.01813036948442459,
        -3.0117505957605317e-05,
        -0.008370923809707165,
        0.010754712857306004,
        -0.00896341074258089,
        -0.00044477093615569174,
        0.006684775929898024,
        -0.005148266442120075,
        -0.05634560063481331,
        0.05593285337090492,
        -0.08568187057971954,
        -0.08955373615026474,
        0.02783682383596897,
        -0.016585174947977066,
        0.0069207437336444855,
        0.007364269811660051,
        0.02205147221684456,
        -0.05742134898900986,
        -0.03009885363280773,
        -0.016965730115771294,
        -0.039476387202739716,
        0.020589429885149002,
        -0.01716754585504532,
        0.03563258796930313,
        0.07137835770845413,
        0.026005810126662254,
        -0.009047199971973896,
        0.01542663760483265,
        0.03191979601979256,
        0.06945603340864182,
        -0.032229237258434296,
        -0.030449554324150085,
        0.038564085960388184,
        -0.022310160100460052,
        -0.12605470418930054,
        -0.01654534786939621,
        -0.011266347020864487,
        0.028442932292819023,
        -0.029611950740218163,
        0.03854667767882347,
        -0.03133349493145943,
        0.02090427279472351,
        -0.025547044351696968,
        0.002542358124628663,
        -0.06114481762051582,
        0.05871123448014259,
        -0.01192122045904398,
        0.01502674538642168,
        -0.03562699258327484,
        -0.007472600322216749,
        -0.05760592594742775,
        0.01444418914616108,
        0.030716581270098686,
        -0.004366799723356962,
        -0.048594336956739426,
        -0.0452963188290596,
        0.049813464283943176,
        0.04077688977122307,
        0.01397344283759594,
        -0.015271132811903954,
        0.0343083031475544,
        0.0330611877143383,
        -0.0708903819322586,
        -0.0815647542476654,
        -0.03296573832631111,
        0.05598597228527069,
        0.006955241784453392,
        -0.0018174824072048068,
        -0.017936797812581062,
        0.015069693326950073,
        -0.03539644926786423,
        0.0916319414973259,
        -0.053904641419649124,
        0.0538809671998024,
        -0.038976628333330154,
        0.03991177678108215,
        -0.0027337167412042618,
        -0.023465672507882118,
        -0.02645702101290226,
        0.005246634595096111,
        -0.015323200263082981,
        0.0196686964482069,
        0.03127261996269226,
        -0.08012033998966217,
        0.0880000963807106,
        0.09934646636247635,
        -0.02611871249973774,
        -0.043085478246212006,
        -0.013321496546268463,
        -0.09115009754896164,
        -0.11105544120073318,
        -0.10705834627151489,
        0.07763545215129852,
        -0.01628069207072258,
        0.000997672090306878,
        -0.005583819467574358,
        -0.041306350380182266,
        -0.09966685622930527,
        -0.06908302009105682,
        -0.06481345742940903,
        0.0777088850736618,
        0.1076601967215538,
        0.05825529247522354,
        -0.05192707106471062,
        0.10694283992052078,
        -0.06039571017026901,
        0.008465754799544811,
        0.007150387857109308,
        0.03681788966059685,
        -0.06329653412103653,
        0.035223472863435745,
        0.09026078879833221,
        -0.07226589322090149,
        0.048533082008361816,
        0.01697823591530323,
        -0.04091491550207138,
        -0.04050999879837036,
        0.052098728716373444,
        -0.0565972700715065,
        0.020767880603671074,
        1.4391586520666882e-33,
        0.09085451066493988,
        0.12412971258163452,
        -0.019207486882805824,
        0.012320220470428467,
        0.028442392125725746,
        0.05084308609366417,
        -0.07815934717655182,
        0.007374319713562727,
        -0.06568733602762222,
        -0.0001643645082367584,
        0.09105851501226425,
        0.03852441906929016,
        -0.06574685871601105,
        0.07477518171072006,
        -0.04092443361878395,
        -0.045614469796419144,
        -0.1286008507013321,
        -0.005461552180349827,
        0.002890037838369608,
        -0.0002227698132628575,
        0.06767499446868896,
        0.012765409424901009,
        0.03824792429804802,
        0.015710674226284027,
        0.07530927658081055,
        -0.03420468047261238,
        -0.027417851611971855,
        -0.00045432374463416636,
        0.08976369351148605,
        0.03692953661084175,
        -0.021021002903580666,
        0.02449697256088257,
        -0.009826518595218658,
        -0.05139486491680145,
        0.004638472571969032,
        -0.012661604210734367,
        -0.04949843883514404,
        -0.17444346845149994,
        -0.04425632953643799,
        -0.014116615988314152,
        -0.003406862262636423,
        0.03536340221762657,
        0.0013617159565910697,
        -0.03015974536538124,
        -0.00972744356840849,
        0.0030895955860614777,
        0.14553678035736084,
        -0.0361439548432827,
        0.018074166029691696,
        0.049354419112205505,
        -0.008618938736617565,
        0.025512082502245903,
        -0.06940262019634247,
        -0.10721606016159058,
        0.012515622191131115,
        -0.04144159331917763,
        -0.015880990773439407,
        -0.020364295691251755,
        0.033647648990154266,
        -0.11432889103889465,
        -0.00839933194220066,
        0.0590692013502121,
        -0.0003810423950199038,
        0.04324156790971756,
        -0.06134848669171333,
        0.03762885555624962,
        -0.014678282663226128,
        -0.03900324925780296,
        0.07175244390964508,
        -0.0022049625404179096,
        -0.06522279977798462,
        -0.023656193166971207,
        0.01278914138674736,
        -0.09575336426496506,
        0.001004038262180984,
        0.00020545106963254511,
        -0.039255540817976,
        0.04613570123910904,
        0.0371939018368721,
        0.048240575939416885,
        0.026153329759836197,
        -0.026181606575846672,
        -0.03435032069683075,
        0.01134954672306776,
        0.09554961323738098,
        -0.04246414080262184,
        0.04497232288122177,
        -0.05672292038798332,
        -0.026865869760513306,
        -0.06445994973182678,
        0.01104066800326109,
        -0.0008261870825663209,
        0.0763653814792633,
        0.002763357013463974,
        -0.023262014612555504,
        -2.6031895452455583e-33,
        -0.0018561050528660417,
        -0.025835977867245674,
        -0.02020074613392353,
        -0.009586225263774395,
        0.07874773442745209,
        -0.07274467498064041,
        0.010869992896914482,
        -0.047449950128793716,
        0.09151769429445267,
        -0.04066154360771179,
        -0.017869064584374428,
        0.0025794627144932747,
        -0.06554023176431656,
        -0.0028395242989063263,
        -0.08721555024385452,
        -0.12867116928100586,
        -0.03765902668237686,
        -0.03649712726473808,
        -0.04742274805903435,
        -0.06383967399597168,
        0.10500314831733704,
        0.05703491345047951,
        -0.02157064899802208,
        0.057453762739896774,
        0.024744946509599686,
        0.05412314832210541,
        0.011112222447991371,
        0.04660072550177574,
        0.053919993340969086,
        -0.006415233016014099,
        -0.026873858645558357,
        0.027665620669722557,
        -0.0605694018304348,
        -0.014353311620652676,
        0.019167950376868248,
        0.04045483097434044,
        0.08524223417043686,
        0.06479386240243912,
        -0.07638458162546158,
        -0.08024141937494278,
        0.006587872747331858,
        0.026972338557243347,
        -0.042751383036375046,
        -0.04182255268096924,
        -0.09087897837162018,
        0.0006826643366366625,
        -0.02097601629793644,
        -0.015334914438426495,
        -0.08907593786716461,
        0.04791472107172012,
        0.025669006630778313,
        0.020389266312122345,
        0.002058792393654585,
        -0.049489010125398636,
        0.0023536819498986006,
        0.0006259617512114346,
        0.0576266385614872,
        -0.0011865003034472466,
        0.06926770508289337,
        -0.021215081214904785,
        0.003394714090973139,
        0.052942369133234024,
        -0.036660611629486084,
        0.05622462183237076,
        0.04702243581414223,
        -0.021055705845355988,
        0.058315422385931015,
        0.12228090316057205,
        0.01107797585427761,
        0.03146747872233391,
        0.02543795295059681,
        0.002481086878105998,
        0.03864210471510887,
        -0.023859554901719093,
        -0.02369728870689869,
        0.010393977165222168,
        0.023295126855373383,
        -0.06786013394594193,
        -0.03950342535972595,
        0.053097549825906754,
        -0.03525148704648018,
        -0.02587718516588211,
        -0.02952122688293457,
        0.09961391985416412,
        0.1029629036784172,
        -0.009028466418385506,
        0.05167733132839203,
        0.04206523299217224,
        0.03739894926548004,
        0.10346203297376633,
        -0.06592739373445511,
        0.0984499603509903,
        0.05663301795721054,
        0.09234423190355301,
        0.07188375294208527,
        -5.7419288879145824e-08,
        -0.005977105349302292,
        0.03419708460569382,
        -0.05387111380696297,
        -0.0012255008332431316,
        -0.004011963028460741,
        -0.11767986416816711,
        0.0024145792704075575,
        -0.12178420275449753,
        0.015263321809470654,
        -0.06788315623998642,
        0.03995170816779137,
        0.048686884343624115,
        -0.052401501685380936,
        0.0028175481129437685,
        0.09731218218803406,
        -0.01339033804833889,
        -0.05711398273706436,
        -0.00937711913138628,
        -0.0481753870844841,
        0.05010121688246727,
        0.014887315221130848,
        0.011443877592682838,
        0.007717857602983713,
        0.017854508012533188,
        -0.02485629916191101,
        0.03932509198784828,
        0.08683662116527557,
        0.04975014925003052,
        -0.04958226531744003,
        0.06368527561426163,
        -0.04804224520921707,
        0.045592840760946274,
        -0.03978760913014412,
        -0.01150329690426588,
        -0.03226938098669052,
        -0.022973082959651947,
        -0.03212066739797592,
        -0.0199764221906662,
        0.013219255954027176,
        0.06588970869779587,
        -0.026472600176930428,
        -0.056971825659275055,
        0.034593500196933746,
        0.03508660942316055,
        0.01034527737647295,
        0.00941313523799181,
        -0.0920211598277092,
        0.0018141277832910419,
        0.01302440743893385,
        0.0025765178725123405,
        -0.011288939975202084,
        -0.008014434017241001,
        0.014930377714335918,
        0.04760520160198212,
        0.05774463713169098,
        0.0643756240606308,
        0.043828096240758896,
        0.0062965210527181625,
        0.013937778770923615,
        0.021517690271139145,
        0.04516500234603882,
        -0.008645310997962952,
        -0.0036763588432222605,
        -0.03278953954577446
    ]
}