{
    "id": "iNk5Res9bB0",
    "title": "iPhone 11 Pro review: the BEST camera on a phone",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-17T10:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=iNk5Res9bB0",
    "category": "Science & Technology",
    "tags": [
        "iphone 11 pro",
        "iphone 11 pro max",
        "iphone 11 pro camera",
        "11 pro camera",
        "iphone 11 pro colors",
        "iphone 11 pro green",
        "11 pro",
        "11 pro max",
        "iphone 11",
        "apple iphone",
        "iphone",
        "apple",
        "apple iphone 11",
        "apple iphone 11 pro",
        "pro max",
        "pro",
        "iphone 11 pro midnight green",
        "midnight green",
        "11 pro midnight green",
        "iphone 11 review",
        "iphone 11 pro review",
        "iphone 11 pro max review",
        "review",
        "hands on",
        "unboxing",
        "iphone 11 camera",
        "iphone 2019",
        "technology",
        "gadgets",
        "tech",
        "tech news",
        "google",
        "verge",
        "the verge"
    ],
    "views": 3111013,
    "likes": 40377,
    "comments_count": 4854,
    "description": "Apples iPhone 11 Pro and 11 Pro Max have the best cameras on a phone; a huge improvement in battery life; bright, beautiful displays; and they come in midnight green. These are some of the most well-balanced, most capable phones Apple  or anyone  has ever made. But starting at $999, theyll cost you. Here's the review of our midnight green unit.  Check out the full review here:  How to preorder:  How to choose which phone to buy:  The 3 best and worst features:  Apple Watch Series 5 review:  iPhone 11 review:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2miGPpX",
        "http://bit.ly/2kFfpub",
        "http://bit.ly/2klgQO2",
        "http://bit.ly/2lXyGr2",
        "http://bit.ly/2kQfH1e",
        "http://bit.ly/2mmwBoN",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Alright, it's iPhone time. Apple released three new iPhones all at once this year. The iPhone 11, the iPhone 11 Pro, and the iPhone 11 Pro Max. Now, I honestly think the iPhone 11 is the phone most people in the iOS ecosystem should get if they're upgrading. So we've got a whole other review of that phone that you should check out, too. But this, this is the Pro review. The dark mode, cash money review for professionals who use their phones to do pro stuff. Like taking telephoto photos. Actually, I have no idea why Apple called these phones Pro. They're basically just nice updates to the iPhone XS, but I also think it's a waste of time to argue about names. iPhone 11 Pro Max is a bad name. But you know what, it's a great phone. And I think Apple might have done it. This is the best camera I've ever seen on a phone. Let's get into it. (calming music) The iPhone 11 Pro looks almost exactly like the iPhone XS from the front. It's a little heavier and thicker, but unless you're comparing them directly, you probably won't notice. I certainly didn't. You do get a much bigger battery in exchange for that extra size, which Apple says leads to a four-hour battery life increase on the regular Pro and a five-hour jump for the Pro Max. But it's surprisingly hard to check that number. I'll get into why in a minute. The big difference from the XS comes on the back where Apple says the rear glass is now stronger and it comes in this frosted matte finish. It also integrates a glossy camera bump with three cameras. The whole back and the bump is a single piece of glass that's milled out. The iPhone 11 is the reverse. It has a glossy back and the camera bump is matte. Now you know. I got a lot of questions about this matte finish and I think it's really nice, especially in this new midnight green color. It didn't really pick up any fingerprints, but it does seem a tiny bit more slippery than the gloss back of the previous phones and the iPhone 11. But I also think most people are just going to stick this thing in a case, so it doesn't seem like a huge issue. A lot of people also asked me if this matte finish will scratch easily, similar to the back of the Pixel 3, and so far the answer seems to be no. But we're going to have to keep an eye on it over time. Apple's finally relented and included an 18W USB-C fast charger with the Pro phones. So you get a USB-C to Lightning cable as well. Now Apple's USB-C charger is not the smallest or prettiest charger out there. But anything is better than the slow 5W brick it's been including for years, so I'll take it. So let's get into these cameras. Apple has a lot at stake here. Google and Samsung's cameras have been outperforming the iPhone for a couple of years now. And Chinese phone makers, in particular, have been racing each other to add an endless array of photography features. If you're in the US, you're probably locked into iMessage and no camera is good enough to make you switch. But Apple doesn't have that advantage in big markets like Europe and China. Everyone uses WhatsApp and WeChat, and switching from iOS to Android is much easier. So Apple's added a bunch of features that first appeared on Android phones. There are three cameras on the iPhone 11 Pro. The telephoto camera has the same basic sensor, but a faster f/2.O lens. The main camera has the same f/1.8 lens and a slightly better sensor. And there's the new super fun ultra-wide camera, which is basically twice as wide as the main lens and f/2.4. And the f/2.2 front camera is now 12 megapixels, up from seven, and has a wider 24mm focal length so it can pull out to a slightly wider angle in landscape for selfies. Apple's also updated its smart HDR processing system, which I was not very impressed with when I reviewed the iPhone XS and XR. The iPhone 11 cameras are an enormous improvement over the XS, and beat the Pixel and Galaxy Note 10 in most of our tests. This shot of Verge video producer, Mariya Abdulkaf, outside in bright sunlight shouldn't be too hard for any camera to do a good job with. And all these photos look basically fine. But zoom and do 100 percent crop and the improvement from the iPhone XS to the iPhone 11 main camera is stunning. The iPhone 11 is way sharper, with way more detail. I also think the iPhone 11 does a way better job than the Note 10 and it's a little better to my eye than the Pixel 3. This improvement is due to something Apple's calling semantic rendering. Basically, Smart HDR recognizes what's in the image and renders it appropriately. I asked Apple to break down how it works for me and it basically goes like this: First, the iPhone starts taking photos to a buffer the instant you open the camera app. So by the time you actually press the button, it's captured four underexposed frames and the photo you want. Then it grabs one overexposed frame. This is all basically the same as the iPhone XS and the Pixel 3, except the Pixel doesn't grab that overexposed frame. Second, Smart HDR and semantic rendering then start looking for things in the photos it understands. Faces, hair, the sky, things like that. Then it uses additional detail from the under and overexposed frames to selectively process the areas of the image it's recognized. Hair gets sharpened, but the sky doesn't. It just gets de-noised. Faces get relighted to make them look more even and the iPhone knows to sharpen up your facial hair. Smart HDR is also less aggressive in flattening the photos. Highlights and faces aren't corrected as aggressively as before because those highlights make photos look more natural. But other highlights and shadows are corrected to regain detail. Finally, the whole image is saved and you've got a photo. This all happens instantly every time you take a photo, which is a testament to how powerful Apple's A13 processor really is. Here's that final image we just took. You can see how the iPhone 11 preserves more detail than the Pixel and Note in the shadows and highlights, and just blows the iPhone XS away in sharpness. The improvements to Smart HDR are applicable across cameras. Here's a quick comparison of the ultra-wides in the 11 Pro and the Note 10. The Note 10 did a better job exposing the sky, but the 11 is just a much sharper photo with more detail. You can see the same thing with selfies. The XS Max has pulled up shadows so much that it looks a little hazy, while the iPhone 11 evenly pulls up shadows in Mariya's face, but preserves the contrast with the background. The Note 10 did all kinds of goofy skin smoothing and the Pixel 3 looks great, but it has less detail than the iPhone. Just look at her eyelashes. Now there are places where the iPhone 11 didn't win in our tests. The XS historically struggled with backlit subjects. And while the 11 is a definite improvement, this photo is really blue. And there's basically no detail in Mariya's face. I think the Note actually did the best overall job here. And I think the Pixel does the best job in low light, but the iPhone isn't bad. It's a lot better than the XS was last year. Apple's promised a new mode for these situations called Deep Fusion, which is supposed to ship later this year, but I wasn't able to test it. If it improves photos taken in this kind of light, then the iPhone will basically pull ahead in every situation. Apple also added a Night mode this year and it's really impressive. It preserves a ton more detail than the Pixel. It comes on automatically in the dark and suggests an exposure time, which you can tweak or turn off if you want. The Pixel photo here looks more dramatic, but look a little closer. The iPhone has preserved all of the detail in the brick and graffiti, which is basically gone in the Pixel shot. Both of these Night mode photos look pretty similar, but look at all the extra detail in the bushes in the iPhone shot. Same with this shot. You'd never know that fence was even there in the Pixel photo. I think the Pixel produces more dramatic-looking shots out of the camera, but I would rather have the extra detail from the iPhone. All in all, I think the iPhone 11 camera does better in bright light than the Pixel 3 and Note 10, and the Night mode beats the Pixel 3 more often than not. If this promised Deep Fusion update improves medium- to low-light performance as much as Apple says it will, the iPhone 11 will once again be the smartphone camera to beat. Apple's also made video on the iPhone 11 better with improved stabilization exposure and the ability to record 4K60 video from any of the three cameras. - But is it really that good? Let's put it to the test. Alright, so we're going to head out in New York City and we're going to test against the Note 10, the Pixel 3, and the XS to see who does video best. We started out at the water and immediately you can see the color differences between the cameras. The Pixel leaned into the warm tones, while Samsung muddied the mid tones. And the iPhone XS leaned into the blues of the sky, while the 11 Pro balanced the warm and cool tones out the most. With the subject closer to the lens the Note 10 kept the flowers the sharpest, while the iPhone XS blurred the background the most. Okay, we've got to test the audio on all these phones. I'll let you guys be the judge. Do I sound like the beautiful angel voice that I have, angelic voice? Of course, the answer is yes. But on these phones, who's to say? In low light, Apple isn't afraid of underexposing the blacks, whereas Samsung and Google will bring them up. Now the 11 Pro does do a lot more smoothing to compensate for all of the noise this typically creates. The front-facing camera on the iPhone 11 Pro did a great job of balancing my skin tone and just the exposure in general. Even against this large neon light source. But it wasn't as sharp as the Note 10. Now all these comparisons are great, but chances are you won't be recording on all of these phones side by side at the same exact time. So let's just talk about the iPhone 11 Pro. The front-facing camera now records in 4K and the \"slofie\" is exactly how you'd imagine it. You'll use it once and probably never touch it again. The video from the rear cameras, though, is really good. Like, in perfect light, it's honestly just impressive. Switching between lenses is pretty seamless in terms of color accuracy and exposure. And you can use the dial method or just tap the lenses on the screen to switch. Now you can't switch between lenses when you shoot in 4K60. So make sure you set 4K30 or lower if you're going to be doing that. The ultra-wide angle lens looks super cool even with the crazy distortion. But there is no image stabilization, which shouldn't be a problem because naturally, the wider the lens, the less need for that. Both the telephoto and wide lens keep your shot stable and pretty sharp for a sensor their size. The color is punchy and pretty saturated and in perfect lighting, you, too, can have that \"shot on iPhone\" look. But in low light, even the iPhone 11 Pro, when viewed on a screen larger than its own, succumbs to noisy blacks and haloed highlights. My big issue, though, why do I have to leave the camera app to change the frame rates? It's not intuitive and it's just time-consuming. Apple, just put it in the app. iPhones have always had great video, but the video on the 11 Pro is the best I've seen on a smartphone to date. And the gap is only getting bigger. Enough of me, back to Nilay. - The screen on the iPhone 11 Pro is a new OLED that Apple is calling the Super Retina XDR display. There's still a notch and Apple is still doing fancy, rounded corners and uniform bezels, which no one else in the industry has really managed to match. Those bezels are still pretty big, though, especially compared to something like the Galaxy Note 10. This is the third year of the basic iPhone X design and Apple's competitors haven't been sitting still in trying to beat it. The big upgrades to the screen are around brightness and power efficiency. Basically, the screen can get a lot brighter than before and it also uses up to 15 percent less power, according to Apple. Now in typical situations, Apple says the iPhone 11 Pro display can go up to 800 nits of brightness and that when you're watching HDR content, the highlights will peak at 1,200 nits. In normal situations, I don't think you're going to notice it. I've never had a problem looking at my iPhone XS display outside. But it's a huge and obvious improvement when you're watching HDR movies. I never really bought the idea that previous iPhone displays were Dolby Vision, but the iPhone 11 Pro display kind of pulls it off. It's hard to capture this on video, but it's just a lot brighter and punchier on the 11 Pro display compared to the XS. The Note 10 display definitely looks as bright, but the iPhone's color processing looks way more natural to me, especially with Apple's True Tone system turned on. Of course, Apple and Google are still in a fight over video codecs, so you can't watch any 4K or HDR content on the iPhone 11 Pro from YouTube. So this video is not in 4K if you're watching on an iPhone. Sorry about that. Apple has also updated the audio on the iPhone 11 and iPhone 11 Pro, with something they're calling spatial audio. It's basically a surround decoder. If you're watching a Netflix movie with Adobe 5.1 sound or game encoded in 7.1, you'll get virtual surround from the stereo speakers. The iPhone 11s also support Dolby Atmos, which is a little silly for stereo speakers, but it's there. There's also standard wide stereo support like last year for everything else. All in all, the iPhone speakers sound really loud and generally better than ever. There's no more 3D Touch on the iPhone 11 Pro, it's been replaced by what Apple calls Haptic Touch, which is basically just long pressing on things with haptic feedback. In most places, you won't really notice it's gone and some things are actually a little easier to figure out. Opening the camera from the lock screen feels the same to me. Rearranging icons on the home screen is a little simpler to figure out since there's a context menu that pops up now. Peeking at links in Safari is a little different in iOS 13, but it's also a little simpler. The only place I truly missed 3D Touch was the keyboard. You could press down anywhere on the keyboard to move the cursor around on the XS, but with Haptic Touch on the iPhone 11 Pro, you can only press and hold on the space bar. Now, I never really realized how many times a day I used that one specific 3D Touch feature and I missed it. But if the trade-off is that there's more room inside the case for a bigger battery, I'm fine with it. Apple claims the iPhone 11 Pro lasts four hours longer than the iPhone XS, and that the iPhone 11 Pro Max lasts five hours longer than the XS Max. As I mentioned earlier, it's really hard to test those claims. Apple doesn't run a strict battery test that we can just repeat. Instead, it's getting that number by taking its huge data set of iPhone usage and applying it to a model of the new phone. So you'll notice that the only hard numbers Apple publishes are like hours of video playback. Simple tests of a single task, which isn't how anyone uses a phone. All that said, the battery life on the iPhone 11 Pro has been impressive. I've been using an 11 Pro Max as my primary phone for the past week, and it has consistently run for 12 to 14 hours on a single charge. And about 10 hours of screen-on time, off the charger, is reported in battery settings. That is a huge improvement over my XS Max, which generally runs for eight to nine hours on a single charge. The smaller 11 Pro has been just as impressive. That's the phone Becca used for her testing and it still had 50 percent of its battery left the morning after she shot her part of the review. It turns out a slightly thicker phone with a bigger battery was the right move after all. Inside the new iPhone 11 Pro, there's the new A13 Bionic processor which, as usual, benchmarks far above the competition. There's a lot of headroom here for things like AR, games, and high-end photo and video apps, but it's not like the A12 Bionic in the iPhone XS is slow. Most of this extra power will be useful towards the end of this phone's life, not the beginning. Face ID is a little bit faster and works at more angles, but it's not particularly dramatic, it just works a little bit better. I think this is the best kind of iterative update. It made a thing that was already pretty good a little bit better, and anything that makes securing your phone a little bit better is great. And most intriguingly, there's a new chip inside the iPhone 11, it's called the U1, which does precise positioning using an ultra wideband radio. Apple says the forthcoming iOS 13.1 update will allow you to just point the phone at another U1 device to put it at the top of your AirDrop list. But none of that works yet, so we'll just have to see. (calming music) Obviously, the iPhone 11 Pro runs iOS 13 and I have to tell you, iOS 13 is pretty buggy. I saw all kinds of glitches and crashes during my week of testing, and iOS 13.1 is already in beta and scheduled for wide release by the end of this month. So it really seems like Apple just squeaked this thing out the door and is racing to fix bugs. I asked Apple about some of these glitches and they told me they're always fixing bugs and iPhone owners generally auto update. But if you're on the fence about upgrading, you might want to wait until some of these bug fix updates actually ship. Assuming all the bugs get fixed, the biggest new feature in iOS 13 is Dark Mode, which is very nice. But otherwise, this is a lot of tiny little updates. There's a swiping keyboard now. Reminders is a much better app. There are better photo editing tools and you can edit videos as well. Apple Maps keeps getting a tiny bit better every year. Siri's voice is slightly smoother. It's a lot of little things that add up into a big update, but if you handed this phone to someone using iOS 12, they might not even notice unless Dark Mode was on. The iPhone 11 Pro starts at $999 with 64GB of storage, which doesn't seem like quite enough for that price. And the 11 Pro Max starts at $1,099. You can spec the Pro Max all the way up to $1,449 with 512GB of storage, which means that you can pay an awful lot of money for this phone if you want to. If you're in the iOS ecosystem and it's time to upgrade, it's a pretty tough choice this year. The standard iPhone 11 offers almost everything you get from the Pro for $699. And I think most people should get the iPhone 11. You'll still get the improved main camera, the fun new ultra-wide lens, the A13 processor, and iOS 13, and all the rest. The extra money for the Pro basically buys you a far superior display, a telephoto camera, and improved LTE performance. And if you want a smaller phone, the iPhone 11 Pro is a little bit smaller than the iPhone 11, which seems a tiny bit unfair to people who want a smaller phone. The entire lineup is still pretty big, though. So if you're hoping for something to replace that aging iPhone SE, you're not going to love any of these options. I'm very picky about displays and cameras, so I'm going to get an iPhone 11 Pro. In fact, the cameras on the iPhone 11 and 11 Pro are so improved that I think they're worth the year-over-year upgrade from last year's models for the first time in a long time. Add in the improved battery life and the iPhone 11 Pro stands out as a major step forward from the XS and one of the best flagship phones of the year. Or it will be, when Apple fixes iOS 13. Hey everybody, this was obviously the iPhone 11 Pro review. We also reviewed the iPhone 11, that was a fun collab we did with Dieter Bohn. Watch both videos, they're both on the channel, and then let me know which of these phones you think you're going to buy or if you're waiting for the Pixel 4.",
    "transcript_keywords": [
        "iPhone",
        "Pro",
        "Apple",
        "Pro Max",
        "Pixel",
        "camera",
        "Note",
        "phone",
        "Pro display",
        "cameras",
        "Max",
        "smart HDR",
        "Pro review",
        "Pro Max starts",
        "phones",
        "HDR",
        "basically",
        "video",
        "phones Pro",
        "Pro phones"
    ],
    "transcript_entity_values": [
        "Dark Mode",
        "hours",
        "Android",
        "1,099",
        "three",
        "iPhone XS",
        "a couple of years",
        "XR",
        "GB",
        "Safari",
        "U1",
        "every year",
        "A13",
        "U1",
        "iMessage",
        "iPhone X",
        "Bionic",
        "4K60",
        "the iPhone 11 and",
        "24mm",
        "iOS 12",
        "Second",
        "iOS 13",
        "the iPhone XS",
        "USB",
        "Pixel",
        "the XS Max",
        "Google",
        "50 percent",
        "Nilay",
        "Samsung",
        "12 to 14 hours",
        "New York City",
        "this year",
        "China",
        "5W",
        "WhatsApp",
        "1,200",
        "Mariya Abdulkaf",
        "Netflix",
        "my week",
        "first",
        "Mariya",
        "18W",
        "Dolby Vision",
        "a ton",
        "Chinese",
        "10",
        "100 percent",
        "four hours",
        "699",
        "11",
        "WeChat",
        "the iPhone XS",
        "last year",
        "five-hour",
        "64GB",
        "midnight",
        "four-hour",
        "the iPhone 11",
        "the past week",
        "LTE",
        "AirDrop",
        "Pro Max",
        "US",
        "12 megapixels",
        "512",
        "eight to nine hours",
        "Becca",
        "the end of this month",
        "Adobe",
        "13",
        "Apple Maps",
        "XS",
        "XS Max",
        "4",
        "The XS Max",
        "later this year",
        "4K60",
        "the year",
        "First",
        "a minute",
        "Deep Fusion",
        "13.1",
        "the morning",
        "one",
        "Apple",
        "four",
        "999",
        "iPhones",
        "7.1",
        "A13 Bionic",
        "about 10 hours",
        "up to 15 percent",
        "the Pixel and Note",
        "Europe",
        "XS",
        "the iPhone XS",
        "years",
        "YouTube",
        "3",
        "five hours",
        "Siri",
        "Dieter Bohn",
        "Dolby Atmos",
        "iPhone 11",
        "up to $1,449",
        "iPhone",
        "iOS 13",
        "the third year",
        "last year's",
        "seven",
        "iPhone SE"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "EVENT",
        "QUANTITY",
        "LAW",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "TIME",
        "GPE",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "EVENT",
        "DATE",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "EVENT",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "NORP",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "PERCENT",
        "ORG",
        "LOC",
        "ORG",
        "FAC",
        "DATE",
        "GPE",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "EVENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.08080219477415085,
        -0.02577720396220684,
        0.05267591401934624,
        -0.07876305282115936,
        0.09609993547201157,
        -0.010359112173318863,
        -0.009209517389535904,
        0.12331586331129074,
        0.040759384632110596,
        0.06647109240293503,
        0.008687097579240799,
        0.03785373270511627,
        -0.037509482353925705,
        0.044771015644073486,
        0.041815903037786484,
        -0.027425235137343407,
        0.14868657290935516,
        -0.10203402489423752,
        -0.07477737963199615,
        -0.023405997082591057,
        -0.034886859357357025,
        -0.021209511905908585,
        0.1445256620645523,
        0.02348926104605198,
        0.012863117270171642,
        -0.019844572991132736,
        -0.101787269115448,
        -0.057599738240242004,
        -0.047264933586120605,
        -0.004125549923628569,
        -0.0313042514026165,
        0.06686009466648102,
        0.03676070645451546,
        0.012999952770769596,
        -0.021176379173994064,
        -0.13200169801712036,
        0.03858014568686485,
        -0.014943422749638557,
        -0.03578207641839981,
        -0.005520480684936047,
        -0.04468395188450813,
        -0.005251406691968441,
        0.0037362200673669577,
        0.03839903324842453,
        0.03601180762052536,
        -0.03668111190199852,
        0.059487491846084595,
        -0.04426237568259239,
        -0.0034046429209411144,
        -0.013959948904812336,
        0.013728595338761806,
        -0.050958652049303055,
        0.00039447876042686403,
        0.0449250303208828,
        -0.06815817952156067,
        0.03370849788188934,
        -0.050763025879859924,
        -0.011840769089758396,
        0.11502838134765625,
        -0.003422818146646023,
        0.059380903840065,
        -0.027868859469890594,
        -0.012435792945325375,
        0.05559425428509712,
        -0.012716198340058327,
        0.036152102053165436,
        -0.05882086604833603,
        0.003512428607791662,
        0.016141051426529884,
        -0.00388331594876945,
        -0.008771668188273907,
        0.06843633204698563,
        0.08978096395730972,
        -0.013336661271750927,
        0.03996247425675392,
        0.04093806818127632,
        0.08593402802944183,
        -0.023974236100912094,
        -0.08536973595619202,
        -0.028507204726338387,
        0.08358275145292282,
        -0.03920948505401611,
        -0.039030760526657104,
        -0.047903839498758316,
        0.08085661381483078,
        -0.05881586670875549,
        -0.01421193964779377,
        0.06327831000089645,
        -0.07090727984905243,
        -0.08206584304571152,
        -0.060202620923519135,
        0.09987066686153412,
        -0.04827192798256874,
        -0.03815696761012077,
        0.0161324143409729,
        0.01998572237789631,
        -0.06042193993926048,
        -0.1268802434206009,
        -0.06431195884943008,
        -0.014272822998464108,
        0.03880246728658676,
        -0.02726881206035614,
        0.04099511355161667,
        -0.0186600424349308,
        0.015507636591792107,
        -0.06911464780569077,
        -0.051377683877944946,
        -0.00511150062084198,
        0.0488022118806839,
        0.10422088205814362,
        0.006858514621853828,
        0.0064288037829101086,
        -0.09095897525548935,
        -0.00887555442750454,
        0.007831806316971779,
        0.010045533068478107,
        -0.027005279436707497,
        0.07722240686416626,
        0.15508286654949188,
        -0.00020714692072942853,
        -0.0028430852107703686,
        0.00021907278278376907,
        -0.07752019166946411,
        -0.036562416702508926,
        -0.019023744389414787,
        0.016394538804888725,
        -0.03598148748278618,
        2.0932900342305975e-33,
        0.03714384138584137,
        0.11378415673971176,
        -0.043691206723451614,
        -0.01710459403693676,
        0.023552965372800827,
        0.015300964936614037,
        -0.03306965157389641,
        0.05153505504131317,
        -0.0325423926115036,
        -0.002976003335788846,
        -0.011006825603544712,
        -0.03038022480905056,
        -0.0450446717441082,
        0.021233227103948593,
        0.06656303256750107,
        -0.06742879748344421,
        -0.057175781577825546,
        -0.008588946424424648,
        -0.04522228613495827,
        -0.0549749881029129,
        -0.008158767595887184,
        -0.07328953593969345,
        -0.0002465282450430095,
        0.02322291024029255,
        0.03668546676635742,
        0.013868230395019054,
        0.1050456315279007,
        0.04357706755399704,
        0.06781695038080215,
        -0.0038172644563019276,
        -0.0992400050163269,
        0.003455907106399536,
        0.05371113494038582,
        -0.014350458048284054,
        0.005610650405287743,
        0.05626135692000389,
        0.026816707104444504,
        -0.0370636060833931,
        0.02799350395798683,
        -0.058238446712493896,
        -0.08540612459182739,
        0.06930451095104218,
        -0.07720015943050385,
        0.0007746945484541357,
        0.08844640851020813,
        0.03294040262699127,
        -0.029998386278748512,
        0.005297218915075064,
        -0.025695132091641426,
        -0.014521255157887936,
        -0.05302442982792854,
        -0.03908385708928108,
        -0.050152163952589035,
        -0.0343642458319664,
        -0.08357620239257812,
        -0.025306418538093567,
        0.053445905447006226,
        -0.04833657294511795,
        -0.01392009574919939,
        0.002182343741878867,
        0.003695700317621231,
        0.02150052599608898,
        -0.06693149358034134,
        0.062183428555727005,
        -0.08366088569164276,
        0.05453669652342796,
        -0.005349826067686081,
        0.04448403790593147,
        -0.07232090085744858,
        0.11818866431713104,
        -0.03875260800123215,
        -0.02439335361123085,
        0.020138883963227272,
        -0.029519442468881607,
        0.06513475626707077,
        0.056845344603061676,
        -0.021774766966700554,
        -0.060570720583200455,
        -0.009669914841651917,
        0.08368808031082153,
        -0.049700576812028885,
        0.04635025933384895,
        0.01983770914375782,
        0.03957703709602356,
        0.00048175512347370386,
        -0.0335686169564724,
        -0.05054686218500137,
        -0.014724979177117348,
        0.006468767765909433,
        0.08521665632724762,
        0.01759411208331585,
        0.022899571806192398,
        0.05761896073818207,
        0.05711078271269798,
        -0.058737900108098984,
        -3.7841657405045086e-33,
        -0.06536053121089935,
        -0.025406181812286377,
        -0.050023410469293594,
        -0.010931846685707569,
        -0.012591736391186714,
        -0.07845336198806763,
        0.030484464019536972,
        0.027606593444943428,
        0.028539855033159256,
        -0.03948536142706871,
        -0.018916618078947067,
        0.01900453120470047,
        -0.033152949064970016,
        0.05981401354074478,
        -0.04018189758062363,
        -0.0579051673412323,
        -0.02694881334900856,
        -0.11983568221330643,
        0.05051422491669655,
        0.0073776040226221085,
        0.08239821344614029,
        0.01819349080324173,
        0.00297926994971931,
        0.005496429279446602,
        0.0051108067855238914,
        0.01736149564385414,
        0.037364665418863297,
        0.05289449542760849,
        0.025715963914990425,
        -0.08353006094694138,
        -0.039672356098890305,
        -0.08428220450878143,
        -0.029089633375406265,
        0.04302993789315224,
        0.041452985256910324,
        0.08761192113161087,
        0.01041290070861578,
        -0.09122134745121002,
        -0.010026169940829277,
        -0.0005829705623909831,
        0.04470968246459961,
        0.03042392060160637,
        0.01683877408504486,
        -0.06085050106048584,
        -0.013431914150714874,
        -0.008811417035758495,
        -0.01973401941359043,
        0.06172332540154457,
        -0.03211219236254692,
        0.059481821954250336,
        -0.013452540151774883,
        -0.0026020046789199114,
        -0.0213165283203125,
        0.008388666436076164,
        -0.05867459997534752,
        -0.019468914717435837,
        0.014675211161375046,
        -0.0015375411603599787,
        0.012296140193939209,
        0.01422366127371788,
        0.06527353078126907,
        0.07645709812641144,
        -0.07955170422792435,
        -0.033984389156103134,
        -0.07840228825807571,
        -0.015617374330759048,
        0.06881209462881088,
        0.008571282029151917,
        -0.0024041866417974234,
        0.04936526343226433,
        -0.02735344134271145,
        -0.0017897699726745486,
        -0.048413146287202835,
        -0.06683772057294846,
        -0.01869926042854786,
        0.038124408572912216,
        -0.03339413180947304,
        0.010016430169343948,
        -0.03697586804628372,
        -0.043702900409698486,
        0.026557255536317825,
        0.032260823994874954,
        0.04868573322892189,
        -0.0037569431588053703,
        0.11354678869247437,
        0.05662826821208,
        0.03129775822162628,
        0.022161437198519707,
        0.007515970151871443,
        0.07452856749296188,
        -0.03715769946575165,
        -0.013484599068760872,
        -0.0705268606543541,
        0.05097447335720062,
        -0.024792505428195,
        -5.143218828607132e-08,
        0.022500738501548767,
        0.007346117869019508,
        0.045185741037130356,
        -0.061801012605428696,
        0.023855913430452347,
        -0.09199285507202148,
        0.021969538182020187,
        0.04751273989677429,
        0.10128936171531677,
        -0.01950305886566639,
        -0.005726086441427469,
        -0.05106723681092262,
        -0.0914246141910553,
        0.0861693024635315,
        0.026419201865792274,
        0.057837072759866714,
        -0.010604659095406532,
        -0.01570752076804638,
        0.013945831917226315,
        0.007114631123840809,
        -0.02424832060933113,
        0.021943220868706703,
        0.01619527116417885,
        -0.06677079200744629,
        0.021288175135850906,
        -0.014256876893341541,
        -0.05802525579929352,
        -0.044935718178749084,
        0.05295850336551666,
        -0.009241762571036816,
        -0.035780228674411774,
        0.017101215198636055,
        -0.019740154966711998,
        -0.0641096755862236,
        -0.027983995154500008,
        -0.04962506145238876,
        0.02714063785970211,
        -0.00529899075627327,
        0.06868670135736465,
        0.025039218366146088,
        0.025104546919465065,
        -0.06427311897277832,
        -0.03528361767530441,
        0.033484820276498795,
        -0.01730429194867611,
        -0.10315826535224915,
        -0.012345751747488976,
        -0.11486157029867172,
        -0.013499146327376366,
        0.052704934030771255,
        -0.07361891865730286,
        -0.07978303730487823,
        0.03421159088611603,
        0.004424562677741051,
        0.00847665686160326,
        -0.016461841762065887,
        0.04483957216143608,
        -0.04384421557188034,
        -0.0716324895620346,
        0.07958170771598816,
        0.11351797729730606,
        -0.051731936633586884,
        -0.011176404543220997,
        0.110011525452137
    ]
}