{
    "id": "iNnVlWPqHQc",
    "title": "We grew more than just pumpkins this year...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-10-15T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=iNnVlWPqHQc",
    "category": "Howto & Style",
    "tags": [
        "Accessible garden",
        "cambry kaylor",
        "garden update",
        "off grid solar",
        "gravity drip system",
        "raised garden",
        "raised flowerbed",
        "raised vegetable beds",
        "planter box",
        "garden",
        "how to garden",
        "wheelchair accessible garden",
        "how to build a flower bed",
        "solar",
        "farming",
        "sustainable living",
        "off grid",
        "homestead"
    ],
    "views": 4918433,
    "likes": 153442,
    "comments_count": 13605,
    "description": "The JerryRig Family just got one little person larger. Join us this year as we grow our whole garden, and one tiny human ;-). The large accessible garden is something weve been doing every year This is the video where we built it:  and this is the video were we planted this spring in 2021:   Here is the off Grid solar panel video:  And here is Cambry's story:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/e3HFRlrQxH4",
        "https://youtu.be/gM_Jm_6tqEQ",
        "https://youtu.be/UnTJScmSLYs",
        "https://youtu.be/ILCDfIBn1fw",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Music playing] Maybe... [coughs] (Cambry laughs at me) Welcome to the garden update 2021, and this time around vegetables aren't the only thing that we're growing. -Yeah. Our vegetables are 5 weeks along, and I'm 23 weeks along. -I don't know much about babies, but I think we're like halfway there? -We're a little over halfway. -And she should finish cooking the baby...what's a better way to say that? -The baby's due in October. -Which is about the same time that we should be harvesting all the vegetables. So we are multitasking in this video. Shall we get started? -Let's get started. [Intro] A lot has happened in 5 weeks. You can see that the pumpkins and the corn have been growing quite a bit. And our water collection is still performing marvelously except for that it hasn't rained since I built it and it's been about 4 weeks since I installed it. If you remember, the water comes along here, comes down, goes in through that little curve right there, and fills up this massive water tank. This has just been filled with a hose for right now, and I'm really hoping at some point we get some rain because that was kind of the whole point. But as far as watering the garden goes, my mom suggested that we water once every other day for 90 minutes. So that's what the timer is set at and every other day. The drip system just runs for 90 minutes. And right now we just have this finger and that finger set up with the drip lines because we were just experimenting with how much water we actually need. And, now that these other fingers are growing we'll install the drip lines over here...probably next week. -So over here we've planted some of the peppers. They're growing nicely. New to our garden this year is melons. We've got some cantaloupe over there. We've got some rogue watermelon from last year that jumped a finger and came up over here. -Normally they are supposed to be over here, but for some reason... -We think these are from last year, just seeds that maybe a bird dropped. So we kind of missed the harvest season for the asparagus. We kind of let them overgrow, so they are re-seeding. They are done for the season already, and then next year I think I'm going to transplant them to another area so we can do all corn. -So this is what an asparagus looks like if you just let it keep growing. -Like a Charlie Brown Christmas tree. -Massive. The one thing that's probably ready to harvest right now is this spinach. And I think the only thing that didn't pop up, Cambry, what was it? -I planted some basil in here and we just planted too late and then we got really hot weather so it didn't show. They're dead. -It should be an interesting year. And this video will document the progression we're having with both the garden and with Cambry. So it is week 6 for the garden and week 24 for Cambry. We did a couple things this week. We finished laying out the rest of the drip system, and we had a little bit of rain. The rainstorm was about 15 or 20 minutes long, and we got about 5 inches worth of water which equates to about 150 free gallons that we can now use when it's not raining here in the garden. -New developments include 2 zucchinis that are growing on the one plant in the back. And we've got probably 6 or so flowers on the pumpkins. -The corn is doing great and the pumpkins are expanding their territory a little bit again, but this year we're going to keep it a little more under control. Hopefully just having them spill off onto this side where the pumpkins can grow, and leaving this side empty so Cambry can still go in and out. -It's a little less crazy. Way more managed this year. -So nothing too crazy this week. Mostly just the rain system getting set up and we've had a couple bits of lettuce. Other than that we're still waiting for the harvest, for the big things like the pumpkins and the watermelons. -Thanks for watching...oh no! -Not in the middle of the year! -Sorry, sorry! -The video's got a long way to go. So it is week 7 for the garden, and week 25 for Cambry. How's the garden doing? How are you doing? -I'm doing great. Just feeling plump. The garden is going really well. This is our first harvest. It is a big old zucchini. Not as big as last year, but I'm going to take them off the vine a little sooner. And then over here our pumpkins are growing like crazy but they're just not as big as last year because we only have three plants...six plants. -The pumpkin plants look a little sad right now. I think they might not be getting enough water. So I've taken our little drip system and cranked it from 90 minutes to 120 minutes. So it should be 2 hours worth of watering instead of an hour and 30 minutes, and that's still happening every other day. I might need to bump it to every day because it is regularly getting over 100 degrees out here, which is pretty hot for the plants. -Okay other new developments are our watermelons are growing like crazy. I'm going to try to keep them in the bed this year. But check out...it's really teeny. There's a baby watermelon in there. -Nice. Good. -I'm sure there's more in here, it's just really lush. And then our potatoes look like they're doing alright. They look like they might need a little more water, but they look happy to me. Our melons are new and they are just as wild as our watermelons right now. I think our peppers have doubled in size since last week. We did plant them a little late so it'll be hard to tell. -And our carrots are coming up quite nicely. We planted a lot more of them, but we'll take what we can get. And lastly, one kind of interesting thing that I don't think I showed last week is that we do have some chickens, but we had a problem where they were eating their own eggs which is kind of a weird situation. But one cool thing my dad did was he built this little shelf where the eggs, once they're laid, can just roll out from under the chickens and it keeps the eggs away from the chickens. I never knew that chickens could be cannibalistic like that, but luckily my dad has a solution. And that it is. Garden production is in full swing. We'll see you next week. A lot has happened in two weeks. Cambry, how far along are you? -27 weeks! -And how are things for you? -Great this week. Just looking forward to baby coming. Not so soon, but one more trimester. -First trimester was a little bit rough. Second trimester was great. We are just starting third trimester so we'll see how that goes. It's been two weeks. We've had a lot happen. Cambry, do you want to show off the new developments? -So we have tons of new pumpkin vines, and a lot of flowers. Not so many pumpkins over here, but we do have one hanging out in the corn. I'll show you. -Oh wow. That's a big boy. How did we not see this guy before? Dang. Cuz if you remember, we planted the big pumpkins along the far side, and regular pumpkins along this close side. -I love that we have so many bees back here. -You can hear them buzzing. One thing we have had a problem with...if you remember we installed a drip system. Well, one half of our drip system's battery died. I'll give you a guess as to which half of the garden that was. You can see it kind of stunted the corn's growth before we realized that the battery was dead. And one thing that's super unfortunate about these timers is that if I ever do want to set the timer, let's say I want it every other day for 60 minutes, I can hit go on the timer but it doesn't start right away. It starts in two days and then goes for 60 minutes, which makes it super not easy to test out different settings on the timer. So we've been hand watering the garden for the last two weeks to hopefully help the corn catch up while I try to find a different drip system or drip timer to finish watering our plants. -The watermelons are my favorite right now because look how cute they are. Like they are just super cute and they are all over the place. Another one there, a couple on the ground. I'm sure there's much more in there. So exciting development. It's like a little, I don't know, like soccer ball. -Right we have so many. And so far Cambry is still able to get through all the aisles. -Yeah. Melons are creeping in though. -Any cantaloupes? -Yeah, actually right here. -Oh wow. Everything's growing. -They are overtaking our peppers, so a little worried about them, but they are blooming so hopefully we get some peppers. You can see pepper plants in the middle here. -I'm excited for that. And our corn. Check that out. Dang. These guys are getting big. Hopefully the little guys start making corn as well. We've probably gotten like, what, seven or eight zucchinis. Zucchinis pump out fruit, is it a fruit, like no tomorrow. So yeah we have plenty of zucchinis. That's it for this week. See ya next week. Dang girl, how far along are you now? -I'm third trimester. -How are the horses? -They are messy. I gotta clean out their stall. -Sweet. Should we check out the garden? -28 weeks. -How are you feeling? -Slow. -Well you're looking great. How's the garden doing? -It's doing really well. -I think I saw a little pepper over here. Let's check it out. So is this a green pepper or a jalapeno? -I don't know. I can't remember. -It looks kind of a like a jalapeno. The pants are definitely bigger than last year. -They're happier for sure. -The corn is doing good except for I think these need to be black right? Cambry says that once the ends get dark like this they are ready for consumption. I think we need to wait for them to get a little bit bigger, but we can...we'll find out. Isn't that right. And then I have still not found a better drip timer yet. So we're still watering things by hand. I will try to find a better drip timer, but we've been kind of busy the last couple weeks. But as you can see, the corn is still a little bit stunted when compared to the corn that had a drip timer that, you know, the battery didn't die. And I think that the pumpkins got a little stunted as well when it went about a week or so without water in 100 degree temperature. But we do still have pumpkins growing which is good. We are 29 weeks. And many things are happening with the garden as well as Cambry. We'll get back to her in a second. The pumpkins are once again kind of overtaking. They've recouped from their dehydrated broken timer situation, which I do have another timer coming so hopefully next week we have that system back up and running. But we have one pumpkin plant kind of crawling up through the corn, and another pumpkin plant trying to make its way into the neighbor's yard again. It's got a couple more feet to go. If you remember last year we had a pumpkin plant go all the way over and leave a pumpkin in the neighbor's dog pin. So hopefully that doesn't happen again this year. -Okay, so this is our first year growing melons. I think they're cantaloupe. Maybe it's honeydew. But they are looking really nice. And some of them are even hanging off the edge. Probably going to try them next week. On that side of the garden there are some jalapenos And then I have bell peppers coming in over here. So this big plant is a bell pepper plant. And then this plant down here also has one. -We're making progress. And how are you feeling? -Great. Thought I wasn't going to be because we're third trimester, but feeling great. -So we came across a little bit of a problem. A large windstorm came and blew over the tall stalks so now they are horizontal. And I think they're supposed to be more vertible. -And the corn on there looks thrashed. -Tell us how you're doing. -I am not thrashed. I am huge. Actually, baby is the size of one of these melons this week at 30 weeks. Find the largest one. Found a cantaloupe this week. Nice. -Maybe. So tell us how you're feeling. What's hard for you? -Transfers are getting harder, especially at the end of the day when I don't have very much energy. But other than that just chugging along. -Is it harder or easier than you thought? -Oh it's way easier than I thought. I thought at this point I would be like bed ridden. So this is way better. -Things are progressing. Our garden is not doing as good this year as it was last year, probably because we just haven't put as much time into it. But we're still enjoying it. I have installed the new timers which I do like more. They feel just higher quality and so far they haven't let us down. So now instead of watering manually, the drip system is taking over again. And we'll see how that goes. -Tonight's kind of fun because we're making tin foil dinners with items from our garden. So the carrots and the zucchini are chopped up and put in tinfoil with some chicken and potatoes. -Not those chickens. -Not those chickens! No. And they are in the oven right now. So we'll taste them later. -Not every corn is perfect, but they still taste good. 31 weeks for the lady. -And the baby. -How are you feeling? -Feeling really good. -What's new? -Getting dressed is a little bit harder than it was last week. I don't know. Bumps a little bigger. That's about it. -She is crushing third trimester though. Our garden...it gets really hot. I don't...we can't blame it. Let's talk. So I did install the drip system again, so this is now watering itself. We haven't watered ourselves for maybe 5 days now. It's just been dripping, which is great. And so far it looks like it's working. I mean the soil is still damp. So this went off this morning, and I would say, I mean the soil is deep, inches deep down in there, so the water is getting where it needs to be. We have picked all of the corn and eaten it. Now we have watermelons though which Cambry's excited about. -We're going to try one tonight. -So how do we know if it's ready or not? -Okay so the Internet says there's this little leaf that's near the stem that should be shriveled up, which it is. And then underneath it should be kind of like a yellowish color. I've kind of already turned it over a little bit under the belly. -So is this the leaf you're talking about? -Yeah. -And then you said it's yellow around the bottom. -Yeah. -This is true. Shall we? -Yeah. -Okay. Sounds hollow. No, sounds solid. Is that what it's supposed to be? It has sounds. Let's chop it open. Is that about how big the baby is? -No, baby's not this big. Baby's the size of one of those. -Can we grab one of these too just in case? -I don't know if they're ready yet. Maybe next week. -I mean it looks good on the outside. Oh wow. This might be our best one yet. Oh it smells good too. -Ooo, the seeds are black even. This is our best one yet, for sure. It's so juicy. -That is great. I think we should put it in the fridge for a little bit so it's cold. -We win. -Nice. Alright, what week are you babe? -32. -Nice. How you feeling? -Pretty good. -How's the garden doing? -It is maxing out in certain areas. So our corn is done, and right now I'm starting to harvest a lot more of the cantaloupe. Our melons are ready. -The drip system is doing well. We had a massive rainstorm which pretty much filled up our whole tank. Kind of made me a little nervous because I never did finish that drain spout so it would have just overflowed right into our barn. Luckily it didn't get that full. But the drip system has been working for the past two and a half weeks or so and everything is still green obviously, except for the corn which is on its way out. Significantly less pumpkins than last year but at the same time we did plant about half as many and they aren't taking over, you know, half the space anymore which is nice. -These are our jalapenos and there are a ton of them this year. They're just like going crazy. I could probably pick 10 of them right now. -Jalapeno fell off while I was touching it. I guess that means I have to eat it. Definitely tastes like a pepper. And now the jalapeno's kicking in. For some reason it tastes kind of like a green bean. No, sweet pea. I don't know why. Well I mean it's hot, but there's also the sweet pea side of it. This jalapeno tastes like 60% sweet pea, 40% jalapeno Slightly bigger. Maybe...[coughing]...Oh my gosh! I don't think the seeds are ready in that last one. Oh my gosh! -You got carried away. Yeah I was going to say that one was teeny, and that one is fully grown. -Alright, we have to...okay. -You going to finish it? -No way, not that one! -[Laughing] Oh my gosh. -Ok, let's finish up this video. -She's a beaut. So much bigger and better than last year. -I'm dying. See you next week. So today Cambry thinks it's time to harvest some cantaloupes, so we have this so we can taste it, as well as I think the potatoes are probably ready. And Cambry, how close are other things to being ready? -Oh our peppers we've been harvesting... -No, I'm talking about you! -Oh, 33 weeks. -Nice. How are you feeling? -Good, baby's been kicking a lot. Just getting excited for him to come meet us. -So should we try some cantaloupes? -Yeah, let's do it. Holy moly. -Would you like to do the honors? -It smells super good. Oh yeah, it looks so good. -Wow. -Yum. -Oh wow that is way soft. -Right? It might be a little too ripe. -Got yours? -Yeah. -Wow that is so juicy. -It's amazing. I think this is my favorite thing we've had from our garden. -I mean cantaloupe isn't usually my favorite thing, but for cantaloupe this is pretty good. -Like some of it is super good. Some of it's a little too soft. I think it's a little over ripe. -Well chickens like it. Wow they ate that whole thing. So I didn't know we were growing mushrooms. -Yeah, I didn't know they were growing either, mostly because our watermelon kind of took over the space, so I don't think our potatoes are going to be very good. -Oh hey. -There's a potato right there. Looks like it could be okay. -Oh that's a big boy. -Hello! What? -Wow! -Okay! Unusual shape. Yikes. I don't know. We didn't have a lot of luck with them last year. -That's a solid meal from just one plant though. -And I bet there's more down below. Here's another one. We didn't go big with the potatoes this year. -Still, that's pretty solid. Wow. Pumpkins are doing pretty good. That pumpkin back there is huge. That will be fun to take out. The pumpkins as well are, it looks like I might need to turn up the water on them a little bit more. I'll do that right now. So I will turn the watermelon dial from 90 minutes to 120 minutes. That way they can have a little bit more water. Our carrots are kind of also overflowing. But look at the color of these leaves because these are also purple carrots, which means if I pull this guy out, anticlimactic, but it's also a purple carrot. There we go, that one's better. -Whoa. Hello ladies. Would you like some carrots? They like the whole thing. One for you. Get it. Get it, girl. Or just take it. -So do the horses like to eat the whole carrot including the green stuff? -Even the green stuff. Get it all. These are tough carrots. -It's been a couple weeks. Cambry, how far along are you? -35. Feeling very large. Slowing down. Really slowing down. -How's the baby doing? -I think well. He's kicking lots. He's enjoying his time in there I think. -How's the garden doing? -The garden has seen better days. -It is not our best year. The pumpkins seem to be having some kind of like white mold on the leaves, which is not boding well for the plant. But we do have a lot of pumpkins that you can see through all of the dead leaves. That looks like a watermelon. But it's not just our pumpkins, our neighbors have pumpkins as well and they look the exact same. So it might be something with all of the pumpkin plants in our area. But the pumpkins are still alive and we're going to be picking them in a couple weeks anyway. The corn has been done for a long time. The zucchinis have been pumping out zucchinis for the last ever. They are invincible plants. -The peppers just keep popping. -And they are good. The green peppers are looking good. I think these are very ready. Oh wow, look at these. These are huge. I usually put some jalapenos in my little egg sandwich that I have most mornings since we have the chickens over there, and they are really good. Especially the seeds are super super hot as we saw earlier, but if I take the outsides of the jalapeno with just a couple seeds, the sandwiches are great. Today is October 4th and it's the final, it's the time we harvest the garden. How are you feeling? -Feeling like I'm ready to pop. -Which you almost are. Just a couple more days? -Two more days. -One of our chickens turned out not to be female. Deciding what to do with him. Anyway, this is the final garden update where we harvest everything. Not everything though. -We're harvesting this little guy in two days. -Harvesting...I don't know if that's the right word. -Evicting. -Evicting? That's a better word. So Cambry is getting induced, which means we know when she's going to have the baby. So we have two days, and today we're going to spend clearing out the garden, organizing the pumpkins, seeing what our harvest entails. It should be fun. -Okay, so I'm super shocked with how well our jalapenos did. I grew them all from seed and we just have so many still. Like an army of jalapenos...and bell peppers. I'm running out of room on my lap though. This is only half of them. -I think we forgot about this zucchini. Woops. Take a look at the size of this guy. Look at this. This one has like multiple vines coming out the top. This is our biggest one all year. Holy cow. Looks like we did have some pumpkins try to climb the tree a little bit. But, at least they're not in the neighbor's yard this time. -So here is our end of year harvest. Quite a few pumpkins, and actually these two big ones are over 50 pounds. Oh I'm making mental notes for next year. So only one type of watermelon next year, the oblong ones. A lot less cantaloupe More corn, and then if we do a couple varieties of pumpkin I want them to be in different places. Carrots again, and maybe two zucchini plants. -Yeah the carrots turned out really good. We had a bunch of them and the horses like those too. As far as updates on the watering situation, I think it worked out really well as far as the drip system goes. Like we didn't ever really water the garden by hand. But I would change a few things. Right now, as you remember, we have the big water tank put up on a scaffold, and it always makes me a little bit nervous, not that the weight can't hold it, but that Utah has a few earthquakes now and then and I'm not sure if it's earthquake proof. So I think I'm going to change that up. You'll have to wait for a future video on that one. Plus, inside of the white tank I thought that since it was inside the barn it wouldn't grow any green algae inside, but there is a little plastic window and a small amount would grow on one side of the tank which we don't want, especially if we're going to use the water to water the horses through the winter. The two solar panels are still working great, charging up our lawn mower and the rigs. I think the batteries are still like at 100% basically all the time. -Our fruit trees are doing fairly well except for one of them, the honey crisp looks like it's dead. It's crisp. -The rest are fine though. -Yeah. -And they did grow. So I think we'll trim them up a little bit next year and let them keep going. What happens next is going to take a couple days for us, but just a couple seconds for you guys. So Cambry, the garden is finished and what week is this little guy? -This is week zero. He's 5 days old. -What's his name? -Cyrus. Cyrus Nelson. -So I'd have to say this year is a little bit more fun than most. Harvesting the garden as well as... -A child... -Our own little guy. How are you feeling now? -Feeling lighter. A lot lighter. -Is it better to have him in or out? -Out! Yeah the first couple days were rough just figuring out a schedule, but last night was promising. -Do doesn't always look this angry. I think it's bright outside. -He did come out with a scowl. -Cyrus came out 7 pounds 12 ounces. And if we remember this pumpkin is about 50 pounds. And Cambry said I could make him a little crib out of this and he could just sleep in it, right? It's been a super fun year. We still have some projects we want to finish. Obviously putting pavers down so it's a little easier for the wheelchair to navigate. But yeah, we plan on doing this again next year. The garden itself is holding up really well. The redwood that we used for the frame has maintained its structural integrity. The color though is very different. If you go back and watch that very very first video when we built it, that color is like super red and vibrant and now it's a little more weathered. But I think it's fine. -It's doing its job. -Like I mentioned earlier, I am going to redo the watering for next year. Probably put a bigger tank on the ground and a smaller tank up top so we can keep watering the horses. But that sums it up for this year. Cyrus is probably a little too young to finish us off. But Cambry... -Thanks a ton for watching. We'll see you around. -Awesome.",
    "transcript_keywords": [
        "year",
        "garden",
        "week",
        "Cambry",
        "pumpkins",
        "weeks",
        "Good",
        "corn",
        "kind",
        "drip system",
        "drip",
        "bit",
        "water",
        "Yeah",
        "feeling",
        "pumpkin",
        "big",
        "growing",
        "thing",
        "system"
    ],
    "transcript_entity_values": [
        "a couple weeks",
        "-Which",
        "two",
        "October 4th",
        "about 4 weeks",
        "only one",
        "a ton",
        "this morning",
        "31 weeks",
        "100 degree",
        "the end of the day",
        "week 6",
        "first",
        "Christmas",
        "the season",
        "Charlie Brown",
        "2021",
        "only half",
        "6 or so",
        "the past two and a half weeks",
        "7 pounds 12 ounces",
        "just one",
        "mornings",
        "our first year",
        "this week",
        "60%",
        "October",
        "just a couple seconds",
        "a couple more feet",
        "about half",
        "a couple days",
        "maybe 5 days",
        "last week",
        "two weeks",
        "29 weeks",
        "this year",
        "last year",
        "weeks",
        "5 weeks",
        "third",
        "60 minutes",
        "90 minutes",
        "seven",
        "an hour and 30 minutes",
        "Utah",
        "about 5 inches",
        "one",
        "about 50 pounds",
        "tonight",
        "every other day",
        "-Maybe",
        "Cambry",
        "100%",
        "six",
        "three",
        "about a week",
        "2 zucchinis",
        "33 weeks",
        "2 hours",
        "5 days old",
        "half",
        "next year",
        "-He",
        "second",
        "20 minutes",
        "30 weeks",
        "one half",
        "what week",
        "One",
        "the first couple days",
        "over 50 pounds",
        "23 weeks",
        "all year",
        "about 15",
        "Cyrus",
        "the last two weeks",
        "two days",
        "the middle of the year",
        "zucchinis",
        "40%",
        "Second",
        "100 degrees",
        "next week",
        "10",
        "Cyrus Nelson",
        "last night",
        "week 7",
        "the last couple weeks",
        "today",
        "Today",
        "-Still",
        "90 minutes to 120 minutes",
        "about 150"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "TIME",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "DATE",
        "PERSON",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL"
    ],
    "vector": [
        -0.06356123834848404,
        0.09206242114305496,
        -0.03951844200491905,
        -0.05641698092222214,
        0.07283107936382294,
        -0.06609469652175903,
        0.08926188200712204,
        -0.012368741445243359,
        -0.013958950527012348,
        0.0935029536485672,
        0.11133530735969543,
        -0.051315780729055405,
        -0.04872981086373329,
        0.035024721175432205,
        0.004570775665342808,
        0.022622963413596153,
        0.0313691683113575,
        -0.0162094347178936,
        -0.05345645919442177,
        0.09938207268714905,
        -0.02149619348347187,
        -0.010958279483020306,
        0.032669562846422195,
        -0.015071741305291653,
        -0.03560521826148033,
        0.04118287190794945,
        -0.08735127747058868,
        0.06872635334730148,
        -0.0940931960940361,
        -0.09534630179405212,
        0.04888569563627243,
        0.08699969947338104,
        -0.021981004625558853,
        0.006745316553860903,
        0.09966692328453064,
        0.07080625742673874,
        0.02810337208211422,
        -0.01021050475537777,
        -0.006777606904506683,
        0.016507238149642944,
        0.007907606661319733,
        -0.09097588062286377,
        0.0302231814712286,
        -0.048155851662158966,
        -0.07129622250795364,
        0.02313145622611046,
        0.02650194615125656,
        -0.07752207666635513,
        0.05007140338420868,
        -0.06263624876737595,
        -0.08190029859542847,
        -0.02123957686126232,
        0.029300734400749207,
        -0.06467314064502716,
        -0.01783275417983532,
        -0.018457049503922462,
        -0.012599729932844639,
        -0.0046868957579135895,
        0.0010584067786112428,
        -0.03781887888908386,
        0.062251728028059006,
        -0.03121274895966053,
        -0.06904245167970657,
        0.08499041199684143,
        -0.039459023624658585,
        -0.04980125650763512,
        0.007137286011129618,
        -0.10192519426345825,
        -0.0554361455142498,
        -0.07626218348741531,
        -0.07576436549425125,
        0.025297492742538452,
        -0.035675909370183945,
        -0.004377823788672686,
        -0.034594252705574036,
        0.03252721205353737,
        0.026843048632144928,
        0.056258298456668854,
        0.05707437917590141,
        -0.02440129965543747,
        0.06461852788925171,
        0.0305497907102108,
        0.02609412930905819,
        -0.008423919789493084,
        -0.04580752179026604,
        0.12471547722816467,
        0.013276299461722374,
        0.11189345270395279,
        -0.016517912968993187,
        -0.004106792621314526,
        -0.034620679914951324,
        0.0192535649985075,
        0.006498831324279308,
        0.048057008534669876,
        -0.04122762009501457,
        -0.06369835138320923,
        -0.0827091857790947,
        -0.1425543576478958,
        -0.07450512051582336,
        0.06748069077730179,
        0.025190580636262894,
        -0.029339076951146126,
        0.03970304876565933,
        -0.016845885664224625,
        0.05478604882955551,
        -0.0057629188522696495,
        -0.10011471062898636,
        0.049768365919589996,
        0.07022060453891754,
        0.00713378144428134,
        -0.009791168384253979,
        0.05864420905709267,
        -0.06848806142807007,
        0.014208192937076092,
        0.04322316125035286,
        0.030508069321513176,
        -0.047347985208034515,
        0.008920224383473396,
        0.075410857796669,
        -0.05300493165850639,
        0.09890323132276535,
        0.0003556687443051487,
        -0.036998044699430466,
        0.0794496014714241,
        0.04799189791083336,
        0.015391516499221325,
        -0.010962856002151966,
        2.2211496567954916e-33,
        0.0729232057929039,
        0.16685260832309723,
        0.06173541769385338,
        0.023639757186174393,
        0.03141346573829651,
        0.03313154727220535,
        0.011408135294914246,
        0.07272854447364807,
        -0.06396627426147461,
        -0.019498033449053764,
        0.00044484567479230464,
        -0.018866606056690216,
        0.014823483303189278,
        0.019245462492108345,
        0.04579458758234978,
        -0.032174937427043915,
        -0.06075526773929596,
        -0.013625617139041424,
        -0.009675777517259121,
        -0.015696795657277107,
        -0.06937482208013535,
        -0.026286976411938667,
        -0.022619998082518578,
        0.08159948885440826,
        0.08620958030223846,
        0.020544778555631638,
        0.07141134142875671,
        -0.040932223200798035,
        0.015374797396361828,
        0.02204205095767975,
        -0.006977194454520941,
        0.017070241272449493,
        0.06343192607164383,
        0.037491217255592346,
        -0.03340720012784004,
        0.015107745304703712,
        -0.03248816356062889,
        -0.11839378625154495,
        -0.09595057368278503,
        -0.01721029169857502,
        -0.005246073938906193,
        0.032493956387043,
        0.005536030977964401,
        -0.017169704660773277,
        0.008341473527252674,
        -0.06042703613638878,
        0.03675132617354393,
        0.046799130737781525,
        -0.055629730224609375,
        0.01985127106308937,
        0.01875624619424343,
        0.010745792649686337,
        0.03836122527718544,
        -0.06409213691949844,
        -0.08270689845085144,
        0.017055153846740723,
        0.007626088801771402,
        -0.03038114123046398,
        -0.01235909853130579,
        0.011276365257799625,
        0.01949179358780384,
        -0.028221532702445984,
        -0.029470328241586685,
        0.00302084325812757,
        -0.09755082428455353,
        -0.020631656050682068,
        0.012541651725769043,
        0.0635434091091156,
        -0.05421905964612961,
        0.055450621992349625,
        -0.00964033231139183,
        -0.010281315073370934,
        0.042465612292289734,
        -0.06841584295034409,
        0.01041661947965622,
        0.027303460985422134,
        -0.03869117796421051,
        0.017032388597726822,
        0.0038025444373488426,
        0.00992191769182682,
        -0.030347762629389763,
        0.005778867285698652,
        0.06253551691770554,
        -0.04135874658823013,
        -0.061092276126146317,
        -0.10531862080097198,
        0.0078108785673975945,
        0.03040330484509468,
        0.0033052123617380857,
        0.0001749743678374216,
        0.006778515409678221,
        -0.016151174902915955,
        -0.0492667555809021,
        -0.05703123286366463,
        -0.020110465586185455,
        -5.72903436825143e-33,
        -0.015638340264558792,
        0.025859152898192406,
        -0.028874339535832405,
        -0.0235275998711586,
        0.06705383211374283,
        -0.02249756082892418,
        0.04502151906490326,
        0.038244642317295074,
        0.04678061604499817,
        -0.11070452630519867,
        -0.11146228760480881,
        0.08501453697681427,
        -0.02817622758448124,
        -0.07346107065677643,
        0.029820293188095093,
        -0.037545885890722275,
        -0.05596718564629555,
        -0.040862422436475754,
        0.005089044105261564,
        0.0031079286709427834,
        -0.004787653684616089,
        0.0845395177602768,
        0.06538958102464676,
        0.05958850309252739,
        -0.010408737696707249,
        0.020743662491440773,
        0.01570167951285839,
        -0.01889403723180294,
        0.03761780261993408,
        -0.02836214378476143,
        0.015906380489468575,
        -0.09829475730657578,
        -0.018986986950039864,
        0.018581822514533997,
        -0.019088508561253548,
        0.04766883701086044,
        -0.0177712831646204,
        -0.037328094244003296,
        -0.04763622581958771,
        -0.04248937964439392,
        -0.019575167447328568,
        -0.005252176430076361,
        -0.008176393806934357,
        0.029493272304534912,
        -0.0515306331217289,
        -0.10186514258384705,
        -0.01805819571018219,
        0.038737665861845016,
        -0.020106302574276924,
        0.0630258321762085,
        -0.09894470125436783,
        0.03266889601945877,
        -0.03645932301878929,
        -0.01690511219203472,
        -0.08697732537984848,
        0.006269222125411034,
        0.08661908656358719,
        -0.006381402723491192,
        -0.015325061976909637,
        -0.0053346240893006325,
        -0.004219135269522667,
        -0.011527031660079956,
        -0.02969226986169815,
        0.04013878479599953,
        -0.030279945582151413,
        0.00870601087808609,
        0.049211520701646805,
        0.004450595937669277,
        -0.01938161440193653,
        0.036751773208379745,
        0.05822106450796127,
        -0.01373559795320034,
        -0.024897541850805283,
        -0.08871030062437057,
        0.011993993073701859,
        -0.02253192476928234,
        -0.007499160245060921,
        -0.016975698992609978,
        -0.003233152674511075,
        0.010435996577143669,
        0.007240494713187218,
        -0.03174276277422905,
        0.02378179505467415,
        0.10806336998939514,
        0.06172919273376465,
        -0.0544290654361248,
        0.05377915874123573,
        0.003438771702349186,
        -0.09624556452035904,
        0.0241808220744133,
        -0.04687279090285301,
        0.04530700296163559,
        -0.011390561237931252,
        0.10783298313617706,
        0.0077309198677539825,
        -7.019443870603936e-08,
        0.06095094233751297,
        0.09888828545808792,
        -0.04349947348237038,
        -0.0498100221157074,
        0.07576160877943039,
        -0.041569676250219345,
        0.04857856407761574,
        0.004268687218427658,
        -0.014202886261045933,
        -0.02990466170012951,
        -0.03087979182600975,
        0.009388765320181847,
        0.05512915924191475,
        0.09754301607608795,
        0.013457395136356354,
        -0.0074889929965138435,
        -0.010666337795555592,
        -0.021401776000857353,
        -0.06802655756473541,
        0.02831946313381195,
        -0.09968961030244827,
        -0.022652175277471542,
        -0.00995170883834362,
        -0.033800579607486725,
        -0.04553132504224777,
        0.011699124239385128,
        -0.08886700868606567,
        0.008854716084897518,
        0.08563835918903351,
        0.06357469409704208,
        -0.015842093154788017,
        0.011514191515743732,
        -0.013862824998795986,
        0.029271498322486877,
        -0.06754811108112335,
        -0.02753150649368763,
        -0.11823897808790207,
        0.006373682990670204,
        0.0657350942492485,
        0.00838843546807766,
        -0.032533448189496994,
        -0.05004741996526718,
        0.06334324926137924,
        0.06842576712369919,
        -0.06281984597444534,
        0.04463973641395569,
        -0.03402679041028023,
        -0.16866174340248108,
        -0.03396616876125336,
        0.03523353114724159,
        -0.05003008618950844,
        -0.016825415194034576,
        -0.09238000959157944,
        0.02536623738706112,
        -0.024671586230397224,
        0.0713629275560379,
        0.028626129031181335,
        -0.06724193692207336,
        0.07343438267707825,
        -0.0029595422092825174,
        -0.016513237729668617,
        -0.05298527702689171,
        -0.01947220414876938,
        0.03593513369560242
    ]
}