{
    "id": "IoaIQSIHuQs",
    "title": "Intel got the Mac Guy.",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-03-18T01:17:40Z",
    "video_url": "https://www.youtube.com/watch?v=IoaIQSIHuQs",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Intel",
        "Evo",
        "Mac guy",
        "Justin Long",
        "Mac vs PC",
        "I'm a mac",
        "I'm a PC",
        "macbook",
        "intel laptop",
        "Justin gets Real",
        "ads",
        "intel mac ads"
    ],
    "views": 887764,
    "likes": 71234,
    "comments_count": 3996,
    "description": "Learn more about Storyblocks Video at   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 AND THE REST OF TH' DAY T' YERSELF 0:13 Intel 11th gen CPUs unveiled 1:38 RX 6700 XT reviews 2:56 TikTok vs Apple personalized ads 4:01 Storyblocks  4:55 QUICK BITS 4:58 Google reduces Play Store cut 5:27 Xbox VR headset?? 6:03 Huawei needs money 6:26 Star Citizen hits $350M 6:51 Charmin sells toilet paper NFTs  NEWS SOURCES  ROCKET RACCOONS Intel officially unveils 11th gen CPUs   More early reviews   Core i5   Intel casts Justin Long in PC vs Mac ads, just a real person being paid to do a real comparison      GPUS ITS THE THOUGHT THAT COUNTS RX 6700 XT reviews   Radeon GPU could be faster with slow CPU   being sold in Czech Republic   But the new CMP card is out BUY THAT     TIKTRAK TikTok, other Chinese app developers looking to bypass iOS anti-tracking feature   elsewhere, can no longer opt out of personalized ads  France rules the feature is fine     QUICK BITS  ANYTHING YOU CAN DO Google one-ups Apples App Store commission reduction     Apple    VBOV SERIES V Xbox VR headset??    5G WILL COST YA 5 GS Huaweis going after 5G patents to make up for losses    CITIZENS PAY TAXES Star Citizen passes $350 million in funding     BRANDS CAN HAVE FUN TOO!!  Charmin is selling NFTs of toilet paper art     ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.storyblocks.com/techlinked",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://linustechtips.com/topic/1315839-intel-officially-unveils-11th-gen-rocket-lake-cpus/",
        "https://www.youtube.com/watch?v=AgFlB0HG_84",
        "https://wccftech.com/intel-core-i5-11600kf-core-i5-11400f-6-core-rocket-lake-desktop-cpu-benchmarks-leak-out-mainstream-chips-to-tackle-amd-ryzen-5/",
        "https://linustechtips.com/topic/1316133-intel-casts-mac-as-pc-in-new-commercials/",
        "https://www.youtube.com/playlist?list=PLk2sjg_-F-MfQL0aUbKyDX909ZfKCUq1c",
        "https://www.engadget.com/intel-pc-ads-justin-long-apple-mac-140527724.html",
        "https://www.youtube.com/watch?v=5wO2vUZv4zw",
        "https://www.youtube.com/watch?v=JLEIJhunaW8",
        "https://linustechtips.com/topic/1315736-powercolor-6700xt-being-sold-in-the-czech-republic-at-1250-hash-rate-of-50mhs-is-on-par-with-a-3080-while-consuming-as-much-power-as-a-3060/",
        "https://videocardz.com/newz/nvidia-cmp-30hx-crypto-mining-processor-goes-on-sale",
        "https://arstechnica.com/gadgets/2021/03/chinas-tech-giants-test-way-around-apples-new-privacy-rules/",
        "https://www.vox.com/recode/22334086/tiktok-privacy-policy-personalized-ads",
        "https://techcrunch.com/2021/03/17/frances-competition-authority-declines-to-block-apples-opt-in-consent-for-ios-app-tracking/",
        "https://www.imore.com/france-antitrust-probe-will-examine-application-ios-14-tracking-changes",
        "https://www.kitguru.net/lifestyle/mobile/mustafa-mahmoud/google-reduces-its-app-store-commission-following-apple/",
        "https://android-developers.googleblog.com/2021/03/boosting-dev-success.html",
        "https://www.macrumors.com/2020/12/24/app-store-15-percent-commission-rolling-out/",
        "https://www.resetera.com/threads/ign-italia-vr-headset-update-message-discovered-in-xbox-series-x-s-os.394804/",
        "https://it.ign.com/xbox-series-x/179732/news/microsoft-al-lavoro-su-un-headset-vr-per-xbox-gli-indizi-arrivano-dalle-nuove-cuffie-wireless",
        "https://www.reuters.com/article/us-usa-huawei-tech/huawei-announces-royalty-rates-for-5g-phone-technology-idUSKBN2B814X?il=0",
        "https://www.cnbc.com/2021/03/16/huawei-to-charge-royalties-to-smartphone-makers-using-its-5g-tech-.html",
        "https://www.eurogamer.net/articles/2021-03-15-star-citizen-shoots-through-USD350m-raised-mark",
        "https://youtu.be/GjvCileoEic",
        "https://www.theverge.com/tldr/2021/3/17/22336115/charmin-nft-toilet-paper-cryptoart-marketing",
        "https://twitter.com/Charmin/status/1372157127280766981?s=20",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(birds chirping sound) - Well top of the morning everyone and happy St. Patrick's day. However you celebrate it. - Happy St. Patrick's day everybody. you know, I may (indistinct) And then put it up to your friends and half of them old canons and some blacks stew anyway. Slating the(beep sound) (laughs hilariously) - Intel has officially unveiled the rocket lake 11th gen desktop processors ranging from the eight core I five 11 400 T to the eight core I nine 11 900 K. And if you're thinking that's only a two core difference medicine, you think I don't know that don't interrupt me. Intel has back ported, their 10 nanometers Cypress Cove architecture to 14 nanometer Silicon for these parts, giving them higher single core performance but preventing them from squeezing more cores in. If you want more details there's even more people who've published reviews of some of the chips before they were supposed to because screw the mainstream narrative, you know - Shut up who needs it - Intel certainly trying to make their own narrative by hiring successful actor, Justin Long, AKA the Mac guy from those old Mac first PC commercials as just like a real person being paid to do a real comparison between Intel powered windows, laptops and Mac books. After Apple switched from using Intel processors, to using their own in-house chips. I mean, sure. You could call it a petty and desperate move because it is you could have at least hired John Hodgman to come on. - That's hilarious. You know, John Hodgman, - No - The Hodgman - hodg - hodgpod. - He's got a great podcast, - He's got a podgcast (laughs cheerfully) - Does he? (background laughter) - Andy's Raytheon RX 6,700 X T officially launches tomorrow. But today reviews for the graphics card went live including Anthony's over on the Linus tech tips channel. - Oh I love him - He's the best. (background laughter) He's so nice. He's so cool. The consensus seems to be once again that if you could find it at MSRP of 479 USD it would be an okay option. If there isn't an RTX 30, 60 TEI available although AMD still doesn't quite seem to have a handle on how to trace rays as well as teen green, to be fair, they go very fast. It's hard to keep track of them. (narrator yelling) And we're in the matrix the thing where they do the time with the bullets but as Harper and box pointed out recently if you've got a slower CPU, like a core i3 you might be better off with the GPU from AMD instead of Nvidia because of driver overhead. If you do need an RX 6,700 XT Pronto they're apparently already being sold in the Czech Republic, but if you're a crypto miner don't listen to what I just said because NVIDIA's first mining focused card. The CMP 30 HX is also now available. (man yelling in the background) Please ignore the fact that it's much worse for mining than the average gamer card. Go buy it. It's over there (glass breaking) - Hohoho where? - And tick talk. My favorite app is trying to find way around the anti-trafficking features built into Apple's upcoming iOS, 14.5 and a couple of different ways. (man talking in the background) No, - Okey (man laughs). In China, tick talks, parent company bite dance, and other domestic corporations are testing a system called CID which would allow them to track and identify iPhone users. Instead of being forced to ask for permission by Apple zone IDFA system In America Tik TOK is removing the options for its users to opt out of personalized ads altogether, which actually brings them in line with most other social media apps. But I thought Tik TOK was better than this. They have all the cool dances and the means - Ohhhhh! - we love that stuff (man speaking unclearly in the background) As our apples anti-trafficking feature whether other businesses like it or not it looks like it will roll out. As Frances competition authority ruled the feature was not an abusive Apple's dominant market position. You think Apple doesn't know that for ramps they're dominant. You said it yourself. Sit down. (man speaking unclearly in the background) Wait i feel Riley's presence. (energetic music) - Now its time for quick bits, brought to you by story blocks and their massive library of stock footage, images, audio and after effects templates. Look, if you're a video creator, you're a storyteller. And the story I'm telling you is that story blocks can help you bring your stories to life without sacrificing your time, budget or resources. They have affordable subscriptions with unlimited video and audio downloads and even an in-browser video editor. So you can get back to creating more of the content you love. We use it on tech link almost every episode because there's over 1 million different stock assets. And if we had to go film an actual real life robot every time I make a joke about AI eventually killing us. That would actually happen before we finished the video. Stop AI from killing us. Check out story blocks today@ `storyblocks.com/tech linked or at the link below. If you don't check out story blocks today a robot is going to murder me tonight Help - Quick bits. They taste just as good as soup with a little seasoning. Google is reducing its play store commission fee from 30% to 15% for the first one in a million dollars. The developer makes each year the move comes after Apple announced a similar policy in November, but only for developers that make less than 1 million per year Google's policy applies to every developer. After hearing the news, Epic games reportedly dropped all their lawsuits against Apple and Google because this change is enough for them. (narrator laughing) J K they didn't. They're still mad. - Stay mad - Stay mad bros. X-Box head. Phil Spencer said Microsoft. Wasn't interested in making an Xbox VR headset, but if that's true, then what the heck is going on with this screenshot of an Xbox UI taken by IGN Italy that says the VR headset needs to be updated in italian. (speaking in foreign language) (narrator speaking in foreign language) You cannot put the head on the head. The pa-- the th th the (laughs joyfully) The head is that the need to go on the past (background laugher) Is X-Box working on a VR headset. And if so is Phil Spencer, even the head of X-Box. How can a box have a head? Let Me know in the comments Huwawei has been hit Pretty hard by China's trade war with the U S so the company has resorted to patent trolling Huwawei will charge smartphone companies for the use of its patented 5g technology because it's got to make money somewhere. (cheerful trumpet music) Wait, were they not charging for it before? Aw, Huawei, we should be friends with them again not this weird dream (background laughter) Star Citizen the highest funded crowdfunding game project of all time has just crossed the $350 million Mark with 2020 being its most funded year ever. Oh man, they've got tons of money now. That's probably enough to get the game out this year, right? I I h I hope so. - I will be playing it for Christmas (miming a tune) that's the Indiana Jones theme song not a Christmas music. And it was only a matter of time before brands hopped on the NFT wagon, toilet paper company Sharman is selling NFTs of artwork. If you could call it that depicting fancy toilet paper rolls. (background laugher) Proceeds from its NFT sales are going to the direct relief charity but still I did not expect NFTs to jump the shark this early, Hey, that's blockchain baby. (small explosion) - Hey - Hey, that's showbiz. And we have to block this episode from getting any longer. So come back on Friday for more tech news independently validated by a network of connected machines instead of a central server it tastes better that way. (narrator cheering)",
    "transcript_keywords": [
        "happy St. Patrick",
        "Patrick day",
        "Apple",
        "Intel",
        "John Hodgman",
        "core",
        "story blocks",
        "time",
        "head",
        "Patrick",
        "XBox",
        "Mac",
        "story",
        "Tik TOK",
        "story blocks today",
        "Hodgman",
        "nanometers Cypress Cove",
        "hired John Hodgman",
        "blocks",
        "make"
    ],
    "transcript_entity_values": [
        "less than 1 million",
        "America",
        "nine 11",
        "Riley",
        "NVIDIA",
        "CID",
        "Google",
        "this year",
        "the Czech Republic",
        "6,700",
        "HX",
        "2020",
        "Friday",
        "IGN Italy",
        "each year",
        "AMD",
        "Anthony",
        "a million dollars",
        "Nvidia",
        "Stop AI",
        "14 nanometer",
        "30",
        "Phil Spencer",
        "tonight",
        "Linus",
        "this early",
        "tomorrow",
        "today",
        "IDFA",
        "five 11",
        "Cypress Cove",
        "the U S",
        "Andy",
        "10 nanometers",
        "John Hodgman",
        "Raytheon",
        "first",
        "XT Pronto",
        "two",
        "Indiana Jones",
        "GPU",
        "CPU",
        "Sharman",
        "eight",
        "Harper",
        "CMP",
        "$350 million",
        "Mac",
        "Huawei",
        "November",
        "Microsoft",
        "11th",
        "China",
        "over 1 million",
        "Tik TOK",
        "30% to 15%",
        "Frances",
        "Apple",
        "J K",
        "14.5",
        "half",
        "italian",
        "Huwawei",
        "Intel",
        "year",
        "TEI",
        "60",
        "Xbox UI",
        "NFT",
        "St. Patrick's",
        "AI",
        "479 USD",
        "400",
        "Mac",
        "Justin Long",
        "MSRP",
        "VR",
        "Christmas",
        "Xbox VR",
        "5"
    ],
    "transcript_entity_types": [
        "MONEY",
        "GPE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "FAC",
        "GPE",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.0904739499092102,
        0.001737318467348814,
        -0.013798586092889309,
        -0.03805021941661835,
        0.08341012895107269,
        -0.051388420164585114,
        -0.021351590752601624,
        0.0407470241189003,
        -0.03594668209552765,
        -0.0330585241317749,
        0.02215750142931938,
        -0.004348937887698412,
        -0.019833242520689964,
        -0.0045517380349338055,
        0.02941547892987728,
        -0.06454623490571976,
        0.14015285670757294,
        -0.03689916431903839,
        -0.01987336203455925,
        0.014443214051425457,
        -0.015637775883078575,
        -0.08296556025743484,
        -0.01827300153672695,
        -0.04308278486132622,
        0.08378447592258453,
        -0.02795792929828167,
        0.020253583788871765,
        -0.040218535810709,
        -0.018668966367840767,
        0.04665433615446091,
        -0.006322627421468496,
        0.032543204724788666,
        0.03328683599829674,
        0.025384653359651566,
        0.007916262373328209,
        -0.06808347254991531,
        0.014400828629732132,
        -0.08242826163768768,
        -0.054305341094732285,
        -0.04231632873415947,
        -0.09206794947385788,
        -0.04505528509616852,
        0.0416814461350441,
        0.05632317066192627,
        0.03748601675033569,
        -0.006755473557859659,
        0.025378257036209106,
        -0.02950594760477543,
        -0.02486119046807289,
        -0.007706150412559509,
        -0.013186703436076641,
        -0.03911089524626732,
        0.02225125953555107,
        -0.003728274954482913,
        -0.033315226435661316,
        -0.0068700578995049,
        -0.045410603284835815,
        -0.03204704076051712,
        0.04064738005399704,
        0.03833876922726631,
        -0.02288479544222355,
        -0.05443748086690903,
        -0.008653155528008938,
        0.08013524860143661,
        -0.055649422109127045,
        -0.020160581916570663,
        -0.06129727512598038,
        -0.006435728631913662,
        0.008659923449158669,
        0.01693403720855713,
        0.029732340946793556,
        -0.0075428844429552555,
        -0.018978828564286232,
        0.017306778579950333,
        -0.038497451692819595,
        -0.011582139879465103,
        0.08861806988716125,
        -0.05455374717712402,
        0.03197384625673294,
        -0.11091721802949905,
        0.03135635703802109,
        -0.015956003218889236,
        0.021024208515882492,
        -0.018385516479611397,
        0.030459288507699966,
        -0.017130933701992035,
        0.004059697035700083,
        0.06837709248065948,
        -0.048914484679698944,
        -0.04585109278559685,
        0.10350377857685089,
        0.13789021968841553,
        0.07080700993537903,
        -0.0024098483845591545,
        0.08423436433076859,
        -0.09115906804800034,
        0.07386478781700134,
        0.029141521081328392,
        -0.06952763348817825,
        0.0412592776119709,
        -0.01263404730707407,
        0.03839787840843201,
        0.034274645149707794,
        0.041391219943761826,
        0.008399402722716331,
        -0.011833755299448967,
        -0.0036666712258011103,
        0.07745961099863052,
        -0.021744927391409874,
        0.030617214739322662,
        -0.040801651775836945,
        0.0068367463536560535,
        -0.059377364814281464,
        -0.07780212163925171,
        -0.04157194495201111,
        0.03497236222028732,
        -0.04443741217255592,
        -0.005064724944531918,
        0.07865124940872192,
        0.020922696217894554,
        -0.04648161679506302,
        0.005759418476372957,
        -0.07435314357280731,
        -0.002916421042755246,
        0.06132778525352478,
        0.07995183020830154,
        -0.06225944310426712,
        1.4804346300936758e-32,
        -0.06707528978586197,
        0.07032053172588348,
        -0.05192543566226959,
        -0.11372645944356918,
        -0.03604942560195923,
        0.038711316883563995,
        0.0023360049817711115,
        -0.0031246179714798927,
        0.046653445810079575,
        0.049915164709091187,
        -0.09583490341901779,
        -0.024589287117123604,
        -0.0916421115398407,
        0.09378036856651306,
        0.06897051632404327,
        -0.059217944741249084,
        0.002318775514140725,
        -0.0010445446241647005,
        -0.05499723553657532,
        0.05773855373263359,
        0.08247347921133041,
        -0.021135298535227776,
        -0.0012840329436585307,
        -0.08781200647354126,
        0.05244218558073044,
        0.04828725382685661,
        -0.013425135985016823,
        -0.055930208414793015,
        0.05203752592206001,
        0.04749530553817749,
        -0.054297395050525665,
        -0.01815737970173359,
        -0.043521225452423096,
        0.03503366932272911,
        -0.0550810843706131,
        -0.013447361066937447,
        -0.02612561732530594,
        -0.1293134242296219,
        0.04395424202084541,
        0.02786204405128956,
        -0.04599906504154205,
        0.03913125768303871,
        -0.09759873896837234,
        -0.07294009625911713,
        0.019154906272888184,
        0.0515727698802948,
        -0.04904254153370857,
        -0.0383751317858696,
        -0.026143740862607956,
        -0.01792358048260212,
        -0.025180693715810776,
        0.08570864051580429,
        -0.061119209975004196,
        0.0047518303617835045,
        0.009361051954329014,
        -0.08432435244321823,
        0.05968543514609337,
        -0.011304781772196293,
        0.07056572288274765,
        0.0756538063287735,
        -0.02515687234699726,
        -0.012815828435122967,
        -0.016477668657898903,
        0.04690804332494736,
        -0.06542082130908966,
        0.057511016726493835,
        0.07333725690841675,
        0.0023727912921458483,
        -0.1283382922410965,
        0.07828564941883087,
        -0.00987373199313879,
        -0.03576730191707611,
        0.06992592662572861,
        -0.03607676178216934,
        0.009002580307424068,
        0.0486912801861763,
        -0.04241665452718735,
        -0.02709857188165188,
        -0.08494116365909576,
        -0.038687143474817276,
        -0.09668460488319397,
        0.02912396378815174,
        0.04274377599358559,
        -0.04044553264975548,
        0.049412015825510025,
        0.028417346999049187,
        -0.006936013698577881,
        0.03221488744020462,
        0.08438081294298172,
        0.017709460109472275,
        -0.05815032869577408,
        -0.02208559401333332,
        -0.024434825405478477,
        0.0259045772254467,
        -0.10453411936759949,
        -1.2347386783565554e-32,
        -0.11031843721866608,
        -0.00904995296150446,
        -0.047538142651319504,
        0.08891486376523972,
        -0.04260005056858063,
        -0.02940199337899685,
        0.03781648352742195,
        -0.001891758176498115,
        0.02520034834742546,
        -0.07356837391853333,
        0.02213025465607643,
        -0.04265686497092247,
        -0.020685961470007896,
        0.048329900950193405,
        0.048840150237083435,
        0.036107130348682404,
        -0.041855573654174805,
        -0.04447945952415466,
        0.011633655987679958,
        0.0084611177444458,
        0.003643834963440895,
        -0.006189963314682245,
        -0.006810355931520462,
        0.06811059266328812,
        0.01365902740508318,
        -0.03134418651461601,
        0.01219831220805645,
        0.003558818018063903,
        0.10259905457496643,
        -0.07021327316761017,
        -0.0561472587287426,
        0.004937650170177221,
        -0.021032486110925674,
        0.03225986659526825,
        0.10154061764478683,
        0.05478440970182419,
        0.015372376888990402,
        0.04809819906949997,
        -0.03577250987291336,
        0.059535421431064606,
        0.07319071888923645,
        -0.04562406986951828,
        -0.061293452978134155,
        0.058560214936733246,
        -0.02921341359615326,
        0.03173598274588585,
        -0.04046409949660301,
        -0.013971589505672455,
        0.0001995056663872674,
        -0.08937456458806992,
        0.00366904865950346,
        -0.045403290539979935,
        0.08515680581331253,
        0.04286370053887367,
        -0.07505247741937637,
        -0.015788840129971504,
        0.01950034499168396,
        -0.003988250624388456,
        -0.024437876418232918,
        -0.04917369410395622,
        0.08907491713762283,
        0.022373981773853302,
        0.005161347333341837,
        -0.03572901710867882,
        0.027321837842464447,
        0.026668105274438858,
        0.056103043258190155,
        0.04242870211601257,
        -0.011194252409040928,
        -0.00781391654163599,
        0.04407164826989174,
        -0.05700257048010826,
        -0.013260014355182648,
        -0.025244975462555885,
        -0.08402908593416214,
        0.09552711993455887,
        0.057755958288908005,
        -0.006228321231901646,
        0.00813471432775259,
        -0.054460883140563965,
        0.0047836992889642715,
        0.07379382103681564,
        0.10131211578845978,
        -0.018014799803495407,
        0.022463412955403328,
        0.0222577303647995,
        -0.01904701255261898,
        -0.03418521210551262,
        -0.03825927898287773,
        -0.04120272025465965,
        -0.08818694204092026,
        0.031120767816901207,
        -0.05206936225295067,
        0.11208073049783707,
        0.011613351292908192,
        -6.420444265131664e-08,
        0.02875298261642456,
        -0.042029839009046555,
        0.010729895904660225,
        0.03195057809352875,
        0.03619440272450447,
        -0.03975933417677879,
        0.00012940879969391972,
        -0.010370979085564613,
        0.019047653302550316,
        0.03892708569765091,
        0.03366854414343834,
        -0.04004112631082535,
        -0.0473819300532341,
        -0.0262807197868824,
        0.017556246370077133,
        0.08013401925563812,
        -0.024915575981140137,
        0.027893805876374245,
        0.054098811000585556,
        0.007948040962219238,
        0.010080571286380291,
        0.0676129013299942,
        0.02748710848391056,
        -0.07559560984373093,
        -0.07979385554790497,
        0.0371546745300293,
        -0.008422721177339554,
        0.05667769908905029,
        0.07518770545721054,
        0.03488510474562645,
        -0.06971336156129837,
        -0.009237340651452541,
        -0.004290231037884951,
        0.007595851551741362,
        0.1174238994717598,
        -0.02032812312245369,
        -0.03764714300632477,
        0.025264348834753036,
        0.08663317561149597,
        -0.018912317231297493,
        -0.013292193412780762,
        -0.08870771527290344,
        0.016746506094932556,
        -0.03405505046248436,
        -0.008591784164309502,
        -0.12193651497364044,
        -0.06837371736764908,
        -0.14402925968170166,
        0.09496128559112549,
        0.04285338148474693,
        0.021955804899334908,
        0.024305148050189018,
        -0.009538200683891773,
        0.026654111221432686,
        0.09296740591526031,
        0.04063041880726814,
        -0.025021076202392578,
        -0.03335686773061752,
        -0.03273444622755051,
        0.06427256762981415,
        0.017976973205804825,
        -0.1086488589644432,
        0.043292295187711716,
        0.03183193504810333
    ]
}