{
    "id": "IQphSqnq3KU",
    "title": "This Gaming Mystery Tech is WILD.",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-06-16T15:02:03Z",
    "video_url": "https://www.youtube.com/watch?v=IQphSqnq3KU",
    "category": "Science & Technology",
    "tags": [
        "mystery",
        "tech",
        "mystery tech",
        "lightsaber",
        "mini saber",
        "hacksmith",
        "saber",
        "ulefone",
        "armor 23 ultra",
        "record",
        "record player",
        "record maker",
        "xbox",
        "playstation",
        "shoes",
        "xbox shoes",
        "playstation shoes",
        "puma",
        "adidas",
        "gamescent",
        "game scent",
        "austin",
        "austin evans"
    ],
    "views": 336369,
    "likes": 10645,
    "comments_count": 364,
    "description": "Learn more about Dropbox for teams:  Thanks to Dropbox for sponsoring this video!  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Xbox & PlayStation Shoes 3:47 Dropbox 4:45 Record Maker 7:49 GameScent 12:13 Ulefone Armor 23 Ultra 15:38 Hacksmith Mini-Saber",
    "description_links": [
        "https://www.dropbox.com/austin",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "(whoosh sound) (breaking glass) - [Ken] Oh, that worked. - That was some real danger right there. I'm just over here warming up, getting ready. And a package was flung aggressively. - Hah! - I have a knife. Adidas? - Adidas. - Adidas. - Okay. I have a couple of thoughts. First of all, it's an Adidas collab with Xbox. Second of all, it is squashed and unbelievably dusty. Can I ask, is this an item that has maybe's been sitting around for a little bit? Ah. - Ah. - Why is it this dusty? - Maybe. - Is there some backstory here? No? I don't even know that Adidas ever did a collab with Xbox. - [Ken] It happened sometime ago. - [Matt] Yeah, it is at least a year ago. - [Alex] Yeah, it happened more than a year ago. - Really? - Yes. - Yeah. - Xbox 20, it was from the 20th anniversary I'm guessing. - [Ken] Which was when? - Not this year, wait-- - Like where? - Wait. 20th anniversary for Xbox? Didn't the Xbox come out in 2002? (negative buzzer noise) 2001? (positive ding) Oh my God. Holy. That is sick. So it's got a clear sole, but you also can see it's got the actual like Adidas Boost on the inside and then yeah, 2001 to 2021. These are 3-year-old shoes. Are you serious? Should I ask how expensive they are before I put them on? How much are these? - How much were they when we bought them versus how much are they now? - Yeah, both, both. How much were these in 2021 when you bought them? - [Alex] So we bought them for $140. - Okay that, I mean it's a little expensive, but that's you know, there's plenty of shoes that are in that kind of zone. - [Ken] How much are they now? Like gimme the price. - [Matt] StockX has got them for $71. - Oh, they've depreciated. - [Ken] Yeah, because they closed all the studios, so. No one likes Xbox anymore. Joanna, it's weird that you're-- - I really like these. - It's weird that you're watching this. Like why do you have the cameras zoomed in? - [Joanna] Oh sorry, I should just zoom in on what-- - Yeah. - Yeah. - [Joanna] Like this? - These are a little small for me to the point where I don't actually need to lace them because they're a little tight. But-- - Oh God. - Look at that. Look at that-- - He was a skater boy. - Beautiful setting. - [Matt] He said, see you later boy. - He wasn't good enough for her, ooh. - [Matt] So we wanted to spark some debates in the comments. - Did you get PlayStation and Xbox shoes, is that the segment? So these are PlayStation Pumas. So it's the Xbox got Adidas and PlayStation had to settle for Puma. (booing sound effect) The only PlayStation bit here is a little bit, you've got a little like triangle and square and whatnot on the front. And you also have on the tongue, which is almost hidden. - Hey. - [Austin] You have the PlayStation symbols. - [Ken] Check the bottom, check the bottom. - Oh okay, and you also have some symbols on the bottom, but like-- - [Ken] So when you curb stomps somebody. (Austin and Alex laugh) - [Austin] Are the Pumas also very, very old? - [Matt] The Pumas not three years old. - [Alex] The Pumas are brand new, so that's why we thought that we could bring the old Adidas out. - I mean, I will say I think the Adidas look a lot cooler. I like the transparent soul versus the thicker dad shoe kind of vibe of the PlayStation sneakers. - That also has a transparency, you literally saw the bottom of it. - [Austin] Yeah, but like you can't see it from the side. Like from the side, does that give you any PlayStation vibes at all? - [Matt] It does look like they went to Payless, got a couple pairs of shoes. - Yeah. - And then, yeah. - I want like a bigger logo, I want something else. Like this is fine, but like, unless you look at the bottom of the shoe, there's not a whole lot going on there. - [Alex] It's got the little tag, the little tag's got the symbols too. - The Pumas are a little bit more comfy. - Yeah, of course they are. - Like I feel they've got like a little bit of extra spring. - Yeah because dad shoes are supposed to be comfortable. - Yeah, yeah, yeah, yeah. But I mean they're both pretty good. How much are the PlayStation Pumas and can you still get them, or are they massively marked up? - [Alex] You can buy them for $120. - The PlayStation shoes do look better with what you're wearing. - [Alex] I think so too. I think the PlayStation goes with more outfits like-- - It does. But what happens when I wanna wear a green and black ensemble? - When do you wear green? - How often is that? - Yeah. (upbeat music) (beep) - Thank you to the sponsor of today's video, Dropbox. Data security is incredibly important. Here at Overclock we spend days, sometimes weeks on a single video. So if we lose any of that data, it can derail a lot of hard work. That's where Dropbox comes in, providing us with essential security tools to maintain control over our content from start to finish. If you work with a team, you probably already know that collaborative work can be hard. How do you share files securely and make sure that only the right people can access them? Well, with Dropbox, it allows you to set passwords on folders and files and expiration dates for those passwords. That way if someone gets a hold of an old password, they can't use it to access your data. And look, accidents happen. Like hitting delete when you really meant to hit share. But you don't have to stress out with file recovery and rewind. In just a few clicks, you can recover your data, no big deal. So if your business has data that you can't live without, Dropbox can give you peace of mind. Check it out at the link in the description to learn more about Dropbox. And thank you again to Dropbox for sponsoring this video. Okay, so this is the Otona no Kagaku magazine. You know, you can record and play to them. It says it's got a switch for 33 and 45. So it actually looks like it would play records. But how would it create a record? Like as far as I know, you can't like write to a record, like you need a record press to squish the vinyl into making beautiful music. - [Alex] So you can take any song you want, like in MP3 form. - Yeah. - And you can turn it into a little mini vinyl. - So this is the magazine, it's Otona no Kagaku magazine calling out a music festival from 2020. (crickets chirp) Huh? - [Ken] It probably did not happen. - That didn't happen. Am I actually gonna like straight make a record right now? Like is that what's happening? Because this is actually really cool if that's the case. I'm about to make some beautiful music. - If I have this correct over here, it says that this might take 60 minutes. Do you wanna see how much instruction there is? Look at that, one, two, we're already in step 11. It's like building a Gundam, but except there are more words than pictures. (Ken laughs) - Matt! Matt, where'd you go? So we've spent some time working on our record player and by we, I mean Alex and Matt spent a lot of time trying to get it to work. What do I do? Because I heard that this was super finicky and annoying. - Okay so-- - Because I see a bunch of little lines-- - Yeah I think-- - But it's all super concentric. - We made a few. - Yeah. - And-- - [Austin] I mean that clearly is nothing. It's just like perfect lines going around. - Yeah, yeah. - What if I sing into it, will that work? - Well kind, that's what it's supposed to do. - When I was-- - Okay. - A young boy. (Matt scratches record) It made something. - And we can flip it over. All right. - Yeah. - And we can do our thing. So we reset it, we pull this pin. - Mhm. - [Matt] Plug it in. - [Austin] Is it USB-C? - [Matt] No. - [Austin] What, no, no, no. - [Matt] There's two modes. There's record mode, which you're not gonna be able to see here, but in play mode. - Is this playing and-- - Playing-- - This is recording? - This is record needle. - [Austin] Okay, got it. - We'll play-- - Should play a This Is video or something. - We'll do Sea Shanty 2. (sea shanty music) - So how do you deploy this guy? - You literally just, all right so-- - Put it down. - Yeah. - We're going to put it down. And so the idea is that this speaker that's on this needle is playing its thing-- - Mhm. - [Matt] And it should start to etch it. - [Austin] It's drawing, but it's like a perfect circle. So I don't think it's actually doing anything. - [Matt] Now this is kind of where we've been at. We've turned this needle around a few times. - [Austin] Yeah. - [Matt] Like it's... - Yeah, so there are-- - Ah. So basically the problem with this is that somewhere in this mechanism, it's not working with the speaker. So we're gonna try to see if we can at least use the record player to listen to a vinyl record. But the problem is, is that nothing actually plays at all. This seems dope, it seems like a really cool thing. Either we're missing something or it's broken, which is a shame because it's a really cool idea. But you know what, that's the great part of Mystery Tech. Sometimes you get something great and sometimes you get a pair of socks for Christmas. Amazon Prime delivery? Oh boy, I'm so excited. Inside we have, oh, is this for a different item? - [Alex] Yeah, it's a different item. - [Matt] Pretend you didn't see that one. - So, this is the GameScent. So it promises AI. (Matt laughs) - [Alex] Yeah. - It automatically releases scents during games, events that release scents, gunfire, explosion, racing cars, forest storm, clean air scent, and many more. You always notice me sniffing tech, well guess what? Get one of these and you can sniff me, hmm. For the first time in history, users will experience a 4D total immersive experience and you can buy customized scents to match your favorite games. - [Matt] I did see that they were gonna also have one, which was just anime convention. (Ken laughs) - So when you're online, when you're playing Yu-Gi-Oh online-- - You mean landfill? - We have the GameScent itself, which is a big old box with a bunch of diffusers in it, I assume. I wanna smell these scents and I'll tell you how accurate they are. So we're gonna do explosions first. - [Alex] You wanna unpack them, or? You're sniffing the box. - That actually smells quite nice, that's not explosions, that's just smells pleasant. We'll do clean air, also doesn't smell like much. - I mean it is clean air. - It's clean air. (Matt laughs) - Forest smells like Febreze. This is racing cars, which also is much darker than the other ones. I dunno, can you see the difference? You see the difference in the liquidity here? What the hell is that? Gunfire? - [Ken] Smells like Nam? - Actually, that's the one that smells vaguely of gunpowder. I'm downloading it from the Play Store and it says it has 100 plus downloads. - [Ken] Yeah, we're one of the 100 idiots that bought it. - So the way this works, in addition to the large amount of steps I had to do with the app, is the most convoluted connection I've ever seen. So I have a USB-A going to this little dongle for power. I also have an aux going into this and then is being passed through to my actual speaker. You could do the same thing with HDMI. This is being powered by USB as well. But if that wasn't all enough, they both have a Bluetooth connection to my phone and I both had to give them Wifi access. So I'm just gonna start playing a game and see what happens. I do smell something, but I'm not sure if it's just like the remnants. - Oh. - Oh. - [Austin] Oh. That was racing. - [Alex] Does it smell like racing? - [Austin] It does smell like ass. Ken you beat 288 miles an hour in the speed trap? Oh, oh, we got a little bit of storm for that one. There's nothing that shows me here that it is actually like a game, right? Like all it's doing is it's taking just the audio and it's trying to interpolate it. So I'll go ahead and leave the game. I'm gonna watch some like COD gameplay or something and see if it can detect the explosions. Oh yeah, that's gunfire. You know what their AI tech, as goofy as it is, actually does seem to somewhat work. Here's the thing, it doesn't smell like actual gunpowder, but it's actually like not terrible. Like it's getting you a little something there. - [Matt] Quick open up Oppenheimer. - No. Whoa, the explosion. Did you see how much explosion just came out? (Austin coughs) Let's listen to some babbling brook, or more ads. This should give us some forest and some storm, I would assume. - [Matt] I suddenly have to go to the bathroom. (group laughs) - Oh, and there's some forest. You know what? As much as this AI stuff is kind of goofy, also forest smells delightful. It actually is really quite accurate in understanding which smell to actually do. I may have been a little too harsh on this. The app is still annoying. The set up process is still too complicated and running it through like aux and stuff, you're probably gonna lose a little bit of audio quality. Like there's definitely some problems with this, but it actually does kind of work. My big question here is how expensive is the GameScent? - [Alex] I mean, can you really put a price on 4D gaming? - I can and it's not as much as I think this thing's gonna be. - [Alex] $150. - Actually, I'm not mad. I'm a little torn because $150 is actually not totally crazy. Now this is gimmicky. I'll absolutely tell you that this is gimmicky. I don't know that I would use this all the time and I certainly think that the scents could be a little bit improved. But I'll be honest, I thought this was gonna be a complete joke and it's actually not bad. I don't hate it. Ah, it's a Ulefone. This is the Armor 23 Ultra. Is that like the Galaxy S23 Ultra, right? - Yeah, so they're known for making a lot of rugged phones that are super practical. If you want take them out for construction work or whatever, they have like a lot of utility, bright flashlights and a whole deal. - Alright, the Armor 23 Ultra. Oh good lord. That is a chungus if I have ever seen one. So we have four cameras, main, 3x telephoto, ultrawide, and a night vision camera. And it also said it has two-way satellite messaging. Dude, there's a lot of stuff going on here. So we've got an SOS button, some kind of like divot thing, an IR blaster. It is chunky though. Like, I don't know how well you can tell, but like that is a, I mean it's not like ultra-ultra rugged, but that is hefty. So this straight up can text via satellite if you have no service. So if you're on a boat in the middle of the Pacific Ocean on route to Null Island, this theoretically will work. The idea that this actually has the ability to just send texts with, I'm assuming no downside, like I don't know if it has like worldwide coverage, but using, what is it called? The bullet app. Ah. (glass breaking sound effect) (Ken laughs) - [Matt] Whoa. - That is a power brick, my dudes. So first of all, I wanna test this 120 watt charge. So I'm gonna plug it into this Shargeek, which to be fair will do 100 watts. So it's not gonna be the full-full speed. So right now we're charging at 20 watts. Fast charging okay, give it a second. So we're 25%. We should start to see that start to going up very quickly. So we'll just do this. This feels like a fire hazard. So we're gonna wait and I wanna see a real big number. So 28 watts. - [Matt] You're about half unplugged on that. - [Ken] I was gonna say. - Oh wait, 108 watts. - Oh shoot. - It's taking 108 watts right now. Wait, it's working. - That's excellent. - Did I really have to plug it all the way in? Was I leaking some wattage? Okay, so it says super fast charging now. So it works. So 31. Now theoretically, if it's really charging at over 100 watts, that's gonna start going up like literally a percent every like 30 seconds. One of the other things I wanna try is the camera. The main thing I wanna try-- - Ooh. - Is night vision. - Can we bring the lights down please? - [Ken] I can see the IR light coming in. - [Austin] Well, here's a problem. So the problem is that we're getting mad glare. So here, I'm gonna take a photo. There we go, you look really creepy. I'll take a selfie too while I'm at it. How much is the Ulefone Armor 23 Ultra. - [Alex] It retails for a grand. - [Ken] Huh? - [Alex] You can, you can apparently it's on sale right now, so you can buy it for $400. - [Ken] Oh, what a discount. - [Alex] I know, it's a brand new phone. I don't know why they discounted it so heavily, but it's-- - So yeah, I would not pay $1,000 for this phone. Here. - Whoa. - Whoa. - Whoa, Jesus Christ. - That was almost manslaughter, I apologize. - Throw the brick at us. - Oh my god. I almost, it almost, I almost felt like the robber from Home Alone. So here's the thing. I actually think $400 is a steal because as Matt and I have pointed out, our Apple Watches also have orange buttons and that costs-- - Ah. - $300 more than this phone. - This phone has satellite messaging. - Yeah. - Yeah. - The ability to take photos in the dark. - Yep. - Uh huh. - And it can charge real quick so you can make a speedy escape. - Yes. - You can also tell the rest of guards to pick you up where the kids are. (Matt breathes in sharply) - [Matt] Ah. - Next item please. - [Matt] I would like to point out for this next item-- - Go ahead. - I bear no responsibility. - [Austin] Okay. - No, like my name's on the shipping label-- - Why is the fire extinguisher out? Oh, good lord. - Whoa, whoa. - Okay, well how dangerous could it be if you threw it. Mini-Saber, uh oh. Uh oh. - Have you ever seen the Star War? - So what we've got here is the, oh, this is the Hacksmith. Oh. Can we get that fire extinguisher a little bit closer to the table? Because I will tell you, there's a lot of flammable things in this vicinity and-- - [Matt] You can't get it too close to the fire extinguisher because fire extinguishers themselves-- - Oh. - Will explode if they catch on fire. - Okay, all right. Risk of fire, keep outta the reach of children. This is not toy, butane not included. - [Matt] Whoa. - Wait, do we need butane? - [Matt] Yeah. - Do we have any of that? - Thanks a lot Alex. - [Alex] What? - Do we have butane? - No. - Oh. (crickets chirp) - Next time on Mystery Tech, we burn the studio down. Now that I am newly armed with some butane fuel, let's try this again, shall we? I will say this is a little intimidating looking. They, I mean they went all black with the packaging. Like, this looks freaking dope. So, oh my god. It feels good too, it's actual metal. And so then you've got the handle, you've got a button, which I assume lights it or something. You've got a lock to, yep. Light it or not light it. So I'm very curious on how this works because obviously, you know, if you've ever used a lighter or something, the flame will come up a little bit. But this is gonna have to be bigger, right? - Yeah, notice the hole there is a little bit bigger than normal. - Okay. - So instead of just like one small hole, like a lighter would normally have-- - [Austin] Yeah, yeah, yeah. - Because like even with a regular lighter, you can get a pretty large flame off of it, but this here's got a couple extra streams there to kind of make a thicker overall plasma stream. - So this isn't like a taser type like thing. - No. - It's actually like a proper like (imitates flame blowing). - This is actually a lightsaber. - Okay, it's a question. Should I do this inside or outside? - [Matt] No, you should not. (Ken laughs) The hell's wrong with you? - What? - [Matt] None of this should be inside right now. - [Ken] Oh, I was gonna say we have the fire extinguisher. - I was gonna say, yeah-- - No. - [Alex] I mean you could probably fill it at least. - No. - [Alex] All right. - I need to fill this with butane so I think I just push it? Oh yeah. How do I know when it's full? - [Alex] Uh, yes. - So do I literally just unlock it and then just send it, just send it? (clicking) Oh. - Oh, yo. - Oh, it's actually working. Wait, hold on. - Oh, Jesus. - Oh. - [Ken] Okay. Oh, yo. - Oh, you know what? That actually does look a lot better when we're in the shade. There we go. There we go. How much was this little guy? - [Alex] $100 dollars. - You know what, this is worth it for $100 bucks. Because like-- - Can you put a price on a good creme brulee? (lighter clicks) - All right, you know what I gotta say? If you put this on the inside, it looks way cooler. Damn. All right, you know what? I was about to say that this is like cool, but nothing all that special. But when you actually see it in a little bit of dimmer lighting, or especially you do it like at night or something, that's absolutely sick. Now, it's still not like a lightsaber. It's a Mini-Saber for a reason. But, that's kind of cool. I should probably stop doing this before I burn something down. - [Ken] Yeah, you were literally right next to Matt's office. (upbeat music) - No. (Austin laughs) (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "Adidas",
        "Xbox",
        "bit",
        "PlayStation",
        "record",
        "thing",
        "lot",
        "Pumas",
        "work",
        "Whoa",
        "kind",
        "Dropbox",
        "smell",
        "fire",
        "smells",
        "PlayStation Pumas",
        "wait",
        "shoes",
        "play"
    ],
    "transcript_entity_values": [
        "so-- - Put",
        "288 miles an hour",
        "33",
        "first",
        "SOS",
        "120",
        "2020",
        "two",
        "Matt",
        "four",
        "Pumas",
        "one",
        "31",
        "Ulefone Armor 23 Ultra",
        "Jesus",
        "Puma",
        "every like 30 seconds",
        "Home Alone",
        "23",
        "108 watts",
        "60 minutes",
        "3x",
        "Adidas",
        "night",
        "Shargeek",
        "2021",
        "Yu-Gi-Oh",
        "PlayStation",
        "Ken",
        "USB",
        "Austin",
        "Xbox",
        "120 watt",
        "Adidas Boost",
        "IR",
        "Joanna",
        "$100 bucks",
        "at least a year ago",
        "20 watts",
        "1,000",
        "the Play Store",
        "Ken] Smells like Nam",
        "71",
        "the Pacific Ocean",
        "today",
        "Sea Shanty 2",
        "Otona no Kagaku",
        "Jesus Christ",
        "Oppenheimer",
        "Matt] Quick",
        "Payless",
        "Amazon",
        "Adidas",
        "140",
        "Christmas",
        "20th",
        "400",
        "the Star War",
        "300",
        "3-year-old",
        "GameScent",
        "Xbox",
        "PlayStation Pumas",
        "AI",
        "11",
        "Hacksmith",
        "the Galaxy S23 Ultra",
        "$100 dollars",
        "Otona",
        "Second",
        "One",
        "Mystery Tech",
        "First",
        "- Adidas",
        "Alex",
        "2001",
        "the PlayStation Pumas",
        "100",
        "this year",
        "4D",
        "150",
        "100 watts",
        "three years old",
        "second",
        "45",
        "Null Island",
        "more than a year ago",
        "25%",
        "about half",
        "weeks",
        "Febreze",
        "28 watts",
        "Dropbox",
        "2002"
    ],
    "transcript_entity_types": [
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "QUANTITY",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "LOC",
        "DATE",
        "LOC",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "ORDINAL",
        "MONEY",
        "EVENT",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "LOC",
        "FAC",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "DATE",
        "GPE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.07418590039014816,
        0.017583763226866722,
        0.02677062898874283,
        -0.03837456554174423,
        0.18827661871910095,
        -0.07254025340080261,
        0.10305016487836838,
        -0.02192080393433571,
        -0.0290022324770689,
        0.04151713848114014,
        0.007487723603844643,
        0.05136093497276306,
        -0.022015869617462158,
        -0.01032237708568573,
        -0.023170268163084984,
        -0.023686252534389496,
        -0.01644578017294407,
        -0.08826897293329239,
        -0.09897767007350922,
        0.009105371311306953,
        -0.0024007530882954597,
        -0.028089534491300583,
        -0.038816943764686584,
        0.06024249643087387,
        -0.09582042694091797,
        0.08236958831548691,
        -0.008356682024896145,
        -0.04069160297513008,
        -0.07933758199214935,
        -0.07572098076343536,
        -0.023959625512361526,
        0.03326669707894325,
        0.010947475209832191,
        0.04292875528335571,
        0.057796843349933624,
        -0.017117897048592567,
        0.028163863345980644,
        -0.001200946164317429,
        -0.02139374427497387,
        -0.05863320082426071,
        -0.08243745565414429,
        -0.07152053713798523,
        -0.0035519483499228954,
        0.07047612220048904,
        -0.032809559255838394,
        -0.008484999649226665,
        0.04985661059617996,
        -0.029896443709731102,
        -0.03535466641187668,
        0.04272610321640968,
        0.0008103164145722985,
        0.021387510001659393,
        0.08535250276327133,
        -0.059609055519104004,
        0.032644353806972504,
        0.025043947622179985,
        0.009071492590010166,
        -0.053046584129333496,
        0.02460111491382122,
        -0.011969506740570068,
        0.12240735441446304,
        0.003213057294487953,
        -0.07524607330560684,
        0.02665293775498867,
        0.010631919838488102,
        -0.022480681538581848,
        0.051859404891729355,
        -0.0050754426047205925,
        -0.020779665559530258,
        -0.006994666997343302,
        0.06115620955824852,
        -0.02580101788043976,
        -0.034789398312568665,
        0.10622597485780716,
        0.01349661871790886,
        0.036862462759017944,
        -0.01970622129738331,
        -0.04978180676698685,
        0.013240227475762367,
        0.0832553431391716,
        0.05165448412299156,
        0.028331635519862175,
        0.04071340709924698,
        0.024263452738523483,
        -0.03905588015913963,
        -0.026739979162812233,
        0.031065616756677628,
        0.00855797529220581,
        -0.055495377629995346,
        -0.052063215523958206,
        -0.06812262535095215,
        0.02081826515495777,
        0.039118047803640366,
        0.08399273455142975,
        0.004435082897543907,
        0.04245099797844887,
        -0.006984350271522999,
        0.012063457630574703,
        -0.06201031059026718,
        0.07565329223871231,
        -0.027070825919508934,
        0.03683927282691002,
        -0.02062065526843071,
        -0.03311232849955559,
        -0.024029619991779327,
        -0.0697828158736229,
        -0.05310732498764992,
        -0.006835291162133217,
        0.0353693813085556,
        0.10913991928100586,
        -0.0694938600063324,
        0.045550115406513214,
        -0.12785065174102783,
        0.07816615700721741,
        -0.06706120818853378,
        0.01617618463933468,
        -0.03946737200021744,
        0.01786358654499054,
        -0.060286883264780045,
        -0.045557837933301926,
        0.024126505479216576,
        0.06295768916606903,
        0.028106071054935455,
        -0.019462332129478455,
        0.0025180731900036335,
        -0.007336377166211605,
        -0.03089667484164238,
        2.604531629186411e-33,
        0.006332240533083677,
        0.044296786189079285,
        -0.022111384198069572,
        -0.012843583710491657,
        0.0582599975168705,
        -0.11289004981517792,
        0.03209911286830902,
        0.04179300740361214,
        -0.039286863058805466,
        0.13597944378852844,
        -0.036693405359983444,
        0.07002614438533783,
        -0.018578264862298965,
        0.008690002374351025,
        0.08066458255052567,
        -0.03106357716023922,
        0.007766279857605696,
        -0.05031002312898636,
        -0.006745835300534964,
        -0.030556732788681984,
        -0.012860625050961971,
        0.05009136721491814,
        0.027202412486076355,
        0.03250481188297272,
        0.06662167608737946,
        0.06016112491488457,
        -0.019761258736252785,
        0.003379277652129531,
        0.12450936436653137,
        0.05737174302339554,
        -0.057783208787441254,
        -0.02196945808827877,
        -0.005178723018616438,
        -0.0011762820649892092,
        -0.05513075739145279,
        -0.0005781008512713015,
        -0.01601501740515232,
        -0.06767163425683975,
        -0.04169400781393051,
        0.025196053087711334,
        0.03078974038362503,
        -0.053643256425857544,
        -0.0816914364695549,
        -0.07381303608417511,
        -0.04149072989821434,
        0.06968826800584793,
        -0.008586004376411438,
        0.010093766264617443,
        -0.08462203294038773,
        -0.020477915182709694,
        -0.05283462256193161,
        0.028211714699864388,
        0.06338409334421158,
        0.017307404428720474,
        0.020027155056595802,
        -0.052841413766145706,
        0.04515280947089195,
        -0.07792536169290543,
        0.10676626116037369,
        -0.01958385668694973,
        0.09272065758705139,
        -0.04379381239414215,
        0.024362970143556595,
        0.03554289788007736,
        -0.05285654589533806,
        0.011271381750702858,
        0.011736900545656681,
        0.016310859471559525,
        0.0012500996235758066,
        -0.006702587939798832,
        -0.030776916071772575,
        0.03907473757863045,
        -0.044611308723688126,
        -0.053745560348033905,
        0.042028725147247314,
        -0.03613612428307533,
        -0.04422256350517273,
        0.02422664687037468,
        -0.045974887907505035,
        -0.028708500787615776,
        0.020418651401996613,
        0.033761266618967056,
        0.045160915702581406,
        -0.022596100345253944,
        -0.1209641844034195,
        -0.0034329681657254696,
        0.04649506136775017,
        0.057804811745882034,
        -0.0772922933101654,
        0.0022313117515295744,
        -0.11304771155118942,
        -0.055389463901519775,
        -0.03365204855799675,
        -0.026814552024006844,
        0.014838911592960358,
        -6.1170845225830526e-33,
        0.05933505669236183,
        -0.10139186680316925,
        0.03614305704832077,
        0.03405134752392769,
        0.0817791074514389,
        0.03814578428864479,
        0.019119907170534134,
        0.044440582394599915,
        0.011263174936175346,
        0.00525558041408658,
        0.020107945427298546,
        0.015082481317222118,
        -0.10762949287891388,
        0.0033074792008847,
        0.05315810814499855,
        0.01000194065272808,
        -0.013143661431968212,
        -0.052988141775131226,
        -0.0011038201628252864,
        -0.030038928613066673,
        0.09426421672105789,
        0.010872354730963707,
        0.016425643116235733,
        -0.05276528373360634,
        -0.10664886981248856,
        0.014952460303902626,
        0.05920287221670151,
        -0.0007861452759243548,
        -0.035729724913835526,
        0.06602899730205536,
        0.0005180546431802213,
        -0.006574202794581652,
        0.054691631346940994,
        0.0563640221953392,
        -0.022284287959337234,
        0.06897319108247757,
        -0.008212164044380188,
        -0.04280191659927368,
        -0.06497479230165482,
        -0.08231790363788605,
        -0.008187021128833294,
        0.008932170458137989,
        -0.052451714873313904,
        0.05538545176386833,
        -0.028719190508127213,
        -0.1064344197511673,
        -0.09096932411193848,
        0.0015728827565908432,
        0.07592439651489258,
        -0.0050290608778595924,
        0.10755468904972076,
        0.015923766419291496,
        -0.002949588932096958,
        0.019702091813087463,
        -0.04152119904756546,
        0.020042723044753075,
        -0.110779769718647,
        0.03399157151579857,
        -0.0060974969528615475,
        0.043382272124290466,
        0.03936747834086418,
        0.03625183552503586,
        -0.12249571084976196,
        -0.02094271406531334,
        0.040946826338768005,
        -0.05766769498586655,
        0.012336457148194313,
        0.0067780534736812115,
        -0.03791391849517822,
        0.004097782075405121,
        -0.002774560358375311,
        -0.00915537029504776,
        -0.024337947368621826,
        -0.00016503091319464147,
        0.019551770761609077,
        0.01358324196189642,
        -0.034395501017570496,
        -0.06984689086675644,
        0.026163531467318535,
        0.02135917730629444,
        -0.013215040788054466,
        -0.05605697259306908,
        0.020957132801413536,
        0.10665426403284073,
        0.07287455350160599,
        -0.020168162882328033,
        0.004569081123918295,
        0.06645502895116806,
        -0.04356445372104645,
        -0.0026752606499940157,
        0.08411283046007156,
        -0.010628222487866879,
        0.007252908777445555,
        0.07794545590877533,
        -0.007955259643495083,
        -6.477428371454153e-08,
        0.016648463904857635,
        0.03601476922631264,
        -0.04014023765921593,
        0.015246116556227207,
        -0.017915811389684677,
        0.018196197226643562,
        0.039790622889995575,
        0.005875500850379467,
        0.061307892203330994,
        -0.016337864100933075,
        -0.023388419300317764,
        -0.01881767250597477,
        -0.10679071396589279,
        0.07257871329784393,
        -0.027072958648204803,
        -0.02490227110683918,
        -0.15305045247077942,
        0.06649326533079147,
        -0.024703374132514,
        -0.05836949497461319,
        -0.021884450688958168,
        0.0011029376182705164,
        0.07938187569379807,
        -0.045907024294137955,
        -0.053672704845666885,
        0.0017357817851006985,
        -0.04701198637485504,
        -0.03651553392410278,
        0.015061219222843647,
        0.0550224669277668,
        -0.09977508336305618,
        -0.026464711874723434,
        0.07072999328374863,
        -0.04454735293984413,
        -0.012563412077724934,
        -0.026018239557743073,
        0.02815881185233593,
        -0.01149788685142994,
        0.03921661153435707,
        -0.06043590232729912,
        -0.02437516115605831,
        -0.14028410613536835,
        -0.08417236804962158,
        -0.009901260957121849,
        -0.028834432363510132,
        -0.023554176092147827,
        -0.07941333204507828,
        0.0045166704803705215,
        -0.04940985143184662,
        0.004040533676743507,
        0.022156352177262306,
        0.014223575592041016,
        0.026192979887127876,
        0.07569228857755661,
        0.0007135235355235636,
        -0.007160206791013479,
        -0.04688858613371849,
        -0.019661089405417442,
        0.05065106973052025,
        -0.0017413987079635262,
        0.048926495015621185,
        -0.10169979929924011,
        -0.02882489748299122,
        0.08395568281412125
    ]
}