{
    "id": "It9D08W8Z7o",
    "title": "NVIDIA Made a CPU.. I’m Holding It. - Grace CPU/Hopper SuperChip @ Computex 2023",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-29T20:34:09Z",
    "video_url": "https://www.youtube.com/watch?v=It9D08W8Z7o",
    "category": "Science & Technology",
    "tags": [
        "gigabyte",
        "servers",
        "cpu",
        "nvidia",
        "computex 2023",
        "h100",
        "ces"
    ],
    "views": 2553667,
    "likes": 98142,
    "comments_count": 4978,
    "description": "Try Pulseway FREE today, and make IT monitoring simple at:   I'm at the Gigabyte booth at Computex 2023 where they're showing off bonkers new hardware from Nvidia!   Discuss on the forum:   Immersion tank 1 A1P0-EB0 (rev. 100) : Immersion tank 2 A1O3-CC0 (rev. 100):  Big AI server (h100) - G593-SD0 (rev. AAX1):    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:22 Meet the Grace Super Chip! 1:22 We got permission for this... 3:13 ..but not for this. 4:40 Now for the GPU! 6:13 That's where the Interconnect comes in 7:32 There's \"old-fashioned GPUs\" too 8:35 Crazy network card 11:00 outro",
    "description_links": [
        "https://lmg.gg/LTT23",
        "https://linustechtips.com/topic/1509962-nvidia-made-a-cpu-i%E2%80%99m-holding-it-computex-2023/",
        "https://www.gigabyte.com/Enterprise/Accessory/A1P0-EB0-rev-200#Specifications",
        "https://www.gigabyte.com/Enterprise/Accessory/A1O3-CC0-rev-100",
        "https://www.gigabyte.com/Enterprise/GPU-Server/G593-SD0-rev-AAX1",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- It's pretty clear where NVIDIA's priorities lie these days. We're here at the Computex booth of one of their partners, Gigabyte, and this is the entire gaming showcase. That's because they, like the rest of the industry, understand that the future of computing lies in the data center. That is where the Grace Superchip comes in. Under each of these gigantic heat spreaders are 72 of NVIDIA's Grace CPU cores, connected together using what NVIDIA calls the NVLink chip-to-chip interconnect for a total of 144 cores, except that's just one of the nodes. This server from Gigabyte accepts not one, not two, but four of these modules in its four separate nodes. That is an absolutely mind bending 576 cores in a 2U server rack. But these are not the types of CPUs that you have in your gaming PC at home. Those processors from the likes of AMD and Intel are based on the x86 architecture. So, similar to what Apple did with their M series: M1 and M2 processors, NVIDIA is making use of a different processor architecture called ARM. And we actually did get permission to do this, you're gonna be taking a closer look here. Ohh. It doesn't look much like it, but this is the same style of processor that you might find in your phone. ARM Processors have a lot of advantages, first and foremost being that they're typically more power-efficient thanks to their relatively lightweight instructure set. So much so that NVIDIA claims these Grace CPUs have twice the performance per watt of the latest x86 chips. But the disadvantage is they also require software, like your operating system and all the programs you need to run, to be coded and compiled specifically for ARM. Now for the PC market, because 86 has been the standard for so long, it's difficult to justify switching over to ARM. It would cost you so much in terms of backwards compatibility. But in the data center, the types of customers who are gonna buy a processor like this are usually developing their own software anyway. Like, let's say Google, to run the algorithms that power Google search, or YouTube recommendations. For them, switching over to ARM isn't as big a deal, and in fact, companies like Amazon, who are developing their own ARM-based CPUs, are already doing it, and very effectively. I mean, hey, if my next gaming CPU could be half the power draw and the same performance of my current one, I'd be stoked, but this is even better. Imagine if instead of one computer, you're talking thousands or tens of thousands. The savings start to become so large that it's less a question of can we afford this migration, and more a question of can we afford not to make it? Now, I didn't ask permission for this part but nobody seems to be stopping me or even really paying attention to me. So, let's take apart Grace Superchip. On each Grace Superchip is up to 480 gigabytes of LPDDR5X ECC memory per CPU. And what's really cool is that that can actually be accessed by either CPU over the NVLink interconnect. That's how fast this new NVLink is. The only downside to this approach, since we're making comparisons to Apple, is that just like with your M2 MacBook, you better decide how much memory you want in your server right at the time you buy it, unless you wanna replace the entire compute engine while you perform a memory upgrade. Given that the rumored price of their H100 GPUs is $100,000, I don't even want to know what this thing costs. But hopefully you get a bit of a discount when you buy it together with the Grace Superchip CPU. Let me show you this. Can't believe they're letting me take this off the wall. (chuckles) Okay. Success. We have dropped nothing important so far today. This is Grace Hopper. On the one side we've got the same 72-core Grace ARM CPU that we just saw, but on the other side, the ooh, shiny, latest NVIDIA H100 Hopper GPU. You can probably see where this is going. Just like with the dual-CPU Grace module, these two are also NVLink chip-to-chip interconnected, meaning that the CPU and GPU have a whopping 900 gigabytes per second of theoretical bandwidth to talk to each other. So first in perspective, a GPU, using a full 16-lane Gen5 PCIe slot, would only have about 64 gigabytes a second of peak throughput. That is 1/14 as much as this, and that's far from the only mind-bending number that this thing is capable of. While the CPU side uses the same, up to 480 gigabytes of LPDDR5X, for the GPU side they need much faster HBM3 memory that runs at a whopping four terabytes per second. That's about four times faster. That's why the memory needs to be right on the package right next to the GPU. Now, all of that is great and cool and all, but HBM is very expensive, and as you can see, there's only so much space here. So the H100 only gets 96 gigabytes of memory. Okay, yeah, for gaming, that certainly sounds like a lot but AI data sets can involve terabytes of data, so it can get used up very quickly. That's where the interconnect comes in. It allows the GPU to access the CPU's memory in a very direct and transparent way, giving the H100 Hopper GPU a functional memory capacity of nearly 600 gigabytes. In practical terms, according to NVIDIA, that puts Grace Hopper anywhere from about two and a half times to nearly four times as fast as an x86 CPU paired with their last generation A100 GPU. And where things get really wild is in the data center with an NVLink switch system, you could connect up to 256 GPUs together, giving them access to up to 150 terabytes of high bandwidth memory. I mean, you guys remember that crazy Mars Lander demo that we showed off on the \"Petabyte of Flash\" array? You could load that entire one billion point data set into memory in that configuration, and still have 50 terabytes to spare. Now, this module, little bit more power hungry than the dual CPU version. A thousand versus 500 watts per module. But I mean, that's for CPU, GPU, and RAM for both of them. And with this kind of performance of course not everybody wants to move to an ARM hybrid CPU, GPU architecture. So NVIDIA is still going to be supporting their old fashioned configurations, be they H100 GPUs and a PCIe form factor, or their HGX H100 with up to eight SMX5 GPUs. Each of these draws a massive 700 watts, making an RTX 40 90 look like a child's play thing, and supports NVLink between these GPUs, and NVSwitch to additional servers. This is the G593-SD0, and Gigabyte was very proud of the fact that they are the first NVIDIA certified HGX H100 8-GPU server in a 5U chassis. Man, that is a lot of compute in a tiny space. Jake's in my ear here telling me I should pull one of the power supplies, but if you've noticed it getting darker, it's because they're actually shutting down the pre-show and they're trying to get us outta here. But there is one more thing that we wanted to talk about. Where'd it go? Dang it, Jake. No. Oh my God! Okay, well this is, no, wait. This isn't the one I wanted. Okay. It's a ConnectX-7, this is an even faster network card. So this is probably the first NVIDIA developed Mellanox network card, given that the acquisition was what, about two years ago? - [Jake] Yeah, ConnectX-6 was already out. - Yeah, but NVIDIA didn't buy Mellanox just to make faster ConnectX cards. (chuckles) No, it was to make these. This is a BlueField-3, so it has networking on it. This is a 100 gigabit one, but it's available at speeds up to 400 gigabit. But what's really special about it is that it has up to 16 processing cores on it. Why, you might ask? Well, just like in the old days when we started offloading TCPIP processing to our network cards rather than having our CPU handle them, this is gonna offload all kinds of interesting things like encryption of your network traffic, or say for example, handling, managing your file system. Because when you're someone like an AWS and you wanna squeeze as much revenue as possible out of every CPU in your data center, you don't want it handling stupid BS that you could just offload to your network card. So the idea here is to free up CPU resources that can be leased to customers by putting them onto the network card itself. And this is especially true for software where the developer sells you a license per core. That's why even though these are gonna be wildly expensive, a lot more than the 4060 Ti, NVIDIA is going to sell shed loads of them. Just like I sold this segue to our sponsor. Pulseway. Are you sick of feeling like a prisoner chained to a desk, managing IT systems? Unleash your inner IT hero with Pulseway's remote monitoring and management software. Pulseway's platform gives you the power to manage your IT infrastructure from anywhere, even from the comfort of your own couch. And with real time alerts and notifications you can be the first to know about potential issues before anyone else on your team. It's accessible through whatever device is close to you thanks to their convenient apps, allowing you to control your IT systems like a boss, even if you're lounging in your PJs. So say goodbye to the boring routine of IT management and hello to the fun of being an IT hero with Pulseway's advanced technology. Don't wait. This is your chance to become a legend in the IT world. Just try Pulseway for free today, and experience the power of simplified IT infrastructure management. Click the link below to get started. (upbeat music) If you guys enjoyed this video why don't you check out, oh, \"The Petabyte of Flash.\" - That was a good one. Well, at the Gigabyte booth, come on. The G RAID one. - Yeah, G RAID. - Actually, no, new Whonnock. New, new, new, Whonnock 3. Whonnock 4, I mean. Damn it.",
    "transcript_keywords": [
        "NVIDIA Grace CPU",
        "Grace ARM CPU",
        "CPU",
        "Grace Superchip CPU",
        "Grace Superchip",
        "NVIDIA",
        "Grace",
        "GPU",
        "NVIDIA priorities lie",
        "Grace CPU cores",
        "ARM",
        "Grace Hopper",
        "memory",
        "Grace CPU",
        "Grace CPUs",
        "Hopper GPU",
        "ARM CPU",
        "GPUs",
        "NVIDIA Grace",
        "Grace ARM"
    ],
    "transcript_entity_values": [
        "one",
        "500",
        "100",
        "nearly four",
        "NVLink",
        "5U",
        "GPU",
        "about two and a half",
        "G593",
        "50 terabytes",
        "AI",
        "NVSwitch",
        "AMD",
        "Whonnock 3",
        "100,000",
        "YouTube",
        "Whonnock 4",
        "256",
        "A thousand",
        "Mellanox",
        "half",
        "Apple",
        "first",
        "up to 150 terabytes",
        "M2",
        "about four",
        "Mars Lander",
        "M1",
        "M2 MacBook",
        "900 gigabytes",
        "the old days",
        "Computex",
        "Amazon",
        "HBM",
        "up to eight",
        "Gigabyte",
        "CPU",
        "AWS",
        "2U",
        "Intel",
        "about two years ago",
        "40 90",
        "up to 400",
        "Grace Superchip",
        "four",
        "Google",
        "thousands or tens of thousands",
        "four terabytes",
        "Grace Hopper",
        "Grace",
        "HGX",
        "16",
        "about 64 gigabytes",
        "TCPIP",
        "Gigabyte",
        "Whonnock",
        "two",
        "1/14",
        "the Grace Superchip",
        "second",
        "Jake",
        "700 watts",
        "one billion",
        "nearly 600 gigabytes",
        "86",
        "today",
        "NVIDIA",
        "Pulseway",
        "up to",
        "up to 480 gigabytes",
        "Petabyte of Flash",
        "Gen5",
        "8",
        "72",
        "The Petabyte of Flash",
        "ConnectX",
        "96 gigabytes",
        "576",
        "terabytes",
        "last generation A100",
        "144",
        "480 gigabytes"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "LOC",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.08587268739938736,
        -0.033351097255945206,
        0.002051710383966565,
        -0.044758304953575134,
        0.07289699465036392,
        -0.07087551802396774,
        0.026897158473730087,
        -0.038797467947006226,
        -0.019525103271007538,
        -0.06027494743466377,
        -0.03569471463561058,
        -0.05420221760869026,
        -0.02850012108683586,
        -0.037782758474349976,
        -0.06898613274097443,
        -0.034502141177654266,
        0.17138759791851044,
        -0.10707613825798035,
        -0.06945716589689255,
        -0.01722143217921257,
        0.004555609542876482,
        -0.02136906236410141,
        -0.020578932017087936,
        0.021833330392837524,
        0.023038465529680252,
        0.04267677664756775,
        -0.03169466555118561,
        -0.019801177084445953,
        0.04452313482761383,
        -0.06906868517398834,
        -0.0023338678292930126,
        0.04854342341423035,
        0.007849964313209057,
        0.011803099885582924,
        0.059618283063173294,
        -0.008264985866844654,
        0.02139606885612011,
        -0.12728261947631836,
        -0.06109089031815529,
        -0.0713123232126236,
        0.07571334391832352,
        -0.06870217621326447,
        0.021456658840179443,
        0.08809087425470352,
        0.05230415239930153,
        -0.017071738839149475,
        0.018125295639038086,
        -0.09395450353622437,
        0.005041212774813175,
        0.024047236889600754,
        -0.07019822299480438,
        -0.09785626828670502,
        0.07450821995735168,
        0.00964450929313898,
        -0.07749485969543457,
        0.05239572748541832,
        -0.013095648027956486,
        -0.04842902719974518,
        0.005128803197294474,
        -0.020191341638565063,
        0.04773005098104477,
        -0.06707268953323364,
        0.011712800711393356,
        0.06130605563521385,
        0.021937215700745583,
        -0.01568935066461563,
        -0.010657062754034996,
        0.03561469539999962,
        -0.003790372284129262,
        0.020971208810806274,
        -0.01593167521059513,
        0.01718413084745407,
        0.013082963414490223,
        0.0237328689545393,
        -0.01573864556849003,
        0.011999049223959446,
        -0.01202471274882555,
        -0.07468007504940033,
        0.05213841795921326,
        -0.04780374839901924,
        0.051160212606191635,
        -0.0736546665430069,
        0.004698209930211306,
        -0.02445686236023903,
        0.025109002366662025,
        -0.03883693739771843,
        0.06310687214136124,
        0.01900721713900566,
        -0.018698297441005707,
        -0.09743741154670715,
        -0.06643260270357132,
        0.08869826048612595,
        0.05397031828761101,
        0.03643941879272461,
        -0.020719902589917183,
        0.02305181883275509,
        -0.027433978393673897,
        -0.010935776866972446,
        -0.0039040595293045044,
        0.10173673182725906,
        0.006752650719136,
        0.04284238442778587,
        0.03434155881404877,
        0.06879109144210815,
        -0.09424763917922974,
        -0.015324828214943409,
        -0.053551577031612396,
        0.15264597535133362,
        -0.020896529778838158,
        -0.020540015771985054,
        -0.06568790227174759,
        0.10378444939851761,
        -0.04146181419491768,
        0.00011913611524505541,
        0.0017112249042838812,
        0.06486082077026367,
        -0.10018796473741531,
        -0.007449593394994736,
        0.029608387500047684,
        -0.018384266644716263,
        -0.035902418196201324,
        -0.0794178918004036,
        -0.015145924873650074,
        0.0024080967996269464,
        0.05247988551855087,
        0.052845973521471024,
        -0.053818557411432266,
        6.50165117287441e-33,
        0.032231301069259644,
        -0.01826932467520237,
        0.0016685761511325836,
        -0.030286254361271858,
        0.042978040874004364,
        0.034526824951171875,
        -0.02593996748328209,
        0.005364356562495232,
        0.018818898126482964,
        0.03189058601856232,
        -0.02472449652850628,
        0.06464000046253204,
        -0.04459464177489281,
        0.05020609125494957,
        -0.01874813437461853,
        -0.13865748047828674,
        -0.006924153305590153,
        0.04325473681092262,
        -0.021685907617211342,
        0.01754060946404934,
        0.08290605247020721,
        -0.02859642170369625,
        -0.030915329232811928,
        -0.009615049697458744,
        0.029986467212438583,
        0.04725579172372818,
        -0.009560709819197655,
        -0.06407784670591354,
        0.07155293226242065,
        0.05937814712524414,
        -0.010344406589865685,
        -0.02978534996509552,
        -0.023784615099430084,
        -0.045772306621074677,
        -0.01416345126926899,
        0.006404954940080643,
        -0.05783969536423683,
        -0.06221144273877144,
        0.021661700680851936,
        0.03821427375078201,
        0.018877316266298294,
        0.06529764086008072,
        -0.0724777802824974,
        -0.16086874902248383,
        -0.0955997109413147,
        0.03762415423989296,
        0.028569640591740608,
        -0.011001944541931152,
        0.026768913492560387,
        0.016091806814074516,
        -0.0021745446138083935,
        0.018736936151981354,
        -0.041799791157245636,
        -0.018054114654660225,
        0.041395217180252075,
        -0.05240621045231819,
        0.011737220920622349,
        0.04154765233397484,
        0.07070206850767136,
        0.03496136888861656,
        -0.021894868463277817,
        0.003625121433287859,
        -0.05510009825229645,
        -0.06207767128944397,
        -0.051327504217624664,
        0.11287374049425125,
        0.03545159474015236,
        0.03541608154773712,
        -0.03908548504114151,
        0.02271369658410549,
        -0.07134485989809036,
        -0.01615036651492119,
        0.004322206135839224,
        -0.016548234969377518,
        0.06989952176809311,
        0.022752154618501663,
        -0.11573263257741928,
        -0.045739974826574326,
        -0.041924215853214264,
        -0.05210309848189354,
        -0.05836285278201103,
        0.02355830743908882,
        0.018604882061481476,
        -0.0008783239754848182,
        -0.025855835527181625,
        -0.03173600882291794,
        -0.024938266724348068,
        0.008379820734262466,
        -0.04142500087618828,
        0.007190887350589037,
        -0.09100352227687836,
        0.0039966413751244545,
        0.025224925950169563,
        0.016745900735259056,
        -0.07040277868509293,
        -7.73569248920734e-33,
        -0.0008254859712906182,
        0.023930253461003304,
        -0.040273427963256836,
        0.05996040627360344,
        0.050277795642614365,
        -0.03354361280798912,
        0.08070864528417587,
        0.053701385855674744,
        0.057844147086143494,
        -0.042522549629211426,
        0.019185779616236687,
        0.019244978204369545,
        -0.04154600575566292,
        0.01896527037024498,
        -0.0244558434933424,
        -0.1165338009595871,
        -0.03756549954414368,
        -0.04303015023469925,
        -0.011336395516991615,
        -0.0377923920750618,
        0.0717979148030281,
        0.02959572710096836,
        -0.023763611912727356,
        0.023060739040374756,
        0.01191630493849516,
        0.09010400623083115,
        0.058860886842012405,
        0.03466169163584709,
        0.03824669495224953,
        -0.06722192466259003,
        -0.03825234994292259,
        0.02472449280321598,
        -0.0008425798150710762,
        0.0364595428109169,
        0.08680082112550735,
        0.04536999389529228,
        0.09447004646062851,
        0.08310878276824951,
        -0.06172209233045578,
        -0.04451049491763115,
        0.07720715552568436,
        0.030553629621863365,
        -0.019962623715400696,
        0.03468969091773033,
        -0.036648090928792953,
        0.010230721905827522,
        -0.059454016387462616,
        -0.010936455801129341,
        -0.0011657779105007648,
        -0.025303347036242485,
        -0.03734944388270378,
        -0.0451618991792202,
        0.04461897164583206,
        0.01709531620144844,
        -0.00834798812866211,
        0.03789147362112999,
        0.03600210323929787,
        0.04557662457227707,
        -0.012933515943586826,
        -0.03464602306485176,
        0.07232765853404999,
        0.0026938875671476126,
        -0.08176528662443161,
        -0.05697537958621979,
        0.03276660665869713,
        -0.055194295942783356,
        0.051177699118852615,
        0.012895425781607628,
        0.01253387052565813,
        0.061463862657547,
        0.011090281419456005,
        0.02205779403448105,
        -0.036432936787605286,
        -0.0899028480052948,
        -0.03349186107516289,
        0.05327685922384262,
        -0.0394342765212059,
        -0.07146279513835907,
        0.04856863617897034,
        -0.049584485590457916,
        -0.029937434941530228,
        0.00760842626914382,
        0.0847773402929306,
        0.007140419911593199,
        0.11576072871685028,
        0.02735535055398941,
        0.06363233178853989,
        -0.03165274113416672,
        0.015381671488285065,
        -0.0376613512635231,
        -0.048510707914829254,
        -0.014193571172654629,
        -0.12924829125404358,
        0.0739443451166153,
        0.0213778056204319,
        -7.25803701584482e-08,
        -0.00043806718895211816,
        0.027008244767785072,
        -0.0016807601787149906,
        0.07526032626628876,
        0.026291141286492348,
        -0.057838790118694305,
        0.005606722552329302,
        -0.027938438579440117,
        0.056737352162599564,
        -0.040122754871845245,
        0.06288342922925949,
        -0.1224975660443306,
        -0.004815491382032633,
        -0.036976028233766556,
        0.08430686593055725,
        0.008606608025729656,
        -0.0780898779630661,
        0.0329035148024559,
        -0.06599907577037811,
        -0.07415919005870819,
        -0.08405095338821411,
        0.03637906163930893,
        0.07144492864608765,
        -0.048532310873270035,
        -0.030490802600979805,
        0.01069356594234705,
        0.05236442759633064,
        0.023691117763519287,
        0.10707999020814896,
        -0.014770285226404667,
        -0.08581927418708801,
        0.01273698452860117,
        0.04074244946241379,
        -0.054291777312755585,
        0.04303605109453201,
        0.006629913579672575,
        -0.041795432567596436,
        0.039210572838783264,
        0.09776172041893005,
        0.0030436438973993063,
        -0.05052986368536949,
        -0.028785886242985725,
        -0.016416514292359352,
        0.019637059420347214,
        0.08714906126260757,
        -0.01939353533089161,
        -0.03310714662075043,
        -0.07387151569128036,
        -0.02822434902191162,
        -0.015598130412399769,
        -0.022710653021931648,
        -0.05039939284324646,
        -0.07186449319124222,
        0.08034908771514893,
        0.047121141105890274,
        0.030807139351963997,
        -0.053229495882987976,
        0.007705500815063715,
        -0.002863672561943531,
        0.0705445259809494,
        0.04372643679380417,
        -0.08661963045597076,
        -0.029875416308641434,
        0.03949950635433197
    ]
}