{
    "id": "iuPfQCegbYo",
    "title": "Should You Build a Gaming PC from GameStop?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-05-14T18:05:15Z",
    "video_url": "https://www.youtube.com/watch?v=iuPfQCegbYo",
    "category": "Science & Technology",
    "tags": [
        "gamestop",
        "game stop",
        "austin",
        "austin evans",
        "gaming pc",
        "pc build",
        "gaming pc build",
        "computer",
        "gaming computer",
        "this is",
        "denki",
        "ken",
        "ken bolido"
    ],
    "views": 868222,
    "likes": 28174,
    "comments_count": 887,
    "description": "GameStop enables me to make questionable decisions. Weirdest Products Apple STILL Sells:  Ken's @Denki EDC video:   More shenanigans on @thisis:   My new F1 show @TheBackmarkers!  Subscribe for more!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=-2syLrlgiqo",
        "https://youtu.be/6iELH6aCrrQ",
        "https://www.youtube.com/thisis",
        "https://www.youtube.com/channel/UC6xg3-DQKl7-NL5TReUhs7g",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Red Alert, stop what you're doing because GameStop now has their brand new gaming PC section available on their website. This is clearly gonna go well. CPUs and processors, important, video cards, hard drives, and storage, motherboards, memory, and cases. It seems like all the ingredients I need. Jared, are these in MSRP prices on... - [Jared] It looks to be that they are. - To be fair, some of these are a little off. So there's an RTX 3050 for 400 bucks, which that's not right. So Micro Center just, you know, 'cause I wanna make sure that we're not getting ripped off here, Micro Center has 3070s and 3080s in stock, and honestly, these prices are relatively the same. I'm kind of feeling this RTX 3060. What CPUs do they have in stock? This selection's a little bit limited, and it's also all Intel. (laughs) (Jared laughs) 12700F, add to cart. Why do these- Jared. - What? - They have mostly AMD motherboards for only Intel CPUs. Why? Oh, okay. They have 980 PROs. They have 970 EVOs. They have Seagates. They have Samsung T7s. The Evo is PCI 3, yeah, it's PCI 3, but that's fine. That's like 12 cases to choose from. - [Jared] Oh, wow. - Wait, what is an Atrix tempered glass computer case? What, I'm caught. Oh, God, this looks terrible. This is gonna be like the white bread of gaming PCs. This is gonna be the missionary of gaming PCs. This is the basic white girl Starbucks order of gaming PCs. They have three pages of coolers. - [Jared] Oh, whoa. - [Austin] They have Z63? They got low profile coolers. They have a Kraken G12 GPU cooler. - [Jared] A what? - The Hyper 212 Black edition. 45 bucks for this? This seems pretty reasonable. All right, we just need a power supply. They have mostly Cooler Master and Intermax, but they have some NZXT. They have some EVGA. Little expensive on the power supplies though. Like they don't have any decent power supplies for less than like 100 bucks. So let's see our grand total. $1,670. - Oh. - This actually seems reasonable. Almost too good to be true. All right, so after a couple of weeks, GameStop packages have arrived. We opened all the boxes to make sure everything was actually here, but it's all here, don't worry. It's all in good shape. - Are you sure? - Yeah, of course. The case and the graphic card, both of which took almost two weeks to show up. Everything else showed up within like two to four days, which was fine. Item number one is nicely padded, a single stick of RAM. - Wait, just one? - Just one. - [Ken] Is that all you ordered? So Ken, here's the thing, right? - [Ken] Single channel? - No, we ordered two, but there's a quantity limit of one per, and they only had two kinds of RAM so we had to get one eight-gig stick and one 16-gig. - [Ken] It says here on the box, buy two for optimal performance. - They wouldn't sell me two. (Ken laughs) They said there was a quantity limit of one. In this box, we have a power supply. So far, we've had two boxes for two components, but whatever, that's fine. Some of our previous GameStop experiences have had, shall we say, less than stellar packaging. Here's our most exciting thing. - Graphics card? - Yes, sir. - [Ken] Did you wait for a drop or was this just readily available on the site readily - Readily available for, basically, MSRP. One of the issues that we had with this video was that they have all the parts you need to build a gaming PC. However, they have a like one or two of most parts. - I'm now back on GameStop's website a couple of weeks after we ordered these parts, and not only do they have Ryzen CPUs available. - Oh. - They also have AMD GPUs available. - Oh. - [Jared] So they've expanded on their selection in just the short amount of time. - They restocked with all the parts that we would've wanted to buy in the first place. - [Ken] We're missing the most important component, and honestly... - What separates GameStop from the rest? When I saw this, I just couldn't help, but spice up our gaming PC setup with the GameStop exclusive Pikachu and Zekrom GX Tag Team box. (Ken sighs) Wait, where are you going? - Home, Jared, is he really just gonna do this right now? - Yes, he is. He warned me ahead of time and he paid me extra not to tell you. - Look at all these packs. Do you see how many packs that is? Count 'em, that's 10. Ooh-hoo-hoo-hoo-hoo. We got the Alt Art Umbreon! (cicadas chirping) For context, the promo card? Worth $9, however, the Umbreon V, currently, raw as is sell for $90. So I'm gonna subtract $90 from the price of my GameStop PC build. That, kids, is how gambling works. (playful music) Ken. - Yes. - Welcome to the almost complete GameStop gaming PC build. - Hmm. - Thankfully, the colorway is great here because we had one choice and it was black with the side of black and more black. - I mean, these MSI boards are super basic, but they really get you everything for the 12th gen Intel, so. - Absolutely, and importantly, this is a DDR5 board. We got ourselves the i7-12700F without the graphics to save ourselves a few dollars to buy some more Pokemon cards. - I mean, you already have graphics here anyway. - Exactly. You can see, I mean, a very large card, but if you flip it over, you'll see that this is all just cooling, right? So this is the actual graphics card. This is all just excess sort of fins. - So what are you gonna do when this PC is built? Like are you going to benchmark it? Like what are you trying to accomplish here? Price to performance? - It's not about the performance. It's about the value that GameStop can provide. - Yeah, Ken. - Austin Evans, answering the questions that no one's asked. - Ken, stop making fun of my video ideas, okay? I'm trying to come up with interesting video concepts. Not everyone's gonna watch a Denki everyday carry video like every basic YouTuber from 2011. - Youtube.com/- - I'm feeling pretty good about this PC. Now with a 3060 on board, we've got plenty of performance for basically any game you wanna throw at it. We can, of course, support ray tracing and whatnot. Now the 3060, even today with graphics card pricing coming down, I think it's probably one of the best sort of bang for buck cards out there. Like I might be down a tire right now. It's a little tough. I don't have my maneuverability. - The wheel's not even moving, dude. - Well, yeah, cause I broke it. (Ken laughs) - That should have paused the game for a second. You hear that? Yeah, you don't 'cause it's dead silent, and that's without the window on. - Hey, hey, hey. - Yes, yes? - Can you stand over here? Stay where I'm at, come here. Now, stoop down a little bit, get to the eye level, get to eye level of the graphics card, come on. Does that look straight to you? - Yup. - It's 2022, Ken. - I don't need you to judge my PC. Is there a little bit of sag with the card? Maybe? Behold, my friends, the GameStop gaming PC of your dream. Not only does it have a- (PC clacking) What'd you bring a PowerSpec for? I'm not even done telling you why this is great. - [Ken] It's better. - What'd you mean it's better, the PowerSpec? - Yeah, this came pre-built. I did not have to pay the employees or I did, but it was included in the price, which is about the same as this. - Actually, do you not know the price of your system? - I actually don't know any, what's in this? (Ken and Jared laugh) - What Ken has is a PowerSpec pre-built PC which has a 3060 so similar to the GameStop system. However, it is lower end, as far as it has a Ryzen 5 instead of my Core i7. It's got a smaller 512 gig SSD instead of one terabyte, but it's also $1,200 as opposed to $1,600 like my system. I ran this whole parts list through PC Part Picker. - [Ken] Okay. - So PC Part Picker is an aggregator that puts together all kinds of PC components from across the web and gives you the best possible pricing, right? So for example, if I want to build this exact PC using PC Part Picker, I have to order from Newegg, GameStop, Amazon, Amazon, GameStop, Amazon, NZXT, and EVGA directly, and I would save a grand total of $5 compared to just buying it from GameStop. GameStop is the cheapest place on the internet to buy the SSD, to buy the cooler, and everything else is within a dollar or two. It's almost as if GameStop has- (sarcastic coughing) Sorry, great deals. (sarcastic coughing) Sorry, I couldn't say it. I just couldn't say it with a- GameStop has great deals and you should build a gaming PC at GameStop. - Breathe, breathe, breathe. (sarcastic coughing) Breathe, breathe. - Are you trying to say that GameStop is bringing power to the players? - Okay, (indistinct). - Oh, my God, Jared, - There's only one thing left to do. One thing, one thing only. I'll be right back. Wish me luck. (car engines revving) (indistinct chattering) (Ken laughing) (bell dings) - [Austin] Hi, Can I trade something in? I'd love some store credit.",
    "transcript_keywords": [
        "Red Alert",
        "GameStop",
        "gaming",
        "card",
        "Part Picker",
        "Ken",
        "Micro Center",
        "Graphics card",
        "Alert",
        "parts",
        "yeah",
        "Graphics",
        "Jared",
        "GameStop gaming",
        "Breathe",
        "power",
        "gaming PCs",
        "buy",
        "build",
        "Intel"
    ],
    "transcript_entity_values": [
        "Atrix",
        "45 bucks",
        "12700F",
        "NZXT",
        "Picker",
        "5",
        "Intermax",
        "Jared",
        "3060",
        "1,600",
        "AMD",
        "PowerSpec",
        "three",
        "3080s",
        "EVGA",
        "Pikachu",
        "Austin Evans",
        "YouTuber",
        "first",
        "10",
        "RAM",
        "i7-12700F",
        "Worth $9",
        "2011",
        "Amazon",
        "Core",
        "Ken",
        "Austin",
        "16-gig",
        "Starbucks",
        "400 bucks",
        "GameStop",
        "Seagates",
        "two",
        "AMD",
        "MSRP",
        "980",
        "12",
        "512",
        "Pokemon",
        "970",
        "Samsung T7s",
        "almost two weeks",
        "one",
        "Zekrom GX Tag Team",
        "90",
        "second",
        "1,670",
        "- Ken",
        "less than like 100 bucks",
        "Newegg",
        "one terabyte",
        "Intel",
        "Micro Center",
        "Ryzen 5",
        "Cooler",
        "Kraken G12 GPU",
        "SSD",
        "1,200",
        "2022",
        "The Hyper 212 Black edition",
        "Ryzen",
        "3070s",
        "only one",
        "One",
        "12th",
        "Denki",
        "Evo",
        "MSI",
        "3050",
        "today",
        "a few dollars",
        "a couple of weeks",
        "3"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "LAW",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        0.0009558923775330186,
        -0.03667937219142914,
        -0.022091597318649292,
        -0.0598813034594059,
        0.011019740253686905,
        -0.0034953525755554438,
        0.025999179109930992,
        0.032910291105508804,
        0.005489210598170757,
        0.04657033085823059,
        -0.03100081905722618,
        -0.005404514726251364,
        -0.024046124890446663,
        0.004193054046481848,
        0.016576625406742096,
        -0.023150501772761345,
        0.08967253565788269,
        -0.01488148421049118,
        -0.04141656309366226,
        0.04088842496275902,
        -0.06874919682741165,
        -0.05647037550806999,
        -0.05980878323316574,
        0.006881695706397295,
        0.01491317804902792,
        0.08948054164648056,
        0.0410163588821888,
        0.03563582897186279,
        -0.06704617291688919,
        0.006786651443690062,
        -0.007748754229396582,
        0.011622731573879719,
        0.026793330907821655,
        -0.010829045437276363,
        0.10832103341817856,
        -0.0051833102479577065,
        -0.012155515141785145,
        -0.059756334871053696,
        -0.05464567989110947,
        -0.11054757982492447,
        -0.036086536943912506,
        -0.021046999841928482,
        -0.04070758447051048,
        0.09359002113342285,
        0.01263478770852089,
        -0.005110802594572306,
        -0.027066003531217575,
        0.017934637144207954,
        0.009820842184126377,
        0.007668296340852976,
        -0.062389273196458817,
        -0.06759978085756302,
        0.0008145117317326367,
        -0.034839924424886703,
        -0.058514032512903214,
        -0.002528551034629345,
        0.01731090433895588,
        -0.03158662095665932,
        0.06319593638181686,
        -0.023098357021808624,
        0.021967299282550812,
        -0.1544739454984665,
        -0.004304083529859781,
        0.07925958186388016,
        0.003389795310795307,
        -0.04691191017627716,
        -0.03193514794111252,
        -0.0113241421058774,
        0.04229852929711342,
        0.018162278458476067,
        0.007784922607243061,
        -0.04322736710309982,
        0.015414980240166187,
        0.0401233471930027,
        -0.023686518892645836,
        0.07249022275209427,
        0.07581373304128647,
        -0.0516965389251709,
        0.028653722256422043,
        0.0502617247402668,
        0.02417396940290928,
        0.025147218257188797,
        0.002124590100720525,
        -0.029158230870962143,
        0.0385301373898983,
        0.013819891028106213,
        0.03471861034631729,
        0.025778742507100105,
        0.016993936151266098,
        -0.05194011703133583,
        0.01313887070864439,
        0.08937843888998032,
        0.07718218863010406,
        -0.004916403442621231,
        0.050573136657476425,
        0.056051723659038544,
        -0.07477794587612152,
        -0.06678052991628647,
        0.018313584849238396,
        -0.017524369060993195,
        -0.036775004118680954,
        0.02170170657336712,
        0.04237009584903717,
        0.003710163524374366,
        -0.022940967231988907,
        -0.04995661973953247,
        -0.09566677361726761,
        0.09707392007112503,
        0.019737521186470985,
        0.0031752935610711575,
        -0.057177577167749405,
        0.0033656980376690626,
        -0.07961750775575638,
        0.025864586234092712,
        0.01683349534869194,
        -0.004492582753300667,
        -0.012903648428618908,
        -0.04146575927734375,
        0.1182602122426033,
        -0.00682457210496068,
        -0.0011365337995812297,
        -0.028856635093688965,
        -0.01712772063910961,
        -0.00934254378080368,
        0.06956081092357635,
        0.04841367155313492,
        -0.10127780586481094,
        3.650542154858754e-33,
        -0.03969129920005798,
        0.1146036833524704,
        -0.051424529403448105,
        -0.039156585931777954,
        -0.04459632933139801,
        -0.002817755565047264,
        0.11263459175825119,
        0.027512405067682266,
        0.04269362986087799,
        0.06129777431488037,
        -0.08462130278348923,
        0.0676073357462883,
        -0.06242261826992035,
        0.07519055902957916,
        0.05868358165025711,
        -0.040366727858781815,
        0.02811674401164055,
        -0.027918893843889236,
        -0.01759818010032177,
        0.027622152119874954,
        -0.022839799523353577,
        0.014538375660777092,
        0.04734622314572334,
        -0.05344748497009277,
        0.002855179365724325,
        -0.025764156132936478,
        -0.07760218530893326,
        0.007453054189682007,
        0.054809246212244034,
        0.002142590470612049,
        -0.05773896723985672,
        -0.028237441554665565,
        -0.016241924837231636,
        -0.03344091773033142,
        0.03606176748871803,
        0.019712986424565315,
        -0.06930727511644363,
        -0.09192085266113281,
        -0.003384294454008341,
        0.10494024306535721,
        -0.08724169433116913,
        0.10525514930486679,
        -0.07890186458826065,
        -0.08102484047412872,
        0.031283020973205566,
        0.04684612154960632,
        -0.029670214280486107,
        -0.06434515118598938,
        -0.024643054232001305,
        -0.007779361214488745,
        -0.08405465632677078,
        0.08131639659404755,
        0.07287578284740448,
        0.024579523131251335,
        -0.0575195774435997,
        -0.06827885657548904,
        0.025976695120334625,
        -0.047299113124608994,
        0.09823520481586456,
        0.07405994832515717,
        -0.09076929837465286,
        -0.028971033170819283,
        -0.024480575695633888,
        0.006614684127271175,
        -0.08219396322965622,
        0.02405036985874176,
        0.08021391928195953,
        0.07154330611228943,
        -0.08877559006214142,
        0.04738524928689003,
        0.06763143092393875,
        -0.048186950385570526,
        0.07102708518505096,
        -0.04100026935338974,
        0.04194865748286247,
        0.030705926939845085,
        -0.0635993629693985,
        0.0140397222712636,
        -0.03870438039302826,
        -0.04382946342229843,
        0.0279828067868948,
        0.03951365500688553,
        -0.07081557810306549,
        0.054456502199172974,
        -0.0006975959986448288,
        0.025702500715851784,
        -0.019342884421348572,
        -0.005340527277439833,
        0.030881067737936974,
        0.04379544407129288,
        -0.08791740983724594,
        0.0012891503283753991,
        -0.04419104754924774,
        0.06835905462503433,
        -0.01630314812064171,
        -4.256148028194766e-33,
        -0.028719307854771614,
        -0.047257594764232635,
        -0.015037119388580322,
        0.05909872427582741,
        -0.06032990664243698,
        -0.010774503462016582,
        -0.030497970059514046,
        -0.06602554768323898,
        0.05842902511358261,
        -0.018957508727908134,
        0.0069646043702960014,
        0.08123987168073654,
        0.011222436092793941,
        0.025923116132616997,
        -0.06811295449733734,
        -0.04375823214650154,
        0.0007107407436706126,
        -0.04787302017211914,
        0.09118833392858505,
        -0.09372352808713913,
        0.03775336220860481,
        0.05023086816072464,
        -0.055816251784563065,
        0.01187273021787405,
        0.025675255805253983,
        0.011839977465569973,
        -0.011427952907979488,
        -0.008812902495265007,
        0.0641399696469307,
        0.006401798687875271,
        -0.026872338727116585,
        -0.008990496397018433,
        0.09629456698894501,
        0.08712117373943329,
        0.08763258159160614,
        0.022185560315847397,
        0.03913608565926552,
        -0.004721650388091803,
        0.02107890136539936,
        0.04033176973462105,
        0.08363903313875198,
        0.025373117998242378,
        -0.10168229788541794,
        0.007610434666275978,
        0.05684611573815346,
        0.0018318321090191603,
        0.06256918609142303,
        -0.040227968245744705,
        0.06848252564668655,
        0.015522739849984646,
        0.002890276722609997,
        -0.03387298062443733,
        0.030661018565297127,
        0.003536543110385537,
        -0.07749298959970474,
        -0.06300310045480728,
        -0.02213148958981037,
        0.0719868466258049,
        -0.012077774852514267,
        -0.05782756954431534,
        0.08833499252796173,
        0.0720960944890976,
        -0.034286607056856155,
        -0.05242167040705681,
        0.01994345709681511,
        0.012923815287649632,
        0.09508512914180756,
        -0.00490107387304306,
        -0.04019230231642723,
        -0.015076014213263988,
        -0.07665349543094635,
        -0.09777306020259857,
        -0.02312212809920311,
        -0.06597282737493515,
        -0.0533454529941082,
        0.04822907969355583,
        0.00755076389759779,
        -0.011175747960805893,
        0.049050796777009964,
        -0.01618094928562641,
        0.027437357231974602,
        0.02072826586663723,
        0.059083931148052216,
        0.01994619145989418,
        0.07975185662508011,
        0.03538490831851959,
        -0.01977362483739853,
        -0.04549601674079895,
        -0.10271361470222473,
        -0.02417559176683426,
        -0.0496593676507473,
        0.002981076715514064,
        0.010504665784537792,
        0.05974813550710678,
        -0.03157702088356018,
        -5.4109975167193625e-08,
        0.09590994566679001,
        -0.05190093070268631,
        -0.013911835849285126,
        0.04019930958747864,
        0.0010548692662268877,
        -0.06696254014968872,
        0.04246175289154053,
        -0.026818053796887398,
        0.03464255854487419,
        0.06707677990198135,
        0.05715516582131386,
        -0.06940589100122452,
        -0.05358500778675079,
        0.0025753816589713097,
        -0.005758254323154688,
        0.09697690606117249,
        -0.049595773220062256,
        0.014843452721834183,
        -0.02356530725955963,
        0.008231674320995808,
        -0.042917802929878235,
        0.09156620502471924,
        0.09365089982748032,
        -0.033438537269830704,
        -0.055276770144701004,
        0.01185951754450798,
        0.0123535031452775,
        0.03512049838900566,
        0.04356628283858299,
        0.024727074429392815,
        -0.06044098362326622,
        -0.003963016904890537,
        0.07828553020954132,
        -0.016873043030500412,
        0.016986846923828125,
        -0.0974254384636879,
        0.015942757949233055,
        0.0675254538655281,
        0.09566167742013931,
        -0.02766885794699192,
        -0.09952124953269958,
        -0.12082937359809875,
        -0.024434609338641167,
        -0.0346083827316761,
        -0.001792475231923163,
        -0.04019295051693916,
        -0.1443345993757248,
        -0.03671495243906975,
        0.0005311199347488582,
        0.005288409534841776,
        -0.03320339694619179,
        0.028604162856936455,
        -0.036009203642606735,
        0.04354812577366829,
        0.0025285466108471155,
        -0.03692063316702843,
        -0.034352418035268784,
        0.005350304767489433,
        0.05026795342564583,
        -0.018074966967105865,
        0.03599318861961365,
        -0.11003787815570831,
        0.008408614434301853,
        -0.0005874030175618827
    ]
}