{
    "id": "iuzbktIA60s",
    "title": "All the other moms will be jelly - Lexus RZ450e",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-25T21:28:27Z",
    "video_url": "https://www.youtube.com/watch?v=iuzbktIA60s",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Lexus",
        "Electric car",
        "Electric Lexus",
        "RZ450e",
        "Driving",
        "Car"
    ],
    "views": 250306,
    "likes": 10228,
    "comments_count": 824,
    "description": "Better sleep makes a better you! Check out Eight Sleep at  and use code LMG for $150 off the Pod Cover.  The Lexus RZ450e sure is pretty, but does it have the power and range people expect from their EVs? Alex is here to check out the ultimate mom vehicle to see if you get enough of the benefits of an EV or if this SUV is more just for looks.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Lexus made this car look goooooooood 0:40 Exterior impressions 4:00 Interior impressions 6:20 Reverse go beeeeep 6:52 Sponsor - Eight Sleep! 7:20 Driving impressions 10:15 Speakers 11:10 Lexus infotainment 14:00 Sending it through corners 15:00 Overall thoughts 16:02 Pricing 16:56 Outro",
    "description_links": [
        "https://www.eightsleep.com/lmg",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- The Lexus RZ. We've got it here and it's... Well, it looks really good. This might be the first time that a car brand has gone from having a big old grill to turning it into an electric car and actually improved the looks while maintaining the same basic styling. I think this looks absolutely fantastic. And you do get a lot of looks. It just isn't the looks from the type of people that you normally would expect. You drive by a rich white mom in this thing and like she is just rubber necking so hard. Little Timmy can scooter straight into the ditch. She is not going to notice. She is looking at this Lexus. That is how good it looks. One detail that's super cool is this Lexus logo. So first of all, it lights up at night and it looks absolutely fantastic. Also, if you look very close, there's a bunch of tiny little wires and that's because it's heated up. That will allow you to get rid of snow, water, that sort of stuff, which is important not only so you can see the fancy lit up logo, but also behind it is radar, which it uses for adaptive cruise control. So that in conjunction with your camera allows it to have a really, really great adaptive cruise system. Moving around the side, you can see that we've got the 18-inch rims, which are the ones that you want because that gives you about 350 kilometers of range. When you step it up to the 20s, you only get about 300, which is pretty oof. Of course, medium quality range can be made up for if you have really fast charging, which this does not have. So we have a 70 kilowatt hour battery in here, which compare that to like an Ioniq 5, it's got 77, and we only have 150 kilowatt charging compared to the competition, which is more like 300. This is very disappointing 'cause even though this has a bit of a smaller battery, charging it from zero to 80 is going to take you about 50 minutes whereas in some other cars in this class, it's more like 18. (Alex sighing) Yeah, not great. One thing that's kind of strange are the door handles. They don't do normal door handle things. Instead, you push inside and then it electronically opens it. If you don't trust that, of course, you do have a real handle down here. But it works really quite well and you don't have the problems of like people like in Teslas where they just don't know how to operate your door handles. It is unfortunate that you don't get the aerodynamic benefits of other cars that have flush door handles, but it is really easy to use. Moving towards the rear, I really like the way that they visually joined the windows to the rear windscreen, and also, these little winglets, I absolutely love. And they are still functional. Apparently they help with turbulence over the back, and given how just clean this windscreen is after a week of driving it, I think they have really achieved it. Also, better aerodynamics means less wind noise while you're driving. I think they did a really good job there. Around back, the excellent styling continues with the light bar that goes all the way across and I just wanna quickly shout out this paint. It is white, but it has some little flecks that really bring it all together. Also, the 450 in the RZ here stands for it being about equivalent to a 4.5 liter V8. Opening up the trunk, you get quite a bit of space. Now, we have the base model, so we don't have the fancy lift gate, but whatever. Trunk's nice and big, and although you don't get a frunk, in talking to Lexus, their rationale is pretty decent. What they wanted to do is have the inverter and all the electronics on top and that allowed them to give, first of all, more leg room and general passenger space, but also, they said that they could've given us a frunk, but the packaging would've made it small and it also would've given them a lot less space in the back and they think that this is way more functional. So we look down here and we have just a lot of very functional space. You can throw your charging cable in there and also like a real backpack. Oh, is there spots here? Oh, cool. Here's your tire repair kit. Hopping into the backseat, you get to see just, well, first of all, how nice the materials are. Like, all up here, this is just a really nice, it's not a leather, but it feels a lot like leather. And in the higher end versions of this, they even have a light that sort of shines a cool little pattern up on here. It is quite neat. Also, we have very standard wrist rest. This is just generally quite comfortable. I have a good, I don't know, three inches of space up here. I'm six feet and I could very easily just sit back here for a big old road trip. Also, of course, back here, you get two USB type C chargers for you to charge up your phone, or in our case, a camera. Hopping into the front seat, these seats are super comfortable. I personally don't love the feel of these seats. I feel like they're designed for someone that's a little bit smaller than myself. But that said, I know that like my mom and all my aunts bought like RAV4's and stuff like that for specifically this kind of a seat feel and they absolutely love it. Also, everywhere that you touch feels really quite good. Like, this center console, the way that they've done the softness of this is just great. And also, one cool kind of trick, it goes both ways. What's not so cool, though, is that they don't have a glove box. There's literally nothing there. Now in the higher trims of this, there's a radiant heater there so it kind of feels like you have a blanket over your legs while you're driving around, which is pretty neat, but I also kind of just want a glove box, guys. Now talking to Lexus, they did say that instead of giving you a glove box, they've given you extra space down here below the center console, but it's a lot smaller than other cars that I've seen that have done this before and it's not the most functional. Like, I tried to put my falafel down there and it didn't really fit. At least did make the center console storage nice and big, though. You can fit a whole water bottle in there. Lttstore.com. One piece of storage that I never thought I'd complain about, though, is the sunglasses holder. Thank you, Lexus, for having one. It's the first car I've had in awhile that has a proper sunglasses holder and I feel like they're very important. It's not so great, though, is that every time that I use it, I feel like I'm one of those infomercial people 'cause it's just too dang small and I don't even have very large sunglasses. (cameraman laughing) (Alex laughing) All right, let's take it for a drive. Although first, I wanna put it in reverse because, yeah, it always makes that sound right there to make sure that you know it's in reverse. I'm the one that just put it in reverse. I know it's in reverse. I don't need this sound the whole time. Apparently, the dealer can probably turn it off. Oh my god, that's annoying. Also, while we're in reverse, this backup camera is probably the worst that I've seen in years. It looks okay right now, but it is just always super dark. It's very grainy. I don't like it very much. Anyway, let's put it in drive. - [Alex Voiceover] Thanks to Eight Sleep for sponsoring today's video. Sleep is important and temperature is the most important factor in improving your sleep. Eight Sleep's products allow for you to control the temperature on both sides of the bed, adjustable from 55 to 110 degrees Fahrenheit or 12 to 43 degrees Celsius for those of you that like good units. It is perfect for partners with different preferred temperatures. Features such as temperature control and sleep pattern insights are all accessible through their easy to navigate app. Head over to the link below and use the code LMG for a nice discount on the pod cover. - In this, we have 308 horsepower, 320 foot pounds of torque. You got a bit of a squat. And it turns out it'll spin the front tires quite a bit. Five seconds, zero to 60. This thing is proper quick for what it is. Of course, something like the GV60 will absolutely destroy it, but at the same time, it has more than enough power for what I think the average Lexus owner is going to want to do. You are not buying this car because of how fast it is. That's just kind of a bonus. You're buying this car because of how comfortable and quiet it is, and it hits most of that pretty well. So, at lower speeds, the ride's a little bit on the harsh side, like if you're hitting bumps, potholes, this is 4,200 pounds of car. It's not going to be able to have like the sort of supple suspension that you want without it having a ridiculous amount of travel. That said, though, once you get above about 60 kilometers per hour or so, it's a really nice spot to put in a bunch of miles. The sound isolation is quite good, but at the same time, it's very similar to what you might find on Ioniq 5 or an Ioniq 6. So it isn't like a standout like I was kind of hoping it would be. That said, though, it's just a very, very simple car to drive. Like, if you're looking for a driving experience, this is not what you want. But like the steering, it's very light, it's very accurate, it very simply does what you want it to do in a very simple way. I can see why this is the car where they want to have drive-by wire steering. Right now, there's a steering column, goes down to the wheels, but in the future, they want to have a yolk and then have a proper drive-by wire system so you only have to turn it like this far to get full lock. But at the same time, do you really trust not having a steering column? Like, Andy, do you want no steering column in your car? - [Andy] No. (Alex laughing) - That said, it's not like they're going to be forcing you to have the drive-by wire yolk system. You can still get a normal wheel like we have right here and this wheel is pretty good. Like the leather, well it's not leather, this is all vegan materials, so they use petroleum instead of an animal, but this does feel really good. It has a good amount of squishiness in a way that makes it feel premium, but it's not like the sausage casing feeling of the GV60 steering wheel. That was ugh. Ugh! One of the biggest problems with the driving experience I feel is this gauge cluster because it sucks. It's terrible. It's really disappointing because Lexus are the ones that pioneered digital dashes and they haven't changed it since. You can see the fricking pixels from here, guys. It doesn't get bright, it looks like trash, and there's just a lot of clutter on the sides. I don't know. Now, to describe this sound system in three words, it sucks ass. Yeah, it is absolutely terrible. Sam, or audio engineer, had a look at it and it not only has a lot more bass than you want, but no low end bass, so you only have high bass there. It also has extra treble. EQ is basically useless because it doesn't adjust the right bands and... (upbeat electronic music) I think that the worst audio file diss that I can possibly have for this is it sounds like you're listening to speakers. Ugh! It is so fricking terrible. But what's really interesting is the fact that it sounds a lot better if you're not using Android Auto or Apple CarPlay. In order to get from Android Auto to the Lexus infotainment, you need to press this once, go there. Everywhere else, you have just a dedicated hard button to get back to like the menu that you want and, ugh, it's so unresponsive. Oh my god, you piece of (bleep). There we go. We're back in the system. So when you're in Lexus's infotainment everything that you want is on the left right here. You can very easily be like, okay, I want my nav, settings, yada, yada, yada. If they very simply left this bar right here around when you were in Android Auto, it would be totally fine. But instead, you go in here, it goes away. Excellent. That's everything that I would want over here is gone. What could make it a lot better is that they have this menu right here where it has a bunch of different stuff, but it is 100% not utilized. It decides what's frequently used. It doesn't have icons, so you just have to read it while you're like driving along the road, and most of it's nothing. Nothing here. It's a really large missed opportunity that kind of just is sort of what this whole infotainment feels like. They just kind of needed to actually use it and improve it to the point where it's good and competitive with everything else, and instead, it's just annoying and you're left hitting this. Ugh. Yeah, that's really fast there, Lexus. Anyway, I got on this tangent in the first place because the sound quality in Android Auto or Apple CarPlay is abominable. And it gets a lot better when you connect it to Bluetooth. So, let's just have a listen here. (upbeat electronic music) Terrible! It's actually (bleep). Now, if we turn it over to Bluetooth, continue. (upbeat drum music) I'm connected to you, car. Look, Lexus RZ, shows it right there, shows that it's playing on Lexus RZ. Please connect your Bluetooth. Oh my god. (Alex growling) Well, anyway, the Bluetooth doesn't work, but whatever they did for the digital audio compression in Android Auto and Apple CarPlay is unacceptable. It sounds terrible and it sounds a lot clearer when you just simply connect through Bluetooth, and I don't know why. But whatever you did, Lexus, please fix it because I'm just saying don't buy this car with this sound system because it (bleep) sucks. And Lexus has told me that over the air updates are possible on this and it would be able to fix stuff like this. Never trust someone that they will fix it later because a lot of the time, they don't. Where were we, Andy? Oh, the climate control. We can talk about that. It's actually pretty good. They have these knobs down here, in the center, they have a little screen. It's kind of like the Mustang Mach-E. It's overall pretty nice. There is a climate screen right here, but there's nothing of substance. So I don't know why they had like a whole dedicated menu, but both of these are complete misses. Ah, whatever. The Toyota Mirai and like basically every Lexus that I've driven has been so good at very simply getting the driving experience correct. Like, maybe it isn't the most engaging, but there's like hard buttons for everything that you want and it just works. This does not do that and it doesn't even have like the fancy, they rethought the interior for it being electric vibe. It's just poorly implemented. Let's find some corners. (Alex giggling) The steering in this is interesting because on one hand, it is very accurate and you can trust it quite a bit, but at the same time, it's giving me absolutely nothing. So like I can turn into this corner and if they just very simply had like a spring on the other side of the wheel, I would believe it's the same. Like, that's how little feedback I'm getting through the system. That said, I don't think I can complain about it too much because of the target audience of this car. It is very easy to drive. Like, they don't have one pedal driving, which I personally don't like, but at the same time, the throttle pedal is tuned really well. So, like, Andy, have you been in the car with like someone that's bad at driving with a Tesla with one pedal driving on? - Oh my god, yeah. - It's so bad. - It's just (groaning). Whereas like you chuck that person into this car and you're going to have a pretty good experience. And that's like the perfect way to put it. It feels like you're driving a gas car, a very good gas car 'cause most of 'em don't have this kind of pickup, but it does just feel like you're driving a gas car, which actually, that's just kind of the summary of this. This car seems like it is very much for people that want a Lexus or a Toyota and have owned a Lexus or a Toyota for their entire life. They just now simply want that, but electric. That said, though, I don't know how good of a plan that is for Lexus/Toyota because if there's one thing that electric car owners have shown is that they have very little brand loyalty. It's just a really disappointing blend of mixing the old and new together. Something like the G80. It did a fantastic job at just being a combustion car that they turned into an electric one and it doesn't really have any of the downsides of an electric car, but it also doesn't have any of like the really fancy nonsense. This right here just kind of feels like they went halfway and I don't know who wants that. So, finally, the price. This one right here, our base model, comes in at $68,000 Canadian, and for that, don't buy it. You don't have parking sensors in a fricking $68,000 car? Come on, guys. Especially with the sound system, I really cannot recommend this. That said, though, if you step it up to the executive package where you have, you know, all the parking sensors, nice moon roof, you've got the Mark Levinson sound system that completely solves that issue, I could see a really good argument for getting this. It is very comfortable, incredibly easy to drive, and just overall a pretty nice car to have. But that'll cost you $84,000 Canadian, which is pretty rough. As an electric car, I don't love the RZ. But that said, Lexus doesn't need a fantastic electric car. They already have a bunch of really fantastic plug-in hybrids, so maybe instead look into one of those. I know that we want to very soon, so hit like, get subscribed, and just have a great old day. And it does look really good, doesn't it?",
    "transcript_keywords": [
        "Lexus",
        "car",
        "good",
        "Android Auto",
        "kind",
        "electric car",
        "lot",
        "driving",
        "feel",
        "pretty",
        "time",
        "nice",
        "sound",
        "system",
        "feels",
        "pretty good",
        "sound system",
        "electric",
        "Auto",
        "Android"
    ],
    "transcript_entity_values": [
        "77",
        "nice moon",
        "110 degrees Fahrenheit",
        "about 50 minutes",
        "$84,000",
        "about 60 kilometers per hour",
        "Ioniq 5",
        "320 foot pounds",
        "RAV4",
        "Sam",
        "150 kilowatt",
        "RZ",
        "100%",
        "Mustang",
        "three",
        "68,000",
        "One",
        "three inches",
        "chuck",
        "60",
        "six feet",
        "one",
        "USB",
        "LMG",
        "Tesla",
        "more like 300",
        "4.5 liter",
        "308",
        "Alex",
        "Toyota",
        "Five seconds",
        "about 300",
        "Andy",
        "Ioniq 6",
        "18",
        "80",
        "Timmy",
        "Apple CarPlay",
        "Ioniq 5",
        "70 kilowatt hour",
        "Mark Levinson",
        "Bluetooth",
        "first",
        "43 degrees Celsius",
        "4,200 pounds",
        "about 350 kilometers",
        "two",
        "Lttstore.com",
        "a bunch of miles",
        "55",
        "Mirai",
        "G80",
        "Canadian",
        "Teslas",
        "EQ",
        "450",
        "Android Auto",
        "18-inch",
        "Eight",
        "12",
        "a week",
        "Apple CarPlay",
        "Alex giggling",
        "years",
        "Lexus",
        "today",
        "zero"
    ],
    "transcript_entity_types": [
        "DATE",
        "GPE",
        "QUANTITY",
        "TIME",
        "MONEY",
        "QUANTITY",
        "LAW",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "EVENT",
        "TIME",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "NORP",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.03238753229379654,
        0.04259614273905754,
        0.03085336461663246,
        -0.005595829337835312,
        0.07146018743515015,
        0.07160812616348267,
        -0.010607237927615643,
        0.07862000167369843,
        -0.018489252775907516,
        0.007711360696703196,
        0.03829941898584366,
        -0.0014105269219726324,
        0.04877445474267006,
        -0.054560352116823196,
        0.04916242137551308,
        -0.03349931538105011,
        0.1278557926416397,
        -0.060195960104465485,
        -0.03367392346262932,
        0.0009857566328719258,
        0.0036450130864977837,
        -0.06564804166555405,
        0.04501448571681976,
        0.015533438883721828,
        -0.0062292288057506084,
        0.05628889054059982,
        0.011377247050404549,
        -0.011887720786035061,
        -0.01807975210249424,
        -0.050938259810209274,
        -0.003697854932397604,
        0.029439743608236313,
        0.013238510116934776,
        -0.053748078644275665,
        -0.021768081933259964,
        -0.014079791493713856,
        -0.013810367323458195,
        -0.059850674122571945,
        -0.055423229932785034,
        -0.026674970984458923,
        -0.04276381805539131,
        -0.0751228928565979,
        -0.04357122257351875,
        -0.011448963545262814,
        -0.01650557480752468,
        -0.016037406399846077,
        0.047986771911382675,
        -0.029864689335227013,
        0.02542862854897976,
        -0.005845915526151657,
        0.014250298961997032,
        -0.05215642973780632,
        0.023576296865940094,
        -0.03271465376019478,
        -0.05707421898841858,
        -0.004594384226948023,
        -0.08964826911687851,
        -0.011074674315750599,
        0.024054376408457756,
        -0.013433708809316158,
        0.015171077102422714,
        0.010971838608384132,
        -0.04022396355867386,
        0.04821789637207985,
        -0.029911335557699203,
        -0.03666248917579651,
        -0.05168827995657921,
        0.0821199119091034,
        -0.01802939735352993,
        0.0400824099779129,
        0.03044205531477928,
        0.02916986495256424,
        0.0016756957629695535,
        0.055431999266147614,
        0.009919129312038422,
        0.022032132372260094,
        0.15314386785030365,
        -0.07677629590034485,
        0.008799022063612938,
        -0.020107664167881012,
        -0.013515395112335682,
        -0.042291682213544846,
        -0.04353467747569084,
        0.031156843528151512,
        0.04387814179062843,
        -0.0059357210993766785,
        0.06927534192800522,
        0.003841183613985777,
        -0.03387891873717308,
        0.05612996220588684,
        0.017075806856155396,
        0.018166113644838333,
        0.07454927265644073,
        -0.009988884441554546,
        -0.05654339864850044,
        0.017313314601778984,
        -0.01773666962981224,
        -0.09561502933502197,
        -0.06011730805039406,
        0.03857198730111122,
        0.037788812071084976,
        0.08289224654436111,
        0.055373795330524445,
        0.048965711146593094,
        -0.06175708770751953,
        -0.057927247136831284,
        0.004093191586434841,
        0.014022033661603928,
        0.03278522938489914,
        0.00555379455909133,
        -0.04049297422170639,
        -0.01879480667412281,
        -0.089696004986763,
        0.022710561752319336,
        -0.11026931554079056,
        -0.014083256013691425,
        -0.00834671687334776,
        0.04787683114409447,
        0.13852056860923767,
        -0.019489528611302376,
        0.0030434385407716036,
        -0.05259808897972107,
        0.06454186886548996,
        0.0020741515327244997,
        0.038684722036123276,
        -0.013945020735263824,
        -0.04605909436941147,
        1.968244756363213e-35,
        -0.13647805154323578,
        0.03822731971740723,
        -0.04177671670913696,
        -0.0031659372616559267,
        0.0486627072095871,
        0.0735350251197815,
        -0.023778334259986877,
        0.03848705440759659,
        -0.035211216658353806,
        0.07049757987260818,
        -0.051816072314977646,
        0.03241068124771118,
        -0.00041364177013747394,
        0.0019414157141000032,
        0.02282324992120266,
        -0.04955708608031273,
        -0.05988524109125137,
        0.038241561502218246,
        -0.09480814635753632,
        -0.014789214357733727,
        -0.05290503799915314,
        -0.0004566625284496695,
        0.053537845611572266,
        -0.048632632941007614,
        0.10248184949159622,
        -0.04094453901052475,
        0.09097930043935776,
        -0.05089326575398445,
        -0.002657050732523203,
        0.03544294461607933,
        -0.10021550208330154,
        0.00371576938778162,
        -0.008092986419796944,
        -0.04124036431312561,
        -0.034430716186761856,
        -0.00048032807535491884,
        -0.07414190471172333,
        -0.11022498458623886,
        -0.05160164460539818,
        0.010141631588339806,
        -0.052065975964069366,
        -0.03626937419176102,
        -0.05570222809910774,
        -0.06311620026826859,
        -0.031044790521264076,
        0.05180051177740097,
        0.08684006333351135,
        -0.012281032279133797,
        -0.019536670297384262,
        0.04617434740066528,
        -0.039252087473869324,
        -0.022886406630277634,
        -0.10950519889593124,
        -0.06365223228931427,
        -0.07067450881004333,
        -0.00201743608340621,
        0.001155823701992631,
        0.01728297956287861,
        0.03530445322394371,
        -0.02308325469493866,
        -0.04687159135937691,
        0.0208320003002882,
        0.07754434645175934,
        -0.08254527300596237,
        0.004170481581240892,
        0.0970740020275116,
        -0.03880183771252632,
        -0.08864358067512512,
        -0.037161435931921005,
        0.029928799718618393,
        0.03403284028172493,
        -0.04982256889343262,
        0.054584745317697525,
        -0.01411023922264576,
        0.06539478152990341,
        0.07677411288022995,
        -0.018438803032040596,
        -0.015640676021575928,
        0.028322771191596985,
        -0.037703126668930054,
        -0.04966726154088974,
        0.05610018968582153,
        0.05221531540155411,
        0.030090436339378357,
        0.14288875460624695,
        -0.06502076238393784,
        -0.04402986913919449,
        0.012698286212980747,
        -0.050330642610788345,
        0.04588114470243454,
        -0.014200488105416298,
        -0.05404771491885185,
        0.0038508360739797354,
        -0.0056726085022091866,
        -0.08276773244142532,
        -2.3396740175049336e-33,
        -0.010693388991057873,
        0.020293334499001503,
        0.012375326827168465,
        0.001996376318857074,
        0.09851797670125961,
        -0.07325177639722824,
        -0.007441222667694092,
        0.0029431243892759085,
        0.02484576590359211,
        0.05307275056838989,
        -0.028085628524422646,
        -0.010200818069279194,
        -0.03209969401359558,
        -0.05231921374797821,
        0.049526043236255646,
        -0.05440357327461243,
        0.1037452220916748,
        -0.10384032130241394,
        -0.015936043113470078,
        -0.04194306209683418,
        0.02836041897535324,
        0.05452381446957588,
        -0.0026020135264843702,
        0.08085021376609802,
        0.058173105120658875,
        0.0013719394337385893,
        0.04727264493703842,
        0.10110201686620712,
        -0.02633507549762726,
        -0.09977646172046661,
        -0.08913387358188629,
        -0.05563291534781456,
        0.03334914892911911,
        0.05182989686727524,
        0.023561030626296997,
        0.016341067850589752,
        -0.010260090231895447,
        0.03480781242251396,
        -0.027362879365682602,
        0.00019233128114137799,
        0.05729129910469055,
        -0.12448787689208984,
        -0.004183751996606588,
        0.06281070411205292,
        -0.029793212190270424,
        -0.015418807044625282,
        -0.05282839760184288,
        -0.013608720153570175,
        0.062229301780462265,
        0.03586990013718605,
        0.011938640847802162,
        -0.05617428943514824,
        -0.0241825133562088,
        0.09617947787046432,
        -0.03294837847352028,
        -0.04254864901304245,
        0.006018987391144037,
        0.04386259615421295,
        -0.04053105413913727,
        0.02903723530471325,
        0.049216777086257935,
        0.04970921576023102,
        0.011360467411577702,
        0.021235493943095207,
        -0.02223397046327591,
        -0.15333524346351624,
        0.012489101849496365,
        -0.0369168296456337,
        -0.06068182364106178,
        -0.009354370646178722,
        0.03983645141124725,
        -0.02825174853205681,
        -0.01759452559053898,
        -0.05040984973311424,
        -0.03246155008673668,
        -0.004759187810122967,
        0.09609141945838928,
        -0.020007358863949776,
        0.10555208474397659,
        -0.09201630204916,
        -0.022468967363238335,
        0.011948131024837494,
        0.05306656286120415,
        0.006207193713635206,
        0.073125921189785,
        0.03590669855475426,
        -0.041440319269895554,
        -0.039148345589637756,
        0.047580063343048096,
        0.08947892487049103,
        0.01371132954955101,
        0.09743326902389526,
        -0.0057092937640845776,
        0.06365477293729782,
        -0.0160989910364151,
        -5.721794948954084e-08,
        0.04105255380272865,
        -0.013605277054011822,
        0.05483720824122429,
        -0.004068224690854549,
        0.012033984065055847,
        -0.08063564449548721,
        0.0036140773445367813,
        0.0021121674217283726,
        -0.08701026439666748,
        0.029073722660541534,
        0.06075148284435272,
        -0.07562483102083206,
        0.034165505319833755,
        -0.006807368714362383,
        -0.030556706711649895,
        -0.013213538564741611,
        -0.01300110388547182,
        0.040614958852529526,
        -0.06867259740829468,
        -0.028754426166415215,
        -0.012281866744160652,
        0.01917433924973011,
        0.013889149762690067,
        0.006950094364583492,
        0.04018682986497879,
        0.007159857545047998,
        -0.004917950369417667,
        0.03278384730219841,
        0.11838562786579132,
        -0.09106221050024033,
        -0.04550739377737045,
        0.021840300410985947,
        0.053654178977012634,
        0.03515816479921341,
        -0.03587697446346283,
        -0.10460972785949707,
        -0.029491819441318512,
        0.08880764245986938,
        -0.04775906354188919,
        0.058337628841400146,
        0.03799333795905113,
        -0.04924944415688515,
        -0.013754675164818764,
        0.0018008006736636162,
        -0.028417591005563736,
        0.02508421242237091,
        -0.041146766394376755,
        -0.11089850962162018,
        -0.009931236505508423,
        0.042738717049360275,
        -0.03961334004998207,
        -0.1042102724313736,
        -0.07211949676275253,
        0.04576415941119194,
        0.05307856202125549,
        -0.008787592872977257,
        -0.07105395197868347,
        0.01940171979367733,
        0.012480858713388443,
        0.0770232304930687,
        0.005143060348927975,
        -0.10288280993700027,
        -0.021006621420383453,
        0.07880302518606186
    ]
}