{
    "id": "iVixsjxdwCs",
    "title": "Weve Never Seen This in a Phone! - Legion Duel 2 Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-04-14T13:15:05Z",
    "video_url": "https://www.youtube.com/watch?v=iVixsjxdwCs",
    "category": "Howto & Style",
    "tags": [
        "gaming smartphone",
        "legion gaming phone",
        "gegion dual 2",
        "legion duel 2",
        "lenovo gaming phone",
        "mobile game",
        "gaming",
        "video game",
        "best smartphone",
        "raid shadow legends",
        "iphone",
        "android",
        "fortnight",
        "legion phone",
        "best gaming phone"
    ],
    "views": 2749125,
    "likes": 67338,
    "comments_count": 2288,
    "description": "The coolest phone we have taken apart... literally - its got two fans. The Lenovo Legion Duel 2 is one of the most powerful gaming phones of 2021, internally. Structurally not so much. Today its time we see how the fans of the Legion Duel 2 work from the inside! We'll take apart the broken gaming phone to find all of the 8 programable gaming triggers.   Watch the Durability Test HERE:   More information on the Lenovo Legion Duel 2 Here:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/Jz_vxrm8rjM",
        "https://www.lenovo.com/gb/en/phones/lenovo/legion-phone-duel/Legion-Phone-Duel-2/p/PPIPPIZ7081",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Legion Duel 2...pretty much the coolest phone I've ever broken....quite literally, since the cooling system inside is pretty epic. Conveniently it's already been cracked open a little for us, so the teardown should be rather simple. We've got multiple access points. And it looks like even the front camera glass got a little damaged during the durability test. The front Gorilla Glass 5 is still going strong though. Let's get started. [Intro] The easiest way to get inside of the Legion Duel 2 is of course with a little heat. And then bending the phone into a c shape with one hand while inserting the razor blade into the elevated slab of glass on the right joycon. The joycon joke is funny because it's almost detached. The glass comes up in thirds, and interestingly it does have a little capacitive pad on the underside as one of the 8 programmable triggers. We'll have to, you know, find them all like some kind of Pokemon quest. Aside from the whole breaking in half thing, this phone is legitimately pretty cool. The other side of the phone opens up in the same way with another thin ribbon connected to another one of the capacitive programmable triggers. Two down, six to go. The inner third glass section though is more difficult. It's recessed into the frame with no antenna lines or easy suction cup access to help lift off the glass. Eventually I do get some penetration with my razor blade, but it still does...break. I hate it when that happens. The goal here, of course, is to get access to the internal dual cooling fans and vapor chamber. We get our first glimpse of the copper air duct system when that glass is removed. First though, the back glass does have LEDs of its own. It looks like there are 6 of them that shine into the logo to reflect and refract around inside the white plastic, which of course causes the glowy effect we see from the outside of the phone. I'll remove three screws so we have access to the fans and stuff. Now normally I think this is supposed to come off the phone in one large section, but my phone conveniently is divided into thirds, which really does make the assembly much easier. The thin slinky looking ribbon is for the dual ultrasonic triggers in the upper corner. Now we've found four of the eight triggers. It's a dangerous quest, but you know, someone's gotta do it. I tried removing these ultrasonic buttons, but they are very much glued into the frame so this is as close as we can get. Here is the bottom stereo speaker, as well as one of the dual haptic vibration motors. This same setup is pretty much mirrored on the other side, which we can discover after removing 4 more screws and taking off that third of the back housing. We once again see two more ultrasonic corner triggers. We're now up to 6, along with a dual vibration motor that's still left in the frame. Real video game controllers have multiple vibrators, so it's cool to see a gaming phone do the same. It's like a portable console that just happens to make phone calls. The other bottom loudspeaker is here as well, but there are no balls inside. There are some protections against water though, like this red rubber gasket and mesh for the microphone opening. Now it's time to take apart the good stuff. The center third of this phone is still solidly screwed into place. Some screws have white arrows pointing to them which definitely facilitates disassembly, but other screws like this one hidden by the popup camera are entirely invisible at first glance, and more difficult to locate. Once all the screws are removed, I can unplug the front facing side mounted popup camera just like a little Lego, and then we get a close up look at the coolest cooling system of the year. There are indeed two fans inside. The larger one with 29 blades at the bottom which can suck in air from the back of the phone. Or if the fan is blocked by laying flat on a table, it can suck in air from the side of the phone and then pull that air through the copper tubing and out through the top where there is another exhaust fan helping to escort the air through the vent next to the popup camera. The phone is so complex it's rather ingenious. To design something that utilizes every millimeter so efficiency is very impressive. Once it's out of the rear frame, we can see more clearly the duct work, as well as how the entire thing is made from copper and completely hollow inside. Lenovo says this system keeps the Qualcomm 888 processor 30% cooler than other phones that have the same chip and I believe it. The copper ductwork looks like it's even laser welded shut. There are two additional copper pillars heading down to the main vapor chamber next to the cameras, but I'll show you that more in a second. You know the phone is pretty interesting when the stepper motor for the front popup camera is the most boring thing we have to look at. The front earpiece speaker has a layer of the largest waterproofing mesh we've ever seen. I still wouldn't trust the phone to be totally waterresitant, but at least there is protection. I'll pop off the metal bracket on the stacked motherboard and unclip some more Lego-style connections along with quite a few signal wires that all head out to those infamous antenna lines. Not a whole lot else on this board so we'll move onto the dual batteries one on either side of the phone. There are no magic pull tabs this time around, but when they do get pulled out with brute force, we get a glimpse of the force touch sensor under the display as one of the final 8 trigger locations. There's one on either side and our quest is now complete. Now I'm usually pretty surprised when companies send me a phone to, you know, review. It's definitely a brave move since my reviews aren't really considered conventional. This Legion Duel 2 was sent in a retail box with a factory seal, but each of the 2,750 milliamp hour batteries say engineering sample on them. So it does make you wonder if Lenovo really was ready to show this off. I think the most logical explanation is that I probably got included on the list of popular YouTubers and just got sent a phone without Lenovo really checking to see who I am or what I do. And if that is indeed the case, I'd like to say: Hello, Lenovo. It's nice to meet you. And I hope we didn't start this off on the wrong foot. With the motherboard released we can take a look at the 64 megapixel main camera, which does not have OIS. And then we have the 16 megapixel wide angle camera which also does not have OIS. We do have a lot of copper and thermal paste on the back though, which brings us to the vapor chamber. Pay attention to these two little copper posts which connect the copper air ducts from the cooling fan down to the copper vapor chamber onto the screen. A lot of planning has gone into this design...well, functional planning...not so much structural planning. With the screen now separated from the mid plate, we get our first look at the rather large vapor chamber. And would you look at that. My fingerprint scanner hypothesis was correct. It does not have a lens, it's just the flat sensor, which for me usually struggles a bit more reading my fingerprints. I prefer the lens style or the ultrasonic. Currently, Sony has the record for the largest vapor chamber inside of a cell phone, but Lenovo is right there as well with the massive chamber all of their own. It feels a bit more thin than Sony's, so I think Sony's still the leader. But it's still impressive. Sometimes we can see liquid quickly evaporate from inside the chamber when I cut it. But even after quickly lifting up the copper flaps, I don't see any liquid this time around. Here's a closeup look at the copper wicking inside of the vapor chamber though. This is what helps wick the liquid inside of the chamber. And here is a close up look at those copper posts that help move the heat from the vapor chamber up to the copper air ducts so the fan can pull it out and blow it away from the phone. Little conductive nuggets of calcification. And to nobody's surprise, there are two of them, just like everything else in the phone. All in all, I'd say that the Legion Duel 2 is one of the most interesting phones we've ever seen the insides of. And whether it was on accident or on purpose, I'm glad Lenovo sent it over. And I'm already looking forward to next year, assuming, of course, we're still friends. And remember, no matter what phone you have, it should probably be in a case. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "vapor chamber",
        "copper",
        "Legion Duel",
        "chamber",
        "inside",
        "glass",
        "Lenovo",
        "vapor",
        "copper air",
        "camera",
        "air",
        "copper air ducts",
        "copper vapor chamber",
        "popup camera",
        "pretty",
        "side",
        "vapor chamber inside",
        "Legion",
        "Duel"
    ],
    "transcript_entity_values": [
        "Qualcomm",
        "30%",
        "6",
        "8",
        "Pokemon",
        "2,750 milliamp hour",
        "Lego",
        "the year",
        "Instagram",
        "four",
        "two",
        "six",
        "three",
        "the stepper motor",
        "Two",
        "Sony",
        "half",
        "YouTubers",
        "4",
        "Lenovo",
        "next year",
        "thirds",
        "29",
        "64",
        "first",
        "second",
        "First",
        "third",
        "16 megapixel",
        "eight",
        "888",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.1491691768169403,
        0.0504089817404747,
        0.013577226549386978,
        -0.10880880057811737,
        0.012485970743000507,
        -0.06292887777090073,
        0.080176442861557,
        0.03230101242661476,
        0.009163779206573963,
        0.0843077078461647,
        0.10335150361061096,
        -0.01656084507703781,
        0.048285339027643204,
        0.0034806453622877598,
        0.05855412036180496,
        0.020754851400852203,
        0.08338861912488937,
        -0.041058704257011414,
        -0.04344908520579338,
        0.08397260308265686,
        0.010559865273535252,
        0.020899808034300804,
        0.02429203875362873,
        -0.013192527927458286,
        0.025885894894599915,
        0.03311534598469734,
        -0.03957698121666908,
        0.0418311282992363,
        -0.09375002980232239,
        -0.06469082832336426,
        0.017397986724972725,
        0.0969286635518074,
        -0.08605318516492844,
        0.013662097975611687,
        0.03290396183729172,
        -0.05867169424891472,
        -0.006896596401929855,
        0.021200383082032204,
        -0.0825376883149147,
        -0.03267243504524231,
        -0.07542094588279724,
        -0.020653946325182915,
        0.07145865261554718,
        -0.013479158282279968,
        0.011836646124720573,
        0.040396787226200104,
        0.0612650066614151,
        -0.035925086587667465,
        0.03275638446211815,
        0.0014574475353583694,
        -0.05838463082909584,
        0.005644394084811211,
        0.07627932727336884,
        -0.005420742556452751,
        -0.044880617409944534,
        0.03876810148358345,
        -0.006970725487917662,
        0.03765259310603142,
        0.04203185439109802,
        0.011650173924863338,
        0.05116601660847664,
        0.05654950439929962,
        -0.07921696454286575,
        0.08666761219501495,
        -0.049194082617759705,
        -0.03427815064787865,
        0.06246456131339073,
        -0.07435719668865204,
        -0.019809942692518234,
        -0.04105948284268379,
        -0.013579168356955051,
        0.0063630687072873116,
        0.020048508420586586,
        -0.04904870316386223,
        0.00123001413885504,
        0.10824854671955109,
        0.019922610372304916,
        -0.013745998963713646,
        0.0024783574044704437,
        -0.017170913517475128,
        0.03408263996243477,
        -0.031796541064977646,
        0.05593021214008331,
        -0.021850109100341797,
        0.07550168037414551,
        0.05213260278105736,
        -0.01717473566532135,
        0.07583338767290115,
        -0.036366142332553864,
        -0.07872306555509567,
        -0.026627836748957634,
        0.0672825276851654,
        0.021957160905003548,
        -0.01764122024178505,
        -0.04920147359371185,
        -0.017842406406998634,
        -0.09435409307479858,
        -0.03877224028110504,
        -0.07444620132446289,
        0.08937667310237885,
        0.0015780965331941843,
        -0.02432594634592533,
        -0.0006106834625825286,
        5.4494063078891486e-05,
        0.07903874665498734,
        0.025938313454389572,
        -0.049916822463274,
        0.009840740822255611,
        0.011777974665164948,
        -0.017805058509111404,
        -0.010965132154524326,
        0.03013595938682556,
        -0.05362650007009506,
        -0.038600023835897446,
        0.022644802927970886,
        0.056978464126586914,
        -0.08051395416259766,
        0.09470526874065399,
        0.11494969576597214,
        0.028091005980968475,
        0.042560119181871414,
        -0.04549972340464592,
        -0.09579192101955414,
        -0.04397791251540184,
        0.03922343626618385,
        0.033936694264411926,
        -0.05282795801758766,
        3.1522592830948024e-33,
        0.08436988294124603,
        0.07830039411783218,
        0.017519714310765266,
        0.0364193432033062,
        -0.04616682976484299,
        0.024479662999510765,
        0.03823458403348923,
        0.00048121929285116494,
        -0.053442731499671936,
        0.01085694134235382,
        -0.026075467467308044,
        0.027093101292848587,
        0.001518836710602045,
        0.03078359179198742,
        0.07125864177942276,
        -0.07988075166940689,
        -0.016803128644824028,
        -0.07096842676401138,
        0.0011927812593057752,
        -0.03647249564528465,
        -0.00232037715613842,
        0.026687506586313248,
        -0.017516588792204857,
        0.03513556718826294,
        0.06322075426578522,
        0.10395686328411102,
        0.024034442380070686,
        -0.02528959885239601,
        0.045903243124485016,
        0.0845714882016182,
        -0.1273030787706375,
        -0.05324092507362366,
        0.009992565959692001,
        0.023421574383974075,
        -0.024250883609056473,
        0.020453767850995064,
        -0.09528344124555588,
        -0.11175712943077087,
        -0.06367407739162445,
        -0.019102314487099648,
        -0.03780606761574745,
        0.03515683114528656,
        -0.12350603938102722,
        -0.04686805605888367,
        -0.056226201355457306,
        -0.06234955042600632,
        -0.057754844427108765,
        -0.008933055214583874,
        -0.045582178980112076,
        -0.007646049372851849,
        -0.016025032848119736,
        -0.038631826639175415,
        0.038624804466962814,
        0.0119529590010643,
        -0.08111661672592163,
        -0.03445328027009964,
        0.008245524950325489,
        -0.015961820259690285,
        0.04566480219364166,
        0.03845253959298134,
        0.018285594880580902,
        0.0028190547600388527,
        -0.062476031482219696,
        0.08042220771312714,
        -0.06041629612445831,
        0.0068685393780469894,
        0.033021993935108185,
        -0.01312254834920168,
        -0.06512433290481567,
        0.008845469914376736,
        -0.03206679970026016,
        0.01593611016869545,
        0.02217940427362919,
        -0.04726050794124603,
        0.0315093919634819,
        -0.0047612800262868404,
        -0.014588466845452785,
        -0.03230028972029686,
        -0.0005891218897886574,
        -0.03499593958258629,
        -0.08997566252946854,
        -0.024899760261178017,
        0.04496343061327934,
        0.000828552118036896,
        -0.03517955541610718,
        -0.07512063533067703,
        0.019074128940701485,
        -0.11786757409572601,
        -0.04503248631954193,
        0.0010397511068731546,
        -0.009706077165901661,
        -0.04084052890539169,
        -0.0089104063808918,
        0.002361911814659834,
        0.005024970509111881,
        -5.0112973541065114e-33,
        -0.05889252573251724,
        -0.00799732655286789,
        0.03897252306342125,
        -0.01747550442814827,
        0.026682905852794647,
        -0.04229017719626427,
        0.0850386694073677,
        0.0507565513253212,
        -0.015948306769132614,
        -0.0842231884598732,
        -0.030723566189408302,
        0.055280715227127075,
        -0.05975790321826935,
        -0.02620815299451351,
        0.06753648072481155,
        -0.06678131222724915,
        0.028329433873295784,
        -0.08768411725759506,
        0.04658158868551254,
        0.0443597212433815,
        0.08652404695749283,
        0.0240260548889637,
        0.12776538729667664,
        0.04000481590628624,
        -0.0029343627393245697,
        -0.00652648601680994,
        -0.006060134153813124,
        -0.07398740947246552,
        0.08450474590063095,
        0.017689423635601997,
        0.007036328781396151,
        -0.05564062297344208,
        0.015472115017473698,
        0.07710541784763336,
        0.06093544512987137,
        0.0335933119058609,
        0.04363860562443733,
        -0.02927597425878048,
        -0.013773472979664803,
        -0.08491775393486023,
        0.030282437801361084,
        0.042836327105760574,
        -0.0034436401911079884,
        0.04409337788820267,
        -0.014388521201908588,
        -0.05834329500794411,
        -0.035758186131715775,
        -0.02281181327998638,
        -0.03193274885416031,
        -0.033465202897787094,
        -0.03157486766576767,
        0.001473614014685154,
        -0.0252055861055851,
        0.03412765637040138,
        -0.08798643946647644,
        -0.019917739555239677,
        0.07075285166501999,
        -0.06959129124879837,
        0.0036307431291788816,
        0.008959934115409851,
        0.10390109568834305,
        -0.028590530157089233,
        -0.08951932936906815,
        0.044474609196186066,
        0.03122751973569393,
        0.05748239904642105,
        0.08987069875001907,
        0.03780302405357361,
        -0.017245445400476456,
        0.02764189802110195,
        0.003229422029107809,
        -0.025139139965176582,
        -0.0011473949998617172,
        -0.048946164548397064,
        0.001164575689472258,
        -0.0033751088194549084,
        -0.08547837287187576,
        -0.07594877481460571,
        -0.01943172886967659,
        -0.012858763337135315,
        0.04559185728430748,
        -0.055829327553510666,
        0.039785608649253845,
        0.03622101992368698,
        0.05833584815263748,
        -0.07602275162935257,
        0.06710696965456009,
        0.06861937046051025,
        -0.06543060392141342,
        -0.053349997848272324,
        -0.04859789460897446,
        -0.0038925467524677515,
        0.04157634824514389,
        0.13146521151065826,
        -0.010571739636361599,
        -6.282204623175858e-08,
        0.0647093877196312,
        0.0329417958855629,
        -0.0037134517915546894,
        -0.003697734558954835,
        -0.014418804086744785,
        -0.022115441039204597,
        -0.0005451992037706077,
        -0.03910815715789795,
        0.06459315121173859,
        -0.02065928652882576,
        0.02950875274837017,
        -0.039858587086200714,
        0.004479970317333937,
        0.0666642114520073,
        0.026839546859264374,
        0.08961782604455948,
        -0.00807157065719366,
        0.01263448316603899,
        -0.027576571330428123,
        0.015360500663518906,
        -0.06544283777475357,
        -0.005576528143137693,
        0.07438924908638,
        -0.09252793341875076,
        -0.029445935040712357,
        0.07295500487089157,
        -0.11012119054794312,
        0.002242698334157467,
        0.06002354249358177,
        0.018085449934005737,
        -0.03740483149886131,
        -0.0218283049762249,
        0.004393909592181444,
        -0.011003779247403145,
        -0.073501355946064,
        0.004091930575668812,
        -0.053316399455070496,
        -0.022082893177866936,
        0.10470914095640182,
        -0.012957428582012653,
        -0.03204295039176941,
        -0.05441528931260109,
        0.001584738725796342,
        0.08683076500892639,
        0.07449501752853394,
        -0.03468601778149605,
        0.062008656561374664,
        -0.15854568779468536,
        -0.0447913222014904,
        -0.03650442510843277,
        -0.03220796957612038,
        0.005241799633949995,
        -0.03777337819337845,
        0.0017173775704577565,
        -0.028814690187573433,
        0.038876861333847046,
        0.03827571123838425,
        -0.017689328640699387,
        0.022402513772249222,
        -0.043849632143974304,
        0.03984251245856285,
        -0.03287710249423981,
        -0.03842972591519356,
        0.03764306753873825
    ]
}