{
    "id": "ix8eA6syk1Q",
    "title": "OnePlus 6T Teardown - Can under display cameras be real?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-11-08T11:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=ix8eA6syk1Q",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 6T",
        "OnePlus 6T teardown",
        "take apart OnePlus 6t",
        "oneplus",
        "one plus",
        "OnePlus 6t Battery Replacement",
        "repair",
        "how to fix",
        "DIY",
        "back glass replacement",
        "How to open OnePlus 6T",
        "in display fingerprint reader",
        "under screen selfy camera",
        "under screen camera"
    ],
    "views": 1241715,
    "likes": 28644,
    "comments_count": 1986,
    "description": "The OnePlus 6T lost the headphone jack, but gained a few new features, like this underscreen fingerprint scanner. The in display fingerprint scanner of the OnePlus 6T is pretty incredible. This teardown of the OnePlus 6T will show exactly how the whole thing works together, below the AMOLED panel to read your fingerprint. If THIS sensor can see through the display, how far away is under-screen selfy technology? Time will tell... but maybe its not as far away as we think it is.   Awesome Smartphone Tool Kit I use:   OnePlus 6T Durability test:  OnePlus 2 Teardown:   LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:  Music is from HERE:    *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2idLGDi",
        "https://youtu.be/6RGq6WM5WBg",
        "https://youtu.be/MHkBjBWc_EU",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://share.epidemicsound.com/pcGGf",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It's time to tear down the OnePlus 6T and review it from the inside. Let's find out what the in-screen fingerprint scanner looks like and see if there was any extra room for that headphone jack. Let's get started. (Intro) I've already removed the back glass once when I was creating the transparent version, so this time around it should be a bit easier. My clear tape is strong, but not as strong as the watertight black adhesive. I'll slice through the remaining tape and set the glass off to the side, exposing our little silver screw over the battery plug. I'll set the screw off to the side along with the silver bracket and unclip the battery with my red plastic pry tool. Normally the battery does have a pull tab, but I covered it up with my red mod. Either way, the 3700 milliamp hour battery still comes out easy enough, which is nice. Now for the 8 screws holding down the NFC and black plastics over the motherboard. The NFC communicates with the square gold contact pads on the back. The motherboard itself has a charging port ribbon connector and 2 more circuit board extension ribbons down at the bottom, each unsnapping like little Legos. The mute slider switch over here on the left looks pretty interesting from the inside. It has 3 stages: silent, vibrate, and ring. I'll unplug the 2 wire cables over on the right side of the motherboard, and remove the one silver screw still in the center of the board. The dual SIM card tray is over here on the right underneath the square white water damage indicator. There is no expandable memory card slot. After unplugging the front camera up at the top, and the front sensor ribbon hidden underneath, we can finally pull the motherboard away from the frame. There is no thermal paste or heat pipe on the OnePlus 6T. The front facing camera is a 16 megapixel little guy with electronic image stabilization. And the rear facing camera is a dual setup. The 16 megapixel main sensor does have OIS, but the secondary depth sensor does not. I'd still much rather that OnePlus swap the depth sensor with a telephoto wide angle lens, since blurry background portrait selfies can all be done with software and one camera. But that's just my opinion. I'll plug both cameras with their metal housing back into the motherboard and continue onward to the frame. We have the earpieces up here, along with the microphone hole and it's water resistant screen. No copper heat pipes, but those are just an efficiency perk and not necessarily a necessity. This phone is one of the cheaper priced flagships out there right now, which means that it doesn't have every single bell and whistle. The bottom plastics have 7 screws holding everything together - normal Phillips screws, which are nice. I'll link my tool kit in the video description. Peeling back the plastic reveals not a lot of extra room down here. We have the circular vibrator over on the left with the circuit board, and the fingerprint scanner hardware and the USB-C plug is in the middle. Then the loud speaker, taking up the bulk of the space, over on the right side. So OnePlus is technically utilizing all of the space inside the 6T, but I also think removing the headphone jack was a very calculated, intentional decision so they could sell more in the wireless OnePlus Bulletproof headphones. Business is business, even if it doesn't benefit the rest of us. There are 2 Phillips head screws holding down the charging port into the frame. I'll lift out the small circuit board. Some of the more sensitive electronics are coated to prevent corrosion, which is a good water resistance move. The charging port ribbon is the last obstacle on our way to unburying the in-screen fingerprint scanner. I'll pull it out of the frame. This time it has a green rubber ring on the tip not quite as aesthetic as the 6's red rubber, but the only people who ever see this is you guys. So we can all just complain quietly in our heads about OnePlus' lack of red. Now for the fingerprint scanner. This thing is pretty sweet. I'll pull off the shielding tape from the top, and then there are 2 black screws holding the sensor in place. After these are out, I'll pull it very gently from the phone body. It's essentially just a camera. The black portion is a lens and has a sensor underneath to take a close up picture of your unique fingerprint, using the green light animation projected from the display to illuminate the ridges in your finger. Looking through the hole the sensor sits in, we can see the underside of the AMOLED display, and the shadow of my finger as it passes along the underside of the glass. We can also see the light from my flash shining back through the same circular hole. Looking from the outside we can see the display is still totally intact, which means this time around the fingerprint scanner is a nonessential part of the display. I think this fingerprint scanner is a solid first step to having under-display selfie cameras meaning we can get rid of screen notches altogether. Thumbs up for that. Just for kicks and giggles, I want to partially reassemble this phone and turn on the display to see what the hole looks like with the screen turned on. I'll tuck the motherboard back in with the front facing camera. And I'll clip on the charging port ribbon, but I won't tuck it into the frame just yet. The bottom circuit board is back where it belongs. I won't be able to reattach everything for this experiment, but hopefully the 6T will still function. It obviously needs the battery, and then I'll turn it on. Even with the phone mostly disassembled, the screen still works, but does not shine backwards into the hole itself. The LEDs in the screen only shine one direction, outward, which is good news for the fingerprint sensor camera. That was kind of fun. I'll turn the screen off again and finish putting it back together. The fingerprint scanner gets put back into it's hole and screwed in with the metallic tape over top. Then I'll take care of the charging port, the lower circuit board, and all the bottom plastics and screws. The battery and the upper plastics can be set into place with their screws. Overall, the OnePlus 6T has the same basic design we saw with the 6 just with the addition of the fingerprint scanner and slightly larger battery. I'm a fan of these lower priced flagships. It's nice to see companies looking out for their customers. Surprisingly enough, everything still works...even the fingerprint scanner. Not too shabby. Nice job OnePlus. I'll link my toolkit in the description. Let me know if you have any questions in the comments. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "fingerprint scanner",
        "fingerprint",
        "scanner",
        "back",
        "battery",
        "screws",
        "camera",
        "sensor",
        "screws holding",
        "circuit board",
        "OnePlus",
        "charging port",
        "fingerprint sensor camera",
        "inscreen fingerprint scanner",
        "charging port ribbon",
        "motherboard",
        "board",
        "hole",
        "screen",
        "facing camera"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "OnePlus Bulletproof",
        "6",
        "8",
        "Instagram",
        "jack",
        "6",
        "Legos",
        "Phillips",
        "3700",
        "NFC",
        "first",
        "3",
        "16 megapixel",
        "USB",
        "OnePlus 6",
        "AMOLED",
        "one",
        "7",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.15994900465011597,
        0.08104412257671356,
        0.015740325674414635,
        -0.0861409530043602,
        0.06682545691728592,
        -0.04233761131763458,
        -0.030204875394701958,
        0.05859912186861038,
        -0.03471766784787178,
        0.00683937594294548,
        0.07043484598398209,
        0.04919692873954773,
        -0.01652112975716591,
        0.005740315653383732,
        -0.019086621701717377,
        -0.09348706901073456,
        0.05696190521121025,
        -0.047231122851371765,
        0.009991664439439774,
        0.06891287118196487,
        0.043472811579704285,
        -0.05299718305468559,
        0.05695538595318794,
        -0.09255493432283401,
        0.0476529486477375,
        -0.059097569435834885,
        -0.0252210795879364,
        -0.027913102880120277,
        -0.057995036244392395,
        -0.048580706119537354,
        0.049195434898138046,
        0.09414710849523544,
        -0.05276826396584511,
        0.04329996183514595,
        0.0012138854945078492,
        -0.03201451897621155,
        0.11122225970029831,
        -0.014882190153002739,
        -0.08115165680646896,
        -0.059016190469264984,
        0.0012710370356217027,
        -0.000893958902452141,
        0.011838859878480434,
        -0.03267708420753479,
        0.03192157670855522,
        -0.023411404341459274,
        0.06523848325014114,
        -0.022850047796964645,
        0.029743608087301254,
        -0.055194295942783356,
        -0.04332476481795311,
        -0.0035372276324778795,
        0.08806921541690826,
        -0.027020631358027458,
        -0.0857338011264801,
        0.01840038411319256,
        -0.028397059068083763,
        -0.05081605911254883,
        0.027007462456822395,
        0.029616007581353188,
        0.09031897038221359,
        0.039644286036491394,
        0.00576957268640399,
        0.06481892615556717,
        0.04652366414666176,
        0.026526879519224167,
        0.030713096261024475,
        -0.1341003179550171,
        0.014456194825470448,
        -0.07107019424438477,
        -0.05810151249170303,
        -0.03141158074140549,
        0.01346199493855238,
        -0.08602623641490936,
        -0.026876049116253853,
        0.06523547321557999,
        -0.026938308030366898,
        -0.03092988394200802,
        -0.026559704914689064,
        -0.011003292165696621,
        0.03978302702307701,
        -0.03458692505955696,
        -0.047275517135858536,
        0.027564195916056633,
        0.00465185334905982,
        0.024313127622008324,
        -0.018708854913711548,
        0.04950908571481705,
        -0.02078988030552864,
        -0.08984378725290298,
        -0.012655350379645824,
        0.0021269386634230614,
        -0.09730885177850723,
        -0.026411747559905052,
        -0.019703811034560204,
        -0.10967129468917847,
        -0.025831351056694984,
        -0.04236169904470444,
        -0.014902652241289616,
        0.03139878064393997,
        0.007471059914678335,
        -0.028653459623456,
        -0.016003036871552467,
        -0.0375160314142704,
        0.013653505593538284,
        -0.04816235974431038,
        -0.11164390295743942,
        -0.04743075743317604,
        0.06363577395677567,
        0.05925288796424866,
        0.02591230347752571,
        0.002229579957202077,
        -0.004244896583259106,
        0.022846784442663193,
        0.0666777566075325,
        0.026037834584712982,
        -0.024383507668972015,
        0.06143691763281822,
        0.07911393791437149,
        -0.015797322615981102,
        0.009433411993086338,
        -0.006061976309865713,
        -0.04743149131536484,
        -0.006301440764218569,
        0.08572393655776978,
        0.041160598397254944,
        0.008073938079178333,
        5.075459876536223e-33,
        0.01032378152012825,
        0.058820728212594986,
        0.00044893642188981175,
        0.0037065288051962852,
        -0.005725199822336435,
        0.044868625700473785,
        -0.014198066666722298,
        0.014658335596323013,
        -0.015841044485569,
        0.038037415593862534,
        0.004026575945317745,
        0.026140553876757622,
        -0.03236234188079834,
        0.04954211786389351,
        0.018664104864001274,
        0.010556335560977459,
        0.007125074043869972,
        -0.003985229413956404,
        -0.06441079825162888,
        0.034935541450977325,
        -0.023579968139529228,
        -0.10827220231294632,
        0.035608939826488495,
        -0.0074369884096086025,
        0.1488412618637085,
        0.058134905993938446,
        0.020967507734894753,
        0.03776973485946655,
        0.06034418195486069,
        0.006320476066321135,
        -0.09630858898162842,
        -0.014806561172008514,
        0.02310754358768463,
        0.006769204046577215,
        -0.014900973998010159,
        0.01834840700030327,
        -0.03220774978399277,
        -0.04994279518723488,
        -0.0002653632254805416,
        -0.019418343901634216,
        0.0035820805933326483,
        0.03476005792617798,
        -0.03272747993469238,
        -0.07875911891460419,
        0.038997236639261246,
        -0.001544261584058404,
        0.0017743417993187904,
        0.0492812916636467,
        -0.0014537880197167397,
        0.006628414150327444,
        0.002691427245736122,
        -0.06668216735124588,
        -0.04936918243765831,
        -0.09836389124393463,
        -0.08806207031011581,
        0.027730800211429596,
        -0.016711805015802383,
        0.023360474035143852,
        0.11442898213863373,
        0.06305205821990967,
        -0.013934245333075523,
        0.019145827740430832,
        -0.04911584407091141,
        0.04881544038653374,
        -0.07652150839567184,
        0.0024191071279346943,
        0.031579457223415375,
        0.04397740215063095,
        -0.05047997832298279,
        0.08878710120916367,
        -0.05189223960042,
        0.0015901128062978387,
        -0.022311752662062645,
        -0.01954496279358864,
        0.0260228980332613,
        0.07215729355812073,
        0.011001978069543839,
        0.023706510663032532,
        0.047879479825496674,
        -0.017804311588406563,
        -0.030284304171800613,
        0.018387233838438988,
        0.10498662292957306,
        -0.017039669677615166,
        0.029112592339515686,
        -0.04250384494662285,
        -0.03719311207532883,
        -0.09271973371505737,
        -0.037340790033340454,
        0.018554214388132095,
        0.014195707626640797,
        -0.01083019096404314,
        -0.1007043719291687,
        -0.05896952375769615,
        -0.034491974860429764,
        -5.813778694738086e-33,
        -0.07139409333467484,
        -0.03188502788543701,
        -0.007256853859871626,
        -0.027170419692993164,
        0.005439050495624542,
        -0.060782767832279205,
        0.16705365478992462,
        0.12237068265676498,
        0.019324013963341713,
        -0.0200924314558506,
        0.016035160049796104,
        0.012313437648117542,
        -0.034840140491724014,
        -0.015688803046941757,
        -0.006042168941348791,
        0.0062886010855436325,
        0.026264982298016548,
        -0.02483726106584072,
        0.006140258628875017,
        0.026586860418319702,
        0.0226643905043602,
        -0.0010245960438624024,
        0.014865507371723652,
        0.06767862290143967,
        -0.03687310963869095,
        0.0265651885420084,
        0.061140596866607666,
        -0.08733437955379486,
        0.035404883325099945,
        -0.07540842145681381,
        0.007211099844425917,
        -0.03353241831064224,
        -0.0068154968321323395,
        0.05016394332051277,
        0.08344267308712006,
        0.025062154978513718,
        0.015411244705319405,
        -0.02843058854341507,
        0.02103208191692829,
        0.005759235471487045,
        -0.03296314924955368,
        0.09327775239944458,
        -0.032065849751234055,
        -0.06292111426591873,
        0.0013059460325166583,
        -0.046580709517002106,
        -0.01959078013896942,
        0.03447125852108002,
        -0.010788480751216412,
        0.06067931279540062,
        0.015256387181580067,
        0.0504230260848999,
        0.010889851488173008,
        0.00983036495745182,
        -0.017370667308568954,
        -0.053331270813941956,
        0.05028676241636276,
        -0.04845919832587242,
        -0.07323718816041946,
        0.07554424554109573,
        0.11255308240652084,
        -0.012290033511817455,
        -0.03163077309727669,
        -0.07860400527715683,
        0.013635709881782532,
        -0.015218118205666542,
        0.06393314152956009,
        0.018054354935884476,
        -0.03637691214680672,
        0.07253319770097733,
        0.05436544120311737,
        -0.03290422260761261,
        0.0354481004178524,
        -0.11690758168697357,
        0.059276580810546875,
        0.07114170491695404,
        -0.0772240087389946,
        -0.008096667006611824,
        0.04589836299419403,
        -0.030018821358680725,
        0.010304518975317478,
        -0.05502619221806526,
        0.02345120534300804,
        0.06753765791654587,
        0.16396857798099518,
        0.033366553485393524,
        0.021419642493128777,
        0.07053083926439285,
        0.019562415778636932,
        0.03468463197350502,
        -0.046765536069869995,
        0.015840869396924973,
        -0.01758669875562191,
        -0.03707987442612648,
        0.022354016080498695,
        -5.1351737084814886e-08,
        0.04644453525543213,
        -0.0060514165088534355,
        0.06052512302994728,
        -0.09112942963838577,
        -0.04299245774745941,
        -0.04820047691464424,
        0.07773219794034958,
        -0.05046793445944786,
        0.021014416590332985,
        -0.09309793263673782,
        -0.015463254414498806,
        -0.08492455631494522,
        -0.05712692439556122,
        0.044461775571107864,
        -0.008973116055130959,
        0.03719177842140198,
        -0.032520100474357605,
        0.01830275170505047,
        -0.01718304306268692,
        0.031108466908335686,
        -0.041255515068769455,
        0.014608429744839668,
        0.0025404752232134342,
        -0.02614193595945835,
        0.025599103420972824,
        0.002009293995797634,
        -0.10925409197807312,
        0.01974196918308735,
        0.09317146986722946,
        -0.013206020928919315,
        -0.04260045662522316,
        -0.05926362797617912,
        0.018198100849986076,
        0.01228308118879795,
        -0.006191815249621868,
        -0.060471273958683014,
        -0.03317597508430481,
        0.024364903569221497,
        0.05248434841632843,
        0.05390920862555504,
        -0.03539401665329933,
        -0.07137033343315125,
        -0.0030791950412094593,
        0.02621656470000744,
        -0.020861951634287834,
        -0.02318808063864708,
        0.11982095241546631,
        -0.11956435441970825,
        -0.14180301129817963,
        0.030281374230980873,
        -0.04865880310535431,
        -0.015620577149093151,
        -0.036878276616334915,
        -0.06013571843504906,
        0.03664124011993408,
        0.0033085341565310955,
        0.09487728774547577,
        -0.009848452173173428,
        -0.03707645460963249,
        0.01825900562107563,
        -0.004255461040884256,
        -0.04440896958112717,
        0.0352008193731308,
        0.11464112997055054
    ]
}