{
    "id": "iyaGDLBsmdY",
    "title": "The VFD that isn't",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-10-18T12:56:39Z",
    "video_url": "https://www.youtube.com/watch?v=iyaGDLBsmdY",
    "category": "Science & Technology",
    "tags": [
        "LCD",
        "VFD",
        "nixie tube",
        "clock",
        "display",
        "LED",
        "seven segment",
        "display tech",
        "technology connections"
    ],
    "views": 925825,
    "likes": 36425,
    "comments_count": 2196,
    "description": "You can support this channel on Patreon! Link below    Wouldnt it be nice if VFDs made a resurgence? Just put VFDs on everything, already! Make VFDs the new blockchain or neural networks or whatever. Priorities, people!  For those of you who enjoy links, I have great news! I found some! Technology Connections on Twitter:  The TC Subreddit  Technology Connections 2 (the channel where I sometimes talk about stuff and generally dont prepare for anything):   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel stay as weird as it is (and maybe, just maybe, get even weirder!), please check out my Patreon page. Thank you for your consideration!   And thank you to the following patrons! Yaniv, Francis Fisher, The War Academy, Conor Killeen, Jay, Dave Anderson, Noah McCann, Eric Hansen, Dane Peterson, Jeremy Kitchen, Steven First, Audin Malmin, Adam D. Ruppe, Rafa Wiosna, Matthew Giraitis, Kevin Landrigan, Carl Yazbek, Logan Kriete, Hunter Schwisow, Matt Falcon, Kieran Cox, Eric Wood, Paul Williams, Brent LaRowe, Lurker239, Felix Freiberger, James Ryan, Lukas Komischke, h.drew foy, Jason Nevins, Jeffrey, BlancoGrande, Stephen Pick, Technicalleigh, John McLusky, Adam Coddington, Lolucoca, Steven Metcalf, Justin Talbot, Christopher Jett, SovietBear, Mike Mason, Techmoan, Kotanu, Christopher Luna, Paul Mills, Brian G. Shacklett, Chris Hartl, Andre N, Tony, Matthew Baron, Mark Critchley, Andres Plaza, Charlie Hankin, Craig Leverenz, Casey Kikendall, Sebi Jecklin, Warmo, The8TrackKid, Drew McClain, Michael Snowden, Ed Hall, Julian Rapoport, Christopher Bassett, Ryan Cozzubbo, Marcus Schwartz, Johan Schoeman, Matt Taylor, Patrick Musson, Lars JJ, Richard Lindsey, Kollin O'Dannel, Peek, blouerat, Robert Toth, Joseph Hill, Marc Ethier, Giacomo Scaparrotti, Thijs Dortmann, Brady Brown, Stein Strindhaug, foophoof, Ernie Smith, Christopher Dickey, Denver Alexander, Mitchel J. Mullin II, Matthew Razza, Trix Farrar, Marco Anastasi, Pavlo Pravdiukov, Howard Kraut, Mike Bailey, Michael Bernstein, Kevin Strehl, Yona, neko, Grayson Lang, Jeffery Grajkowski, Eric Merrill, Stefan Berndtsson, Michael Sims, Clint Eisinger, Christopher Leidich, Mike Friedman, Andr Waage Srensen, Sam Redfern, Tully, fussel, Corey A Hudson, EpicLPer, Luc Ritchie, Eric Romero, Ryan Hardy, Taylor Martin, thefanification, Ewen McNeill, Henrik Ripa, Albin Flyckt, Shane Zamora, John Bailey, Alex Ilyin, Andrew \"FastLizard4\" Adams, Avi Drissman, Phil Taprogge, Sam Witney, Jonathan Skowronek, Tim Grov, Pieter van der Eems, Brian Condron, Reto Jost, Vince Terranova, Andrew Montagne, David Scott, Mike Nichols, Brandon Enright, James Fialho, Christian Torelli, The Paul Allen, toasterking, Jason Brady, ce keen, Jake Shep83, Nick Pollard, David Grossman, Manalope, Andy S, Robert, Johan Greefkes, Jacob Dixon, Rob Kefford, Benjamin A., Nathaniel, Michel Sievers, Colin Cogle, Aaron Rennow, Bee Jay, Countzero, Kodapan, Eli Krumholz, Guillaume Tremblay-Beaumont, Sha Nasti, Laria, Stephen B Hinton, thegeoffreak, scott b, Elliot Clark, Bob Slovick, Jason Burgett, Jib Systems, Andrew Rosenwinkel, Grazer, Bob B, Mike Noe, Scott Rowland, Joshua Doades, Ennex The Fox, Steve Kralik, Your name, Kirill Polstainen, Felix Winkelnkemper, BoostCookie, 98abaile, Rennix, Charles, Sebastian Sparrer, Matt Mullett, Andreas Kuzma, Paul Moffat, Max, Alessandro Robert Nilsen, Ryan Benson, Neil Forker, Vincent Beelte, James Pinakis, Johnni Winther, Mark Hesse, Nathan Blubaugh, lululombard, Armando Fox, Nelson, Angelo van der Sijpt, William Evans, VilleS, Anton Afanasev, Kilrah, Ray, Liam O'Flynn, Gideon Ritter, Oliver Lee, Lennart Sorensen, Mitch Radoll, Will Wren, Viorel, Reaghan Kekeis, lohphat, Vivian Pypher, Brandon Whiting, Scott Herron, Marlo Delfin Gonzales, Zachary Hazlett, Peter Stewart, Patrick Barry, Robin Johnsen, Nomad, Eric, Phia Westfall, Jeremey Hastings, Mark Wayt, Matthew Reynolds, Arthur Robillard, Sonic the Anonymous Hedgehog, Lee Tustain, Ramon Gamez, Marcel de Jong, Vaughn B., Breunie Ploeg, Braden McDorman, Julien Oster, Jake Hickman, Trae Palmer, Gary Hampson, Lennart Rosam, Chris Wallace, Matt Shea, Jason Baker, Galimaufry, Aaron Helton, Michael Holmes, John Piontkowski, Trey Harris, Peter Pfundstein, Wilhelm Screamer, Alan Boyd, Mat Stu, RYAN INGOGLIA, Charlycobra, Thomas Kolanus, William Kisley, Daniel Johnson, Potch, Reemt Rhmkorf, Robin Rattay, Bruce Justyn, Rae McIntosh, Justin D, Adam Zawisza, LordJakson, Triancia, Max Barnash, Microfrost, Sinirlan, Mitch Schenk, Juan Olivares, Mike Bird",
    "description_links": [
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "One of the sadder things about the current state of gadgetry is the absolutely uninspired informational displays were stuck with now. Full-color LCD panels are so dang cheap that ya might as well just put a crappy little UI together and call it a day. But not long ago, your favorite whatsits and doodads would have their own little custom displays of various technologies. Which technologies? Why (whimsical music plays) Theres the wonderful Nixie tube, though thats not really custom. Its just numbers, really. Youve got your classic pea-soup LCD panels like youll find on the original Game Boy. Then theres the grey and black LCD, offering a less nauseating experience. Simple LEDs can and do work to make seven-segment displays, and sometimes youll see that tech get expanded out into more complicated symbolical imagery like this oven display. But perhaps my favorite piece of display tech is the vacuum fluorescent display. Yes, these VFDs, while not the obsession of a certain Lemony Snicket, are still very interesting indeed. Their bright, self-illuminating elements, high contrast (with the aid of color filters) and nearly limitless design potential made these things a staple of a/v equipment, delightfully eighties car dashboards, appliances, and of course, vending machines. Who could forget vending machines? They work surprisingly like the vacuum tubes of days gone by, with a series of heated cathode wires at the front of the display emitting some anxious electrons, arbitrarily shaped anode targets coated with the phosphors hanging out at the back of the display, and a control grid that sits between the two to control things. If you want to light up a segment, you simply make sure that the control grid is positively charged to let some of those electrons through, and then you also positively charge the target so the electrons will go careening towards it, hit it passionately, and with the help of our friends the fantastic fluorescent phosphors, those electrons become photons and the anode plate will glow. How neat! Adding the control grid allows the display to be multiplexed. If youve got 64 things you need to light up, you might think youd need 65 wires to control it all, one for each element and one for the common cathode. But, stick some control grids in between, and you can wire a bunch of the elements together, and allow only one at a time to be lit by cycling through the control grids and selectively blocking the elements from being lit. If you use 8 control grids each in charge of 8 elements, you can use only 17 wires, some rapid switching circuitry, and our dumb brains to make it appear as though the whole display is being lit at once when in fact its being lit in segments very rapidly. See our brains are dumb and we cant see really fast things, engineers have exploited that a lot. Anyway, vacuum fluorescent displays have largely fallen out of favor since they require custom tooling to make custom displays, and theyre fragile glass things which need to be pulled into a vacuum and kinda its just an ordeal. Plus they only really make sense for certain applications. Now that we are willingly buying microwave ovens that connect to the internet for some reason, having a fixed display can become a real limitation, so VFDs are becoming an increasingly rare sight. Now of course, VFD dot matrix displays are a thing so its not like you couldnt just update one of those, and those do have some relevant applications, but were gonna ignore them for right now. Wanna see a great VFD? Take a look at this thing thats been sitting on the table this whole video! Its a stereo amplifier from the 1980s. Right? Well, I think so. And look at that beautiful amber and red VFD, such a nice Wait a minute! This aint what it seems. Oh, JVC, pulling tricks on us again! This display is in fact a backlit LCD panel, made in the style of a VFD! Huh. Thats kinda peculiar, isnt it? I mean, its clearly trying to mimic a VFD, lots of real vacuum fluorescent displays use this exact color scheme, like this Pioneer Laserdisc player. But, if you take a closer look at this display, youll realize it doesnt have the characteristic grid pattern of a VFD, and it has some weird viewing angle distortions. Head-on, this looks rather convincing. But, move your head around a little and youll start to see the inactive elements become more visible in that weird LCD way. Truthfully it took me a while to realize this thing was playing tricks on my like some sort of trick player, but once I did I exclaimed to the heavens, Ive been tricked! And it was very unpleasant. Of course Im kidding, its pretty cool! You can see the big ol LEDs providing the backlighting, both amber and red. *buzzer sound* Never come to conclusions until youve taken the thing apart. Those LEDs? Are really just incandescent bulbs! Yeah. Which makes the next line particularly silly. And I think this is why it looks so convincing, as the two distinct wavelengths of light would produce an effect quite similar to that of real phosphors in a real vacuum fluorescent display. (HA) And of course, since the display operates inversely from most LCDs which have a bright background and darken the active segments, the illusion is pretty good. But heres an interesting question. Why? This is a pretty large display, so perhaps it would have been prohibitively expensive to make a VFD of such proportions. But then again, this LCD seems like a pretty novel thing. Maybe it isnt, but Ive not seen this sort of technique used before so I can only assume that its kinda rare. *buzzer sound* No, you have seen this sort of thing before. On your own microwave. You silly person. OK, OK yes I have seen this sort of thing before, but it was never in a color scheme that so closely matched the delicate glow of my beloved VFDs! Its always been a sickly green, or a sickly orange, or a stupid piercing blue, or some other usually unappealing color. And also making LCDs like this is a way more recent trend, isnt it? Am I off my rocker? Well as it turns out my rocker is in the corner so I am indeed off of it but thats just a silly joke, the fact of the matter is this thing is neat. And I think its sorta unique. Not absolutely. But probably a little. Oh man I should google this, shouldnt I? Lets see JVC RX-222 some pictures. OK, yeah, yeah thats it. Oh, its from 1989 it looks like thats good we were right about that, barely. Oh, and look at that, theres some other models over there that look to have very similar displays well then it looks like JVC was all-in on this little quirky display thing, at least for a while in the late 80s. But was anybody else? Truthfully, I have no idea because if this is a special kind of backlit LCD, I don't know what its called. And without knowing if its got a special name, perhaps LiquiTron Luma+, its difficult to search for. If any of you people out there know if this has a specific name, or if its just an underutilized style of backlit LCD, do let us know because I couldnt be bothered to check that very thoroughly. Well. Thats all I had for this video. Yeah. Umm, but, hey! Lets just play this random CD I found. Im sure there will be some appropriate music on it. [ mechanical noises ] recklessly smooth jazz Just because the video is super short and off the cuff doesnt mean I aint got any bloopers! Wait. This isnt a blooper, I planned this. But it is during the credits Hey credits, is this a blooper? Ah farts. ...that of real phosphors inside a real phosphor fuh fuh fah! Im not enunciating very well at all. This video is what, seven minutes long? Why is it taking me so long to do this? [straining noises] ...and our dumb brains to make it appear as though the whole euh the ble bleugh [angry snarl] One for each of the an ah! ba bu buh. By selectively selecting the control grids, or selectively controlling the control grids. Hmm. Me again. The spirit of the endscreen! Do you know what a pirate's favorite aisle of the craft store is? Why, it be the Isle of Yaaarghn. Shut up you loved it.",
    "transcript_keywords": [
        "display",
        "uninspired informational displays",
        "control grids",
        "LCD",
        "control",
        "VFD",
        "displays",
        "thing",
        "vacuum fluorescent display",
        "make",
        "things",
        "absolutely uninspired informational",
        "backlit LCD",
        "current state",
        "state of gadgetry",
        "uninspired informational",
        "vacuum fluorescent",
        "custom displays",
        "grids",
        "vacuum"
    ],
    "transcript_entity_values": [
        "JVC",
        "Nixie",
        "Lemony Snicket",
        "only one",
        "the Isle of Yaaarghn",
        "two",
        "seven minutes",
        "8",
        "1989",
        "VFD",
        "65",
        "LCD",
        "Pioneer",
        "seven",
        "Game Boy",
        "only 17",
        "One",
        "64",
        "the 1980s",
        "UI",
        "the late 80s"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.10985404998064041,
        -0.10809864103794098,
        0.07288231700658798,
        -0.060863517224788666,
        0.02115682326257229,
        0.0016760192811489105,
        -0.0028670590836554766,
        -0.023440049961209297,
        -0.022517595440149307,
        -0.03614601120352745,
        -0.055807117372751236,
        0.07712574303150177,
        -0.010116051882505417,
        -0.006887746509164572,
        0.0024736656341701746,
        -0.01716240495443344,
        0.0143943652510643,
        -0.018125079572200775,
        -0.07264280319213867,
        0.019462067633867264,
        -0.04989907145500183,
        -0.034329645335674286,
        0.05247834324836731,
        -0.023174647241830826,
        -0.04001622274518013,
        -0.0008805720717646182,
        -0.03572205454111099,
        -0.010403894819319248,
        0.0001886538229882717,
        -0.050301551818847656,
        0.0020824777893722057,
        0.09777550399303436,
        -0.07823733240365982,
        -0.002491268329322338,
        -0.02687804214656353,
        0.04169760271906853,
        0.05454837158322334,
        0.004612510092556477,
        -0.037976983934640884,
        0.04693951457738876,
        0.02676502615213394,
        -0.11257113516330719,
        -0.01013607531785965,
        0.015147188678383827,
        -0.015896212309598923,
        -0.017039233818650246,
        0.047726310789585114,
        -0.020563529804348946,
        0.031232742592692375,
        -0.03366359695792198,
        0.018711645156145096,
        -0.0924878716468811,
        0.11995281279087067,
        0.04043055698275566,
        -0.038547709584236145,
        0.0019365986809134483,
        0.06293636560440063,
        -0.0269410889595747,
        -0.009335697628557682,
        -0.03578620404005051,
        0.06908100098371506,
        -0.0021295815240591764,
        -0.021762339398264885,
        0.012973413802683353,
        0.02333894930779934,
        0.024598749354481697,
        0.004817865323275328,
        0.10631310939788818,
        -0.003089854260906577,
        -0.07653415203094482,
        -0.050688814371824265,
        0.058752357959747314,
        0.03842483460903168,
        0.05417255312204361,
        0.046968549489974976,
        0.025363324210047722,
        0.031797513365745544,
        -0.03993357717990875,
        0.1432652324438095,
        -0.036857135593891144,
        0.08382003754377365,
        0.009569297544658184,
        -0.022557469084858894,
        -0.05085345357656479,
        -0.06195502728223801,
        -0.020718760788440704,
        -0.027438167482614517,
        0.044063542038202286,
        0.023841414600610733,
        0.01012354250997305,
        -0.06560012698173523,
        0.08479613065719604,
        0.09435504674911499,
        -0.029459629207849503,
        -0.00010764762555481866,
        0.020492376759648323,
        -0.04623560979962349,
        -0.08059448003768921,
        -0.07519488036632538,
        0.0715719610452652,
        -0.026799388229846954,
        0.0701080709695816,
        -0.0598873607814312,
        -0.03928537666797638,
        -0.02991030551493168,
        0.039243049919605255,
        -0.04421621561050415,
        0.11939199268817902,
        0.06331919878721237,
        -0.007863315753638744,
        -0.037011440843343735,
        0.08527525514364243,
        -0.023189207538962364,
        -0.032110754400491714,
        -0.031520403921604156,
        0.06431445479393005,
        -0.006366460118442774,
        0.06086208298802376,
        0.05390721932053566,
        -0.07747775316238403,
        -0.0010419102618470788,
        0.0033767407294362783,
        -0.025296254083514214,
        -0.027619769796729088,
        0.06520991772413254,
        -0.07110942900180817,
        -0.05162773281335831,
        2.508846389029477e-33,
        0.047401681542396545,
        0.15181966125965118,
        -0.016336942091584206,
        0.02171245403587818,
        0.05677630007266998,
        0.019495518878102303,
        -0.004203870426863432,
        -0.032480403780937195,
        -0.12677747011184692,
        -0.03873644024133682,
        -0.001466399640776217,
        -0.00407978193834424,
        -0.028451288118958473,
        0.031165683642029762,
        -0.02674407884478569,
        -0.11356668174266815,
        -0.10297109186649323,
        -0.0800304114818573,
        0.007254608906805515,
        -0.06534864753484726,
        0.023200171068310738,
        -0.004100045654922724,
        0.011284420266747475,
        0.04367562755942345,
        0.08019259572029114,
        -0.05283401533961296,
        -0.026786569505929947,
        0.06516339629888535,
        0.07235494256019592,
        0.025469770655035973,
        -0.0661194771528244,
        -0.01430040318518877,
        -0.009721392765641212,
        -0.04208705574274063,
        0.006472574546933174,
        -0.02672765962779522,
        -0.019613616168498993,
        -0.14424608647823334,
        -0.000508196884766221,
        -0.030571071431040764,
        0.025938699021935463,
        0.046330392360687256,
        -0.026093890890479088,
        0.009143506176769733,
        -0.03425659239292145,
        0.010114138014614582,
        0.1421610414981842,
        -0.021123701706528664,
        0.044192343950271606,
        0.020987406373023987,
        -0.0818600133061409,
        0.017410090193152428,
        -0.052029017359018326,
        -0.07420114427804947,
        0.031805455684661865,
        -0.08013159781694412,
        -0.006458230782300234,
        -0.026615211740136147,
        0.011204580776393414,
        -0.03391816467046738,
        0.04404470697045326,
        -0.030488794669508934,
        -0.008159351535141468,
        0.01362342108041048,
        -0.08042144030332565,
        0.030609769746661186,
        -0.009565962478518486,
        -0.0200156569480896,
        0.007401189301162958,
        0.041256360709667206,
        -0.02161841280758381,
        0.03508708253502846,
        -0.06231386959552765,
        -0.1281798928976059,
        0.01725378818809986,
        0.005420120432972908,
        -0.01790202036499977,
        -0.026630934327840805,
        0.05907922238111496,
        -0.012788021937012672,
        0.00230688345618546,
        -0.020016083493828773,
        -0.03599090501666069,
        0.04898294806480408,
        0.05405363440513611,
        -0.014009878970682621,
        0.051419489085674286,
        -0.04285299777984619,
        0.032638054341077805,
        -0.026075297966599464,
        -0.023042770102620125,
        -0.01096978597342968,
        0.09156081825494766,
        0.021216347813606262,
        0.008728213608264923,
        -2.6600597782673482e-33,
        -0.02549920044839382,
        0.021253425627946854,
        0.0025808748323470354,
        -0.03244546055793762,
        0.013020613230764866,
        -0.10146836191415787,
        -0.009041120298206806,
        0.04770372435450554,
        0.04051588848233223,
        -0.04288243502378464,
        0.043254971504211426,
        0.01676744781434536,
        -0.044538866728544235,
        -0.04135943949222565,
        -0.11136357486248016,
        -0.07152675837278366,
        0.020294034853577614,
        -0.01625840738415718,
        0.047106921672821045,
        -0.027091285213828087,
        0.05722060799598694,
        0.06449603289365768,
        -0.08504436910152435,
        0.07055116444826126,
        0.054088909178972244,
        0.020671842619776726,
        -0.004272662103176117,
        0.03793090954422951,
        0.022145457565784454,
        0.03832259774208069,
        0.037570640444755554,
        -0.02905190922319889,
        -0.0027385891880840063,
        -0.003736922750249505,
        0.07724080979824066,
        0.09384747594594955,
        0.12235629558563232,
        0.004417599178850651,
        -0.07187593728303909,
        -0.07564220577478409,
        0.011572262272238731,
        0.0045423349365592,
        -0.09238452464342117,
        -0.04052632302045822,
        -0.07681002467870712,
        0.009164420887827873,
        -0.0472046434879303,
        0.006051476113498211,
        -0.06472383439540863,
        0.006748258601874113,
        0.03394858166575432,
        -0.005146549548953772,
        0.09429984539747238,
        -0.03514184430241585,
        -0.027813369408249855,
        0.07451333105564117,
        0.04863528162240982,
        0.09223712235689163,
        0.00349138374440372,
        0.019744208082556725,
        -0.029189610853791237,
        0.01556084118783474,
        0.03128596395254135,
        0.009266367182135582,
        0.0949438065290451,
        -0.07366709411144257,
        0.031207218766212463,
        0.1034216359257698,
        -0.01294699776917696,
        -0.0008401243248954415,
        -0.02116633951663971,
        0.03248945623636246,
        -0.07215511798858643,
        -0.004017935134470463,
        0.04288909211754799,
        -0.05571264401078224,
        0.07378163188695908,
        -0.0118783637881279,
        -0.048146702349185944,
        0.11247463524341583,
        -0.007534123491495848,
        0.06267784535884857,
        -0.005427314899861813,
        -0.037610072642564774,
        0.08901291340589523,
        0.10457135736942291,
        0.07813848555088043,
        0.036497894674539566,
        -0.030918937176465988,
        0.001398806693032384,
        -0.05066243186593056,
        0.023653235286474228,
        0.015389567241072655,
        0.0587754063308239,
        0.08377326279878616,
        -4.759499461215455e-08,
        -0.006099364720284939,
        0.01631223037838936,
        -0.06467511504888535,
        -0.011565442197024822,
        0.0023872817400842905,
        -0.07300464063882828,
        0.002612797077745199,
        -0.07346156984567642,
        -0.027011213824152946,
        0.0009558192687109113,
        -0.05408394709229469,
        0.04903027042746544,
        -0.04951370507478714,
        0.02981686405837536,
        0.11312418431043625,
        -0.006374914664775133,
        -0.07376223057508469,
        0.013165773823857307,
        -0.07074255496263504,
        -0.03458739444613457,
        0.05810076743364334,
        0.03946171700954437,
        0.048658400774002075,
        0.01554378867149353,
        0.010277781635522842,
        0.01486539002507925,
        0.05665513500571251,
        -0.007484370842576027,
        -0.037615884095430374,
        0.05708625912666321,
        -0.01880130171775818,
        -0.006527703255414963,
        -0.09060279279947281,
        -0.007403329014778137,
        -0.015361537225544453,
        0.018103281036019325,
        -0.09554620087146759,
        -0.011074996553361416,
        0.02999233454465866,
        0.13588544726371765,
        -0.017628077417612076,
        -0.013115487061440945,
        0.051888853311538696,
        0.04028000682592392,
        0.003011778462678194,
        -0.007089738268405199,
        -0.08139745146036148,
        -0.004316298756748438,
        0.0332343652844429,
        -0.08228517323732376,
        0.01483587734401226,
        0.004172938875854015,
        0.008429932408034801,
        0.0014643908943980932,
        0.02619136869907379,
        0.02239408902823925,
        0.035922642797231674,
        0.05982470512390137,
        -0.008941033855080605,
        0.042629219591617584,
        0.07115190476179123,
        -0.04653829336166382,
        -0.021487092599272728,
        -0.007822124287486076
    ]
}