{
    "id": "j5K2eizVbaY",
    "title": "Original iPhone 2G Teardown - TEN YEARS LATER!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-08-28T14:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=j5K2eizVbaY",
    "category": "Howto & Style",
    "tags": [
        "iPhone",
        "Original iphone",
        "new iphone",
        "iPhone 8",
        "iPhone 2g",
        "iPhone one",
        "First iphone",
        "iPhone release",
        "Next iphone",
        "apple",
        "the first iphone",
        "apple iphone",
        "iphone anniversary",
        "technology",
        "iphone 1st generation",
        "iphone 1st gen",
        "tech",
        "2007 iphone",
        "smartphone",
        "repair",
        "fix",
        "screen",
        "battery",
        "broken",
        "teardown",
        "disassembly"
    ],
    "views": 2907129,
    "likes": 51235,
    "comments_count": 2217,
    "description": "The First iPhone ever made was released on June 29th 2007.  And Today, in 2017, its time to take it apart and see what it is made of. This original iPhone was state of the art back in the day. Two megapixel camera, 8gb of internal storage... Sleek metal body, and no visible screws.  How do you take apart the iPhone? Lets find out.   Replacement iPhone 2G screens are HERE:  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   Original iPhone Durability Test:  iPhone 4 Screen Replacement:  iPhone 5 Screen Replacement:  iPhone 6 Screen Replacement:  iPhone 7+ Screen Replacement:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://ebay.to/2giKrWb",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://youtu.be/haRKRKsPBFE",
        "https://youtu.be/okSN54TOcbk",
        "https://youtu.be/qvsLjaW2Qbo",
        "https://youtu.be/t6O-bGY_1dM",
        "https://youtu.be/gH2Uok-9Y8A",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "With the next iPhone launch right around the corner, I think it's a good time to look back and see where it all started. Tearing down the original iPhone that was released in 2007 over 10 years ago. Do you feel old yet? In this video I'll show how to replace the screen and the battery, and see how much different it is on the inside from the more recent iPhones. It did survive my durability test, so let's see if it survives a tear down. [Intro] There are no visible screws on the exterior of the original iPhone, but there is a black plastic segment that with some persuasion can be removed. Exposing 3 Phillips head screws holding the back metal panel in place. And then, you know, the SIM card gets removed as well at some point during this process, preferably before the tear down starts, but better late than never. Taking apart your phone does void the warranty, but as we know, warranties don't last forever and sometimes you just got to fix your own stuff. And that's what I'm here for. The back metal panel is actually really difficult to remove. There's no adhesive, it's just very firmly held in place. My plastic tool did some initial separating from the metal frame of the screen, but my metal tool had to make an appearance and do the actual heavy lifting, successfully unclasping the back metal panel and exposing the high tech insides of the iPhone 2G. There is one ribbon holding the back panel to the phone. This controls the vibrator, headphone jack, and side buttons. It unsnaps just like a little Lego from the motherboard. One super interesting thing is that at the bottom of the headphone jack is a water damage indicator. Smart of Apple to stick it next to one of the largest holes in the phone. If you peer into the headphone jack you can see that it's still white on the inside. This means that my phone has never been wet. If it had gotten wet, the red coloring would bleed through the sticker making the headphone jack pink on the inside. Kind of tricky. There are 3 white signal wires with their circular round head connectors just like we see in all modern phones. I'll unsnap each of these with my tweezers and then pull them off to the side. Three Phillips head screws hold the motherboard in place. It was nice of Apple not to use any proprietary screws to hold this original iPhone together. I wish they had continued that trend. Their recent phones contain proprietary screws which make it a little bit harder to take apart. On the back of the motherboard there are several connectors three of them are the Lego-style connectors that we see on modern phones today. And one of them is the longer style connector which HTC loves to use in all of their phones. The most unfortunate part of repairing an original iPhone though is the battery. It is soldered onto the motherboard and cannot be replaced without soldering skills, which puts a battery replacement beyond the reach of the average person. I'm pretty sure Apple changed this with the next version of their iPhone, the iPhone 3G, but I'll have to take that one apart to be sure. This motherboard holds a whopping 8 gigabytes of total internal storage. The OnePlus 5 Android phone released earlier this year has 8 gigs of RAM. Phones have come a long way in the last 10 years....well, Android phones anyway. The iPhone 7 putters along with just gigabytes of RAM. Speaking of 2, the camera on the original iPhone has two whole megapixels of photo quality. No flash and no optical stabilization. The first phone that implemented optical image stabilization was actually a Windows phone, the Lumia 920, in 2012. Android phones like the LG G2 followed the year after in 2013, and then Apple caught up in 2014, implementing OIS in just one of their phones the iPhone 6 Plus. Now the screen of this phone isn't too bad to remove, it's pretty similar to the iPhone 4 with ten screws all around the outside edge. All of these screws are the same size, except for the bottom two, but it's still good to practice to lay the screws out in such a way that you remember where they go when it's time to put the iPhone back together. Once all 10 of these screws are out, the front metal frame lifts away from the screen. The actual screen removal is pretty tricky during this part. There is an adhesive layer under the black top and bottom sections of the glass so I'm using a razor blade to slice through that while trying not to crack the glass at the same time. If your glass is already cracked, you don't have to be as careful as I am. I'll link replacement screens and other parts in the video description like always. Once that adhesive is cut, there are a series of clasps on both sides of the screen that need to be lifted up, allowing the display to separate from the rest of the phone. I find a razor blade to be super effective with this part, and then the whole display pulls through the frame. Since I'm going to attempt to put my phone back together again, I'm being very careful with these little ribbons they can tear like paper, rendering the display useless. The loud speaker is at the bottom of the phone. And now that we have all of the major components removed, it's time to see if it works when I put it back together. I'll tuck the screen ribbons through the frame first, remembering that these kink and tear easily. Once the screen is mostly in place, I'll position that home button back where I found it. A razor blade is not cosmetically the best choice for this procedure. The metal frame then sits in place, held together by the 10 screws that were laid out in an organized fashion earlier. And now the origami nightmare that is the ribbon cables plugging into the back side of the motherboard. I found it easiest to fold the battery over the top of the motherboard, since it's permanently connected. And then plug the three Lego-style ribbons in first, and then untaping the large charging port ribbon from the back of the phone allows it to extend up enough that I can plug it into the latch connector. First lifting up the latch, plugging in the ribbon, and then locking the latch after it's in. It's actually not too bad. The three screws for the motherboard get screwed in these are different sizes. And then the three white signal ribbons all get connected to their circular slots. The sides buttons, vibrator, and always convenient headphone jack get plugged into the motherboard with this Lego-style connector. And then the back metal plate clamps securely on the body with the three screws holding it down along that bottom edge. And finally, the last bit of black plastic slides up into place, hiding the screws and the internal components. Surprisingly enough, the phone actually turns on. Thumbs up for that. I've taken apart every single other iPhone on this channel, besides the 3G, so if you're into seeing technology from the inside, you should grab some popcorn and settle in. The iPhone 8 will get the same durability and tear down treatment as soon as it's released. So make sure you're subscribed so you don't miss it. Thanks a ton for watching. And I'll see you around.",
    "transcript_keywords": [
        "iPhone",
        "phone",
        "back",
        "screws",
        "phones",
        "original iPhone",
        "back metal panel",
        "back metal",
        "motherboard",
        "metal",
        "screen",
        "headphone jack",
        "Phillips head screws",
        "place",
        "Apple",
        "Android phones",
        "metal panel",
        "iPhone launch",
        "metal frame",
        "headphone"
    ],
    "transcript_entity_values": [
        "earlier this year",
        "2014",
        "iPhone",
        "Windows",
        "8 gigabytes",
        "OnePlus 5 Android",
        "8",
        "Lego",
        "the year",
        "RAM",
        "two",
        "ten",
        "jack",
        "three",
        "Three",
        "2012",
        "Phillips",
        "SIM",
        "10",
        "Apple",
        "the LG G2",
        "2007",
        "first",
        "10 years ago",
        "today",
        "First",
        "the last 10 years",
        "Android",
        "the iPhone 6 Plus",
        "2013",
        "3",
        "One",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.07063619792461395,
        0.07742204517126083,
        0.13709893822669983,
        -0.05055762082338333,
        0.02220122702419758,
        -0.08406516164541245,
        0.018438274040818214,
        0.07580442726612091,
        -0.01074795238673687,
        0.06949468702077866,
        0.09989013522863388,
        -0.010256106965243816,
        -0.016796624287962914,
        0.05377032235264778,
        -0.01186579279601574,
        0.01681777462363243,
        0.024816613644361496,
        -0.024878287687897682,
        -0.0733618438243866,
        0.07806422561407089,
        0.04270746931433678,
        -0.015339341945946217,
        0.017193565145134926,
        -0.04918644577264786,
        0.005224343854933977,
        0.043685972690582275,
        -0.03166012093424797,
        0.0034152374137192965,
        -0.07134547084569931,
        -0.051460765302181244,
        0.00040108608664013445,
        0.0608067587018013,
        -0.10759083926677704,
        0.08845596760511398,
        0.0465250201523304,
        -0.05915865674614906,
        0.03501247242093086,
        0.014331902377307415,
        -0.040779925882816315,
        -0.05113108828663826,
        -0.043997302651405334,
        0.003868325147777796,
        0.023843036964535713,
        -0.013197633437812328,
        0.005553124472498894,
        0.047342877835035324,
        0.11504233628511429,
        -0.043423399329185486,
        0.051487479358911514,
        -0.039301708340644836,
        -0.08121304959058762,
        0.01165962964296341,
        -0.0003317628870718181,
        0.0724024698138237,
        -0.016953658312559128,
        0.018777403980493546,
        0.008682332001626492,
        -0.02672686241567135,
        0.0690252035856247,
        -0.007745259441435337,
        0.08879313617944717,
        0.04952389374375343,
        -0.0013314485549926758,
        0.0719015821814537,
        0.016553187742829323,
        -0.028688380494713783,
        0.013591856695711613,
        -0.1268932819366455,
        -0.023774735629558563,
        0.022688541561365128,
        -0.02674154005944729,
        -0.03449975326657295,
        -0.020442528650164604,
        -0.019786465913057327,
        0.007188499439507723,
        0.03933406621217728,
        -0.014626067131757736,
        -0.021248437464237213,
        -0.03050346113741398,
        0.0077596390619874,
        0.07358270138502121,
        0.017941776663064957,
        0.05269157513976097,
        -0.01311660185456276,
        -0.015479912981390953,
        0.03869812935590744,
        -0.018562527373433113,
        0.1170751303434372,
        -0.018130548298358917,
        -0.11053416877985,
        -0.01887315697968006,
        0.08564072847366333,
        -0.032209452241659164,
        -0.0018535415874794126,
        0.06036588177084923,
        -0.06989169120788574,
        -0.10066796839237213,
        -0.09436812251806259,
        -0.033202797174453735,
        0.03857909515500069,
        0.05898289754986763,
        -0.04971807077527046,
        0.03754439204931259,
        -0.030140085145831108,
        0.044102396816015244,
        -0.05214842036366463,
        -0.08865541219711304,
        -0.010446318425238132,
        -0.010154127143323421,
        0.0370488166809082,
        0.008638116531074047,
        0.08500329405069351,
        -0.04537961259484291,
        0.03601788729429245,
        0.03813231363892555,
        0.035867467522621155,
        -0.04312245920300484,
        0.06762901693582535,
        0.08254851400852203,
        -0.018825333565473557,
        0.008543620817363262,
        -0.01715674251317978,
        -0.031301990151405334,
        0.028334714472293854,
        0.009367401711642742,
        -0.01006647851318121,
        -0.014224840328097343,
        4.2118366666145657e-33,
        -0.002098762197420001,
        0.09119734168052673,
        0.017061345279216766,
        0.0232606902718544,
        -0.028284484520554543,
        -0.0010663788998499513,
        0.06862198561429977,
        0.03986453264951706,
        0.01764407381415367,
        0.03786579146981239,
        0.019962459802627563,
        -0.032497044652700424,
        -0.016014553606510162,
        -0.008218692615628242,
        0.08698593825101852,
        -0.01777011528611183,
        -0.04704108461737633,
        -0.04466748610138893,
        -0.0020217846613377333,
        -0.002798324218019843,
        -0.04189474880695343,
        -0.0451810322701931,
        -0.005910523235797882,
        0.07190417498350143,
        0.04336662217974663,
        0.08444780111312866,
        0.06267766654491425,
        -0.02506486140191555,
        0.03848123550415039,
        0.015599614009261131,
        -0.06939300149679184,
        -0.017604421824216843,
        0.06261031329631805,
        -0.03135179355740547,
        -0.042044367641210556,
        -0.0313853845000267,
        -0.035422250628471375,
        -0.07265210896730423,
        -0.048789989203214645,
        0.003721965476870537,
        -0.0450044609606266,
        0.02741689421236515,
        0.006959128193557262,
        -0.007648260332643986,
        0.05932483822107315,
        -0.02174106054008007,
        -0.028712216764688492,
        0.03880096599459648,
        -0.043245166540145874,
        -0.03446164354681969,
        0.03812345862388611,
        -0.09179713577032089,
        0.012235439382493496,
        -0.07683324068784714,
        -0.12628483772277832,
        0.04567175731062889,
        0.035032421350479126,
        -0.03778309002518654,
        0.042629290372133255,
        0.03118312545120716,
        -0.004884522408246994,
        0.02858833037316799,
        -0.06311637908220291,
        0.050678763538599014,
        -0.03513318672776222,
        -0.006902775727212429,
        -0.016282258555293083,
        0.05335265025496483,
        -0.08367105573415756,
        0.06951538473367691,
        -0.021273445338010788,
        -0.04582253843545914,
        0.01936439611017704,
        -0.04517298936843872,
        0.025804642587900162,
        -0.010175101459026337,
        -0.02295185811817646,
        -0.021638786420226097,
        0.024595852941274643,
        -0.008761566132307053,
        -0.046222373843193054,
        0.03429127484560013,
        0.10775681585073471,
        0.014378737658262253,
        -0.022356681525707245,
        -0.11073984205722809,
        -0.030511317774653435,
        -0.0799359530210495,
        0.05505839362740517,
        0.11316698044538498,
        -0.019531849771738052,
        -0.029513616114854813,
        -0.15134812891483307,
        -0.03266710042953491,
        -0.007290491834282875,
        -6.0564190958470375e-33,
        -0.02802848443388939,
        -0.020506341010332108,
        -0.0004928959533572197,
        0.0017513999482616782,
        0.03537360206246376,
        -0.09308397769927979,
        0.01041918620467186,
        0.10230734944343567,
        0.07605315744876862,
        -0.08627735078334808,
        -7.904889935161918e-05,
        0.06818890571594238,
        -0.03165304660797119,
        0.019324379041790962,
        -0.023930132389068604,
        -0.0338578075170517,
        -0.05550087243318558,
        -0.11504822224378586,
        0.0052202437072992325,
        0.0535244382917881,
        0.089076928794384,
        0.038603127002716064,
        0.09810718148946762,
        0.07095684111118317,
        0.027298972010612488,
        0.012844699434936047,
        0.03961896896362305,
        -0.03778652474284172,
        0.06787888705730438,
        -0.018180759623646736,
        0.01986749656498432,
        -0.09256906807422638,
        0.03120715357363224,
        0.06315390765666962,
        0.04909048229455948,
        0.040429387241601944,
        0.030283119529485703,
        -0.05288012698292732,
        -0.012189174070954323,
        -0.04510792717337608,
        -0.030363650992512703,
        0.12252064794301987,
        -0.005522925406694412,
        -0.045248329639434814,
        -0.02325550653040409,
        -0.06233329698443413,
        0.04814119264483452,
        0.017131932079792023,
        -0.026646960526704788,
        0.025603262707591057,
        -0.04973682016134262,
        0.027025969699025154,
        -0.033593762665987015,
        -0.007110034115612507,
        -0.05663299933075905,
        -0.0009325513383373618,
        0.06257349252700806,
        -0.07680457085371017,
        -0.005028894171118736,
        -0.023143868893384933,
        0.11103371530771255,
        0.0317155085504055,
        -0.053628306835889816,
        -0.05141937732696533,
        -0.020064162090420723,
        -0.06012076139450073,
        0.028492653742432594,
        0.028943808749318123,
        -0.04716392233967781,
        0.02209976315498352,
        0.026904379948973656,
        -0.03926967456936836,
        0.020765943452715874,
        -0.08862175792455673,
        0.041255172342061996,
        0.027715306729078293,
        -0.060488030314445496,
        0.013272290118038654,
        0.012345817871391773,
        -0.0236296895891428,
        0.0769701898097992,
        -0.03867658972740173,
        0.04652762785553932,
        0.056649353355169296,
        0.11500552296638489,
        0.026303043588995934,
        0.04408162459731102,
        0.06481116265058517,
        -0.03500426560640335,
        -0.021257400512695312,
        -0.06362199783325195,
        -0.012512268498539925,
        -0.04093635082244873,
        0.06313920766115189,
        -0.021059531718492508,
        -5.469669162039281e-08,
        0.029706841334700584,
        0.011074730195105076,
        0.0100669264793396,
        -0.0584479384124279,
        -0.002151899505406618,
        -0.06534130871295929,
        -0.025029916316270828,
        0.044716160744428635,
        0.08324001729488373,
        -0.08210098743438721,
        -0.06014389544725418,
        -0.05236775428056717,
        -0.04800792783498764,
        0.08999715745449066,
        -0.05907213315367699,
        0.04516596719622612,
        -0.05832453444600105,
        0.0006016268744133413,
        -0.012710520066320896,
        0.017256850376725197,
        -0.10780805349349976,
        -0.02512887306511402,
        0.03630756214261055,
        -0.03335050866007805,
        -0.0071184514090418816,
        0.055706463754177094,
        -0.11769692599773407,
        -0.05065233260393143,
        0.04191384091973305,
        -0.008256323635578156,
        -0.011942693963646889,
        -0.013882981613278389,
        -0.025332290679216385,
        0.00869926530867815,
        -0.05043768882751465,
        -0.06449124217033386,
        -0.06435605883598328,
        -0.013707144185900688,
        0.08402218669652939,
        -0.029736675322055817,
        0.003929285332560539,
        -0.036884188652038574,
        0.020985936746001244,
        0.04030606523156166,
        -0.004313670564442873,
        -0.06627011299133301,
        0.08295776695013046,
        -0.11266647279262543,
        -0.05265185236930847,
        0.002079747850075364,
        -0.06012248247861862,
        -0.06053731590509415,
        -0.1061258614063263,
        -0.016034608706831932,
        0.024338752031326294,
        -0.037965238094329834,
        0.0713920071721077,
        -0.014122601598501205,
        -0.00019288364273961633,
        -0.04290337115526199,
        0.022784534841775894,
        -0.040926720947027206,
        0.002922093728557229,
        0.07146934419870377
    ]
}