{
    "id": "J_EDZOodc14",
    "title": "Shot on iPhone Xs! Travel Vlog to London!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-09-28T20:41:58Z",
    "video_url": "https://www.youtube.com/watch?v=J_EDZOodc14",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone xs",
        "iphone xs max",
        "vlog",
        "london",
        "forza"
    ],
    "views": 571742,
    "likes": 16160,
    "comments_count": 1428,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- So, we're on our way to London very shortly here and Jenna is filming something. - Oh no, get in the pool! - Jenna's testing her iPhone underwater today. (tranquil music) - [Justine] How was your test? - Good! I'm freezing but I think it works. - [Justine] He's gonna go absolutely nuts right now. (dog barking) It's the same dog, every time he sees it he freaks out. So, if you haven't been able to tell yet, this is an iPhone vlog test. I'm vlogging this entire video on my iPhone. I'm taking Matty for a walk right now. We just finished filing Jenna's underwater test video, if you guys wanna watch that, I'll put the link to her channel in the description below and an annotation. We are actually heading to London. In probably 10 or 15 minutes, we have to drop Matty at Matt's house! Do ya wanna go see Matt? Okay, you ready? Hello! (dog barking) - Oh, come on, nope. Riley. (dog barking) Hey! Riley, Riley, Riley, Riley, Riley. - [Justine] Matt, are you ready for this adventure? - I think I am, are you vlogging? - [Justine] Yes! I haven't vlogged in three months. - [Matt] Same. Congratulations! How much better has your life been? - [Justine] It's been great. (upbeat music) - [Justine] Look how big that suitcase is. Sean, is that suitcase big or what? - It's double the size, it's almost half the size of yours. - [Jenna] Yours is so small! Look at yours! - We made it, we're late, but thankfully the flight is delayed. So, it will all work out. - 9:45 What is this? - 9:45. Oh, that's, I mean, I look like a mess. Ten o'clock! We're finally boarding. There we go! (upbeat music) - Hello! - So, there's no wifi on this flight, so it'll be like 10 or 11 hours without any connection, but I'll probably sleep the whole time. - [Justine] Jen, use the breathe app. - I need-- (upbeat music) - However many hours later, we're here. We made it. Now I have to go through customs. (upbeat music) - [Justine] I need a coffee in this hand immediately. - [Jenna] You're not supposed to do it yourself! - Well, I tried. That's a heart! (upbeat music) Packed way too much. There's horses outside, look! - [Justine] Hello, horsie, are you having a good day? (bright electronic music) I have been up all night, like, all night. So, we landed, got to the hotel, and I thought, \"I'm gonna go to bed now.\" No, that's not the case. I watched the sun rise, I watched these horses out there just grazing and having a great time. Since I slept the entire flight and stayed up all night my original plan was to finish listening to this audio book that I started, it's called \"Captivate\" by Vanessa Edwards, thinking that that would help me fall asleep but it did not. But it's about the science of people and learning why different people communicate in certain ways. There's even like, fun little work books and activities that they talk about in the book and then you go to the website and then, it's a whole thing. But it was a really, really fascinating book, I'm extremely excited to finish it, I am almost done. If you guys want to get a 30 day free trial of Audible, you go to audible.com/iJustine or you can text iJustine to 500 500. Right now, I'm gonna go get lunch with my sister and I don't even know we gotta go to rehearsals for our livestream that's happening later today. I'm so tired. (upbeat music) Today, we are at Goodwood House, this is an incredible estate, it's over 12,000 acres outside of London. I did a really fun livestream for Forza Horizon 4 yesterday, and today we are going to do a bunch of activities. There's balloon rides, we're gonna be racing hover crafts, they also have a Ford Raptor, if you guys don't know I'm obsessed with Ford Raptors and I really, really want one so hopefully they'll let me test drive it here today. They would not let me drive McLaren Senna yesterday. I asked very nicely, I told them that I am an incredible driver, and they said, \"No, you're a liability.\" So, today, I don't know what's gonna happen I got a really massive, I don't want to call it a selfie stick, but it's for a 360 camera, so I can get some really cool shots. You're gonna have to measure this with your iPhone. They told me not to bring a lot of things, but I brought a big selfie stick. I can touch you. - [Jenna] No, please don't. - [Justine] I'm touching you! - [Jenna] No! Don't touch me, get out of here! (upbeat music) - [Justine] One, two, three, four, five, six. Six McLarens. So, I never thought that I needed a McLaren until right now. I mean, it looks like a storm trooper. It's beautiful. So, I'm supposed to be on that side. (upbeat music) Guys, this car is so freaking fun. - Great time. - He's like, I work for them I drive them all the time. This is just another day. (upbeat music) - Wow, wow, wow! That was incredible! Oh my goodness! (bells chiming) Well, the adventure's continuing, we just got done driving the McLarens, well, being driven in them. I have to do a test drive because we had so much fun in those cars, I need to be behind the wheel. We're now going to go on a balloon ride. I've never gone on a balloon ride before. Our friend Suzy was in an air balloon accident. So, I'm not really sure how I feel about this. This balloon is really massive. I've never actually been this close to a hot air balloon before. - Nice and warm. It's not cold though is it? It's a lovely day! Off we go. - Up, up, and away. - That's it. Happy days. - Hello! - Hello. (playful music) - Okay, that was really fun. I'm feeling a little dizzy now. (upbeat music) We're now on the rally car portion, and Tanner is gonna be out driver. This is gonna be so much fun. We actually met Tanner years and years ago. We did this crazy test drive in Madrid. It's fun to be back! I wasn't in your car the first time. This is it. - Ah, no. That's right, you were in a lesser-- - Justin Bell's - A lesser car. - Oh, well, here we are again. What are we doing today, like, what are we driving? - This is a super rally car, we're going around a rally stage that has all four seasons just like Horizons 4 does, so we're gonna go though summer, fall, winter, and spring, it's gonna be amazing. - Oh boy, okay. Do I get in? - [Tanner] Yeah, you get in on this side. - Oh shoot, that's right, this is the wrong side! - [Tanner] Yeah, you always get in on the wrong side. - Okay. - [Tanner] So, get in, we're getcha buckled up. - Okay. This is your first run? - First run! This is gonna be good. Hopefully we won't get lost trying to find the stage. - [Justine] I can put it in my GPS. - Follow the track, see? That's good advice. We just got good advice. - In case I need to free myself, I know how. Twist. - [Tanner] Alright. - Okay, are you ready? - Yeah, we're gonna go find the start of the stage which is over there. - Okay! - [Tanner] Alright, you good? - [Justine] I'm good. How is it over there? - It's pretty hot over here. No, it's kinda cool, but man, it's literally so weird to grab gears with your left hand like this. This is gonna be fun. - [Justine] Yeah, so, famous last words. Oh, boy. - [Tanner] You ready to go? - [Justine] Oh my god! Yes! I'm ready! Oh my! (intense music) Oh my god. (intense music) Oh my goodness! This is so... insane! (intense music) Oh my god! (intense music) (engine revving) The fun is continuing, we just had lunch, and, oh my gosh, we just did a wild ride previous to that with Tanner again inside of the rally car. (intense music) Holy moly! But we're gonna be basically racing the hover crafts and the rally trucks as well, so I don't know what's gonna happen, I can't wait. (bubbly music) Hi! - [Driver] Hey! - Oh, man. This is exciting. - So, this is a Ranger Raptor, so, this is kinda the European model, but we only have this one in Europe at the minute so we have to look after it. - [Justine] Really? - Yeah. - Just this one? - [Driver] Just this one. - We're driving the only Raptor here? - We are. - Wow. Have you seen the VelociRaptor? - Yeah, pretty cool. - Oh my goodness, guys, it's the coolest thing ever. It starts around 349,000 dollars. - Oh, I hit my head, good thing I'm wearing a helmet. - [Justine] Whoa, whoa. (energetic music) Oh my gosh! Holy moly! Oh gosh, this is so (lively music) Ha! Oh, my body... is flailing! I've hit every piece of my body off of this. - [Driver] You can go a little faster in this car. - [Jenna] Yeah, you definitely... - [Friend] That was incredible! - [Justine] How was it? - That was crazy! - [Justine] Oh my goodness. - There was a log of grass in your face. - [Jenna] Yeah, that's what I was thinking - Yeah? It's probably, like, all in my hair. - [Justine] Wow. - [Friend] Ah, man. That was a rush. - Now we're here playing Forza Horizon 4. This is so much fun, we're in one of the sleds. This is one of the non-mobile ones but the other one up there... That one actually moves around. Jenna's over there. This game is so freaking fun, like I'm absolutely loving it. I'm driving to the worst of my abilities, but check this out, I'm gonna do donuts, ready? Here we go! Ha ha ha ha, wow! I'm proud! I've destroyed the Subaru. We're in the McLaren center, this thing's like, a million dollars, and it doesn't even have cup holders. What? Check out this safety harness. This is a proper racing seatbelt for my racing needs. - [Jenna] No cup holder. - No cup holders, that's crazy talk. Right? - [Jenna] Maybe, I don't know. - I mean, all that money and you can't even have a drink. - [Jenna] No drink. - Wow, it's real nice. - [Jenna] It's really nice. - But they won't let anyone ride it. - [Jenna] I wanna go fast. I accidentally pulled this. Cause he's like, \"Figure out how to open the door.\" And I was like, \"This looks like if I need to get out.\" - Oh god! I can't even-- - [Jenna] Do you know how to open the door? - I can't even reach the door, I've got me seat-- - [Jenna] Figure out how to open the door! That didn't feel-- - [Jenna] 'Kay, figure out how to get out! It's like the escape room. It is fun now that I know. - Oh my god! I pushed a button! - [Jenna] Nope! Warmer! Think higher. Over, to the other side. Closer to the front of the car. Think, \"Wow, I really need a reading light!\" - Well. I don't know, how do I get out of here? This is too nice for me. Just kidding. It's perfect. - [Jenna] You could put this in the back of your Ford Raptor. - I could put this in my Ford Raptor. Well, today was so incredible. I hope you guys enjoyed this vlog. I'm not even sure if this vlog can do this day justice because it was so much fun. A huge thank you to Microsoft and Forza, cause this was just unlike anything I've ever experienced and I'm glad I could take you guys with me. So, goodbye, Duke. I think he's staying over there. He's home, but I didn't see him. Time for dinner and then we fly back to LA. B-Bye! All the McLarens are going away! (chill music)",
    "transcript_keywords": [
        "fun",
        "Riley",
        "Yeah",
        "Wow",
        "Ford Raptor",
        "car",
        "today",
        "Good",
        "Raptor",
        "guys",
        "time",
        "Jenna",
        "test",
        "balloon",
        "ready",
        "Ford",
        "day",
        "rally car",
        "god",
        "side"
    ],
    "transcript_entity_values": [
        "Forza",
        "Matty",
        "one",
        "Warmer",
        "later today",
        "Justine] One",
        "McLaren",
        "Ten o'clock",
        "Audible",
        "a good day",
        "iJustine",
        "European",
        "Vanessa Edwards",
        "Justine",
        "Europe",
        "Subaru",
        "iPhone",
        "Today",
        "around 349,000 dollars",
        "10 or 11 hours",
        "three",
        "a Ranger Raptor",
        "Captivate",
        "Suzy",
        "Sean",
        "Justine] Matt",
        "Tanner",
        "Kay",
        "Ford Raptor",
        "Forza Horizon 4",
        "Six",
        "Justine]",
        "LA",
        "winter",
        "years ago",
        "10 or 15 minutes",
        "four",
        "Duke",
        "five",
        "McLaren Senna",
        "summer",
        "Riley",
        "Ford Raptors",
        "six",
        "all night",
        "today",
        "Goodwood House",
        "Justine] Jen",
        "over 12,000 acres",
        "Jenna",
        "two",
        "McLarens",
        "Madrid",
        "almost half",
        "Microsoft",
        "this day",
        "Horizons 4",
        "first",
        "Matt",
        "three months",
        "30 day",
        "the minute",
        "London",
        "a million dollars",
        "Justine] Hello",
        "Riley",
        "yesterday"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "PRODUCT",
        "NORP",
        "PERSON",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "LAW",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "GPE",
        "MONEY",
        "PERSON",
        "PERSON",
        "DATE"
    ],
    "vector": [
        0.023793891072273254,
        -0.06753413379192352,
        0.004316512495279312,
        -0.13656136393547058,
        0.03448600694537163,
        0.03892147168517113,
        0.08463852107524872,
        -0.002003149129450321,
        -0.03865246847271919,
        0.054068490862846375,
        0.061984676867723465,
        0.0006068323273211718,
        0.006542904302477837,
        0.03915155306458473,
        -0.010083610191941261,
        0.029435545206069946,
        0.03528237342834473,
        -0.05322468653321266,
        -0.013669926673173904,
        0.04676865413784981,
        0.01269792951643467,
        -0.04977552592754364,
        0.05465822294354439,
        0.059898532927036285,
        -0.002194726374000311,
        0.08723039925098419,
        0.00022929898113943636,
        0.03532920777797699,
        -0.05848824977874756,
        -0.060451939702034,
        -0.040483441203832626,
        0.021801913157105446,
        0.04297366738319397,
        0.007914113812148571,
        0.04263917729258537,
        -0.02838161215186119,
        0.0500505268573761,
        0.005001565907150507,
        -0.028618352487683296,
        -0.00656553590670228,
        -0.0075958832167088985,
        -0.05760907754302025,
        0.038058090955019,
        0.008603360503911972,
        -0.04298533871769905,
        -0.034014660865068436,
        0.04015989974141121,
        -0.027692152187228203,
        0.05687018856406212,
        0.04759619012475014,
        -0.044175248593091965,
        -0.020816359668970108,
        0.029709678143262863,
        -0.005591139663010836,
        -0.10052891075611115,
        -0.018317602574825287,
        -0.11914613842964172,
        0.039703793823719025,
        0.0551847368478775,
        -0.07870610058307648,
        -0.01850503869354725,
        0.023619262501597404,
        -0.015248148702085018,
        0.07559341937303543,
        -0.04119719937443733,
        -0.05419638752937317,
        -0.05230548232793808,
        0.003315446199849248,
        -0.00212893751449883,
        -0.006704886443912983,
        -0.09038771688938141,
        0.05674870312213898,
        -0.03632018715143204,
        0.011220011860132217,
        -0.03379594907164574,
        0.06942026317119598,
        0.06420757621526718,
        -0.07278997451066971,
        -0.06851325184106827,
        0.028219081461429596,
        0.07166025042533875,
        -0.04017796367406845,
        -0.0704890713095665,
        -0.00412769103422761,
        0.02813686989247799,
        -0.015236995182931423,
        -0.0030981029849499464,
        0.02580171823501587,
        -0.044619448482990265,
        -0.0871550664305687,
        -0.08866315335035324,
        -0.005934472661465406,
        -0.013882279396057129,
        0.01448595616966486,
        -0.008707956410944462,
        -0.05029994621872902,
        0.018106350675225258,
        -0.028419511392712593,
        -0.03341057896614075,
        0.06579281389713287,
        0.06399384886026382,
        -0.035441406071186066,
        -0.0010463593062013388,
        -0.005883585661649704,
        -0.03298459202051163,
        -0.11473031342029572,
        -0.0854601263999939,
        0.03497638553380966,
        0.010768790729343891,
        0.0005733513971790671,
        -0.048977941274642944,
        0.03140246868133545,
        -0.0489196740090847,
        -0.06960360705852509,
        -0.013366414234042168,
        0.06541039794683456,
        -0.0477951280772686,
        0.05739917606115341,
        0.05025613307952881,
        -0.05480891093611717,
        -0.018243854865431786,
        -0.09188429266214371,
        -0.03486667200922966,
        0.04853537678718567,
        0.021778425201773643,
        0.00802649650722742,
        -0.02069801464676857,
        1.3007468003854547e-32,
        -0.08698240667581558,
        0.08089426159858704,
        0.02349967323243618,
        0.05560104548931122,
        -0.027046428993344307,
        -0.06508655101060867,
        -0.014207498170435429,
        0.10889618843793869,
        -0.018911434337496758,
        0.03640615567564964,
        -0.010593335144221783,
        0.014299818314611912,
        -0.02522173337638378,
        0.003837032476440072,
        0.024006901308894157,
        -0.012483293190598488,
        -0.0030581604223698378,
        -0.06170767545700073,
        -0.041373565793037415,
        0.030642908066511154,
        -0.004795021843165159,
        -0.057260408997535706,
        0.020437000319361687,
        0.0744093582034111,
        0.053653739392757416,
        0.08895508199930191,
        0.05934754014015198,
        0.005874140653759241,
        0.07241059839725494,
        0.010039551183581352,
        -0.05665171891450882,
        -0.01271901186555624,
        -0.02637571655213833,
        -0.08131007105112076,
        -0.04577372223138809,
        0.0346454456448555,
        -0.05211838334798813,
        -0.029582621529698372,
        -0.015456091612577438,
        -0.02974945865571499,
        -0.03762093931436539,
        0.013387282378971577,
        -0.11503865569829941,
        -0.0686250552535057,
        0.09131459146738052,
        0.07117220014333725,
        -0.04218286648392677,
        0.01910308375954628,
        -0.01667770743370056,
        0.010123138315975666,
        0.007195071317255497,
        -0.05792996659874916,
        -0.09353353828191757,
        -0.012542604468762875,
        0.0051875063218176365,
        -0.033048056066036224,
        -0.03726239502429962,
        0.04474101588129997,
        0.016473835334181786,
        0.04433522745966911,
        0.044682279229164124,
        0.005838159937411547,
        -0.03164457902312279,
        -0.017471766099333763,
        -0.057218391448259354,
        0.05089921876788139,
        0.05745968595147133,
        -0.07352063059806824,
        -0.005822279024869204,
        0.09152155369520187,
        -0.023283176124095917,
        0.019228365272283554,
        0.10308808833360672,
        -0.010878591798245907,
        0.07859726995229721,
        0.057328350841999054,
        -0.11045647412538528,
        -0.040814824402332306,
        0.03659645840525627,
        0.02871921844780445,
        -0.11620128154754639,
        0.0475987009704113,
        0.006076016463339329,
        0.10411940515041351,
        0.048483915627002716,
        -0.08457905054092407,
        0.01429039053618908,
        -0.01980961114168167,
        -0.007819836027920246,
        0.04561300203204155,
        -0.048013415187597275,
        0.02389724738895893,
        -0.1147392988204956,
        -0.027982940897345543,
        -0.04690699279308319,
        -1.2752410708981066e-32,
        0.020055308938026428,
        0.02684045396745205,
        0.013383549638092518,
        -0.013806451112031937,
        0.018009452149271965,
        -0.022129202261567116,
        0.05956249311566353,
        0.10422734916210175,
        0.07435950636863708,
        -0.03294994682073593,
        0.01957743614912033,
        -0.05339624360203743,
        -0.04680877923965454,
        0.05363348126411438,
        -0.029984112828969955,
        -0.05275677517056465,
        -0.012177311815321445,
        -0.06841491907835007,
        -0.003384845796972513,
        0.0380224846303463,
        0.07014042884111404,
        0.09177793562412262,
        0.08665458858013153,
        0.021023962646722794,
        0.02863480895757675,
        0.019883492961525917,
        0.05697453022003174,
        0.0539262630045414,
        0.03172316402196884,
        -0.005208614282310009,
        -0.05099182203412056,
        -0.04498735070228577,
        -0.0019345296313986182,
        -0.03188970685005188,
        0.020302964374423027,
        0.06057180091738701,
        0.015093614347279072,
        0.06054941192269325,
        0.013061112724244595,
        -0.06798987090587616,
        -0.013983093202114105,
        -0.004867628216743469,
        0.03200839087367058,
        -0.009158956818282604,
        0.03893793001770973,
        -0.09196767210960388,
        -0.08527307212352753,
        0.0485471710562706,
        0.036146704107522964,
        0.022985681891441345,
        -0.029490089043974876,
        -0.041102536022663116,
        -0.057556092739105225,
        0.036781203001737595,
        -0.01247457880526781,
        0.009567703120410442,
        -0.060905247926712036,
        -0.05509939044713974,
        0.049921706318855286,
        -0.0041390638798475266,
        0.027983296662569046,
        -0.04010595381259918,
        -0.07801109552383423,
        -0.061720289289951324,
        -0.012107356451451778,
        -0.10864885151386261,
        0.06353157013654709,
        0.056482356041669846,
        -0.024678796529769897,
        0.04912728816270828,
        -0.007051658816635609,
        0.008960336446762085,
        0.04913423955440521,
        -0.00527970353141427,
        0.011607824824750423,
        -0.011556594632565975,
        -0.06042857468128204,
        0.04011145234107971,
        0.07429314404726028,
        -0.03921239823102951,
        0.004360586404800415,
        0.024192940443754196,
        0.03875602409243584,
        0.0997585579752922,
        0.15307676792144775,
        0.13271215558052063,
        0.08250317722558975,
        0.0008528330945409834,
        -0.020428098738193512,
        0.01876416988670826,
        0.04077782854437828,
        0.03485353663563728,
        0.033155012875795364,
        0.052767734974622726,
        -0.08454739302396774,
        -6.504427574327565e-08,
        -0.01929384097456932,
        0.027512283995747566,
        -0.053892046213150024,
        -0.027413660660386086,
        -0.005428828299045563,
        -0.05707036703824997,
        -0.03228600323200226,
        0.01339918002486229,
        0.10663023591041565,
        -0.05400138348340988,
        0.055829968303442,
        -0.028155336156487465,
        -0.013026331551373005,
        0.137172669172287,
        -0.036889731884002686,
        0.010795445181429386,
        -0.10553500801324844,
        0.07315023243427277,
        -0.023015916347503662,
        -0.01459552627056837,
        -0.06909208744764328,
        0.05186155065894127,
        0.02768164686858654,
        -0.013274230994284153,
        0.06101645156741142,
        -0.017645912244915962,
        -0.02400624379515648,
        -0.0651123896241188,
        0.07350076735019684,
        -0.044724415987730026,
        -0.10479505360126495,
        0.01055231411010027,
        0.002070595743134618,
        0.021850112825632095,
        -0.06836093217134476,
        -0.06535711884498596,
        -0.05309209227561951,
        -0.01647578738629818,
        0.035198695957660675,
        -0.039918944239616394,
        0.010565550997853279,
        -0.1390438973903656,
        -0.008560298010706902,
        -0.007821036502718925,
        0.03574627637863159,
        -0.05489414930343628,
        0.05906388536095619,
        -0.10273156315088272,
        -0.053112659603357315,
        -0.008612613193690777,
        -0.05625151842832565,
        -0.0031588843557983637,
        0.03283558413386345,
        -0.0432143472135067,
        0.08853965252637863,
        -0.003150287317112088,
        0.03814003989100456,
        0.0001999618689296767,
        -0.007018533535301685,
        0.0059346891939640045,
        0.04676119238138199,
        0.002221117727458477,
        -0.06936424970626831,
        0.0430193692445755
    ]
}