{
    "id": "Jamq41tpQ7Q",
    "title": "Samsung Galaxy Z Flip3: A Hater's Perspective",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-09-03T19:22:26Z",
    "video_url": "https://www.youtube.com/watch?v=Jamq41tpQ7Q",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "Galaxy",
        "Z Flip3",
        "Flip",
        "Folding",
        "OLED",
        "Screen",
        "Delicate",
        "Smartphone",
        "22:9",
        "Wide screen",
        "Ultrawide",
        "Compact",
        "Lightweight",
        "Movie watching",
        "Fold",
        "Fold3",
        "Stereo"
    ],
    "views": 1975616,
    "likes": 59157,
    "comments_count": 3431,
    "description": "Get yourself a dbrand skin TODAY at   I'm a huge fan of Samsung's Fold3 5G, so you would think I would naturally be a big fan of the Flip series, but you'd be surprised. Last year's Flip didn't impress me but maybe the Flip3 can change my mind!   Buy Samsung Galaxy Z Flip3 On Samsung (PAID LINK):  On Amazon (PAID LINK):  On Best Buy (PAID LINK):   Buy Samsung Galaxy Z Flip On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Buy Samsung Note 9 On Amazon (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:14 - Phone impressions 2:12 - dbrand's birthday cake 5:01 - Comparing it to the old Flip 7:00 - Why the Flip3 is interesting 8:15 - Camera 9:00 - Exterior screen 10:00 - Battery 10:45 - Display and stereo 11:15 - Closing thoughts",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://geni.us/3gETF1G",
        "https://geni.us/zhiP",
        "https://geni.us/LGuzR",
        "https://geni.us/GcOnC0F",
        "https://geni.us/Bf5vk",
        "https://geni.us/5ai9i",
        "https://geni.us/QfX7fsc",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You've already heard from the lovers, now you're going to hear from a hater. I love the Fold3, but the Flip series is one that I have never really been able to wrap my brain around. I mean, why go to all the effort of engineering a folding screen, just so that you can use a phone that fundamentally looks exactly like the one that you've been using for the last four years? Everything from the thickness to the size of the display, I mean, even the IO is, it's just the same. Let's take a look at this thing. Starting on this side, we've got our lock button, which doubles as a fingerprint sensor, our volume rocker, a noise-canceling microphone over here. We've got our SIM tray. Single SIM on this particular model, just one SIM card installs in there. Down at the bottom we've got more microphones, a speaker, got a USB C port. Everything about it, it's pretty much your old phone, but new. Well, with the exception obviously being the folding display, and Samsung has come a long way with their foldable screen technology. Unlike the first-generation ones, this screen is bright enough that I can comfortably use it outdoors. That was one of my big issues with the original Fold. The crease is still visible. In fact, I wouldn't really say that it's any less visible than it was before, but that part also never bothered me. The part of the hinge that did bother me was the fact that it acted as a point of ingress, which made it impossible for Samsung to rate these folding devices as water or dust resistant. Well, that changes. The Flip3 is actually IPX8 water resistant. So they're rating it in two meters of water for up to 30 minutes, if I recall correctly. Another key benefit of Samsung's latest generation foldable OLEDs is that they can run it up to 120 hertz, which means whether you're just swiping through notifications and home screens or whether you're gaming on the go, you're gonna get a much, much smoother experience. Now, something I'm actually not sure about. I know the first gen one wasn't 120 hertz, but was the Fold 5G 120 hertz? I'm trying to remember. - [Jono] We'll find out after. Here's a present from dbrand. - Apparently, instead of answering my question, I'm being given this present from dbrand. Do I need eye protection? - [Jono] No. - Well, you know how those guys are. Ow, ow, ow! How many do you have? Ow! - [Jono] It's for your birthday! - Oh, look at that. It's a birthday cake. I'm sure there's some kind of awful twist. - [Jono] Here. I want a piece. - [David] Me too. - [Linus] I think there's a phone in there. - [Jono] What are you talking about? - [James] Use your hands! - [David] No, I want a piece! Don't use your hands. Aw. (laughs) - Sorry, dbrand. You win some, you lose some. I'm a pretty sharp character, and I think I can tell when there's a phone in my cake. David, does that look like a David size piece? - [David] That's way too big. - Really, David? - [David] Yeah, that's way too big. Give me like a third of that. - I don't believe you. David, you're not gonna like this. He actually wants a Flip3. - [David] Oh no. - Did they bake it in? Oh, dbrand, dbrand, dbrand. Yeah, here. Sorry, you guys can see this while I unearth it. Oh, that's unfortunate. - [David] Is this the old one or the new one? - This is the old one. - [David] Is it waterproof? - No. - [David] Aw, bummer. - Ooh, it's cold. Was this in the fridge? - [Jono] (laughs) Yes. - Oh my God, there's cake on the inside of it. \"Have a birthday.\" Not a good birthday, just a birthday. I did. I did have a birthday, thank you. Thank you, dbrand. They've got an aged Linus face picture. Oh my God, does it still turn on? - Oh, hey, yeah! (men laughing) - This cake... Oh, that's awful. - [David] The hinge chocolate, no! - The hinge is all chocolate, boys. Why would they do this? Buy stickers from dbrand, I... Oh my God. Hold on a second. Is this cake at least good? It smells really good. Oh, that is really good. Okay, David, you have to help me. You have to help me take this one. No, no, here's yours. - [Jono] Thank you. - [David] If you insist. - It's really good. - Very chocolaty. - Mm-hmm. With that complete derailment out of the way, dbrand makes high quality skins, cases, all kinds of good stuff for your phone, game console, pretty much you name it, they've got a skin for it. Check them out. I'm sure they are gonna have an awful insulting vanity URL down in the video description. Just click through to that and you can get your own devices skinned, hopefully with something a little more attractive than this. One other big improvement to the screen is operation in kind of semi-folded mode. So you can see that if we put them both at the same angle, like let's say you're sitting and watching a teeny tiny little movie. Okay, like this. The new one, the Flip3, manages to tilt back that far without kind of rocking around. But if I were to bump this desk, you can actually see that the last gen one is gonna kind of teeter-totter, even though they're both at pretty much exactly the same angle here. So can you see that, David? So they've just adjusted the weighting a little bit to make it so that you can really put the hinge at any angle that you want. No movie is better with a teeny tiny screen. I mean, that's one of the reasons that I am super into the Fold series, but obviously not everyone wants to deal with the fact that the Fold is literally double the thickness of the Flip series. Like, if what you're after is the biggest possible screen, a folding screen has got you covered there with the Fold3. And if what you're after is the smallest possible pocketable device, well, that's where the Flip3's strength comes in. Let's go ahead and try it. Will it fit? Yes, we could even fit another one. Maybe one of these. I mean, these pants have pretty big pockets though, so. There you go. How many diagonal inches of screen do I have in my pocket at this point now? Your answer... - [Men] Whoa. - A lot. But nothing I've said so far addresses why I declared myself to be a hater when it comes to the Flip series. And that is because of the price. Last time around, the flagship Flip device was just shy of 1,500 US dollars. That's a lot to pay for, in my opinion, a user experience that is pretty much the same as a regular candy bar phone. This time around, the story changes. Now they're asking just over $1,000 for the Flip3. Now, that's still a lot of money, but when you consider that flagship phones from Samsung's competitors like Apple are already at or above the $1,000 price point, all of a sudden, well, it starts to make sense. Because instead of just being basically the same experience as my old phone, but for more, it's basically the same experience as my old phone, and now the folding is just extra. So it's still got a Snapdragon 888 processor. It's still got 8 gigs of RAM, 128 gigs or 256 gigs of storage, just like other flagship phones on the market, but it folds. That's not to say it doesn't have any disadvantages. If you were hoping to find a headphone jack, you won't find one here. It has a mere 3,300 milliamp power battery, which is on the low end for a flagship phone these days. And of course, because they're trying to build this thing to be as thin as humanly possible, because most of the time when you put it into your pocket or your bag or whatever else, you're gonna have it folded, you're giving up some of the, well, some of the optical advantages of having a large camera bump, like you might have on a typical candy bar phone these days. It does have two 12-megapixel rear shooters, as well as a single selfie camera, which can be digitally adjusted to accommodate a larger group of friends, if say, for example, you have them. I'll just put my arm around someone imaginary, but I'm sure you would have a friend to take a picture with. And switching back to the rear, you've got just a regular, sort of regular lens. And then you've got an ultra wide that is... Wow, that is extremely wide. It's basically fisheye. So I've got my finger here, David, just holding it by this corner. - What? - And my finger is in the frame right now. - [David] Whoa, wow. - Yeah, I mean, if you're into it, then I guess that's an advantage. But if you're not gonna use that all the time, then I don't personally see that as an advantage. Another big advantage over the last Flip is that the exterior display is a lot bigger. So whether it's showing you charging indication or the time or notifications, it's, in my opinion, a much, much more usable size. Though, I have to confess that personally, I find these types of mechanisms kind of gimmicky. The reality of it is for me, it's all about time-to-use. So if this is in my pocket then it is just as fast for me to pull it out and flip it out and just be looking at the main display as it is to pull it out, see it... Like, what do I want, a pager? Like, what year is it? Pull it out, look at this, then decide to open it up. That to me is not very realistic. But if you're the kind of person that typically has your phone on the desk next to you, I could see it being useful. I just don't see it being that much more useful than just having it sitting there like that. One cool feature that Samsung's added this time around, although it's more of a software feature, is I think they call it care battery or battery care or something along those lines, but you can configure your phone to only charge to 85% maximum. It's something that it shouldn't give you a ton of stress if you 100% charge up your battery, but every little bit counts and your battery is under its most stress when it is completely charged, like that last 20% or so. So if it was me personally, I would actually use that feature, assuming that it was a convenient one for me to make use of. Now I wanna talk about one of the things that's different about this particular folding candy bar experience compared to a regular phone, and that is the extremely tall display. So it's a 22 by 9 aspect ratio, which basically means that cinematic content like this \"Shang-Chi\" trailer here, pretty freaking awesome. Almost anything else though is gonna have really, really large black bars. Now, something I wanna try out here is... Da-da-da-da-da-da-da Yes, it does have an amplified earpiece speaker, so you can expect a good stereo experience out of it. Like, the compromises you're making for the foldability, they are there, but they're not nearly as there as they were even one generation ago. And the fact that the pricing is now coming down, it's like the one multiple device category where prices seem to be coming down rather than up. It's starting to get compelling. Something I didn't mention before, but that I noticed almost immediately, is that I do find between the taller display as well as the fact that the hinge gets in the way, the lock button and fingerprint sensor is a little bit out of the way for me to reach. From the bottom, I don't have very big hands, that's where my thumb comfortably rests. And it's a solid like centimeter and a half below where that lock button is. And I have to kind of, I have to shift. I like to have this corner of the phone in my palm and I have to shift it in order to access it. Not the end of the world by any stretch of the imagination, but it does mean moving the phone around in your hand more, which could increase the likelihood of drops. Samsung does seem to have kind of at least thought of this. So they're using Corning Victus glass in the design, obviously not on this side, but fortunately the foldable screen is another area where Samsung has improved these a ton. There's actually an included screen protector that in my opinion feels almost as good as glass. Even last generation it was kind of like soft, like you could put your fingernail into it and it would have a clear indentation left behind. I mean, I'd say it's good enough, in my opinion. - [David] You should try folding it the other way, see what happens, - Yeah, yeah, yeah, yeah, yeah, yeah. Yeah, yeah. Bend, redo bendgate here. Anyway, thanks for watching. Subscribe to Short Circuit.",
    "transcript_keywords": [
        "phone",
        "Yeah",
        "screen",
        "dbrand",
        "Samsung",
        "kind",
        "David",
        "good",
        "Flip",
        "pretty",
        "big",
        "folding",
        "Flip series",
        "birthday",
        "time",
        "experience",
        "display",
        "Fold",
        "SIM",
        "fact"
    ],
    "transcript_entity_values": [
        "22",
        "888",
        "Da-da-da-da-da-da-da",
        "IO",
        "12-megapixel",
        "100%",
        "a ton",
        "SIM",
        "One",
        "RAM",
        "two meters",
        "8",
        "one",
        "USB C",
        "Fold",
        "up to 30 minutes",
        "Flip",
        "Fold",
        "9",
        "second",
        "the last four years",
        "3,300 milliamp",
        "IPX8",
        "Fold 5",
        "Flip3",
        "just over $1,000",
        "120 hertz",
        "David",
        "Samsung",
        "128",
        "1,500 US dollars",
        "1,000",
        "like centimeter and a half",
        "85%",
        "third",
        "256",
        "first",
        "these days",
        "one generation ago",
        "two",
        "120",
        "Snapdragon",
        "Short Circuit",
        "Linus",
        "jack",
        "James",
        "last 20%",
        "Corning Victus",
        "Apple",
        "Shang-Chi"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "PERCENT",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.17866404354572296,
        -0.026993757113814354,
        0.05664980784058571,
        -0.051714494824409485,
        0.06740695983171463,
        -0.011832298710942268,
        0.01930747553706169,
        0.11362021416425705,
        -0.00910905096679926,
        0.009955628775060177,
        0.021281028166413307,
        0.04950060695409775,
        0.028300967067480087,
        -0.010184833779931068,
        0.06045188382267952,
        -0.049965277314186096,
        0.019275810569524765,
        -0.033963385969400406,
        -0.016155995428562164,
        0.008287371136248112,
        0.02618264965713024,
        -0.046374108642339706,
        0.042407043278217316,
        -0.04279953986406326,
        0.05018621310591698,
        -0.034372325986623764,
        -0.02658381126821041,
        -0.020004471763968468,
        -0.008721012622117996,
        -0.0337122417986393,
        0.0070312609896063805,
        0.11319316178560257,
        -0.0010082105873152614,
        -0.03631936013698578,
        -0.046758610755205154,
        -0.11155997961759567,
        0.013241107575595379,
        -0.06391964852809906,
        -0.04223873093724251,
        0.020000528544187546,
        -0.006821817718446255,
        0.013048832304775715,
        -0.011695269495248795,
        -0.027319462969899178,
        0.0322662778198719,
        -0.047138288617134094,
        0.028347168117761612,
        0.020411143079400063,
        -0.016252201050519943,
        0.059435032308101654,
        -0.004858607891947031,
        -0.030338995158672333,
        -0.01742265187203884,
        0.03175683319568634,
        -0.03896379843354225,
        0.05224485695362091,
        -0.012043759226799011,
        -0.02126782014966011,
        0.03762563318014145,
        -0.02530766651034355,
        0.0873769149184227,
        -0.09169965982437134,
        -0.06247666850686073,
        0.04356155917048454,
        0.026268186047673225,
        0.030943989753723145,
        -0.016154121607542038,
        -0.0015334498602896929,
        -0.03860113024711609,
        -0.007295351475477219,
        -0.062498949468135834,
        -0.006935537327080965,
        0.04982243478298187,
        0.07561323046684265,
        0.007952144369482994,
        0.023212255910038948,
        0.15122950077056885,
        -0.065569669008255,
        -0.06718366593122482,
        0.007687055971473455,
        -2.7162819606019184e-05,
        -0.0412171296775341,
        -0.06210128962993622,
        0.0011399753857403994,
        0.029460454359650612,
        -0.04092703014612198,
        0.00399028230458498,
        0.0779857262969017,
        -0.044966921210289,
        -0.044429343193769455,
        0.014194933697581291,
        0.14066262543201447,
        0.030619142577052116,
        -0.006218702532351017,
        -0.030062701553106308,
        0.04326934367418289,
        -0.03629542514681816,
        -0.05686206370592117,
        0.005444358568638563,
        0.06592779606580734,
        0.09514646977186203,
        0.02108580805361271,
        0.10849498957395554,
        -0.005237031728029251,
        -0.01416914165019989,
        -0.05786633491516113,
        0.011874505318701267,
        0.06729800999164581,
        -0.08603472262620926,
        0.016322186216711998,
        -0.019726522266864777,
        0.02134205773472786,
        0.0046523017808794975,
        -0.049452994018793106,
        -0.11333423852920532,
        0.016796598210930824,
        -0.04671024531126022,
        0.04569203779101372,
        0.10731364786624908,
        0.0050803604535758495,
        0.02327132225036621,
        0.04280411824584007,
        -0.04820551723241806,
        -0.0823248028755188,
        -0.0347285121679306,
        0.046565279364585876,
        -0.08221614360809326,
        3.096602931661229e-33,
        -0.05959014222025871,
        0.09792831540107727,
        -0.07300033420324326,
        -0.056349530816078186,
        -0.019785970449447632,
        0.08042533695697784,
        0.005945972632616758,
        0.029897307977080345,
        -0.07194146513938904,
        0.062015123665332794,
        -0.061235424131155014,
        0.0708676129579544,
        -0.03594549000263214,
        0.011759367771446705,
        -0.01692047528922558,
        -0.01725471019744873,
        -0.06308948993682861,
        0.003436914412304759,
        -0.006525753065943718,
        -0.031871020793914795,
        0.05407530069351196,
        -0.01484218705445528,
        0.013980228453874588,
        -0.03425979986786842,
        0.04373455420136452,
        0.00590155553072691,
        0.019676432013511658,
        -0.06891446560621262,
        0.06937514990568161,
        -0.0003962678893003613,
        -0.005996779538691044,
        -0.02264878898859024,
        0.08524269610643387,
        -0.09263251721858978,
        0.030087534338235855,
        0.02561911754310131,
        -0.04762934893369675,
        -0.12053973227739334,
        0.027242980897426605,
        -0.038235779851675034,
        -0.03110356442630291,
        0.03848288208246231,
        -0.10070496052503586,
        0.02211030386388302,
        0.008197289891541004,
        0.08157680928707123,
        0.021116092801094055,
        -0.028142772614955902,
        0.044079482555389404,
        -0.018097124993801117,
        -0.03124409168958664,
        -0.047429125756025314,
        -0.10418979823589325,
        -0.003979573491960764,
        -0.019060878083109856,
        -0.031096072867512703,
        -0.0028962506912648678,
        -0.00590472063049674,
        0.01162702590227127,
        0.0327703095972538,
        -0.027098583057522774,
        0.026399115100502968,
        -0.04205034673213959,
        -0.005658622365444899,
        -0.14111195504665375,
        0.07751244306564331,
        0.04931219667196274,
        -0.06090767681598663,
        -0.0812537744641304,
        0.010063459165394306,
        -0.022431926801800728,
        -0.028406748548150063,
        0.029802236706018448,
        0.040906958281993866,
        0.016131717711687088,
        0.00670752814039588,
        -0.047458466142416,
        0.016986770555377007,
        0.032347872853279114,
        -0.049822352826595306,
        -0.056412965059280396,
        -0.038081057369709015,
        0.04382358491420746,
        0.06737018376588821,
        -0.012738285586237907,
        0.012890633195638657,
        0.009531200863420963,
        -0.06605490297079086,
        0.0295023825019598,
        -0.020362261682748795,
        -0.01796327531337738,
        -0.020699549466371536,
        0.05312559753656387,
        -0.005096982233226299,
        -0.04017598554491997,
        -3.381845819437873e-33,
        -0.09363754838705063,
        -0.01151867862790823,
        -0.02603140100836754,
        0.04739971458911896,
        0.005438010208308697,
        -0.024252956733107567,
        0.042601246386766434,
        0.013531675562262535,
        -0.013285466469824314,
        -0.06971833109855652,
        -0.0026035320479422808,
        0.053559161722660065,
        0.019939804449677467,
        -0.03852273151278496,
        0.008753184229135513,
        -0.06779704988002777,
        0.07193823903799057,
        -0.11233261227607727,
        0.025589140132069588,
        -0.001473129610531032,
        0.12104032933712006,
        0.038779474794864655,
        0.0006966406363062561,
        0.1167110949754715,
        0.0092464629560709,
        0.021299269050359726,
        0.06414443999528885,
        0.012437356635928154,
        0.04207297042012215,
        0.06330037117004395,
        -0.01809845119714737,
        -0.040360987186431885,
        0.02471783384680748,
        -0.0042897677049040794,
        -0.000849352974910289,
        0.040701769292354584,
        0.03233937919139862,
        0.06502433866262436,
        -0.02552233450114727,
        -0.020631400868296623,
        -0.001842109370045364,
        -0.013668668456375599,
        0.05644991248846054,
        -0.004310021176934242,
        0.006623285822570324,
        -0.03490911424160004,
        -0.03831353411078453,
        0.04557354375720024,
        -0.009794129058718681,
        -0.005702183581888676,
        -0.05917299911379814,
        -0.014505218714475632,
        0.03144538030028343,
        -0.07087206095457077,
        -0.04227208346128464,
        0.05280255526304245,
        0.0614786334335804,
        -0.047066278755664825,
        0.024141965433955193,
        0.02169821597635746,
        0.026949835941195488,
        0.005277681164443493,
        0.015531188808381557,
        -0.04076854884624481,
        -0.037265345454216,
        0.00792208407074213,
        0.09247519820928574,
        -0.02502620965242386,
        0.01213627215474844,
        -0.001968713942915201,
        -0.07598613947629929,
        0.0145551273599267,
        -0.008328689262270927,
        -0.157347172498703,
        -0.03741428628563881,
        0.10058341920375824,
        -0.060069456696510315,
        0.05247902870178223,
        0.0007700049318373203,
        -0.03101416490972042,
        -0.013718826696276665,
        0.06212108954787254,
        0.09901826083660126,
        0.03700748458504677,
        0.036425698548555374,
        0.017191831022500992,
        -0.06185212358832359,
        -0.004948167130351067,
        -0.0069200582802295685,
        0.013254763558506966,
        -0.12471843510866165,
        0.00394322257488966,
        -0.05425795540213585,
        0.08491083234548569,
        0.03319534286856651,
        -5.170507577645367e-08,
        0.0266971904784441,
        0.02809893898665905,
        0.08438748121261597,
        0.03008466400206089,
        -0.020026667043566704,
        -0.02414926514029503,
        0.013833215460181236,
        -0.017272504046559334,
        0.09128080308437347,
        0.03569783642888069,
        0.01793278194963932,
        -0.07809928059577942,
        -0.08366331458091736,
        0.014933797530829906,
        0.036427609622478485,
        0.06284704804420471,
        -0.02323262207210064,
        0.0562707893550396,
        -0.03245796263217926,
        -0.013680698350071907,
        -0.007853369228541851,
        0.06847908347845078,
        0.059102900326251984,
        -0.036817535758018494,
        0.10776868462562561,
        0.022213397547602654,
        -0.029514331370592117,
        0.05137822777032852,
        0.09031930565834045,
        -0.0425010584294796,
        -0.04043472930788994,
        -0.010950754396617413,
        0.04088546335697174,
        -0.001796655124053359,
        -0.010157439857721329,
        -0.08007743954658508,
        -0.008885585702955723,
        0.01225198246538639,
        0.0600309818983078,
        0.06143656000494957,
        0.04060728847980499,
        0.027324963361024857,
        0.003939858637750149,
        0.04093966260552406,
        -0.04573402553796768,
        -0.10530900210142136,
        -0.007902252487838268,
        -0.06424442678689957,
        0.044928546994924545,
        0.010642259381711483,
        -0.01189291663467884,
        -0.12205450981855392,
        -0.1124277114868164,
        0.0036655524745583534,
        0.07459422200918198,
        0.012358142994344234,
        -0.009829391725361347,
        0.025304831564426422,
        -0.031688254326581955,
        0.10649199783802032,
        0.01902020536363125,
        -0.13382220268249512,
        -0.03382332995533943,
        0.07562144845724106
    ]
}