{
    "id": "JBYHwRXmEhY",
    "title": "I Ripped Up My Sponsor’s Check - Intel Fab Tour",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-05-19T18:15:58Z",
    "video_url": "https://www.youtube.com/watch?v=JBYHwRXmEhY",
    "category": "Science & Technology",
    "tags": [],
    "views": 2108224,
    "likes": 94381,
    "comments_count": 4199,
    "description": "Check out NZXT BLD today at:   Get your Crucial DDR5 RAM today at:   You've waited long enough for a follow-up. It's what we're calling the \"overview tour\" of the giant Intel fab I visited in Israel. The place where the CPUs are made. It's amazing.  Learn more about Intel Transistor's:   Discuss on the forum:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:15 Step 1: Design 2:15 Power-on Room 3:22 Validation Lab 5:50 Stability Testing 7:25 Product Platform Validation 8:15 This robot installs CPUs lol 10:10 Outro",
    "description_links": [
        "https://nzxt.co/LinusBLD",
        "https://crucial.gg/LTT_DDR5",
        "https://youtu.be/Z7M8etXUEUU",
        "https://linustechtips.com/topic/1432108-i-ripped-up-my-sponsor%E2%80%99s-check-israel-design-center-tour-2/",
        "https://lttstore.com",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Intel's sponsored, or at least they tried to. I have never done this before, but shortly after I arrived at Intel's Israel development center, I ripped up the previously agreed upon sponsorship check. Because the lab here is so far beyond anything I have ever seen before in my life that I would've paid them to take a tour of it. What you guys are about to see is the full monty. Not just the facilities and the equipment, but the people who created many of my favorite CPUs. From Core 2 duo back in 2006, all the way to 12th gen Alder Lake. And somehow, maybe they were all sick, PR and marketing didn't get in the way, giving me nearly unlimited access to the engineers, lab techs and project leads. You wanna know how the sausage gets made? Wrong video, but if you wanna know how CPU gets made you've come to the right place. Oh, just like our sponsor, Crucial, don't just work faster, work better. Crucial's DDR5 Ram is engineered for efficiency, so you can load, transfer and download files faster, with less lag time and more efficiency. Get your Crucial DDR5 Ram today using the link below. (upbeat music) Creating a CPU takes a really long time, from this wishlist scribbled on a whiteboard by engineering to final delivery 12th gen core was about a 30 month process. The first step is design, that takes a year or more of hundreds of engineers working tirelessly to build a simulation of a working processor. Once they're pretty sure it's gonna work, the blueprints get handed over to the fab to produce a batch of ES1 or Alpha silicon. That's gonna take a few months due to the incredible complexity of the fabrication process. But that doesn't mean they're gonna be waiting around, the simulated version of the chip can be used in the meantime to develop firmware, software and testing tools. And launching any new processor design, let alone the four dies and six different configurations from nine to 240 Watts of Alder Lake, requires close collaboration with partners. So at this stage Intel shares high level timelines and design considerations, like expected thermals and power consumption. Of course, there's no guarantee that what they get back from the fab is going to work. In fact, it's pretty much a given that it won't. Man I would give just about anything to be a fly on the wall in this room during a product launch. This is the power on room, and when the first ES1 chips roll off the line Intel flies experts in every field. Memory, bios, networking, you name it, to here in Israel where they all get together in this room with the goal of powering on the chip, and booting an operating system. Sounds simple enough, right? But no, even the best simulations can't possibly hope to account for all of the problems that can occur in the real world. And I give you my personal Linus tech tips guarantee that if I brought a black light in here I'd find sweat, blood and tears on pretty much every working surface. - I work more than 24 hours in a day to make it happen. It's really amazing, I was even when my wife give a birth was my little child, it's even more than that. You will say that. (group cheering) - Once the most game break bugs are ironed out, usually through software and firmware workarounds, that ES1 silicon makes its way out to the validation lab. Where the goal is to achieve a much higher level of functionality. And this place is absolutely wild. So make sure that you're subscribed for the deeper dive that's coming. There is so much crazy gear in here that I actually extended my trip to make an additional video about it. Which is another first. But let's get you through the basics for now. It's divided into multiple zones, each of them focused on validating either a specific subsystem or some combination. CI IVT is right outside the power on room, and this acts as a small scale testing ground for new fixes, which could easily be rolled out multiple times a day while the lab is running full tilt. As you might expect the core IP section, where they validate the CPU cores themselves is the biggest. And by an even bigger margin than you probably already realize, this lab everything you just saw, actually only contains the team that worked Alder Lake's P cores or high performance cores. The E core, or efficiency core validation lab is somewhere else entirely. But if you keep wandering around in here, you'll find basically everything else. The mislabeled memory debug team faced some really unique challenges with Alder Lake thanks to the four separate memory technologies that it has to support during the transition from DDR4 to DDR5. External devices like Thunderbolt docks and USB drives need to be tested. And woo. This aisle is fondly nicknamed times square, because it's full of all the different kinds of screens that you might wanna connect to your computer. High resolution, high refresh rate, HTMI 2.1, you name it they've got it. And sometimes all at once. This Alder Lake mobile test bench was running 4K video on two high resolution external monitors, plus the embedded display port display to represent the built-in one on your notebook. It's looking pretty good ladies and gentlemen. The only thing missing around here is some quality desk pads from lttstore.com. What is this mice directly on the table? All of these teams work in parallel as much as possible, testing, retesting, making sure that someone's else's fix didn't break your own biz. Until finally we end up in SST. Stress and stability testing is where the smaller scale validation now gets run over longer durations, and at a much greater scale. Most of the ES1 bugs will be squashed, or at the very least bound. And then they go through the whole process again with more refined beta ES2 silicon. Then rinse and repeat until finally the design is ready for prime time. Which doesn't mean that testing is over. Every chip that rolls off the line gets validated, but at Intel scale quality control can't possibly be done by hand like this. So let's go downstairs and see some really cool robots, shall we? The device under test, in this case a CPU, gets installed in what's called a tester interface unit. Which is a giant PCB that plugs into the back of the green machine and is covered in probe points that can be monitored using the oscilloscope in the back. This tells the engineers exactly what's happening on even a single pin during the test. Then when it's ready, the thermal head here, which we met earlier, presses down and the tests begin. What you're looking at right now is basically the same test rig, but designed for an engineer to stand in front of it and work on it manually. And with rigs like these Intel can throw vectors at anything from a single transistor, to a block of transistors, to an entire subsystem of the whole chip, or any combination of the above. And they can do it at temperatures ranging from subzero all the way up to over a hundred degrees, with the help of the thermal head. Synthetic tests are fine and good, but PPV is the end game. Product platform validation takes place on pretty much every CPU off the line at this point. And involves taking that theoretically working processor and installing it in an actual motherboard, connected to actual storage memory and peripherals. And checking to make sure that everything is working as expected. These rigs can do all kinds of cool things that a customer would never encounter in the real world. They can even have the CPU go to sleep, but still output to a display. I'm sure there's a reason that they test that, but it's not obvious to me. This one's a little more obvious. I love this room. It's all fine and good to have one processor that works with that one kit of memory that you validated it with. But if you wanna deliver a consistent experience you need way more data. And robots like this one can help you get it. Whether you wanna test a huge number of CPUs with every possible configuration of memory. Or, run countless chips through a test where they're using an external graphics card. This is the place to do it. And okay, actually it's not countless, Intel did disclose that over 10,000 systems get powered on internally before they launch, in order to hit their quality target. And they never rest, remember that timeline we talked about before? If Alder Lake was started 30 months ago, do the math. That means Meteor Lake is almost certainly well underway. And if we were to rifle around through the stacks and stacks of processors in this place, we would almost certainly find Raptor Lake chips and more. They do everything from compute, to communications, to AI and security here. And if Alder Lake is anything to go on all that stuff that's in development is gonna be hecka exciting. Just like I'm excited to tell you about our sponsor. NZXT, with NZXT Build getting a custom-built PC is easier than ever. It's available in the US, Australia, Germany, Netherlands, France, and Italy. And allows you to find a PC that fits your needs perfectly. Whether it be a custom, a pre-built, or a build kit. Just set your budget, see how your PC will perform in your favorite games, and Build takes care of the rest. You can even customize and upgrade your build with various NZXTT case options, and RGB lighting setups. NZXT features transparent pricing, with a flat $99,00 assembly fee in your local currency. And they'll ship within 48 business hours. With all your PC's components covered by one warranty plan NZXT will manage any problems that you have through their expert live chat for real time help and troubleshooting. There's even free and easy returns for any system that does not meet the build engine FPS performance guarantee within 10%. So check out NZXT Build today using the link in the video description. If you guys enjoyed this video maybe go check out the fab tour. Because I think that's the only thing that we've ever done that can hold a candle to this tour of the research and development center.",
    "transcript_keywords": [
        "Alder Lake",
        "Lake",
        "Intel",
        "Alder",
        "gen Alder Lake",
        "CPU",
        "build",
        "work",
        "Intel sponsored",
        "test",
        "worked Alder Lake",
        "NZXT Build",
        "Alder Lake mobile",
        "NZXT",
        "lab",
        "Core",
        "Raptor Lake chips",
        "Memory",
        "Intel Israel development",
        "room"
    ],
    "transcript_entity_values": [
        "nine",
        "PCB",
        "NZXT",
        "one",
        "a year",
        "four",
        "12th",
        "first",
        "a hundred degrees",
        "RGB",
        "Alder Lake's",
        "Thunderbolt",
        "Crucial",
        "10%",
        "today",
        "SST",
        "10,000",
        "Australia",
        "ES2",
        "PPV",
        "30 months ago",
        "NZXTT",
        "a few months",
        "Israel",
        "NZXT Build",
        "DDR5 Ram",
        "30 month",
        "Meteor Lake",
        "AI",
        "more of hundreds",
        "FPS",
        "Raptor Lake",
        "48 business hours",
        "4",
        "US",
        "Netherlands",
        "IVT",
        "2.1",
        "more than 24 hours",
        "NZXT Build",
        "CPU",
        "six",
        "USB",
        "Linus",
        "France",
        "Alder Lake",
        "2006",
        "Alder Lake",
        "two",
        "Italy",
        "Intel",
        "Alder Lake",
        "Germany"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "TIME",
        "CARDINAL",
        "GPE",
        "GPE",
        "ORG",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "DATE",
        "GPE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "GPE"
    ],
    "vector": [
        -0.0939486175775528,
        -0.012296993285417557,
        0.009513123892247677,
        0.004122174810618162,
        0.049111995846033096,
        -0.06121581420302391,
        0.006771509535610676,
        0.03699351102113724,
        -0.06358850747346878,
        -0.07383743673563004,
        -0.008389310911297798,
        0.00890663918107748,
        -0.059578049927949905,
        -0.008553418330848217,
        -0.046502407640218735,
        -0.020391440019011497,
        0.04781150072813034,
        -0.12944433093070984,
        -0.025399114936590195,
        -0.055011678487062454,
        -0.021288296207785606,
        -0.05056602507829666,
        0.013222087174654007,
        0.0026684969197958708,
        0.037795424461364746,
        0.009033813141286373,
        0.06604621559381485,
        0.004174889996647835,
        0.0040765181183815,
        -0.05387713760137558,
        -0.02188616432249546,
        0.09622300416231155,
        -0.037767767906188965,
        0.0006800112896598876,
        0.05792078748345375,
        0.04191966354846954,
        -0.006201170850545168,
        -0.048873234540224075,
        0.01378035917878151,
        -0.09604757279157639,
        0.016296064481139183,
        -0.04009745642542839,
        0.06498835235834122,
        0.03913963958621025,
        0.04850035160779953,
        0.040628183633089066,
        0.037952251732349396,
        -0.12117377668619156,
        0.011018279939889908,
        0.02667117491364479,
        -0.06074858829379082,
        -0.10754064470529556,
        0.06260824203491211,
        -0.0364825576543808,
        -0.017384812235832214,
        0.040818583220243454,
        0.04920990765094757,
        -0.05460043251514435,
        0.021965201944112778,
        -0.0026022070087492466,
        0.05063573271036148,
        -0.09542413800954819,
        -0.03517751395702362,
        0.015418079681694508,
        0.019924558699131012,
        0.006730238441377878,
        -0.01901807077229023,
        0.02978709526360035,
        -0.000947965367231518,
        -0.02375105582177639,
        0.0493030846118927,
        -0.033633969724178314,
        -0.004473123699426651,
        0.06998523324728012,
        -0.03692375123500824,
        -0.04589374363422394,
        0.05108805373311043,
        -0.048366136848926544,
        0.06303388625383377,
        -0.039307452738285065,
        -0.020476114004850388,
        -0.07038884609937668,
        0.08395981043577194,
        -0.057498373091220856,
        0.07579305768013,
        -0.02585894986987114,
        0.06745070219039917,
        -0.044019442051649094,
        0.022759290412068367,
        -0.07422689348459244,
        0.0005827298737131059,
        0.05305885896086693,
        0.0448746457695961,
        -0.0017301503103226423,
        0.022663192823529243,
        0.03162643685936928,
        -0.008246214129030704,
        -0.027982410043478012,
        0.020380696281790733,
        0.08149513602256775,
        0.07440686225891113,
        0.05711126700043678,
        0.01777753047645092,
        0.037835247814655304,
        -0.09164807200431824,
        0.013021248392760754,
        -9.999535541282967e-05,
        0.15082797408103943,
        -0.015179120004177094,
        -0.009725632146000862,
        -0.032392945140600204,
        0.10785044729709625,
        0.0036714214365929365,
        -0.08316946029663086,
        -0.01599665731191635,
        -0.07452311366796494,
        -0.039904240518808365,
        0.03041062504053116,
        0.0905594676733017,
        0.004027810413390398,
        -0.03490570932626724,
        0.06512152403593063,
        -0.03145566210150719,
        0.019980628043413162,
        -0.012158132158219814,
        -0.004099115263670683,
        -0.17268888652324677,
        -8.58766030529861e-34,
        -0.0023889520671218634,
        0.01903952844440937,
        -0.07376950979232788,
        -0.00746965454891324,
        0.02294648252427578,
        -0.051865749061107635,
        -0.029374223202466965,
        -0.03001106157898903,
        -0.05311586707830429,
        0.029968131333589554,
        0.027664097025990486,
        -0.022056089714169502,
        0.0020529746543616056,
        0.047852061688899994,
        0.018122132867574692,
        -0.13596108555793762,
        0.016738245263695717,
        -0.0382516123354435,
        0.007523594424128532,
        -0.013668264262378216,
        0.05415456369519234,
        -0.049805253744125366,
        -0.02629794552922249,
        0.00233972049318254,
        0.07248733192682266,
        -0.014629057608544827,
        0.029516996815800667,
        0.017857441678643227,
        -0.001178888836875558,
        0.04650183394551277,
        -0.006659885868430138,
        -0.02938711829483509,
        -0.042201850563287735,
        -0.11505284905433655,
        -0.0020811702124774456,
        0.046989236027002335,
        -0.06837613135576248,
        -0.08802831918001175,
        -0.012582793831825256,
        -0.019656646996736526,
        0.04923544079065323,
        0.0345405638217926,
        -0.15404094755649567,
        -0.03638111799955368,
        -0.027244195342063904,
        0.06252732127904892,
        -0.012002797797322273,
        -0.000300335930660367,
        0.08651132881641388,
        -0.040601108223199844,
        -0.09194398671388626,
        -0.009195532649755478,
        -0.07500220835208893,
        -0.02382035180926323,
        0.05688044801354408,
        0.004902238957583904,
        -0.006663904525339603,
        -0.0038547723088413477,
        0.1019299328327179,
        0.11107878386974335,
        0.024950772523880005,
        0.05248204246163368,
        -0.08003885298967361,
        0.032133761793375015,
        -0.1020493283867836,
        0.07358825951814651,
        0.05651604011654854,
        0.03735516220331192,
        -0.07296430319547653,
        0.018252477049827576,
        -0.021886149421334267,
        -0.013839459046721458,
        0.09548091888427734,
        -0.001702326931990683,
        -0.02955816499888897,
        0.024934137240052223,
        -0.11807642877101898,
        -0.09813130646944046,
        -0.030100513249635696,
        -0.010704326443374157,
        0.01089607272297144,
        -0.041167259216308594,
        0.04591124504804611,
        -0.017857706174254417,
        -0.038661640137434006,
        0.020025793462991714,
        -0.016383033245801926,
        -0.07401696592569351,
        -0.016089903190732002,
        -0.035790324211120605,
        -0.0245647095143795,
        -0.051860421895980835,
        0.04562051594257355,
        -0.007837112993001938,
        -0.10484057664871216,
        -2.2554586634761478e-33,
        0.006473913788795471,
        -0.012238413095474243,
        0.013116721995174885,
        0.031334564089775085,
        -0.013388266786932945,
        0.005077187437564135,
        0.03596958518028259,
        -0.01069729682058096,
        0.004481942392885685,
        0.010763335041701794,
        -0.0031431219540536404,
        0.06579738110303879,
        -0.035992275923490524,
        -0.05421479791402817,
        0.007744506001472473,
        -0.024130092933773994,
        0.0044763959012925625,
        -0.07393573969602585,
        0.08490084856748581,
        0.012644622474908829,
        0.06247955933213234,
        0.053397227078676224,
        -0.03157898038625717,
        0.019390251487493515,
        -0.00863241869956255,
        0.030538881197571754,
        0.015222147107124329,
        0.08103948086500168,
        0.0158673208206892,
        0.008689671754837036,
        -0.017220236361026764,
        -0.0672069564461708,
        -0.006964084692299366,
        0.04243762046098709,
        -0.020565135404467583,
        0.024499619379639626,
        0.056935276836156845,
        0.011124154552817345,
        -0.04248172789812088,
        -0.0032623151782900095,
        0.012195984832942486,
        0.027926990762352943,
        -0.03335611894726753,
        0.023869851604104042,
        -0.05240408331155777,
        0.021114112809300423,
        -0.032705824822187424,
        -0.0030738727655261755,
        0.057898055762052536,
        -0.10662084817886353,
        -0.033603716641664505,
        -0.043220166116952896,
        0.0702618807554245,
        -0.04468601942062378,
        -0.03622279688715935,
        -0.02215353399515152,
        2.599443178041838e-05,
        0.052752528339624405,
        0.013411367312073708,
        -0.044483136385679245,
        0.0543842688202858,
        -0.06900772452354431,
        0.06446442753076553,
        -0.055356644093990326,
        0.0139986677095294,
        -0.02980484999716282,
        0.0632334053516388,
        0.054155133664608,
        -0.05934596806764603,
        0.018180128186941147,
        -0.045474305748939514,
        0.008819704875349998,
        -0.026172365993261337,
        -0.04396854341030121,
        -0.04364824295043945,
        0.06852530688047409,
        0.041927117854356766,
        0.013945149257779121,
        -0.00018179832841269672,
        -0.06582098454236984,
        0.011120126582682133,
        0.007355017121881247,
        -0.014002492651343346,
        -0.004096131306141615,
        0.08575285226106644,
        -0.005509566981345415,
        0.005888217128813267,
        -0.023879192769527435,
        -0.051690880209207535,
        -0.043767187744379044,
        -0.08199905604124069,
        -0.0712108314037323,
        -0.025820504873991013,
        -0.003897332586348057,
        -0.02075083740055561,
        -5.890218091053612e-08,
        0.06378893554210663,
        -0.00020748637325596064,
        -0.026098495349287987,
        0.03450224921107292,
        0.03340107947587967,
        -0.06232175603508949,
        0.03407084196805954,
        -0.021973177790641785,
        0.06376530230045319,
        0.0234665684401989,
        -0.020303895696997643,
        -0.05638827383518219,
        -0.02519776113331318,
        0.02016235701739788,
        0.06168821081519127,
        0.023422904312610626,
        -0.06577825546264648,
        0.07453064620494843,
        -0.011777813546359539,
        -0.08815541863441467,
        -0.026149552315473557,
        0.06086654216051102,
        0.12161719053983688,
        -0.041109781712293625,
        -0.017990320920944214,
        0.07063446938991547,
        0.02772386744618416,
        0.06023239344358444,
        0.08282750844955444,
        -0.059444501996040344,
        -0.12765423953533173,
        0.046886760741472244,
        0.05834650620818138,
        -0.06000771000981331,
        0.09935163706541061,
        0.004871281795203686,
        0.0025187821593135595,
        0.012940945103764534,
        0.07668961584568024,
        0.029620569199323654,
        -0.05307220295071602,
        -0.040899887681007385,
        0.051256705075502396,
        0.07813690602779388,
        0.009683907963335514,
        0.016314253211021423,
        -0.06055121868848801,
        -0.0696684941649437,
        -0.013439839705824852,
        0.009002181701362133,
        0.0403471402823925,
        -0.006904688198119402,
        -0.02752280794084072,
        0.11253204196691513,
        0.026835113763809204,
        0.07423102110624313,
        -0.11237790435552597,
        -0.01808125711977482,
        -0.014771675691008568,
        0.09536546468734741,
        0.09653273969888687,
        -0.07711862027645111,
        -0.05808980017900467,
        0.008453009650111198
    ]
}