{
    "id": "JcvF8duW_Ok",
    "title": "Finally got the Nintendo Switch Lite!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-10-10T21:54:57Z",
    "video_url": "https://www.youtube.com/watch?v=JcvF8duW_Ok",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Nintendo switch lite",
        "unboxing",
        "teal",
        "turquoise"
    ],
    "views": 1896125,
    "likes": 39281,
    "comments_count": 3773,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we're unboxing the new Nintendo Switch Lite. I'm a little bit late to the unboxing and checking this out because I was out of town this past weekend. So I didn't get a chance to get it on release date. But I am so excited because I travel a lot and I always have my Switch with me. So anything that could maybe make that traveling experience a little bit easier, with a little bit smaller of a console, I am so into. A huge thank you, Nintendo, for sending me one of these to check out. I am so excited because ever since they announced this, I was like, \"Okay, cool. \"A smaller Nintendo Switch, in fun colors? \"Yes, please.\" So this is the turquoise version. It also comes in yellow and a gray. I love this color. This looks so great. Let's open it up and check it out. (Justine gasps) Look a this. Oh, yeah, okay. Okay, all right. This already feels better. Mostly just because it feels like it's all one piece, which it is. Here it is, like, look. (sighs) I love this color. (relaxed music) So this is pretty minimalist. All you have is a charger and the console. So the main question that I think a lot of people are asking themselves is, \"Do I need a Nintendo Switch Lite? \"Which Nintendo Switch should I get?\" This feels like a replacement for the 3DS or the 2DS. And if you ever plan on playing on your TV, if you wanna dock this, this one is not dockable. This is solely for portable gaming. Now if you already have a Nintendo Switch and you also want to have Nintendo Switch Lite, you can still use the Lite version with your other Nintendo Switch, but I think it gets a little bit complicated with the cloud saving. 'Cause you have to set one of your Nintendo Switches as a primary Nintendo Switch and one is the secondary. And I'm not sure if there's an easy way to do that yet. I haven't tried it out yet these are only from articles and reviews that I've read, so I don't 100% know. So this also doesn't have a kickstand. So this is something that really is made for just handheld play. But you can connect Joy-Cons if you do you wanna play in tabletop mode, so that is also an option. But again if you do want to be able to play on your television, this is not the Switch for you. You would have to get either the launch version or the new Nintendo Switch. Now the difference between the new Nintendo Switch is it does have a little bit faster of a processor, and the battery life is a little better than the launch version. The Nintendo Switch Lite battery is about the equivalent of the original Nintendo Switch, but the new Nintendo Switch has a better battery life than this one in the launch Nintendo Switch. Does any of us make sense? It's really not that complicated, but I feel like as I'm saying these words everything just sounds very difficult. Either way, let me break this down for you. Do you want to only be able to play on the go and save a $100? Get the Switch Lite. Do you wanna be able to dock your Nintendo Switch and be able to take it on the go? Then get the Nintendo Switch and pay an extra $100. 'Cause it's kind of crazy that this is only, like, $200. You're getting an incredibly powerful machine in the palm of both of your hands. I feel like the Nintendo Switch is probably gonna be due for a larger upgrade sometime in the near future. Since I guess the original one came out in 2017. So the screen. (Nintendo Switch clicks) Oh, hello. So this screen is a little bit smaller than the previous version of addition to Switch. But because the screen is smaller the pixel density makes it seem like the screen is a little more crisp. So that is something that you should notice. Okay, we're successfully connected. Will I remember my password for my Nintendo Account? Probably not. (laughs) \"Import user data,\" okay. \"Do you still have the console?\" Yes. \"A system update is required.\" Okay. You do that! So we're gonna go to system settings, we're gonna update this. Then we're gonna transfer everything over. This antenna Switch and I, we have been through so much together. We have been around the world and back again. So you can definitely tell the size difference. It's basically like if you took off one of the Joy-Con controllers. So that's about the size. Nintendo also sent a \"Legend of Zelda: Link's Awakening\". (sighs) I'm so excited because I have a bunch of travel coming up, so this is gonna be so perfect. I love mobile gaming. I know that we're talking about Nintendo, even having the Apple Arcade has been amazing. Just because no matter where I am, that I wanna play a game to pass in time. I have games in the palm of my hand. This is cool. I'm gonna need to get a Nintendo Switch case now. (gasps) If you guys have any recommendations for some carrying cases, let me know. Are you restarting now? This does look pretty good. I like that it has a full D-pad. Where's this one, they have to kinda make the little buttons so it's like a fake D-pad. Since the Joy-Cons are so interchangeable. \"Downloadable software purchased \"by the transferred user \"will no longer put on the original.\" \"On the.\" Huh? \"Will you be keeping the previous console \"in addition to this one?\" Yes. Okay, so let's get this all set up. I'm gonna transfer over all of my data from gonna Switch to this Switch and then it all should be well. - [Narrator] A few moments later. - Okay guys, that was actually a lot easier than I thought. Right now I've got \"Tetris\" installing and I ended up doing the digital download of \"Zelda: Link's Awakening\" because, for some reason, I just prefer having it as digital, as opposed to a cartridge. That means I'm gonna, maybe, give this as a gift to Jenna. Jenna! Can you come here real quick? Remember we played this at E3? \"Zelda: Link's Awakening\". (Jenna gasps) - That was fun. (Justine gasps) - She's a big smile on her face. Okay, here you go. Jenna doesn't wanna be seen. (laughs) But look at the new Switch Lite! No, you can't have that! Careful it's downloading. It's downloading, careful. Careful. No, that's my phone. (laughs) Did you just leave it there? (laughs) - Is it actually for me? - Yes, it's actually for you. Jenna thought I was fake giving her a gift. (laughing) - [Jenna] I thought it was a fake gift. (laughs) (Justine laughing) - What games do I have on here? What have I been playing? \"Overcooked\", love. \"Mario Tennis Aces\". \"Mario Party\". Oh my god, \"Diablo\". (gasps) What a great game. \"Super Mario Bros. Deluxe\". We got \"Tetris\". \"Lego Movie\", \"Mortal Kombat\", \"Mario Maker\". Well thank you guys for watching, I look forward to testing this out a little bit more and also finding a nice case for it. Let me see. Amazon, let's see what we have for Nintendo Switch Lite cases. This is the case that I have been using for the regular Nintendo Switch. This was honestly something I just found on Amazon and I'd loved it because it's such a small profile. I just put my things in there. Got my little extras here. And course my Zelda. (sighs) Precious, precious, precious. So it looks like they have where this is like the same exact case, but for the Switch Lite. Thank you, I will take it. Count me in, I will put a link in the description if you wanna check it out. I mean, it's nothing fancy it's just exactly what I need. You know what I also wanted to get? Wireless Bluetooth transmitter. It was Twelve South, I believe. So it looks like there's a couple of them. Let's see here, I think it was Twelve South that had one. So this one's a bestseller, so I'm gonna go with this one. We're gonna try this out and see how it works. - [Narrator] The next day. - My Amazon orders have already arrived. So I got my case and then the little Bluetooth adapter. This carrying case looks perfect. It's basically the same exact case that I had before, but smaller. And that's the unboxing of the case. Let's see what it looks like in here. Looks just like my other case but smaller. A little place for cartridges and just probably put some headphones or something here. That's a good little spot to put this. \"Welcome to a life with better sound.\" Got a few accessories here. What are you? I haven't seen you since 1990. I've got a lotta of things here. And if you guys missed the memo, this basically will turn anything that you have with a 3.5 millimeter headphone jack into Bluetooth. \"Pairing, when powered on press the power button twice \"to start pairing.\" Just got these new Sony headphones. Very nice. (dog barking) Well, I'm glad these are noise canceling. Look how cool I'm gonna be. Oh, come on. \"Bluetooth is connected.\" Can you hear that or no, is that in my head? Oh my gosh. This sounds so good. Why have I not got one of these sooner? How long about a Switch? This is incredible. (relaxed music) Well see you guys in my next video. Thank you so much for watching. Let me know what games you guys are playing on your Nintendo Switches or if you have a 3DS or 2DS, I would love to hear what you guys are looking forward to most. I cannot wait for \"Luigi's Mansion\" and I'm definitely pre-ordering. It looks like it's coming out on Halloween, which is so perfect. Until then, I'll see you guys later.",
    "transcript_keywords": [
        "Nintendo Switch",
        "Nintendo Switch Lite",
        "Switch Lite",
        "Switch",
        "Nintendo",
        "Nintendo Switch case",
        "smaller Nintendo Switch",
        "launch Nintendo Switch",
        "original Nintendo Switch",
        "Switch Lite cases",
        "primary Nintendo Switch",
        "regular Nintendo Switch",
        "Lite",
        "Switch Lite battery",
        "Nintendo Switches",
        "case",
        "guys",
        "bit",
        "Switch case",
        "Link Awakening"
    ],
    "transcript_entity_values": [
        "Tetris",
        "1990",
        "a \"Legend of Zelda: Link's Awakening",
        "Lite",
        "one",
        "E3",
        "Amazon",
        "2DS",
        "Switch",
        "Justine",
        "Nintendo",
        "an extra $100",
        "Nintendo Account",
        "Sony",
        "2017",
        "100",
        "100%",
        "Mario Party",
        "gonna Switch",
        "3DS",
        "the Nintendo Switch",
        "Zelda",
        "Luigi's Mansion",
        "Bluetooth",
        "jack",
        "Super Mario Bros. Deluxe",
        "the Switch Lite",
        "200",
        "Nintendo Switch Lite",
        "Mario Tennis Aces",
        "Zelda",
        "next day",
        "Nintendo",
        "Mario Maker",
        "Halloween",
        "Nintendo Switch",
        "Joy-Cons",
        "Kombat",
        "Zelda",
        "Twelve",
        "2DS",
        "Jenna",
        "Wireless Bluetooth",
        "Switch Lite",
        "the Switch Lite",
        "the Joy-Cons",
        "3.5 millimeter",
        "Lego Movie",
        "the Apple Arcade",
        "Nintendo Switches",
        "this past weekend"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "NORP",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "PRODUCT",
        "DATE"
    ],
    "vector": [
        -0.041975829750299454,
        -0.09422275424003601,
        -0.018403327092528343,
        -0.12653042376041412,
        0.01828920841217041,
        0.04602665454149246,
        0.07752620428800583,
        0.071747325360775,
        -0.03280482068657875,
        0.08230087161064148,
        0.0009055756381712854,
        0.006523369811475277,
        -0.06965650618076324,
        0.02759304828941822,
        0.0338277705013752,
        0.0765625536441803,
        -0.023801198229193687,
        -0.00960923545062542,
        0.008460283279418945,
        0.017880646511912346,
        0.012095200829207897,
        -0.10140647739171982,
        -0.00038597852108068764,
        -0.015945594757795334,
        -0.038991253823041916,
        0.09540282189846039,
        0.009775803424417973,
        0.03136150538921356,
        -0.0942603349685669,
        -0.08578428626060486,
        -0.048691291362047195,
        0.004721943289041519,
        0.0691440999507904,
        -0.012046419084072113,
        -0.022181551903486252,
        -0.06376449763774872,
        0.02913631685078144,
        -0.04302400350570679,
        -0.0068893167190253735,
        -0.047763414680957794,
        -0.0020663996692746878,
        -0.03006746619939804,
        0.01811939664185047,
        -0.01987735740840435,
        -0.08334913104772568,
        -0.06584852933883667,
        0.0014471096219494939,
        -0.05484732985496521,
        0.04475734382867813,
        0.05788027495145798,
        -0.07617158442735672,
        -0.034442029893398285,
        0.0426933690905571,
        0.010398893617093563,
        0.004117698408663273,
        0.0380929671227932,
        -0.05722608044743538,
        0.014822943136096,
        0.10043755918741226,
        -0.07451706379652023,
        -0.0027063253801316023,
        -0.03280322998762131,
        0.03454787656664848,
        0.04134003445506096,
        -0.06557025760412216,
        -0.032135654240846634,
        0.010886969976127148,
        -0.009315109811723232,
        0.005272251088172197,
        -0.04075237363576889,
        -0.10942960530519485,
        0.06262814253568649,
        0.007933920249342918,
        0.0012850739294663072,
        -0.054990652948617935,
        0.030592074617743492,
        0.040167588740587234,
        -0.029248805716633797,
        -0.029310209676623344,
        0.051903657615184784,
        0.017023911699652672,
        -0.03297659009695053,
        -0.07275543361902237,
        -0.021703116595745087,
        0.027507968246936798,
        0.044644489884376526,
        0.03564798831939697,
        -0.024398865178227425,
        -0.038600336760282516,
        -0.040292948484420776,
        -0.1022520512342453,
        0.009296857751905918,
        0.010486859828233719,
        0.006041298620402813,
        -0.04493849352002144,
        -0.06787927448749542,
        -0.0006334130885079503,
        -0.09121336787939072,
        -0.045492060482501984,
        0.05496102571487427,
        0.030056199058890343,
        -0.04860331863164902,
        0.032303448766469955,
        -0.0629030391573906,
        -0.004087507724761963,
        -0.13241441547870636,
        -0.04835307225584984,
        0.039715468883514404,
        -0.028897171840071678,
        0.027645286172628403,
        -0.018080521374940872,
        0.04626794531941414,
        -0.05038955435156822,
        -0.04265686497092247,
        0.023243438452482224,
        0.07133737206459045,
        -0.036662209779024124,
        0.0969962477684021,
        0.02704395353794098,
        0.045354992151260376,
        -0.003563342383131385,
        -0.04988362640142441,
        -0.007053638342767954,
        0.04440248757600784,
        -0.013148698955774307,
        0.036995790898799896,
        -0.010584081523120403,
        1.2721199864598795e-32,
        0.025799207389354706,
        0.0681314617395401,
        -0.012329074554145336,
        0.07363022118806839,
        -0.015276739373803139,
        -0.019557932391762733,
        0.018037309870123863,
        0.13780857622623444,
        -0.04438731074333191,
        0.000891771400347352,
        -0.022900862619280815,
        0.04809479042887688,
        -0.07224933058023453,
        0.05597100779414177,
        0.04779598116874695,
        -0.05459599941968918,
        -0.0014459331287071109,
        -0.07536108046770096,
        -0.045270003378391266,
        -0.019506866112351418,
        0.008687646128237247,
        -0.02127867192029953,
        0.052980270236730576,
        0.09888952225446701,
        0.049922309815883636,
        0.09922163933515549,
        0.04064678028225899,
        -0.019927337765693665,
        0.07094084471464157,
        0.007101866882294416,
        -0.06475083529949188,
        -0.04416403919458389,
        -0.001146111637353897,
        -0.06489613652229309,
        0.038831379264593124,
        0.019440848380327225,
        -0.03984615206718445,
        -0.015672186389565468,
        -0.054419439285993576,
        0.007511820178478956,
        -0.023474635556340218,
        -0.02426336705684662,
        -0.051718179136514664,
        -0.05156489089131355,
        0.09310250729322433,
        0.04191628471016884,
        0.03718284144997597,
        0.03626067936420441,
        -0.004377575591206551,
        0.05193513259291649,
        -0.07294518500566483,
        -0.021919572725892067,
        -0.04089019075036049,
        0.009992221370339394,
        0.0030630487017333508,
        -0.10766846686601639,
        -0.03445342928171158,
        0.06994554400444031,
        0.08053716272115707,
        0.04483519867062569,
        0.02962958812713623,
        0.030354715883731842,
        0.009177845902740955,
        -0.03925951197743416,
        -0.04535632207989693,
        0.13368242979049683,
        0.07532227039337158,
        -0.08749543130397797,
        0.04010863974690437,
        -0.010561558417975903,
        0.008860639296472073,
        -0.026977552101016045,
        0.05322854965925217,
        0.022876307368278503,
        0.05302336812019348,
        0.06364946812391281,
        -0.11165614426136017,
        -0.0777411013841629,
        0.01970907859504223,
        -0.037284303456544876,
        -0.07507482171058655,
        0.06132727488875389,
        -0.014179868623614311,
        0.07027541100978851,
        0.0239869337528944,
        -0.06588653475046158,
        0.049564991146326065,
        -0.012600226327776909,
        -0.07183892279863358,
        0.006280461326241493,
        -0.029963351786136627,
        0.08560653775930405,
        -0.06127537041902542,
        -0.03536466136574745,
        -0.012541507370769978,
        -1.1870421869195749e-32,
        0.016128791496157646,
        -0.013658861629664898,
        0.01226620189845562,
        -0.007788061164319515,
        0.04973973333835602,
        -0.0375797264277935,
        0.02581769786775112,
        0.08612460643053055,
        0.06481774896383286,
        -0.037027757614851,
        0.029031237587332726,
        -0.06562169641256332,
        -0.10482639074325562,
        -0.013191767036914825,
        -0.05542631074786186,
        -0.04460155591368675,
        -0.03617819771170616,
        -0.053441695868968964,
        0.061058394610881805,
        -0.025821955874562263,
        0.06603604555130005,
        0.1103476732969284,
        0.038518358021974564,
        0.0626821368932724,
        -0.01878242753446102,
        0.04034993052482605,
        0.055644720792770386,
        0.04125555604696274,
        0.04873828962445259,
        0.02506554126739502,
        0.01148295123130083,
        -0.016470372676849365,
        -0.035762887448072433,
        0.02032986283302307,
        0.04406705126166344,
        0.04582205042243004,
        0.055775295943021774,
        0.06571783125400543,
        -0.011811408214271069,
        -0.06630947440862656,
        0.0001721259468467906,
        -0.03788840398192406,
        0.0044373818673193455,
        0.029152365401387215,
        -0.01293500792235136,
        -0.11269132047891617,
        -0.058743733912706375,
        0.024644451215863228,
        0.0009447920601814985,
        0.018023869022727013,
        -0.03721756488084793,
        -0.05845293775200844,
        0.005513307172805071,
        -0.058516260236501694,
        -0.03722160682082176,
        -0.06078339368104935,
        -0.04722677543759346,
        -0.024986743927001953,
        0.06886440515518188,
        0.025460198521614075,
        0.07592648267745972,
        -0.05256357416510582,
        -0.05326148122549057,
        -0.05652880296111107,
        0.005375461187213659,
        -0.052611492574214935,
        0.1451403945684433,
        -0.003335758810862899,
        0.022427944466471672,
        0.002222286770120263,
        -0.007626239210367203,
        0.01381588727235794,
        0.05784870311617851,
        -0.04238126054406166,
        0.05691840127110481,
        -0.008280033245682716,
        -0.0828808918595314,
        0.008254887536168098,
        0.0911872535943985,
        -0.040787141770124435,
        -0.039922311902046204,
        -0.021094536408782005,
        0.04518194496631622,
        0.05414705350995064,
        0.08903784304857254,
        0.06277154386043549,
        0.12053264677524567,
        -0.03544037416577339,
        -0.035131387412548065,
        0.019612297415733337,
        0.006930739153176546,
        0.10156553983688354,
        0.056694354861974716,
        0.08416098356246948,
        -0.05227430909872055,
        -6.070004587854783e-08,
        0.08806800097227097,
        0.024283546954393387,
        -0.027546893805265427,
        0.006924275774508715,
        0.06379732489585876,
        -0.05790407210588455,
        -0.02442402020096779,
        0.0053883991204202175,
        0.036427490413188934,
        -0.066520094871521,
        0.06405071914196014,
        0.01420442946255207,
        0.018525296822190285,
        0.13099223375320435,
        0.06819522380828857,
        0.025343187153339386,
        -0.06954465061426163,
        0.08920963108539581,
        -0.033163025975227356,
        -0.027307646349072456,
        -0.050444480031728745,
        0.03649201989173889,
        -0.001566515420563519,
        -0.050058431923389435,
        0.06185367703437805,
        -0.009862220846116543,
        0.02148398570716381,
        -0.008871137164533138,
        0.011796614155173302,
        0.039081405848264694,
        -0.02639174833893776,
        -0.0069739059545099735,
        0.001528601162135601,
        -0.003984867129474878,
        -0.06591431796550751,
        -0.029160479083657265,
        -0.030403755605220795,
        -0.024246055632829666,
        0.016392260789871216,
        -0.019132403656840324,
        -0.0026579962577670813,
        -0.12177733331918716,
        -0.0708760917186737,
        0.011291609145700932,
        -0.040229421108961105,
        -0.06698668748140335,
        0.004477737005800009,
        -0.03248484805226326,
        -0.07105494290590286,
        -0.034551672637462616,
        -0.06229989230632782,
        0.02985125035047531,
        0.012051297351717949,
        -0.04687805473804474,
        0.036224838346242905,
        -0.007044619414955378,
        0.06687077134847641,
        0.053336694836616516,
        -0.041650667786598206,
        -0.018199622631072998,
        0.06921070069074631,
        -0.009021558798849583,
        -0.07373801618814468,
        0.039324745535850525
    ]
}