{
    "id": "JDAK6ilKgIc",
    "title": "Windows 10 Installation Sensation on a Custom PC - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-12-13T21:00:29Z",
    "video_url": "https://www.youtube.com/watch?v=JDAK6ilKgIc",
    "category": "Science & Technology",
    "tags": [
        "Windows 10 Installation Sensation on a Custom PC - Krazy Ken's Tech Misadventures",
        "Windows 10 Installation Sensation on a Custom PC",
        "Windows 10",
        "Microsoft",
        "Custom PC",
        "Gigabyte Motherboard",
        "AMD",
        "Radeon",
        "Video Card",
        "Corsair",
        "Software Installation",
        "Computer",
        "Krazy Ken's Tech Misadventures",
        "KKTM",
        "Krazy Ken",
        "Tech",
        "Humor",
        "PC",
        "Funny",
        "Comedy",
        "Ryzen",
        "AMD Ryzen",
        "GPU",
        "CPU"
    ],
    "views": 26605,
    "likes": 662,
    "comments_count": 137,
    "description": "Krazy Ken joins United Wave in a Windows 10 installation sensation! United Wave has a custom PC that he purchased for a friend (super-generous) but without an operating system, it's just a box that lights up. Join them on their epic questthey'll also show off the hardware itself.  Support the show and get in the credits   Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #79 - Windows 10 Installation Sensation on a Custom PC  Krazy Ken is now on Patreon! Pledge now to help support the show and get an opportunity to be in the show's credits!   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  COMPUTER CLAN COLLABORATORS INVOLVED IN THIS VIDEO Ken (Hildron101010) United Wave  #KrazyKen",
    "description_links": [
        "http://patreon.com/krazyken",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://patreon.com/krazyken",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] Actually, we should. Oh wait, we don't have ethernet, (beep) that. If anyone wants to turn this stuff back on later. - [United Wave] Don't worry, I'm really good at turning things on. - [Krazy Ken] (laughs) That makes one of us. (laughing) (upbeat electronic music) - Hey guys, how y'all doing? Really, that's just great. You know, I'm doing pretty great today too because for some reason I have this custom built PC in my lair. And the only problem is, well actually United Wave here is joining me and he can explain what we need to do with it. And he can tell you a little bit about it. - [United Wave] So this is a custom built PC. It's an 800 dollar build, it is complete with the Ryzen 5 3.4 6-core processor. It has a Gigabyte B450 motherboard, it contains 16 gigabytes of Vulcan RAM, it has a two terabyte hard drive, and a quarter terabyte solid state drive, in this nice red and black Corsair case. - [Krazy Ken] I dig it, I think it looks pretty, but what's the problem right now? What can we not do with it? - [United Wave] It doesn't have Windows. - [Krazy Ken] Ah, but it has one right here. I'm sorry, alright, oh he's already walking out. Alright, so to install Windows, first we need an installer. So we have the education edition of Windows, which United Wave has a product key for. And we're just gonna use Rufus here to image it to a flash drive, so hopefully we can just click this button and everything will be hunky-dory. And Rufus is complete. So we are gonna close that and take it out. I mean take the flash drive out. So, that should work. Safe to remove. Yes, it is indeed safe. And we're gonna plug this into the PC. Oh my gosh! Did you-- - [United Wave] I fact-checked it, it is real. - [Krazy Ken] What! Okay, hang on. We were, United Wave, was doing something on the side. What's the name of that band? - [United Wave] The name of the band X-A-V-L-E-G-B-M-A O-F-F-F-A-S-S-S-S-I-T-I-M-I-W-O- A-M-N-D-U-T-R-O-A-B-C-W-A-P-W- A-E-I-I-P-P-O-H-F-F-F-X (laughing) - [Krazy Ken] That sounds like some really weird programming language or something. - [United Wave] Let's listen to them on YouTube. - [Krazy Ken] That's a real name of a band. How do you pronounce that!? Oh my gosh, the things you do. Alright, let's switch to the PC. I mean, the other PC. Alright, so we have the flash drive here, we're ready to go, just gonna plug it in to the HDMI port I guess, there we go. The power button is on the side here and I'm guessing F12, F12 is usually the boot menu thing, so I'm gonna guess it's F12 or F8, I really don't know. Actually United Wave, we're gonna make this a team effort thing. You're gonna hit the power button and I'm gonna take over the keyboard, sound good? - [United Wave] Okay. - [Krazy Ken] Alright, we'll do a little switcheroo. Alright, monitor's on standby, got the keyboard, our beautiful Belkin mouse, and United Wave go ahead and hit that thing. (smacks) And warranty voided. (laughing) Okay, hope I pressed the right button because sometimes you need to press the function key with the actual function keys on this thing. F11 for boot menu, shit! I just saw it. Wait, reboot and select proper boot device. Okay, I rebooted it, it's F11 apparently. - [United Wave] Well we're gonna see if I set up the reset button correctly. - [Krazy Ken] Oh okay. - [United Wave] If I can press it. (slight laughing) Oh, that was the headphone jack. (laughs loudly) Thought I pressed the reset button! - [Krazy Ken] Hey! Think you got it. Just gonna spam the F11. Monitor going to sleep. Lazy ass monitor. There we go, should just be able to do this. I like how the boot menu actually looks pretty and it's got even a mouse input, that's kinda cool. And as you can see, we're doing this on Black Friday. So I think your PC is a little bit cheaper today now. - [United Wave] Yeah actually the build right now is for just under 700 dollars, compared to when I paid for it two weeks ago for 800 dollars. - [Krazy Ken] (laughs) Oh well, how times change in, what, two weeks. - [United Wave] Yeah. Well I bought everything when Bitcoin fell because it dropped the prices of graphics cards - Oh, video cards and video cards, and it made everything fall with it. - [Krazy Ken] Sweet, alright so we're on the gu-ee, so that's a good start. I'm guessing you want English, it's your only option. Oh, but we got some other things here too. Let's give you, oh gosh, I can't even pronounce that keyboard input, but we'll just keep it at us. Alright we'll go next and oops, I just slid the mouse into your PC, I'm sorry. And install now. It should be pretty straight-forward. And while it's installing we'll actually take a little tour of the hardware cause there's some cool things in here. Oh, product key. Actually, do you have that for me? You guys can't watch this, close your eyes. And, everything sets on fire. So United Wave you're gonna have to come over here and read all of this. (laughing) - [United Wave] Hold on. Perfect! - [Krazy Ken] (laughs) Yes, cut, print, kill the pig cause there's nothing on this SSD, right? - [United Wave] Correct. - [Krazy Ken] So we have two drives in here - [United Wave] Install to the SSD - [Krazy Ken] Which I'm guessing is the five, twelve, four, seven, six. Cool, yeah that looks gucci. Wow, it's been a while since I've seen this screen. But yeah, so while this is going United Wave, you can pop the window off this thing right while it's running or not? - Yeah. - [United Wave] So here's just an inside look without the case on of the inside of the computer. You can see everything running, ignore the terrible-ass cable management. I'm still waiting on some fans before I do all my cable management in the back and in the PC. This will all get run behind eventually. But I mean, I have the power supply, I put the fan in upside down for the time-being, graphics card, the new Ryzen CPU which comes with it's own cooling fan and it's pre-thermal paste so you don't even have to worry about dealing with that yourself. It's all a pretty easy build, did it in less than an hour. Like I said 700 bucks right now, 800 normally. This is actually a gift build for a friend of mine. - [Krazy Ken] That's generous. - [United Wave] They wanted a gaming tower, they like red and black, so I - Edgy found what they wanted and just went with it. - [Krazy Ken] So the, correct me if I'm wrong, but the two and a half inch SSD is actually on the backside of the board, right? - [United Wave] Yeah so the solid state drive is actually located right here. There is two mounting ports for solid state drives. There is one back here and there is one right above it. So I'm using the lower section, that's where I'm mounting the SSD. And then there's a four-slot hard drive bay right here and this is where you see the two terabyte currently being placed. - [Krazy Ken] So there's four bays, you got two terabytes in there now, cool. - Yeah Sweet! - [United Wave] Sadly this case only came with one fan but the plus side is the fan is LEDed red. - [Krazy Ken] Alright, well that was a really fast installation. That was like, seven minutes maybe. So, Virgin Islands, right? No. United States, yes. It was the one already highlighted. - [United Wave] Actually it's United Wave. (laughs) - [Krazy Ken] Is the keyboard layout right? Yes it is, good sir. Dude I have not even seen this set-up screen before. I really don't use Windows too much. This is actually really pretty looking. Let's skip that. (groans indecisively) Skip the ethernet for now? - [United Wave] I don't have an ethernet cable, I didn't think about that. Do we own one? - [Krazy Ken] This is just like the issue I had in that past episode. Even if we did, we'd have to run it all the way to our router. - [Krazy Ken] Okay looks like everything is hooked up to this bay station here. Let's just get the USB out of the way, there we go. Now the ethernet, give it a little jiggle, it's a little stuck. Is it time for tacos? No, wait it's not time for tacos. Come on, focus, focus! And got it! (alarm ringing) Oh shit, oh shit, oh boy! Oh they're after me, oh shit! That was a fun time. - [United Wave] Oh shit, maybe I won't be installing shit this time. - [Krazy Ken] Do we have a wifi card for this? - [United Wave] I do at campus. - [Krazy Ken] Oh, so like 50,000 miles away. Okay, we're gonna skip that for now. There's actually other ways we can maybe make that work. Okay so who's gonna use this PC? Create a super memorable password. We should just use a default one and then they can change it cause we didn't do an OEM configuration. - [United Wave] Just do the password I do for all my friends when we play online games. It is two. - Two Two. - Two. Two. - Two. Two. - Two. (laughs) No, that's it. (laughing loudly) - [Krazy Ken] I wanna click the eyeball to make sure we spelled it right, okay. - [United Wave] I have a bad habit that my friends forget. It is 2, 4 times. - [Krazy Ken] 2, 4 times. Create a security question for this account. Really? What? - [United Wave] I also just put those as two. - [Krazy Ken] This is, I'm totally foreign to this. I have not seen, that is usually for online stuff. Why are they doing it for a local account? Cause this isn't like a OneDrive, or a Microsoft account. So you're just gonna do two? - Yeah. You can probably change this shit later. (laughs) What's your first pet's name? Two. What was your childhood nickname? Two. And for the final question, for one million dollars, there's nothing very exciting. Where did your parents meet? Two (laughing). - [United Wave] How many parents do you have? - [Krazy Ken] Wait! Cortana is on this thing! I thought you said that-- - [United Wave] It said educational did not contain Cortana. - [Krazy Ken] I wonder if that's an old-- - [United Wave] Form I found? - [Krazy Ken] Maybe, let's just turn her off for now. If you wanna turn that on later you can. Okay so, privacy settings, speech recognition, find my device, inking and typing, location, I mean honestly - Off, off, off, off I'm gonna turn it all off if anyone wants to turn this stuff back on later, whatever. - [United Wave] Don't worry, I'm really good at turning things on. - [Krazy Ken] (laughs) That makes one of us. (laughing) It's lonely in the lair. Okay so don't turn off your PC. So whatever you do, don't press the button. - [United Wave] Oh so this is where I put the reset button. (laughs) - [Krazy Ken] Promptly goes and presses reset button. I'm actually curious what would happen. It would probably, once it reboots, bring us back to the beginning of the set-up or whatever. We're at the Windows desktop and I'm not sure what form you were looking at earlier, where it said it doesn't have Cortana or Edge, but both of them are clearly here. - Okay - Whatever. Let's find the way to name this PC cause I do not remember. Control + I maybe? Oh, Windows key + I sorry. Let's see, name. View your PC name. Rename this PC, cause right now it is Desktop R-B-14-juhb. What would you like to name your PC, good sir? - [United Wave] Butthole two. - [Krazy Ken] Okay, what's the backstory on that one? - [United Wave] When I had my PC custom built with some friends two years ago, my friend named it Butthole without me having any knowledge of this. And my friend currently makes fun of me for having it named Butthole, so to be fair it is now Butthole two (laughs). - [Krazy Ken] Yeah. - [United Wave] She is not gonna be happy. - [Krazy Ken] I used to name my computers after anime characters but I thought that would be confusing if I ever came up on a-- - [United Wave] Oh, like Cory in the House? (laughing loudly) - [Krazy Ken] If I ever came up on a network and people would be like, who is this? Now it's just Ken's MacBook Pro. That rebooted really fast. This is really speedy. - [United Wave] A lot you can do with 700 dollars. - [Krazy Ken] This is slick. - [United Wave] A nice PC or a very good day at a strip club (laughs loudly) - [Krazy Ken] Okay well now you can, I know you can't install anything right now cause we've gotta hook up ethernet, which I have some tricks to make that work. I don't know if we'll be able to really do that because of what happened in the last episode I tried that. But you can at least customize some shit. Does she like start screen stuff? Could we like - Yeah, I'll-- You'll fiddle with all that? - Yeah Alright, well. Hey Windows is on here, looks like it's working. - [United Wave] That was a lot less painful than I thought. - [Krazy Ken] Yeah Windows has become a lot easier to install (laughs) over the years. - [United Wave] Wonderful. - [Krazy Ken] It's not like you have to install MS-DOS or any of that shit. It looks like there's some screen tearing you might need to throw some drivers on here. Actually, we should, oh wait, we don't have ethernet. (bleep) that. - [United Wave] How bad's the tearing? - [Krazy Ken] Here, so like you see that? - Oh yeah. Yeah. - [ United Wave] Is it the monitor, or? - [ Krazy Ken] No, well actually, naw I don't think it'd be the monitor because v-sync is usually controlled by the video card. But yeah we'll probably have to fix that up. - [United Wave] It was just built yesterday, so for all I know it could be out-of-date drivers or what-not, so. - [Krazy Ken] There's probably no drivers on here at all, because we jus-- - [United Wave] I'll throw on drivers and check the Windows update and have that through. - [Krazy Ken] Once we get it on the internet. Alright, stand-by. Alright so we're back to try and get the PC up and running with temporary internet connection and some drivers. However, when we booted it back up, we had the HDMI plugged in and every time we try to switch into a different video interface it won't work and HDMI is only working in low resolution. So I'm guessing we do need some kind of driver on here. So we don't have access to a router down here but I do have a Mac Mini set-up with internet sharing and hopefully that can act as our quasi-router. So United Wave if you could be so kind to plug in the CAT6 cable. So the Mac Mini is taking the wifi from an airport bay station and sharing the internet, I don't know, signal, magical beams, whatever the hell they are, over CAT6 onto the PC. So, do you wanna allow it to be discoverable? We'll say no. Setting up device. Wait, USB input device. What the frick? We already had USB plugged in. What's it doing? Oh, Apple keyboard and a mouse, okay. And it looks like we have network connected so that's a good sign. Let's do, let's just go to a random webpage. United Wave what's a good website? - [United Wave] The Computer Clan dot com. - [Krazy Ken] Oh, shameless plug. That was not staged by the way, ladies and gentlemen. That was just very, very well put-together. Look at that, it works. So we got this thing online in one step, perfect. And yeah obviously it's in very low resolution so-- - [United Wave] Wait, you asked for a good site. - [Krazy Ken] Oh, oh, my feelings are so hurt right now. They actually are, I'm gonna need to go cry after this. So, card, do you have the box or the model number of your video card? - [United Wave] It's Gigabyte 580, I think off the top of my head. - [Krazy Ken] Wanna maybe double-check that. Okay for some reason the resolution now adjusted itself so I can actually see what we're doing. This is the disc that came with the product, but there's no optical drive on this tower so we can't actually install it. However this disc has the same name, I think it's AOROUS, as that link we were looking at. So I'm guessing that utility comes with drivers and all that good shit. So let's download that, right here. Download in America, guess that's where we are, it was released this year so that should be fine, Windows 10 64-bit, yeah this video card artwork looks like Kamui Senketsu. I do like Microsoft Edge, it's a little pretty. But you're probably gonna install Chrome on here, I'd imagine. (laughs) Edge, also known as Google Chrome installer. Okay so let's run this thing here. - [United Wave] Microsoft never really got out of their emo phase did they? - [Krazy Ken] Microsoft didn't get out of their emo phase? - Yeah What do you mean? - [United Wave] They're still trying to be edgy. - [Krazy Ken] Oh Edge, edgy. (laughs) - [United Wave] What played that sound effect? - [Krazy Ken] That was the user account control. - [United Wave] But was that the monitor? - [Krazy Ken] Oh, that's a good point, let's find that out. - [United Kingdom] Cause it shouldn't have speakers. - [Krazy Ken] We have, oh yeah it's coming through the monitor. It's like, you just, - I was like hold on a second! - The driver installed a physical speaker in the tower. (laughs) - [United Wave] That's like I just downloaded this new app off the app store, it gave about 100 more gigabytes of storage. - [Krazy Ken] Yeah, it's funny because in another Krazy Ken episode I have a Mac that has a program installed called a RAM doubler. So I don't know if it virtualizes your memory different but that's like, back when download more RAM dot com was actually functional. Alright we're extracting some DLLs right now, that's exciting. Oh yeah! Look at that, now we're elite hacking in a sci-fi film. But at least we see the nice frosted glass of the fluent design that's pretty. I'm so happy about that, okay. Let's read all the end user license agreement. Accept! Please hold while I try to connect you. Play a flute solo (sad trumpet sounds) Your graphic card's-- - [United Wave] That was a trumpet. - [Krazy Ken] I know, I don't know why I went to a trumpet when I said flute, I don't know why I went there. Right when I did that I felt stupid. So let's see what's under the custom install. AMD display driver, that's the main thing I'd say we want, the problem report wizard, HDMI audio driver. Here it goes, your graphics card is almost ready. Okay so what is Re-Live? I'm guessing that's maybe a recording thing or something. I've never heard of that, have you? - Nope. Alright! We're gonna skip it for now, you can always get it later, right is that cool? - Yeah. Alright we'll do that. Has not been installed? General error has occurred. Okay well that's great. What the (beep)? General error. I hate it when it's a general error. (laughs) What does that mean? Alright we're going to try something different here. Maybe it gave us that error cause we skipped that whole re-live thing? I have no idea. Okay so we rebooted. Let's see... Oh yeah look at that. That is way nicer. There is no tearing on that. There's a little bit of ghosting but I think that's from the monitor. That's not from the card, yeah that's way nicer. It's smooth. I think you're good to go. If there's any issues just light up the Krazy Ken signal. I can only see it during night time though. And if it's cloudy. I'll give you these drivers. Actually I should probably pack it up first. - [United Wave] Yeah that'd be nice. - [Krazy Ken] You take that one. Okay, pack this one up next. You got a sticker in here. Do you want the sticker? - No - Okay. - [United Wave] It's not my computer! - [Krazy Ken] That's right, you got it as a generous gift. All packed up, there you go. Okay that's it. Do you wanna do the honors and shut-er-down - Sure or should I just do it? Alright, I'm gonna walk outta the way here. (laughing) - [United Wave] Oh, I don't know what I did. There's a Radeon overlay apparently. - [Krazy Ken] Wait did you trigger that? - [United Wave] Yeah apparently ALT + R. Meant to do this, I do eenie meenie miney mo catch a tiger by the toe (laughs). (thudding) - [United Wave] So we got the computer all set up right here new mouse, keyboard, mouse pad, to go with it. Blue Snowball microphone, display monitor, we got the computer tucked away here in the corner since we're in a dorm room. We need access to the side power buttons, little bit annoying anything that's plugged in does get blocked by this drawer trying to open, so gotta have something in or the drawer open. Nice glowing red. We got 3 red LED fans. There's two on top and there's one in the back here. It's running great once we figured out the drivers and how to get the display, however it does once in a while BSOD giving an error about something trying to write to a read only location. Haven't been able to figure that one out yet but otherwise it's running pretty well. So hopefully it keeps kicking and we can figure out that error soon. - [Krazy Ken] That's it, I'm calling this a win. Thanks for sticking with us. Catch the crazy, pass it on. (upbeat electronic music)",
    "transcript_keywords": [
        "United Wave",
        "Yeah",
        "alright",
        "United",
        "Wave",
        "Windows",
        "good",
        "thing",
        "button",
        "shit",
        "card",
        "install",
        "pretty",
        "back",
        "drivers",
        "drive",
        "monitor",
        "wait",
        "things",
        "Alright Hey Windows"
    ],
    "transcript_entity_values": [
        "one million dollars",
        "YouTube",
        "50,000 miles",
        "two",
        "F12",
        "SSD",
        "3",
        "United Wave",
        "six",
        "2",
        "two weeks",
        "Black Friday",
        "Rufus",
        "jack",
        "four",
        "one",
        "Windows",
        "800 dollar",
        "MacBook Pro",
        "Chrome",
        "United Kingdom",
        "Two",
        "Krazy Ken] Wait",
        "a very good day",
        "Cory",
        "two terabytes",
        "United States",
        "Krazy Ken]",
        "800 dollars",
        "Edge",
        "Apple",
        "Krazy Ken] 2",
        "CAT6",
        "Mac",
        "Krazy Ken] Maybe",
        "Virgin Islands",
        "16 gigabytes",
        "first",
        "4",
        "about 100 more gigabytes",
        "two and a half inch",
        "Microsoft Edge",
        "Microsoft",
        "the Mac Mini",
        "64",
        "House",
        "a quarter terabyte",
        "F11",
        "700 bucks",
        "USB",
        "Ken",
        "two years ago",
        "two terabyte",
        "F8",
        "United Wave]",
        "Radeon",
        "seven minutes",
        "700 dollars",
        "3.4",
        "Google Chrome",
        "today",
        "Krazy Ken",
        "seven",
        "AMD",
        "Windows",
        "less than an hour",
        "two weeks ago",
        "Ryzen CPU",
        "Butthole",
        "LEDed",
        "Vulcan RAM",
        "Bitcoin",
        "800",
        "Krazy Ken] Wanna",
        "Krazy Ken] Sweet",
        "the years",
        "Gigabyte 580",
        "Kamui Senketsu",
        "6",
        "Belkin",
        "just under 700 dollars",
        "English",
        "OneDrive",
        "this year",
        "America",
        "Krazy Ken",
        "RAM",
        "Gigabyte",
        "yesterday",
        "Cortana",
        "second",
        "Corsair",
        "night",
        "HDMI"
    ],
    "transcript_entity_types": [
        "MONEY",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "EVENT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "QUANTITY",
        "GPE",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "LANGUAGE",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG"
    ],
    "vector": [
        -0.08845864236354828,
        -0.01595638319849968,
        0.018033446744084358,
        -0.1292790323495865,
        0.039156097918748856,
        0.06289404630661011,
        0.04158572480082512,
        -0.044938307255506516,
        -0.07306937128305435,
        -0.04064815491437912,
        0.0403541624546051,
        0.01605878211557865,
        -0.02793719246983528,
        0.023113830015063286,
        0.0006553502171300352,
        0.01005674060434103,
        0.1043458878993988,
        -0.060327790677547455,
        -0.10376103967428207,
        -0.014329205267131329,
        -0.02770322747528553,
        -0.14582565426826477,
        -0.016878122463822365,
        -0.025096407160162926,
        0.04164435714483261,
        0.01129993051290512,
        0.01811313070356846,
        0.010990024544298649,
        -0.011305952444672585,
        0.020177559927105904,
        0.015208871103823185,
        -0.006012899335473776,
        0.03215958550572395,
        0.017344500869512558,
        0.03533055633306503,
        -0.0694715827703476,
        -0.005335346329957247,
        -0.008973735384643078,
        -0.10563457012176514,
        -0.05161832273006439,
        -0.022885320708155632,
        0.018210865557193756,
        -0.0004096397606190294,
        0.04807509481906891,
        0.041886623948812485,
        -0.025760162621736526,
        0.044104818254709244,
        -0.09304778277873993,
        0.0002608192735351622,
        -0.028795046731829643,
        -0.0190591998398304,
        -0.01384708285331726,
        0.0758993998169899,
        -0.02126779407262802,
        -0.059642016887664795,
        -0.020198384299874306,
        0.03217986598610878,
        0.01834050379693508,
        0.06051648035645485,
        -0.09507458657026291,
        0.02921162359416485,
        -0.11451441049575806,
        -0.02901984564960003,
        0.030476709827780724,
        0.01215360127389431,
        -0.0013986071571707726,
        0.011832171119749546,
        0.029958315193653107,
        0.04238549992442131,
        -0.15293967723846436,
        -0.0514972098171711,
        -0.015395394526422024,
        -0.00324261374771595,
        0.04652383178472519,
        -0.03550462797284126,
        -0.0037104529328644276,
        0.015180819667875767,
        -0.05078756436705589,
        -0.008097480982542038,
        -0.056718118488788605,
        0.0646633431315422,
        0.031747087836265564,
        -0.02656603790819645,
        -0.0781886875629425,
        0.03300400823354721,
        0.04389709606766701,
        -0.04766745865345001,
        -0.04044312238693237,
        -0.0398562066257,
        -0.018014004454016685,
        -0.08505051583051682,
        0.022521888837218285,
        0.09473336488008499,
        -0.04379399120807648,
        0.04934418573975563,
        0.018640650436282158,
        0.05093860998749733,
        -0.04133882001042366,
        -0.05505664274096489,
        0.04419994354248047,
        0.015157999470829964,
        0.02242765948176384,
        0.0681520327925682,
        -0.07267940789461136,
        -0.033544037491083145,
        -0.08445430546998978,
        -0.018228638917207718,
        0.12519630789756775,
        0.04685774818062782,
        -0.027552416548132896,
        -0.02806605026125908,
        0.030271582305431366,
        -0.07422158867120743,
        -0.04595005139708519,
        0.07059397548437119,
        -0.009540592320263386,
        -0.08059244602918625,
        0.04289601370692253,
        0.03307544067502022,
        -0.06104729697108269,
        0.030625533312559128,
        -0.08996368199586868,
        -0.004133130423724651,
        -0.0007520018261857331,
        0.06318515539169312,
        0.025335494428873062,
        -0.033574189990758896,
        5.685393773135168e-33,
        0.05627979710698128,
        0.06115375831723213,
        -0.032736536115407944,
        -0.013417202979326248,
        0.00032134598586708307,
        -0.03667183220386505,
        -0.026308611035346985,
        0.052277158945798874,
        -0.06902946531772614,
        -0.030691418796777725,
        -0.008876687847077847,
        0.02167518623173237,
        -0.038996171206235886,
        0.0036767206620424986,
        0.0026603061705827713,
        -0.03169727697968483,
        -0.0789990946650505,
        -0.008311108686029911,
        -0.04536367207765579,
        0.027975060045719147,
        0.05164586752653122,
        0.06543482840061188,
        0.02100546658039093,
        -0.021054206416010857,
        -0.04004502296447754,
        -0.06977978348731995,
        -0.09380180388689041,
        0.043909702450037,
        0.11643655598163605,
        0.030013086274266243,
        -0.10701654851436615,
        0.011413248255848885,
        0.03793258219957352,
        -0.012688593938946724,
        -0.018502630293369293,
        -0.016150817275047302,
        -0.02160477824509144,
        -0.06879997998476028,
        0.09046463668346405,
        -0.0028056504670530558,
        -0.01117108017206192,
        -0.022003723308444023,
        -0.028205309063196182,
        -0.019304834306240082,
        0.03364090248942375,
        -0.010863480158150196,
        0.1172230988740921,
        0.06643355637788773,
        0.04681362211704254,
        0.04268811643123627,
        -0.04167353734374046,
        0.03685450553894043,
        0.041772156953811646,
        0.041265178471803665,
        -0.04893204942345619,
        -0.012421701103448868,
        0.08545295149087906,
        -0.02618817612528801,
        0.09210291504859924,
        0.037058938294649124,
        0.05524895712733269,
        0.03244626149535179,
        0.029090583324432373,
        0.025140181183815002,
        -0.04913312941789627,
        -0.07838743925094604,
        0.1195063516497612,
        0.07038243860006332,
        -0.02281869761645794,
        0.059520866721868515,
        -0.051784880459308624,
        -0.035005535930395126,
        -0.009494643658399582,
        -0.07906834036111832,
        0.09677531570196152,
        -0.002169692190364003,
        -0.0857020691037178,
        0.03998028114438057,
        -0.057615868747234344,
        0.05473963916301727,
        -0.04415286332368851,
        -0.010560971684753895,
        -0.021522287279367447,
        0.062062546610832214,
        0.004253904800862074,
        0.04757661372423172,
        -0.03454263135790825,
        -0.05070648342370987,
        -0.009288647212088108,
        0.01019649114459753,
        0.01811104267835617,
        -0.041554808616638184,
        0.03203074261546135,
        0.08871518820524216,
        0.033237483352422714,
        -5.552567319596065e-33,
        0.03929523751139641,
        -0.04801210016012192,
        -0.04066420719027519,
        -0.050684984773397446,
        0.0644843801856041,
        0.021517163142561913,
        0.022191885858774185,
        -0.03839321434497833,
        -0.0007937648915685713,
        -0.04183383285999298,
        0.09792312234640121,
        -0.02945658750832081,
        -0.06862328946590424,
        0.021877069026231766,
        -0.035375215113162994,
        0.004966542590409517,
        0.0032376511953771114,
        0.04319480434060097,
        0.0582285150885582,
        0.020751822739839554,
        0.10719230026006699,
        -0.015363045036792755,
        -0.05290668085217476,
        -0.053572580218315125,
        -0.003243064973503351,
        -0.003096808446571231,
        0.03732290863990784,
        0.03271790221333504,
        0.06751697510480881,
        0.05383379012346268,
        0.018365910276770592,
        0.037534866482019424,
        -0.0889730453491211,
        -0.007613050751388073,
        0.036311075091362,
        0.05818575620651245,
        0.05844515189528465,
        -0.04371090605854988,
        -0.09348320960998535,
        -0.05754561722278595,
        0.031847622245550156,
        0.04601657763123512,
        -0.09190338104963303,
        0.03786729648709297,
        -0.0010040209162980318,
        0.02126682922244072,
        -0.05903422459959984,
        -0.039469365030527115,
        -0.04197771102190018,
        -0.011682718992233276,
        0.040938086807727814,
        0.027689561247825623,
        0.04532594978809357,
        0.018582938238978386,
        -0.07250627875328064,
        -0.013456666842103004,
        0.02385925129055977,
        0.13843773305416107,
        0.016627246513962746,
        0.01924906298518181,
        -0.046882323920726776,
        -0.029800739139318466,
        0.0007316734408959746,
        -0.09326779842376709,
        -0.0039055130910128355,
        0.04899092763662338,
        0.09526175260543823,
        0.09899170696735382,
        -0.027648044750094414,
        -0.022430570796132088,
        -0.080515556037426,
        -0.05795195326209068,
        0.05563226714730263,
        -0.1231459528207779,
        0.003661572467535734,
        0.028900453820824623,
        -0.0008158390410244465,
        -0.035310741513967514,
        0.008674395270645618,
        -0.03445540368556976,
        -0.012259230017662048,
        -0.051527850329875946,
        0.05749782547354698,
        0.02696753852069378,
        0.02279345691204071,
        0.01618940941989422,
        0.002315347082912922,
        0.005577255040407181,
        -0.053649649024009705,
        0.03453719615936279,
        -0.010268072597682476,
        0.005756126716732979,
        -0.008027334697544575,
        0.0962175577878952,
        0.04515587165951729,
        -5.6751606081206774e-08,
        -0.018601395189762115,
        0.019930612295866013,
        -0.017117012292146683,
        -0.01224576123058796,
        0.040279362350702286,
        -0.02452716790139675,
        0.0029753779526799917,
        0.030582064762711525,
        -0.0302597563713789,
        -0.05042476952075958,
        0.07219352573156357,
        -0.09441956877708435,
        -0.05161774903535843,
        -0.014755030162632465,
        0.06473155319690704,
        -0.009288386441767216,
        -0.11118925362825394,
        0.13734079897403717,
        -0.020775657147169113,
        -0.02913576178252697,
        -0.009260131977498531,
        0.012189703062176704,
        0.11747471988201141,
        -0.024861998856067657,
        -0.011568388901650906,
        0.07264541834592819,
        0.058229830116033554,
        0.021473929286003113,
        0.06014468893408775,
        -0.008190644904971123,
        -0.02077404409646988,
        -0.049997780472040176,
        -0.0575602687895298,
        0.008542553521692753,
        0.07664396613836288,
        -0.06918959319591522,
        -0.05030608922243118,
        0.07378717511892319,
        0.1162482425570488,
        -0.017760859802365303,
        -0.028079412877559662,
        -0.07082535326480865,
        -0.021361202001571655,
        0.03272591158747673,
        0.04837030917406082,
        0.025372423231601715,
        -0.09243851900100708,
        -0.03130144253373146,
        0.02644547075033188,
        -0.027177732437849045,
        -0.016803134232759476,
        -0.004649539012461901,
        -0.05326461419463158,
        0.053229156881570816,
        0.03885456174612045,
        -0.00588550278916955,
        0.017452407628297806,
        -0.010611316189169884,
        0.023878715932369232,
        0.0770261287689209,
        0.05843961238861084,
        0.006699569523334503,
        -0.03293980658054352,
        0.03326203674077988
    ]
}