{
    "id": "jEXsZnW6Jso",
    "title": "Mikme Review: Much More Than A Mobile Microphone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-06-16T14:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=jEXsZnW6Jso",
    "category": "Science & Technology",
    "tags": [
        "mikme review",
        "mikme microphone",
        "mikme mic review",
        "mikme blackgold review",
        "mikme microphone review",
        "mrmobile",
        "michael fisher",
        "juan carlos bagnell",
        "somegadgetguy",
        "wireless microphone",
        "best wireless microphone"
    ],
    "views": 69294,
    "likes": 3089,
    "comments_count": 208,
    "description": "Physically, the Mikme microphone isnt all that different from the Zoom h2n, the portable recorder I normally use on the road. But inside, it packs a 1-inch gold-plated condenser microphone and a Bluetooth stack powerful enough to broadcast live audio to a connected iPhone many meters away. Mikme is the most sophisticated mobile microphone I've ever used  so much so that I had to bring in a special guest to help cover it! Join me for the MrMobile Mikme Review, featuring SomeGadgetGuy himself, Juan Carlos Bagnell!   [SUBSCRIBE TO MRMOBILE]     [FOLLOW JUAN CARLOS BAGNELL]       [ABOUT MRMOBILE'S MIKME REVIEW]  MrMobile's Mikme review was produced following three months with a Mikme review device provided by Mikme. The device was used with an iPhone X and received one software update during the review period.   [STATEMENT FROM MIKME ON ANDROID APP]  \"We are aware of the fact that Android is the bigger chunk of the market midterm but short term our [belief] is that more of early adopters of the initial targeted market of Mikme of musicians, podcasters, video makers and journalists are using iOS. So, this is why we initially launched with the iOS app ahead of Android. As we want to broaden our user base now, we started to work on the Android app and hope to release it soon. As the audio framework from Android is weaker than iOS this is not an easy task.\"   [PRODUCTS IN THIS VIDEO]  Mikme Wireless Recording Microphone [B&H]:   Zoom h2n Handy Recorder [Amazon]:    [MUSIC IN THIS VIDEO]  \"Fashionista\" by Olive Musique, available at Premium Beat:    Boosted by Cymatix, available at Premium Beat:   [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://somegadgetguy.com/",
        "https://www.youtube.com/user/JuanBagnell",
        "http://twitter.com/somegadgetguy",
        "http://mrmobile.tech/4pw",
        "http://mrmobile.tech/4px",
        "https://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "https://www.premiumbeat.com/royalty_free_music/songs/boosted",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- I'm Michael Fisher, and normally I don't come at you like this face to face in a walk and talk. Part of that is a stylistic choice, but really it's just harder to film live audio out here in the real world. What makes it a little bit easier is if you have a device like this. This is the most innovative little microphone I've ever used. And it's also one I can't use that often because of one big drawback. This is the Mr. Mobile review of Mikme. (upbeat music) Physically, the mike the microphone isn't all that different from the Zoom H2n, the portable recorder I normally use on the road. It's a black metal box, two by two by one and a half inches, with a tripod mount on the bottom, a micro USB port with some controls on the side, and a single record button up top. Inside is a one inch, gold plated condenser microphone. And since I'm not really an audio guy, I'm going to bring in a special guest to talk about that, in just a second. But first I want to talk about how I've been using it these past few months. The microphone is powered by a rechargeable battery, good for up to three and a half hours of recording if you just use it by itself. But it's also got a Bluetooth radio inside, and a companion app for iPhones running iOS 9 and later. That means if you want to record, say a podcast or an interview, you can use your phone as a remote control to start and stop recording and adjust gain on the fly. And if you want to record video you can do that right through the app with synchronized audio. What's cooler about this is that yeah, you're going to get some Bluetooth connection problems occasionally during recording. But the phone and Mikme synchronize later, and that corrects for those errors by taking the higher quality audio from the microphone's internal storage. The app has a few editing tools, including separate tracks for local audio and microphone audio, you can put effects on there and whatnot. But most often I just found myself using it in a very straightforward audio capacity. The special BlackBerry KEY2 Edition of the CrackBerry podcast was recorded entirely on the Mikme. And despite the fact that this cardioid microphone isn't really designed for surround sound recording with four people around a table, it did pretty well. - [Man] It did good for (mumbles) keyboard. (laughing) - [Man] That's a thing for a lot of people, I mean I myself included. - [Michael] By the way I was using it as a Bluetooth connected microphone in this mode, not a stand-alone. Then I started getting a low battery warning at about an hour and 15 minutes in. My only real problem with the thing arose when it came time to get the final audio off my phone. The sharing functionality is cumbersome, and if you decide to ditch one failed export attempt for another, well the project has to mixdown all over again before you can try it. That gets annoying. Especially if you don't have a great internet connection, as I often don't on the road. Also I couldn't find a way to shoot video in 4K using the app, I think it's limited to 1080P. And that app crashed a few times on my iPhone 10. Also if you do get an error message, well don't don't expect a lot of detail. Before we come to Mikme's biggest limitation I want to bring in some gadget guy to give us a look at the device from an audiophile's perspective. Please welcome SomeGadetGeu, Juan Carlos Bagnell. - Okay, we all good there? Yeah, looking set. Hey, Mr. Mobile. Thanks for bringing me on. This is a really interesting idea of a product which really wasn't on my radar. Now there's a lot we could talk about when it comes to studio quality sound. But the conversations we had before you sent this thing out to me, I would say your assessment was pretty spot on. Your ears are in the right place. Utilizing this one inch gold diaphragm means we are going to arrive at recordings which are more detailed, more nuanced, a bit more colorful, and a bit more vibrant than the portable recording solutions we often use out in the field. When it comes to a larger diaphragm as that relates to audio quality, the obvious metaphor we can point to would be cameras. Generally speaking, the larger the image sensor is on a camera, the higher quality the photo and video capture is going to be. Yet we rarely see this kind of studio capsule used out in the field. So why don't we take this higher quality capture unit out with us for location audio? The purpose of any microphone is to capture those tiny little nuances and vibrations in air. And studio grade kit is very susceptible to movement. Again capturing vibrations, vibrating the microphone. And you also have to balance out some of the compromises involved with a very sensitive piece of equipment, and how durable you can make that piece of kit. When we're dealing with condenser microphones out in the field, you're usually going to see some kind of handheld unit like this. Now this is a condenser microphone, but it doesn't employ the same kind of capsule that we see in the Mikme. (metal threads scraping) This smaller capsule helps balance out some of those compromises in handling noise, and you're able to mount it in a far more durable fashion than what we typically use for studio grade microphones. Let's quickly compare this against one of my studio mics, which is going to use a diaphragm very similar to what's in the Mikme. (metal threads scraping) This poor mic, I've dissected it so many times and I just drop that screw. All right, now we're cookin'. A little bit smaller, a little more durable, but a little less nuanced against quite a bit bigger, a lot more nuanced, but also a lot more fragile. It's a really interesting step taking something which usually lives in a very safe environment, and trying to build an enclosure for it where we can take it outside the studio. Which brings me to one critical point when we're throwing around monikers, advertising studio grade quality. To arrive at studio grade quality, that's as much the quality of the capture of the microphone as it is the quality of your studio. Increasing that quality over what we usually use in a mobile solution, upgrading to this studio grade, large diaphragm capsule can be a double edged sword. For example recording here in my decently well acoustically treated office, I'm having to record these pieces around a very aggressively ambitious garbage truck down the block. (garbage truck beeping in reverse) To compensate for that other major concern, handling noise, because of how much more sensitive this type of capsule is to vibration, Mikme is borrowing some very good ideas from other top tier microphone manufacturers. Mr. Mobile, if I may be so bold, I believe one of the microphones you use to record your narration is the AKG C414, which employees a very novel internal shock stabilization system to free that microphone of any distracting vibrations when in a studio environment. Mikme has taken that idea, injecting a whole ton of steroids into it to act as a stabilization system for handholding that kind of capsule. I'm such an AV nerd. Capturing audio is a beautiful technical art representing a wonderful balance of compromises. Achieving the best possible sound that we can while minimizing distracting elements from the gear that we're using in the environment that we're surrounded by. Always a game of balancing those pros and cons. But taking this back up to what I said earlier, Mikme's got some really interesting ideas on display here. - [Michael] Again that's Juan Carlos Bagnell. You can follow him at SomeGadgetGuy. I'll drop the links in the description. Thanks a lot man. So with all the technical wizardry inside this clever little package, what's my beef? The price? No, audio gear is expensive. And $399 is a pretty fair price for all this functionality. No, the thing that's going to relegate my Mikme to dust gathering duty on a shelf is the fact that I don't use an iPhone. And the app, the thing that makes it more than just another portable microphone is iPhone only. The company's reasons for this are familiar ones. Android is harder to develop for because of fragmentation. So many phones supporting or not supporting so many different features, I get it. Still, Android makes up 86% of the global smartphone market. So the fact that no Android phones are supported at all, I mean it's just really frustrating. If you are an iPhone user looking for a way to record music, or podcasts, or interviews on the road, you should definitely give this one a gander. Just be sure to cross shop my old reliable, that Zoom H2n, especially if you're only using it for voice recording. It doesn't have the fancy app integration, but you do get incredible sound, great battery life, and versatile recording patterns for a lot less than the Mikme costs. What's your favorite on-the-go recorder? Is it your phone? A plug-in mic, micro-cassette recorder from 1991? Let us know in the comments. Also subscribe to theMrMobile on YouTube so you don't miss more tech reviews landing every week. Until next time. Thanks for watching, and stay mobile my friends.",
    "transcript_keywords": [
        "Michael Fisher",
        "microphone",
        "Mikme",
        "audio",
        "studio",
        "quality",
        "studio grade",
        "recording",
        "app",
        "lot",
        "studio grade quality",
        "Fisher",
        "Michael",
        "face",
        "Juan Carlos Bagnell",
        "Mobile",
        "record",
        "capsule",
        "face to face",
        "studio grade microphones"
    ],
    "transcript_entity_values": [
        "iOS 9",
        "BlackBerry KEY2 Edition",
        "AKG",
        "1991",
        "about an hour and 15 minutes",
        "Juan Carlos Bagnell",
        "1080P.",
        "AV",
        "every week",
        "Android",
        "YouTube",
        "four",
        "USB",
        "Mobile",
        "CrackBerry",
        "iPhone",
        "Michael",
        "two",
        "4",
        "a whole ton",
        "399",
        "second",
        "iPhones",
        "86%",
        "these past few months",
        "one inch",
        "up to three and a half hours",
        "Michael Fisher",
        "one",
        "Mikme",
        "C414"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.1066945269703865,
        -0.01896262727677822,
        0.08185947686433792,
        -0.060406751930713654,
        0.04214934632182121,
        -0.08546283841133118,
        0.031055353581905365,
        0.10215207934379578,
        -0.02831084467470646,
        -0.0393592044711113,
        0.002148181200027466,
        0.012017538771033287,
        0.031000245362520218,
        0.024447539821267128,
        0.019640905782580376,
        0.005395940970629454,
        0.07286643981933594,
        -0.05190674960613251,
        -0.025775641202926636,
        0.009120910428464413,
        -0.00922737643122673,
        0.05886188521981239,
        0.09999656677246094,
        0.05761872977018356,
        0.05473366752266884,
        -0.02199985273182392,
        -0.06135262921452522,
        0.020526152104139328,
        0.020684165880084038,
        0.07002992928028107,
        0.02562125213444233,
        0.055585913360118866,
        0.09649251401424408,
        0.009142473340034485,
        -0.08124618977308273,
        -0.0794856995344162,
        0.080509714782238,
        -0.021084651350975037,
        -0.047076914459466934,
        -0.010401031002402306,
        -0.057441696524620056,
        0.013647434301674366,
        0.019402965903282166,
        0.04954550787806511,
        -0.023373493924736977,
        -0.026995312422513962,
        0.02082522213459015,
        -0.055126167833805084,
        -0.07793072611093521,
        0.050488486886024475,
        -0.06158270314335823,
        -0.06416389346122742,
        0.024285200983285904,
        0.049836430698633194,
        -0.06413880735635757,
        0.04283035174012184,
        -0.05255438759922981,
        0.07336890697479248,
        0.09127774089574814,
        0.00864478014409542,
        -0.012374973855912685,
        0.02232883684337139,
        -0.024440020322799683,
        -0.001489152666181326,
        -0.07051222026348114,
        -0.01040799729526043,
        -0.047626618295907974,
        -0.07342745363712311,
        0.028506901115179062,
        -0.031456660479307175,
        0.018084345385432243,
        0.021235233172774315,
        -0.01416821964085102,
        -0.04111090674996376,
        -0.03724518045783043,
        0.07521349936723709,
        0.03655530884861946,
        0.02872178703546524,
        -0.04698343947529793,
        0.0021111657842993736,
        0.09006157517433167,
        -0.08254340291023254,
        -0.017550062388181686,
        -0.08411379158496857,
        0.018790917471051216,
        -0.02482990361750126,
        -0.01170708891004324,
        -0.0029382447246462107,
        -0.08651497960090637,
        -0.05290784314274788,
        -0.0634189248085022,
        0.0408443883061409,
        -0.10339108854532242,
        -0.0305627454072237,
        -0.04027803614735603,
        0.018626704812049866,
        -0.024263810366392136,
        -0.014178242534399033,
        -0.0017132863868027925,
        0.10047296434640884,
        0.012856311164796352,
        -0.027843069285154343,
        -0.06507351994514465,
        0.031062263995409012,
        0.028916385024785995,
        -0.08749701827764511,
        -0.001001455239020288,
        -0.06661871075630188,
        0.038730524480342865,
        0.02012408897280693,
        -0.027917485684156418,
        0.023193715140223503,
        -0.04716493934392929,
        -0.011521057225763798,
        -0.0022512059658765793,
        0.06240342929959297,
        -0.0878271535038948,
        0.09690968692302704,
        0.03908991441130638,
        0.043533749878406525,
        -0.015461582690477371,
        -0.020961221307516098,
        -0.10075975954532623,
        -0.018767647445201874,
        0.05645006522536278,
        0.04148338362574577,
        -0.056854017078876495,
        5.394141170489945e-33,
        -0.02355656586587429,
        0.04213416576385498,
        0.06180252134799957,
        0.026497945189476013,
        -0.08003924787044525,
        -0.02675599232316017,
        -0.02244291827082634,
        0.004688013345003128,
        0.07690586149692535,
        -0.004517282359302044,
        0.004247468430548906,
        0.036421068012714386,
        -0.07890677452087402,
        -0.02053331770002842,
        0.059642087668180466,
        -0.03816579282283783,
        -0.09205355495214462,
        -0.05298232659697533,
        -0.023026276379823685,
        0.039725616574287415,
        0.017282264307141304,
        -0.07899737358093262,
        0.023759733885526657,
        0.032312020659446716,
        0.08534598350524902,
        0.014069429598748684,
        0.12594938278198242,
        -0.02921842597424984,
        0.0975341722369194,
        0.03187311068177223,
        -0.16436149179935455,
        -0.08823930472135544,
        0.036816634237766266,
        -0.09274191409349442,
        -0.02179753966629505,
        0.015387063845992088,
        -0.0711199939250946,
        -0.0900871753692627,
        -0.040522001683712006,
        -0.05195263400673866,
        -0.07649466395378113,
        -0.00756515609100461,
        -0.09331554919481277,
        -0.04857754707336426,
        0.017267534509301186,
        -0.02002955600619316,
        -0.07320436835289001,
        -0.022099366411566734,
        -0.011068948544561863,
        -0.022872159257531166,
        -0.02342813089489937,
        -0.014295895583927631,
        -0.06376215070486069,
        0.02398035116493702,
        -0.03646443039178848,
        -0.04059948772192001,
        0.06642420589923859,
        0.01968483254313469,
        0.03782558813691139,
        0.022924112156033516,
        0.0005233485135249794,
        0.008136163465678692,
        0.015338467434048653,
        -0.006508457474410534,
        0.018976042047142982,
        0.07998083531856537,
        -0.029828926548361778,
        0.0004364384803920984,
        -0.0038942135870456696,
        0.060239486396312714,
        0.07345963269472122,
        -0.03645680844783783,
        0.04219084233045578,
        -0.024225158616900444,
        -0.0013515341561287642,
        0.006218344438821077,
        0.006238334812223911,
        -0.017176425084471703,
        0.011089921928942204,
        -0.00526009825989604,
        -0.04676656052470207,
        0.03064139559864998,
        -0.014828077517449856,
        0.04275737702846527,
        -0.04166271910071373,
        -0.05218500643968582,
        -0.02378382720053196,
        -0.07492151856422424,
        -0.01578904688358307,
        0.12261033058166504,
        -0.017533572390675545,
        0.06174721196293831,
        -0.030360568314790726,
        0.007412147708237171,
        -0.07531290501356125,
        -5.6222932363830276e-33,
        -0.09131314605474472,
        0.06106704846024513,
        0.002536448650062084,
        -0.003430413082242012,
        -0.021696100011467934,
        -0.0004119474906474352,
        0.10263340920209885,
        0.11012790352106094,
        0.007949421182274818,
        -0.015378366224467754,
        -0.04970422759652138,
        -0.027838006615638733,
        0.048136938363313675,
        0.0011924628634005785,
        -0.0356646329164505,
        0.005584151018410921,
        0.017095297574996948,
        -0.045021843165159225,
        0.06844310462474823,
        0.05273432284593582,
        0.08062875270843506,
        0.06123434752225876,
        0.09158378094434738,
        0.08443434536457062,
        -0.038437362760305405,
        -0.022865690290927887,
        -0.06892789900302887,
        0.04312664642930031,
        0.007278501987457275,
        -0.08225337415933609,
        -0.039473459124565125,
        -0.048147834837436676,
        0.029013043269515038,
        -0.053588107228279114,
        0.09560011327266693,
        0.03702741861343384,
        0.024150995537638664,
        -0.03131641820073128,
        0.03355913981795311,
        -0.058320604264736176,
        0.0011630390072241426,
        0.011962958611547947,
        0.0902496948838234,
        0.007379426620900631,
        0.013593310490250587,
        -0.051333945244550705,
        -0.02108064666390419,
        0.027973731979727745,
        0.007231532596051693,
        -0.022117864340543747,
        0.03451627120375633,
        0.020413152873516083,
        -0.03516257926821709,
        -0.015767984092235565,
        -0.04951821640133858,
        0.031028499826788902,
        0.027528416365385056,
        -0.047619108110666275,
        0.027979521080851555,
        0.07991760969161987,
        0.09071915596723557,
        0.01596193015575409,
        -0.021389029920101166,
        -0.01324436254799366,
        -0.021835733205080032,
        0.04151371493935585,
        0.13787072896957397,
        -0.01385839469730854,
        0.034036848694086075,
        0.05650417134165764,
        0.033382464200258255,
        -0.02916930615901947,
        0.033477310091257095,
        -0.0031536512542515993,
        0.016230633482336998,
        0.12330188602209091,
        -0.08850204944610596,
        -0.050160884857177734,
        -0.07678225636482239,
        -0.08907725661993027,
        0.026178687810897827,
        0.09705221652984619,
        0.006573745049536228,
        0.03221936151385307,
        0.08382294327020645,
        0.00029615015955641866,
        0.032256923615932465,
        -0.0687761902809143,
        -0.019385360181331635,
        0.020606322214007378,
        -0.00018065331096295267,
        0.037054359912872314,
        -0.04484555870294571,
        0.016043048352003098,
        0.004202806390821934,
        -5.347031972746663e-08,
        0.004475805442780256,
        -0.05986357480287552,
        0.048161718994379044,
        -0.04574443772435188,
        -0.023472538217902184,
        -0.11724164336919785,
        0.05233658850193024,
        0.01574794389307499,
        0.08648552000522614,
        0.029943736270070076,
        0.04621894285082817,
        -0.06322775036096573,
        -0.06981566548347473,
        0.1214873194694519,
        0.02431773580610752,
        0.018818449229002,
        -0.02342010848224163,
        0.030935538932681084,
        -0.028392819687724113,
        -0.0060958294197916985,
        0.010828617960214615,
        0.051458172500133514,
        -0.003419626271352172,
        -0.059115197509527206,
        0.07152349501848221,
        -0.07293891906738281,
        -0.05225759372115135,
        0.08453369140625,
        0.02821159176528454,
        -0.06359408050775528,
        -0.020993612706661224,
        0.037405211478471756,
        -0.029942015185952187,
        0.03269872069358826,
        -0.026917314156889915,
        -0.02855714038014412,
        -0.04383714124560356,
        0.04205765575170517,
        0.020967457443475723,
        -0.04232816770672798,
        -0.046482037752866745,
        -0.05743595212697983,
        0.009768987074494362,
        0.03303511068224907,
        0.0022803833708167076,
        -0.031012579798698425,
        -0.025762079283595085,
        -0.11008741706609726,
        0.004732776433229446,
        0.044573474675416946,
        -0.030048316344618797,
        -0.03731858730316162,
        0.02794629894196987,
        -0.07205758988857269,
        0.04752122983336449,
        0.01953667588531971,
        0.03634607419371605,
        -0.000994672765955329,
        -0.02695605717599392,
        -0.08677501976490021,
        -0.0056467484682798386,
        0.0002392021269770339,
        0.019248904660344124,
        0.08138415962457657
    ]
}