{
    "id": "jFQEwfuS3G0",
    "title": "The BEST of CES 2020",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-01-10T20:53:51Z",
    "video_url": "https://www.youtube.com/watch?v=jFQEwfuS3G0",
    "category": "Science & Technology",
    "tags": [
        "ces",
        "ces 2020",
        "tech",
        "cool tech",
        "future tech",
        "technology",
        "razer",
        "asus",
        "rog",
        "toyota",
        "amd",
        "insta360",
        "dell",
        "alienware",
        "sony",
        "android",
        "windows",
        "display",
        "monitor",
        "oneplus",
        "woven city",
        "concept one",
        "oneplus concept one",
        "insta360 one r",
        "one r",
        "lg",
        "lg ultrawide",
        "lg gram",
        "ultrawide",
        "this is",
        "austin evans"
    ],
    "views": 643587,
    "likes": 18564,
    "comments_count": 724,
    "description": "Thanks to Amazon for sponsoring this video! MORE of our CES videos here  The TINY Razer Tomahawk:  a 360 FPS ROG monitor:  AMD's Ryzen is a HUGE step forward for 2020:  The ridiculous PC with a full PS4 Pro built in:   My walkthrough of the Toyota Woven City:  The 4K 160Hz LG UltraGear 27GN950:  \r Check out our new channel! \r Subscribe! \r Instagram: \r Twitter:",
    "description_links": [
        "https://youtu.be/uN-Qka6zruI",
        "https://youtu.be/ScwPFY5l1Ew",
        "https://youtu.be/aUvB-3gG1YA",
        "https://youtu.be/2YwcfFqkpsI",
        "https://twitter.com/Toyota/status/1214607114435325952",
        "http://bit.ly/2sQ8bHS",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. My voice is nearly gone, but we're here at CES, it's time to take a look at some of the best things that we've found. And sponsoring the madness this year is Amazon. Starting with of course, the announcement of the Sony PS5 logo. In other news, Razer announced actual, real products that we were actually able to try, unlike someone else, that announced a car instead of a PlayStation. I'm still salty about that. So Razer has a few things we actually already did a video on, but definitely the highlight for me is the Razer Tomahawk. So this takes advantage of the Intel NUC Compute Element, which essentially puts an entire laptop CPU and motherboard onto what looks like a graphics card that you can slide into an incredibly small enclosure. If you want more, you can definitely check out the full video. However, since we've made that video, it's come to light exactly how expensive the NUC Compute Element is. So Razer's still trying to confirm how much they're gonna charge for the Tomahawk. But just to get the Compute Element, you're looking at like $1200, and that's just for the Core i7 model, you don't even get RAM or SSD, and obviously you still have to buy everything else. So it's cool, it's definitely one of my highlights of CES, but it's pricey, it's a lot. So much that it broke my voice. Speaking of Razer, they also showed off their new Blade 15 and 17 with the 300Hz displays. Now that's actually been a bit of a trend here at CES. Of course displays are always interesting, you see the 8K TV's, but what we're seeing a lot of, it's really pushing the envelope not necessarily in just pixels, but in resolution, frame rate, as well as HDR, all combined. So there are a ton of really cool displays, in addition to these ridiculous 300Hz laptops. But probably my favorite is what we saw over at the ASUS booth, with the ROG Swift 360, with a full 360 frame per second display. Now mind you, is it for everyone? No, it's for hard-core eSports guys who want a 24-inch, 1080p monitor that runs at 360 frames per second. But it's really cool here at CES to see not just the bigger, more ridiculous monitors, but stuff which is actually practical for a wide range of people. There we go, something like this. Oh, hi, didn't see you there. So this years' best of CES coverage is sponsored by Amazon and the Amazon Alexa. It should be no surprise, considering that we're here at CES that Amazon Alexa is absolutely everywhere. With over 100,000 compatible Alexa devices, and sorry, let me just say that again, 100,000 Amazon Alexa compatible devices, as well as over a hundred thousand skills. It really is in pretty much everything. Alexa, order a Coke Energy. - [Alexa] What do you call a Coke Energy presentation? A PowerPoint, doh! - That was pretty good, that was pretty good. So there are all kinds of different devices that do have Amazon Alexa support. So for example, there's the Echo Glow, there's also the Echo Dot. There are literally hundreds of different devices that support Alexa here, including MindStorms. Between the devices that take advantage of Alexa and the wide range of developers who are supporting it, it is absolutely no wonder that Alexa is pretty much everywhere here at CES. Something else really cool is the Insta360 ONE R, which we've been using for the last couple weeks. So the cool part about this is that it actually comes in a modular sort of state. So if I pull it out here, this is the, I believe that they call it the twin pack, what we're getting here is actually a couple different ways that you can take it apart. So this right here is what I would call the brain, so this is where the processing happens, you've got a little USB-C port behind this flap, you have your record button, as well as a very small screen. But the cool part about this is that you can attach different lenses and different cameras based on what you actually wanna do with it. So if I wanna vlog with it, I can have the screen facing me, or if I take it apart, flip it around, I can have the screen facing away from me and just shoot it like this. So if we want a action cam, this is all we need. Or, alternatively, it also does come at least with this specific pack, with the 360 module. So we're gonna attach the bottom, snap these guys apart and now I can easily just connect my 360 module, snap this guy onto the bottom and now I have a 360 camera. The cool part about this is you can easily buy the cameras, the modules, these little sensors, and you can swap it out. So this can be the brain, and the idea is that Insta360 will continue to support this into the future. So they will continue to bring out new modules. In fact, there's actually another module coming soon, which has a much larger one-inch sensor and a Leica lens. Now all this looks really cool, however I can't wait to get back to the office and spend a little bit more time to see just exactly how we can use it in our own workflow. So we're over here at the very loud LG booth to take a look at what they got and one of the things that's really jumping out to me is their brand new UltraWide displays. So this is the 38WN95C, and this is a 38-inch display, 4K by 1440p resolution. What's really cool about it, is while it has all the professional features like Thunderbolt and HDR 600, what's cool about it is it also supports 144 Hz as well as G-Sync. There's also the brand new UltraFine Ergo, which is a 32-inch 4K display, on what is one of the best looking hinges I've ever seen, it's super flexible, and they also do have the new Gram, which I actually wanna go much more in depth on later, but it has been updated with larger batteries, as well as Intel 10th gen, and Thunderbolt across the board. Speaking of displays, LG has their brand new UltraGear line, and one of the ones that really has jumped out to me is their new 27-inch 4K panel. What's nice about this, is not only do you get the high end color accuracy, as well as what honestly is probably one of the better looking monitors of all CES that I've seen, but it also runs at that full 144 frames per second. You can overclock it to 160 frames per second. So it's kinda like, you get the high end image quality, but you also get that super, super smooth G-Sync action. What might be my favorite part though, lowkey, is this simulator they have over here, with three of the 38-inch monitors all running super high refresh rate with the F1 simulator, real talk, I think this might be the year that I finally build my own sim racing. Like I really, really want a sim racing set-up, like mmm, mmm! Mmm! Mmm! I also need a voice, but it's fine, I'll just race, it'll be fine. Dell, specifically Alienware, had some very interesting announcements. The thing that really got my attention is the Concept UFO, As this is essentially a Nintendo Switch, except a Windows PC. So it's an 8-inch display, it does have removable controllers, although to be fair even though they're magnetic, they don't actually work wirelessly, but there's still a lot of very cool stuff here. And while yes, they call it a concept, I kind of feel like this is a real thing, I mean the fit and finish was absolutely spot-on. And it really does feel like a product that they can ship any time now. Now they're being very coy about what's actually inside this thing. So all I could get out of them is that it's Intel 10th gen, which to me makes me assume that it's pretty much the same spec as an XPS 13, just put in a smaller chassis. But with it, I was able to play a couple of games that I would guess were somewhere in the neighborhood of maybe 900p or 1080p on low, so it's certainly not a hardcore gaming machine. But considering just how small this thing is, there's a lot of potential. Dell also had a couple of interesting new projects. Ori, which is a single 13-inch laptop which you can fold into half, which is interesting. As well as Project Duet, which is essentially a 13-inch laptop with a secondary display instead of the keyboard. So I'll start with Duet, one of the cool parts about this is while you do have the dual screens, they're still flat touch screens, so you don't have to deal with any kind of folding issues, and it does come with a magnetic keyboard, which will go onto the back when you're not using it, you can put it on top of the keyboard, or the \"keyboard\" to actually turn it into a proper laptop. You can even slide it up and use it as a track pad. Well, they're concepts, right? And I think it's gonna be really interesting to see who's actually interested in something like this. So here at CES there have been a lot of foldable devices, last year was phones, this year it's a lot of tablets and pretty much any kind of weird new form factor that you can take advantage of with a foldable OLED. Wooo! My voice is almost gone but we're nearly there with the best of CES. So the next thing I saw which I was really excited about is the OnePlus Concept One. Now this is a Concept which is very much based on the current OnePlus McLaren 7T Pro, but it has a couple of key features. First of all, in conjunction with McLaren, they have a really cool orange leather back on it. What I find more interesting is the electrochromatic glass that goes over the cameras. So as smart phones get more and more capable as far as the camera side, generally the way they're doing that is by adding more lenses. And while that's great, one look at the OnePlus 7T. Matt, can I have my OnePlus 7T? Thank you. One look at the camera bump bump on the OnePlus 7T, and what might give you an idea of why you might wanna hide this. So with the Concept One, the electrochromatic glass essentially acts as a tint. So when you have it open, it's nice and clear, you can see all the cameras and the flash. But with the press of a button, it will immediately block those off and give it much more sort of sleek form factor. Now this isn't hugely important right now, it's a nice little gimmick and it does have the added benefit of serving as an ND Filter, but where this could really come in handy, as you can imagine an entire back glass panel, we could have all kinds of stuff, like it could be a clear back like JerryRigEverything style. And then you sort of shade the entire thing. There's some cool stuff that they're working on here. Now as a concept, this probably won't be out in its current form, and it might not ever actually come out, but OnePlus has spent some serious time and effort sort of building up this tech. So I'm really curious to see what it can do for the next generation or the next-next generation. So I do have to give a disclaimer, the next item is from a sponsor of the channel, it is from Toyota, however, they have something really cool here at CES. The Woven City. Now, I went way more in depth on this on Twitter, I did a whole walk through, but essentially they're building their entire own city. It's out in Japan, it's by Mount Fuji, and essentially the entire thing is going to be autonomous. It will be very much focused on mobility, it's gonna be powered by hydrogen, everything's going to be sustainable, it really looks like the utopia of Ken's future. So that my friends is the best of CES. Thank you very much for watching, please subscribe if you enjoyed, and you can check out some of our other CES coverage here, actually much more in depth videos on like half the stuff I talked about. Now if you'll excuse me, well, my voice is shot, my feet are shot, my brain is shot, I'm just tired. It's been a long week. Thanks for watching our CES coverage though, appreciate you. Specifically you.",
    "transcript_keywords": [
        "CES",
        "Amazon Alexa",
        "NUC Compute Element",
        "cool",
        "Alexa",
        "Compute Element",
        "CES coverage",
        "Amazon",
        "Amazon Alexa support",
        "Razer",
        "Intel NUC Compute",
        "thing",
        "NUC Compute",
        "cool part",
        "Concept",
        "Amazon Alexa compatible",
        "Austin",
        "devices",
        "pretty",
        "lot"
    ],
    "transcript_entity_values": [
        "15",
        "100,000",
        "half",
        "OnePlus 7",
        "Duet",
        "10th",
        "Twitter",
        "Matt",
        "Japan",
        "one",
        "the NUC Compute Element",
        "CES",
        "ND Filter",
        "Gram",
        "a ton",
        "Dell",
        "OnePlus 7T.",
        "last year",
        "Thunderbolt",
        "13-inch",
        "OnePlus",
        "eSports",
        "Tomahawk",
        "hundreds",
        "300Hz",
        "a long week",
        "OnePlus 7T",
        "27-inch",
        "Alienware",
        "PlayStation",
        "Core",
        "USB",
        "Ken",
        "Austin",
        "24-inch",
        "900p",
        "LG",
        "The Woven City",
        "PowerPoint",
        "Alexa",
        "Mount Fuji",
        "SSD",
        "1080p",
        "Alexa",
        "as over a hundred thousand",
        "38WN95C",
        "360",
        "17",
        "32-inch",
        "the Echo Dot",
        "1200",
        "160",
        "ONE",
        "Coke Energy",
        "the Razer Tomahawk",
        "G-Sync",
        "Amazon",
        "ASUS",
        "Leica",
        "Thunderbolt",
        "Sony",
        "years",
        "MindStorms",
        "McLaren",
        "Toyota",
        "CPU",
        "144",
        "One",
        "one-inch",
        "First",
        "Alexa",
        "XPS",
        "Project Duet",
        "this year",
        "Razer",
        "three",
        "Nintendo Switch",
        "UltraWide",
        "PS5",
        "over 100,000",
        "Razer",
        "OnePlus McLaren 7T Pro",
        "K TV's",
        "RAM",
        "Ori",
        "8-inch",
        "the Concept UFO",
        "F1",
        "the Compute Element",
        "4",
        "OnePlus Concept One",
        "8",
        "second",
        "the year",
        "the Echo Glow",
        "Intel",
        "the last couple weeks",
        "38-inch",
        "UltraFine Ergo"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "GPE",
        "PRODUCT",
        "PERSON",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.07668477296829224,
        -0.013198606669902802,
        -0.003481183899566531,
        -0.08241727203130722,
        0.10119032114744186,
        0.014107382856309414,
        -0.0036494717933237553,
        0.03619973361492157,
        -0.002268020296469331,
        0.05665155500173569,
        -0.04590887203812599,
        0.034818146377801895,
        0.048095036298036575,
        -0.02364002726972103,
        -0.01462162472307682,
        -0.03382919356226921,
        0.09872156381607056,
        -0.02002784051001072,
        -0.041030362248420715,
        -0.0599023662507534,
        -0.04450087994337082,
        -0.07236996293067932,
        -0.018027912825345993,
        0.026658842340111732,
        -0.045932259410619736,
        0.08696049451828003,
        0.06846783310174942,
        0.022361451759934425,
        -0.039092231541872025,
        -0.034734562039375305,
        0.0651484876871109,
        0.013409366831183434,
        -0.012006348930299282,
        -0.017245899885892868,
        -0.024317117407917976,
        -0.07880478352308273,
        0.021085787564516068,
        -0.07878364622592926,
        -0.0793924406170845,
        -0.08542191982269287,
        -0.01092583779245615,
        -0.08147450536489487,
        0.02888106182217598,
        0.08108842372894287,
        0.03979911655187607,
        -0.039076067507267,
        0.016808655112981796,
        -0.09621857851743698,
        0.020305082201957703,
        -0.03826770558953285,
        -0.01432218961417675,
        -0.07525110244750977,
        0.025478024035692215,
        -0.07245685160160065,
        -0.10950658470392227,
        0.045839160680770874,
        0.007610742002725601,
        -0.04188612103462219,
        0.050439752638339996,
        0.025307081639766693,
        0.0671926811337471,
        -0.15014150738716125,
        -0.041819896548986435,
        0.04793309047818184,
        0.017298616468906403,
        -0.02304927632212639,
        0.005945796146988869,
        0.030344875529408455,
        0.028324905782938004,
        0.01449244562536478,
        -0.026128744706511497,
        0.0016207051230594516,
        0.05828402563929558,
        0.046923521906137466,
        -0.012086799368262291,
        -0.017702851444482803,
        0.09238921850919724,
        -0.02167670801281929,
        0.09910774976015091,
        -0.005344852339476347,
        0.04987333342432976,
        -0.05296095088124275,
        -0.04162265360355377,
        -0.12036090344190598,
        0.03411008045077324,
        0.0162031427025795,
        0.009324414655566216,
        0.03000485710799694,
        0.020741809159517288,
        -0.019139602780342102,
        -0.06942998617887497,
        0.059162434190511703,
        0.028917506337165833,
        -0.04922748729586601,
        -0.04610271006822586,
        -0.022942014038562775,
        -0.01414597500115633,
        -0.07243441790342331,
        -0.024335350841283798,
        0.04877058044075966,
        -0.004480175673961639,
        0.10378637909889221,
        0.05973438173532486,
        0.003983486443758011,
        -0.028682583943009377,
        -0.05243949964642525,
        -0.01357954926788807,
        0.05277859792113304,
        -0.028590476140379906,
        0.018142899498343468,
        -0.039448000490665436,
        0.07654175162315369,
        -0.11743652820587158,
        -0.021755240857601166,
        0.05006396397948265,
        0.043936219066381454,
        -0.0278781671077013,
        0.04174474626779556,
        0.09777120500802994,
        -0.04660499095916748,
        -0.029940087348222733,
        0.018145166337490082,
        -0.04407408460974693,
        0.013458814471960068,
        0.10386115312576294,
        0.030084939673542976,
        -0.11065104603767395,
        3.7642444173359325e-33,
        -0.05416513979434967,
        0.14283448457717896,
        -0.010032420977950096,
        0.02035149373114109,
        -0.033048149198293686,
        0.03023683838546276,
        0.03460099920630455,
        0.043552279472351074,
        -0.05830436944961548,
        0.05132227763533592,
        0.04619152471423149,
        0.07333377003669739,
        -0.03878295421600342,
        0.0034935760777443647,
        0.07015788555145264,
        -0.06643853336572647,
        -0.06902531534433365,
        -0.029664941132068634,
        -0.08587300032377243,
        -0.021818378940224648,
        0.01724972575902939,
        0.06806584447622299,
        0.04748747497797012,
        0.03660068288445473,
        0.07078424096107483,
        -0.0020492796320468187,
        -0.04423709586262703,
        -0.007211312651634216,
        0.03871510922908783,
        0.0338972844183445,
        -0.07587603479623795,
        0.014179014600813389,
        -0.025531727820634842,
        -0.00016102388326544315,
        -0.028029248118400574,
        -0.031000517308712006,
        -0.08790834248065948,
        -0.11415328085422516,
        0.033515796065330505,
        0.04381823167204857,
        0.005780106410384178,
        0.05008707195520401,
        -0.07316718250513077,
        -0.03156823292374611,
        0.0047910199500620365,
        0.02617316134274006,
        0.01245727390050888,
        0.006429421715438366,
        0.019258830696344376,
        -0.029095293954014778,
        -0.03273198381066322,
        0.025594551116228104,
        0.03470299020409584,
        -0.033419545739889145,
        0.000929497997276485,
        -0.061562035232782364,
        0.06301189213991165,
        -0.0730191320180893,
        0.09832783043384552,
        0.008054773323237896,
        0.001325535587966442,
        0.01289178803563118,
        -0.08705900609493256,
        0.007280458230525255,
        -0.08186513185501099,
        0.06787688285112381,
        0.114874467253685,
        0.034750547260046005,
        -0.015104219317436218,
        0.07543405890464783,
        -0.0025045371148735285,
        0.010927148163318634,
        0.038048919290304184,
        -0.09555629640817642,
        0.05733395740389824,
        0.048326246440410614,
        -0.037915490567684174,
        -0.015515130013227463,
        -0.06774067878723145,
        0.038216669112443924,
        -0.008256791159510612,
        0.052307091653347015,
        -0.0202967319637537,
        0.019875461235642433,
        0.07512765377759933,
        0.01250890176743269,
        -0.012016497552394867,
        -0.02934025600552559,
        0.02174813114106655,
        -0.06421302258968353,
        -0.006630730349570513,
        -0.04446577653288841,
        0.03264189139008522,
        0.07230115681886673,
        -0.051827505230903625,
        -3.590590840940864e-33,
        0.016584621742367744,
        -0.022353509441018105,
        -0.020073214545845985,
        0.10862401872873306,
        0.0224661435931921,
        -0.04789035767316818,
        0.023633787408471107,
        0.014267596416175365,
        0.015257429331541061,
        -0.11380032449960709,
        0.08509604632854462,
        -0.01608343981206417,
        -0.00650593638420105,
        0.01052033994346857,
        -0.028185604140162468,
        -0.029119206592440605,
        0.024052532389760017,
        -0.09875210374593735,
        0.01170483510941267,
        -0.02464376389980316,
        0.07443942129611969,
        0.1041095107793808,
        -0.005425478331744671,
        -0.009534853510558605,
        -0.032286010682582855,
        -0.03251958265900612,
        0.07108142226934433,
        0.010020988993346691,
        0.04382076859474182,
        -0.006089548580348492,
        -0.0293258223682642,
        -0.027246886864304543,
        0.045319635421037674,
        0.011327644810080528,
        0.048876237124204636,
        0.02312685176730156,
        0.0724768340587616,
        0.03999872878193855,
        -0.02826893888413906,
        -0.005780707113444805,
        0.03817962482571602,
        0.04858923703432083,
        -0.03819431737065315,
        0.05484001338481903,
        0.010841275565326214,
        0.01795128919184208,
        -0.015150721184909344,
        -0.007367883808910847,
        0.0382462702691555,
        0.005616805981844664,
        0.014823080971837044,
        -0.04641139507293701,
        -0.07070446759462357,
        -0.0033146371133625507,
        -0.07349815219640732,
        -0.025029592216014862,
        -0.041924331337213516,
        0.03932841122150421,
        0.008755276910960674,
        0.034899644553661346,
        -0.012463782913982868,
        0.027440818026661873,
        0.010667151771485806,
        -0.06726102530956268,
        -0.011093005537986755,
        0.013164881616830826,
        0.02953922189772129,
        0.0827023908495903,
        0.0012487638741731644,
        -0.02354336529970169,
        -0.03775588795542717,
        0.0060464004054665565,
        -0.05548662319779396,
        -0.04333306476473808,
        -0.037406109273433685,
        0.07984216511249542,
        0.037994906306266785,
        -0.011367328464984894,
        0.020878728479146957,
        -0.0059621394611895084,
        -0.05251492187380791,
        -0.0018996421713382006,
        0.031703364104032516,
        -0.0012088557705283165,
        0.08897101134061813,
        0.0731624886393547,
        -0.03540720045566559,
        -0.06019702926278114,
        -0.029463354498147964,
        -0.009676181711256504,
        -0.047660164535045624,
        0.03289557248353958,
        -0.04087432473897934,
        0.07302005589008331,
        -0.003584066638723016,
        -5.256457313862484e-08,
        0.042851511389017105,
        0.05273427441716194,
        -0.009217450395226479,
        -0.00585161754861474,
        0.08454183489084244,
        -0.013210510835051537,
        0.012910946272313595,
        -0.062468670308589935,
        0.07170446217060089,
        0.07862295210361481,
        -0.00818107184022665,
        -0.01756729930639267,
        -0.025420622900128365,
        0.018872089684009552,
        -0.01393747329711914,
        0.12589384615421295,
        -0.08105777949094772,
        0.05640733614563942,
        0.003794404910877347,
        -0.014559360221028328,
        -0.009050863794982433,
        0.08227863907814026,
        0.08358040452003479,
        -0.030045391991734505,
        -0.025196248665452003,
        -0.0008811973384581506,
        -0.0719989687204361,
        -0.008752008900046349,
        0.08049162477254868,
        -0.043671198189258575,
        -0.04208580404520035,
        -0.050294239073991776,
        0.029866106808185577,
        -0.0075423140078783035,
        0.04688534140586853,
        -0.09825405478477478,
        0.017013035714626312,
        0.036322221159935,
        0.10267318785190582,
        0.0016899157781153917,
        0.024324240162968636,
        -0.05811643600463867,
        -0.07614170014858246,
        0.04929923266172409,
        -0.06263544410467148,
        -0.01154345739632845,
        -0.08406770974397659,
        -0.14642561972141266,
        -0.07209175080060959,
        -0.009538847021758556,
        -0.06213252246379852,
        0.015398537740111351,
        -0.05863925814628601,
        0.027235234156250954,
        0.10810548067092896,
        0.02374519407749176,
        0.009226026944816113,
        -0.0440191924571991,
        -0.01738665997982025,
        0.03484036400914192,
        0.06178281456232071,
        -0.10583263635635376,
        -0.010824942030012608,
        0.07757256180047989
    ]
}