{
    "id": "jfySWlD6W_8",
    "title": "I found the PERFECT keyboard",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-08-09T15:30:56Z",
    "video_url": "https://www.youtube.com/watch?v=jfySWlD6W_8",
    "category": "Science & Technology",
    "tags": [
        "mechanical keyboard",
        "keyboard",
        "custom keyboard",
        "luxury keyboard",
        "gaming keyboard",
        "mechanical",
        "luxury",
        "custom",
        "gaming",
        "taeha types",
        "razer",
        "massdrop",
        "drop",
        "ctrl",
        "massdrop ctrl",
        "huntsman",
        "razer huntsman",
        "anne pro 2",
        "review",
        "test",
        "comparison",
        "gaming pc",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 2578734,
    "likes": 71035,
    "comments_count": 2873,
    "description": "Can we truly find the ultimate gaming mechanical keyboard?  Enter for your chance to win a $20,000 gaming PC!  Razer Huntsman Mini keyboard on Amazon:  Razer Huntsman Tournament keyboard on Amazon:  Anne Pro 2 keyboard on Amazon:  Epomaker SK64 keyboard on Amazon:  Massdrop / Drop CTRL keyboard on Amazon:  GMMK Compact keyboard on Amazon:   Best mechanical keyboard 2020  By using our Amazon affiliate links we may receive compensation for purchases through those links.  My new podcast The Test Drivers!  Our second channel This Is!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.omaze.com/AUSTINEVANS",
        "https://austin.tech/huntsmanmini",
        "https://austin.tech/huntsmantournament",
        "https://austin.tech/annepro",
        "https://austin.tech/sk6",
        "https://austin.tech/dropctrl",
        "https://austin.tech/gmmkcompact",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to our search for the ultimate mechanical keyboard. So Ken has spent many, many hours and many, many dollars buying, customizing, and tweaking to his heart's content, a wide range of keyboards in our search for what could be the very best keyboard that you can buy. Now, the thing is, when it comes to a mechanical keyboard, you can get way into the weeds, right? I mean, there are people who are incredibly hardcore, you can completely custom build keyboards like our friend Taeha Types does. But the thing I want to know is which of these keyboards is closest to my own personal preference. And before we get to that, of course I have to give a big shout out to the sponsor of today's video, which is? - [Ken] Omaze. - Which is? - [Ken] Omaze. - Okay, it doesn't work when I try to lean in too far to the camera. Thank you very much to Omaze for sponsoring this video. Be sure to stay tuned to the end of the video, to find out how you can not only help support a wonderful charity, but also potentially win yourself some sweet new gaming gear. So to start out with, let's take a look at the Razer Huntsman Mini, which has the same, very clicky switch that I'm used to and I actually use in my Razer Huntsman Elite at home. So I have always heard gravitated toward the much more clicky style. Now, there are actually advantages and disadvantages to the various different ones, beyond just your own personal preference. So for me, I like this, but also as generally speaking a little bit better for typing, right? So, you know, as you're typing away your essay, your report on why Ken spent all the company money, then this gives you a little bit more of that sort of satisfying click. Now on the opposite end of the spectrum, you have the linear keyboard. This is much quieter, as you can hear, but essentially instead of having that sort of very indistinctive click, so you press it down and then you get the click, this is completely, as the name implies, linear from top to bottom. Now this is generally speaking better as a gaming keyboard. Now what you get here is something which doesn't have that like. (keyboard clicks) It doesn't have that same kind of feel, especially doesn't have that same kind of sound. Well you have to think about it, if you're going to be be gaming and you're going to be using a handful of keys for hours at a time there are a couple of things you want. First of all, you want it to be very quick sort of key. In fact, actually, if you look at the Huntsman, the Tournament Edition, this is a very light linear switch for the exact same reason, right? It's sort of very quick to kind of pop up. It's also very quick to press down and it's not going to be super heavy so your fingers are tired after your hours and hours of Fortnite. I wouldn't know, I don't do that, but I'm sure people play lots of, (clears throat), anyway, what was I saying? Oh yeah, yeah, so linear, very different style of key. Now, if you want to blend the two, then you get what is known as a tactile switch. So essentially it has a lot of the same advantages of a linear switch. But as you can hear, you have a little bit more of an actual click. So this pretty much has no click, right, It just goes all the way down and it sort of, to the feel just is like straight. - [Ken] Yeah, there's a little bit of a bump when you press it, you can actually more feel it than hear it. - [Austin] Yeah, like right like this, right? So, click, click, click, You can see how it goes down a little bit and then it drops? Same thing with this guy, right, but you have a much more pronounced click and of course you get a lot more of that sound. - Yeah, basically it's all about confirmation. Do you want to have the audible and physical confirmation or do you just want the physical confirmation or no confirmation at all, it really just depends. So you can spend as much money as you want customizing these keyboards, but you actually don't have to spend a crazy amount. So probably the cheapest one that I have here is this SK64 board. So this has hot swappable switches for optical mechanical switches, So kind of like the Razer. this board with the key caps and the switches themselves costs about $90 unshipped. - Not bad. - Not too bad at all. - [Austin] I love the NES style, color scheme going on here. - It's a cool color scheme, right? And again, it came with all of this stuff already. The only thing that I had to buy apart from that was I ended up taking the liberty of getting some kit stuff to help with the process of taking keys out, right. So, as I pop that guy off, don't worry about it. With a little bit of labor you can actually make your keys feel and sound better than they did before. If I actually take this apart you guys will see that there are these extra little stems here. Those are the stabilizers, those are for the longer keys that kind of need a little bit of stability because the switch just won't cut it on its own. On the other end of it, so this is a Massdrop CTRL, we've looked at a lot of these on the channel. The Massdrop CTRL is one of the ones that you see around on the internet a lot. The biggest thing is that this keyboard on its own costs around I think 200, if not slightly, more than 200, but you can't hot swap the switches off these things to whatever you want. Again, these Gateron MX switches you can put in here. I think this is a lot of money though for what you can get. I actually found that for $120 this GMMK compact board was actually a really good balance of price and quality. So why don't you hold this, why don't you look that, 'cause I'll hold the camera for you. - So this is interesting because what you've done is you've given it those linear switches, but then you've put these very interesting key caps on which are sort of very much domed on all sides. Now that's great if you want to hit F to pay your respects, you don't want your finger to fly off of it. But on the flip side it means it's a little bit harder to move from key to key. - [Ken] Also, the key caps themselves are about 90 bucks. These are from Drop. So does Anne Pro 2 we have pudding key caps in this really nice like cyan and pink color. These were only about $15 on Amazon. So you can go either really crazy at $80. You can get even more for like a couple. You can get them for like 200 bucks, if you really want to, or you can get something really cheap. But of course the feel is different. These definitely feel a little more substantial, a little thicker. These are obviously a little cheaper plastic, a little lighter as well. There's a lot of things to chase Austin Evans, keyboards are hell, also this cable, $50. - So I think at this point we have a good sense for the various different keyboards we have. The different switches, different caps, the different sort of chassis. So now, what do we do now? - [Ken] You just want to try 'em and practice? Well, let's put it this way. The first step is to get a computer in here. We should probably get that set up. Hey, there we go, there we go. So we got a computer. And I think what you should do is we'll start with a typing test. Literally, let's see which one you like to type on the most and then we'll go into gaming and we'll see which one you like gaming the most. And then we can kind of just gather opinions and then we'll see which one walks away your favorite. - Okay, I like that, but you didn't say dramatic enough. 'Cause don't forget, we need to keep people watching the video. Next up, we're about to do the most extreme keyboard test possible. I'm about to try all of these keyboards in a wide variety and challenging conditions. I'm about to find out which is the ultimate mechanical keyboard. See, if you say something like that, the people are a little more interested. 'Cause otherwise it kind of sounds boring 'cause we're just playing with a keyboard. - [Ken] You did that for the four people that are left. Good job. - They probably can't figure out how to find the escape key on their custom keyboard So they're stuck on the video. - It's the big red one. - Yeah, well. - [Ken] That sounded pretty good, actually. I'm proud of my work. - So start out with, let's try the Huntsman which I am a little bit more comfortable with. So... 74 words per minute, so that's about right, I could be a little bit faster but, okay, that's I think a pretty good baseline. So obviously this is something I'm really comfortable with. Let's try one of the linear switches. (keyboard clicks) All right, 78, so almost exactly the same. Although interestingly, I was actually a little bit more accurate. Okay, let's try one of the tactiles now. (keyboard clicks) Oh, okay, slightly messed up. A little bit faster, wait, is that really true? 77, have I gotten exactly the same on all three keyboards. Does that sound right to you? - [Ken] I mean, just says that you're consistent. - 83, so a little bit faster on that one. Now one thing I definitely noticed is a, pinging, that's the phrase, right? So you actually hit that space bar a little loud, can you hear that? (keyboard clicks) - [Ken] You get that twang, right? So what you can do is essentially dampen the body on some of these keyboards, you just straight up, open up the whole entire thing, put a little bit of foam between the body and the board. This one, my favorite one that I spent hours and hours slaving over, this one, the GMMK actually came pre dampened already, it came with the foam. (keyboard clicks) 64, yeah I was significantly slower with that one. You know, in theory, I could probably be pretty fast with this one but the weight and especially the keycaps on that one it would take a lot of getting used to Im not, no offense, Im not a huge fan of this one particularly. (keyboard clicks) - 73, okay. Now why don't we try-- - One of the CTRLs? - Yeah, which CTRL should I use? - [Ken] You can try both of them but they're very, very different from each other. - Yeah, I'm making a lot of mistakes, but it does sound nice. It's crazy light. - [Ken] I think the rating is like 35 grams. - Okay, 69. - Nice. - But my accuracy was among the worst. - [Ken] Yeah, so these are a little bit of a heavier, tactile switch. - 93 and 100% accuracy, that is so much better than the other ones. So if I'm going to do all of these, I think I need to really narrow it down to a couple. So it is a new day. I have come in with fresh eyes and we have an actual gaming PC, unlike yesterday, ahem. So now let's play some CS:GO and see which keyboard I really like. So first impressions, I definitely like the Razer, right? It feels good, it feels sort of very responsive. And this is what I'm used to, right, this is the way I always game. It's funny, when it comes to gaming I almost feel like the mouse makes more of a difference than the actual keyboard. Right, would you agree? - Not really. - Really? I feel like for something like CS:GO I care more about sort of tuning my mouse than anything else? - [Ken] You're not really playing like a CS:GO player though. - No, cause I suck. Of course, we already have established this, I'm not a good gamer. So this, if I remember correctly, is our tactile, right? - [Ken] Yes. - Immediately I like the sort of lighter feel of this one. So something I'm noticing with this one, it feels a little bit more sort of the lack of clickyness actually means that I feel like I can get the key down little bit quicker. It does seem like it's kind of an interesting blend. I really want to go back to the Drop though, 'cause I feel like this was my favorite when it came to typing and my thought is, it's probably going to be better for gaming too. All right. Oh, I love that feel. So I think something that is really jumping out to me about the Drop is it feels, like for my personal taste, I like the way that it sounds. And especially when it comes to actually gaming, it feels good, right, like I don't know how to, I don't know how to best describe it, but like, I guess the responsiveness of the keys. I'm a little bit torn between the Razer and the Drop right now. For typing I actually really liked the Drop. For gaming I do like the tactile feel, it does feel like it's a nice sort of middle ground. This is one of the most expensive keyboards here. Obviously you have the full rainbow puke if you want it. But especially if you get into something like maybe some custom key caps on this to kind of give it a little bit more style. This might be the move. Like, I love my Razer, right, I love the clicky clackiness, but I think it actually may be time for me to move on a little bit and go to something which is just a little bit more, sophisticated for your finest mechanical keyboard needs. - [Ken] The goal is to get you to try better things so much to the point where certain things don't feel as good anymore. - Are you trying to tell me the difference right now is using my Razer, like this is like a prebuilt gaming PC whereas this is like building my own? Like, is that the difference? - [Ken] I think the differences like, this is Alienware. This is iBUYPOWER. - Okay. - [Ken] And then this is like your budget $800 PC that you built on your own. - So with all of this I'm curious, what happens when I go to the extreme end of mechanical keyboards, what happens if we actually build a full custom one? - [Ken] Well, I can find someone to help you with that. It will cost you about, a couple of hundred dollars or a thousand dollars. - Oh, okay, that sounds much more like it. Luckily we have the sponsor of today's video to help out, Omaze! See what I did there? You made a joke about money and I was like, oh, well this video's sponsored so hopefully they'll sponsor our video on a building a computer keyboard. - [Ken] They justified me purchasing all of these. - Omaze is partnered with Gamers Outreach, a charity which is dedicated to providing children in hospitals with access to gamer gear as well as entertainment. And you can help support as well as potentially win yourself a $20,000 ultimate gaming PC, as well as some sweet Razer gear, including a mouse, keyboard, as well as headset. When you donate you're entered for a chance to win and you can do that by going to omaze.com/AustinEvans and entering the code AustinEvans50 for 50 additional entries. If you're not familiar with Omaze, they have a wide range of other things available, including giving away stuff like cars and one of a kind experiences. But if you want your chance to win a $20,000 ultimate gaming PC, and don't forget that also includes taxes and shipping included, head over to omaze.com/AustinEvans and use the code AustinEvans50 for those 50 additional entries. Thank you very much to Omaze for sponsoring this video and thank you very much to Omaze for giving you guys a sweet opportunity. What are you waiting for, head over there and until next time, I will be playing with keyboards and not a $20,000 ultimate gaming PC. Well, that's a future video, okay, that's not, that's a different thing. Don't worry about that.",
    "transcript_keywords": [
        "bit",
        "keyboard",
        "feel",
        "keyboards",
        "gaming",
        "key",
        "sort",
        "Razer",
        "kind",
        "yeah",
        "thing",
        "click",
        "Omaze",
        "key caps",
        "good",
        "Razer Huntsman",
        "lot",
        "mechanical keyboard",
        "switches",
        "Razer Huntsman Mini"
    ],
    "transcript_entity_values": [
        "78",
        "200 bucks",
        "F",
        "Razer",
        "77",
        "20,000",
        "three",
        "about 90 bucks",
        "Huntsman",
        "CTRL",
        "800",
        "Austin Evans",
        "Razer",
        "more than 200",
        "Ken] Omaze",
        "first",
        "Alienware",
        "Amazon",
        "Omaze",
        "Anne Pro 2",
        "80",
        "Ken",
        "64",
        "Austin",
        "yesterday",
        "a thousand dollars",
        "120",
        "two",
        "four",
        "50",
        "Gateron MX",
        "100%",
        "Razer",
        "Gamers Outreach",
        "73",
        "Drop",
        "one",
        "omaze.com/AustinEvans",
        "50",
        "35 grams",
        "hours and hours",
        "69",
        "Fortnite",
        "NES",
        "200",
        "GMMK",
        "Taeha Types",
        "linear",
        "about $90",
        "the Razer Huntsman Mini",
        "only about $15",
        "One",
        "a couple of hundred dollars",
        "Massdrop",
        "today",
        "hours",
        "First",
        "Razer Huntsman Elite",
        "74"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "ORDINAL",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.04323991388082504,
        -0.0964164063334465,
        0.03709009289741516,
        -0.05066094920039177,
        -0.06780467927455902,
        -0.010016909800469875,
        0.07787422090768814,
        0.05230565369129181,
        -0.011587191373109818,
        0.09507196396589279,
        0.02622491680085659,
        0.049976859241724014,
        0.05913844332098961,
        -0.018004773184657097,
        -0.012103262357413769,
        -0.048376381397247314,
        0.03457011282444,
        0.02265940047800541,
        -0.08361948281526566,
        -0.003174409968778491,
        -0.04889978840947151,
        -0.055517639964818954,
        -0.01808123290538788,
        -0.017887433990836143,
        -0.03999778628349304,
        0.030369404703378677,
        0.004875350743532181,
        0.02856762893497944,
        -0.002011396922171116,
        -0.08600811660289764,
        -0.0822775661945343,
        0.013680796138942242,
        -0.01424423698335886,
        -0.013394497334957123,
        -0.05816711485385895,
        -0.003717071609571576,
        -0.021795053035020828,
        0.013817863538861275,
        -0.09410716593265533,
        -0.06708276271820068,
        -0.06738682836294174,
        -0.058653801679611206,
        0.05986640602350235,
        0.06539782136678696,
        0.0450126975774765,
        0.03686234727501869,
        0.005937956273555756,
        -0.0983428806066513,
        0.0006893178797326982,
        0.06055285781621933,
        -0.08929917961359024,
        -0.05271172896027565,
        0.09598366171121597,
        -0.017967233434319496,
        -0.02615315467119217,
        0.03984101489186287,
        -0.03381367027759552,
        -0.009321818128228188,
        0.041242487728595734,
        -0.03511324152350426,
        0.04259235039353371,
        -0.09018833935260773,
        -0.06663736701011658,
        -0.02964606136083603,
        -0.036286260932683945,
        0.04253813624382019,
        0.02506539411842823,
        -0.01874595135450363,
        0.06443515419960022,
        0.0009168167016468942,
        0.018351498991250992,
        -0.051738303154706955,
        -0.006355303805321455,
        0.0272965244948864,
        0.040052786469459534,
        -0.049105964601039886,
        0.06848740577697754,
        -0.04177432507276535,
        0.05891146883368492,
        0.0892210379242897,
        -0.017048969864845276,
        -0.01423630490899086,
        0.015132542699575424,
        -0.05187210813164711,
        0.02942558191716671,
        0.041242312639951706,
        0.013533338904380798,
        0.03907684236764908,
        0.043819911777973175,
        0.016342412680387497,
        -0.039605166763067245,
        0.048874445259571075,
        0.03371284529566765,
        -0.038837384432554245,
        -0.04671938344836235,
        0.03996315225958824,
        0.03657658398151398,
        -0.025112083181738853,
        -0.06185111030936241,
        0.029241524636745453,
        0.023901421576738358,
        0.038113415241241455,
        0.0520566888153553,
        -0.04257727414369583,
        0.024347174912691116,
        -0.04109515622258186,
        0.009347492828965187,
        -0.013037136755883694,
        0.02870929427444935,
        -0.017067044973373413,
        -0.037616368383169174,
        -0.03529864549636841,
        -0.019025908783078194,
        0.03204360976815224,
        0.004868880845606327,
        0.061647284775972366,
        -0.058351337909698486,
        0.038164809346199036,
        0.13196416199207306,
        0.0691726878285408,
        -0.04569931700825691,
        -0.02970651537179947,
        -0.10773476213216782,
        0.03369535133242607,
        0.011544263921678066,
        0.045773863792419434,
        -0.0929824635386467,
        5.1376438950367064e-33,
        -0.009966031648218632,
        0.12585137784481049,
        -0.0032780487090349197,
        -0.018964339047670364,
        0.03778136149048805,
        -0.028825705870985985,
        0.03466084599494934,
        0.04627664387226105,
        -0.028296276926994324,
        -0.016289090737700462,
        -0.07360012829303741,
        0.040100742131471634,
        -0.08682223409414291,
        0.05105896294116974,
        0.08922485262155533,
        -0.0741114690899849,
        -0.04995793104171753,
        0.03897549584507942,
        -0.09108558297157288,
        -0.04315770044922829,
        0.062474679201841354,
        0.046917159110307693,
        0.025800101459026337,
        0.0007182637928053737,
        0.04308313503861427,
        -0.019496813416481018,
        -0.0016862197080627084,
        -0.036349475383758545,
        0.03408470377326012,
        0.02612990140914917,
        -0.1440577507019043,
        -0.006228914484381676,
        -0.10219072550535202,
        -0.03984503075480461,
        -0.02417420968413353,
        -0.055399272590875626,
        -0.01720542646944523,
        -0.04546552523970604,
        -0.014737510122358799,
        -0.006381957791745663,
        -0.0540585070848465,
        0.02801898866891861,
        -0.052739374339580536,
        -0.027142304927110672,
        -0.0240656528621912,
        0.00920508336275816,
        0.05609900876879692,
        0.037852223962545395,
        -0.009022515267133713,
        -0.12397102266550064,
        -0.016054971143603325,
        0.04654568433761597,
        0.044052235782146454,
        0.024932701140642166,
        0.015039767138659954,
        -0.07833486050367355,
        0.0040948945097625256,
        0.027002805843949318,
        0.0846334844827652,
        0.09112671762704849,
        0.01762850023806095,
        0.029939765110611916,
        0.09185843169689178,
        0.11119589954614639,
        -0.004800242837518454,
        -0.026939477771520615,
        0.03519647195935249,
        0.008522680029273033,
        0.01440564263612032,
        0.01467133779078722,
        -0.02673373557627201,
        -0.0010237268870696425,
        -0.01905018649995327,
        -0.05656949058175087,
        0.004823349416255951,
        -0.02273189090192318,
        -0.010174943134188652,
        -0.08871697634458542,
        0.014076118357479572,
        -0.020632298663258553,
        0.008788115344941616,
        0.1184827908873558,
        -0.09217999875545502,
        0.04073377326130867,
        0.02586909756064415,
        -0.012434057891368866,
        -0.007274444214999676,
        -0.10027571767568588,
        -0.00395159563049674,
        0.009124630130827427,
        -0.10333000868558884,
        -0.03257383033633232,
        -0.03663922846317291,
        0.01989830657839775,
        -0.012234002351760864,
        -5.439251868228704e-33,
        -0.04709114879369736,
        -0.048238251358270645,
        0.02327459119260311,
        0.10447494685649872,
        0.009777081198990345,
        0.04064079374074936,
        0.013500423170626163,
        -0.018774310126900673,
        0.08316764235496521,
        -0.06624279916286469,
        0.022782983258366585,
        0.04381933435797691,
        0.05678689852356911,
        -0.018352467566728592,
        -0.0191267728805542,
        -0.01107780821621418,
        -0.05237175524234772,
        -0.007395080756396055,
        0.07964468747377396,
        -0.06478477269411087,
        0.0700233206152916,
        0.019136691465973854,
        -0.11643034964799881,
        0.06031553074717522,
        -0.03582346811890602,
        -0.003139896783977747,
        -0.024051541462540627,
        0.08494266867637634,
        -0.03310110792517662,
        0.04863541200757027,
        -0.01765555702149868,
        0.07003169506788254,
        -0.027028847485780716,
        0.05064494535326958,
        -0.008600516244769096,
        0.0189442690461874,
        -0.03242214024066925,
        0.09092335402965546,
        0.02507128193974495,
        0.0182877779006958,
        0.09890102595090866,
        -0.033047664910554886,
        0.049086615443229675,
        0.02297329157590866,
        0.018347827717661858,
        -0.07086487859487534,
        0.0054238843731582165,
        -0.08872378617525101,
        0.04716597869992256,
        -0.004761073738336563,
        0.09890012443065643,
        -0.09245116263628006,
        -0.015448551625013351,
        -0.07969538122415543,
        -0.13812439143657684,
        -0.013480320572853088,
        -0.03217087313532829,
        0.0022685974836349487,
        0.013635988347232342,
        0.02403619885444641,
        -0.02179437130689621,
        -0.016524266451597214,
        0.04684499651193619,
        0.06712664663791656,
        0.034076496958732605,
        -0.023198723793029785,
        0.057866115123033524,
        0.004480191972106695,
        -0.06476858258247375,
        -0.026238663122057915,
        -0.005501621402800083,
        0.023899732157588005,
        0.05554584786295891,
        0.029578588902950287,
        0.051482073962688446,
        0.05462634935975075,
        0.06284817308187485,
        -0.019222576171159744,
        0.00224156491458416,
        -0.06382203847169876,
        0.03118588589131832,
        0.01662909798324108,
        0.07534021139144897,
        0.0343143567442894,
        0.029618462547659874,
        0.1489381641149521,
        -0.04988256096839905,
        0.09401454031467438,
        -0.01867697574198246,
        0.013302387669682503,
        0.04276445135474205,
        0.006649351213127375,
        -0.006491417996585369,
        0.028910476714372635,
        0.010855705477297306,
        -5.593371454892804e-08,
        0.04348282888531685,
        0.0637599527835846,
        -0.04350694641470909,
        0.024440117180347443,
        -0.019413068890571594,
        0.0160604789853096,
        0.004578527063131332,
        -0.04198645055294037,
        -0.021643057465553284,
        -0.012664077803492546,
        0.028400033712387085,
        -0.01664801687002182,
        0.005220275372266769,
        0.053112152963876724,
        0.04240467771887779,
        0.11569776386022568,
        -0.06874285638332367,
        0.06182383745908737,
        -0.06122499331831932,
        -0.03856753557920456,
        0.038725387305021286,
        -0.016050659120082855,
        0.08688345551490784,
        0.00134381209500134,
        -0.054406337440013885,
        -0.05102929472923279,
        -0.11608648300170898,
        0.04870070144534111,
        0.05326821655035019,
        -0.04286123812198639,
        0.008447724394500256,
        -0.045298896729946136,
        0.05440322682261467,
        0.04817676171660423,
        -0.009150022640824318,
        -0.07483053207397461,
        -0.04322812333703041,
        0.03167847916483879,
        -0.05506529659032822,
        0.010259144939482212,
        -0.0034669574815779924,
        -0.11804427951574326,
        -0.06169101968407631,
        -0.02887144312262535,
        -0.11428805440664291,
        0.002753507811576128,
        -0.010334792546927929,
        -0.08156252652406693,
        -0.03613819554448128,
        0.07198581099510193,
        0.0004703881568275392,
        -0.0064892638474702835,
        0.055759355425834656,
        0.007701172027736902,
        0.03767887130379677,
        0.10257630795240402,
        -0.008124489337205887,
        0.015312889590859413,
        0.009840672835707664,
        -0.04748253524303436,
        0.03831696882843971,
        -0.04201212897896767,
        -0.07522030174732208,
        0.05032312870025635
    ]
}