{
    "id": "jHP942Livy0",
    "title": "Your dishwasher is better than you think (tips, tricks, and how they work)",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2024-06-11T15:38:41Z",
    "video_url": "https://www.youtube.com/watch?v=jHP942Livy0",
    "category": "Science & Technology",
    "tags": [],
    "views": 3522513,
    "likes": 142934,
    "comments_count": 10007,
    "description": "Let your dishwasher do the work for you! Links 'n' stuff:  The Connextras video on my dishwasher's program change-up:   The original dishwasher videos:    Technology Connections on Mastodon:   Technology Connections on Bluesky:   Have you ever noticed that I've never done a brand deal? That's all thanks to people like you! Viewer support through Patreon keeps this channel independent and possible. If you'd like to join the amazing folks who fund my work, check out the link below. And thank you!   00:00 Intro 00:55 An overview of how dishwashers work 02:10 Tip 1: Filters - clean them 02:56 More on how dishwashers work 04:13 HEAT - it's important! 06:43 Tip 2: Run the kitchen tap until you get hot water 08:12 DETERGENT - what it does and how the machine uses it 11:42 Tip 3: Use and close the detergent dispenser 14:27 Tip 4: Try cheap detergent and add a pre-wash dose 15:01 Testing a new detergent product 17:52 Detergent dosing 19:40 RECAP and lightning round 20:40 Dishwasher cleaning products 21:43 A workaround for a broken detergent dispenser 22:52 Other cycles and options 23:25 Rinse Aids 24:11 Try cheap pods if nothing else 25:17 Tips on loading the dishwasher",
    "description_links": [
        "https://www.youtube.com/watch?v=0Kp3bjm55xw",
        "https://youtu.be/_rBO8neWw04",
        "https://youtu.be/Ll6-eGDpimU",
        "https://mas.to/@TechConnectify",
        "https://bsky.app/profile/techconnectify.bsky.social",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "If youve got a dishwasher that you thinkkinda sucks, theres a good chance that with just a few tweaks to how you use it you can gettruly clean dishes with very little effort. Hi. Im apparently the internets weird applianceguy, and a few years ago I made two videos on dishwashers and more specifically dishwasherdetergent. Together, theyre the length of a feature film! And you dont have time for that, soIve created this new version. Which begins now. First, I want you to know that you can absolutely load a dishwasher with filthy stuff just covered in crap. I do it all the time! The only prep youshould need to do when loading a dishwasher is scrape off large pieces of uneaten food. The machine can handle a lot on its own, even burnt-on stuff. But its important tounderstand that dishwashers are actually very simple machines doing a very simple thing. Ifyou ever looked in there at the spray arms and thought that looks an awful lot like oneof those twirly lawn sprinklers you were having a correct thought! This machine couldsincerely be described as a couple of those sprinklers inside a waterproof box. The boxhas racks which allow you to conveniently position stuff you want to clean like platesand bowls and flatware above those sprinklers so that they spray all that stuff with lotsand lots of water to get it squeaky clean. But dishwashers dont use lots and lots ofwater. In fact they use very little because the water inside is recirculated. The bottom of yourdishwasher is actually a false bottom: below the mesh surface is a sump which holds somewhere onthe order of a gallon of water. Thats 3.8 liters, though Im not being that precise because the amount varies from machine to machine. When the cleaning cycle begins, an inlet valveopens to allow clean water to fill the sump, usually through a hole in the side wall. Oncefull, the valve closes and a powerful pump driven by an electric motor starts running. That pump forces the water through the spray arms and thats it. That spraying actionis what cleans your dishes. It just has to go on for a while to be effective, hence the recirculation of water. In some machines, the water is screened through a washable mesh filter before it reaches the pump. Which brings me to Tip Number 1: check yourdishwashers bottom for a removable filter and clean it. If youve never done this and you havea filter, Im very sorry for what you are about to find. It will be unpleasant. You should becleaning that filter regularly. In other machines, the pump doubles as a macerator: smallblades at its intake break down bits of food like a mini garbage disposal. Thosemachines usually dont have a filter, just a grid to catch stuff thats too big for themacerator to chew up. And, for the record, those are the only kind of dishwasher that I will everpurchase because cleaning those filters is gross. Now, you might very well have realized that if it's the same water being recirculated then as the dishwasher runs the water inside of it is going to get yuckyfrom all the food residue it's knockin' off the plates and whatnot. And yep! That water gets real nasty realquick. So the machine periodically stops the main pump and starts up a second pump which pushes thedirty water out of the machine through a drain hose. and it may also add some clean water at thesame time to help purge that drain hose and the sump of all the nasty water. Once empty, the dishwasherfills itself up again with another gallon-ish of clean water and the main pump starts back upto continue cleaning. This fill, pump for a while, then drain sequence is going to repeat a fewtimes and by the end of the fourth or fifth fill and dump, all the food residue will havebeen removed from the items inside the dishwasher and the water in the sump is clean. On the lastfill the stuff inside is simply getting rinsed, and after one last draining, the cyclewill end and your dishes are clean - all while using only a few gallons of water. In this case, 4.2 gallons or 16 liters. Ive described the basics of what the machinedoes to clean your dishes but Ive skipped two important helpers: heat and chemicals. Letsstart with heat. If youve ever hand-washed a dirty kitchen or food thing then youveprobably discovered that the process is a lot easier if the water youre using is hot. Thisis especially true if what youre trying to clean is at all greasy - the hotter the water, themore that grease softens and the more easily it will come off whatever its stuck to. So,a dishwasher has a heating element to heat the water inside. In many North American dishwashersthat heating element is exposed at the bottom and used for a heated dry option, but top tip - you might try turning that off. I never use the heated dry because it feels like a waste of energy, it can damage items especially on the bottom rack, and the final rinse is quite hot anyway so if you empty the dishwasher right after it finishes, that water will evaporate quickly unless youlive in a swamp. Even if I dont get to it until the next morning most stuff inside isdry and I just use a dish towel for what few things might still have a bit of water onthem. But thats just, like, my opinion. What isn't my opinion though is that it takes awhile to heat up a gallon of water with the power output of that heating element. My dishwasherat home has an 800W element and because energy is energy and water is water, we know that itcan only elevate the temperature of the water inside by about 3 degrees Celsius perminute - and thats assuming absolutely no heat losses. Thats a pretty leisurelytemperature rise so, in North America, dishwashers are hooked up to the hot watersupply at the sink. That way the water they fill with is already hot and the heating element only has to raise the temperaturea little bit (though it may raise it a lot inthe final rinse if you have a sanitize option). Except - well, you know what your kitchensink is like. Unless youve got a booster heater under there or a hot water recirculationpump, it takes a while for the water to actually get hot when you open the tap. The cold water inthe pipes between your water heater and the sink needs to be purged and because dishwashers fillwith so little water, if it takes more than just a few seconds to get hot water at yourkitchen sink your dishwasher will begin washing with lukewarm water at best and stone cold waterat worst. And thats bad, especially because the dishes are at their very dirtiest and could reallyuse the help of heat. Think about how much harder it is to get butter or cheese out of a pan whenthe water is cold and thus isnt softening it. So - heres Tip Number 2: rightbefore you start the dishwasher, run the hot water in your kitchen sink untilits properly hot. That way you ensure the dishwasher will actually fill with hot water. Many dishwashers - like the one youre looking at now - dont even bother turning their heatingelement on at all during the first fill of water. So that water will only be as hot as it was whenit entered. Running the tap until its actually hot may be the most important tip in this video depending on your dishwashers programming. Again, though, this advice is for North Americans specifically. Manyother parts of the world hook the dishwasher up to cold water and the cycle programming is adjustedaccordingly. But here they are designed to fill with (and thus expect) hot water. If you havea delay start option that might change up the programming to account for that but... italso might not so again, if you're not happy with your dishwasher, try running the tap untilits steamy hot and then start it. That alone can make a huge difference. And by the way - if youtry this and it doesnt seem to be helping, you might wanna double check that your dishwasher is actuallyhooked into the hot water line. You should see a water line under your sink with a flexiblehose heading towards the dishwasher. If that hose is hooked up to the cold water supply by mistake, themachines performance will suffer tremendously. But you dont just wash dishes with hot water. Youre gonna need some soap. And thats why you have to buy detergent for your dishwasher! These chemical products contain a non-sudsing cocktail of dispersants, surfactants,emulsifiers, and enzymes. The enzymes help to break down proteins and starches in food, and by the way those enzymes work best when the wash water is up to temperature. Soif you dont run the tap until its hot, you can shorten the time in the wash cycle that the enzymes are effective which hurts washing performance. It may seem like Im hammering thatpoint kinda hard but I am! Because its important and I really want you to try running the tapuntil its hot when you start the dishwasher. Anyway the other components inthe detergent are also important: surfactants lower the surface tension ofthe water which helps it clean. Emulsifiers encapsulate fats and oils which allows them tomix with the wash water. And the dispersants keep all that washed-off gunk suspended in thewater so that it doesnt create residue deposits inside the dishwasher or indeed end up backon the stuff its trying to clean. There are usually a few other helper components dependingon the detergent product, and in a moment Ill tell you the kind of dishwasher detergent Iuse and recommend. Spoiler alert, its the cheapest kind! But first I need to draw yourattention to the machines detergent dispenser. This little dispenser is criticallyimportant to the proper operation of your dishwasher. If you dont put yourdetergent in here and close that door, you may very well be wrecking your machinescleaning performance and I cannot stress that enough. The reason this is here is because every time the machine gets rid of the dirty water inside of it, It also gets rid of any detergent that was in the water! And we need that detergent to clean thedishes! But - we dont want it right away. Think about what happens when you load it upwith dirty dishes - say a bunch of plates after a big pasta dinner. Those plates are filthyand covered in red sauce. Or maybe Alfredo, doesnt matter take your pick. Whenthe machine starts spraying them with water, a bunch of that sauce is going to dissolve quickly, falloff and end up in the wash water. That first fill of water is known as the pre-wash, andsince it gets dirty so quickly, the machinedoesnt spend a lot of time with it. My dishwasheronly spends 10 minutes in the pre-wash before it drains that water out and fills again for thenext part of the cycle known as the main wash. If that dispenser werent there and holding thedetergent back, then my dishwasher would only have 10 minutes with soap in the water and then it wouldall be gone! So only after it has drained the nasty pre-wash water out and replaced it with cleanwater for the main wash does the dispenser door open and allow the detergent into the water. The dishwasher will then spend a long time with that fill of water, sometimes more than an hour. So actuallyhaving detergent added at the correct time is crucial to a good cleaning performance. AlthoughI just discovered that my fancy dishwasher is able to tell how dirty the pre-wash water is andmay switch up its programming. That is not at all a universal thing and depends on having fancy sensors- most machines just run predefined programs so Im not getting into this here, but if you'recurious what I'm talking about - that second channel video will explain. So Tip Number 3: Be sure to use the detergentdispenser and close it. Most of you probably already are, but I know there are some folks out there whoskip it and just throw the detergent in the tub. If your dishwashers detergent dispenseris broken and thats why you aren't using it, thats going to really hurt your machinesperformance and ideally it should be fixed - though there may be workarounds depending on your machine which Ill discuss later. But you may also remember from your previous life experience that fats and oils dontmix with plain water. You need an emulsifier to make them mix. Which is in the detergent... but themachine doesnt let the detergent into the water until the second fill. So you might think thatfirst fill is going to struggle with fats and oils. And yes it will! And thats whymany, many dishwashers have detergent dispensers like this one - where there are twocompartments. One is sealed by the gasket in the detergent dispenser door and labeled MainWash. But the pre-wash compartment right next to it isnt sealed at all: there are holes in the door to allowany detergent you put in there to spill right out. Ya see, before grocery stores were filledwith these infernal pod and pack things, dishwasher detergent came in a boxlike this. It was a box of powder, and you were expected to open this little spout and pour that powder into the dispenser. And if you put some of this powder in both of those cups, then theone with holes in the lid would just spill its contents out and so the dishwasher would beginits cycle with some detergent! That meant it could tackle fats and oils immediately, sothe pre-wash was much more effective. Then, when it drained out that nasty waterand filled again for the main wash, it would open the dispenser and let out a secondround of detergent to replace what just got pumped out. That second fill would have a head-start thanks to the pre-wash detergent getting rid of at least some fats and oils already. And incase youre thinking this is some lost art, my much newer dishwasher - a model still on sale- works the same way. The lid of the dispenser has a divot labeled pre-wash, and if ya put alittle detergent there, it cleans much better. Detergent pods and tablets, while they are a convenient concept, break this pattern. And especially if you have an older dishwasher which wasnt born in thetime of pre-dosed detergent dominance, those products can, frankly, suck. Now, I know many of you out there are having a fine experience using those products and by all means you should keep using emif youre happy. But if youre not happy with your dishwasher, or youre a value-obsessedMidwesterner like I am, heres Tip Number 4: try a more basic detergent product andplace some in both spots your machineexpects it to go. If your dishwasher doesnt have a dedicated spot to put pre-wash detergent, just add a little extra along the dooror directly into the wash tub. Something like a tablespoon will be fine. And if youreskeptical that this will actually do anything, well your dishwasher still has that dispenser,right? Its still holding the detergent back until the second fill, otherwise the dispenser wouldbe pointless. So give it a try. It cant hurt. Speaking of giving things a try, theres a brandof detergent which has come out with yet another new product this time touting CycleSync technology: RightIngredient ASTERISK right time! What does that mean? [clears throat] Finish Ultimate is our first ever tabletwith CycleSync technology that releases the right ingredient ASTERISK to act at the right time. That sure implies that these will align their vibes with my machine or something. But is thereanything to that implication? First, lets put one of these tablets in my dishwasher and let it runfor a bit. Yeah, it all dissolved in a matter of minutes so if I didnt put this in the dispenser (which the instructions explicitly tell me to do) all of it would have drained out after 10minutes. So it doesnt appear to be anything to do with these three sections of seemingly differentitems. Theyre just making this prettier. Since my dishwasher doesnt have a hole in itsside, Ill pour hot water from the tap into this glass pan so we can see watch how the tablets dissolve. Yeah its just its just all oozing out once the membrane is breached. I should note I tried thislast time with their compressed tablet things and I had the same thing happen - it completelydissolved in my dishwasher after 10 minutes. So what do they even mean by CycleSync? Letsfind where that asterisk leads. Oh and by the way this is actually called a double dagger andnot an asterisk, fun pedantic typography fact. Its on the bottom - of course it is. Enzyme. Thats it? The word Enzyme? The protease and amylase enzymes that are also found in thisWalmart brand powder? The Enzymes that work best at high temperatures so will indeed getmore effective at the right time? I dont know if you see how sneaky it is to put that mark after the word ingredient but hopefully you do. The thing is, if its not clear already, theseare just tablets of soap dressed up to seem important. Your dishwasher is the thing doingthe work, and theres nothing all that special about these. And not to get too tin foil hat on you, but it does feel weird to me that theres so much differentiation for a commodity product like dishwasher detergent. Powders and gels tend to live a sad life on the bottom shelf while the flashy pods get allthe attention, but I sincerely think these are the better products because they jibe with the waydishwashers actually work - and theyre a better value, to boot. I much prefer powder because it comes in a paper box and not a plastic jug, but gels are much more readily available. However, powderproducts can contain both bleach and enzymes which arent stable together in a liquid, so powdersare usually more effective. If you can find them. However - theres a wrinkle. But itsdouble-edged. One of the reasons I like powder and gel is because how much detergentyou actually need to use varies. If you have soft water, you likely need to use very little andyou can stretch a box like this for months. But if you have hard water, youll need to use more. Also, how soiled your dishes are affects things, too, because the detergent gets used up and becomes less effective as it tackles food deposits. I strongly believe that the two-dosestructure of traditional dishwasher programs means you can use much less detergent: youre not expecting the detergent to do everything with a single fill of washwater. But the tabs and packs are, though, so they're extremely concentratedto get all the work done at once. The wrinkle in dosing it yourself, though, isthat its pretty easy to use too much detergent. The cups in the dispenser are big for those of you who have really hard water and need a lot of detergent, but most people dont. So if youre trying out apowder or gel product and find youre left with a powdery residue on your stuff, youreusing too much detergent and the final rinse couldnt get rid of it all. The boxes dont explainthat - they say to fill the cups completely which is almost always a terrible idea. Youdbe surprised how little you actually need. I really appreciate being able to fiddle with this (and Ive discovered I only need to fill the cup up about half-way pretty much no matterwhat Im cleaning) but your brain may vary. Detergent packs force a one-size-fits-all amount of detergent on you which very much rubs me the wrong way, but it usually works andthere are many people who would prefer that. Those four tips: look for filters and clean them, run thekitchen tap until the water's hot before you start the machine, use the detergent dispenser and close the lid, and finally consider using a basic detergent product and add a little pre-wash detergent, are what I consider the most important things to try. I have used some astoundingly cheap dishwashersin my time including the gnarliest landlord special Ive ever encountered - that thing didnt even havea sprayer for its top rack, and boy was it loud. But it cleaned everything just fine and with Walmart brand detergent! The only thing I can attribute my seemingly perfect dishwasherscorecard to is actually putting detergent in both places all those machines expected it to go and alwaysrunning the kitchen tap until it's hot before I started the cycle. Now we've blown past the 20 minute mark and this video is supposed to be more shareable than the others so Ill finish up with a lightning round of othertips you might try. If none of what Ive gone over seems to be helping, try a dishwasher cleaningproduct before you give up. Limescale and other forms of buildup can clog the sprayer nozzles or makethe pump less effective, and many products are available which help to get rid of those deposits. Im partial to products like this which come in a bottle: you insert them upside-down and awax plug holds the product back until the water is hot enough to melt it. When I use these, Iactually dont run the water hot first to make sure the plug doesnt melt during the pre-wash, and I use the machines tough setting with the high-temp wash option selected. Ive used boththis Glisten product and Finishs version of a similar thing and find them to be great. Note theFinish product has a heavy perfume which lingers through several washes. I like that but it maybother others so be aware of that. You can also use a product like Lemishine which is just powdered citric acid. If adeep cleaning of your dishwasher still doesnt fix things, your dishwasher likely has a worn out pumpimpeller or something else is mechanically wrong, or, you may have the rare actually-bad dishwashermodel, and might just have to replace it. If your dishwashers detergent dispenser is broken and thats why you arent using it, first - you might try your hand at replacing it if you feelup to it. Replacement parts are often available, and this is YouTube! Im sure there are manyguides out there, possibly for your specific dishwasher. Though I wont be endorsing any ofthem. But even without a functional dispenser, your dishwasher may be able to work with adifferent cycle. Express or Eco cycles often dont do a pre-wash fill and open the dispenserright away. Those are typically options for a faster wash with the trade-off of reducedeffectiveness. I dont know what dishwasher you have, but you can listen out for it draining and determine how long it spends with each fill. If some cycles begin with it spending 30 or 40minutes with the same water, those will be what you want. But if your dispenser works, the normalcycle (or Auto cycle) is probably what you want to use day to day. Speaking of cycles, though, you shouldnt beafraid to try the other cycles and options available to you. The tough settingsdont make the washing action stronger, they just make it go on longer and might getthe water hotter. So give it a try. If you have a high-temperature wash option that might be goodto try, too, though I will say that in my experience using it can exacerbate hard water deposits in somesituations. Same goes with the sanitize option - I really only use that if theres somethingin the dishwasher that I feel might need it. Next - rinse aids. Use them. This isnt a scam,and most dishwashers have a rinse aid dispenser right next to the detergent dispenser. Itllsquirt a little bit of this stuff out in the final rinse, and all that it is is a very mild surfactant which reducesthe surface tension of water, causing it to form a thin film which easily evaporates without leavingwater spots. This is particularly helpful to use if you have hard water, and many machines allow you tovary how much rinse aid it dispenses - youll need more the harder your water is. This stuff is sosimple theres no need to go name-brand. Just get the cheap stuff. And, to European viewers, manyof your dishwashers have built-in water softeners and require dishwasher salt. So make sure yagot that on hand and fill it up if you need to. If you arent able to find powders or gels inyour area, or they pose a challenge for you to use for whatever reason, I would recommendtrying the cheapest store-brand dishwasher tablets or pods you can find. You may verywell find they work great! And if they dont, try mimicking what you can do with powder and gel byputting one in the dispenser and another directly into the tub. Pods are quite concentrated sothat runs the risk of it leaving a residue, but its something to try if your dishwasher isntthat great. I honestly wish detergent people would make a two-section pod with a removable babypod for use in the pre-wash. I probably still wouldnt use that because I find powder in a box with a spout to be plenty convenient already, but that feels like a useful option. Oh, andin case you might find using this box difficult, you might try emptying it into a storagecontainer you can use a scoop with. That might also help if you live somewhere very damp and powder will cake up on you (but, not for nothing, I never have that problem here in the Midwest and I keep this under the sink). And lastly, I didnt really want to go here because its the source of strife for many a family, but make sure youre loadingthe dishes correctly. The sprayers are below the racks so the dirty surfacesshould be facing down. Additionally, since the sprayers rotate around the center ofthe machine, the dirty surfaces of vertical objects like plates should ideallyface inward. When Im loading it, the left-hand side looks like this, andright of the center-line it looks like that. Also be sure things arent bunching together and blocking their neighbors from being hit by the sprayers, and - this is important - make sure those sprayer armscan spin freely. Tall items in the bottom rack can stop the top racks sprayer fromspinning, and thats not good. A whole lot of stuff will get hardly any water if itstays in one place throughout the cycle. The top rack is often adjustable and can beraised up to minimize this so if stuff on the top rack is often dirty for you, give that atry. And be mindful that on either rack, theres less washing action at the cornersbecause its a square on top of a circle, so if youre washing something thats really dirty, youll want to keep it closer to the center. And I think thats it. I want to reiterate that ifyoure not having problems with your dishwasher, you dont have to change your habits (though you're probably not watching this). But, gosh, Idreally like more people to just buy plain powder because it feels like this is an endangeredspecies. My local Walmart keeps just a single slot of shelf space for this stuff and theyreoften out. I'm to the point of checking for it every time I stop in for whatever random thingbrings me to Walmart. And while I dont want to say pods dont work (clearly they do formany people) the feedback from the last videos was amazing. Many people reported that theirdishwashers were cleaning like never before and all thanks to trying cheap detergent and using it as their machine expects. Im reasonably sure youll see many comments like that below thisvideo. Your dishwasher is responsible for 99% of the work. Detergents are necessary, ofcourse, but its just soap. And I for one think that luxury soap products which go into a machine and dont deliver any kind of unique experience but perhaps a vague hint of fragrance are silly. Thanks for watching, and heres to clean dishes!",
    "transcript_keywords": [
        "water",
        "dishwasher",
        "detergent",
        "hot water",
        "hot",
        "water inside",
        "dishwasher detergent",
        "detergent dispenser",
        "clean water",
        "fill",
        "dispenser",
        "clean",
        "dishwashers detergent dispenser",
        "machine",
        "wash water",
        "water hot",
        "time",
        "stuff",
        "hard water",
        "prewash"
    ],
    "transcript_entity_values": [
        "theFinish",
        "4.2 gallons",
        "Iuse",
        "1",
        "thedishes",
        "30",
        "99%",
        "ASTERISK",
        "North America",
        "dishwasherat",
        "two",
        "about half",
        "hose",
        "10minutes",
        "3",
        "European",
        "Iactually",
        "2",
        "Idreally",
        "Enzymes",
        "Soif",
        "North Americans",
        "20 minute",
        "YouTube",
        "Finish Ultimate",
        "about 3 degrees Celsius",
        "only a few gallons",
        "waterat",
        "North American",
        "months",
        "Youdbe",
        "Limescale",
        "Finishs",
        "the next morning",
        "16 liters",
        "first",
        "one",
        "4",
        "four",
        "MainWash",
        "3.8 liters",
        "the end of the fourth or fifth",
        "a few years ago",
        "One",
        "just a few seconds",
        "800W",
        "armscan",
        "more than an hour",
        "First",
        "Midwest",
        "second",
        "10 minutes",
        "CycleSync",
        "Alfredo",
        "minutes",
        "Walmart",
        "three",
        "Lemishine"
    ],
    "transcript_entity_types": [
        "NORP",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "NORP",
        "TIME",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "NORP",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "NORP",
        "TIME",
        "ORDINAL",
        "LOC",
        "ORDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.11244431883096695,
        -0.10757026076316833,
        0.11018628627061844,
        -0.06952271610498428,
        -0.018280765041708946,
        -0.02375217340886593,
        -0.03158381208777428,
        0.012720250524580479,
        -0.06587136536836624,
        -0.02341473661363125,
        -0.03247574716806412,
        0.012586372904479504,
        -0.04717760160565376,
        0.025100944563746452,
        -0.05937247350811958,
        -0.00910962838679552,
        0.00782083161175251,
        -0.013918393291532993,
        -0.04584255442023277,
        -0.04745033383369446,
        0.06183065474033356,
        -0.11353220790624619,
        -0.008760777302086353,
        -0.0629575252532959,
        0.003482598112896085,
        0.03572766110301018,
        0.029646603390574455,
        -0.033369503915309906,
        -0.07487013936042786,
        0.009967128746211529,
        0.006869276519864798,
        0.03149675205349922,
        -0.048044104129076004,
        -0.05151405930519104,
        -0.06277959048748016,
        -0.024892020970582962,
        0.02512962371110916,
        0.010107972659170628,
        0.04906364902853966,
        -0.0016897449968382716,
        0.05677546188235283,
        -0.05734112113714218,
        -0.021390622481703758,
        0.011486956849694252,
        0.0025803551543504,
        0.01851877011358738,
        -0.01593184657394886,
        -0.015467662364244461,
        0.05826343223452568,
        -0.03677036985754967,
        -0.058937203139066696,
        0.002266198629513383,
        0.1289944350719452,
        -0.02684829756617546,
        -0.014963526278734207,
        -0.007685063872486353,
        0.03160155937075615,
        -0.09033408015966415,
        0.016909562051296234,
        0.01564515009522438,
        0.04376597702503204,
        -0.002242541639134288,
        -0.08520954847335815,
        0.051447544246912,
        0.006233686581254005,
        0.025303171947598457,
        0.0466776080429554,
        0.1404464989900589,
        -0.016452757641673088,
        -0.01567549630999565,
        -0.09695577621459961,
        0.08162427693605423,
        0.07111681997776031,
        0.08721015602350235,
        0.06930987536907196,
        -0.04753399267792702,
        0.03696366399526596,
        -0.08356458693742752,
        -0.057594917714595795,
        -0.006325503345578909,
        -0.01850595884025097,
        0.005313207395374775,
        -0.005046244245022535,
        0.05371943488717079,
        0.019436122849583626,
        0.032998617738485336,
        -0.014176882803440094,
        -0.06385377049446106,
        0.03540295362472534,
        -0.02236594446003437,
        -0.0389949306845665,
        0.0672871321439743,
        0.014629967510700226,
        -0.13023805618286133,
        0.03465607762336731,
        0.075994573533535,
        -0.06077474728226662,
        0.06902836263179779,
        -0.029215127229690552,
        0.005563120357692242,
        -0.099440798163414,
        0.012250587344169617,
        -0.023578133434057236,
        -0.04912919923663139,
        0.04951285943388939,
        -0.009031331166625023,
        0.023758068680763245,
        0.0617801770567894,
        0.10137587040662766,
        0.012741252779960632,
        -0.0009397829417139292,
        0.08465784788131714,
        -0.00843837484717369,
        0.003325996920466423,
        0.01686697266995907,
        -0.007894710637629032,
        0.015939323231577873,
        0.01670219376683235,
        0.013404847122728825,
        -0.015884995460510254,
        0.02023433707654476,
        -0.03798776492476463,
        -0.09490928798913956,
        -0.03719191625714302,
        -0.008661558851599693,
        0.04163569211959839,
        0.0369231216609478,
        6.286288852860259e-33,
        0.017767198383808136,
        0.0778319239616394,
        0.043099403381347656,
        -0.03807419165968895,
        0.01565983146429062,
        -0.07638082653284073,
        -0.03932313621044159,
        0.07105778902769089,
        -0.018997786566615105,
        0.08275805413722992,
        0.05540551617741585,
        -0.03309529274702072,
        -0.10818103700876236,
        0.006113078445196152,
        0.027575107291340828,
        -0.02757633477449417,
        -0.002554472768679261,
        -0.0059065427631139755,
        -0.08208335936069489,
        -0.007289878558367491,
        -0.002199818380177021,
        -0.009069956839084625,
        -0.0035295356065034866,
        -0.010810491628944874,
        -0.03950861096382141,
        -0.038548145443201065,
        0.029887497425079346,
        0.025716258212924004,
        0.06736695021390915,
        -0.0014400571817532182,
        -0.012500898912549019,
        -0.012306859716773033,
        -0.032339297235012054,
        0.0406765379011631,
        -0.08754117786884308,
        -0.07548467814922333,
        -0.10029040277004242,
        -0.05884420871734619,
        0.016987642273306847,
        -0.09638138115406036,
        -0.03680797666311264,
        0.042313121259212494,
        -0.047116491943597794,
        0.028549009934067726,
        -0.01407739706337452,
        -0.034841254353523254,
        -0.03606587275862694,
        0.051424380391836166,
        0.05203835293650627,
        0.07538346201181412,
        0.0456119067966938,
        0.02144734188914299,
        -0.043059561401605606,
        -0.020431431010365486,
        -0.054783694446086884,
        0.02803901955485344,
        0.008522680029273033,
        -0.0829656794667244,
        0.00024437220417894423,
        0.06632451713085175,
        0.01979459822177887,
        -0.042933251708745956,
        -0.01215886976569891,
        0.020491397008299828,
        -0.0007947484264150262,
        0.06957544386386871,
        0.052887048572301865,
        0.03484104201197624,
        0.03413759171962738,
        0.024759920313954353,
        -0.07217272371053696,
        -0.0012580904876813293,
        -0.1016061007976532,
        0.028535090386867523,
        0.05586015805602074,
        0.06697726994752884,
        0.062363170087337494,
        0.041658975183963776,
        -0.008991006761789322,
        0.03133092820644379,
        0.03335203602910042,
        -0.05679222568869591,
        -0.022501127794384956,
        0.02924755960702896,
        -0.060697972774505615,
        0.025071047246456146,
        0.03566201403737068,
        -0.009417425841093063,
        0.1007266417145729,
        -0.030842719599604607,
        0.07108102738857269,
        -0.01904536783695221,
        -0.012930522672832012,
        0.009638448245823383,
        -0.03915951028466225,
        -7.039809384412147e-33,
        0.060307346284389496,
        0.017781052738428116,
        -0.01881338469684124,
        0.012796820141375065,
        -0.04187575727701187,
        -0.0513891763985157,
        0.009916655719280243,
        0.021395523101091385,
        0.02479802817106247,
        -0.04028875008225441,
        -0.022804591804742813,
        0.040465548634529114,
        -0.05777958035469055,
        -0.033455345779657364,
        -0.090390145778656,
        0.08534888923168182,
        0.06617632508277893,
        -0.010855636559426785,
        -0.0781116932630539,
        -0.0730007067322731,
        0.02458072640001774,
        0.13130536675453186,
        0.028193814679980278,
        0.02901124395430088,
        -0.07645062357187271,
        -0.03968759626150131,
        -0.021661484614014626,
        0.09175998717546463,
        0.014749370515346527,
        0.008045793510973454,
        0.008438422344624996,
        0.039481185376644135,
        0.11242616921663284,
        -0.01378017757087946,
        0.0054191043600440025,
        0.06615884602069855,
        0.06691206246614456,
        -0.03582543507218361,
        0.0695924460887909,
        -0.0372764989733696,
        0.07364203780889511,
        -0.033013444393873215,
        -0.0716734305024147,
        -0.038121312856674194,
        -0.059375181794166565,
        0.05159799009561539,
        -0.11737889796495438,
        -0.030658993870019913,
        -0.06998027116060257,
        0.10495269298553467,
        -0.028399545699357986,
        0.01147101353853941,
        0.009670272469520569,
        -0.08046511560678482,
        -0.009030327200889587,
        0.022232661023736,
        0.10345011204481125,
        -0.08695680648088455,
        0.026674069464206696,
        0.011770425364375114,
        0.01538140419870615,
        0.08241842687129974,
        -0.010141738690435886,
        0.0209486186504364,
        -0.009087243117392063,
        -0.049772296100854874,
        0.07618924975395203,
        0.026934707537293434,
        0.004105198197066784,
        -0.03449629619717598,
        -0.07363247871398926,
        0.016146784648299217,
        0.02108743041753769,
        -0.07816021889448166,
        -0.009614991955459118,
        -0.08386023342609406,
        -0.042412955313920975,
        -0.047743070870637894,
        -0.1094435527920723,
        0.04019475355744362,
        0.023591211065649986,
        -0.0386253222823143,
        -0.056368134915828705,
        -0.0006273313774727285,
        -0.036511629819869995,
        0.03137774392962456,
        0.058411650359630585,
        0.02684931270778179,
        0.016920264810323715,
        0.0823853388428688,
        -0.07703346014022827,
        0.025120025500655174,
        0.021754508838057518,
        0.09489738941192627,
        0.05733434855937958,
        -5.551653359248121e-08,
        0.06972228735685349,
        -0.020339326933026314,
        0.08779267221689224,
        0.07337460666894913,
        -0.03038998879492283,
        0.014303850010037422,
        -0.10036919265985489,
        0.06659609824419022,
        -0.06308543682098389,
        -0.007966248318552971,
        -0.018409980461001396,
        0.06668953597545624,
        -0.060551051050424576,
        -0.01712980680167675,
        0.008153225295245647,
        -0.04155273735523224,
        0.04445116966962814,
        -0.023891575634479523,
        -0.06072410196065903,
        -0.041224438697099686,
        0.037472840398550034,
        -0.012289460748434067,
        0.07798654586076736,
        0.029741007834672928,
        -0.0012832826469093561,
        0.047594811767339706,
        -0.01654059626162052,
        0.09157799929380417,
        0.0006915678386576474,
        -0.018743954598903656,
        -0.002341985469684005,
        0.024709951132535934,
        -0.05062277615070343,
        0.018501343205571175,
        -0.014657018706202507,
        0.04740503802895546,
        -0.06758513301610947,
        -0.05356072261929512,
        0.036978207528591156,
        0.06057373061776161,
        -0.002341193612664938,
        0.06849998235702515,
        -0.11784867942333221,
        0.08762826770544052,
        -0.031705331057310104,
        -0.04717560485005379,
        -0.048235077410936356,
        -0.019473101943731308,
        0.05414595082402229,
        0.025880057364702225,
        0.0952087864279747,
        0.05393082648515701,
        0.02325635962188244,
        -0.013262785971164703,
        -0.0380658395588398,
        0.03347582370042801,
        -0.02306060492992401,
        0.004784720949828625,
        0.051866304129362106,
        0.06753969937562943,
        0.07857995480298996,
        -0.030136529356241226,
        -0.03576961159706116,
        -0.023736340925097466
    ]
}