{
    "id": "JHVPSjzOYx4",
    "title": "iPhone 12 Pro Max vs. $2,500 Blackmagic Camera - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-11-17T16:55:57Z",
    "video_url": "https://www.youtube.com/watch?v=JHVPSjzOYx4",
    "category": "Science & Technology",
    "tags": [
        "iPhone 12 Pro Max vs. $2500 Blackmagic Camera - Krazy Ken's Tech Talk",
        "iPhone 12 Pro Max",
        "Apple",
        "iOS",
        "iPhone Camera",
        "Blackmagic Pocket Cinema Camera 6K",
        "BMPCC6K",
        "Blackmagic Camera",
        "iPhone Camera Comparison",
        "Final Cut Pro",
        "FCP X",
        "Dolby Vision",
        "HDR",
        "High Dynamic Range",
        "10-Bit Video",
        "10-Bit Color",
        "Canon",
        "Low-Light",
        "Sensor-Shift Stabilization",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan",
        "Tech"
    ],
    "views": 14826,
    "likes": 762,
    "comments_count": 91,
    "description": "How \"pro\" is the iPhone 12 Pro Max camera? Well, to find out, Krazy Ken pits it against a $2,000 Blackmagic Pocket Cinema Camera 6K with a ~$500 kit zoom lens. Let's see how well the iPhone holds up!  iPhone 12 Pro detailed camera test    Download our epic wallpapers   Support our channel and get cool stuff   Subscribe for more tech videos!    Zoom H4n Audio Recorder   My Gear Recommendations    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - iPhone 12 Pro Max vs. $2,500 Blackmagic Camera   Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtu.be/Gk1Ob1IkM4E",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "https://amzn.to/38QijD2",
        "http://amzn.to/2hmJhHU",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(beep) (waves crashing) - [Krazy Ken] (beep) holy (beep) (laughing) (beep) Oh, that's in the shoes. - [Man] Yeah (indistinct) - ow - I should have moved a little bit quicker than that. (electronic music) - Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And today I'm going to pit the iPhone 12 Pro Max with Apple's biggest and best camera system to date against my daily driver camera which is a Blackmagic Pocket Cinema 6K. And for the sake of this experiment, I'll keep it in 4K mode. So, don't worry about that. Since Apple puts the word \"pro\" in their phones and they talk about having a pro camera system and stuff like that. I wanted to see how pro this thing really is. Now, you're probably thinking this is an unfair comparison. No (beep) Sherlock. Yes, of course it's unfair. That's the idea. Different devices are going to do things differently. There's pros and cons to everything. There's some things that the iPhone does right out of the box that my Blackmagic can't do. (scenic music) But in the end, everybody is different and you're going to need to find out what works best for your situation and for the equipment you need. And I'm here to help you do that. So, let's go out and shoot some stuff. (whooshing) (upbeat scenic music) So before I get into the weak points of the iPhone 12 Pro Max's camera, let's talk about the good stuff. (whooshing) Starting with stabilization. The 12 Pro Max uses sensor-shift stabilization, as opposed to the optical stabilization in the 12 Pro. Honestly, I didn't notice a difference between the two, but in the end, the results are amazing. And since my Blackmagic doesn't have any kind of stabilization built in, I would need to spend money on a motorized gimbal, and I'd have to make it work each time. Cause you have to balance those. You have to use counterweights and other things to actually get them balanced and make them work right. But in the iPhone, the stabilization is already built in and you never have to worry about calibrating it or balancing it. It's pretty incredible. And if you want to go the extra mile, you can combine the slow motion and the sensor-shift stabilization with a motorized gimbal. And now you really have a steady shot. And you're set. Now let's talk about high dynamic range video, or HDR video. So my Blackmagic can shoot up to 13 stops of dynamic range at its native ISO. But it does that in a color space that's more limited. And it can't practically support an HDR transfer function like what the iPhone shoots in. So you can get all that dynamic range, but it's still outputted into standard dynamic range video. It wouldn't be something you would play on an HDR TV to reap the benefits of those higher brightness values. This is kind of a rabbit hole, but I already jumped down it a couple of times in these other episodes. So if you want to learn more about HDR and Dolby Vision on the iPhone, I highly recommend checking those out. So with the iPhone's integration of HDR, you can achieve a lot of brightness, and you can also record in 10-bit color. And even if you don't want to publish HDR, let's say you're shooting the HDR on here and you're going to edit it in Final Cut Pro. You don't need to deliver in HDR. You have so much latitude to work with, so you can still deliver in standard dynamic range, but you can get creative with your color grading, or if you want, you can just do a simple one-click conversion where everything gets tone mapped to standard dynamic range, and then it's compatible with standard dynamic playback. But if you ever need to go back to the HDR information, you can do so. So it's pretty cool that you can capture an HDR video with an HDR transfer function, on a device that's in your pocket. My Blackmagic can't do that. Also, I do want to say the overall quality is pretty good. Even when converting down to standard dynamic range. Earlier, I shot, in a controlled and lit environment, this studio, with the iPhone 12 Pro. And to most people, especially if you're not comparing side-by-side. You wouldn't be able to tell the difference between me in my studio being filmed on an iPhone 12 Pro compared to a Blackmagic. So, the quality is pretty nice. (whooshing) Okay, so let's talk about what waterproofness. Now, I love my Blackmagic, but it has vents on it. So it's not weather-sealed. So I don't really want to take it out in the rain when there's harsher conditions, like what we just filmed in. Its really cold. (whooshing) But hey, sometimes I still chance it because I like to live dangerously, and take bubble baths. But mostly the dangerously thing. But overall, I wouldn't want to take it out in the rain, but with an iPhone, it's rated for four meters, for 30 minutes, under water. So there's a lot more peace of mind using this device in harsher conditions to get that shot. You don't have to worry about it getting wet and breaking. So stabilization, HDR, and waterproofness are the three things I think the iPhone 12 Pro Max does really well. Think about the person who just wants to start their own YouTube channel or something. You can get away easily by using this as your main camera. I would still pair it with, you know, maybe a separate audio recording system and some lighting. But like I said earlier, there are some weak points. So, let's go ahead and dive into those. (whooshing) Low-light is the bane of the iPhone camera. In fact, it's the bane of many camera systems. Thankfully, the low-light performance in the iPhone is always improving, like what the larger sensor on the iPhone 12 Pro Max. But in the end, it's still a weak link. There's lots of splotching noise in the low-light areas of footage. So, be warned about that. The computational features on the iPhone will automatically try to suppress it, but in the end, you're still gonna see some artifacts and some noise. (whooshing) Another thing that bugs me on the iPhone is the lack of natural motion blur. Because the iPhone's aperture can't close down and there's no neutral density filters to keep out excess light. The shutter speed has to increase to keep the shot from being overexposed. But in doing so, we lose that comfortable motion blur we usually see, especially when referring to the traditional film look. And yes, you can use third party apps like FiLMiC to control the shutter speed. And you can use other accessories like filters to help keep excess light out. But there's certain trade-offs. As of right now, FiLMiC does not support 10-bit color or Dolby Vision. So if you use that third-party app, as opposed to the stock camera app, you're going to lose those big features. So, just keep that in mind, it's all trade-offs. (whooshing) That even experienced frame drops getting baked into the actual footage. In fact, my friend's iPhone 12 Pro Max also experienced the same issue. Frame drops were baked into the recording. So that's something Apple needs to patch. Up next, is depth of field. That's the effect that creates those big, beautiful, blurry backgrounds that everybody loves. So, on the iPhone, it's getting better, but it's still not going to replace what a real camera can do. But, there's some things you can do. If you shoot with a telephoto lens, mathematically, it just works out with physics and everything, where you can get a nice shallow background. Especially if your background is really far away from your subject. The more depth you have, the more you can get that background to look nice and blurry. Again, with a higher focal length, you can get that, it's really cool. But in the end, it's not going to be as good as what you can get on a normal camera. And that's because cameras can have interchangeable lenses and different lenses, especially with bigger apertures and longer focal lengths, can create those bigger, more beautiful bouquets circles and nice shallow depth of field. But the other reason is the sensors on these cameras are massive and the bigger the sensor, the more creative freedom the photographer or the videographer has to create that big, beautiful blur that everybody likes. So, again on the iPhone, it's getting better, but as of right now, it's really not going to be able to replace what a camera can do. However, maybe one day we'll get some great, super high quality artificial depth of field. Kind of like what we have with portrait mode for photos on the iPhone. Maybe we'll have that for videos soon. So now let's move on to the last two traits I want to cover. Detail preservation and highlight roll-off. One thing I've never really been satisfied with is the fine details. You'll usually see unusual softness or splotchiness, or maybe because of the software, certain compression artifacts show up and the fine details in those small areas usually don't preserve very well. Whereas with the Blackmagic, the details look stunning without being overly processed-looking. Because there's not a lot of computational stuff happening on the Blackmagic compared to an iPhone. And you also might experience loss of detail with certain lighting situations, even with the HDR features enabled. For example, in this kind of exaggerated lighting setting, you'll see the iPhone's footage doesn't preserve the smooth gradation on my face with that lighting. The highlight roll-off isn't as smooth as what the black magic can capture. So circling back, how pro is the iPhone 12 Pro's and Pro Max's camera system? Well, it's getting there. It's impressive to see how close they get to an actual camera every year. But to me personally, I would not replace my pro equipment with an iPhone 12 Pro or Pro Max. But, I will gladly use it as a compliment. If I need to get that steady shot, I will gladly use this. Or if I just need to quickly capture that moment in time, because in the end, the best camera is the one you have with you. And since this fits in my pocket, it's going to be with me a lot more than my Blackmagic. But that's just me, everybody is different. Let's say I already have an iPhone and I want to start a YouTube channel. Like I said earlier, you already have a great camera system here and you can easily get away by just using this. And I would say pair it with some good lighting, you know, good tripod, doesn't have to be crazy expensive and some good audio solution. Actually don't skimp on the audio, because I think sound is way more important than picture. So don't skimp on that. And if you need an external recorder to go with your iPhone to capture super high quality audio, get the Zoom H4N. I used to use this a bunch. It's great. And you can just plug XLR mics into here. Super high quality sound. So go ahead and grab one of those. And if you need it quick, I have a link in the description. I actually have other gear recommendations in the description as well, so go ahead and check those out. But ultimately, it doesn't matter a lot what tools you use, cause it's about the skills, right? It's about the person using the tools. It's not about the tools themselves. So let me know what you think about the iPhone 12 Pro and the Pro Max's camera system. Feel free to write a comment down below. And if you have any questions, if you're on the fence about purchasing any of these things, or you need other camera equipment to go with them, just let me know. I'll do my best to answer that stuff for you. Cause I've been there, done that, I'd love to help. And if you'd like to help fund the future of the Computer Clan, plus get some awesome perks along the way, feel free to pledge to my Patreon. Thank you in advance for your support. And hey, if you liked this episode, you know what to do. Thanks for sticking with me, catch the crazy and pass it on. (upbeat music) (beep)",
    "transcript_keywords": [
        "Pro Max",
        "Pro Max camera",
        "Pro",
        "iPhone",
        "HDR",
        "camera",
        "Blackmagic",
        "Max",
        "Max camera",
        "Max camera system",
        "dynamic range",
        "pro camera system",
        "camera system",
        "dynamic",
        "standard dynamic range",
        "pro camera",
        "HDR video",
        "standard dynamic",
        "stabilization",
        "range"
    ],
    "transcript_entity_values": [
        "13",
        "Blackmagic",
        "one day",
        "Pro's",
        "third",
        "daily",
        "two",
        "Apple",
        "Pro Max",
        "Patreon",
        "today",
        "YouTube",
        "Krazy Ken",
        "Final Cut Pro",
        "Pro Max",
        "12",
        "four meters",
        "30 minutes",
        "the Zoom H4N.",
        "4",
        "one",
        "Max",
        "10",
        "One",
        "XLR",
        "iPhone",
        "Pro Max's",
        "FiLMiC",
        "the Computer Clan",
        "Dolby Vision",
        "three"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.05556575953960419,
        0.0013575375778600574,
        -0.012417186982929707,
        -0.15143601596355438,
        0.0005855605122633278,
        0.019663130864501,
        0.0489690862596035,
        0.07492298632860184,
        -0.004436587914824486,
        0.03543388098478317,
        0.029866617172956467,
        0.02870851382613182,
        0.010744806379079819,
        -0.017259227111935616,
        -0.0187509935349226,
        0.0026256872806698084,
        0.15100286900997162,
        -0.04795943200588226,
        -0.0869288221001625,
        -0.012626183219254017,
        -0.014796514995396137,
        -0.10363275557756424,
        0.1162060871720314,
        -0.008608563803136349,
        0.10493087023496628,
        0.017238276079297066,
        -0.07238377630710602,
        -0.016954991966485977,
        0.01069438736885786,
        0.0038288217037916183,
        -0.035305581986904144,
        0.01733165793120861,
        0.025994885712862015,
        0.029970701783895493,
        0.06287150830030441,
        -0.1035161241889,
        -0.02491132728755474,
        0.00486628757789731,
        -0.08158676326274872,
        -0.019256919622421265,
        -0.03613714128732681,
        0.06261605024337769,
        -0.07321496307849884,
        0.05965263769030571,
        0.020701827481389046,
        0.016425801441073418,
        0.09581919759511948,
        -0.01619691215455532,
        0.0028148789424449205,
        -0.012385332025587559,
        -0.015300735831260681,
        0.010936298407614231,
        -0.0028552634175866842,
        0.0727352425456047,
        -0.025233644992113113,
        -0.007385446690022945,
        -0.07727787643671036,
        -0.023660432547330856,
        0.10768898576498032,
        0.016017161309719086,
        -0.02942504733800888,
        -0.02348531223833561,
        0.006168399006128311,
        0.03845665231347084,
        0.02199019491672516,
        -0.04527993127703667,
        -0.0017985772574320436,
        0.07911913096904755,
        0.016597915440797806,
        -0.014344966970384121,
        -0.05738069489598274,
        0.07555966824293137,
        0.0754527747631073,
        0.014424871653318405,
        -0.006442584563046694,
        -0.0015809433534741402,
        0.000716249574907124,
        -0.06917037814855576,
        -0.04390028864145279,
        -0.04563096910715103,
        0.09686532616615295,
        -0.07225024700164795,
        -0.04028566926717758,
        -0.059594009071588516,
        0.019381524994969368,
        -0.026009608060121536,
        -0.02067619375884533,
        0.012762270867824554,
        -0.022801371291279793,
        -0.1045173704624176,
        -0.04607423394918442,
        0.04033233970403671,
        -0.009430039674043655,
        -0.08080931007862091,
        -0.05570017173886299,
        0.005429836921393871,
        -0.05616696923971176,
        -0.09996280074119568,
        0.006913305725902319,
        0.045096080750226974,
        0.03849830478429794,
        -0.04031004384160042,
        0.018232474103569984,
        -0.10745546221733093,
        0.03048877976834774,
        -0.04576755315065384,
        -0.010448618791997433,
        0.05366653576493263,
        0.07211646437644958,
        0.1181696280837059,
        0.0016736638499423862,
        0.06369145959615707,
        -0.0496964268386364,
        -0.024203332141041756,
        0.11373326182365417,
        0.08909382671117783,
        -0.06504569202661514,
        0.07094386965036392,
        0.1326708048582077,
        -0.029424335807561874,
        -0.009138120338320732,
        -0.032705944031476974,
        -0.060794755816459656,
        0.013256079517304897,
        0.00032023602398112416,
        0.00454868096858263,
        -0.016243508085608482,
        5.057424854458732e-33,
        0.035009659826755524,
        0.12687605619430542,
        -0.01632460579276085,
        -0.0012307632714509964,
        0.018081841990351677,
        -0.03782910108566284,
        -0.007960590533912182,
        0.051259055733680725,
        -0.058731578290462494,
        0.0056823017075657845,
        -0.0045670620165765285,
        -0.03275409713387489,
        -0.06386201083660126,
        0.013135656714439392,
        0.03389701619744301,
        -0.03503531590104103,
        -0.09971500188112259,
        -0.04318422079086304,
        0.01801886036992073,
        0.03807683661580086,
        -0.01100623793900013,
        -0.03627646341919899,
        0.00488204974681139,
        0.09044009447097778,
        -0.011336042545735836,
        0.02246597595512867,
        0.058732397854328156,
        0.012180067598819733,
        0.08855895698070526,
        0.018842283636331558,
        -0.12910492718219757,
        0.024137800559401512,
        0.052637118846178055,
        -0.04069017618894577,
        -0.016511479392647743,
        -0.020127156749367714,
        -0.02809925749897957,
        -0.05895918235182762,
        0.033757396042346954,
        -0.045976392924785614,
        -0.06682243198156357,
        0.04932845011353493,
        -0.11484511196613312,
        -0.062408532947301865,
        0.027396872639656067,
        0.017010772600769997,
        0.019967423751950264,
        0.0662987157702446,
        -0.009731910191476345,
        0.010654491372406483,
        0.004175981041043997,
        -0.05832531675696373,
        -0.018717767670750618,
        -0.03605061396956444,
        -0.05229290947318077,
        0.04071749001741409,
        0.05907777324318886,
        -0.059314120560884476,
        0.067629374563694,
        0.05136323347687721,
        0.0104190893471241,
        0.004099710378795862,
        -0.038536619395017624,
        0.06763572245836258,
        -0.08064176142215729,
        0.03459062799811363,
        -0.0026522562839090824,
        0.0778791680932045,
        -0.04789954051375389,
        0.09264817088842392,
        -0.0620640330016613,
        0.0376601405441761,
        0.027961811050772667,
        -0.058573901653289795,
        0.05072678253054619,
        0.018943559378385544,
        -0.07902389019727707,
        -0.03653087094426155,
        -0.041501160711050034,
        0.11209214478731155,
        -0.0808737576007843,
        0.05877025052905083,
        0.024188708513975143,
        0.06995315104722977,
        -0.010216165333986282,
        -0.020245743915438652,
        -0.015702536329627037,
        0.01361118070781231,
        -0.002629790687933564,
        0.06238997355103493,
        -0.00173472729511559,
        -0.005312627647072077,
        -0.06416883319616318,
        0.03164437413215637,
        -0.034085869789123535,
        -5.66634782591597e-33,
        0.04966604337096214,
        0.004800441209226847,
        -0.008788816630840302,
        0.014832830987870693,
        0.06867381930351257,
        -0.018563035875558853,
        0.06032026186585426,
        0.05705660581588745,
        0.019367819651961327,
        -0.01635214313864708,
        0.03543948009610176,
        0.02276221290230751,
        -0.060188475996255875,
        0.05989934876561165,
        -0.04452027380466461,
        -0.08858650922775269,
        -0.07983444631099701,
        -0.009609256871044636,
        0.062329526990652084,
        0.002324070781469345,
        0.09070316702127457,
        0.01598729006946087,
        0.003236486343666911,
        0.07231871783733368,
        -0.04820147156715393,
        0.01479736715555191,
        -0.015492969192564487,
        0.07738901674747467,
        0.03290440887212753,
        -0.01974920928478241,
        0.09124859422445297,
        -0.09419342875480652,
        -0.05285082012414932,
        -0.023089345544576645,
        0.014604886062443256,
        0.05211717635393143,
        0.038564324378967285,
        -0.03407623618841171,
        -0.057247888296842575,
        -0.020121688023209572,
        0.08158870041370392,
        0.05278521776199341,
        -0.007759829983115196,
        -0.0569254532456398,
        -0.0013129104627296329,
        -0.023152891546487808,
        -0.023051992058753967,
        0.041431400924921036,
        0.04476206377148628,
        0.0001506695116404444,
        -0.004133270122110844,
        -0.004413444083184004,
        -0.009336964227259159,
        0.018277736380696297,
        -0.0764167308807373,
        -0.01580348052084446,
        0.008918396197259426,
        0.01023562066257,
        -0.0031811578664928675,
        0.0623275563120842,
        0.007592409383505583,
        0.011990879662334919,
        -0.1073259711265564,
        -0.029416577890515327,
        -0.08373952656984329,
        -0.0008005725685507059,
        0.057595159858465195,
        0.013255476951599121,
        -0.00427121901884675,
        0.0365578792989254,
        2.0651508748414926e-05,
        -0.03580611199140549,
        0.01817459799349308,
        -0.05264931917190552,
        -0.028527285903692245,
        0.07354418933391571,
        -0.02476220577955246,
        0.04692472890019417,
        0.04825633019208908,
        -0.05058252811431885,
        -0.0005013298359699547,
        0.02067592181265354,
        0.07020670175552368,
        0.08085011690855026,
        0.078708715736866,
        0.09775468707084656,
        0.016819974407553673,
        -0.024690888822078705,
        0.0037657329812645912,
        0.03535640984773636,
        -0.019564475864171982,
        -0.011554904282093048,
        -0.037209779024124146,
        0.019469015300273895,
        -0.009912648238241673,
        -5.23041521205414e-08,
        -0.021454893052577972,
        0.07275494933128357,
        0.02698877826333046,
        -0.06851736456155777,
        0.04348691180348396,
        -0.08980933576822281,
        -0.04992535337805748,
        0.06827437877655029,
        0.10850246995687485,
        -0.03537120670080185,
        0.026676351204514503,
        -0.06398381292819977,
        -0.07075392454862595,
        0.025866011157631874,
        -0.048580434173345566,
        0.024913882836699486,
        -1.4027724319021218e-05,
        0.018512742593884468,
        -0.0038308128714561462,
        -0.04210011288523674,
        -0.03237568587064743,
        -0.0016337045235559344,
        0.049864139407873154,
        -0.08089470118284225,
        -0.007371312472969294,
        0.006874969229102135,
        -0.05505784973502159,
        0.0116184176877141,
        0.05431228503584862,
        -0.02778276428580284,
        -0.04583455249667168,
        -0.014145569875836372,
        -0.05668272823095322,
        -0.05358874052762985,
        0.024477729573845863,
        -0.06563719362020493,
        -0.09734676033258438,
        -0.006729354616254568,
        0.05288100615143776,
        0.022409023717045784,
        -0.0019529212731868029,
        -0.11669478565454483,
        0.005678422283381224,
        -0.016467588022351265,
        -0.009772426448762417,
        0.02950085885822773,
        -0.026058023795485497,
        -0.11820726096630096,
        -0.009411745704710484,
        0.02938101440668106,
        -0.07133352011442184,
        -0.040792763233184814,
        -0.01997789740562439,
        -0.029520774260163307,
        0.05180130898952484,
        -0.023895125836133957,
        0.04238695651292801,
        -0.011242263950407505,
        -0.03305569663643837,
        0.027307644486427307,
        0.08078452944755554,
        -0.08449486643075943,
        -0.06952936947345734,
        0.06497015058994293
    ]
}