{
    "id": "Jib6v--UffY",
    "title": "Playstation is in Trouble",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-01-19T01:53:02Z",
    "video_url": "https://www.youtube.com/watch?v=Jib6v--UffY",
    "category": "Gaming",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "overclock",
        "overclock media",
        "playstation",
        "xbox",
        "microsoft",
        "sony",
        "blizzard",
        "Activision",
        "Bethesda",
        "candy crush"
    ],
    "views": 36089,
    "likes": 2361,
    "comments_count": 238,
    "description": "Hello and welcome back to THIS IS! Microsoft's acquisition of Activision Blizzard will have MASSIVE implications to the gaming world.   The PC is Killing PS5:  Can the Switch Keep Up?:  Why the PS5 is LOSING Money:   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/Ib8WlAfSGYo",
        "https://youtu.be/36_B1cX9z0w",
        "https://youtu.be/3ZzQ1wUJ9iA",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is we have breaking news. So breaking, so newsy, that this has had to come out of an eight month hiatus in order to talk about it, Austin. - $68.7 billion with a B. - If you haven't seen Twitter today, Microsoft has announced that they are buying Activision Blizzard for $68.7 billion. That is absolutely insane. I cannot think of a deal that's anywhere near this size. - So, for some context, when Microsoft bought Mojang, the makers of Minecraft, they spent $2.5 billion on that acquisition. When they bought Bethesda, they spent what $7 billion? - 7.5 Billion. So this deal is 10 times almost the size of buying Bethesda. That was a massive deal. We couldn't believe they spent seven and a half billion dollars on Bethesda, but now we've got Activision Blizzard, $68.7 billion. - To put that number in context. That's not far off of like Nintendo's market share. Yeah, you heard me right. Nintendo. - I, that is a number that I did not research and that just caused my brain to reboot. - When you think about bringing in, obviously you've got Blizzard, you've got franchises, like Call of Duty. I keep seeing everyone put Candy Crush up in the same category, which bothers me. - Here's the thing I don't know, have you actually looked at the numbers of Candy Crush? Candy Crush made $1.2 billion in 2020. Okay? - I'm sorry, 1.2 Billion? - To dismiss Candy Crush it's just like, it's ridiculous. - There's a tons unpack here. We can easily be here all day, but I think there's some big highlights. First and foremost is the giant disaster of a company that Activision has been really over the last six to nine months as just sort of terrible news story after terrible news story has come out. - I mean, it feels like it snow balled all that time, but like, it's been like a long steady decline for the company, the toxic workplace, all that stuff. - I think it's not a coincidence that when everything sort of really started coming to a head over the last few months, and there were a lot of people, including Phil Spencer, who said, \"Hey, we're reevaluating our relationship with Activision.\" I don't think most people took that to being, we're reevaluating our purchase of Activision, but I don't think anyone can deny that there is an enormous amount of work that Microsoft and the Activision Blizzard will have to do to clean up the toxic culture not only just in the employee side, but also in the gaming side. I mean, you think about toxic sort of fan bases. You think games like Call of Duty. You think games like Overwatch there's a lot of just toxicity here. So I think there's a big road ahead. I think Phil Spencer and Microsoft have probably some of the best credentials to take on this task. I think they, specifically Phil has done a good job of trying to make sure that inclusion and just not being toxic gamer scum is like part of the company. If anyone's going to do this, I feel like Microsoft are the company and specifically the fact that all of this is being recombined into now, Microsoft Gaming. So, Phil Spencer is now the CEO of Microsoft Gaming. Now, to be fair this acquisition is gonna take awhile. They said, it's gonna close, at some point between now and the, I think June of 2023. So obviously $68.7 billion I mean that's gonna take a while. But, that I think is probably the number one thing that I see at this end. Based on the news reports we're seeing it does seem like Bobby Kotick, the CEO of Activision Blizzard is gonna be out probably five seconds after the deal closes. - Which is the best thing for everyone involved. I mean, yeah, like it's gonna go a long way to kinda fixing the relationship with gamers. I mean, it's not an immediate fix. - It's gonna take a while. - Like it's, that is the number one step and I'm glad that they're taking it right away. - So I think that's, for me, that seems like the big story, but then you think about the ramifications for gamers, right? So, on one side you've got an enormous boon to Game Pass, I mean, it's clear that for the last several years, Microsoft is heavily investing in Game Pass. They're heavily investing in gaming. But Game Pass really feels like that's the platform. They just having to make Xboxes and PCs this sort of will. - And we've been saying this for years now, ever since Game Pass came out, we've been saying that the philosophy of Xbox is not, we want you playing a game on Xbox. We want you playing one of these games on one of our services. Now it's gonna be crazy to see how they integrate these with Game Pass, because I can't see them adding Warcraft to Game Pass. It is $15 a month for Warcraft right now and I just can't see them losing out on that much revenue because there's still millions of players of Warcraft. I do think that they should treat this acquisition differently than they treated Bethesda. So, Bethesda came out and said like, okay, like Elder Scrolls VI, that's gonna be an Xbox exclusive. All these exclusives, they said, we're gonna like, I think they need to do that. Because a lot of people have said like, okay, Xbox doesn't have marketable first party exclusive. - Sure. - And Bethesda, that was a huge way to go and say, okay, if we can have a Skyrim level game as an exclusive to Xbox that we'll sell console. Will it sell as many console as something like God of War? Probably not. But, I don't think that they should make any of these Activision things exclusive to Xbox. Maybe some of the older titles, but like, I think it'd be crazy for them to make Call of Duty an Xbox exclusive. - I don't think they're going to. Look, if you look at what they've done, they've continued to make things like Deathloop, like that's the out as a PS5 exclusive, although to be fair, that deal was signed before the actual acquisition happened. But I think, again, I come back to Minecraft. Minecraft is still available and basically every platform under the sun for good reason. There's no reason for Microsoft to pull that away. What I do think we'll be different though. Is it pretty much all of these games are gonna come into Game Pass. I mean, they even said that basically in like the announcement that they plan on. - Call of Duty should be on Game Pass, but it should also be a to be for purchase on PS5. Because here's the weird thing about it now, because there's plenty of people Call of Duty, is like the game they buy every year for their console. They're in a weird spot that Microsoft is now potentially making more money on a PS5 purchase than Sony is through games. - There will be some exclusives. There will be like, you think about the Call of Duty you think about the huge titles. Those will still be pretty much everywhere. - I'm glad you talking about titles. - More and more on Xbox. - I wanna talk about titles because Microsoft has just purchased every mascot of the PS one and PS2 era. So, Crash Bandicoot, Spyro the Dragon. - Spyro. - Earthworm Jim, they have Tony Hawk's. That whole series, they have Guitar Hero. Okay, like when's the last time there was a Guitar Hero game? I don't know. I feel like it's been awhile. - It's been a while yeah. - But like, Microsoft can bring that back and it's one of the biggest franchises in history and they have the rights to that in that now. - Microsoft has now pretty much made themselves one of the very largest gaming companies in the world. The rival really isn't Sony Nintendo anymore. It's Tencent. Now, that might not be a household name, but Tencent is one of, none of the largest companies in the world, but it is probably the biggest gaming specific company in the world. Some of the companies that Tencent owns Riot, they own 40% of Epic. They actually owned 5% of Activision Blizzard. So Tencent's actually gonna make a bag. - They still made money on this. - A hundred percent. And sure you can look at companies like Valve who obviously do super well, but they're a little more opaque because they don't really, they're not a publicly traded company. So not a lot of information about it, but Microsoft has made an enormous investment in this. And when you think about it like that, there is I think, a very healthy future for the Microsoft gaming division of the company. It seems clear that they see a huge, huge 69 billion odd potential and then some in this kinda space. Which means that if you are a Xbox or PC gamer, the future looks really bright. I think if you're Sony, you gotta look at this news and be like, oh, there's no way you can look at any of that. - And that's one of the things that we kind of always talk about with Sony is, a lot of these great PlayStation one and two games, which I think should be included in a back catalog of Sony stuff is now, if they wanna do them, they gotta ask Microsoft for the rights to do it. It's crazy to me. Like, I know that like, I'm a vintage gamer only because I'm just old at this point. - You're just a vintage human. The one single craziest fact about this whole thing, they spent 67, sorry $68.7 billion. It's a cash transaction. There's zero stock. They literally, they're wiring a $68.7 billion check over to the Activision. Like what? - Let's know in the comments what you think about this, is a good deal? Is a bad deal? Or is Microsoft still not having a games in their catalog? - Oh my God, no. That meme is dead. That meme is dead. - Like the video, subscribe, and we'll catch you in the next one.",
    "transcript_keywords": [
        "Game Pass",
        "Microsoft",
        "Activision Blizzard",
        "Call of Duty",
        "Game",
        "Activision",
        "billion",
        "Xbox",
        "Candy Crush",
        "Pass",
        "Microsoft Gaming",
        "games",
        "Blizzard",
        "Bethesda",
        "Duty",
        "Phil Spencer",
        "Call",
        "buying Activision Blizzard",
        "gaming",
        "company"
    ],
    "transcript_entity_values": [
        "zero",
        "$2.5 billion",
        "Warcraft",
        "Tencent",
        "PS2 era",
        "PS5",
        "the last few months",
        "$68.7 billion",
        "five seconds",
        "one",
        "Call of Duty",
        "Guitar Hero",
        "Earthworm Jim",
        "Deathloop",
        "millions",
        "Twitter",
        "Phil",
        "today",
        "Epic",
        "Bethesda",
        "Phil Spencer",
        "15",
        "the last several years",
        "seven and a half billion dollars",
        "$1.2 billion",
        "Game Pass",
        "Nintendo",
        "the Call of Duty",
        "Mojang",
        "$7 billion",
        "Austin",
        "2020",
        "years",
        "5%",
        "Activision Blizzard",
        "Overwatch",
        "Candy Crush",
        "Activision",
        "2023",
        "every year",
        "June",
        "PS",
        "Tony Hawk's",
        "two",
        "all day",
        "Microsoft Gaming",
        "40%",
        "69 billion",
        "an eight month",
        "Nintendo",
        "1.2 Billion",
        "the last six to nine months",
        "Skyrim",
        "Xbox",
        "Minecraft",
        "Xboxes",
        "Sony",
        "Scrolls VI",
        "Microsoft",
        "first",
        "A hundred percent",
        "PlayStation",
        "Guitar Hero",
        "Valve",
        "67",
        "Bobby Kotick",
        "First",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "EVENT",
        "PERSON",
        "ORG",
        "GPE",
        "MONEY",
        "GPE",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        0.030838493257761,
        -0.011542495340108871,
        0.07745470851659775,
        -0.02104858309030533,
        0.03572835773229599,
        0.016571741551160812,
        0.05279942601919174,
        0.010456240735948086,
        0.04010651260614395,
        0.100682832300663,
        -0.0883602499961853,
        0.06681058555841446,
        0.008217932656407356,
        -0.029353013262152672,
        0.05268160626292229,
        0.01979188062250614,
        -0.030925534665584564,
        -0.0618521012365818,
        -0.045061904937028885,
        0.06806471198797226,
        -0.012793542817234993,
        -0.0703134760260582,
        -0.050685491412878036,
        0.04562586918473244,
        0.06646817177534103,
        0.014078628271818161,
        -0.01180354319512844,
        0.030097683891654015,
        -0.0677480548620224,
        0.004020861815661192,
        -0.0902133509516716,
        0.06080421432852745,
        -0.0032747702207416296,
        0.03321613371372223,
        0.05539790540933609,
        0.01010510791093111,
        -0.017153078690171242,
        0.003222867613658309,
        -0.07257071137428284,
        -0.06262829154729843,
        0.004158856812864542,
        0.03536870330572128,
        -0.06552965939044952,
        0.04670694097876549,
        -0.011675906367599964,
        -0.03152598813176155,
        -4.4419946789275855e-05,
        0.012607196345925331,
        -0.01650991477072239,
        0.10160024464130402,
        -0.029297949746251106,
        -0.08099545538425446,
        0.07961279898881912,
        -0.07525492459535599,
        -0.011762709356844425,
        -0.033684760332107544,
        0.0048599583096802235,
        0.006121560465544462,
        0.08135875314474106,
        0.04961957782506943,
        0.007296689320355654,
        -0.09431425482034683,
        -0.05052121728658676,
        -0.003126335795968771,
        -0.0007686234312132001,
        -0.004690617322921753,
        0.09949437528848648,
        -0.005166572518646717,
        -0.09919609874486923,
        -0.026215888559818268,
        -0.00283523416146636,
        -0.012533201836049557,
        0.08658203482627869,
        0.0074578626081347466,
        -0.041779082268476486,
        0.015483158640563488,
        0.053286533802747726,
        -0.003146415576338768,
        0.028062155470252037,
        0.07142288982868195,
        0.06959900259971619,
        -0.02031863108277321,
        -0.062054552137851715,
        -0.05034765601158142,
        -0.010261564515531063,
        0.0623309500515461,
        0.00872216559946537,
        0.003298640251159668,
        0.06322510540485382,
        -0.023982567712664604,
        -0.08247864246368408,
        -0.0030252505093812943,
        0.11642442643642426,
        0.02110270969569683,
        -0.0002384732069913298,
        0.05397701635956764,
        -0.04948005825281143,
        -0.03381960839033127,
        0.008726213127374649,
        0.03253123536705971,
        -0.00626918813213706,
        0.09145281463861465,
        0.046161800622940063,
        -0.048389118164777756,
        -0.0021473681554198265,
        -0.03931749612092972,
        -0.012254506349563599,
        0.056116197258234024,
        -0.052264951169490814,
        0.0005682863411493599,
        -0.08324140310287476,
        0.017822330817580223,
        -0.04739219322800636,
        -0.03214093670248985,
        0.0896497517824173,
        0.04148031398653984,
        -0.016861552372574806,
        0.0682225450873375,
        0.008464894257485867,
        -0.025672364979982376,
        0.03618638962507248,
        0.07827465236186981,
        -0.06434828042984009,
        0.015363252721726894,
        0.010833445005118847,
        0.002903030952438712,
        -0.0709274560213089,
        3.7686172563209914e-33,
        -0.010472115129232407,
        0.04867944493889809,
        0.015890028327703476,
        0.018485426902770996,
        -0.06126495450735092,
        0.013387375511229038,
        0.0464472696185112,
        0.0401773601770401,
        -0.09292495995759964,
        0.06690438836812973,
        -0.017603624612092972,
        0.031329184770584106,
        -0.03544981777667999,
        -0.0024317072238773108,
        0.10934703052043915,
        -0.0349588617682457,
        -0.003960372414439917,
        -0.007743760012090206,
        0.027423279359936714,
        -0.010729556903243065,
        -0.001969265518710017,
        0.0054101296700537205,
        0.0691421777009964,
        0.012446479871869087,
        -0.03328809514641762,
        -0.017343692481517792,
        -0.08358848839998245,
        0.0045027039013803005,
        0.08102232217788696,
        -0.021231645718216896,
        -0.06067640706896782,
        -0.04647566005587578,
        0.059160973876714706,
        0.009544975124299526,
        0.05615270510315895,
        -0.055318161845207214,
        0.018463825806975365,
        -0.04110834002494812,
        0.014254291541874409,
        0.020733822137117386,
        -0.056522876024246216,
        0.060670267790555954,
        -0.0988558977842331,
        -0.027274353429675102,
        -0.003024826990440488,
        0.023167654871940613,
        -0.05409431830048561,
        -0.13355666399002075,
        -0.05669322609901428,
        0.0069687883369624615,
        0.0037676235660910606,
        0.08906295895576477,
        -0.018427355214953423,
        0.020107900723814964,
        -0.020432431250810623,
        -0.06573008745908737,
        0.013325362466275692,
        -0.07491026818752289,
        0.036332834511995316,
        0.08343170583248138,
        0.03862089291214943,
        -0.039619699120521545,
        0.09329857677221298,
        0.033061396330595016,
        -0.06502137333154678,
        0.08275491744279861,
        0.13640516996383667,
        0.06418712437152863,
        -0.06132461875677109,
        0.006575982552021742,
        0.01827137917280197,
        -0.010149474255740643,
        -0.018403250724077225,
        -0.0027380739338696003,
        -0.015231441706418991,
        -0.02217625267803669,
        -0.03200125694274902,
        -0.038784924894571304,
        0.03864622116088867,
        0.07101453840732574,
        0.007956292480230331,
        -0.028241034597158432,
        0.03080200031399727,
        -0.006128423381596804,
        -0.02051650360226631,
        0.038661155849695206,
        0.042693667113780975,
        -0.03882046416401863,
        -0.011395166628062725,
        -0.030052898451685905,
        -0.10050591826438904,
        -0.017757844179868698,
        0.021951798349618912,
        0.0686698853969574,
        0.06821191310882568,
        -4.9383917251005746e-33,
        -0.044306252151727676,
        -0.05516541004180908,
        0.02044282853603363,
        -0.036070238798856735,
        -0.11039513349533081,
        -0.0376158244907856,
        -0.029115427285432816,
        -0.00620245561003685,
        -0.05333448201417923,
        -0.020392118021845818,
        -0.04926391318440437,
        0.07644633203744888,
        -0.004184050019830465,
        0.08418945968151093,
        -0.039565250277519226,
        -0.06289800256490707,
        0.11725719273090363,
        -0.060609523206949234,
        0.06825719773769379,
        -0.00633897865191102,
        0.050065524876117706,
        0.04184519499540329,
        -0.0509100966155529,
        0.06356821209192276,
        0.0005415441701188684,
        0.05053313076496124,
        0.0014557570684701204,
        -0.06198609992861748,
        0.028279632329940796,
        0.05823732540011406,
        0.005746072623878717,
        -0.010476621799170971,
        0.02624189853668213,
        -0.02402973733842373,
        0.04106925055384636,
        0.015168499201536179,
        0.0012793279020115733,
        -0.026058688759803772,
        0.004731735214591026,
        -0.048402637243270874,
        0.009345714934170246,
        -0.02504713088274002,
        -0.06073687598109245,
        -0.006211278960108757,
        -0.002144217025488615,
        0.04082533344626427,
        0.056077439337968826,
        -0.024224359542131424,
        0.1043299064040184,
        -0.0314815454185009,
        0.035285428166389465,
        -0.011157887987792492,
        -0.02802399732172489,
        -0.0562489852309227,
        -0.06905579566955566,
        -0.04580352455377579,
        -0.08909093588590622,
        -0.008424540981650352,
        0.04133794456720352,
        -0.07519932836294174,
        0.0030628982931375504,
        0.02776985988020897,
        -0.029926631599664688,
        0.012729715555906296,
        -0.020389104261994362,
        0.12198581546545029,
        0.11648018658161163,
        -0.049116071313619614,
        0.017512498423457146,
        -0.07353585213422775,
        -0.035904284566640854,
        0.009292141534388065,
        -0.12042423337697983,
        -0.029933903366327286,
        -0.07335105538368225,
        0.09442541003227234,
        -0.016607703641057014,
        0.051504865288734436,
        -0.01032231841236353,
        0.031379565596580505,
        0.04269194230437279,
        0.011572301387786865,
        0.025129862129688263,
        -0.05314725264906883,
        0.031649455428123474,
        -0.06337960064411163,
        0.03822644427418709,
        -0.038839686661958694,
        -0.10210629552602768,
        -0.04971982166171074,
        -0.07186409085988998,
        -0.027399003505706787,
        -0.026728058233857155,
        -0.002600976498797536,
        0.0009994099382311106,
        -5.4896638346235704e-08,
        0.09321540594100952,
        -0.059600308537483215,
        0.002444339217618108,
        -0.007166355848312378,
        0.07085741311311722,
        -0.03357918560504913,
        0.0015693262685090303,
        0.07730062305927277,
        0.07379836589097977,
        0.1292172521352768,
        0.010350244119763374,
        0.004046473652124405,
        -0.058644287288188934,
        0.016965700313448906,
        -0.03045189566910267,
        0.032662685960531235,
        -0.08719682693481445,
        0.01526909600943327,
        0.00514950742945075,
        0.009427438490092754,
        -0.03644406795501709,
        0.05988827720284462,
        0.021766191348433495,
        -0.06431225687265396,
        0.035349756479263306,
        -0.0339975580573082,
        -0.02164679765701294,
        0.03944198042154312,
        -0.0011906148865818977,
        0.04707977920770645,
        0.0589672327041626,
        -0.06277507543563843,
        -0.04918937012553215,
        -0.041413385421037674,
        -0.00669556250795722,
        -0.07236184924840927,
        0.03849325329065323,
        0.0476488433778286,
        0.054275527596473694,
        -0.060843709856271744,
        -0.09017814695835114,
        0.00914614088833332,
        -0.016328565776348114,
        0.019648443907499313,
        -0.0525287464261055,
        -0.014329638332128525,
        -0.15039347112178802,
        -0.05971691012382507,
        0.04912658408284187,
        -0.09839474409818649,
        0.04699110612273216,
        0.044596169143915176,
        0.020566176623106003,
        0.04138494282960892,
        0.0102786710485816,
        -0.03723764419555664,
        -0.005882600322365761,
        0.047193314880132675,
        -0.07385137677192688,
        -0.028467578813433647,
        -0.03620048984885216,
        -0.17023678123950958,
        -0.02508617378771305,
        0.0035891805309802294
    ]
}