{
    "id": "Jj3w1g3poQs",
    "title": "Microsoft Surface Duo review: double troubles",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-09-10T13:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=Jj3w1g3poQs",
    "category": "Science & Technology",
    "tags": [
        "surface duo",
        "microsoft surface duo",
        "surface duo review",
        "microsoft surface",
        "foldable phone",
        "foldable",
        "phones",
        "two screens",
        "dual screen",
        "surface duo video",
        "android device",
        "microsoft",
        "surface",
        "folding phone",
        "microsoft apps",
        "apps",
        "software",
        "hardware",
        "display",
        "camera",
        "price",
        "dieter bohn",
        "microsoft phone",
        "verge review",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 426974,
    "likes": 10676,
    "comments_count": 964,
    "description": "The Surface Duo  Microsoft is back into the phone game with its own Android device. It's a two-screened folding phone that runs all of Microsoft's best apps. But making the device so thin and spending so much time on development means that there are some compromises. In this review, Dieter Bohn looks at the camera, the software, and the hardware.  Learn more:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Surface Duo at Microsoft:   0:00 Intro 0:43 Whats the big idea? 2:05 Duo duel 3:41 Not so good things 5:06 Hardware 6:44 Software 8:16 Bugs 9:58 Remember when 11:18 Outro  Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/2Rd8i8O",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/32L9y8D",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat music) - The Surface Duo. Four years after Microsoft gave up entirely on making its own Windows Phones, it is back with this Android phone, only this is trying to be a different kind of thing, an entirely new kind of thing, not just a phone or a tablet. See, Microsoft has a very, very big idea it is trying to pull off with this dual screen Android device, this $1,400 Android device. That is ultra flagship territory. That is a big idea with a very big price tag, which means that this is the big time Microsoft. I hope you brought your A game. (upbeat music) All right. So what's this big idea? \"What's the big idea, Microsoft?\" Sorry. The big idea is that Microsoft knows a thing or two about how people use computers to be productive. They've got that whole Office and Outlook and Windows thing, but the insight that they have is that the way we use our phones to be productive has stagnated. The thing that makes you productive at your desktop is windows. I mean the moveable boxes your apps go in, not necessarily the operating system. With windows, you could have multiple things going on at once. You can cross reference stuff and you can drag stuff between your different apps. But every attempt so far to make something like that productivity system for phones has been pretty bad. So the Surface Duo tries to recreate that sense of productivity through multitasking by having two screens. It's not a tablet, it's two phone apps side by side. And instead of split screen, like you might get on other phones or tablets, the idea of side-by-side apps is built into this thing at the core. And it's a pretty good idea. Microsoft just has to execute on it well in both the hardware and the software. Let's do the hardware first. I'm not gonna say that Microsoft nailed it with the execution, but they came damn close. Let's talk about the choices that Microsoft made with the Surface Duo. We can make it a game. Good choice. Not so good choice. It's a duo duel. Good choice. Make it thin, aggressively obsessively thin. It's around 10 millimeters when it's closed. And it is less than five millimeters thick when it's open. Compare that to the chonk that is the Galaxy Z Fold 2. I know they're different devices, but still thin matters because it makes the Surface Duo pocketable, light and something that's just a joy to pick up and use. Also, there's nothing on the outside when it's closed. No camera, no screen, no little baby status screen, nothing. And I dig that. It shows intention and focus. That's actually two things. That's not how we play this game, but whatever. Not so good choice. These bezels around the screen. They are huge and blah-blah-blah, there's something to hold on to, blah. But look, they're too big. They should be smaller. Now, I admit I'm not really that annoyed by them. It's totally a fair 1st gen mulligan, but they're dopey. Good choice. Can I just say that the Surface team at Microsoft knows how to make a hinge. It feels great. It's firm throughout the full 360 degrees of motion, it's solid without being stiff and the gap between the two screens is there, but it's not gigantic. I mean, it's too gigantic to have one app span across both screens without being dumb, but that's not really what the Surface Duo is for. Not so good thing, actually, terrible thing, the camera. It is 11 megapixels and it's awful. Everything is muddy and lifeless and just bad bad bad. Low light is bad, portrait is bad. You should only use this camera for video conferencing, which is actually super great 'cause you could set the Duo up right here and get this two screen setup, but look, I get why the camera is so bad. Microsoft had to keep the sensor small to keep the device thin. And you know what? Camera hardware isn't everything, but (exhales loudly) Microsoft has a ton of catching up to do when it comes to image processing. Good choice, obsessing over materials and build quality. It is glass front and back and inside with metal rails. The fit and finish is just really good though I can find a couple little uneven spots to quibble with if I look really closely. Like for example, the white points on the screens are just a little bit different. The left one is a tiny bit pinker. Now, this is really hard to show on video or photos, but trust me, it's there. Anyway, whatever. Honestly, the screens do look good. And they also will take input from a Surface Pen if you've got one of those lying around. Wait a minute, aren't you the good choice guy? Why are you nitpicking the white point? You know what? Shut up. We don't have much practice with this thing. (upbeat music) Right. So really the truth here is a lot of these choices are nuanced. It's not just good or bad. Take waiting so long to release it that the specs ended up being out of date. I'm actually not that mad about it. I'm mostly fine with the specs. Yes, it's last year's processor, but it still feels fast. Plus all that extra time that Microsoft spent with a Snapdragon 855 meant that it could optimize some things like battery life. The battery on this device is a tiny little 3577 milliamp cells split between two, but I've been getting to the end of the day anyway even when I'm using both screens. I also don't care that it doesn't have 5G. I think that by the time that missing 5G is gonna give you a sad, you'll probably be thinking about upgrading anyway. Another mixed decision, it is super wide even especially when it's folded in half. This is a sign that Microsoft is trying to make a new kind of thing and not just a phone. You get more text and it feels more like a window you might see in your computer, just a little tiny bit, but it is awkward to hold in one hand. You can't really use this thing with one hand, but there is one just unforced hardware error in this thing. It's the RAM. There's 6 gigs, which is enough for Android, but not quite enough to be doing two things at once in a rock solid, reliable, zero freezy freezes kind of way. And the whole point of the Surface Duo is doing two things at once. And again, this is the $1,400 Duo, which has the same amount of RAM as a $350 Pixel 4A. So from a spec perspective, not a good value for the money this phone, like at all. But at the end of the day, I have to admit I'm really impressed with the design and the quality of this hardware, which brings us to software. (upbeat music) Okay. Here's the deal. The Surface Duo is trying to be that new kind of device. One that is built with multitasking in mind from the jump. But most of the time you just have this simple system where there is an app on each screen. And just by itself, that's useful and it's simpler than split-screen on other phones. There's also different postures like I dunno, tent mode or whatever. You can turn it vertically to get this really gigantic keyboard, which is nice, but spanning screens is mostly awkward. Only a few apps are good when they're spanned across both screens at once. Microsoft's own apps or other apps like the Kindle app, they're aware of that gap and they do interesting things to work around it. But really, the key thing to know here is how multitasking works. Microsoft's idea was to take Android and make it natively feel like it has a real multitasking system. That's instead of what Samsung does with the Fold where it has this extra multitasking layer on top of it. The Surface Duo system feels more like an integrated whole. That's both good and bad though. See, everything is driven by swiping up, but now swiping up does a lot of different things depending on your context. Sometimes it brings up the multitasking view. Sometimes it goes home. Sometimes it launches the app drawer. Sometimes it flings the app over to the other screen if you happen to swipe up at a certain angle. Oh, and by the way, if you turn it vertically, all of those up swipes are now sideswipes because the little bar's over on this side now. It takes some getting used to, but when it works, it does the thing, hassle-free multitasking that makes you feel way more productive. But also sometimes the software just freezes up for a second or it lags when you're trying to input something. So I just have to tell you that the original version of the software that Microsoft shipped to reviewers was so buggy and bad that it was unusable. It was crashy and laggy and... (exhales loudly) But then Microsoft shipped an update to reviewers that's also gonna come to all devices on launch day. And it didn't fix all of the lags and the bugs, but it did tamp them down enough to finally make this thing really usable. It helped, but the software, it still needs work. So for example, take the camera. If you wanna take a picture that isn't a selfie, you need to switch the screen out to here, which means you need to do a flip and then maybe a double tap, which only sometimes works. Honestly, I missed more shots than I took because I was faffing around trying to get the screen to the other side. Now, a lot of this is just that Android isn't designed to work this way originally. A lot of apps aren't designed to understand that there could be a second screen and the multitasking is something that Microsoft had to build on its own. So honestly, Google could do some work to make this easier for Microsoft, but you know what? It's not Google's logo on the outside of the Surface Duo, it's Microsoft's. Speaking of Microsoft, the Surface Duo does a better job than any other Android manufacturer at creating a coherent and unified ecosystem of apps and services. This thing works with Microsoft Edge, Your Phone on windows, Outlook, OneDrive, Office, all of it. Plus if you don't wanna use any of that, you're not forced to. You could just use Google Services so you can not use Bing. Sorry Bing. No, I'm not. It's hard to remember now, but before the iPhone, there was a smartphone that was nearly perfect for work. It was the Blackberry. And I feel like the Surface Duo is the 2020 equivalent of that. It is very good for getting things done. Microsoft just needs to smash a few more bugs, like smash smash. The first Surface, and I mean the very first Surface, wasn't really ready. It had a bunch of very good ideas, a few bad ones and a lot of bugs, but a lot of people also didn't get what Microsoft was going for with it. A few years later, Microsoft finally came through with the Surface Pro 3 that actually achieved what the first Surface was trying to do. The Surface Duo, it's not really ready at release. It has a bunch of good ideas, a few bad ones and a lot of bugs. But I do think a lot of people aren't going to get what Microsoft is going for. The difference though is this isn't Microsoft's first rodeo. Depending on how you count, this is Microsoft's WinCE, Pocket PC, Windows Mobile, Windows Phone... 5th attempt at this sort of device. And I do think they've got a real shot this time, just not with this device as much as I'd like the hardware and all of the ideas and the software. Maybe if this didn't cost 1,400 bucks, we could be having a different conversation, but it does. And if you wanna spend that much money on a work phone, the Note 20 Ultra does split screen, comes with the stylist, has a not terrible camera and runs all of those Microsoft apps just fine. This Surface Duo doesn't quite live up to Microsoft's big ideas, but after they've been knocked down so many times in the smartphone game, it's nice to see them up and back in the fight. I just hope that this device isn't their last round. The... Sorry. Wait, sorry. Let's go back up. That's okay. That's fine. Right there. I wasn't ready for you. Can we make this work? - [Man] Let's just do it again. - Okay. I'm sorry. - [Man] No, it's all good. - Hey everybody. Thanks so much for watching. What do you think? Is this anywhere near worth the money? Let me know down in the comments. If you wanna see another folding phone that costs even more, I just reviewed the Galaxy Z Fold 2 and you can check that out.",
    "transcript_keywords": [
        "Surface Duo",
        "Microsoft",
        "Surface",
        "Duo",
        "good",
        "thing",
        "Good choice",
        "screen",
        "Surface Duo system",
        "Microsoft big ideas",
        "big idea",
        "bad",
        "phone",
        "big",
        "Windows",
        "things",
        "apps",
        "Android",
        "Surface Duo pocketable",
        "screens"
    ],
    "transcript_entity_values": [
        "zero",
        "Surface",
        "Four years",
        "Google Services",
        "Android",
        "Duo",
        "Fold",
        "one",
        "Windows Phones",
        "launch day",
        "the Surface Duo",
        "Windows Mobile",
        "3577 milliamp",
        "The Surface Duo",
        "OneDrive",
        "1,400",
        "Google",
        "360 degrees",
        "5th",
        "between two",
        "5",
        "the end of the day",
        "Office",
        "around 10 millimeters",
        "2020",
        "Office and Outlook",
        "Outlook",
        "1,400 bucks",
        "20",
        "the Galaxy Z Fold 2",
        "half",
        "Samsung",
        "two",
        "6",
        "$350",
        "second",
        "This Surface Duo",
        "Microsoft",
        "first",
        "Microsoft Edge",
        "iPhone",
        "1st",
        "the Surface Pro 3",
        "less than five millimeters",
        "A few years later",
        "last year's",
        "RAM",
        "Blackberry",
        "11 megapixels",
        "Windows",
        "a ton",
        "a minute",
        "Kindle"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "TIME",
        "PERSON"
    ],
    "vector": [
        -0.11852585524320602,
        -0.037805333733558655,
        0.08884754031896591,
        -0.08948494493961334,
        0.05362013727426529,
        -0.030743610113859177,
        -0.024401063099503517,
        0.05101749673485756,
        0.004274273291230202,
        0.0400991216301918,
        0.029936105012893677,
        0.04398335516452789,
        0.007900954224169254,
        0.011511429212987423,
        0.0697697103023529,
        0.016274627298116684,
        0.033758509904146194,
        -0.09945353120565414,
        -0.05421251058578491,
        0.10826077312231064,
        0.008718178607523441,
        -0.027334652841091156,
        -0.028173023834824562,
        -0.05142534524202347,
        0.02734321355819702,
        0.0068928939290344715,
        -0.05572592467069626,
        -0.0011470615863800049,
        0.006246407516300678,
        -0.008625534363090992,
        -0.01497604325413704,
        0.12274478375911713,
        0.023445382714271545,
        0.04672901704907417,
        -0.03777850791811943,
        -0.127687469124794,
        0.025074781849980354,
        0.006104260217398405,
        -0.1069561317563057,
        -0.0870547816157341,
        -0.06684808433055878,
        -0.025302711874246597,
        -0.02381538413465023,
        0.01985989511013031,
        0.04823097586631775,
        -0.031106866896152496,
        0.05224892124533653,
        -0.0369160994887352,
        -0.029972484335303307,
        0.004097440745681524,
        -0.03225242346525192,
        -0.0868455097079277,
        0.04896426573395729,
        -0.04309831187129021,
        -0.06168979033827782,
        0.045822542160749435,
        -0.020233403891324997,
        0.11844699084758759,
        0.027334900572896004,
        0.011863728985190392,
        0.102252297103405,
        -0.04421131685376167,
        -0.011670012027025223,
        0.05331850051879883,
        0.02798815816640854,
        0.02123534493148327,
        -0.038304053246974945,
        -0.059381768107414246,
        -0.00654006190598011,
        -0.03566296026110649,
        -0.05448198318481445,
        0.01160855870693922,
        0.027639087289571762,
        0.005223449319601059,
        0.04950739070773125,
        0.006414995063096285,
        0.033005647361278534,
        0.008504904806613922,
        -0.06174079328775406,
        -0.08502175658941269,
        0.019776903092861176,
        -0.006677332799881697,
        -0.03774202615022659,
        0.00839977990835905,
        0.012188725173473358,
        -0.019970715045928955,
        -0.00041130356839857996,
        0.04364299029111862,
        -0.05392703786492348,
        -0.05289161950349808,
        -0.07138968259096146,
        0.06546574085950851,
        0.00613497756421566,
        -0.009352542459964752,
        0.024112695828080177,
        -0.034253060817718506,
        -0.04134812206029892,
        -0.0830746665596962,
        -0.03670995682477951,
        0.01611129567027092,
        -0.01640227995812893,
        0.02742565982043743,
        0.08199885487556458,
        -0.0343223437666893,
        0.02787400409579277,
        -0.12773554027080536,
        0.0463346466422081,
        -0.02228662371635437,
        0.01730695180594921,
        0.024129824712872505,
        0.017573734745383263,
        -0.00012921530287712812,
        -0.03666457533836365,
        -0.017976723611354828,
        0.024929367005825043,
        0.006265205796808004,
        -0.002946180757135153,
        0.020392602309584618,
        0.11021745949983597,
        -0.016349580138921738,
        -0.02313070558011532,
        0.01122603565454483,
        -0.08157133311033249,
        -0.12366267293691635,
        0.0014922897098585963,
        -0.009871907532215118,
        -0.027397949248552322,
        3.534943305714921e-33,
        -0.005401818547397852,
        0.12252740561962128,
        -0.05808928981423378,
        -0.011691148392856121,
        0.015308727510273457,
        -0.019125772640109062,
        0.003400794928893447,
        0.028812352567911148,
        0.012473566457629204,
        0.030597738921642303,
        -0.06097373366355896,
        0.015965716913342476,
        -0.014263695105910301,
        0.06611678749322891,
        0.09180290997028351,
        -0.036184050142765045,
        0.03497268632054329,
        -0.010725993663072586,
        -0.03868188336491585,
        -0.030067231506109238,
        0.03016461431980133,
        -0.001991333207115531,
        0.002164756413549185,
        -0.06556008011102676,
        -0.0021971974056214094,
        0.041077375411987305,
        0.03887997195124626,
        -0.012151668779551983,
        0.12141724675893784,
        0.004078346770256758,
        -0.1103009283542633,
        0.02115744911134243,
        0.013258473016321659,
        -0.013330317102372646,
        -0.003410330507904291,
        0.025127284228801727,
        -0.05523810163140297,
        -0.09195602685213089,
        0.0600212998688221,
        0.006259923800826073,
        -0.09248802065849304,
        0.03197456896305084,
        -0.05537068843841553,
        -0.033955059945583344,
        0.03824348747730255,
        -0.06760111451148987,
        -0.01457151398062706,
        -0.0013915995368734002,
        -0.007345620077103376,
        -0.010162209160625935,
        0.011409935541450977,
        0.03094412386417389,
        -0.026870250701904297,
        0.04783462733030319,
        -0.06586592644453049,
        -0.05009094625711441,
        -0.003961596172302961,
        -0.031470801681280136,
        0.02848214842379093,
        0.03721480071544647,
        0.07630722969770432,
        -0.005109263118356466,
        -0.06104465574026108,
        0.026369882747530937,
        -0.10676085203886032,
        0.038129325956106186,
        0.11690404266119003,
        0.020926957949995995,
        -0.09065423905849457,
        0.017487913370132446,
        -0.01266747061163187,
        -0.021793225780129433,
        -0.012314864434301853,
        -0.02872459404170513,
        -0.010588664561510086,
        -0.0253473948687315,
        0.029922882094979286,
        -0.040912337601184845,
        0.01412349846214056,
        0.02186041697859764,
        -0.05559801310300827,
        -0.010145716369152069,
        0.06118481233716011,
        -0.06780367344617844,
        -0.11870568990707397,
        0.009374633431434631,
        0.00505212415009737,
        -0.05099043250083923,
        -0.03495337814092636,
        0.09962891787290573,
        -0.07957036793231964,
        0.002316800644621253,
        -0.04024330899119377,
        0.04469433054327965,
        0.0016656199004501104,
        -4.842693627974178e-33,
        -0.11330193281173706,
        -0.060392726212739944,
        -0.046561650931835175,
        -0.03653816133737564,
        -0.029365377500653267,
        -0.005893405992537737,
        0.017293177545070648,
        -0.05000210180878639,
        -0.026877867057919502,
        -0.02764536812901497,
        -0.004495653789490461,
        0.02774231880903244,
        0.06736702471971512,
        0.03775521367788315,
        0.01197581086307764,
        -0.03877102583646774,
        0.031670764088630676,
        -0.05120814964175224,
        0.07019268721342087,
        0.02905368246138096,
        0.07073091715574265,
        0.03506739065051079,
        -0.006384324282407761,
        0.06611450016498566,
        -0.004088253248482943,
        0.0058577354066073895,
        -0.01807617023587227,
        -0.04061609506607056,
        0.03523263335227966,
        0.03650543838739395,
        0.01139522809535265,
        -0.012051336467266083,
        -0.0027870789635926485,
        0.022417133674025536,
        0.13576775789260864,
        0.026277512311935425,
        -0.01682101935148239,
        -0.14306704699993134,
        -0.023243753239512444,
        -0.06125626340508461,
        0.029077038168907166,
        -0.03550812602043152,
        -0.007648042868822813,
        -0.00376199372112751,
        0.05825009196996689,
        -0.03573324903845787,
        -0.002116071991622448,
        -0.015403860248625278,
        -0.054033201187849045,
        -0.009037564508616924,
        0.03900531679391861,
        0.05151781439781189,
        -0.011044850572943687,
        -0.05177769064903259,
        -0.05319398641586304,
        -0.017725959420204163,
        -0.014295854605734348,
        -0.029232118278741837,
        0.04430443048477173,
        -0.02078879252076149,
        0.06375613063573837,
        -0.003696961561217904,
        -0.07460237294435501,
        -0.06198007985949516,
        -0.0023637237027287483,
        0.1394275724887848,
        0.11639109998941422,
        0.0003249265719205141,
        -0.002966054482385516,
        0.030999159440398216,
        -0.051886748522520065,
        -0.01275935210287571,
        -0.030414707958698273,
        -0.07573862373828888,
        -0.029330788180232048,
        0.05791051313281059,
        -0.037964966148138046,
        -0.01964259333908558,
        -0.067496158182621,
        -0.04358265548944473,
        0.0649852454662323,
        -0.006895488128066063,
        0.1419840157032013,
        0.01918611116707325,
        0.039212264120578766,
        -0.03845445066690445,
        -0.014877070672810078,
        0.05816449597477913,
        -0.09602678567171097,
        0.008566713891923428,
        -0.059087954461574554,
        0.0007041360368020833,
        -0.053182605654001236,
        0.16467250883579254,
        0.0339476652443409,
        -5.352004350811512e-08,
        0.05705605819821358,
        -0.022025583311915398,
        0.07517528533935547,
        -0.013639291748404503,
        -0.04170265048742294,
        -0.06212720647454262,
        0.053180236369371414,
        0.02030755952000618,
        0.009721420705318451,
        0.005203112494200468,
        -0.08616103231906891,
        -0.10467918962240219,
        -0.08332716673612595,
        0.0885632187128067,
        0.09964390099048615,
        0.15029343962669373,
        -0.01703703962266445,
        0.024090714752674103,
        -0.016672778874635696,
        -0.013273760676383972,
        0.026535168290138245,
        0.02255335822701454,
        0.049835339188575745,
        -0.04631515592336655,
        0.04959544911980629,
        0.015990743413567543,
        -0.039799053221940994,
        0.04877365007996559,
        0.047024134546518326,
        -0.04167170077562332,
        0.03201839327812195,
        -0.006715300492942333,
        0.031021002680063248,
        0.043515827506780624,
        -0.048591308295726776,
        -0.04220246151089668,
        0.03979295492172241,
        0.0657568946480751,
        0.10635269433259964,
        0.011201187036931515,
        0.0017607563640922308,
        0.03812969848513603,
        -0.03213931620121002,
        0.059764884412288666,
        0.03284772112965584,
        -0.060395900160074234,
        -0.022534368559718132,
        -0.09999697655439377,
        0.004747539293020964,
        0.014022941701114178,
        -0.021875979378819466,
        0.005649609491229057,
        0.05041072517633438,
        0.07073630392551422,
        0.031829312443733215,
        0.00858440063893795,
        0.006857236381620169,
        -0.0028635330963879824,
        0.009793016128242016,
        0.06713235378265381,
        0.030888965353369713,
        -0.03229868784546852,
        0.005069007631391287,
        0.07542649656534195
    ]
}