{
    "id": "JJerxCkSEEs",
    "title": "This is a POKEMON Gaming PC?!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-02-20T20:33:41Z",
    "video_url": "https://www.youtube.com/watch?v=JJerxCkSEEs",
    "category": "Science & Technology",
    "tags": [
        "adobe premiere pro",
        "premiere pro",
        "adobe premiere pro price",
        "premier pro",
        "premiere pro free",
        "adobe premiere pro cc",
        "adobe premiere pro free",
        "video editing software",
        "best video editing software",
        "video editing software free",
        "free video editing software",
        "video editor",
        "free editing software",
        "editing software",
        "editing software free",
        "best editing software",
        "vlogging",
        "edit video",
        "video editing",
        "edit a video",
        "leonhart",
        "leon hart",
        "pokemon",
        "gaming pc",
        "austin evans",
        "pc build"
    ],
    "views": 1166832,
    "likes": 45442,
    "comments_count": 1611,
    "description": "A portion of this video was sponsored by Adobe Premiere Pro. Try it out now:  We teamed up with @Leonhart to build the ultimate Pokemon gaming PC!  My new podcast @TheBackmarkers!  Our second channel @thisis!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.adobe.com/products/premiere.html",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Big thanks to Adobe Premiere Pro for sponsoring a portion of this video. Today, we are building the ultimate Pokemon Gaming PC. Now, you'll probably notice that recently I've gotten more than just a little into Pokemon cards. As part of that, I've become friends with Leonhart, one of the absolute OGs of Pokemon cards, and honestly just a side note, one of the nicest guys I've ever met in my life. So today we're building him a brand new gaming PC that not only looks the part, but that can game, stream, and edit. So what do you want this thing to look like? Do you care about what size it is? Are there any special features? Anything that comes to mind that you wanna go for, for the aesthetic of the system? - What if like grasp maybe the colors on the inside could be like red, green, and blue. Just kind of like the original Game Boy games. - [Austin] Oh. - Maybe make a little play on nostalgia. - What if we even take a step further? What if we actually put some kind of little like pool with like a Squirtle jumping in and we have a volcano, or we have like a little grassy section, something like that. - Do you have like a desk space, or something in mind? Just so I can get a little bit of an idea of the scale if we're gonna go for a smaller chasse, or a bigger chasse? - [Leonhart] Right here is my current one. - Okay. - [Leonhart] It's collecting dust down there. (Austin chuckling) I'm about to do a full-on clean, so, - Nice. - It's just an IKEA desk. - Okay, cool. Let me start tracking some stuff down. Keep making the videos. Keep making me waste way too much money on eBay every day. (laughing) - Yeah, sorry. Sorry, Sorry let's piece for all that's out there. Let's see who pulls my Leon cards (Austin chuckling) Right? - I'm pretty sure you're gonna open a hundred more packs than I will, but I'll give it my best shot. (laughing) - I pulled again, so it's still fair game. - So, for the ultimate Pokemon YouTuber, we need the ultimate Pokemon build. So, first of all, while we're gonna make this look as cool as possible, it needs to perform well. And there are a few main things we need to do with the system. It needs to be able to game, it needs to be able to video edit, and it also needs to be able to stream. Which is why we're starting out with the Ryzen 7 5800X. Brand new Ryzen chip, eight cores, and importantly, not only will it be great for the editing side, but it also will be great for streaming. On top of that, we're gonna be pairing it with the RTX 3080. Again, when you talk about streaming, having that invent coding is nice, and this will easily be able to play any game that Leon wants to throw at it. Now, to actually make this all streaming ready, we have a couple of Elgato products. So we have Elgato 4K60 pro which you can route not only camera and if he wants but also this is really meant for connecting like a PS5 or an Xbox or something too. And we have a Cam Link 4K, so now it's just all capable of 4K streaming. But importantly, this will also work again for any kind of camera he wants to route in. - Okay. So here we have the case that we gonna be building everything inside of. This is an O11 Dynamic from Lian Li - From Lian Li which is a killer case. Well, the nicest things about it, it's super modular. But the thing is for this system we can make it perform great, right? We have all the components, but really how we're gonna have to sell this is by making it look cool. Right? Ken, I've never seen this before. This is a red Nendoroid. - Yes. - Okay. Wait, wait, show me this. Show me this. - So actually used to collect animate figures a lot and a lot from the series in particular the Nendoroid series from Good Smile Company. This is in particular Trainer Red. And the reason why I bought this for us is because it actually comes with little versions of the starters to go alongside Trainer Red. - How much was this? - So this has been long out of retail but some places are obviously still selling it from stock. - Yeah. - This cost us, I think around $120 - Ooh! - which is like double of retail. - I got to see, I got to see the Squirtle. Dude, I mean look Squirtle's my, Squirtle's my guy. - I'ma pick my favorite one though. - Charmander the Wrong Starter? Huh, that's okay. Bulbasaur deserves to be on the ground by himself. Don't at me. - that's rude. - I want to water gun you right now. - It's in the handbook somewhere. I don't think that's a lab. - Well, so one of my big questions here and something we should really sort out right now, how much space are we gonna have? 'Cause we still need to fit a full 360 mm radiator graphics card, and everything like that. Why don't we actually get the motherboard out? And kind of roughly figure out where everything is gonna live, because I think we may have less space than we hoped for. But think about it. If we're building like a whole forest and a lake and a volcano, I mean, cause we're gonna need at least a couple inches of verticality, right? So we have our Crosshair Hero, which will obviously do the job. So we're gonna load up our Ryzen 7, the RAM, everything else later. (upbeat music playing) - So with that, we should have our board in place. So you can see how much we're gonna have above, which will make sense because we do have a 360 mm radiator that we are gonna be installing at the top of the case. But beyond that, the actual bottom of the case, I mean, we're gonna have some space but it's not gonna be like massive. So, okay. So this is what's gonna look like with the graphics card. Oh crap, okay? And then, - This is crazy. - That's fine. - You sure you don't wanna put a screw in there? - That's fine. - You sure? - Fine, Wes. I will put a screw in so it doesn't break off or something silly. - I literally heard a creaking. - And then if I drop a little 4K 60 in here. - So how much space are we working with here? - Oh, that's fine. No, it's fine. - Yeah, I know, you can almost see it, right? We could actually do a little depth trick where when it rolls back, we can do a little hill up here and then just roll it immediately down. So, it looks like it has some depth to it but you actually have a lot of space back there. - So I think all the space we're really gonna need is just maybe like an inch or so, just so we can bring cables up. - Okay. - And then I would say let's make it where when the diorama is in the board could still come out will be my main question. Or if there's a way to remove the diorama in any way, basically I wanna make sure that this is not locked in it for all the time. If anything goes wrong, if we need to do troubleshooting or something - Sure, you just put magnets on the back of the board and just slapped it onto the case. - You know what's great with computers? Magnets, never causes any problems. - [Ken] We have SSDs. So while Ken and I are going to start prepping the system so we're going to do our test fits and we're going to start running cables. We're gonna get all of the components ready. Wes is going to grab some stuff like the side panels and get them laser edged. And yet actually layering in all of the different diorama components that he wants. So that at the end of the build, we're both done. We can put the entire thing together and hopefully it turns out to be truly the ultimate Pokemon gaming PC. - This portion of the video is sponsored by Adobe Premiere Pro. The Premiere Pro was the very first pro video editor that I ever used eight years ago, nine years ago, and they've come a very, very long way since then. Premiere Pro is used by everyone from TV shows, to YouTubers, to TikTokers , and for good reason, it really is the industry standard. Now do you have Lumetri color which is a great way of now adding light but of course you have that full capability to customize the color of your videos however you like. You also have very powerful audio editing tools. So I personally really like the fact that you have that sort of AI one click ability to customize it, to have your voice to be completely where you want it, including your levels which is much better than me doing it by myself and low key one of the best features of the Premiere really is the integration with Photoshop and After Effects. Between the three of those, that really is sort of your Swiss army knife of tools that you need to create content in 2021. So if you're looking to up your video editing game definitely check out Adobe Premiere Pro at the link in the description and huge shout out to Adobe for sponsoring this portion of the video. They do a lot to support creators, but without any further ado, why don't we get back to building ourselves a PC, shall we? So there are a few specific things that we're doing for this system. One of which is to use a pair of SSDs. Now, ideally I would have used just a single 980 pro 'cause that really is my favorite SSD at the moment. However, the issue is that they only make a one terabyte version, which is fine. I'm sure that Leon would be totally okay with one terabyte of storage, but I wanted to give him a little bit more, which is why we're also going to be using an additional one terabyte PCI 4.0 SSD. So, as someone who is a YouTuber specifically as someone who does a lot of video editing having really fast PCI storage is nice. And these 980 Pros cannot say enough good things about them. They're incredibly fast it's like seven gigabytes per second reading speeds. And when it comes to working with huge video files and tons of Pokemon cards spreadsheets, lots of I don't know, it's just nice to have that storage. So we have 32 gigs of G Skull Trident and this is the Trident Z Neo and this should be more than enough. (cool music playing) Okay, we are ready for a test boot of the ultimate Pokemon gaming PC. So obviously all of our cabling is completely temporary. We also don't have the final CPU. So because the board needs a bios update we just threw in a third gen I think an Athlon. So when it comes to building an AMD system especially with the latest AMD 5000 series of Ryzen, you actually have to be slightly careful because if the board is say a few months old and it doesn't have the correct BIOS you can put the chip in and nothing will happen, right? So what I wanna do today is take an older chip that I know should work, install it in the motherboard and make sure that the BIOS is fully up to date and then we'll swap over to the Ryzen processor. I mean I need to do this, but it's going to save me a whole lot of time in troubleshooting. If we put the entire system together and nothing happens. Now, it just needs to post for us. Take in a minute to post. - The monitors on, right? - Yeah, it's stuck on 4D right now. - [Ken] So our BIOS code is reading 4D. So Austin's looking up what that even is, (Austin laughing) - So funny. - [Ken] What is it? - Looks like it's a memory issue. - [Ken] You wanna unseat and reset the RAM? - Yeah, let's pull some memory out. All right, let's go for round two. - [Ken] 4D. - Doesn't like our memory. Something about the CPU, the board and the memory are not communicating correctly. I can throw the Ryzen 7 in there like the actual processor to see. (upbeat music) - Oh, that looks much better. Yep, okay. - [Ken] There's a processor. - It was just a processor. Now let's see if the BIOS actually is compatible 'cause if it's not up to date it will not post. 'Cause it depends on how new the board is and this board has been, oh, okay it's fine. All right. Well, we did all that to make sure that it works and it works right out of the box and I didn't have to bother with it. So now I'm going to update the BIOS, load up all of our RAM and we should essentially be good to go with the actual hardware of the system. Wes, how are you looking over on this side? - It's going pretty good. I'm starting to figure out the density for the water color. Just to have a nice sort of cartoony blue. - That looks very Squirtlely. - Yes, very Squirtlely. - It sounds, that sounds weird. So, what we're gonna do is we're gonna underlay it with some of these and then we're gonna apply a little bit of this texture over top of the LEDs to get it to have a a ripple effect, so as we animate through, hopefully it kind of shines up and then and then we just sort of some water motion effects in there. OK, I'm testing now. - Working with this set, I realized that there's a lot of opportunity for animation through lighting. Now we need to make, you know, somewhat of an elevated surface that is going to hold its shape. So it has to be durable but at the same time, transparent in certain places. And after messing around with a bunch of different materials, honestly, plastic bowls just ended up working great. So, cutting them out for the little lava patches was awesome because I could put a little diffusion on the top, a little on the bottom, maybe sandwich another layer in there then have a nice surface to paint that I could mesh in with the plaster. So you can see we're starting to get the overall idea of how this is gonna come together. And I've just thrown together really quick and dirty lighting samples here. You can see the lava over to the side here which will have Chamander, some cool flowing effects in there, and then that will be our lake where we will have our Bulbasaur. I mean Squirtle. Now we just have to paint. I like paint. Very tired, but it feels good. But more importantly because apparently college never dies, I'm drinking Monster again. It's gonna be a hell of a year. All right, we got something fresh from the Laser Etcher. - Okay. - And they were engraved by laser. - Check that out. - Yo, that looks pretty cool. Oh dude. Especially when you get some light on that. So this is the first time that we've actually had glass etched side panels for a build. We've done stuff like vinyls and what not but this looks so, so sick. The thing is, I think it gives a level of sort of customization to assist them that you don't usually see. So the fact that we were able to get the Leonhart logos etched onto the glass, I personally think, takes this bill to an entirely different level. So one of the things we are doing just to keep everything even here is that we're going full Corsair RGB across the board. So I went and picked up six LL 120s. not cheap. However, we wanna make sure that everything is consistent that we can run everything through IQ. We don't have to deal with multiple types of RGB. Cause we've done that before and it's not fun. - [Ken] Corsair is the only ones that's allowed to make RGB program. - So the main reason that we opted to go for the Kraken Z this is the model that has the LED screen. You can kind of see it right here. So this entire thing is a display so we can put whatever we want on it. Which will look a lot better than the the test heat sink we have on here. I'm just gonna take that off. I don't like looking at that. So we still need to install obviously the AIO, the fans, get some of the RGB strips in, where is the diorama? How is the inside looking? Cause I know you're building that all still separate, right? - So here's where we're at right now. (Austin laughing) Wes, Wes, this is so cool. Look at Charmander! - [Wes] There he is. - Oh, that is so cool. - So, there is test animation going right now. So you can kind of see the lava flowing underneath there. And right now that's about half of the pour,. We're going to go up all the way to about the edge here and this branch, which comes around to kind of form the puddle is actually what holds up the GPU. - [Austin] Oh, dude. This is legit. - So I've been a part of a few custom builds now. And this one is the most similar to Grounded because of all the miniatures and model work. But I like this one a little better than that in a way because it gave me restrictions to work within, I mean physical restrictions were in the base of the computer case, more problem solving which is always a fun part of the, of the process. - I really did not want Leonhart to see this system at all. I tried to keep myself from teasing it on Twitter and everything. 'Cause I really wanted to see his genuine reaction. I really, really hope that he's surprised and he likes it and he doesn't look at the system go. No. Is that like cool or something? He's nice. He probably like pretend to like it even if he didn't. (Austin laughing) whenever you're ready, spin around and take a look. - All right, man, I've been waiting a long time for this and, oh my gosh! There is actually like a diorama going on in my computer right now. There's a Charmander, Bulbasaur, my boys Squirtle, you even included in this? And then you got Red. There's even a GIF of him running right now. Oh my gosh. I seriously am going like numb right now. It's like I pulled a first edition base set Charizard. (Austin laughing) For me, this is what like embodies Pokemon for me. It's the original starter Pokemon. And you somehow made a whole like \"diorama\" is if that's the word, got like the colors and oh my, I didn't even see it. Oh my, you have my logo etched in the sides of it. And it's in the Leonhart in the front of it. Is this mine? - This is all yours, man. The ultimate Pokemon game PC for the ultimate Pokemon YouTuber. So you've got yourself, you Ryzen 7 5800X, plenty for editing gaming, streaming, the whole deal and RTX 3080. You've got yourself tons of LED lighting and RGB lighting literally everywhere. But we also have a 4K capture card built in and we have another one for the external. - This is exactly what I was looking for. This is just gonna allow me to move forward as a content creator and just help like overall my whole community, you know. And the Pokemon community in general, you know. I can start doing hopefully better content from here. - Dude, you've done so much for the community. This is the least I could do to give back. I mean like you've changed the whole game in such a big way. Hopefully this PC is at least one small part of helping you kind of push things forward. This has been one of my favorite gaming PC builds we've ever done. I remember those early days where some of the builds I would do like hardly even worked and what not. I was like, trying my best to make something that was cool. And we've come from that to delivering something which my favorite YouTuber in the world thinks is awesome. I mean, I'm not sure what more you could ask for. It's a happy ending and a great reason for you to Ringaling the Dingaling bell, subscribe to the channel, and stay tuned for other nefarious ideas like this. Maybe we'll build a Digimon game PC next. Oh boy, 1999 called and wants its ideas back.",
    "transcript_keywords": [
        "ultimate Pokemon",
        "Pokemon",
        "Adobe Premiere Pro",
        "Premiere Pro",
        "ultimate Pokemon Gaming",
        "make",
        "Pokemon Gaming",
        "Pokemon cards",
        "Pro",
        "game",
        "system",
        "Ryzen",
        "ultimate Pokemon YouTuber",
        "ultimate Pokemon game",
        "Adobe Premiere",
        "put",
        "board",
        "kind",
        "Squirtle",
        "cool"
    ],
    "transcript_entity_values": [
        "Photoshop",
        "the Ryzen 7 5800X. Brand",
        "at least a",
        "YouTubers",
        "4D",
        "TikTokers",
        "first",
        "Twitter",
        "Adobe Premiere Pro",
        "120",
        "two",
        "AMD",
        "Swiss",
        "a year",
        "Trident Z Neo",
        "5800X",
        "980",
        "one",
        "Corsair RGB",
        "Good Smile Company",
        "nine years ago",
        "32",
        "Chamander",
        "Trainer Red",
        "Adobe",
        "GPU",
        "2021",
        "third",
        "an additional one terabyte",
        "six LL 120s",
        "Charizard",
        "YouTuber",
        "1999",
        "5000",
        "Ryzen",
        "the Kraken Z",
        "G Skull Trident",
        "seven gigabytes",
        "at least one",
        "Ken",
        "Austin",
        "the Ryzen 7",
        "one terabyte",
        "Nendoroid",
        "PCI",
        "Lian Li - From",
        "eight years ago",
        "today",
        "PS5",
        "Squirtle",
        "AIO",
        "a hundred",
        "Premiere",
        "Ringaling the Dingaling bell",
        "eight",
        "a few months old",
        "RGB",
        "the Laser Etcher",
        "IKEA",
        "Xbox",
        "Pokemon Gaming PC",
        "AI",
        "Trainer Red",
        "Pokemon",
        "Leonhart",
        "every day",
        "CPU",
        "eBay",
        "Ryzen",
        "One",
        "Premiere Pro",
        "Wes",
        "Lian Li",
        "Leon",
        "three",
        "Pokemon YouTuber",
        "RAM",
        "Athlon",
        "3080",
        "Pokemon",
        "Today",
        "4",
        "Digimon",
        "YouTuber",
        "early days",
        "about half",
        "Nendoroid",
        "Elgato",
        "Game Boy",
        "Ken] Corsair"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "NORP",
        "LAW",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "EVENT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "GPE",
        "NORP",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "PERSON"
    ],
    "vector": [
        -0.03820532187819481,
        0.011459541507065296,
        0.03386098891496658,
        -0.10374864190816879,
        0.01671823300421238,
        -0.030118165537714958,
        0.020748717710375786,
        0.026156539097428322,
        -0.021027592942118645,
        -0.003863902762532234,
        -0.10292070358991623,
        -0.010110451839864254,
        -0.058759905397892,
        0.03660464286804199,
        -0.007329746149480343,
        0.0031291982159018517,
        0.08378146588802338,
        -0.012635503895580769,
        -0.06855912506580353,
        0.08958227932453156,
        -0.014226972125470638,
        -0.10618443042039871,
        -0.024221593514084816,
        -0.04004404693841934,
        -0.05683797597885132,
        0.07036645710468292,
        0.045755498111248016,
        0.04542672634124756,
        0.009574783965945244,
        -0.07624518871307373,
        0.03111216053366661,
        0.021829914301633835,
        0.036776043474674225,
        0.01666017808020115,
        -0.06705330312252045,
        -0.07664588838815689,
        0.015004433691501617,
        -0.013468679040670395,
        -0.050710681825876236,
        -0.059717338532209396,
        -0.005527433007955551,
        0.061844754964113235,
        -0.004968027118593454,
        0.08921737968921661,
        -0.03534916415810585,
        0.04851702228188515,
        0.013781090267002583,
        -0.05228175222873688,
        -0.024591637775301933,
        -0.004836746957153082,
        -0.06671755015850067,
        -0.08827205002307892,
        -0.026449300348758698,
        -0.024756629019975662,
        -0.011593815870583057,
        0.08021733164787292,
        0.019696025177836418,
        -0.08980696648359299,
        0.06139228120446205,
        -0.048290498554706573,
        0.07008464634418488,
        0.010930865071713924,
        0.04784673824906349,
        0.03973929584026337,
        -0.0376116968691349,
        -0.04277816414833069,
        -0.016709547489881516,
        0.026985768228769302,
        0.10985035449266434,
        -0.10873615741729736,
        0.054152317345142365,
        0.04564299434423447,
        -0.009636454284191132,
        -0.005399835295975208,
        -0.04647501930594444,
        0.021686991676688194,
        -0.017309272661805153,
        -0.03354578837752342,
        -0.04424341395497322,
        0.05039726942777634,
        0.038302481174468994,
        0.01738850586116314,
        -0.03658125922083855,
        0.037386953830718994,
        0.003865746781229973,
        0.044487424194812775,
        0.02540605515241623,
        0.0035323835909366608,
        -0.04889592155814171,
        -0.006263789255172014,
        -0.020023327320814133,
        0.1508304923772812,
        0.02040272392332554,
        -0.03853924199938774,
        0.018280325457453728,
        0.05839361995458603,
        -0.013484354130923748,
        -0.15512718260288239,
        -0.07731526345014572,
        0.06220892071723938,
        0.05986236780881882,
        -0.009895301423966885,
        0.09202225506305695,
        0.03917796164751053,
        0.014691775664687157,
        -0.03998977690935135,
        -0.06122727692127228,
        0.023975063115358353,
        0.010625457391142845,
        0.003706766525283456,
        0.029365908354520798,
        -0.0998678207397461,
        -0.09594959765672684,
        0.03512649983167648,
        0.017304541543126106,
        0.02632853575050831,
        -0.09821363538503647,
        0.07504335045814514,
        -0.023239465430378914,
        0.018315263092517853,
        0.038294147700071335,
        -0.030351564288139343,
        -0.06416211277246475,
        -0.007700897287577391,
        0.07851329445838928,
        0.03896726295351982,
        -0.06305696815252304,
        2.6392875073913722e-33,
        0.028391296043992043,
        0.10503026843070984,
        -0.07267693430185318,
        0.057777781039476395,
        0.010417946614325047,
        0.02052675001323223,
        0.054984066635370255,
        0.01113399863243103,
        -0.05512567609548569,
        0.06613778322935104,
        -0.025191064924001694,
        0.06520771980285645,
        -0.0951225608587265,
        0.10991174727678299,
        0.09412337094545364,
        -0.08956485986709595,
        -0.02531810849905014,
        0.004095384385436773,
        -0.05415103957056999,
        0.028369028121232986,
        0.03476905822753906,
        -0.008351734839379787,
        0.029733899980783463,
        -0.025049226358532906,
        -0.02370106242597103,
        0.013113141059875488,
        -0.06056414917111397,
        -0.07602300494909286,
        0.0561915785074234,
        -0.011475741863250732,
        -0.06266960501670837,
        -0.05639045685529709,
        -0.008189143612980843,
        0.028516406193375587,
        0.010182294063270092,
        -0.07991742342710495,
        -0.03517618775367737,
        -0.1316905915737152,
        0.0035371293779462576,
        0.05157943442463875,
        -0.028327427804470062,
        0.04847988858819008,
        -0.06319624185562134,
        -0.030210647732019424,
        -0.05332060903310776,
        0.00268844747915864,
        0.12362892180681229,
        -0.01152721792459488,
        -0.08629326522350311,
        -0.06128176674246788,
        -0.0016291519859805703,
        -0.015153823420405388,
        0.08440064638853073,
        -0.056320954114198685,
        -0.03996512293815613,
        -0.09025367349386215,
        0.005758230108767748,
        0.012633072212338448,
        0.10830279439687729,
        -0.021642591804265976,
        -0.006361482664942741,
        -0.01828950271010399,
        -0.0015815807273611426,
        0.058284301310777664,
        -0.04071689024567604,
        0.0241074301302433,
        0.0622091181576252,
        0.027441086247563362,
        0.05222015827894211,
        -0.004580020904541016,
        -0.03189172223210335,
        -0.022626115009188652,
        -0.009306703694164753,
        -0.05908923223614693,
        0.028294889256358147,
        -0.015401293523609638,
        -0.04677334055304527,
        -0.01787405274808407,
        -0.06979197263717651,
        0.03324567899107933,
        -0.09532670676708221,
        0.040470968931913376,
        -0.06643430143594742,
        0.04165314882993698,
        -0.033898595720529556,
        -0.0385155975818634,
        0.10239023715257645,
        0.02351667359471321,
        -0.0065696220844984055,
        0.027542302384972572,
        -0.06673751026391983,
        0.008626054972410202,
        0.009038432501256466,
        0.010377507656812668,
        0.04307880997657776,
        -3.567946411640211e-33,
        -0.02979852631688118,
        -0.11076147854328156,
        0.011607123538851738,
        -0.017029307782649994,
        0.06006835028529167,
        -0.03761734813451767,
        0.019499775022268295,
        0.036513783037662506,
        0.03771812468767166,
        -0.0430261604487896,
        -0.01467603724449873,
        0.08359899371862411,
        -0.02844497188925743,
        -0.05392380431294441,
        -0.06424732506275177,
        0.0048565031029284,
        0.024726592004299164,
        -0.003455620026215911,
        0.00043473177356645465,
        -0.07145626097917557,
        0.005397755652666092,
        0.04002511128783226,
        -0.039149340242147446,
        0.006328360177576542,
        0.006179493386298418,
        0.07899796217679977,
        0.08660043030977249,
        -0.14626771211624146,
        -0.0013842764310538769,
        0.04820425063371658,
        -0.001255529816262424,
        -0.01869361288845539,
        0.028335437178611755,
        0.09134785085916519,
        0.04034276679158211,
        0.029771139845252037,
        0.12718649208545685,
        0.0007493049488402903,
        -0.024022933095693588,
        -0.032714590430259705,
        0.014987483620643616,
        0.028743624687194824,
        -0.016392245888710022,
        0.013339283876121044,
        0.04007772356271744,
        -0.020049192011356354,
        -0.007544882129877806,
        0.041264858096838,
        0.00434756837785244,
        0.033750224858522415,
        -0.0038715219125151634,
        0.037252239882946014,
        -0.025883283466100693,
        -0.05695998668670654,
        -0.008997020311653614,
        -0.09111553430557251,
        0.02245093695819378,
        0.010190715081989765,
        0.06926612555980682,
        -0.01512931752949953,
        -0.005992887541651726,
        -0.05677841976284981,
        -0.06243850663304329,
        -0.01745784655213356,
        -0.023294171318411827,
        0.06424615532159805,
        0.08640257269144058,
        0.005542723927646875,
        -0.009812546893954277,
        -0.035036422312259674,
        -0.002341656247153878,
        -0.007026149425655603,
        -0.01869993470609188,
        0.006884045898914337,
        0.06609473377466202,
        0.007433319464325905,
        0.061401769518852234,
        -0.025222934782505035,
        0.07911539077758789,
        -0.0044865794479846954,
        -0.059817731380462646,
        -0.014184478670358658,
        0.05634342133998871,
        0.009140167385339737,
        0.12554270029067993,
        0.025592174381017685,
        -0.018739286810159683,
        0.03571125492453575,
        -0.00832346174865961,
        -0.07374388724565506,
        0.04630209133028984,
        0.09911897778511047,
        0.008564407005906105,
        0.036073725670576096,
        0.04628917947411537,
        -5.587758522551667e-08,
        0.024255698546767235,
        -0.04671813175082207,
        0.019936377182602882,
        0.019107533618807793,
        -0.02528616413474083,
        -0.03729420527815819,
        -0.030988555401563644,
        -0.08059199154376984,
        0.04596671089529991,
        -0.03930312767624855,
        0.061302103102207184,
        -0.06749830394983292,
        -0.053638752549886703,
        0.015943331643939018,
        0.07622478157281876,
        0.030304651707410812,
        -0.025959942489862442,
        0.05640123784542084,
        -0.07213252782821655,
        0.06181236356496811,
        -0.031046446412801743,
        0.012267941609025002,
        0.024364104494452477,
        -0.04898134246468544,
        -0.06902262568473816,
        -0.041975945234298706,
        -0.040383465588092804,
        -0.08044440299272537,
        0.007399885915219784,
        -0.006112892646342516,
        0.06750858575105667,
        0.0008383257663808763,
        0.09858543425798416,
        0.0028148111887276173,
        0.04803025349974632,
        -0.051144327968358994,
        -0.024601951241493225,
        0.047457389533519745,
        0.05398993194103241,
        -0.00030707442783750594,
        -0.04829201474785805,
        -0.10410530120134354,
        -0.022229129448533058,
        -0.028852174058556557,
        -0.010320944711565971,
        -0.036235418170690536,
        0.022581931203603745,
        -0.1330813467502594,
        -0.0225220900028944,
        0.07643324881792068,
        -0.03552756458520889,
        -0.024556055665016174,
        0.02576521784067154,
        0.014648995362222195,
        0.08282124996185303,
        0.011220005340874195,
        0.01655084639787674,
        0.03679871931672096,
        0.04206546023488045,
        -0.04431572183966637,
        0.0154488580301404,
        0.052411798387765884,
        -0.04136376455426216,
        0.029418887570500374
    ]
}