{
    "id": "jkCiozY-DGA",
    "title": "Sorry, But I LIKE This Keyboard! - Logitech POP Keys",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-12-01T20:18:41Z",
    "video_url": "https://www.youtube.com/watch?v=jkCiozY-DGA",
    "category": "Science & Technology",
    "tags": [
        "Sorry Buy I love This keyboard",
        "This keyboard made me cry with tears of joy",
        "keyboard",
        "LLogitech",
        "Gaming",
        "PC",
        "Personal",
        "Logitech",
        "Mouse and Keyboard",
        "Silent",
        "Circule",
        "Key caps",
        "Keys",
        "Switches"
    ],
    "views": 1267884,
    "likes": 29418,
    "comments_count": 1223,
    "description": "Learn more about MSI's MPG Z690 Carbon WiFi motherboard at   Plouffe is someone you typically see using a highly customized keyboard, but it must be unique when you see him excited for something mainstream. The Logitech POP Keyboard and mouse are reasonably attractive in general but valuable for specific use cases.   Buy Logitech POP KEYS Round Button Bluetooth Mechanical Keyboard On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy Logitech POP Mouse On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/AKFtx",
        "https://geni.us/CIfAImi",
        "https://geni.us/ER9U",
        "https://geni.us/0P0n",
        "https://geni.us/RiBa0yv",
        "https://geni.us/9ZvOB",
        "https://geni.us/XQegHWB",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Okay guys, hear me out. Yes, there's emojis. Yes, it's yellow and black and gray, but, I kinda like it. I've been wanting to buy a set of keycaps like this for a long time actually 'cause I love the idea of typing on like an actual typewriter. Yeah, it's a Logitech Mechanical Keyboard. It's not gonna be like amazing feeling, but I don't think they're the Romer-G switches, which is actually a huge upgrade. I hate those things. Apparently they are these like Logictech Brown switches or something. So I'm kind of excited to try those. And then to top it off, there's a pop mouse as well. - [David] Ewww - My only disappointment so far is that we got the yellow one, instead of, it comes in like three different colorways I think. And I really liked the other ones a lot more. Like I'm not, I'm just not big on yellow, but I mean let's open it up and see how it looks. Yeah, so the packaging is actually really nice. Like I love this whole GET EXPRESSIVE #PersonalityThatPOPS. I hate emojis, I never use them in like just about anything unless I'm texting my girlfriend. I'll take a look at the keyboard in a second. I actually really like the wrapping that they've got on here with their Logitech logo. And then on the interior, you've actually got this really nice, just kinda quick start guide inside the actual box itself. I'm on the fence about it because I like having actual guides that you can put somewhere if you need them with this, you have to keep the box, which is a little unfortunate. And I mean, yeah, this is just warranty and like don't chew on batteries and stuff like that. You don't need that. Comes with these four extra emoji keys. I think there's probably four already pre-installed on the board, but you get four extra as you can swap these as you want. It looks like they're just like cherry cross stems. You also get a you know USB dongle. But that's actually it, there's not much else in the box here. So I think this is the one big difference here is that this is like a purely wireless keyboard. You can't plug it in I don't think, but they do offer up to three years of battery on the keyboard and then two years of battery on the mouse. Oh yeah, there's a little double A sticker here. Okay, so that's not bad. All right, So one double A is supposed to give you like two years of charge on this thing. Oh, it's magnet. I wish the magnet was a little stronger. Yeah, see like, boom. It just comes apart, no problem. But I do like the idea that it's a magnet. So I mean, as soon as you do drop it or break it, well, you're not gonna break it. But as soon as you do drop it, it's just gonna fall apart instead of breaking one of the clips and then being forever stuck without it. That being said it is silent, but I really hate the click on this thing. It feels-- - [Jono] There's no click. - It's like a membrane switch on the key on the mouse and I really don't like it. The scroll wheel feels okay. It's nothing extravagant. It's nice and smooth and spins a little bit after you like power scroll. As much as I hate the way this feels, it is super silent. So I could see this being a good thing for office environments and stuff. So this middle click is supposed to be like an emoji button or something. Now for the keyboard 'cause this is what I care about a lot more. Ooh, okay. I really like this so. - [Jono] That looks pretty sick actually! - Oh, I don't hate this. I'm pretty sure these are Browns 'cause there's not a very huge bump there. But it's there it's present for sure. I actually really like this already. I don't know. I'm probably. - [Jono] \"Oh, I'm gonna sell out!\" - Yes, the spacebar is a little like high-pitched and it's not super rattling, but it doesn't sound great. But you could probably fix that. Oh, yeah, keys are good. So you we've got our emoji keycaps, prayer hands, fire you know, as keyboards fire, you got the heart emoji that's my favorite, I heart everything and thumbs up. So yeah, honestly right out of the gate, I actually kinda like typing on this thing. It feels okay. It's not the best typing experience I've ever had in my life. And the spacebar it leaves a bit to be desired, but these switches are tolerable. I am probably gonna go home and buy a set of like rounded keycaps like this. Coming with the keyboard itself you've got the-- - [Jono] Go back! Go back! - What! - [Jono] Look at that Escape key! - Oh yeah, the Escape key is like gold. I mean, that's pretty sweet. It does look like they've got some Mac stuff too, like there's a command and an Option key here. So you could switch this to Mac 'cause they're a little Mac switch on it. Like some of the other keyboards I've looked at, I don't know what that is probably an on, off switch. And yeah, this battery on the back. Two double A's will last you three years on the keyboard. That's not bad. Oh, and there's a nice little dongle holder on the keyboard itself too. Similar to our other keyboards we're about a banana and 1/4, 1/3 long. The heft I think is probably like a pound and a half, two pounds. The typing angle, it looks like it's pretty fixed. There's no feet on this thing. Just rubber grippy stoppers. I don't hate this thing nearly as much as I thought I would probably because they've changed the switches to these Browns, which is great. You can't take them out. It's not hotswap. So you can't really customize the board all too much. But you know, I don't think you need to switch these like the Roamer-G's don't feel good. These aren't bad. So they give us these four emoji keys here. But then on the board with it are like your typical like heart eyes emoji, crying emoji, smiling emoji, crying laughter emoji and then this one's just like, I don't know, three phases. I don't even know what that emoji is. - [David] Maybe that's like the emoji shortcut. - So there's three different colorways. This comes in Daydream, Blast and Heartbreaker. So now we're gonna try gaming on this thing, but first a word from our sponsor MSI. Now that the new CPU's are here, the new motherboards are here to. MSI has got their new MPG Z690 Carbon WIFI supports 12th Gen Intel processors with the LGA 1700 socket and it's got support for DDR5 memory up to 6,666 megahertz. Man that's fast. It's got the latest PCIE 5.0 solution with up to 128Gb/s bandwidth for maximum transfer speed. It's also got their enhanced power design and Premium Thermal Solution for all you overclockers out there. Learn more at the link below. Logi Pop Mouse connecting. So this thing can switch between I think 404,000 DPI, which is okay, gaming mouse can go higher, but you know it's not really for gaming. It feels okay. The clicking though, oh God, it feels terrible. - [David] Gotta do some typing. - And that does bring up the emoji menu. Oh my God! Emoji no. Emoji thought I was supposed to be able to like hit this and have an emoji come up. There's probably something I'm missing here. I don't know how much I like actually typing on these. They feel okay normally. But the problem is the keys go so far down that your finger is a little deep when you go to move it away. I feel like I'm gonna run into other keys as I type and I have a feeling my typing test is not gonna go very well. That's not bad. So I got like 114 words per minute. 97% accuracy. It's worse than what I can do, but it's honestly not terrible. Especially for one of the first times typing on this thing. You do encounter what I just mentioned, where your fingers kind of rub against other keys as they're coming up, 'cause it's just so deep. But it wasn't nearly as obtrusive as I thought it would be. Is it the best sounding keyboard I've ever used? No, like not by a longshot. I think the main problem is the plastic. It makes it feel a little hollow. Like there's no big, deep, deep thought that you would get from like a metal case with foam or a wooden case with foam. But honestly I think that this sounds better than a lot of other things I've typed on that were like relatively cheap mechanical keyboards. Yeah, so there's not much customization, but there are a ton of like actually pretty well thought out different functions that you can use. If these emoji keys work for Twitch chat and stuff. Honestly, I can see there being a lot of use there, especially if you're streaming and you wanna just like quickly answer like no crying emoji. The mouse is super quiet as well. So if you want it to control some stuff on the download, you can totally like, can you hear that? - [David] Nope. - It glides pretty easy. It's a little heavy for how big it is. This isn't too bad. I mean, you know, it's a mouse like I've gamed on worse. I can't count the number of times I've had to use some like pretty much this kind of Logitech mouse. That's like $10 and staples. Except you know what, at least this one's colorful. I don't like that. I can't hear the clicks. I don't know what it is. Yeah, the keyboard feels okay. If I spilled some Mountain Dew on my old keyboard and this was like the only thing I had to use, then I would probably be okay with it. The mouse not so much. I think for office work, it's perfectly fine. But for gaming, yeah, I'm just, ooh, that was a nice head shot, for gaming, no thanks. One big thing I'd like to mention that I haven't yet is if you like the color scheme of these guys, they're not out yet so we don't have one, but Logitech is putting out desk pads at some point in the future and you can get ones to match. So you can really build a whole aesthetic in one simple package. So if you want something that has a really nice color scheme, and you're not the biggest keyboard snob ever, but you wanna like get a half decent mechanical keyboard at an okay price. I think this is about 100 bucks and the most is like 40. Like you're not paying, you know $100 for this mouse. So that's totally okay. I think this is a solid option for you. Not a lot of people are gonna like the emoji key stuff, but let's be real, you can just take those off and never use them. I wish it was the purple one though. - [David] Yeah. - But no big deal. Oh, I just got a double (gently laughing). If you like the way this thing looks and you wanna check it out, feel free to look at our affiliate links below. It's the Logitech pop keyboard and mouse combo. And if you like this short circuit, make sure to look at the NuPhy keyboard that we just unboxed recently. It's a super slim mechanical keyboard with some low-profile gaterons on it and it comes with a free Waifu.",
    "transcript_keywords": [
        "emoji",
        "Keyboard",
        "Yeah",
        "thing",
        "mouse",
        "emoji keys",
        "keys",
        "feels",
        "typing",
        "Mechanical Keyboard",
        "Logitech",
        "pretty",
        "keyboards",
        "key",
        "hate",
        "kind",
        "feel",
        "nice",
        "switch",
        "stuff"
    ],
    "transcript_entity_values": [
        "up to three years",
        "Emoji",
        "half",
        "three years",
        "12th",
        "1/4",
        "three",
        "a ton",
        "One",
        "about 100 bucks",
        "40",
        "5.0",
        "one",
        "Premium Thermal Solution",
        "USB",
        "two years",
        "emoji",
        "Twitch",
        "Gen Intel",
        "Mac",
        "Romer",
        "emoji",
        "LGA 1700",
        "Logitech",
        "404,000",
        "second",
        "Browns",
        "two pounds",
        "6,666 megahertz",
        "Waifu",
        "DDR5",
        "100",
        "first",
        "97%",
        "MSI",
        "NuPhy",
        "Daydream, Blast and Heartbreaker",
        "four",
        "1/3",
        "128Gb/s",
        "Mac",
        "the Roamer-G's",
        "Two",
        "Logictech Brown",
        "CPU",
        "10",
        "114"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "FAC",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.07569196820259094,
        -0.0705997496843338,
        0.03539241477847099,
        -0.09426448494195938,
        0.05432083085179329,
        0.05273738130927086,
        0.124192014336586,
        0.08329357206821442,
        0.02366313524544239,
        0.07999487221240997,
        0.08299417793750763,
        0.021409986540675163,
        -0.001848579733632505,
        -0.006466960534453392,
        0.08441314101219177,
        -0.017211459577083588,
        -0.02137828804552555,
        -0.05123497545719147,
        -0.031267210841178894,
        0.013207885436713696,
        0.008559263311326504,
        -0.08123096078634262,
        0.06711342930793762,
        0.02483389899134636,
        -0.028637109324336052,
        -0.09122762084007263,
        0.02695043757557869,
        -0.011041095480322838,
        0.029650213196873665,
        -0.010459678247570992,
        -0.031471528112888336,
        0.053537771105766296,
        0.04062803462147713,
        -0.01635146513581276,
        -0.08874360471963882,
        -0.0809725895524025,
        0.12236341089010239,
        -0.044002093374729156,
        -0.05693969130516052,
        -0.04619963839650154,
        -0.03757840767502785,
        0.005156866740435362,
        0.08315437287092209,
        0.03398800641298294,
        0.03977717459201813,
        0.010500730946660042,
        -0.008618638850748539,
        -0.030418554320931435,
        -0.03624941408634186,
        0.12523940205574036,
        -0.008024991489946842,
        -0.08965803682804108,
        0.05723279342055321,
        -0.029639218002557755,
        -0.03782319277524948,
        0.015797846019268036,
        -0.024666042998433113,
        -0.03106459230184555,
        0.09241727739572525,
        -0.04527299478650093,
        0.035798195749521255,
        -0.08698720484972,
        -0.07133258879184723,
        0.020849987864494324,
        -0.011007294058799744,
        0.029602734372019768,
        -0.024983588606119156,
        -0.05174064263701439,
        -0.03786153346300125,
        -0.04610336944460869,
        -0.02765701338648796,
        -0.07473187148571014,
        -0.005513241980224848,
        0.03942114859819412,
        -0.04454527050256729,
        -0.025036346167325974,
        0.052210960537195206,
        -0.029414286836981773,
        0.0254483874887228,
        0.07964435964822769,
        -0.05320035293698311,
        -0.0006327376468107104,
        -0.044633328914642334,
        -0.0023510060273110867,
        0.027367020025849342,
        -0.033801253885030746,
        0.040977273136377335,
        0.056911539286375046,
        0.006342003121972084,
        -0.057653579860925674,
        -0.013133492320775986,
        0.0772600993514061,
        0.008633204735815525,
        -0.003267771564424038,
        0.015374734997749329,
        0.018422462046146393,
        0.05031227320432663,
        -0.0834343284368515,
        -0.01809690333902836,
        0.041256558150053024,
        0.045847658067941666,
        0.03055255487561226,
        0.05314762890338898,
        -0.057166799902915955,
        -0.055574193596839905,
        -0.05496809259057045,
        -0.019526375457644463,
        0.07701651751995087,
        -0.001077686669304967,
        -0.029834730550646782,
        -0.04892183467745781,
        0.016107259318232536,
        -0.04569298028945923,
        0.03028962016105652,
        0.018087690696120262,
        0.01853291131556034,
        -0.03546665236353874,
        0.017972569912672043,
        0.10285758227109909,
        -0.01137352455407381,
        -0.01346520520746708,
        -0.01973484270274639,
        -0.1277145892381668,
        -0.010652248747646809,
        -0.03374578058719635,
        0.04088205844163895,
        -0.0588960275053978,
        7.308899143098569e-33,
        0.009035767056047916,
        0.13629519939422607,
        -0.05070578306913376,
        -0.08563536405563354,
        0.048367880284786224,
        0.06625312566757202,
        0.08100535720586777,
        -0.020936144515872,
        -0.06867595762014389,
        0.018958499655127525,
        -0.09051202982664108,
        0.030163882300257683,
        -0.09774833172559738,
        0.014593959785997868,
        0.010461739264428616,
        -0.0792679712176323,
        -0.044974882155656815,
        0.060172274708747864,
        -0.023835645988583565,
        -0.012466681189835072,
        0.0010481582721695304,
        0.005777033977210522,
        0.06809710711240768,
        0.02176775224506855,
        0.1516035944223404,
        0.029140764847397804,
        0.03053029626607895,
        -0.04901610314846039,
        0.02715536393225193,
        0.007962330244481564,
        -0.0069589936174452305,
        -0.010846582241356373,
        -0.05396859720349312,
        -0.08465585112571716,
        -0.05712644383311272,
        -0.02678745426237583,
        -0.0863807424902916,
        -0.09092513471841812,
        0.03805305436253548,
        -0.045270442962646484,
        -0.029474250972270966,
        -0.029031861573457718,
        -0.08734016120433807,
        -0.024438854306936264,
        0.012383482418954372,
        0.0042199017480015755,
        -0.03409356251358986,
        0.02442517876625061,
        0.06417983025312424,
        -0.059962812811136246,
        -0.0671985000371933,
        -0.036404501646757126,
        -0.11141771823167801,
        -0.027802864089608192,
        -0.037712592631578445,
        -0.07274367660284042,
        -0.030144236981868744,
        0.04437268152832985,
        0.012972958385944366,
        0.06080900505185127,
        0.031232565641403198,
        0.06007539853453636,
        0.15323391556739807,
        -0.005471160169690847,
        -0.0166801605373621,
        0.015486195683479309,
        0.07834944128990173,
        -0.04010145738720894,
        -0.03524889796972275,
        -0.026575110852718353,
        0.026472918689250946,
        -0.04468178376555443,
        0.013715439476072788,
        0.0009347569430246949,
        -0.03613528609275818,
        -0.007711903192102909,
        0.0010802051983773708,
        -0.04995018616318703,
        0.01786072552204132,
        0.007805405650287867,
        0.009776274673640728,
        0.01595109887421131,
        0.012773525901138783,
        0.08654450625181198,
        0.003658762201666832,
        -0.007350727915763855,
        -0.058366574347019196,
        -0.08306419849395752,
        -0.026773476973176003,
        -0.013894698582589626,
        -0.028718460351228714,
        -0.0031927635427564383,
        -0.06614009290933609,
        -0.02240854687988758,
        -0.08430776745080948,
        -7.430655378588803e-33,
        -0.048536498099565506,
        -0.004940879996865988,
        0.02460017055273056,
        0.060141220688819885,
        -0.025443850085139275,
        0.01828409731388092,
        -0.005062000826001167,
        -0.07261048257350922,
        0.05138322710990906,
        -0.0737687423825264,
        -0.00023967969173099846,
        0.035772234201431274,
        0.041403431445360184,
        -0.02473391778767109,
        -0.012255363166332245,
        0.03203892707824707,
        0.01754368655383587,
        -0.03190474584698677,
        0.04486114904284477,
        -0.09060372412204742,
        0.09295904636383057,
        -0.050934601575136185,
        -0.06710038334131241,
        0.09710762649774551,
        0.026959829032421112,
        -0.02866111695766449,
        -0.0032411713618785143,
        0.061973318457603455,
        0.0047274562530219555,
        0.003004099940881133,
        -0.03919514641165733,
        0.0616455003619194,
        0.01699029467999935,
        -0.04741303622722626,
        0.09183071553707123,
        0.004030007403343916,
        0.05475878342986107,
        0.0828198492527008,
        0.023342927917838097,
        0.04021114483475685,
        0.013360410928726196,
        -0.03394477441906929,
        0.12618350982666016,
        -0.02025088295340538,
        -0.010827548801898956,
        -0.10454495996236801,
        -0.032015811651945114,
        -0.06816215813159943,
        0.02773810178041458,
        0.06541245430707932,
        0.005283639300614595,
        -0.08585019409656525,
        0.07778426259756088,
        -0.06605786830186844,
        -0.10173241794109344,
        -0.013879005797207355,
        -0.06360029429197311,
        -0.011822303757071495,
        -0.016136307269334793,
        -0.04513729736208916,
        -0.0015763120027258992,
        -0.014319025911390781,
        0.05441480129957199,
        0.09372853487730026,
        -0.007774378173053265,
        -0.047259870916604996,
        0.08413953334093094,
        -0.0019925751257687807,
        -0.04873717948794365,
        -0.026781698688864708,
        0.03676750138401985,
        0.025260210037231445,
        0.07553283125162125,
        -0.02432570420205593,
        -0.011035180650651455,
        0.07725869864225388,
        0.014530121348798275,
        -0.002050457987934351,
        -0.005040571093559265,
        -0.055043283849954605,
        0.06881789118051529,
        0.05957809090614319,
        0.08411930501461029,
        -0.01369092334061861,
        -0.016007721424102783,
        0.07774142175912857,
        0.021992092952132225,
        0.02973080240190029,
        -0.050870876759290695,
        0.020095963031053543,
        -0.053184617310762405,
        0.031600628048181534,
        -0.0028138533234596252,
        0.04956713691353798,
        0.014742383733391762,
        -5.959023141599573e-08,
        0.006603792309761047,
        0.02387314662337303,
        0.07226918637752533,
        0.020696109160780907,
        -0.00028587609995156527,
        0.0011105326702818274,
        0.02499796636402607,
        -0.032528430223464966,
        -0.0057072946801781654,
        -0.06514390558004379,
        -0.03182459622621536,
        -0.06279345601797104,
        0.02819792367517948,
        0.036732278764247894,
        0.03469051420688629,
        0.08292064815759659,
        -0.07477998733520508,
        0.03656500577926636,
        -0.025113917887210846,
        -0.017840659245848656,
        0.02194969542324543,
        -0.017655733972787857,
        0.09490127116441727,
        0.021512312814593315,
        -0.012118957005441189,
        0.01916380785405636,
        -0.012465721927583218,
        0.13582973182201385,
        0.10236950218677521,
        -0.03142433241009712,
        0.004081951454281807,
        0.03009030409157276,
        0.03941457346081734,
        -0.024723302572965622,
        -0.04366505891084671,
        -0.028363509103655815,
        -0.020504146814346313,
        0.04723887890577316,
        -0.041887857019901276,
        0.05950916185975075,
        -0.014448972418904305,
        -0.0674329549074173,
        -0.03170686587691307,
        -0.03374660760164261,
        -0.07790315896272659,
        -0.01615084894001484,
        -0.016590921208262444,
        -0.038965173065662384,
        -0.0015934675466269255,
        0.10208645462989807,
        0.013205708004534245,
        -0.0013545751571655273,
        -0.009863318875432014,
        -0.005384755786508322,
        -0.012403110973536968,
        0.07887803763151169,
        -0.014705215580761433,
        0.03390323743224144,
        0.09765276312828064,
        0.019351040944457054,
        -0.017741410061717033,
        -0.07441306114196777,
        -0.028963537886738777,
        0.0550556518137455
    ]
}