{
    "id": "jLqvnlL0fuU",
    "title": "15 Devices We Can't Live Without",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-04-26T18:08:26Z",
    "video_url": "https://www.youtube.com/watch?v=jLqvnlL0fuU",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 111698,
    "likes": 4346,
    "comments_count": 199,
    "description": "What is in our every day carry?   Check out Denki's video!  I Wasted $342.40 on Target Tech:  16 Smartphones Better Than iPhone:  Game Console Myths:  We Tried Netflix Gaming So You Dont Have To:  I SCAMMED Goodwill:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Intro w/ Ken 0:40 What is Every Day Carry? 1:33 Kens Wallet 2:20 Matts Bag and Phones 3:04 Matts Dongles 4:08 Filming equipment we carry every day 5:04 What Phones does Ken have? 6:14 Matts Laptops 7:22 How Matt and Ken choose what to carry 8:22 Matts favorite device 9:45 Matt and Kens tools of choice 11:40 What bag Ken uses 12:09 What do you think?",
    "description_links": [
        "https://www.youtube.com/watch?v=6iELH6aCrrQ",
        "https://youtu.be/gcgoL9rVOtE",
        "https://youtu.be/xq3nelhnjdY",
        "https://youtu.be/XYfkJI9dbC4",
        "https://youtu.be/-DlpJHcbtHE",
        "https://youtu.be/cvFZdvdEC_w",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Hello, and welcome to This Is. Today, I have my good friend Benjamin Kolido over here. And we often get asked, what do we carry around in our bags? Ken, what do you have in your bag? - The name of the game here is Everyday Carry, and I don't carry a lot anymore. - I have toned down what I carry, but it's definitely more than your fanny pack here. - I used to carry around a big back pack, but now, I downsize everything, because it turns out I didn't need a lot of the stuff that I used to carry. - If you had to pick one item out of your bag right now, what would you start with? - Like the most important thing? - Most important to start with? - I actually made a video about this on the other overclock channel. That's not Austin Evans, or This Is. - Be sure to check out Ken's channel Denki Time. Link in the description. - So the whole thing is Everyday Carry. This is a huge thing on YouTube but also it's important for a lot of us, right? Everyone wants to find inspiration for how to either downsize or at least just pick out the essential stuff. My main thing was downsizing in a way where I wasn't compromising all that much. And while we are YouTubers and I do edit video and I shoot video and I have to do all of that on a laptop I don't do that all the time. So my thing is I moved everything to my phone. - You don't carry your phone in your pocket? - It depends. EDC I kind of just loop in as bag and pocket to be fair but I do like rocking the phone in the bag when I don't want my pockets to be big. - Oh so I always have my phone in my pocket. So you've got the 13 Pro Max. I have the 13 Pro. - What I treat my bag as. - Yeah. - Is the mothership. It has the stuff that I need where that I don't normally carry around in my pockets. So I have a Bellroy travel wallet which I use not only when I'm traveling but also to just hold my cards for everyday stuff. More often than not when I just need say one of the cards that I don't use often physically like my Apple card. It's nice to just have this in here. And this also has a built in pen. So when you need to sign receipts and stuff like that I have all of the cards that I need in here which is my debit card. The work card and my driver's license. And then every other card that I have is on Apple Pay. The cool thing here that everything in California in SoCal at least is Apple Pay. I mean, that's obviously circumstance of where we are. That's how I'm able to simplify everything. - Yeah. One thing other tech YouTubers like to do is we do carry multiple phones. I know you carry another phone. I carry three phones with me. All right. Yeah. So-- - Oh that made a sound too. - And this is light compared to what it normally is. So this is a Samsonite Rio as far as phones go. So I have a hand me down Z flip 5G, which is currently dead. Because I haven't been using this that much. Here's my controversial one that I carry around with me. - Oh boy, oh boy. - I am one of like the six people in the world who carries around the Microsoft Surface Duo two. This is pretty much my main like media machine. - It's probably good to like watch videos. Oh, Game Pass. - So if we're gonna just pull everything out always have a Xbox controller for Game Pass which I play on the Duo. I also use the Duo as my mobile hotspot. The name of the game for Matt is just being prepared for anything. - Yeah. - Name a dongle. - Oh my God. - Whatever you think you need. I probably have it in here. You could tell that I've never once used my MagSafe charger on my Mag phone. - To be fair I haven't either. For all of the years that I've asked for MagSafe. - Everyone was definitely like, I want MagSafe pack. Never once used it. - I do like this holder though. - As you see I need to get new one because it's kind of busting at the scene. - Sure but like, so I mean, I never know what this brand is called. I just see it on Amazon a lot. B-U-B-M. Be unique. Be myself. If that's not a Chinese brand, then I don't know what is. (both chuckles) - On the other side here I have every again, just-- - Everything that Satake has sent us that we've never made a video on. - I have every Satake product ever. - I see this the amount of times that they sent us this, the Apple watch charger, USBC. This thing is cool though. - Yeah. - I do like this. - I mean, when I travel that's how I charge my watch and my AirPods. - Wait. Oh, it's a dual. This is like something that I would carry around on EDC. Apple watch charger on one side, cheat charger on the other for your AirPods. - Little dongle thing that has a one terabyte SSD in there. I also like to carry around my Detty. So we got the pocket system from Detty. Little pocket love. - I mean no offense to Detty but my favorite thing in this whole entire kit is the moment MagSafe. They have a slew of accessories for camera of people. And this one in particular is great. You want to demo that? - Yeah so I mean you could just. - So it has a cold shoe on it. So you could put any accessories like the back of these mics have a clip, which you could put into a camera cold shoe like Matt is doing over there. And on top of that, there's a quarter 20 on the bottom to put the whole thing on a tripod, if you want. - So it just connects here. You could just use this as a mic. You can clip it on here. - Yeah it's a wireless mic kit, which is really handy for when you need to do run and gun video stuff. - When we go and shoot stuff at like Microcenter a lot of times we're, using our main cameras but sometimes if we go to Best Buy or something. - Or Target. - We don't necessarily have permission to shoot. We usually just grab iPhones and a mic like this is super low profile. I like to carry around that with me just in case. The battery on those last forever. What other phones you got in there? - Yeah. So I have in the inner pocket of this bag a Samsung Galaxy S22 Ultra, I think it's a salmon pink. - Companies love to just make up color, it's salmon. - I love this phone a lot. And the main reason why, the cameras are excellent. I really wanna point out this 10X lens. People will say it's a gimmick. There are a lot of people that can't imagine why you would even want something like this but when the 10X lens has better quality than the telephoto on the iPhone. - Yeah I know that with the iPhone, I'm gonna whip this out quickly, snap a picture and it's gonna be pretty damn good. Now, am I gonna be doing a whole bunch of photo editing on it? Absolutely not. - For me it's like I do a lot of my own personal stuff. - Yeah. - I do stuff for Denki. I do stuff for Austin. I very much rely on my mobile camera for a lot of my work. So on top of the mobile camera, I also use the phone itself to do all my editing. I use Lightroom mobile and I think that's why I was able to move away from my computer so quickly in my Everyday Carry. - One thing probably people are gonna be shocked to find out 110000% of the thumbnails are shot with my iPhone. Airdrop them over to, you don't carry around a laptop in your Everyday Carry. I usually carry two. I have have my 14 inch M1 max this is like my favorite laptop ever. I tend not to be someone who upgrades my core devices every year. - Sure. - The exception being is these MacBooks. I was on a 2018 MacBook with the i9, which was horrible. The throttling on it, which it was just a bad laptop - But M1, M1 transformed everything. - I did switch to the M1 Air, which was pretty good. I was using the absolute base model which we had used for a video. The eight gigs of RAM is pretty much I-- - Yeah eight gigs of RAM and Photoshop don't go great together. - No, no. So I upgraded to the M1 Max and I have no plans on upgrading this anytime soon. - So I have the same exact laptop at the office and it's been great for everything. - I mean the battery life, and this is great right now. I do normally carry around some form of Windows laptop with me. - Which Razer is it? - I was using the Razer Blade 15, which you can check out our video up here. I swapped that out. I'm waiting on a Razer Blade 14. Because again the 14 inch just seems to be the sweet spot for me. I don't want anything larger. - I love that floor factor. I mean 14 inch laptops have always been my favorite. - When I pick any of my devices, specs are I would say third or fourth on my list. - Specs are important for like some of the things that we do. But at the end of the day, like a lot of like things like fit and finish, is it gonna be heavy in your bag? There are other things to think about other than performance. People will prioritize performance. But I think for us, we live around performance. We kind of have a diff... An adjusted sense of what we need. It almost sounds like it's making excuses for things. But here's the thing I think what it can all be boiled down to is the fact that again and this underpins this whole EDC video is everyone has certain tastes, needs and preferences. And while this might not be a one size fit all for everyone we have unique circumstances where we might want to rock two phones or we might have a laptop versus not, like there are a bunch of different needs that we have to suit for ourselves. - Speaking of needs. I had a need that just phones don't itch for me. I would not call myself a vintage gamer. I love like Game Boy Air game like Game Boy Advance was just like my bread and butter. This is my new favorite device of all time. But this is the Anbernic RG552. There have been several of these hand held. In fact, we already did a video on the predecessor of this. This is a little emulator machine, it is running Android. You can run Linux on here. This thing can play up to Wii games as far as like handhelds that aren't the Steam Deck. This has become my new favorite device. It feels great. It's been able to play any game that I put at it. - Here's a true testament to how weird and niche this is. But also I get why they did all this stuff. It has two micro SD card slots. - So one of those is for dual booting. - There's also two USBC ports, one for charging and one for data. - Yep. Mini HDMI. - Which is a weird choice, but sure. One reason why I like this a lot. It's smaller than the switch light. - This has been a great device. It is pricey $250. - That's not as much as I've thought, but that's still pretty pricey. - But like this has been in my bag ever since and this should become my new favorite device. We will have a video comparing that to some other handouts. So keep an eye out for that. Now, currently it is running Android seven which is a little outdated. Someone did have a patch for it to be able to upgrade to Android 11. However, I have not gotten that to work because it's not officially supported. - This is such a nice device. I'd be more compelled to take this around than something like the Steam Deck or the Inu. I don't think the Steam Deck would ever leave my house. - Speaking of Segways tell me what else you got in your bag there. - So we're all about cutting edge technology. So I also have a cutting edge. - I also have my JerryRigEverything. - Let's go. That thing is great. It cuts like butter on everything, including fingers may or may not have had some incidents. But the thing that I carry around a lot is the Leatherman Wave. You as my former professor have showed me the ways of the Leatherman. - Having a good Leatherman or just any type of good multi-tool will always come in handy. - [Ken] If you don't know what a multi-tool is it's basically what people consider to be like a Swiss army knife. So I have pliers. I have on the top here it has a saw for some reason I never use it. Got a knife, easy one. These are meant for outdoors. But the main reason why Matt as my professor taught me about these things is because when you go to film school you need to always be prepared. If time is money in the industry, which it still is in the world of YouTube and video production. Being prepared for any scenario that comes about multi-tool will serve pretty much all of those needs. It's also super utilitarian. It's hard to see on camera, but there's a ruler on here. It's very basic, but I feel like this is one of the things that people emphasize on EDC a lot. When I see those videos, first thing that comes to mind is like outdoorsy. A lot of people in tech nowadays are doing EDC because they've also done it for a long time. Just it's in always in the form of what's in my bag what apps are on my iPhone. - I know the cables that I needed and every time I've needed a cable and haven't had it the first thing I do when I get home is I go and order that cable. And that's why it ends up in my bag like this. - Yeah that's like five years of just-- - This is 15 years. - I don't even remember what I did two years ago. So this is one thing I got a key smart consolidates all my keys into like a little Swiss army kind of thing. As you can see, they don't really jingle all that much anymore, like they used to. So that's kind of a cool reason why you would want to get a key smart also 20 bucks not too bad. - Yeah, not bad. - And the lot last thing is just the bag itself. I buy a lot of sling bags. This is the one that I've stuck around with the most. This is the North Face field body bag. It comes in a bunch of different colors and styles, not too bad either price-wise. MSRP is 45. Love that it has a top handle. Of course the sling is also adjustable. This thing is just very utilitarian. Looks good. Has a little bit of the hype beast mentality in there. If you care about brands, this looks pretty stylish. - I have zero style whatsoever which is why I have a black bag minus my little Lego sticker. - Oh that's cute. - But let us know in the comments what you have in your Everyday Carry. Is there things as we should keep in our carrier bags let us know what you have because I wanna know what you carry in your bag. I keep saying bag like subscribe, follow look out for Denki Time channel. Look out for our video on the Anbernic. We'll catch you in the next one. - Bye. Bye. (soft music)",
    "transcript_keywords": [
        "carry",
        "thing",
        "Everyday Carry",
        "lot",
        "bag",
        "Yeah",
        "video",
        "friend Benjamin Kolido",
        "stuff",
        "things",
        "game",
        "phone",
        "Benjamin Kolido",
        "people",
        "Everyday",
        "Time",
        "phones",
        "Apple",
        "EDC",
        "laptop"
    ],
    "transcript_entity_values": [
        "zero",
        "EDC",
        "USBC",
        "Android",
        "SoCal",
        "Bellroy",
        "three",
        "Razer Blade",
        "5",
        "the end of the day",
        "every year",
        "Swiss",
        "One",
        "Denki",
        "YouTube",
        "the M1 Air",
        "the Steam Deck",
        "RAM",
        "M1",
        "Game Boy Air",
        "Duo",
        "Linux",
        "third",
        "Android seven",
        "M1 Max",
        "Benjamin Kolido",
        "Mag",
        "Everyday Carry",
        "250",
        "Matt",
        "Austin",
        "Anbernic",
        "MacBook",
        "Xbox",
        "Detty",
        "the Microsoft Surface Duo",
        "first",
        "Chinese",
        "Today",
        "MacBooks",
        "Samsonite Rio",
        "Windows",
        "M1 max",
        "Satake",
        "Lightroom",
        "45",
        "Pro Max",
        "California",
        "Android 11",
        "YouTubers",
        "13",
        "15 years",
        "SD",
        "Microcenter",
        "the Leatherman Wave",
        "2018",
        "20 bucks",
        "Austin Evans",
        "one",
        "fourth",
        "Razer",
        "Apple",
        "five years",
        "Detty",
        "iPhones",
        "Leatherman",
        "14",
        "eight",
        "the Anbernic RG552",
        "six",
        "15",
        "Samsung Galaxy S22 Ultra",
        "Lego",
        "two",
        "14 inch",
        "Amazon",
        "MagSafe",
        "Game Boy Advance",
        "MSRP",
        "Denki Time",
        "Ken",
        "iPhone",
        "110000%",
        "two years ago"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "LOC",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "DATE"
    ],
    "vector": [
        -0.06616751104593277,
        0.04808409512042999,
        0.07624964416027069,
        -0.10672847926616669,
        0.05974322557449341,
        -0.029289210215210915,
        0.18503019213676453,
        0.01538428757339716,
        0.03196487948298454,
        0.05270208418369293,
        0.07159693539142609,
        0.00963247288018465,
        0.04363556578755379,
        0.02396501787006855,
        0.03202172741293907,
        -0.042339544743299484,
        0.03105095587670803,
        -0.08060108125209808,
        -0.12620459496974945,
        0.03954639658331871,
        0.005355478264391422,
        -0.0035196931567043066,
        0.041160326451063156,
        0.00924010667949915,
        -0.030849972739815712,
        0.0969422459602356,
        -0.02975109964609146,
        -0.08300355821847916,
        -0.0605965293943882,
        -0.021715395152568817,
        -0.020982857793569565,
        0.07278110831975937,
        -0.01981499418616295,
        0.007654288783669472,
        -0.05284649878740311,
        -0.05697062239050865,
        0.0233615729957819,
        0.012089574709534645,
        -0.022610971704125404,
        -0.017329495400190353,
        -0.05462222546339035,
        -0.056379035115242004,
        0.00028092635329812765,
        0.03985695540904999,
        -0.027448298409581184,
        -0.02421751245856285,
        -0.026446839794516563,
        -0.08349401503801346,
        0.08049964904785156,
        -0.0053993831388652325,
        -0.0025520343333482742,
        0.019283702597022057,
        0.022349214181303978,
        0.06097477674484253,
        0.020242175087332726,
        0.008626310154795647,
        -0.03325021639466286,
        0.01721074804663658,
        0.07122835516929626,
        0.02933056838810444,
        -0.010119481012225151,
        -0.014854910783469677,
        -0.009059438481926918,
        0.0767156109213829,
        -0.015986066311597824,
        -0.030786849558353424,
        -0.057116564363241196,
        0.038451969623565674,
        -0.06450273841619492,
        0.037913110107183456,
        -0.07538497447967529,
        0.0662597045302391,
        0.045126330107450485,
        0.08094684779644012,
        0.043089207261800766,
        -0.007861962541937828,
        0.05501642823219299,
        -0.04321921616792679,
        0.03970048204064369,
        -0.02684500627219677,
        0.0036438037641346455,
        0.010360670275986195,
        -0.018958380445837975,
        0.013173449784517288,
        -0.015448510646820068,
        0.004362301900982857,
        -0.055915605276823044,
        0.022619862109422684,
        -0.05377102270722389,
        -0.06660924106836319,
        -0.13063418865203857,
        0.01714172400534153,
        0.02387475036084652,
        0.004598100669682026,
        -0.03361998125910759,
        -0.02077341079711914,
        -0.021886978298425674,
        0.047427963465452194,
        -0.10878683626651764,
        0.04919472336769104,
        0.05614330619573593,
        0.11185408383607864,
        0.10852794349193573,
        0.011132847517728806,
        0.01729123480618,
        -0.03377233445644379,
        -0.08404440432786942,
        -0.03387976437807083,
        0.021729176864027977,
        0.03528407961130142,
        -0.0211680568754673,
        -0.023935092613101006,
        -0.0478709377348423,
        -0.016193687915802002,
        0.0617452934384346,
        0.0018160002073273063,
        -0.062065113335847855,
        0.09671956300735474,
        0.023939870297908783,
        0.030844740569591522,
        -0.04371977224946022,
        0.0520547516644001,
        0.009802287444472313,
        -0.0168039258569479,
        0.041291505098342896,
        0.06374622881412506,
        0.015246777795255184,
        2.9867847596585567e-33,
        0.016323775053024292,
        0.06691230833530426,
        0.02853764221072197,
        0.1009858176112175,
        -0.025867994874715805,
        -0.08009714633226395,
        -0.013705244287848473,
        0.11418241262435913,
        -0.019948819652199745,
        -0.007377041503787041,
        0.0017488395096734166,
        0.05157921463251114,
        -0.07721102237701416,
        0.05612392723560333,
        0.10496016591787338,
        -0.016866430640220642,
        -0.0413607582449913,
        -0.03927887976169586,
        0.05322693660855293,
        -0.010362338274717331,
        -0.008113652467727661,
        -0.09239272773265839,
        0.040582261979579926,
        -0.024289043620228767,
        0.08762890845537186,
        -0.07588714361190796,
        0.009393254294991493,
        0.01624024659395218,
        0.099083311855793,
        0.018226832151412964,
        -0.07597982883453369,
        0.008585181087255478,
        0.0008761247154325247,
        -0.014332332648336887,
        -0.06020640954375267,
        -0.010175180621445179,
        -0.009598405100405216,
        -0.061902910470962524,
        0.031503334641456604,
        -0.020702237263321877,
        -0.028269976377487183,
        -0.009173649363219738,
        -0.08429206162691116,
        -0.005091763101518154,
        -0.04677772521972656,
        0.007749338634312153,
        0.11044807732105255,
        -0.0012608339311555028,
        -0.019135549664497375,
        0.015409574843943119,
        -0.062451548874378204,
        -0.018567165359854698,
        -0.0033705029636621475,
        -0.032326944172382355,
        -0.08691281825304031,
        -0.07410581409931183,
        0.019421949982643127,
        -0.07301784306764603,
        0.04305131360888481,
        0.0016110619762912393,
        0.03959048166871071,
        0.0662309005856514,
        0.026474541053175926,
        0.061722204089164734,
        -0.014906580559909344,
        0.00038634485099464655,
        0.08483556658029556,
        0.012471139430999756,
        -0.025826476514339447,
        0.019285716116428375,
        -0.02653331868350506,
        0.021115072071552277,
        0.010144556872546673,
        -0.06256700307130814,
        0.09074137359857559,
        0.06107170134782791,
        -0.004876917693763971,
        -0.028302881866693497,
        -0.07971300184726715,
        -0.029122794046998024,
        0.008619969710707664,
        -0.049689315259456635,
        -0.032631583511829376,
        0.08709395676851273,
        -0.04291872680187225,
        -0.032287802547216415,
        0.03574717789888382,
        -0.0901704952120781,
        -0.04142184928059578,
        0.02430015429854393,
        -0.04371262714266777,
        -0.04891963303089142,
        -0.032148104161024094,
        -0.03243253752589226,
        -0.05137235298752785,
        -4.3205236089755636e-33,
        0.07812826335430145,
        -0.03113379329442978,
        -0.002636886667460203,
        0.009914346039295197,
        0.0657731369137764,
        -0.06471405923366547,
        -0.014920560643076897,
        -0.0086536705493927,
        0.01976812444627285,
        -0.08795398473739624,
        -0.08511687070131302,
        0.016468366608023643,
        0.0001688106858637184,
        0.024811165407299995,
        0.036145392805337906,
        -0.031909290701150894,
        -0.08756768703460693,
        -0.030340850353240967,
        0.0006471587694250047,
        -0.05037912726402283,
        0.04952745512127876,
        0.005564179737120867,
        -0.06020805612206459,
        0.037890851497650146,
        -0.022705258801579475,
        0.03785693272948265,
        -0.040046535432338715,
        0.027334053069353104,
        -0.009630447253584862,
        -0.008021040819585323,
        -0.025781357660889626,
        -0.1201503574848175,
        0.07607225328683853,
        0.05312139168381691,
        0.0038148206658661366,
        0.0035704360343515873,
        0.03921999782323837,
        -0.0002777148620225489,
        -0.02353283390402794,
        -0.08392709493637085,
        0.022477930411696434,
        -0.010317078791558743,
        -0.039320118725299835,
        0.010350095108151436,
        -0.04801604524254799,
        -0.07760373502969742,
        -0.07682854682207108,
        -0.011629752814769745,
        -0.004708001855760813,
        -0.02084866538643837,
        0.08862952888011932,
        0.03535358980298042,
        -0.09952867776155472,
        -0.05259221792221069,
        -0.09940248727798462,
        0.08621935546398163,
        -0.03261735290288925,
        -0.008243217132985592,
        0.06859776377677917,
        -0.03980189189314842,
        -0.003825516439974308,
        -0.002485976554453373,
        -0.05105888098478317,
        0.043806374073028564,
        -0.04864760488271713,
        -0.03696596249938011,
        0.08483485132455826,
        0.03913571313023567,
        -0.0834704041481018,
        -0.03490903973579407,
        -0.08999082446098328,
        -0.0389956496655941,
        0.01636425219476223,
        -0.09302878379821777,
        0.013739739544689655,
        0.06720054894685745,
        0.009287264198064804,
        -0.07606589049100876,
        0.032900985330343246,
        0.0060791014693677425,
        0.001686152652837336,
        -0.057163603603839874,
        0.030846940353512764,
        0.0413304828107357,
        0.01716597191989422,
        0.03316214680671692,
        0.02026429772377014,
        0.02243976853787899,
        -0.026650765910744667,
        0.04646516963839531,
        0.04239951819181442,
        0.035561006516218185,
        -0.08986160159111023,
        0.09076011180877686,
        0.021549485623836517,
        -5.996549390374639e-08,
        0.017689300701022148,
        0.04054264351725578,
        -0.01977139711380005,
        0.01955481804907322,
        0.027493376284837723,
        -0.011814801953732967,
        0.10018472373485565,
        0.0581798180937767,
        0.038272786885499954,
        0.03760521858930588,
        0.06243939697742462,
        -0.001525602419860661,
        -0.10263387113809586,
        0.061056312173604965,
        0.05006048455834389,
        0.05838139355182648,
        -0.009263833053410053,
        -0.023566413670778275,
        -0.027209389954805374,
        -0.006947661284357309,
        0.033116355538368225,
        -0.006417295895516872,
        0.03438979387283325,
        -0.012698176316916943,
        0.009335653856396675,
        0.013082564808428288,
        -0.06472054868936539,
        0.005544629413634539,
        0.07169241458177567,
        0.09322178363800049,
        -0.033929720520973206,
        -0.018422884866595268,
        -0.09263187646865845,
        -0.0012303277617320418,
        0.06832357496023178,
        -0.1226947158575058,
        -0.08205045014619827,
        -0.03394100442528725,
        0.02964106760919094,
        0.10034007579088211,
        -0.0001776169810909778,
        -0.13401766121387482,
        -0.04016381502151489,
        0.0046486021019518375,
        -0.012342565692961216,
        0.0016921852948144078,
        -0.06741207838058472,
        -0.062301699072122574,
        -0.015413849614560604,
        0.00839899480342865,
        -0.004547645803540945,
        -0.08023438602685928,
        0.09999804198741913,
        -0.0026929413434118032,
        0.06309671700000763,
        -0.001407537143677473,
        0.009750021621584892,
        -0.028406769037246704,
        0.005059297662228346,
        0.0071739982813596725,
        0.01817469485104084,
        0.018315551802515984,
        -0.05998659506440163,
        0.07134458422660828
    ]
}