{
    "id": "JnGXTk57rOU",
    "title": "Why Does This $10,000 Gucci Xbox Exist?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-12-02T00:40:32Z",
    "video_url": "https://www.youtube.com/watch?v=JnGXTk57rOU",
    "category": "Science & Technology",
    "tags": [
        "gucci xbox",
        "$10000 XBox",
        "XBox Series X",
        "MKBHD",
        "Gucci",
        "10K",
        "expensive xbox"
    ],
    "views": 2181004,
    "likes": 106677,
    "comments_count": 5174,
    "description": "Sponsored by Cash App, download from App Store/Google Play store - Use code MARQUES for $15 and $10 goes to Girls Who Code! Twitter:   The Gucci Xbox Series X:   MKBHD Merch:  Tech I'm using right now:  Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://twitter.com/MKBHD",
        "https://stockx.com/microsoft-xbox-x-gucci-series-x-special-edition-console-bundle",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- You might've seen the headlines about this thing. A $10,000 limited edition Gucci branded gaming console in a special box. One of a hundred were made all custom and now we've got one right here. So might as well take it out of the box, shall we? I'll be honest, I don't know, I haven't unboxed many Gucci things, but there's a lot of leather and Gucci Xbox branding on it. It actually smells pretty good, like it's leather. So let's, let's open it up. Why not? One out of a hundred. And there it is. It's the old green inside of a Gucci box we've all seen. Actually, oh, here, there's a game pass card. So somebody watching this just got a free game pass. So the inside, this has some pockets up here. Okay, let's get the console outta here. Oh, okay. It's covered in Gucci logos from head to toe, all the way around. Not on the back though. Just the front and the sides. And the rest is exactly like a normal Xbox Series X. And I can put that over here. So you got your cables, normal HDMI cable, normal power cable, not Gucci branded cables. And then you have two controllers here. Both of them also customized. I've seen a fair share of custom controllers in my day. This one has the stripes, the red and the blue stripe and the Gucci font at the front. Other than that, normal black controller. Oh, and this is one of 100 MKBHD edition. So one of one, two. So they put MKBHD in green on the back. Oh, they put it on the Xbox too. There we go. Can you see that? Says MKBHD on the Gucci Xbox, so technically this is an MKBHD Gucci collab, right? Is that it? I think that's it. Oh, this whole thing comes out and then there's just more compartments to buckle things in and it's all padded and upholstered and you can probably repurpose this if you want. This becomes your Gucci carrying case for something. Maybe you take your Xbox to the hotel with you when you travel. This would be the, the place to carry this around. It's a lot. It's a lot. It's a lot, this is just ridiculous. Okay. Just for the record, I didn't buy or customize this. Microsoft sent, or Gucci sent it here to the studio. So I dunno, who knows, maybe I'll do a giveaway of this customized one of a hundred, $10,000 Xbox. Follow me on Twitter for a giveaway of this Xbox. So let's take this opportunity to talk about brand collabs, what they are, why they keep happening, and how we got here. So we already know brands just love to collaborate, right? It's basically a corporate 101 strategy for increasing brand awareness, trying to get something trending or capitalizing on overlapping audiences. Oftentimes, they're really cringy, but sometimes, sometimes you get something that's pretty cool or even iconic. There's Nike and PlayStation, there's Lego and Ikea, Uber and Spotify. Doritos and Taco Bell. There was even a Burger King and McDonald's collab, believe it or not. But I want to talk about collaborations in tech because there are endless examples. But when I think about them in my head, I kind of divide them into two different categories. The ones that seem to make sense. And then the ones that seem kind of dumb. So if you look at something like Apple and Nike Plus for example. Okay, yeah. Makes perfect sense. Apple got to add some fitness focused features to their watch with a trusted partner to attract more of the workout crowd. And Nike gets a bunch of new customers using Nike products and exposed to the Nike brand via the machine that is Apple sales. So basically it's a win win for both companies. Or there was the Oneplus Hasselblad collab earlier this year. That's again, it makes sense. It's a win-win. Oneplus has this new but ongoing partnership where they get to put the Hasselblad name alongside their smartphone cameras. So that's a win for Oneplus because a lot of people who trust the Hasselblad name in photography will now associate Oneplus with high quality cameras, whether it's true or not. And it's a win for Hasselblad, a pretty traditional old timey camera company who can now associate their name with an upstart, trendy smartphone company to signal that they're high tech and fashion forward. You know, this happens with Leica all the time too. So whether they're cringy or super corporate or not, whatever the vibe is, there are a number of brand collabs all around the tech industry every year that make sense. And then there are monstrosities like this because on the surface in the tech world, this seems dumb. It's a Gucci Xbox. Why would that be better than a regular Xbox? Does a Gucci Xbox perform or play games better in some way? Do I get anything out of having a Gucci Xbox? Of course not. But if you've noticed, there's actually been a lot of tech collaborations like this. Tech companies collaborating with fashion companies, fashion brands. So tech products are in this weird place where most of the stuff you buy is supposed to be purely functional, right? You buy a piece of tech because it accomplishes a task or serves a certain function. It's a computer that does the thing you need it to, but not necessarily because of the fashion, but whether we like to admit it or not, there is a personal element to all of these purchases. I've always said, the smartphone you buy is actually one of the most personal choices you make. You hold it every day. You take it everywhere with you. It wakes you up in the morning. You feel kind of empty and lost without it. So even though it is just a piece of tech, it's no wonder the companies that sell them, want you to feel like they're also pretty fashionable, in addition to being a good piece of tech. You might remember LG collaborated with Prada on smartphones three different times. Samsung collaborated with Hugo Boss on a smartphone back in 2008 and again, in 2011. Louis Vuitton collaborated recently with headphone maker, Master and Dynamic to sell some $995 ear buds. There was a gold Dolce and Gabbana Razor Three a decade ago. And I think Apple and Hermes may be the best example of them all. Hermes, Hermes? I never know if I'm saying that right. Hermes, Hermes, Hermes, right? But I just remember so distinctly when the Apple watch went on sale, the first one went on sale back in 2015 and Apple, they of course made a couple of versions. There was a black version and a silver version. It was stainless steel, but they wanted to, of course, signify that it was fashionable because it's a watch and they have to get the fashion crowd to like it. And so they made the Apple watch edition and this version was plated in solid 18 karat gold. And it started at $10,000. Now anybody already subscribed here to this channel probably already knows that it's a bad idea to drop 10 bands on a first gen tech product, just 'cause it's covered in gold and you think it's fashionable. But that's a real thing people did. That's out there. Like the real humans actually spent that money on the first gen Apple watch. Tech blogs had a field day with the headlines. We already knew this was coming, but yeah, a year later there was a new one. The edition was discontinued, of course. It turns out Apple, even as massive and popular and successful and wealthy as they are, can't break into fashion immediately just by themselves on their own name. And so shortly after that, we did see the beginning of that Hermes collaboration. So that fashion brand comes in, they start to do custom watchbands, unique styles with leather that matched the watch faces, and custom packaging and higher prices. 'Cause you know, it's fashion. That's kind of the way things work, but that collaboration has been way more successful. It continues to this day and it's a win-win for both companies. Hermes gets a much more tech focused crowd and Apple gets to break into the much more fashion centric crowds. So fundamentally that's what they're always looking for in these brand collaborations is a win for both sides. That win-win. Kind of like MKBHD and New Channel sponsor Cash App. Cash App is incredible. I get to share it with you guys. They're the easiest way to send, spend, and save money and you can buy stocks or even Bitcoin with a dollar. So if you use code Marques to sign up, 15 bucks will appear in your account. It's not bad. And then $10 will go to Girls Who Code, link below. But the point is, the point is this, none of these tech fashion collabs actually makes the product better. Like none of them. That's not the point of this type of collab. Now you could argue that the tech on tech collabs actually do. You could say if a Oneplus and Hasselblad are collaborating that that actually can make the camera in the phone a bit better. You could argue that. You could argue that the Nike Plus and Apple sponsorship and collaboration actually made a better product. But this is just a monogrammed Xbox Series X. It's not a better Xbox. The Dolce and Gabbana Razor was just a gold Razor. It's more about the experience of taking it out the box, the custom packaging, the fashion nature of it, whatever you think about this fashion, that's what that collab is more about. And then there's also the X factor, which is just hype. So brands have various levels of this and in a world where the PlayStation Five from rival Sony was pretty much the most hyped thing in gaming for a whole year around its release. I mean, it's still impossible to get. So Microsoft and their brand team is of course, looking for ways to get people talking about and thinking about Xbox Series X, which came out around the same time and what better way than by creating a limited edition, super hyped special Xbox with one of the most hyped companies. So even though the product isn't actually better, the hype and all the brand awareness created by this collab is a win-win for both companies. So that's why the Gucci Xbox exists. This honestly probably would have been received the exact same way if it was a Supreme Xbox or a, I don't know, Louis Vuitton Xbox, it's just, they just want people saying Xbox more and it's working. It's working, isn't it. I'm here sitting on video talking about it, and now it's on YouTube going into their brand sentiment calculator. And of course there's no dislikes on this video, so it must be working. But yeah, the truth is I divided them into two different categories at the beginning of this video. Those that seem to make sense and those that don't. But at the end of the day, when you look at it as a win-win in some way, they kind of all do make some level of sense. So I wouldn't be shocked if we keep seeing more of this type of stuff. Thanks for watching. Catch ya on the next one. Peace.",
    "transcript_keywords": [
        "Gucci Xbox",
        "Xbox",
        "Gucci",
        "Apple",
        "tech",
        "Xbox Series",
        "Gucci Xbox branding",
        "MKBHD Gucci collab",
        "fashion",
        "Gucci Xbox perform",
        "Gucci Xbox exists",
        "Hermes",
        "brand",
        "Nike",
        "Apple watch",
        "MKBHD",
        "MKBHD Gucci",
        "Hasselblad",
        "Gucci branded",
        "normal Xbox Series"
    ],
    "transcript_entity_values": [
        "2008",
        "Gucci",
        "Apple",
        "three",
        "Lego",
        "Spotify",
        "2015",
        "the Nike Plus",
        "a Supreme Xbox",
        "one",
        "Nike",
        "Hermes",
        "Master and Dynamic",
        "One",
        "Louis Vuitton",
        "Tech",
        "PlayStation Five",
        "New Channel",
        "Leica",
        "Prada",
        "Gucci Xbox",
        "a whole year",
        "Louis Vuitton Xbox",
        "MKBHD Gucci",
        "Uber",
        "Sony",
        "Catch ya",
        "101",
        "Gabbana Razor",
        "Gucci",
        "Ikea",
        "Doritos",
        "the Gucci Xbox",
        "10",
        "15 bucks",
        "Oneplus",
        "a hundred",
        "Marques",
        "10,000",
        "Hugo Boss",
        "18",
        "a Gucci Xbox",
        "Dolce",
        "first",
        "Gucci Xbox",
        "some $995",
        "HDMI",
        "PlayStation",
        "Xbox Series X.",
        "100",
        "LG",
        "my day",
        "Microsoft",
        "Xbox",
        "Oneplus",
        "McDonald",
        "Oneplus Hasselblad",
        "Taco Bell",
        "2011",
        "MKBHD",
        "10",
        "Razor",
        "YouTube",
        "a Gucci Xbox",
        "Twitter",
        "earlier this year",
        "Nike Plus",
        "Hasselblad",
        "this day",
        "two",
        "the end of the day",
        "Bitcoin",
        "Samsung",
        "a year later",
        "Burger King",
        "Three a decade ago"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PRODUCT",
        "EVENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.06242005154490471,
        -0.036620669066905975,
        0.007593920454382896,
        -0.08844679594039917,
        0.09698527306318283,
        0.017144111916422844,
        0.12576159834861755,
        -0.0007785064517520368,
        0.07810354977846146,
        0.0071561262011528015,
        0.038467053323984146,
        0.0933094471693039,
        0.06675367057323456,
        -0.05852702260017395,
        -0.0022233419585973024,
        -0.05658232048153877,
        0.07210442423820496,
        -0.09524966031312943,
        -0.011296672746539116,
        0.012094913981854916,
        -0.0926479771733284,
        -0.025248179212212563,
        -0.03614279255270958,
        0.03426538407802582,
        -0.10020112246274948,
        0.008149813860654831,
        0.0064615653827786446,
        -0.025583136826753616,
        -0.11473411321640015,
        -0.049592141062021255,
        0.03882833942770958,
        0.06053975224494934,
        0.01542098168283701,
        0.04857077822089195,
        0.01117705088108778,
        -0.014922418631613255,
        0.00895693525671959,
        0.01731210947036743,
        -0.08728790283203125,
        -0.047006167471408844,
        -0.06679429858922958,
        -0.06818396598100662,
        0.031752437353134155,
        0.0764673724770546,
        0.020150640979409218,
        0.0027818165253847837,
        -0.029032038524746895,
        -0.032975293695926666,
        0.0057913498021662235,
        0.03542604297399521,
        0.004075154662132263,
        -0.054182346910238266,
        0.03528173640370369,
        -0.06274211406707764,
        0.008031897246837616,
        -0.032546669244766235,
        -0.044170279055833817,
        -0.027535349130630493,
        0.000880119507201016,
        0.031986054033041,
        -0.003825040301308036,
        -0.048106517642736435,
        -0.029947923496365547,
        0.017056576907634735,
        0.011288979090750217,
        -0.0233751367777586,
        0.011908305808901787,
        0.010790611617267132,
        -0.05837647244334221,
        -0.03989409655332565,
        0.07218822836875916,
        0.0009683955577202141,
        0.0199727863073349,
        0.04553176462650299,
        -0.020620882511138916,
        0.08295603841543198,
        0.04003746062517166,
        -0.01032926980406046,
        0.0635078176856041,
        0.06465978920459747,
        0.02440417744219303,
        0.009606346487998962,
        -0.027344588190317154,
        0.016331549733877182,
        -0.017178254202008247,
        0.04446639493107796,
        0.06622207909822464,
        -0.011331167072057724,
        -0.04235673323273659,
        -0.009536532685160637,
        -0.0034055709838867188,
        0.03546410799026489,
        0.04897906631231308,
        0.053270019590854645,
        -0.03513353690505028,
        -0.008832968771457672,
        -0.08149204403162003,
        0.030165154486894608,
        -0.04865625873208046,
        0.021329548209905624,
        0.02741692215204239,
        0.021827446296811104,
        0.056364528834819794,
        -0.09283386170864105,
        -0.044846221804618835,
        -0.11715909093618393,
        -0.03516453132033348,
        0.07595938444137573,
        0.0626913532614708,
        -0.013148966245353222,
        -0.104929618537426,
        0.03856421634554863,
        -0.0512123741209507,
        -0.005657216068357229,
        -0.011656493879854679,
        0.036918237805366516,
        0.032913003116846085,
        0.04430323839187622,
        0.0026616347022354603,
        -0.05494572967290878,
        0.05429649353027344,
        0.036824505776166916,
        -0.019180340692400932,
        -0.062381643801927567,
        -0.05956070497632027,
        -0.02795467898249626,
        0.02523580752313137,
        2.4690309259991875e-33,
        -0.03523646295070648,
        0.030337506905198097,
        -0.01684924215078354,
        -0.004887860268354416,
        0.05310033634305,
        -0.029923826456069946,
        0.016155647113919258,
        0.07894714921712875,
        -0.10260118544101715,
        0.08801065385341644,
        0.006029574200510979,
        0.050329409539699554,
        -0.09600930660963058,
        0.0658184215426445,
        0.052848901599645615,
        -0.00658842409029603,
        -0.021933432668447495,
        -0.05688072741031647,
        0.02849333919584751,
        -0.06891018152236938,
        -0.03499957546591759,
        0.015660861507058144,
        0.09955605864524841,
        0.014653614722192287,
        -0.03125849738717079,
        0.0973072275519371,
        -0.006989391520619392,
        0.01329000387340784,
        0.13248129189014435,
        0.028207210823893547,
        -0.04139216989278793,
        -0.01674615778028965,
        -0.007606385741382837,
        -0.00989584345370531,
        -0.039286743849515915,
        -0.01300223171710968,
        -0.003250365611165762,
        -0.07716207206249237,
        0.005370826460421085,
        0.07574668526649475,
        -0.039899177849292755,
        0.008336598053574562,
        -0.04026811197400093,
        -0.0363469161093235,
        -0.006276423577219248,
        0.0035280317533761263,
        0.058565814048051834,
        -0.010799188166856766,
        -0.03690352290868759,
        0.014577371068298817,
        -0.0059214443899691105,
        0.06129240244626999,
        -0.03494488075375557,
        0.10841420292854309,
        -0.052544012665748596,
        -0.053303830325603485,
        0.04156873747706413,
        -0.036557868123054504,
        0.07042080909013748,
        -0.043967097997665405,
        0.07153114676475525,
        -0.0053213611245155334,
        0.059042878448963165,
        -0.0019175271736457944,
        -0.08568893373012543,
        0.09579863399267197,
        0.05590356886386871,
        -0.05507741868495941,
        0.0177195742726326,
        0.0832827016711235,
        0.045154716819524765,
        0.009668673388659954,
        -0.019583459943532944,
        -0.0834922343492508,
        0.05194295570254326,
        -0.05314142629504204,
        -0.034812990576028824,
        0.026097988709807396,
        0.08120447397232056,
        -0.019633594900369644,
        -0.04518521577119827,
        0.05146285891532898,
        -0.030796566978096962,
        0.1217082217335701,
        -0.04451719671487808,
        0.03024587593972683,
        0.03760632500052452,
        0.016254177317023277,
        -0.0359405092895031,
        -0.006894173100590706,
        -0.0869385153055191,
        -0.014176556840538979,
        -0.015558128245174885,
        -0.042126357555389404,
        0.04868168383836746,
        -3.166835045703014e-33,
        0.07206945866346359,
        -0.0924573689699173,
        0.016468148678541183,
        -0.005693043116480112,
        0.024296972900629044,
        -0.01800590194761753,
        -0.010283923707902431,
        0.010959496721625328,
        0.06000501289963722,
        0.020513994619250298,
        -0.016852667555212975,
        0.007610628847032785,
        0.0005045756115578115,
        0.028641097247600555,
        0.046334803104400635,
        -0.017644375562667847,
        -0.019580822438001633,
        -0.006934621836990118,
        0.006859317421913147,
        -0.06135082617402077,
        0.02603611908853054,
        0.03373832255601883,
        0.041572168469429016,
        0.0021099026780575514,
        -0.06144050508737564,
        0.03440050780773163,
        0.03643549233675003,
        0.05073387920856476,
        0.013245774433016777,
        0.03385084494948387,
        -0.04962396249175072,
        -0.04366236925125122,
        -0.003075571730732918,
        0.003364390227943659,
        -0.0316450335085392,
        0.017754876986145973,
        0.10540234297513962,
        0.006359920371323824,
        -0.023769784718751907,
        -0.008198754861950874,
        -0.022335214540362358,
        -0.0038082441315054893,
        -0.03515646234154701,
        0.02030867524445057,
        -0.015109103173017502,
        -0.04202611371874809,
        -0.04582636058330536,
        -0.012881736271083355,
        0.11426293104887009,
        0.04032027721405029,
        0.09615304321050644,
        -0.02962205372750759,
        0.009051021188497543,
        0.00657136645168066,
        -0.15941190719604492,
        0.01038398314267397,
        -0.1062716394662857,
        0.010937461629509926,
        0.04441096633672714,
        0.013627534732222557,
        0.01890598237514496,
        0.036463119089603424,
        -0.1385580450296402,
        -0.06333459913730621,
        -0.019525840878486633,
        0.01971859484910965,
        0.05391014367341995,
        0.010271013714373112,
        -0.04654145985841751,
        -0.06174919009208679,
        -0.020330941304564476,
        -0.038585320115089417,
        -0.012888377532362938,
        -0.03279311582446098,
        -0.03853648528456688,
        0.03538651391863823,
        -0.04096125811338425,
        -0.010744395665824413,
        0.09985906630754471,
        0.007586407940834761,
        0.027945807203650475,
        -0.04443485289812088,
        0.02747192420065403,
        0.0384821742773056,
        0.11283504217863083,
        -0.03484015166759491,
        -0.006934946868568659,
        0.04138043522834778,
        -0.02777891606092453,
        0.040701691061258316,
        -0.05379690229892731,
        0.07697451859712601,
        -0.023095296695828438,
        0.08211670070886612,
        0.05021137744188309,
        -5.303747485640997e-08,
        -0.0013905466767027974,
        0.015186932869255543,
        -0.02278553694486618,
        -0.0050255367532372475,
        0.008786739781498909,
        -0.009489280171692371,
        0.008620652370154858,
        0.023128671571612358,
        0.05413514003157616,
        0.02233336679637432,
        0.0032013196032494307,
        -0.0019920486956834793,
        -0.1368657499551773,
        0.05480664223432541,
        -0.08606262505054474,
        0.07725729793310165,
        -0.1224207952618599,
        -0.020513083785772324,
        -0.020255764946341515,
        0.0482807420194149,
        -0.006327291950583458,
        0.09155821800231934,
        0.050121646374464035,
        -0.08987019211053848,
        -0.09584949165582657,
        0.013189119286835194,
        -0.04349307715892792,
        0.00021349769667722285,
        -0.030157528817653656,
        0.0503050833940506,
        -0.048109836876392365,
        -0.022174006327986717,
        0.03449975699186325,
        -0.010225401259958744,
        -0.0045385598205029964,
        -0.06889737397432327,
        -0.0693904235959053,
        0.009388836100697517,
        0.027430936694145203,
        -0.00797595176845789,
        -0.0016765871550887823,
        -0.12630459666252136,
        -0.10144677013158798,
        -0.015566060319542885,
        -0.053424689918756485,
        -0.051725175231695175,
        -0.08317694067955017,
        -0.023678582161664963,
        -0.0816127210855484,
        0.13523878157138824,
        -0.003016059286892414,
        0.014410780742764473,
        -0.007058798801153898,
        0.07738165557384491,
        0.05233573913574219,
        -0.05154087021946907,
        0.03364935144782066,
        -0.03849208354949951,
        0.011221278458833694,
        0.07253839075565338,
        -0.03612996265292168,
        -0.11559388786554337,
        0.06391534954309464,
        0.02473004162311554
    ]
}