{
    "id": "jnMMtbVP0ps",
    "title": "PCIe Gen5 Drives are Here! Are they Worth It?? - Crucial T700 PCIe Gen 5 NVMe SSD",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-03-18T17:06:11Z",
    "video_url": "https://www.youtube.com/watch?v=jnMMtbVP0ps",
    "category": "Science & Technology",
    "tags": [
        "ssd",
        "crucial",
        "crushal",
        "crical",
        "nvem",
        "nvme ssd",
        "pcie gen 5",
        "amd cpu",
        "fast ssd",
        "fastests ssd",
        "fastest hard drive",
        "computer storage",
        "new fastests computer storage"
    ],
    "views": 1894750,
    "likes": 61062,
    "comments_count": 2329,
    "description": "Try Zoho One free for 30 days with no credit card required here:   Save 10% and Free Worldwide Shipping at Ridge by using offer code LINUS at   Crucial just sent us their new T700 SSD and thanks to the power of PCIe Gen 5 this very well maybe the fastest NVMe SSD on the planet. So how fast does it go? And should you consider one for your next build?  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 I was paid to write this intro 1:16 What's New! 3:28 T700 vs 990 Pro CrystalDiskMark 4:52 How SSDs work 5:45 More Testing 8:12 The Numbers on the Box Lie 10:26 The Problem with Gen 5 10:55 The Solution with Gen 5 13:10 Raid 0 is dumb",
    "description_links": [
        "https://www.zoho.com/one/lp/linus.html",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1494901-i-just-upgraded-i-hate-it-when-this-happens%E2%80%A6/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This. Is. Speed. (yelling) Gen 4, more like Gen snore. Gen 5? I feel alive. - This P-C-I-E, Gen 5 SSD may well be the fastest M dot 2 drive on the planet. Over 12 gigabytes a second. That is so fast. You could move your Warzone install in about 5 seconds. And even if you're more into playing games than copy pasting them around, with direct storage compatible titles, finally hitting the market, gamers might have a reason to add storage speed to their list of \"specs that actually matter.\" Let's see what this thing can do. Wait a minute, 69 megabytes a second? That's not nice. That's not nice at all. Just like it's not nice to make you wait and find out what's going on, after this message from our sponsor. - Thanks to The Ridge for sponsoring this video. Made with premium quality materials, The Ridge Wallet is the perfect excuse to get rid of that old, bulky wallet. (whispering) It's, not good. The Ridge Anniversary Sale is happening now until March 24th. Check 'em out in the link below and use code 'Linus' to save 10% off your purchase and get free shipping. - Before we get into the inconvenient details, let's talk about what makes the crucial T700 a hare among tortoises, a star among planets, a diamond among, roughs. It starts with the interface. While this may look exactly like the kind of M dot 2 drive that you would install in your pc, and in fact you could, since it's fully backwards compatible, when paired with a PCIE Gen 5 capable CPU and motherboard, it goes from a theoretical maximum of 7.9 gigabytes a second to nearly 16 gigabytes a second. \"But Linus,\" you might say, \"even your best-case scenario demo you did had it anywhere from 11 to 12 gigabytes a second.\" Well, yes, while the interface itself can hit the speeds I just said, this is our big, \"but wait, there's less\" moment. You see, there's more than one factor that affects the real world performance of an SSD, and the interface is one of them. But another is the controller and our T700 here has a doozy of a controller. The new Phison E26 is an 8 channel controller that can easily handle drives with 4 terabytes of capacity at speeds of up to 14 gigabytes per second. That is nearly double the speed of their end-game Gen 4 controller. Yes, yes, yes, I know. 14 gigabytes a second is also not 12. But you're forgetting the 3rd major factor that affects SSD performance: The NAND flash that actually stores the data; and this is the hardest part to scale. Honestly, the fact that this thing is as fast as it is, is a modern miracle. The T700 uses Micron's latest 232-layer TLC NAND at 2000 mega transfers per second to deliver the performance we saw. Up to 12 plus gigabytes per second of sequential reads, and about 11 gigabytes per second of sequential writes, in both the 2 and 4 terabyte capacities. Now, curiously, it seems that by pushing the dies to their full rated 2400 mega transfers per second, they could probably saturate the Phison E26 controller. But there are some reasons that they might not do that. Starting that it, probably wouldn't affect anything. Behind me is 2 identical Ryzen 7950x bench PCs, courtesy of our lab. On the left, we've got the Samsung 990 PRO, probably the fastest Gen 4 SSD on the market. If you ignore the firmware issues. On the right, we've got the T700. Gen 5 baby! Time for our CrystalDiskMark drag race? - Yeah, let's go. - Okay, you're team last Gen? - I'm Gen 4. - You're Gen 4? Wait how T700s do we have? - Tradition, versus modernity? This is great. All right, we ready? - Yeah. Let's go. - Let's go, let's go. - Didn't even count in. - What? Why? I went. - Okay well they're around now. - Yeah. I wanna win. - (laughs) - What can I say? Oh look at this. See you later, buddy. How's my rear view mirror treating you? - Oh my God, this is brutal. Literally more than double. - Double the performance. Boom we're back to sequentials. Boom. Let's go. Write speed, baby. Particularly those lower Q depth sequentials, just crushing the Gen 4 drive. That's my first L. If you look closely, you'll notice the weak improvements in random reads and random writes, which funnily enough, is the category of drive activity that represents typical day-to-day use, and it's also where most drives struggle. Why is that so slow? Well, here's the thing: writing to an SSD is kind of like boarding an airplane. Each row is a block, and if you want to add a person to a row, well first, you need to pull everyone out of that row, so that the new person can get in. Then everyone has to sit back down. This takes time. With sequential writes, people ready to be seated together in convenient groups of 3, you can fill several rows or blocks quickly. But with random writes, you've got different people, trickling in and out, at different sections, at different times, and they all gotta squeeze into the various random open seats on the plane. Sequential writes are also slowed-down, when there are people already sitting in a row, but when there's some downtime, the flight attendants are running the trim function, where they move people who have been seated in their own rows, into rows with other people, so that when an influx of new passengers come along. we don't have to worry as much about doing the awkward seat dance. When those random writes do happen though, boy does it ever suck. Here we go Adam. Let's go. - Oh, what are we doing now? Trying some games? - We are opening some programs. Oh, let's see. - Let's open some programs. Okay, so we should close Steam. Let's close steam. - Well, no, no. - Close steam. Yeah. Launch steam. - Okay. - 3, 2, 1. - Go. (taps keyboard) (whispers) I'm gonna crush you. - Okay. That was, the same. Even the ads loaded the same. Edge! - 3, 2, 1, go. (taps keyboard) - Maybe something heavier? - Okay. - Like a game? - Maybe close Edge. Okay. PCMark's kind of a dog. - Yeah. Let's do PCMark - Open up PCMark. - 1, 2, 3 go. (taps keyboard) Oh. - Whoa! - That was a pretty big win. - Actually significant. - Yeah. - Okay, but can we repeat it? - 3, 2, 1, go. (taps keyboard) - Okay. - Now. - On the subject of PCMark, it did in the storage benchmark, show a solid win for the new drive, with the T700 leading by about 16%. But in less good news, when we fired up Forspoken, which at this point is our only PC showcase for direct storage, we just plain couldn't tell the difference. That's not to say, we couldn't measure the difference. We were looking at about a 5% advantage for our Gen 5 SSD. But there was no difference in actual frame rate, and that 5% was just not something we could actually notice. In Final Fantasy Endwalker, we did see a 14% improvement in load times, which is cool, but it's a far cry from the 40% improvement that these drives showed in synthetic benchmarks like CrystalDiskMark. You know what? Maybe we should just do a big file transfer in Windows. I mean, we say it all the time: \"You know these sequential drives, at least they're good for big file transfers.\" - Let's do some big files. - All Right. Yeah, this is gonna go really fast, probably. So 6 gigabytes a second, 5 gigabytes a second 4 and a half gigabytes a second. I mean, that's pretty fast. 4.2 gigabytes a second. That's really fast. Maybe the fastest I've ever seen. We seem to have hit some sort of file explorer bottleneck here at about 4 gigabytes a second. But here's the thing, even if Windows Explorer didn't come up against its own software limitations, when performance is this fast, it can only last for so long. Running our new drives in IOmeter, free of Windows file Explorer, we've slammed them for 15 minutes of continuous activity and saw our speeds fall precipitously in less than a minute, down to about 3 gigabytes a second. What's going on here, you might ask? Is it thermal throttling? The answer is no. With either the heat sink on the drive, or the integrated heat spreader on your motherboard, these drives stay well within their thermal limits. What did happen though is we overwhelmed the cache on our drive. Pretty much all modern drives store more than 1 bit per cell, which gives them more capacity but comes at the cost of performance and longevity. But here's the thing, many drives, especially performance ones, can operate that multi-bit per cell NAND in a kind of pseudo-SLC mode. So it's kind of like switching over a segment of the storage to go much faster but at the cost of capacity. Once the drive has filled up that low capacity cache, it starts running at much slower TLC NAND speeds; then, when that is nearly full, we move to what's called a holding state, where the drive runs at a distinctly unimpressive 1, to 1 and a half gigabytes per second. Basically, it's bottlenecked by being forced to rearrange data on the fly while it's operating, rather than being allowed to perform these operations in the background while you aren't using it. Which, if you remember from our airplane analogy is pretty inefficient. Lo and behold, the 990 PRO suffers the exact same fate, even coming in at similar sustained numbers. Wait a second. That's because despite the impressively dense new NAND on the T700, it's not actually faster than the NAND flash from top-tier Gen 4 drives, like the 990 PRO. Bummer. To be clear, this only happens when you're moving incredibly large files, and it doesn't reflect typical use. Most of the time you're doing those random reads and writes, that can easily be handled by the high-speed cache. Which is actually an even bigger problem for the marketing teams who are tasked with selling these drives. If the sequential numbers aren't sustainable, and the Gen 5 interface is ludicrously overkill for the more random workloads that we encounter on a daily basis, what is the point of this thing? Okay? It's possible that you're a power user with numerous virtual machines or Docker containers and you could have some use for this, but, honestly I think even that is kind of missing the point of what makes PCIE Gen 5 drives so exciting. The real exciting part is not necessarily this drive, or even the current PCIE Gen 5 crop of platforms. But rather the increased expansion that could be available to us in the future. Thanks to Gen 5's faster per lane data rates, we could, in theory, get the same performance from our drives, as last Gen, or GPUs, or network cards, using half as many lanes. Like think about a Ryzen 5000 system. You got your GPU, that's 16 lanes. You've got your single M dot 2 storage drive, that's another 4. And then you're sitting there going, \"hm I need more storage. Why don't I add a 2nd M dot 2 drive?\" Well, when you go to add that 2nd drive, instead of running off the PCIE lanes that are directly wired into the CPU, you're gonna be running off lanes that are going through the motherboard chipset. Which is fine, but the more drives you wanna add the more potential there's gonna be for bottlenecks unless you wanna fall back to slower SATA drives. Now, workstation class CPUs do exist, with much greater PCIE connectivity, but, they're also significantly more expensive. With PCIE Gen 5, on the other hand, well we get double the performance with the same number of lanes. Or, the same performance, using half as many lanes. So suddenly, you could have two drives, at a more of an ample 8 gigabytes a second, with nice low latency connections, directly to the CPU. Personally, I'd actually like to see us go all the way down to a single lane drive at four gigabytes a second. And then I could have 4 of them. Sick! Now, in practice, it's not that simple, nothing ever is. But think about it, this could be a very interesting path for the industry to follow, and in fact, we're already seeing it in the server space. Now, you might be wondering, why not just make more lanes, instead of trying to make the lanes faster? Well, the thing is, that more lanes means more pins are needed to connect them, and more pins means more complexity. And more complexity, means higher costs. So while I'm a little disappointed to find out that there is no clear benefit to this thing for the average gamer, hey, at least we can have fun with them, right? See big numbers. Why don't we Raid-zero these drives? See how fast they go? Hey, Raid 0's a valid configuration, David. Oh my God. Are you actually using Windows Drive Manager to Raid 0 them? - We can you use storage space... - Just do it. I don't care. - We just gotta get this guy in here. - This is ridiculous. Well, there's two in here now. Oh we wanna... - Yeah - But you can't do the one that you're booted on. We have to format it into a drive and then put... - Are these hot swappable? - PCIE is not hot swappable. Yes, it is. - It is? - Well, not on consumer platforms. I'm shutting that down. - (laughs) - How many of these could you fit in the tech? - I thought you were gonna ask how many I could fit in my butt. - Oh! - Well, I was gonna ask about your tech sack. (laughs) - Did you try this? And it's really fast. - Yes. Neat. - Well, it failed when I tried to create it, so that's cool. (laughing) And just like if we were running a single drive, other bottlenecks would stop us before we'd get anywhere near this kind of performance in the real world. - Yep. - So as our testing has shown today it's not really the speed that matters, at least not today. The real benefits of PCIE Gen 5 are, more about flexibility, and I guess being ready for whatever the future might bring. And whatever segue I might bring to our sponsor: - Zoho One. Do you own or manage a business? Zoho One can make your life easier. It takes the essential elements of any business such as accounting, marketing, and HR, and combines them into one unified operating system. Build your very own website from the ground up and maintain it with intuitive customization and personalization options. Send out purchase orders, create marketing campaigns, and manage shift scheduling all in just a few clicks. Then, track metrics and use that data to make key decisions to increase revenue. It helps you help yourself. Again, you see how that works. When you got everything set, start automating your processes and never worry about 'em again. And if you're working on the go, that's no problem. Zoho One includes mobile apps so you can run your business anywhere. Take control of your business the way you see fit with Zoho One. Follow the link below to try Zoho One for free for 30 days with no credit card required. - If you guys enjoyed this video, you might also enjoy the Honey Badger den, a truly fast SSD array that we actually do use in our editing den right over there. Yep, that's right. I mean, it's not in there, it's in the server room, but they use it every day to not nearly its full potential just like this. Oh, crap.",
    "transcript_keywords": [
        "Gen",
        "PCIE Gen",
        "drive",
        "drives",
        "gigabytes",
        "PCIE",
        "makes PCIE Gen",
        "SSD",
        "performance",
        "lanes",
        "fast",
        "NAND",
        "Yeah",
        "thing",
        "current PCIE Gen",
        "storage",
        "writes",
        "random",
        "kind",
        "sequential"
    ],
    "transcript_entity_values": [
        "232",
        "40%",
        "one",
        "Gen 5",
        "Over 12 gigabytes",
        "14 gigabytes",
        "SSD",
        "Windows file Explorer",
        "Final Fantasy Endwalker",
        "nearly 16 gigabytes",
        "2nd",
        "Gen 5's",
        "10%",
        "GPU",
        "Forspoken",
        "Raid 0",
        "14%",
        "March 24th",
        "1",
        "7.9 gigabytes",
        "Gen 5 SSD",
        "Micron",
        "PCIE Gen 5",
        "Zoho One",
        "2000",
        "12 plus gigabytes",
        "T700",
        "Linus",
        "PCMark",
        "1",
        "NAND",
        "half",
        "Docker",
        "first",
        "2",
        "4 terabyte",
        "Windows Drive",
        "990",
        "2400",
        "Phison E26",
        "less than a minute",
        "5 gigabytes",
        "PCIE Gen 5",
        "The Ridge Anniversary Sale",
        "4",
        "6 gigabytes",
        "CPU",
        "about 3 gigabytes",
        "Adam",
        "Warzone",
        "Samsung",
        "more than one",
        "T700",
        "30 days",
        "Windows",
        "Ridge",
        "IOmeter",
        "4 and a",
        "about 16%",
        "Ryzen 7950x",
        "The Ridge Wallet",
        "David",
        "5%",
        "69 megabytes",
        "16",
        "L.",
        "about 5 seconds",
        "3",
        "TLC",
        "Up to",
        "12",
        "Raid-zero",
        "Gen 4",
        "two",
        "Gen 4 SSD",
        "second",
        "PCIE",
        "PCMark - Open",
        "more than 1",
        "4 terabytes",
        "daily",
        "about 11 gigabytes",
        "15 minutes",
        "today",
        "Windows Explorer",
        "up to",
        "SATA",
        "8",
        "4.2 gigabytes",
        "a second",
        "11 to 12 gigabytes",
        "2",
        "3rd",
        "Zoho One",
        "about 4 gigabytes",
        "a minute",
        "four gigabytes",
        "Gen 4",
        "1 and a half gigabytes"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "GPE",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "NORP",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "EVENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "PERCENT",
        "GPE",
        "PERSON",
        "PERSON",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "PERSON",
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "TIME",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "FAC",
        "QUANTITY"
    ],
    "vector": [
        -0.07782518863677979,
        -0.012058276683092117,
        0.05353650823235512,
        -0.02782347984611988,
        0.08195828646421432,
        0.04746896028518677,
        -0.040763162076473236,
        0.0036240899935364723,
        -0.04959125071763992,
        -0.025337304919958115,
        -0.02974225953221321,
        0.02803857997059822,
        0.015271110460162163,
        -0.022840972989797592,
        0.026991311460733414,
        -0.027348482981324196,
        0.07665326446294785,
        -0.08568710833787918,
        -0.018038975074887276,
        -0.01841696724295616,
        -0.019319171085953712,
        0.0034203229006379843,
        0.004031284712255001,
        -0.0523991733789444,
        0.01939871348440647,
        -0.09248316287994385,
        0.031497448682785034,
        -0.039648644626140594,
        0.025456469506025314,
        -0.0026644142344594,
        -0.008045156486332417,
        0.06301069259643555,
        -0.0712827667593956,
        0.004889051895588636,
        -0.0024165341164916754,
        -0.0740240216255188,
        0.03685766085982323,
        -0.07308425009250641,
        -0.04746251553297043,
        -0.0898635983467102,
        0.04990946874022484,
        -0.019893722608685493,
        -0.09945815801620483,
        0.03727998957037926,
        0.05943373963236809,
        0.03512192517518997,
        0.04446006566286087,
        -0.03710887208580971,
        0.059456683695316315,
        -0.07381370663642883,
        -0.037277594208717346,
        -0.05391860008239746,
        0.011708125472068787,
        -0.023739945143461227,
        -0.11251481622457504,
        0.035344213247299194,
        0.04161844402551651,
        -0.09256549924612045,
        0.03964028134942055,
        -0.06144425645470619,
        0.049917954951524734,
        -0.15016180276870728,
        0.023056965321302414,
        0.012704756110906601,
        0.019715266302227974,
        -0.020282933488488197,
        0.045762281864881516,
        0.025658726692199707,
        -0.024111010134220123,
        -0.0060531990602612495,
        0.028408855199813843,
        0.049915611743927,
        0.021741582080721855,
        0.08357632160186768,
        -0.030408743768930435,
        0.02153635397553444,
        0.0940791442990303,
        -0.03612058609724045,
        0.03857451677322388,
        -0.05944528803229332,
        -0.04123867675662041,
        -0.00604225555434823,
        0.025166917592287064,
        -0.04816768318414688,
        0.04859094321727753,
        -0.034264739602804184,
        0.025762714445590973,
        0.09562259167432785,
        -0.02057936042547226,
        -0.09182891994714737,
        0.0727328360080719,
        0.03543372079730034,
        0.07450345903635025,
        -0.011223800480365753,
        -0.016392188146710396,
        0.03587333858013153,
        -0.041899796575307846,
        -0.07706752419471741,
        -0.075356125831604,
        -0.006582472939044237,
        -0.031461164355278015,
        0.11422689259052277,
        0.02946116216480732,
        -0.04290028288960457,
        -0.0763101875782013,
        -0.00345774763263762,
        0.03896206244826317,
        0.06693841516971588,
        -0.04730626195669174,
        -0.01900859735906124,
        -0.03983176872134209,
        0.07781282812356949,
        -0.027070995420217514,
        0.029546430334448814,
        -0.03339097276329994,
        0.05504017323255539,
        -0.0845772922039032,
        0.0146650280803442,
        0.043497730046510696,
        -0.03531000018119812,
        -0.007457980886101723,
        -0.043143756687641144,
        -0.01763148419559002,
        0.03079635463654995,
        -0.053587183356285095,
        0.033710796386003494,
        -0.007432357408106327,
        5.905632190653324e-33,
        -0.009746415540575981,
        0.04931389540433884,
        -0.07074097543954849,
        -0.01654835231602192,
        -0.009230894967913628,
        -0.0010396819561719894,
        0.038873303681612015,
        -0.0012441178550943732,
        -0.0035975934006273746,
        0.02204534038901329,
        -0.12811464071273804,
        -0.05401533469557762,
        -0.07257609814405441,
        0.05087835714221001,
        -0.004405615851283073,
        -0.07292836904525757,
        -0.08671534061431885,
        0.04400024935603142,
        0.00930415652692318,
        0.015320216305553913,
        0.05912961810827255,
        0.015805702656507492,
        0.03170856833457947,
        -0.017069987952709198,
        0.11736219376325607,
        -0.04364586994051933,
        -0.010913503356277943,
        -0.06928578019142151,
        0.10414102673530579,
        0.019930647686123848,
        -0.0740765929222107,
        -0.03993687033653259,
        -0.0029832127038389444,
        -0.04028353840112686,
        0.0547914020717144,
        0.0293215773999691,
        -0.045418400317430496,
        -0.05112839490175247,
        0.03377053141593933,
        -0.02430759370326996,
        0.0069262864999473095,
        0.009513099677860737,
        -0.07521796226501465,
        -0.0799679085612297,
        -0.09844492375850677,
        0.0017025036504492164,
        0.02239401452243328,
        0.022225607186555862,
        0.037158116698265076,
        0.03557699918746948,
        -0.0681837797164917,
        0.05868799611926079,
        -0.12486225366592407,
        -0.021678732708096504,
        -0.0031413831748068333,
        0.0013106318656355143,
        0.05882342904806137,
        -0.006740503944456577,
        0.10004067420959473,
        0.007575389929115772,
        0.009098879992961884,
        -0.0960618183016777,
        0.047046780586242676,
        -0.06718848645687103,
        -0.03747852146625519,
        0.07626453787088394,
        0.04741301015019417,
        -0.008838617242872715,
        -0.04036615043878555,
        -0.048677876591682434,
        0.020116588100790977,
        -0.037832535803318024,
        6.343377026496455e-05,
        -0.07726594805717468,
        0.1022702232003212,
        -0.04664027318358421,
        -0.03022592142224312,
        -0.04516218975186348,
        0.005007895175367594,
        0.022916628047823906,
        -0.06363676488399506,
        0.04150998964905739,
        -0.0542028471827507,
        0.07127314060926437,
        0.11597681790590286,
        0.06066460534930229,
        0.06790773570537567,
        -0.022471416741609573,
        -0.013397468253970146,
        -0.04127712920308113,
        0.002776313340291381,
        -0.01189181488007307,
        0.03667895123362541,
        0.014682523906230927,
        -0.044612426310777664,
        -5.892997830433892e-33,
        -0.02155974693596363,
        -0.020500868558883667,
        -0.0005902232369408011,
        0.06208323314785957,
        -0.014272253960371017,
        -0.039631444960832596,
        -0.02993268519639969,
        0.07024988532066345,
        -0.007109062280505896,
        -0.02109329216182232,
        -0.005386617034673691,
        -0.014714720658957958,
        -0.020948244258761406,
        -0.017167340964078903,
        -0.01654922589659691,
        -0.043308354914188385,
        0.039266277104616165,
        -0.025268342345952988,
        0.06129532307386398,
        -0.055548179894685745,
        0.10143660753965378,
        -0.009530422277748585,
        0.0686284527182579,
        0.0331389345228672,
        0.0431220605969429,
        0.06765510141849518,
        0.017564784735441208,
        0.027607986703515053,
        -0.026461409404873848,
        -0.005930492654442787,
        -0.03534718230366707,
        0.022050872445106506,
        -0.013785947114229202,
        -0.016164081171154976,
        0.06236172467470169,
        0.03658922761678696,
        0.06285297125577927,
        0.04953181743621826,
        0.005465941969305277,
        0.021983230486512184,
        0.0031909109093248844,
        0.038537751883268356,
        0.02031663805246353,
        -0.0036358439829200506,
        -0.04440096393227577,
        -0.0776154026389122,
        0.010061593726277351,
        -0.06105782836675644,
        0.06095457822084427,
        0.057801853865385056,
        0.03803129121661186,
        0.008497539907693863,
        0.08515919744968414,
        0.012908470816910267,
        0.019801564514636993,
        -0.04324798285961151,
        0.028480542823672295,
        0.035458456724882126,
        -0.03635438531637192,
        -0.02708536386489868,
        0.02970852144062519,
        0.07135798782110214,
        0.022311441600322723,
        -0.031235726550221443,
        0.02612987346947193,
        -0.03252946957945824,
        0.09847697615623474,
        0.03806339576840401,
        -0.04250260069966316,
        0.014826667495071888,
        -0.09920508414506912,
        -0.043617893010377884,
        0.020234303548932076,
        -0.07313784211874008,
        -0.06120897829532623,
        -0.036099523305892944,
        0.03692401573061943,
        0.02509244531393051,
        0.05722552537918091,
        -0.03276162967085838,
        -0.025429770350456238,
        0.04656807333230972,
        -0.0219656340777874,
        -0.025371287018060684,
        -0.007396493572741747,
        -0.006566544063389301,
        0.04881652444601059,
        -0.03552861139178276,
        0.07275986671447754,
        -0.017224738374352455,
        -0.063819020986557,
        0.008637881837785244,
        -0.03943304717540741,
        0.04790157079696655,
        0.012596609070897102,
        -5.1985065141479936e-08,
        0.02507544867694378,
        0.02398131601512432,
        0.005353438202291727,
        0.04006434231996536,
        0.05750275030732155,
        -0.08999926596879959,
        -0.06300811469554901,
        0.024976080283522606,
        0.027290772646665573,
        -0.002914797281846404,
        0.14136798679828644,
        -0.06950291246175766,
        -0.05138987675309181,
        -0.049855343997478485,
        -0.02083796262741089,
        -0.011133085936307907,
        -0.05242530256509781,
        -0.008984017185866833,
        -0.022145483642816544,
        -0.12172131985425949,
        0.032949045300483704,
        0.060444168746471405,
        0.08660763502120972,
        -0.00847766362130642,
        0.03396512567996979,
        0.04106960445642471,
        0.046861615031957626,
        -0.01424252986907959,
        0.09318353235721588,
        -0.12204654514789581,
        -0.10245953500270844,
        0.003471566364169121,
        -0.019617410376667976,
        0.025797175243496895,
        0.08548364043235779,
        -0.032565176486968994,
        -0.03419550135731697,
        0.1033855751156807,
        0.11104359477758408,
        0.09209032356739044,
        -0.010843534953892231,
        0.005889273714274168,
        0.03792012855410576,
        -0.012221128679811954,
        -0.014784786850214005,
        -0.027583422139286995,
        -0.06805966049432755,
        -0.041734542697668076,
        0.0002625649212859571,
        0.05659016594290733,
        -0.049061473459005356,
        -0.019317833706736565,
        -0.0502747967839241,
        0.07454173266887665,
        -0.04504936560988426,
        0.010262314230203629,
        -0.053029417991638184,
        0.06685755401849747,
        0.012976410798728466,
        0.08764646202325821,
        -0.029705382883548737,
        -0.14282524585723877,
        -0.06657591462135315,
        0.07124187797307968
    ]
}