{
    "id": "JpTgfDfJTcI",
    "title": "Vivo Nex Dual Screen Teardown! - Its complicated...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-02-05T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=JpTgfDfJTcI",
    "category": "Howto & Style",
    "tags": [
        "Vivo Nex Dual Screen",
        "Dual screen smartphone",
        "Vivo Nex Dual screen review",
        "Teardown",
        "Dual screen teardown",
        "How to open Vivo Nex Dual screen",
        "Vivo Nex 2",
        "Nex",
        "Vivo",
        "Best smartphone",
        "Android",
        "hands on",
        "unboxing",
        "Dual display review",
        "3d camera",
        "TOF camera",
        "nubia x"
    ],
    "views": 1152557,
    "likes": 31240,
    "comments_count": 2119,
    "description": "Lets open up the Vivo Nex Dual Display! Get your first audiobook for free when you try Audible for 30 days! Visit  or text jerryrig to 500500 Did you happen to see any cracks in the glass? The Vivo Nex Dual Display also called the Vivo Nex 2 by some people is one of the coolest phones ive seen this year. It even has a headphone jack! Its time to teardown the vivo Nex dual display, disassemble it and review the phone with 2 screens from the inside.   Watch the Vivo Nex Dual Screen Durability test here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.audible.com/jerryrig",
        "https://youtu.be/ANqeyOzM0aQ",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Nex S Dual Screen smartphone, with massive screens on both the front and back of the phone. It's time to take this unique looking contraption apart and see how it's put together. Next thing you know, they'll be taking things a step farther and trying to go bezel-less on both sides instead of just the front. Totally fine with me. This video is sponsored by Audible. Let's get started. [Intro] When I open up a strange new phone for the first time, I'm usually going in blind. It's not like Vivo includes a disassembly instruction booklet with the phone. I am the instruction booklet. There are two visible T2 screws down at the bottom that need to be removed. But then I'm left deciding which side of the phone comes off first...the rear, like most glass backed phones and the previous dual screen Nubia X. Or is it the front that comes off? I decided to heat things up and start with the rear... ....and I chose wrongly. The goal of these tear downs is to reassemble the phone and get it back together in one piece after I take it apart. So obviously, we aren't off to a very good start. The phone still works though just a cosmetic crack. So I'll turn the whole thing back off again and we'll try to enter the forbidden internals through the front route. We don't know the adhesive level of the phone since there's no IP rating, but I'm going to warm it up anyway, because that's just what needs to happen with modern cell phones. Now sliding my tools between the plastic edge of the big screen and the metal frame of the phone, we can start to see a gap forming, meaning this time, we're going in the right direction. From a build perspective, having screens on both sides of the device makes it hard to tell which side needs to open first. And this phone is even weirder than I anticipated. When lifting off the screen, the entire phone body comes with it. Battery, motherboards and everything is attached directly to the screen. I did not see that coming. Removing the screen leaves only the metal frame and secondary rear screen behind. The back panel does have two ribbons sneaking up towards the motherboard. I'll unscrew the 5 silver Phillips head screws holding down the long metal ribbon cable bracket. And I'll unclip the sensor ribbon, but I'll leave the screen ribbon intact for now. I kind of want to see if we can get both screens working side by side instead of front and back. This might not be the smartest thing to do, but I've already done dumber things today, so what can it hurt? Might as well see if it's possible while I'm in here. I got both screens situated side by side and I can press the power button with my finger. And it looks like we are successful so far. I can use the 3 finger slide trick to transfer one side of the screen to the other. And since the phone still thinks it's in one piece it works. We should totally try out one of these apps to see if that works too. Hm. Huge thanks to Audible for sponsoring this teardown and supporting my channel. The latest book I've been listening to is called Artemis by the same author that wrote The Martian. Except this time around, instead of being on Mars, it's a new story about a mining colony on the moon, you know, with smuggling explosions and all kinds of science-y near death experiences and stuff. You can get a free audio book when you try Audible for 30 days. Just click the link in the description. Audible.com/jerryrig or text the word jerryrig to 500-500. J-E-R-R-Y-R-I-G. You get to keep the book even if you cancel the service. Audible also has something called Audible Originals a full range of exclusive titles only found on Audible. Whether you're in it for the entertainment or keeping your mind active while learning new things, Audible is worth a shot. I use it regularly while at the gym or driving. Audible.com/jerryrig. I'm really glad that worked, and the phone is still alive. I'll put it gently back to sleep so we can continue deeper inside. Unplugging the battery like a little Lego, and then I'll move over to the AMOLED screen connector ribbon and pop that off, releasing the back panel of the rear screen. I guess technically the rear screen can be replaced without replacing the whole housing. But with the weird circular camera lens thing, it's hard to say for sure exactly how that might happen. Weird phones makes for some weird repairs. We'll know more when replacement parts hit the market. I'll unplug the side button ribbon to make space for the battery removal. It's super nice of Vivo to make removing the battery easy. No broken pull tabs and no damage done to the 3500 milliamp hours during removal. There are 2 Phillips head screws holding down the long silver plate over top of all the 3 rear camera connectors. Then I'll find the 2 more screws over top of our little friend, the headphone jack up here at the top corner. It's got it's own little metal plate, but when that comes out, look how small this guy is. It's super impressive that Vivo can have two massive screens, a big battery, and still have room left over for the headphone jack. I'll remove the 4 screws holding down the motherboard, keeping the screws organized of course. And then I'll unclip the two bottom remaining extension ribbons and the two wire cables. Then the motherboard is free for us to take a look at. Surprisingly there is no thermal paste on this board like there is on most other flagships these days. And even though this phone has only been alive for a few hours, the metal above the processor does appear to be discolored by heat. I'm no expert, but I would like to see this phone bench marked next to a similarly spec'd flagship and see which one thermally throttles first. No thermal paste might be an issue down the road. Up here we have something called a TOF camera, or Time Of Flight. It's a self contained 3D system that measures distance and can produce some pretty cool 3D rendering of objects. I think Vivo is mostly just using this for fancy beauty modes in the camera settings for right now. But the future applications might be pretty fun. There are 2 regular cameras in here as well: a 12 megapixel main camera with it's 2 megapixel depth sensor side kick. The main camera does have optical image stabilization. And both cameras are housed in separate units. If you remember from the durability test, this phone has a speaker grille on both the front side and the back side. The ambidextrous smartphone can make calls from either screen. And the earpiece inside is what makes this all possible, allowing sound to escape from both the front and back of the speaker. Pretty cool. The vibrator motor is this cute little guy over here on the left. It's an eccentric rotating mass motor. A bit different than the coin style or taptic vibrators we are used to seeing these days. But even though it's an older style of vibrator, it still gets the job done. Remember, this phone does have an in-screen fingerprint scanner which is hidden down here at the bottom, under the 8 screws. One of which has a warrantee void sticker on it, which means we should probably stop the teardown. Just kidding. And that joke never does get old. I'll pop off the protective metal plate over the extension ribbon and under screen fingerprint scanner connector. Then I can remove the loud speaker. This thing does have a bit of the water resistant mesh covering the speaker hole, which is good. For the charging port board, I'll unplug the extension ribbon and white wire cable. And then the board itself can just shimmy out of the frame. We see a bit more of the water resistance here around the USB-C opening with this black rubber ring. We also have a square white water damage indicator residing next to the SIM card tray. If you remember, Vivo was the first smartphone manufacturer to introduce an in-screen fingerprint scanner back in 2017. Back then it was a literal square chunk of the screen that made repair pretty impossible. But this time around, Vivo is using the same style of sensor that we saw in the OnePlus 6T a simpler version. Quite literally just a camera that shines up through the display to take a picture of your fingerprint. You can see the hole in the middle of the frame that let's us view the underside of the AMOLED screen. And the light from my personal phone can shine up through the screen into the hole. It works the other way around as well. When the screen is turned on, it lights up your finger with animation so the camera underneath can take a good picture. Thumbs up for that. Vivo is definitely one of the leaders in innovation right now. They are making some pretty phenomenal and unique phones. I'll put the charging port back into place, along with the loud speaker and the 8 screws holding everything down. Then I'll get the 2 rear cameras back in place and scootch the motherboard down over the top, making sure that no ribbons get pinched underneath. The itty bitty but always useful headphone jack snuggles down into it's slot in the frame, and then I can screw in the motherboard, slide the battery back into place, and make sure all the ribbon cables are plugged in with the metal brackets holding everything tight. Since both front and rear screens are pretty difficult to replace, this phones not going to be winning any repairability awards, but at least the battery can be swapped out pretty easily. And now that we know how the phone opens, that particular step will be easier in the future as well. I'll take both of the rear panel ribbons and clip them onto the motherboard, along with plugging in the battery. Then I can screw down the large metal plate that keeps the connection secure. I'll turn the phone on before sandwiching it back together, just to make sure everything is working. And lucky for us, everything still functions. The triple finger swipe still swaps screens, and let's just pretend I opened up the phone right the first time around and I didn't damage anything. Alright. I don't see any cracks, do you? Congrats to Vivo for keeping the smartphone world interesting. I'll be looking forward to seeing what they have in store for us this year. Don't forget to grab your free audio book from Audible with a 30 day trial. Link in the description. And let me know what your favorite book is down in the comments so I can go check it out. Come hang out with me on Instagram and Twitter, and thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "Screen",
        "back",
        "side",
        "Audible",
        "screens",
        "Vivo",
        "rear screen",
        "rear",
        "ribbon",
        "phones",
        "front",
        "screws",
        "camera",
        "Dual Screen",
        "metal",
        "Battery",
        "time",
        "dual screen Nubia",
        "Nex S Dual"
    ],
    "transcript_entity_values": [
        "Artemis",
        "30 days",
        "Vivo",
        "30 day",
        "Audible Originals",
        "8",
        "Lego",
        "Instagram",
        "2017",
        "two",
        "Martian",
        "jack",
        "TOF",
        "a few hours",
        "12 megapixel",
        "Time Of Flight",
        "4",
        "Phillips",
        "SIM",
        "this year",
        "5",
        "T2",
        "first",
        "500-500",
        "AMOLED",
        "2 megapixel",
        "today",
        "these days",
        "Mars",
        "3500 milliamp hours",
        "3",
        "One",
        "The Nex S Dual Screen",
        "OnePlus 6",
        "Audible",
        "Nubia X.",
        "one",
        "Twitter",
        "IP",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "PERSON",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09193488955497742,
        0.04145319014787674,
        0.09588082879781723,
        -0.15128326416015625,
        0.0002250859106425196,
        -0.08332314342260361,
        0.027276551350951195,
        0.08004661649465561,
        -0.019327253103256226,
        0.0474512055516243,
        0.0718199834227562,
        -0.020888131111860275,
        -0.03358872979879379,
        0.07569915056228638,
        -0.012962223961949348,
        -0.0550469234585762,
        0.05343491956591606,
        -0.054643865674734116,
        0.0008135051466524601,
        0.11379405111074448,
        0.0595296248793602,
        -0.02873685583472252,
        -0.02041563019156456,
        -0.10732599347829819,
        -0.0007323917234316468,
        0.002462800359353423,
        0.01618194207549095,
        -0.008621249347925186,
        -0.037211380898952484,
        -0.057275742292404175,
        0.024349993094801903,
        0.0847112238407135,
        -0.07833652943372726,
        0.03250812366604805,
        0.0200087521225214,
        -0.1125425174832344,
        -0.007970720529556274,
        -0.03621625155210495,
        -0.09262179583311081,
        -0.06653711944818497,
        -0.06708701699972153,
        -0.02356550097465515,
        -0.043062105774879456,
        0.004035383462905884,
        0.012204614467918873,
        -0.06894651055335999,
        0.06792151927947998,
        -0.05878644809126854,
        0.09576437622308731,
        -0.01136381458491087,
        -0.0712215006351471,
        -0.010021135210990906,
        0.05033125355839729,
        0.07605504244565964,
        -0.04937608167529106,
        0.05910677835345268,
        -0.009407825767993927,
        -0.014177907258272171,
        0.019912229850888252,
        -0.011027182452380657,
        0.11748696118593216,
        0.03006438910961151,
        -0.004104601684957743,
        0.07749083638191223,
        0.022127041593194008,
        0.034034363925457,
        0.04108374938368797,
        -0.10505256801843643,
        -0.010235250927507877,
        0.02668394334614277,
        -0.06260215491056442,
        -0.01819401979446411,
        0.029867902398109436,
        -0.07939723134040833,
        -0.0021757616195827723,
        0.04287217929959297,
        -0.007933168672025204,
        -0.03097098506987095,
        -0.0009251970914192498,
        0.016560623422265053,
        0.04549743980169296,
        0.04889374226331711,
        -0.02745557762682438,
        -0.0005203144974075258,
        0.02471703290939331,
        0.06124882027506828,
        -0.0013408286031335592,
        0.07770398259162903,
        -0.028302351012825966,
        -0.08470810949802399,
        -0.06795140355825424,
        0.04459088668227196,
        -0.011081704869866371,
        -0.012553677894175053,
        -0.015922291204333305,
        -0.12633441388607025,
        -0.06830351054668427,
        -0.03694857656955719,
        0.004681007005274296,
        0.03211569786071777,
        0.040490660816431046,
        -0.012997860088944435,
        0.071754090487957,
        0.016802281141281128,
        -0.0025671750772744417,
        -0.10258657485246658,
        -0.03859920799732208,
        -0.006170311011373997,
        -0.030824167653918266,
        0.03564447909593582,
        -0.04315575584769249,
        0.0889650508761406,
        0.00690177408978343,
        0.02783074975013733,
        0.006196390837430954,
        0.048791833221912384,
        -0.02960558421909809,
        0.08042352646589279,
        0.11519883573055267,
        -0.0008790602441877127,
        0.03265394642949104,
        -0.04810895025730133,
        -0.07364895194768906,
        -0.0002572637458797544,
        0.08465283364057541,
        0.0007379679009318352,
        -0.04757152125239372,
        3.252379075690214e-33,
        0.02121666818857193,
        0.0718335509300232,
        -0.027459559962153435,
        0.02388913743197918,
        -0.02352329157292843,
        0.01500446442514658,
        -0.008079769089818,
        0.026971841230988503,
        -0.052460331469774246,
        0.046190135180950165,
        0.024802623316645622,
        -0.021149305626749992,
        -0.012988749891519547,
        0.044544897973537445,
        0.012099898420274258,
        0.014728240668773651,
        -0.04831305891275406,
        -0.01111456099897623,
        -0.03536512330174446,
        0.04113590717315674,
        -0.030225269496440887,
        -0.06203993409872055,
        0.0010306674521416426,
        0.02960830368101597,
        0.029339363798499107,
        0.05554121732711792,
        -0.024797020480036736,
        0.013589021749794483,
        0.01921069622039795,
        0.012686165049672127,
        -0.10546521842479706,
        -0.036491457372903824,
        0.10147364437580109,
        -0.018855292350053787,
        -0.020123586058616638,
        -0.008557847701013088,
        -0.004692495334893465,
        -0.039276622235774994,
        -0.030816683545708656,
        -0.004882218781858683,
        -0.12009356170892715,
        0.0628119632601738,
        0.05842575430870056,
        -0.07136118412017822,
        0.03673618659377098,
        -0.020488986745476723,
        -0.04709765315055847,
        0.051712632179260254,
        0.003200140316039324,
        -0.0401623472571373,
        -0.006220502778887749,
        -0.07792820781469345,
        -0.003627500496804714,
        -0.06772458553314209,
        -0.06382912397384644,
        -0.017733318731188774,
        -0.0010127335553988814,
        -0.004766873084008694,
        0.016503822058439255,
        0.057399045675992966,
        0.03949180617928505,
        -0.03574201092123985,
        -0.05766912177205086,
        0.03663255646824837,
        -0.049826156347990036,
        0.043541524559259415,
        0.011285691522061825,
        0.01889927126467228,
        -0.07287344336509705,
        0.016036758199334145,
        -0.056305184960365295,
        0.060557350516319275,
        0.042720917612314224,
        -0.05218435078859329,
        0.00985637679696083,
        0.04063975065946579,
        0.028778258711099625,
        -0.04460481181740761,
        0.020479882135987282,
        0.010893595404922962,
        0.0034196111373603344,
        -0.008750501088798046,
        0.04106326401233673,
        -0.022907249629497528,
        -0.032488711178302765,
        -0.05814160034060478,
        -0.03562343493103981,
        -0.0693625807762146,
        0.00567028671503067,
        0.006120416801422834,
        0.02221953123807907,
        -0.03434630110859871,
        -0.12401196360588074,
        -0.08048012852668762,
        -0.018453914672136307,
        -4.9322464610396665e-33,
        -0.03623416647315025,
        -0.01912258192896843,
        -0.045877259224653244,
        -0.04718875512480736,
        0.06338252127170563,
        -0.0022917042952030897,
        0.11891256272792816,
        0.09825784713029861,
        0.04113946855068207,
        -0.09824120998382568,
        0.02666401118040085,
        0.10425817221403122,
        -0.04463527351617813,
        0.025104541331529617,
        -0.005337977781891823,
        -0.04243403673171997,
        -0.003541440237313509,
        -0.10244598984718323,
        0.030658194795250893,
        0.019769875332713127,
        0.06941524893045425,
        0.05419815331697464,
        0.06260395795106888,
        0.04521085321903229,
        0.02758990228176117,
        0.024858972057700157,
        0.024744218215346336,
        0.03058660961687565,
        0.0008078785031102598,
        -0.007321613375097513,
        0.0480104424059391,
        -0.03214187175035477,
        -0.010466000996530056,
        0.08004730194807053,
        0.10136372596025467,
        0.062382668256759644,
        0.05904555693268776,
        -0.025133807212114334,
        -0.015240694396197796,
        -0.07871264964342117,
        -0.038840942084789276,
        0.11282429844141006,
        0.003159782150760293,
        -0.010006441734731197,
        -0.012795168906450272,
        -0.06452325731515884,
        -0.018839696422219276,
        -0.030668552964925766,
        -0.019336119294166565,
        -0.0049127209931612015,
        -0.03141142427921295,
        0.01574702188372612,
        0.01383206807076931,
        -0.043124355375766754,
        -0.04352359101176262,
        -0.0017988256877288222,
        0.01780390366911888,
        -0.03958487883210182,
        0.05535687878727913,
        -0.003603900782763958,
        0.08717348426580429,
        0.07970186322927475,
        -0.11210329085588455,
        -0.07319293171167374,
        -0.04107583686709404,
        -0.007959217764437199,
        0.01955200918018818,
        0.065520279109478,
        -0.02108861319720745,
        0.060948412865400314,
        -0.0028759168926626444,
        0.023941433057188988,
        0.006661268416792154,
        -0.09821271896362305,
        0.04963395744562149,
        0.025160856544971466,
        -0.10747476667165756,
        -0.04259834811091423,
        -0.0035509499721229076,
        0.0010726969921961427,
        0.022983793169260025,
        -0.07325582206249237,
        0.04868604615330696,
        0.0664668008685112,
        0.06992941349744797,
        0.04525255784392357,
        -0.003692924277856946,
        0.04989456385374069,
        -0.018651369959115982,
        -0.03912897780537605,
        -0.06861742585897446,
        0.023330876603722572,
        -0.07110457867383957,
        0.05986793711781502,
        0.0092616006731987,
        -5.482327836148215e-08,
        0.051424961537122726,
        0.009429050609469414,
        0.012422572821378708,
        -0.06276682764291763,
        -0.03312832862138748,
        -0.09660264104604721,
        0.048590220510959625,
        -0.01167215220630169,
        0.07913295179605484,
        -0.057911328971385956,
        -0.015702104195952415,
        -0.049914758652448654,
        -0.022526904940605164,
        0.07907988876104355,
        -0.006885954644531012,
        0.09949277341365814,
        -0.0379682257771492,
        0.05937613174319267,
        -0.037149783223867416,
        -0.0742400735616684,
        -0.05973152816295624,
        0.040574751794338226,
        0.08721742033958435,
        -0.039828360080718994,
        0.015431086532771587,
        0.02037842944264412,
        -0.07812514156103134,
        -0.01271295826882124,
        0.06476227939128876,
        -0.027756813913583755,
        -0.0765187069773674,
        0.009228810667991638,
        0.002140515483915806,
        -0.023705916479229927,
        -0.03250744566321373,
        -0.046250391751527786,
        -0.039382901042699814,
        0.06068471446633339,
        0.07604487985372543,
        0.019497253000736237,
        0.011225193738937378,
        -0.04988785460591316,
        -0.009938734583556652,
        0.05150017887353897,
        0.029286932200193405,
        -0.06267163157463074,
        0.10091813653707504,
        -0.12384767830371857,
        -0.030063513666391373,
        -0.01466395240277052,
        -0.03218802809715271,
        0.03706066682934761,
        -0.07699359953403473,
        -0.009827817790210247,
        -0.022869909182190895,
        -0.0407618023455143,
        0.050492797046899796,
        0.07102036476135254,
        0.003900334471836686,
        0.034962546080350876,
        -0.02569880336523056,
        -0.011367905884981155,
        0.007208754308521748,
        0.06455814093351364
    ]
}