{
    "id": "jQkjwsdthgA",
    "title": "The LG V40 Has Five Cameras 📸",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-10-03T21:02:04Z",
    "video_url": "https://www.youtube.com/watch?v=jQkjwsdthgA",
    "category": "Science & Technology",
    "tags": [
        "lg v40",
        "best camera phone",
        "lg v40 thinq",
        "v40",
        "lg v40 camera",
        "lg v40 thinq review",
        "lg v40 review",
        "lg",
        "v40 thinq",
        "smartphone",
        "android",
        "flagship",
        "lg thinq",
        "lg v40 specs",
        "tech",
        "best smartphone camera",
        "v40 lg",
        "austin evans",
        "v40 2018"
    ],
    "views": 300984,
    "likes": 8325,
    "comments_count": 804,
    "description": "Check out the Massdrop $150 audiophile headphones!  With the LG V40 ThinQ you're getting five cameras on a top notch Android flagship. $400 Pocophone F1 vs $1100 iPhone XS Max:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://dro.ps/austinevans-hd58x",
        "https://www.youtube.com/watch?v=3u7CuBZofBI",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. 2018 has been a very interesting year for smart phones. We've lost our friend, the headphone jack, and instead we now have notches on almost every smart phone you can buy, and dual camera set ups are everywhere. But what if I told you that there is a smart phone flagship in 2018 that does things just a little bit differently? The brand new LG V40 ThinQ ticks all the boxes you would expect out of a modern flagship. You're getting that huge 6.4 inch OLED display. It does have a notch, although it actually is hidden by default, which looks nice, and you're getting that classic glass and aluminum build. With, well, something just a little bit different. If you look closely you'll find not one camera, not two cameras, but three cameras on the rear. And just to sort of add to that, there's also two front facing cameras. The three cameras aren't just for show. They each serve a different purpose. So the main camera is what you would expect on most smart phones. It's a roughly 30 millimeter equivalent, but the wide angle camera at 16 mil is going to give you a much wider field of view, and the telephoto with a roughly 2X zoom, and around 50 millimeters is going to get you much, much closer to the action. I sound like the, the LG ad right now. It'll get you closer to the action. The main camera is the highest quality of the three. Now you do have a wide F1.5 aperture, but there's also optical image stabilization, as well as dual pixel auto focus. That wide angle can give you a very different perspective. Now to be fair, this is something that LG has been doing on their flagships for a little while now, but usually you lose that on the telephoto option. Whereas with the V40, you literally get it all. The telephoto camera is the weakest of the three. All of that comes down to the sensor which does seem a bit inferior to the wide and the standard. You don't quite have the same range and you are losing some features. Like it does not support RAW, and the color just isn't quite on par. Quality wise, the V40 cameras do a pretty good job, but they're a little bit different than the iPhones and the Galaxies of the world. So out of the box, it's not going to be as punchy, however, I think a lot of people who are buying the V40 are going to really be into sort of customizing and tweaking their images. And there's a lot of flexibility here, specifically thanks to that RAW processing. There's just a lot of dynamic range that you can get out of the wide and the standard photos. It might not be quite on par with like an SLR or something, but it's really impressive what you're able to get out of this if you don't mind doing a little bit of editing. Low light performance is pretty impressive on the standard shooter, as is the bokeh, it's very nice, even without the portrait mode. And on top of that, the AI cam is actually decent. So like most smart phones in 2018, it has some kind of mode which will give you a little bit of an optimization based on what you're taking a photo of. For example, if you take a photo of food, it'll will boost like saturation or sharpness or whatever the case is. Usually I don't find this all that useful, and you can of course turn it off here, but it actually does a pretty good job out of the box. The portrait mode on the V40 is actually pretty decent. So to be fair, we do have pre-release software, so I have noticed a few issues, like sometimes it does a really good job of cutting you out of the shot, but then it'll slightly miss focus, but generally speaking, it's pretty solid. It is a little bit weird that you can't take a portrait mode shot with the telephoto camera, like pretty much every other phone. Instead you have to use the main shooter. I assume that's probably something to do with the fact that the telephoto camera isn't as good, but there are some cool modes, including a contour lighting mode. It's very similar to what you're getting on the iPhone, but my favorite is the colored backdrops. So as opposed to just cutting you out and putting like a black background behind, you can pick a bunch of different colors and some of them look really nice, assuming you don't have hair. Or anything that it doesn't like. Matt looks great on it, this one's top notch. Video is a huge component of the V40, so as a little test, we are now shooting on the V40 at 4K 24 frames per second. You can go all the way up to 4K 60, but for this test, because this is the 24p video, that makes a little bit more sense. We have the high bit rate mode enabled, we are shooting in HDR 10 and then grading it down to Rec. 709 to fit inside a standard YouTube time line. So you guys can get a good sense of sort of the quality of the image, as well as the audio, because we are using the Hi-Fi audio that is built into the phone. As if three rear facing cameras weren't enough, you also have two selfie shooters. So one is going to be a standard eight megapixel, and then we have an extra wide five megapixel option. To be honest, I can't tell a huge difference at first glance between the two shooters. But once you actually switch over to that wide angle, that can make the difference between getting your friends in the shot, or only your favorite friends in the shot. The bottom line is that while it sounds excessive to have five cameras on your smart phone, they actually do all serve a purpose. Props to LG for not just adding gimmicky features like a extra depth sensor or a monochrome sensor. All five lenses really do give you something different here. The V40 continues LG's trend of not only including a headphone jack, but a properly good one. So this is rocking a 32 bit Hi-Fi quad DAC, and what better way to test that then with the sponsor of today's video. Massdrop and the Sennheiser 58X Jubilee headphones. All you need to do is jump into the LG settings and enable the Hi-Fi quad DAC and we should have the full power of the phone. Woo (soft rock music). So one of the reasons why this actually is a really good combination is that these headphones, even though they're only $150, are proper audiophile grade. I mean they sound almost identical to the $500 version of the Sennheiser headset. These headphones actually are able to be driven with a normal headphone jack, so if you wanna plug it into a standard phone or laptop, they're going to sound good. But if you have something that can give 'em just a little bit more juice, such as the V40, it really does help them to come alive. So you will probably be able to hear my music pretty well with these, and that is because they are open back headphones. Now there are pros and cons to this design. One of the pros is these, like a lot of other high end headphones, do give you a very wide sound stage, it's a rich, rich sound, but on the downside, it is definitely going to be a little more for home use because well, it's not exactly a stealthy way of listening to music. If you've been curious about getting into higher end audio, the HD 58X Jubilees are an awesome way to get into it, and right now they're only $150 on Massdrop. But if you guys know how Massdrop works, they're not going to last for long. They've sold over 20,000 of these pairs of headphones, so you'd better get them soon, or you might be waiting quite awhile. Now if you'll excuse me, I'm going to go back to listening to a little bit of music on my LG V40 and my super dope headphones. Coming back to the V40, the hardware is very similar to a bigger G7. That means you have glass on front and back with an aluminum build, as well as a fingerprint sensor right where it belongs. Unfortunately what you're not going to find is any kind of face unlock, but I don't know, I mean fingerprint sensor still works, right? The screen looks terrific. It's a 6.4 inch OLED display with 1440p resolution, and they actually have a lot of different customization options, as you would kind of expect on a high end phone like this, that's aimed for more of the creative Wes's of the world. - Yes, I like how the display is customizable, for the creative professionals like me in the world. - Thanks Wes. Unfortunately, early software on the V40 means that we can't actually do our full screen regimen of tests, but based on at least subjective impressions, it looks very accurate, although maybe not quite as bright as stuff like the iPhone XS or the Note9. Inside you'll find a Snapdragon 845, paired with six gigs of RAM, as well as 64 gigs of storage, and that is expandable with a micro SD card slot. AKA, it has almost the exact same spec as every other Android flagship in 2018. Now we are shooting this video before the official announcement, so at the moment we don't have the final price or the release date, but assuming that it is somewhere in that $800 to $1000 flagship range, it looks interesting. The cameras really are the selling point of the V40. Having three individual options is something that is legitimately helpful to have on a phone. There's a lot of potential here, and I'll tell you what, this certainly will not be the last phone we see with three or even five cameras this year. Or next year, it's probably gonna be a thing now.",
    "transcript_keywords": [
        "bit",
        "cameras",
        "camera",
        "phone",
        "telephoto camera",
        "smart phones",
        "wide",
        "good",
        "headphones",
        "smart",
        "pretty",
        "Austin",
        "mode",
        "lot",
        "give",
        "standard",
        "main camera",
        "telephoto",
        "smart phone flagship",
        "wide angle camera"
    ],
    "transcript_entity_values": [
        "five megapixel",
        "roughly 2X",
        "over 20,000",
        "six",
        "next year",
        "this year",
        "only $150",
        "three",
        "iPhone",
        "2018",
        "24p",
        "Android",
        "first",
        "RAM",
        "the AI cam",
        "jack",
        "around 50 millimeters",
        "64",
        "Austin",
        "G7",
        "709",
        "two",
        "roughly 30 millimeter",
        "Sennheiser",
        "Matt",
        "SLR",
        "16 mil",
        "LG",
        "4",
        "iPhones",
        "one",
        "YouTube",
        "second",
        "500",
        "a very interesting year",
        "32",
        "five",
        "V40",
        "SD",
        "eight megapixel",
        "Rec",
        "Massdrop",
        "$800 to $1000",
        "One",
        "Wes",
        "today",
        "the iPhone XS",
        "6.4 inch",
        "HDR 10",
        "V40",
        "Massdrop"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "EVENT",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "EVENT",
        "PRODUCT",
        "GPE"
    ],
    "vector": [
        -0.03368674963712692,
        0.018199391663074493,
        0.11280463635921478,
        -0.07847794145345688,
        0.06824415922164917,
        -0.0173188466578722,
        0.025416208431124687,
        0.10759811848402023,
        -0.004179127048701048,
        0.06495340913534164,
        0.061750009655952454,
        0.00427325488999486,
        0.03504788503050804,
        0.008410496637225151,
        0.06001122668385506,
        -0.020342102274298668,
        0.04286257177591324,
        -0.10479570925235748,
        -0.03341963514685631,
        0.03691098093986511,
        0.019343538209795952,
        -0.04470156878232956,
        0.0221833735704422,
        -0.00013613591727335006,
        0.045758530497550964,
        0.019447054713964462,
        -0.057277798652648926,
        -0.03311839699745178,
        -0.0405224934220314,
        -0.05457546189427376,
        0.0213992428034544,
        0.10440567135810852,
        0.01011877041310072,
        0.045271873474121094,
        -0.04286828637123108,
        -0.14165140688419342,
        0.021648794412612915,
        -0.019503002986311913,
        -0.03962398320436478,
        0.0002562254958320409,
        -0.02274724654853344,
        -0.03534408286213875,
        -0.032136522233486176,
        -0.02131110429763794,
        -0.053340844810009,
        -0.0101015605032444,
        0.04856018349528313,
        -0.017739187926054,
        -0.06658099591732025,
        -0.07009342312812805,
        0.0024049803614616394,
        -0.0412924699485302,
        0.027715211734175682,
        -0.0067092194221913815,
        -0.09235207736492157,
        -0.010218828916549683,
        -0.06506931781768799,
        0.017645569518208504,
        0.029868928715586662,
        0.06700680404901505,
        0.007877204567193985,
        0.036623768508434296,
        -0.028979523107409477,
        0.07580229640007019,
        -0.01181273628026247,
        0.03343057632446289,
        0.02721480280160904,
        -0.06606670469045639,
        -0.00418931245803833,
        0.03169158101081848,
        -0.032579950988292694,
        0.013450509868562222,
        0.00026955766952596605,
        -0.0357319712638855,
        -0.020265711471438408,
        0.01559210941195488,
        0.03765728697180748,
        -0.02130703069269657,
        0.02294004335999489,
        0.012451422400772572,
        0.042017363011837006,
        -0.057692255824804306,
        -0.09218312799930573,
        -0.01584136299788952,
        0.005402570590376854,
        -0.046331461519002914,
        -0.00025295448722317815,
        -0.014210359193384647,
        -0.05512600019574165,
        -0.12391968816518784,
        -0.1046585664153099,
        -0.022630080580711365,
        -0.1047845259308815,
        0.022168587893247604,
        -0.01742548868060112,
        0.005581308621913195,
        -0.03455451875925064,
        -0.03709246218204498,
        0.05340120941400528,
        -0.004601997323334217,
        0.0390576533973217,
        0.01983785443007946,
        0.05815261974930763,
        -0.014110987074673176,
        0.07146193087100983,
        -0.04393631964921951,
        -0.0420052744448185,
        -0.017173243686556816,
        -0.019103454425930977,
        -0.00318495137616992,
        0.003381534246727824,
        0.025326399132609367,
        0.015081970952451229,
        -0.013724390417337418,
        -0.02223525382578373,
        0.0006140968762338161,
        0.027599437162280083,
        0.034270066767930984,
        0.08704149723052979,
        -0.005583225283771753,
        -0.007401492912322283,
        -0.07385902851819992,
        -0.042303942143917084,
        -0.029888862743973732,
        0.03742149844765663,
        0.022325143218040466,
        -0.01596761681139469,
        3.616073354414783e-33,
        0.002611133037135005,
        0.06263253837823868,
        -0.039432235062122345,
        -0.040025174617767334,
        0.022855378687381744,
        0.007848731242120266,
        0.00421553198248148,
        0.07144006341695786,
        -0.04271315783262253,
        0.07409306615591049,
        -0.01487916149199009,
        -0.03372374549508095,
        0.00985417515039444,
        0.04675685986876488,
        0.051910556852817535,
        -0.020937355235219002,
        -0.074333555996418,
        -0.029092824086546898,
        -0.02558005042374134,
        -0.0034128171391785145,
        -0.08025677502155304,
        -0.015489334240555763,
        0.026341358199715614,
        0.06389117985963821,
        0.07497172057628632,
        0.0769200548529625,
        0.10500520467758179,
        -0.023344457149505615,
        0.018951889127492905,
        -0.012125704437494278,
        -0.08193580061197281,
        0.018569784238934517,
        0.05486944690346718,
        -0.010269067250192165,
        0.003773110918700695,
        0.06914971023797989,
        -0.020429223775863647,
        -0.05707215145230293,
        0.021488947793841362,
        -0.0475030317902565,
        0.06197100132703781,
        0.06328967213630676,
        -0.10353434085845947,
        0.0054365359246730804,
        0.028622116893529892,
        0.06043738126754761,
        -0.07349510490894318,
        0.009833012707531452,
        -0.09174931049346924,
        0.023465996608138084,
        0.01397002674639225,
        -0.021273387596011162,
        -0.041105568408966064,
        0.006912682205438614,
        -0.056948453187942505,
        -0.014536422677338123,
        -0.06481818854808807,
        -0.008906560018658638,
        0.08856149762868881,
        0.012030535377562046,
        0.008522740565240383,
        0.03493579849600792,
        -0.060578200966119766,
        0.026762306690216064,
        0.007259789854288101,
        0.06783253699541092,
        0.0741584524512291,
        0.026076238602399826,
        -0.06019924581050873,
        0.09883074462413788,
        0.057831279933452606,
        0.008030104450881481,
        0.064366415143013,
        -0.08407444506883621,
        0.08012456446886063,
        0.055044785141944885,
        -0.038474589586257935,
        -0.07321885228157043,
        0.06502889096736908,
        0.028670450672507286,
        -0.020246507599949837,
        0.06591009348630905,
        0.11308077722787857,
        0.044804636389017105,
        0.015776213258504868,
        -0.04258965700864792,
        0.01561753824353218,
        -0.02354784496128559,
        -0.0008635203121230006,
        0.045090049505233765,
        -0.052180562168359756,
        -0.018087008967995644,
        0.029811011627316475,
        -0.00025483008357696235,
        -0.021997299045324326,
        -3.421237002475912e-33,
        -0.015214882791042328,
        0.008219119161367416,
        -0.006612848024815321,
        -0.027282504364848137,
        0.03365276753902435,
        -0.0635027289390564,
        0.09243987500667572,
        0.04912330210208893,
        0.016400055959820747,
        -0.018896471709012985,
        0.07496345788240433,
        -0.0053347209468483925,
        -0.03736227750778198,
        0.024337414652109146,
        -0.022359274327754974,
        -0.034851498901844025,
        -0.0055196862667799,
        -0.17559611797332764,
        0.03520025312900543,
        0.02357962541282177,
        0.07212729752063751,
        0.01573057286441326,
        0.017993729561567307,
        0.11989572644233704,
        -0.01792306825518608,
        0.009425587952136993,
        -0.06038481742143631,
        0.02252008765935898,
        -0.01753961108624935,
        -0.07761851698160172,
        0.023450346663594246,
        -0.10177768766880035,
        0.07797284424304962,
        -0.033006008714437485,
        0.04820297658443451,
        0.03267209231853485,
        0.04170595481991768,
        0.017621517181396484,
        0.05494074895977974,
        0.0169934444129467,
        -0.09823208302259445,
        -0.0012288653524592519,
        0.04559436812996864,
        -0.08294985443353653,
        0.07895766198635101,
        -0.044331859797239304,
        -0.013114940375089645,
        0.00183096865657717,
        -0.018857380375266075,
        -0.024115251377224922,
        0.011495032347738743,
        0.06011461094021797,
        -0.07219947129487991,
        0.04956079646945,
        -0.12749654054641724,
        -0.007503652945160866,
        -0.05538785830140114,
        -0.032491929829120636,
        -0.025527874007821083,
        0.04569023847579956,
        0.09780126810073853,
        -0.0031905227806419134,
        -0.0846603736281395,
        -0.026218002662062645,
        -0.029848722741007805,
        0.02676389180123806,
        0.0652695968747139,
        -0.05169786140322685,
        -0.04864765331149101,
        0.02699088118970394,
        -0.01971990056335926,
        -0.06205351650714874,
        0.018769752234220505,
        -0.06741995364427567,
        0.06832725554704666,
        0.09801306575536728,
        -0.10042261332273483,
        -0.008518277667462826,
        0.04125238582491875,
        0.022763743996620178,
        0.026360299438238144,
        -0.06337621808052063,
        0.06726186722517014,
        0.05583717301487923,
        0.034237347543239594,
        0.011211701668798923,
        -0.05056952312588692,
        -0.048539429903030396,
        -0.014289156533777714,
        0.026974055916070938,
        -0.06116531044244766,
        -0.05837136134505272,
        -0.09438281506299973,
        0.04072404280304909,
        0.02667471393942833,
        -4.8368288929623304e-08,
        0.0858955904841423,
        0.0012127680238336325,
        0.011252809315919876,
        -0.018533987924456596,
        0.0022595617920160294,
        -0.10473918914794922,
        -0.03213932365179062,
        0.01992150768637657,
        0.13225366175174713,
        -0.04148336872458458,
        0.029102010652422905,
        -0.07721911370754242,
        -0.05713726207613945,
        0.09373174607753754,
        0.054685596376657486,
        0.03232014179229736,
        -0.03640232980251312,
        0.05030430853366852,
        -0.030039403587579727,
        0.026411669328808784,
        0.004559660796076059,
        0.039356768131256104,
        0.03577248007059097,
        -0.05017886683344841,
        0.05241988226771355,
        0.023036397993564606,
        -0.06592582166194916,
        -0.0014691429678350687,
        0.05443819612264633,
        -0.011135220527648926,
        -0.0458807647228241,
        0.04156632721424103,
        -0.02852553129196167,
        0.04078506678342819,
        0.05144773796200752,
        -0.08552882075309753,
        -0.029596326872706413,
        0.007896551862359047,
        0.043554164469242096,
        0.03646446764469147,
        0.022439686581492424,
        -0.14454469084739685,
        -0.01412979606539011,
        0.07457426935434341,
        0.027122946456074715,
        -0.031588029116392136,
        0.07297654449939728,
        -0.08672145009040833,
        0.0012410408817231655,
        0.01752500608563423,
        -0.03967449814081192,
        0.0417117103934288,
        -0.008973597548902035,
        -0.031575966626405716,
        0.027411187067627907,
        -0.07051137089729309,
        0.13444244861602783,
        -0.019174842163920403,
        -0.05134645104408264,
        -0.026947500184178352,
        0.011147551238536835,
        -0.0502217672765255,
        0.03206045553088188,
        0.12550178170204163
    ]
}