{
    "id": "jQlpiJNQg7Y",
    "title": "Xbox Series X Unboxing & Review!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-11-05T14:16:27Z",
    "video_url": "https://www.youtube.com/watch?v=jQlpiJNQg7Y",
    "category": "Science & Technology",
    "tags": [
        "xbox",
        "x box",
        "xbox series x",
        "series x",
        "series s",
        "ps5",
        "microsoft",
        "xbox series x review",
        "xbox series x unboxing",
        "series x review",
        "series x unboxing",
        "xbox series x vs ps5",
        "series x vs ps5",
        "playstation",
        "playstation 5",
        "game console",
        "unboxing",
        "review",
        "tech",
        "gaming",
        "load times",
        "comparison",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 1071139,
    "likes": 36979,
    "comments_count": 2892,
    "description": "The Microsoft Xbox Series X brings serious competition to the PS5 but is it enough? Why you need a new TV for Xbox Series X and PS5:  Does the Xbox Series X overheat?   My new podcast @TheBackmarkers!  Our second channel @thisis!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/dBAveEUyr8A",
        "https://youtu.be/n5eXwMCa3Ko",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- This is the Xbox Series X, I've spent a lot of time with this console this year. So let's take a closer look at what Microsoft latest and greatest console is all about. Spoiler alert, this is really the Xbox 1.5 that's not necessarily a bad thing though there's a whole lot to unpack here before we get into the unboxing. Now and on the back, we've got the well, oh, that's you can't play that yet, can you? Oh, no, I think it's time to open up the Series X. Whoa, whoa, yo, that is an unboxing experience, holy I've waited so long for this, so we have the hardware, we also have what I assume are our cables, controllers, that kind of stuff. So we have an HTMI cable, now unlike a lot of time when you are unboxing and go whatever you actually are probably gonna wanna use this because this is a high speed HDMI 2.1 cable. Now any HDMI will work with the Series X, in fact any TV pretty much will work with the Series X but to get those high frame rates, 8K, all that kind of stuff, you're gonna want an HDMI 2.1 cable like the one they've very kindly included so definitely hold on to this one. There we go, that's our Xbox box now, wanna take a look at our Xbox box Xbox box and that my friends is a retail model of the Xbox Series X, now of course, this is a little bit more PC like than most console, so it is a vertical design. Although I will mention, you can drop it on its side, so it does have four little rubber feet so you can use it like this, but up front it's pretty straightforward. You have a USB A port, your controller button, the power button as well as your 4K Blu-ray drive. So this will accept discs from the original Xbox, from the 360 and the Xbox one, as well as your DVDs, Blu-rays all that kind of stuff. But around back we have a decent amount of ports, including our HDMI, power, ethernet, two more USB-A for total of three, as well as the storage expansion module. Up top, you'll see the big fan itself. So that is the only fan in the entire Xbox Series X, but we have done an entire video talking about the overheating potential or rather the lack thereof, which you guys can feel free to check out. So now I think it's time plug it in and take a closer look at exactly what you get with the Xbox Series X for this generation. Going into this generation, one of the main differences between these Series X and the previous generations is in speed. So yes, the Xbox Series X is the most powerful console of all time, beating out of course, all the previous Xboxes but even slightly beating out the PlayStation Five. But when you look at the gameplay, it looks nice, it looks better, but we're not seeing the kind of massive leap that we've seen with previous generations, right? I think going from PS2 to PS3, for example. A part of that is because the Xbox Series X as well as the little brother this Series S are powered by the Xbox Velocity Architecture, which is code for an SSD. Now there are certainly doing some stuff on the backend to actually able to sort of fire hose that data straight from your SSD unto the graphics. So there's a lot that they're doing but generally this is sort of bringing the console's at parity to what the PC space has had for a long time. It's one thing to talk about how fast the console is but it's really good a good sense of it, let me give you a little bit of a load time comparison. So here I have \"Watch Dogs: Legion\" a game which is optimized, for not only the original Xbox One S and X but also of course has a port for the Series S and the Series X and the difference is massive. Whereas these new consoles can load it in about 21 seconds, the previous generation consoles are over a minute and 10 seconds, that is a massive difference. Same thing goes for other titles such as Gears 5 while yes on the Series X and S you're loading in 10, 11 seconds. The previous generation of consoles they're 52 seconds and a minute and one second respectively. Same story for \"Dirt 5\", you're looking at 12 seconds on these new consoles compared to 40 and 42 seconds on the Xbox One that is something that you will notice every time you load a game. Now, when it comes time to play games on the Series X, generally titles will fall into a couple of categories. First of all, there's backwards compatible games these are titles that would already work on the previous Xbox One. So things like original Xbox games, 360 games, Xbox One games, they'll run at least as well on Series X, if not better than they did before. Next, there's a series of games which supports Smart Delivery so generally these are Xbox One games that are being optimized for the Series X. So take, for example, \"Forza Horizon 4\" that is a game which gets some improvements but most importantly, will run at 4k at 60 on the Series X with that patch of course comes free of charge. The same thing goes for a lot of other titles \"Gears\" is a good one where not only does it get improved quality settings, 4K60, but importantly it also supports 120FPS in multiplayer like another example of an Xbox One game which is just being modified to work on these consoles. Now, outside of that, there's a another category of games which is not an official category, but for me, they're more of the games that can truly take advantage of this hardware. So things that really take advantage of the Ray tracing, for example, now \"Dirt 5\" is one of the games, as well as \"Watchdogs Legion\" that are technically Series X native games. They're not just like patched but these are the early games from the generation. As always, I expect things to improve over time with these games are taking advantage of things like that Ray tracing to push the envelope on graphics a bit. But that being said, when you look at the console generation that we're coming into with the Xbox Series X and the PS5, there's not a killer feature yet, right? None of these games look like they're true next gen powerhouses. They look a little bit better where you really noticed that difference besides stuff like the loading times is the fluidity. The idea that we will see many more games running at 60FPS is great, 4k60 is a very smooth experience and at this point I would say the majority of people who were buying these consoles already have 4k TVs. If you don't then can I introduce you to my friend the Xbox Series S, which we'll be doing a much, more in-depth video on soon. So make sure to stay tuned but that is a console which is a little more focused at 1080P and sub 4k resolutions. But the idea of you're getting these games, which will look a little bit better and will ideally look even better in the future But importantly, they're running quicker, smoother and you have the ability to run it even higher frame rates up to 120 FPS. So for a good example of how the frame rate can impact your game running at 30 FPS means that you get a brand new frame displayed on your TV every 33.3 milliseconds you run it 60 FPS, you get a new frame every 16.7 milliseconds. However, if you're running at a 120 FPS you get a new frame, every 8.3 milliseconds. Now I don't need to tell you the difference between seeing someone walk around the corner and eight milliseconds versus 33 can make a huge difference. Now only just for you to be able to react but also for your controller to be able to respond, right? These kind of differences cannot only just look great, right? I mean, obviously the game looks super smooth there's a reason why most phones these days have higher refresh rate displays but also you have that performance inside these new consoles. Now, I don't want to give you the wrong idea here the Xbox Series S can run some games at 120 FPS, the PlayStation 5 will absolutely run games at 120 FPS and in fact, we've done an entire video talking about the TVs you need to get because most TVs today will not support these high refresh rates. But the nice thing about this new generation of consoles is it is pretty much baked in from the start. So what you're looking at here, if I'm just to give you the top line of the whole experience going to next gen is not necessarily games that look a lot better, right? From the graphics, there are certainly improvements and there's more to come. What you're really going to see is in the speed of the load times and just how fast everything moves as far as the interface goes and just simply how smooth the games run. You should expect a higher level of performance for the vast majority of games this time around, you know, all those 30 FPS games are gonna be 60. All those old 60 FPS games are gonna be 120 with some caveats here and there, but it's a different kind of generational leap than what we've seen in the past. When you look at the Series X controller, this looks very similar to the Xbox One and I think the theme here is very much evolution. So if you look at something like the DualSense controller on the PS5 this is a much more thorough re-imagining of what a controller can do now of course make sure to subscribe to the channel for a lot more on the PS5, as well as the DualSense. But speaking specifically about this Series X there are a couple of major improvements. First of all, it now uses a USB-C port it also has a new texture grip on the handles. These shape has been slightly redesigned compared to the Xbox one so it's a little more friendly to smaller hands. You have a new share button as well as a much improved D-pad but generally speaking, this is very similar to the Xbox One controller and in fact, you actually can use this on the Xbox One and vice versa, if you already have any Xbox One controllers. They will work right out of the box with the Series X and of course, all of this is compatible with the PC as well as things like your phone as well. Now there are some under the hood improvements on the Series X controller. So things like latency has been improved specifically when you're using with these brand new consoles, but generally speaking, if you like an Xbox One controller, you'll like the Series X very much a Xbox 1.5 controller. If I do say so myself, which considering that I liked the Xbox One controller more than pretty much anything else, not a bad thing, but it's not quite as ambitious it's something like the DualSense. - [Ken] If it ain't broke, don't fix it. - It's a great great point unless you can fix it better. So if you'll humor me for a second, let's say that the Xbox Series X really is that Xbox 1.5, right? So while yes, a lot of things are very similar there are some major improvements that have been happening this console generation. They just simply won't be replicated into the future and honestly, this is really the backbone of gaming for the next five, six, seven years plus. So the thing is while certain aspects of technology and of gaming are evolving at a super fast pace, you look at graphics, right? Which, I mean, this is almost 10 times more powerful than the Xbox One when it first came out when it comes to graphics, but then you look at the memory which is barely twice as much, right? Certain things scale at different sort of rates and the last generation quite simply was pretty conservative, right? I mean, the graphics were okay, but those last gen consoles, weren't all that powerful when you compare them to even a mid-range PC of 2013. When you compare that to today, when you build a fairly high end gaming PC, you're actually looking at roughly equivalent specs, the Xbox Series X and the PS5, that bodes well going into this generation because you have that baseline of performance because let's not forget the vast majority of games out there are designed with the console's in mind first and PC second, right. And while yes, I will say that there are certainly some aspects which feel very much like a quicker Xbox One but there's also not really a lot of time to think back on those old days of going from PS1 to PS2 or PS2 to PS3, right? There's lots of different people who buy consoles but at the end of the day I think one of the most important things is that things are moving forward, right? And I think it's hard to argue that the Xbox Series X doesn't move things forward in a pretty major way. It might not be as flashy as the PS5, It might not have that trick new controller, the PS5 does, it might not be as cheap as the Xbox Series S but if you are someone who is interested in the Xbox One, if you were someone who was interested in a game console to play actual games on, unlike some other devices that pretend to be game consoles, then it's hard to go wrong with the Xbox Series X. I mean that in a real way, right? It's easy to get caught up in the speeds and feeds, it's easy to get caught up in the millisecond and the megahertz, but ultimately the Xbox Series X is a refined, quicker, and ultimately a console that has a whole lot more potential than the Xbox One ever did.",
    "transcript_keywords": [
        "Xbox Series",
        "Xbox",
        "Series",
        "Xbox box Xbox",
        "entire Xbox Series",
        "games",
        "Xbox box",
        "original Xbox",
        "original Xbox games",
        "console",
        "consoles",
        "Xbox games",
        "time",
        "Xbox Velocity Architecture",
        "game",
        "FPS",
        "things",
        "controller",
        "FPS games",
        "generation"
    ],
    "transcript_entity_values": [
        "60FPS",
        "hose",
        "Gears 5",
        "2.1",
        "four little rubber feet",
        "the Series X and S",
        "33",
        "first",
        "this Series S",
        "two",
        "the Series X",
        "120",
        "4K60",
        "one",
        "60",
        "Watch Dogs: Legion",
        "DualSense",
        "six",
        "120FPS",
        "Forza Horizon 4",
        "the Series S",
        "the PlayStation 5",
        "USB",
        "Xbox One",
        "the end of the day",
        "the Xbox Series X",
        "these days",
        "the Series X",
        "SSD",
        "4k",
        "a minute and 10 seconds",
        "seven years",
        "FPS",
        "Xbox One S",
        "eight milliseconds",
        "today",
        "PS5",
        "8.3 milliseconds",
        "K Blu-ray",
        "Smart Delivery",
        "about 21 seconds",
        "Xboxes",
        "Series X",
        "Ray",
        "52 seconds",
        "16.7 milliseconds",
        "this Series X",
        "Xbox",
        "HDMI",
        "the Xbox Velocity Architecture",
        "the Xbox Series X",
        "the next five",
        "sub 4k",
        "Microsoft",
        "Xbox One",
        "almost 10",
        "12 seconds",
        "Xbox 1.5",
        "the Xbox One",
        "First",
        "4k60",
        "this year",
        "three",
        "the Xbox Series X",
        "the PlayStation Five",
        "30",
        "10, 11 seconds",
        "Dirt 5\"",
        "4",
        "8",
        "second",
        "Dirt 5",
        "Xbox Series X",
        "2013",
        "Gears",
        "40 and 42 seconds",
        "the Xbox Series S",
        "the Xbox Series S",
        "33.3 milliseconds",
        "Series"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "ORDINAL",
        "EVENT",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "LOC",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "TIME",
        "PRODUCT",
        "LOC",
        "PERSON",
        "TIME",
        "QUANTITY",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "LAW",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "EVENT",
        "DATE",
        "WORK_OF_ART",
        "TIME",
        "PRODUCT",
        "EVENT",
        "QUANTITY",
        "EVENT"
    ],
    "vector": [
        0.0066123418509960175,
        -0.0907287746667862,
        0.07765312492847443,
        -0.04321017116308212,
        0.1470106691122055,
        -0.00018134525453206152,
        0.010477868840098381,
        -0.10203666985034943,
        -0.003963399212807417,
        0.07592623680830002,
        -0.07160600274801254,
        0.06312241405248642,
        -0.03250651806592941,
        -0.059669848531484604,
        -0.00934255588799715,
        -0.03314688056707382,
        0.05291951447725296,
        -0.12903985381126404,
        -0.11871220916509628,
        0.07237346470355988,
        0.037095047533512115,
        -0.06396257877349854,
        -0.08987569063901901,
        0.02487581968307495,
        -0.01401287317276001,
        0.015363982878625393,
        -0.005369565915316343,
        -0.004304054193198681,
        -0.057849492877721786,
        -0.036628611385822296,
        -0.031928520649671555,
        0.018679983913898468,
        0.009012038819491863,
        -0.0337284579873085,
        0.0021959119476377964,
        0.030758613720536232,
        -0.009064839221537113,
        -0.04179852083325386,
        -0.15017938613891602,
        -0.04187239706516266,
        -0.002082517370581627,
        -0.041864391416311264,
        0.001589182298630476,
        0.05722743645310402,
        0.022621560841798782,
        -0.0032667419873178005,
        -0.03751326724886894,
        -0.14990060031414032,
        0.01938646286725998,
        0.027845216915011406,
        -0.01016983762383461,
        -0.0026164886076003313,
        0.06261955946683884,
        -0.017038492485880852,
        0.030509740114212036,
        0.02252892591059208,
        -0.011489610187709332,
        -0.026289843022823334,
        -0.0022389108780771494,
        -0.034218061715364456,
        0.018348703160881996,
        -0.056066859513521194,
        -0.015180302783846855,
        0.040736883878707886,
        0.017963530495762825,
        -0.011597025208175182,
        0.04374313727021217,
        0.04225742444396019,
        0.02746988646686077,
        0.04977385699748993,
        -0.08543563634157181,
        0.049327317625284195,
        0.042616985738277435,
        -0.008115372620522976,
        0.04211050644516945,
        0.0122132683172822,
        0.019621923565864563,
        -0.10229329019784927,
        0.06354691833257675,
        0.050065502524375916,
        0.04390805587172508,
        0.01720784232020378,
        -0.08822830766439438,
        -0.034879446029663086,
        -0.08824791014194489,
        0.018186358734965324,
        -0.003753276774659753,
        0.0038964576087892056,
        -0.02131950855255127,
        -0.0014137543039396405,
        -0.03492116555571556,
        0.025648919865489006,
        0.1477329134941101,
        0.107342429459095,
        0.02855597995221615,
        -0.03070930577814579,
        -0.03695106506347656,
        -0.017982570454478264,
        -0.05779482051730156,
        0.007520689163357019,
        0.014068776741623878,
        0.03471807762980461,
        0.009545396082103252,
        0.013059714809060097,
        -0.004914402030408382,
        -0.09513818472623825,
        -0.05584835633635521,
        0.025210175663232803,
        -0.07524464279413223,
        -0.012374154292047024,
        -0.07215549796819687,
        -0.058083053678274155,
        -0.05730804428458214,
        0.021102923899888992,
        0.0035546710714697838,
        0.008405454456806183,
        0.006372745148837566,
        0.022524038329720497,
        -0.0049104029312729836,
        -0.04330623149871826,
        0.06898154318332672,
        -0.04828851297497749,
        -0.010605617426335812,
        0.0069023906253278255,
        0.044664498418569565,
        -0.08569253981113434,
        -0.006835093721747398,
        8.940645646816196e-34,
        -0.08188016712665558,
        0.05084223672747612,
        0.010757196694612503,
        0.07256143540143967,
        0.02203873172402382,
        0.022235289216041565,
        0.04966283217072487,
        0.10827893763780594,
        -0.015066863968968391,
        0.0981922373175621,
        0.02979007363319397,
        0.09589922428131104,
        -0.08574941009283066,
        0.005552797112613916,
        0.0478515699505806,
        -0.07907284796237946,
        0.010859924368560314,
        0.023387176916003227,
        -0.055638961493968964,
        0.028059648349881172,
        0.024803541600704193,
        0.019027646631002426,
        -0.0006830831989645958,
        -0.06287359446287155,
        -0.05668672174215317,
        0.054413169622421265,
        -0.026624422520399094,
        -0.09961073845624924,
        0.04009132459759712,
        0.010735493153333664,
        -0.11608541011810303,
        -0.037688251584768295,
        -0.03561846911907196,
        0.04793534427881241,
        0.01757359504699707,
        0.009606319479644299,
        0.04357582703232765,
        -0.038107406347990036,
        0.03444400429725647,
        0.1388721764087677,
        -0.0018019147682935,
        -0.04737737774848938,
        -0.06549177318811417,
        -0.03547094762325287,
        0.0446014404296875,
        -0.015411587432026863,
        0.005969152320176363,
        -0.04499592259526253,
        -0.12109984457492828,
        -0.01791689172387123,
        0.025535747408866882,
        0.05809484049677849,
        0.008216517977416515,
        -0.010361633263528347,
        0.032397378236055374,
        -0.05584500730037689,
        0.02741774171590805,
        0.03474067151546478,
        0.031849347054958344,
        0.08068517595529556,
        0.023760836571455002,
        -0.04127515107393265,
        0.017537232488393784,
        -0.028233660385012627,
        -0.086970254778862,
        0.03318971022963524,
        0.05682619661092758,
        -0.047682326287031174,
        -0.05294426530599594,
        -0.019756248220801353,
        -0.05019183084368706,
        0.03863951191306114,
        -0.0419648140668869,
        -0.02710636518895626,
        0.07788891345262527,
        0.07826976478099823,
        -0.05934755131602287,
        0.05817025899887085,
        -0.0025735015515238047,
        0.01481196004897356,
        0.04219890758395195,
        0.01750541478395462,
        -0.03960171714425087,
        0.046445589512586594,
        -0.05495093762874603,
        -0.027925916016101837,
        0.033324677497148514,
        0.016886817291378975,
        -0.006637613754719496,
        0.0001918499037856236,
        -0.08201441168785095,
        -0.06593616306781769,
        0.061451442539691925,
        0.03362920507788658,
        0.0586673729121685,
        -3.231375195692927e-33,
        0.05623110756278038,
        -0.11056345701217651,
        0.03301217406988144,
        0.007097842171788216,
        0.035649314522743225,
        -0.015976248309016228,
        0.0026070543099194765,
        -0.026724455878138542,
        -0.011309871450066566,
        -0.014082049019634724,
        0.006795051973313093,
        -0.04230345040559769,
        -0.039596185088157654,
        0.06451273709535599,
        0.017706485465168953,
        -0.03574327006936073,
        0.012799643911421299,
        -0.027173571288585663,
        0.010958059690892696,
        -0.003234736155718565,
        0.07349124550819397,
        0.04340150207281113,
        -0.02711663208901882,
        -0.0017055151984095573,
        -0.021232597529888153,
        0.03881467878818512,
        0.04553251340985298,
        0.01285617146641016,
        0.035844191908836365,
        0.04213474318385124,
        -0.026687024161219597,
        -0.019982757046818733,
        0.04389480501413345,
        -0.049787361174821854,
        0.035718612372875214,
        0.09395687282085419,
        0.05572693049907684,
        0.050678715109825134,
        -0.045693736523389816,
        -0.005896501708775759,
        0.006824363023042679,
        0.010771206580102444,
        -0.03556079417467117,
        0.006778386887162924,
        -0.0002797231718432158,
        -0.026917384937405586,
        -0.04380110651254654,
        -0.022212980315089226,
        0.08525852113962173,
        0.13473358750343323,
        0.07354571670293808,
        -0.059613872319459915,
        -0.062350232154130936,
        -0.03927776962518692,
        -0.0704001933336258,
        0.007537402678281069,
        -0.06169803440570831,
        0.04896633327007294,
        0.045233700424432755,
        -0.006588821765035391,
        0.06253714114427567,
        -0.005463713780045509,
        -0.09418598562479019,
        -0.008321134373545647,
        0.019213560968637466,
        -0.01799263432621956,
        0.12220738083124161,
        -0.015014592558145523,
        0.029131123796105385,
        -0.07228143513202667,
        -0.07504670321941376,
        -0.03109871782362461,
        -0.05152023956179619,
        -0.09307530522346497,
        0.03621210530400276,
        0.05723227560520172,
        -0.0192020982503891,
        -0.06962793320417404,
        0.07981298118829727,
        -0.005957028362900019,
        -0.10611589252948761,
        -0.030460868030786514,
        0.07144147157669067,
        0.024271313101053238,
        0.08977953344583511,
        -0.022823257371783257,
        0.1104472279548645,
        0.046025350689888,
        -0.0646129697561264,
        -0.04269300773739815,
        0.029393520206212997,
        -0.03016985021531582,
        -0.022479932755231857,
        0.06190038099884987,
        0.0401700958609581,
        -5.081523823946554e-08,
        -0.010893939062952995,
        -0.030702149495482445,
        -0.007358269765973091,
        -0.03871302679181099,
        0.044240158051252365,
        -0.01611313782632351,
        -0.04263361915946007,
        -0.01607160083949566,
        0.06778497248888016,
        0.0376516729593277,
        0.11854276061058044,
        -0.016565952450037003,
        -0.00914162490516901,
        0.04315491393208504,
        0.04097289964556694,
        0.10904091596603394,
        -0.09775638580322266,
        0.01923605240881443,
        -0.01912933960556984,
        0.00015404075384140015,
        -0.016636749729514122,
        0.04061037302017212,
        0.021145351231098175,
        -0.09112721681594849,
        -0.005477876402437687,
        -0.020085688680410385,
        0.01377183198928833,
        0.02761448733508587,
        0.09621401131153107,
        0.0038214526139199734,
        -0.08388408273458481,
        -0.03195849806070328,
        -0.027878323569893837,
        -0.021829668432474136,
        -0.0016222690464928746,
        -0.029039032757282257,
        0.03250164911150932,
        0.03655700013041496,
        0.060064103454351425,
        -0.016636790707707405,
        -0.0041281781159341335,
        -0.06727151572704315,
        -0.04687635228037834,
        0.0088422242552042,
        -0.029977397993206978,
        -0.055197715759277344,
        -0.06644383817911148,
        -0.020940039306879044,
        -0.0705268606543541,
        -0.04749934747815132,
        -0.002275425009429455,
        0.016220051795244217,
        0.018224548548460007,
        0.007790726143866777,
        0.0963837280869484,
        0.026850583031773567,
        0.010336648672819138,
        0.03651908040046692,
        0.029083235189318657,
        0.08435763418674469,
        -0.01244112104177475,
        -0.003910870291292667,
        -0.0700082927942276,
        0.03388736769556999
    ]
}