{
    "id": "JRPd4LBhfew",
    "title": "Top 5 Smartphones of 2017!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-12-31T16:29:50Z",
    "video_url": "https://www.youtube.com/watch?v=JRPd4LBhfew",
    "category": "Science & Technology",
    "tags": [
        "smartphone",
        "2017",
        "best of",
        "best of 2017",
        "iphone x",
        "google pixel 2",
        "pixel 2",
        "pixel",
        "oneplus 5t",
        "moto e4 plus",
        "razer phone",
        "essential phone",
        "galaxy s8",
        "android",
        "ios",
        "apple",
        "google",
        "samsung",
        "tech",
        "iphone",
        "austin evans"
    ],
    "views": 600136,
    "likes": 17745,
    "comments_count": 3027,
    "description": "The best smartphone of 2017 - from budget Android to $1000 iPhone. Moto E4 Plus:  Samsung Galaxy S8:  OnePlus 5T:  iPhone X:   Google Pixel 2:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=GvWrLS5V_uw",
        "https://www.youtube.com/watch?v=OGBAqLv_IG8",
        "https://www.youtube.com/watch?v=cpkqobWXfGM",
        "https://www.youtube.com/watch?v=_rMm_Qz8wmI",
        "https://www.youtube.com/watch?v=Ud_9UKsKoIk",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. 2017 has been one of the best years for smartphones ever. So here are my top five favorites. Kicking things off, we have the Moto E4 Plus. This is straight-up the best deal in smartphones right now. Back in August when I first did a video on the E4 Plus, it was $180, but if you want to go to Amazon and buy one today, it's only going to be 130. At that kind of price, you shouldn't expect much, but this is a good phone, period. It has a metal build, which while it's a little bit on the thicker side, does feel good in the hand. The reason it's a little bit chunky is because this guy is rocking a massive 5,000 milliamp-powered battery. This is straight-up the best battery life that I've ever tried in a smartphone. Now sometimes you can get about a day or so out of most phones with decent batteries, but with this guy, especially considering the fairly power sipping internals, getting two full days of usage is actually not too hard. To put things in perspective, it has nearly triple the battery size of the iPhone 8. It's not just a phone with a giant battery, you're getting a 5.5 inch 720P display, which while a good panel, it would be nice to have a little bit of a higher resolution. But again, it's $130. The camera's also pretty good. And Motorola's software, while not fully up-to-date on Oreo just yet, is pretty clean. The bottom line is that this really is all the smartphone that most people need, especially when you consider that crazy battery life and great price. The Moto E4 Plus is definitely worth a look. Next up, we have the Samsung Galaxy S8. Now this was one of the first flagships of the year, however it is still one of the best. Use this phone for about two minutes and it's hard not to be impressed with just how far Samsung has come with design. It's an all metal and glass build. What's impressive is just how well the glass tapers around on both the front and back. As nice as the iPhone X design is, it's hard for me to argue with just how nice the Galaxy S8 feels in the hand. It's all the more impressive that they did it over six months before Apple did. The Galaxy S8 really did set the bezel-less trend for 2017. Well yes, on top and bottom there are some slight bezels, but especially on the sides, they're basically non-existent. It goes deeper than that, too. The amulet display is still one of the absolute best that you can buy it with rich blacks and great color. You're also getting the headphone jack, which in a year where most phones have dropped it, is definitely a nice addition. As you would expect, performance is good. And while I'm still not a huge fan of Samsung's software scan, it doesn't really get in the way and there's no doubt that the phone is snappy. While the camera isn't quite on par with the Pixel 2, it's still terrific. One of the nice things about this is that because it is a few months old, the price has come down to $650, which I think is more than reasonable for such a great phone. However, it's not perfect. The fingerprint sensor placement around back just doesn't make sense. The idea that it only has a single mono speaker in 2017 is kind of annoying. And while the addition of fast charging and wireless charging is nice, it still doesn't quite make up for the fact that the battery life isn't too great on its own. The biggest issue is that we're only a few months away from the unveiling of the Galaxy S9. Taken as a whole, though, it is hard to argue that the Galaxy S8 isn't one of the best phones of 2017. Next we have the OnePlus 5T, one of my biggest surprises of the year. So at $500, this is definitely not a budget phone. However, when you consider that a lot of the other flagships are $1000 this year, this actually starts to look like a bargain. While on the surface it looks very similar to the also-released in 2017 OnePlus 5, the biggest difference here is that we're now getting a basically bezel-less display. It's rocking a good, but not remarkable, six-inch amulet display, which while not quite as sharp as the Galaxy S8, it's still fine for pretty much everyone. The hardware's also good. So it's got a seamless aluminum build, which not only looks good, but I feel like almost more importantly, feels really nice in the hand. The fingerprint sensor is also around back now, you know in a sensible place that you can actually reach. And OnePlus was very proud of the idea that they have still kept the headphone jack. Continuing on the good trend, performance is good. So with the Snapdragon 835 and eight gigs of ram, it's about as good as it gets on Android right now. The software is pretty clean and mostly stock. OxygenOS does add a couple of useful features, but what really stands out about the OnePlus 5T to me is the camera. Phones like the Pixel really have pulled away from pretty much all other phones out there right now, but the OnePlus 5T does a remarkably good job of keeping up. So, no, it's not quite as good, but in a lot of situations, it's close enough that it's going to be really hard to tell the difference. And that's impressive, especially considering that usually when you step down from those thousand dollar flagships to something that's a little bit cheaper, the camera is the first thing to be cut. It might not be the best in any specific area, but it's good basically everywhere and at $500, the OnePlus 5T is a rock-solid phone. Speaking of incredibly expensive flagship phones, we have the iPhone X. Yes, a thousand dollar price tag is incredibly expensive for a phone. But, if you can look past that for just a second, it's hard not to be impressed with what Apple is able to pull off here. First of all, are the bezels, or rather lack of bezels. So as long as you can look past the notch, which for me only took a few minutes to get used to, you're getting an absolutely incredible screen here. It's an amulet panel that is ever so slightly better than the one on the Galaxy S8, which is no small feat. Along with that, you're getting HDR support and Apple's still awesome 3D Touch. The praise doesn't stop there, either. The Apple A11 bionic chip inside the iPhone X not only shames a lot of phones, but even some computers. That, combined with iOS 11, means that the iPhone feels incredibly snappy. Everything responds basically immediately. And especially now that we have the new gestures that have replaced the home button, it feels even faster. You do lose Touch ID, which would be nice to have, but honestly, Face ID feels like some next-gen tech. Raise your phone to wake, give it a half a second to scan your face, and you're right into your phone. Now it's not a perfect system. While it works really well for me, it does vary from person to person. Some people have had a lot of issues with it. For the most part though, the hardware is absolutely top-notch. Get it, notch? Glass and stainless steel give the iPhone X a heft that actually does make it feel more expensive and the battery life is a noticeable step-up from previous iPhones. Even the camera is right up there with the very best smartphones out. You now have wireless charging, as well as waterproofing. If it sounds like I'm a fan of the X, then you would be right. Yes, the price tag is steep, but as far as I'm concerned, it doesn't get much better than this. Before we get to the final phone, I want to give a few honorable mentions to some phones that did some really cool stuff this year, starting with the Razr phone. This came out of nowhere with some legitimately cool features. It's rocking a 5.7 inch display with a 1440P resolution and what makes it really exciting is the 120 hertz refresh rate. This makes everything from games to animations look buttery smooth. It will be a feature in phones in 2018. You're also getting the best speakers I've ever heard on a phone period. It's not even close. The only problem is that it feels like a brick in your pocket and the camera is straight garbage-town. Something that I feel like was a little underrated this year is the iPhone 8 plus. So take all the best parts of the iPhone X, including the camera, you're getting the build quality, you're getting even better battery life, but you're adding Touch ID and you're shaving a couple hundred dollars off the price. The biggest issue is that the iPhone X has a bigger screen and Face ID and a smaller chasse. The iPhone 8 Plus is a good phone, but the X is just a better one. Then, there's the essential phone. This is a little bit of a weird one. On one hand, the hardware is incredible. It's got a ceramic build and a notch to put the iPhone X to shame. At launch, it was held back by an expensive price tag and a mediocre camera, but some software updates and a price cut have mostly addressed that at this point. The only real issue is that the essential company itself is maybe not the most stable in the world right now. But, if you're willing to take a little bit of a gamble, the essential phone is really solid. All of this leads me to my favorite phone of 2017. The Google Pixel 2. Now let me be clear, I prefer the standard Pixel 2 over the Pixel 2XL. Not only is it $200 cheaper, but the screen is not garbage-town, which you know is helpful when you pay $850 for a phone. What you're getting here is the fastest Android phone I've ever tried. Even though on paper it's not as powerful as the iPhone X, in real use it feels right up there, which is really a testament to how well Google has optimized this phone. In an age where phones get bigger and bigger, I found the standard Pixel 2 to be actually a pretty decent size. Now the design isn't quite on par with something like the Galaxy S8 or the iPhone X, but that really isn't a deal breaker to me. Not only does the Pixel 2 add waterproofing, which is basically a necessity these days, but you're also getting pretty decent battery life. Where it really shines is with the camera. In my opinion, this is the best smartphone camera you can buy. Now a lot of the credit goes to Google's awesome optimization of the camera, and while yes, sometimes the iPhone X does look a little bit better, but generally speaking, I prefer the overall results that you get from the Pixel. Where the Pixel 2 really wins for me is price. At $650, this is nearly $400 cheaper than the iPhone X. Sure, the iPhone does some things better than the Pixel, but for most people, this is a better choice, which is why it is my favorite phone of 2017. So you guys have seen my picks, but I'm curious, what is your favorite phone of 2017? Let me know in the comments below and I will catch you on the next one.",
    "transcript_keywords": [
        "phone",
        "iPhone",
        "good",
        "Pixel",
        "phones",
        "Galaxy",
        "camera",
        "battery",
        "battery life",
        "good phone",
        "price",
        "nice",
        "feels",
        "favorite phone",
        "bit",
        "Austin",
        "pretty",
        "year",
        "hard",
        "life"
    ],
    "transcript_entity_values": [
        "130",
        "nearly $400",
        "2017",
        "this year",
        "130",
        "5,000",
        "OnePlus",
        "2017 OnePlus 5",
        "2",
        "Pixel 2",
        "iPhone",
        "iOS 11",
        "the E4 Plus",
        "2018",
        "Motorola",
        "iPhone X",
        "650",
        "first",
        "about two minutes",
        "the Galaxy S8",
        "day",
        "Amazon",
        "850",
        "Google",
        "the Galaxy S8",
        "eight",
        "jack",
        "Samsung",
        "two full days",
        "a few months old",
        "1440P",
        "Glass",
        "a year",
        "Apple",
        "only a few months",
        "August",
        "a half a second",
        "5.7 inch",
        "120",
        "5.5 inch",
        "the Pixel 2XL",
        "iPhone X",
        "Austin",
        "iPhones",
        "six months",
        "the Moto E4 Plus",
        "one",
        "500",
        "second",
        "these days",
        "a few minutes",
        "the year",
        "200",
        "five",
        "thousand dollar",
        "180",
        "a couple hundred dollars",
        "1000",
        "six-inch",
        "One",
        "the Galaxy S9",
        "The Moto E4 Plus",
        "OnePlus 5",
        "today",
        "Oreo",
        "First",
        "Android"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "LAW",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "TIME",
        "FAC",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "PRODUCT",
        "GPE",
        "NORP",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "DATE",
        "TIME",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.05454124137759209,
        0.10198120772838593,
        0.11334265023469925,
        0.004636104218661785,
        0.027460822835564613,
        -0.06453672796487808,
        0.04574819281697273,
        0.06239913031458855,
        -0.019843071699142456,
        0.07374368607997894,
        -0.01653030514717102,
        -0.005691249389201403,
        0.029174072667956352,
        0.05564367398619652,
        0.018263215199112892,
        -0.000652341463137418,
        0.10435281693935394,
        -0.07244741916656494,
        -0.039856478571891785,
        -0.04133491963148117,
        -0.030316263437271118,
        -0.008752710185945034,
        0.08687835931777954,
        -0.007779236417263746,
        0.08150854706764221,
        0.048227883875370026,
        -0.08286359906196594,
        -0.0558776929974556,
        -0.046102043241262436,
        -0.06182887777686119,
        0.01355510763823986,
        0.12044961005449295,
        0.012326736934483051,
        -0.051967646926641464,
        -0.046340495347976685,
        -0.07545597851276398,
        0.04142501950263977,
        -0.014731906354427338,
        -0.00337913166731596,
        -0.03186631575226784,
        -0.030520087108016014,
        0.017033187672495842,
        0.06267973780632019,
        0.0045360480435192585,
        -0.004359153565019369,
        -0.04730851203203201,
        0.07340606302022934,
        -0.048589907586574554,
        0.04642675071954727,
        -0.021154943853616714,
        0.009516401216387749,
        -0.023532403632998466,
        -0.007766010705381632,
        -0.020779719576239586,
        -0.08576074987649918,
        -0.006606950890272856,
        -0.03308311104774475,
        -0.031946200877428055,
        0.09233987331390381,
        -0.011207050643861294,
        0.063444122672081,
        -0.05064462497830391,
        0.016932662576436996,
        0.06473355740308762,
        -0.01205125916749239,
        0.0068063088692724705,
        -0.0012970735551789403,
        -0.09498747438192368,
        -0.01978849060833454,
        0.044384632259607315,
        0.0026079167146235704,
        0.015148581005632877,
        0.048620253801345825,
        -0.006249176803976297,
        0.008137775585055351,
        0.0864061787724495,
        0.11140328645706177,
        0.01539412047713995,
        -0.0031935961451381445,
        0.04293233901262283,
        0.039787039160728455,
        -0.006139189470559359,
        -0.06262609362602234,
        -0.0734458938241005,
        0.07947947829961777,
        -0.0014589588390663266,
        0.01758592203259468,
        0.015409588813781738,
        -0.022012049332261086,
        -0.013755671679973602,
        -0.00018062652088701725,
        0.07140883803367615,
        -0.05874115973711014,
        0.02568049170076847,
        -0.042696285992860794,
        0.007883935235440731,
        -0.04324270412325859,
        -0.09943559020757675,
        -0.09708580374717712,
        0.020821377635002136,
        0.03349095582962036,
        0.06268420815467834,
        0.050933271646499634,
        0.031335342675447464,
        0.051027677953243256,
        -0.08813578635454178,
        0.03995370864868164,
        0.014210707508027554,
        -0.011161021888256073,
        0.043547458946704865,
        -0.03550554811954498,
        -0.04159676656126976,
        -0.0457419715821743,
        -0.010490971617400646,
        -0.029013218358159065,
        -0.03561273589730263,
        -0.03408970311284065,
        0.06418979912996292,
        0.11069950461387634,
        0.037951432168483734,
        0.0024517441634088755,
        0.015152988955378532,
        -0.06327535957098007,
        -0.08061281591653824,
        0.007634617388248444,
        -0.030210910364985466,
        -0.037232279777526855,
        1.4666449242312788e-33,
        0.02121676504611969,
        0.07857861369848251,
        0.004497434478253126,
        -0.010238924995064735,
        -0.019956011325120926,
        0.023674968630075455,
        -0.003241404425352812,
        0.01668442040681839,
        -0.06181730329990387,
        -0.00713190296664834,
        -0.053410645574331284,
        0.012748250737786293,
        -0.01290972251445055,
        0.06313202530145645,
        0.09697414189577103,
        -0.07974454760551453,
        -0.06312333792448044,
        -0.08298109471797943,
        0.010026373900473118,
        -0.025655964389443398,
        -0.04480784758925438,
        -0.03980502858757973,
        -0.07681390643119812,
        0.03594456985592842,
        -0.012393485754728317,
        0.036620307713747025,
        0.060901425778865814,
        -0.07655102759599686,
        0.06573032587766647,
        0.026515569537878036,
        -0.15880374610424042,
        0.005353051703423262,
        0.005495868623256683,
        -0.030135629698634148,
        -0.015693211928009987,
        0.04426614195108414,
        -0.015617342665791512,
        -0.0401955246925354,
        0.05997191369533539,
        0.007655490655452013,
        -0.14355507493019104,
        0.09522221237421036,
        -0.06487831473350525,
        0.028368903324007988,
        0.03040633164346218,
        0.010459876619279385,
        -0.08100423216819763,
        0.029140014201402664,
        0.00696942862123251,
        -0.034395210444927216,
        -0.07253818213939667,
        -0.055781617760658264,
        -0.002484741387888789,
        -0.00039476942038163543,
        -0.12970325350761414,
        0.029499085620045662,
        0.01731235533952713,
        -0.01284060813486576,
        0.04120515659451485,
        -0.006422895006835461,
        -0.021467888727784157,
        0.06953774392604828,
        -0.05354171246290207,
        -0.018764454871416092,
        -0.05457749962806702,
        0.011513623408973217,
        0.0040659173391759396,
        -0.05382830649614334,
        -0.08457721024751663,
        0.09489491581916809,
        0.06450822204351425,
        -0.03663747012615204,
        0.07695754617452621,
        -0.04806593060493469,
        0.06894909590482712,
        0.030223755165934563,
        0.04990726709365845,
        -0.0741197019815445,
        0.0029379369225353003,
        0.049847312271595,
        -0.00991468783468008,
        0.016926441341638565,
        0.05570296570658684,
        -0.021418362855911255,
        0.04619390890002251,
        -0.01914897747337818,
        -0.04462401196360588,
        -0.07213606685400009,
        0.07846099883317947,
        0.054837822914123535,
        -0.005514952354133129,
        -0.05411224812269211,
        0.04027595371007919,
        0.006430852226912975,
        0.029775792732834816,
        -1.73071412817824e-33,
        0.03674434870481491,
        0.02274901233613491,
        0.07516048103570938,
        0.055327776819467545,
        0.0021600567270070314,
        -0.024038098752498627,
        -0.029991012066602707,
        0.06247648969292641,
        -0.02662074752151966,
        -0.018901778385043144,
        0.002801103750243783,
        0.029546864330768585,
        0.033603932708501816,
        0.0034926538355648518,
        0.013745480217039585,
        0.0013029584661126137,
        -0.035022784024477005,
        -0.15651269257068634,
        0.09016735106706619,
        -0.031919363886117935,
        0.05490782484412193,
        0.033558011054992676,
        -0.028363052755594254,
        0.039543330669403076,
        0.006651242729276419,
        0.003503951011225581,
        -0.05418458580970764,
        -0.02295861765742302,
        0.012500827200710773,
        -0.09304484724998474,
        -0.07100328803062439,
        -0.07926293462514877,
        0.01449634600430727,
        0.022702807560563087,
        0.030352795496582985,
        0.040354590862989426,
        0.033310677856206894,
        0.023578878492116928,
        0.046058811247348785,
        0.026953184977173805,
        0.052485391497612,
        0.07856342196464539,
        0.0761723741889,
        -0.008739699609577656,
        0.11902029067277908,
        -0.045363087207078934,
        -0.039157453924417496,
        0.04182002320885658,
        0.030578328296542168,
        0.06310772150754929,
        0.030017971992492676,
        0.07034502178430557,
        -0.09112709760665894,
        0.007536462042480707,
        -0.026092350482940674,
        -0.027302972972393036,
        0.0020424562972038984,
        -0.028957705944776535,
        -0.03431282564997673,
        -0.022593921050429344,
        0.05105123296380043,
        0.01283422764390707,
        0.02677309699356556,
        0.018491847440600395,
        -0.08939733356237411,
        -0.015161862596869469,
        0.08067041635513306,
        -0.010365304537117481,
        -0.007856735028326511,
        -0.06119322031736374,
        -0.09574678540229797,
        -0.08182564377784729,
        -0.030530935153365135,
        -0.09285464137792587,
        0.057200126349925995,
        0.08271577209234238,
        -0.05540021136403084,
        -0.035725511610507965,
        -0.003899192437529564,
        -0.039475567638874054,
        0.05139033868908882,
        0.09647875279188156,
        0.026553267613053322,
        -0.051688555628061295,
        0.0498567670583725,
        0.018070455640554428,
        0.006797392852604389,
        0.029096847400069237,
        -0.013757722452282906,
        0.07070177048444748,
        -0.02375023439526558,
        -0.003441197331994772,
        -0.10041672736406326,
        0.038275718688964844,
        0.006977500393986702,
        -4.890510751920374e-08,
        0.0315808542072773,
        -0.012925602495670319,
        0.01639668457210064,
        -0.030509719625115395,
        0.01299892459064722,
        -0.0108293816447258,
        0.0009497395367361605,
        -0.01132266502827406,
        0.1829807013273239,
        0.013601851649582386,
        0.04200826212763786,
        -0.05840206891298294,
        -0.08190081268548965,
        0.03577873110771179,
        -0.015242546796798706,
        0.10330197215080261,
        -0.02774936892092228,
        0.006624214816838503,
        0.01852802187204361,
        0.017841702327132225,
        -0.0013757760170847178,
        0.03393721953034401,
        -0.004126069135963917,
        -0.025778038427233696,
        0.02075337804853916,
        0.01646333746612072,
        -0.03831479698419571,
        -0.0028549719136208296,
        0.033743616193532944,
        -0.02045508474111557,
        -0.044147294014692307,
        -0.015469990670681,
        -0.00899727176874876,
        -0.034932106733322144,
        -0.01988121122121811,
        -0.0931842178106308,
        0.00396818108856678,
        -0.054240234196186066,
        0.05165988206863403,
        0.00800622534006834,
        0.029341921210289,
        -0.06721831113100052,
        0.008288085460662842,
        -0.0015223881928250194,
        -0.011638949625194073,
        -0.072170190513134,
        -0.01435028575360775,
        -0.08403594046831131,
        -0.02843068726360798,
        0.04905064031481743,
        -0.039178043603897095,
        -0.027107393369078636,
        0.0007180051179602742,
        0.02257670648396015,
        0.04514887183904648,
        0.007017479743808508,
        0.05107242241501808,
        -0.0016162487445399165,
        -0.03631014749407768,
        0.006412826478481293,
        0.043780095875263214,
        -0.14598099887371063,
        -0.02999711222946644,
        0.12155881524085999
    ]
}