{
    "id": "jSa1tvrrFZg",
    "title": "Do It Yourself Solar Power? - Easy DIY Solar Panel Installation!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-04-10T13:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=jSa1tvrrFZg",
    "category": "Howto & Style",
    "tags": [
        "Solar",
        "DIY solar",
        "solar energy",
        "Solar panels",
        "residential solar",
        "Grid tied solar",
        "how to install solar",
        "what is solar energy",
        "how do solar panels work",
        "diy solar",
        "solar panel",
        "solar panels",
        "solar power",
        "off grid",
        "diy solar generator"
    ],
    "views": 4154448,
    "likes": 111039,
    "comments_count": 6241,
    "description": "Solar Power and renewable energy is the way of the future. Get $250 dollars off your custom solar plans HERE:  It is the instruction booklet I used to install the solar panels on my house - but will be specifically designed for your home.  If you want someone ELSE to install your solar. Tesla Solar is priced better than most. The now $100 Tesla Solar discount is here:   One Year Update Video is here:   Attempt any DIY project at your own risk. Follow local code. Working with electricity can be dangerous.   Here are my numbers.  I have an 8.06kw solar system. It cost me $13,300 (before incentives)  With the federal incentive for 2020 (26% tax credit) and my state tax credit ($1600) it brings the cost of my system down to $8,243. Remember these are 2020 prices.  Tesla would have charged me $17,000 to install a 7.56kw system in 2020. Another company bid $21,200 for an 8kw system.  and a fourth company was $21,700 for fully installed 8.68kw (all those bids are before government incentives)   My energy costs around $0.11 per kWh on average. Using a solar calculator like the one here:  I can see that my system will generate about 12,000 kWh per year. Which is about $1,319 worth of energy. So my system will 'pay itself off' in about 6.2 years with incentives, and 10 years without the incentives. The best part though, is that over 30 years my panels will generate around $35,000 dollars worth of energy. Far more than what I paid. And they'll keep on making energy longer than that. Totally worth it.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.solarwholesale.com/jerryrigeverything",
        "https://ts.la/zack10701",
        "https://youtu.be/vBquse_KAdI",
        "https://pvwatts.nrel.gov/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So a lot of people think that solar panels are actually pretty fragile, but that's not the case. I'm currently walking on top of some and I weigh about 200 pounds. Now obviously this is not something you want to do on a regular basis they are made of glass. But still, it can't be a Jerry Rig Everything video without a durability test. [Music] Jerry Rig Headquarters is currently powered by 100% renewable solar energy. And in today's video I'm going to show you how I installed these. So there are a ton of places to buy solar panels, but I found that I could do it myself for about half the price. I've partnered up with a company called Solar Wholesale that actually sells DIY kits that include everything you need in one convenient package...including the custom installation plans that you need for your permits from your city. Also keep in mind that these solar panels will retain 80% of their energy producing ability for the next 30 years, and then continue producing electricity far longer than that. And even though I went into this project knowing that I was going to install solar myself, I did price out other options, and it turns out Tesla was one of the more fairly priced out there. So if you don't want to install solar yourself, Tesla's a good option and I'll leave a $250 discount for them also down in the description. Alright, there is a lot of information to go over and not a lot of time to do it, so let's get started. [Intro] The biggest perk of working with Solar Wholesale is this plan set. The plan set is the instruction booklet designed specifically for my house, with all the information I need to get the permits and approvals from my city. Along with the plan set, they ship every single part that I need to install my solar system in one big kit, which makes the whole project much easier since the parts just work together right out of the box. Plus the solar panels are made right here in the United States. Getting someone like Tesla to come install the solar for you is still worth it of course, it just takes a few more years to break even. But either way you're still making a positive impact on the environment and lowering your electricity bill from the moment the panels get connected. Remember, every house is going to have a slightly different roof line and different energy needs which is why it's nice to have this plan set that was custom made to my specific situation. This is the wiring diagram. All of this makes a lot more sense when you have the parts right in front of you. So last time I was climbing up onto my roof, I broke my wrist...so...there's that. So we've laid out where the perimeter of the panels are going to be on the roof with a lumber crayon and a chalk line, and this will just help us visualize where the panels are going to be and where we're going to lay the rack that the panels rest on top of. It will all start making sense in a minute. So in order to attach the racking system to the roof we need to find the trusses that are underneath the shingles and the plywood, and the easiest way to do that is with a hammer. Listen closely. You can hear the difference between the loose area of roof and the solid area of roof and that's where we want to drill down and attach our lag bolts. We can tell by the resistance that the drill bit had all the way down through the wood that we hit a stud. We hit something good to tie into. So once you've found your first truss, all of the rest will be in the same spots, so if you're working by yourself you can just attach the tape to the drill bit that's still in the stud and mark two feet on center all the way down the roof. So before we can attach the rails that hold the panels, we have to put the flashing down and I'll explain what the flashing does in a second. Before I can put the flashing down I do have to put some of this clear sealant in a U shape around the hole that the lag bolt goes through, and then I'm also going to put some clear sealant into the hole because the whole point of this is to keep water out of the roof. Then I can lift up some of the shingles, slide the flashing underneath. And then this is the part that holds the rail. Put the lag bolt through the opening into the holes we pre-drilled earlier and then we'll ratchet it down into place. So now that the flashing's in place we can visually see how it keeps water out of the roof. You know, the water will run down the roof and it won't go into the holes we just drilled, especially if you missed a hole and had to drill an extra one. As well as, each of these bolts right here have a black washer around the top which also helps seal to keep the water out. So the reason I decided to go with the snap and rack system is because these little L feet right here are adjustable up and down. So the rail can adjust underneath the panels to keep the panels level. And the reason it's called a snap and lock system is because the rail will sit right on top of these little feet and they click into place...just like, you know, a little Lego. The rail itself is black which makes it a little more aesthetic on top of the roof and it can slide forward and backward inside of the channel as we're positioning it. And there's a channel inside of the rail that hides the wires for all of the micro-inverters. So the rails are up and it's micro-inverter time. So the micro-inverters are held in place with these little metal pieces which can just dip into the rail and then clip up into place. The reason we decided to go with micro-inverters over other inverters is one, they're easy to install, and two, they are much safer. They convert the power from DC to AC right at the panel. And if one panel does get covered by like, let's say snow or shadow from a tree, the rest of the panels keep on working, which isn't always true of other types of inverters. So all of our solar panels are on the roof and there has to be a way to get the power from the roof into the house. We do that with something called a roof junction box. We have to drill a small hole in the roof, and normally this would be where you have attic space, but in this particular building we do not, so we're going to drill a bigger hole, fish the wire through the wall, and pull it up through the top. The bigger hole is still fine though because the roof junction box once we seal it up with that clear sealant will make sure no water runs inside. The shingles will just fit down over the flashing and no water will be able to get into the attic space. So the cable that connects all the micro-inverters together is called a trunk cable. This is what brings the power from the micro-inverters down to the roof junction box. So the trunk cables lay down inside of the rail. We've put some electrical tape over the connection, and then we just zip tie the whole thing to keep it secure. So remember, every house is going to be a little bit different, but this is the exterior roof junction box. And we have the yellow wire running through inside the attic space. All of these wires were provided in my kit, but we need a switch from the yellow insulated wire, which is indoor wire, to exterior wire when we're running it through the conduit. This gray stuff down along the side of the house. This junction box is where we're going to start feeding the exterior wire down through there and then into the breaker panel. So since these trunk cables are generic, they are probably not cut to length just yet and so we're just going to chop it where we need it and remove the extra plugs. Then we can take these two trunk cables inside of this junction box and connect it to the insulated yellow wires down to our exterior junction box on the wall. So we're just about to start laying panels, and because of how many panels are on this roof, I have to have two arrays which means that there's two trunk cables coming into this junction box. You might be wondering what we've done down here on this section of roof, and it's because we can fit more panels if we run them horizontally. So we've laid the rails out in a different way. And that just shows that no matter what your roof looks like, we can always orient the panels to most utilize the space. So this copper wire right here, it's called a system ground, and it's tied into each one of these rails with little spikes and clips, so if any electrical anomalies like faulting or lightning happens, it'll just transfer the electricity right into the ground heading down to the junction box. So let's talk about setting the solar panels and wire management for a second. Right now we have three panels in place and a 4th one right here ready to snap in. Each solar panel has two wires on the back that plug into the micro-inverter. The micro-inverter can hold 4 panels at a time. Then it runs down the trunk cable all the way down to the roof junction box down there at the end. The DC wires are at one end of the panel so we're running the wire in down those center lines so it can easily plug into the micro-inverters that we have placed on the rail. Remember that none of these wires can be touching the roof, so there are little eyelets at the bottom that we can zip tie the wires to. We can also twist them together a little bit to make sure that nothing is touching the shingles before we plug them in. So this little guy right here is called a mid-clamp. This is what clips into the rail and holds a panel on either side. There's a myth going around that solar panels aren't very green because of how much energy it takes to produce them in the first place. And that's also not necessarily true. Depending on where the solar panels are manufactured, it takes anywhere from 6 months to three years for a solar panel to off-set the carbon it took to make it in the first place. Which isn't very much time considering how long it's lifespan is. Another perk of the panels that came in my Solar Wholesale kit, is that they are black on black - no silver frames. It's something to think about when you're picking out panels. I got the black ones so they blend into the roof a bit more. Another perk of having the micro-inverters is that the system is totally modular. We can add panels or take away panels as much as we want and we don't have to worry about the junction box or limiting our system to a certain size when we set it up the first time. It can always be expanded. The nice thing about the snap and rack system is that every fastener on this project is either a Phillips head screw or a half inch sprocket which makes the installation pretty quick because you're not looking for all kinds of tools. So now we have our solar panels installed, we left our rails a bit long to give ourselves a bit of leeway, and now we can just cut them off. So these end clamps basically slide into the channel, and then when we tighten this bolt right here at the end, it's snugs it up tight and holds the panel in place. Then these plastic end caps snap on to keep everything looking aesthetic from the ground. Alright so let me tell you what's going on electrically here for a second. We actually haven't connected the wires yet. This is the panel that's powering the house we're in right now and we've drilled a hole through the panel to the outside. And then these two boxes out here that we just installed are going to take the power from the solar panels on the roof, bring them into this box, combine all the panels, and then head over here to the solar disconnect which can actually disconnect all of the power from the solar panels heading into the house. It's a safety thing. When working with the wires and the electrical part of the solar system remember to one, follow local code, and b, follow your plan set. It'll explain everything you need to know. So we have the larger array up here, the smaller array down here at the bottom, and they are all connected in this joiner box in the center. All the wires from the roof and this side panel over here feed into this and you can see these ground wires, these copper wires that were attached to the rails, all of those are heading down to the breaker box which I'll show you in a second. Now we can tuck all these wires inside the box and close it up. So down here in the breaker box, this is what's accepting the two strings that I have. Each of the strings has their own 20 amp breaker. Black and red go on the bottom and the ground goes over here on the side. Remember there are two kinds of solar systems. There are grid-tied and off-grid. We installed a grid-tied system here which means that the solar panels need to sense the grid before they start supplying power to my house. If those micro-inverters up top don't sense power from the grid, they are going to stay off. So I can touch these wires all I want because we're not attached to the grid yet. If you want an off-grid system, there's a few other components you need to install and maybe I'll make a video about that later, but this is all about grid-tied. If you do want to use your solar panels when the city power goes out, you would need a battery or a generator. It's pretty cool that all of those solar panels just come down into these 6 wires. Makes it pretty simple. And now we're going to connect that breaker panel to the solar disconnect with this thicker gauge wire, and it should just go through the hole and we can wire it up. Now we're going to take the same thickness of wire and push it through to the breaker panel on the other side of the wall. So this is still not connected inside of the house. So no power is running to it from the panels up top or from the grid. Basically this safety shutoff is called a knife blade switch. So right now it's connected, and watch these metal bars right here. When I turn it off, the metal bars knife away and break the connection. And remember since this is a grid-tied system, once those micro-inverters up top stop sensing the power, they turn off and there's no power running anywhere in the solar system. So up to this point we haven't been working with any live wires. This is the part where we start working in a place where there could be power. Now, we have shut off power to this particular panel, but if you're feeling a little uneasy about working next to live power, you know, the grid, you can always hire someone to do this particular portion for you. If you remember, these three wires are coming in from that safety shutoff from outside. And we have an empty slot in the breaker panel where we're just going to connect these wires, one into the ground, and the other two into the breaker, which connects the solar on my house to the grid. And now my solar wires are connected to the breaker box and the system is on. So we powered everything on and it's connected and working, but I still need to get my final inspection and have my meter changed out so it'll read power going both directions. That whole process will take me about a week or two, but for you guys....[snap]...that time has already passed. My meter is installed and we are pumping out green energy. The energy that I don't use during the day flows out to the grid. This meter keeps track of it and then I get that energy back at night as a 90% credit. The energy company takes 10% off the top because they can, and they are acting as my battery which is convenient for me with an on-grid system. I'll show you what the app looks like in a second, the one that shows how much solar I'm actually making in real time. But yeah, the inspector came by, checked all the wiring, made sure none of the cables were touching the roof and said we could flip the switch. I think it's been a pretty fun project. Since my panels are in the sun all day long, not shaded by any trees or not on the wrong side of the house, these will pay themselves off in about 9 years. That's without any government incentives. Now if we do factor in the state and federal incentives, they'll pay themselves off in about 6 years. So these panels will keep making electricity all throughout my lifetime and keep producing power even long after I'm gone...which is pretty awesome. Remember these are just ballpark numbers that I've estimated. I do have an app that keeps track of everything for me. So I'll probably make a follow up video in about a year to see if my estimates are correct. So if we take a look at the app that is currently on my phone, it's telling us in real time how much energy we are generating. So 7,671watts. And over the lifespan of my solar panels, they've generated 843 kilowatt hours. And what's cool is we can go into today's energy, right here, and see exactly the solar projection that it's made. You can see here in the morning the sun came out and we started making more electricity throughout the day. If we go back a day we can see that this day was pretty cloudless up until about noon, and then clouds kind of like came over and started blocking the solar panels a little bit. But we still made 48 kilowatt hours of energy. And the last thing I want to show you is if we go over right here we can see the production per module. So as the day progresses you can see which modules might be blocked by shade from a tree or shade from your roof, and you can see that they're all working. The financial incentive to doing solar panels is worth it all by itself. But the whole less air pollution and saving the planet thing is pretty cool too. And that's it. I will leave both links down in the video description for you: the Solar Wholesale, as well as the Tesla link, both with their discount codes. And you can see which one works best for you. Personally I kind of like the do-it-yourself side of things, but I totally understand if you want someone else to install it for you. I'll always be hanging out down in the comments to answer some questions if you have any. And I'll probably make a followup video in about a year or so to kind of update you and see how it's been producing for me. So make sure you're subscribed. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "solar panels",
        "panels",
        "solar",
        "roof",
        "panel",
        "roof junction box",
        "wires",
        "junction box",
        "box",
        "Solar Wholesale",
        "wire",
        "power",
        "system",
        "roof junction",
        "breaker panel",
        "solar system",
        "junction",
        "solar panels installed",
        "rail",
        "house"
    ],
    "transcript_entity_values": [
        "U",
        "the next 30 years",
        "about 6 years",
        "about 9 years",
        "6",
        "7,671watts",
        "10%",
        "80%",
        "Lego",
        "6 months to three years",
        "100%",
        "two",
        "4th",
        "20",
        "three",
        "48 kilowatt hours",
        "about half",
        "AC",
        "about a week",
        "about 200 pounds",
        "two feet",
        "DC",
        "about a year",
        "a Jerry Rig",
        "this day",
        "DIY",
        "a ton",
        "4",
        "Phillips",
        "a half inch",
        "night",
        "about noon",
        "about a year or so",
        "843 kilowatt hours",
        "90%",
        "the United States",
        "250",
        "Tesla",
        "second",
        "first",
        "today",
        "Solar Wholesale",
        "Solar Wholesale",
        "one",
        "the day",
        "a few more years"
    ],
    "transcript_entity_types": [
        "NORP",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "TIME",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "GPE",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.03749825060367584,
        0.08834072202444077,
        0.0884825587272644,
        0.02161441743373871,
        -0.03776928782463074,
        -0.014739450998604298,
        0.009431904181838036,
        0.08116035163402557,
        -0.07044849544763565,
        0.0805593803524971,
        -0.029921501874923706,
        -0.03715083748102188,
        0.06752559542655945,
        0.017140192911028862,
        0.03394441679120064,
        0.053183797746896744,
        0.016454150900244713,
        -0.05577125400304794,
        -0.010194226168096066,
        0.03318110853433609,
        0.049159225076436996,
        0.00902576744556427,
        -0.009767103008925915,
        -0.05863214656710625,
        0.16454225778579712,
        0.05673087015748024,
        -0.03567137569189072,
        0.011137832887470722,
        -0.0780189111828804,
        0.032027099281549454,
        -0.01838333159685135,
        0.018042201176285744,
        -0.0599135160446167,
        -0.07380670309066772,
        0.0868193656206131,
        0.03310132771730423,
        -0.00041182516724802554,
        -0.014748974703252316,
        0.005751249846071005,
        0.009486698545515537,
        -0.005613280460238457,
        -0.06422311067581177,
        -0.05140309780836105,
        0.009390362538397312,
        -0.07597216963768005,
        0.03599966689944267,
        0.05826437845826149,
        0.0764116570353508,
        0.054781608283519745,
        -0.01571844518184662,
        -0.004857257474213839,
        -0.04146401584148407,
        0.05668513476848602,
        0.0018408984178677201,
        0.004775636363774538,
        -0.031151512637734413,
        -0.0004720051074400544,
        -0.015238196589052677,
        0.02416389063000679,
        0.0058896481059491634,
        -0.0026856388431042433,
        -0.15914082527160645,
        -0.05107304826378822,
        0.02416461892426014,
        0.04625971242785454,
        -0.038444649428129196,
        -0.030119547620415688,
        0.011288170702755451,
        -0.07773469388484955,
        -0.03639627620577812,
        0.02605541981756687,
        0.005131465848535299,
        -0.005709487479180098,
        -0.001504688523709774,
        -0.034954965114593506,
        0.0024373361375182867,
        0.10686556249856949,
        -0.009973510168492794,
        0.045569680631160736,
        -0.04107692837715149,
        0.08614268153905869,
        0.076229989528656,
        -0.064698725938797,
        0.026774976402521133,
        -0.018835827708244324,
        -0.020540816709399223,
        0.036395326256752014,
        0.09077563881874084,
        0.10675486922264099,
        -0.01106747891753912,
        0.010505740530788898,
        -0.02199019491672516,
        0.00024814807693473995,
        -0.019762378185987473,
        -0.005092010833323002,
        0.04142364114522934,
        0.01182443369179964,
        -0.08008856326341629,
        -0.038265079259872437,
        0.02718556672334671,
        0.08218641579151154,
        -0.0025623487308621407,
        0.00021930341608822346,
        -0.038622211664915085,
        0.011877565644681454,
        -0.00878564640879631,
        -0.06973731517791748,
        0.09005753695964813,
        0.003514896146953106,
        -0.04283328354358673,
        0.00436986843124032,
        -0.02772737294435501,
        -0.01995091885328293,
        0.0200972780585289,
        0.029553109779953957,
        0.018496543169021606,
        0.050003163516521454,
        -0.027527377009391785,
        0.08327864855527878,
        0.0013157227076590061,
        0.057649966329336166,
        -0.056291431188583374,
        0.057942043989896774,
        0.045005664229393005,
        0.02855708636343479,
        0.010782914236187935,
        -0.08748827874660492,
        2.7092499924164377e-33,
        -0.01563483290374279,
        0.11248789727687836,
        0.014920365996658802,
        -0.07153214514255524,
        0.008447039872407913,
        0.05712493509054184,
        0.024985864758491516,
        0.132032111287117,
        -0.0504474975168705,
        -0.030208341777324677,
        0.03411741182208061,
        -0.03952338173985481,
        0.04325854778289795,
        0.05067875236272812,
        0.019781436771154404,
        -0.04782874137163162,
        0.01573793776333332,
        -0.07623274624347687,
        -0.03102743625640869,
        -0.029850587248802185,
        0.0029575619846582413,
        0.01242482103407383,
        0.050846025347709656,
        -0.006504456512629986,
        0.0011879652738571167,
        -0.07701711356639862,
        0.03390746936202049,
        -0.05503026768565178,
        -0.018474411219358444,
        -0.027107873931527138,
        -0.0054219672456383705,
        -0.05861865356564522,
        0.07573102414608002,
        0.0198599211871624,
        -0.043774042278528214,
        -0.027900265529751778,
        0.010064704343676567,
        -0.028557391837239265,
        -0.030891934409737587,
        -0.08014540374279022,
        -0.03688855469226837,
        0.09782092273235321,
        -0.0003073864500038326,
        -0.02104349434375763,
        0.020992184057831764,
        0.05212658271193504,
        0.024082034826278687,
        -0.039802733808755875,
        -0.06168905645608902,
        0.026845596730709076,
        0.0008643575711175799,
        0.09941840916872025,
        -0.07597341388463974,
        -0.022470368072390556,
        -0.08482971787452698,
        0.013629676774144173,
        0.06480603665113449,
        -0.05212114378809929,
        0.051007017493247986,
        0.023384669795632362,
        -0.039837151765823364,
        -0.023160230368375778,
        -0.01291724108159542,
        -0.04802993685007095,
        -0.060743872076272964,
        0.032186537981033325,
        -0.026392845436930656,
        0.06481130421161652,
        -0.013468101620674133,
        -0.001182839972898364,
        0.0014542016433551908,
        -0.08656882494688034,
        0.011283418163657188,
        -0.008103324100375175,
        0.09321245551109314,
        0.03885851800441742,
        -0.014054059982299805,
        0.020808573812246323,
        -0.06968896836042404,
        -0.012532138265669346,
        -0.0017361447680741549,
        0.03797079250216484,
        0.02410854771733284,
        0.011439708061516285,
        0.0821259617805481,
        -0.013248516246676445,
        0.03410175442695618,
        0.04800286144018173,
        -0.02158699370920658,
        -0.031595729291439056,
        0.06773250550031662,
        0.028025547042489052,
        0.019853860139846802,
        0.010755602270364761,
        -0.02434552274644375,
        -3.709778621274551e-33,
        -0.005788118578493595,
        0.07044291496276855,
        0.03650439530611038,
        -0.08341808617115021,
        0.09283482283353806,
        0.007667527999728918,
        -0.06871958076953888,
        -0.0698089674115181,
        0.0022055914159864187,
        -0.001299294293858111,
        -0.058813463896512985,
        0.03335609659552574,
        0.02650589682161808,
        0.007347866892814636,
        -0.06344269961118698,
        -0.0078447125852108,
        -0.07812578976154327,
        0.009769839234650135,
        0.02552013471722603,
        -0.036191005259752274,
        -0.027965812012553215,
        0.15918949246406555,
        -0.014451678842306137,
        0.05757291242480278,
        -0.012396113015711308,
        -0.035893503576517105,
        -0.04988684132695198,
        0.002314438810572028,
        0.06039564311504364,
        0.04575814679265022,
        -0.08940614014863968,
        -0.057073432952165604,
        -0.05165427550673485,
        0.004384360276162624,
        0.013779889792203903,
        -0.03439582884311676,
        -0.009022947400808334,
        -0.023052670061588287,
        -0.011679180897772312,
        0.014827195554971695,
        0.04786514863371849,
        -0.07546985894441605,
        -0.05921875685453415,
        -0.08920112997293472,
        -0.03423386439681053,
        -0.054639410227537155,
        -0.06207161769270897,
        -0.03613002225756645,
        -0.060831330716609955,
        0.10365335643291473,
        -0.023007970303297043,
        0.004037185106426477,
        -0.02048601396381855,
        0.013063469901680946,
        -0.06115872785449028,
        -0.11971884220838547,
        0.08091015368700027,
        0.13844212889671326,
        -0.03519945964217186,
        -0.000774103740695864,
        0.00783912930637598,
        -0.03652125597000122,
        0.05858353525400162,
        0.0016972020966932178,
        0.008477933704853058,
        -0.05617512762546539,
        0.018198233097791672,
        -0.009671183302998543,
        0.04514840245246887,
        -0.06752472370862961,
        -0.10852367430925369,
        -0.03779037296772003,
        -0.04364684969186783,
        -0.06204701215028763,
        0.0402374267578125,
        0.07459774613380432,
        0.0641196072101593,
        0.03950661048293114,
        0.005045350641012192,
        0.005582091864198446,
        -0.03157802298665047,
        0.038116395473480225,
        0.05882110446691513,
        -0.059262439608573914,
        0.030658148229122162,
        -0.03625665605068207,
        0.027689220383763313,
        -0.08791114389896393,
        -0.021468888968229294,
        0.14059680700302124,
        -0.04049534723162651,
        -0.01855538785457611,
        0.1040291041135788,
        0.06031064689159393,
        0.002111243549734354,
        -4.727502656010074e-08,
        0.027231168001890182,
        -0.004696457181125879,
        0.0007714990642853081,
        0.03155994415283203,
        0.018111130222678185,
        -0.04840109497308731,
        -0.025779005140066147,
        0.0347004197537899,
        0.031232623383402824,
        -0.042144060134887695,
        0.0805698037147522,
        -0.03796243295073509,
        0.051952753216028214,
        0.021418413147330284,
        -0.1688886135816574,
        0.0039730495773255825,
        -0.006674326956272125,
        0.10532156378030777,
        -0.02065414935350418,
        0.05717478692531586,
        0.011651587672531605,
        -0.000493761501275003,
        -0.02969140186905861,
        0.05513589829206467,
        0.011495525948703289,
        0.06116455793380737,
        0.013233013451099396,
        0.061482351273298264,
        0.04242390766739845,
        -0.02616271935403347,
        -0.034669019281864166,
        -0.03229154273867607,
        0.03201425448060036,
        -0.052040670067071915,
        -0.04331621900200844,
        -0.040788084268569946,
        -0.13512882590293884,
        -0.05963995307683945,
        0.05900951847434044,
        0.03744657710194588,
        0.06102324649691582,
        -0.04302980750799179,
        -0.021404216066002846,
        -0.01877831108868122,
        0.00023255629639606923,
        -0.016108037903904915,
        -0.08404061198234558,
        -0.12122142314910889,
        0.07965631037950516,
        0.02630934864282608,
        0.050356607884168625,
        -0.001911343657411635,
        0.007559347432106733,
        -0.03372196853160858,
        0.05066872388124466,
        0.0009042875608429313,
        -0.08811740577220917,
        0.058261044323444366,
        -0.023459775373339653,
        0.022762201726436615,
        0.04822766035795212,
        -0.042535386979579926,
        -0.07370155304670334,
        0.0060189408250153065
    ]
}