{
    "id": "Jsxp3xjWHa8",
    "title": "Huawei P30 Pro hands-on: a photographic powerhouse",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-03-26T13:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=Jsxp3xjWHa8",
    "category": "Science & Technology",
    "tags": [
        "huawei p30 pro",
        "huawei p30",
        "p30 pro",
        "p30 huawei",
        "p30",
        "huawei",
        "android",
        "huawei p30 pro review",
        "p30 pro huawei",
        "huawei p30 pro camera",
        "huawei mate 30",
        "headphones",
        "huawei freelace",
        "freelace",
        "s10",
        "samsung galaxy s10",
        "wireless headphones",
        "huawei mate x",
        "mate x",
        "first look",
        "hands on",
        "review",
        "phone",
        "phones",
        "huawei p30 pro release date",
        "release date",
        "specs",
        "camera",
        "optical zoom",
        "2019",
        "rumors",
        "smartphones",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "apple",
        "google",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 314459,
    "likes": 4415,
    "comments_count": 404,
    "description": "The Huawei P30 Pro flagship has a huge battery, absentee bezels, and a promising new quad-camera system. It will compete against Samsungs Galaxy S10 series for supremacy in the high-end Android smartphone market across Europe and Asia. Huawei is also launching a non-Pro P30, which scales the screen size down to 6.1 inches, has a smaller 3,650mAh battery, and accepts slower 22.5W charging, as well as the Huawei FreeLace earphones.  Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2YlemhX",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey I'm Vlad with Verge and this is the Huawei P30 Pro and so is this. (upbeat music) So what's new about the new P30 Pro? Well in a lot of ways it's more of an evolution rather than a revolution. Especially compared to Huawei's Mate 20 Pro flagship from the end of last year. You still have the Kirin 980 processor on the inside. You still have pretty much the same specs on the internals. You have a 2340 by 1080p display. OLED it's still as beautiful as ever and Huawei has done it's utmost to reduce the bezels to be as thin as possible and has put this dewdrop notch right up here at the top. That's the familiar stuff that's the evolutionary stuff. But what Huawei is saying with this phone is the camera is the selling point. The P in the P-series is about photography after all. Now what we have here is a four-camera setup. The middle lens is a 40 megapixel super spectrum censor. I'll tell you more about that in a minute. Then there's a 20 megapixel ultra-wide censor and then you have the periscope lens. Which does 5x optical zoom and a total Huawei claims a 10x hybrid zoom. Which the company claims it's losses by combining the signal and the data from the main censor and the telephoto censor down here. Those are three cameras and up here just under the flash you have the flood eliminator and then you have a time-of-flight camera which you use for depth detection. Depth detection why do you want to know that? Well one of the things is you extra nice bokeh. So what you have is a gradual effect rather than the essentially the 2D cut out effect. Where the person in the front looks entirely separated from his background. In this shot in particular I also really like the gradation here between the blacks and the greys and also the texture on the jacket. And again the separation from the person in foreground that we want to keep them focused and the background. And even on the edges where you have more challenging things such as the hairline and so on you still have a bit of imperfection. But it's really much improved especially for Huawei and it's one of the better one's that I've seen. So I'm not an enthusiast for portrait modes. But with this new time-of-flight censor that Huawei has added I do see a major improvement from the company and I might be tempted to start using this. The main censor here still has 40 megapixel resolution. Which is then used to combine four pixels into one giving you a 10 megapixel standard resolution. But the interesting thing is something that Huawei calls super spectrum. So instead of an RGB breakdown of the sub-pixels you get a RYYB. Which means you get a red censor, two yellow censors and a blue censor. And because the yellow censors absorb red and green light that actually means you get more light into each pixel with this new arrangement. Huawei has also created a new AI driven HDL plus mode and I'm really excited about this one. It automatically creates an exposure map for the entire frame. So that tells it here's the sun I need to lower exposure on that. Here's the subject, here's a face, it detects faces and it automatically adjust the exposure on the particular section. So that the face is better exposed, the sun's brightness is detained in and you get just a better overall shot. A better exposure because it knows what it's looking at. Now the big deal as far as Huawei is concerned is it's new 10x optical zoom. It's really easy to access you have this zoom adjustment here on the side. You tap it once you go to 5x and that switches from the main censor over here to the telephoto one at the bottom. You press it again it combines the two sensors. But then here's what happens when it's that far zoomed in you do need to pull away from your subject in order to be able to focus on it. One cool thing that Huawei has done and it's a really unnecessary thing is it's put optical stabilization on both the telephoto censor and the main camera. What this gives you is an amazing level of flexibility in terms of focusing. It's almost like having a handheld camera with a physical optical zoom. You have this ultra-wide angle where you can capture the entire window. Then you have the regular view which gives you a view of the church. You get 5x so you can start picking out details. And then by 10x you could almost read any signs if there were any over there. And the detail, I've taken a few sample shots with this camera already. The detail is really impressive and is definitely compares much better to cameras where you take a shot and then you try and crop into it. To which you use the same level of zoom. So as I said beside the camera the Huawei P30 Pro is quite an evolutionary device. It has the same Kirin 980 processor as the Mate 20 Pro and I have zero complaints about that. This is a seven nanometer processor. It has dual MPUs for all the AI capabilities that Huawei built into it's EMUI. And there are real ones to be fair. Huawei has shown statistics that show that it's devices gets slower over time at a lower rate than it's competitors such as the Samsung Galaxy Note devices. And that's down to Huawei's AI optimizations and just keeping the phone running as fast as possible. Huawei does it usual thing of putting a massive battery in the inside of this device. 4,200 million power battery. It also has 40 Watts wide charging. We get to use 70% of the battery refilled within the first 30 minutes of charging. You have fast wireless charging. You have reverse wireless charging so you can charge your other accessories via the back of this phone. And there are a couple of other cool additions that Huawei has made. One of them is you no longer have an earpiece. In order for Huawei to reduce the notch to it's absolutely minimum size it has removed the earpiece. And it's using electromagnetic levitation, the company says, in order to basically create a resonance in the display. Which gives you the sound that you would usually get from the earpiece. That does mean you don't have stereo speakers on this phone. You're just going to have the one main speaker down here at the bottom which is doing most of the work and then you have the earpiece. But then Huawei does make the point that you get a more private call because with this mode of creating sound. The only person that hears the sound coming from the top is you when you're on the call. That does also mean that Huawei is getting rid of it's face and lock technology. The sophisticated one that mirrors Apple's face ID that has on Mate 20 Pro. But just like the Mate 20 Pro the P30 Pro has the in-screen fingerprint censor. It's optical, Huawei says it's faster and it's better. I didn't like the Mate 20 Pro fingerprint censor so I think it's important that Huawei's improved this. So this is gonna require a bit of testing. The sides on this phone are curved. But they're less curved on the Mate 20 Pro and I think that's a major improvement. The one sacrifice that Huawei makes relative to the Mate 20 Pro which had it's camera array in the middle of the phone. Is that with the cameras all clustered in one side you get plenty of wobble when you put the P30 Pro on a flat surface. (knocking sound) So Huawei has yet to detail some of the finer specifications for this device such as the RAM and how much storage you'll be able to get on these devices. But those will pop up along with the price and the full color options at Huawei's official announcement event in Paris. So alongside the P30 Pro Huawei said they are announcing the Huawei P30. It is very much what it looks like. It's a cut down version of the P30 Pro. It's smaller, 6.1 inch display still 2340 by 1080 resolution. Still that dewdrop notch and you still get most of the same camera setup. However it's a triple camera rather than the quad camera of the P30 Pro. You get smaller resolution on the wide angle lens. You get a smaller maximum zoom 3x optical from the system and 5x hybrid max zoom verus 10x with the P30 Pro. The battery is smaller on this 3,650 million power rather than 4,200 with the P30 Pro and the charging is not as fast. But the processor on the inside, the quality of the display. The same super spectrum main camera sensor it's all in here with the P30. So I think Huawei has done a really good job of balancing the comparison between the P30 and the P30 Pro. These are significantly different devices. Even physically the P30 is quite flat it doesn't have the same curvature on the side of the display that the P30 Pro has. I'm anticipating the P30 will be significantly cheaper than the P30 Pro and both of them have their advantages. With the P30 obviously being more of the budget model. And when I say both of them have their advantages let's not forget the P30 still has a headphone jack which the P30 Pro does not. But Huawei's answer to that is a brand new pair of earphones which it calls The Huawei Freelace. Now you may be looking at these and thinking they're just another pair of neckbuds and to some extent they are. But you can disconnect them, one from the other and then you get a USB-C plug which can plug into your phone to charge the headphones. This will automatically pair the earphones to the phone which is neat. You can get four hours worth of listening out of just five minutes of charging. A full charge will get you 18 hours of music playback. Which for a pair of really light well-balanced earphones that's a lot. And the other thing is they're magnetized so you can answer a call by opening them up and also play and pause music. So this is a neat accessory that Huawei is announcing alongside the P30 Pro and the P30. So this has been our first look at the Huawei P30 the Huawei P30 and the Huawei Freelace. All of them look quite interesting. They're going to be doing battle against Samsung's Galaxy S10 Series. Unfortunately none of that action is going be happening in The United States. But for people like me here in Europe and people in China these are exciting devices. The P30 Pro is showing a lot of potential in my first testing with it's camera. The P30 has a headphone jack and all the performance and quality of a true flagship. And the Freelance does something unique and new. I like this new idea of whatever we're gonna call this. (soft music) (exhale sound) Stay tuned to Theverge.com and Youtube.com/Theverge",
    "transcript_keywords": [
        "Huawei",
        "Vlad with Verge",
        "Pro",
        "Pro Huawei",
        "censor",
        "camera",
        "Huawei Freelace",
        "Huawei Mate",
        "Mate",
        "Pro fingerprint censor",
        "zoom",
        "phone",
        "Vlad",
        "Verge",
        "main censor",
        "Huawei calls",
        "Huawei calls super",
        "main",
        "optical",
        "charging"
    ],
    "transcript_entity_values": [
        "zero",
        "four hours",
        "Kirin 980",
        "P30",
        "one",
        "Apple",
        "four",
        "The P30 Pro",
        "Theverge.com",
        "three",
        "Watts",
        "AI",
        "USB",
        "P30 Pro",
        "the P30 Pro Huawei",
        "1080",
        "The United States",
        "Huawei P30 Pro",
        "The Huawei Freelace",
        "the end of last year",
        "40 megapixel",
        "Paris",
        "Europe",
        "5x",
        "HDL",
        "20 megapixel",
        "RGB",
        "20",
        "seven nanometer",
        "18 hours",
        "70%",
        "Samsung",
        "Kirin",
        "the Huawei Freelace",
        "two",
        "jack",
        "just five minutes",
        "One",
        "1080p",
        "3,650 million",
        "Vlad",
        "China",
        "the Huawei P30",
        "Freelance",
        "2340",
        "4,200",
        "10 megapixel",
        "4,200 million",
        "the first 30 minutes",
        "first",
        "3x",
        "EMUI",
        "the P30 Pro",
        "RAM",
        "40",
        "Huawei",
        "6.1 inch",
        "RYYB"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "GPE",
        "LOC",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.10061103105545044,
        0.00025874690618366003,
        -0.005589191801846027,
        -0.058361660689115524,
        0.0809788703918457,
        -0.008879168890416622,
        -0.0009520658059045672,
        0.06426902115345001,
        -0.004094477742910385,
        0.057686831802129745,
        0.07780974358320236,
        0.05977320671081543,
        0.051165614277124405,
        0.006458629854023457,
        0.08909890800714493,
        0.029534127563238144,
        0.09165091067552567,
        -0.13743478059768677,
        0.0031939472537487745,
        0.027406811714172363,
        -0.02566227875649929,
        -0.06742708384990692,
        0.10043132305145264,
        0.053347792476415634,
        -0.009237349964678288,
        0.038349274545907974,
        -0.015487948432564735,
        -0.005371865816414356,
        -0.03752464801073074,
        -0.036954399198293686,
        0.011049812659621239,
        0.16921466588974,
        0.043055396527051926,
        -0.03075859323143959,
        -0.021085387095808983,
        -0.06450902670621872,
        -0.011482679285109043,
        -0.0038420953787863255,
        -0.029488002881407738,
        0.01741938479244709,
        0.03459588438272476,
        -0.04031822085380554,
        0.009149109944701195,
        -0.013925796374678612,
        -0.004110528621822596,
        -0.040023017674684525,
        -0.035361144691705704,
        -0.034353673458099365,
        -0.013847313821315765,
        -0.03766683116555214,
        0.06345769017934799,
        -0.06715278327465057,
        -0.017871035262942314,
        -0.019768591970205307,
        -0.08341119438409805,
        0.01599162630736828,
        0.038488347083330154,
        0.042504169046878815,
        0.04777120426297188,
        -0.03427427262067795,
        0.02120296098291874,
        0.03728145360946655,
        -0.03828512132167816,
        0.047580670565366745,
        -0.005045905243605375,
        -0.0068381428718566895,
        0.05480519309639931,
        -0.0022309112828224897,
        0.0039297775365412235,
        0.006863051559776068,
        -0.03439754620194435,
        0.03472348675131798,
        0.014507114887237549,
        0.0024238184560090303,
        -0.04983029142022133,
        -0.031170383095741272,
        0.041427258402109146,
        0.0065996600314974785,
        -0.06534639000892639,
        -0.01731947250664234,
        0.034030184149742126,
        -0.020699381828308105,
        -0.09282145649194717,
        -0.056068263947963715,
        0.06310229748487473,
        -0.047137096524238586,
        -0.02930406481027603,
        0.029252318665385246,
        -0.0869249701499939,
        -0.07500600814819336,
        -0.08412212133407593,
        0.09627640247344971,
        -0.11299707740545273,
        -0.010632777586579323,
        -0.015585397370159626,
        0.027732551097869873,
        -0.059828538447618484,
        -0.05574113503098488,
        -0.04795966297388077,
        -0.011853385716676712,
        0.07718286663293839,
        0.0449378527700901,
        0.03725367784500122,
        -0.02633110247552395,
        0.024352630600333214,
        -0.05620590224862099,
        -0.019127998501062393,
        0.03383595123887062,
        -0.0006137148593552411,
        0.0706963837146759,
        -0.03692165017127991,
        0.007232083007693291,
        -0.08808586001396179,
        -0.012789854779839516,
        -0.040620312094688416,
        0.07277867197990417,
        -0.0315207801759243,
        0.04763651639223099,
        0.09468673169612885,
        -0.01650206744670868,
        0.009917163290083408,
        -0.05252295359969139,
        -0.08449789136648178,
        -0.10461895912885666,
        0.00046894658589735627,
        0.004589075688272715,
        -0.07568502426147461,
        1.3748348665057233e-33,
        0.029996665194630623,
        0.09367372840642929,
        -0.04512101411819458,
        -0.020064326003193855,
        0.01868322491645813,
        0.0073138875886797905,
        0.011284270323812962,
        0.014120955020189285,
        -0.052114956080913544,
        0.0073194052092731,
        -0.07064099609851837,
        0.021240221336483955,
        0.014132769778370857,
        0.046643517911434174,
        0.08064846694469452,
        -0.10060228407382965,
        -0.07424496114253998,
        0.006624705158174038,
        -0.005591687746345997,
        -0.031233616173267365,
        0.01671971194446087,
        -0.010632955469191074,
        0.04354552552103996,
        0.00017626001499593258,
        0.04548006132245064,
        0.010800682008266449,
        0.056529752910137177,
        0.02934075891971588,
        0.0202694833278656,
        0.0009926101192831993,
        -0.10849250108003616,
        0.01510663516819477,
        0.026209669187664986,
        -0.0462651252746582,
        -0.03156805783510208,
        0.049872249364852905,
        0.0022919941693544388,
        -0.08357886224985123,
        0.003546730615198612,
        -0.03948770463466644,
        -0.03393203392624855,
        0.03322392329573631,
        -0.07145429402589798,
        -0.048036884516477585,
        0.004120319616049528,
        0.008583569899201393,
        -0.03334033489227295,
        -2.9092308977851644e-05,
        -0.0419868640601635,
        -0.018117375671863556,
        0.017925405874848366,
        0.0009831159841269255,
        -0.053820785135030746,
        0.07519404590129852,
        -0.03639525547623634,
        -0.022657448425889015,
        0.017133483663201332,
        -0.023767884820699692,
        -0.02132859081029892,
        0.0030280030332505703,
        0.1252780258655548,
        0.00025126105174422264,
        -0.046509165316820145,
        0.03957536816596985,
        -0.01953638531267643,
        0.06878238916397095,
        0.048927247524261475,
        0.04892120510339737,
        -0.03835668787360191,
        0.08664104342460632,
        -0.021100757643580437,
        -0.040838468819856644,
        0.0014631730737164617,
        -0.02504117786884308,
        0.07831934839487076,
        0.016412993893027306,
        -0.048859853297472,
        -0.02147641032934189,
        0.005653564818203449,
        0.032046906650066376,
        -0.08920378983020782,
        0.05559546872973442,
        0.04805641621351242,
        0.01408239733427763,
        -0.08975552022457123,
        -0.02396331913769245,
        0.034383080899715424,
        0.002914966084063053,
        -0.044756822288036346,
        0.0063194697722792625,
        0.005521284881979227,
        -0.056734632700681686,
        0.06293094903230667,
        0.08802486956119537,
        -0.0038160313852131367,
        -2.3063017328850888e-33,
        -0.030984796583652496,
        0.0021624371875077486,
        0.04463271051645279,
        -0.03061050921678543,
        0.011880535632371902,
        -0.04761166125535965,
        0.11932078003883362,
        0.0339970625936985,
        -0.029391009360551834,
        -0.04318432882428169,
        0.009388870559632778,
        0.01251506619155407,
        -0.00046497402945533395,
        -0.040671106427907944,
        0.022534197196364403,
        -0.04863615706562996,
        -0.034616995602846146,
        -0.031718961894512177,
        0.062445268034935,
        0.017407018691301346,
        0.12666210532188416,
        0.04337681829929352,
        -0.002139338292181492,
        -0.022115472704172134,
        -0.07248283177614212,
        0.0025993739254772663,
        0.019786570221185684,
        -0.010924450121819973,
        0.02411593869328499,
        -0.0356203094124794,
        -0.019127506762742996,
        -0.05996750667691231,
        -0.02017793245613575,
        0.011572347953915596,
        0.05096185952425003,
        0.013563990592956543,
        -0.026732541620731354,
        -0.0307791568338871,
        0.03306858241558075,
        -0.010800727643072605,
        0.012894676066935062,
        0.049254484474658966,
        0.031674522906541824,
        -0.05767039954662323,
        0.02388986200094223,
        -0.033227358013391495,
        -0.05919510871171951,
        -0.024443261325359344,
        -0.03190731257200241,
        -0.006194559391587973,
        0.05400514975190163,
        0.052926987409591675,
        -0.03689968213438988,
        0.05580081045627594,
        -0.06518063694238663,
        -0.07404836267232895,
        -0.044045161455869675,
        -0.04308779910206795,
        -0.03910611942410469,
        -0.015050424262881279,
        0.043997786939144135,
        0.08557499945163727,
        -0.05455798655748367,
        0.01317637786269188,
        -0.10480275005102158,
        0.04426398500800133,
        0.08255646377801895,
        0.027973735705018044,
        0.021294765174388885,
        0.07396902143955231,
        -0.01533878780901432,
        0.0035018697381019592,
        -0.10610781610012054,
        -0.002876864979043603,
        -0.038351576775312424,
        -0.016203593462705612,
        -0.08292922377586365,
        0.023556340485811234,
        0.038182903081178665,
        -0.009335019625723362,
        0.04014424979686737,
        0.010508526116609573,
        -0.0004758816212415695,
        -0.013514982536435127,
        0.023489074781537056,
        -0.02021118998527527,
        -0.007748093456029892,
        0.020228488370776176,
        0.034246623516082764,
        0.051358357071876526,
        -0.01972288265824318,
        -0.04459488019347191,
        -0.12022969126701355,
        0.13232770562171936,
        0.030771877616643906,
        -4.792313745838328e-08,
        0.011089700274169445,
        -0.007882779464125633,
        0.023757360875606537,
        0.04465729743242264,
        0.005642401520162821,
        -0.0986795648932457,
        0.0339004322886467,
        0.017727188766002655,
        0.12238331139087677,
        -0.028587238863110542,
        0.046126652508974075,
        -0.12380781769752502,
        -0.027661342173814774,
        0.014486018568277359,
        0.038479145616292953,
        0.11163593083620071,
        -0.021279018372297287,
        0.05798327177762985,
        0.00044421484926715493,
        -0.01716877892613411,
        0.005435922648757696,
        0.06726089119911194,
        0.016988277435302734,
        -0.10867074877023697,
        0.03159146383404732,
        0.061781030148267746,
        -0.11142361909151077,
        -0.0030597378499805927,
        0.017221778631210327,
        -0.04482497647404671,
        -0.032593224197626114,
        0.01320060808211565,
        -0.05074033886194229,
        -0.008882168680429459,
        0.05835511162877083,
        0.021011289209127426,
        0.08235568553209305,
        -0.042650219053030014,
        0.058598700910806656,
        0.05866404250264168,
        0.021159030497074127,
        -0.12046027183532715,
        -0.03131435811519623,
        0.019020209088921547,
        0.02604653313755989,
        -0.07628357410430908,
        0.0034728297032415867,
        -0.08311935514211655,
        -0.03353891149163246,
        0.13732624053955078,
        -0.019292449578642845,
        0.028891803696751595,
        -0.007645426783710718,
        -0.06801239401102066,
        0.00486114714294672,
        0.054032739251852036,
        -0.003277770709246397,
        -0.024379536509513855,
        -0.11916597187519073,
        0.064142607152462,
        0.11227233707904816,
        -0.0805528312921524,
        0.11970117688179016,
        0.10001282393932343
    ]
}