{
    "id": "jUIzLu5eVbM",
    "title": "Deep-Cleaning a Viewer's DIRTY Gaming PC! - PCDC S3:E9",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2022-10-01T00:46:30Z",
    "video_url": "https://www.youtube.com/watch?v=jUIzLu5eVbM",
    "category": "Science & Technology",
    "tags": [
        "pcdc",
        "deep cleaning",
        "dirty pc",
        "gaming pc makeover",
        "nasty pc",
        "dirty computer",
        "old computer",
        "computer restoration",
        "how to clean a pc",
        "personal computer deep cleaning",
        "greg salazar",
        "viewer pc",
        "how to clean a computer",
        "remove dust",
        "how to clean a pc fan",
        "dirty gaming pc",
        "computer cleaning",
        "dusty pc",
        "how to clean a pc properly",
        "Gross computer"
    ],
    "views": 100337,
    "likes": 6827,
    "comments_count": 452,
    "description": "SPONSORS: Check out Corsair HS65 Surround headsets:    From the #1 Purifer brand, Levoit's VortexIQ 40 Vacuum:   This PC hasn't been cleaned in over 8 years! Let's give it a makeover! By the way, if you live in the Orlando, FL area and have a dirty system, apply to have it cleaned for free today!    Consider supporting us on Patreon!   SPONSOR: Snag an OEM Windows 10 Pro key for $16 using code 'SKGS' for a 25% discount: Win10 Home ($15): Office 2019 ($48):    My cleaning gear:  SYINE Respirator Mask:  Scott Shop Towels:  Electric Air Duster:  ONSON Cordless Vacuum:  Medical Grade 99.9% Isopropyl Alcohol:  Q-tips Cotton Swabs:  Xool 80 Precision Tool Set:  Hizek Black Disposable Gloves:    My troubleshooting gear: FLIR C5 Thermal Camera:  Skybasic Digital Microscope:  YIHUA Soldering Station:  Helping Hand Soldering Board:  Xool 80 Precision Tool Set:    My studio gear: Sony a6600 (Primary):  Sony a6400 (Secondary):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   Music provided by Monstercat: Liuwik, Airdraw, & Blood Groove & Kikis - White Collar   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #PCDC #DirtyPC #Cleaning",
    "description_links": [
        "https://geni.us/5nuXZpK",
        "https://amzn.to/3SCpFO6",
        "https://gregsalazar.com/pcdc",
        "https://www.patreon.com/gregsalazar",
        "https://bit.ly/Win10SKGS",
        "https://bit.ly/homeSKGS",
        "https://bit.ly/2019SKGS",
        "https://geni.us/V4uA",
        "https://geni.us/rIy5O6Y",
        "https://geni.us/RALt4",
        "https://geni.us/aABrFWE",
        "https://geni.us/tBVQ",
        "https://geni.us/nQhVVQm",
        "https://geni.us/1IfxDSw",
        "https://geni.us/MBCJaf",
        "https://geni.us/3ALEI",
        "https://geni.us/6zurf",
        "https://geni.us/DbjS",
        "https://geni.us/7DDrL",
        "https://geni.us/1IfxDSw",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp",
        "https://youtube.com/c/monstercatsilk"
    ],
    "transcript": "- This here is another viewer's very dirty gaming pc. As far as I'm aware, this hasn't been cleaned in over eight years. Which... That's kind of tough to do. And while it shows, it's not the dirtiest thing on the planet, but it is pretty gross. A lot of caked up dust and grime pretty much everywhere that the eyes can see. And so that's gonna require a full disassembly. We're gonna deep clean everything about as far as each component will go and then we'll reassemble it all, make sure it's still boots up. Wow, it's been a minute hasn't it for a PCDC video. Even a GCDC one console side of things. There just aren't too many systems that need to be cleaned anymore that are very dirty in and around Orlando, Florida. And I say, that's a job well done. Like I knew this playlist would be a finite one at least with respect to this area. There are only so many systems out there that need to be deep cleaned, and that have viewers who watch these videos, right? So it is what it is. That's why these have been coming in a bit slower. But I really like to hold out for a proper dirty system. And I think this one fits the bill. This PC specifications are, well they're old. Like I said, it's been running for eight or nine years pretty much uncleaned throughout its life. This is an older Cooler Master case, has plenty of airflow it appears. This graphics card is a HD 7950, so several, several generations old. Looks like a Z, maybe like a Z77, Z87 ASUS motherboard, I can't tell. And then a tower Cooler Master cooler, with a power supply that obviously can keep up with this combination of hardware here. So I mean it runs fine apart from the fact that it's extremely dusty and grimy. And that's again what we're gonna take care of here. Oh yeah, ready? Come along for the ride. Stay with me. This is workout mode. Oh my gosh. The Corsair HS65 surround gaming headset delivers all day comfort and sound with memory foam leatherette ear pads, lightweight aluminum reinforced construction and Dolby audio 7.1 surround on both Mac and PC. You can even use iCue software with SoundID to customize audio profiles for unique experiences in game and in chat. As always, you can learn more by clicking the link below. Now, before taking everything apart I wanna give you a quick pov what we're dealing with here. Multiple fans in this rig. Two Noctua fans up front, and we've also got one at the rear for exhaust. These are going to- Yeah, they're gonna take up quite a bit of our time here cleaning. We're gonna clean individual fins. We're also gonna re-oil these fans. Although I don't show that usually on camera, we do that to ensure that the fans have several years of life left, assuming they haven't already been damaged before we receive the system. We've got two fans in the cooler. These are, yeah, the more fans that we throw into a deep cleaning, it just gets exponentially longer to clean. They are by far the most labor intensive part of this entire project. We've got two fans as well and the graphics card shroud and we tear all this apart, we'll be cleaning those fans individually. We also have a very large fan here that looks like it was added after the fact. And this one's maybe like a one, say like a 180 mm, 200 millimeter and yeah. So just a ton more surface area to tackle on this one. It's probably pretty difficult to see from this camera angle. We haven't actually gotten behind the motherboard yet. But there's a lot of dust just all up in and around this case. I'm gonna try my best to preserve all of these components. I don't think I want to upgrade anything. Is there like, there's like some- Oh, is that a loose hard drive? That is a loose hard drive. Oh my gosh, that's not good. So maybe some physical things we'll need to address as well. Oh, I really didn't see that coming. And then of course, just when you thought you'd seen enough fans, two more of them. These look like 80 or 92 millimeter fans. We have a fan in the power supply as well. So what we're looking at like 10 fans here. This is gonna take a ton of time and of course it's all very, very grimy. So now that you know what we're getting ourselves into, let's talk about some of the things I use to clean these rigs. It's all by the way, linked in this video's description if you want to check any of it out. Isopropyl alcohol and shop towels are a great place to start. Great for scrubbing. The IPA's gonna really help pick up a lot of that stuck on dust that air alone will not be able to tackle, including air cans. You can use an industrial-like air compressor that's gonna put a lot of stress on especially the fan blades. So be very careful where you use something like that. I like to stick with an electric duster like this one. And it has nylon bristles, great for scrubbing. They don't produce any static either, so you shouldn't worry about damaging components as long as you're not jamming the entire nozzle straight into SMDs on your boards. I also like to use IPA with cotton swabs, it's great for getting in and around these smaller crevices and things around motherboards. Their SMDs especially chip sets, great for cleaning processors and the like. And it doesn't hurt to have a versatile toolkit around. This is a knockoff wannabe IFixit toolkit. It comes with pretty much any screw head that you could think of to get tons of things apart. Some graphics cards especially don't use traditional phillips screws. They'll use hex screws, allen screws, something like that. And so having a set like this can come in very handy. You can use this also for dissembling phones and other things. Now, apart from also pairing my cleaning process with a Levoit air purifier, something that really saves the day when it comes to cleaning stuff like this indoors. I also use a Levoit VortexIQ Cordless Stick Vacuum Cleaner. This thing sucks, but in a really good way. It literally lifts the carpet up from my floor while I'm vacuuming. So you know that it's really sucking, right? And that's always good to see. You've got the two stage HEPA filters in this thing so you can be sure that the air that's circulating back into your room through the vacuum is clean. This should keep those with severe allergies from sneezing every five seconds as well. So if you're prone to that kind of thing, using one of these vacuums is gonna really help out. And especially after finishing the cleaning process in the office, which I always try to do because the lighting in here is just so much better. You can imagine how much dust, even after getting rid of the loose stuff in the garage remains on my carpet in this office. And that is again where the vacuum really comes in handy. I strongly suggest you check out the VortexIQ lineup from Levoit. These are super powerful, they have really long battery life and they suck, but in a really good way. You can learn more about them by clicking their sponsor link below. So with all that out of the way, I apologize, took a minute. Let's get to the deep cleaning process. And for that we're gonna cue the music. I have to like, oh God, acrobatics here. I am not flexible. Are you ready? 3, 2, 1. (White Collar playing) Phew. All right, that took a while. About two solid days of cleaning, allowing things to dry because that- Yeah, that needs to happen don't want to fire system up with water in it, wouldn't be good. But you can see it's looking so, so much better now. We've got the front grill, I can actually see through it. So that's nice, sorry about the auto focus. That has totally been cleaned up. This case actually cleaned up really nicely. Really impressed with the quality of it. There's no scratches or... Actually, you know, a couple tiny things here and there. But overall, I mean for the age of this case, I think it holds up very well. I'm actually quite the fan of this case now that I've had the time to build on it. We cable managed as best we could. Here from this side you don't really see too much hanging out. It's kind of just stuffed between the power supply and the drive base here. Which actually have a hot swap board in there as well, so that's cool. The top of the case where you'll probably see most of your components has been pretty much cable managed as far as I could get it. Just given what we're working with here. You've got our tower cooler totally clean, the graphics card has been cleaned. And yeah, just overall it really shows well. So I'm really impressed with the way this one turned out. All the fans have been deep clean. Just all in all, yeah, mission accomplished. But wait, there's still one thing we need to do. Make sure the system actually powers on again. So let's do that. Get our portable monitor connected once again, and power on here at the rear of the case. All right, power button is up front. (button clicks) (computer whirring) Okay, one- Oh, it's good. All right, so it's post. I just noticed there is one fan that's not spinning and I think it just... I think it just disconnected all this. There's a bunch of stuff back here. Yep, that makes sense. There we go, now she's spinning. So all fans spinning. I'm gonna hop into the bios real quick and make sure that all of his drives are detected. He has like four storage drives in here, and then also an optical drive, so there's a lot going on. I wanna make sure all that's being detected and then we'll put the side panels on and call it a day. I wanna thank all of you for watching this far into these videos. Viewer retention is such a huge help for the channel. I'd say it matters more than even subscriber count. It's probably as powerful if not more powerful of a metric than just sheer comments, engagement when the videos go live. So thank you for watching this far, again, into these. I try to make them as interesting as I can. I try to pick music that's not so polarizing. I've tended to lean more toward like house music and we have a license through Monstercat to use music from their platform, which is really great. So I appreciate that from them. I'm really happy with the way this one turned out. Again, no surprises, that's always a good thing. You don't wanna have a system not turn on after you completely dissect it. It look so much better now. Not a dust spec sight that I could see. And this case, I mean of all things, the case I think is what's most impressed me here. This has cleaned up so nicely and it's just given new life to an otherwise older platform. Now remember, if you or someone you know lives in and around Orlando, Florida and you have a dirty system, something that looks as gross as this or worse, I would love a chance to deep clean it for free. I won't charge you anything at all. All you need to do is submit a form, via the link in this video's description. It'll be pretty straightforward what you need to include. Just a few photos, a brief description of the rig itself, specifications. And yeah, as long as you're okay with me taking it on for a few days, I'll make it look as close to brand new as I possibly can. And even feature it in a video here on this channel. So cool bragging rites to your friends let's say if you wanted to, you know, show up on a YouTube channel. That'd be just beneficial for both of us. Because I obviously get to make content out of it as well. And that's why I do this for free because you guys are already doing enough as it is allowing me to take your systems on for as long as I do. Oftentimes it's... I mean, this guy's gonna pick this one up on Friday. So he'll have given it to me for a week. And it's just because of his work schedule and things. He drove over an hour to get here, and is doing the same obviously to pick it back up. And that's one way. So two hours both ways, times two. He's driving four hours in total to drop the system off. That's a lot. That's more that I could ever ask for. And sometimes I feel guilty that all I can do is clean this for free. But I'm grateful to those who have allowed this playlist to continue operating just because they're willing to loan me their system. So, huge help anyone who submits a form. We have a system now where you should be notified if you're approved or rejected for whatever reason. That way you're not just gonna be left hanging. And I'm gonna try to get through those as quickly as I can in the future. Leave a comment down below, let me know what you think about this video. Consider leaving a thumbs up if thought the video was cool. Consider subscribing if you have not already. Join our public Discord server and other things down in the video description, and I'll catch you in the next one. My name is Greg. Thanks for cleaning with me.",
    "transcript_keywords": [
        "fans",
        "things",
        "cleaning",
        "yeah",
        "system",
        "clean",
        "case",
        "thing",
        "video",
        "fan",
        "pretty",
        "make",
        "good",
        "cleaned",
        "Cooler",
        "lot",
        "deep",
        "great",
        "deep clean",
        "Cooler Master"
    ],
    "transcript_entity_values": [
        "a minute",
        "Dolby",
        "a ton",
        "Orlando",
        "Corsair",
        "White Collar",
        "Z87 ASUS",
        "a week",
        "the day",
        "HEPA",
        "four hours",
        "over eight years",
        "80",
        "several years",
        "92 millimeter",
        "iCue",
        "PCDC",
        "over an hour",
        "two",
        "four",
        "two hours",
        "phillips",
        "Cooler",
        "7.1",
        "Discord",
        "Friday",
        "a few days",
        "Levoit",
        "Florida",
        "3",
        "allen screws",
        "YouTube",
        "About two",
        "Mac",
        "one",
        "200 millimeter",
        "180 mm",
        "Monstercat",
        "Greg",
        "Two",
        "IFixit",
        "IPA",
        "every five seconds",
        "1",
        "Cooler Master",
        "eight or nine years",
        "Levoit",
        "2",
        "all day",
        "Noctua"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.10351113975048065,
        -0.023041553795337677,
        0.05968024581670761,
        -0.08239331841468811,
        0.09419842064380646,
        -0.023168690502643585,
        0.06021742522716522,
        -0.0054817465133965015,
        -0.09278620779514313,
        0.0015377120580524206,
        0.05425114184617996,
        0.027241403236985207,
        -0.009924110025167465,
        0.00039693707367405295,
        -0.025511296465992928,
        -0.0012906260089948773,
        0.026075270026922226,
        -0.00689728045836091,
        -0.05583462864160538,
        -0.007239928934723139,
        -0.02836611680686474,
        -0.030929047614336014,
        -0.019834017381072044,
        -0.03427053615450859,
        -0.021050505340099335,
        0.0132312485948205,
        0.00409260718151927,
        -0.054985299706459045,
        -0.0451626218855381,
        -0.007474491372704506,
        0.03610989823937416,
        -0.004903068765997887,
        0.0032423213124275208,
        0.02353569120168686,
        0.1302514523267746,
        -0.06279991567134857,
        -0.003566047642379999,
        -0.007882588542997837,
        -0.08428003638982773,
        -0.011381358839571476,
        -0.0411246195435524,
        -0.02968955785036087,
        -0.08104413002729416,
        0.06259886175394058,
        0.06899434328079224,
        -0.0066091506741940975,
        -8.411736780544743e-05,
        -0.0255153626203537,
        0.024991938844323158,
        -0.01215488649904728,
        0.010714808478951454,
        -0.02486121840775013,
        0.052108533680438995,
        -0.030735954642295837,
        -0.06743564456701279,
        -0.035645741969347,
        0.014461429789662361,
        -0.0680646151304245,
        -0.043735209852457047,
        -0.08236140012741089,
        0.0011873969342559576,
        -0.07257014513015747,
        -0.06337510049343109,
        0.03489236533641815,
        -0.01630616933107376,
        0.03202807903289795,
        0.02294539287686348,
        -0.012370139360427856,
        0.006089331116527319,
        0.015337572433054447,
        -0.12375109642744064,
        0.008500817231833935,
        -0.004864281043410301,
        0.06796805560588837,
        -0.00302306842058897,
        0.08257346600294113,
        0.009473691694438457,
        -0.10785342752933502,
        3.7349178455770016e-05,
        -0.031205570325255394,
        0.06418726593255997,
        -0.047992900013923645,
        0.011610456742346287,
        0.02442661114037037,
        0.020146114751696587,
        0.018476128578186035,
        -0.017964458093047142,
        -0.042342621833086014,
        0.009696208871901035,
        -0.05099187418818474,
        -0.05676339566707611,
        0.02654109336435795,
        0.05378064885735512,
        -0.05578470602631569,
        0.037996336817741394,
        0.013908511027693748,
        0.030404943972826004,
        0.020073769614100456,
        -0.034766633063554764,
        0.05093659460544586,
        -0.057450585067272186,
        0.0005233672563917935,
        0.05034996569156647,
        -0.09110289067029953,
        0.020846214145421982,
        -0.008837244473397732,
        -0.02678936906158924,
        -0.006059754174202681,
        6.452039815485477e-05,
        -0.005928481929004192,
        -0.04819715768098831,
        0.03097505122423172,
        -0.07571302354335785,
        -0.020415768027305603,
        0.0839712917804718,
        0.0076410179026424885,
        0.03442114591598511,
        0.028512388467788696,
        0.016740117222070694,
        0.0069398898631334305,
        0.028619663789868355,
        -0.033077411353588104,
        -0.044584207236766815,
        -0.03896501660346985,
        0.025140007957816124,
        -0.0024217457976192236,
        0.01449585147202015,
        8.258946901744589e-33,
        -0.011560137383639812,
        0.09469012171030045,
        -0.0002419461525278166,
        -0.06421483308076859,
        -0.043753184378147125,
        0.01917312666773796,
        0.09157704561948776,
        0.053003013134002686,
        0.029039008542895317,
        0.1366690993309021,
        -0.01813189499080181,
        0.013289129361510277,
        -0.11201541125774384,
        0.017921486869454384,
        0.06007763743400574,
        0.0006357490201480687,
        -0.037577565759420395,
        0.027494532987475395,
        -0.06732214242219925,
        -0.016838721930980682,
        -0.037584010511636734,
        0.024435855448246002,
        -0.01623261161148548,
        0.04740516468882561,
        0.0347965843975544,
        -0.03976338356733322,
        -0.046587277203798294,
        0.0014199382858350873,
        0.08097372949123383,
        0.020925981923937798,
        -0.010030006989836693,
        0.05467023700475693,
        0.008847632445394993,
        0.03506513684988022,
        -0.11638833582401276,
        0.03221305087208748,
        -0.08186958730220795,
        -0.07767234742641449,
        0.055436018854379654,
        -0.022335123270750046,
        -0.04457087814807892,
        0.029593946412205696,
        0.018831107765436172,
        -0.08490943163633347,
        0.03895501792430878,
        -0.07627059519290924,
        -0.041051995009183884,
        0.027809318155050278,
        0.0375097393989563,
        0.04924515634775162,
        -0.0462576188147068,
        0.056796371936798096,
        -0.018740957602858543,
        0.01228747982531786,
        -0.09287609905004501,
        -0.04289442300796509,
        0.09472133964300156,
        -0.024713177233934402,
        0.053574707359075546,
        0.053084395825862885,
        0.019073329865932465,
        0.046331509947776794,
        0.011665311641991138,
        -0.003547446569427848,
        1.6758944184402935e-05,
        0.001349729485809803,
        0.13236509263515472,
        0.0657263919711113,
        -0.008315561339259148,
        -0.046553462743759155,
        -0.02915339358150959,
        0.03913964331150055,
        -0.08987410366535187,
        -0.054212912917137146,
        0.04584580659866333,
        -0.0194513238966465,
        0.004774240776896477,
        -0.04170810431241989,
        -0.014914995059370995,
        -0.027205614373087883,
        -0.006469487212598324,
        0.0692124143242836,
        -0.0065175266936421394,
        0.00807992648333311,
        -0.014304528012871742,
        -0.026728665456175804,
        -0.0074509382247924805,
        0.06502046436071396,
        -0.010608921758830547,
        -0.03476986661553383,
        0.02926809899508953,
        -0.001543332007713616,
        -0.022603461518883705,
        0.04150194674730301,
        -0.04522636532783508,
        -8.698364322497222e-33,
        0.04319893568754196,
        -0.07394203543663025,
        0.024565638974308968,
        0.1304517388343811,
        -0.018975969403982162,
        0.03642788529396057,
        0.047920823097229004,
        0.01726452447474003,
        0.017697790637612343,
        -0.013270393945276737,
        -0.028977422043681145,
        0.08493953943252563,
        -0.004339775536209345,
        -0.04163521155714989,
        0.07943012565374374,
        0.06088769808411598,
        -0.08227936923503876,
        -0.04853415861725807,
        -0.02480488270521164,
        -0.004476888105273247,
        0.06424466520547867,
        0.1125655546784401,
        0.05780867859721184,
        0.0032675391994416714,
        -0.1002553328871727,
        0.026321934536099434,
        -0.026474719867110252,
        -0.015836553648114204,
        0.058659955859184265,
        0.043857134878635406,
        -0.009407679550349712,
        0.06177248805761337,
        0.03836126625537872,
        0.040509119629859924,
        0.03644324466586113,
        -0.11558277159929276,
        0.0847410336136818,
        -0.010382124222815037,
        -0.03921227157115936,
        -0.08163049072027206,
        -0.003919319249689579,
        0.0022285827435553074,
        -0.004034281708300114,
        0.06799689680337906,
        -0.025594938546419144,
        0.006057696416974068,
        -0.06824076175689697,
        -0.10389815270900726,
        0.014432021416723728,
        0.04955727607011795,
        -0.032276105135679245,
        -0.0037536679301410913,
        -0.07180256396532059,
        0.02790318988263607,
        -0.03580847382545471,
        0.07728441804647446,
        -0.04346141591668129,
        -0.023203404620289803,
        -0.05375434458255768,
        0.009174471721053123,
        0.043883778154850006,
        0.07812342047691345,
        -0.103277288377285,
        0.013342517428100109,
        0.013681606389582157,
        0.027214154601097107,
        0.1242087185382843,
        0.0916895866394043,
        -0.051616862416267395,
        -0.06677132099866867,
        -0.07962857931852341,
        0.02027338743209839,
        0.008609991520643234,
        -0.12104485929012299,
        -0.01598360948264599,
        0.028561869636178017,
        0.024161815643310547,
        -0.030320316553115845,
        0.03266792371869087,
        0.03375789150595665,
        -0.0384349599480629,
        -0.05745392665266991,
        -0.014907610602676868,
        0.07824286818504333,
        0.04134824499487877,
        -0.08717558532953262,
        -0.06242465600371361,
        0.0075457231141626835,
        -0.03225273638963699,
        0.0252318624407053,
        -0.05628625303506851,
        0.012292178347706795,
        0.06490374356508255,
        0.010632816702127457,
        0.03738320618867874,
        -6.101393523749721e-08,
        0.04955326020717621,
        0.0767611563205719,
        0.07747062295675278,
        0.04514720290899277,
        0.022841764613986015,
        -0.07312269508838654,
        -0.02531338296830654,
        0.17600683867931366,
        -0.0033126333728432655,
        0.021615521982312202,
        0.06073759123682976,
        -0.086786188185215,
        -0.06311076134443283,
        -0.0394667387008667,
        0.04834655672311783,
        -0.022935081273317337,
        -0.1014857143163681,
        0.08607006818056107,
        -0.0626542791724205,
        -0.07644158601760864,
        -0.014825558289885521,
        0.059627726674079895,
        0.07244180142879486,
        0.005416984669864178,
        -0.0621444396674633,
        0.041912373155355453,
        -0.00021103463950566947,
        0.06332593411207199,
        0.05054495483636856,
        0.02318991906940937,
        -0.039866190403699875,
        -0.026508565992116928,
        0.01375853642821312,
        -0.011579874902963638,
        -0.007305622566491365,
        -0.05328664183616638,
        -0.006213618908077478,
        0.00954138021916151,
        0.08910344541072845,
        0.007769450545310974,
        -0.03056432120501995,
        -0.10919429361820221,
        -0.1166948452591896,
        0.015057348646223545,
        0.003467410570010543,
        -0.031764283776283264,
        -0.07294807583093643,
        -0.061236269772052765,
        -0.047557931393384933,
        -0.0029817367903888226,
        -0.04653868079185486,
        0.037084128707647324,
        -0.02625105530023575,
        0.043042104691267014,
        -0.023139428347349167,
        0.05306722968816757,
        0.018301719799637794,
        -0.014021572656929493,
        0.0657249316573143,
        0.08636689931154251,
        0.024653414264321327,
        -0.09684552997350693,
        -0.0832231342792511,
        0.02800999954342842
    ]
}