{
    "id": "jXzJ7FlqX6M",
    "title": "I Got This MYSTERY Motherboard From Reddit - AMD Z490",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-17T18:00:39Z",
    "video_url": "https://www.youtube.com/watch?v=jXzJ7FlqX6M",
    "category": "Science & Technology",
    "tags": [
        "Rare PC parts",
        "engineering sample",
        "prototype",
        "prototype motherboard",
        "ES motherboard",
        "engineering motherboard",
        "rare motherboard",
        "AMD Z490",
        "AMD Z490 chipset",
        "cancelled motherboard",
        "unreleased motherboard"
    ],
    "views": 1608098,
    "likes": 52481,
    "comments_count": 1071,
    "description": "Check out Micro Centers New Year Top Deals:  Submit your build to Micro Centers Build Showcase:   Learn more about NexiGo's family of webcams here:   Instead of the trash, this confusing engineering sample motherboard found its way to China, then Reddit, and now our office!  Lets take a look at what it offers and learn why AMD cancelled it!  Discuss on the forum:   Buy a TP-Link WiFi 6 PCIe WiFi Card:  Buy a TP-Link 10GB PCIe Network Card:  Buy a SABRENT 1TB Rocket NVMe 4.0 Gen4 PCIe M.2 SSD:  Buy a Seasonic FOCUS GM-750 PSU:  Buy a MSI PRO X670-P WiFi ProSeries Motherboard:  Buy an ASUS PRIME X670-P Motherboard:  Shop BestBuy:  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:21 AMD what now? 2:56 Let's build a PC with it 4:13 The secret sauce 6:41 Quirks & features 7:47 Das boot & Windows 9:55 What's in a name? 10:47 It works! Why cancel it? 12:25 Outro",
    "description_links": [
        "https://micro.center/u36",
        "https://micro.center/40o",
        "https://viraln.link/LTTWebcams23",
        "https://linustechtips.com/topic/1482067-i-got-this-mystery-motherboard-from-reddit/",
        "https://geni.us/UJIHQh5",
        "https://geni.us/U35v6r2",
        "https://geni.us/TNbN",
        "https://geni.us/Jrgfo3a",
        "https://geni.us/ySDZ",
        "https://geni.us/LhAffO",
        "https://howl.me/ciS30FLZblh",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Every motherboard with a Z490 chipset has one thing in common, Intel, Intel, Intel. Wait a minute, what in the heck is this thing? It says Z490, but there it is. Obviously an AMD CPU socket. Where did this thing come from? Reddit obviously, don't you read the video title? But more importantly, what is it? Why did they make it? Why ultimately didn't they make more of them? And how does this compare to the AMD motherboards we know and love? These three M.2 slots tell us that the story might have something to do with PCIe lanes, but from what we've been able to glean, this entire chipset was canceled before it could be released. Is this the competitor that could have been? Did we miss out on something amazing? Well, it turns out that for an engineering experiment, it's surprisingly functional. So we're gonna be taking it for a spin with close attention to all the curious little details. After you pay close attention to these details from our sponsor. Nexigo. Whether you're in need of a webcam or accessory for your VR device, Nexigo has a great selection of products to choose from. Learn more about them at the link down below. This strange motherboard first appeared on Reddit which is kind of wild because as skeptical as I was, this is no hoax. This is an AMD CPU socket and it is on a motherboard with a Z490 chipset. Just not the kind of Z490 chipset that you might think. Now we have seen motherboards in the past with support for both Intel and AMD CPUs. Most recently from ECS using a daughterboard. But if you look carefully at that product, the chipset is actually on that secondary board. That's because both AMD and Intel use proprietary protocols and no modern motherboard chipset is capable of communicating with CPUs from both vendors. So no, this is not an AMD socket Frankensteined onto an Intel chipset board, but rather just another case of AMD ripping off Intel's naming scheme to make it seem like they're a generation ahead. But that doesn't mean that it's boring. Let's jump in and see how close this thing was to being ready. One thing we can tell immediately between the particular shade of orange they use and the lettering for the silkscreen, not to mention the fact that it says gigabyte right on it, is that this board was originally from gigabyte. And while it might be missing some of the cosmetics, we can also tell that it was based on the X470 Aorus Gaming 7. Because between the layout and features and from looking at the pixels, you can tell they've got a lot in common. For our CPU, given that this is in the same family as the rest of AMD's 400 series motherboards, I think it is possible, well probable, that first and second gen Ryzen chips, like this 2700X, will work. But even though X470 boards, like this one's cousin, can be updated to support third and up to fifth gen, well, there are no BIOS updates available for engineering samples, so third gen and up would be basically impossible. As for RAM, we'll be going with these G.Skill Flare X sticks rated for 3,200 megatransfers per second. 2000 series chips could do better and did benefit from faster, but this was kind of the bang for the buck speed at the time that I would expect any motherboard to support fairly easily. And finally, it's SSD time, bringing us to the most obvious advantage of this chipset compared to X470, an extra M.2 slot. Okay, I'm leaving out some important details here. It's not quite as simple as slapping on an extra slot and calling it a day. You actually need the PCI Express lanes to support that slot, and this board's X470 cousin is clearly already maxing out this platform's 32 lanes. So then, how does this one have more? Ah, the secret is under this heat sink. With it removed, we'll find a couple of things. First is the AMD chipset itself. This looks pretty darn similar to an X470 chipset and honestly, probably uses the exact same silicon. It wouldn't be the first time we saw a manufacturer artificially limit the features on a chipset to address different price points. If you remember from our Intel R&D Center tour, they actually have special chipsets for development that they can reconfigure through software to be any member of the 12th Gen chipset family that they wish. So the different codes etched in the top are probably the only things that differentiate this from an X470. But what's this? A chip from PLX. Yes, this seems to be the secret sauce of the AMD Z490 chipset that enables it to have four extra general purpose Gen 3 PCIe lanes. It's also a big part of the reason this board, and any like it, never made it to the market. More on that later. This chip is known as a multiplexer, and while PLX is probably the best known, they are just one of the many manufacturers who produce them. A multiplexer's purpose is to connect multiple PCIe devices downstream to the same lanes originating from the CPU, or for that matter, from the AMD chipset. Now obviously, a multiplexer can't magically create extra bandwidth, and if every single downstream device was running full tilt at the same time, it would be bottlenecked. But that rarely happens, and these devices were very common back in the mid 2000s in the heyday of SLI, so that motherboard manufacturers could squeeze as many 16x slots as possible onto a motherboard for three-way and four-way configurations. Of course, now that multiple GPUs aren't really a thing anymore, the focus for this chipset was on increasing support for NVMe SSDs. Now, because I really wanna load this thing up and see just how close it was to final, we're gonna be going high-end here with three of these awesome Sabrent Rocket 4 Plus PCIe Gen 4 drives. We're gonna have those and more linked down below. Oh, whoops, I've got these on wrong, and evidently we need hook and loop fastener to hold down this one. It doesn't have all the mounting hardware, all right? It's an engineering sample. Don't worry though, that's an older one, not a Rocket Plus. Other fun quirks, once we've got the board powered up, here we go, watch this. All the RGB on the motherboard lights up in white, and then that's the last time you're ever gonna see it because any control for it appears to have been completely removed from the BIOS. I mean, you don't need no RGB on an engineering board, do you? Surprisingly, all three of these slots do work, but not everything about the board does. Even though I haven't personally tested it yet, we did test it before getting started, and there are absolutely some quirks on this board. The bottom PCIe slot, for example, is completely dead, and so is the onboard networking. What's curious is that the network chip is detected in Windows, but no driver package from Intel that we could find would install, so it's possible that it's an engineering sample as well. Ryzen 2000 chips didn't have onboard GPUs, so this is the only way for us to get a video output. Speaking of video output, we've been outputting some really great exclusive videos over on flowplane.com. How about this one, showcasing some of the TikTok hacks we tried that you won't find on YouTube? Big moment. To be clear, I am expecting it to work. It's just that this kind of borderline engineering sample stuff, if you look at it wrong or blow on it too hard, sometimes it stops working, so nothing's a guarantee. Hello? Yes, okay. Time to see what else works, or doesn't work. As it turns out, the USB headers do work. The back IO all works, except for ethernet. Even the USB-C port, so here's one of our Steam drives, which should allow us to game on this completely unreleased motherboard. Man, everything about this just feels and looks completely normal. 2700X, eight-core processor, it's turboing as you would expect. Gigabyte Z490 Aorus Master. Chipset. AMD Promontory. I don't remember what their code name was for X470. Promontory means it has a Zen 2 ready BIOS. That's it? Wait, Bixby? How does Bixby figure into all of this? My arch nemesis returns. No, these are code names. Promontory was used for everything from A320 to B550, and Bixby was used for X570. I think the most notable thing about all of this is how not notable it is, though. Everything is operating exactly as I would expect. The interesting thing about this run isn't the score, but rather how fast the CPU turbos. We're sitting at anywhere between around 3.9 to 4 gigahertz, which is about what we'd expect. Our Wi-Fi card is only 2.4 gigahertz, so I guess we're gonna be pushing it a little harder even by throwing a network card in this slot here and seeing if the whole thing will run together. We're off the rails now, ladies and gentlemen. Not in a good place. Bah, bah, I got him. Okay, I need shields, I need shields. No! There's an invisible guy behind me, but that's not what's important. What's important is that I'm running at 118 frames per second in Halo Infinite. Obviously, that's not like the most FPSs ever or anything like that, but what it is is working. Okay, it's a normal motherboard, which means you're probably wondering a few things, first and foremost being why AMD chose the Z blank 90 naming convention, which is associated exclusively with Intel, or well, almost exclusively. And the particularly savvy among you are probably wondering how it is that this Z490 project came about before Intel's Z490. Well, this isn't the first time that AMD has pulled this kind of product naming one-upmanship. Back when Intel's X299 chipset was the king of the hill, AMD released their competing Threadripper platform, X399, seemingly to paint Intel into a corner and make it seem like when Intel launched their next gen, that they were copying AMD when actually they were just following their own established pattern and AMD ruined the party. But unconventional naming isn't what gets the product canceled. What does is price. Those PLX chips were seemingly necessary for motherboard manufacturers to market their boards as Z490, and they came at a heavy price. You'd have easily been paying 300 to even $350 for what? An extra drive? How many of you even have more than one M.2 drive today, let alone four plus years ago? Add to that that teams would have needed to do new BIOS engineering and provide long-term support for what would have probably been a low volume product and suddenly the X470 Aorus Gaming 7 that this is based on looks like a much more compelling value at $240 brand new. To be honest then, I don't think we really missed out on anything here. Sure, there are some people out there who would benefit from more PCIe lanes, but 2000 series and 3000 series Ryzen also had Threadripper equivalents that, I mean, by the time you're spending this kind of money on a motherboard, not only had more PCIe lanes, but also more memory bandwidth and the possibility for higher core counts. If only AMD had kept their promise for platform longevity, which you can tell I'm totally over. And besides, AMD already had X570 under development to provide more lanes than the X470 chipset that it replaced. I can see why AMD officially canceled Z490 at Computex in 2018. I mean, X570 came out less than a year later. So all in all, rest in peace, confusingly named chipset, you died before you could live and were forgotten not long after. Just like this segue to our sponsor. Thanks to Micro Center for sponsoring today's video. New year, new me, more like new year, new tech. Start your year off right with a tech upgrade and let Micro Center help you with doing it. With a great variety of products and even better prices, they can be your one-stop shop for all things tech. Laptops, computer components, monitors, TVs, network equipment, you name it, and they have got it. Let their in-house PC building team put together a new custom rig for you that is just as unique as you are. With 25 stores across the US and their crew of knowledgeable staff, they make it easier than ever to find what you are looking for. And if you're having any technical difficulties, they've got your back with their certified technicians at their knowledge bar. So what are you waiting for? Head over to the description box and check out Micro Center today for all of your tech needs. Thanks for checking out this rare motherboard with us. I really love it when we get these kinds of engineering samples or prototypes to mess around with. It can be kind of hit or miss. This one was a hit, but if you wanna see a miss, check out the video that Alex and I did where we looked at a prototype water-cooled laptop.",
    "transcript_keywords": [
        "AMD",
        "Intel",
        "chipset",
        "AMD CPU socket",
        "motherboard",
        "AMD CPU",
        "AMD chipset",
        "Intel chipset board",
        "thing",
        "board",
        "AMD CPUs",
        "gen",
        "time",
        "CPU",
        "engineering",
        "lanes",
        "AMD motherboards",
        "kind",
        "Micro Center",
        "Intel chipset"
    ],
    "transcript_entity_values": [
        "one",
        "year",
        "X299",
        "eight",
        "One",
        "RGB",
        "Reddit",
        "2018",
        "PLX",
        "300",
        "Sabrent Rocket 4 Plus",
        "Threadripper",
        "AMD",
        "2000",
        "three",
        "Ryzen",
        "SLI",
        "YouTube",
        "3,200",
        "New year",
        "Z490",
        "400",
        "B550",
        "first",
        "AMD Promontory",
        "only 2.4 gigahertz",
        "Bixby",
        "First",
        "32",
        "3000",
        "the heyday",
        "Computex",
        "25",
        "2700X",
        "Ryzen",
        "CPU",
        "240",
        "Promontory",
        "2700X",
        "third",
        "Micro Center",
        "Intel",
        "Nexigo",
        "more than one",
        "the mid 2000s",
        "Windows",
        "four",
        "Reddit",
        "12th",
        "four plus years ago",
        "Frankensteined",
        "Alex",
        "118",
        "Threadripper",
        "A320",
        "secondary",
        "ECS",
        "TikTok",
        "less than a year later",
        "M.2",
        "second",
        "PCI Express",
        "as many 16x",
        "Gen 3",
        "Z490",
        "Ryzen 2000",
        "today",
        "fifth",
        "350",
        "Z",
        "RAM",
        "Intel R&D Center",
        "between around 3.9 to 4 gigahertz",
        "Aorus Gaming 7",
        "US",
        "AMD",
        "90",
        "2",
        "USB",
        "a minute",
        "Halo Infinite",
        "IO"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "GPE"
    ],
    "vector": [
        -0.08211082220077515,
        -0.011952294036746025,
        0.07063040882349014,
        0.018442196771502495,
        0.11512245237827301,
        -0.010899067856371403,
        0.03916040062904358,
        0.028944771736860275,
        -0.02901897393167019,
        0.0064520565792918205,
        0.041522447019815445,
        0.0038496176712214947,
        -0.03277533873915672,
        0.003014707937836647,
        -0.0592472217977047,
        0.04329283535480499,
        0.0875408798456192,
        -0.1443566083908081,
        0.015541810542345047,
        0.015130841173231602,
        0.050615232437849045,
        -0.018432719632983208,
        0.01985587365925312,
        -0.03669083118438721,
        0.010761978104710579,
        -0.06631363928318024,
        0.09006829559803009,
        -0.009074573405086994,
        -0.008456425741314888,
        -0.03565266728401184,
        0.0074839601293206215,
        0.08456893265247345,
        -0.006519773509353399,
        0.0250009186565876,
        0.07402835786342621,
        -0.10416478663682938,
        0.10562265664339066,
        -0.044577378779649734,
        -0.019700028002262115,
        -0.07522662729024887,
        0.04121443256735802,
        -0.021004755049943924,
        0.0005348983686417341,
        0.05350518971681595,
        0.03250940144062042,
        0.054342012852430344,
        0.022263653576374054,
        -0.05800142139196396,
        0.04103834554553032,
        -0.07604129612445831,
        -0.027515791356563568,
        -0.06488604843616486,
        -0.03260493278503418,
        -0.03808717429637909,
        -0.08245473355054855,
        0.04337802901864052,
        -0.04138597100973129,
        -0.09904250502586365,
        0.056729648262262344,
        -0.06781118363142014,
        0.06203228235244751,
        -0.05265435203909874,
        0.05537250265479088,
        0.06300513446331024,
        0.0709756389260292,
        -0.0241189394146204,
        -0.012020491063594818,
        0.00997335184365511,
        -0.013200163841247559,
        -0.08241531997919083,
        0.02155657485127449,
        0.028807006776332855,
        0.02028070017695427,
        0.036852821707725525,
        -0.03338991850614548,
        0.057155609130859375,
        0.1073109582066536,
        -0.044704679399728775,
        0.038650963455438614,
        0.00514968391507864,
        -0.040670525282621384,
        -0.00907085556536913,
        0.07071522623300552,
        -0.08473420888185501,
        0.08853497356176376,
        -0.010388700291514397,
        0.019868237897753716,
        0.01949373632669449,
        0.028884118422865868,
        -0.13046883046627045,
        -0.06336576491594315,
        0.009950903244316578,
        0.036250822246074677,
        0.012130359187722206,
        0.009412026032805443,
        0.026512693613767624,
        -0.002483561635017395,
        -0.04157286509871483,
        -0.027416834607720375,
        0.03848071023821831,
        0.001843279111199081,
        0.09219961613416672,
        0.06258697062730789,
        -0.006652039010077715,
        -0.05015633627772331,
        0.01048451941460371,
        -0.08694250136613846,
        0.10574087500572205,
        0.014139872044324875,
        -0.01089587900787592,
        -0.10166187584400177,
        0.04416368901729584,
        -0.06551622599363327,
        0.005681557580828667,
        0.03038499504327774,
        0.014910845085978508,
        -0.03023168444633484,
        0.05182098224759102,
        0.05039740726351738,
        -0.08935593068599701,
        -0.0065710884518921375,
        -0.048721279948949814,
        -0.07964512705802917,
        -0.0071995980106294155,
        0.015345249325037003,
        0.07793262600898743,
        -0.03483026102185249,
        7.564960016274065e-33,
        0.03671891242265701,
        0.09397317469120026,
        -0.04404386878013611,
        0.001916908542625606,
        -0.0012108077062293887,
        0.016336917877197266,
        0.04065326228737831,
        -0.016133621335029602,
        -0.02334675006568432,
        0.047968581318855286,
        -0.09782195836305618,
        -0.1117059662938118,
        -0.05370568856596947,
        0.032750505954027176,
        0.009153944440186024,
        -0.055117346346378326,
        -0.03334078937768936,
        -0.014974670484662056,
        0.05049430951476097,
        0.05388354882597923,
        0.03701602295041084,
        0.054854344576597214,
        0.06542790681123734,
        -0.06646673381328583,
        0.08346447348594666,
        -0.002115233801305294,
        -0.044356148689985275,
        0.00010287419718224555,
        0.06938403844833374,
        -0.01935664936900139,
        -0.04098586365580559,
        -0.03386234864592552,
        0.006544569507241249,
        -0.02486555278301239,
        0.00921209342777729,
        0.0348234660923481,
        -0.023706883192062378,
        -0.11310362070798874,
        -0.028840020298957825,
        -0.03434133902192116,
        -0.03168109059333801,
        0.06559903174638748,
        -0.1019946038722992,
        -0.11062608659267426,
        0.017629753798246384,
        -0.024253984913229942,
        -0.033423829823732376,
        -0.03066313825547695,
        0.005249342881143093,
        0.006283425260335207,
        -0.09973408281803131,
        0.04297438636422157,
        0.031477078795433044,
        -0.02736077643930912,
        0.012634002603590488,
        -0.04890984296798706,
        0.017162222415208817,
        0.012334142811596394,
        0.11376646161079407,
        0.05848407745361328,
        0.012204938568174839,
        -0.1242169439792633,
        -0.03910873457789421,
        0.01272388081997633,
        -0.03776513412594795,
        0.03615110367536545,
        0.05833031237125397,
        0.015129905194044113,
        -0.0625668466091156,
        0.054569534957408905,
        0.0030965430196374655,
        -0.0014232543762773275,
        0.03255171701312065,
        -0.005699199624359608,
        0.027917025610804558,
        -0.004204922821372747,
        -0.08070311695337296,
        -0.033308710902929306,
        -0.05166134238243103,
        -0.07011827826499939,
        0.022899270057678223,
        0.019788948819041252,
        -0.0014528734609484673,
        0.07050354778766632,
        0.030954787507653236,
        -0.020196260884404182,
        0.03372809663414955,
        0.02631535939872265,
        -0.02286914736032486,
        -0.021295715123414993,
        -0.0010561764938756824,
        0.002056732540950179,
        -0.010649791918694973,
        0.06805713474750519,
        -0.018762512132525444,
        -6.508386755504622e-33,
        -0.09161512553691864,
        0.024395477026700974,
        -0.028276389464735985,
        0.0124519569799304,
        -0.045174743980169296,
        -0.040741704404354095,
        0.09321069717407227,
        0.02325105108320713,
        -0.002539434004575014,
        -0.08291331678628922,
        0.06387681514024734,
        0.0009880599100142717,
        0.014474866911768913,
        0.00686970679089427,
        -0.03608258441090584,
        0.02836621180176735,
        0.053061697632074356,
        -0.050782810896635056,
        0.02885482832789421,
        -0.04014305770397186,
        0.10901129245758057,
        0.0677184984087944,
        -0.05369797348976135,
        -0.027650907635688782,
        -0.014530462212860584,
        0.08722011744976044,
        0.04181224852800369,
        -0.008360335603356361,
        -0.007010379806160927,
        -0.012302503921091557,
        -0.04093662649393082,
        0.03148660808801651,
        0.022250818088650703,
        0.04156648367643356,
        0.054604511708021164,
        0.04434342682361603,
        0.0006906231865286827,
        0.027552668005228043,
        0.022991113364696503,
        -0.0398641861975193,
        0.03295246511697769,
        0.13807810842990875,
        0.03390654921531677,
        0.025668269023299217,
        -0.00779164070263505,
        -0.04851112887263298,
        0.006033140700310469,
        -0.037648964673280716,
        0.07526934891939163,
        0.02294875867664814,
        -0.0620894692838192,
        -0.09548619389533997,
        0.058178387582302094,
        0.025684287771582603,
        0.008574212901294231,
        -0.020207777619361877,
        0.03832240775227547,
        0.029164353385567665,
        -0.012551180087029934,
        -0.05961025878787041,
        0.0819811224937439,
        0.03983156755566597,
        -0.029292013496160507,
        -0.07188399136066437,
        0.027505723759531975,
        -0.03885957971215248,
        0.08957492560148239,
        0.03880036622285843,
        -0.04738472402095795,
        -0.035441432148218155,
        -0.04472851753234863,
        0.025689417496323586,
        -0.029612332582473755,
        -0.09341777861118317,
        0.007051675580441952,
        -0.005789285060018301,
        -0.006520112510770559,
        0.051917511969804764,
        0.02812441810965538,
        -0.031629618257284164,
        -0.04115143418312073,
        -0.057544004172086716,
        0.030330810695886612,
        0.030788127332925797,
        0.08363184332847595,
        -0.0044364118948578835,
        0.05092428997159004,
        0.009441932663321495,
        0.03712906688451767,
        -0.10078179836273193,
        -0.07596256583929062,
        -0.015945114195346832,
        -0.0701884925365448,
        0.06849747151136398,
        -0.011495091952383518,
        -6.00784275661681e-08,
        0.017781732603907585,
        -0.05684809014201164,
        0.004097402561455965,
        0.001001832541078329,
        0.05703302100300789,
        -0.10853695869445801,
        0.030833397060632706,
        -0.049264997243881226,
        0.009450944140553474,
        -0.040387555956840515,
        0.039610132575035095,
        -0.039874158799648285,
        -0.06554701924324036,
        -0.015922755002975464,
        0.04493875801563263,
        0.031543612480163574,
        -0.12144841998815536,
        0.10173974186182022,
        -0.01281762309372425,
        -0.08448450267314911,
        0.004066296387463808,
        -0.008537638932466507,
        0.04981449991464615,
        -0.0038023022934794426,
        0.028162186965346336,
        0.03180466964840889,
        -0.0278074499219656,
        0.035754211246967316,
        0.11802539229393005,
        -0.03255784884095192,
        -0.09587858617305756,
        -0.016615455970168114,
        0.09814632683992386,
        -0.019764931872487068,
        0.0320950523018837,
        -0.022083083167672157,
        -0.0069278269074857235,
        0.058475472033023834,
        0.10076385736465454,
        -0.00285084405913949,
        -0.025687741115689278,
        -0.072459377348423,
        0.05909706652164459,
        -0.005487596150487661,
        0.03994426131248474,
        0.006959306541830301,
        -0.07395999878644943,
        -0.07024464011192322,
        -0.024208029732108116,
        0.04959162324666977,
        -0.04631148651242256,
        -0.04263622686266899,
        -0.00999236386269331,
        0.013140843249857426,
        -0.009106136858463287,
        -0.007690278813242912,
        0.004379059188067913,
        0.03941483795642853,
        0.024565575644373894,
        0.034180328249931335,
        0.05866331234574318,
        -0.07816348969936371,
        -0.07001980394124985,
        0.06759326905012131
    ]
}