{
    "id": "K2IOZ-5Nk5k",
    "title": "What is a Bump Stock? Should it be illegal?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-11-15T14:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=K2IOZ-5Nk5k",
    "category": "Howto & Style",
    "tags": [
        "Bump Stock",
        "Bumpstock",
        "Bump-stock",
        "slidefire",
        "bump fire",
        "AR-15",
        "assult rifle",
        "Illegal",
        "legal",
        "guns",
        "hobby",
        "firearm",
        "What is a bump stock",
        "how does a bump stock work",
        "bump stock legal",
        "ban bump stock",
        "gun stock",
        "bumpfire stock",
        "bump stock legislation"
    ],
    "views": 10039763,
    "likes": 264930,
    "comments_count": 57018,
    "description": "How does a bump stock work? This video will demonstrate how a bumpstock works when attached to a Semi-Automatic AR-15. This has been in the news quite a bit lately as the United States government holds hearings on whether this gun accessory should be banned.   This video shows how a Bump Stock works, and what it can accomplish while attached to an AR-15.   It is currently illegal for private United states citizens to own a fully automatic firearm. (As of 1986) BUT bump stocks are only an accessory to a rifle, and don't actually alter the gun to fire automatically. So they are totally legal as of the posting of this video, anyone can buy one, and anyone can shoot with one.   The question is: Should it stay legal? or should this accessory be regulated?   Would you like to see more videos like this in the future?   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad",
    "description_links": [
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "So today's video is going to be a little different and slightly more serious. There have been a lot of talk in the news lately about something called a bump stock. Now where I live in Utah, shooting guns is a fairly recreational activity. I would say Texas, Utah, and Idaho have plenty of guns distributed between the general population. And it's kind of like a hobby thing. People go out to shoot guns and it's even a great date idea. And I've owned plenty of guns in my life, and my family, and it's just kind of like part of the custom and part of the culture. But lately there's been something in the news called a bump stock and how it attaches to a semi-automatic rifle. Now, I've never used a bump stock before, but I am curious as to how easy it is to install, what it's made of, and what it can actually do. So yesterday I went out and bought an AR-15. This particular setup is about $1,500. I walked into a local sports store and picked out the gun I wanted. They did a background check and I walked out of there. So the thing about an AR-15 is that it's pretty customize-able. You can swap out the barrels, you can swap out the lowers. You can put scopes on the rails. You can swap out the back stock. And this stock part is what we're going to be talking about today because the bump stock replaces the handle of the gun and the stock of the gun and allows you to fire at an automatic rate with a semi-automatic weapon. I'll explain what those mean in a second. So while I'm pretty familiar with guns, I am not a gun expert by any means. I literally just bought this gun yesterday and this video is purely to just see what a bump stock is capable of doing. After major tragedies like the one in Las Vegas or the one in Texas, people call for stricter legislation on guns in general, and in particular, these bump stocks. But only by learning about them and knowing what they're capable of can we make the most educated decision. I was able to purchase a bump stock of my own. These are available online from multiple websites and local classifieds. This one cost me about $400. So we're going to install it on the AR-15 right now and see what it can do. So right now we're going to shoot this several times. Right now the bump stock is not in place and we're going to see how many rounds we can get off without the help of a bump stock. So this gun is semi-automatic, so every time I pull the trigger there's going to be a bullet leaving out the end of the chamber. So I'm going to cock back the gun. That puts a bullet into the chamber. The safety is now off and I'm ready to fire. [Shooting sounds] That was relatively quick. So this is a 40 round clip and so every time I pull the trigger 40 times, I can lose all the ammo inside of that clip, and that was pretty fast. You can get a lot of shots off in a pretty short amount of time. So now let's install the bump stock, and as a newb, I've never shot with a bump stock before. We'll see if it's possible to shoot faster than it is with just a straight trigger. So how the bump stock works is actually incredibly simple. The gun slides around inside of the stock and uses the recoil of the gun to shoot more bullets. This piece is pretty important. I'm a right-handed shooter so I use my right hand to pull the trigger. And so I'm going to take this piece of plastic, slide it onto the gun, and it blocks the trigger on one side. So when I grab the gun, I rest my finger on that piece of plastic on the far side. And then using the gun, I can pull forward with this hand, my finger connects with the trigger, pulls it, and then the gun will bounce back and forth. And each time it hits my finger, it will shoot another round. And since the gun is doing it all automatically, it can pull the trigger faster than I can pull the trigger. Hence the full auto function of the bump stock. So these are the bullets right here. We have a five five six and it's just a whole box of these things. These things are about 40 cents a piece. So I also got these clips. These clips hold 40 rounds. They are about $20 each, and I can take little bullets and just pop them into the top. And then the whole clip just slides into the gun when you're ready to shoot. This is my first time shooting with the bump stock so we'll see how it goes. I got the clip in place. The stock is functional. Safety is off. We're loaded, and let's see how this works. [Shooting sounds] Okay, that was faster than I expected. [Shooting sounds] So that shot much faster than I anticipated, obviously. And each time I shoot one of these clips by the way, it's about 16 American dollars 16 US dollars. So it's a lot of ammo going very very quickly. What we're going to do right now is I'm going to do it one more time, but this time we're going to shoot it in slow motion using a Galaxy S8, and you can pay attention to the stock and the trigger and watch how the gun is recoiling inside of the bump stock so we can get a better idea of how it works. So watch here as my hand pulls forward on the barrel of the gun. This brings the trigger up to my stationary trigger finger. My finger never moves, but still connects with the trigger due to the forward motion of the gun. The gunman fires and the recoil brings the gun back to my stationary finger over and over, causing the trigger to be pulled again and again very quickly, until I run out of ammo. Accuracy is severely compromised, but accuracy isn't really the point of full auto. Here's the semi-auto firing rate one more time. [Shooting sounds] My finger was pulling the trigger manually. And here it is again with the currently fully legal bump stock installed on the AR-15. [Shooting sounds] I'll be pretty honest. I'm pretty blown away with how well the bump stock works and how much ammo it can throw out of the gun as fast as it did. I was not expecting that. Now as far as all the controversy goes, I'm not going to jump into that on this channel. Personally, I think that guns are a great hobby, but not everyone in the world is sane and they can turn something good and fun into something absolutely terrible not just with guns, but with cars, vehicles, anything can be turned into something bad. Like always, you're welcome to comment about this stuff in the comment sections right below this video, but make sure to keep it a conversation and not an argument. Let's keep in constructive and productive. So even though this video was quite a bit different then what I usually do on this channel, I think it was interesting and useful. Knowledge is power and now we know what bump stocks are capable of and what they can do. And we can make more educated decisions on whether they should be banned or just kept in existence. Let me know what you think down in the comments, and keep it constructive and not destructive. We're here for the conversation. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "bump stock",
        "stock",
        "gun",
        "bump",
        "trigger",
        "guns",
        "bump stock works",
        "time",
        "shoot",
        "pretty",
        "finger",
        "pull",
        "pull the trigger",
        "stock works",
        "Utah",
        "bump stock replaces",
        "clip",
        "stocks",
        "legal bump stock",
        "bump stock installed"
    ],
    "transcript_entity_values": [
        "Las Vegas",
        "about $20",
        "about 16 American dollars 16 US dollars",
        "today",
        "Idaho",
        "AR-15",
        "first",
        "40",
        "about $1,500",
        "about $400",
        "five",
        "Utah",
        "one",
        "Texas",
        "second",
        "about 40 cents",
        "classifieds",
        "yesterday"
    ],
    "transcript_entity_types": [
        "GPE",
        "MONEY",
        "MONEY",
        "DATE",
        "GPE",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "MONEY",
        "GPE",
        "DATE"
    ],
    "vector": [
        -0.07703209668397903,
        0.014965519309043884,
        -0.05429181084036827,
        -0.0827505886554718,
        0.02308235503733158,
        0.03222903981804848,
        0.059381961822509766,
        0.018732279539108276,
        -0.04144473746418953,
        0.049859512597322464,
        0.086953304708004,
        0.13120004534721375,
        -0.006872980855405331,
        0.015974102541804314,
        0.01472639199346304,
        -0.010929281823337078,
        0.050356425344944,
        -0.017159990966320038,
        -0.01926889829337597,
        0.07063373178243637,
        -0.032287340611219406,
        -0.033752188086509705,
        0.05084303393959999,
        0.0826294869184494,
        -0.04478594288229942,
        -0.03756481409072876,
        0.022146636620163918,
        0.06859872490167618,
        -0.07056377083063126,
        -0.0974833220243454,
        0.023154428228735924,
        -0.043474432080984116,
        -0.026020994409918785,
        0.018637951463460922,
        0.019246166571974754,
        -0.0626952052116394,
        0.03761300817131996,
        0.016737472265958786,
        -0.03073297254741192,
        0.05678758770227432,
        0.08939781039953232,
        -0.0603913739323616,
        -0.02349235489964485,
        0.0001339759473921731,
        0.03778919577598572,
        0.009174355305731297,
        -0.003611041931435466,
        -0.03341805562376976,
        0.0026193810626864433,
        -0.03432643041014671,
        -0.040567006915807724,
        -0.006900311913341284,
        0.05388704314827919,
        -0.0002119286364177242,
        -0.04069016873836517,
        -0.08266481012105942,
        -0.04426820948719978,
        0.006788096856325865,
        0.015551884658634663,
        -0.04568205773830414,
        0.06104256957769394,
        -0.05276015028357506,
        0.012577779591083527,
        -0.04106227308511734,
        -0.00183235970325768,
        -0.012952708639204502,
        -0.0020605213940143585,
        -0.09154309332370758,
        0.018072908744215965,
        -0.011332405731081963,
        -0.018928058445453644,
        0.039813082665205,
        -0.06936492025852203,
        0.04484536871314049,
        -0.10449332743883133,
        -0.007128233555704355,
        0.05301812291145325,
        0.0999859869480133,
        0.0813041552901268,
        -0.048138510435819626,
        0.03189431130886078,
        -0.027901284396648407,
        0.07535737752914429,
        -0.12742818892002106,
        -0.00635104114189744,
        0.08205442130565643,
        -0.05848334729671478,
        0.0853835940361023,
        -0.016591062769293785,
        0.010981316678225994,
        -0.031721100211143494,
        -0.0021924760658293962,
        0.048742689192295074,
        -0.0023922112304717302,
        0.03011232055723667,
        -0.008532902225852013,
        -0.00944470800459385,
        -0.042431291192770004,
        -0.04074374586343765,
        0.027073917910456657,
        0.06721705198287964,
        -0.0034695137292146683,
        0.01630706526339054,
        0.0454031303524971,
        -0.0231154877692461,
        0.022201165556907654,
        -0.03716317564249039,
        0.019228653982281685,
        -0.004821940325200558,
        -0.04747004806995392,
        0.007303834427148104,
        0.08219704777002335,
        -0.024994099512696266,
        -0.06844395399093628,
        -0.048051249235868454,
        0.07089909166097641,
        -0.0799156129360199,
        -0.02030901238322258,
        -0.014648603275418282,
        -0.09279094636440277,
        0.012494269758462906,
        -0.02155088260769844,
        0.051668696105480194,
        -0.01790657639503479,
        0.02977476641535759,
        -0.04433554783463478,
        -0.09621375799179077,
        -5.2789674278578275e-34,
        0.005036511458456516,
        0.09514330327510834,
        -0.03868865221738815,
        -0.0026942910626530647,
        -0.021080382168293,
        -0.06939993053674698,
        0.03294641524553299,
        0.03709813952445984,
        -0.06949271261692047,
        0.04571745544672012,
        0.034872520714998245,
        -0.01613161712884903,
        -0.014274854212999344,
        0.037376757711172104,
        0.05716322362422943,
        -0.07450159639120102,
        -0.00491713359951973,
        0.02397395297884941,
        0.032102517783641815,
        -0.024575848132371902,
        -0.02606748603284359,
        -0.022366760298609734,
        -0.07447442412376404,
        0.016752468422055244,
        -0.06405988335609436,
        0.04390436038374901,
        0.0005357181653380394,
        0.04345936328172684,
        0.07310179620981216,
        0.042632926255464554,
        -0.030787000432610512,
        0.100159652531147,
        0.008280640468001366,
        -0.021572677418589592,
        0.04152810201048851,
        -0.104827381670475,
        -0.07827029377222061,
        -0.06474565714597702,
        -0.06080952659249306,
        -2.5077006284845993e-05,
        0.11118375509977341,
        4.7272489609895274e-05,
        -0.031932637095451355,
        -0.021095018833875656,
        0.0028281027916818857,
        0.0555439293384552,
        -0.0019579946529120207,
        0.0024718327913433313,
        -0.049796540290117264,
        -0.024798179045319557,
        0.057478226721286774,
        0.035048890858888626,
        0.01602988876402378,
        -0.04788246750831604,
        -0.04649864137172699,
        0.03011692687869072,
        -0.0686735212802887,
        -0.057151418179273605,
        0.03895476087927818,
        -0.031733497977256775,
        0.045704375952482224,
        0.0264670941978693,
        0.020962942391633987,
        0.02745147980749607,
        -0.16532546281814575,
        0.047520074993371964,
        0.09282708168029785,
        0.07801308482885361,
        -0.025107702240347862,
        0.1304466873407364,
        0.08472693711519241,
        0.07089502364397049,
        -0.08401269465684891,
        -0.028519174084067345,
        0.017713766545057297,
        -0.01585003174841404,
        -0.01136664766818285,
        0.04285600781440735,
        0.09628979116678238,
        -0.02195023000240326,
        -0.004949059337377548,
        -0.07469911128282547,
        0.051519859582185745,
        0.04634071886539459,
        -0.03999004140496254,
        -0.05178992077708244,
        0.009530898183584213,
        0.015964148566126823,
        0.028797440230846405,
        0.044767435640096664,
        -0.009686892852187157,
        0.002637020079419017,
        -0.05713550001382828,
        0.02152029052376747,
        0.045062240213155746,
        -1.1626409629445189e-33,
        0.05751505121588707,
        0.015804899856448174,
        -0.09205689281225204,
        0.019333763048052788,
        -0.04686632379889488,
        -0.023131057620048523,
        0.054977674037218094,
        0.008322610519826412,
        0.03510821610689163,
        -0.02346249297261238,
        -0.023429730907082558,
        -0.002101768273860216,
        -0.05424089357256889,
        0.04135947301983833,
        0.04744508117437363,
        -0.06628941744565964,
        -0.08276358246803284,
        -0.04408501461148262,
        -0.010501578450202942,
        -0.02577885054051876,
        0.05783247947692871,
        -0.05324423685669899,
        0.021938471123576164,
        0.03835536167025566,
        -0.009738975204527378,
        0.03168707340955734,
        -0.08233365416526794,
        0.005071681458503008,
        0.018318958580493927,
        -0.00486342515796423,
        0.04187426716089249,
        -0.029166951775550842,
        -0.020536284893751144,
        0.002599032362923026,
        -0.08691033720970154,
        -0.02246045134961605,
        0.034617066383361816,
        -0.028683297336101532,
        0.026522589847445488,
        -0.15201079845428467,
        0.029314855113625526,
        0.06942968815565109,
        0.012389188632369041,
        0.03161953017115593,
        -0.040752314031124115,
        -0.024151500314474106,
        0.07257889211177826,
        0.0052052889950573444,
        0.020140746608376503,
        -0.008874885737895966,
        -0.0724480077624321,
        0.01071290485560894,
        0.09601490944623947,
        0.06330374628305435,
        -0.0899379774928093,
        0.021332332864403725,
        0.03583965823054314,
        0.0014455558266490698,
        -0.001512859482318163,
        0.07043429464101791,
        0.06245427206158638,
        0.0026925047859549522,
        -0.08914992958307266,
        -0.07118504494428635,
        -0.0006922914762981236,
        -0.060126349329948425,
        -0.04139203578233719,
        -0.05134401097893715,
        -0.05740886554121971,
        -0.008013686165213585,
        0.10329531878232956,
        -0.07255242019891739,
        0.0630553662776947,
        0.03782087564468384,
        -0.015348448418080807,
        0.023277299478650093,
        0.1144271045923233,
        -0.02838917449116707,
        0.04450906813144684,
        -0.019127333536744118,
        -0.00026555531076155603,
        -0.06908029317855835,
        -0.03465942293405533,
        0.048569947481155396,
        -0.037221502512693405,
        0.03894805908203125,
        -0.026100218296051025,
        -0.0032509174197912216,
        -0.058151815086603165,
        0.01448545791208744,
        -0.032023899257183075,
        -0.0004096384800504893,
        -0.05662480741739273,
        0.10744272917509079,
        -0.054513197392225266,
        -4.745390214111467e-08,
        -0.019004981964826584,
        0.060399286448955536,
        -0.04250391945242882,
        -0.027745826169848442,
        -0.03813992068171501,
        0.026755591854453087,
        0.039554182440042496,
        -0.062242764979600906,
        0.07894889265298843,
        -0.059688590466976166,
        -0.0011918849777430296,
        -0.06948293745517731,
        -0.05075246840715408,
        0.03431053087115288,
        -0.06251343339681625,
        0.021706154569983482,
        -0.012990327551960945,
        0.05341149494051933,
        -0.024126896634697914,
        0.05912395939230919,
        -0.04949147254228592,
        0.04336630553007126,
        0.0938766598701477,
        -0.010445971041917801,
        -0.0827053114771843,
        0.04269721731543541,
        -0.030215829610824585,
        0.03481300175189972,
        0.07531992346048355,
        0.10657255351543427,
        -0.04443025961518288,
        0.023248570039868355,
        0.0314512625336647,
        0.06690932810306549,
        -0.037046320736408234,
        -0.008217818103730679,
        -0.06007569655776024,
        0.020680449903011322,
        0.07514014095067978,
        -0.0002200681046815589,
        0.008099501021206379,
        -0.051378633826971054,
        0.00957887526601553,
        -0.01310618408024311,
        -0.030682912096381187,
        0.02573852799832821,
        -0.07534284144639969,
        -0.09859941899776459,
        -0.07093752175569534,
        0.06445644795894623,
        -0.01863182708621025,
        -0.07267376780509949,
        -0.0020262280013412237,
        0.08287224918603897,
        0.014075963757932186,
        0.06410279870033264,
        0.04858360067009926,
        -0.05259263142943382,
        0.023329608142375946,
        0.013736979104578495,
        0.07283148914575577,
        -0.10451047867536545,
        0.042668022215366364,
        0.08314196020364761
    ]
}