{
    "id": "K2MrpXKZ2ow",
    "title": "A Phone you can SHAVE with?! - Durability Test",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-08-06T13:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=K2MrpXKZ2ow",
    "category": "Howto & Style",
    "tags": [
        "Shaver phone",
        "Phone shaver",
        "razer phone",
        "shave with phone",
        "cool phone",
        "tech",
        "technology",
        "teardown",
        "How does a shaver work",
        "cell phone shaver",
        "awesome phone",
        "best phone",
        "iphone",
        "android",
        "smart phone",
        "mobile phone",
        "review",
        "shaver phone review",
        "unboxing",
        "hands on",
        "durability test"
    ],
    "views": 1624621,
    "likes": 38674,
    "comments_count": 2993,
    "description": "The Craziest Phone in the world! You can SHAVE WITH IT!! If you need a real razor though jump on the Dollar Shave Club $5 Deal HERE:  (Shipping is FREE!!) Huge thanks to Dollar Shave Club for Sponsoring this teardown.  Would you ever buy this shaver phone? Its kinda bulky... BUT having a shaver on hand would be kinda nice. Especially while traveling. The dual sim card makes going between countries easy. Here is the Shaver phone:   If you have ever wondered how a shaver works, this is the video for you. I will teardown the shaver phone and show how the little motors remove hair from your skin. Its actually really cool inside. The big battery, and singular motor inside the shaver phone can accomplish a lot!   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.dollarshaveclub.com/jerryrig",
        "https://ebay.to/2OLsNH6",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So we got a weird one today...a little something I saw over on Unbox Therapy channel a while back. It has to be one of the strangest phones I've ever seen, but surprisingly only costed me $35 on eBay. A self-proclaimed dust-proof, shockproof, waterproof, and rugged, dual SIM card cellphone, with, get this, a built-in shaver. Yeah. Like the kind of shaver you would shave your face with. In the box it even has one of those little bristle cleaners for the foil head. I'll be testing all of these features, if it ever turns on, side-by-side with a normal razor blade from Dollar Shave Club, who's sponsoring this video, all in the name of science of course. Let's get started. [Intro] Turns out that the phone wasn't dead out of the box. The phone has a massive old-school removable 3800 milliamp hour battery that has some tape over the battery contacts. And once I got that tape off everything started working. We do durability tests here on my channel to make sure... [ Weird song starts playing from phone] ...to... make sure the manufacturers are giving us quality durable products. And that includes this Frankenstein monstrosity of a cellphone shaver. Let's see what this thing is made from, starting with the screen. I have a set of Mohs picks that visibly show us what the screen is made from. Glass is a level 6. A diamond screen would be a level 10. But since this unique machine is only $30 on eBay, the screen is plastic, scratching at a level 3 with deeper grooves at a level 4. It does have the brightest flashlight I've ever seen on a phone though. So if you've ever wanted to call your grandma while shaving in the dark, this phone is for you. The front buttons are painted plastic kind of what we would expect to find on the lower end of the quality scale. A higher end plastic button example would be the embedded buttons on the Nintendo Switch. We aren't just here for the buttons though. Let's shave the shaver. The side buttons are made from plastic. It seems to be a reoccurring theme throughout this phone. The back panel is also made from plastic. The center logo thing has more of a clear rubber over the top. The flashlight on the top of the phone has a plastic lens which is fine and normal. The camera lens though is also plastic. It's a bold move. That little piece of plastic is protecting all .3 megapixels of the camera, so it's pretty safe to say that quality pictures were not the first priority on this flashlight shaver that happens to make phone calls. The little flap doohickey down at the bottom protects the micro USB and regular sized USB slot, and hasn't stayed shut since I unboxed this thing. So I think that waterproof claim is completely bogus. It will be nice to use that full-sized USB slot to charge up some other accessories though. It's interesting that the dedicated shaver switch on the side doesn't have a safety lock. I imagine this shaver randomly going off in your pocket is going to be a real issue...still more useful than Bixby though. Let's give this thing a shot at shaving. You might be thinking to yourself, why is this grown man shaving his arm with a cellphone, and you're right. This is an incredibly weird situation. I think maybe we should just clear your search history and not talk about this again. But if I'm being completely honest, this is the best shave I've ever gotten with a cellphone. 10 out of 10. I'm legitimately surprised it even works. Fair is fair though. Let's see what an actual razor can do. Dollar Shave Club has this starter box they send out for $5 with free shipping. It has all kinds of goodies. They even have stuff like toothpaste and hair styling products, for those of you who have hair, that you can add into the kit later. Not just razors. And the best part is there are zero contracts, so if being clean is not your thing, you can quit whenever you want. Not a bad deal at all for just $5. Replacement blades are sent for just a few dollars a month after the first batch and I'll leave a link in the description. The razor is just as, if not more, efficient than the shaver phone. And it won't awkwardly go off in your pocket. Grab your own $5 kit with a link in the description, or head to dollarshaveclub.com/JerryRig. It's pretty easy. Thanks to Dollar Shave Club for sponsoring this video. Let's finish off the durability test and see how this shaver phone works from the inside. One of the biggest flaws in this phone is the lack of games. There is no Snake game, which is kind of a deal breaker for me. The 2.6 inch screen is covered by that thick layer of plastic so the heat from my lighter doesn't penetrate down into the display below. But we can see it melting the outer plastic. It did last about 18 seconds before turning into a molten mess. Which is good to know if you happen to be shaving outside by a campfire. Structurally, if it looks like a brick and feels like a brick, there's a good chance it's actually a brick. And that is indeed the case with this random conglomerate of gadgets. The shaver phone is surprisingly sturdy. I still have massive doubts about the waterproof claims though, since there is no actual IP rating and the back panel and bottom flap keep opening up on their own. So maybe don't get this thing wet while shaving...you might lose your $30 investment. I vote we open it up and see how the shaver operates from the inside. It's actually rather simple with 2 screws holding the bottom together, 4 invisible screws holding together each of the golden metal side rails, and 2 more Phillips head screws up at the top. There's one last tiny little guy guarding the battery housing, and then the whole phone can start to open. The problem with opening up this phone is that the screen is semi clipped into the front housing, and since there are no Lego connections holding the screen to the motherboard, I shredded all the soldered ribbon cable between the two. Kind of like how we saw on the World's Smallest Cellphone, except for I didn't break that one. The motherboard has the silver grounding tape all over it, but once that gets peeled back we get our first look at the circular vibration motor and the even bigger loudspeaker sub-woofer thing. Remember that catchy little jingle that played when I turned the phone on? [Weird song playing from phone.] This speaker is probably the biggest speaker I've even seen inside of a cellphone. The shaver motor, which is quite a bit bigger than the Nex S front camera motor, is soldered directly onto the main board. No Lego connectors anywhere inside of this phone, but there is an aluminum heat sink on the back of the LED flashlight diode. The thing is so powerful and bright that it needs it's own mini heat dissipation system, which is actually super cool. Thumbs up for that. Let's see how the shaver portion works. The top metal circular foils pop off allowing the insides to be clean. But under those triangle pins is another trap door with massive white circular gears. The big motor inside spins it's singular gear, which in turn rotates the two larger gears attached to the bottom of each of those triangular silver posts. Which then rotates the shaving mechanism underneath the circular metal foils. Pretty brilliant. We can snag a closer look at the under side of those foils. You can see that the gaps in the foil are just big enough to let hair through, but not big enough that the little metal twisty bits can snag on your skin. The same basic principle applies to all shavers, it's just super interesting to see it here on a cellphone. I would put the whole thing back together again, but somebody accidentally ripped the screen off and destroyed the ribbons. So it's kind of incapacitated at the moment. Still a super interesting phone though. Grab your own $5 shaving kit from Dollar Shave Club using my code and link in the description. With free shipping, it's cheaper than even your local grocery store. Would you ever use a phone like this? Let me know down in the comments, and then come hang out with me on Twitter and Instagram. Thanks a ton for watching. I will see you around. [Phone playing weird song... again]",
    "transcript_keywords": [
        "Unbox Therapy channel",
        "Unbox Therapy",
        "Dollar Shave Club",
        "phone",
        "shaver",
        "Shave Club",
        "shaver phone",
        "Dollar Shave",
        "plastic",
        "Therapy channel",
        "shave",
        "thing",
        "screen",
        "cellphone",
        "shaving",
        "Unbox",
        "Therapy",
        "back",
        "shaver phone works",
        "Club"
    ],
    "transcript_entity_values": [
        "only $30",
        "last about 18 seconds",
        "Nex",
        "30",
        "Lego",
        "Instagram",
        "35",
        "eBay",
        "3800 milliamp hour",
        "Fair",
        "two",
        "Glass",
        "just $5",
        "Unbox Therapy",
        "6",
        "Frankenstein",
        "the Nintendo Switch",
        "just a few dollars",
        "Twitter",
        "4",
        "Phillips",
        "zero",
        "Dollar Shave Club",
        "10",
        "first",
        "5",
        "today",
        "2.6 inch",
        "3",
        "Bixby",
        "One",
        "USB",
        "Mohs",
        "one",
        "IP",
        "2"
    ],
    "transcript_entity_types": [
        "MONEY",
        "TIME",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09884438663721085,
        0.07044254243373871,
        0.07397326827049255,
        -0.03333795443177223,
        -0.006060371641069651,
        -0.08432980626821518,
        0.05645321309566498,
        0.03169325366616249,
        -0.03260362148284912,
        0.09245713800191879,
        0.12874606251716614,
        -0.03309657424688339,
        -0.015430532395839691,
        0.08503496646881104,
        0.042026083916425705,
        -0.04275783151388168,
        0.032214969396591187,
        0.01119045540690422,
        -0.04153973609209061,
        0.08228064328432083,
        0.055170197039842606,
        0.01865352876484394,
        -0.003848482621833682,
        -0.03190740942955017,
        0.015615702606737614,
        -0.02171802893280983,
        -0.035067636519670486,
        0.0011556103127077222,
        -0.06637032330036163,
        -0.05989260599017143,
        0.09852654486894608,
        0.05715130269527435,
        -0.04726240411400795,
        -0.039720188826322556,
        0.03197561576962471,
        -0.08176343142986298,
        0.03217072784900665,
        0.06486032903194427,
        -0.006919792853295803,
        -0.018570218235254288,
        -0.05236963555216789,
        0.010491989552974701,
        0.05710490420460701,
        -0.05507640540599823,
        0.027495238929986954,
        -0.08070880174636841,
        0.05793792009353638,
        -0.005353286862373352,
        0.004021578934043646,
        0.024937866255640984,
        -0.027041904628276825,
        -0.07100357860326767,
        0.010395870544016361,
        -0.0060410634614527225,
        -0.05774342641234398,
        0.03351296856999397,
        -0.031465284526348114,
        0.0017833103192970157,
        0.002044333377853036,
        -0.01951058767735958,
        0.02649248018860817,
        -0.008729815483093262,
        -0.022651391103863716,
        0.04896950349211693,
        -0.011812837794423103,
        -0.025983525440096855,
        0.010826447047293186,
        -0.11058228462934494,
        -0.025273645296692848,
        -0.019395094364881516,
        -0.11367333680391312,
        -0.020532777532935143,
        -0.04047400876879692,
        0.02471138909459114,
        -0.05212978646159172,
        0.041638173162937164,
        0.05846112594008446,
        0.038979675620794296,
        -0.006206114310771227,
        0.09932630509138107,
        0.023411821573972702,
        -0.05532784387469292,
        0.03322821855545044,
        -0.007188575807958841,
        0.03880112245678902,
        0.03357870876789093,
        0.02469690330326557,
        0.0451791025698185,
        -0.07446479797363281,
        -0.05211794748902321,
        0.004023638553917408,
        0.11919119954109192,
        -0.028628263622522354,
        -0.024476757273077965,
        -0.00274520181119442,
        -0.04669564589858055,
        -0.08616558462381363,
        0.04691985994577408,
        -0.036744583398103714,
        0.033543363213539124,
        -0.00675415201112628,
        -0.06622783094644547,
        -0.009062067605555058,
        -0.020000385120511055,
        -0.027888383716344833,
        -0.02652493305504322,
        -0.09102043509483337,
        -0.016307678073644638,
        0.06810615211725235,
        -0.021944576874375343,
        -0.06190921366214752,
        -0.0052289231680333614,
        -0.0911414697766304,
        -0.04140627756714821,
        0.01103541161864996,
        -0.04703770577907562,
        0.033016279339790344,
        0.008940886706113815,
        0.15708936750888824,
        0.0012158167082816362,
        -0.015373734757304192,
        -0.026474962010979652,
        -0.04984627291560173,
        -0.04668348655104637,
        0.0639152005314827,
        0.0034574666060507298,
        0.03544033318758011,
        2.8540185502049335e-33,
        0.04255783557891846,
        0.13363823294639587,
        0.05371621996164322,
        -0.02346406690776348,
        -0.017769068479537964,
        0.036049213260412216,
        0.0017868243157863617,
        0.012052427977323532,
        -0.08029642701148987,
        -0.012435291893780231,
        -0.003623646218329668,
        0.03358442336320877,
        -0.0021585323847830296,
        0.014315922744572163,
        0.08013968914747238,
        -0.034080564975738525,
        0.002034015255048871,
        -0.09459765255451202,
        0.008462279103696346,
        -0.04211016371846199,
        0.012112555094063282,
        0.022728074342012405,
        0.011609004810452461,
        0.07420603185892105,
        0.08132936805486679,
        0.04330021142959595,
        0.04709380492568016,
        -0.09940110892057419,
        0.062109824270009995,
        0.04951213300228119,
        -0.09226283431053162,
        -0.01334389764815569,
        -0.002073094714432955,
        0.003771089483052492,
        -0.040507860481739044,
        0.08695850521326065,
        -0.006674903444945812,
        -0.08930020779371262,
        -0.03904013708233833,
        -0.011269154958426952,
        -0.05058826506137848,
        0.026759445667266846,
        -0.018171658739447594,
        -0.00595425209030509,
        -0.01089526992291212,
        -0.009810526855289936,
        -0.08268587291240692,
        0.052192844450473785,
        -0.06414727121591568,
        0.02682005800306797,
        0.0023591904900968075,
        -0.05517959967255592,
        0.03262849897146225,
        -0.001999040599912405,
        -0.08934885263442993,
        0.02327641472220421,
        0.009364315308630466,
        -0.07057539373636246,
        -0.010569924488663673,
        0.041310012340545654,
        0.0212184339761734,
        -0.03236106410622597,
        -0.06609413772821426,
        -0.007851479575037956,
        -0.07120519131422043,
        -0.02943756803870201,
        0.028537875041365623,
        0.01602005399763584,
        -0.021462788805365562,
        0.07387259602546692,
        -0.023992933332920074,
        0.05450614169239998,
        0.04342936724424362,
        -0.05596545711159706,
        0.02158936858177185,
        0.04994942247867584,
        -0.026396194472908974,
        -0.04471011832356453,
        -0.038651399314403534,
        0.05228131264448166,
        -0.047045573592185974,
        0.06902605295181274,
        0.02529689110815525,
        -0.040958911180496216,
        0.04933132231235504,
        -0.06599421799182892,
        0.0030104585457593203,
        -0.046264808624982834,
        0.037733111530542374,
        -0.014339856803417206,
        -0.018943440169095993,
        -0.06228439509868622,
        0.004070566967129707,
        0.023921500891447067,
        -0.005591908935457468,
        -4.9140376862034446e-33,
        0.04593535140156746,
        -0.03499792143702507,
        0.040548622608184814,
        0.06129886209964752,
        0.011645445600152016,
        0.007583598140627146,
        0.11928056180477142,
        0.06715261936187744,
        -0.039921876043081284,
        -0.1160653755068779,
        -0.02822399139404297,
        0.004178987350314856,
        0.07667543739080429,
        0.020061058923602104,
        0.021207567304372787,
        -0.035634156316518784,
        -0.019711798056960106,
        -0.11498594284057617,
        0.023588877171278,
        0.03634098172187805,
        0.02596997655928135,
        0.0197732113301754,
        0.08883196115493774,
        0.0561489462852478,
        -0.09511544555425644,
        -0.012550433166325092,
        -0.025795096531510353,
        -0.09027136862277985,
        0.07988075166940689,
        0.005493689328432083,
        -0.057114046066999435,
        -0.014736426994204521,
        0.07800699770450592,
        0.04433499276638031,
        -0.02883606031537056,
        0.12238167971372604,
        -0.030986199155449867,
        0.02341826818883419,
        0.09373798966407776,
        -0.03010932169854641,
        -0.02182902954518795,
        0.00034245935967192054,
        0.010353694669902325,
        -0.0025537023320794106,
        -0.01312707457691431,
        -0.05924917012453079,
        0.0087204584851861,
        0.030064085498452187,
        -0.09288836270570755,
        0.027941012755036354,
        -0.015910904854536057,
        0.004463081248104572,
        -0.019686955958604813,
        0.07207316160202026,
        -0.047680728137493134,
        -0.020451843738555908,
        -0.004666323307901621,
        -0.09221819043159485,
        -0.038758546113967896,
        0.04089346528053284,
        0.0531269833445549,
        0.012113051488995552,
        -0.10430338233709335,
        0.03499222919344902,
        -0.06185641884803772,
        -0.057016946375370026,
        0.01413961686193943,
        -0.008192349225282669,
        0.020256293937563896,
        -0.059249985963106155,
        -0.07091780006885529,
        -0.023125270381569862,
        0.012148923240602016,
        -0.01759958080947399,
        0.013116339221596718,
        -0.022068234160542488,
        0.01079553458839655,
        -0.027824372053146362,
        -0.02142092026770115,
        0.03026590496301651,
        0.0040771556086838245,
        -0.018031395971775055,
        0.04092470183968544,
        -0.003365984419360757,
        0.08398733288049698,
        -0.009221130982041359,
        -0.008798624388873577,
        0.025386657565832138,
        -0.05021331086754799,
        -0.014098352752625942,
        -0.11240287125110626,
        0.06464409083127975,
        -0.03188290819525719,
        0.03172041103243828,
        -0.018376216292381287,
        -5.7461882363440964e-08,
        0.013561753556132317,
        0.04913196340203285,
        0.07331818342208862,
        0.012078478001058102,
        0.020710157230496407,
        0.014041950926184654,
        0.02853846177458763,
        -0.034127652645111084,
        0.039505910128355026,
        -0.02569679170846939,
        0.011328987777233124,
        -0.01858912780880928,
        -0.04220418259501457,
        0.08460734784603119,
        -0.02493964694440365,
        0.11226563900709152,
        0.039603929966688156,
        0.11363918334245682,
        0.03636946901679039,
        0.018867023289203644,
        -0.08870334178209305,
        -0.004981922917068005,
        0.008843103423714638,
        -0.01220112293958664,
        -0.009283307939767838,
        0.012437823228538036,
        -0.10997957736253738,
        0.01504256296902895,
        0.07081222534179688,
        0.05724741145968437,
        -0.04061208292841911,
        -0.042541828006505966,
        -0.006154733709990978,
        0.006672464776784182,
        -0.07780337333679199,
        -0.043193161487579346,
        -0.04645812138915062,
        -0.051372088491916656,
        0.05335681512951851,
        -0.019035153090953827,
        0.04801046848297119,
        -0.04839629679918289,
        -0.040170684456825256,
        0.022130100056529045,
        -0.0378355048596859,
        -0.10164343565702438,
        0.05379239097237587,
        -0.18277442455291748,
        -0.061278026551008224,
        0.10005779564380646,
        -0.030613260343670845,
        -0.0408848412334919,
        -0.04063649848103523,
        0.016251884400844574,
        0.05362538620829582,
        0.09113242477178574,
        0.09654698520898819,
        -0.050134409219026566,
        -0.01400041300803423,
        0.07187211513519287,
        0.06447899341583252,
        -0.06473439186811447,
        -0.03197319805622101,
        0.040722403675317764
    ]
}