{
    "id": "K3FGfAQwGPo",
    "title": "Ultimate Travel Gear Bag!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-02-11T18:25:46Z",
    "video_url": "https://www.youtube.com/watch?v=K3FGfAQwGPo",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 179096,
    "likes": 6403,
    "comments_count": 502,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine, and today, we're doing a video that I've been wanting to do for a really long time, but I haven't really been traveling much. And I'm about to head out on a really fun road trip. And I'm gonna show you guys everything that I'm bringing with me to make content. And it's a lot of stuff. And this is actually kind of pared down. I took out some things. I was like, I'm only bringing the things that I think I'm gonna need and then the things that I think I might actually need that I thought that I wouldn't need, but I might need it, so we're going to just put it in here, so just in case. I didn't bring the things that I thought that I might not really... No, we get the point. So a huge thank you to OWC for sponsoring this video. And this is actually a perfect video to integrate this in, because this is their USB-C Travel Dock. Not only does this have pass-through charging, but it also has two USB 3.1 ports, a USB-C and Thunderbolt 3, HDMI outs, and an SD card slot. One of the things that I really like is you are able to fold the cable up, and it's already connected, so you don't have to worry about never having a cable to plug it in. Since they launched this thing, I pretty much have used it non-stop, so if you guys want to check it out, I'll put a link in the description. OWC has so much cool stuff. I am working on a full tour of all of the OWC stuff that I've been using, so stay tuned for that. And this, this precious piece is actually going into the top laptop bag, because it needs to be accessible and handy whenever I need it. So I broke my packing down into basically three sections. So I have all of the podcast gear in this container. I have kind of my laptop bag, which has like my iPad, my computer, and all kinds of accessories that I might need quickly or while we're on a road trip. And then over here, I've got this massive Pelican Case. I ended up getting three different size Pelican Cases, one for larger tripods, and then a smaller, little Air one for smaller road trips, but this is gonna be a very long road trip. So I needed to bring the big boy for this one. So let me show you how I have this laid out. Now normally, you're supposed to mount this kind of up here, but I packed this part so full that if I put this like this, it won't close, so I have to go like this. And I just cover that all up. And then this little dome kind of covers up all this stuff. And then when I get to my destination, I just open it back up. This, up there. I'm actually gonna put some Velcro here. I need to make a note to remind myself to do that. And I have easy access to anything that I need. You will notice that there is the little space here, and that's because I've got a secret thing that's goin' here, so couldn't put it in here. But normally, this is filled to the brim with something. Just trust me, there's something there. But what I do have here, right now, in the meantime, is actually gonna go in here. This is also an OWC drive. I just recently got this. This is their Envoy Pro EX. This is a Thunderbolt 3 drive. This is a four-terabyte solid-state drive. I've been editing all of my videos off this. Tyler's had been editing all of our videos off of this. The two-terabyte drives just weren't cutting it anymore for me, so to be... Oh, look at that. Look at you. Look at you! Anyway, the speeds on this thing are incredible, and now that we're shooting in 8K, sometimes... This was one of the first drives that I bought, and it basically had changed my editing life. Now this is a newer version. This is actually a 16-terabyte ThunderBlade drive. I had bought the eight-terabyte solid-state drive, actually, when I was shooting that 8K Mac Pro video, because I ran out of space everywhere, so it was the only drive that I could find that would be able to handle all of the footage. And now they have a 16-terabyte one. So they did send me this to check out. I mean, if you're somebody that goes through a lot of storage, and you need to be able to edit off of it directly, this is a solid-state RAID, so there are drives inside of this, and it's life-changing. I love you. Say it back. I also love this little NOMATIC bag. This thing, I'm always puttin' random stuff in here, random stuff, whatever I want. Oh, this is something that's also fairly new. So this is the Blink Pro by Saramonic, and I'd use the previous version of these, and these new ones have this little charging container, so you can just see those little charging conductors there. I've actually been using this with the Sony CD1, because that does have an audio input. So with this receiver, I have these two transmitters that I can give one to me or to my sister, and both of our audio will go on to the same track. So normally, these two cameras that we're actually using right now would be in here. So over here, I have one, just to show you the placement. This next little section is kind of just everything that is sort of like this shape, microphones, tripods, mobile mounts, (air hisses) to clean lenses. I've got the DJI Osmo. For our XLR audio. I've also got this little rig, which we've been using for the new Sony A1. Some little Nanlites, two of those, 360 stick, and there's a also power strip, fits very nicely, just like so. Now over here is also gonna be a secret little section of something that I can't show you yet. But what I can show you are these incredible cases that Aldryn made for the Mavic Mini. Oh, these are so cool, and they fit perfectly in here. So I love this because I can fill these up with whatever I want if I'm not using it for my Mavic Mini and the controller, and they fit perfectly in here. I was so excited. In this little section, we've got my drone, the Mavic Air 2, very nicely placed. And again, like I was telling you guys, these TrekPaks are so cool, because I just kind of put my item in and cut these pieces to fit. And they're pretty standard sizes too, so I'm able to kind of reconfigure it later. Okay, Tyler, I've got a question. So over here, we've got a lot of ND filters and stuff. Like, which ones should I keep? We've got some Peter McKinnon. We've got some Moment ones. What do you think? - [Tyler] I mean, they don't take up that much space. - Are you saying I bring them all? - [Tyler] You can bring 'em all. - Okay, let's bring it all. So much for paring things down. Oh, we've also got our SD card packet, full of actually not SD cards. These are the CFexpress cards, and they don't fit in here. - [Tyler] They just jangle around, all jangly. - And back here's where I've put all the lenses, and I've got these little Peter McKinnon backcap stickers. So the lenses that I'm gonna be bringing with me, I've got the 24 millimeter. This is the 1.4. This is so beautiful. Boy, this is our 135 G Master. We've got our 12 to 24. This is a 2.8. And we've got our 85 millimeter. That's a 1.4. We're also gonna be bringing the 24 to 70. Is that 24 to 70? And then the 16 to 35. Remember when I said I was bringing only what I needed? I'm bringing only what I needed. In this little section, I brought the Elgato Wave:3 microphone. I just wanted to make sure I had something that was a simple USB mic, in case I needed to record some VO. And I've also got the Insta360 ONE X2. Up here is easy access to cables, basically any cable that I might ever need. In here, bunch of random stuff. (rattle rattles) Everybody, screenshot this and tweet it to @GavinFree, right now. I've got an extra SIM card, some tape. Command strips, you will really never know when you might need that. This is where I have all the audio. We've got extra microphones. We've got a lot of packs. So I use the Sennheiser AVX. They seem to be working quite well for us. I'm using it right now. How's it sound? Here's a little baggie of some accessories. I really love little baggies. Then this is where all the batteries are gonna go. And so far, we only have one. None of them are charged. And that's it for Pelican Case. The backpack, this, I like to keep very accessible to anything that I might need in the car, 'cause if I'm not driving, which I'm usually not, because I'm a terrible driver, and Jenna doesn't trust me, so I'm usually editing, in the backseat, front seat, doesn't matter. In this little front pocket, I always keep my AirPods or whatever headphones I have. And I like keeping this here, because I can just go, oh, look at that. Also in here, oh, it's a secret tutorial for cubing. (pages flapping) This is my easy-access area here. So I have my OWC travel dock and also my Sony ZV-1, AirPods, glasses, chapstick, contacts, tampons. I'm a lady. Ah, oh, yeah, yeah, yeah. Love these little Incase bags. This is some miscellaneous accessories, the two phones that are gonna be coming with me, other than my iPhone. I've got some cables in here. Just like a nice little mix of just stuff I might need. I love this little bag. This one's actually by Away. This came with one of their suitcases. And in here, I keep things that are kind of flat. So I have my CFexpress. Oh my gosh, we have an extra card. That's good to know. And then I have a couple different cables. I've also got the Duo Charger, which is obviously been game-changing for traveling. Like, this thing is so cool. So I usually have at least one or two Mophie chargers. This is a smaller one. I also have a larger version of this that has an AC port, so I can charge things with a normal plug. Although the car that we're taking does have plenty of outlets, so we will be able to have power. Nintendo Switch, of course, can't leave home without it. We have the new 13-inch M1 MacBook Pro. I love this computer. I just wish that it had two more ports. When they release the next version of whatever Mac comes next, it's gonna be mind-blowing. My iPad (bag clatters) Air. So I've mostly been using my iPad Air to do Apple Fitness, especially when I'm traveling, because everything is here. I've got all of my workouts. It connects to the Apple Watch. And then I can also use this to do emails or whatever else I want, maybe like watching Netflix. Next up, this is a new addition to the fam. My last trip, I actually was able to put all of this stuff in here, but I only brought three microphones. And this time, I wanted to bring all of the microphones. This is the whole podcast setup minus microphone stands, which if you're gonna be on my podcast and I'm traveling, you're gonna hold the microphone, and I'm so sorry about it. Actually, no, I'm not, because the microphone stands, it's just an added hassle. So here it is. It's all nicely packed. Put all four microphones in here. We've got the Rodecaster Pro. We've even got two sets of headphones, because Jenna and I both have our own, so that would be for our potential guests. I also just recently got this off of, I saw it on B&H. It's a way to use the Rodecaster with USB, Tyler. All the XLR cables are down at the bottom. Everything is fit in here, real nice, real snug. There's something... Oh yes, oh yes! A tiny bag. Adapters here for the headphones, and the cables for the headphones as well. So that, my friends, is the to-go podcast. Obviously, this is not set up for flight. So if we were going on a plane, I would have to reconfigure this back into the Pelican case. As far as lighting goes, we're gonna be bringing the new Aputure Amaran 200d light. It's a lot smaller, and it's really light, so we're able to bring that, and probably, actually, we could probably bring a smaller light stand too, since it's lighter, right? No? We are going to bring a bigger, we're gonna bring a C stand. So I think that is pretty much everything, other than I make sure I always carry a knife with me, just in case I needed to cut something, or unbox something on the go. Other than that, I think it's time to go. I'll put links in the description if you want to check out anything that I talked about here today. And if there's anything that you think that is missing from my kit, don't tell me, because I don't want to have to buy it. (laughs) Well, thank you, guys, so much for watching. I'm looking forward to heading out on this trip. I'm gonna be making some content and hopefully getting some time to rest, but that's probably not gonna happen. Any time I try to go on a trip and say I'm not going to film anything, I'm just going to enjoy, there's all kinds of cool stuff to film and make videos about, so can't wait. I'll see you guys very soon. Bye! (mellow music)",
    "transcript_keywords": [
        "stuff",
        "put",
        "things",
        "bring",
        "Pelican Case",
        "kind",
        "OWC",
        "case",
        "thing",
        "Pro",
        "drive",
        "bringing",
        "love",
        "Justine",
        "trip",
        "guys",
        "microphones",
        "Pelican",
        "cables",
        "Air"
    ],
    "transcript_entity_values": [
        "NOMATIC",
        "85 millimeter",
        "AirPods",
        "Pelican",
        "Mavic Mini",
        "Velcro",
        "12",
        "iPad",
        "one",
        "the Apple Watch",
        "USB-C",
        "iPad Air",
        "ONE",
        "1.4",
        "eight-terabyte",
        "24",
        "Peter McKinnon",
        "Justine",
        "135",
        "Sony",
        "OWC",
        "AC",
        "Mac",
        "Nanlites",
        "Pelican Case",
        "three",
        "the Blink Pro by Saramonic",
        "M1 MacBook Pro",
        "four-terabyte",
        "USB-C Travel Dock",
        "13-inch",
        "ND",
        "A1",
        "two-terabyte",
        "Aldryn",
        "four",
        "24 millimeter",
        "at least one",
        "8",
        "Elgato Wave:3",
        "Netflix",
        "Nintendo Switch",
        "K Mac Pro",
        "360",
        "3",
        "SD",
        "Apple Fitness",
        "Air",
        "today",
        "16-terabyte",
        "two",
        "the DJI Osmo",
        "the Rodecaster Pro",
        "Mavic Air 2",
        "200d",
        "Tyler",
        "Aputure Amaran",
        "16 to",
        "first",
        "Pelican Case",
        "CFexpress",
        "the Mavic Mini",
        "USB",
        "Rodecaster",
        "Jenna",
        "XLR",
        "Mophie",
        "2.8",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "NORP",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "LOC",
        "CARDINAL",
        "WORK_OF_ART",
        "FAC",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "GPE",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.04734307527542114,
        -0.04653481766581535,
        -0.0673360675573349,
        -0.08864597976207733,
        0.03965204954147339,
        0.019690420478582382,
        0.10399968922138214,
        0.06263600289821625,
        -0.022675899788737297,
        0.06032365560531616,
        0.054028186947107315,
        0.018696855753660202,
        -0.0033931832294911146,
        0.03565350919961929,
        0.007995843887329102,
        0.04293275251984596,
        0.02469911426305771,
        -0.013611551374197006,
        -0.011321269907057285,
        0.02988564223051071,
        -0.016297953203320503,
        -0.047475334256887436,
        0.02395973913371563,
        0.008738996461033821,
        -0.04918632283806801,
        0.11203303933143616,
        -0.0032550005707889795,
        0.03793586790561676,
        -0.07110857963562012,
        -0.07229098677635193,
        -0.0398189052939415,
        0.03856893628835678,
        0.09435613453388214,
        0.0018787019653245807,
        0.01573985628783703,
        -0.022149577736854553,
        0.04795489087700844,
        -0.0163755901157856,
        -0.017532914876937866,
        -0.024748971685767174,
        -0.02726094424724579,
        -0.03742178902029991,
        0.015011847019195557,
        -0.003104700008407235,
        -0.05743851512670517,
        -0.08552482724189758,
        0.005360204726457596,
        -0.021168159320950508,
        0.06751629710197449,
        0.06886742264032364,
        -0.048673756420612335,
        -0.01994304545223713,
        0.016383908689022064,
        0.013860557228326797,
        -0.06966585665941238,
        -0.004404826555401087,
        -0.09346950054168701,
        0.00167303835041821,
        0.008827319368720055,
        -0.11815080791711807,
        0.02916317991912365,
        -0.04269888252019882,
        -0.009333984926342964,
        0.07481555640697479,
        -0.05349293723702431,
        -0.05406852811574936,
        -0.004822558723390102,
        -0.014667563140392303,
        -0.018710188567638397,
        0.01957191526889801,
        -0.11928673833608627,
        0.061490774154663086,
        -0.04786660149693489,
        0.04668066278100014,
        0.01987992785871029,
        0.056618984788656235,
        0.05397120863199234,
        -0.039653487503528595,
        -0.00785798765718937,
        0.047216515988111496,
        0.01609291508793831,
        -0.04284141585230827,
        -0.07301382720470428,
        -0.023668654263019562,
        0.017222052440047264,
        0.00445918831974268,
        0.010659038089215755,
        0.011906906962394714,
        -0.03587508201599121,
        -0.07678970694541931,
        -0.08095158636569977,
        -0.0285330843180418,
        -0.02038734033703804,
        -0.0030314093455672264,
        -0.04671775549650192,
        -0.019127938896417618,
        -0.0523078590631485,
        -0.032793063670396805,
        -0.043959952890872955,
        0.06191837415099144,
        0.04803777113556862,
        -0.024663370102643967,
        0.032517168670892715,
        -0.022519629448652267,
        -0.02550511248409748,
        -0.10162142664194107,
        -0.0104361642152071,
        -0.00213126209564507,
        0.03482329100370407,
        0.003321833675727248,
        -0.06776975095272064,
        0.047963522374629974,
        -0.04352061450481415,
        -0.07140088081359863,
        -0.002829473465681076,
        0.11408526450395584,
        -0.026958806440234184,
        0.1336306780576706,
        0.03307244926691055,
        0.019467996433377266,
        -0.026077447459101677,
        -0.06859660148620605,
        0.030389798805117607,
        0.04811025783419609,
        0.027005720883607864,
        0.021702080965042114,
        -0.0485251247882843,
        1.32838737455069e-32,
        -0.04151678457856178,
        0.06564120203256607,
        0.013367963023483753,
        0.09380214661359787,
        -0.016203219071030617,
        -0.04287801682949066,
        -0.024913132190704346,
        0.04933452978730202,
        -0.022397473454475403,
        0.03189535066485405,
        -0.009568222798407078,
        0.07194023579359055,
        -0.030102308839559555,
        0.06754323840141296,
        0.06527359783649445,
        -0.04097770154476166,
        -0.02600337378680706,
        -0.06417053192853928,
        -0.019488614052534103,
        -0.036315593868494034,
        -0.01603235863149166,
        -0.05243632197380066,
        0.04950340837240219,
        0.08397999405860901,
        0.13950508832931519,
        0.07742762565612793,
        0.08177980780601501,
        0.020324043929576874,
        0.09728776663541794,
        0.016733642667531967,
        -0.06005141884088516,
        -0.04636339470744133,
        -0.03006689064204693,
        -0.08456619828939438,
        -0.044840890914201736,
        0.017277736216783524,
        -0.07434471696615219,
        0.0008990619098767638,
        -0.0160529688000679,
        -0.032961901277303696,
        -0.026521209627389908,
        -0.0034823392052203417,
        -0.08647266775369644,
        -0.04437769204378128,
        0.02957203984260559,
        0.017911484465003014,
        0.08689063042402267,
        0.0922079086303711,
        -0.01131238043308258,
        0.03713870048522949,
        -0.05698075890541077,
        -0.04635980352759361,
        -0.05190717428922653,
        -0.03021986596286297,
        -0.04048408940434456,
        -0.0931481271982193,
        -0.014017756097018719,
        0.04710235446691513,
        0.05192437767982483,
        0.04740193113684654,
        0.038101404905319214,
        0.017599156126379967,
        0.005881607066839933,
        0.00472393911331892,
        -0.01190218236297369,
        0.09006669372320175,
        0.08729291707277298,
        -0.05965098738670349,
        0.05472201481461525,
        0.04795835539698601,
        -0.005454893223941326,
        0.003380480920895934,
        0.050574611872434616,
        0.009922350756824017,
        0.0797155499458313,
        0.045366350561380386,
        -0.07563979923725128,
        -0.055229783058166504,
        0.012518600560724735,
        -0.027090048417448997,
        -0.11602512001991272,
        0.060097526758909225,
        0.025326309725642204,
        0.11184960603713989,
        -0.05491241440176964,
        -0.06245408579707146,
        0.038590557873249054,
        -0.040885668247938156,
        -0.020406285300850868,
        -0.03382638096809387,
        -0.010245098732411861,
        0.053810589015483856,
        -0.059222761541604996,
        -0.0612364299595356,
        -0.03616977483034134,
        -1.2141208747851171e-32,
        0.08132651448249817,
        0.024948593229055405,
        0.03835359588265419,
        -0.015010582283139229,
        0.0779712125658989,
        -0.023612087592482567,
        0.04531804472208023,
        0.07348007708787918,
        0.052247028797864914,
        -0.06700333952903748,
        0.018389618024230003,
        -0.06650396436452866,
        -0.08349594473838806,
        0.016693564131855965,
        0.011913576163351536,
        -0.025448119267821312,
        -0.08505351841449738,
        -0.06308905780315399,
        0.0619460828602314,
        -0.03294084221124649,
        0.0774884968996048,
        0.11888473480939865,
        0.06236599385738373,
        0.010371246375143528,
        -0.023120436817407608,
        0.00940774567425251,
        0.02431463822722435,
        0.06508834660053253,
        0.018809400498867035,
        0.016151592135429382,
        -0.009013342671096325,
        -0.046276114881038666,
        -0.011973503045737743,
        0.006135709583759308,
        0.01849309913814068,
        0.03667458891868591,
        0.01885894127190113,
        0.06435468792915344,
        0.009131410159170628,
        -0.06501023471355438,
        0.015913309529423714,
        -0.0033636316657066345,
        -0.005058993119746447,
        -0.01830184832215309,
        0.00379611155949533,
        -0.14139264822006226,
        -0.025314444676041603,
        0.008035198785364628,
        0.0077057769522070885,
        -0.01877535879611969,
        -0.055531006306409836,
        -0.041934799402952194,
        -0.045176275074481964,
        -0.020041093230247498,
        0.000941599253565073,
        0.03126959130167961,
        -0.09223747253417969,
        -0.03196154534816742,
        0.042941685765981674,
        -0.025169165804982185,
        0.03344375267624855,
        -0.02220846153795719,
        -0.06880560517311096,
        -0.045009128749370575,
        -0.0035502726677805185,
        -0.07846665382385254,
        0.0958511009812355,
        0.026824165135622025,
        -0.03963879868388176,
        0.009694626554846764,
        -0.010115179233253002,
        -0.007366048637777567,
        0.047092098742723465,
        0.013801334425807,
        0.06262665241956711,
        -0.009355464018881321,
        -0.024074334651231766,
        0.020519444718956947,
        0.11873742938041687,
        -0.035227879881858826,
        -0.04563392326235771,
        -0.03599780052900314,
        -0.005886898376047611,
        0.09868055582046509,
        0.10395534336566925,
        0.1184893473982811,
        0.0508236363530159,
        -0.04244713857769966,
        -0.02780485525727272,
        0.0469832681119442,
        0.03688662126660347,
        0.05035793408751488,
        0.05205138772726059,
        0.11635103821754456,
        -0.057321518659591675,
        -6.366145299807613e-08,
        0.0035783383063971996,
        0.04386831447482109,
        -0.04344684258103371,
        -0.0003702724352478981,
        0.03500882536172867,
        -0.0811350867152214,
        -0.003971443045884371,
        0.047149356454610825,
        0.04201173037290573,
        -0.03585655242204666,
        0.07930691540241241,
        -0.017149392515420914,
        -0.013054020702838898,
        0.10239598900079727,
        -0.015094691887497902,
        0.03211433067917824,
        -0.11132776737213135,
        0.08718625456094742,
        -0.04973062872886658,
        -0.08113382756710052,
        -0.027402903884649277,
        0.0472600981593132,
        0.04000627249479294,
        -0.032063502818346024,
        0.07244831323623657,
        -0.006422837730497122,
        -0.05173627287149429,
        -0.06833872199058533,
        0.0702650174498558,
        0.010226225480437279,
        -0.0794614627957344,
        -0.010224574245512486,
        -0.005801951512694359,
        -0.033604882657527924,
        -0.04678981378674507,
        -0.0649973675608635,
        -0.05307285115122795,
        -0.017248883843421936,
        0.038655634969472885,
        0.05059847980737686,
        0.027678869664669037,
        -0.11023938655853271,
        -0.038102541118860245,
        0.00011247371730860323,
        -0.0005034314235672355,
        -0.04054441675543785,
        0.004518227651715279,
        -0.0706607848405838,
        -0.09481500089168549,
        -0.014834398403763771,
        -0.044390588998794556,
        -0.004083463456481695,
        0.022271445021033287,
        -0.027173619717359543,
        0.029680736362934113,
        0.006287147291004658,
        0.021313482895493507,
        0.06240949034690857,
        0.0019785978365689516,
        0.0008232681429944932,
        0.005131470039486885,
        -0.009592889808118343,
        -0.0751396119594574,
        0.015342197380959988
    ]
}