{
    "id": "k3jDxPXZuPE",
    "title": "We’re all being played and I’m tired of it",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-07-11T17:26:11Z",
    "video_url": "https://www.youtube.com/watch?v=k3jDxPXZuPE",
    "category": "Science & Technology",
    "tags": [
        "amd cpu best",
        "which amd cp",
        "laptop cpus",
        "linustechtips",
        "branding tech",
        "intel 14700k",
        "amd 7640u",
        "apple m3 mac",
        "apple is evil",
        "amd is evil",
        "intel is evil",
        "linus tech tips",
        "linus tech",
        "pc hardware",
        "cpu",
        "gpu",
        "nvidia is evil",
        "Processor Architecture",
        "Mobile Chips",
        "Desktop CPUs",
        "Hardware Acceleration",
        "Neural Processing Tasks",
        "Integrated Graphics",
        "Apple M-Series Processors",
        "2023 MacBook Pro",
        "Consumer Behavior",
        "Brand Loyalty",
        "Investor Targets",
        "Product Rebadging"
    ],
    "views": 1035484,
    "likes": 50013,
    "comments_count": 2733,
    "description": "Visit  and use offer code LTT for 10% off  Checkout the G.Skill Trident Z5 Royal at:    AMD, Intel, Nvidia, Apple and pretty much everyone else think you are an IDIOT. They think they can just mislead consumers by tweaking their naming schemes for their hardware (Remember the RTX 4080 12GB?) and making them more confusing. How bad has it become? We're gonna tell you.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 The Names are Stupid 2:12 The Names are Misleading 4:59 The Names are Intentional 6:41 The Names are Stupid, again 8:39 The Names are Confusing 9:04 The Names are Here to Stay",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://lmg.gg/TridentZRoyalNewegg",
        "https://lmg.gg/TridentZRoyalAmazon",
        "https://linustechtips.com/topic/1576277-amd-is-misleading-you-on-purpose-also-nvidia-intel-and-everyone-else/",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "$4.7 trillion. That is how much companies are projected to spend to get your attention in 2025 with helpful messages like this thermal paste is good for AI and sports gambling makes you cool. But marketing is more than just the ads that get served before your YouTube video and in the middle of your YouTube video and at the end of your YouTube video. A considerable amount of that budget is spent every year on branding. AMD, for instance, didn't come up with the name Ryzen by pulling it out of a hat. It was a very clear statement that they were back, and millions of dollars get spent to nail the tone of slogans, logos, sounds, and so much more, all with one purpose, convincing you to pull out your wallet and buy. Look at Apple's habit of stringing together superlatives like Ultra, Pro, and Max. If they're doing it? I promise you, it's because a team of professionals found that these \"powerful\" words maximize the odds that you're going to think that Apple's just playing the best. Which raises a question, if they're all so smart, why are all these names so dumb? What is Liquid Retina XDR? Is that better than Ultra Retina XDR? How about the Ryzen 8640 HS? Is that better than the Ryzen 7736U? I don't know. And what makes a CPU go from core to core ultra? As it turns out, the confusing nature of this branding is almost certainly by design. It's not intended to inform and educate you, but rather it's intended to appeal to your gut feelings. And I've got a gut feeling that we're gonna talk a lot more about confusing branding after this confusing, this segue confusing sponsor to our segue sponsor. G-skill! Embrace the finer things in life, like yachting, art collecting, and of course, RAM, with G-skill's Trident Z5 Royal DDR5 featuring a mirror finish in either gold or silver and a crystalline light bar. Learn more at the link in the description. Picture this. It's June 2024, and you just got a new laptop as a grad present, and... After a bit of research, you find out, boy howdy, is it ever a good one. It's got a cutting-edge 7000 series processor with ripping-fast Zen 4 cores from AMD, except for one small problem. It doesn't. Now, my goal going into this wasn't to upset fanboys by singling out AMD, but their mobile product naming scheme is so incomprehensible that it requires its own Wikipedia section, making it a prime example. Of how misleading product naming can hurt consumers. To illustrate, let me show you how it compares to the current desktop naming scheme. This right here on desktop is your all-important architecture number. This indicates if the chip is using the latest generation core technology or something older. Well this, haha, this goes, um, here now. And then that first spot, that first number, well now that's the release year, but... I don't know, let's put an 8 there, I guess, which tells you what year it came out, as long as you consult this handy rubric. You think, wait, that first number has no bearing on performance whatsoever anymore? That's right, its main purpose seems to be to allow AMD to create a new 8000 series, or a 9000 series CPU, without doing the engineering work to release a new architecture. And we're not done yet. That second number? That's the market segment. So you've got a Ryzen 9 over here, and then you can either have a 9 or an 8. Wait, isn't that kind of redundant? Because we've already got a segment over here. Yes, yes it is. Oh wait, I forgot, I forgot to put year on here. I'm confusing even myself. And don't forget about the fourth number. That can be 0. This is a differentiate number. It could be 0, or if it's better... but not better enough to change any other numbers, it's 5. Not 3, not se- Just 0 and 5. Oh, right. And don't forget about the letter over here, which indicates the power target. Or if it's unlocked, I don't know. But Intel has letters to indicate the power target, so AMD has letters to indicate the power target. So not only are these letters not industry standard, even within AMD's own lineup, you can have instances where two chips can have the exact same numbers, but markedly different performance characteristics. At least they kept the meaning of the architecture number the same, though, right? Seven is the newest? Nope. It's four now? Are you confused yet? Good, that's what they want. So you're not gonna think about it too hard and you'll just trust that bigger numbers better. But here's a couple examples of how this can go very, very wrong. In February, Nvidia launched a refreshed RTX 3050 6 Giga. Why? I don't know, and it doesn't matter. What matters is that if Nvidia had followed AMD's naming scheme that I just laid out, it would have become the RTX 6530. Can you imagine the outrage if the community got their hands on the shiny new 6530 only to find out that Nvidia arbitrarily doubled the model number? I mean, look, Nvidia is no saint. They have shamelessly adjusted the meaning of their model numbers many times to suit their needs. We actually have a full video coming on their bull s***. But this example shows how what AMD has done here sets a completely new bar for this nonsense. And ironically, in a way that could actually hurt AMD in the long term. Imagine this scenario. Oh popsicles, they are fresh out of the 7640U. Well, I guess I'll go with the higher number, 7735U, except for one small problem. You just downgraded to an older processor. So now you're gonna go tell all your friends who bought modern chips from AMD's competitors how bad AMD's battery life and performance sucks. Way to go, AMD. Making matters more confusing, they've added AI investor bait to their upcoming generation, which is fine. Except, why? Are the letters in front now? Now, remember how I said that I didn't just wanna beat up on AMD? That's because Intel is also terrible. Their new product naming is so confusing that they get it wrong on the very page that explains it on their own website. They did get some stuff right this time around. They finally removed the superfluous I, they kept the reasonably well-defined market segment number, and they moved the word processor to the front. Wait a minute, what was that last one? That's not right. You're saying that going forward, an Intel Core i7-14700K processor would have been called Intel Core 7 processor 14700K? I mean, I know that rules are made to be broken, but typically Intel, we say our adjectives first, like this. Look at this beautiful, perfectly sized, new black super soft polyblend graphic T-shirt from lttstore.com. If I reversed it, it would sound more like floatplane.com at signup, content behind the scenes bonus weekly twice four. If that sounds backward to you, it's because it is. And that's before we even tackle the suffixes. HX means highest performance, all skills unlocked. HK means highest performance, all skills unlocked. H means highest performance. P means performance optimal. This is like buying a car that has three positions for the gas pedal, okay? Highest speed unlocked, highest speed and optimized for speed. G indicates integrated graphics, but also F indicates no integrated graphics. So what you're getting if there's neither of them? Who knows? Oh, and they're getting rid of the Pentium branding again, except they aren't. Again. Oh, and finally, Ultra indicates an AI-capable chip. Well, that one was just obvious. Now, some companies do keep their naming cleaner. For Apple's M series processors, the new number every year simply indicates, hey, this is a new processor with Pro, Max, and Ultra suffixes that mean various degrees of better. But, with that said, Apple is also guilty of some serious naming bullsh*t. Can I interest you in the latest 2023 MacBook Pro, or would you prefer the older, crappier 2023 MacBook Pro? So what can we do as consumers? Well, you can complain to your country's consumer protection agency, but that's not gonna do anything in the short term, so you can encourage people in your life to try and educate themselves before they make purchases, but... That can be just as confusing as \"not bothering\" and it takes time that many people just don't have or don't want to invest into this and Truthfully, I get it. I mean, it's literally my job to learn about and demystify these things But there are many areas of my life where I just don't feel like putting in the work either Why do I buy the brand of dishwasher soap that I do? It's not like I've performed thorough testing in a controlled environment. All I know is that it's cheap at Costco and it tastes delicious Jokes aside, the point that I'm making here is that consumer behavior isn't going to change So what we really need is a shift in attitude for manufacturers and not just the ones I called out today Guys, I'm addressing you directly now. Branding doesn't need to be a bad thing It doesn't need to be deceptive in a perfect world It will guide your customer to the right product in your portfolio Resulting in a positive experience that will foster long-term brand loyalty and therefore future sales If you keep that mentality in mind you could even engage in controversial practices like Rebadging a last-generation product to fill an entry-level gap in your new lineup And it doesn't have to be such a terrible thing as long as you do all the necessary extra steps like Making sure it continues to get driver support for a long enough period as though it was new The issue is I just don't see that happening. I see hostility toward the customer Everywhere I look in an effort to pursue short-sighted quarterly targets that look good to investors. I'm just fed up with it So fed up that I don't even know if I want to tell you about our sponsor Squarespace, stop living in the dark ages of cold calling and trying to explain your business to people who are like well Just spit it out. What what are you talking about? Instead create a free website with Squarespace and save your precious saliva Their all-in-one platform makes it easy to get your website up and running quickly And you don't need to be a graphic designer to use their intuitive fluid engine site builder It has tons of templates to get you started and uses drag-and-drop elements meaning no coding is required either Their asset library will help you manage all your files from one central hub and use them across the whole Squarespace platform and with advanced analytic insights you can see what's working well and what needs a little touching up. So head to squarespace.com/ltt and get 10% off today. If you guys enjoyed this video, you might enjoy a video on the biggest industry lie that's going on right now, AI, or as I like to call it, machine learning with extra steps",
    "transcript_keywords": [
        "AMD",
        "number",
        "Ultra Retina XDR",
        "confusing",
        "Ultra",
        "YouTube video",
        "naming",
        "performance",
        "Intel",
        "Intel Core",
        "Retina XDR",
        "Ryzen",
        "Liquid Retina XDR",
        "core",
        "processor",
        "video",
        "numbers",
        "Pro",
        "AMD naming scheme",
        "Apple"
    ],
    "transcript_entity_values": [
        "Intel Core 7",
        "F",
        "one",
        "second",
        "millions of dollars",
        "7735U",
        "four",
        "Apple",
        "first",
        "0",
        "9",
        "Max",
        "Trident Z5 Royal DDR5",
        "6530",
        "10%",
        "Rebadging",
        "tons",
        "$4.7 trillion",
        "today",
        "Ultra Retina XDR",
        "Seven",
        "2023",
        "3050",
        "Ultra",
        "Apple's M",
        "7000",
        "February",
        "AI",
        "RAM",
        "8",
        "June 2024",
        "8000",
        "5",
        "AMD",
        "weekly",
        "3",
        "Pentium",
        "4",
        "the release year",
        "YouTube",
        "Liquid Retina XDR",
        "14700",
        "9000",
        "AMD",
        "three",
        "CPU",
        "Ryzen",
        "2025",
        "Nvidia",
        "Squarespace",
        "6530",
        "Ryzen",
        "Wikipedia",
        "quarterly",
        "Costco",
        "a minute",
        "fourth",
        "two",
        "Intel Core",
        "Intel",
        "Ultra, Pro",
        "every year"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.12099669873714447,
        -0.040166132152080536,
        0.037377115339040756,
        -0.07669537514448166,
        0.1254338026046753,
        0.031089724972844124,
        0.028615262359380722,
        0.07460526376962662,
        0.002748332219198346,
        -0.03065461479127407,
        0.032240621745586395,
        0.07905898243188858,
        0.0024183299392461777,
        -0.05204669386148453,
        0.03145577013492584,
        -0.058397211134433746,
        0.040871258825063705,
        -0.0893060490489006,
        -0.05394069850444794,
        -0.021856291219592094,
        0.02831934578716755,
        -0.038948904722929,
        -0.003471661824733019,
        -0.0071732341311872005,
        0.02332269214093685,
        -0.05620711296796799,
        -0.0032742605544626713,
        -0.061208777129650116,
        0.028941260650753975,
        -0.05773177742958069,
        0.0038508472498506308,
        0.09782825410366058,
        -0.015201221220195293,
        0.0033020521514117718,
        -0.032406315207481384,
        -0.08391798287630081,
        -0.020120544359087944,
        -0.09460669010877609,
        -0.07519335299730301,
        -0.06974407285451889,
        0.04940019175410271,
        -0.0525793731212616,
        -0.03238527104258537,
        0.014747146517038345,
        -0.005909344647079706,
        -0.06454385071992874,
        0.06890787184238434,
        -0.032420843839645386,
        -0.029118478298187256,
        0.029820112511515617,
        0.03663378208875656,
        -0.0629589632153511,
        0.010392346419394016,
        -0.030109915882349014,
        -0.082239530980587,
        0.012971657328307629,
        -0.006375848315656185,
        -0.0022620719391852617,
        0.03197995573282242,
        0.026406098157167435,
        0.033566899597644806,
        -0.08826914429664612,
        -0.040167566388845444,
        0.08046657592058182,
        0.016915781423449516,
        0.016612175852060318,
        0.007359122391790152,
        0.0647994875907898,
        -0.06442025303840637,
        -0.027588117867708206,
        0.014247311279177666,
        -0.013253805227577686,
        0.05758021026849747,
        0.14827609062194824,
        -0.030961185693740845,
        0.015221839770674706,
        0.0788131132721901,
        -0.016124550253152847,
        0.04476819187402725,
        -0.02783580869436264,
        0.022987939417362213,
        0.016911577433347702,
        -0.006577543448656797,
        -0.03678714483976364,
        0.03918267786502838,
        -0.01838110014796257,
        0.040046099573373795,
        0.033778879791498184,
        0.013832522556185722,
        -0.10651934891939163,
        -0.024132568389177322,
        0.0425606369972229,
        0.1349393129348755,
        0.044960130006074905,
        -0.0031404250767081976,
        0.009734323248267174,
        -0.0042144786566495895,
        -0.06702311336994171,
        -0.06239078566431999,
        0.04920905455946922,
        -0.00690601859241724,
        0.06976151466369629,
        0.03362785279750824,
        -0.049284420907497406,
        -0.1016841009259224,
        -0.052063748240470886,
        -0.019079046323895454,
        0.10029502213001251,
        0.03104039467871189,
        -0.005098795983940363,
        -0.10752959549427032,
        0.07318630069494247,
        -0.06260182708501816,
        -0.04317774623632431,
        -0.01317682582885027,
        -0.02947024255990982,
        -0.06400744616985321,
        -0.014779044315218925,
        0.07954996824264526,
        -0.06211813539266586,
        -0.062306053936481476,
        -0.02886193059384823,
        -0.05018561705946922,
        -0.013055138289928436,
        0.006108651868999004,
        0.07053150981664658,
        -0.04822787642478943,
        2.7176946336301496e-33,
        -0.05060562118887901,
        0.04861952364444733,
        -0.06006501242518425,
        -0.07587207853794098,
        0.008869006298482418,
        0.02175229601562023,
        0.011745958589017391,
        0.018521318212151527,
        0.0003282239777036011,
        0.01648714765906334,
        -0.015303540043532848,
        0.029776297509670258,
        -0.06715519726276398,
        0.030530182644724846,
        0.039745502173900604,
        -0.02067655697464943,
        -0.054868560284376144,
        0.05963895842432976,
        0.06137644127011299,
        0.010246219113469124,
        0.014353989623486996,
        0.0255234744399786,
        0.04684638977050781,
        -0.010501808486878872,
        0.044471655040979385,
        -0.03662659227848053,
        -0.03403087332844734,
        -0.005126550793647766,
        0.11195399612188339,
        0.03129024803638458,
        -0.02207443304359913,
        -0.07590910792350769,
        0.0358833484351635,
        -0.04204101860523224,
        0.027213934808969498,
        0.04238390922546387,
        -0.02667093463242054,
        -0.09075009822845459,
        0.040093328803777695,
        -0.030909983441233635,
        0.011344391852617264,
        0.03166566044092178,
        -0.11294881254434586,
        -0.07179945707321167,
        -0.03298197686672211,
        0.04921623319387436,
        0.061987634748220444,
        -0.029752155765891075,
        -0.035633672028779984,
        0.03706665709614754,
        -0.0777595043182373,
        0.05690348520874977,
        -0.07371491938829422,
        -0.0018560463795438409,
        0.029496818780899048,
        -0.02307753637433052,
        0.007727980613708496,
        -0.04122889041900635,
        0.09717649221420288,
        0.03170119598507881,
        -0.008142347447574139,
        -0.011904465034604073,
        0.03725193440914154,
        -0.01928524114191532,
        -0.06780670583248138,
        0.05642853304743767,
        0.07729227840900421,
        -0.03456757590174675,
        -0.057202115654945374,
        -0.008399328216910362,
        -0.025941334664821625,
        -0.027564382180571556,
        0.0053518181666731834,
        -0.022113744169473648,
        0.051753561943769455,
        0.00410119304433465,
        -0.0920012965798378,
        0.010611492209136486,
        0.01614007167518139,
        0.0011524823494255543,
        -0.05986887589097023,
        0.02924617938697338,
        0.0702226385474205,
        0.06501652300357819,
        0.021750442683696747,
        0.0010351965902373195,
        0.051768507808446884,
        -0.04104617238044739,
        -0.04129753261804581,
        0.046165887266397476,
        -0.036944277584552765,
        0.0035025610122829676,
        -0.0048477197997272015,
        0.026721080765128136,
        -0.034259043633937836,
        -4.185851261963685e-33,
        -0.07837389409542084,
        -0.011158994399011135,
        -0.03301994875073433,
        0.037123098969459534,
        -0.045677632093429565,
        -0.049205929040908813,
        0.017606031149625778,
        0.021855497732758522,
        0.02447553351521492,
        -0.026780813932418823,
        0.024706343188881874,
        0.0032548648305237293,
        -0.09412435442209244,
        -0.0543576180934906,
        0.03014335222542286,
        -0.10731246322393417,
        0.046449676156044006,
        -0.07247167080640793,
        0.042996954172849655,
        -0.05623375251889229,
        0.10610628873109818,
        -0.006203889846801758,
        -0.028009753674268723,
        0.03324040770530701,
        0.03250961750745773,
        0.02165583334863186,
        -0.023613406345248222,
        0.024874350056052208,
        0.004192291758954525,
        0.01030269730836153,
        0.01734498143196106,
        -0.01615234464406967,
        0.0019679113756865263,
        -0.010053563863039017,
        0.07029321044683456,
        -0.022793041542172432,
        0.07635355740785599,
        0.11549632996320724,
        -0.015059483237564564,
        -0.044411201030015945,
        0.028295429423451424,
        -0.04978872835636139,
        -0.028840629383921623,
        -0.02102351188659668,
        -0.02223355509340763,
        -0.08338725566864014,
        -0.031665265560150146,
        -0.10836879909038544,
        0.006068281829357147,
        0.0025137353222817183,
        0.035710711032152176,
        -0.069492869079113,
        0.08313467353582382,
        -0.034044764935970306,
        -0.04714226722717285,
        0.03381108120083809,
        0.029359320178627968,
        0.050362009555101395,
        0.019434118643403053,
        0.0065727015025913715,
        0.11935778707265854,
        -0.019450178369879723,
        -0.031170742586255074,
        -0.021920859813690186,
        0.003378694411367178,
        -0.08746249228715897,
        0.057060107588768005,
        0.00869143195450306,
        -0.029039429500699043,
        -0.011030120775103569,
        -0.011939792893826962,
        -0.023331252858042717,
        -0.0008352293516509235,
        -0.10293110460042953,
        -0.07192454487085342,
        0.027285581454634666,
        0.028939856216311455,
        -0.0264583770185709,
        -0.008823123760521412,
        -0.04698828235268593,
        -0.01875615119934082,
        0.0804755687713623,
        0.0742018073797226,
        0.011613935232162476,
        0.042714040726423264,
        0.02424384281039238,
        0.08025742322206497,
        -0.012162938714027405,
        0.01853581704199314,
        -0.03876427188515663,
        -0.09511193633079529,
        -0.011063843965530396,
        -0.06144547089934349,
        0.08180844783782959,
        -0.009939944371581078,
        -6.360528459481429e-08,
        -0.040034692734479904,
        -0.00594792515039444,
        0.028293821960687637,
        0.05606679990887642,
        -0.00736570917069912,
        -0.0767098069190979,
        -0.04199230298399925,
        0.006460241507738829,
        0.060417722910642624,
        0.023575633764266968,
        0.08741792291402817,
        -0.08830761909484863,
        -0.09191153943538666,
        0.024754516780376434,
        0.03684452921152115,
        0.03412861004471779,
        -0.09301004558801651,
        0.07109563052654266,
        -0.054617103189229965,
        -0.003685601055622101,
        -0.030650345608592033,
        0.08599544316530228,
        0.07125166058540344,
        -0.024472663179039955,
        0.04315929859876633,
        0.05647866427898407,
        0.07242748886346817,
        0.05721152201294899,
        0.1541154533624649,
        -0.010202198289334774,
        -0.06407006829977036,
        0.020187627524137497,
        0.005992532707750797,
        0.0575588122010231,
        0.008159800432622433,
        -0.06155127286911011,
        -0.03659389540553093,
        0.07845540344715118,
        0.06957004219293594,
        0.06360867619514465,
        -0.03467639535665512,
        -0.013631267473101616,
        0.02858767844736576,
        0.03217099979519844,
        0.05977242812514305,
        -0.02679734118282795,
        -0.05496672913432121,
        -0.00524516124278307,
        0.004549301229417324,
        -0.004066227003931999,
        -0.030135808512568474,
        0.010963530279695988,
        -0.06000284105539322,
        0.03939203917980194,
        0.05009273812174797,
        -0.10815824568271637,
        -0.0033302579540759325,
        0.006068303715437651,
        -0.06616201251745224,
        0.07702784240245819,
        -0.015202632173895836,
        -0.12978960573673248,
        -0.002808114979416132,
        0.09450890868902206
    ]
}