{
    "id": "K9BMWhYrE98",
    "title": "Samsung Galaxy Note 8 Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-09-05T15:09:39Z",
    "video_url": "https://www.youtube.com/watch?v=K9BMWhYrE98",
    "category": "Science & Technology",
    "tags": [
        "galaxy note 8 review",
        "galaxy note 8 unboxing",
        "galaxy note 8 specs",
        "galaxy note 8 mrmobile",
        "note 8 vs s8+",
        "galaxy note 8 vs galaxy s8",
        "note 8 vs s8",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 701619,
    "likes": 19341,
    "comments_count": 1449,
    "description": "6.3; 3300; 195; 12. Samsung's new Galaxy Note 8 is awash in numbers  but theres only one that really matters: 105. Thats how many dollars more youll dole out at the register if you choose the Galaxy Note 8 over its close cousin, the Galaxy S8+. In exchange, youll get a larger screen, dual cameras, a few spec bumps  and the most misunderstood accessory in smartphones. Many folks are asking if adding a stylus is worth all that extra dough  and I'm here to help answer that question. Im MrMobile and this is the Galaxy Note 8 review.   [SPONSOR]  Brought to you by dbrand. Skin your Galaxy Note 8 here:     [SUBSCRIBE]     [ABOUT THE GALAXY NOTE 8 REVIEW]  MrMobile's Galaxy Note 8 Review was produced after ten days with a US Galaxy Note 8 review device on loan from Samsung. The device received multiple software updates to Bixby during the review period. It was tested on T-Mobile US in Greater Boston and Project Fi in Boston and Berlin, Germany.   Some footage by Mark Guim [Mobile Nations] for Android Central.   [FURTHER READING]  Where to buy the Galaxy Note 8 [Android Central]:   Galaxy Note 8 Review [Android Central]:    [MUSIC]  Days and Days by Eternity Bro, available at Premium Beat:   \"Urban Odyssey\" by Jake Silver, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://dbrand.com/mrmobile-note8",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/where-buy-galaxy-note-8",
        "https://www.androidcentral.com/samsung-galaxy-note-8",
        "https://www.premiumbeat.com/royalty_free_music/songs/days-and-days",
        "https://www.premiumbeat.com/royalty_free_music/songs/urban-odyssey",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] 6.3, 195, 12. The newest Samsung Galaxy Note is awash in numbers, but there's only one that really matters, 105. That's how many dollars more you'll dole out at the register if you choose the Note 8 over its close cousin, the Galaxy S8 Plus, and in exchange, you'll get a larger screen, dual cameras, and the most misunderstood accessory in smartphones. I'm Mr. Mobile, and this is the Galaxy Note 8 review, brought to you by dbrand. (techno pop music) You know what they say about the pen being mightier, so let's kick things off with that. Just like every year, the new S-pen clicks into a little silo on the corner of the phone. Ask a Note owner to demonstrate the S-pen and they'll probably start by showing you how quick it is to take a screen off memo, or they'll but out the brushes, colors, and textures inside Samsung Notes, which packs enough versatility to let you kick out some pretty detailed doodles. If they have a Note 8, they may whip up a live memo, which lets you share brief, animated sketches with friends. It's all very cool and cute for an elevator pitch, but the people who criticize the S-pen as superfluous do have a point. For most folks, once the honeymoon phase wears off, the doodling dies down. Writing on a screen this size with a pen this size just isn't comfortable enough to wanna do for a long time, but here's the thing. When I carry a Note, I use the S-pen every day, just not for artwork. A good example is signing PDFs. You see, the Note always debuts at the time of year my apartment lease comes up for renewal, so every year I end up signing and sending it from the phone. When I need to memorize a script or looking something up in Kindle, the S-Pen is a great highlighter, and it's a smart one, too. It can translate text into different languages on the fly. And look, as great as it was when we traded resistive screens for capacitive ones about a decade ago, you've gotta admit we lost something in the process. Your big, blunt fingertip will never be as precise as the point of a pen, and being able to hit those small touch targets or scroll a list with a hover or click that tiny little subscribe button on a YouTube channel, (clears throat) it's all much easier with a stylus. I've been saying this for years, the S-pen is as indispensable to the Galaxy note as a mouse is to a computer. Let's talk about the Note 8's other big upgrade, that big honking camera module. How you feel about this thing is gonna depend on what kind of pictures you take. Do you snap a lot of long distance shots of tall buildings? Or singers on stage? Do you zoom in on strange pigeon breeds you've never seen before? If you do, that secondary camera with its telephoto lens will be very welcome, especially since its optically stabilized, just like its conventional neighbor, and that OIS works very well. If you take a lot of portraits of friends, you'll like the faux depth of field effect, too, which you can adjust even after the shot. That is, you'll like it when it works right. Using software to try to discern subject from background is almost always hit or miss, and despite all its processing power, the Note 8 is no exception. Unless you've got a very consistent background, expect this to look janky. Also, Samsung calls its primary camera a wide angle, but this is deceptive. At 77 degrees, it's only wide in comparison to the telephoto, so if you're trying to take a picture of, say, your dinner, or any photo in a confined space, you have to hold your phone annoyingly far away to fit it all in. Aside from those beefs, though, I've got nothing to complain about. This is a phone you can fire up at sunrise and use in basically every lighting condition you're likely to find through the course of the day, including pouring rain, because the phone's water resistant, and for most folks, it's almost never gonna let you down. It brings a great combination of speed, reliability, and versatility, and that goes for the selfie shooter, too, though its beauty mode does tend to go heavy on the virtual bronzer. Ooh, yeah, that's transfer complete. That's an Alex face. - Heard that drop. - [Michael] What you think about that? - [Friend] It's a good thing, because I'm curious, you know? I would wanna know why that happens. - [Michael] Yeah. - [Friend] I like that other people do, too. - [Michael] Yeah. (wind blowing) The Note 8 has taken some heat for its battery, and not just because of what happened to the Note 7. We're talking size here. 3300 milliamp hours isn't small, but it is typical, and to some Note buffs, typical is a bad word. See, the whole shtick of the Note line is that it's atypical. When the first one launched, it was mercilessly mocked for its size and its stylus, until it sold millions of units and became one of the most successful smart phone families in history. As some see it, that success came from Samsung refusing to settle, and this battery definitely feels like settling a bit. For what it's worth, the company told me this has nothing to do with safety, but rather a simple matter of just not having enough space to put a bigger battery in, thanks to the internal volume claimed by the S-pen and the dual camera system. This is probably also why the fingerprint scanner is still way up by the cameras, by the way, an uncomfortable placement that means you should probably get used to using the iris scanner instead. Sadly, that scanner is just as inconsistent as last year, in my experience. But Samsung has efficient hardware and smart software on its side, and so the Note 8 gets me through even moderately heavy days pretty okay. I watched about two hours of downloaded Netflix on this gorgeous 6.3 inch display, and the phone still had enough to see me through an afternoon of navigating and photographing Berlin, even when I had to occasionally max out the brightness to overcome sunlight, which the display did easily. When you do run low, fast charging is here, as always, and if you forget your cable at home and need to top up on the go, you can swing by a Starbucks, slap this sucker down on a wireless charger. Preorder before September 24th, and you also get a fast wireless charging pad and 128 gig micro-SD card for free. A couple notes before we wrap up. Phone calls are great, and I love the extra volume options Samsung builds into its dialer, which helps that otherwise dinky single speaker make itself heard on loudspeaker calls. If you wanna keep those calls to yourself, the phone ships with comfortable AKG-tuned ear buds, which sound fine, but fall short of the fancier buds that come with phones like HTC's U11. Also, the Note 8 includes a dedicated button for the Bixby digital assistant. Samsung just pushed an update enabling voice support a little bit before the review date, though, so I still need more time to decide how I feel about it. Frankly, I'm not terribly confident that Samsung has the user data to support this feature, and at the very least, I wish I had the ability to reprogram that button to do something else, but I'm still withholding judgment. I'm sure Android Central has a few words though. I'll link you to their review in the description. For the past few years, my Galaxy Note review process has followed the same arc. I start out disappointed because it doesn't initially live up to my high expectations, but after a week of using it, when I collect all my thoughts and actually write the review, the good stuff outweighs the bad by like five to one. True, it's not a crazy envelope pusher anymore, but to be honest, the Note hasn't been for a long time. It's grown up, and it's made the compromises that come with that. As a result, it now appeals to a wider swath of people. If you don't care about the pen but love the rest of the package, yeah, you should snap up the S8 Plus. You get almost everything I've just talked about, but the S-pen does lend the Galaxy Note 8 a semblance of the specialness the line once possessed, and so dismissing it entirely is a mistake, just like dismissing that first Galaxy Note was all those years ago. In the U.S., the Note 8 is already shipping as this video goes to the server, and it comes in orchid gray and midnight black, the latter of which is a smudge fest of spectacular proportions. If it turns out to be as fragile as its Galaxy S cousins have turned out to be, you'll wanna fight the scratches and the smudges with a premium vinyl skin from dbrand. Choose from 25 different finishes to create a custom color cocktail unique to your Note 8. Get yours at the link in the description, and follow The Mr. Mobile on Twitter and Facebook, where I'll be taking your questions about the Note 8 that I didn't get to here. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Galaxy Note",
        "Note",
        "Samsung Galaxy Note",
        "Galaxy Note review",
        "Spen",
        "Galaxy",
        "inside Samsung Notes",
        "newest Samsung Galaxy",
        "Samsung",
        "Samsung Notes",
        "phone",
        "Samsung Galaxy",
        "Notes",
        "Note review",
        "Note review process",
        "Note line",
        "time",
        "review",
        "Note owner",
        "year"
    ],
    "transcript_entity_values": [
        "3300 milliamp hours",
        "AKG",
        "micro-SD",
        "77 degrees",
        "12",
        "195",
        "the Galaxy S8 Plus",
        "Kindle",
        "Samsung Galaxy Note",
        "6.3 inch",
        "Galaxy Note",
        "128",
        "U11",
        "the S-pen",
        "Galaxy Note",
        "Samsung",
        "Berlin",
        "millions",
        "last year",
        "a week",
        "YouTube",
        "the S-Pen",
        "Facebook",
        "25",
        "Mobile",
        "Android Central",
        "about a decade ago",
        "Bixby",
        "about two hours",
        "Starbucks",
        "first",
        "the past few years",
        "max",
        "the time of year",
        "Michael",
        "U.S.",
        "105",
        "Samsung Notes",
        "the day",
        "Galaxy",
        "September 24th",
        "midnight",
        "the S8 Plus",
        "years",
        "Alex",
        "Galaxy S",
        "HTC",
        "Netflix",
        "only one",
        "Twitter",
        "Galaxy Note 8",
        "8",
        "afternoon"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME"
    ],
    "vector": [
        -0.08984445780515671,
        0.05404376611113548,
        0.07806862890720367,
        -0.05735688656568527,
        0.008652403950691223,
        0.026306550949811935,
        0.012312328442931175,
        0.1940574049949646,
        0.01280284021049738,
        0.011604547500610352,
        0.03385728970170021,
        0.03623449429869652,
        0.019845368340611458,
        0.012295753695070744,
        0.0300663523375988,
        -0.010305698961019516,
        0.1063205674290657,
        -0.13093362748622894,
        -0.06412455439567566,
        0.065887451171875,
        0.09860789030790329,
        -0.04776547849178314,
        0.0888247862458229,
        -0.0524313785135746,
        0.056181084364652634,
        -0.010881785303354263,
        -0.03588547930121422,
        -0.08270152658224106,
        -0.01618080586194992,
        0.013538289815187454,
        -0.05357837677001953,
        0.1300673484802246,
        0.009397136978805065,
        -0.02188917249441147,
        -0.002512664068490267,
        -0.05814731493592262,
        0.04981710761785507,
        0.006659052800387144,
        0.013697751797735691,
        0.029896527528762817,
        -0.0564303919672966,
        -0.013686471618711948,
        0.0006322151166386902,
        -0.02328340895473957,
        0.034536588937044144,
        -0.06554694473743439,
        0.081304170191288,
        0.0398942232131958,
        -0.016572333872318268,
        0.03017519786953926,
        0.0022574872709810734,
        -0.01710965856909752,
        -0.026279451325535774,
        -0.011600951664149761,
        -0.03256583958864212,
        -0.00100304139778018,
        0.021725336089730263,
        -0.00047390416148118675,
        0.053821731358766556,
        -0.009705194272100925,
        0.010119780898094177,
        -0.03984132036566734,
        0.045925501734018326,
        0.025816552340984344,
        0.00437542237341404,
        -0.003267096122726798,
        0.011880558915436268,
        -0.10394462198019028,
        0.013480485416948795,
        -0.00787524413317442,
        -0.00040333924698643386,
        0.03234552964568138,
        0.051660582423210144,
        0.026892628520727158,
        0.002675045980140567,
        0.027510320767760277,
        0.039982691407203674,
        0.029251042753458023,
        -0.04037245735526085,
        -0.06398022174835205,
        0.0233386792242527,
        -0.05177060142159462,
        0.016157403588294983,
        -0.0290322657674551,
        0.08169955760240555,
        -0.023369960486888885,
        -0.04222096502780914,
        0.016240688040852547,
        -0.04517751187086105,
        -0.011437550187110901,
        0.06080356985330582,
        0.1271735429763794,
        -0.044125035405159,
        -0.06074852496385574,
        -0.04639040306210518,
        0.006657749880105257,
        -0.0696258395910263,
        -0.027400827035307884,
        -0.0015737429494038224,
        0.021726315841078758,
        0.09382720291614532,
        0.003209914080798626,
        0.03288766369223595,
        0.09331154078245163,
        0.0779021605849266,
        -0.02927437610924244,
        -0.0027793380431830883,
        -0.049224212765693665,
        -0.026593433693051338,
        -0.05598542466759682,
        0.04876935854554176,
        0.03932434320449829,
        0.0010368946241214871,
        -0.023219730705022812,
        -0.017010830342769623,
        -0.02253163978457451,
        -0.035366225987672806,
        0.03917432203888893,
        0.11853426694869995,
        0.09219656139612198,
        -0.009798695333302021,
        -0.0009384173317812383,
        -0.06995569914579391,
        -0.06157504767179489,
        -0.045044686645269394,
        0.05949243903160095,
        -0.05426212400197983,
        4.495559860600787e-33,
        -0.028728188946843147,
        0.12165399640798569,
        -0.020673785358667374,
        -0.06998025625944138,
        -0.019328875467181206,
        -0.034559592604637146,
        -0.05492554232478142,
        0.031108295544981956,
        0.006893497426062822,
        -0.05468962714076042,
        -0.03517353907227516,
        -0.005942721851170063,
        0.009321874938905239,
        0.060485199093818665,
        0.040879372507333755,
        -0.03452038764953613,
        0.01896645501255989,
        0.004730274435132742,
        0.027433689683675766,
        0.006499199662357569,
        0.007689769379794598,
        -0.11284895986318588,
        0.032199226319789886,
        -0.020536676049232483,
        0.012438633479177952,
        0.045448947697877884,
        0.08144843578338623,
        0.016346711665391922,
        0.047355424612760544,
        -0.0261322520673275,
        -0.12929464876651764,
        0.010712486691772938,
        0.033305320888757706,
        -0.07740394026041031,
        -0.001169561524875462,
        -0.05987212434411049,
        -0.0005537024699151516,
        -0.08851097524166107,
        0.030191173776984215,
        -0.096591055393219,
        0.023415515199303627,
        0.07115166634321213,
        -0.033313341438770294,
        0.009480362758040428,
        0.025996223092079163,
        -0.00048553760279901326,
        -0.09520555287599564,
        -0.04840627312660217,
        0.03063533827662468,
        0.0057729086838662624,
        0.003800677601248026,
        -0.034885529428720474,
        -0.02539796009659767,
        0.027058184146881104,
        -0.09112740308046341,
        -0.031258970499038696,
        0.03803398087620735,
        -0.08608817309141159,
        0.02208893932402134,
        0.06752320379018784,
        0.032564952969551086,
        0.06558237224817276,
        -0.0157912727445364,
        -0.016678526997566223,
        -0.07512868195772171,
        0.04965957626700401,
        0.005510157439857721,
        0.0072605120949447155,
        -0.03785933181643486,
        -0.008642145432531834,
        -0.01232144795358181,
        -0.009685147553682327,
        0.027794886380434036,
        0.026847470551729202,
        0.025079919025301933,
        -0.02785777673125267,
        -0.033049046993255615,
        0.014398696832358837,
        0.0202949158847332,
        -0.01537298783659935,
        -0.051362041383981705,
        0.014889020472764969,
        0.031455088406801224,
        -0.017203014343976974,
        -0.008218362927436829,
        -0.03168157488107681,
        0.018003476783633232,
        -0.12261351197957993,
        0.009224901907145977,
        0.009092816151678562,
        -0.05127258598804474,
        -0.003935825079679489,
        -0.028333956375718117,
        0.02004917711019516,
        -0.035029202699661255,
        -6.066342104877901e-33,
        -0.11011480540037155,
        -0.003641191404312849,
        -0.017314599826931953,
        -0.0003356768283993006,
        -0.02571023814380169,
        0.0015476831467822194,
        0.030176574364304543,
        -0.019521916285157204,
        0.013034407049417496,
        -0.042472753673791885,
        -0.03875657916069031,
        0.038198322057724,
        0.048853810876607895,
        -0.04292986914515495,
        -0.018947778269648552,
        -0.009493431076407433,
        -0.03927253559231758,
        -0.0515107586979866,
        0.05456237494945526,
        -0.057958245277404785,
        0.04660172015428543,
        0.0006680989172309637,
        0.07363928854465485,
        0.10515964776277542,
        -0.01600608229637146,
        -0.04816308990120888,
        -0.04924898222088814,
        -0.048166673630476,
        0.04218567907810211,
        -0.016672436147928238,
        0.101474829018116,
        -0.05619754269719124,
        -0.04914557561278343,
        0.10684548318386078,
        0.0267025139182806,
        -0.008526473306119442,
        0.05286410078406334,
        -0.08054736256599426,
        0.07460576295852661,
        0.02376767247915268,
        0.10054361820220947,
        -0.02397829107940197,
        0.04932360723614693,
        0.022013382986187935,
        -0.056365448981523514,
        0.03427533060312271,
        0.01197393611073494,
        0.004178232047706842,
        -0.09207985550165176,
        0.03042619675397873,
        0.03503530099987984,
        -0.005057147238403559,
        -0.027120260521769524,
        -0.0448518842458725,
        -0.09987660497426987,
        0.028904223814606667,
        0.05608183890581131,
        -0.0425332635641098,
        0.027942895889282227,
        0.007402250077575445,
        0.08688616007566452,
        0.08217684924602509,
        -0.06081349402666092,
        -0.06230435147881508,
        -0.03395960479974747,
        0.033069830387830734,
        0.0818585678935051,
        -0.008223963901400566,
        0.018419897183775902,
        0.029643956571817398,
        0.0002420636301394552,
        -0.01329919882118702,
        -0.06189269572496414,
        -0.05326220020651817,
        0.06124625355005264,
        0.13088244199752808,
        -0.02282572351396084,
        -0.07961458712816238,
        -0.015312952920794487,
        -0.0807618573307991,
        -0.02421993762254715,
        -0.03772339969873428,
        0.08453530818223953,
        -0.009808877483010292,
        0.04060118645429611,
        -0.03274794667959213,
        0.019115308299660683,
        -0.07674260437488556,
        -0.023619288578629494,
        0.10750030726194382,
        -0.03703852370381355,
        -0.03136900067329407,
        -0.08745718002319336,
        0.024845441803336143,
        -0.009269309230148792,
        -5.208474718187972e-08,
        0.009620021097362041,
        0.015193238854408264,
        0.02734590880572796,
        -0.0684247836470604,
        0.03144778683781624,
        -0.11634248495101929,
        -0.026910053566098213,
        -0.03312335163354874,
        0.055908191949129105,
        -0.005801061633974314,
        -0.008379378356039524,
        -0.14340883493423462,
        -0.09228875488042831,
        -0.029795734211802483,
        -0.005698433145880699,
        0.008779232390224934,
        0.03141988441348076,
        0.07072465866804123,
        -0.03195253014564514,
        0.00617761816829443,
        0.026149678975343704,
        0.06621093302965164,
        -0.007373005151748657,
        -0.08455024659633636,
        0.0652209147810936,
        0.006308490876108408,
        -0.06391441076993942,
        0.08372832089662552,
        0.009073962457478046,
        -0.05654214695096016,
        0.08112490922212601,
        0.03834500163793564,
        -0.033792201429605484,
        0.014978671446442604,
        0.02638595923781395,
        -0.0692937821149826,
        -0.010327482596039772,
        0.041198741644620895,
        0.048911336809396744,
        0.08835811167955399,
        -0.007876822724938393,
        -0.061786189675331116,
        -0.07093043625354767,
        0.03096987120807171,
        0.004776140674948692,
        -0.09110963344573975,
        -0.01046691183000803,
        -0.12146463990211487,
        -0.018224848434329033,
        0.07300346344709396,
        0.004449690692126751,
        -0.05686080828309059,
        -0.019156841561198235,
        -0.0009740343084558845,
        -0.01558837853372097,
        -0.06121193245053291,
        0.03678685799241066,
        -0.013637717813253403,
        0.02224104106426239,
        0.041462015360593796,
        0.0657881498336792,
        -0.07516824454069138,
        0.041622232645750046,
        0.04244697093963623
    ]
}