{
    "id": "K_gXJK7SIRs",
    "title": "I built an Xbox inside a PS5!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-05-08T17:09:38Z",
    "video_url": "https://www.youtube.com/watch?v=K_gXJK7SIRs",
    "category": "Science & Technology",
    "tags": [
        "ps5",
        "xbox",
        "playstation",
        "playstation 5",
        "xbox series s",
        "psbox",
        "game console",
        "gaming",
        "console",
        "ultimate",
        "building the ultimate",
        "ps 5",
        "x box",
        "sony",
        "microsoft",
        "asus",
        "rog",
        "strix",
        "xg34uq",
        "monitor",
        "tv",
        "austin",
        "austin evans",
        "psready",
        "ps ready"
    ],
    "views": 964550,
    "likes": 31049,
    "comments_count": 2056,
    "description": "Learn more about the ROG Strix XG43UQ HDMI 2.1 gaming monitor:  I \"improved\" a PS5 with an Xbox Series S.  A closer look at the PSBox over on @PSReady:   The ultimate PS5 has an Xbox Series S inside!  My new podcast @TheBackmarkers!  I have a TikTok!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://austin.tech/strix",
        "https://www.youtube.com/watch?v=TwxSTk_-D50",
        "https://www.relay.fm/testdrivers",
        "https://www.tiktok.com/@austintechtips",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- It's the moment of truth. (intense music) (beeps) Yeah! - [Matt] Oh! - [Austin] The PSbox! It lives! There's no doubt that PS5 is an impressive console and the mods have already begun. Not only have we done a custom PS5 with the dbrand Darkplates, as well as, for some reason, we built a Switch inside. Someone has water cooled a PS5. Someone even built an entire PS5 out of brass. You know what no one has done yet? Give the PlayStation what it really needs. Some, uh, extra horsepower. You've already seen the title of this video. You know where this is going. To really do justice to a project like this, I hit up my boy, James, who has more than his fair share of experience in building some of these crazy, crazy projects. That straight up looks like a PS5 pro or something, right? I mean, it's super distinctive as a PS5 but also ridiculously chonky. - It screams it has power in it. This is mainly just a concept you're seeing. Like here, you'll have to fine tune it. - Aw, man. Let's do it! With James on board, I'm feeling a lot better about the project, but the ultimate test is going to be this. Can we pull off the PS5 Xbox hybrid or are we going to spectacularly crash and burn? Then you might be wondering why we're starting out with the digital edition. Well, a couple of months ago, we decided to build the ultimate PS5, and as part of that, we used this. So, this is a side panel from the disk version of the PS5, which as you can see, if you put this side panel on a digital edition, gives you a lot of extra space. For that video, we built in a Nintendo Switch inside the PS5, but this time, we're going a little bit bigger. And by a little bit bigger, I mean a whole lot bigger. And you might be wondering, why are we using an Xbox Series S? The main reason is due to the size as well as the heat. The Series S, while is a very capable console, is nowhere near as bulky and especially hard to package as the Series X is, and on top of that, is going to be much easier to cool. Oh, why, thank you, Matt. So, of course, if we're going to be building the ultimate PSbox, we're going to need the ultimate display for it. So, huge shout-out to ASUS for sponsoring this madness and for providing the ultimate display for the PlayStation 5 and the Series X. This is the ROG Strix XG43UQ. So, it does come with HDMI 2.1 cables, which is important. So, unlike most monitors, once you get up to that, like, 4K, 120 Hertz, you really, actually need a properly certified cable. We also, of course, have DisplayPort as well if you're hooking this up to the PC. And let's be real. You're getting a nice monitor like this. The ideal setup is really hooking up both your PC and your console to it. There we go. Ooh! Look at that nice padding. (grunting) That is 43 inches of gaming power. Oh wow. Okay. So, we have DisplayPort, four HDMIs, Aura Sync, as well as we have a couple of USB ports, as well as audio. You see it's an actual, nice anti-glare display as well. All right. I gotta get a PlayStation built for this. (laughs) Okay. Oh boy. Is that some double-sided tape? Ooh, 3M. That must mean we're getting fancy. Now, James did a lot of custom work here. And that, yeah, that looks very custom. I'm just realizing how much is about to be involved in building this. So, we're taking advantage of some of these screw holes that were already put in place by our kind friends at Sony. Oh, wow! That's some engineering right there! So, immediately, you can start to see where we're going with this. Because we're gonna have this extra sort of depth, imagine Series S live in something like that inside. Ah, that'll be helpful, wouldn't it? Oh, wow! Look at that! That just goes on like that? Are you kidding me? You know, this kinda reminds me of like, Legos, except that I suck at building Legos, so. - [Matt] It you so long to build the easiest set possible. - Oh, this is the actual 3D printed base. Look! It's even got the Xbox logo on it! Are you kidding me? The Series S just drops in like that. Look at that. So, now you can start to see the bones of our PSbox come together. So, because we actually have a reasonable amount of space here, I still think the PlayStation 5 will actually get enough air flow. And on the other side, you'll see that the Xbox is going to be able to pull out and sort of exhaust from this side. I don't know exactly how much cooling it'll really have, but ultimately, as long as it works. It runs a little toasty, that's fine, right? Running a little toasty never hurt anybody, right? Woo hoo hoo hoo! That is what I am talking about! So, we have the ethernet, USB, HDMI, and the figure eight power cable. And to be fair, we only have one USB. So, you are giving up a couple of USBs, but like, whatever. That's totally fine. As long as I could plug some stuff in. That, my friends, is the real final piece. So, what this is gonna do, is this is going to line up something like that. And then, I guess we're just gonna bend it down. Woo! We got a little, uh, a little, uh, pressure needed. The main thing we have to be very careful of, is there's a lot of alignment, right? So, we have not only the power button for the Xbox and the PS5, but also the USB ports, as well as there's a little button on the front, which is specifically for the controller sync. There's just a lot of things that need to be very precisely aligned. And once you start to put it down, you're hearing everything, and then you got to tear it all back if something's slightly off. I am and on the top. So, this I should just go on, since this has not really been touched. So, the other side panel has been slightly modified, and by slightly modified, I mean, well, clearly, it's not gonna work exactly the way it did before. So, see some very helpful one, two, three little stickers. Magnets? - You'll see, these are just screws. - Okay. - Labeled one, two, and three. - [Austin] Oh, so, we're just gonna go like that? - [Wes] Yep. - [Austin] Wow! Okay! No wonder these are such strong magnets. There's one, two, and there's one up here. All right, here goes nothing. Very hard. Oh, wait. Can I do it? Is the PSbox done? Have we successfully built the PSbox? Look at this! Look at this! Inside this box is not only a PlayStation 5, there's also an Xbox! Therefore, the name! PSbox! - [Matt] Yeah! - Thanks, Matt. I'm glad someone's excited about the PSbox! So, let's fire up our ROG Strix XG43UQ display and hope that our PSbox comes to life. (beeps) Oh, look, you can even see. Oh, I didn't even realize this! So, you've got the blue LEDs on the inside, but obviously, it doesn't work on the other side. Well, look at that. We immediately come up on the 43 inch display. Oh, look at this. Look how good that looks! Oh, my God! Ah, so good! So, with our PSbox fully assembled, now it's time to really put it to the test. So, Ken, we're not gonna go head-to-head. We're gonna be a team, we're gonna play some duos, and we're gonna show off exactly what our masterpiece is capable of. We did win when we built the ultimate PS5. I don't know why people are trying to tell me they were playing against bots when they were just clearly upset with our superior Fortnite skill. - We were playing against bots. - [Austin] Flossing. I gotta say, I've definitely never played Fortnite on a PlayStation before. Or a PS5, rather. It looks really nice, though. And of course, I have the superior ROG monitor. So, not only am I getting that full 4K, 120, but I also do have, especially if you're playing on the Xbox side, you do have support for variable refresh rate. And of course, if you're playing on PC, not only do you have that full 4K, 144 Hertz input, but you also have the ridiculous HDR brightness. We're playing at 6% brightness right now. This thing at a 100%. Ken, can you cover me? I'm gonna turn up to 100% and make everyone's eyes bleed at how bright this gets. - [Ken] I can only cover you if you go somewhere good. - [Austin] There we go! There we go! There we go! There we go! There we go! That is a thousand nits of brightness. Do you see the brightness on my face right now? You've got not only all of the frame rate and the response time, but you also get the brightness, which is something that you really don't get on something like an OLED. As much like using TVs for gaming. Ah. Look how bright that is. (laughs) I gotta turn this down. I gotta turn this down. I'm sitting too close to the monitor for full brightness. So, how was your experience on the Series S? - Um, I mean, I'm not noticing, like, bad performance at all, actually. Like, this is totally fine. I mean, it's not as sharp as your 4K experience over there. It's definitely looking like a 1080 game. I mean, the max potential here is that I'm able to play stuff on the Xbox side that I obviously wouldn't have been able to play otherwise on my PS5. So, it is kind of the best of both worlds. I still say that, no, if this was, you know, an ideal console, obviously, I would like a Series X, but that also opens up a different can of worms, right? I feel like that would be a little more difficult. - If you think this is a the big chungus, wait till you see if we do a PS5 and Series X combination. - [Ken] I don't see any action here. Well, that's definitely a wall that someone built. These are, these are definitely a man-made wall. Oh, that's a person. Oh, got one. - I have some potion if you need it. - Um, I'm okay. I have not gotten shot yet. Feeling adventurous today. Oh, there's some stuff over here. Where is this person? Oh, there he is. (laughs) - [Austin] Where are you? You got him? - [Ken] Yeah. Headshot. Let's go. Is that a dinosaur? - [Austin] It's probably a dinosaur. All right, I'm coming, I'm coming. I'm behind you. - [Ken] Oh, oh, oh, oh, oh, oh. Okay, he's looking at me. He's looking at me. Oh, God! Help! Help! Help! Help! Help! - [Austin] Come down, come down, come down. - [Ken] Oh! Oh, Jesus. Okay. Now, though. Shit, oh! - [Austin] Oh, that's definitely a person. - [Ken] Yeah, yeah. That's a person. Oh, geez. - [Austin] Got 'em! - [Ken] Yeah. - [Austin] Got 'em! - [Ken And Austin] There we go. - [Ken] Now I need, now I need some heals. - [Austin] Oh, uh, dudes, dudes, dudes, dudes, dudes. There's a button. There's a thing behind you! Right behind you! Right behind you! - [Matt] It was not gonna attack you until you attacked it. - [Ken] Oh, God, eh, eh eh! Oh, I'm I'm definitely not in a good state right now. - See? This is teamwork right here. Teamwork! - No. You shot the animals that we didn't need to shoot. - [Matt] You're literally the reason he's dead. - [Austin] I'm reviving you, it's fine! There are six people left. So, we're actually in pretty good shape here. - [Ken] I think we're gonna win. - [Austin] I think so, too. - [Ken] Against these bots. Oh, I'm getting shot. Oh, I see 'em. Oh, they're gonna get attacked by the wolves. (Austin laughs) - [Ken] Or the dinosaurs. - [Austin] The dinosaurs are assisting! There's only two other people left. - [Ken] Oh, up there. - [Austin] Oh, dude. They're all over the place. - [Ken] Oh, here, here, here. Wait, wait, wait, wait. There's a dude. There's a dude. Yeah, got it. Ooh, yeah. We got 'em! - Yeah! - [Austin] Teamwork makes the dream work, baby! Thank you very much for watching this episode of Building Something Questionable out of Very Expensive Electronics. Make sure to go check out the ASUS ROG monitor at the link in the description. And of course, if you would like to purchase a PSbox, you can't because. Hey, hey, hey, hey, hey, hey. Be nice to PSbox. Okay? Don't take apart the PS box. - [Ken] It smells like fire. - [Austin] Yeah! Like fire, good!",
    "transcript_keywords": [
        "Series",
        "Yeah",
        "Xbox",
        "PSbox",
        "side",
        "built",
        "moment of truth",
        "Xbox Series",
        "Xbox side",
        "ultimate",
        "lot",
        "Hey",
        "PlayStation",
        "wait",
        "USB",
        "dudes",
        "brightness",
        "good",
        "ROG",
        "building"
    ],
    "transcript_entity_values": [
        "ROG Strix XG43UQ",
        "six",
        "Very Expensive Electronics",
        "2.1",
        "three",
        "Nintendo Switch",
        "the PlayStation 5",
        "thousand",
        "PlayStation 5",
        "the Series X",
        "up to 100%",
        "1080",
        "ASUS ROG",
        "Aura Sync",
        "the Series S",
        "PlayStation",
        "Building Something Questionable",
        "eight",
        "6%",
        "USB",
        "Ken",
        "Austin",
        "ASUS",
        "a couple of months ago",
        "two",
        "Matt",
        "Switch",
        "ROG",
        "four",
        "120",
        "Xbox",
        "HDMI",
        "Hertz",
        "100%",
        "only two",
        "4",
        "Sony",
        "one",
        "James",
        "43 inches",
        "Jesus",
        "PSbox",
        "DisplayPort",
        "Xbox",
        "Legos",
        "Fortnite",
        "the 43 inch",
        "144",
        "hoo hoo hoo",
        "PSbox",
        "PS",
        "PSbox",
        "Darkplates",
        "Wes",
        "today",
        "PS5",
        "The Series S",
        "Series"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "EVENT",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "EVENT"
    ],
    "vector": [
        -0.050300221890211105,
        -0.03139590844511986,
        0.005688935983926058,
        -0.011756658554077148,
        0.14983400702476501,
        -0.04717336222529411,
        0.017336411401629448,
        -0.032347261905670166,
        0.010114534758031368,
        0.05045471340417862,
        -0.09713960438966751,
        0.0849178284406662,
        0.031242813915014267,
        -0.06872651726007462,
        -0.01872830279171467,
        0.013987726531922817,
        0.04820820316672325,
        -0.06572563201189041,
        -0.0898582935333252,
        -0.019292164593935013,
        0.010150894522666931,
        -0.1195276752114296,
        -0.06405438482761383,
        0.03594530001282692,
        -0.050650276243686676,
        0.05730503425002098,
        -0.03315698355436325,
        0.07010575383901596,
        -0.08099126815795898,
        -0.022577421739697456,
        -0.04141366481781006,
        0.00637864600867033,
        -0.03610657528042793,
        -0.04101235419511795,
        -0.026252634823322296,
        0.03526384010910988,
        0.0468582846224308,
        -0.03868052363395691,
        -0.0659981369972229,
        -0.09160511940717697,
        -0.001973673002794385,
        -0.058786891400814056,
        -0.03543257340788841,
        0.08517194539308548,
        -0.01906058005988598,
        -0.021927185356616974,
        -0.011611180379986763,
        -0.14774732291698456,
        -0.01856781542301178,
        -0.049410440027713776,
        -0.019307229667901993,
        -0.046059709042310715,
        0.07836780697107315,
        -0.0626773089170456,
        -0.07336612045764923,
        0.04555455967783928,
        0.03027067892253399,
        0.0029870097059756517,
        0.09472575038671494,
        -0.05620788410305977,
        0.02585403434932232,
        -0.09143196791410446,
        -0.04792170971632004,
        -0.010342207737267017,
        0.036395080387592316,
        0.0025795581750571728,
        0.047714803367853165,
        0.008701392449438572,
        0.03382160887122154,
        0.057132747024297714,
        -0.023608658462762833,
        0.052432864904403687,
        0.043926775455474854,
        0.023789580911397934,
        -0.07507690787315369,
        -0.018274078145623207,
        -0.020645875483751297,
        -0.04666273668408394,
        0.051123518496751785,
        0.05529583618044853,
        0.07547774910926819,
        0.046912916004657745,
        -0.07586648315191269,
        -0.00792613159865141,
        0.005718254018574953,
        0.05392187461256981,
        -0.006510299164801836,
        0.006908816751092672,
        -0.053935423493385315,
        -0.04015854746103287,
        -0.040106672793626785,
        0.04622286185622215,
        0.0387277826666832,
        0.03201165422797203,
        -0.03272608295083046,
        -0.047129519283771515,
        -0.05623932555317879,
        -0.09816586226224899,
        -0.022472891956567764,
        0.059800099581480026,
        0.022979820147156715,
        0.04478577896952629,
        0.04629584774374962,
        -0.04674271121621132,
        0.027005108073353767,
        -0.05098072439432144,
        -0.13360463082790375,
        0.11048564314842224,
        -0.04890036582946777,
        -0.052058905363082886,
        -0.061086591333150864,
        -0.006631781812757254,
        -0.04512966051697731,
        0.001949215424247086,
        0.10269659757614136,
        0.0659608542919159,
        -0.041697908192873,
        0.030852189287543297,
        -0.018104178830981255,
        -0.05833730846643448,
        0.09242267161607742,
        0.01941066049039364,
        -0.1018896996974945,
        0.023862304165959358,
        0.06674838066101074,
        -0.05112358555197716,
        -0.04880845546722412,
        3.463158804446081e-33,
        0.0009302339749410748,
        0.07517139613628387,
        0.08700131624937057,
        0.09637054055929184,
        0.00881845224648714,
        0.03246700391173363,
        0.020514115691184998,
        0.08951688557863235,
        -0.0018025300232693553,
        0.11015160381793976,
        0.06816896051168442,
        0.047837018966674805,
        -0.04530329257249832,
        0.003895761910825968,
        0.08953902125358582,
        -0.04460825398564339,
        -0.040273670107126236,
        0.0007004404324106872,
        -0.022237876430153847,
        -0.017066404223442078,
        -0.002033152850344777,
        0.007937279529869556,
        0.013777516782283783,
        -0.01059813890606165,
        0.0035780849866569042,
        0.10177359730005264,
        -0.05641479790210724,
        -0.09132730960845947,
        0.05703160911798477,
        0.03841922804713249,
        -0.09871438145637512,
        0.011569671332836151,
        -0.027362382039427757,
        0.07964463531970978,
        -0.017580989748239517,
        -0.01630464568734169,
        -0.002183159114792943,
        -0.06159740313887596,
        0.00819468405097723,
        0.06198130175471306,
        0.05638457462191582,
        0.010022851638495922,
        -0.06120840087532997,
        -0.005875322502106428,
        0.008046770468354225,
        -0.01702364906668663,
        -0.008554845117032528,
        -0.04899544268846512,
        -0.09266940504312515,
        -0.020122628659009933,
        0.027755102142691612,
        0.021152416244149208,
        0.0295626912266016,
        0.021233823150396347,
        0.055150773376226425,
        -0.032245196402072906,
        0.026660975068807602,
        -0.008433555252850056,
        0.09085063636302948,
        0.06898009777069092,
        0.03321504220366478,
        -0.04162979871034622,
        -0.005160058382898569,
        -0.004151689819991589,
        -0.07346413284540176,
        0.05207737907767296,
        0.08516247570514679,
        0.004888034891337156,
        0.0232237596064806,
        -0.027741827070713043,
        -0.03240310028195381,
        0.0595223531126976,
        -0.0043260264210402966,
        -0.02618912048637867,
        0.058823369443416595,
        0.0367128849029541,
        -0.047328799962997437,
        0.012386126443743706,
        -0.06821008026599884,
        0.06250791251659393,
        -0.019466834142804146,
        0.016765234991908073,
        -0.04224766418337822,
        0.013985136523842812,
        0.015608109533786774,
        0.039040230214595795,
        0.06252552568912506,
        -0.05225939303636551,
        -0.052999913692474365,
        0.0029047231655567884,
        -0.05493582412600517,
        -0.11165259778499603,
        0.04992830380797386,
        0.04939405992627144,
        -0.04667258635163307,
        -5.115688966641208e-33,
        0.030652012676000595,
        -0.120152048766613,
        -0.0005455164355225861,
        0.00805737730115652,
        0.029442204162478447,
        -0.03330908343195915,
        -0.04312426596879959,
        -0.11262483149766922,
        -0.03983847796916962,
        -0.01730375364422798,
        0.02397947758436203,
        0.029252782464027405,
        -0.022472912445664406,
        0.06729395687580109,
        0.003447874914854765,
        -0.03665074706077576,
        0.02770709991455078,
        -0.02042197808623314,
        0.020400330424308777,
        -0.03623155876994133,
        0.10604999214410782,
        0.058664653450250626,
        0.0394466370344162,
        0.06980500370264053,
        0.00865179393440485,
        0.04963473230600357,
        0.05780186504125595,
        -0.027606092393398285,
        0.051880888640880585,
        0.062350232154130936,
        -0.032784126698970795,
        -0.00686445040628314,
        0.03846922889351845,
        -0.038776423782110214,
        0.016587594524025917,
        0.034931525588035583,
        0.08772241324186325,
        0.026591146364808083,
        -0.019751468673348427,
        -0.009277909994125366,
        -0.04172299802303314,
        0.06600672751665115,
        -0.01660979352891445,
        0.003733930876478553,
        -0.06652960926294327,
        -0.018928367644548416,
        0.029132239520549774,
        -0.030431043356657028,
        0.04919781908392906,
        0.018299788236618042,
        0.11882880330085754,
        -0.044501665979623795,
        -0.11960665881633759,
        -0.006236052606254816,
        -0.06634075194597244,
        -0.08774163573980331,
        -0.056586991995573044,
        0.050875239074230194,
        0.01669720932841301,
        0.01626739278435707,
        0.03785344213247299,
        0.026250718161463737,
        -0.10236760973930359,
        0.005931217223405838,
        0.009394911117851734,
        0.015230581164360046,
        0.12114045023918152,
        -0.024544553831219673,
        0.024301085621118546,
        -0.0773201510310173,
        -0.013426639139652252,
        -0.028947584331035614,
        0.012663320638239384,
        -0.003435281338170171,
        0.06274646520614624,
        0.04282492771744728,
        0.014449520967900753,
        -0.009889247827231884,
        0.00787905603647232,
        0.03861633688211441,
        -0.09383351355791092,
        -0.06790217757225037,
        0.0391063392162323,
        -0.004350754898041487,
        0.07960733026266098,
        -0.0949351117014885,
        0.02784137986600399,
        0.04880302771925926,
        0.00042535673128440976,
        -0.014622923918068409,
        -0.017595048993825912,
        0.03741469979286194,
        -0.06914299726486206,
        0.06229175627231598,
        0.06025654077529907,
        -5.949035752905729e-08,
        0.041270509362220764,
        0.040402963757514954,
        -0.005741149187088013,
        -0.022473115473985672,
        0.04021373391151428,
        -0.02868848666548729,
        -0.004094724543392658,
        -0.02241796813905239,
        0.05189581960439682,
        -0.006671009585261345,
        0.06546247750520706,
        -0.044697266072034836,
        0.03459785506129265,
        0.00042310587014071643,
        -0.020645389333367348,
        0.08028338104486465,
        -0.049836285412311554,
        0.05123715475201607,
        -0.016034724190831184,
        0.004607760813087225,
        -0.041105277836322784,
        0.020408468320965767,
        0.014226280152797699,
        -0.11072736978530884,
        0.0010787718929350376,
        -0.057310279458761215,
        -0.04914192855358124,
        -0.04236675426363945,
        0.06795256584882736,
        -0.015631049871444702,
        -0.024389592930674553,
        -0.04731107875704765,
        0.005597698502242565,
        -0.058601390570402145,
        0.040801722556352615,
        0.016872258856892586,
        0.037119876593351364,
        0.0030800136737525463,
        0.01604813151061535,
        -0.029685014858841896,
        -0.04863373935222626,
        -0.09739578515291214,
        -0.0888969674706459,
        0.02505408227443695,
        -0.04214245453476906,
        0.013910302892327309,
        -0.06522772461175919,
        -0.09151383489370346,
        -0.08338664472103119,
        -0.031064147129654884,
        -0.026162145659327507,
        0.027587462216615677,
        0.03321271017193794,
        -0.0009140547481365502,
        0.08381620794534683,
        0.022620178759098053,
        0.05156287923455238,
        0.0019333083182573318,
        -0.017890173941850662,
        0.01329002808779478,
        -0.017873547971248627,
        -0.0014456812059506774,
        0.0010072368895635009,
        0.032608773559331894
    ]
}