{
    "id": "KaVliK5Zgzg",
    "title": "Vegan Phone Teardown! - Its not as boring as we thought...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-05-25T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=KaVliK5Zgzg",
    "category": "Howto & Style",
    "tags": [
        "Find X2 Pro",
        "Oppo Find X2 Pro",
        "Find x2",
        "Find X2 teardown",
        "Find X2 review",
        "Find X2 oppo",
        "oppo find x2 pro camera",
        "best phone 2020",
        "smartphone",
        "android",
        "iphone",
        "best smartphone",
        "find x2 pro repair",
        "take apart oppo find x2",
        "vegan leather"
    ],
    "views": 832880,
    "likes": 35475,
    "comments_count": 2159,
    "description": "The Find X2 Pro is Oppos latest flagship contender. With its high pricepoint comes some pretty high end specs. Right off the line, this might look like a regular normal everyday flagship smartphone. Yeah its got peach vegan leather on the back, but its also got dual batteries inside, that when charged together can get 100% charged up in just 38 minutes. Accomplishing 65 watts of flash charging is no easy feat. And Oppo seems to have gotten it figured out. I mean... The Oppo Find X2 Pro is not the most interesting phone in the world... but its definitely got some cool secrets hiding inside.   Find X2 Pro Durability Test:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/faKvUTEreXY",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Oppo Find X2 Pro you know, that expensive flagship you already probably forgot even existed. Today we're going to take apart this peachy colored phone and find out how it's able to charge at that ridiculously powerful 65 watts. Let's get started. [Intro] So if you remember, this Find X2 Pro is using textured vegan leather on the back, meaning that it's really plastic that just feels like leather. But a textured panel is not conducive to proper suction cupping, so I'll still break out the heat gun of course, mostly out of habit cuz I'm not really sure where else to start. We'll either turn this peach into cobbler or we'll be able to get inside. Funny enough, all it takes is one starting slice with my razor blade, and the rest of the peach peels by hand pretty easily, making this one of the easiest phones to open up since, well, since removable batteries were a thing. Does anyone else remember back when phones had batteries you could take out. It's been a long time since I've been able to pop the back off a phone with just my bare hands. It's a pretty easy tear down for a phone that has an ip68 water resistance rating. We can see the back panel is still entirely plastic and flexible. A nice change of pace from those easily shattered glass backs. I'd give a thumbs up for that. The phone is held together with 13 screws on the top black portion. I can remove those and then pop off the auto focus and flash LEDs off the camera units. These are just lightly adhered. Then I can unplug those from the motherboard and we can set the whole thing off to the side next to the screws. Now we can clearly see the motherboard along with the rather large camera cluster. Before checking those out though, I'll disconnect the battery and pop off the three other ribbons down along the bottom of the motherboard. Just like little Legos. Then I can remove the 8 additional screws holding down the bottom plastics. Those bottom plastics do contain the loud speaker, which also has the high quality sound dampening foam balls inside that we're used to seeing most flagships having. These balls make the speaker sound larger than it actually is, which is a good thing. Going deeper into the phone I can remove the extension ribbon and lift up the charging port ribbon to uncover the battery. This is one of the more unique batteries we've ever seen inside of a smartphone. There aren't many phones out there that can claim 65 watt flash charging. For reference, Samsung's Galaxy S20 can fast charge at 25 watts, and the iPhone 11 can fast charge at 18 watts. So 65 watts is super impressive. It can get 100% battery charge in just 38 minutes. The way Oppo has managed this, it looks like, is that it's not just one battery inside, it's two. Each of them is a 2130 milliamp hour capacity. And I can assume each one of them charges at the normal 30ish watts that we've seen in other devices like the OnePlus 8. But since each of these batteries are filling up at that 30 watts at the exact same time, it's charging doubly fast. It's a rather brilliant setup. Everyone's going to go nuts when Apple invents this in a couple years. The motherboard is held in place with 2 screws and some crazy long signal wires. The front facing camera is a 32 megapixel little guy. No optical image stabilization, but it does have a super cool looking plastic bracket holding it in place. The transparent pastel pink and blue. Oppo should have made the entire phone out of this plastic. I'd take retro see-through over vegan leather any day of the week. The motherboard can come away from the phone at this point revealing an underscreen copper vapor chamber. This dissipates the heat out of the display side of the phone. And we also get a close-up look at the rather large camera units. Both of these are 48 megapixels. The top one is the ultra wide camera with no optical image stabilization. And the bottom one is the main camera which does have that OIS. The Find X2 Pro also has a periscope zoom camera just like we saw inside of the Galaxy S20 Ultra. If you want to see how this works from the inside, we did tear one apart in that Ultra video. I'll link that down in the video description. But basically there's the image sensor down at one end perpendicular to the lens facing out the backside of the phone, and it uses some cool prism mirrors inside for that periscoping telephoto effect. Kind of cool. I'll get the cameras put back into place, and then make my way down to the bottom of the phone. Oppo has been bragging about the size of their vibrator in this Find X2 Pro, saying that it's the largest of any Android smartphone. So let's find it. I'll pop out the dual SIM card tray, which then allows me to pull out the SIM card board with it's little white water damage indicator down at the bottom. Now, the large vibrator that Oppo is talking about is hiding underneath this cute little USB charging port...which isn't a good sign. A big vibrator wouldn't be able to hide this easily. The vibrator is a linear actuator, which is capable of providing more complex haptic feedback vibrations than a coin style or rotating mass vibrator could. But it's still just a rather normal looking, normal sized machine. I'm not usually one to get into a vibrator measuring contest, but if I were, Apple would devastate the competition. Apple's is twice as long, thicker, and wider. It's not even close. I mean, of course, size isn't everything, but still. Then of course, we have the main focus of this phone, the large 10 bit billion color 120 Hertz refresh rate screen, which does help this phone differentiate a bit from all the other rectangles out there. This screen, along with the dual flash charging batteries inside are definitely the coolest parts of this phone. The dual battery setup is something I hope we see a lot more of in the future. Getting the phone put back together is easy enough. The internal design is pretty similar to all the other glass backed phones we've ever taken apart. After the motherboard is set down in to place I can reattach the signal wires and then plop the battery, loudspeaker, front facing camera, and 23 super tiny screws. And lucky for us, our patient survived the operation and still turns on and functions like normal. The peach is still peachy. Nice work Oppo. It might not be as flashy as the original Find X, but we can still find that there's more than meets the eye with the Find X2 Pro. As always, let me know what you think down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "Find",
        "camera",
        "inside",
        "Oppo",
        "back",
        "forgot even existed",
        "Pro",
        "watts",
        "phones",
        "motherboard",
        "bottom",
        "battery",
        "vibrator",
        "screws",
        "Oppo Find",
        "batteries",
        "charging",
        "plastic",
        "charge"
    ],
    "transcript_entity_values": [
        "30 watts",
        "25 watts",
        "30ish",
        "23",
        "the Find X2 Pro",
        "ip68",
        "8",
        "Instagram",
        "2130",
        "32 megapixel",
        "100%",
        "two",
        "120",
        "the Galaxy S20 Ultra",
        "three",
        "Oppo",
        "SIM",
        "just 38 minutes",
        "Find X",
        "Hertz",
        "Galaxy S20",
        "Apple",
        "65 watts",
        "48 megapixels",
        "65 watt",
        "Samsung",
        "2",
        "Android",
        "Today",
        "10 bit billion",
        "USB",
        "13",
        "one",
        "18 watts",
        "Twitter",
        "a couple years"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.12017900496721268,
        0.067128024995327,
        0.08765864372253418,
        0.0010280460119247437,
        0.0690809115767479,
        -0.1386505365371704,
        0.053738318383693695,
        0.11562634259462357,
        -0.009580226615071297,
        0.033360231667757034,
        0.09250696748495102,
        0.023167751729488373,
        -0.025657741352915764,
        0.01599789597094059,
        0.027447639033198357,
        0.009783850982785225,
        0.11981397122144699,
        -0.023722616955637932,
        0.028535911813378334,
        0.0858444944024086,
        0.001416549552232027,
        -0.06853888183832169,
        0.09828892350196838,
        -0.03908867388963699,
        0.004596239887177944,
        0.06743546575307846,
        -0.027290089055895805,
        -0.0013063426595181227,
        -0.03834792599081993,
        -0.07237314432859421,
        0.05167054012417793,
        0.08023009449243546,
        -0.018620282411575317,
        -0.022203972563147545,
        0.001525924657471478,
        -0.04448745399713516,
        0.06714746356010437,
        -0.0178159698843956,
        -0.05618772655725479,
        -0.06682942062616348,
        0.00748464185744524,
        -0.023624880239367485,
        0.0338694266974926,
        -0.007340670097619295,
        0.06105425953865051,
        -0.037444498389959335,
        0.0896259993314743,
        -0.07397560030221939,
        -0.00969683937728405,
        -0.05222557857632637,
        -0.009253385476768017,
        -0.060738276690244675,
        0.03188379481434822,
        0.008955970406532288,
        -0.08402072638273239,
        0.049478400498628616,
        -0.031650494784116745,
        -0.01124663557857275,
        0.05996022745966911,
        -0.014381654560565948,
        0.04686049744486809,
        0.06038427725434303,
        -0.03896953910589218,
        0.07289522886276245,
        -0.031141096726059914,
        -0.009408125653862953,
        0.029927661642432213,
        -0.041680846363306046,
        -0.019967684522271156,
        0.009141555055975914,
        -0.03603141009807587,
        0.07445856183767319,
        0.034022923558950424,
        0.01588372513651848,
        -0.034530505537986755,
        0.09393102675676346,
        0.06970509886741638,
        -0.0027302319649606943,
        -0.020886965095996857,
        -0.011741822585463524,
        0.10017337650060654,
        -0.05290452018380165,
        -0.06362754106521606,
        0.0204703900963068,
        0.04296554997563362,
        0.009929981082677841,
        0.013789153657853603,
        0.017400966957211494,
        -0.0852317288517952,
        -0.020559869706630707,
        -0.02581438608467579,
        0.13680750131607056,
        -0.019911788403987885,
        -0.031785596162080765,
        -0.012077897787094116,
        -0.013165435753762722,
        -0.052344974130392075,
        -0.04790981113910675,
        -0.08237769454717636,
        0.05099620297551155,
        0.0010049750562757254,
        0.04547182098031044,
        0.007952549494802952,
        -0.043981801718473434,
        -0.02457272633910179,
        -0.07136090099811554,
        -0.09207037836313248,
        0.011864357627928257,
        0.0643874928355217,
        0.0695071592926979,
        -0.03398725762963295,
        -0.017978329211473465,
        -0.053543489426374435,
        -0.00778209138661623,
        0.00503630330786109,
        0.06838975101709366,
        -0.03697296604514122,
        0.08845845609903336,
        0.09678638726472855,
        0.008403469808399677,
        0.005808540154248476,
        -0.02844032272696495,
        -0.08479807525873184,
        -0.04811881482601166,
        0.06089777871966362,
        -0.027539093047380447,
        -0.0059584579430520535,
        5.5251595667806895e-33,
        0.03294198587536812,
        0.0921289324760437,
        -0.013354010879993439,
        0.030152233317494392,
        -0.03613784536719322,
        -0.01482837088406086,
        0.01969132013618946,
        -0.011798303574323654,
        -0.0922045111656189,
        0.03490440174937248,
        -0.018621336668729782,
        -0.022810466587543488,
        -0.0487276166677475,
        0.05263034254312515,
        0.09039420634508133,
        -0.09330249577760696,
        -0.023219261318445206,
        -0.013073913753032684,
        0.01861712709069252,
        -0.0271763913333416,
        0.004131312482059002,
        -0.048468928784132004,
        0.028976477682590485,
        0.016245925799012184,
        0.09228774160146713,
        0.05678612366318703,
        0.06047726795077324,
        -0.07304900884628296,
        -0.0005636131390929222,
        0.03252755105495453,
        -0.09973473101854324,
        -0.009080573916435242,
        0.02666294574737549,
        0.09908071160316467,
        -0.05691498890519142,
        0.04790167137980461,
        -0.03046613186597824,
        -0.13798484206199646,
        0.02915949374437332,
        -0.02334437146782875,
        -0.03719791769981384,
        0.04547169432044029,
        0.00404304638504982,
        0.008327639661729336,
        0.01974591054022312,
        -0.0241704024374485,
        -0.003651780541986227,
        -0.019687805324792862,
        -0.0006643898086622357,
        0.013201450929045677,
        0.004956668708473444,
        -0.03088698722422123,
        -0.010315237566828728,
        0.022004881873726845,
        -0.05641668289899826,
        0.004524474032223225,
        -0.023978520184755325,
        0.0008851749589666724,
        0.06766614317893982,
        0.02868458442389965,
        0.013059294782578945,
        0.00851782038807869,
        -0.10212615132331848,
        0.009101894684135914,
        -0.11010758578777313,
        0.06561174988746643,
        0.0004680082784034312,
        -0.08191317319869995,
        -0.05380617454648018,
        0.11822764575481415,
        0.004376715049147606,
        -0.0726710632443428,
        0.04298518970608711,
        -0.07275553792715073,
        0.06870049983263016,
        0.051858238875865936,
        -0.02400055155158043,
        -0.029646825045347214,
        0.011931556276977062,
        -0.007553287781774998,
        -0.048839762806892395,
        -0.01962287910282612,
        0.04058506712317467,
        0.0390971340239048,
        -0.0027411493938416243,
        -0.010984191671013832,
        -0.016656791791319847,
        -0.08223136514425278,
        -0.008776240050792694,
        0.03816492483019829,
        0.019054125994443893,
        -0.07859298586845398,
        -0.07442451268434525,
        -0.09190113097429276,
        -0.010888349264860153,
        -5.030265057482983e-33,
        -0.020408980548381805,
        0.004198760725557804,
        0.020518623292446136,
        0.02857462875545025,
        -0.025304703041911125,
        -0.07326674461364746,
        -0.02380349114537239,
        0.06879258155822754,
        0.030268527567386627,
        -0.04888490214943886,
        0.01116237137466669,
        0.03530546650290489,
        0.010302994400262833,
        -0.01555542554706335,
        0.020087432116270065,
        0.004028669558465481,
        0.026359491050243378,
        -0.09260129183530807,
        0.06864684820175171,
        -0.037883460521698,
        0.030107000842690468,
        0.07930870354175568,
        0.0702945664525032,
        0.08967103809118271,
        0.02881918102502823,
        0.009770222939550877,
        0.050853926688432693,
        -0.03551437333226204,
        0.07595928758382797,
        -0.09305577725172043,
        -0.05024315044283867,
        -0.010612428188323975,
        0.036387890577316284,
        0.03858447074890137,
        0.030032066628336906,
        0.03020366095006466,
        -0.027357909828424454,
        0.0011596124386414886,
        0.014300446957349777,
        0.019094448536634445,
        -0.01113644428551197,
        0.027100082486867905,
        -0.023213574662804604,
        -0.052925724536180496,
        -0.017663322389125824,
        -0.06325218826532364,
        -0.03671073541045189,
        0.05544242635369301,
        0.07294409722089767,
        0.042768027633428574,
        0.0223678071051836,
        0.04186316207051277,
        -0.05259757116436958,
        0.03624238073825836,
        -0.05870262533426285,
        -0.0649496465921402,
        -0.004695632494986057,
        -0.038507163524627686,
        -0.054383084177970886,
        0.0030337620992213488,
        0.12502016127109528,
        0.02683963067829609,
        0.004988042172044516,
        0.012633596546947956,
        -0.055106181651353836,
        -0.028196975588798523,
        0.07333502918481827,
        0.02823290042579174,
        -0.060057561844587326,
        0.01240492146462202,
        -0.015655292198061943,
        -0.03553270176053047,
        -0.05215669423341751,
        -0.07045397162437439,
        0.03363676741719246,
        0.03834950923919678,
        -0.09241928160190582,
        -0.03813846781849861,
        0.011459535919129848,
        -0.026886727660894394,
        0.05056024715304375,
        0.01926499791443348,
        0.08284614980220795,
        -0.017763452604413033,
        0.055701468139886856,
        0.03177596256136894,
        -0.04210302606225014,
        0.10666706413030624,
        -0.041414789855480194,
        0.011874613352119923,
        -0.05421853065490723,
        -0.012301321141421795,
        -0.05694116652011871,
        0.10804276913404465,
        0.023592019453644753,
        -5.70206424299613e-08,
        0.01707281358540058,
        -0.021018793806433678,
        0.0670330598950386,
        -0.0033189731184393167,
        0.02466847561299801,
        -0.00910533219575882,
        -0.028150148689746857,
        -0.006444772705435753,
        0.08524172753095627,
        -0.0065306550823152065,
        -0.0449049137532711,
        -0.03789537400007248,
        -0.028427481651306152,
        0.05583275482058525,
        -0.03414801135659218,
        0.13023945689201355,
        0.023484377190470695,
        0.021273748949170113,
        -0.042359139770269394,
        -0.009088507853448391,
        -0.055760420858860016,
        0.026828128844499588,
        -0.015318557620048523,
        -0.07925322651863098,
        0.004214326851069927,
        0.002062121406197548,
        -0.10995956510305405,
        -0.03450397774577141,
        0.10750338435173035,
        0.023563265800476074,
        -0.03402208536863327,
        -0.02047542668879032,
        0.0331353098154068,
        -0.039863623678684235,
        -0.05173730477690697,
        -0.026922501623630524,
        -0.03640478104352951,
        -0.06877296417951584,
        0.038885775953531265,
        0.013255888596177101,
        -0.0030091411899775267,
        -0.04665058106184006,
        0.04541334509849548,
        0.0430787019431591,
        -0.07422244548797607,
        -0.028579212725162506,
        0.06889259070158005,
        -0.11385217308998108,
        -0.08916016668081284,
        0.010803752578794956,
        0.006203528493642807,
        -0.0013433616841211915,
        -0.07988041639328003,
        -0.05702190846204758,
        -0.002929608803242445,
        0.01491569634526968,
        0.0006864585448056459,
        -0.01214035414159298,
        -0.007986800745129585,
        -0.011129331775009632,
        0.039769239723682404,
        -0.1065785363316536,
        0.03837425261735916,
        0.0938548892736435
    ]
}