{
    "id": "kb6L8zRfJPU",
    "title": "I wasted $867 on Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-12-10T16:05:11Z",
    "video_url": "https://www.youtube.com/watch?v=kb6L8zRfJPU",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "unboxing",
        "amazon",
        "ebay",
        "wish",
        "chromebook",
        "lenovo",
        "gaming",
        "ideapad",
        "headphones",
        "empyre",
        "sticky note",
        "printer",
        "asus",
        "zenfone",
        "zenfone 9",
        "denki",
        "this is",
        "austin",
        "austin evans"
    ],
    "views": 504387,
    "likes": 16782,
    "comments_count": 316,
    "description": "More info on the @Lenovo Gaming @Google Chromebook:   Product Page:   Elf Ear headphones on Amazon:  Smart Sticky Note Printer on Amazon:  Asus Zenfone 9 on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 Elf Ear Headphones 1:26 Sticky Note Printer 4:24 Lenovo Gaming Chromebook 6:35 Asus Zenfone 9 8:32 Apple Clothes 9:58 Empyre Gaming Mouse  #LenovoCloudGaming, #LenovoCloudGamingChromebook #ad",
    "description_links": [
        "https://lnv.gy/3hbfbIf",
        "https://lnv.gy/3Boldwa",
        "https://austin.tech/elfheadphones",
        "https://austin.tech/noteprinter",
        "https://austin.tech/4pL84Vj",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- I'm ready to expand my horizons with a very tiny little item. What is this? Ew. Why does that look so? Ew. - [Jared] These are Elf Ear earbuds. - [Ken] Let's go. (Jared laughs) - I forgot. It's the humiliation part of Mystery Tech. Okay, I don't like this at all. So, it's got like a little like loop for your ear. You're supposed to put the headphone in and I guess loop this in the front and the back. It smells not good. Like it smells like ears. No, it smells like silicon, actually. How do I- I loop it backward? - [Jared] No, no, no, no, no, no, no. - [Ken] You have to undo it like an umbrella. Like it's like when the wind hits it and like, it's like inside out. You have to like un-pop it. - What are any of you saying right now? Please, hear me. - [Ken] Thank you. - Don't ever say ear me ever again. There you go. - Wow. Are we feeling it now? - [Jared] You ready to go to Comic-Con? - Can you feel it now, Mr. Krabs? - Art thou feeling it now, Mr. Krabs? - [Jared] We're gonna get you a little like Link outfit. (people laughing) He looks like he's about to give me the first quest in my RPG. (people laughing) Village elder, getting down. (people laughing) - These actually don't sound bad. (laughing) (people laughing) How much is my new Cosplay future? - [Jared] These are only $14. - [Ken] Whoa. - [Jared] Yeah. - So, there's an item on Mystery Tech that serves its intended function, is kind of neat and affordably priced. I'm speechless. What am I supposed to say? It does what it says and it's cheap. I'd like to ask you to subscribe and ring-a-ling the ding-a-ling bell. 'Cause otherwise my emo arc will be long and dark. (people laughing) (tape rewinding) (box thudding) Pretty happy with that catch, day one additions. Okay, so immediately I'm concerned. The reason why I'm concerned is that day one additions, launch additions, limited editions, are usually what you slap on the box when you're trying to ship something which is not complete. Oh. (box thudding) - [Ken] What does it say? - [Austin Evans] Amazon.com/devicesupport. - [Ken] Aah. - What is a day one addition of an Amazon product? A compatible echo device is required to pair your printer. (object thudding) Smart Sticky Note Printer day one addition. So, you print out a sticky note? Isn't that what a Sharpie's for? (crickets chirping) - [Ken] I have nothing. - Yeah, I mean. I haven't got nothing either. - What, what, what? - [Matt] Have we ever been speechless? (people laughing) - We've got ourselves a role of thermal paper which I will say does not look like a sticky note at all. - This is already more work than just going to Target and buying a sticky note and writing it yourself. - I'm trying to keep an open mind here. It could be cool, but also I'm so confused as to why Mr. Bezos would've ever green lit such a product. - This was brought to life by supporters. People had 30 days to back this and it met its backing goal in three days. - [Austin Evans] No. - It offends me that Amazon crowdsourced funding. Also, I can tell that Austin has never worked in retail. (people laughing) - All right, it's printing out how to get started. Alexa, discover my printer. - [Alexa] Starting discovery. This will take a few moments. - This is really disturbing. Your printer hasn't connected to your Wi-Fi network, so- - [Ken] Stop wasting- - I didn't do it. Ken. I did not do anything, the printer printed out. I hate the fact that every time I reset it, it has to print out another... (people laughing) It's connected. - [Matt] We've used half the damn roll! (people laughing) - We're getting another message, almost finished. Once the- - [Ken] Stop. (everyone laughing) The level of stickiness of this, by the way, is also like the receipt you get from McDonald's after you spill some Sprite onto it. (people laughing) Like it sticks, but like not really. - Alexa, print me today's crossword. - [Alexa] Do you want me to print today's crossword? You can also pick a different date. - Yes. - [Alexa] Your request was sent to the printer. - Thank you. Oh my God, that's a lot. Okay. - [Jared] Oh my God. - That's enough. 13, smartphone border. It's bezel. - [Jared] Bezel. Aah. - [Joanna] Tech. - Ah, yeah. Mystery Tech. The star of \"Everything Everywhere All At Once\"? - I don't know how to pronounce it but it's- (cross-talking) - Who is the star of \"Everything Everywhere All At Once\"? - Use Alexa to cheat? - [Alexa] Abraham, who is the father of us all. (everyone laughing) - Alexa, how much is the Amazon Smart Sticky Note printer? - [Alexa] Recently on Amazon, the price for Amazon Smart Sticky Note printer ranged from 22 US dollars up to 150 US dollars. - [Jared] I'm gonna go ahead and tell you that's wrong. (chuckles) - Okay. - [Jared] It is $110. - [Ken] Not as bad as I thought. - What are you talking about? It's horrible. I can't get behind this. - [Ken ] Alexa, print me a sticky note, \"I'm stupid.\" - [Alexa] Your note was sent to the Amazon printer. (everyone laughing) (hand slapping) - Oh, it's even timestamped. (people laughing) - Are you sure? - [Ken] I'm a trained professional. (box thudding) - Okay. That was fairly gentle. Thank you very much. So, this is, my friends, is the sponsor of today's Mystery Tech, the Lenovo Gaming Chromebook. Yeah, you heard me right. Need I say more? - [Matt] Yeah. What is a Gaming Chromebook? - Well, I'm glad you asked. This is a 16 inch panel, 16 by 10, 2560 by 1600 resolution. And importantly, it is running at a full 120 FPS. GeForce Now has been around for a little while now but this might be one of the best devices to play it with. Not only does it come with a three month free trial of the RTX 3080 tier, which means that you're getting a full RTX 3080 in the cloud. But that also means that you can stream games at up to 1440 P and 120 frames per second. Like that's one of the main advantages of a Chromebook. And specifically with this, is that you're getting the features that are really important like the display, like your RGB keyboard. But you're also getting full compatibility with Cloud Gaming Services. What do you do? What's like BM in Fortnite? You emo'd, no, no, you emo'd on him, right? - Yeah. Well you... Do, do, do, do, do, do Do, do, do, do Yeah, whatever dance your character had, yeah. - I am now recording using my Gaming Chromebook. - [Matt] Let's see you get that, ah, what's the opposite of a dub? - The L. Zero build. Pss. - [Matt] Yes, that's the better one. - It's so weird. I'm not used to ever seeing a higher refresh rate experience when you're actually playing via cloud game. Again, I am doing nothing special here. Now, I am on a Wi-Fi 6 network here at the office. And to be fair, we do have good Wi-Fi. So, this is one of the things you can say with cloud gaming is that your internet connection is, of course, one of the most important things. Oh, someone's shooting me. Someone's shooting me. You can't do that! That's cheating! - [Joanna] I think that was already there. - Okay, so, here's the thing. Having high performance gaming peripherals is important but skill also necessary. This is an excellent Chromebook. You've got 11 hours of battery life, plenty of performance for regular tasks. But on top of that, you've also got that high refresh rate, high resolution display, which pays dividends not only for regular use, but especially when it comes to gaming. So, if you're interested in learning more about the Lenovo Gaming Chromebook, definitely be sure to check it out at the link in the description. A huge shout-out to Lenovo for sponsoring this segment of Mystery Tech. (scene whooshing) (box thudding) Is this an iPhone? Oh wait, hold on, hold on. Oh, it's actually in there, isn't it? - [Ken] What do you think this is? A game? - I mean, usually you guys pull shenanigans. Yeah. - [Matt] We've never pulled a shenanigan a day in our lives. - Okay, I'm gonna open up. - [Ken] Surprise! It's a Zenfone 9. - I knew it. Why is a Zenfone- Ooh, why is a Zenfone 9 in an iPhone box? - [Ken] Because I might have thrown away the box before Mystery Tech but- - You opened an item of Mystery Tech? - [Ken] Yes. 'Cause I'm making a Denki video on this. - Okay, so now I get this nonsense out of here. (glass shattering) This my friends, is the ASUS Zenfone 9. What we've got here is a smaller Android device that packs what seems to be an impressive camera and some features that you probably haven't seen in a while. This is some ancient technology called the headphone jack. A little bit of a strange alien concept, but theoretically, you could plug in headphones to your phone. Even though it is a small size of a device, the thickness is a little bit chunky. I mean, you put it beside a Z Flip, which is obviously a very, very thick phone. It's not that much thinner, but it makes sense, right? If you're gonna make a smaller sort of form factor of a phone, you gotta flex somewhere. It has two cameras that has an ultra-wide and it has a gimbal main camera, 50 megapixels. - [Ken] Which the gimbal only works in 1080. - Gimbal should be hardware, not resolution-based. - Gimbal is more of a state of mind. (rainbow tinkling) - [Austin Evans] So, I am now recording on the Zenfone. And while I'm gonna try to be nice and smooth, I mean, it is doing a lot of stabilization. - [Jared] Do you think for 700 bucks this beats the value of an iPhone 13, which is the same price? - It depends, for camera, I'd still get the iPhone 13. But I do think that on the Android side, this is really competitive for 700. - If you're looking for a small device, the Zenfone 9 certainly seems like it is well worth a look. And it's also worth a look to go check out Ken's video all about the Zenfone 9. Apparently an Xperia or something. - [Ken] Wait, and you're gonna scratch the back of your Z Flip, dude. Okay. - [Matt] Wear less tighter pants. Make- - [Jared] Austin in cargo shorts? (soft upbeat music) (scene whirring) - We've got an Apple bag. Is this an actual Apple product? - [Ken] Yes. - Is it really? - [Ken] I took a trip up to San Jose to visit some friends and went to Apple Park and picked you something up. - Is this a gift from Tim Cook personally? - [Ken] No, he hates you. - Are these children's clothes? - [Ken] Yes. - Did you buy me children's clothes from the- - [Matt] That is what you wear, isn't it? - So, there are two onesies here for no particular reason. Not like I would ever have a personal use for a onesie. - [Ken] Are you saying you don't have a son anymore? - So, if you'd like to indoctrin- I mean, ah, get your child looking stylish early. You can give them the green apple. Oh, you know, I like the fact that the buttons are color-matched. That's a very- - [Ken] That's kinda cute actually. - That's a very like sort of on b rand kind of thing. Also, I'm a big fan of the three-snap on the bottom. I don't like the extra snaps now. I know that there's a snap for the head but that's not as important. I think you can just shove their head in there. Their heads aren't important. Now, this one's a little bit smaller but I immediately like this 'cause this is the rainbow logo. A is for Apple. - [Ken] Oh, that's adorable. - That's really good. Now, these snaps are for the big head. Yeah, go ahead. - Lightning or USB-C. Do you have the pro model or the poor model? - Promotion, 120 burps per minute. (laughing) - [Ken] Oh. - [Matt] I would've waited for next year's model. That's like- - You know, the older models are better. (laughing) - [Matt] You could always get a refurbish. (Austin laughing) - Can we move on to the next item in Mystery Tech, please? - [Matt] You're the one who controls this. - Truer words have never been both true and false at the same time. (laughing) (scene whipping) What's Empyre? (box thudding) It says it on the box. Atlas Custom, wait, wireless gaming mouse? Wait, is this just a Model O rip off? It's got replaceable hot-swappable switches. That's okay. I guess I will just admit that I am not a mouse aficionado. I feel like I would probably just tweak the mouse once and never touch it again. So, we've got ourselves the very, very lightweight regular shell and we have the mouse itself. (mouse clicking) Sounds like a mouse. You can swap out the main grip to go from honeycomb aka trypophobia warning to a more regular standard version. And you also can do that for the top as well. I've never played around with switches for my mouse before. - It's definitely not as common as keyboards are right now but I think there are companies out to change that. That's actually a very interesting way to do it. - Oh and then you put them, yeah. - [Ken] Yeah. They're on their own little caddy. - [Austin Evans] Yeah. - [Ken] That you can just pull out with your hands, so you actually don't have to go super-crazy like you would even on a hot-swap keyboard. - Okay. All right. So, I'm gonna do a full test. So, these are these switches that come with it. These are the Huanos, these are the blues. So. (switches clicking) Okay. Pretty decent. Now, we're gonna move on to the red switches, which are Kailhs. (switches clicking) All right, I'm gonna do one red and one blue. (switch clanking) All right. Now, let's do my left versus right click. So, left click. (mouse clicking) Right click. (mouse clicking) - [Ken] It's subtle but I can hear it. - That sounds exactly the same to me. (laughs) - The true super fans know that the blue has 0.036 DBs more of pressure that give it an actuation point of third degree past center. - One sounded deeper than the other, just vaguely. - That's what I said. (Austin laughing) - Oh, and we've got ourselves some RGB. We got a little underglow as well as the actual logo itself. I'm looking at all of this, I don't think there's anything here besides the hot-swappable switches that would really make me want to go for this over something like a Model O. Which really begs the question, how expensive is this? - [Jared] The price of the switches per pair, is five bucks. The price of the shell is $6 a piece. The mouse itself is $90. - No, no. As a wireless mouse, 90 bucks is a lot of money, man. - [Ken] No dude. What are you talking about? - [Matt] That's not bad for 90 bucks. - All right, all right, all right, all right. If swappable mouse switches are the way you wanna live your life, then let me not stand in your way. But let the light of freedom and justice lead the way (eagle shrieking) to your promised land. I'm just gonna use the Model O. - [Jared] Okay, Uncle Sam. (dramatic music)",
    "transcript_keywords": [
        "Mystery Tech",
        "Sticky Note",
        "Sticky Note Printer",
        "Smart Sticky Note",
        "Yeah",
        "Gaming Chromebook",
        "Lenovo Gaming Chromebook",
        "Tech",
        "Amazon Smart Sticky",
        "Mystery",
        "Gaming",
        "Note",
        "printer",
        "Zenfone",
        "Note Printer",
        "Sticky",
        "mouse",
        "Chromebook",
        "Amazon",
        "expand my horizons"
    ],
    "transcript_entity_values": [
        "Tim Cook",
        "only $14",
        "Ken] Wait",
        "a few moments",
        "half",
        "iPhone",
        "700 bucks",
        "Alexa] Abraham",
        "0.036",
        "ASUS Zenfone 9",
        "first",
        "two",
        "Matt",
        "120",
        "90",
        "one",
        "GeForce Now",
        "Apple Park",
        "Chromebook",
        "a Zenfone 9",
        "Atlas Custom",
        "Kailhs",
        "third",
        "Austin Evans",
        "Huanos",
        "Uncle Sam",
        "Ken",
        "Austin",
        "Ken ] Alexa",
        "90 bucks",
        "Zenfone",
        "Wi-Fi",
        "16 inch",
        "three days",
        "Joanna",
        "16",
        "next year's",
        "Alexa",
        "Target",
        "McDonald",
        "Denki",
        "today",
        "Matt] Wear",
        "22 US dollars",
        "13",
        "up to 1440",
        "2560",
        "Android",
        "Sharpie",
        "110",
        "Joanna] Tech",
        "1080",
        "10",
        "Amazon",
        "RGB",
        "Ken] Aah",
        "Apple",
        "6",
        "Everything Everywhere All At Once",
        "Lenovo",
        "Amazon Smart Sticky",
        "Fortnite",
        "three month",
        "Gaming Chromebook",
        "the Zenfone 9",
        "RPG",
        "Mystery Tech",
        "Krabs",
        "Alexa",
        "1600",
        "USB-C.",
        "Pss",
        "Jared",
        "Cloud Gaming Services",
        "three",
        "it's-",
        "un",
        "Sprite",
        "3080",
        "San Jose",
        "Xperia",
        "a day",
        "second",
        "11 hours",
        "50 megapixels",
        "700",
        "Bezos",
        "150 US dollars",
        "Ken] Stop",
        "five bucks",
        "30 days"
    ],
    "transcript_entity_types": [
        "PERSON",
        "MONEY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "EVENT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "ORG",
        "DATE",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE"
    ],
    "vector": [
        -0.0764571949839592,
        0.03022604249417782,
        -0.03480212390422821,
        -0.05006299912929535,
        0.055006470531225204,
        -0.06256384402513504,
        0.12445880472660065,
        0.042588971555233,
        -0.02031213417649269,
        0.0066644009202718735,
        0.08580504357814789,
        0.013215597718954086,
        -0.02998676709830761,
        -0.06938466429710388,
        -0.013333668932318687,
        0.023573096841573715,
        0.016948804259300232,
        -0.05936746299266815,
        -0.067383773624897,
        0.026607315987348557,
        -0.007753813173621893,
        0.06981053948402405,
        0.07279226183891296,
        0.002309424802660942,
        -0.062148645520210266,
        0.06718473136425018,
        0.00994696281850338,
        -0.12765148282051086,
        -0.08633291721343994,
        -0.057103823870420456,
        0.04503485560417175,
        0.0334409661591053,
        0.01871730387210846,
        -0.033797696232795715,
        -0.0347704254090786,
        -0.02659645676612854,
        -0.009572823531925678,
        0.012242787517607212,
        -0.01001532468944788,
        -0.03432108461856842,
        -7.332865061471239e-05,
        -0.038833994418382645,
        -0.04814431443810463,
        -0.014195634983479977,
        -0.07719749212265015,
        0.030825084075331688,
        -0.08392797410488129,
        -0.04756459966301918,
        0.03323361277580261,
        -0.021962597966194153,
        0.019296882674098015,
        -0.0853796973824501,
        0.007199550978839397,
        -0.05634857341647148,
        -0.023718643933534622,
        0.030874747782945633,
        -0.003484173212200403,
        0.009837787598371506,
        -0.026217926293611526,
        0.08260269463062286,
        0.0909016951918602,
        -0.07152542471885681,
        0.03591521829366684,
        0.04312192648649216,
        -0.030222885310649872,
        0.014514471404254436,
        0.02750760316848755,
        -0.04633568227291107,
        -0.026189398020505905,
        -0.050351280719041824,
        0.017770832404494286,
        0.005459276493638754,
        -0.020957132801413536,
        0.03581109642982483,
        0.04797877371311188,
        0.03339936211705208,
        0.02069878950715065,
        -0.023648811504244804,
        0.040782760828733444,
        0.0794985294342041,
        -0.11944516748189926,
        -0.019971096888184547,
        0.07360371202230453,
        -0.020671945065259933,
        -0.005116200540214777,
        0.040563829243183136,
        0.04633823037147522,
        -0.04595913365483284,
        -0.03893677517771721,
        -0.04663355275988579,
        0.010091163218021393,
        0.012152174487709999,
        -0.012120568193495274,
        -0.003333253785967827,
        0.06858941912651062,
        -0.013436688110232353,
        0.029429657384753227,
        0.002695560222491622,
        -0.009426829405128956,
        0.06522729247808456,
        0.04699120298027992,
        0.024212408810853958,
        0.052752263844013214,
        -0.039146553725004196,
        -0.009190400131046772,
        -0.08981798589229584,
        -0.07881984859704971,
        -0.036473099142313004,
        -0.014245735481381416,
        0.03206811472773552,
        0.016705771908164024,
        -0.06483276188373566,
        0.015517574734985828,
        0.024669017642736435,
        0.013135163113474846,
        -0.027109190821647644,
        -0.013231483288109303,
        0.10016580671072006,
        0.07187598943710327,
        0.012407129630446434,
        0.048921313136816025,
        0.0718303695321083,
        -0.09270866960287094,
        -0.05775616690516472,
        -0.06417044997215271,
        0.0568128302693367,
        -0.11636928468942642,
        5.6272530878595284e-33,
        0.012122347950935364,
        0.05663454160094261,
        -0.058612506836652756,
        -0.09671229124069214,
        0.01167391613125801,
        -0.03058749809861183,
        -0.07750564068555832,
        0.03723462298512459,
        -0.011485890485346317,
        0.0835442915558815,
        -0.05394870042800903,
        0.019695252180099487,
        -0.03787994757294655,
        0.09348169714212418,
        0.006062711123377085,
        -0.05856364965438843,
        -0.045621465891599655,
        0.016926465556025505,
        -0.012918596155941486,
        -0.007467143703252077,
        0.006451500579714775,
        -0.002944679232314229,
        0.026320142671465874,
        -0.009083956480026245,
        0.009162181988358498,
        0.04588392376899719,
        -0.058535050600767136,
        -0.06186332926154137,
        0.02107873558998108,
        0.03741343691945076,
        -0.09948604553937912,
        -0.03809738531708717,
        -0.024871597066521645,
        -0.11797133833169937,
        -0.029572531580924988,
        0.02079075016081333,
        -0.009592671878635883,
        -0.05639331042766571,
        -0.03505375608801842,
        -0.03809468075633049,
        0.019623083993792534,
        0.01348153781145811,
        -0.032875239849090576,
        0.007438266649842262,
        0.00850522518157959,
        0.06559894979000092,
        0.03993786498904228,
        0.06984727084636688,
        0.01694510690867901,
        -0.024542059749364853,
        -0.06341330707073212,
        -0.02256234921514988,
        0.04747140780091286,
        -0.030566461384296417,
        0.04220522940158844,
        -0.06407611072063446,
        0.01586219109594822,
        -0.012311246246099472,
        0.015557454898953438,
        0.030995525419712067,
        0.04097625985741615,
        0.07911040633916855,
        0.05447760596871376,
        -0.014541652984917164,
        -0.026393160223960876,
        0.043705251067876816,
        0.06430687010288239,
        0.0507698617875576,
        -0.042374253273010254,
        -0.08394379913806915,
        0.029521247372031212,
        0.038486842066049576,
        0.04412122815847397,
        -0.009071625769138336,
        0.010483713820576668,
        0.00387244182638824,
        0.005277675110846758,
        -0.05438169836997986,
        0.029187407344579697,
        -0.11646066606044769,
        -0.009827695786952972,
        0.04490692541003227,
        0.06637649238109589,
        -0.017299430444836617,
        -0.013245103880763054,
        -0.06909090280532837,
        -0.028909362852573395,
        -0.08091376721858978,
        -0.08139631897211075,
        0.002745731733739376,
        0.005783091764897108,
        0.06611216068267822,
        -0.04410824924707413,
        -0.0030587459914386272,
        -0.059297867119312286,
        -7.568663558163124e-33,
        0.006221129093319178,
        -0.08596743643283844,
        -0.009654408320784569,
        -0.021381305530667305,
        0.031594887375831604,
        0.13182580471038818,
        0.05312000587582588,
        0.01830771006643772,
        -0.038906898349523544,
        -0.027724003419280052,
        -0.00037681375397369266,
        0.03007734753191471,
        -0.02594940736889839,
        -0.04986513778567314,
        0.06536360830068588,
        -0.053819216787815094,
        -0.02985657937824726,
        -0.013690241612493992,
        0.02892601117491722,
        -0.0033496730029582977,
        0.02399309352040291,
        0.013429208658635616,
        0.02644902840256691,
        0.03139884024858475,
        0.0056425114162266254,
        0.010948628187179565,
        -0.01638730615377426,
        -0.04785647615790367,
        -0.01542094349861145,
        0.028682513162493706,
        0.0051312679424881935,
        -0.04309825971722603,
        -0.04584822431206703,
        0.006678990088403225,
        0.1060756966471672,
        -0.018436862155795097,
        0.042692214250564575,
        -0.023229703307151794,
        0.01716858707368374,
        -0.0966147780418396,
        -0.044471751898527145,
        -0.0060667721554636955,
        0.05881703644990921,
        -0.06698767095804214,
        -0.04038481041789055,
        -0.04902166500687599,
        -0.07985081523656845,
        0.024531953036785126,
        -0.0196504108607769,
        -0.015776315703988075,
        0.022134283557534218,
        -0.009040463715791702,
        -0.0019461603369563818,
        -0.0783248320221901,
        -0.16458025574684143,
        0.0720812976360321,
        -0.06772717088460922,
        0.001887324033305049,
        0.04748566076159477,
        0.009231504052877426,
        0.005189870484173298,
        -0.05209941044449806,
        -0.028360404074192047,
        0.01709442026913166,
        -0.08906636387109756,
        0.05964003503322601,
        0.044041216373443604,
        -0.015165717341005802,
        0.0018111427780240774,
        0.0005166295450180769,
        0.03745047748088837,
        -0.01211231667548418,
        0.027461761608719826,
        -0.05101269483566284,
        -0.0012297217035666108,
        0.061709050089120865,
        -0.001902895513921976,
        -0.10668008774518967,
        0.02723851054906845,
        0.0038974855560809374,
        0.01232363935559988,
        0.0316731296479702,
        0.05438602343201637,
        0.04761109501123428,
        0.06472627818584442,
        -0.048249293118715286,
        -0.012741483747959137,
        -0.0004921286017633975,
        -0.11131922155618668,
        0.05602983385324478,
        0.037291716784238815,
        0.05415443331003189,
        -0.03936026990413666,
        0.16699157655239105,
        0.03861065208911896,
        -5.430560889863045e-08,
        0.07322349399328232,
        0.004970671143382788,
        0.06569691002368927,
        -0.06560371071100235,
        0.05717786028981209,
        -0.049781858921051025,
        0.022305632010102272,
        -0.01873644068837166,
        -0.054624784737825394,
        -0.014257265254855156,
        0.031860437244176865,
        -0.02032364159822464,
        -0.05469876527786255,
        0.10497884452342987,
        0.07729407399892807,
        0.09412529319524765,
        -0.03376953676342964,
        0.04484741762280464,
        -0.039813097566366196,
        -0.1277151107788086,
        0.003158110659569502,
        0.042733680456876755,
        0.04768680781126022,
        -0.0764661580324173,
        0.031336940824985504,
        -0.03557971864938736,
        0.052157897502183914,
        0.14941956102848053,
        0.05259773135185242,
        -0.01130167581140995,
        -0.03505405783653259,
        0.029424652457237244,
        -0.0632629320025444,
        0.01403399184346199,
        0.00651932368054986,
        -0.07922689616680145,
        -0.024007456377148628,
        -0.029849059879779816,
        -0.022112270817160606,
        0.02980879694223404,
        -0.019872251898050308,
        -0.09881261736154556,
        0.00666291918605566,
        0.03137880936264992,
        0.014518475160002708,
        -0.10555358231067657,
        0.07722000032663345,
        -0.0012063328176736832,
        -0.04587695002555847,
        0.1356109231710434,
        -0.004695869982242584,
        0.04828418046236038,
        0.07255200296640396,
        0.05854038894176483,
        0.002348868874832988,
        2.7554322514333762e-05,
        -0.0025227274745702744,
        0.017290856689214706,
        -0.10444960743188858,
        0.04966006428003311,
        -0.026007628068327904,
        -0.02300417050719261,
        0.08616362512111664,
        0.0865316167473793
    ]
}