{
    "id": "KENzAAOzuNs",
    "title": "The WORST Version of Windows",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-07-13T19:05:27Z",
    "video_url": "https://www.youtube.com/watch?v=KENzAAOzuNs",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 155264,
    "likes": 5788,
    "comments_count": 1008,
    "description": "We all know the best was Windows XP Tech We Wish Would Come Back:  The WEIRDEST Custom Keyboards:  Ranking the WORST Controllers of All Time:  Shark Tank Scams Tested!  I got SCAMMED on Instagram:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:22 Windows 2000 1:48 Windows ME 2:47 Windows Phone 4:02 Windows Vista 5:25 Windows 95 6:08 Windows 10 7:06 Windows NT 7:42 Windows 7 8:48 Windows Mobile 9:15 Windows 8 10:00 Windows 365 11:02 Windows 1.0 11:45 Windows 11 13:00 Windows 98 14:15 Windows CE 14:58 Final Tier List",
    "description_links": [
        "https://youtu.be/zIj2tK2lJOI",
        "https://youtu.be/hzX6AOx0Pk8",
        "https://youtu.be/xJBcNbS-uTM",
        "https://youtu.be/w1-NoqAL5fE",
        "https://youtu.be/5dd1GmKPsIw",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- There have been some awful, awful, awful, awful versions of Microsoft Windows in the past but there's also been some good ones. - Vista's S tier, fight me. So today we are going to be ranking every version of Windows, asterisk, I think every version 'cause I don't actually know the list right now- - There's a lot of them. - As with a lot of, \"This Is\" videos, we do not know what we're about to be arguing about. But the first version of Windows is Windows 2000. - How do we argue these? Because like so many people who are watching this video have never used these. - We're going to give you our pain of being old people who had to use old versions of Windows. So the way that this went was Windows 2000 was built on the Windows NT code base, which was what eventually like Windows XP was using. Like it was a much more modern version versus the nine... I think it called it 9X which is the Windows 90 like five, 98, the older school build of Windows- - Which is why we never got an official Windows 9. - That's a rumor, I don't actually know if that was true. Supposedly a lot of apps, if they detected Windows 9, Windows 98 or something, I don't fully believe that but- - My conspiracy theory is- - What is Y2K also real? - Yeah, we have a whole movie about it. It's called \"Office Space\". - The thing is, this is back in a day where Microsoft were bringing out a lot of versions of Windows and you couldn't just download them. You had to actually go buy them and upgrade them. Hardware compatibility was very different. The problem with 2000 was it was very expensive and it also was one of these things where it was kind of better, but also was not a massive step forward. Like they had some of the core stuff that made it into like Windows XP, which was a huge step forward. But it was expensive, it was designed for businesses and it was almost a fail on Microsoft's part that regular consumers who want an upgrade were going out and buying the business pro version of Windows. - Or pirating it, \"Looks like you're trying to pirate an OS, can I help?\" That's what Clippy sounds like to me. I'm giving this one- - C? - I like starting off with C because like if we're so negative so quickly, I'm going C, I'm going C. - Okay, C tier. Next up you have, Window ME. Okay, yeah, I feel this is really easy. So to be fair, there's a lot of discussion about how Microsoft development was done back here. So I'm not super, exactly clear on the timelines but as far as I know, NT and XP like that was meant to be earlier. And ME was almost more of a stop gap to make yet another Windows 9X based OS which was filled with issues. Now mind you, it wasn't all bad. There were some good things in it. Like it had Windows Movie Maker in it. I actually started my channel with Windows Movie Maker. - One of the famous lines from Mac, \"It just works.\" That was just like a thing. Like you could plug in like any device to a Mac and it quote, unquote just works. What they did with that was they bloated the software, the OS because it just included every driver to every printer, to every whatever on the market. And that's why you had these massive OSs. And that's what ME did. This OS from 2000 was aptly named the Windows mistake edition and we're gonna rank it aptly so as an F, not even talking about the bugs. - Windows phone, Matt. - Oh, come on. - How the hell are we gonna rank Windows phone? - I would say the ceiling is a beat while the tiles were cool and whatnot. One, do we still use tiles? No. - The thing I liked about Windows phone was that it was very very quick and responsive considering, especially like Android in these days was still kind of laggy and slow. iOS was pretty quick, but Windows phone was so clear and concise, right? Mind you, you might not have liked the style. And I wasn't like a massive, massive fan but everything was very cohesive, quick, snappy and it looked nice. Now the big issue with Windows phone was app support. No Google apps, as far as I know or very, very few. I think they had like an app or two, but it wasn't like any kinda like real support. That almost alone was enough to kill Windows phone because Google obviously had a vested interest in making sure that Android was successful and iOS was too big to ignore. Honestly, for all the times that I did videos on Windows phones and stuff, I actually never daily drove a Windows phone for more than like a month at a time. I feel like it's D and I really am sad about that. - D? - Is this the rare time where I was gonna be way nicer? - I think so. It was so good, but it almost deserves a lower ranking due to the fact that it was so close to greatness and yet completely and totally failed. - You wanna give it a D? - I'm gonna give it the D, man. - Give it the D, next up we have Windows Vista, F. - S tier, baby! - There's nothing to talk about this. It is F tier alone because it removes Space Cadet 3D Pinball. - I'm gonna make an impassioned argument for why Vista was a major step forward. - Oh, here we go. - Now, keep in mind, Vista had six years- - Here we go. - Of development hell, right? So we talked about like, you know, Windows NT and ME and they were gonna go to an all new code base. Well, Vista was an all new code base. Vista was and still is the basis for Windows 11 today. I look at Windows Vista as like the beginning of modern Windows. - And I don't see that as a pro because I see history repeating itself right now. The requirements to get Vista running were so high. It's the same reason all these people talk about, \"My $3,000 computer can't run Windows 11.\" This is Vista all over again. - I'll admit there were problems with Vista the high system resources, and the fact that it was clearly after all those years still not fully baked. Windows 7 was really the complete version of Vista. Like Vista was like the beta of Windows 7. I think most people fondly look back at Windows 7, but I'll argue that Windows 7 and 8 and 10 and all the new versions would not have existed without Vista. I honestly, sincerely, completely would give Vista a C. I'm a Vista stan- - Scoff. - I stan for Vista. - Vista's the reason I stopped using Windows. I'm saying D- - Moving on. - Fine D, D all right, all right. Windows 95, it was great for a lot of households in America. I can't speak for the rest of the world, just 'cause I was not in the rest of the world in the summer of 1995. - '95 and '98 were like the first, to me, really popular versions of Windows and computers in general. And then obviously XP after that. The problem is I can't speak from experience because we didn't have a computer when Windows 95 came out. I've used it very briefly. I know it has a great reputation, but I was six and I don't think I could really evaluate Windows 95, all that well. - I'm giving this an A tier- - I'll just agree with you blindly. Also Steve Ballmer was very excited about this. - Steve Ballmer was. - And anything that Steve Ballmer is excited for, (indistinct) I'm always excited for. - You know what he was excited for that wasn't that great though? - Windows 10. - [Matt] Steve Ballmer was checked out, man. - Unlike Vista and especially the jump from XP to Vista, which was, it was six years and there were some service packs but XP didn't evolve that much. Windows 10 from the beginning to the end of its sort of run when 11 came out was a massively overhauled OS. Every few months it felt like Microsoft were bringing out major new features. Windows 10 when it first came out was a step forward from 8 but Windows 10 toward the end was terrific. And still is I think what most people are running on their systems, right? Now, there were some issues with Windows 10. Not only did they get a lot more aggressive with the auto updates but the telemetry and the data gathering and the analytics they were running in the background. It also finally got rid of Internet Explorer for realsies, which was great. To me, it's A tier, I guess. I don't think I could say 10 is S tier. I think it's a very, very- - A tier. - Good version of Windows but I also don't think it was particularly revolutionary. I think it was better than like 8, although 8.1 was reasonable. - I'll give you A tier, I'll give you A tier. All right, moving on, Windows NT. - Oh wow, so 1993 was when Windows NT came out it stood for new technology. - New technology. - It really was the basis for Windows going forward. You know, we were talking about all the Windows NT stuff. NT was the first kind of modern, I don't wanna say redesign, but it was like it was a structurally very, very different OS under the hood. And it took them what, seven, eight years before it finally came to the mainstream with Windows XP. How do you even rank that? - I mean like we gave Windows 95 an A, I say we gave this one a B - You wanna go with B? You wanna go with B, I'll go with you. - Moving on, Windows 7. Here's what I gotta tell you. I have never once used Windows 7. - Windows 7 was as if the clouds parted, the angels began singing and all became right with the world. - The miracle you just described, really contradicts how you were fighting to give Vista a C. - 7 I think gets a little bit of an extra boost because most people hated Vista. Because when Vista first came out, no one gave it... Well, people who gave it a shot, had a bad experience and then bailed on it. And then they just kinda waited till Windows 7 came out. - Yep, that's exactly what happened with me. - But if you stuck with Vista toward the end, you would've realized that 7 wasn't actually that big of a difference. I'm bordering between A or S. The only reason why I don't want to give it full S tier is just because what Windows 7 was is basically just slightly better Vista. And I know most people don't wanna agree with that. But like if Vista is all the way down at a D I feel like 7 is like an A. - I'm gonna counter argument. Again, not having used it, so don't at me. So now I can say whatever I want. Clearly Microsoft thought it was not an S tier because they decided to follow it up with 8. I'll give you A tier, I'll give you A tier. - Moving to our next operating system which is Windows Mobile, not an S tier, I will tell you that. - This is where I do have nostalgia. I was firmly a palm pilot person, this was like my laptop for a while, I had a dock for it. - Whoa, I never used Windows Mobile. My first Windows Mobile experience was Windows phone. So where do you rank Windows Mobile? - I'm not gonna pretend like it was better than like XP or whatever, I'll give it a B. - Okay, B tier it is. Next up we have Windows 8. The thing was Windows 8 brought in a very different design language. Where you had like the traditional desktop, but you also had the full tile view. But the problem was while they were trying to get people like the iPad and stuff, I didn't want my 24 inch, 10 ADP desktop display to be a bunch of dumb tiles of like a mobile app. - Because the tiles are built for touchscreen, like if you're trying to do a home desktop, it just didn't work out. - And they got rid of the start menu. So you couldn't avoid it. You literally hit the start key or the Windows key and instead of getting your normal menu, you got this huge full screen interface, which is dumb and looked stupid. - Here's my controversial take. I wanna give this an F tier just because of all the goddamn phone calls I got from my parents, \"Where's the start menu?\" - Next up we have (laughs) Windows 365. - Wait, wait, wait, wait, wait. - So, okay, so if you're not familiar Windows 365 is really Windows 11, but in the cloud you're not actually owning a computer, right? You could access this with again pretty much any web browser up to and including your phone if you have a keyboard or some very, very large amount of patience. And the way it works is that you pay a subscription. It starts, I think of like $28 a month and goes up. It basically depends on how much RAM you want, CPU. Like how much resources you want on that dedicated cloud system. - [Matt] We got Windows 365 running- - On an Xbox, on my bed? - On an Xbox. And then in that Windows 365, we got X cloud running. - [Austin] That was the greatest moment of Matt's entire life. - Yeah, my problem with it was when we looked at the pricing, the pricing is just too- - Very expensive. - It's expensive and the specs you get for even like that the cheapest thing it's like what? Like one core- - The two cores, four gigs of RAM or something- - Yeah, it's- - You really need to spend 50, 60 bucks at least a month on this, which is again why it is for enterprises and not for people. To me, this is like C or D. - Yeah, I'll give whatever you wanna do on that. - I'll give it a D. - Moving on, Windows 1.0. - Oh good Lord. I never in my life have used Windows 1.0, historically incredibly important. It made Microsoft a multi-billion dollar company. Like hugely important- - Had paint even back in one. - The Paint was good actually. - I think we got to go C. Window XP- - S tier. - S tier. - S tier. - S tier. - No doubt about it. Wait, wait, wait. - Yeah, go ahead. - Mark the time, Austin Evans and Matt Ansini unanimously agree on something. What user icon did you pick? - Oh, I was the chess piece. - You were the chess piece? - I was chess. - I think I was a soccer ball. - Soccer ball, 100%, absolutely. Can everyone just pause for a moment? (Windows tune) That might be the greatest sound ever created by humans. - [Matt] Windows 11. - [Austin] Oh. - Look, man, we're early into Windows 11. - Must be a year old at this point. - But right now I would say unimpressed. - I think Windows 11. Again, if you look at the historical context, is hurt a little bit by the fact that Windows 10 got so many years of updates. If Windows 10, would've been like previous versions of Windows, where it would've gotten like a couple of big chunks and that's it. And we've got all the new stuff from Windows 11 all at once, cool, but Windows 11 just basically felt like Windows, the next version of Windows 10, just with some shiny stuff and a few things under the hood. I mean, obviously it's not going to be as huge and as robust and as groundbreaking as a Windows version could be - Which is fine. - It is fine. - Except- - There's problems with- - All the sketch stuff that's done in the background. No more offline accounts. That's pissed off a lot of people. - Also the support. Now, yes, it is a free upgrade from Windows 10. However, you need a ridiculously high standard of hardware to run Windows 11 authentically. And the thing is it's just because Microsoft wanted to be like that. It's been a nightmare. And I don't know, off the top of my head, what the adoption is on Windows 11 at this point, but- - It's gotta be small because of we gave Windows 10 an A. - I think it's gotta be a C. - I agree with you, I was gonna say like it'd have to be B at best, but then with all the poor rollout has brought it down to a C for me. - All right, next up, we've got Windows 98. - So- - Whew. - Here's the thing with Windows 98 because I'm assuming you didn't use this one either. This is one where it gets a little controversial on paper, it was actually a pretty good upgrade. However, again, if Windows 95 was what made everything accessible to the average consumer Windows 98 kind of broke that a little bit. A ton of people were frustrated with they knew Windows 95 and then they no longer knew Windows 98 when it came up - It was early days when people weren't used to things were radically changing when you got a new update, right? They're like, \"Oh, it's just gonna like run faster. Or my printer's gonna work better or whatever.\" And then you had ME, you also had 2000 and you had XP all come out in like a three year time span. But Microsoft, it felt like they were thrashing into the surface to be constantly cranking out stuff. It was almost like they were crumbling under their own weight a little bit. And 98, while again, I can't really speak to it that much as far as personally using it, it felt like it was at a time where it was right before a huge transition to XP. And it wasn't really able to live up to its full potential. That being said, I think was fine. Like a B seems like- - A B seems fine to me. Yeah, like- - I will say though, one thing Windows 98 has the best logo. - All right, our last one Windows CE - This is a really weird one because CE was never actually like a mainstream version of Windows. This was meant to be a version of Windows that lived in something like an ATM or lived inside like signage whatever and fun fact, it's still supported, even though it came out in 1996. It is still going to be supported until 2023. It was a totally different kernel compared to NT and to DOS. On the surface was Windows E and it ran Windows E kind of things. But it was a very different thing that was really designed to be in and running for years and years and years at a time with very little maintenance. I mean, the fact that it came out in 1996 and is still being supported today is badass, C tier? - I'll give you C tier. You know, like it's right in the middle. Let us know what you liked the most out of all Windows operating systems. Are we way off base? Are we- - If any Windows ME stans show up, they're gonna be immediately banned from the comments. You've been warned. - Yeah, just banned. Like, subscribe, follow we'll catch you in the next one. (relaxing music)",
    "transcript_keywords": [
        "Windows",
        "Vista",
        "Windows phone",
        "Windows Vista",
        "Windows Mobile",
        "tier",
        "Windows Movie Maker",
        "version of Windows",
        "give",
        "Windows Movie",
        "Microsoft",
        "Microsoft Windows",
        "awful",
        "version",
        "people",
        "gave Windows",
        "rank Windows",
        "run Windows",
        "give Vista",
        "phone"
    ],
    "transcript_entity_values": [
        "Every few months",
        "Windows 95",
        "Android",
        "multi-billion dollar",
        "24 inch",
        "S. The",
        "CPU",
        "60 bucks",
        "the Windows NT",
        "the summer of 1995",
        "Windows CE - This",
        "7",
        "A ton",
        "stan",
        "six years",
        "One",
        "Windows Vista",
        "CE",
        "50",
        "Clippy",
        "Windows XP",
        "Microsoft",
        "Matt Ansini",
        "8.1",
        "RAM",
        "Steve Ballmer",
        "Windows 98",
        "years and years and years",
        "at least a month",
        "Windows 10",
        "ATM",
        "Windows 8",
        "2000",
        "Windows 11",
        "Google",
        "Matt",
        "Windows 7",
        "iPad",
        "daily",
        "Austin",
        "eight years",
        "Xbox",
        "Windows NT",
        "XP",
        "first",
        "Windows 98",
        "Windows",
        "early days",
        "10",
        "11",
        "1996",
        "Windows Movie Maker",
        "a year old",
        "Windows Mobile",
        "Windows",
        "'98",
        "F. - S",
        "nine",
        "Explorer",
        "Windows",
        "8",
        "three year",
        "Y2K",
        "98",
        "1993",
        "Windows 9",
        "100%",
        "'95",
        "like $28",
        "Vista",
        "Windows 1.0",
        "these days",
        "ADP",
        "one",
        "Mac",
        "Austin Evans",
        "four",
        "today",
        "Space Cadet 3D Pinball",
        "six",
        "Microsoft Windows",
        "F",
        "95",
        "98",
        "3,000",
        "America",
        "Windows 365",
        "2023",
        "two",
        "Windows Vista",
        "a day",
        "Windows 7",
        "Windows 7",
        "Windows NT",
        "seven"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "EVENT",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "LAW",
        "NORP",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "DATE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "GPE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "FAC",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.05820779874920845,
        -0.007639582734555006,
        0.07280457019805908,
        -0.007271864917129278,
        0.009447028860449791,
        0.011508221738040447,
        0.06349398195743561,
        0.028111260384321213,
        -0.02968142367899418,
        0.041143570095300674,
        -0.0031701428815722466,
        -0.006903942208737135,
        0.036653291434049606,
        0.003782841842621565,
        -0.02895079366862774,
        -0.03147507086396217,
        0.02500697411596775,
        -0.09426958113908768,
        -0.09994624555110931,
        0.029207633808255196,
        -0.09368463605642319,
        -0.0029019329231232405,
        -0.06195098161697388,
        0.05316765606403351,
        0.02570400759577751,
        -0.009462143294513226,
        -0.09526225924491882,
        -0.01930420845746994,
        -0.0434216633439064,
        -0.05226965621113777,
        -0.11622194200754166,
        0.07389658689498901,
        0.01864038221538067,
        0.013919072225689888,
        -0.01760365255177021,
        -0.1338675171136856,
        0.01690693199634552,
        -0.013380362652242184,
        -0.047732364386320114,
        -0.07545143365859985,
        -0.00670397887006402,
        0.06018267199397087,
        0.0050479392521083355,
        0.06386426091194153,
        0.01726871356368065,
        -0.01805567555129528,
        -0.015183943323791027,
        -0.036272093653678894,
        -0.07136218249797821,
        0.0374874621629715,
        -0.07200440764427185,
        -0.031750280410051346,
        0.038946229964494705,
        -0.006609055679291487,
        -0.03768278285861015,
        -0.06141773238778114,
        0.04905807971954346,
        0.0032924585975706577,
        0.016367996111512184,
        0.033698488026857376,
        -0.017215846106410027,
        -0.06972172111272812,
        -0.08934582024812698,
        -0.007327730767428875,
        0.016173698008060455,
        0.0029660535510629416,
        -0.03927826136350632,
        -0.033270422369241714,
        0.007394090294837952,
        0.006887604482471943,
        -0.07836924493312836,
        -0.02124638482928276,
        0.047185443341732025,
        0.06545346230268478,
        -0.07064361870288849,
        -0.010942438617348671,
        0.03166370466351509,
        -0.05388544872403145,
        0.02190147526562214,
        -0.01126281637698412,
        0.05892912670969963,
        -0.019578177481889725,
        -0.058353036642074585,
        -0.03644927591085434,
        0.007975433021783829,
        0.02837251126766205,
        -0.06995495408773422,
        -0.043518032878637314,
        -0.03737137094140053,
        -0.0010465107625350356,
        -0.09056954085826874,
        -0.004316175356507301,
        0.1463053971529007,
        0.0656421035528183,
        0.1211332157254219,
        0.045054949820041656,
        0.06362950056791306,
        -0.06562962383031845,
        0.012870999984443188,
        0.09599333256483078,
        0.01920376531779766,
        0.020889705047011375,
        0.08945294469594955,
        -0.027501780539751053,
        0.07708244025707245,
        -0.005489055998623371,
        -0.01044312585145235,
        -0.025750139728188515,
        -0.00630694767460227,
        -0.08713384717702866,
        -0.024762805551290512,
        -0.0245948638767004,
        -0.04577105492353439,
        -0.10119716078042984,
        0.0193205364048481,
        -0.11776402592658997,
        0.06360609829425812,
        0.07773235440254211,
        0.03923734650015831,
        0.06634388118982315,
        -0.006742211990058422,
        -0.0299005638808012,
        -0.05100192129611969,
        -0.04633965343236923,
        0.002585124457255006,
        0.036384791135787964,
        -0.053132303059101105,
        5.5479516675591644e-33,
        0.07021086663007736,
        0.0213477686047554,
        0.017902085557579994,
        0.058415841311216354,
        0.08925753831863403,
        0.03008265234529972,
        0.003775455290451646,
        0.007195635233074427,
        -0.025664443150162697,
        -0.06483076512813568,
        0.02691340446472168,
        0.016390200704336166,
        -0.03652939572930336,
        -0.030971918255090714,
        0.1558721512556076,
        0.010099336504936218,
        -0.021505514159798622,
        0.03234594315290451,
        -0.06125189736485481,
        -0.04954054579138756,
        0.05375291407108307,
        0.01712840050458908,
        0.004760451149195433,
        -0.15618914365768433,
        0.040975939482450485,
        -0.08519072830677032,
        -0.04432578384876251,
        -0.03257514908909798,
        -0.006015435792505741,
        0.0005937303067184985,
        -0.02312588505446911,
        -0.010053575038909912,
        -0.02644055150449276,
        -0.0329773835837841,
        -0.03185627609491348,
        -0.019562607631087303,
        0.0017086452571675181,
        -0.04205382987856865,
        0.060423292219638824,
        -0.06932056695222855,
        -0.09859655052423477,
        0.018054164946079254,
        0.0038184497971087694,
        -0.016482695937156677,
        0.08506009727716446,
        0.04480297863483429,
        -0.036520957946777344,
        0.010275138542056084,
        0.00177021324634552,
        -0.021824417635798454,
        -0.009737846441566944,
        0.03903893381357193,
        0.032135967165231705,
        0.09836330264806747,
        -0.0820091962814331,
        -0.031092310324311256,
        0.060125403106212616,
        -0.01868501864373684,
        0.02170255407691002,
        0.07755172252655029,
        0.04256506264209747,
        -0.0052995262667536736,
        -0.011012155562639236,
        -0.05109647288918495,
        -0.0032748666126281023,
        -0.03400793671607971,
        0.04627353325486183,
        -0.003606936428695917,
        -0.08166126161813736,
        0.04111582413315773,
        -0.03970622643828392,
        -0.07742945849895477,
        -0.03553822636604309,
        0.008200583048164845,
        0.02843698300421238,
        0.04750338941812515,
        0.0426994264125824,
        -0.014321164228022099,
        0.011164055205881596,
        -0.019262343645095825,
        -0.007234653923660517,
        0.021902544423937798,
        -0.019607260823249817,
        -0.0632430911064148,
        0.015907203778624535,
        -0.0201733335852623,
        0.008129927329719067,
        -0.06026249751448631,
        0.06395585089921951,
        0.020062072202563286,
        -0.06062746420502663,
        -0.03073856420814991,
        0.041069988161325455,
        0.07964669167995453,
        -0.05674641206860542,
        -7.149286112040103e-33,
        -0.06994172930717468,
        -0.02943073771893978,
        0.04224080964922905,
        0.01565311662852764,
        -0.038245853036642075,
        -0.02889508195221424,
        -0.05121627077460289,
        -0.0034357323311269283,
        -0.06245684251189232,
        -0.02399713173508644,
        0.029929649084806442,
        0.1070784479379654,
        0.056003402918577194,
        0.0491037480533123,
        0.07321993261575699,
        -0.003738293657079339,
        0.010227780789136887,
        -0.054876770824193954,
        0.010731343179941177,
        0.030154433101415634,
        0.010291403159499168,
        0.06250663101673126,
        -0.15075480937957764,
        0.05423694849014282,
        0.011450626887381077,
        -0.026402050629258156,
        -0.0440356582403183,
        -0.012443658895790577,
        0.08184552192687988,
        -0.041924409568309784,
        0.05656037479639053,
        0.012769234366714954,
        -0.042325422167778015,
        -0.024468939751386642,
        0.06481508165597916,
        0.005417080596089363,
        0.018124861642718315,
        -0.1079895868897438,
        -0.02472657524049282,
        0.025100279599428177,
        0.031059814617037773,
        -0.0455782525241375,
        0.010103859938681126,
        0.03424249216914177,
        0.017709583044052124,
        0.0015585965011268854,
        -0.031478412449359894,
        -0.02455698512494564,
        -0.01059133280068636,
        0.04376017302274704,
        0.06356317549943924,
        -0.016146119683980942,
        -0.03292184695601463,
        0.051431190222501755,
        -0.03658023849129677,
        -0.06295508146286011,
        -0.0726495087146759,
        0.0248227771371603,
        -0.03349990397691727,
        0.04708801582455635,
        -0.006215380039066076,
        0.013140372931957245,
        -0.013371467590332031,
        -0.043537627905607224,
        -0.018566560000181198,
        0.008365252055227757,
        0.07109157741069794,
        0.09092319011688232,
        -0.08374418318271637,
        -0.037884969264268875,
        -0.048791877925395966,
        0.003995648119598627,
        -0.13748599588871002,
        -0.11045472323894501,
        -0.020715193822979927,
        0.06334058940410614,
        0.08121143281459808,
        -0.013585736975073814,
        -0.05008728429675102,
        -0.025815805420279503,
        0.005623986478894949,
        0.019616831094026566,
        0.06929363310337067,
        0.022776620462536812,
        0.02258618175983429,
        -0.009668192826211452,
        0.0861208364367485,
        -0.013434093445539474,
        -0.005177440121769905,
        -0.013775603845715523,
        0.01398339681327343,
        -0.035842638462781906,
        0.02289441041648388,
        0.06999871134757996,
        0.019356004893779755,
        -6.186150613984864e-08,
        -0.001007910119369626,
        0.0085698701441288,
        -0.03384530171751976,
        0.045415300875902176,
        0.02103833481669426,
        -0.0017765184165909886,
        -0.07983310520648956,
        0.02845044434070587,
        -0.030639883130788803,
        0.010923873633146286,
        0.028280209749937057,
        -0.07780609279870987,
        -0.048734795302152634,
        -0.021902313455939293,
        0.059852100908756256,
        0.11380703747272491,
        -0.15177811682224274,
        0.05145445093512535,
        0.0119013711810112,
        -0.024901771917939186,
        -0.01978951133787632,
        0.08505060523748398,
        0.09112972766160965,
        -0.01330835185945034,
        -0.04517638683319092,
        -0.010195429436862469,
        -0.0009434949024580419,
        0.006482007913291454,
        0.057502053678035736,
        0.06560180336236954,
        0.039510034024715424,
        -0.031158944591879845,
        0.02257547900080681,
        -0.003676688764244318,
        -0.007995733059942722,
        0.027415281161665916,
        -0.00965412613004446,
        0.024733031168580055,
        0.03247414529323578,
        0.04012684151530266,
        0.03376690670847893,
        -0.04786122590303421,
        0.04254470020532608,
        0.08538136631250381,
        -0.03004448302090168,
        -0.020252104848623276,
        -0.06640587002038956,
        -0.06374335289001465,
        0.028471317142248154,
        -0.07854070514440536,
        -0.05807820335030556,
        -0.03039454109966755,
        0.037717606872320175,
        0.05506476014852524,
        0.06020257994532585,
        0.04934501647949219,
        -0.03572451323270798,
        0.026739027351140976,
        0.03509289398789406,
        0.06342507153749466,
        0.145207017660141,
        -0.021362563595175743,
        -0.0552351213991642,
        0.12727755308151245
    ]
}