{
    "id": "kEuWbJZmbfM",
    "title": "What Apple Isn't Telling You",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-06-03T18:13:37Z",
    "video_url": "https://www.youtube.com/watch?v=kEuWbJZmbfM",
    "category": "Science & Technology",
    "tags": [
        "wwdc",
        "wwdc 2021",
        "apple",
        "apple event",
        "new apple event",
        "2021 apple",
        "apple 2021",
        "apple event june 2021",
        "apple event june",
        "june",
        "2021",
        "mac",
        "macbook pro",
        "macbook air",
        "macbook",
        "mac pro",
        "imac",
        "imac pro",
        "rumor",
        "leak",
        "the test drivers",
        "austin evans"
    ],
    "views": 629883,
    "likes": 24314,
    "comments_count": 1597,
    "description": "Check out the Logitech Combo Touch!  The June Apple Event at WWDC 2021 has some big stuff from Timmy Cook. We built \"invisible\" gaming PCs:   My new podcast @TheBackmarkers!  I have a TikTok!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://logi.link/austinnotduncan",
        "https://youtu.be/WIMMi60S9zc",
        "https://www.relay.fm/testdrivers",
        "https://www.tiktok.com/@austintechtips",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Apple has an unfair advantage and the PC space may never be the same. So Apple's WWDC is right around the corner and it's got me thinking a lot about the Mac. Now it's no surprise, but in 2021 Apple's pretty much dominating the majority of their markets. Think about it, iPads are pretty much the tablet and think about AirPods. I don't really think most people understand just how massive the AirPod market is. In 2018 alone, AirPods brought in $8 billion with a B in revenue, which for context is more than the entirety of AMD, for AirPods. But while Samsung will happily sell you a sub $200 Galaxy phone, Apple are busy selling $400 iPhone SEs and $700 iPhone 12s, which they make a lot more money on per unit compared to those budget Samsung options. Apple has always done well in the premium PC space. Similar to the phone market, they almost exclusively sell laptops and desktops that are very expensive, typically over a thousand dollars, and that is in search of that sweet, sweet profit. Now it makes sense, right? As Apple, why would you go after the HP Streams that are costing $200 of the world when you can sell people thousand dollars MacBooks? It just makes sense if you could actually pull it off. With the introduction of Apple silicon though, I really think that Apple is about to crack the PC market wide open. And in reality, it's all thanks to the iPhone. Back in the days of the OG phones, Apple were using a lot of off the shelf components, including CPUs. Now the first time they designed their own chip was for the iPad with the Apple A4. This wasn't truly a custom CPU as Apple had purchased a promising chip design company called P.A. Semi to get the project off the ground at least initially. It wasn't until 2013 with the A7 chip and the iPhone 5s where things really started to take off. The A7 was a 64-bit processor and it was years ahead of what anyone expected in the phone space. Competitors like Qualcomm scrambled to rush their 64-bit CPUs to market, but it was too late. Apple had snatched the performance crown and they have not looked back since. With over a decade of groundwork laid, Apple have the seeds to launch their next big play. Right now, the Mac is a relatively small part of the PC market, accounting for only about 8% market share. Considering how dominant most of Apple's other products are, in my opinion, this is definitely where they have the most potential to grow. And they're in a great position to do that, thanks to their new M1 chips. Even when Apple first announced their plans to switch over to their own Apple silicon-based chips, leaving behind over a decade of history with Intel in their- - [Man] Partnership. - Partnership, thank you very much. There was a lot of speculation on whether there would be any upper groin pains transitioning from the previous Intel chips to Apple silicon. And trust me when I say, it is not as easy as it sounds. So for example, Microsoft introduced Windows on ARM years ago, and yet they've still come nowhere near Apple's level of compatibility. A great example of this is Adobe. Now on the Windows side, they only have a handful of apps, they're really fully optimized, whereas in just a few months, somehow they were able to get almost all their apps up and running on Apple silicon. Funny at how that works, right? When you actually sell ARM based systems and not just talk about making them. - [Man] Yikes. - As soon as we got our hands on the M1 Macs, it was really clear. This was a completely different animal. Not only are the M1 chips incredibly powerful, but importantly, they're also power efficient, which means great battery life. It is one of those very, very rare situations in the computer industry where you get to have your cake and eat it too. Or you get to eat your cake and have it too. - [Man] Why would I wanna have my cake if I can't eat it? - You may want to save it for later. This video is sponsored by Logitech. Now the iPad has gotten a lot more powerful over the years but what really makes it more than a laptop is this, the Logitech Combo Touch. Not only are you getting a great backlit keyboard with a full row of iPad shortcut keys, but you also get that track pad which makes a big difference. If you've never used an iPad with the track pad, it is an absolute game changer. Essentially with a single device, you can seamlessly go from your touch screen to using the Apple Pencil all the way to the track pad on that single device. The compound touch design is also super versatile. So as it uses a smart connector, you never have to think about charging the keyboard and it's also detachable so you can use the iPad as standalone tablet, pop out the kickstand, attach the keyboard, all the while keeping your iPad Pro protected. So if you're looking for a premium experience at a solid price, then definitely be sure to check out the Logitech Combo Touch, the link in the description. Of course, huge shout to Logitech for sponsoring this portion of the video. Now we're getting a little bit into speculation town here, but I expect that the M1 will stick around in base models, while we get something like an upgrade version of the processor with the things that Pros want. Think more than one display out your MacBook Pro or more RAM, higher spec things. Then we don't know what the next version of the M1 will be called yet. There's a lot of speculation that might be the M1X, following the naming convention of the iPad chips because one of the issues with the entire M1 lineup right now, is there's very, very little difference between the models. You have eight and 16 gigs of RAM options and you get a seven core GPU versus an eight core GPU for the more advanced model. My best guess for what the full Apple silicon lineup is going to be, is something like this. So the base models for the foreseeable future will likely have the M1 CPU. It's clearly more than powerful enough for the vast majority of people out there. And then we'll get the upgrade, M1X or whatever they decide to call it, the model with more CPU cores, more GPU options. That'll go into the Pro Macs, not to be confused with the iPhone Pro Max or the Mac Pro, the Pro level Macs. We've got all the ingredients coming together now. Apple has a huge lead building their own chips, which are legitimately some of the best in the business and they no longer have to pay Intel for chips. Can you imagine Apple pulling off the new 24 inch iMac design, while having to cool an expensive Intel processor and wait for Intel to bring them that new generation? I mean, Apple silicon gives them the performance and importantly the flexibility to design exactly like they want. Okay, so this might sound like a stretch but hear me out. Apple can also make the Mac cheaper. Look at the Mac Mini which actually did get a drop in price as soon as they moved it from an Intel processor to the M1. No longer does Apple have to pay Intel $150 plus per chip when they can use their own M1 processors for less than maybe what, 40, 50 bucks, at least that's my estimate. But regardless, it's definitely cheaper than what they're buying them from Intel at. Sure, companies like Microsoft and Google are working on their own chips, but Apple has a huge lead based on all the work they've done for the iPhone that the Mac essentially inherited for free. Right now no one else in the space is really prepared to take Apple on here. Apple gets to taking margin for themselves which either allows them to cut the pricing slightly without losing too much profit or just spend that money on design or Tim Cook's bank account. Regardless, Apple's always been known as a premium brand and that expense now actually comes with some of the best overall fundamentals in the industry. Those are a lot of upgrades that I think you're going to be coming over the next year to two years for the Mac lineup. So of course, some of this stuff we may see at WWDC next week, but one of the big ones really I expect is the next version of the iMac. So we already have the 24-inch which I think is a very good look at what the iMac 30, 32 maybe even call it the iMac Pro will actually look like. So my prediction is this. Obviously larger screen, maybe we get a little bit more on the port selection, ideally we have something like 10 gig ethernet onboard. But realistically, the main difference between the standard iMac and the iMac Pro is going to be the processor. I do think this will be one of the systems that can really benefit from at least the option of something like an M1X or M2X, whatever that next tier up processor is. Something else I really wanna see is next generation of MacBook Pro. Now, of course the current MacBook Pro does have the M1 processor but it's only in the base model, the 13-inch. Instead, I think what we'll see here is something that's already actually been fairly well leaked, a brand new 14-inch Mac Pro and a brand new 16-inch Mac Pro. Now the schematics have already shown that they're going to shock on surprise, add more ports. So in addition to USB 4/USB-C we'll also have HDMI, we'll have MagSafe, which I'm actually very excited about, potentially even with ethernet on the dongle similar to the iMac. And we'll also have an SD card slot. In addition, I think the upgraded performance should be a big boon here. So whether it's the M1X or M2, whatever they decide to call it, I think these systems should have an option for more performance which would be nice to know I have more RAM. But on top of that, having the ability to connect more displays. Something that is a real bottleneck for me personally when I'm using the M1 MacBook Pro is that in addition to the internal screen, gonna hook up one extra display, something that pretty much every other Intel, AMD and Nvidia laptop can allow you to do more than. However with M1X, I expect that you could to at least connect it to a couple of different displays if you wanna live that multi-screen lifestyle. It also seems like the MacBook Air is very much in store for an upgrade as well. So a bunch of leaked renders have shown that the MacBook Air will get a lot of inspiration from the iMac, including things like a white bezel which I might not be a huge fan of, but also things like a white keyboard and importantly a bunch of colors because I like colors, that's all, that's literally the extent of this. - [Man] I want a yellow one. - Now, if we can all kind of just sit down, we can all kind of tip our rumor hats for a moment. I have a theory. This is backed up by no evidence whatsoever besides the fact that I think it would be cool. The MacBook Air currently runs $1,000 for the base model, I think a fairly reasonable amount considering just how good that system is. But what if, we had a MacBook 12-inch yet again or better yet, an iBook. Okay, just hear me out here, right? So Microsoft does this with this Surface Go. It is a smaller, cheaper, and more portable laptop that's very much based on the Surface Line, but it's like what? Five, 600 bucks and importantly it gives you almost all of those same features. Imagine if Apple with their new found savings from Apple silicon makes a smaller MacbBook Air, trim out some ports, maybe just give me one port, make the screen smaller, I don't know, remove Touch ID, whatever you gotta do. But imagine, they had like an $800 iBook. That would sell like GameBurst. I'm just saying, free advice Timmy Cook if you aren't already working on it, that's fine. Think about it. Then we have the Mac Pro. This is I think the most complicated of all of the Apple silicon transitions. First of all, I don't expect to see this anytime soon. They said it's gonna take two years to do this full transition. I fully expect the Mac Pro to be the very last system in the line. Now to do this, there are a couple of ways they can handle it. So of course the Mac pro just a couple of years ago, saw a very major overhaul where they brought back a much more traditional tower style system. But even though it is currently powered by Intel processors and AMD GPUs, this thing is loaded up with upgradability. You have tons of PCI slots, you have the MPX modules. There's a lot of stuff here which seems like it doesn't necessarily directly correlate to how they would make Apple silicon work. Think about some of the limitations of at least current Apple silicon as it sits today. You can not connect any kind of external GPU, even over Thunderbolt. You can't connect additional RAM, it's all on package. So the M1s is just eight or 16, the end. And on top of that, what kind of GPU are they gonna put in here because Apple silicon, even if it did support an external GPU, has no AMD or Nvidia driver support. If Apple is going to do this, they really only have two options. Either they scale up an Apple silicon GPU or they straight up letting you throw in an AMD or an Nvidia GPU inside of the Apple silicon Mac Pro. They could do that, but they've spent all this time and all this money getting away from anything that's not Apple brand, they're trying to keep that vertical integration. So does it make sense for them to really ship an AMD or an Nvidia GPU? Maybe, maybe for a short while, while they're transitioning, who knows? But the Mac Pro is absolutely the biggest question mark on what that system will look like once it does have that full Apple silicon glow up. At this point, I think that the future for the Mac is incredibly clear. As a company, Apple has a ton of incentive to try to push this as far as they can, because they're not really, I mean, sure Apple will make a car and they make some VR glasses, blah, blah, blah. They'll try all these other things. But if you look at how they're going to grow their company and grow their market share at the moment, the Mac seems like the very obvious spot to start. And beyond that, Apple silicon gives them a huge advantage. They have a several year headstart on everyone else in this space, they have the full vertical integration. And as far as the consumer side goes, it makes a lot of sense. It's buy an Apple silicon Mac. Again, they've amazing performance, great battery life, they have some really interesting designs, they run cool, they run quiet. I mean, there's so much to sort of support these things and we've only seen the very first generation of Apple silicon Macs. I'm very curious, what do you think about where Apple is right now and where they're headed with the Mac? Because as far as I'm concerned, these are by far the most exciting Macs we've ever seen and there's so much potential. It is incredibly, incredibly rare for a single company to make such a huge leap in the PC space, right? But anyway, thank you very much for watching Austin's Rank Corner on Macs. Make sure to subscribe and ring-a-ling that ding-a-ling bell because WWDC is coming and my predictions will soon be proven incorrect.",
    "transcript_keywords": [
        "Apple",
        "Apple silicon",
        "Mac Pro",
        "Apple silicon Mac",
        "Mac",
        "Pro",
        "silicon Mac Pro",
        "Apple silicon GPU",
        "full Apple silicon",
        "Apple silicon makes",
        "make Apple silicon",
        "silicon",
        "MacBook Pro",
        "Intel",
        "Macs",
        "Pro level Macs",
        "Pro Macs",
        "GPU",
        "silicon Mac",
        "full Apple"
    ],
    "transcript_entity_values": [
        "$8 billion",
        "iPhone",
        "M2",
        "MacBook",
        "iPad",
        "first",
        "the next year to two years",
        "two years",
        "Qualcomm",
        "32",
        "Five",
        "two",
        "AMD",
        "12-inch",
        "M1 MacBook Pro",
        "one",
        "AirPod",
        "iMac",
        "a ton",
        "14-inch",
        "Tim Cook's",
        "13-inch",
        "The MacBook Air",
        "Adobe",
        "AMD GPUs",
        "GPU",
        "OG",
        "WWDC",
        "2021",
        "2018",
        "24 inch",
        "MagSafe",
        "iPad Pro",
        "Austin",
        "24-inch",
        "GameBurst",
        "just a few months",
        "MacbBook Air",
        "Nvidia",
        "Galaxy",
        "16",
        "Macs",
        "Logitech",
        "PCI",
        "M1s",
        "1,000",
        "the iMac Pro",
        "seven",
        "today",
        "a decade",
        "Rank Corner",
        "AMD",
        "600 bucks",
        "Windows",
        "the Mac Pro",
        "800",
        "MPX",
        "Google",
        "10",
        "WWDC",
        "USB 4/USB-C",
        "eight",
        "12s",
        "thousand dollars",
        "AirPods",
        "40",
        "400",
        "the Mac Mini",
        "Apple",
        "Thunderbolt",
        "700",
        "the years",
        "years",
        "the MacBook Air",
        "MacBook Pro",
        "only about 8%",
        "200",
        "Microsoft",
        "CPU",
        "A7",
        "SD",
        "Mac Pro",
        "Mac",
        "the days",
        "iMac",
        "Windows on ARM years ago",
        "First",
        "iBook",
        "the Mac Pro",
        "MacBooks",
        "M1",
        "50 bucks",
        "Timmy Cook",
        "RAM",
        "a couple of years ago",
        "Samsung",
        "64",
        "the Surface Line",
        "just eight",
        "150",
        "more than one",
        "a sub $200",
        "P.A. Semi",
        "the HP Streams",
        "iPads",
        "Pros",
        "Intel",
        "Mac",
        "5s",
        "2013",
        "next week",
        "MacBook Pro",
        "16-inch",
        "over a thousand dollars",
        "the M1 Macs"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "LOC",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "DATE",
        "MONEY",
        "FAC",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "ORG"
    ],
    "vector": [
        0.010811887681484222,
        -0.07124906033277512,
        0.09437156468629837,
        -0.033487603068351746,
        0.04596371576189995,
        -0.02247726544737816,
        0.03742585331201553,
        0.046643033623695374,
        0.02149401605129242,
        0.10043515264987946,
        0.027652135118842125,
        0.03646793216466904,
        0.0002765753888525069,
        -0.042089320719242096,
        0.05075160413980484,
        -0.02212442457675934,
        0.07157156616449356,
        -0.08494379371404648,
        -0.04563619941473007,
        0.03560202941298485,
        -0.02288811095058918,
        0.033941883593797684,
        0.06893111020326614,
        -0.007949238643050194,
        0.06384866684675217,
        0.007360903080552816,
        -0.02908317744731903,
        -0.0901431292295456,
        -0.04304767772555351,
        0.036236122250556946,
        -0.05723577365279198,
        0.03898073732852936,
        0.0330679677426815,
        0.04512897878885269,
        0.0016791834495961666,
        -0.1101222112774849,
        0.03302749618887901,
        -0.055765509605407715,
        -0.024126939475536346,
        -0.06448112428188324,
        -0.08519168198108673,
        -0.05262792855501175,
        -0.03964540734887123,
        0.06110372766852379,
        0.00449303537607193,
        -0.06320661306381226,
        0.02152801677584648,
        -0.0383504219353199,
        0.0010797339491546154,
        0.08460384607315063,
        -0.013753651641309261,
        -0.04396494850516319,
        0.06303758174180984,
        -0.032098378986120224,
        -0.011383220553398132,
        -0.0009389187907800078,
        -0.03769747167825699,
        0.014106055721640587,
        0.09628000855445862,
        0.044982556253671646,
        -0.006150207947939634,
        -0.08280390501022339,
        0.026635058224201202,
        -0.020638324320316315,
        0.018509989604353905,
        -0.07848207652568817,
        -0.0056663258001208305,
        0.02615939825773239,
        0.011037370190024376,
        -0.0026117791421711445,
        0.043523531407117844,
        -0.012867890298366547,
        0.090101458132267,
        0.013186759315431118,
        0.02502671629190445,
        0.038522202521562576,
        0.08174236863851547,
        -0.022228529676795006,
        0.04070223867893219,
        0.05196445807814598,
        0.05438941717147827,
        -0.022599076852202415,
        -0.018284084275364876,
        -0.04736410826444626,
        -0.003466254798695445,
        -0.037609804421663284,
        -0.04979367554187775,
        -0.011826733127236366,
        -0.06594573706388474,
        0.016363006085157394,
        -0.02631601132452488,
        0.04866331070661545,
        -0.03008863516151905,
        -0.02681313455104828,
        0.033644646406173706,
        -0.007840903475880623,
        -0.008141032420098782,
        0.03275035694241524,
        -0.010146626271307468,
        0.027569783851504326,
        0.027537215501070023,
        0.10968893021345139,
        0.04257955029606819,
        -0.005545219872146845,
        -0.008380473591387272,
        -0.09357113391160965,
        -0.004315255209803581,
        -0.05741989612579346,
        0.058431677520275116,
        0.07623444497585297,
        0.01636912301182747,
        -0.06720836460590363,
        -0.11591120809316635,
        -0.004407597240060568,
        0.006257554516196251,
        -0.0160761047154665,
        -0.001033551525324583,
        0.08394487202167511,
        0.0760512501001358,
        0.011153574101626873,
        -0.05257633328437805,
        0.09432897716760635,
        -0.00026613217778503895,
        0.016364993527531624,
        -0.03700869902968407,
        0.05040799826383591,
        -0.12774357199668884,
        5.854453003328445e-33,
        -0.08240200579166412,
        0.027941042557358742,
        -0.011270775459706783,
        -0.0335758812725544,
        -0.06272002309560776,
        -0.02135610394179821,
        0.031670570373535156,
        0.07865863293409348,
        0.024680769070982933,
        0.020314758643507957,
        -0.09263160079717636,
        0.01738808862864971,
        -0.04635273665189743,
        0.012697095051407814,
        0.07923456281423569,
        -0.08006972819566727,
        -0.11992006003856659,
        -0.033588435500860214,
        -0.019200854003429413,
        -0.0005277651944197714,
        -0.010970225557684898,
        0.002045973436906934,
        0.0009673535823822021,
        0.023939479142427444,
        -0.01278519257903099,
        -0.08960902690887451,
        -0.011575685814023018,
        -0.05112135037779808,
        0.03232945129275322,
        0.020978666841983795,
        -0.05396375432610512,
        -0.000983322155661881,
        0.04279153794050217,
        -0.12272217124700546,
        -0.04919373616576195,
        -0.060369253158569336,
        0.022064249962568283,
        -0.049308523535728455,
        0.06917938590049744,
        -0.0030542761087417603,
        -0.1256992518901825,
        -0.007530368398874998,
        -0.05153649300336838,
        -0.00877602118998766,
        0.03050760179758072,
        0.04720218479633331,
        -0.043559398502111435,
        0.005200921092182398,
        -0.04448540881276131,
        -0.034580666571855545,
        -0.04244115203619003,
        -0.005812888965010643,
        0.007998909801244736,
        0.025412805378437042,
        0.011984867043793201,
        -0.09407079964876175,
        -0.030646637082099915,
        -0.08133891969919205,
        0.0345783494412899,
        0.07266125828027725,
        -0.06737162917852402,
        0.03382622450590134,
        0.005809537600725889,
        0.002453270135447383,
        -0.10469433665275574,
        0.0896683782339096,
        0.09312760084867477,
        0.008174742572009563,
        -0.07422496378421783,
        0.1049143597483635,
        0.03955456241965294,
        0.02222127839922905,
        -0.015577355399727821,
        -0.06296274811029434,
        -0.0030409032478928566,
        0.005597769282758236,
        0.01986628957092762,
        0.01623361185193062,
        -0.03943823650479317,
        0.018899865448474884,
        -0.014296311885118484,
        0.033552899956703186,
        0.06417836993932724,
        0.021907782182097435,
        -0.030574481934309006,
        0.015639975666999817,
        0.04390229284763336,
        -0.06221364066004753,
        0.030921336263418198,
        0.030040619894862175,
        -0.026854034513235092,
        0.04122442379593849,
        -0.03576616942882538,
        0.010101097635924816,
        -0.015688719227910042,
        -5.493425994754288e-33,
        0.01637924276292324,
        0.02860676310956478,
        -0.019514290615916252,
        -0.004414145369082689,
        -0.058309685438871384,
        -0.04079288989305496,
        0.033202171325683594,
        -0.0401134118437767,
        -0.047008976340293884,
        -0.08249713480472565,
        -0.024098524823784828,
        0.06490016728639603,
        0.005525676533579826,
        0.030688272789120674,
        -0.05040612444281578,
        -0.006710880436003208,
        -0.05044659227132797,
        -0.06850386410951614,
        0.0566885806620121,
        -0.06286167353391647,
        0.027505140751600266,
        -0.011033049784600735,
        0.09973949193954468,
        0.044570256024599075,
        -0.015582633204758167,
        -0.04012072831392288,
        -0.06245758756995201,
        -0.011362333782017231,
        0.026451777666807175,
        -0.03503129631280899,
        -0.005271022208034992,
        -0.02804010733962059,
        0.059148434549570084,
        0.032328084111213684,
        0.10624374449253082,
        0.020831162109971046,
        -0.046582311391830444,
        -0.019227711483836174,
        0.0053339758887887,
        0.003412419930100441,
        0.030292486771941185,
        0.005051106214523315,
        -0.016114840283989906,
        -0.002838917775079608,
        0.03412966802716255,
        0.005197413265705109,
        -0.025985414162278175,
        0.08067448437213898,
        0.0844568982720375,
        -0.08548992872238159,
        0.043363794684410095,
        0.039590682834386826,
        -0.06137785688042641,
        -0.028098218142986298,
        -0.08602887392044067,
        0.025476444512605667,
        -0.01589406281709671,
        0.00141460623126477,
        -0.058375097811222076,
        0.018119726330041885,
        0.05802546441555023,
        0.04069115221500397,
        0.039164185523986816,
        -0.020970452576875687,
        -0.018259771168231964,
        0.009767323732376099,
        0.03419261798262596,
        0.009502588771283627,
        0.028013495728373528,
        -0.01828649453818798,
        0.016331255435943604,
        -0.020706767216324806,
        -0.02848226949572563,
        -0.0333675853908062,
        -0.04828187823295593,
        0.1433870792388916,
        0.0772770568728447,
        -0.017728500068187714,
        0.048206981271505356,
        -0.04290281608700752,
        0.018085617572069168,
        0.16974003612995148,
        0.05067816749215126,
        0.021247750148177147,
        -0.012211776338517666,
        0.07154443860054016,
        0.027166595682501793,
        -0.04768573120236397,
        -0.12671120464801788,
        0.10467370599508286,
        -0.061558354645967484,
        -0.06127529218792915,
        -0.039254043251276016,
        0.030594665557146072,
        0.0027282731607556343,
        -5.431570926361928e-08,
        0.019492145627737045,
        0.015160974115133286,
        0.07283332943916321,
        0.010254706256091595,
        0.008746648207306862,
        0.01064329594373703,
        0.033798933029174805,
        0.028692925348877907,
        0.13526666164398193,
        0.0899558812379837,
        0.0037158289924263954,
        -0.045483846217393875,
        -0.08280958235263824,
        0.0680493712425232,
        0.03052891045808792,
        0.10445365309715271,
        -0.09262523055076599,
        0.049550462514162064,
        -0.004117227159440517,
        -0.06596784293651581,
        -0.015399842523038387,
        0.07868238538503647,
        0.00478495704010129,
        -0.016532203182578087,
        -0.06663978844881058,
        0.002437424147501588,
        -0.051611416041851044,
        0.01441841572523117,
        -0.002231538761407137,
        0.049493566155433655,
        -0.05614827573299408,
        -0.10223084688186646,
        -0.0429966002702713,
        0.012975605204701424,
        0.019681280478835106,
        -0.1037689745426178,
        -0.05811704322695732,
        0.022276287898421288,
        -0.017128154635429382,
        0.021639050915837288,
        -0.060564085841178894,
        -0.06406588107347488,
        -0.0009550125105306506,
        0.0025859929155558348,
        -0.017962472513318062,
        -0.10060989856719971,
        -0.048239175230264664,
        0.018719950690865517,
        -0.0003530374960973859,
        0.07624250650405884,
        0.04040861502289772,
        0.029362980276346207,
        0.062059491872787476,
        -0.0009590550325810909,
        -0.012304896488785744,
        -0.0020086863078176975,
        -0.019021611660718918,
        -0.05673439800739288,
        -0.0817333459854126,
        0.039777159690856934,
        0.041597481817007065,
        -0.09342785179615021,
        0.0036128463689237833,
        0.13416753709316254
    ]
}