{
    "id": "KF3uvSltvb0",
    "title": "The NEW Lenovo Yoga Pro 7 is Here.",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-03-14T15:06:13Z",
    "video_url": "https://www.youtube.com/watch?v=KF3uvSltvb0",
    "category": "Science & Technology",
    "tags": [
        "lenovo",
        "yoga",
        "yoga pro",
        "yoga pro 7",
        "pro 7",
        "lenovo yoga pro 7",
        "unboxing",
        "review",
        "laptop",
        "amd",
        "ryzen",
        "ryzen ai",
        "rtx",
        "nvidia",
        "creator",
        "austin",
        "austin evans"
    ],
    "views": 265787,
    "likes": 3823,
    "comments_count": 152,
    "description": "Check out the Lenovo Yoga line:   Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:",
    "description_links": [
        "https://www.lenovo.com/us/en/c/laptops/yoga/products/",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- This is the Lenovo Yoga Pro 7. Whenever I make a laptop video, I like to ask a simple question. Who is this for? It literally refines a lot of the criticism that I might have for a system, because what might make a thin and light laptop perfect for one person might make it a complete disaster for someone else. So, when Lenovo and AMD reached out to sponsor a video on this, the Yoga Pro 7, the answer was pretty clear. It is designed for creators, whether you're working on your portfolio or working on memes. And that means that the priorities are different. I want battery life, but I also want something at least somewhat portable. I want a big, bright color accurate screen. And most above all, I wanna see performance. I need it to be able to handle video and photo editing, and maybe a little bit of gaming on the side. This is mean to deliver a little bit more firepower thanks to the fact that it is using the AMD Ryzen 8040 Series processors which specifically have not only have RDNA 3 graphics but also Ryzen AI. And there's a lot to talk about there, but first let's actually open it up and take a look. All right, so we have ourselves a 140 watt USB-C charger. So, this device does come optionally with an RTX 3050 or you can get it with integrated graphics. Honestly, for a device like this, I would actually probably lean toward the integrated graphics option because I will tell you the RDNA 3 GPU inside is quite potent. Now we have the device itself. Excessive use may cause damage to your vision. Thank you. I appreciate that. Excessive use of your any screen will cause damage to your vision. Except, I've been told, that excessive watching of the Austin Evans channel only makes you more attractive. I don't have an actual statistic on that, but I mean, I've been watching my videos for years, look what happened to me. Does look surprisingly thin and light. Crack it open and see. All right, so, we take this off, and we've got ourselves the Yoga Pro 7. And also, I'll immediately tell you, it has a matte display. You can see that makes a big difference. So this is using one of their PureSight Pro panels. Let's fire it up, shall we? The way that they designed this is that it sort of tapers quite heavily from the side to the bottom. It feels really nice in the hand. It makes it feel significantly thinner than it actually is. It's got the full lie flat hinge. This is neat. Lenovo is the biggest PC manufacturer in the world. They have a number of lines. Obviously, ThinkPad is a tremendously successful brand, but that's much more sort of business, corporate oriented. Legion and LOQ are much more on the gaming side, but Yoga, Yoga is meant to be the, not the laptop for everyone, but the laptop for someone who wants to be a bit more creative, you know? Like, they have all these stats about how the percentage of people who buy Yogas and then create content with them, it's quite high. And so, I think they make a lot of decisions to make that content creation better. So having spent a little bit of time editing with the Yoga Pro 7i, I have some initial thoughts. First and foremost, it is incredibly cool that every 2024 Yoga comes with two months for free of Adobe Creative Cloud. Even if you're already a paying subscriber, it would just be added on. That is a big win. Now obviously you can use Premiere, Photoshop, the whole thing. And editing this Short, which mind you, it's only 30 something seconds long, but it is a full 4K video, this handles it with absolutely no problem at all. The nice thing is I can pretty much do my full workflow on this system, including switching over to something like CapCut where I can use some lovely effects to get exactly the beautiful cinema quality images that I am accustomed to. And that I think just kind of goes to show more so of what these systems are capable of now. You know, with Ryzen AI on board, not only can you use things like image generation, and believe me when I say, 2024 is gonna be a year where that NPU being on board is going to be very helpful for a lot of features that are coming down the road. But on top of that you have the RDNA graphics, you have the Ryzen CPU core. You also have the RTX 3050 on board. There's really sort of nothing that you're missing here. Now, yes, if you're really trying to crush extended length 4K videos and ProRes and RAW, and all that kind of stuff, that's probably gonna be a little outside the scope of what you're expecting to do on this thin and light laptop. But what you do have is enough performance for, I would say the vast majority of content creation. Now, the screen and the speakers also work pretty well. So, I like the fact that this has very high res display that has that matte coating. And on top of that, if I turn the volume up a little bit, the speakers, the quad speakers built in here, are actually pretty good. From DKOldies. Okay, so I do have the third party. I actually like using laptop speakers to mix my audio on because it's a sort of good general mix between something like headphones and like a stereo on one end, and something like the phone speaker which most people use on the other side. So, if something sounds good on laptop speakers, especially when they're a good set like this, it generally sounds pretty good everywhere. One of the features that really stood out to me is the PureSight Pro LCD. The 14.5 inch 3K panel has the all too illusive matte finish. It's also supposed to have low blue light emission which is healthier on your eyes, but the thing that I really appreciate is the buttery smoothness of the 120 hertz refresh rate. Now don't get me wrong, this is not meant to be a gaming laptop, but for casual use it's really not bad, especially equipped with the RTX 3050. But, how is it to actually live with? Something I wanna show more in laptop videos is how fast they are to wake from sleep. This one's fairly snappy and it does have Windows Hello support, meaning you can get up and running really quickly. Now, a couple of general thoughts on using the Yoga. I am, as always, a huge fan of these of keyboards. It's got 1.5mm of key travel, it's backlit, it's really nice. What I'm not a huge fan of is the trackpad. It's a nice physical size for a laptop like this, but listen to what it sounds like. (trackpad clicks) It's fine, but the problem is is that it just feels a little bit hollow. And that's something that you don't get with some of the higher end Yogas. So while I like the size of it, I wish that they had sort of refined that click a little. Other than that though, the build quality is really quite nice. And they do have a good sustainability angle with no plastic in the packaging, and some of the materials here are recycled, but the entire thing feels very premium. So, here's the thing, I actually find that this is quite a good device for content consumption. So, the matte display, the high resolution, the high frame rate, it all looks good for watching video, the speakers are solid. Like, there's so many things that are going for a laptop like this. That while, yes, it is designed for creators, you don't have to be creating all the time to get the most out of this device. Because it's still quite thin, it's quite portable, you've got good battery life. It checks so many boxes, but importantly, it has some extra features, and importantly, performance, to push it over the edge compared to a lot of super thin and light devices. Which, let's be real, aren't that much thinner and that much lighter than what you're getting here. So, who is this laptop for? Well, it's pretty obvious that it was designed with creators in mind. We've got that beautiful display, the four crisp speakers, plenty of power, AI everywhere, and even a free two month membership to Adobe Creative Cloud. It honestly does feel premium. But, who it's designed for and who actually should buy it are sometimes two different things. And honestly, a lot of the things that make this laptop good make it very applicable to a wide majority of people. I mean, think about it, almost everyone is a creator to some form or another. Maybe you're making videos all day, or maybe you're just making memes, or cutting together family videos. Everyone can benefit from a lot of these creator focused features. That's what I think Lenovo does quite well. It's a solid product that has a good focus on features that actually benefit what the user needs. Now, as of recording this video, we don't yet have pricing on the Pro 7, but assuming that it's somewhere in the neighborhood of the last generation, it is an easy recommendation for pretty much anyone who wants a solid laptop, that will get some work done, maybe a little bit of gaming on the side, and more importantly, it's designed for years and years of use down the line. So thank you very much to Lenovo and AMD for sponsoring this video. If you wanna check out the Pro 7 the link will be in the description. Until next time my friend, I'll be making both my portfolio and my memes on my shiny new Yoga. Oh no! Oh no, can I use AI to fix that light falling in the background in the middle of my take? Why would we fix it in real life when we could use AI? I need to be a totally different person just to fix it because honestly, this is the future. We're gonna CapCut the whole thing and I'm gonna be animated and it's gonna be hilarious. I just can't wait.",
    "transcript_keywords": [
        "Yoga Pro",
        "Lenovo Yoga Pro",
        "Yoga",
        "laptop",
        "Pro",
        "good",
        "make",
        "video",
        "bit",
        "lot",
        "speakers",
        "Lenovo",
        "thing",
        "pretty",
        "Lenovo Yoga",
        "videos",
        "laptop good make",
        "Adobe Creative Cloud",
        "light",
        "designed"
    ],
    "transcript_entity_values": [
        "Photoshop",
        "the Pro 7",
        "only 30 something seconds",
        "1.5mm",
        "the Lenovo Yoga Pro 7",
        "AMD",
        "third",
        "LOQ",
        "First",
        "Premiere",
        "two month",
        "first",
        "RDNA",
        "Yoga, Yoga",
        "PureSight Pro",
        "14.5 inch",
        "Austin Evans",
        "two months",
        "two",
        "Ryzen AI",
        "a year",
        "four",
        "120",
        "4",
        "one",
        "Windows",
        "years",
        "NPU",
        "AI",
        "Lenovo",
        "all day",
        "2024",
        "140 watt",
        "Yoga",
        "K",
        "Adobe Creative Cloud",
        "ThinkPad",
        "One",
        "ProRes",
        "GPU",
        "3050",
        "the Yoga Pro 7i",
        "the Yoga Pro 7",
        "3",
        "the Yoga Pro 7"
    ],
    "transcript_entity_types": [
        "ORG",
        "EVENT",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "LAW",
        "LAW",
        "CARDINAL",
        "FAC"
    ],
    "vector": [
        -0.025444209575653076,
        -0.015780173242092133,
        -0.025114718824625015,
        -0.02136848494410515,
        0.09725701063871384,
        0.01629234477877617,
        0.06543756276369095,
        0.06787645071744919,
        0.03923429921269417,
        0.074350506067276,
        -0.005482628475874662,
        0.014153817668557167,
        0.014932569116353989,
        0.04031864553689957,
        0.04592290148139,
        0.0775030329823494,
        0.1370248943567276,
        -0.06390342861413956,
        -0.03578278422355652,
        0.028539394959807396,
        0.027188055217266083,
        -0.04021937772631645,
        0.0549907460808754,
        -0.016381002962589264,
        0.021334070712327957,
        0.030734306201338768,
        0.03552141785621643,
        -0.02708948217332363,
        -0.009025155566632748,
        0.01059973519295454,
        0.0043554953299462795,
        -0.018185734748840332,
        0.018995139747858047,
        0.021479791030287743,
        -0.02101115509867668,
        0.001192417461425066,
        0.03797220438718796,
        -0.04542739316821098,
        -0.07265910506248474,
        -0.04779255762696266,
        -0.08825363963842392,
        -0.017498597502708435,
        0.09165944159030914,
        -0.018457291647791862,
        -0.008024177514016628,
        -0.008531054481863976,
        0.0813615545630455,
        -0.10330626368522644,
        0.06093902513384819,
        -0.03721233084797859,
        -0.026179909706115723,
        -0.065983846783638,
        -0.006616175640374422,
        -0.03579704836010933,
        -0.04182038828730583,
        -0.01262703537940979,
        0.01740044727921486,
        -0.04442927986383438,
        -0.010333357378840446,
        0.028826721012592316,
        0.05972397327423096,
        -0.07748454809188843,
        0.050823938101530075,
        0.04309465363621712,
        -0.004957034718245268,
        -0.088435597717762,
        0.05593351274728775,
        0.02513250708580017,
        0.040516238659620285,
        -0.0905010923743248,
        -0.09164328873157501,
        0.0013403864577412605,
        0.01970791444182396,
        0.001973829697817564,
        -0.07225365191698074,
        -0.0502467043697834,
        0.053182072937488556,
        -0.01379484310746193,
        0.0219673253595829,
        -0.011328963562846184,
        0.05010363832116127,
        0.04358477145433426,
        0.06798537820577621,
        -0.037036482244729996,
        0.07047278434038162,
        0.005275339353829622,
        0.04550168663263321,
        0.08395083248615265,
        -0.008291718550026417,
        -0.04463628679513931,
        -0.026935234665870667,
        0.13495522737503052,
        -0.04330682009458542,
        -0.03363201767206192,
        -0.035968780517578125,
        -0.03190134838223457,
        -0.002184591256082058,
        -0.08125004172325134,
        -0.06262443214654922,
        0.06519612669944763,
        0.03216811269521713,
        0.06113868206739426,
        0.11239118874073029,
        -0.001682784641161561,
        -0.048810239881277084,
        -0.04094435274600983,
        -0.005003390833735466,
        0.08442611992359161,
        -0.007975827902555466,
        0.06235701963305473,
        -0.017191315069794655,
        -2.3576823878102005e-05,
        -0.03711022064089775,
        0.06231297552585602,
        0.03231988474726677,
        0.04284416884183884,
        -0.03469167649745941,
        0.06287683546543121,
        0.03730081394314766,
        0.07578883320093155,
        0.0006327963201329112,
        -0.06747888773679733,
        0.033304162323474884,
        -0.028522145003080368,
        -0.009370897896587849,
        0.01233678963035345,
        -0.09616871923208237,
        2.169623882308112e-33,
        -0.008854657411575317,
        0.04022049158811569,
        -0.011237483471632004,
        0.03021790273487568,
        -0.0201211329549551,
        -0.024683136492967606,
        -0.05185116454958916,
        -0.02986825443804264,
        0.04762012138962746,
        -0.017885535955429077,
        -0.002824820578098297,
        -0.06026621535420418,
        -0.02484937384724617,
        0.06589791923761368,
        0.10028276592493057,
        -0.09798332303762436,
        -0.06090827286243439,
        -0.02867583930492401,
        -0.03580653294920921,
        -0.002848294097930193,
        0.013681966811418533,
        -0.0019279232947155833,
        -0.0383286252617836,
        -0.03169647604227066,
        -0.03761651739478111,
        0.026884878054261208,
        0.10488365590572357,
        0.0435333251953125,
        0.023579925298690796,
        0.006177306175231934,
        -0.07696174830198288,
        -0.10502196848392487,
        -0.06889043003320694,
        -0.06838790327310562,
        0.01725641079246998,
        -0.054279182106256485,
        -0.06992439180612564,
        -0.08427520096302032,
        0.0366399809718132,
        0.017729148268699646,
        -0.07308436930179596,
        0.08732409030199051,
        -0.004513754043728113,
        -0.03857702389359474,
        0.025714732706546783,
        0.07626604288816452,
        0.08081864565610886,
        0.08805564045906067,
        -0.05747731775045395,
        -0.014106689020991325,
        -0.051258429884910583,
        -0.0011612597154453397,
        0.0389753133058548,
        -0.05638677626848221,
        -0.034799087792634964,
        -0.05509733408689499,
        0.012426539324223995,
        -0.024332791566848755,
        0.09331149607896805,
        0.08493241667747498,
        -0.09054245799779892,
        -0.03592976927757263,
        -0.08792214095592499,
        0.017489779740571976,
        -0.11021716147661209,
        0.006202086340636015,
        0.03735410049557686,
        0.027117792516946793,
        -0.025540374219417572,
        0.016080262139439583,
        0.039787013083696365,
        -0.031832728534936905,
        0.08372762799263,
        -0.020337624475359917,
        0.021577417850494385,
        0.002201428636908531,
        0.02712439000606537,
        -0.01135472021996975,
        -0.1258883774280548,
        0.04870982468128204,
        -0.042600080370903015,
        0.018369458615779877,
        -0.017820874229073524,
        0.024516448378562927,
        -0.03816019743680954,
        -0.0035130309406667948,
        -0.04907901585102081,
        -0.0885310024023056,
        -0.0797320306301117,
        -0.012439681217074394,
        -0.00414613401517272,
        0.00894754845649004,
        0.02819892205297947,
        0.012715526856482029,
        -0.026684707030653954,
        -1.6963254082869186e-33,
        0.020386148244142532,
        -0.009120455011725426,
        -0.007284126710146666,
        -0.022252924740314484,
        0.11822976171970367,
        0.005994763690978289,
        0.05009528622031212,
        -0.014573980122804642,
        -0.044912900775671005,
        -0.1072758287191391,
        -0.0481235533952713,
        -0.0271198358386755,
        -0.02657187357544899,
        0.03809422254562378,
        -0.009612014517188072,
        0.012295936234295368,
        -0.05832885578274727,
        -0.11609317362308502,
        -0.05026115104556084,
        -0.013010885566473007,
        0.04038059711456299,
        0.08667005598545074,
        0.03208889067173004,
        -0.022224310785531998,
        0.006592820398509502,
        0.06658321619033813,
        -0.04846160113811493,
        0.019164947792887688,
        0.03206614777445793,
        0.05572731792926788,
        0.02719593606889248,
        -0.09483558684587479,
        -0.004540096037089825,
        0.05014811083674431,
        0.05866852030158043,
        -0.032301969826221466,
        0.0234551839530468,
        -0.0649372935295105,
        -0.056001774966716766,
        0.06234629079699516,
        0.10107026994228363,
        0.0667228102684021,
        -0.024853013455867767,
        -0.056079693138599396,
        0.005558197386562824,
        0.04348509758710861,
        -0.1293894648551941,
        -0.038980454206466675,
        -0.01122375763952732,
        -0.1054285541176796,
        -0.04668319225311279,
        0.0682864710688591,
        -0.05071048438549042,
        -0.07513412833213806,
        -0.032276954501867294,
        -0.09217558056116104,
        -0.0036635438445955515,
        0.06316114962100983,
        0.009025197476148605,
        0.004627813585102558,
        -0.004133266396820545,
        0.007261224556714296,
        -0.026635007932782173,
        0.017538748681545258,
        -0.011920012533664703,
        0.07356474548578262,
        0.07542123645544052,
        0.06113213673233986,
        0.002376585965976119,
        -0.054072387516498566,
        -0.017738617956638336,
        -0.08184293657541275,
        0.006840515416115522,
        0.01187307108193636,
        0.0028495413716882467,
        -0.0032864150125533342,
        0.09744193404912949,
        -0.027050523087382317,
        0.0010529984720051289,
        0.008510928601026535,
        -0.004968852270394564,
        -0.0434989370405674,
        0.009119195863604546,
        -0.03488974645733833,
        0.009312096051871777,
        0.0282493457198143,
        0.022594952955842018,
        -0.05393511801958084,
        -0.003926726523786783,
        -0.0026916293427348137,
        0.0798993930220604,
        0.08012472093105316,
        -0.06830534338951111,
        0.12163940072059631,
        0.0409708097577095,
        -4.913607654088992e-08,
        0.0013116352492943406,
        -0.06654173880815506,
        0.11071527749300003,
        0.01422443613409996,
        -0.05995861813426018,
        -0.04464000090956688,
        0.03451535105705261,
        -0.04790021851658821,
        0.07754934579133987,
        0.02196541801095009,
        0.041927844285964966,
        -0.09183446317911148,
        0.008050034753978252,
        0.06826253235340118,
        0.015461468137800694,
        0.04550613835453987,
        0.03327787667512894,
        0.07623515278100967,
        -0.01996089704334736,
        -0.022702421993017197,
        -0.023826964199543,
        -0.03514157235622406,
        0.03285018727183342,
        -0.045528996735811234,
        -0.0458744540810585,
        0.01090940460562706,
        -0.046834733337163925,
        0.023137636482715607,
        0.04062099754810333,
        -0.05442649871110916,
        -0.056397758424282074,
        0.05258156359195709,
        0.014189659617841244,
        -0.025965413078665733,
        -0.024550946429371834,
        -0.05246113985776901,
        0.007120865397155285,
        -0.01668844372034073,
        -0.0015806213486939669,
        0.10667771100997925,
        -0.06861940771341324,
        -0.02120618149638176,
        0.014145727269351482,
        0.023271720856428146,
        0.03444281592965126,
        -0.010145052336156368,
        0.018574802204966545,
        -0.08659039437770844,
        -0.030114905908703804,
        0.10407164692878723,
        0.029011869803071022,
        -0.004444113466888666,
        0.060604460537433624,
        0.018570369109511375,
        -0.013679368421435356,
        0.04582700878381729,
        -0.012111756950616837,
        0.09219568222761154,
        -0.027840130031108856,
        0.015831444412469864,
        0.09403575956821442,
        -0.07397952675819397,
        0.006554757710546255,
        0.02568867616355419
    ]
}