{
    "id": "KgNaNiLA7dI",
    "title": "The Best Gaming Phone Is...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-10-23T16:53:35Z",
    "video_url": "https://www.youtube.com/watch?v=KgNaNiLA7dI",
    "category": "Science & Technology",
    "tags": [
        "rog phone",
        "razer phone 2",
        "black shark 2",
        "black shark helo",
        "razer phone",
        "asus rog phone",
        "blackshark",
        "xiaomi black shark",
        "gaming phone",
        "gaming smartphone",
        "best gaming phone",
        "black shark",
        "razer",
        "rog",
        "asus",
        "unboxing",
        "smartphone",
        "review",
        "android",
        "gaming",
        "best smartphone",
        "phone",
        "razer phone 2 review",
        "austin evans"
    ],
    "views": 2196370,
    "likes": 38782,
    "comments_count": 3518,
    "description": "The best gaming phone: Asus ROG Phone vs Razer Phone 2 vs Xiaomi Black Shark Helo!  You might want to check out This Is...  ROG Phone on Amazon:  Razer Phone 2 on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/thisis",
        "http://austin.tech/rogphone",
        "http://austin.tech/razerphone2",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, this is Austin. Between the ROG Phone and the Razer Phone 2, 2018 is shaping up to be an awesome year for gaming smartphones. So with both of them on the desk at the same time, why, I think a good old-fashioned comparison is in order. First up we have the Razer Phone 2. Now, a couple weeks ago, we were able to get our hands on this, but it was a very brief hands-on, whereas this, this is going to be a little bit more of an in-depth feature comparison review gaming benchmark. Are there other words I can put in the title? Do you see how shiny this glass is? It'll never be this shiny again the second I put my dirty fingerprints on it. Not only do we have a fast charger included in the box, something that a certain fruit-themed company might want to take note on, but we also have a series of cables and dongles. But what's actually kind of interesting about the Razer Phone is that we have a USB-C headphone adapter. Now this might not sound impressive. In fact, it's included on most phones that don't have a headphone jack, which is basically everything at this point. But this actually does support full hi-fi audio and supposedly has a pretty good DAC inside. Next up we have the ROG Phone, and I actually don't know to open this box. (Velcro crackling) Oh, wow, okay, that's, all right, that's a box. All right. (chuckling) First up, we have the phone itself. So the ROG Phone's kind of unique in that not only does it have a USB-C and a headphone jack on the bottom, but it has two more USB-Cs on the side which are meant for accessories. So the last time I tried the ROG Phone, it was still a fairly early prototype, and I've gotta say, immediately, this feels really nice. We do have that, actually, is that aluminum? That's gotta be aluminum. It's incredibly heavy, though, wow. It really feels nice, and it's got such a heft in the hand, and unlike the Razer Phone, which is basically a giant squared-off brick, this is much more rounded and a little bit more of a hand-friendly shape. Something unique about the ROG Phone is that unlike basically every other gaming phone out there, there's a wide range of accessories that are either included in the box such as this fan, or other things that'll be available for purchase. You know what I feel like right now? I feel like ROG is trying to make the ultimate ROG Phone, right? Like, when we do Building the Ultimate, we try to find the ridiculous and crazy accessories, but they're just selling all of the accessories. You could literally get everything you need to build the ultimate ROG Phone straight from the store. Not only does it have the RGB, but it also has a fan, USB-C, headphone jack, all that stuff, which is rearranged to the bottom. This is cool. I really appreciate that they put this in the box. I don't want to get too into the dock right now, but the idea is that when you're using the phone in landscape mode, your hand is naturally covering up not only the headphone jack but also the USB-C, so in addition to be able to get a little bit of cooling, you also have those ports on the bottom of the phone so you can easily plug it in, plug your headphones in, and you won't get in the way of your hands. (box thumping) Wait, what'd you, what are you doing? A Black Shark? Wait, are you trying to add another phone to the comparison in the middle of the video? \"You're Gamer, Let's Shark!\" Oh boy, this looks exciting. What's the deal with this? Oh. Oh, this is not the original Black Shark at all. Okay, this is an unprecedented move in that there's a brand-new unreleased smartphone on my desk and I literally don't know anything about it, except that it looks kind of cool! That's something to know about it, right? So it's got a kind of combination of aluminum on the sides but it still does have that glass back panel, and I'm assuming that looks kind of like an RGB logo? Oh, wow, that's quite the gamer skin, and, oh yeah, we do have a RGB logo on the back. I like how we have this great comparison: look, it's the ROG Phone versus the Razer Phone. It all makes sense. And now, I'm like, wait a minute, there's this totally new phone that I have no idea about. I have to figure it out on the fly. This is cool, though. I guess they've definitely upped the RGB game. I mean, that's a look right there. So it looks like you can individually change not only the logo color, but also the little Shark Mode thing on the side. \"By pressing the Shark button, \"your phone will become a game console.\" What, a game console? In a smartphone? That's crazy! So after spending some time with the Black Shark, a few things come to mind. First of all and probably the most important for the video is that this is not a final phone and it's certainly not final software. There's definitely some tweaks that are going to need to go on before this is released. And also, a lot of the benchmarks and stuff don't even work yet, so we're gonna take some of this with a grain of salt. There's also the controller, which actually doesn't attach to the phone. It attaches to the case that comes with the phone, so it's maybe not the most elegant way of doing it, but it's sort of like you would expect with a Joy-Con. The only problem is that the controller only works wirelessly, so even though you can slide it on, something like this, it actually doesn't attach with any kind of wires or whatever, so you still need to separately charge not only the controller but the phone itself. The big problem is that this is a Chinese market phone, which means that here in the United States, well, it doesn't have the Google Play store, or any kind of Google apps at all. Now there will be a global version of this phone, and hopefully that will include, you know, the fundamental apps that you would expect like YouTube, but for now, it's kind of hard to get apps on this, unless of course you wanna play a little bit of Fortnite by chance. All three phones have the very familiar Snapdragon 845 inside. So the ROG is slightly clocked higher, but the main difference between the three is that the Black Shark has an optional 10 gigabyte of RAM option, whereas the others only top out at a measly eight gigs of memory. Coincidentally, they all have the exact same size 4,000-milliamp hour battery, which is a good thing for gaming, but from here, the differences start to stand out just a little bit more. The first big difference is with displays. The Black Shark has a perfectly respectable six-inch 2160x1080p panel. It's good but nothing spectacular, especially when you compare it to both the ROG Phone as well as the Razer Phone. Move over to the ROG Phone, and while it does have that same size as well as resolution of the Black Shark, it is an OLED panel running at a full 90 Hertz. Now as far as I know, this is the first time that any phone has hit 90 Hertz with an OLED panel. The Razer Phone has a slightly smaller 5.7-inch display, but it is a much higher resolution at 2560x1440, and importantly, it runs at a whopping 120 hurt refresh rate. Hertz, not hurt. It doesn't hurt to refresh, it Hertz to refresh. The only real downside is that this is a very wide phone, specifically when you put it side by side with the Black Shark and the ROG. It's just not quite as comfortable to hold, but that screen is really well-optimized for video. Let's talk about these screens for a second. The ROG Phone has a very accurate OLED panel, and even though it's not the most well-calibrated thing in the world, it looks nice to the eye. The Razer Phone thankfully is much, much brighter than the original version of the Razer Phone. Again, it's not quite 100% there, but it is a lot better than the previous generation. And the Black Shark looks nice, but again, it's not quite final, so it's hard to run any kind of real tests. It looks goods, but I really feel like the winner here is the ROG just purely based on the looks. Where these phones really shine is with the higher refresh rate, so it's really hard to show on video, but even the 90 Hertz of the ROG Phone really does make a big difference in small things like scrolling through a webpage or moving between menus. It really does seem a lot more fluid, and that definitely does apply to the Razer Phone. Now, to my eye, I actually can't really see a major difference between 90 Hertz and 120 Hertz. Theoretically, this is a little bit smoother, and I will say it looks maybe a little bit sharper when you're moving between things, but realistically, both these phones are a big step up over the Black Shark, or, well, every other 60 Hertz phone out there, which is basically all of them. All three have dual front-firing speakers, but there's a clear winner as far as which one sounds best. - [Phone] Hey, guys, this is Austin. The Microsoft Surface line has been growing a lot lately, with everything from a desktop all-in-one with the Surface Studio all the way down to the cheap and tiny Surface Go, there's a lot to like. - I guess the ROG Phone wins by default here. That's not what I was expecting. So the problem with the Razer Phone is at least with my specific unit, even though it is very loud and very clear, there's definitely a little bit of distortion on the very high volume. Something the ROG Phone definitely does right are the extra features and accessories that come along with it. One of the main ones is the squeeze feature. This is somewhat to what you'll find on the Pixel where if I squeeze it, what happens is it turns into ROG Gaming X Mode. The thing with X Mode is you actually can customize it to do whatever you want, but I just like going X Mode, not X Mode. X Mode! It's just kind of fun to do. But it's not only just for show, so if you flip the ROG Phone over, on the top are the AirTriggers. This essentially adds physical controls to the top of the phone, giving it a little bit more of a controller kind of feel. The way it works is that each of them can be mapped to a specific button on the screen. The way it works is that inside the X Mode software, you can adjust the actual touchpoint of where you want it, so for example, my right trigger is the actual trigger in the game, and my left is to go on to the sights. You can do it however you want, but the thing is, this is a really, really nice addition to give you a little bit more of a physical control on a phone without having to carry around, like, you know, a controller, or accessories. One downside to the ROG Phone is that this is one of the hottest devices that I've ever tested. Now it doesn't get uncomfortably warm, but after a few minutes of gaming, it does get a little bit toasty, which is where the included fan comes in. So what you do is snap this on to the USB-C ports on the bottom of the phone. As soon as you clamp it on, not only will the RGB logo light up, but it will start a pretty easy little fan which will cool the back of the phone. Now in testing this doesn't make a massive difference to performance. What it does do is cool off the back of the phone to make it a lot nicer for when you're, you know, doing extended Fortnite gaming sessions and not sweating your fingers up. Can you sweat your fingers up? Is that, I can't say that, can I, that's weird. So what's the best gaming phone of 2018? Well, I really like a lot of what Razer has done with the Razer Phone 2. I gotta give it to the ROG Phone. Not only does it have great performance, it looks nice. It's got a lot of really cool features, but really, what kind of sells this to me over everything else is this is the first gaming phone that's not only good at gaming, but it's also good at being a phone, and that, that kind of means a lot. (electronic static) (screen humming) (deep breath) Hey, guys, this is-- (electronic music)",
    "transcript_keywords": [
        "ROG Phone",
        "Razer Phone",
        "Phone",
        "ultimate ROG Phone",
        "Black Shark",
        "ROG",
        "ROG Phone kind",
        "Razer",
        "Shark",
        "gaming phone",
        "ROG Phone straight",
        "ROG Phone versus",
        "ROG Phone wins",
        "Black",
        "phones",
        "kind",
        "Razer Phone thankfully",
        "Hertz",
        "mode",
        "bit"
    ],
    "transcript_entity_values": [
        "The Black Shark",
        "the Razer Phone",
        "Black Shark",
        "10 gigabyte",
        "Razer",
        "Velcro",
        "three",
        "the Surface Studio",
        "2018",
        "USB-C",
        "Gamer",
        "Chinese",
        "a couple weeks ago",
        "Google",
        "first",
        "RAM",
        "4,000-milliamp hour",
        "the United States",
        "the ROG Phone",
        "eight",
        "jack",
        "OLED",
        "ROG",
        "between 90",
        "Austin",
        "AirTriggers",
        "RGB",
        "two",
        "six-inch 2160x1080p",
        "Shark",
        "ROG",
        "YouTube",
        "the ROG Phone",
        "120",
        "100%",
        "USB-Cs",
        "the Razer Phone 2",
        "Hertz",
        "Hertz",
        "60",
        "second",
        "a few minutes",
        "ROG Phone",
        "Ultimate",
        "5.7-inch",
        "90",
        "Fortnite",
        "ROG Phone",
        "Microsoft Surface",
        "the Black Shark",
        "a minute",
        "ROG Gaming X Mode",
        "One",
        "The ROG Phone",
        "the ROG Phone's",
        "First",
        "The Razer Phone",
        "2, 2018",
        "the Razer Phone"
    ],
    "transcript_entity_types": [
        "GPE",
        "WORK_OF_ART",
        "LOC",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.07649857550859451,
        -0.04108945280313492,
        0.0447801798582077,
        -0.048389822244644165,
        0.015062577091157436,
        -0.05161753296852112,
        0.02739318646490574,
        0.0462447926402092,
        -0.005717800930142403,
        0.048633769154548645,
        -0.09979822486639023,
        0.04255391284823418,
        0.024673311039805412,
        -0.009280056692659855,
        0.003928996156901121,
        0.0015343419509008527,
        0.1789213865995407,
        -0.036410555243492126,
        -0.04198192432522774,
        -0.010162274353206158,
        0.05582241341471672,
        -0.046478092670440674,
        0.01794968917965889,
        -0.02593027986586094,
        0.06664657592773438,
        0.04598022252321243,
        -0.06695892661809921,
        0.052183907479047775,
        -0.028567297384142876,
        0.004848768003284931,
        0.02903873659670353,
        0.10297733545303345,
        -0.010067359544336796,
        0.029559729620814323,
        -0.051782649010419846,
        -0.11012908816337585,
        -0.019122814759612083,
        -0.05205065757036209,
        -0.023836025968194008,
        -0.05622358247637749,
        -0.10237865895032883,
        0.0014720521867275238,
        0.031145887449383736,
        0.06371212750673294,
        0.013070639222860336,
        -0.08051937073469162,
        0.023119769990444183,
        -0.06555023789405823,
        -0.013011224567890167,
        0.010510551743209362,
        -0.036087073385715485,
        -0.02618160843849182,
        -0.018711648881435394,
        -0.03218989074230194,
        -0.08303193747997284,
        0.1620965152978897,
        -0.03952917456626892,
        -0.01939636841416359,
        0.038057100027799606,
        0.03355637192726135,
        0.0038553334306925535,
        -0.024189654737710953,
        -0.07871125638484955,
        0.07144096493721008,
        -0.008078754879534245,
        -0.020374733954668045,
        0.02976040169596672,
        -0.013218829408288002,
        0.008429314941167831,
        0.05543116480112076,
        0.03636904060840607,
        0.04599421098828316,
        0.0269585233181715,
        0.03791213408112526,
        -0.006896681617945433,
        0.06640784442424774,
        0.06408654153347015,
        -0.022760575637221336,
        -0.009310053661465645,
        -0.007648605387657881,
        0.040252771228551865,
        -0.05806802958250046,
        0.008016593754291534,
        -0.01782802678644657,
        0.046861786395311356,
        -0.08341515064239502,
        -0.0019197879591956735,
        0.051736343652009964,
        -0.024387553334236145,
        -0.07398621737957001,
        -0.018426397815346718,
        0.1645406186580658,
        0.01713714562356472,
        -0.026360588148236275,
        -0.0127007020637393,
        0.03476893901824951,
        -0.00048812126624397933,
        -0.07806308567523956,
        -0.0400506965816021,
        0.04780234768986702,
        -0.03751499950885773,
        0.025610703974962234,
        0.06308428198099136,
        0.024588126689195633,
        0.07061140239238739,
        -0.04665972292423248,
        -0.043670833110809326,
        0.032167740166187286,
        -0.028113752603530884,
        0.017538247630000114,
        -0.04295848309993744,
        -0.0028557840269058943,
        -0.05017048865556717,
        0.051808133721351624,
        0.006850218400359154,
        0.01157363224774599,
        0.006333078723400831,
        0.03483200818300247,
        0.08780024200677872,
        0.015448471531271935,
        0.02390742488205433,
        -0.031675320118665695,
        -0.07379242777824402,
        -0.03622950613498688,
        0.06237710267305374,
        0.031317126005887985,
        -0.02362324856221676,
        9.334973491994187e-34,
        -0.002537256106734276,
        0.08319788426160812,
        0.023317240178585052,
        -0.03593815118074417,
        -0.04221099615097046,
        0.027050655335187912,
        0.06284531950950623,
        0.010754449293017387,
        -0.015655431896448135,
        0.07655397057533264,
        -0.05615661293268204,
        0.10065455734729767,
        -0.0648336336016655,
        0.041118841618299484,
        0.11666953563690186,
        -0.03447139263153076,
        -0.04331154376268387,
        -0.0476578064262867,
        -0.04323114454746246,
        0.01953108422458172,
        0.017168479040265083,
        0.042592912912368774,
        0.0260718185454607,
        0.011735323816537857,
        0.062264762818813324,
        -0.023607252165675163,
        0.0018565657082945108,
        -0.061430223286151886,
        -0.024990152567625046,
        0.005500607192516327,
        -0.01077826227992773,
        -0.05364818125963211,
        0.012406076304614544,
        0.02981583960354328,
        -0.03732762485742569,
        -0.00872619915753603,
        -0.0754387229681015,
        -0.07685968279838562,
        -0.010056775063276291,
        -0.023572830483317375,
        -0.056115616112947464,
        0.070273257791996,
        -0.07688476890325546,
        -0.01074456237256527,
        0.05844767391681671,
        0.0033186282962560654,
        -0.06574524939060211,
        -0.05170523375272751,
        -0.05158271640539169,
        -0.02046588622033596,
        -0.05902998149394989,
        0.00821109302341938,
        0.01942136324942112,
        0.06805653870105743,
        -0.0405537374317646,
        -0.02124825492501259,
        0.09119490534067154,
        0.014199196361005306,
        0.022220799699425697,
        0.02894703671336174,
        0.00749185448512435,
        -0.030151640996336937,
        -0.06053239852190018,
        0.0372336320579052,
        -0.018640073016285896,
        0.0643213614821434,
        0.02598295547068119,
        -0.013203807175159454,
        -0.07970317453145981,
        0.04139242321252823,
        0.04360305517911911,
        0.0005056790541857481,
        0.019232282415032387,
        -0.007074914872646332,
        0.08436265587806702,
        0.004476503469049931,
        0.024792177602648735,
        -0.03432115912437439,
        -0.043616898357868195,
        -0.022665593773126602,
        -0.06108882278203964,
        0.007019527722150087,
        -0.09074078500270844,
        -0.02113359048962593,
        -0.018576880916953087,
        -0.013295498676598072,
        0.027416912838816643,
        -0.04691921919584274,
        0.014443236403167248,
        0.03900453820824623,
        -0.07654215395450592,
        -0.028421087190508842,
        0.005725978873670101,
        0.03823558986186981,
        0.004401438403874636,
        -1.420787512073259e-33,
        -0.06966853886842728,
        -0.10615191608667374,
        0.03274053707718849,
        0.1480991542339325,
        0.02056623436510563,
        -0.05539565160870552,
        0.07056235522031784,
        0.01794387213885784,
        -0.008245722390711308,
        -0.10672537237405777,
        0.0231800377368927,
        0.06366043537855148,
        0.01583561860024929,
        0.0037949688266962767,
        -0.0074762445874512196,
        -0.009926212951540947,
        0.03383500501513481,
        -0.07431386411190033,
        0.03204881027340889,
        0.06145578622817993,
        0.042381808161735535,
        0.07769587635993958,
        -0.0139235220849514,
        0.04138090834021568,
        -0.023644352331757545,
        -0.08072132617235184,
        0.062187258154153824,
        -0.0827278420329094,
        -0.028694158419966698,
        0.00024525620392523706,
        0.023918841034173965,
        0.026757236570119858,
        0.0830007940530777,
        0.01970783993601799,
        0.06524438410997391,
        0.048512548208236694,
        0.09736808389425278,
        -0.08377272635698318,
        -0.018872536718845367,
        0.03547363355755806,
        0.04382963478565216,
        0.06152718514204025,
        0.010251986794173717,
        -0.021492592990398407,
        0.0666930079460144,
        0.03385576978325844,
        -0.05553828552365303,
        0.021020997315645218,
        -0.014441299252212048,
        -0.02253199741244316,
        0.04893209785223007,
        -0.04672620818018913,
        -0.07786870002746582,
        -0.007411304861307144,
        -0.05449674651026726,
        -0.0743139237165451,
        -0.027020519599318504,
        -0.09529351443052292,
        -0.0023294794373214245,
        0.0319615975022316,
        0.09377441555261612,
        0.053248725831508636,
        -0.10054728388786316,
        -0.017696868628263474,
        -0.044820088893175125,
        0.03763648867607117,
        0.07069568336009979,
        0.03684716299176216,
        0.0036618479061871767,
        0.008366113528609276,
        -0.14103606343269348,
        -0.04239684343338013,
        -0.04347112029790878,
        0.017276166006922722,
        -0.011385875754058361,
        0.0618811696767807,
        -0.07403942942619324,
        0.03196234628558159,
        0.00027983664767816663,
        0.005143805872648954,
        0.038676343858242035,
        0.052825476974248886,
        0.048957329243421555,
        0.023907026275992393,
        0.02173326537013054,
        0.024095026776194572,
        -0.001627853256650269,
        -0.008183751255273819,
        -0.06922844052314758,
        -0.10399067401885986,
        0.017428072169423103,
        -0.032303594052791595,
        -0.05803795903921127,
        0.01651858352124691,
        0.0008105251472443342,
        -5.484663034849291e-08,
        0.12189506739377975,
        -0.0419543981552124,
        0.09916531294584274,
        -0.022652553394436836,
        -0.006400730460882187,
        -0.021440906450152397,
        0.009670024737715721,
        -0.027729129418730736,
        0.06315632164478302,
        4.7720637667225674e-05,
        -0.012754526920616627,
        -0.047900959849357605,
        -0.08652745187282562,
        0.01199378166347742,
        0.023061593994498253,
        0.15360625088214874,
        -0.0015607618261128664,
        -0.0011180175933986902,
        0.013444582931697369,
        0.06324281543493271,
        0.03115876577794552,
        0.0562601238489151,
        0.07069335132837296,
        -0.057525038719177246,
        -0.0019520242931321263,
        0.0008667944930493832,
        -0.10715755075216293,
        -0.04095319285988808,
        0.069943368434906,
        -0.005821072030812502,
        0.04703206568956375,
        -0.042890917509794235,
        0.07419684529304504,
        -0.003691880265250802,
        -0.004684931132942438,
        -0.06553869694471359,
        0.06687188893556595,
        -0.032630447298288345,
        0.10669659823179245,
        -0.017402339726686478,
        0.010130798444151878,
        -0.052245043218135834,
        -0.030582165345549583,
        0.001171777374111116,
        -0.006438624579459429,
        -0.06282339990139008,
        0.01999789848923683,
        -0.129940003156662,
        -0.016972564160823822,
        -0.04515943303704262,
        -0.007156425155699253,
        -0.02852240763604641,
        -0.01687660440802574,
        -0.07785895466804504,
        0.0750868171453476,
        -0.012473219074308872,
        0.028528766706585884,
        -0.005791855975985527,
        0.02515687793493271,
        0.030128875747323036,
        0.07403097301721573,
        -0.013888188637793064,
        -0.045648299157619476,
        0.07940375059843063
    ]
}