{
    "id": "KhwJ6fD-t10",
    "title": "Windows 11 hacking using a reverse shell // NETCAT and Hak5 OMG Cable",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-12-30T15:07:00Z",
    "video_url": "https://www.youtube.com/watch?v=KhwJ6fD-t10",
    "category": "Science & Technology",
    "tags": [
        "netcat",
        "windows 11",
        "hak5",
        "omg cable hak5",
        "omg cable keylogger",
        "omg cable scripts",
        "omg cable hack",
        "omg cable demo",
        "rat",
        "remote access tool",
        "ncat",
        "ethical hacking",
        "lan turtle",
        "reverse shell",
        "reverse powershell",
        "david bombal",
        "davidbombal",
        "powershell",
        "kali linux",
        "rubber ducky",
        "usb rubber ducky",
        "hak5 omg",
        "omg cable",
        "hak5 omg cable",
        "hak5 omg cable tutorial",
        "remote control",
        "windows 11 remote control",
        "windows 11 exploits",
        "netcat tutorial",
        "netcat windows",
        "netcat listener"
    ],
    "views": 110345,
    "likes": 4632,
    "comments_count": 226,
    "description": "Create your own virtual machine on Linode with 60-day $100 credit*   * Please note: Credits expire in 60 days. Errata: The promo code mentioned in the video is incorrect - you need to use the link above to automatically add credit.  * Thanks to Linode for sponsoring this video!  // MENU // 0:00  Introduction 1:05  Network Topology 3:40  Method 1: Easy Method 5:09  OMG Cable 8:00  Method 2  // STEPS and INSTRUCTIONS // Download this PDF for detailed instructions:   // SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF // Monitor:  More stuff:   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  hak5 netcat rat hak5 omg omg cable hak5 reverse shell rubber ducky windows windows 11 windows 10 real time protection windows anti virus windows real time protection  Disclaimer: This video is for educational purposes only. I own all equipment used for this demonstration. No actual attack took place on any websites.  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #hak5 #netcat #reverseshell",
    "description_links": [
        "https://davidbombal.wiki/linode",
        "https://www.dropbox.com/s/5ai8ex6rkif4bql/OMG%20Reverse%20shell%20updated%20v3.pdf?dl=0",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://amzn.to/3yyF74Y",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- In this video, I'm going to show you how to use Netcat to run a reverse shell attack against a Windows 11 computer. (rock music) Now, before we continue, if you enjoy these types of ethical hacking videos, consider subscribing to my YouTube channel, I upload a whole bunch of ethical hacking content to my YouTube channel. Please like this video if you enjoy it and click on the bell to get notifications. Okay, without further ado, let me show you how to set this up so that you can run a reverse shell on a Windows 11 computer and connect to a server on the internet and control that Windows 11 computer from a server on the internet. What I'm showing you here is for educational purposes only. Do not use what I'm showing you here to attack other devices that you don't own or have permission to attack. Only use the information here to attack devices that you own or devices that you have permission to attack. In this example, I've got Windows 11 connected to my screen, as well as a Mac M1 Mini. This is a virtual machine hosted by Linode. Has a public IP address of that. I am SSHing to that server. So in my example, I've got a Windows 11 computer connected via WiFi to my home router. Home routers or enterprise routers typically run firewalls and will typically not allow connections from the outside. In other words, they will not allow a Netcat attacking device to access an internal machine or internal computer on your home network. So what we want to do here is bypass that. Firewalls will typically allow connections from the inside of your network to the outside. In other words, they will allow connections from your home network to the internet, but will not allow connections from the internet to your home network unless they are initiated or started by the inside device, in this case, Windows 11. So what I'm going to do is run Netcat on an internet server hosted in the cloud. Once again, this is on a Linode, who I want to thank for sponsoring this video. You can get a hundred dollars credit using the link below or using the code davidbombal. Hosts, such as the one I'm using, don't cost very much. In this example, I'm using Ubuntu 20.04 LTS, and I'm running the device in the UK, but you could host the device around the world. I don't need a lot of CPU power and a lot of RAM, so to create a host like this, I'm going to use a one gig host. Costs $5 a month, and once again, you can get a hundred dollar credit. So you can basically run a device such as this for free. So I'll just create another device here, such as \"ubuntu2\" and click create and that host is created. And I'll be able to access it remotely as soon as it's provisioned. But in my example, I've already got a host configured and running called \"netcat_attack_vm\". It's got this IP address. So what we wanted the Windows 11 computer to do is initiate a connection to that device with IP address 139.162.246.75. That's this device, once again. I've SSHed from my Mac to that device. Command IP address shows me the IP address of that virtual machine. So to run an attack such as this, you need an attacking device. Next thing we need to do is run some code on this Linode host. I've created a PDF to help you do this. (rock music) This method, which is an easy method, is to run this command on your Linux server in the cloud. So what I'll do is paste that command onto the Linode host. I'm using a port number here of 81. You may want to use another port number. Generally well-known ports are below 1024. So you probably want to use a port number in that range because that will be permitted by firewalls. Don't worry too much about these commands. Basically what we're doing here is setting up Netcat to listen on port 81. Step one, we've got a host. We've done that. Step two, we're running Netcat on the host. Third step now is somehow we need to initiate the connection, we have to get to the client to initiate a connection to the internet, to that server. One of the ways to do that is to send them a phishing email, send them an email where they open up a file and that initiates the connection. This is why you need to be really careful opening up attachments on emails. Don't just open up an executable. Don't just open up a PDF. Make sure that you warn people who are not tech savvy why they shouldn't just open up files on emails or download files from the internet. You want to be really careful doing that because of stuff like this. Now, in my example, what I've done is I've planted an OMG cable in this network. These cables look just like traditional USB cables. This is USB-A to USB-C. But can you see where the problem is over here in my home network? Where is my cable hidden? So actually what I've done is I've connected the OMG cable to this wireless keyboard. I'm now sending keystrokes through the wire connection rather than the wireless keyboard. Why would you do that? Because you may need to charge your Bluetooth keyboard, which I'm doing here. Now, before I continue, some people might say why are you using a Apple keyboard with a Microsoft operating system? That's just because I've got a specific OMG cable here. But you could use other keyboards. So there's an OMG cable for a keyboard such as this. I'm just using an Apple keyboard for this demonstration, but you don't have to, it does work with other keyboards as well. And in previous videos, when I've demonstrated the OMG cable, people have left comments and saying, \"David, you're connecting to the OMG cable from the same room,\" but just be aware that you can connect to an OMG cable, it runs a WiFi access point within it from up to a mile away. That's how far away it's being tested. So in my example, I'm using this iPhone to connect to the WiFi access point within this cable to initiate the session from the Windows computer to my attacking device. What I'm going to do here is a load a script. So I've pre-created scripts and saved them in the OMG cable. Now you don't have to do that. If you connect wirelessly, you could paste code onto the OMG cable and then run the attack. But what I'll do now is I'll press run, and hopefully what you'll see on the Windows computer is something happens. It runs a PowerShell command. And what you'll see now is on the attacking device, hosted in Linode, we've got a connection and a Windows PowerShell connection has been opened. I could type a command such as \"dir\", and that gives me all the files on that computer. So as an example, if I go to route, type \"dir\", there are the directories on the Windows computer. I have got this Windows computer to initiate a session to Netcat in the cloud, and now I can do things. In the document which I've shared with you, I've got some commands that you could try. So I can now paste commands on the Linode server to get things to happen over here. So I'll just move the keyboard away, I'm not going to touch the Windows computer, and let's do something which you have to do as part of the fun. (rickrolling) (rock music) In this example, what I'm going to do is start Netcat on the server using port 81. You could use a different port if you wanted to. Another thing you need to do with this method is set up a web server. So I'm going to SSH back to the new server that I've created. And what I'll do is start a little Python web server on port 80. So I need to run two steps, basically, on the server. I have to run a web server and I have to start Netcat. So basically going back to our topology, I've done two steps on the Linode server. Set up a web server and I've started Netcat, now I need to do something on the client and I need to get it to initiate the connection to the server. Now, one of the great things about Windows 11 is the antivirus has got a lot better. So real-time protection has got a lot better. In my tests, I've found that if you don't disable real-time protection, this reverse shell is blocked. So to stop or mitigate this kind of nonsense, one of the things that you're going to make sure that you don't turn off is real-time protection. Real-time protection blocks the reverse shell. So it's great that Microsoft real-time protection has got this good that it blocks reverse shells. I've had to manually disable that. And then what we need to do is run the script. Now, in this example, the client or victim is going to connect to the attacking server and run the script, is going to connect to the web server and run the script. So we need to have the script on the attacking server and you need to change this domain name to the correct domain name. So in this example, \"shell.theboss.lol\" needs to be changed to the IP address of the attacking server. I'm using a different server in this example. So the IP address of this server is this server is this. So when I create the script and the script I'm going to create is called \"payload.ps1\". So payload.ps1, I need to edit this IP address or domain name to the correct IP address of the server. This method allows you to use a domain name. In my example, I have got the domain name, shell.theboss.lol resolving to this IP address. But now that I'm creating a new server, I need to edit the script to point to the new server. So, as an example, if I do an NS lookup for shell.theboss.lol that resolves to this IP address of my first Linode attacking device, the one that I've previously demonstrated. But now that I'm using this IP address, I need to change my script to use that new IP address. And I need to specify the right port, which in this example will be 81. So that's fine. So I'll save the script. So we need to do three things on the Netcat or attacking server for this example. We need to have a web server, we need to run Netcat, and we need to have a script that's going to be run by the client. So I've got Netcat running, I've got my script here. So if I cat to look at the script, there it is. Script is running. So I need to run my web server now. And I need to specify the port, which in this example is going to be port 80. So last step now is to run the malicious code on the client. And the code we need to run is this. Notice, once again, it's pointing to theboss.lol, so I'm going to have to change that to point to the correct server name. So on the client now, I need to edit this domain name to point to the IP address of my attacking server, which is going to be 85.159.213.165. So again, this code needs to be run in PowerShell on the victim computer. So what I'll do here is run PowerShell. So I'll paste that code in on our attacking server now. Netcat is listening on port 81. We've got the web server running, so hopefully we'll see a connection. And as you can see there, something happened. We had a connection from the client to the server and we've got an HTTP 200, that means success. And now on Netcat, I can type commands such as dir, and that shows me Windows information such as the desktop, documents, downloads, et cetera. Okay, I hope you enjoyed this video. If you did, please like it. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I'm David Bombal, and I want to wish you all the very best. (rock music)",
    "transcript_keywords": [
        "server",
        "Windows",
        "Netcat",
        "run",
        "OMG cable",
        "Windows computer",
        "web server",
        "OMG",
        "attacking server",
        "device",
        "address",
        "script",
        "Linode",
        "computer",
        "cable",
        "connection",
        "port",
        "attacking",
        "run Netcat",
        "Linode server"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "UK",
        "first",
        "Linux",
        "three",
        "USB",
        "SSH",
        "Apple",
        "USB-A",
        "a hundred dollars",
        "81",
        "80",
        "Linode",
        "1024",
        "SSHed",
        "One",
        "two",
        "Ubuntu 20.04 LTS",
        "CPU",
        "YouTube",
        "iPhone",
        "David",
        "IP",
        "5",
        "Python",
        "Mac",
        "NS",
        "139.162.246.75",
        "USB-C.",
        "Windows 11",
        "Linode",
        "RAM",
        "Netcat",
        "up to a mile",
        "Third",
        "hundred dollar",
        "PowerShell",
        "Windows",
        "ubuntu2",
        "David Bombal"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON"
    ],
    "vector": [
        -0.08130820840597153,
        0.08403674513101578,
        -0.025582468137145042,
        -0.10631146281957626,
        0.05794767662882805,
        0.05344923958182335,
        0.03161833807826042,
        -0.005664162337779999,
        -0.06023939326405525,
        0.07354794442653656,
        0.07796718180179596,
        0.011797670274972916,
        -0.024592453613877296,
        -0.10167543590068817,
        -0.06787001341581345,
        -0.013776358217000961,
        0.040422841906547546,
        -0.010164069943130016,
        -0.020698409527540207,
        -0.008814658969640732,
        -0.013341840356588364,
        -0.05746810883283615,
        -0.01076444424688816,
        -0.06390824168920517,
        0.004634744953364134,
        -0.010200077667832375,
        -0.011471973732113838,
        0.039761628955602646,
        -0.06711754947900772,
        -0.05701538547873497,
        -0.04486681520938873,
        -0.04940515011548996,
        0.004650361370295286,
        -0.0054222033359110355,
        0.01811215654015541,
        -0.0439194031059742,
        0.02221001870930195,
        0.04276306927204132,
        -0.08799032121896744,
        -0.07251445204019547,
        0.008179682306945324,
        -0.07008575648069382,
        -0.04545101523399353,
        0.010182655416429043,
        -0.03618043288588524,
        -0.0336180105805397,
        0.00867372751235962,
        -0.03650372847914696,
        0.061912789940834045,
        -0.020169170573353767,
        -0.04898810014128685,
        0.07910795509815216,
        0.01594916358590126,
        0.016534673050045967,
        -0.07845064997673035,
        -0.018268004059791565,
        0.03871500864624977,
        0.01973677985370159,
        0.031118176877498627,
        -0.019197776913642883,
        0.08679623156785965,
        -0.02893669530749321,
        -0.033795490860939026,
        0.01207346748560667,
        -0.019255591556429863,
        0.006313236430287361,
        -0.011495026759803295,
        0.040148764848709106,
        0.013351860456168652,
        0.01281147450208664,
        -0.10875935107469559,
        0.019583946093916893,
        -0.05029115453362465,
        0.016134850680828094,
        0.019449565559625626,
        0.027930565178394318,
        -0.0445820651948452,
        0.07112395018339157,
        0.04067555069923401,
        -0.01049940288066864,
        0.02664562501013279,
        0.08418964594602585,
        0.020426807925105095,
        0.025608738884329796,
        -0.0058592697605490685,
        0.12124806642532349,
        -0.08894834667444229,
        0.01926538720726967,
        0.012459306977689266,
        -0.019450124353170395,
        0.005324187688529491,
        0.023123178631067276,
        0.10611490160226822,
        -0.006958250422030687,
        0.07570695877075195,
        -0.07365497946739197,
        -0.003033725544810295,
        -0.07580037415027618,
        -0.016111982986330986,
        0.041738685220479965,
        -0.022622492164373398,
        -0.09059689939022064,
        0.03016151301562786,
        -0.0865030288696289,
        0.07006017118692398,
        0.010485947132110596,
        0.010417924262583256,
        0.011146605014801025,
        0.06448504328727722,
        -0.05350613221526146,
        -0.12021520733833313,
        0.052504803985357285,
        -0.05275983363389969,
        -0.08338382840156555,
        0.033862560987472534,
        0.053687263280153275,
        -0.06521142274141312,
        0.06001381203532219,
        0.08114084601402283,
        -0.06648590415716171,
        0.040101636201143265,
        -0.053689610213041306,
        0.012944172136485577,
        -0.05343709886074066,
        0.03993605449795723,
        -0.01587105728685856,
        0.015415417030453682,
        1.0342290968070283e-32,
        0.0330105721950531,
        0.06152234971523285,
        -0.03373246267437935,
        0.01013876311480999,
        0.07929588854312897,
        0.03151749446988106,
        0.060501500964164734,
        0.054949600249528885,
        -0.06831071525812149,
        0.036587536334991455,
        0.001653217477723956,
        -0.08709292113780975,
        -0.004841473884880543,
        -0.026418069377541542,
        0.02995232865214348,
        -0.04626946896314621,
        0.006201194599270821,
        0.014131608419120312,
        0.014921505004167557,
        -0.061423417180776596,
        0.007795676123350859,
        -0.06700754165649414,
        0.033472947776317596,
        -0.09274013340473175,
        0.00020528330060187727,
        -0.01498990599066019,
        -0.04081141576170921,
        -0.018651258200407028,
        0.14272700250148773,
        0.03324344381690025,
        -0.017059167847037315,
        -0.003212706418707967,
        0.054881926625967026,
        0.022334888577461243,
        -0.05987734720110893,
        0.013455545529723167,
        0.0023219636641442776,
        -0.09832828491926193,
        0.016237759962677956,
        0.009430253878235817,
        0.03348779305815697,
        -0.07485471665859222,
        -0.035324420779943466,
        -0.07070940732955933,
        0.04907922446727753,
        -0.04429496079683304,
        0.010081382468342781,
        -0.002671674359589815,
        -0.028428932651877403,
        0.06480477005243301,
        0.012412688694894314,
        0.040990762412548065,
        -0.0193974319845438,
        -0.035574037581682205,
        -0.11659356951713562,
        0.00614173524081707,
        0.04245668649673462,
        0.018779782578349113,
        -0.015314245596528053,
        0.10199902951717377,
        0.05269123613834381,
        0.018293770030140877,
        0.042459070682525635,
        0.023719849064946175,
        -0.052678339183330536,
        -0.08673608303070068,
        0.05994446948170662,
        -0.03376823291182518,
        -0.058530427515506744,
        0.08300492912530899,
        -0.054461561143398285,
        -0.0006172841531224549,
        -0.06071072816848755,
        -0.04746440425515175,
        -0.05315811187028885,
        0.01924973353743553,
        -0.039764441549777985,
        0.025354335084557533,
        0.007387745659798384,
        0.028514187783002853,
        -0.04635394364595413,
        0.03969068080186844,
        0.0018517669523134828,
        -0.06438390910625458,
        0.032335538417100906,
        -0.013378754258155823,
        0.008480173535645008,
        -0.08319014310836792,
        0.03906272351741791,
        0.03996257856488228,
        0.0039784107357263565,
        -0.04137897863984108,
        0.0015020597493276,
        0.05139412358403206,
        0.005116956774145365,
        -9.47413255400636e-33,
        -0.039568983018398285,
        0.031347740441560745,
        -0.03027685172855854,
        0.008982239291071892,
        -0.018578708171844482,
        0.03096017800271511,
        0.009578527882695198,
        -0.010015614330768585,
        -0.042611654847860336,
        -0.0061384644359350204,
        0.01585683412849903,
        0.04224935546517372,
        -0.030680539086461067,
        -0.028669675812125206,
        0.10857982188463211,
        -0.004018097650259733,
        0.04620692506432533,
        -0.027610039338469505,
        -0.013701495714485645,
        -0.028017202392220497,
        -0.016868505626916885,
        0.054288290441036224,
        0.0445626825094223,
        -0.04544627666473389,
        -0.019515331834554672,
        -0.009676029905676842,
        0.10184259712696075,
        0.1125730499625206,
        0.0844687670469284,
        0.06826834380626678,
        0.03361302241683006,
        0.02455594390630722,
        -0.04617539420723915,
        0.041589461266994476,
        0.05225416272878647,
        0.03913842886686325,
        0.10893410444259644,
        0.012222426012158394,
        -0.006780381314456463,
        -0.12971794605255127,
        0.06521166861057281,
        -0.05667579546570778,
        -0.10023488849401474,
        -0.025218922644853592,
        -0.06276750564575195,
        0.0018824207363650203,
        -0.059152621775865555,
        -0.02831142209470272,
        -0.0996650904417038,
        0.07459148019552231,
        0.06781550496816635,
        -0.03518834337592125,
        0.03581059351563454,
        0.05555521324276924,
        -0.07898610830307007,
        0.04889361187815666,
        0.00974936131387949,
        0.06154788285493851,
        0.04173731431365013,
        -0.005751717835664749,
        0.024682480841875076,
        0.009648009203374386,
        -0.08105015009641647,
        0.017310628667473793,
        0.059593260288238525,
        0.03752861171960831,
        0.054791443049907684,
        0.07257915288209915,
        -0.0780322253704071,
        -0.0794437825679779,
        -0.021214812994003296,
        0.10384029150009155,
        0.010585106909275055,
        -0.021113313734531403,
        0.01334158144891262,
        0.00860171765089035,
        0.06075722351670265,
        0.01839781366288662,
        -0.03189754858613014,
        0.03394755348563194,
        -0.03364955633878708,
        -0.027288010343909264,
        -0.04502641409635544,
        -0.016973299905657768,
        -0.031226221472024918,
        -0.002729270374402404,
        0.020557599142193794,
        0.09474245458841324,
        0.02150515653192997,
        0.04257456958293915,
        -0.047766007483005524,
        -0.012984128668904305,
        -0.0348556786775589,
        0.15102849900722504,
        0.11152209341526031,
        -6.148835751673687e-08,
        -0.0340813510119915,
        0.0073252287693321705,
        -0.02315369062125683,
        0.025512972846627235,
        0.022539205849170685,
        0.06008515506982803,
        -0.023746857419610023,
        -0.09358280897140503,
        -0.05047013983130455,
        -0.06436951458454132,
        -0.041373640298843384,
        -0.03765903785824776,
        -0.02275143563747406,
        -0.014067921787500381,
        -0.03453627973794937,
        0.03897654265165329,
        -0.0995134711265564,
        0.003958316054195166,
        -0.009829060174524784,
        0.018857484683394432,
        -0.011145533993840218,
        0.00040180323412641883,
        0.08182139694690704,
        0.04453286528587341,
        -0.06745512783527374,
        0.01985202543437481,
        0.07611649483442307,
        -0.012267724610865116,
        0.03000037744641304,
        0.024358872324228287,
        -0.07456664741039276,
        -0.013857067562639713,
        -0.030394824221730232,
        0.04250914603471756,
        -0.04530048370361328,
        0.05078139156103134,
        -0.041527606546878815,
        0.013733292929828167,
        0.04514884948730469,
        0.04762593284249306,
        0.00939747504889965,
        -0.06063294783234596,
        -0.010881687514483929,
        -0.039333637803792953,
        -0.04042704030871391,
        0.008576305583119392,
        -0.10497316718101501,
        -0.09616991877555847,
        0.03857901692390442,
        -0.06626834720373154,
        -0.033778753131628036,
        0.05701900273561478,
        0.028379080817103386,
        0.0909053310751915,
        -0.030488980934023857,
        0.02513032779097557,
        0.06650076061487198,
        -0.06401233375072479,
        0.05192539468407631,
        0.16933630406856537,
        -0.03352653607726097,
        0.011833987198770046,
        0.010362710803747177,
        0.03390786051750183
    ]
}