{
    "id": "kilrAtqjwvA",
    "title": "Building The Ultimate Xbox One X",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-09-29T15:15:18Z",
    "video_url": "https://www.youtube.com/watch?v=kilrAtqjwvA",
    "category": "Science & Technology",
    "tags": [
        "xbox",
        "xbox one x",
        "xbox one",
        "microsoft xbox",
        "microsoft",
        "game console",
        "gaming",
        "console",
        "building the ultimate xbox one x",
        "building the ultimate",
        "xbox one controller",
        "xbox one accessories",
        "fortnite",
        "tech",
        "unboxing",
        "austin evans"
    ],
    "views": 4075948,
    "likes": 67551,
    "comments_count": 5053,
    "description": "It's finally time to build the ultimate Xbox One X. Xbox One X Retro Skin on Amazon:  Xbox One X USB Cooling Fan on Amazon:  Xbox One X Cooling Stand on Amazon:  Xbox One X Hard Drive Enclosure on Amazon:  2TB Seagate FireCuda Hard Drive on Amazon:  8TB Seagate Xbox Game Drive on Amazon:  Samsung T5 Portable SSD on Amazon:  Xbox One Design Lab Controller:  AmazonBasics Xbox One Controller Charging Station on Amazon:  Hyperkin Duke Original Xbox Controller on Amazon:  Keymander Mouse and Keyboard Adapter on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/onexskin",
        "http://austin.tech/onexfan",
        "http://austin.tech/onexstand",
        "http://austin.tech/onexhddenclosure",
        "http://austin.tech/2tbfirecuda",
        "http://austin.tech/xboxgamedrive",
        "http://austin.tech/samsungt5",
        "https://xboxdesignlab.xbox.com/en-us/?rtc=1",
        "http://austin.tech/xboxcharging",
        "http://austin.tech/hyperkinduke",
        "http://austin.tech/keymander",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and welcome to the ultimate Xbox One X. Now this has been a very highly requested video. So much so, in fact, that we got an anonymous letter from Hong Kong giving us some suggestions to include for the video. So with some of those in mind, let's get to building. Nick Cage approves. Yes. So everyone's probably familiar with the wonderful look of the Xbox One X. A.K.A. it's just a black box. Which is where this comes in. This is going to be a skin which is going to make our Xbox One X look a lot like an original Xbox. Would some say it looks like an Xbox One? So, in the picture they've got like the front of it, it's got like the Xbox logo and stuff. But, this is just a top skin. Clearly wouldn't happen if this was dbrand. - [Voice Over] Shots fired! Shots fired! - It's actually pretty much lined up, I'm slightly off center. So you put it side by side with the original Xbox it actually doesn't look so bad. I mean, I know I wasn't 100% precise but I think it's close enough that I'll buy that. Next up, because we know just how useful cooling fans and extra attachments are for consoles, we have not only an intelligent cooling fan, but we also have a cooling dock with extra USB ports. So we've got three small cooling fans, it's gonna plug in via USB, and to be fair it does give us a USB pass through, so I guess it just snaps on something like this. I mean it actually does kind of blend in whether this is going to make any difference at all I am incredibly doubtful of but luckily we have a whole other cooling dock to keep it even cooler for our, whatever it is we're doing on an Xbox which is gonna make it overheat. Connecting actually is pretty easy. Then we just do that. Wait a minute... So I see that there's a fan, but where is it pulling air from? There's no place for it to pull on the bottom, on the front, on the sides, why are there three fans if they have no intake or exhaust? What this does give us is three more USB ports up front. One of the things we're going to have to keep in mind with this video though is that we have a lot of things that are going to be requiring USB, so making sure that we have full USB 3.0 on as many ports as possible is going to be a challenge. Because a mere one terabyte of storage is not going to be anywhere near enough, the next step is yet another add-on hub thing. This is going to give us the ability to not only plug in a full 3.5 inch hard drive, we are also going to be getting even more USB ports. Oh joy. That's pretty cool, so it's actually got a Scorpio on the front, which would make sense because this is a Scorpio version of the console, that now has a skin covering all that up. So, people still know we're cool? So the idea here, it it's anything like some of the previous hubs we've used, is that we'll be able to, not only plug in that three and a half inch drive, so this is going to give us three more USB 3.0 ports on front. Now with a three and half inch drive bay we can go completely crazy and put basically any kind of desktop hard drive in here, but as opposed to doing a standard hard drive, instead we have a two terabyte Seagate Firecuda. So this is going to be an SSHD which means that in addition to having two terabytes of capacity, (plastic crinkling) in addition to having two terabytes of capacity there's also a little bit of flash storage on here which depending on the game might not actually make a huge difference to load time, but at the very least it should be a little bit quicker than the standard hard drive. One nice touch is that you have everything you need to do this. As long as you have a 3.5 inch hard drive, I do actually think that this will work with a two and a half inch as well, but if you have a screwdriver you have everything you need to put it on the sled. And with that I think we can, well, just put it in here. So this entire thing is going to operate using the front USB 3.0 port on the Xbox. So as long as we're able to line that up we're going to cover up the power button but it has a little push button, actually it's clear too, so you can see when it's on and off. It's gonna be a little tight, I guess it will work though. The only issue that I actually don't really like with this is that opposed to having it's own separate power cable which I will admit is a little bit annoying, instead it's actually going to go on top of the current power cable. Considering how much power the Xbox One X pulls through just figure eight cable seems a little sketchy, also our fan doesn't let this go in all the way. This is falling apart very quickly but I guess that works, right? While three terabytes might be enough for a normal Xbox One X, this, my friends, is the ultimate Xbox One X which is where this comes in. The Seagate Game Drive with an additional eight terabytes of capacity. Unlike the rest of our accessories this is really straight forward. So instead of attaching it directly to the Xbox this just needs a USB cable. But it does give us an additional two USB 3.0 ports on the front of the Xbox. To think, I was worried about not having enough ports, like, five minutes ago. So with just an external power brick and a single USB cable, we're now up to 11 terabytes of capacity? Which is where this comes in: the Samsung T5 SSD. This is actually something we use on a daily basis here at the office. So, all of our videos are edited off of these T5s, one of the nice things is they come in really large capacities. This one is gonna be a full two terabytes of quick SSD storage, all running off of a single USB cable. Almost said USB-C cable, but we gotta use USB-A for this one. I mean do you need 13 terabytes on you Xbox One X? Probably not. Do you need to build the ultimate Xbox One X? Probably not. Are we done building the Xbox One X? Absolutely not. As far as controllers go, we have a couple of Xbox One Design Lab controllers. These are really cool because you have a lot of customization options for how the controllers look, and importantly they're still going to be the same size, which is important because we have a dual charging station. I mean, it doesn't really look pretty with our Design Lab controllers but now we have two controllers down and two more to go. If you really want the ultimate controller for the Xbox One X though, you want the Duke. So this is modeled almost identically after the original Xbox controller, and while it's a little bit controversial, some might say it's, well, you'll see, you'll see. Oh yeah, that's what I'm talking about. This is licensed by Microsoft even though it's made by Hyperkin. Wow that looks almost identical to the original. For context, this is what a standard Xbox One controller looks like and this is the Duke. It's massive. I think you're definitely going to be better gaming on a standard Xbox controller, but the coolness of this is just, there's just no way to get around it. Now unfortunately this is going to be a wired controller, but thankfully it's going to be a really long cable and it is detachable with microUSB. As if all these controller options weren't enough we also have the Keymander. This is actually something I did a video on, like two or three years ago. But the idea here is that this is going to be an adapter that will turn a mouse and keyboard into what the xBox thinks is a standard controller. So inside this little box, well it gets a little bit complicated but hopefully it won't be that bad. So around front we have a mouse, keyboard, and gamepad, I think you actually have to have all three plugged in because it pretends to be the gamepad but it's actually passing through the mouse and the keyboard signal. Then around back we have another series of USB ports for power, PC, game, as well as data, which looks like a eighth inch jack. Oh man, this is, this is a lot. (clock ticking)(ding) Welcome, my friends, to the completed ultimate Xbox One X. And yes, all of these cables and accessories are completely necessary. So, to start with we're gonna be showing you what the Keymander will do. We are going to be spoofing it with the actual Xbox One controllers. You need to make sure this is still plugged in. With that, your mouse, your keyboard, everything attached via USB, we should be able to play a game. (mouse clicks) Hey it works! I mean it's really, really slow. Maybe we should turn up the mouse sensitivity a little. Dude, this actually doesn't feel that different than playing on a PC. I mean, there might be a touch of latency if I try and move really quickly, but it's not bad. Now there's definitely an argument to be said that this is going to give you an unfair advantage, but, I mean, if you want to be more comfortable playing with your mouse and keyboard versus an Xbox controller, and you don't mind dealing with some finickiness, it is not the easiest thing to set up, and you do need kinda keep it tuned per game to make sure it has the correct profiles, but you can download those pretty easily. Why do you have weapons? Okay, well this is unfortunate, this is very unfortunate. Wait a minute... I'll just use my, no, no. Wait, I got, that count's as a kill right? I blew up on them. I'm gonna count that as a kill. Dave will be very proud. The Duke on the other hand, well it's definitely a much larger controller. Personally, I do think that the standard Xbox One controller is better, but I mean better is kind of relative, right? The Duke is a unique option. It also doesn't feel that bad, so some of the buttons are a little bit weirdly laid out compared to the newer controllers, especially stuff like the left and right bumpers which feel kind of tacked on, but it works. Of course we're not here just to play Fortnite. We have 13 terabytes of hard drives to install a whole bunch of other games if we want to as well. So right now if you go into the options we have the internal hard drive, we also have another 7.2 terabytes from that eight terabyte drive over there, we have the 1.8 terabytes of our T5, and then we have our two terabyte Firecuda which is in here. They'll actually show up and once you give them a quick format, I mean, it kinda works. Unlike a lot of the builds in the ultimate series that we do this actually all works, all the accessories are plugged in, attached, skinned, powered, USB-ed, whatever you want to call it, it's all actually working. Now does it make sense? No of course not. Am I going to put links to every single one of these accessories that we used in the description? Of course I am.",
    "transcript_keywords": [
        "Xbox",
        "USB",
        "Xbox controller",
        "ultimate Xbox",
        "USB ports",
        "standard Xbox",
        "original Xbox",
        "USB cable",
        "Hong Kong giving",
        "terabytes",
        "controller",
        "drive",
        "hard drive",
        "standard Xbox controller",
        "Hong Kong",
        "original Xbox controller",
        "ports",
        "single USB cable",
        "front",
        "make"
    ],
    "transcript_entity_values": [
        "T5",
        "daily",
        "eight terabyte",
        "three",
        "USB-C",
        "Keymander",
        "Seagate",
        "Hyperkin",
        "two terabytes",
        "two and a half inch",
        "xBox",
        "Xbox One X",
        "Xbox One X.",
        "Duke",
        "eight",
        "USB",
        "jack",
        "13 terabytes",
        "Xbox",
        "two",
        "an additional eight terabytes",
        "Xbox One",
        "Dave",
        "Hong Kong",
        "Xbox",
        "3.5 inch",
        "100%",
        "microUSB",
        "13 terabytes",
        "Firecuda",
        "a mere one terabyte",
        "Austin",
        "three and a half inch",
        "Xbox One X.",
        "T5s",
        "one",
        "Xbox One X",
        "three terabytes",
        "Nick Cage",
        "two or three years ago",
        "1.8 terabytes",
        "Microsoft",
        "Xbox One",
        "USB-ed",
        "Scorpio",
        "SSD",
        "Samsung T5",
        "Fortnite",
        "up to 11 terabytes",
        "a minute",
        "three and half inch",
        "Design Lab",
        "One",
        "five minutes ago",
        "Xbox One Design Lab"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG"
    ],
    "vector": [
        -0.0029420582577586174,
        -0.06463046371936798,
        -0.004256112966686487,
        -0.06644530594348907,
        0.12009814381599426,
        -0.014188251458108425,
        0.02356669493019581,
        -0.04224575310945511,
        0.030830377712845802,
        0.04927448928356171,
        -0.016135649755597115,
        0.0007883460493758321,
        0.08975892513990402,
        -0.0322503000497818,
        -0.017777394503355026,
        0.040043994784355164,
        0.07137357443571091,
        -0.1178179457783699,
        -0.06085987761616707,
        0.07420699298381805,
        0.0007748896023258567,
        -0.0549209900200367,
        0.008387354202568531,
        -0.01131933182477951,
        -0.13106603920459747,
        -0.0054684849455952644,
        -0.029362553730607033,
        0.009670131839811802,
        -0.07313509285449982,
        -0.04953563213348389,
        -0.036219242960214615,
        0.0005614446708932519,
        -0.01621192693710327,
        -0.01946718618273735,
        0.019221706315875053,
        -0.03874623402953148,
        0.06445342302322388,
        -0.010263864882290363,
        -0.13696376979351044,
        -0.0619024895131588,
        -0.009111347608268261,
        -0.05854032561182976,
        0.089976005256176,
        0.05183636397123337,
        -0.028434330597519875,
        -0.0015277804341167212,
        0.00590509595349431,
        -0.09008876979351044,
        0.05031902343034744,
        0.041219305247068405,
        0.0381217896938324,
        -0.05454733595252037,
        0.06949533522129059,
        -0.052830494940280914,
        0.001968073658645153,
        0.048390064388513565,
        -0.0524548701941967,
        -0.020473245531320572,
        0.0593789741396904,
        -0.05476613715291023,
        0.0553058497607708,
        -0.048381928354501724,
        0.022086283192038536,
        0.03027133084833622,
        0.021016232669353485,
        -0.02833528257906437,
        -0.02373606525361538,
        -0.013643561862409115,
        -0.017918908968567848,
        -0.02295471914112568,
        -0.014500202611088753,
        -0.04074295982718468,
        -0.010062001645565033,
        -0.01574256829917431,
        0.04254929721355438,
        0.021818174049258232,
        0.07067267596721649,
        -0.055270593613386154,
        0.036137841641902924,
        0.007308620028197765,
        -0.02812941186130047,
        0.013121680356562138,
        -0.09160646051168442,
        -0.02081732638180256,
        -0.01861785538494587,
        0.02729961834847927,
        0.02672530710697174,
        0.05030348151922226,
        -0.04969870671629906,
        0.0038450604770332575,
        0.024408262223005295,
        0.0042234016582369804,
        0.10466960072517395,
        0.049590468406677246,
        -0.02271803840994835,
        -0.06409872323274612,
        -0.0028732430655509233,
        -0.019634481519460678,
        -0.0809580534696579,
        -0.004100130870938301,
        -0.058439694344997406,
        0.0383649580180645,
        0.07078264653682709,
        0.008526233024895191,
        -0.00415334478020668,
        -0.12845882773399353,
        -0.041369225829839706,
        0.07561646401882172,
        -0.013033474795520306,
        -0.0658491849899292,
        -0.025635292753577232,
        -0.07984647154808044,
        -0.10335758328437805,
        0.05707896128296852,
        0.0018014690140262246,
        0.047202855348587036,
        -0.028593499213457108,
        0.024835940450429916,
        0.028549838811159134,
        -0.04999838024377823,
        0.09395502507686615,
        -0.03377313166856766,
        0.020864538848400116,
        -0.023794271051883698,
        0.058842677623033524,
        -0.07790369540452957,
        -0.018574289977550507,
        8.164323279923241e-33,
        -0.026010949164628983,
        0.08327091485261917,
        -0.0013910181587561965,
        -0.036201562732458115,
        0.02861306630074978,
        -0.016125179827213287,
        0.08273934572935104,
        0.088254414498806,
        -0.007864375598728657,
        0.1055912971496582,
        -0.03938959166407585,
        0.09303390979766846,
        -0.09719701111316681,
        0.015872709453105927,
        0.009212731383740902,
        -0.056426629424095154,
        -0.026474162936210632,
        -0.04613111913204193,
        -0.06783169507980347,
        0.0053911274299025536,
        0.007565033156424761,
        0.07924441248178482,
        0.04494454339146614,
        -0.05544615536928177,
        0.004122896119952202,
        -0.047949470579624176,
        0.009016470983624458,
        -0.05757100135087967,
        0.07649876177310944,
        0.052766989916563034,
        -0.15498630702495575,
        -0.03213674575090408,
        -0.07932338118553162,
        0.014342009089887142,
        -0.004862149246037006,
        -0.015233808197081089,
        -0.0013905216474086046,
        -0.029867663979530334,
        -0.010583674535155296,
        0.05757298320531845,
        -0.04877905920147896,
        -0.04448116198182106,
        -0.07679768651723862,
        -0.03762034699320793,
        -0.01313411258161068,
        0.013150827959179878,
        0.014993072487413883,
        -0.052394915372133255,
        0.0373067669570446,
        0.0340004600584507,
        -0.04552214965224266,
        0.011301565915346146,
        0.02680838853120804,
        -0.0518491268157959,
        0.006216355133801699,
        -0.12436813861131668,
        0.012043486349284649,
        0.030302541330456734,
        0.024797961115837097,
        0.02725154533982277,
        -0.007103949319571257,
        -0.04513845592737198,
        0.032812438905239105,
        0.014697802253067493,
        -0.10601700097322464,
        0.03053337149322033,
        0.0984388217329979,
        -0.0513572134077549,
        -0.021675465628504753,
        -0.03941735997796059,
        -0.026477618142962456,
        0.02529531717300415,
        0.07057617604732513,
        -0.10797951370477676,
        0.03364573046565056,
        0.0037057071458548307,
        -0.09735692292451859,
        0.017400965094566345,
        0.004552876111119986,
        0.023803798481822014,
        -0.04601287469267845,
        0.013329627923667431,
        -0.031417928636074066,
        0.10210154205560684,
        -0.02993345633149147,
        0.0298768300563097,
        0.030111830681562424,
        0.06876187771558762,
        0.040486790239810944,
        -0.0657726600766182,
        -0.07916367799043655,
        -0.05147462338209152,
        0.030114011839032173,
        -0.031829170882701874,
        0.01924208551645279,
        -8.733704090786756e-33,
        -0.026448259130120277,
        -0.11490273475646973,
        0.02917664125561714,
        0.03184064105153084,
        0.012047672644257545,
        0.02311716042459011,
        0.008427681401371956,
        0.013423753902316093,
        0.05544131249189377,
        -0.00840702559798956,
        -0.030871612951159477,
        0.037960074841976166,
        -0.0797211229801178,
        -0.041166048496961594,
        -0.00021308641589712352,
        -0.032762572169303894,
        0.026473645120859146,
        -0.05426911637187004,
        0.025034917518496513,
        -9.291847527492791e-05,
        -0.0021182456985116005,
        -0.011139758862555027,
        -0.02921738103032112,
        0.009189596399664879,
        -0.007499347440898418,
        0.03696309030056,
        0.10260254889726639,
        0.03624160587787628,
        0.04641871526837349,
        0.01767057739198208,
        -0.08455018699169159,
        0.06122957542538643,
        0.023800687864422798,
        0.04883071407675743,
        -0.0001973882463062182,
        0.018598437309265137,
        0.05801483616232872,
        0.04143432155251503,
        -0.03814457356929779,
        0.024136949330568314,
        0.01593097113072872,
        -0.04872193932533264,
        0.006901165470480919,
        0.024378154426813126,
        0.03752044960856438,
        -0.015350541099905968,
        -0.009410019032657146,
        -0.012608390301465988,
        0.033301595598459244,
        0.07519906759262085,
        0.019570982083678246,
        -0.0028445888310670853,
        0.012066695839166641,
        -0.029490254819393158,
        -0.09213163703680038,
        -0.04972337558865547,
        -0.0027429363690316677,
        0.09628639370203018,
        0.06761545687913895,
        0.007758274208754301,
        0.019618721678853035,
        0.04027457535266876,
        -0.005629169754683971,
        -0.014560496434569359,
        -0.05166826397180557,
        -0.04206377640366554,
        0.11062706261873245,
        0.025862937793135643,
        -0.0482095405459404,
        0.06423263251781464,
        0.007805269677191973,
        -0.03151310607790947,
        -0.013736297376453876,
        -0.06592202186584473,
        0.054231055080890656,
        0.02021184377372265,
        0.025956861674785614,
        -0.08090139925479889,
        0.030324744060635567,
        -0.02759133093059063,
        -0.017323244363069534,
        0.06080823019146919,
        0.08182723075151443,
        0.03949101269245148,
        0.15050749480724335,
        -0.011045524850487709,
        0.07185272127389908,
        0.11089809983968735,
        -0.04606372117996216,
        -0.049261484295129776,
        0.0033021531999111176,
        0.0036026672460138798,
        -0.02958722598850727,
        0.06364691257476807,
        -0.03314461186528206,
        -5.97386673462097e-08,
        -0.027132906019687653,
        0.017496155574917793,
        -0.024393361061811447,
        -0.00533367320895195,
        -0.003246726468205452,
        -0.00599847873672843,
        -0.0002547943440731615,
        0.015363515354692936,
        0.0881287232041359,
        -0.012499570846557617,
        0.1150258332490921,
        -0.037126097828149796,
        -0.07460162788629532,
        0.05967668816447258,
        0.004798732697963715,
        0.07461531460285187,
        -0.060085099190473557,
        0.061900604516267776,
        -0.02900795079767704,
        -0.013470035046339035,
        -0.041787296533584595,
        0.007341861724853516,
        0.057576343417167664,
        -0.12538374960422516,
        0.015767812728881836,
        0.010526535101234913,
        -0.10304220765829086,
        0.010317099280655384,
        0.04737986996769905,
        -0.04334355890750885,
        -0.059900667518377304,
        -0.040781255811452866,
        -0.024939684197306633,
        0.005173050798475742,
        0.04305833950638771,
        -0.05155051127076149,
        -0.008024458773434162,
        0.03636140376329422,
        0.08389550447463989,
        0.005805660970509052,
        0.005508958362042904,
        -0.07155919075012207,
        -0.06558854877948761,
        -0.018121736124157906,
        0.03517228364944458,
        0.01652633771300316,
        -0.08696553111076355,
        -0.07914014905691147,
        -0.0899406298995018,
        0.05150485411286354,
        -0.03791116550564766,
        -0.061892732977867126,
        0.016918782144784927,
        -0.014319331385195255,
        0.09358252584934235,
        0.06666063517332077,
        0.0026717334985733032,
        0.007690728642046452,
        0.04908393695950508,
        0.08887570351362228,
        0.048378799110651016,
        -0.006909653078764677,
        -0.06242770329117775,
        0.08364275842905045
    ]
}