{
    "id": "kjt60g5qQ_A",
    "title": "Oneplus 8T Teardown! - Are there really TWO batteries?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-10-16T16:15:07Z",
    "video_url": "https://www.youtube.com/watch?v=kjt60g5qQ_A",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 8t",
        "OnePlus 8t teardown",
        "How to repair oneplus 8t",
        "two batteries 8T",
        "OnePlus",
        "New oneplus",
        "best budget phone",
        "midrange device",
        "smartphone",
        "android",
        "iphone",
        "best smartphone"
    ],
    "views": 1397342,
    "likes": 56852,
    "comments_count": 3594,
    "description": "Its time to take apart the OnePlus 8T. Snag a teardown skin for your device here:  OnePlus releases a lot of phones throughout the year. This time they say they have added two batteries inside to speed up charging times. Double the batteries, double the charging speed. Its time to take apart the OnePlus 8T to see for ourselves.  The cell phone tool kit I use is here:  Watch the OnePlus 8T durability test here:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/teardown",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/2DURcr7",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Rumor has it that OnePlus has snuck two batteries inside of the OnePlus 8T this year to sped up its charging time. Instead of one battery charging at 30 watts like last year, its now two batteries totaling 65 watts. I say we go find them and see what they look like from the inside. Lets get started. [Intro] This is the Aquamarine Green version of the 8T. I still think it looks more blue than anything else. After all the crazy phones weve been dealing with like the Wing, Fold, and Duo, itll be nice to open up a normal phone for a change. With some heat and gentle slicing we can remove the back glass and fold it open like a book. Nothing special is attached to the glass. The inside of the phone has the NFC coil near the top, but no wireless charging. There are 16 normal Phillips head screws holding the whole phone together. Ill link the tool kit Im using down in the video description. Ill unplug the rear flash and top sensor, then the top black plastics can come away from the phone, along with the bottom plastics and the built-in loud speaker. There is no waterproofing on the speaker unit. The mesh is on the frame as youll see in a second. The speaker does have foam balls inside. These balls dampen the sound and make the speaker box sound bigger than it actually is. Now you might be thinking, Hey Jerry, it looks like theres only one battery inside of this phone. And youre right. But appearances can be deceiving. We took the liberty of changing the battery back to red with our Teardown Skin, like OnePlus used to do with the OnePlus One and OnePlus Two. Im sure theres some kind of make batteries great again joke in here somewhere, but since the last guy who said something similar is a joke, well just avoid the subject altogether. Up at the top we have some graphite tape and copper covering the silver shields. OnePlus has even added thermal paste on the top side to keep things running efficiently. Kind of fun. We make the Teardown Skin an exact representation of the actual insides. Ill put a link for the Skin down in the video description. Theres a pretty good chance weve already made one to cover your phone. Ill unplug the battery and the two long extension ribbons. Both pop off like little Legos. There are two screws holding down the motherboard. I can remove the front facing 16 megapixel camera. Theres no OIS on this guy, but it does have electronic image stabilizing. Now for the battery. If you look closely at the non-red battery you can see a crease down the center. There are actually two halves, two batteries, but theyre packaged as one, with one joint or seam down the center. Each of the halves have 2250 milliamp hour capacities for a total of 4500. Now Im no lithium expert, but it does seem to be standard across the board that most phones dont charge faster than 30 watts. So its probably safe to say that charging a singular battery with more power than that might cause the battery to explode or catch fire. But doubling up the batteries allows for double the power to be utilized. Tesla kind of uses the same principle in their electric cars. A Tesla doesnt have just one large battery under the car, its actually six or seven thousand tiny little batteries that can all be charged simultaneously very quickly. The copper cooling system of the 8T also extends beneath the battery and might help with cooling. Ill show you that in a second. The bottom SIM card tray board can come away. Its got some screws holding it down. Then the USB-C charging port can come up. Its on a ribbon all of its own and super easy to replace. It also has its own red rubber ring around the tip for the water resistance, even though there is no official IP rating. The square vibrator is down here as well, placed right here in the center of the phone above the under screen fingerprint reader. Its a haptic style vibrator. The under screen fingerprint scanner is probably one of those flat sensor types without a lens and wed have to break off the screen in order to see it. Ill disconnect the 4 Lego style ribbons that surround the rear cameras and Ill pull the whole thing out from the motherboard since theyre all joined into the same metal housing. We have the 16 megapixel ultra wide camera up top with no OIS. Then we have the main 48 megapixel sensor which does have optical image stabilization. Then we have the 5 megapixel macro camera with no OIS, and the 2 megapixel monochrome which also does not have OIS. Finally we can get the motherboard out and away from the phone. Where Samsung is now not using any thermal paste on their motherboards, OnePlus has doubled down and doubled up, splattering thermal goo all over the back of the motherboard, as well as a few dollops on the front. We can see that the paste rests directly on top of the copper heat pipe which extends below the battery. The copper can take the heat from the processor and the battery as well, I assume, and then release it out the front of the display. Camera sensors are known to heat up as well. So there is some graphite tape and copper underneath. But it doesnt seem to be a part of the vapor chamber. Now Im always torn at this point since I do like seeing the vapor chambers in their entirety. But in order to do so, I would have to remove the screen which kills the phone. And I should probably leave this one alive since I definitely killed the last few phones that came across my desk- The Fold 2 and the Duo. We can still check out a few more things though like the waterproofing mesh over the loudspeaker holes in the bottom. And we can also slice open the vapor chamber to see the little droplets of liquid inside near the bottom. Since we dont want any sharp objects underneath the battery when we put it back in, Ill just rip off the rest of the copper flap and lay the plastic layer back on top. Sharp objects and lithium dont play super well together. Now we can put everything back together and hope it still turns on. I think this OnePlus 8T is the fourth phone that OnePlus has released this year. And while its definitely still worth a glance with its incremental improvements, you know, if your current phone is out of commission, personally Id be okay if smartphone companies stopped releasing 3 or 4 versions of the same phone every year, and just focused on one or two more solid devices. But I guess more variations reduce the overall risk of one design tanking. And they get their brand out in front of people with each new release wave. Brand awareness is pretty priceless. Either way, with everything turned on. Its functioning like normal. Kind of nice to have a phone living again after a tear down. Ill leave a link for the Teardown Skin down in the video description. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. Ill see you around.",
    "transcript_keywords": [
        "phone",
        "battery",
        "Ill",
        "OnePlus",
        "Teardown Skin",
        "top",
        "inside",
        "batteries",
        "Skin",
        "copper",
        "back",
        "charging",
        "OIS",
        "phones",
        "megapixel",
        "charging time",
        "Fold",
        "Teardown",
        "speaker",
        "battery inside"
    ],
    "transcript_entity_values": [
        "30 watts",
        "OnePlus",
        "Aquamarine Green",
        "The Fold 2",
        "OnePlus",
        "8",
        "Lego",
        "Instagram",
        "two",
        "4500",
        "six",
        "16",
        "Jerry",
        "only one",
        "4",
        "Phillips",
        "seven thousand",
        "2 megapixel monochrome",
        "this year",
        "5",
        "NFC",
        "OnePlus One",
        "65 watts",
        "Tesla",
        "last year",
        "second",
        "OnePlus Two",
        "Samsung",
        "OnePlus 8",
        "fourth",
        "16 megapixel",
        "3",
        "OnePlus 8T",
        "48 megapixel",
        "every year",
        "one",
        "Twitter",
        "IP"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "EVENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.11288286745548248,
        0.1246858537197113,
        0.03819539025425911,
        -0.016749683767557144,
        0.020630281418561935,
        -0.0440061092376709,
        0.04199715331196785,
        0.0894845724105835,
        0.003823528066277504,
        0.08778698742389679,
        0.07708278298377991,
        -0.007928118109703064,
        0.004137231502681971,
        0.04912379011511803,
        0.026918331161141396,
        -0.02407221496105194,
        -0.0008357898914255202,
        -0.04934954643249512,
        -0.07710497826337814,
        0.08668651431798935,
        0.08777732402086258,
        0.018771357834339142,
        0.07556548714637756,
        -0.003459238214418292,
        0.06582716107368469,
        -0.010760169476270676,
        -0.08436636626720428,
        -0.014711828902363777,
        -0.08346615731716156,
        -0.047395747154951096,
        0.043559323996305466,
        0.05819036066532135,
        -0.0643434077501297,
        0.0378224216401577,
        0.08270291239023209,
        0.06721275299787521,
        0.08633238822221756,
        0.03693230077624321,
        -0.022703517228364944,
        -0.03792009502649307,
        0.011940456926822662,
        0.026302270591259003,
        0.022866882383823395,
        -0.02079247124493122,
        -0.046677302569150925,
        0.039684146642684937,
        0.06380677968263626,
        -0.0799010694026947,
        0.03186548873782158,
        0.0024657142348587513,
        0.0055576651357114315,
        0.019536279141902924,
        0.034771423786878586,
        0.041487451642751694,
        -0.009333682246506214,
        0.02752070128917694,
        -0.03427497670054436,
        0.022735178470611572,
        0.02984653227031231,
        -0.05773274973034859,
        -0.013094374909996986,
        0.03129419684410095,
        -0.009603951126337051,
        0.09397312998771667,
        0.007940062321722507,
        -0.029622338712215424,
        0.010303846560418606,
        -0.12430445849895477,
        -0.09343323111534119,
        0.005625034216791391,
        0.005807800218462944,
        0.01259476225823164,
        0.021202538162469864,
        0.02729138173162937,
        -0.017056940123438835,
        0.09055604040622711,
        0.023516157642006874,
        0.06510984152555466,
        -0.012804734520614147,
        -0.019581342115998268,
        0.03493822365999222,
        -0.05864712968468666,
        0.019508257508277893,
        -0.023056760430336,
        0.04279949516057968,
        0.017093027010560036,
        -0.017585596069693565,
        0.05136261135339737,
        0.021217891946434975,
        -0.0624859593808651,
        0.04081432893872261,
        0.09567354619503021,
        0.06792190670967102,
        0.061892252415418625,
        0.01591837778687477,
        -0.042635478079319,
        -0.10459023714065552,
        -0.02230047434568405,
        -0.09322470426559448,
        0.00709864916279912,
        0.02134745754301548,
        -0.06810960918664932,
        0.05074901133775711,
        -0.008004306815564632,
        0.048220597207546234,
        -0.0708763524889946,
        -0.08856770396232605,
        -0.07391360402107239,
        0.046850450336933136,
        0.03628571704030037,
        0.0560736320912838,
        0.014522423036396503,
        -0.017963210120797157,
        0.001650980324484408,
        0.027405185624957085,
        0.07186780124902725,
        -0.09144666790962219,
        0.05570841208100319,
        0.15560799837112427,
        -0.017577556893229485,
        0.008791017346084118,
        -0.03793167695403099,
        0.02951858378946781,
        -0.01386555377393961,
        0.057507023215293884,
        0.013830081559717655,
        0.0007933862507343292,
        3.568983050720842e-33,
        0.006407015025615692,
        0.05467837303876877,
        -0.012415881268680096,
        0.008999359793961048,
        -0.042887598276138306,
        -0.007383680436760187,
        -0.010014323517680168,
        0.01743273250758648,
        0.015000473707914352,
        0.028862429782748222,
        -0.0683295950293541,
        0.0360226146876812,
        0.038993120193481445,
        0.02476995624601841,
        -0.005216503515839577,
        -0.014230811037123203,
        0.05734208598732948,
        -0.03548635542392731,
        0.034527551382780075,
        -0.027967914938926697,
        -0.05324363335967064,
        -0.0031460202299058437,
        0.010936892591416836,
        0.06963619589805603,
        0.10989399254322052,
        0.04089398682117462,
        0.10612786561250687,
        -0.052709780633449554,
        0.06434515118598938,
        0.025762369856238365,
        -0.07405698299407959,
        0.025251680985093117,
        -0.031220415607094765,
        0.018484866246581078,
        0.005654074251651764,
        0.038031771779060364,
        0.010951008647680283,
        -0.0518789105117321,
        -0.04085240513086319,
        -0.061616428196430206,
        -0.0606413297355175,
        0.007750756107270718,
        -0.030384229496121407,
        -0.08605144172906876,
        0.014923499897122383,
        -0.09895280003547668,
        -0.11078279465436935,
        0.0010712560033425689,
        -0.04949836805462837,
        0.0038555681239813566,
        -0.033948831260204315,
        -0.04313142970204353,
        0.0012133622076362371,
        -0.007967422716319561,
        -0.0869833305478096,
        0.030961966142058372,
        0.02765580080449581,
        -0.014234975911676884,
        0.08643335103988647,
        0.055735062807798386,
        0.02147870510816574,
        -0.015478718094527721,
        -0.05151068791747093,
        -0.004037287086248398,
        -0.034742556512355804,
        -0.01701190136373043,
        -0.01974574849009514,
        -0.01042420044541359,
        -0.021143995225429535,
        0.005314304959028959,
        -0.029546992853283882,
        -0.06860584020614624,
        -0.001210584887303412,
        -0.06948284059762955,
        0.014818648807704449,
        0.0061262426897883415,
        0.026357514783740044,
        0.0226439218968153,
        0.04989254102110863,
        -0.028124751523137093,
        -0.056633803993463516,
        -0.012385886162519455,
        0.033376049250364304,
        -0.00091741286450997,
        -0.01060227956622839,
        -0.08766800165176392,
        0.008097627200186253,
        -0.07864124327898026,
        -0.04178372398018837,
        0.02691599540412426,
        0.04057009890675545,
        -0.031025463715195656,
        -0.09518155455589294,
        -0.038514334708452225,
        -0.0029806108213961124,
        -5.6377572319100794e-33,
        -0.08020534366369247,
        0.011885644868016243,
        -0.03720027208328247,
        -0.028694558888673782,
        0.07166492193937302,
        -0.009938986971974373,
        0.008160172961652279,
        0.023047270253300667,
        0.013605001382529736,
        -0.07026645541191101,
        -0.049198951572179794,
        -0.006150241009891033,
        -0.12412714958190918,
        -0.08267001807689667,
        0.04203682392835617,
        -0.03095809370279312,
        0.019525781273841858,
        -0.05208243802189827,
        0.05598912015557289,
        0.01524296309798956,
        0.030360551550984383,
        0.06253571808338165,
        0.07413136959075928,
        0.07624296098947525,
        -0.008004650473594666,
        -0.016576645895838737,
        0.007459054235368967,
        -0.07765419036149979,
        0.051254961639642715,
        -0.04232826083898544,
        0.00559598533436656,
        -0.012022296898066998,
        -0.018941139802336693,
        0.12481710314750671,
        -0.017542719841003418,
        0.021806666627526283,
        0.004098180681467056,
        -0.029806852340698242,
        0.030723178759217262,
        -0.05671018734574318,
        0.03371956944465637,
        0.019470738247036934,
        -0.013445699587464333,
        -0.014323703944683075,
        -0.058697547763586044,
        -0.05395213142037392,
        -0.051185064017772675,
        0.03504250943660736,
        -0.06959223747253418,
        0.07058694213628769,
        -0.04470996931195259,
        0.02197282947599888,
        -0.07398323714733124,
        -0.01326272264122963,
        -0.02086097002029419,
        -0.0722360908985138,
        0.08018068969249725,
        -0.05720025300979614,
        -0.05401097238063812,
        -0.016693467274308205,
        0.10972936451435089,
        0.012927930802106857,
        0.011485312134027481,
        0.0014551739441230893,
        -0.08291259407997131,
        -0.017038995400071144,
        0.03545340523123741,
        -0.03134622052311897,
        -0.010735494084656239,
        0.046395931392908096,
        0.02318783663213253,
        -0.007934469729661942,
        -0.0066975257359445095,
        -0.1257953941822052,
        -0.01247668731957674,
        0.014163448475301266,
        -0.07480233907699585,
        -0.03888446465134621,
        0.01642957516014576,
        -0.06974051892757416,
        0.05232970416545868,
        -0.03624039515852928,
        0.0408780574798584,
        0.03356776759028435,
        0.00878224242478609,
        -0.06937063485383987,
        0.10799088329076767,
        0.07651659101247787,
        -0.008472537621855736,
        0.02444920316338539,
        -0.010247294791042805,
        -0.005266867578029633,
        -0.028893761336803436,
        0.17209219932556152,
        -0.02912851609289646,
        -5.829851801308905e-08,
        0.03926635533571243,
        0.0492573045194149,
        -0.021751565858721733,
        -0.07649704068899155,
        -0.023205861449241638,
        -0.0819268450140953,
        0.010446968488395214,
        0.09957537055015564,
        0.012746583670377731,
        -0.048914507031440735,
        0.06736549735069275,
        -0.01657014898955822,
        -0.005392592400312424,
        0.04596555978059769,
        -0.033838000148534775,
        0.06671379506587982,
        -0.0430808886885643,
        0.00958835706114769,
        -0.027324793860316277,
        0.049907386302948,
        -0.06619824469089508,
        -0.021979758515954018,
        0.03421907126903534,
        -0.02195134200155735,
        0.032835762947797775,
        0.08245161175727844,
        -0.15618650615215302,
        -0.030621778219938278,
        0.06858830153942108,
        0.0043172044679522514,
        -0.015226529911160469,
        -0.0059919715858995914,
        -0.018077027052640915,
        0.001904279226437211,
        -0.05825868248939514,
        -0.06722398847341537,
        -0.03487980738282204,
        -0.0060487170703709126,
        0.04880436509847641,
        0.05094275251030922,
        -0.05353377386927605,
        -0.09891072660684586,
        0.03899722173810005,
        0.05359189957380295,
        -0.028673933818936348,
        -0.024753810837864876,
        0.06186789646744728,
        -0.11380192637443542,
        -0.07397552579641342,
        0.01806039549410343,
        -0.08208558708429337,
        0.00411850493401289,
        -0.06772665679454803,
        -0.06107000261545181,
        -0.08011925220489502,
        0.016155805438756943,
        0.012758586555719376,
        -0.009181080386042595,
        0.014506050385534763,
        0.008630241267383099,
        0.009708747267723083,
        -0.07828948646783829,
        0.033059991896152496,
        0.038183681666851044
    ]
}