{
    "id": "KlGaWZJPwo4",
    "title": "Is MultiVoltz a Scam? (Yes! Here's Why) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-05-07T18:01:25Z",
    "video_url": "https://www.youtube.com/watch?v=KlGaWZJPwo4",
    "category": "Science & Technology",
    "tags": [
        "Is MultiVoltz a Scam? (Yes! Here's Why) - Krazy Ken's Tech Talk",
        "MultiVoltz",
        "MultiVoltz Charger",
        "iPhone Charger",
        "iPhone Charger Scam",
        "MultiVoltz Scam",
        "Quick Charge 3.0",
        "Qualcomm",
        "Android",
        "Battery",
        "iOS",
        "Apple",
        "Smartphone",
        "iPad",
        "Rechargeable Battery",
        "Science",
        "Tech",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan"
    ],
    "views": 606538,
    "likes": 21313,
    "comments_count": 2375,
    "description": "You can support this channel on Patreon! Link below Can MultiVoltz charge your phone in 15 minutes AND heal past battery damage? No. It violates science, and it's a scam. Here's why Watch more scam-busting episodes    Check out my 8-Bit Guy Collab   Watch the StarScope scam-buster   Download our epic wallpapers   Subscribe and listen to our podcast    Support our channel and get cool stuff   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Is MultiVoltz a Scam? (Yes! Here's Why) - Krazy Ken's Tech Talk   Patrons got to see this episode early. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://youtu.be/ZahGI6vlkqw",
        "https://youtu.be/67350MLGXXQ",
        "https://thecomputerclan.com/wallpapers",
        "https://applekeynotechronicles.transistor.fm",
        "https://Patreon.com/KrazyKen",
        "https://subscribe.thecomputerclan.com",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "(upbeat music) - Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and I am just so excited to show you this cat video. I, no, sorry. I guess my phone battery is dead. You know, if only two rebels could undermine the smartphone industry and invent a supercharger that could charge this whole thing in 15 minutes, why don't we have something like that? Well, we do! Say hello to the MultiVoltz! As with most things in life, if it sounds too good to be true, it probably is. So let's dive into the BS that is MultiVoltz. MultiVoltz claims to be a mobile device charger which can charge your phone in 15 minutes and reverse battery damage at the same time. This video ad has been making the rounds on YouTube and tons of people have requested me to look into this one. And I'm glad you guys did, because this one is scammy as heck. As you can see, it actually exists. It arrived, but that's about the only semi-redeeming quality about this whole thing. The ad talks about two people, Chris and Damian, who worked at a large tech company making smartphones. Until one day, they uncovered a dirty secret. The company was using batteries designed to get worse over time, on purpose. They discovered all devices have this intended battery aging flaw, to force customers to buy a completely new device each time the battery life starts getting worse. There's already so many things wrong with this ad and we're only about 10 seconds in. So, let's just power through the rest of it before we start taking it apart. So Chris and Damian quit their jobs and created a device which could fix bad batteries for good. And they discovered a way to bypass the battery killing practices that their ex-employer was using. Ultimately, they created a supercharger, which can charge your phone in minutes and reverse the battery aging process. And behold, the MultiVoltz was born. And my favorite claim in this whole ad is that they say they can increase your battery life by 200%. What century are these guys living in? In the future, maybe there's some technology that can do that, but there's no way that is possible now. Then they claim it can charge five times faster than a normal charger. And then they say, \"Watch this comparison test \"and see for yourself.\" So then they time-lapse all the devices charging and then they cut the video? What! The results of that could have easily been faked. Who knows how much time passed between those two shots, an hour could have gone by. And I love how they say the factory charger has barely done anything. Well, 36% is still something so eat me. So, blah-blah-blah, 50% off, fake discount. And then they claim devices like this are usually over $150. Okay, that's not true at all. So, let's start picking apart this ad. The first big problem with this scammy ad is the claim about battery health. Their claiming that this unnamed smartphone company is actively killing the battery in the customer's phones. Well, this unnamed company doesn't exist. The whole backstory is fake. A lot of these ads like to use a fake backstory to try to get you into the emotion of the story and trick you into buying something. But it seems like they're taking a stab at big companies like Apple and Samsung. I don't believe they are actively killing your battery. So let's take off our tinfoil hats and just acknowledge batteries will just die. That's just, that's how it works. It's not evil, it's science. But the worst part is they claim they can reverse the batteries health, which is a lot more of a complicated issue so we'll cover that in a moment. Another issue with this ad, aside from just being poorly shot with lots of stock footage, is that they stole this clip from the Explorer YouTube Channel, specifically his video about how mobile chargers work. And again, the $150 claim is total BS. You can get similar devices on the higher end range for $25 to $50, depending on the number of ports and features. And the OEM price per unit tops out at only a buck 85 on Alibaba, and about only $4 on eBay for retail. And again, this test could have easily have been faked, but in a bit we'll run our own tests and see what the real results are. And by the way, the YouTube channel that hosted one of the video ads has another video on their channel, and guess what it is, Cosmic Scope, AKA StarScope, another very sketchy product that I covered in another episode. They're all working together I tell you. There's someone pulling the strings. So now, let's take a look at MultiVoltz web presence. When you Google MultiVoltz, the first four results talk about it being a scam. Good, it seems like people's bull(beep) detectors are working. Among the search results were a couple of websites, yourMultiVoltz and buyMultiVoltz. Oddly enough, one website feature list says you can charge zero to 70% in 35 minutes. Quite a stark contrast from zero to 100 in 15 minutes. But then another section says you can charge in 15 minutes or less. More inconsistency equals more red flags. And they claim MultiVoltz is the world's first supercharger that uses this patented battery healing technology. Yeah, I don't think so. The website also says \"Get NETTEC for 17.99,\" but that's not the name of this product. So, I'm confused by that. One of the sites also has a likely fake review section with a, you got it, 4.6 average rating, just like we've seen in many, many past products. I think \"James Bond\" writer Ian Fleming sums this up perfectly, \"Once is happenstance. \"Twice as coincidence. \"Three times is enemy action.\" Yeah, it's as if they're all a scam or something. The website reiterates on the BS claims from the video, but I think the claims on the site are actually worse. They say the \"Smart circuits are designed \"to monitor the charging performance of your battery. \"It will automatically stop charging \"once your battery is fully charged.\" Now, that could possibly work, I guess, if this very cheap thing is able to communicate with the phone. But phones have this type of monitoring and optimization technology built in any way, so I'm not really sure what benefits that would offer. But that's not really the main problem. It's the next statement that concerns me. It also says, \"This mechanism reverses the aging process \"and heals past damage.\" So this brings us to the science behind this product. How can it be possibly heal your smartphones battery? There's many different types of batteries in the world and in certain cases, there are ways to heal them or recondition them. But in the context of smartphone batteries and USB power adapters, that doesn't really apply here. First off, we need to understand the basics behind how a rechargeable battery works. Generally speaking, a battery has three parts. A cathode, the positive end, an anode, the negative end, and in the middle, electrolyte. The electrolyte is an ion-filled substance which reacts with the atoms in the anode, and this builds up electrons, which are negatively charged subatomic particles. The anode and cathode are typically comprised of certain metals. And the electrolyte is a paste, acid, or similar compound. The chemicals vary depending on what type of battery you're using. Simply put, electrons on the negative side naturally want to flow to the positive side, but they can't pass through the electrolyte. But when a circuit connects both ends of the battery it allows the electrons to flow, creating an oxidation-reduction reaction, or a redox reaction. This generates electricity. When an outside power source is connected, for example, your USB power adapter, the flow of electrons is reversed, but over time, repeated redox reactions will wear the metals down. Eventually the electrons can't be stored in the anode anymore, and they won't be able to flow from negative to positive. No more electricity can be produced. Now, depending on how pedantic your friends are, they might say these chargers aren't technically chargers they're USB power adapters or power supplies. It's the charging circuits in your phone that actually activate the charging. Is it possible to reverse the health of a battery and heal it with a USB power adapter? Well I don't like to say the word impossible, but I do like to say the word improbable. The wear from the redox reactions inside a battery is chemical. The metals physically get worn away with time and they can't be regenerated with a USB power adapter. So, with all of that in mind, it seems like it would be a really dumb idea to buy one of these, right? But of course, I'm the exception that proves the rule. So, I went ahead and bought one. The purchase process was pretty easy at first, but I had doubts about this American Owned badge, especially considering there's plenty of non-American outlets in their video. Then I received this bogus discount with a fake countdown timer, and then a pandemic relief discount. Then I received an upsell page which says, \"Don't use regular cables, \"you won't get the full experience.\" I doubted that, but just to humor them, I bought the denim lightning cable. The charger and cable took, I think it was about two weeks to arrive, but hey, at least they showed up. When I opened the box, the first thing I noticed was the product actually doesn't say MultiVoltz. It says Quick Charge 3.0. And when I looked back on some of the product imagery, the same Quick Charge logo was present in some images, but the MultiVoltz logo was present in others. Either way, the hardware should be the same. Now, full disclaimer, I understand that none of my devices are compatible with the Quick Charge 3.0 standard by Qualcomm, so according to the copy on the website I won't get the really quick 15 minute charging experience. But, in their video ad, and in other parts of the website, they show non QC 3.0 devices charging in 15 minutes. So to try to keep things fair, I'm gonna attempt to replicate the ad as best as I can with my own test. I have an iPhone 7, an iPad Air 2, and an iPhone 12 Pro for this test, and they're all at 0%. I plugged in the iPhone 12 Pro with the recommended denim cable, and I connected it to the red USB port, which automatically recognizes QC 3.0, but truthfully, it doesn't matter in this case because iPhones don't use QC. But the other devices were connected to the green ports. By the way, the ports were very tight. You have to use quite a bit of extra force to plug them in. About 16 minutes in, the iPhone 7 was at 9% charge while the iPhone 12 Pro was at 18%. The iPad still hasn't booted, so I couldn't check the percentage. Remember how the ad ripped on Apple's factory charger for only getting the phone to 36% in 15 minutes? Well, as you can see, the MultiVoltz charger couldn't even get that far. While we wait for everything to charge, I'd like to recommend this other similar episode I did. It talks about how computers and electronics die and just stop working. I actually collabed with The 8-Bit Guy on it too and I love how it turned out. So, feel free to watch that episode next. By the way, this thing is noisy. It has kind of like a gritty hissing sound to it. (device hissing) It's definitely not as quiet as Apple's adapter. 90 minutes in and the iPad Air is only at 6%. So, for the sake of my sanity, I'm gonna just take this one out of the competition here, but I'll still leave it plugged in just so I don't screw anything up with the other devices. Ah, the results are in. And the final times are, iPhone 7 took two hours and 36 minutes to charge, and it tied with the iPhone 12 Pro, and the iPad did not finish. So my iPhones took over 10 times longer to charge than what the ad and certain parts of the website claimed. Not even close. So yeah, this product is a scam. Don't buy it. But if you have bought something similar, I would like to know what your experiences are. And personally, I don't think it's worth fretting over the health of your battery. Thankfully, many modern phones have built in measures to optimize your battery so you can get more use out of it, so you shouldn't have to worry. But also if your battery really starts to suck, you can get the battery replaced without having to pay for an all new device. Ultimately, all batteries will die. So, let's just enjoy them while they work. And if you'd like to help me buy more of these insane products to dive into feel free to pledge to my Patreon, and in exchange I will give you some awesome perks. So, thanks for your support. Also, my new podcast just launched on a ton of platforms and if you're an Apple or Steve Jobs enthusiast, you're definitely gonna wanna subscribe to this one. And hey, if you liked this episode, you know what to do. Thanks for sticking with me. Catch the crazy, and pass it on. (upbeat music)",
    "transcript_keywords": [
        "battery",
        "charge",
        "USB power",
        "minutes",
        "USB power adapter",
        "MultiVoltz",
        "devices",
        "video",
        "USB",
        "Quick Charge",
        "claim",
        "power",
        "iPhone",
        "batteries",
        "time",
        "charging",
        "phone",
        "charger",
        "product",
        "website"
    ],
    "transcript_entity_values": [
        "36%",
        "one day",
        "MultiVoltz",
        "200%",
        "two",
        "non-American",
        "QC",
        "four",
        "85",
        "over $150",
        "about only $4",
        "Quick Charge",
        "50%",
        "Quick",
        "minutes",
        "only about 10 seconds",
        "17.99",
        "18%",
        "Damian",
        "Three",
        "QC 3.0",
        "iPad Air 2",
        "American",
        "About 16 minutes",
        "Apple",
        "StarScope",
        "9%",
        "8",
        "MultiVoltz",
        "Google MultiVoltz",
        "iPhone 7",
        "about two weeks",
        "first",
        "Quick Charge",
        "70%",
        "100",
        "150",
        "Qualcomm",
        "three",
        "iPhones",
        "USB",
        "zero",
        "OEM",
        "the iPad Air",
        "Alibaba",
        "Cosmic Scope",
        "35 minutes",
        "only two",
        "Samsung",
        "iPad",
        "What century",
        "Patreon",
        "YouTube",
        "Krazy Ken",
        "0%",
        "Chris",
        "Steve Jobs",
        "two hours and 36 minutes",
        "10",
        "about two",
        "$25 to $50",
        "a ton",
        "15 minute",
        "James Bond",
        "3.0",
        "the Explorer YouTube Channel",
        "90 minutes",
        "eBay",
        "MultiVoltz",
        "4.6",
        "Ian Fleming",
        "12",
        "15 minutes",
        "One",
        "five",
        "an hour",
        "6%",
        "First"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "DATE",
        "WORK_OF_ART",
        "PERCENT",
        "CARDINAL",
        "NORP",
        "LOC",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "TIME",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "NORP",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "ORDINAL"
    ],
    "vector": [
        -0.17282238602638245,
        -0.03109101578593254,
        0.0008371263975277543,
        -0.10691586136817932,
        -0.00315572670660913,
        -0.029611723497509956,
        0.06087365373969078,
        0.013816041871905327,
        -0.019352387636899948,
        0.0033735036849975586,
        -0.005015556700527668,
        0.014773156493902206,
        0.04193873703479767,
        -0.023995036259293556,
        0.011214181780815125,
        -0.030621079728007317,
        0.031116703525185585,
        -0.06603066623210907,
        -0.07429036498069763,
        -0.018256383016705513,
        -0.0007520600338466465,
        -0.10246051847934723,
        0.06155240535736084,
        -0.03574663773179054,
        0.06331554800271988,
        -0.0430782288312912,
        -0.09463606029748917,
        0.03502001613378525,
        -0.006161489989608526,
        -0.06606419384479523,
        0.04184592515230179,
        0.08988354355096817,
        -0.012281345203518867,
        0.021773960441350937,
        0.022359637543559074,
        -0.0038974848575890064,
        -0.0371757447719574,
        0.015110092237591743,
        -0.08339375257492065,
        0.015995614230632782,
        0.02310674637556076,
        -0.007198200561106205,
        -0.08173222094774246,
        0.03415542095899582,
        -0.017614366486668587,
        0.031919125467538834,
        0.007833132520318031,
        -0.02529316209256649,
        0.04366486147046089,
        0.004764916840940714,
        -0.02981148660182953,
        -0.07882332801818848,
        0.09725405275821686,
        0.043110717087984085,
        -0.04918868839740753,
        -0.02899210900068283,
        -0.0029048563446849585,
        0.016676047816872597,
        0.08683037757873535,
        -0.04969226196408272,
        0.042123351246118546,
        -0.0505518764257431,
        -0.09503137320280075,
        0.04425085335969925,
        0.06911695748567581,
        0.02236475795507431,
        -0.02099113166332245,
        0.04780998453497887,
        -0.0016679557738825679,
        -0.04909372702240944,
        0.026553932577371597,
        -0.036050014197826385,
        0.06425119191408157,
        0.06456716358661652,
        -0.009521782398223877,
        0.031099902465939522,
        0.057083483785390854,
        -0.0628969594836235,
        8.432594768237323e-05,
        -0.08338325470685959,
        0.0644335225224495,
        -0.04532497748732567,
        -0.06992089748382568,
        -0.06774117052555084,
        0.06451690942049026,
        0.014669932425022125,
        -0.09181805700063705,
        -0.002500421367585659,
        0.06318148970603943,
        -0.028207579627633095,
        0.005732445511966944,
        0.09977812319993973,
        0.07124179601669312,
        0.005488860886543989,
        -0.048444975167512894,
        0.051125138998031616,
        -0.046720586717128754,
        -0.04576705023646355,
        -0.050431787967681885,
        0.06018240749835968,
        0.047604095190763474,
        -0.004620801657438278,
        0.008853108622133732,
        -0.08640556782484055,
        0.0454539991915226,
        -0.0355941578745842,
        0.0046202149242162704,
        0.07194055616855621,
        0.0843190997838974,
        0.07385493069887161,
        -0.02889324352145195,
        0.08984187245368958,
        -0.000992735498584807,
        0.004061960149556398,
        0.015769708901643753,
        0.11252560466527939,
        -0.05048368126153946,
        0.06139257177710533,
        0.13751326501369476,
        -0.09896906465291977,
        0.015026886947453022,
        0.017117803916335106,
        0.0192642193287611,
        -0.08106698840856552,
        0.08825920522212982,
        -0.037694014608860016,
        -0.035052187740802765,
        2.451519366249797e-33,
        -0.027264753356575966,
        0.11598356813192368,
        -0.04777546226978302,
        0.011419104412198067,
        -0.008068220689892769,
        0.004665716085582972,
        -0.005630267318338156,
        0.06114111468195915,
        -0.13008400797843933,
        -0.002315882360562682,
        -0.02205188386142254,
        0.04925455525517464,
        0.021707378327846527,
        0.03487800434231758,
        -0.09297573566436768,
        -0.01732855848968029,
        -0.02094903588294983,
        -0.050093356519937515,
        0.026804931461811066,
        0.030606631189584732,
        0.08862881362438202,
        -0.010149828158318996,
        -0.03476165607571602,
        0.05385148152709007,
        0.013297978788614273,
        -0.03424345329403877,
        0.004934180993586779,
        -0.01340241264551878,
        0.12519606947898865,
        0.05475841462612152,
        -0.09719769656658173,
        0.044980354607105255,
        0.053146783262491226,
        0.008356534875929356,
        0.040157802402973175,
        0.025189047679305077,
        -0.059947285801172256,
        -0.08471113443374634,
        0.02854829467833042,
        -0.00452972250059247,
        -0.05325128138065338,
        -0.03479795157909393,
        -0.09831567853689194,
        -0.05910232663154602,
        -0.05445914342999458,
        0.0009280439699068666,
        -0.030250197276473045,
        -0.03628605604171753,
        -0.01581755094230175,
        -0.0368470624089241,
        -0.05355680733919144,
        -0.006147306878119707,
        -0.04775397479534149,
        0.006068077869713306,
        -0.04336504265666008,
        0.05295855924487114,
        -0.033871885389089584,
        -0.014048771001398563,
        0.13846908509731293,
        -0.004453433211892843,
        0.017856746912002563,
        0.05704229325056076,
        -0.01474539004266262,
        0.05125870555639267,
        -0.11995634436607361,
        -0.09166926890611649,
        0.012609952129423618,
        0.053378116339445114,
        -0.02381984330713749,
        0.07086275517940521,
        -0.006942941807210445,
        -0.012182035483419895,
        -0.007398936897516251,
        -0.04212727025151253,
        0.006230649538338184,
        0.0004539546789601445,
        -0.0292079895734787,
        0.04876542463898659,
        0.007884596474468708,
        0.08637410402297974,
        0.006799264810979366,
        -0.01032774243503809,
        0.08228110522031784,
        0.005475788842886686,
        0.0444900318980217,
        0.025669211521744728,
        0.01342543214559555,
        -0.05713919177651405,
        -0.05706782639026642,
        -0.024350423365831375,
        0.013938449323177338,
        -0.040136612951755524,
        -0.020163865759968758,
        0.023092707619071007,
        -0.03483406826853752,
        -3.998568563254801e-33,
        -0.06407000124454498,
        0.015512644313275814,
        0.002672965405508876,
        -0.0021453239023685455,
        0.07991988956928253,
        -0.02055358700454235,
        -0.029592135921120644,
        -0.03194950148463249,
        -0.01385356392711401,
        0.046042829751968384,
        0.017683198675513268,
        0.02152123674750328,
        -0.046008653938770294,
        -0.0712316483259201,
        0.1054527536034584,
        -0.06746366620063782,
        0.05969031900167465,
        -0.03773785009980202,
        -0.0047846101224422455,
        -0.0442865751683712,
        0.05258164554834366,
        0.010775929316878319,
        -0.03136042505502701,
        0.09394122660160065,
        -0.032380811870098114,
        0.013429439626634121,
        0.017757371068000793,
        0.02705685794353485,
        0.03914586082100868,
        0.10131915658712387,
        0.024204032495617867,
        -0.004286263603717089,
        -0.03351261839270592,
        0.04575306922197342,
        0.029004236683249474,
        0.02680833265185356,
        0.051687441766262054,
        0.016524897888302803,
        -0.03557908535003662,
        -0.08570370823144913,
        0.06480538845062256,
        0.02492504008114338,
        -0.04874313622713089,
        -0.041164182126522064,
        -0.034796420484781265,
        -0.04422716051340103,
        -0.026769382879137993,
        -0.0009202077053487301,
        -0.014599595218896866,
        0.06304183602333069,
        0.02234884910285473,
        -0.011544441804289818,
        0.034432824701070786,
        0.03244232013821602,
        -0.04190000891685486,
        0.018564380705356598,
        0.02885335125029087,
        0.06283789128065109,
        0.04559987410902977,
        -0.03385103493928909,
        0.01633472554385662,
        -0.030473792925477028,
        -0.02438213676214218,
        -0.044257357716560364,
        0.06423915177583694,
        0.0003416860708966851,
        0.1348288208246231,
        0.014531377702951431,
        -0.005995546467602253,
        -0.04149330034852028,
        0.01914004236459732,
        0.026907488703727722,
        -0.06611327081918716,
        -0.08088068664073944,
        -0.025074640288949013,
        0.09517918527126312,
        -0.023570360615849495,
        -0.006677584256976843,
        -0.08067638427019119,
        -0.040215469896793365,
        0.04282550513744354,
        0.006081763654947281,
        0.09948897361755371,
        0.055607110261917114,
        0.048320088535547256,
        -0.03710906207561493,
        0.03937589377164841,
        0.046300746500492096,
        -0.01930403709411621,
        -0.0184770617634058,
        -0.030184492468833923,
        -0.056136950850486755,
        -0.0028557381592690945,
        0.09686708450317383,
        0.06973660737276077,
        -5.3446083114749854e-08,
        0.04293760284781456,
        0.0428357757627964,
        -0.004089037887752056,
        -0.03373708203434944,
        0.0044349743984639645,
        -0.10071459412574768,
        -0.03761378675699234,
        0.03347557783126831,
        0.031789157539606094,
        0.03261158615350723,
        0.05626748502254486,
        -0.058366768062114716,
        -0.042278338223695755,
        0.025098280981183052,
        0.0013303366722539067,
        -0.02852734737098217,
        -0.0723138079047203,
        0.00047619841643609107,
        -0.04764799773693085,
        -0.013775421306490898,
        -0.007197747938334942,
        -0.009533588774502277,
        0.053889933973550797,
        -0.024638481438159943,
        0.00443072896450758,
        0.05552786961197853,
        -0.009123943746089935,
        0.03660913184285164,
        0.04341523349285126,
        -0.08770258724689484,
        -0.09663383662700653,
        -0.023928705602884293,
        -0.02278492972254753,
        -0.031032659113407135,
        -0.018440039828419685,
        -0.028325103223323822,
        0.0019435521680861712,
        -0.021824713796377182,
        0.026521863415837288,
        0.029930394142866135,
        -0.01093982346355915,
        -0.07519689202308655,
        0.09732739627361298,
        0.042226921766996384,
        -0.046976666897535324,
        -0.018448740243911743,
        -0.10858723521232605,
        -0.1080734133720398,
        0.09104882180690765,
        -0.00334207178093493,
        -0.03672363981604576,
        0.004426857922226191,
        0.013366863131523132,
        0.035062793642282486,
        0.025163108482956886,
        -0.032544516026973724,
        -0.05768989771604538,
        -0.020650984719395638,
        0.06882019340991974,
        0.04780218005180359,
        0.06015527993440628,
        -0.11031917482614517,
        -0.05946864187717438,
        -0.010261720046401024
    ]
}