{
    "id": "KLUmBwpKnwU",
    "title": "Is VAIO BETTER without Sony?? - Vaio SX12 Laptop",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-12T00:42:39Z",
    "video_url": "https://www.youtube.com/watch?v=KLUmBwpKnwU",
    "category": "People & Blogs",
    "tags": [
        "Sony",
        "Vaio",
        "Laptop",
        "Intel",
        "10th Gen",
        "Mobile",
        "Notebook",
        "1080p",
        "battery",
        "dell",
        "xps"
    ],
    "views": 693535,
    "likes": 22462,
    "comments_count": 1640,
    "description": "VAIO was a big name in the computer world with Sony, but in 2014 they separated... how does it hold up today?  Buy Vaio SX12 On Amazon (Paid Link):  On Walmart (Paid Link):   Buy Dell XPS 7390 On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/k5EY",
        "https://geni.us/ld89",
        "https://geni.us/Cb0Gdqa",
        "https://geni.us/IBBn4vW",
        "https://geni.us/CqtyW",
        "https://geni.us/HZIWWQT",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- So this is about Max moving around. - [Man] Can you undo that top button? - Undo like this one? No, we're not doing that. - That's... All right, that's fine- - Undo the top button, yes. - That's way better. - Looking for better audio. This right here is the Sony... This right here is the not Sony VAIO SX12. So you're probably thinking where has VAIO been for the past, I don't know, since I think it was 2014 when they stopped existing, kind of. Well, they've been slowly, you know, making their own laptops. Apparently when they broke up, they wanted to get away from like general consumer stuff and into more like bleeding edge high-end stuff. So here we have it, the VAIO SX12, what is apparently the thinnest laptop in the world that has a six core processor. I'm not totally sure why that's a necessary thing to know but, you know, let's see how it goes. So the box I would say it looks really great. Very, I don't know. It's black. It says VAIO on it. There we go. And it's in a little bag. I actually quite like this box, but let's see how the laptop... Oh, cool. So it's just, you know, a nice matte black little laptop. There isn't a whole lot about the outside besides... Holy crap. Those are a lot of ports. So I was looking at originally, I thought like, did they just copy the design from 2014? And like, that's why it has so many ports, like freaking VGA right here. But it turns out no. Even like when they stopped producing VAIO laptops, they didn't have anywhere near this many ports. Like it was just, I think there was a HDMI and two USBs here. Whereas now we have VGA, ethernet, HDMI. That has a Thunderbolt sign. Yes. So we have Thunderbolt and then USB-A and SD card full-size. On the other side we have, wow, another two USB Type-As, a headphone port and that's about it, power in. So we have a power cord, kind of an old school style one where they have, you know, the barrel connector. It doesn't appear to have USB-C type charging. Thank you for purchasing our new VAIO PC. Well I didn't purchase it. But, you know? The VAIO PC now in your hands has successfully completed the Azumino Finish. All essential elements focusing on inspira... What else we got here? Startup guide. We can probably figure that ourself. All right, well, I guess we just get right into the laptop here. Hopefully it has power. And here we go. Over the keyboard they have what feels like a microfiber cloth. It's actually quite nice. So it does have the cool kind of hinge you see it on some Asus laptops these days or I think that old VAIO ones did as well, where it's flat on the table, but then as you lift it up, it creates a small gap between the table and you know, the bottom of the laptop. This will be good for two things. So for one, it'll be much nicer for your hands where, you know, you'd have the slight inclination while you're typing, which should make typing for long periods of time a little bit easier. And also, you know, it has a six core processor in it. So it's gonna need lots of air getting in there and just shoot it out and, you know, heat everything up besides hopefully the processor itself. Looks like that we also have Windows Hello right up there. And I think there's a fingerprint. Yeah, there's a fingerprint reader right here. So, getting into it should be pretty simple. Oh, oof! This trackpad, look at that. This right here has to be the smallest trackpad I've seen in nearly a decade I would say. This is frigging tiny. This laptop is nearly $1,900 and, yep, it is really light. But I don't know, it's quite plasticky kind of around here for what you would expect from something that's $1,900. Here We have the last gen XPS 13. So these right here are identically specced machines. Although the Dell comes in at $50 less and has a 4K touchscreen as opposed to, I believe it's a 1080p. Yeah. No touching at all here. As far as the actual screen quality goes, unsurprisingly the 4K display on the Dell is just sharper and generally better. But I don't care about that too too much like the 4Kness of it, because like, you know, 1080p on a 13 inch display, I need to get what? Here before I can start seeing pixels at all. And I'm not using this computer that close. You'd probably be looking more at using it like right around here somewhere. I want to say nice things about this computer 'cause overall, like, I don't think it's all that bad from what I've been using besides this trackpad. It's abominable. Every time that I go to do something it's just so terrible. And you can't even be like, oh, it's fine because you know, you can use the touchscreen. But there is no touchscreen option. You just have to use this. Come on guys. So for one thing, there's no like press to click. That isn't necessarily a deal breaker, but you just kind of expect it these days. It has these super duper small little right click, left click guys that for one, they just don't feel great. Like the snap isn't very great. You can kind of see where I push it, there's a lot of mush before you actually get into the click. Anyway, back to the keyboard here. (keyboard clicking) Hmm. It feels kinda bouncy almost, not so much the keys but just sort of the whole chassis underneath it. It's pretty, not fantastic. You can really feel it when you're clicking down any of the keys that the whole deck is flexing, which even though these might be good keys, I have no clue. It doesn't really matter if you don't have the chassis flex. But, oh, look at that up there. Are you able to see? This is just me pressing the keys and the whole deck is flexing. So if you compare that to the XPS here, this is as hard as I can push. You do see some flex and it's, there's barely anything 'cause you know, this thing is made of carbon fiber and magnesium. Whereas this right here, bit on the plasticky side for sure. 1900 bucks and you have that. We haven't gotten to the fun bit yet though. So, it does have that six core processor. Let's see how it does with a little Blender render. F12. I wouldn't expect it to be able to do anywhere near max turbo the whole time. Like if I had to guess we'll probably be sitting at about 2.6 gigahertz but... Oh, it's already at 94 degrees. We're down to 2.3 gigahertz. As far as the speed goes, ah, it's not great given how long it's been going. About this Dell here, just as a little comparison. Let's just, it's not the same task. We're not going to really drag race these two. I don't have the power brick for this one. But I just want to see how loud it gets in comparison. Although this is definitely a bit on the loud side, I'd say that, given that it's like six cores and something that's of this size, it's really not bad. Like we're not getting like the Razor Blade whine or anything. So far the Dell is silent, but I don't think that will last very long. Anyway, on the VAIO it seems to have, you know, leveled out somewhere around 2.2, 2.3 gigahertz, which isn't all that bad. But it's not incredible. I think the Dell might be at max speed, but I just can't really tell because of how much louder the VAIO is. All right, we're not gonna complete this render 'cause it's taking half a while. It's able to hold. It's thermal is pretty good. Like it has leveled out around 85-87 degrees thereish while doing 2.2 gigahertz switches. I would say very acceptable for a machine of this size. As for the sound, it's definitely on the higher end. Although I wouldn't consider it unacceptable. Like this Dell is so much quieter. You can barely hear it. Even though the fan are really giving air. Going back to the overall just size of this machine though, I can't get over the number of ports. Like we have said, I don't know, it doesn't feel amazing. But it also doesn't feel bad. Like as far as flex in this direction, there's almost none. As far as screen wobble, almost none. Like I would consider that very good. The screen flex it's a bit on the flexy side, but again, totally acceptable. Like, okay, this is way stiffer. But it doesn't really matter. You're not doing this all day. This is... Okay, the Dell is way better as far as general build quality goes. But it's also a lot heavier. Yeah. So let's see what the actual difference is between these two. We've got like 850 grams. That is frigging light. This one right here is about 1200 or so. That's you know, a good what? 400 gram difference. You're going to notice that in your backpack. Like I can just, tossing these around really feel it in my hands. But I don't know. The VAIO might be one of the most disappointing laptops I've used in quite a while. It's so light. It has so many ports and somehow is really thin. Like is it thinner than the XPS? Well, of course it is. They said that... Oh no, it isn't. They said that it was the thinnest six core, but looking at, it's not. It's really not. But it's really close. It's within a couple millimeters. And for the price that they're commanding, this right here should be carbon fiber and this needs to be bigger. So like my recommendations are like this whole keyboard needs to come up a couple centimeters. That will give you more space for your palms to rest and also like the key thing is just more space for this trackpad 'cause it is unacceptable. And then maybe make the whole top carbon fiber. And that would allow you to, you know, not notice that kind of, oh, so much flex. What else can we see here? Oh, I wonder how the speakers are? It already sounds a little bit crushed, but it's not too too bad. (upbeat music) There's no base at all. I wouldn't really expect there to be much of bass in this, but you know, it's low enough that I would say it's a bit disappointing. \"Crab Rave\". Let's see what it sounds like on the XPS. (upbeat music) There's no comparison. So I don't know how to feel about this. Everything that I remember from VAIO was just very high quality and this given the price, I don't know it just doesn't really stick the landing. It has the ports, it has the size and like the feel and look, I have to say is pretty good. But I don't know. The build quality and this trackpad is just inexcusable. There's no way that you can use a trackpad like this and not have a touchscreen in 2020. Like, I don't know. They just need to go back to the drawing board a bit and figure that one out. Anyway, get subscribed, hit like or whatever, the bell. See ya.",
    "transcript_keywords": [
        "VAIO",
        "Dell",
        "kind",
        "bit",
        "laptop",
        "feel",
        "ports",
        "Sony VAIO",
        "VAIO laptops",
        "trackpad",
        "good",
        "undo",
        "laptops",
        "XPS",
        "producing VAIO laptops",
        "bad",
        "flex",
        "thing",
        "lot",
        "core"
    ],
    "transcript_entity_values": [
        "half",
        "Crab Rave",
        "USB Type-As",
        "94 degrees",
        "XPS 13",
        "VGA",
        "400 gram",
        "4",
        "Thunderbolt",
        "one",
        "USB",
        "850 grams",
        "a couple millimeters",
        "1900 bucks",
        "Max",
        "VAIO",
        "1,900",
        "about 1200",
        "Blender",
        "XPS",
        "about 2.6 gigahertz",
        "max",
        "nearly a decade",
        "13 inch",
        "2020",
        "Windows",
        "2.2 gigahertz",
        "Razor",
        "Sony",
        "these days",
        "HDMI",
        "Asus",
        "2.2",
        "two",
        "a couple centimeters",
        "1080p",
        "2.3 gigahertz",
        "nearly $1,900",
        "2014",
        "F12",
        "85-87 degrees",
        "4Kness",
        "XPS",
        "SD",
        "six",
        "50",
        "Dell"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE",
        "NORP",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG"
    ],
    "vector": [
        -0.05528036132454872,
        -0.022678585723042488,
        -0.014982043765485287,
        -0.06158967316150665,
        0.05096157640218735,
        0.07829035073518753,
        0.009145972318947315,
        0.05176892876625061,
        0.01827801950275898,
        -0.024319181218743324,
        0.051181674003601074,
        0.07882095873355865,
        -0.04631238058209419,
        -0.011989506892859936,
        0.05976911634206772,
        -0.05698878690600395,
        0.10505274683237076,
        -0.006272525526583195,
        0.028812488541007042,
        0.028388679027557373,
        0.03533394634723663,
        -0.029526744037866592,
        0.007534774485975504,
        -0.002307344228029251,
        0.0876459851861,
        0.04103347286581993,
        -0.001971674617379904,
        0.01185159757733345,
        -0.10168898105621338,
        -0.05071127042174339,
        -0.10649019479751587,
        0.07067307829856873,
        0.03099256195127964,
        -0.024403700605034828,
        0.007731856312602758,
        -0.05783240497112274,
        -0.007604856044054031,
        -0.03033122420310974,
        0.017007650807499886,
        -0.08420440554618835,
        -0.077557772397995,
        -0.007022755686193705,
        0.011638863943517208,
        -0.013395536690950394,
        -0.04983239620923996,
        -0.0018841366982087493,
        0.06593859940767288,
        -0.07927399128675461,
        0.02425958402454853,
        0.030708909034729004,
        0.010044122114777565,
        -0.03466420993208885,
        0.07878722995519638,
        0.028270740061998367,
        -0.08634970337152481,
        0.05226987600326538,
        0.005278505850583315,
        -0.008092890493571758,
        0.020544495433568954,
        -0.024437960237264633,
        0.03323349356651306,
        -0.10829047113656998,
        0.034790292382240295,
        0.07724763453006744,
        -0.0036673357244580984,
        0.004763885401189327,
        0.02907651476562023,
        -0.061292000114917755,
        -0.07458047568798065,
        0.00747993029654026,
        -0.02094515785574913,
        0.09660448133945465,
        0.009369155392050743,
        0.049578651785850525,
        -0.03879913315176964,
        -0.0033770613372325897,
        0.0691528171300888,
        -0.010749024339020252,
        0.04285372048616409,
        -0.00023367501853499562,
        0.06003262847661972,
        -0.031035946682095528,
        -0.08318053930997849,
        0.02744339592754841,
        0.022040657699108124,
        0.06431211531162262,
        0.019428079947829247,
        -0.015801100060343742,
        -0.011413076892495155,
        -0.14495442807674408,
        -0.07086203992366791,
        0.015514431521296501,
        0.03495188057422638,
        -0.020796651020646095,
        0.007203790359199047,
        -0.087623730301857,
        -0.010183501988649368,
        0.037247829139232635,
        -0.03505272790789604,
        0.02954348921775818,
        0.09615308791399002,
        0.005988475400954485,
        0.08151042461395264,
        -0.08287015557289124,
        -0.012031189166009426,
        0.007306966464966536,
        -0.06014571338891983,
        0.08524096012115479,
        -0.04414016753435135,
        -0.009966446086764336,
        -0.1149534359574318,
        0.0784745141863823,
        0.023782620206475258,
        -0.0189846009016037,
        -0.009232018142938614,
        0.09711417555809021,
        -0.02150259166955948,
        0.030337542295455933,
        0.034805916249752045,
        -0.025809666141867638,
        0.017974738031625748,
        -0.09652924537658691,
        -0.08127804845571518,
        0.009132296778261662,
        -0.026648979634046555,
        -0.051621414721012115,
        -0.06126486137509346,
        2.743075393374326e-33,
        0.00896554533392191,
        0.07367727160453796,
        0.01712493598461151,
        -0.09230132400989532,
        0.019003428518772125,
        0.056549396365880966,
        0.022224482148885727,
        0.06167968735098839,
        -0.10217393934726715,
        0.04383646324276924,
        -0.06511082500219345,
        -0.027892867103219032,
        -0.04617777839303017,
        -0.007081715855747461,
        0.03225071355700493,
        -0.03132547810673714,
        -0.037419188767671585,
        -0.020557373762130737,
        -0.0766122117638588,
        -0.02406497858464718,
        0.08440215140581131,
        0.013777018524706364,
        0.0356777124106884,
        0.004541766829788685,
        -0.032092440873384476,
        0.04263269156217575,
        0.016292812302708626,
        -0.019700312986969948,
        -0.010256065987050533,
        0.020286038517951965,
        -0.11832766234874725,
        0.013323110528290272,
        0.027445735409855843,
        -0.0434659905731678,
        -0.02657640166580677,
        -0.012866864912211895,
        -0.028862077742815018,
        -0.06125010922551155,
        0.048111818730831146,
        -0.11934844404459,
        -0.021020639687776566,
        0.16875843703746796,
        -0.10182593762874603,
        -0.11253319680690765,
        0.00080621347296983,
        0.0009427830809727311,
        -0.043508924543857574,
        -0.008704024367034435,
        0.006937282159924507,
        -0.017257722094655037,
        -0.058025624603033066,
        0.017646310850977898,
        0.026697862893342972,
        -0.013207034207880497,
        0.00985900778323412,
        -0.024084586650133133,
        0.06464327871799469,
        0.12458862364292145,
        0.02614229917526245,
        0.07765281200408936,
        0.1583116203546524,
        -0.008627663366496563,
        0.032481174916028976,
        -0.025745293125510216,
        -0.08291131258010864,
        0.15112431347370148,
        0.09149151295423508,
        0.0362304225564003,
        0.023653974756598473,
        0.017496934160590172,
        -0.01985524222254753,
        0.02427012473344803,
        -0.035240113735198975,
        -0.02316492237150669,
        -0.053463079035282135,
        -0.009038373827934265,
        -0.10511703044176102,
        -0.06799976527690887,
        0.05034263804554939,
        0.004734362941235304,
        -0.0066242339089512825,
        -0.02655711956322193,
        -0.040479760617017746,
        0.040021348744630814,
        0.020940130576491356,
        -0.022786878049373627,
        -0.011474947445094585,
        -0.04642752557992935,
        -0.04923808574676514,
        0.033117953687906265,
        -0.01476985402405262,
        0.0365167036652565,
        -0.03207756578922272,
        0.03891143947839737,
        -0.004122524987906218,
        -4.766164537631832e-33,
        0.008992766961455345,
        -0.03647191822528839,
        0.03923780098557472,
        0.0014681614702567458,
        -0.0855572298169136,
        0.04507816210389137,
        0.01586737670004368,
        -0.00030446992604993284,
        0.003118908265605569,
        -0.018895646557211876,
        0.01833253540098667,
        0.033886730670928955,
        -0.041440244764089584,
        -0.022907594218850136,
        0.026385560631752014,
        0.023913726210594177,
        -0.004124652128666639,
        -0.13665691018104553,
        0.0091467946767807,
        -0.02948005683720112,
        0.043408844619989395,
        0.05815289914608002,
        0.002834059065207839,
        0.018680380657315254,
        -0.07968153059482574,
        -0.002382629783824086,
        -0.030765004456043243,
        0.040504954755306244,
        -0.02127087675035,
        -0.005850081332027912,
        -0.045326340943574905,
        -0.08012324571609497,
        -0.04982630908489227,
        -0.007704142481088638,
        0.09164582192897797,
        -0.011138557456433773,
        0.014607039280235767,
        0.039780065417289734,
        0.06194744259119034,
        0.0030509307980537415,
        0.006918126251548529,
        0.06313028186559677,
        0.013771300204098225,
        -0.013786152005195618,
        0.011037791147828102,
        -0.035537201911211014,
        -0.10877937823534012,
        -0.0420592837035656,
        0.043974488973617554,
        -0.033997680991888046,
        -0.008271293714642525,
        -0.06328629702329636,
        -0.020862296223640442,
        0.007795691955834627,
        -0.04949594661593437,
        0.019539184868335724,
        -0.11893080919981003,
        -0.008955495432019234,
        0.024160286411643028,
        -0.050622936338186264,
        -0.025564776733517647,
        0.019523553550243378,
        -0.07304678112268448,
        -0.037471529096364975,
        -0.04559548944234848,
        0.05483635142445564,
        -0.0057133776135742664,
        0.018843229860067368,
        -0.026221709325909615,
        -0.014201419427990913,
        -0.053503938019275665,
        -0.016956022009253502,
        -0.025583678856492043,
        -0.03434491530060768,
        -0.03648381680250168,
        0.06866918504238129,
        -0.062107570469379425,
        -0.041335057467222214,
        -0.041239652782678604,
        -0.04940509423613548,
        -0.030019059777259827,
        -0.04076560586690903,
        0.01673095114529133,
        0.02508234977722168,
        0.014672018587589264,
        0.0496954545378685,
        -0.018537504598498344,
        -0.03285744786262512,
        -0.01408966351300478,
        -0.009014066308736801,
        -0.04134726896882057,
        0.01748303696513176,
        0.019656158983707428,
        0.016098791733384132,
        -0.04407869279384613,
        -5.531090252475224e-08,
        -0.005652217660099268,
        -0.02906699851155281,
        0.06127263978123665,
        0.05217356979846954,
        0.02204601839184761,
        -0.04950810596346855,
        0.001986153656616807,
        0.10220316052436829,
        0.10550370067358017,
        0.01763617806136608,
        0.06734233349561691,
        -0.03837250918149948,
        0.027162956073880196,
        0.03622439503669739,
        -0.011161510832607746,
        0.07957236468791962,
        -0.05460745468735695,
        0.10038388520479202,
        0.004278599284589291,
        0.027396908029913902,
        0.0038375884760171175,
        0.04253850877285004,
        0.11933384090662003,
        0.00514761870726943,
        0.06893258541822433,
        0.002659951336681843,
        -0.05488291755318642,
        0.014809354208409786,
        0.06877875328063965,
        -0.0394686758518219,
        -0.052112482488155365,
        -0.03418640047311783,
        -0.002438904484733939,
        -0.039317939430475235,
        0.009442347101867199,
        -0.014422403648495674,
        -0.05718919634819031,
        0.03247831389307976,
        0.0171356163918972,
        -0.06559757888317108,
        0.06539935618638992,
        -0.08617041260004044,
        -0.048528410494327545,
        0.0681954100728035,
        0.06205134093761444,
        0.024760019034147263,
        0.013163458555936813,
        -0.09138348698616028,
        -0.05822589993476868,
        -0.022748779505491257,
        -0.051282163709402084,
        0.011193833313882351,
        0.014748415909707546,
        0.04735761880874634,
        0.057612206786870956,
        0.013391143642365932,
        -0.01943775825202465,
        0.0747096836566925,
        -5.6969620345626026e-05,
        0.06561671942472458,
        0.11159270256757736,
        -0.052674807608127594,
        -0.0596308633685112,
        0.08739812672138214
    ]
}