{
    "id": "KMdQkz5ID_E",
    "title": "Tech We DON'T Want to Come Back",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-03-31T16:07:27Z",
    "video_url": "https://www.youtube.com/watch?v=KMdQkz5ID_E",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 179062,
    "likes": 5399,
    "comments_count": 336,
    "description": "There is a lot of tech we miss...just not these ones I bought Apples BIGGEST mistake:  The WORST Tech at Hot Topic:  The WORST Phones:  PS5 Pro CONFIRMED:  The WORST Pro Controller:   Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Lynaugh  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:11 Internet Explorer 1:16 3D TVs 2:23 Xbox Kinect 3:11 Phone Chargers 4:01 VHS Tapes 5:37 Windows 8 6:15 Hoverboards 7:37 QuiBi (Quick Bites) 8:48 CDs 9:47 MapQuest 11:07 BitConnect 11:48 Juicero 12:45 RED Hydrogen One",
    "description_links": [
        "https://youtu.be/x3pmg6Hj6cc",
        "https://youtu.be/2-a6AUnrpVw",
        "https://youtu.be/Cz4L09CUoSE",
        "https://youtu.be/rGQHdBUa4pE",
        "https://youtu.be/nGmQkiMGuoE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello and welcome to This Is. We've seen plenty of tech we wish would come back, but what about the tech that we are so glad is dead buried and gone? - [Austin] I'll get the shovel, let's go. - Let's see what we got up first. - Internet Explorer. You know what? I could not be happier to say goodbye Internet Explorer. Have you been replaced in spirit by Edge, which is a also Microsoft browser. Yes, but unlike Edge, which is actually a good browser Internet Explorer, was not only not a good browser Internet Explorer held the entire internet back for years - And they did it dirtily. They basically just stole the source code from Mosaic, one of the first browsers. - Look, Microsoft as a company would never steal code or ideas, like Xerox. - The FTC had to come in and be like, nah. - Well the thing was this became so dominant that entire industries, like you said, were really built on Internet Explorer. And mind you, at the time when basically it was the only browser anyone used, it peaked at 95% browser share, which is an insane figure today. This was, while not initially horrible, right? I mean I don't think anyone would just say Internet Explorer was just a bad browser. - Well it good because there was was nothing else. - Exactly. Like you can't just be good because you kill everyone else around you. That's being like, I'm the most popular person on the island cause I murdered all my survivors. - Is this not the plot of Lord of the Flies? - I don't know. - 3D TVs, after avatar, which for the record, I'm not a fan of Avatar. Yeah, yeah, it's, - Avatar's not a good movie. - Tech I don't want to come back as Avatar three. There was a spew of 3D TVs. - Spew is a great way to describe that too - Every like and you had to have awful, - [Both] 3D everywhere! - You had to wear the doofiest looking glasses. It made you look like Austin Evans. Who wants to spend a hundred dollars to cosplay as Austin Evans just to see - Lots people Matt. - 3D in your living room. - So many people want that. While not a terrible idea. And now mind you, I don't want to just poo poo 3D. 3D can be cool. We saw at CES this year Asus showed off a laptop that was a completely normal laptop with the great OLED display. The 3D was terrific. It was not hurting your eyes - It was the best. - Right. - But like 3DS everyone hated it so much that they just made the 2Ds - I never turned it on. We're saying that we don't want the 3D TVs with the glasses and all the nonsense. I'm happy if beautiful, wonderful 3D displays have one downside. - I don't feel like the girl from the ring is coming out of my TV to just be like, \"Hey.\" (creepy music playing) The Kinect. - I miss Kinect, I want Kinect to come back. Kinect is good. You say your thing and I'll tell you why you're wrong. - Fine from now on, you have to put a listening device in your office at any given time and I have complete access to it. That was the Kinect - That's not the Kinect, okay Let me pitch you on why the Kinect was good. Cash your mind back to the late 2000's. The Kinect was a actually an impressive sensor that would not only do audio and video tracking but importantly would actually give you full 3D so you could use your body as a controller. Now yes they did over hype it especially with the E3, the project the tall video where they showed some kids scanning a skateboard that never worked. But what did work was a lot of fun games and especially while the Kinect for 360 was good. - Name several games that aren't Just Dance. - Just Dance 2. - Yeah. - Just Dance 3. - Yeah. - Just Dance 4. - Yeah. Yeah. Kinect, I salute you, and never come home. - The wild west of phone chargers. - This is fine. We can get rid of this one. - You had the family and like each had like a different phone or whatever. You had this hydra of phone chargers and they were all different bricks. Some of them were barrel connectors some of them were 30, 40, 80 pins. Like why? - It was insane, like - It wasn't even from brand to brand. - The fact that we are now basically on USB-C for everything, the iPhone's really the last holdout and even that's almost gone. - You know what was actually good about these though? As much as I hated all the plugs here. - Yeah. - The adjustable adapters I did like. - Ew - Radio Shack sold about 50 different connectors for it. - Yeah. - And some of them were for like Nokia and what not. - Yeah. LG - Yep. - There's no reason to be different. We all should be square pegs and square holes and the world should be colorless and the work should continue and everything should be standardized and the same and there's no room for individuality. Okay - Okay. - Kenzie, this is a violation. Okay? - Kenzie! - This is not okay. - This is what happens when we hire a zoomer. - Basically the video you're watching right now after a number of months will actually end up on our side living on magnetic tape called LTO, which is a distant cousin, but the same sort of premise as VHS, right? But essentially, - Yeah - This was really the first major way for you to watch movies at home. At this time, you basically had two options. You could watch something on TV. you could watch something at a theater. - Oh, you're forgetting the awesome third option, which was laser disc! - I didn't forget that, because that is dead and should stay dead. VHS was great. Now mind you, I think Netflix should be canceled. I think HBO should be shut down and I think that Hulu is a disaster. I think that instead they should go back to mailing us VHS's. I bought a VCR a few years ago. Look straight up. - We both have VCRs. - A couple years ago I was at a yard sale and some dude was selling his VCR for five bucks. I bought it, sat in my garage and then got rid of it. - The one piece I don't miss about VHS, is having to rewind the tape. - Yeah. - Before you went back to Blockbuster. - Yeah. - And if you didn't they would fine you. This was such an annoying thing that you used to go and be able to buy tape rewinders. - Yep. - Well why not just use the VHS? Well what if I wanna rewind tapes while watching something in my VHS? It was a whole industry that we killed when VHS went the way of the buffalo. - If you want the unreleased Overclock videos throughout the years, subscribe and ringling the dingling button and you too will be notified when Austin's super cool secret VHS of videos that no one will ever see online is finally on sale. The problem is it's gonna be expensive though cause getting that many VHS's - Yeah - Was a whole thing - We need to change the title now to Tech We Wish would come back, but not all of it. - Windows 8. What can we say about Windows 8 - Nothing good. - That hasn't already been said about basically the entire NFT market, it's bombed out and depleted - If you are a zoomer who's never used a computer before. Windows 8 was just Windows 7, but worse. So this was designed with touchscreens in mind. It also came out alongside the first Surface which was running RT and that was a whole separate thing. The problem with Windows 8 was it took all the good stuff with Windows 7, slapped a bunch of ugly stuff on. Windows 8 was just bad and there's a reason why almost all the things they brought in for Windows 8 they got rid of for Windows 10 and now Windows 11. It just was bad, is bad, remains to be bad. - Hoverboards, apparently these are still a thing. - These are still a thing. - Have you ever felt like riding around on a ticking time bomb? Well hoverboard. - I actually have two good hoverboard stories cause this is 2015, a good year for Austin Evans. One of which is, I won a hoverboard race, which I'm gonna continue to brag about forever. I beat certain elite cadre of tech youtubers cause I was faster and I cheated. On top of that, there was a moment on a hoverboard. we were shooting on a hoverboard and someone fell backward and almost cracked a head straight across on concrete when the hoverboard flipped and did the wrong thing. So someone almost died on a shoot using a hoverboard. Now to be fair, a lot of our problems with the hoverboard are much more so with the idea that you know, they're dangerous you're going to fall off. But the real danger with this was the things would catch on fire. Not like \"oh little fire\" like they would explode while you're riding them because they had super (explicative) batteries. It completely tainted the market, right? Where everyone just looked at hoverboards and thought that these are magical whizzbang gadgets and gizmos that would randomly catch on fire and light little Timmy's feet on singed exploding fireness. - So he'd catch on fire and then fall over and crack his skull open. - There you go. That's his hoverboard experience. (long beep) That's all I have to say. - I don't know - Hoverboards, look, hoverboards are super fun - I don't always have a transition. - Wait, you have transitions? - Ready for this transition? - Star wipe. - Quibi. - How do you wanna pitch Quibi? Because this is a complicated story full of nuance, intrigue and piles of money being lit on fire. - I did not use the Quick Bite thing. - It was called Quibi, not Quick Bites. - It was short. - So the way this worked was, so cash your mind back. So this launched in 2020 right as a pandemic is really hitting. So everyone was trapped at home wanting to watch Netflix and there's a huge boom in streaming services. Everyone was just piling money into these services cause they're all convinced it was the next big thing and Quibi decided to go about it a very different way. They went mobile first so all these shows could be watched vertical or landscape but on top of that, they had poured over a billion dollars of funding into the company and they had paid all kinds of top tier content. Not licensed, not original. Oh no, no. It was just a bunch of celebrities who made generic town TV shows. The good thing with Quibi is that it lasted less than a year with a billion dollars in the bank. They shut down a mere eight months after they launched and basically said, \"Hey oops.\" - This is the exact reason why the Silicon Valley Bank collapsed was because Quibi was most of their investments. - Not true, but true spirit. - Makes just as much a sense as anything else in Silicon Valley. - Moving on - CDs more like CDs nuts. (\"Gottem\" sound effect) - Matt I'm not getting you anything for that one. - What! - You get zero points for a CDs nuts joke. CDs unlike VHS's added no analog charm. There's a reason why 2023 is the year that CDs have been dethroned by vinyl. There are more vinyl sales than CDs - But they have such richer tones brah. - The problem with CDs is that as a digital format there is no advantage over just streaming it. Now mind you, yes CD quality was technically a little bit better than what you get on like Spotify or whatever. - How much time have you wasted trying to scroll through looking for the song you want? Whereas with the CD, I had my solid 10 CDs here. - It's called a playlist. - Yeah - Spotify has those. - And I want my 10 songs I listened to, it was just ready there. We had the shuffle feature on a CD player. I never knew what song was gonna come next. - Vinyls are cool. I will say cassettes are still kind of cool. CDs literally have no point in existing in 2023. I'm just gonna say it. - MapQuest. - All right. - Technically MapQuest is around, but if you're still using it, you're probably my parents. So, this launched in 1996 and it was the first ones to the game. - It's important to consider that not too long ago, Zoomers. There was no Google Maps, there was no Apple Maps. - No we just had maps - You had literal paper maps. If you were gonna go from point A to point B you needed to learn the route. You needed to know where you were going. And having MapQuest was a huge win. Matt, do you remember the days where you can go and visit someone's house and you didn't know where it was and you couldn't just go through on your phone like, oh, text me. You go, oh, okay. What's your address? - Go down the road and you'll take a left at the barn. If you see the other barn, you've gone too far. The road's gonna make a little bit of a jaunt. You take a fork at the left you'll double back if you hit the gas station just ask Jerry for some directions there, because I don't know how to get the rest of the way. - This is a real thing. While I don't miss it, because obviously Google Maps and all the maps that we have right now are far superior. This is an important step. Imagine, right? You're in the post apocalyptic world, and you're trying to find your cousin, your brother. Imagine how easy you would be if you had a MapQuest direction printed out. cause guess what? Your GPS ain't gonna work anymore. Joel, you gotta go pull out your MapQuest to figure out how to make it to Montana. - I used to live one mile away from the office. I would still use GPS. - That's sad Matt. - I didn't know where to go. - bitconnect. - No, no, no. [Both Screaming] biconnect!! bitconnect was a currency that launched back in 2016 and this was the new hotness. bitconnect is the hottest pyramid scheme this side of a cryptocurrency you've seen since it collapsed shortly after. You wanna make 100% per month. All you need to do is convince a bunch of your friends to also invest in this Ponzi scheme and you too will be rich if you get out at the right time and screw everyone else who got in later. Boy, what a great idea. This went from $463 to 40 cents a coin, and as long as you got out before it got to the top and didn't get arrested along the way, you were home free! [Both Screaming] Bitconnect! - The Juicero. What? - A $400 juicer machine from 2016. - The idea with Juicero, is that this was a hip new way to deliver yourself some juice, right? You know you've got like Keurigs you've got these little pods that you put in the machine, it'll make you some coffee or tea or whatever. Who wants to go and spend $63 on a juice from Jamba Juice? Not me. Instead, I'd like to spend $61 per pack on Juicero. They again raised 120 million dollars. But the way that they made all that money was they pitched this thing being internet connected. Not as DRM or anything, but purely to let you know if your juice had expired and you had to throw it away and therefore get some new ones. It was also expensive. It had an incredible mechanism that would juice the pouches with four tons of force, which is important because people quickly realized you could just take these pouches and just go, (squeeze motion) - Having never played with this, I just immediately said why not just squeeze hand? - What if we squeeze hand underneath the Juicero machine - The Red Hydrogen One? - Let's go. - Are you a potential cinematographer in the land of Holly-Weird. Then I have the phone for you right here. - Can I tell a story? - Yeah. - The Red Hydrogen One was a device sold by the Red company, who make a variety of expensive cinema cameras for douche bags. - Also sunglasses. - Red was a company who was very much based on hype. In the middle of all this hype Red realize there are only so many suckers who will spend $50,000 on a camera which is gonna break after three to six months. This ARRI company with their Alexas that are super expensive please, who wants good customer support and a camera that actually works when you can oversell people on 74 K pixels and all kinds of other stuff. - Marques is gonna gonna bust in here and smash your face with a Frisbee. - The next move was to create a smartphone and to bring that Red patented technology and emphasis on the patent, because believe me, I say they like their fair share of lawsuits. They brought this out to a phone. It had a holographic display, which I went to the launch event of. The first time I saw the screen, I was like, \"is that a prototype?\" And they go, \"no, it's great, isn't it?\" I was like, that looks worse than 3Ds. Mind you, the final shipping models were slightly better but slightly. These things looked bad and the main reason why you would buy this is because they've pitched it. So you'd be able to swap out on the back to an actual like Red cinema camera grade sensor. You could put better lenses on it. - This was weirdly ribbed for no one's pleasure. - Look, there's a lot of things I wish would come back. Literally. This is on the bottom of the list but thank you very much for watching this episode of This Is Subscribe and ringling, the dingling button for the secret Austin VHS cut. And until next time Matt, I'm gonna switch all our cameras to Reds. - No!",
    "transcript_keywords": [
        "Internet Explorer",
        "browser Internet Explorer",
        "good browser Internet",
        "Yeah",
        "good",
        "VHS",
        "Kinect",
        "thing",
        "Internet",
        "back",
        "Windows",
        "Explorer",
        "hoverboard",
        "browser Internet",
        "Red",
        "goodbye Internet Explorer",
        "Internet Explorer held",
        "Austin Evans",
        "CDs",
        "mind"
    ],
    "transcript_entity_values": [
        "zero",
        "Joel",
        "three",
        "Frisbee",
        "Reds",
        "less than a year",
        "Asus",
        "NFT",
        "2",
        "a hundred dollars",
        "Hulu",
        "ringling",
        "about 50",
        "Ponzi",
        "2023",
        "One",
        "hydra",
        "Google Maps",
        "Juicero",
        "Edge",
        "Microsoft",
        "MapQuest",
        "Zoomers",
        "Keurigs",
        "HBO",
        "2015",
        "Windows 10",
        "Quibi",
        "third",
        "Windows 8",
        "Kinect",
        "Windows 11",
        "DRM",
        "50,000",
        "Matt",
        "2020",
        "Austin",
        "the Silicon Valley Bank",
        "four tons",
        "this year",
        "Netflix",
        "Timmy",
        "first",
        "a mere eight months",
        "10",
        "1996",
        "Kinect",
        "three to six months",
        "30",
        "E3",
        "FTC",
        "the late 2000's",
        "a number of months",
        "Explorer",
        "a billion dollars",
        "Silicon Valley",
        "61",
        "five bucks",
        "2016",
        "100%",
        "ARRI",
        "a good year",
        "one mile",
        "3Ds",
        "Kenzie",
        "74",
        "A couple years ago",
        "400",
        "USB-C",
        "LTO",
        "the year",
        "RT",
        "2Ds",
        "Juicero",
        "463",
        "CES",
        "Austin Evans",
        "one",
        "3D",
        "80",
        "Austin VHS",
        "Mosaic",
        "95%",
        "MapQuest",
        "today",
        "Nokia",
        "Alexas",
        "Spotify",
        "Internet Explorer",
        "over a billion dollars",
        "VHS",
        "a few years ago",
        "years",
        "the years",
        "Montana",
        "3",
        "no Apple Maps",
        "2023",
        "120 million dollars",
        "Xerox",
        "two",
        "63",
        "Windows 7",
        "40",
        "iPhone",
        "Jerry",
        "Kinect",
        "Jamba Juice"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "MONEY",
        "LOC",
        "MONEY",
        "MONEY",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "FAC",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "FAC",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "ORG"
    ],
    "vector": [
        -0.07421878725290298,
        -0.0033061013091355562,
        0.11961415410041809,
        -0.0838313177227974,
        0.08067874610424042,
        -0.021226191893219948,
        0.11454284191131592,
        0.008332896046340466,
        0.0009684649994596839,
        0.017584366723895073,
        0.06621485203504562,
        0.02114884927868843,
        0.11542076617479324,
        -0.04999910667538643,
        -0.01575477235019207,
        -0.00629535922780633,
        0.005168250296264887,
        -0.10846048593521118,
        -0.05580715462565422,
        0.004664469510316849,
        -0.05361069366335869,
        0.051104895770549774,
        -0.03551003709435463,
        0.04081134498119354,
        -0.03306746110320091,
        0.09502259641885757,
        -0.024850575253367424,
        -0.04581661894917488,
        -0.1421649307012558,
        -0.05988799408078194,
        -0.09665200859308243,
        0.08734080195426941,
        -0.0266741830855608,
        -0.03789198398590088,
        0.028010603040456772,
        -0.03553183376789093,
        0.004978911951184273,
        -0.023773984983563423,
        -0.024886226281523705,
        -0.08920754492282867,
        -0.03287392482161522,
        -0.0386962927877903,
        0.012348363175988197,
        0.08364828675985336,
        -0.005249205511063337,
        -0.027998602017760277,
        0.03974711894989014,
        -0.14572206139564514,
        0.050622474402189255,
        -0.01098553091287613,
        -0.006684469990432262,
        -0.008916731923818588,
        0.08086108416318893,
        -0.03882284089922905,
        -0.0020877502392977476,
        0.00975014641880989,
        0.07868388295173645,
        0.06741193681955338,
        0.08877506852149963,
        0.02445279434323311,
        -0.008867880329489708,
        -0.090931236743927,
        -0.0732528492808342,
        -0.008836344815790653,
        0.008175340481102467,
        -0.04451150819659233,
        -0.014771007001399994,
        0.00621053297072649,
        -0.007389298640191555,
        0.05485711991786957,
        -0.050241921097040176,
        0.0326089970767498,
        0.06648017466068268,
        0.08505851030349731,
        0.046054285019636154,
        0.001749070012010634,
        0.048993196338415146,
        -0.04854505509138107,
        -0.020163724198937416,
        0.009622257202863693,
        0.06846455484628677,
        -0.0429576151072979,
        -0.07068882882595062,
        -0.021021686494350433,
        -0.05029413849115372,
        0.03388793393969536,
        -0.014113901183009148,
        -0.003167958464473486,
        -0.004614599980413914,
        -0.08541076630353928,
        -0.09853220731019974,
        0.016658315435051918,
        0.10207251459360123,
        0.0242287777364254,
        0.03183206543326378,
        -0.056576699018478394,
        -0.030969714745879173,
        -0.05671355128288269,
        -0.04982428252696991,
        0.08600617200136185,
        0.03977392613887787,
        0.031623516231775284,
        0.044686537235975266,
        -0.010591821745038033,
        -0.015546782873570919,
        -0.04929539933800697,
        -0.08231108635663986,
        0.055919062346220016,
        0.03420421853661537,
        0.02271224558353424,
        -0.02046968974173069,
        -0.024316949769854546,
        -0.04941188916563988,
        0.007727654650807381,
        0.03647283464670181,
        0.021549485623836517,
        -0.02439497411251068,
        0.07392434030771255,
        0.03680447116494179,
        -0.037915583699941635,
        -0.015370529145002365,
        0.03483547642827034,
        -0.051066428422927856,
        -0.025432053953409195,
        0.07053358852863312,
        0.015747079625725746,
        -0.04535601660609245,
        3.313468415076494e-33,
        0.007952279411256313,
        0.12628322839736938,
        -0.012523683719336987,
        0.06903759390115738,
        0.013187920674681664,
        -0.014686591923236847,
        -0.003180455882102251,
        0.04562728479504585,
        0.05096808820962906,
        -0.0037256779614835978,
        -0.023327652364969254,
        0.0676964595913887,
        -0.05784008651971817,
        -0.01340177096426487,
        0.08072588592767715,
        -0.060182034969329834,
        -0.02770298533141613,
        -0.055393487215042114,
        0.0011236381251364946,
        -0.04465614631772041,
        -0.027381297200918198,
        0.041997719556093216,
        0.01959756389260292,
        -0.037221793085336685,
        0.00101703021209687,
        0.01852978952229023,
        -0.02084023877978325,
        -0.01900394819676876,
        0.08493854105472565,
        0.01217377558350563,
        -0.0914902314543724,
        0.03336925059556961,
        0.088661789894104,
        -0.0004830434045288712,
        0.023221727460622787,
        -8.111396164167672e-05,
        -0.002349053742364049,
        -0.08282556384801865,
        0.01806706190109253,
        0.002448354847729206,
        -0.07502410560846329,
        0.06902632862329483,
        -0.09647508710622787,
        0.008671150542795658,
        0.10758636891841888,
        -0.03597669303417206,
        0.06476150453090668,
        -0.011979302391409874,
        -0.012734120711684227,
        -0.008183308877050877,
        -0.03905270993709564,
        0.01309422217309475,
        0.09881215542554855,
        -0.002606714377179742,
        -0.04217534884810448,
        -0.04962916299700737,
        -0.018486691638827324,
        0.023812804371118546,
        0.042338669300079346,
        0.02555174194276333,
        0.08341088891029358,
        0.061319392174482346,
        0.06734751909971237,
        -0.020457589998841286,
        -0.04870476573705673,
        0.04407395049929619,
        0.08689247071743011,
        0.040629979223012924,
        -0.03790328651666641,
        0.07573968917131424,
        -0.06541255861520767,
        0.0035914613399654627,
        -0.02942342683672905,
        -0.05331910029053688,
        -0.0039015349466353655,
        0.10096351057291031,
        -0.02457834780216217,
        -0.06417517364025116,
        -0.007095283828675747,
        -0.039786841720342636,
        -0.034829169511795044,
        -0.05639253929257393,
        -0.07124178856611252,
        0.020559145137667656,
        0.12771326303482056,
        -0.0022867610678076744,
        0.03725716471672058,
        -0.08987121284008026,
        -0.01828904077410698,
        0.0483933761715889,
        -0.05152739956974983,
        -0.014789084903895855,
        0.0016607674770057201,
        0.04993993788957596,
        -0.05117113143205643,
        -4.945368284072705e-33,
        0.02219686098396778,
        -0.05995062738656998,
        -0.011409303173422813,
        0.02144434303045273,
        -0.0191844142973423,
        -0.1245371624827385,
        0.030575664713978767,
        0.012217545881867409,
        -0.008559590205550194,
        -0.01897590234875679,
        0.02172599732875824,
        0.006447419989854097,
        0.017883921042084694,
        -0.02930343709886074,
        0.004309207201004028,
        -0.04001149907708168,
        -0.021552488207817078,
        -0.05913859233260155,
        -0.005424174480140209,
        0.019490065053105354,
        0.02551579661667347,
        0.056759752333164215,
        -0.10870859771966934,
        0.062267549335956573,
        -0.05590289458632469,
        0.0319468192756176,
        -0.010722186416387558,
        -0.005167536903172731,
        0.03587909787893295,
        -0.028251947835087776,
        0.005305950529873371,
        -0.07771163433790207,
        -0.004517979454249144,
        0.06268800795078278,
        0.08428557962179184,
        0.03912130370736122,
        0.05726196616888046,
        0.004775951616466045,
        -0.023651573807001114,
        -0.020655885338783264,
        0.027873696759343147,
        -0.020349452272057533,
        -0.019436532631516457,
        0.00855613686144352,
        -0.023987721651792526,
        -0.012903069145977497,
        -0.021555723622441292,
        0.039590466767549515,
        0.006439025979489088,
        0.04098616912961006,
        0.07976393401622772,
        -0.021853726357221603,
        -0.021333470940589905,
        -0.04453178495168686,
        -0.06737428158521652,
        -0.04625849798321724,
        0.0393931046128273,
        0.012110978364944458,
        0.018043246120214462,
        0.04654892906546593,
        0.027658933773636818,
        -0.05254834517836571,
        -0.0037019660230726004,
        0.007638908457010984,
        -0.037993550300598145,
        0.016817009076476097,
        0.1311970204114914,
        0.11980428546667099,
        -0.0767994076013565,
        -0.008805631659924984,
        0.01128208264708519,
        0.02690686099231243,
        -0.06158435344696045,
        -0.13958783447742462,
        -0.001077116234228015,
        0.058954931795597076,
        -0.03673050180077553,
        -0.002847950905561447,
        -0.04518221318721771,
        -0.007296777796000242,
        0.025588558986783028,
        0.057145074009895325,
        0.022318430244922638,
        0.006641509477049112,
        0.060286056250333786,
        0.025663698092103004,
        -0.0068443091586232185,
        0.05403953045606613,
        0.012021337635815144,
        -0.06181659549474716,
        -0.05956549569964409,
        -0.05518902838230133,
        0.02116340398788452,
        0.047911450266838074,
        -0.09621370583772659,
        -6.851834655208222e-08,
        0.005878849420696497,
        0.03260958939790726,
        0.007665001787245274,
        -0.03206244856119156,
        0.10852504521608353,
        -0.03395486995577812,
        -0.04551157355308533,
        0.0698934867978096,
        0.02076982520520687,
        0.03182271122932434,
        0.0020972811616957188,
        -0.016118189319968224,
        -0.08983736485242844,
        0.05063946917653084,
        0.09840629249811172,
        0.13500246405601501,
        -0.08031925559043884,
        0.005966645665466785,
        -0.026072675362229347,
        -0.0494280643761158,
        -0.027949651703238487,
        0.02700727805495262,
        0.028969641774892807,
        -0.025187024846673012,
        -0.009053722955286503,
        -0.014898699708282948,
        -0.06134168058633804,
        -0.03091190569102764,
        0.07432281225919724,
        0.01523937750607729,
        -0.040710363537073135,
        -0.06284942477941513,
        -0.08804689347743988,
        -0.02287812903523445,
        0.01287794392555952,
        -0.06288016587495804,
        0.034782011061906815,
        0.00650709168985486,
        0.030660774558782578,
        0.0044439444318413734,
        -0.05557135120034218,
        -0.02393387258052826,
        -0.07362104952335358,
        0.04968538507819176,
        -0.08096305280923843,
        -0.06545750796794891,
        -0.044865984469652176,
        -0.019611671566963196,
        -0.06187775731086731,
        -0.033994410187006,
        -0.03678421676158905,
        -0.0543179027736187,
        0.0011820767540484667,
        0.033335428684949875,
        0.06324011087417603,
        0.025976350530982018,
        0.0026421721559017897,
        -0.01215960644185543,
        -0.07012666761875153,
        0.062257736921310425,
        0.05888688564300537,
        -0.04927463456988335,
        0.037782590836286545,
        0.03711264207959175
    ]
}