{
    "id": "KnBEeReqrsk",
    "title": "Building My New Streaming PC",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-04-21T18:02:38Z",
    "video_url": "https://www.youtube.com/watch?v=KnBEeReqrsk",
    "category": "Science & Technology",
    "tags": [
        "streaming pc",
        "gaming pc",
        "streaming on twitch",
        "gaming computer",
        "gaming pc build",
        "ryzen 2",
        "ryzen 2700x",
        "amd",
        "pc gaming",
        "ryzen",
        "pc build",
        "fortnite",
        "pubg",
        "gaming",
        "nvidia",
        "austin evans"
    ],
    "views": 869115,
    "likes": 22782,
    "comments_count": 1832,
    "description": "For streaming games like Fortnite on Twitch and YouTube Gaming this PC build is ready to go. AMD Ryzen 7 2700X on Amazon:  Asus Crosshair VII Hero motherboard on Amazon:  16GB G.SKILL TridentZ RAM on Amazon:  EVGA NVIDIA GeForce GTX 1070 graphics card on Amazon:  500GB Samsung 960 EVO SSD on Amazon:  4TB WD Black hard drive on Amazon:  Blackmagic Intensity Pro 4K capture card on Amazon:  Corsair 570X case on Amazon:  750W Corsair RM750X power supply on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/ryzen2700x",
        "http://austin.tech/crosshairvii",
        "http://austin.tech/tridentz16",
        "http://austin.tech/evga1070",
        "http://austin.tech/960evo",
        "http://austin.tech/wdblack4tb",
        "http://austin.tech/intensitypro",
        "http://austin.tech/corsair570x",
        "http://austin.tech/rm750x",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, this is Austin and today we're building a streaming PC. So we've done a lot of gaming PC builds over the years but something you guys have always asked for is a dedicated streaming box and what we're going to be doing today actually has three different criteria. So first of all we need a computer that can actually play games. The idea here is that not only do we wanna be able to stream from this, but we also wanna be able to play the games on it and stream all from a single PC. The second criteria is, well, it actually has to be good at streaming. So my goal my goal is to be able to play at 1080p 60 and to be able to stream to places YouTube Gaming and Twitch at 1080p 60. Thirdly, we actually need to be able to stream from other consoles as well as record. So a lot of times when we're doing videos, especially when we're not even going to do livestreaming, we need to get some gameplay from stuff like a PS4 or even some older consoles and right now we have to pull out another laptop, a bunch of capture equipment, it's kind of a pain. However, with this PC in addition to be able to stream, we are also going to be able to capture gameplay. So let's actually see what we've got for the system. So these are the brand new AMD second generation Ryzen processors. Now AMD was awesome enough to actually hook us up with this to be able to do a video on but there's a actually a lot of reasons why you might wanna pick up a Ryzen processor for a build like this. You guys will probably be familiar with first generation Ryzen. So this came out last year and it really kind of changed the desktop PC scene. However, with the second generation AMD Ryzen seven desktop processors it's going to be, well, just a little bit better. To be honest, it's not gonna be a huge difference but what we should expect is a little bit more performance for about the same price, so who's going to complain about that? First of all we have Ryzen 5 2600X. So this is going to be the six core 12 thread processor or we can go all out with Ryzen 7, this is going to-- (clears throat) This is going to be the eight core 16 thread part which we are going to be using for this streaming build. Now to go along with the Ryzen processors, we also have this giant Velcro box? (chuckles) I love that AMD goes completely all out on their press kits. We also get the Asus ROG Crosshair 7 Hero, which is going to be another X470 motherboard and judging by the heft, this is a (chuckles), gonna be a big one and last but not least, we have a kit of GSKILL SniperX, which is going to be 16 gigs at DDR3400, so something actually that is important to keep in mind with Ryzen processors is that memory is important. For the most part, most memory's going to be compatible but faster memory is actually going to make a fairly sizeable difference. Whereas a lot of times on an Intel chip, it's gonna be a small thing. It's mostly like going from single to dual channel but with Ryzen, this kind of fast stuff actually does make a big difference. So fast forward a bit and we have the completed build ready to go and as you can see, there's a lot of RGB. Now, to be totally honest with you, I think once we actually get this a little bit more dialed in, I'm probably gonna get it a little bit less flashy but it looks good on camera and that's the important part. So this is the Corsair 570X case. Now the main star of the show here really is going to be the tempered glass. So not only do we have a glass side panel but the top, the rear, as well as the front are all completely made out of (knocking) tempered glass. And I've gotta say, especially paired with all the RGB and the thankfully pretty decent looking cable management, thanks to the actual room in the case, I think it looks pretty nice. Take off the side panel and what you'll see is that the case actually is not going to be too busy inside, I mean, seriously, with a build like this normally I would want to go for something like an all-in-one loop or even like just a bigger air cooler but considering that this comes in the box, I really have no complaints. It's going to be more than enough for what we need. So in addition to that Asus Crosshair motherboard as well as the 16 gigs of G Skill memory we also do have an EVGA GTX 1070. Now because this is going to be a streaming setup that is aimed at 1080p gaming and I had a 1070 laying around and didn't want to have to go buy a 1080 or something, I think this should be more than good enough and as you guys will see here in a little bit, for gaming performance at 1080, this has more than enough power. For storage, we have a 500 gigabyte Samsung 960 Evo SSD. Now as an entry drive, it's going to give us plenty of performance and 500 gigs should be enough for our games, for Windows, programs, and that kind of stuff with plenty of overhead but on top of that because we are going to be doing a lot of gameplay recordings with this guy, we do also have in the back a four terabyte WD Black hard drive. Now, this is where all the recordings are going to live at least until we actually need to go edit it and then we're gonna use USB to sort of dump it out to the editing PC. As far as actual capture goes, that should be pretty much all we need. Now, down here the only thing that is not black, and matte, and RGB, and cool is our Blackmagic Intensity Pro 4K. Now this is just simply an internal capture card. So, around back we have a pair of HDMI ports as well as we have a multitude of analog inputs so if we do wanna hook up an older console, we can record with this guy but the idea here is that we actually have a single system that is going to be able to not only capture gameplay that we're actually playing on the system, but we can capture from those external consoles, PCs, pretty much whatever else we have. This entire setup is being powered by a 1000 watt Corsair RM1000. Now 1000 watt power supply is wild overkill for this system considering it's probably gonna be pulling well less than 500 watts, however, I had it lying around and so it had the nice modular cables and, you know, why not? No, no, I have real reasons. When we upgrade to another 1070 and overclock the Ryzen processor, I'm never gonna do any of this. It's gonna be totally fine stock because I'm literally just needing to place of a 1080. I just like the idea of making it more RGBed and more ridiculous when really I'm trying to be conservative and build something that's reasonable. So first up we have an easy one, Rocket League. And, of course, here at 1080p on max settings we're getting a solid 220 frames per second. So, you know, it's gonna be playable but importantly we also do have support for ShadowPlay. So with a single keyboard command we can get a nice, clean recording of the gameplay as well. Of course, we can also stream it too but plenty of performance for a game like this. So while we wait for PUBG to update, like it always need to do when I need to film a video, this actually is a good time to talk a little bit about why I'm using Ryzen 7 as opposed to a lower end Ryzen or something like a Core i5 or i7 and that is entirely due to the fact that we've got eight cores and 16 threads to work with. Now, we can definitely get away with a lot less if we were just doing gaming but the idea that we're going to be streaming or recording on top of that the extra head room does make a big difference. As you can see we have, well, it's just nice to look at lots of threads. So, now that PUBG has been updated, what we're getting here is, as you'd expect, a pretty solid experience. So, again, 1080p ultra settings. Right now just running around this little prison yard, we're getting a solid 100 frames per second and this actually is a good time to mention that I am playing on a higher refresh rate monitor. Not that that really matters for streaming but it actually does make it a little bit better for, well, you know, playing the game. This is the ultimate camouflage, being naked in the desert. (laughing) They'll never see me coming. Next up, we have Fortnite because what else would we be playing in 2018? So, I've got full epic settings at 1080p and we're averaging around 100 frames per second. What's different this time is that we are streaming at the same time so this is the exact same feed on YouTube Gaming and it's going to be a full 1080p 60 frame. You can see it's gonna be maybe a few seconds delayed but it's actually a surprisingly clean looking signal. We're really not going to be losing a lot of quality while still getting a super playable game and that's really the beauty of a system like this. So if I was going to be a hardcore dedicated streamer, I would have a separate PC to be able to get the maximum performance out of the one that I'm using to play the game but the performance overhead really isn't bad with a system like this. We have plenty of cores, we have a more than powerful enough GPU, which means that I can easily play the game, stream it all at once, and not really see any kind of serious performance penalty. So that is our brand new streaming PC. As always, I'll have links to everything we used in the description of this video. You may want to make some changes, like a different power supply, considering that that's total overkill. But for the most part I actually do think this is going to be a pretty reasonable set up and I'm excited to get some streaming going in the future. Anyway, guys, thank you so much for watching and I will catch you in the next one.",
    "transcript_keywords": [
        "Ryzen",
        "Ryzen processors",
        "generation AMD Ryzen",
        "streaming",
        "lot",
        "stream",
        "Austin and today",
        "bit",
        "AMD Ryzen",
        "generation Ryzen",
        "generation Ryzen processors",
        "gaming",
        "performance",
        "Austin",
        "play",
        "AMD",
        "system",
        "pretty",
        "capture",
        "guys"
    ],
    "transcript_entity_values": [
        "six",
        "100",
        "570X",
        "AMD",
        "Velcro",
        "three",
        "ShadowPlay",
        "AMD Ryzen",
        "Thirdly",
        "YouTube Gaming",
        "Windows",
        "less than 500 watts",
        "2018",
        "1080",
        "first",
        "220",
        "Ryzen",
        "eight",
        "Core",
        "USB",
        "Samsung",
        "Austin",
        "RGB",
        "Ryzen 5 2600X.",
        "a few seconds",
        "AMD",
        "PS4",
        "Rocket League",
        "four",
        "12",
        "the years",
        "Ryzen 7",
        "Asus Crosshair",
        "one",
        "WD Black",
        "Ryzen 7",
        "second",
        "GSKILL",
        "1080p 60",
        "RGBed",
        "around 100",
        "Corsair",
        "16",
        "Intel",
        "500",
        "Fortnite",
        "DDR3400",
        "1080p",
        "Twitch",
        "last year",
        "1000 watt Corsair RM1000",
        "Ryzen",
        "7",
        "1000 watt",
        "Blackmagic Intensity Pro",
        "max",
        "EVGA GTX 1070",
        "seven",
        "960",
        "GPU",
        "today",
        "First",
        "Ryzen"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "LAW",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "LAW",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "GPE"
    ],
    "vector": [
        0.019158784300088882,
        -0.047621022909879684,
        -0.010936259292066097,
        -0.018380777910351753,
        0.045715831220149994,
        0.06517355889081955,
        -0.013413402251899242,
        -0.026685960590839386,
        -0.01338125392794609,
        0.03651132434606552,
        -0.10431266576051712,
        -0.03523080423474312,
        -0.025965923443436623,
        -0.025657514110207558,
        0.004071434028446674,
        -0.0077643138356506824,
        0.12073711305856705,
        -0.061285700649023056,
        -0.03156515583395958,
        0.013217968866229057,
        0.008642075583338737,
        -0.07889017462730408,
        -0.0615120567381382,
        -0.027338393032550812,
        -0.04914594814181328,
        0.05132940411567688,
        0.09375905990600586,
        0.04535435885190964,
        0.0038437233306467533,
        -0.039094824343919754,
        0.0812864601612091,
        -0.03801301494240761,
        -0.001648890902288258,
        -0.0008972853538580239,
        -0.017123650759458542,
        -0.07949918508529663,
        0.014622622169554234,
        -0.1466994434595108,
        -0.09800725430250168,
        -0.061398040503263474,
        0.040420837700366974,
        -0.004784674383699894,
        -0.014796040952205658,
        0.09427159279584885,
        -0.02579154446721077,
        0.003584772115573287,
        0.026308277621865273,
        -0.057950276881456375,
        0.021729053929448128,
        -0.010218746960163116,
        -0.038948338478803635,
        -0.05320823937654495,
        0.025012684985995293,
        0.013786353170871735,
        -0.09987424314022064,
        0.009541787207126617,
        -0.008186752907931805,
        -0.0779382660984993,
        0.05176156386733055,
        -0.04244273528456688,
        0.05097411945462227,
        -0.12827068567276,
        0.07976529747247696,
        0.032945550978183746,
        -0.02400352992117405,
        -0.026661094278097153,
        -0.0150027796626091,
        0.10880269855260849,
        0.058971356600522995,
        -0.004572446923702955,
        0.0103729497641325,
        0.030836407095193863,
        0.01969539001584053,
        0.012457809410989285,
        -0.01353621669113636,
        -0.0044822790659964085,
        0.06266199052333832,
        -0.06036732718348503,
        0.0047693075612187386,
        0.07178305089473724,
        -0.0135952765122056,
        -0.020257797092199326,
        -0.056850600987672806,
        -0.06810916215181351,
        0.009845960885286331,
        0.026390157639980316,
        0.007171464152634144,
        0.010557059198617935,
        -0.045710448175668716,
        -0.05897526815533638,
        -0.01911742426455021,
        0.05895170196890831,
        0.13737991452217102,
        0.031997088342905045,
        0.011220631189644337,
        0.027729889377951622,
        0.008624684996902943,
        -0.11021284759044647,
        -0.06435954570770264,
        0.007028388790786266,
        -0.018448662012815475,
        0.0381181463599205,
        0.10510910302400589,
        0.044095478951931,
        -0.02585754357278347,
        -0.03922365978360176,
        -0.07199157029390335,
        0.14910879731178284,
        0.010134580545127392,
        -0.07939259707927704,
        -0.07370271533727646,
        0.030356362462043762,
        -0.05902460217475891,
        0.03981202095746994,
        0.02813837118446827,
        0.07529131323099136,
        -0.07725272327661514,
        0.010077118873596191,
        0.043175749480724335,
        0.026198238134384155,
        0.03737855330109596,
        -0.02744491957128048,
        -0.0025217344518750906,
        0.03566115349531174,
        0.08362020552158356,
        0.022433629259467125,
        -0.06761660426855087,
        1.144946485253881e-32,
        0.030805766582489014,
        0.040287017822265625,
        -0.04799947515130043,
        -0.010100348852574825,
        0.010009980760514736,
        0.029221434146165848,
        0.02149369567632675,
        0.013332339003682137,
        -0.0627061128616333,
        0.006091116461902857,
        -0.04012438282370567,
        0.03619508072733879,
        -0.05112072452902794,
        0.10241695493459702,
        0.04876432940363884,
        -0.10664109140634537,
        -0.03994785621762276,
        -0.03301181271672249,
        0.05404331907629967,
        -0.029599590227007866,
        0.07025404274463654,
        0.0031312014907598495,
        0.01017407700419426,
        -0.03524675592780113,
        0.012442760169506073,
        -0.044173140078783035,
        -0.054445888847112656,
        -0.04998381808400154,
        0.11214473098516464,
        0.02157660759985447,
        -0.07746756076812744,
        -0.06137126311659813,
        -0.04652518779039383,
        -0.03955685719847679,
        0.09162507951259613,
        -0.05568594112992287,
        -0.057112835347652435,
        -0.0808459147810936,
        -0.048443105071783066,
        0.0294664166867733,
        0.0008648260845802724,
        0.03846355900168419,
        -0.10759595781564713,
        -0.06662853062152863,
        -0.036262646317481995,
        -0.04465925320982933,
        0.02302619442343712,
        -0.007974839769303799,
        -0.049314599484205246,
        0.0032005892135202885,
        -0.038850657641887665,
        0.05660601332783699,
        0.029416026547551155,
        -0.02290448173880577,
        0.020116159692406654,
        -0.07784279435873032,
        -0.016362369060516357,
        0.046419546008110046,
        0.14062155783176422,
        0.030316239222884178,
        -0.013356621377170086,
        -0.06333810091018677,
        -0.030558845028281212,
        0.004388156812638044,
        -0.07922469079494476,
        0.03354005888104439,
        0.10453823953866959,
        0.046016622334718704,
        -0.026777727529406548,
        -0.02008959650993347,
        0.00618007080629468,
        0.015534952282905579,
        0.08088747411966324,
        -0.009539240971207619,
        0.0523257739841938,
        0.06616979092359543,
        -0.04436113312840462,
        -0.052757278084754944,
        -0.026181969791650772,
        -0.005339857656508684,
        -0.021527346223592758,
        0.025895366445183754,
        -0.04603832960128784,
        0.08511261641979218,
        0.030217647552490234,
        0.05300934240221977,
        0.021930623799562454,
        0.01847311668097973,
        -0.015718627721071243,
        -0.028848422691226006,
        -0.04339975118637085,
        0.023317329585552216,
        0.04590529203414917,
        0.01150423102080822,
        0.02005389891564846,
        -9.667566026905921e-33,
        -0.024460328742861748,
        -0.058740340173244476,
        -0.021928690373897552,
        0.07108622789382935,
        0.09050020575523376,
        -0.03872082754969597,
        0.05442940443754196,
        -0.042905185371637344,
        0.06939878314733505,
        -0.06994841247797012,
        -0.024937821552157402,
        -0.023261183872818947,
        -0.011452560313045979,
        0.016947703436017036,
        -0.0781695619225502,
        -0.06152823567390442,
        -0.006680843885987997,
        -0.08050189912319183,
        0.021728109568357468,
        -0.0463242270052433,
        -0.01365519780665636,
        0.031344443559646606,
        -0.02297249250113964,
        -0.09369933605194092,
        0.04364468529820442,
        0.04996572434902191,
        0.023722389712929726,
        0.0018855356611311436,
        -0.028858495876193047,
        0.04838930070400238,
        0.033080555498600006,
        0.022765256464481354,
        -0.032209377735853195,
        0.0023410115391016006,
        0.006686483509838581,
        0.03526397794485092,
        0.13031338155269623,
        0.09840389341115952,
        -0.03147429600358009,
        -0.01767435483634472,
        0.04665875434875488,
        0.010190038941800594,
        -0.01686183176934719,
        -0.011097717098891735,
        0.07973968237638474,
        0.06737077236175537,
        -0.03507210686802864,
        -0.030995870009064674,
        0.025226952508091927,
        0.017386581748723984,
        -0.008751940913498402,
        -0.03360721841454506,
        -0.0006224779062904418,
        -0.02992400713264942,
        -0.0012323691044002771,
        -0.13574813306331635,
        0.01301658060401678,
        0.053943999111652374,
        0.042752619832754135,
        -0.010595324449241161,
        0.06017906963825226,
        -0.01920858956873417,
        -0.009715380147099495,
        -0.03454000875353813,
        0.007004460785537958,
        -0.05115896835923195,
        0.0338636115193367,
        0.08043327927589417,
        -0.031117118895053864,
        -0.031093858182430267,
        -0.08986078202724457,
        -0.051769550889730453,
        -0.01137964241206646,
        -0.0175675917416811,
        -0.015998993068933487,
        0.08325188606977463,
        0.034781359136104584,
        -0.01656920462846756,
        0.040863197296857834,
        0.022778093814849854,
        -0.09395824372768402,
        0.03753713145852089,
        0.027079151943325996,
        -0.04278039559721947,
        0.09901910275220871,
        0.006135324481874704,
        0.0352647639811039,
        -0.026384536176919937,
        0.021736405789852142,
        -0.1017516553401947,
        -0.038810327649116516,
        0.03782220184803009,
        -0.05345927178859711,
        0.016156958416104317,
        0.0005760377389378846,
        -5.636094613237219e-08,
        0.0006397408433258533,
        -0.04200868681073189,
        -0.029033822938799858,
        0.05733701214194298,
        0.04548689350485802,
        -0.02429598942399025,
        0.0199956726282835,
        -0.06564804911613464,
        0.11459271609783173,
        -0.04351146146655083,
        0.064936563372612,
        -0.07876332104206085,
        -0.026899999007582664,
        -0.025887133553624153,
        0.009538009762763977,
        0.04004573076963425,
        -0.031655699014663696,
        0.01815827004611492,
        0.012178169563412666,
        -5.8930847444571555e-05,
        0.0010559704387560487,
        0.050559647381305695,
        0.038642510771751404,
        0.026851654052734375,
        -0.03385372459888458,
        -7.801170431775972e-05,
        0.06915262341499329,
        -0.029150497168302536,
        0.054084084928035736,
        -0.033483631908893585,
        0.00047473597805947065,
        -0.013895286247134209,
        0.04383543133735657,
        -0.07700410485267639,
        0.08096971362829208,
        -0.05849882587790489,
        -0.03210639953613281,
        0.12321431189775467,
        0.022990962490439415,
        0.0376286655664444,
        -0.008659632876515388,
        -0.06814472377300262,
        0.03801397234201431,
        -0.05955555662512779,
        0.010691436938941479,
        -0.019973674789071083,
        -0.1140255481004715,
        -0.009302562102675438,
        -0.03217914700508118,
        0.03205274045467377,
        -0.01790468767285347,
        -0.04076438024640083,
        0.006850824691355228,
        0.06572051346302032,
        0.15048272907733917,
        -0.02689485065639019,
        0.03443841263651848,
        0.012880495749413967,
        0.008005596697330475,
        -0.014470983296632767,
        0.057242315262556076,
        -0.04438181594014168,
        -0.05681375414133072,
        0.036400992423295975
    ]
}