{
    "id": "ks86a6Xtvmo",
    "title": "this Electric Truck is full of Garbage...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-06-30T13:43:00Z",
    "video_url": "https://www.youtube.com/watch?v=ks86a6Xtvmo",
    "category": "Howto & Style",
    "tags": [
        "Electric garbage truck",
        "Electric truck",
        "tesla truck",
        "garbage truck",
        "big truck",
        "big rig",
        "tractors",
        "real tractors",
        "excavator",
        "dump truck",
        "cars",
        "toy truck",
        "tractors working",
        "garbage bin",
        "what happens to garbage",
        "electric refuse truck",
        "electric trucks",
        "big trucks"
    ],
    "views": 443886,
    "likes": 24986,
    "comments_count": 1238,
    "description": "Have you ever wanted to drive a garbage truck? Visit:  to get 50% off your first month of any Kiwico subscription! Huge thanks to Kiwico for sponsoring this video. I have always wanted to drive a garbage truck. It just seemed like a lot of fun to use the big robotic arm to dump the trash into the big bin and take it all to the landfill. Today we get to drive a garbage truck and see what happens to all the trash we throw away.   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.Kiwico.com/JerryRig",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Music playing] This is the biggest vehicle I've ever driven. [Laughing] That's cool! [Music playing] Ever since I was a little kid I've wanted to drive a garbage truck with the massive robotic arms that can just pick things up and dump it in the back. It just looked really fun. Behind me is Utah's first 100% electric garbage truck. And Ace Recycling and Disposal has graciously allowed me to come take it for a spin. This video is sponsored by KiwiCo. Let's get started. [Intro] The driver's seat is on the opposite side of where it normally is. If Little Jerry could see me now he'll think I've definitely peaked in my career. So first time inside of a garbage truck and there are so many buttons in here. Take a look. And I am by no means an expert in any of this, but this is how we control the robotic arm. We'll see how good at that I am in a second. But other than that, everything looks pretty standard even though this is a top of the line electric vehicle. We have our air conditioning, we have our radio. We have an emergency kill switch. This button right here switches from an air horn to an electric horn. [Honking sound] And then this one...air horn. [Honking sound] Whoa! This control here is actually something special and I'll mention that in a second. There are four external cameras that we can see on this screen. This is where we dump the garbage, side views, and rear view. And it looks like there are a few more additional cameras in the back. One thing that I think is really interesting though is that it does have these analog dials with a digital display behind it, which is interesting. This electric garbage truck has a top speed of 65 miles an hour and a range...the range is a little more complicated because we have the massive robotic arm on the side, which we'll get to in a second. If you were to just drive in a straight line, the truck would have about a 200 mile range. But if you're doing a lot of starting and stopping and using the robotic arm, you can get about 60 miles with 600 pickups. Speaking of which, I think it's time to try out the robotic arm. Foot on the brake, turning the ignition. Alright, I'm nervous. Okay! So parking brake, pushing down to release. Oh, safety first. Oh man, I'm nervous. Okay, so then I go into drive. Oh boy. Yes! Oh boy. This is the biggest vehicle I've ever driven. Luckily we're in a big deserted parking lot so there's not a whole lot that I could mess up. Wow, this is huge. Speed bump. Okay, we've lined up some garbage cans over here on the side. Gotta get pretty close to them. So I'm within like 6 feet. Literally this is my first time ever doing this. Alright, brake. That thing just rolls forward doesn't it? Alright, it does not stop by itself. So for the mechanical arm to operate, it is all done through this joystick. As soon as I turn on the power takeoff it engages the hydraulic system for the robotic arm. And so for any of these buttons to work left or right I have to pull this trigger. I can hear the hydraulics in the back, and then I can open, close, left, right, up and down. Okay it's go time. Trigger in. Woo! It's a big boy. Okay. That's crazy. Oh, I'm not even close. The brakes! Alright, and then this is...whoa! Oh boy. You can just smash the oblivion out of those things. It doesn't have a sensor...they're interesting. Bringing it in. Yikes. That thing shakes the whole truck! I'm going to go into drive. I mean it definitely feels big and heavy. I think this thing weighs about 22,000 pounds when empty, and when fully loaded it's around 66,000 pounds. It's got the turning radius of a garbage truck. Let's see what the acceleration is like, after I straighten it out. So alright, wheels are straight I think. Yeah! That's cool. I mean it's definitely not Tesla acceleration, but you can tell there's some battery power. The drive train actually has two gears, 0-30 and then it switches gears after 30. Round two, let's see if we can pick up. I did it on my first try. I grabbed that container. I did have to adjust the truck a few times. Going into reverse pulls up the rear view camera as well as starts that beeping noise for us. Just back up. I think most garbage men can do this with the mirrors. I have to stick my head out the window. Okay, arm out. Yes, it's working. Woo! Nice. The lifting arm of the truck maxes out at around 900 to 1000 pounds. If there ever is a load too heavy, the arm just won't lift it up and you'll probably get a note on your garbage bin saying you've got to empty it yourself. But the arm is very, very strong. Once the plastic garbage bin has been dumped inside the garbage truck, there is a hydraulic smoosher that scooches and compacts all the trash back into the rear portion. With hundreds and hundreds of these plastic garbage bin pick ups done every day, everything's got to get nice and compact back there. Let's take a look underneath and see what's powering this thing. An interesting thing about these trucks, if you notice the rear tires, one set is raised up off of the ground. Remember that special console inside next to the dash? When this is fully loaded it weighs 66,000 pounds, and in order to be legally street worthy it needs to be able to distribute that weight over more area, so dropping down the rear tires allows the truck to do that. You'll see the same things on dump trucks or cement trucks. Anything with super heavy payloads needs to protect the road underneath it. Let's check out the inside. That is huge. Look at the size of these hydraulic arms. That is insane. So inside the garbage truck this is actually steel plate made out of AR 500, meaning that the inside is 100% bulletproof. So if you're looking for a good place to hide during the zombie apocalypse, inside a garbage truck is actually a pretty good option. It's made out of AR 500 because the garbage truck is constantly dumping its load at a transfer facility, meaning that there's going to be a lot of abrasive materials inside. It could be concrete, it could be rocks, people's trash made up of who knows what. So the container needs to be made out of something that won't erode or wear away over time, and AR 500 would definitely do the job. With everything opened up we can get a good idea of how this works. There are two motors back there which I'll get two in a second. Behind the cab though is the battery pack. 642 volts worth made up of these 16 modules. We have two coolant reservoirs, one for the motors and one for cooling the battery packs. There are over 350 kilowatt hours of energy in the battery pack behind me, which is almost 4x what you would find in a Tesla. It lets this machine move pretty much all day. The motors are back here. The garbage truck has two axles and two motors. And since we have this big stilt right here, we're able to get underneath. This motor is capable of outputting 200 horsepower, and combined with this motor back here has over 800 pound feet of torque. It's interesting that to get access to the batteries we have to tilt the whole cab forward. So if you forget your drink inside and it's unopened, you would end up with quite the mess on the inside of your windshield. I'd like to see another electric vehicle do that. The high voltage lines are the orange protected cables, the same ones I used in my Hummer that are running to the electric motors. These ones back here are headed to the motors. The big claw is over here on this end. It's got some rubber pads on it. And the whole thing is run off of hydraulics. This is a big hydraulic tank right here with an electric motor, and it's interesting that this electric motor actually has its own drive shaft to the hydraulic pump, which then puts the liquid in the giant pistons and allows the whole bed to raise up and empty the trash at the transfer center. And I'm going to show you exactly what that looks like, but first, one way to make your trash can a little more fun is with KiwiCo. Throwing away trash is more entertaining when it's a game of trasketball. KiwiCo's mission is to provide the next generation of innovators with the tools to become creative problem solvers and critical thinkers. KiwiCo provides monthly crates that expose kids to concepts in STEAM, you know, science, technology, engineering, art, and math. They do this with fun monthly hands-on projects, like this basketball trash can that has levers, hinges, and latches. Each crate is designed by experts. My wife and I have been giving these subscriptions away to our nieces for their birthdays and holidays. You can go to KiwiCo.com/jerryrig for 50% off your first month. There are no long term commitments or contracts, just hands on fun for kids, teens, or even adults. And you can pause or cancel your subscription whenever you like. The crate includes everything that's needed, so there's no running out to get extra supplies. With kid friendly instructions and even an educational magazine, there's plenty to do ever after the project is over. You can help support the channel and have a whole lot of fun along the way at KiwiCo.com/jerryrig. I'll have a link down in the description. Nothing but net. So after the trash can is full, and the electric garbage truck has come to pick it up, what happens next? Let's go find out. As we drive to the transfer station, you might be wondering why someone would want to make an electric garbage truck in the first place since it's not lightweight or aerodynamic. But it's actually the perfect vehicle to be battery powered since electric motors are way more efficient at doing a lot of starting and stopping than gas motors are. Plus, with a set route and the ability to charge up every night, it just makes a lot of sense. That's also why there's a big push right now to electrify school buses. They also have predictable routes and electric vehicles have less moving parts which means not as much maintenance. If we lived in a smaller town this electric garbage truck would probably drive out to a landfill to dump its load. But since Salt Lake City is pretty massive, instead we'll be pulling onto the weighing platform of the transfer station. This particular transfer station handles about 1500 tons of waste every single day. Once the back hatch is unlocked the bulletproof garbage container can raise high up into the air and we can let the 20,000 pounds of compressed, smooshed up trash right out onto the transfer station floor. At this point we have two options: either someone grabs a broom and dustpan, or we can call in a huge front loader to transfer the trash into big semi trucks that haul everything away to a landfill. It's a pretty cool process. As they load up the awaiting semis, one thing I have noticed is that there always seems to be a lot of smooshing going on. If you enjoyed this video seeing where your trash goes, let me know with a thumbs up. It's right down there next to the subscribe button. And there you have it. Utah's first all electric garbage truck. I'm super excited where the future's headed. Leave any questions you have down in the comments below. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "garbage truck",
        "electric garbage truck",
        "garbage",
        "truck",
        "electric garbage",
        "electric",
        "arm",
        "back",
        "robotic arm",
        "inside",
        "trash",
        "motors",
        "thing",
        "drive",
        "lot",
        "big",
        "trucks",
        "transfer",
        "robotic",
        "garbage bin"
    ],
    "transcript_entity_values": [
        "about 60 miles",
        "642 volts",
        "first month",
        "Little Jerry",
        "like 6 feet",
        "20,000 pounds",
        "every single day",
        "around 900 to 1000 pounds",
        "over 800 pound feet",
        "Hummer",
        "Twitter",
        "around 66,000 pounds",
        "Instagram",
        "four",
        "100%",
        "two",
        "65 miles an hour",
        "hundreds and hundreds",
        "16",
        "0-30",
        "over 350 kilowatt hours",
        "Ace Recycling and Disposal",
        "AR 500",
        "about 22,000 pounds",
        "monthly",
        "600",
        "Salt Lake City",
        "Tesla",
        "first",
        "second",
        "the orange protected cables",
        "50%",
        "200 mile",
        "30",
        "One",
        "200",
        "66,000 pounds",
        "Utah",
        "one",
        "every day",
        "almost 4x",
        "every night",
        "about 1500 tons"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "QUANTITY"
    ],
    "vector": [
        -0.07795341312885284,
        0.09677204489707947,
        -0.018832672387361526,
        -0.04336569085717201,
        0.0588214285671711,
        -0.04860774800181389,
        0.10839354246854782,
        0.007528981659561396,
        -0.03222142532467842,
        0.04166209697723389,
        0.07280410081148148,
        -0.009528681635856628,
        0.050974924117326736,
        0.07715063542127609,
        -0.019893230870366096,
        -0.02003665640950203,
        0.0663205161690712,
        -0.009741055779159069,
        -0.04350842908024788,
        0.11875372380018234,
        0.04899706318974495,
        0.0540442056953907,
        0.0774279534816742,
        -0.06624355912208557,
        -0.0384674109518528,
        0.04693250358104706,
        -0.009539489634335041,
        0.018336622044444084,
        -0.10162589699029922,
        -0.1487487554550171,
        0.02998625673353672,
        0.026432720944285393,
        -0.09797759354114532,
        -0.062746562063694,
        0.10700885206460953,
        0.05242456495761871,
        0.018094295635819435,
        0.03798549622297287,
        -0.02905358374118805,
        -0.03666255250573158,
        -0.01427322905510664,
        -0.04829493165016174,
        0.06369547545909882,
        -0.09136710315942764,
        -0.0431269146502018,
        -0.023202842101454735,
        0.040677815675735474,
        -0.09054374694824219,
        0.0922052338719368,
        -0.08411886543035507,
        -0.017459508031606674,
        -0.04818446561694145,
        0.10844305157661438,
        -0.007716475985944271,
        0.028915563598275185,
        -0.08110129833221436,
        -0.01846516877412796,
        -0.04756534844636917,
        -0.03454519808292389,
        -0.032583992928266525,
        0.042226746678352356,
        0.004962283652275801,
        -0.012010334990918636,
        0.03715365007519722,
        0.025147398933768272,
        -0.021432148292660713,
        0.04759444296360016,
        -0.07543397694826126,
        -0.06982944905757904,
        -0.06089949235320091,
        -0.0646325945854187,
        -0.0020443801768124104,
        -0.02705179899930954,
        -0.01899215579032898,
        -0.02854800783097744,
        0.018426818773150444,
        0.07265329360961914,
        0.008382282219827175,
        -0.017680836841464043,
        0.034827589988708496,
        0.024698106572031975,
        0.04681424796581268,
        0.007063463795930147,
        -0.04722291976213455,
        -0.03349491208791733,
        0.05037631839513779,
        -0.0009338600793853402,
        0.06877055019140244,
        -0.02908705174922943,
        0.011465848423540592,
        -0.006381597835570574,
        0.045888908207416534,
        0.05131252110004425,
        -0.03572506457567215,
        -0.03510177135467529,
        -0.07610379159450531,
        -0.06177065894007683,
        -0.036463551223278046,
        -0.04853112995624542,
        0.08390151709318161,
        0.03906182199716568,
        0.023949895054101944,
        0.018730754032731056,
        -0.06696155667304993,
        0.0429501086473465,
        -0.028250491246581078,
        -0.048056021332740784,
        0.05493522435426712,
        0.011255726218223572,
        -0.015202865935862064,
        0.03761088103055954,
        0.033149342983961105,
        -0.07495478540658951,
        0.031294554471969604,
        -0.01311254408210516,
        0.025045473128557205,
        -0.11249745637178421,
        0.01156469713896513,
        0.038117703050374985,
        -0.033643774688243866,
        0.03575587645173073,
        -0.008374843746423721,
        -0.05924779549241066,
        0.04894116520881653,
        0.0731843039393425,
        0.0621725358068943,
        0.040639862418174744,
        2.356486892799554e-33,
        -0.009146985597908497,
        0.08000198006629944,
        0.04543953016400337,
        -0.01316179521381855,
        0.017956813797354698,
        -0.04260772839188576,
        -0.002623318461701274,
        0.09666737914085388,
        0.013479957357048988,
        0.04547173157334328,
        -0.016075562685728073,
        0.024463143199682236,
        -0.0018808027962222695,
        0.04197519272565842,
        -0.011669063940644264,
        -0.07105055451393127,
        -0.08976611495018005,
        -0.03698571398854256,
        -0.0021175367292016745,
        -0.03815730661153793,
        -0.03710577264428139,
        0.03843458369374275,
        0.022727947682142258,
        0.05204114317893982,
        0.06705734133720398,
        0.018673351034522057,
        -0.0026448506396263838,
        -0.0034793494269251823,
        0.08160335570573807,
        0.05183373764157295,
        -0.05978399142622948,
        0.08186767995357513,
        0.04758988693356514,
        0.05471133440732956,
        -0.035527292639017105,
        -0.0011097150854766369,
        -0.12625861167907715,
        -0.07888395339250565,
        -0.11225242167711258,
        -0.062045492231845856,
        0.029046162962913513,
        -0.01986270397901535,
        -0.12497754395008087,
        -0.02560955286026001,
        -0.05759873986244202,
        -0.055914506316185,
        0.05801042914390564,
        0.00029352863202802837,
        -0.03030654415488243,
        0.05046983063220978,
        -0.020328747108578682,
        -0.029512202367186546,
        0.021355729550123215,
        0.016522977501153946,
        -0.09489667415618896,
        0.019313117489218712,
        0.06296523660421371,
        -0.08122102916240692,
        0.026363296434283257,
        0.0006866337498649955,
        0.00022489488765131682,
        0.06064656749367714,
        -0.0033601131290197372,
        0.024115992709994316,
        -0.028937360271811485,
        -0.03853229805827141,
        0.053070131689310074,
        0.03561460226774216,
        -0.022805094718933105,
        0.01501399651169777,
        0.012287203222513199,
        -0.01869955286383629,
        0.03148139640688896,
        -0.023058367893099785,
        0.026175374165177345,
        0.02340705506503582,
        -0.04458022117614746,
        -0.0017412510933354497,
        0.0353822261095047,
        -0.05002136528491974,
        -0.007223943248391151,
        -0.009626793675124645,
        0.03462295979261398,
        -0.09021749347448349,
        0.009736819192767143,
        -0.0109482416883111,
        0.005279200617223978,
        -0.06930793076753616,
        0.03583016246557236,
        0.002430071821436286,
        -0.06396574527025223,
        0.001023411052301526,
        -0.09120102226734161,
        -0.029410606250166893,
        0.010586032643914223,
        -5.605788193671529e-33,
        0.09168408811092377,
        0.023039700463414192,
        0.02494426816701889,
        0.009963247925043106,
        0.019681500270962715,
        -0.03724205121397972,
        0.047269947826862335,
        0.01613037660717964,
        0.0348445400595665,
        -0.019918425008654594,
        -0.07900228351354599,
        0.05486537516117096,
        -0.035159412771463394,
        0.007110218517482281,
        0.14868804812431335,
        -0.06290935724973679,
        -0.03452939912676811,
        -0.0988609567284584,
        -0.06611785292625427,
        -0.013665016740560532,
        0.0030861333943903446,
        0.03947471082210541,
        0.054133616387844086,
        -0.002332448959350586,
        -0.024123653769493103,
        0.018155110999941826,
        -0.020439516752958298,
        0.00016694943769834936,
        0.04727465286850929,
        -0.0014059595996513963,
        -0.037085868418216705,
        -0.07862450927495956,
        0.03535903990268707,
        0.049635495990514755,
        -0.06004470959305763,
        -0.015725815668702126,
        0.0026786383241415024,
        0.044498033821582794,
        -0.006165511440485716,
        -0.0976092591881752,
        -0.024563735350966454,
        0.032080911099910736,
        -0.0381518118083477,
        0.05568716302514076,
        -0.07335089892148972,
        -0.16733822226524353,
        -0.040136683732271194,
        -0.042022380977869034,
        0.0468752346932888,
        0.008599546737968922,
        -0.0629187598824501,
        0.04913489520549774,
        -0.01624363847076893,
        0.0013617187505587935,
        -0.0613035187125206,
        0.05866759270429611,
        0.1124037578701973,
        -0.040963511914014816,
        0.003210516879335046,
        0.009376266039907932,
        0.004494341090321541,
        0.014710956253111362,
        -0.029631858691573143,
        0.02064814791083336,
        -0.005748991388827562,
        -0.05643409118056297,
        0.05877941474318504,
        -0.0458766371011734,
        -0.028177175670862198,
        0.0425928458571434,
        0.013882782310247421,
        -0.016429858282208443,
        0.03882777318358421,
        -0.09462790191173553,
        -0.021635977551341057,
        -0.007128735072910786,
        -0.028368648141622543,
        -0.026624232530593872,
        -0.017333127558231354,
        -0.06379137933254242,
        0.06625168025493622,
        -0.06687955558300018,
        0.03269185125827789,
        0.09624505043029785,
        0.016116037964820862,
        0.0029636500403285027,
        -0.0022171568125486374,
        0.0037474900018423796,
        -0.00041044660611078143,
        0.041814155876636505,
        -0.016417594626545906,
        -0.018754009157419205,
        0.0019972631707787514,
        0.13250575959682465,
        -0.06649107486009598,
        -6.244650307962729e-08,
        -0.009285988286137581,
        0.09924627095460892,
        -0.025348376482725143,
        -3.354201908223331e-05,
        0.04252396151423454,
        -0.01666410081088543,
        0.03996070846915245,
        0.06151987239718437,
        -0.012597540393471718,
        -0.009407979436218739,
        0.09137576073408127,
        -0.009834647178649902,
        -0.0438118502497673,
        0.08074008673429489,
        0.0027073435485363007,
        0.015313072130084038,
        0.005847383290529251,
        0.02213948220014572,
        -0.050146494060754776,
        0.013715292327105999,
        -0.08759699016809464,
        -0.07783462852239609,
        0.0005633066175505519,
        0.001360775320790708,
        -0.006137981079518795,
        0.03711019083857536,
        -0.06421443819999695,
        0.09106292575597763,
        0.06222148984670639,
        0.007817193865776062,
        -0.07259722054004669,
        0.03469039499759674,
        -0.07609714567661285,
        0.03509475663304329,
        -0.032777197659015656,
        -0.05528804659843445,
        -0.05233026668429375,
        -0.013320925645530224,
        0.008426585234701633,
        0.05240615829825401,
        0.01615883596241474,
        -0.018842145800590515,
        -0.03448711335659027,
        0.0313253216445446,
        -0.04475455358624458,
        0.022016674280166626,
        -0.08558385074138641,
        -0.10286955535411835,
        -0.04404040798544884,
        0.06258311122655869,
        -0.04270554706454277,
        -0.03320646658539772,
        -0.10031786561012268,
        0.11736809462308884,
        0.017811812460422516,
        0.05581600219011307,
        0.01924748346209526,
        -0.08086329698562622,
        -0.037315599620342255,
        0.035376034677028656,
        0.05411546677350998,
        -0.0032052479218691587,
        0.0376223586499691,
        0.009712105616927147
    ]
}