{
    "id": "Ksjr1WC9t8w",
    "title": "M1 Ultra is GAME CHANGING! New Mac Studio, Studio Display, iPad Air and iPhone SE! #AppleEvent 2022",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-03-09T01:17:23Z",
    "video_url": "https://www.youtube.com/watch?v=Ksjr1WC9t8w",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 152413,
    "likes": 7876,
    "comments_count": 609,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And what the heck just happened? The Apple event just ended. I'm kind of still freaking out. Let's go through everything that was announced leading up to the Mac Studio. Oh my God, it's so beautiful. Like I'm shaking. I was actually shaking during the event when I saw that. And then I saw that the new Mac Studio has a new studio display. Holy moly. Okay, let's just start from the beginning. First thing that they announced is two new colors for the iPhone 13 and the iPhone 13 Pro. Love that. Love that for all of us who already have an iPhone and don't need to upgrade to a new green one. But if you don't already have an iPhone 13 and your favorite color happens to be green, then today is your day. Okay, so there's also a new iPhone SE, which was one of the big rumors and it's here and it's happening. And they're taking some of the aspects of the iPhone 13 and bringing them to the SE, like the A15 bionic chip 5G. It has a glass front and back. It has an improved camera system with a 12 megapixel camera with computational photography, deep fusion and smart HDR. Of course, it has has some improved battery life. The display is a 14.7-inch retina HD display. It has a 16-core neural engine, improved video quality. It's 26 times faster than an iPhone 8 and it has three new colors. And as for a price, it is starting at $429 and pre-orders are happening this Friday. And it'll be shipping on March 18th. People love the iPhone SE mostly because it is obviously a much more affordable iPhone but it still has the touch ID. And that is super exciting. So if you are in the market for a new phone and you love touch ID, iPhone SE could be for you. Okay, now moving on to the iPad Air. I've talked about this in a couple other videos that I've been using my iPad so much more recently. And this is really exciting for somebody who is in the market for an iPad. Maybe they've never had one before, or maybe they have a much older iPad and they are looking to upgrade and they don't quite need the iPad Pro status. That's where the iPad Air comes into play. So now the new iPad Air will have an M1 chip and it will also have 5G, and in typical Apple fashion, they love comparing and giving us all kinds of specs of how much faster things are than, you know, other devices. So they said that this is gonna be faster than the fastest competitive tablet and two times fast as the best-selling Windows laptop in this price range. So that sounds good to me. It'll also have a new front 12 megapixel ultra wide camera, which will also be supporting Center Stage, which is awesome 'cause the M1 iPad Pro also has that. And I love it for FaceTime. It also will support the magic keyboard, which is so incredible because this magic keyboard has kind of changed the way that I use my iPad. It has made it more, I guess, MacBook-ish like, which is great for me be because I love this thing so much. Have I mentioned that I love my iPad. This is also kind of interesting. Like they made a little subtle mention that there is a new version of iMovie coming out next month. Like what, where did that come from? I don't know. All of us Final Cut editors are just over here like \"When Final Cut on iPad?\" I don't know. The new iPad Air will be coming in five colors, and, as per price, it is starting at $599. Okay, now we're heading into territory where I guess I should roll my sleeves up. Whenever these events happen and they, you know, kind of fly into like the basement and John's there chilling and they're like, \"All right, let's go to John in the basement.\" You know it's gonna get serious. And it got super serious. It got so serious that I was freaking out. Here we are, all thinking that we're gonna be getting the new M2 chip. We're gonna be starting this next era of M1, M2. Ha, you would think that. You would think that, right? Absolutely not. We could not be more wrong. So instead of an M2 chip, we got an M1 Ultra, which is basically two M1 Max chips, just jammed together. They said that this was a secret hidden feature that was never discussed until now. (hands banging on desk) Okay, so this new M1 Ultra behaves like a single chip to software. 114 billion transistors, 800 gigabytes a second, 2.5 terabytes a second, interprocessor bandwidth. Like honestly, specs and numbers aside, basically just knowing how powerful, like my M1 Max MacBook Pro is. I don't even need, don't even tell me about it. Just let me put my hands on it and test it. And it's gonna be incredible. Like I, just I love my MacBook Pro so much that I can't even imagine how incredible this is gonna be. So, of course, we've got this M1 Ultra chip. We gotta put it in something. Hmm. So that's where the Mac Studio comes into play right here. Now it looks like a Mac mini that just kind of got, hmm, super stretched out. But this? Ahh, like I love it so much. And I haven't even tried it yet. So now when they announced this, again, typical Apple fashion, they spouted off so many different percentages of how much faster that this is gonna be than basically all of the other powerful Macs that are kind of out right now. But like, this is what shook me to my core. 18 streams of 8K ProRes 422. Like I feel, I feel physically ill and not like a bad ill. An illness of, I don't even know. I need help. I need help. Somebody help me. I'm unable to compute. Unable to compute. So it has four Thunderbolt 4 ports, 10 gigabit ethernet, two USB-A ports, HDMI port, pro audio jack, WIFI 6, Bluetooth 5. I also love the fact that they decided to put some ports on the front. So they have two USB-C ports, which actually will be Thunderbolt 4 ports if you get the M1 Ultra, along with an SD card slot. Now there are actually two different versions of this Mac Studio. There's gonna be an M1 Ultra and there's gonna be one that you can get with the M1 Max. And that obviously comes with some price differences. So with the M1 Ultra 64 gigs of ram, one terabyte solid state drive, that will start at $3,999. And the Max Studio with the M1 Max will start at $1,999. I was pretty surprised on the Mac Studio price 'cause it kind of felt very reasonable. But again, as you spec these things out, the price significantly goes up. So let's see how much the Mac Studio will be if we completely spec it out. All right, so we're going to go with the M1 Ultra, and like I said, you do get two options between the M1 Max and the M1 Ultra. So all right, so this is the 20-core, 48-core GPU, 32-core neural engine, 64 gigs of ram. No, we're gonna upgrade to 20-core, 64-core GPU, 32-core neural engine, 128 gigs of ram and eight terabyte solid state, which brings us to a grand total of $7,999. Which is actually, still is not that bad. Like I once spent over $8,000 on just a MacBook, specing that out. So all things considered, yes, that is a pretty high price tag, but for what you're getting, it's really, it's actually not that bad at all. I am so excited to test this out. And, of course, we're gonna need a display for this new Mac Studio, aren't we? This is the new 27-inch studio display. And this is basically everything that I've kind of really wanted in the pro display XDR. So don't get me wrong. The pro display XDRs are so beautiful. They're so fantastic, but they don't have speakers. They don't have a microphone, they don't have a camera. But this has an actual A13 bionic chip built in. It has the ultra wide front camera, with Center Stage. And this is actually the same camera that is on the iPad. It has a built-in six-speaker array and three-microphone array, which is gonna be so incredible, because I feel like so many people are still kind of working from home, or if they're not, they are doing conference calls, no matter where. Like I feel like that is what we basically are doing on a daily basis. I know I am. So the fact that this is all just there, built in. I don't need to have external speakers. I don't need to have a separate webcam. I don't need a microphone. Like it's just, it's just there. The studio display actually comes in a few different configurations. You have the standard glass, which starts at $1,599, and the nano texture glass that starts at $1,899. So I'm gonna spec out an $1,899 nano texture glass, which is actually only a couple hundred dollars more. And when you think about that in comparison to the pro display XDR, it is a thousand dollars extra for that nano texture glass. So we also have two different stand options. So if we were going with the $1,599, the base model, just the regular tilt adjustable stand is the same price. But if you want the tilt and height adjustable stand, that's $1,999. And if you just want the VESA mount adapter, that's also $1,599. So we're gonna just do the $1,899 with the tilt and height adjustable stand. And that brings us to a grand total of $2,299. I'm gonna actually just add that to my bag right now. They also announced a new magic keyboard with touch ID and a numeric keypad. And this has like the new space gray color, which I guess is not that new, but the fact that you can now buy this in addition to a magic mouse, and a magic track pad, also pretty exciting. Dude, I'm hyped about this display. Very, very hyped. Like it looks so good. So this was just kind of like a really quick little overview of the Apple event. Of course, whenever I get these items in, I will be doing a full review on all of them, which, of course, I can't wait. So if you guys haven't already, please subscribe and hit the little bell notification so you'll know when I post new videos. So stay tuned. It's Apple season and I'm hyped. Are you hyped? I'm hyped. So you guys wanna leave me some comments below on what you're most looking forward to, and if there's anything that you would like me to test out on any of these devices, leave it in the comments, and I'll see you guys in the next video. Bye. (upbeat music)",
    "transcript_keywords": [
        "Mac Studio",
        "Studio",
        "iPad",
        "ultra",
        "Mac",
        "iPad Air",
        "Pro",
        "iPhone",
        "Love",
        "kind",
        "display",
        "studio display",
        "Mac Studio price",
        "Max",
        "pro display",
        "pro display XDR",
        "iPad Pro",
        "price",
        "Apple",
        "chip"
    ],
    "transcript_entity_values": [
        "27-inch",
        "iPhone SE",
        "7,999",
        "one",
        "SE",
        "Windows",
        "32",
        "next month",
        "16",
        "K ProRes 422",
        "FaceTime",
        "5",
        "March 18th",
        "800 gigabytes",
        "When Final Cut on iPad",
        "five",
        "M1 Max MacBook Pro",
        "six",
        "3,999",
        "the iPad Air",
        "1,899",
        "Macs",
        "Mac",
        "599",
        "iPad",
        "A13",
        "this next era",
        "1,999",
        "a thousand dollars",
        "M1",
        "the M1 Ultra",
        "114 billion",
        "M1 Ultra",
        "429",
        "today",
        "John",
        "First",
        "second",
        "MacBook",
        "A15",
        "M2",
        "48",
        "this Mac Studio",
        "26",
        "M1 Max",
        "Justine",
        "iPhone",
        "20",
        "the Mac Studio",
        "three",
        "Bluetooth 5",
        "2.5 terabytes",
        "1,599",
        "the Max Studio",
        "jack",
        "eight terabyte",
        "this Friday",
        "8",
        "M2",
        "12 megapixel",
        "Mac Studio",
        "SD",
        "Center Stage",
        "iPad Air",
        "VESA",
        "128",
        "10",
        "2,299",
        "USB",
        "GPU",
        "Apple",
        "an M1 Ultra",
        "iPad Pro",
        "XDR",
        "MacBook Pro",
        "13",
        "four",
        "the M1 iPad Pro",
        "18",
        "daily",
        "Thunderbolt 4",
        "two",
        "14.7-inch",
        "over $8,000",
        "Final Cut",
        "64"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        0.00359112536534667,
        -0.10858439654111862,
        -0.01880277507007122,
        -0.13664056360721588,
        0.013446444645524025,
        0.017698580399155617,
        -0.007127830293029547,
        0.00652407156303525,
        -0.05487052723765373,
        0.08235252648591995,
        0.033109039068222046,
        0.012211314402520657,
        -0.03451099246740341,
        0.0005765131209045649,
        0.03171132504940033,
        0.06272868812084198,
        0.08565596491098404,
        -0.023588979616761208,
        -0.004123847000300884,
        0.04632747918367386,
        -0.0012037892593070865,
        -0.0626467913389206,
        0.04531189426779747,
        0.019470805302262306,
        -0.01706002838909626,
        0.09269677847623825,
        0.014912932179868221,
        0.05901449918746948,
        -0.07991697639226913,
        -0.08952545374631882,
        -0.03158329054713249,
        0.02974141575396061,
        0.08654207736253738,
        0.033326469361782074,
        0.06907298415899277,
        -0.06135442852973938,
        0.03553027659654617,
        -0.031515199691057205,
        -0.08418850600719452,
        -0.08701863139867783,
        -0.03696136549115181,
        -0.032328180968761444,
        0.03405878692865372,
        -0.014693097211420536,
        -0.008680080994963646,
        -0.05500314384698868,
        -0.011343264952301979,
        -0.04096389189362526,
        0.08996215462684631,
        0.08760379254817963,
        -0.029968999326229095,
        -0.06123052537441254,
        0.0015052601229399443,
        0.014412468299269676,
        -0.015880081802606583,
        0.026866136118769646,
        -0.06584344804286957,
        0.017969949170947075,
        0.0812191367149353,
        -0.04718126356601715,
        0.00940815731883049,
        -0.018885057419538498,
        -0.0006770466570742428,
        0.03912224620580673,
        -0.033010333776474,
        -0.038608238101005554,
        0.012833219021558762,
        -0.004213736392557621,
        -0.022779393941164017,
        0.04490498825907707,
        -0.05412577837705612,
        0.032823242247104645,
        -0.0017919777892529964,
        -0.0011635811533778906,
        -0.036825988441705704,
        0.020979413762688637,
        -0.03465442731976509,
        -0.05649755522608757,
        -0.03810511529445648,
        0.02810267172753811,
        0.07323430478572845,
        -0.05924141779541969,
        -0.06567063182592392,
        -0.032140102237463,
        0.012415469624102116,
        0.04781524837017059,
        -0.011793931946158409,
        -0.018580574542284012,
        -0.0700480192899704,
        -0.015176230110228062,
        -0.09996877610683441,
        -0.007488531060516834,
        0.023417698219418526,
        0.043351348489522934,
        -0.013492200523614883,
        -0.05219981446862221,
        0.0035158449318259954,
        -0.023815147578716278,
        -0.012423630803823471,
        0.06765221059322357,
        0.03228731453418732,
        -0.03262651339173317,
        0.0021628926042467356,
        -0.02195158787071705,
        0.0006722305552102625,
        -0.09571918845176697,
        -0.01345662772655487,
        0.03987273573875427,
        0.0055779460817575455,
        0.05785156413912773,
        0.017667032778263092,
        0.02567129209637642,
        -0.03119770810008049,
        -0.022311238572001457,
        0.02008076384663582,
        0.08879347890615463,
        -0.022725235670804977,
        0.03984016925096512,
        -0.01833086833357811,
        0.0500989593565464,
        -0.0017334705917164683,
        -0.027726158499717712,
        -0.012569489888846874,
        0.051604628562927246,
        0.011090441606938839,
        0.08805263787508011,
        -0.04673070088028908,
        1.365974541102202e-32,
        0.012418756261467934,
        0.03323035314679146,
        0.0261086318641901,
        0.02731267735362053,
        -0.03988087922334671,
        -0.0498642660677433,
        0.07552669197320938,
        0.09131865948438644,
        -0.012323309667408466,
        0.00529363052919507,
        -0.030388617888092995,
        0.05719538778066635,
        -0.04872164502739906,
        0.035026561468839645,
        0.05168053135275841,
        -0.09333460032939911,
        0.026780884712934494,
        -0.0662490576505661,
        -0.021984264254570007,
        -0.0016315208049491048,
        -0.04411667585372925,
        -0.002054612385109067,
        0.0054274252615869045,
        0.0014198435237631202,
        0.05463573336601257,
        0.1355048567056656,
        0.040618330240249634,
        0.03672497346997261,
        0.09564109891653061,
        0.025394344702363014,
        -0.11091364920139313,
        -0.06909286975860596,
        -0.04117957875132561,
        -0.09877290576696396,
        -0.006518959999084473,
        -0.00957874208688736,
        -0.04464395344257355,
        -0.02106330543756485,
        -0.011160398833453655,
        0.023348066955804825,
        -0.06886382400989532,
        -0.015363459475338459,
        -0.08643048256635666,
        -0.07779035717248917,
        0.0644291415810585,
        0.060049429535865784,
        0.012865961529314518,
        0.0863223671913147,
        -0.02621896006166935,
        -0.013129605911672115,
        -0.03864631429314613,
        -0.007487526163458824,
        -0.04451240971684456,
        -0.0402660109102726,
        -0.057877905666828156,
        -0.055190134793519974,
        -0.020239926874637604,
        0.03521169349551201,
        -0.004938844591379166,
        0.029295669868588448,
        0.038972411304712296,
        -0.022184308618307114,
        0.0006470970110967755,
        0.06240292638540268,
        -0.07287394255399704,
        0.1077423170208931,
        0.04419110342860222,
        -0.015653809532523155,
        0.028150588274002075,
        0.07515610754489899,
        0.007418280001729727,
        -0.018819259479641914,
        0.11863650381565094,
        -0.0037368768826127052,
        0.053283996880054474,
        0.013124632649123669,
        -0.0857531726360321,
        -0.004493263084441423,
        -0.010541635565459728,
        0.00881379097700119,
        -0.08663616329431534,
        0.08610512316226959,
        -0.02715364098548889,
        0.08488956093788147,
        -0.04364646226167679,
        -0.030072340741753578,
        0.052967432886362076,
        -0.041020892560482025,
        -0.04810544475913048,
        0.02251054160296917,
        -0.04798092693090439,
        0.04239034280180931,
        -0.06455588340759277,
        -0.050378698855638504,
        -0.04769187420606613,
        -1.3257031332005873e-32,
        0.061981748789548874,
        0.027728518471121788,
        -0.006140605080872774,
        -0.00438114907592535,
        0.03842952847480774,
        -0.023798147216439247,
        -0.013310737907886505,
        0.09584566950798035,
        -0.006643802393227816,
        -0.049518585205078125,
        0.08792804181575775,
        -0.04075730964541435,
        -0.10587973147630692,
        -0.040536973625421524,
        -0.04296058788895607,
        -0.053660664707422256,
        -0.038067977875471115,
        -0.045498624444007874,
        0.06382586061954498,
        -0.015577460639178753,
        0.13592569530010223,
        0.1101100817322731,
        0.07867736369371414,
        0.02871071547269821,
        0.006337108556181192,
        -0.03561479598283768,
        0.0359027199447155,
        0.05710858479142189,
        0.05047423020005226,
        0.013710285536944866,
        0.047179192304611206,
        -0.02175484411418438,
        -0.051722120493650436,
        -0.005246609449386597,
        0.038533613085746765,
        0.06368345767259598,
        0.014568550512194633,
        0.030033502727746964,
        -0.03901933878660202,
        -0.04928496852517128,
        0.029606593772768974,
        -0.012093241326510906,
        -0.0368308499455452,
        -0.02212914638221264,
        0.03604225069284439,
        -0.015201064758002758,
        -0.02175392210483551,
        0.0027085882611572742,
        0.04007543623447418,
        -0.06543701887130737,
        -0.04714579880237579,
        -0.04481949284672737,
        -0.02159407176077366,
        -0.0358320027589798,
        -0.05033662170171738,
        -0.03412684425711632,
        -0.06368792802095413,
        -0.06723026186227798,
        0.046779584139585495,
        0.01169850304722786,
        0.1050449088215828,
        -0.02784387581050396,
        -0.08461152762174606,
        -0.09938575327396393,
        0.01810520701110363,
        -0.035114191472530365,
        0.010478600859642029,
        -0.03251172602176666,
        -0.008578700013458729,
        0.05480371415615082,
        -0.03203188627958298,
        -0.010952375829219818,
        0.03484905883669853,
        0.015564006753265858,
        -0.02470391057431698,
        0.011948881670832634,
        -0.07102249562740326,
        -0.004045662935823202,
        0.06521613150835037,
        -0.05469051003456116,
        -0.020801395177841187,
        0.04033143073320389,
        0.046553462743759155,
        0.12188777327537537,
        0.055202778428792953,
        0.12293587625026703,
        0.06948056817054749,
        0.0003720876120496541,
        -0.029531927779316902,
        0.052244558930397034,
        0.00016906140081118792,
        0.03218430280685425,
        0.058255162090063095,
        0.06916745007038116,
        -0.14055567979812622,
        -6.160774290719928e-08,
        0.032933805137872696,
        0.031777407974004745,
        -0.00617586262524128,
        0.007132369093596935,
        0.01145413238555193,
        -0.07235311716794968,
        -0.07157260924577713,
        0.0042382883839309216,
        0.11995606869459152,
        -0.05817697197198868,
        0.05710756033658981,
        -0.050364769995212555,
        -0.006317360792309046,
        0.07138333469629288,
        0.020148737356066704,
        0.014897613786160946,
        -0.0571967177093029,
        0.054068781435489655,
        -0.03258410841226578,
        -0.05651793256402016,
        -0.06339584290981293,
        0.08560509979724884,
        0.031427789479494095,
        -0.021626150235533714,
        0.036063581705093384,
        0.007466340437531471,
        -0.04244564101099968,
        -0.01581423170864582,
        0.0626852810382843,
        0.06152220815420151,
        -0.06337793916463852,
        -0.012191439978778362,
        -0.012074105441570282,
        0.0012404925655573606,
        -0.051539596170186996,
        -0.06722860783338547,
        -0.04073086008429527,
        0.024040961638092995,
        0.035639941692352295,
        -0.040380097925662994,
        -0.01224158052355051,
        -0.14262168109416962,
        -0.045879073441028595,
        -0.005417517852038145,
        -0.03106275014579296,
        -0.07402024418115616,
        0.01737222634255886,
        -0.08862563222646713,
        -0.04467282071709633,
        -0.04324701428413391,
        -0.019603844732046127,
        0.021805735304951668,
        0.06219545751810074,
        -0.04780352860689163,
        0.09377124160528183,
        0.03917677327990532,
        0.03595146909356117,
        0.02199893817305565,
        -0.06027497723698616,
        -0.010473783127963543,
        0.10902724415063858,
        -0.023671971634030342,
        -0.09720378369092941,
        0.05954691767692566
    ]
}