{
    "id": "KuS8UN4Bh1k",
    "title": "The Razer Core X Will Supercharge Your Laptop",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-05-22T07:11:23Z",
    "video_url": "https://www.youtube.com/watch?v=KuS8UN4Bh1k",
    "category": "Science & Technology",
    "tags": [
        "laptop",
        "laptop upgrade",
        "razer core x",
        "core x",
        "razer core",
        "gaming laptop",
        "ultrabook",
        "upgrade laptop",
        "laptop graphics card",
        "notebook",
        "thunderbolt 3",
        "razer",
        "external gpu",
        "gaming",
        "review",
        "core",
        "upgrade",
        "egpu",
        "thunderbolt",
        "graphics",
        "austin evans"
    ],
    "views": 921355,
    "likes": 18760,
    "comments_count": 1598,
    "description": "With a new lower price, the Razer Core X will upgrade your laptop with Thunderbolt 3 external graphics.  Can You Game on a Mac?  Razer Core X:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=6KPrstpPQms",
        "https://www.razer.com/gaming-laptops/razer-core-x",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "(groan sound) - That could've been incredibly bad. I totally just stepped on this Thunderbolt cable while it was still plugged in and slightly bent it. That's okay, it won't affect the video. Hey guys, this is Austin. Thin-and-light laptops like this Dell XPS 13 are great, but the graphics are never going to be the strong suit. That's where this comes in. This is the Razer Core X, and it is the latest external GPU enclosure from Razer. External graphics are nothing new. I recently did a video on an Alienware laptop from 2014 that did have external graphics as an option. More recently, we did a little gaming on a Mac comparison where we used the Gigabyte Gaming Box to be able to actually play decent games over a Thunderbolt 3 interface on a MacBook. The only issue is that doing external graphics over Thunderbolt 3 can get pricey very, very quickly. First of all, you're going to need a computer with a Thunderbolt 3 port. Ideally, you're going to have one that does have a full four lanes of PCI-e, something that's not always going to be advertised particularly well by the manufacturer. Next, you're going to need an enclosure such as the Core X, although there are of course other options. One of the most expensive parts is always going to be your GPU. Put this all together, and while it can be a nice setup, it can get really expensive very quickly. When it comes to the original Razer Core, which is still going to be on sale, by the way, you're going to be getting a lot of extra features including USB ports, Ethernet, as well as a second Thunderbolt out, but the issue is price. $500, this can be as expensive as a lot of really high-end GPU's that you would normally pick up, which is where the Razer Core X comes in. While you're going to be losing most of those features, most importantly, you can still fit a full-sized graphics card inside and it's going to be a full $200 less. Put the Core X side-by-side with the original Razer Core as well as the tiny little Gigabyte Gaming Box, and you'll see that it is, well, it's a little bit large. However, that is going to be for a reason. It is a very generic-looking black box. It is still going to be made out of aluminum, but you're not going to have any of the bells and whistles of the Core, including stuff like Chroma RGB lighting. Take a look around back and you'll see it's about as simple as it gets. You're going to find a single Thunderbolt 3 port as well as your power connector. However, use the tool-less mechanism which is about as easy as it gets to open up and you'll see why this guy is so big. It does now support a full triple-slot graphics card. That's not going to be super common. However, some cards, especially the higher-end ones with giant coolers, will need a little bit of extra space, and the Core X does provide. You're also going to find the upgraded power supply. We now have a 600-watt unit as opposed to the 500-watt in the previous Core, and it's also now going to be a full ATX power supply. That's going to be mostly useful if you ever wanna upgrade in the future, although with 600 watts of capacity, that means that the graphics card itself is going to be able to get 500 watts, and there's going to be a full 100 watts available for USB-C power delivery to your laptop. It should be good enough for a while, but there is that flexibility. You're also going to find a 120-millimeter fan for cooling. Installing a graphics card is about as simple as it gets. What you do is open up your enclosure and then just drop it right into place, just like you would with a standard desktop, and it should clip in. For power, you do have a pair of 6+2 pin connectors. The cable management out of the box is a little bit tight, so I had to undo that just to get a little bit more slack. You just have to plug these guys in, and then, if I can actually get it into place, (clears throat) use the little screw to make sure the whole thing doesn't come flying out of the slot. Then all you do is take the entire assembly, line it up into the enclosure, slide it into place, pop the handle, and you're gonna be good for some external graphics action. I am using Vega 64 for this demo, but you can use the vast majority of current AMD and NVIDIA graphics cards. You should keep in mind that if you're going to be using this on Mac, which is now supported, you are going to be needing to use an AMD graphics card if you want official support. NVIDIA cards will work, but it requires just a little bit more work. From here, it's pretty straightforward. Just take the Thunderbolt 3 cable and plug it into your laptop. You will wanna use an external monitor, so I'm just gonna hook up the DisplayPort cable to the back of our graphics card. You actually don't have to do this, but it will give you much better gaming performance when you're not having to fight between the graphics card sending video back and forth to the internal laptop display. Something like this going out over DisplayPort is going to give you much better performance. But with that, we have our full Thunderbolt 3 setup ready to game. When it comes to gaming, of course the graphics card and the actual CPU that is inside your laptop is going to make a huge difference. Something like Vega 64 is honestly a little bit overkill, but we are still going to see a huge, huge performance gain over playing on integrated graphics. Using the Vega 64 as well as the Core i7-8550U that's going to be inside this guy, we're getting, on full epic settings at 1080p, around 70 to 80 frames-per-second. You're always gonna be giving up some performance when you're using Thunderbolt 3 as opposed to an actual, dedicated solution, but if you put it side-by-side with something like integrated graphics as opposed to 720p on low settings at 30 frames, this, at full epic settings, is just a totally different-looking game. Although, one of the slight downsides to most Thunderbolt enclosures is that the Thunderbolt 3 cables have to be fairly small, which means that ... I'm getting cooked right now by the graphics card. I guess I could just do that. (laughs) So again, you will definitely wanna use an external display. Right now, we're actually recording it using an HDMI capture card, so we're not affecting the performance. But this is gonna be super playable. Framerate's jumping around a little bit, but it's generally in the 70 to 80 frame-per-second range. (yells) No, why? (laughs) I didn't have anything yet. Why? Let's try Fortnite round two, which of course is the game that I'm playing, as if somehow you're watching this video without knowing the game Fortnite exists. Because of course you do have to have a Thunderbolt 3 port, it does mean that you're not exactly going to be using this with a super old-school laptop, but I actually would recommend either an 8th-gen Core i5 or i7. The previous dual-cores will be fine, but when you have a full quad-core CPU, it actually does make a pretty big difference to gaming performance. Next up, we have PUBG. This is another game that is absolutely no problem to run with something as high-end as a Vega 64 card. At 1080p with everything maxed out, we're averaging in the 70 to 80 frame-per-second range. It's really cool when you consider that with a single Thunderbolt 3 port, we're turning a thin-and-light ultrabook into a proper gaming PC. Sure, you're gonna need some other stuff like a monitor and a mouse, although not technically, but it makes your game a lot better. But it's so cool to be able to have a small, thin-and-light laptop that you can carry around all day, have no problems with, and then when you get home, hook it up and turn into a full, dedicated gaming PC. Of course the Razer Core is also going to be supported on macOS. Support is a little bit odd right now, mostly because a lot of games aren't going to be particularly well-optimized on the Mac. We tried Fortnite; it didn't really wanna load. I'm gonna show that. However, Rocket League is faring a bit better. On full, maxed-out settings, we're somewhere around 70 frames-per-second, but we're getting this weird text thing. You can game on the Mac, but not super well. Although if you wanna know more about that, we did an entire video on why gaming on a Mac is a questionable idea. But the Razer Core does work, and it's mostly just on software to actually support it. At $300, the Razer Core X actually is going to be pretty reasonably-priced as far as these Thunderbolt 3 enclosures go. Yes, you do need a little bit of extra hardware, but if you do have a Thunderbolt 3-equipped Mac, or especially an ultrabook, it's a great way of turning it into a pretty decent gaming laptop.",
    "transcript_keywords": [
        "Razer Core",
        "Core",
        "Thunderbolt",
        "graphics card",
        "original Razer Core",
        "graphics",
        "Razer",
        "card",
        "full",
        "gaming",
        "bit",
        "External graphics",
        "Gigabyte Gaming Box",
        "Mac",
        "laptop",
        "external",
        "game",
        "incredibly bad",
        "single Thunderbolt",
        "full Thunderbolt"
    ],
    "transcript_entity_values": [
        "Ethernet",
        "600 watts",
        "the Razer Core X",
        "XPS 13",
        "Framerate",
        "AMD",
        "500 watts",
        "MacBook",
        "70 to 80",
        "the Razer Core",
        "Razer",
        "Chroma RGB",
        "Alienware",
        "Core",
        "2014",
        "USB",
        "600-watt",
        "Austin",
        "two",
        "300",
        "AMD",
        "30",
        "100 watts",
        "Rocket League",
        "four",
        "Thunderbolt 3",
        "Thunderbolt",
        "Gigabyte Gaming Box",
        "Vega",
        "one",
        "1080p",
        "second",
        "500",
        "8th-gen Core",
        "6",
        "500-watt",
        "200",
        "Razer Core",
        "Dell",
        "the Core X",
        "ATX",
        "DisplayPort",
        "CPU",
        "Fortnite",
        "all day",
        "PCI",
        "Mac",
        "Thunderbolt",
        "Mac",
        "120-millimeter",
        "One",
        "NVIDIA",
        "GPU",
        "First",
        "3"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL"
    ],
    "vector": [
        0.02102711610496044,
        -0.06913106143474579,
        -0.021451864391565323,
        -0.024455515667796135,
        0.06134241446852684,
        -0.03666778653860092,
        -0.07348036020994186,
        0.048103924840688705,
        0.009752913378179073,
        -0.019962068647146225,
        -0.0372028574347496,
        -0.02526797540485859,
        -0.00039553854730911553,
        -0.011288048699498177,
        0.042167626321315765,
        0.08467487245798111,
        0.13761396706104279,
        -0.014556819573044777,
        0.011087178252637386,
        0.024213498458266258,
        -0.014433298259973526,
        -0.08968719840049744,
        0.014859945513308048,
        -0.022867172956466675,
        -0.003454948775470257,
        0.047535885125398636,
        0.11850737780332565,
        -0.02773977257311344,
        -0.07887506484985352,
        0.027410050854086876,
        -0.035168085247278214,
        -0.07685628533363342,
        -0.021646054461598396,
        0.014895026572048664,
        0.020458361133933067,
        -0.10827754437923431,
        0.015559461899101734,
        -0.06149056926369667,
        -0.09123815596103668,
        -0.09228186309337616,
        -0.06107303127646446,
        0.013383066281676292,
        0.026995036751031876,
        -0.016400834545493126,
        0.0408705398440361,
        -0.05618893727660179,
        0.052266038954257965,
        -0.03994396701455116,
        -0.018237033858895302,
        0.003998579923063517,
        0.028559446334838867,
        -0.037807054817676544,
        -0.0723557323217392,
        0.03854566439986229,
        -0.0014151851646602154,
        0.08739816397428513,
        -0.03680210933089256,
        -0.0846899077296257,
        -0.04929891601204872,
        0.0672372356057167,
        0.08738209307193756,
        -0.07655750215053558,
        -0.01638706773519516,
        0.04209231957793236,
        -0.004065921995788813,
        -0.12950444221496582,
        0.045824743807315826,
        0.001578197698108852,
        0.016445660963654518,
        0.03461606055498123,
        0.07828111201524734,
        -0.04688354209065437,
        -0.07830076664686203,
        -0.11214801669120789,
        0.0026192660443484783,
        0.059664033353328705,
        0.05201224237680435,
        -0.04578402638435364,
        0.012298722751438618,
        -0.003995015751570463,
        -0.01499477494508028,
        0.04811832681298256,
        0.01976870186626911,
        -0.008761648088693619,
        0.0049920459277927876,
        -0.045770686119794846,
        0.015416761860251427,
        0.058895260095596313,
        -0.07844395190477371,
        -0.004085765220224857,
        0.04257927089929581,
        0.02916836366057396,
        -0.0026527512818574905,
        0.028819052502512932,
        0.024548128247261047,
        -0.04236970841884613,
        0.023204652592539787,
        -0.13761529326438904,
        0.0071233538910746574,
        0.043283186852931976,
        -0.002575590740889311,
        -0.00580513896420598,
        0.09842175245285034,
        0.021182356402277946,
        0.022097334265708923,
        -0.028431344777345657,
        -0.014556720852851868,
        0.07417888939380646,
        -0.12506067752838135,
        0.007516444195061922,
        0.0016198769444599748,
        -0.03921450674533844,
        -0.058756425976753235,
        0.030945781618356705,
        -0.01222050841897726,
        0.027170337736606598,
        0.014795585535466671,
        -0.071895532310009,
        0.043122582137584686,
        0.04340507835149765,
        -0.06192082539200783,
        -0.01994280144572258,
        0.03444614261388779,
        0.03648306056857109,
        0.07857193052768707,
        -0.008394153788685799,
        -0.07563479989767075,
        4.447454958345293e-33,
        -0.05550345033407211,
        0.029135962948203087,
        -0.028500201180577278,
        -0.04471571370959282,
        -0.021369285881519318,
        0.05865731090307236,
        0.09620746970176697,
        -0.014098958112299442,
        -0.010930846445262432,
        0.08928388357162476,
        -0.06527075916528702,
        0.05844179540872574,
        0.011536926962435246,
        0.03983598202466965,
        0.02922961488366127,
        -0.03831946477293968,
        -0.015992943197488785,
        -0.0051157912239432335,
        -0.023889966309070587,
        0.08609023690223694,
        0.03884245827794075,
        -0.03304566070437431,
        -0.00838229339569807,
        -0.0677511915564537,
        -0.024264778941869736,
        0.045054905116558075,
        0.019248099997639656,
        0.0012624291703104973,
        0.026974165812134743,
        0.019331125542521477,
        -0.011580709367990494,
        -0.04829838126897812,
        0.010234223678708076,
        -0.040674787014722824,
        -0.05802556872367859,
        0.04547716677188873,
        -0.03665122017264366,
        -0.0676153227686882,
        -0.023469287902116776,
        0.07531262189149857,
        -0.0483408160507679,
        0.055986322462558746,
        -0.0383635051548481,
        -0.040511567145586014,
        0.011462105438113213,
        0.039457134902477264,
        0.047729816287755966,
        -0.018843648955225945,
        -0.12445979565382004,
        -0.037821196019649506,
        0.005356650799512863,
        -0.005744055844843388,
        0.07539854943752289,
        0.013642648234963417,
        -0.06963185966014862,
        0.004278211388736963,
        0.09157498180866241,
        0.061586905270814896,
        0.12780268490314484,
        0.03035266138613224,
        -0.008483130484819412,
        -0.05330074951052666,
        -0.029943406581878662,
        0.05815541371703148,
        -0.018916580826044083,
        0.04269692674279213,
        0.06600794196128845,
        0.03675864636898041,
        -0.0620298907160759,
        0.019284071400761604,
        -0.0393381305038929,
        0.034266967326402664,
        0.028380297124385834,
        -0.0927422046661377,
        0.09642148017883301,
        -0.01273503340780735,
        -0.09318535029888153,
        0.06053262948989868,
        -0.007975909858942032,
        0.048772238194942474,
        -0.01552986167371273,
        -0.003227229230105877,
        0.048099368810653687,
        0.027351658791303635,
        -0.029557444155216217,
        0.0667286366224289,
        -0.06840211153030396,
        0.026084497570991516,
        0.04107736796140671,
        0.049455899745225906,
        0.016257023438811302,
        0.009179121814668179,
        -0.008765176869928837,
        0.02650531940162182,
        0.03753499686717987,
        -2.9997934413603285e-33,
        -0.008569847792387009,
        -0.03606487438082695,
        -0.03507625311613083,
        0.08739025890827179,
        0.017552431672811508,
        0.03867748752236366,
        -0.03672482818365097,
        -0.015741566196084023,
        0.048464082181453705,
        -0.1437964141368866,
        0.0172811858355999,
        0.0878414735198021,
        0.016626155003905296,
        0.04430432990193367,
        -0.011174839921295643,
        -0.02823280170559883,
        -0.05471181496977806,
        -0.053238268941640854,
        -0.030790846794843674,
        -0.033559031784534454,
        -0.028910497203469276,
        0.01757558435201645,
        0.0027681344654411077,
        -0.0645473301410675,
        -0.04062699154019356,
        0.001618275768123567,
        0.04439559578895569,
        -0.04370100796222687,
        0.03656994178891182,
        -0.001030870364047587,
        0.02189607545733452,
        0.026884226128458977,
        0.056389257311820984,
        0.0002312240976607427,
        0.04827776178717613,
        -0.006153760012239218,
        0.0690213218331337,
        0.0017806560499593616,
        -0.026444362476468086,
        0.056560203433036804,
        0.016900772228837013,
        0.152451753616333,
        0.023232266306877136,
        0.006183350458741188,
        0.0676952674984932,
        0.04462403431534767,
        -0.08986629545688629,
        -0.11723238229751587,
        0.03402470424771309,
        0.0008692776900716126,
        -0.05922187864780426,
        -0.0712306946516037,
        0.007122984621673822,
        -0.006680600810796022,
        -0.008780218660831451,
        -0.10314051806926727,
        -0.04308772459626198,
        0.04351005330681801,
        0.06626176834106445,
        0.0013204891001805663,
        0.0306365005671978,
        0.08898867666721344,
        -0.011945708654820919,
        -0.05543530359864235,
        0.05137883126735687,
        -0.011344068683683872,
        -0.06796400994062424,
        0.00996552687138319,
        0.06789816170930862,
        -0.015660718083381653,
        -0.05174945294857025,
        -0.04186775162816048,
        -0.019153112545609474,
        0.012037403881549835,
        0.02650904282927513,
        0.08241131901741028,
        0.04842203110456467,
        0.00112727505620569,
        0.07331289350986481,
        0.023779267445206642,
        0.01635996624827385,
        -0.05644423887133598,
        0.0646335780620575,
        0.03573092445731163,
        0.02801414020359516,
        -0.021425923332571983,
        0.06956221163272858,
        0.045570507645606995,
        -0.06762911379337311,
        -0.07227979600429535,
        -0.02430299110710621,
        0.0022195414640009403,
        -0.04195358231663704,
        0.0058358111418783665,
        -0.06505832821130753,
        -4.7745558617862116e-08,
        0.006145766470581293,
        -0.003801595186814666,
        -0.0020715680439025164,
        0.12217164039611816,
        -0.035771530121564865,
        0.012989997863769531,
        0.06683288514614105,
        -0.0025304502341896296,
        0.1178509071469307,
        0.02921990677714348,
        -0.02298879250884056,
        -0.10362166166305542,
        0.052393607795238495,
        -0.05030205100774765,
        -0.022095344960689545,
        0.09692493081092834,
        0.021726103499531746,
        -0.039145369082689285,
        0.03947316110134125,
        -0.0026645143516361713,
        -0.0468415766954422,
        0.0990041047334671,
        0.10859176516532898,
        -0.029269937425851822,
        -0.04710033908486366,
        0.04305940121412277,
        -0.07606910169124603,
        -0.023998748511075974,
        0.009584615007042885,
        -0.027216359972953796,
        -0.06974790245294571,
        0.029227042570710182,
        0.030512947589159012,
        0.0520770326256752,
        -0.016604425385594368,
        -0.05241205543279648,
        0.03373885154724121,
        0.04411838576197624,
        0.08929769694805145,
        0.03629074618220329,
        0.012122123502194881,
        -0.041370734572410583,
        -0.05274726822972298,
        -0.09079591929912567,
        -0.02845274843275547,
        -0.027960114181041718,
        -0.02473069354891777,
        -0.07006029784679413,
        -0.052593085914850235,
        0.03139597922563553,
        -0.002710788743570447,
        0.04752654582262039,
        -0.049556829035282135,
        -0.01976551115512848,
        0.05839523300528526,
        -0.02460087090730667,
        0.00952700525522232,
        0.003517353208735585,
        -0.017521580681204796,
        0.01608338952064514,
        0.018263548612594604,
        -0.11845376342535019,
        0.012073966674506664,
        0.049596309661865234
    ]
}