{
    "id": "kuTTAuUorsI",
    "title": "I Have to Do Everything this AI Says - ChatGPT Builds a PC",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-22T18:00:33Z",
    "video_url": "https://www.youtube.com/watch?v=kuTTAuUorsI",
    "category": "Science & Technology",
    "tags": [
        "ChatGPT",
        "AI",
        "ChatGPT Builds PC",
        "PC Build",
        "Gaming",
        "Gaming Pc",
        "Linus Tech Tips",
        "LTT PC",
        "Crazy PC",
        "AMD",
        "Intel",
        "Nvidia",
        "Graphics",
        "hubspot",
        "hubspot crm",
        "hubspot software",
        "hubspot marketing",
        "hubspot sales",
        "hubspot pricing",
        "hubspot crm platform",
        "hubspot cms",
        "hubspot operations",
        "hubspot service"
    ],
    "views": 3089593,
    "likes": 97266,
    "comments_count": 3287,
    "description": "A portion of this video is sponsored by HubSpot CRM. Learn more about HubSpot CRM at:   Have you ever wondered what would happen if you asked AI to build you a gaming PC? No? Well, we did, and with ChatGPT it became a reality.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:10 Introducing ChatGPT 1:16 HubSpot 1:28 Help me build a PC 4:35 Prepping the motherboard 5:46 ChatGPT gives us a CPU cooler 8:23 HubSpot 9:05 Installing storage 11:15 ChatGPT has failed us 13:10 Redemption 16:22 Peripherals 17:44 Conclusion",
    "description_links": [
        "https://clickhubspot.com/ocb",
        "https://linustechtips.com/topic/1475683-i-have-to-do-everything-this-ai-says/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Thanks to HubSpot CRM for sponsoring a portion of this video. In its own words, the ChatGPT chatbot from OpenAI is (dramatic music) a force to be reckoned with in the world of language processing AI. And they might be onto something. Ask it seemingly any question and it responds in fluent English with the ease and confidence of the smartest person you've ever met, or maybe the most arrogant since it does get things very wrong sometimes. In spite of its shortcomings, it has already proven to be an extremely powerful tool for creation. Code snippets, poetry, and even simulating a Linux virtual machine are all possible, if it's in the mood. It can even generate Linus tech tips video scripts. I mean, not in a way that will replace our writing staff anytime soon. In fact, I'm pleased to announce that I will be paying my writing team double their current salaries. This is a testament to their hard work and wait, what? Who put that in the chatbot? You were supposed to ask it if it can help me build a PC. The rules today are simple then. I have to do everything the AI tells me as if I have no PC building knowledge whatsoever. I mean, what could go wrong? But enough about this. Let's take a moment to thank our sponsor for supporting this program and it making it possible for us to bring you this innovative technology. - Thanks to HubSpot CRM for sponsoring this portion of the video. HubSpot is an all in one CRM platform that makes it easy for your team to stay aligned. Learn more about them later in the video. Thanks to HubSpot for sponsoring that portion of this video. - Building a PC can be a fun and rewarding experience and I'll be happy to help you through the process. Here's a list of basic components you will need to build a PC: case, power supply, motherboard, CPU, RAM. It even explains what CPU and RAM are. Wow. Not only is this response coherent, well-formatted, and encouraging. You can do it! - [Crowd Member] You can do it. - Unfortunately, if I didn't already know how to build a computer, it probably wouldn't help me that much. But if you run into difficulties or have any questions along the way, don't hesitate to ask for help. This ability to go back and forth with the user, allowing them to refine their query, is what makes ChatGPT so freaking powerful. Let's try to narrow things down a little. I have a 1500 US dollar budget and I want the best gaming PC, including peripherals. Unless we press this reset thread button in the top left, it will continue to use all the context of our previous interactions to give us better and better answers. Because it can't browse the internet, it wasn't able to give me a recommendation for a specific price, but maybe what we can do is get it there through a set of guidelines. Will it understand colloquialisms like that? It already thinks I can't handle this. Consider buying a pre-built system. I really want to build it myself. What's a good CPU for gaming? Hey, here we go! Currently some popular options for gaming CPUs include the Ryzen 9 5900X, the Core i9-10900K, and the Ryzen 7 5800X. These recommendations actually make a ton of sense because the data set that ChatGPT chatbot was trained on ends sometime in 2021, so the newest processors wouldn't be part of its data set. If you're working on a tighter budget, you may wanna consider a CPU like the Ryzen 5 5600X, which offers good performance at a more affordable price. Should we build a 5,600X machine? It's a capable CPU that can handle gaming at 1440p. It's a good mid-range CPU. It actually recommends something with more cores and threads like the Ryzen 7 5800X or Core i9-10900K. It also tells me I'm gonna need a GPU now that it knows what kind of games I want to play. This is amazing! Which one would be best if all I care about is gaming? Intel CPUs have a reputation for offering better single core performance which can be beneficial for gaming. That was more true before Ryzen 5000 series. I can definitely tell this was trained before current year. Be aware, AMD CPUs are generally easier to overclock than Intel. It's not quite true. They are generally more open to being overclocked, but not necessarily more overclockable. I want a straight up recommendation, bud. It is not gonna tell me exactly which one. The best for you will depend on your specific needs and budget. And there it is. The Ryzen 9 5800X. At this stage, I've got step-by-step instructions for assembling a computer and everything the chatbot has asked me to acquire so far. As you can see, I'm a little short on components, but I know the first step is to install the CPU onto the motherboard, so maybe it can help recommend one. Okay, here's some factors to consider. Oh, we do get a few specific recommendations though. Do we have an ASRock 8550 Phantom Gaming 4? It's not quite what the chatbot recommended, but here's the closest ASRock B550 board we have. Let's go with this. Apparently this is a good balance of features and value, which is exactly the kind of machine we're trying to build. When handling a motherboard, it's important to be careful and avoid damaging the delicate components on the board. Here are a few tips. Avoid touching the components on the motherboard, especially the pins on the CPU and contacts on the RAM. That is such great advice. This is an amazing summary of the precautions you should take when handling sensitive electronics. - [Crew Member] Forgot your anti-static wrist strap. - It's on my ankle as always. Oh, it specifically says to follow the instructions in my motherboard's manual. I never thought to look for that. I might look up the function of a specific header or something like that, but I never thought, oh gee, I'll follow the step-by-step instructions in my motherboard manual for how to build a computer. Well, I don't know about you guys, but I'm having an absolute blast. Up, put it in, put it down. Huh! So easy. Thanks, ChatGPT. We've run into a bit of a hitch now though. The instructions go from CPU to how to install AMD's box cooler, but the 5800X doesn't come with a box cooler so that's really where the usefulness of these instructions ends. Maybe ChatGPT can help fill in the gaps. You can use an air cooler, which is a heat sinking fan, or a liquid cooler, which uses the pump radiator and fans to dissipate heat with Cooler Master Hyper 212 EVO, Noctua NH-D15, or the be quiet! Dark Rock Pro 4. These are just a few examples of easy to install air coolers. Let's see what we got. It looks like we do have a Hyper 212 EVO in stock. I guess that's what we're going with. Cooler Master includes detailed illustrated instructions, but there are a couple of points that a new user might want more clarification on. How much thermal compound is that? It looks like a mountain range. Maybe the chatbot can help me with that. Small amount, the size of a pea in the center of the CPU or a thin line down the middle. Unsolicited and yet so right. That confidence though is a double-edged sword. When the chatbot is wrong, it also still seems really trustworthy. ChatGPT got this way wrong. This is not very easy to install. You gotta hold the back plate on here and then you gotta put the pass through thing with the plastic thing on here and put the nut on from the back. While ChatGPT does have information that it's compiled from millions of articles online, what it doesn't have is actual human hands so it doesn't have any context. But hey, at least the LTT store screwdriver is perfect for tools like this. Gotta love the strength of that magnet. Go around tightening these nuts. For all its current failings though, imagine what OpenAI is gonna be able to do with a more up-to-date data set. When I respond and I say, \"Hey, the Hyper 212 EVO, not that easy to install. I just got called a (beep) noob. No, you're a noob! The future. Now I need some help choosing RAM. That is not strictly speaking correct, but if you want optimal performance a speed of at least 3,200 mega transfers per second actually is good. And then it says 3,600 is also a good choice. That is correct. I would like 16 gigs of DDR4 RAM please. Ah, why thank you. As for how to install it, ChatGPT has me covered there. Locate the DIMM slots on the motherboard. Typically long rectangular slots with metal contacts on the bottom edge. That could be this, that could be this. Yeah. As before, it tells me specifically to consult the manufacturer's manual. If I am in doubt, there are instructions. A-plus. Install storage drives into the case. Well, I don't have drives or a case. I'm gonna throw it for a loop and ask it to pick two things for me at once: storage and a case. For now, it's still faster to get tech tips, even if they do come with messages from our sponsors, like- - Thanks to HubSpot CRM for sponsoring this portion of the video. Whether you're a small business owner or are running a large enterprise, organizing your customer relationships can be a bit tricky. But with HubSpot, it doesn't have to be. HubSpot's connected CRM platform is easy to use. Really. So your teams and data can stay connected, meaning your customers get a better experience. Are you just done juggling disconnected marketing sales and customer service solutions? Solve it all, all in one place, with HubSpot. Plus you can try before you buy. No commitment, no hidden fees, not even a credit card needed to sign up. Your customers will thank you. Your competition probably won't. So check out HubSpot using the link below today. Thanks to HubSpot for sponsoring that portion of this video. - Oh hey, there we go. Mm, it got a little confused here. It's recommending higher capacity drives if you want a high performance system, but what you actually want is an SSD in a high performance system regardless of the capacity. Do not wanna just put a two terabyte hard drive in a high performance system today. I'm gonna forget about the case for now and see if we can get it to narrow down an SSD for me. An error occurred? No! since they went public beta a few days ago, they've racked up a million daily users. Either the server super bogged down or it's had enough of this particular conversation, but we are not getting any more responses. Yeah, no, it's broke right now. We gave OpenAI's servers a little time to cool off, and boom! Let's get a 970 EVO Plus 1 terabyte please. Once the SD is properly installed, replace the slot cover and secure it with the screw or screws. You forgot to peel this, GPT chatbot. It also got a little bit lucky in that this particular slot used the same screws for the heat sink and securing the SSD down to the board. That is not true of every SSD slot. Then again, I did tell it what motherboard I had. I'm good to go. I just found some problems. It never actually tells me to put the motherboard in the case. Unfortunately, I have to follow the instructions the chatbot gave me and things are about to get a little spicy. I think the next thing I need is a GPU. I'm looking for good 1440p gaming performance but I don't want to spend an arm and a leg. The RTX 3070 offers excellent performance for 1440p gaming with ray tracing capabilities and high frame rates at high settings. It also comes at a more affordable price point than some of the higher end GPUs. RTX 3070 it is. Those of you in the know have probably figured out the problem we're about to have. Place the motherboard into the case and secure it with screws. Place your case on a flat, stable surface and install the power supply into the case. Well, I haven't actually picked a case or power supply yet. Let's see if it can recommend a power supply. How about the EVGA SuperNOVA 750 watt 80-plus Gold Fully Modular Power Supply. This'll be our stand-in for the 750 watt SuperNOVA. What about my case? It just recommended the Thermaltake Core V1 Mini-ITX Cube. Womp, womp. I'm gonna give it a chance though. (gasps) It is a Mini-ITX case, which means it is designed to fit Mini-ITX motherboards such as the Asrock B550 PG Riptide. - Disappointed! - I think the wasted case purchase should count against my budget. I bought that case and it doesn't fit. It apologizes, clarifies that it's only compatible with Mini-ITX motherboards, which are smaller than ATX motherboards typically used in gaming PCs. It still doesn't know the spec for this is ATX, but that didn't prevent it from actually getting the right answer. Can you recommend an ATX case then? How about the NZXT H510 Elite? It is spacious and well-ventilated. It looks like the closest thing we have for performance is the H510, which has a solid plastic front panel, whereas the Elite has a solid glass front panel. It may also be missing a couple of fans, so if they're missing, we'll just go grab some fans off the shelf and throw them in here to make sure that our performance is as it should be. I have been given no instructions to install my IO shield, I have been told to install my GPU before putting the motherboard into the case, and I have not been prompted to remove any PCI slot covers or anything like that. If I were to actually install this motherboard right now, I would have no way of outputting video, and there's also a strong chance that I would end up damaging something because it would be impossible to properly align the motherboard. The power supply is typically installed at the bottom of the case, near the back. Great instructions. Some have it in a different location such as the top or side. Be sure to check the case's documentation. When in doubt, read the (beep) manual. Which way should the fan point? Up or down? With the blades facing downward. Let's give it a chance to undo what it got wrong. No, you should not have the GPU installed on the motherboard when fitting it into the case. It should be after the motherboard is securely installed. Make sure you're using the correct screws. That's a really good tip, because they can be either 6-32 or M3. You can also try adjusting the positioning of the other components in the case to make more room for the motherboard. Wow! Let's make sure we have the correct screws. Thanks, chatbot. This whole experience makes me want to try to do something I don't know how to do using the chatbot. Okay, chatbot. The power supply and motherboard are installed but I'm not sure how to connect them together. You will need to use the appropriate cables from your power supply. A 24-pin ATX power cable and an 8-pin EPS12V power cable. Whoa! First locate the ATX power connector on the motherboard, which is typically near the edge of the motherboard, near the CPU. Let's go! That's pretty near to the CPU, I think. It even told me to cable manage! It told me to cable manage, you guys! I wasn't gonna cable manage 'cause I assumed it wouldn't mention that, but darn it, I'm gonna end up with a better computer than if I had someone from my writing team spec it. It's fairly clear that this is no substitute for, you know, this guy. I mean look. Does chatbot have a beard like that? I didn't think so. How about connecting the case to the motherboard? Hmm, nothing about reset or power LED, but it does say to refer to the documentation, and it tells me to cable manage them. All right, here we go! We should let the chatbot title our videos for a week. Just see if anyone notices. - Build your dream PC with AI by your side. Let AI help you create the ultimate gaming pc. - They're not bad. This might be a bit of a hack plugging in these fans that I wasn't explicitly told to plug in, but it did tell me to plug in all the cables from the case to the motherboard and to consult the documentation for both of them if I wasn't sure, so I'm pretty sure I would've gotten here. Is it time to put my GPU in now? Yes, you'll need to locate the PCIe slot on the motherboard, which is near the CPU and has a long, rectangular shape. Remove the slot cover and set it aside. Set aside. Hmm. It didn't tell me how many slot covers to remove unfortunately. Well, I guess that's how we're doing it, 'cause it only told me to remove one. We're wrenching on that a little bit. Oh, I mean technically it's in there. It's not pretty, but it's in. It did tell me to plug in my power cables so I'm gonna go ahead and do that. We've got dual eight pins on this GPU. Chatbot suggested I have cable ties at the ready earlier but never actually instructed me to use them. I mean, still looking pretty good all things considered. We're really close to the end now, but we have no idea how close we are to our original budget. This is not what I was expecting. Generally speaking, the chatbot doesn't like to talk about exact dollar figures, just like it doesn't like to give instructions for doing anything nefarious. And what I had wanted to show you guys was the workarounds that you can use in the event that it doesn't want to answer you. So if you ask it to maybe tell you a story, it's far more likely to give you instructions versus if you just ask how to bruteforce a wifi password. We don't need to go monitor shopping. It absolutely loves this Alienware AW3420DW monitor. It's gotta be Dell! We don't actually have that exact model but we do have the successor, so we're gonna use that as a placeholder here. What the hell is going on here? What the hell? Did we tape this back together? With this choice of monitor, even if we had the last gen one the budget is clearly broken. But it also did clearly state that it is not really gonna be able to help us stick to a budget because it can't search the internet. It's kind of shocking how close it got actually. Before it recommended this high-end monitor, we were at just over $1,300, which is plenty of budget left over for a decent gaming display and keyboard and mouse. And I'm not gonna give it a total fail for the monitor because we could have easily given it more context. Oh, this is much more reasonable. I wonder how much of its ability to select a gaming display is dependent on keywords like G-Sync. Ooh, it recommends the AOC C24G1A. 145 bucks on eBay. $280 new. That's a lot more like it. G Pro X mechanical keyboard and a G Pro wireless gaming mouse. (sighs) - [Crew Member] Yay! - That's definitely more affordable. Good budget options. Yeah! (laughs) LTT desk pad wins! In case you're wondering, it never told me to put the panels back on, so that's where we're at. (upbeat music) And this is it. Gaming on an AI designed and guided PC, playing Cyberpunk 2077, but I don't even think that this was the best use of it. What about troubleshooting? You notice things are looking a little wide. Let's see what ChatGPT has to say about that. You gotta set your resolution, your aspect ratio! It just knows, you guys! But now my frame rate's stuttering a bit. How can I make it more smooth? Update your drivers. Ooh, adjust your graphic settings. Maybe it's too high for your hardware to handle. That's great advice, great advice. Thanks for watching. I hope you found this information helpful and useful for building your own gaming PC. Please leave a comment below and I'll do my best to respond. I won't. Thanks again and happy gaming.",
    "transcript_keywords": [
        "case",
        "motherboard",
        "CPU",
        "gaming",
        "chatbot",
        "power supply",
        "power",
        "instructions",
        "install",
        "good",
        "HubSpot",
        "HubSpot CRM",
        "performance",
        "video",
        "Ryzen",
        "ChatGPT",
        "put",
        "CRM",
        "build",
        "budget"
    ],
    "transcript_entity_values": [
        "ASRock",
        "3070",
        "one",
        "eBay",
        "SSD",
        "eight",
        "HubSpot",
        "Dark Rock Pro 4",
        "EVGA",
        "GPU",
        "the Ryzen 7",
        "RAM",
        "Dell",
        "AI",
        "Cyberpunk 2077",
        "AMD",
        "LTT",
        "Cooler",
        "the Thermaltake Core V1 Mini-ITX Cube",
        "280",
        "Linus",
        "just over $1,300",
        "a million",
        "Linux",
        "24",
        "Mm",
        "G Pro",
        "English",
        "B550",
        "first",
        "a week",
        "First",
        "970",
        "SuperNOVA 750 watt 80-plus",
        "3070",
        "Ryzen",
        "CRM",
        "1500 US dollar",
        "CPU",
        "M3",
        "Gold Fully Modular Power Supply",
        "The Ryzen 9 5800X.",
        "6-32",
        "Intel",
        "ATX",
        "Ryzen 5000",
        "GPT",
        "2021",
        "SD",
        "H510",
        "HubSpot CRM",
        "16",
        "Mini-ITX",
        "750 watt SuperNOVA",
        "PG Riptide",
        "1 terabyte",
        "5800X",
        "Noctua NH-D15",
        "two",
        "Core",
        "millions",
        "G-Sync",
        "AOC",
        "NZXT",
        "second",
        "two terabyte",
        "Elite",
        "145 bucks",
        "daily",
        "5,600X",
        "a few days ago",
        "today",
        "3,600",
        "PCI",
        "RAM",
        "8",
        "Asrock",
        "at least 3,200",
        "DIMM",
        "Alienware",
        "Cooler Master Hyper 212 EVO",
        "5800X",
        "IO"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "LANGUAGE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "NORP",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE"
    ],
    "vector": [
        -0.07667812705039978,
        -0.06905003637075424,
        0.010235334746539593,
        -0.07742530107498169,
        0.12976111471652985,
        0.01849888637661934,
        0.0914691835641861,
        0.046400804072618484,
        -0.005027778912335634,
        0.0071788933128118515,
        -0.03558400273323059,
        -0.026616191491484642,
        -0.06277633458375931,
        -0.051850948482751846,
        -0.0005624702898785472,
        0.03809604421257973,
        0.05656794086098671,
        -0.12268638610839844,
        -0.047331735491752625,
        -0.027441665530204773,
        0.0319480374455452,
        -0.037915781140327454,
        0.032848477363586426,
        -0.017094852402806282,
        0.019350456073880196,
        -0.00853742752224207,
        0.03169376775622368,
        -0.009058604016900063,
        0.04316413775086403,
        0.008689848706126213,
        0.025076083838939667,
        0.03527887910604477,
        0.01847311668097973,
        0.021508200094103813,
        -0.017198454588651657,
        0.00040262137190438807,
        -0.030865076929330826,
        -0.07104922831058502,
        -0.05904595926403999,
        -0.017499463632702827,
        0.018687136471271515,
        -0.06047463044524193,
        -0.00829680822789669,
        -0.030982643365859985,
        0.06389413774013519,
        0.006941137835383415,
        -0.03790939599275589,
        -0.030608225613832474,
        0.010146901942789555,
        0.09406084567308426,
        -0.1043625921010971,
        -0.08454478532075882,
        0.012083339504897594,
        -0.04275248199701309,
        -0.061326660215854645,
        0.10216130316257477,
        -0.005482323467731476,
        0.039781469851732254,
        0.054161909967660904,
        -0.04851793497800827,
        0.08328010141849518,
        -0.09843850135803223,
        -0.01788387820124626,
        0.06943672895431519,
        0.01590071991086006,
        -0.01814904995262623,
        -0.027015551924705505,
        0.08214720338582993,
        -0.01954972743988037,
        -0.02792847529053688,
        0.06394612789154053,
        -0.015575610101222992,
        -0.026386916637420654,
        0.07085905969142914,
        0.0009007503977045417,
        0.025607556104660034,
        0.0023088797461241484,
        -0.0431787446141243,
        0.025521162897348404,
        -0.010675405152142048,
        0.016432028263807297,
        3.9657665183767676e-05,
        0.048798203468322754,
        -0.052120767533779144,
        -0.03829661384224892,
        0.012150117196142673,
        0.06369753181934357,
        0.016981026157736778,
        0.015885435044765472,
        -0.03868669643998146,
        -0.050004180520772934,
        0.0286992397159338,
        0.0777881070971489,
        0.04929732158780098,
        0.013528255745768547,
        0.07470624148845673,
        -0.007951091043651104,
        -0.07924140244722366,
        -0.05483054369688034,
        0.11960343271493912,
        -0.034971948713064194,
        0.031659357249736786,
        -0.018634721636772156,
        -0.05484383925795555,
        -0.08848635107278824,
        -0.010306641459465027,
        -0.0008002756512723863,
        0.0742199495434761,
        0.04601422697305679,
        0.013239030726253986,
        -0.09161747992038727,
        0.03350631520152092,
        -0.016426311805844307,
        -0.028135621920228004,
        0.0550653375685215,
        0.020707035437226295,
        -0.039093296974897385,
        0.036768388003110886,
        0.04493176192045212,
        -0.020746499300003052,
        0.04192366823554039,
        -0.03206169977784157,
        -0.003004658268764615,
        0.037830229848623276,
        0.00966843031346798,
        0.038882777094841,
        -0.04632940888404846,
        -1.6247798629790817e-33,
        -0.0025336763355880976,
        -0.007857192307710648,
        -0.0008347133989445865,
        0.017212489619851112,
        0.053866103291511536,
        -0.012018631212413311,
        0.0009178588516078889,
        0.012034399434924126,
        -0.06852080672979355,
        -0.01894374191761017,
        -0.03306734189391136,
        -0.028014251962304115,
        -0.04621770977973938,
        0.031073221936821938,
        0.013277068734169006,
        -0.057105083018541336,
        -0.03192761167883873,
        0.03711611405014992,
        0.041819971054792404,
        -0.042917609214782715,
        -0.0012308037839829922,
        -0.010200638324022293,
        0.01777040585875511,
        -0.0026490511372685432,
        0.06467042118310928,
        -0.017978783696889877,
        -0.0068420832976698875,
        -0.06661462783813477,
        0.11026190966367722,
        0.02966221049427986,
        -0.06140010803937912,
        -0.006594707723706961,
        -0.06308756023645401,
        -0.03372811898589134,
        -0.011212872341275215,
        0.0005441656103357673,
        -0.07655052840709686,
        -0.12133564054965973,
        -0.027425453066825867,
        0.08089891821146011,
        0.005424986127763987,
        -0.01316774357110262,
        -0.05042329803109169,
        -0.15219266712665558,
        -0.04434956982731819,
        0.009337673895061016,
        0.05440258979797363,
        -0.025501849129796028,
        -0.0013253899523988366,
        0.009319106116890907,
        -0.05726777762174606,
        0.03394753858447075,
        -0.05159453675150871,
        -0.03216250240802765,
        0.05429742857813835,
        -0.11544124782085419,
        -0.05087839439511299,
        -0.06410815566778183,
        0.0541750006377697,
        -0.0074799079447984695,
        0.027771858498454094,
        -0.040428001433610916,
        0.013410710729658604,
        0.005761286243796349,
        -0.07660470902919769,
        0.012928890995681286,
        0.05839826911687851,
        -0.0021855372469872236,
        0.007208126597106457,
        0.004068075679242611,
        0.012530510313808918,
        -0.01225160900503397,
        -0.010743048042058945,
        -0.007488260045647621,
        -0.046749502420425415,
        0.01723777875304222,
        -0.12868627905845642,
        -0.012218935415148735,
        -0.019253870472311974,
        0.030393388122320175,
        -0.07766389101743698,
        -0.011880691163241863,
        0.011185083538293839,
        -0.02061350643634796,
        0.054715704172849655,
        -0.03910455480217934,
        0.013653922826051712,
        -0.05559271201491356,
        0.0125497467815876,
        -0.0008570653153583407,
        -0.12017122656106949,
        0.031038863584399223,
        -0.07089443504810333,
        0.016471026465296745,
        -0.07903432846069336,
        -9.235661668093973e-34,
        -0.13214099407196045,
        0.0410161018371582,
        -0.05787989869713783,
        0.05676501616835594,
        0.043075449764728546,
        0.00848696380853653,
        0.020494697615504265,
        -0.0713491439819336,
        0.0705636665225029,
        0.04774448275566101,
        -0.0182355847209692,
        -0.012415056116878986,
        -0.05873505026102066,
        -0.06266117841005325,
        0.05307640880346298,
        -0.06297638267278671,
        0.039609767496585846,
        -0.09570552408695221,
        -0.03126024082303047,
        -0.02862277254462242,
        0.06423104554414749,
        0.004754741210490465,
        -0.04283628985285759,
        0.03417939692735672,
        0.08495599031448364,
        0.004476358648389578,
        0.019876156002283096,
        0.046680424362421036,
        0.0065739331766963005,
        0.07669401168823242,
        0.08095913380384445,
        0.003043054137378931,
        -0.1225263774394989,
        0.03286387026309967,
        0.07691963762044907,
        0.05857713520526886,
        0.11968573927879333,
        0.0241018645465374,
        -0.08104145526885986,
        -0.018552202731370926,
        0.05935570225119591,
        -0.05677931755781174,
        -0.10727337002754211,
        -0.003804098814725876,
        0.00824559386819601,
        -0.0592743456363678,
        0.0065210601314902306,
        -0.046872954815626144,
        -0.01695617474615574,
        -0.01632806845009327,
        0.056676700711250305,
        -0.06048654019832611,
        0.1365361213684082,
        -0.044285427778959274,
        -0.10550731420516968,
        0.007266073487699032,
        0.05623730644583702,
        0.046095892786979675,
        -0.009762991219758987,
        -0.03980410844087601,
        0.06796439737081528,
        -0.05790948122739792,
        -0.02897128462791443,
        -0.06394254416227341,
        0.030989134684205055,
        -0.047561921179294586,
        0.04432317614555359,
        0.0742562785744667,
        -0.044311508536338806,
        -0.059426065534353256,
        0.014189561828970909,
        -0.013038937002420425,
        -0.013252281583845615,
        -0.019618971273303032,
        -0.03514370322227478,
        0.06815796345472336,
        0.07368679344654083,
        0.004510899540036917,
        0.029506145045161247,
        -0.08259640634059906,
        -0.015174457803368568,
        -0.015856679528951645,
        0.14060916006565094,
        0.01983167789876461,
        0.08839906007051468,
        0.01020966935902834,
        0.01846078597009182,
        -0.020880432799458504,
        -0.023521704599261284,
        0.040614306926727295,
        -0.046875473111867905,
        0.03187888488173485,
        -0.01871649920940399,
        0.09806033968925476,
        0.027937011793255806,
        -5.607688180475634e-08,
        -0.03455205634236336,
        -0.03457419201731682,
        -0.024470511823892593,
        0.06902287155389786,
        0.004981738515198231,
        -0.025158045813441277,
        -0.0027827173471450806,
        -0.04276064410805702,
        0.018773814663290977,
        0.0008031234028749168,
        -0.019547460600733757,
        -0.09889505058526993,
        -0.017467327415943146,
        0.0655786544084549,
        0.07069046050310135,
        -0.0025713336654007435,
        -0.04494239762425423,
        0.07984259724617004,
        -0.059847984462976456,
        -0.056301433593034744,
        0.038031648844480515,
        0.042409323155879974,
        0.050241995602846146,
        -0.004408110864460468,
        -0.023694287985563278,
        -0.04583731293678284,
        0.06622704863548279,
        0.08935818821191788,
        0.016561785712838173,
        0.02149232104420662,
        -0.0712243914604187,
        0.005680096801370382,
        -0.02131696790456772,
        0.005764564033597708,
        0.07319613546133041,
        -0.03688342869281769,
        -0.017167266458272934,
        0.06357507407665253,
        0.05300973728299141,
        0.03963851183652878,
        -0.0517851784825325,
        0.05077380686998367,
        0.0503537692129612,
        0.004513388033956289,
        0.04538317769765854,
        -0.008000459522008896,
        -0.10517783463001251,
        -0.1543012410402298,
        0.020249517634510994,
        -0.032306186854839325,
        -0.021477075293660164,
        0.01203226763755083,
        0.036572083830833435,
        0.09754188358783722,
        0.1105593740940094,
        -0.026397766545414925,
        -0.014930149540305138,
        0.038466475903987885,
        -0.021541211754083633,
        0.026344673708081245,
        -0.012826412916183472,
        0.00990277249366045,
        0.006802303250879049,
        0.03580255061388016
    ]
}