{
    "id": "kvN5_GXlg2Y",
    "title": "Apple's Forbidden Words",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-06-15T21:06:03Z",
    "video_url": "https://www.youtube.com/watch?v=kvN5_GXlg2Y",
    "category": "Science & Technology",
    "tags": [
        "Apple's forbidden words",
        "forbidden words",
        "Apple words",
        "augmented reality",
        "virtual reality",
        "MKBHD",
        "vision pro",
        "apple vr",
        "apple virtual reality",
        "apple vision pro",
        "Palabras prohibidas de Apple",
        "palabras prohibidas",
        "palabras de Apple",
        "realidad aumentada",
        "realidad virtual",
        "realidad virtual de apple"
    ],
    "views": 3272708,
    "likes": 128768,
    "comments_count": 5879,
    "description": "There's a few words that Apple literally never says on stage. Just something interesting I noticed  MKBHD Merch:   The Truth About AI Art:   The list of Apple trademarked terms:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://youtu.be/0gNauGdOkro",
        "https://www.apple.com/legal/intellectual-property/trademark/appletmlist.html",
        "https://www.amazon.com/shop/MKBHD",
        "https://lnk.to/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Hey, what's up? MKBHD here. And did you notice something? I've been thinking a lot about this over the past couple years of watching Apple presentations, and it just became much more obvious watching their latest, which was WWDC. Because in this presentation, Apple went through 45 minutes on stage talking about their new Vision Pro headset, and they didn't say the words virtual reality on stage once. And just in general, there are certain words that Apple just refuses to say or generally doesn't like to reference at all in any of their presentations or any of their marketing, and it's fascinating to watch. So, what are those words, and why is Apple doing this? So let me start with the why. Now, obviously, I'm not Apple, so this is from the outside looking in, but there are two really good reasons for why they do what they do or why they don't say what they don't say, and those are control and comparison. So control first. I've already talked about Apple, and a big reason for a lot of what they do is being able to fully control over everything as much as possible, and that extends to PR too. It doesn't even have to be PR. It's just smart branding. But if you come out with a new product and you associate it heavily with a word that the general public already uses or that another company, some competitors are already using heavily for a bunch of different things, then you run the risk that the sentiment around that word might actually change and might actually have a downturn at some point in the future, thus dragging the whole reputation of your product down with it. So here's another commonly never used word in Apple presentations, AI. Apple just doesn't say artificial intelligence on stage. Now, if you want some contrast, go back just a few weeks ago to Google's developer conference, just Google I/O, and they introduced a bunch of features on stage in Android and in Chrome, and let's just say they weren't shy about what was powering it. - As an AI-first company, AI, AI, AI, AI, generative AI, generative AI, generative AI, AI, AI, AI, AI, AI, AI, AI, AI. So I mean, pretty clearly, they love leaning into that, but Apple, on the other hand, also introduced, at their developer conference, WWDC, a bunch of software features in iOS and macOS, and they used the words AI or artificial intelligence on stage exactly zero times. They never said it. Now, they did use phrases like machine learning and ML, and they talked about how a transformer model is being run local on device that will help auto-correct in the new keyboard in iOS 17, things like that, but at no point did they call themselves an AI-first company or proudly proclaim that they have a bunch of new features powered by AI to show us today. Nothing like that. And I think that's because clearly AI is such a big thing that it kinda has this public persona that also has a bit of a dark side. It's a bit of a controversial word in some areas. We've talked about how AI art is sometimes accused of stealing from real artists. I made a whole video about that. I'll have a link below. And so the word is so much that if you're Apple, and you care so much about your public image, you don't wanna risk attaching yourself to that word that you can't control, so they just don't. They literally just don't say it. So that's control. The other thing, like I said, is comparison, and this is a funny one too with Apple. So if you've ever watched an Apple presentation, which most of us have, there are some pretty common themes that you see every time. You see the high production value, a variety of presenters, unlabeled graphs, Craig's power stance. But as a tech reviewer, one thing I've also noticed, and I think any other journalist or anyone covering these companies probably also notices to a point is that Apple just kind of avoids comparing themselves or even talking about or acknowledging other companies or other products at all. They kinda just like to pretend that they're the only company in the world, and they exist in this little ecosystem of just Apple stuff, and other stuff just sort of fades away. Now, there are a few notable exceptions to this rule. They do every once in a while mention, \"Oh, our new laptop is X% faster than the most popular PC laptop,\" or something like that. They'll do that once in a while. But really, in general, they do it far less than the other companies. Especially, I've watched it a lot in the smartphone space. If you watch another smartphone product unveiling, a lot of 'em will do straight up spec comparisons to others and just number comparisons. \"Our folding phone has a new 4,800 milliamp hour battery, which makes it the biggest battery in any foldable in this category. Oh, our new phone has a 200 megapixel camera, which makes it the highest resolution ever in a smartphone. Oh, our new display refreshes at 165 hertz, making it 20% more responsive than the next best thing.\" All this stuff. Apple doesn't really like to do this type of comparison. Instead, they would much rather name everything. Now, I'm not just talking about the products. Of course, they name things like the iPhone, and the Mac, and the AirPods. And the software also has extremely functional names. You have iOS, iPadOS, macOS, watchOS, tvOS, visionOS, but they also like to take technical achievements and technical features and brand them. Put a name on them. They name everything. So instead of 120 Hertz high refresh rate LTPO display, we've got ProMotion. - ProMotion. - [Marques] Instead of an optical fingerprint reader, we have TouchID. - TouchID - Instead of a large linear vibration motor, it's a Taptic Engine. Instead of the latest version of glass from their supplier, it's Ceramic Shield. - Ceramic Shield. - Now of course everyone knows the value of good catchy branding, but when you brand something for yourself, instead of using the term that everyone else uses, that specifically makes your version a little bit harder to compare to everyone else's. So while all the other companies are talking about, okay, we got to 120 Hertz, but now we've got to 144 hertz, and now our gaming phone is 165 hertz, so it's 15% more responsive than their 144 hertz. And apple's over here, like, \"We have ProMotion and this version of ProMotion is more responsive and smooth than any other ProMotion we've ever had.\" They hardly ever use IP68 or IP67 on stage as much as they just like saying it's dust and water resistant again. And there's hole punch cutouts in the top of the AMOLED display of every other phone in the store, but ours, with our software on top, is a Dynamic Island. - Dynamic Island. - There's actually a whole page of these just on Apple's site. I'll link it below, just trademarked names of things that they've put their stamp on. Some are programs, some are features, some technologies, and there's a lot of them. Clearly, they're not the only ones who do this, but it's just the most consistent thing about all of their presentations. And the cherry on top of all of this is, a lot of times, Apple doesn't even really like saying at all ever what the actual spec is. They'll leave it to you to find out later and tech reviewers will really dig in and figure it out. But when's the last time you ever saw the milliamp hour size of an iPhone mentioned in the keynote? The last time I checked, they just don't do that ever. They'll just tell you it's the longest battery life of any iPhone we've ever made. That is the epitome of control and comparison. Now with the new Vision Pro headset that Apple just unveiled, in particular, It's interesting. It's really interesting. I made a whole video just on I got to try it and my first impressions with it. If you somehow haven't seen that yet, I'll link it below. But it's also pretty clear based on what we know that Apple has future plans with this, to make it cheaper of course, but to also make it smaller and higher tech, and better, and better to the point where the tech sort of just fades away, and you have a pair of glasses that you look through and still have all of the technology and function from. So they never really want to call the Vision Pro a VR headset, even though it totally is, because of the ambitions that they have to steer this vision and the control that they have, no pun intended, towards mostly AR stuff. So you'll see all kinds of demos in the videos of a virtual reality headset with really good pass through. Like when you go into that theater demo for one, like you're in complete darkness with a huge screen in front of you. I mean, that's literally a VR headset, but they want to steer you so much towards thinking of vision as an augmented reality experience and that's much easier if you just never say virtual reality out loud at all. The closest they got was talking about how you can spin the digital crown and fully immerse yourself beyond the dimensions of your physical room with features called Environments. And there it is, they've managed to brand virtual reality with a different name so they can control it and manage what it's compared to over time. They also didn't say a whole lot about the specs on stage. Part of it, of course, is because this is something that's coming out early next year, so it's not done. Maybe some things change between now and then, but they still didn't say a refresh rate on stage. They didn't say a field of view number in degrees. They avoided a lot of the things that pretty much every other VR headset and maker out there would put in their presentation. But there was no shortage at all of naming things and setting the tone for how they want us to think about this headset going forward. So the next time you're watching an Apple presentation or some keynote, there's a lot of impressive things to pay attention to. The graphics, the transitions, the drone shots, the power stances, but it's the words. Pay attention to the words. Thanks for watching. Catch you guys in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "Apple",
        "Apple presentations",
        "lot",
        "things",
        "stage",
        "control",
        "words",
        "word",
        "Vision Pro",
        "watching Apple presentations",
        "hertz",
        "Vision Pro headset",
        "headset",
        "thing",
        "Vision",
        "features",
        "time",
        "presentations",
        "talking",
        "ProMotion"
    ],
    "transcript_entity_values": [
        "Craig",
        "iOS 17",
        "macOS",
        "AI",
        "15%",
        "today",
        "AMOLED",
        "Apple",
        "200 megapixel",
        "4,800 milliamp hour",
        "one",
        "Hertz",
        "apple",
        "144",
        "Dynamic Island",
        "45 minutes",
        "early next year",
        "IP67",
        "Android",
        "Ceramic Shield",
        "first",
        "just a few weeks ago",
        "165",
        "AirPods",
        "the Vision Pro a VR",
        "iPhone",
        "zero",
        "Google",
        "Vision Pro",
        "Chrome",
        "ProMotion",
        "Mac",
        "two",
        "the past couple years",
        "120",
        "WWDC",
        "ML",
        "20%"
    ],
    "transcript_entity_types": [
        "PERSON",
        "EVENT",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "PERCENT"
    ],
    "vector": [
        0.007152072619646788,
        -0.027002055197954178,
        0.06329372525215149,
        -0.06992044299840927,
        0.0890083983540535,
        0.011491137556731701,
        0.07474152743816376,
        -0.03445398434996605,
        0.07308654487133026,
        -0.0824725478887558,
        -0.0005946812452748418,
        -0.018439283594489098,
        -0.0046920496970415115,
        -0.10204797983169556,
        -0.021394828334450722,
        -0.0035153026692569256,
        0.11206137388944626,
        -0.05149057134985924,
        -0.056903671473264694,
        0.02953646145761013,
        0.07350252568721771,
        0.06568209826946259,
        0.010356076061725616,
        0.03585987538099289,
        0.02605775184929371,
        0.08071120083332062,
        -0.026088625192642212,
        -0.025328587740659714,
        -0.018481643870472908,
        0.014249861240386963,
        -0.00793598871678114,
        0.09049313515424728,
        0.07457698881626129,
        0.06788090616464615,
        -0.0007452918798662722,
        -0.04122983291745186,
        0.0010283569572493434,
        -0.0018487201305106282,
        -0.10999494791030884,
        -0.09416447579860687,
        -0.06156235188245773,
        -0.0317043773829937,
        -0.02407999522984028,
        0.05922159180045128,
        0.01635058969259262,
        0.005385367199778557,
        0.011613897979259491,
        -0.05591752007603645,
        -0.01502043753862381,
        0.06286423653364182,
        -0.09334740042686462,
        -0.13667349517345428,
        0.04857850819826126,
        -0.00035272393142804503,
        -0.021870318800210953,
        0.036398012191057205,
        0.023070523515343666,
        0.06310399621725082,
        0.06637480854988098,
        0.046107176691293716,
        0.06742293387651443,
        -0.07093311846256256,
        0.019483229145407677,
        0.013068311847746372,
        -0.02765011042356491,
        -0.06531904637813568,
        -0.0007410963880829513,
        0.031842585653066635,
        -0.03714035451412201,
        -0.023717673495411873,
        0.08272764831781387,
        -0.007441019173711538,
        0.08901923894882202,
        0.04143795743584633,
        0.036404699087142944,
        0.014812645502388477,
        0.02850918658077717,
        -0.11796746402978897,
        0.015056230127811432,
        -0.06219799071550369,
        0.04441407322883606,
        -0.03736653923988342,
        0.019908364862203598,
        -0.028210453689098358,
        -0.06112164258956909,
        0.027357039973139763,
        -0.047812677919864655,
        -0.08842560648918152,
        -0.04410465806722641,
        0.04558209702372551,
        -0.11628954112529755,
        -0.08052314817905426,
        -0.03576335310935974,
        -0.05149850621819496,
        0.07906125485897064,
        -0.06437613070011139,
        -0.07549582421779633,
        -0.04736997187137604,
        0.04542924091219902,
        0.03925127536058426,
        0.004177822731435299,
        0.04368535429239273,
        0.02585490047931671,
        -0.016031088307499886,
        -0.05331598222255707,
        -0.10959615558385849,
        -0.022602610290050507,
        -0.0026430608704686165,
        0.0005791953881271183,
        0.06737799942493439,
        -0.024574801325798035,
        0.0054894788190722466,
        -0.022743167355656624,
        -0.04039386659860611,
        0.006759165320545435,
        0.05789753422141075,
        -0.055509667843580246,
        0.03501997888088226,
        0.0887780711054802,
        -0.04148099198937416,
        -0.01046424638479948,
        0.10026229918003082,
        0.015238034538924694,
        0.002593772718682885,
        -0.05259993299841881,
        -0.05823523551225662,
        -0.027890492230653763,
        1.312414463438129e-33,
        -0.003134693717584014,
        0.020288584753870964,
        -2.205542659794446e-05,
        -0.005871564149856567,
        0.03315217047929764,
        -0.11321297287940979,
        -0.024269718676805496,
        0.023836012929677963,
        0.047764427959918976,
        0.03281598910689354,
        0.03595544025301933,
        0.010223506018519402,
        0.014235625974833965,
        0.04105306789278984,
        0.04165763780474663,
        -0.07619162648916245,
        -0.04470135644078255,
        -0.0009048900101333857,
        -0.05601074919104576,
        0.000950795307289809,
        0.01920662261545658,
        0.047465886920690536,
        0.03462834283709526,
        -0.01739041693508625,
        -0.09984814375638962,
        -0.0012622622307389975,
        0.008030385710299015,
        -0.04130839183926582,
        0.1103523001074791,
        0.0401964895427227,
        -0.08744078129529953,
        0.024602003395557404,
        0.05308637022972107,
        -0.08602587133646011,
        0.00836485531181097,
        -0.010151179507374763,
        -0.012650838121771812,
        -0.06649531424045563,
        0.02309168316423893,
        -0.01351761445403099,
        -0.07103759795427322,
        0.0008890078752301633,
        -0.055160198360681534,
        -0.0667395293712616,
        -0.007161625660955906,
        0.10299801081418991,
        -0.02485695481300354,
        -0.02436196058988571,
        -0.05741623416543007,
        0.07887258380651474,
        -0.03185350075364113,
        0.016806554049253464,
        0.06520577520132065,
        -0.02922843210399151,
        0.02625960297882557,
        0.012799883261322975,
        0.03392450511455536,
        -0.038579657673835754,
        -0.015520376153290272,
        0.020694579929113388,
        -0.012456716038286686,
        0.07439519464969635,
        0.05003971979022026,
        0.05482996627688408,
        -0.0417080894112587,
        0.07894686609506607,
        0.03903196007013321,
        0.003902609460055828,
        -0.02046957239508629,
        0.06031963601708412,
        -0.04676203802227974,
        0.01136576198041439,
        -0.015117851085960865,
        -0.03360779210925102,
        -0.03249071538448334,
        -0.08450999110937119,
        -0.032036423683166504,
        0.019019553437829018,
        -0.019308701157569885,
        0.010569843463599682,
        -0.03973377123475075,
        -0.014391210861504078,
        -0.03632736951112747,
        0.0012785227736458182,
        -0.0985049232840538,
        0.003668634919449687,
        -0.05979025736451149,
        -0.030840858817100525,
        -0.032759614288806915,
        0.04942842945456505,
        -0.04866925999522209,
        0.04244166612625122,
        -0.05591101944446564,
        0.024556471034884453,
        -0.11845193058252335,
        -4.5690058496661175e-33,
        0.028009586036205292,
        -0.060760561376810074,
        -0.05258479341864586,
        -0.008028707467019558,
        -0.04331451281905174,
        0.016617154702544212,
        0.042620062828063965,
        0.059367623180150986,
        0.023485243320465088,
        -0.06293468922376633,
        0.03044503554701805,
        -0.0233658067882061,
        -0.07727965712547302,
        -0.022264879196882248,
        -0.020082196220755577,
        -0.09133134037256241,
        0.036187391728162766,
        0.002095605945214629,
        0.007157693151384592,
        0.11496373265981674,
        0.06313282996416092,
        0.02071554586291313,
        -0.048469528555870056,
        -0.04747864976525307,
        0.00935226771980524,
        -0.0076936460100114346,
        0.021919241175055504,
        0.0800478532910347,
        0.007453715894371271,
        0.03129834681749344,
        0.04892913997173309,
        0.039026882499456406,
        -0.03692855313420296,
        0.004601712338626385,
        0.04346013069152832,
        0.047177497297525406,
        -0.052316632121801376,
        -0.0301800649613142,
        -0.043364983052015305,
        -0.028378624469041824,
        0.02534935623407364,
        0.025061490014195442,
        -0.050599776208400726,
        -0.012580467388033867,
        -0.04564960300922394,
        0.02374749630689621,
        -0.1178947314620018,
        0.036176592111587524,
        0.028721986338496208,
        -0.023221023380756378,
        0.03182040899991989,
        -0.03269163519144058,
        -0.01506834477186203,
        -0.02798015996813774,
        -0.0999591127038002,
        -0.010079929605126381,
        -0.1021350845694542,
        0.038634203374385834,
        0.0276612751185894,
        0.029395464807748795,
        0.08752118051052094,
        0.012607141397893429,
        -0.007701115682721138,
        -0.12908697128295898,
        -0.023607447743415833,
        0.012044471688568592,
        -0.018820952624082565,
        0.02536775916814804,
        0.05780346691608429,
        -0.0115957111120224,
        0.06432449072599411,
        0.025337813422083855,
        -0.06698031723499298,
        -0.010954556986689568,
        -0.09156486392021179,
        0.020422425121068954,
        0.010749268345534801,
        -0.06395500898361206,
        -0.0760868564248085,
        -0.04227345436811447,
        0.0366780050098896,
        0.08645845949649811,
        0.05524561181664467,
        0.11994198709726334,
        0.08589533716440201,
        0.1112678125500679,
        -0.09171200543642044,
        0.03776577487587929,
        -0.0473063662648201,
        0.074906125664711,
        0.05468365550041199,
        -0.04834557697176933,
        -0.04483577609062195,
        0.12445549666881561,
        -0.11304018646478653,
        -5.176095285719384e-08,
        -0.07915639132261276,
        -0.04885515570640564,
        0.009631055407226086,
        -0.07041160762310028,
        0.031497810035943985,
        -0.04234810173511505,
        0.0121723348274827,
        -0.01720346137881279,
        0.03566602244973183,
        -0.046599142253398895,
        -0.010210486128926277,
        -0.04455800727009773,
        -0.10490268468856812,
        0.0665905773639679,
        0.042936500161886215,
        0.052674513310194016,
        -0.05214130878448486,
        0.0531461201608181,
        0.006860742345452309,
        -0.03324466571211815,
        -0.041017863899469376,
        0.02868979051709175,
        0.018825646489858627,
        -0.03591025620698929,
        -0.032739002257585526,
        0.0746229961514473,
        -0.02164333313703537,
        -0.005329967010766268,
        0.01929295063018799,
        0.06729631870985031,
        0.027446798980236053,
        0.042269039899110794,
        -0.05188613012433052,
        -0.04155510291457176,
        0.01827392727136612,
        0.002904880093410611,
        -0.04058506712317467,
        -0.0007594462367706001,
        0.031998708844184875,
        0.02237117663025856,
        -0.05617370083928108,
        -0.04447846859693527,
        0.028686249628663063,
        0.01843300648033619,
        0.004406843800097704,
        0.004153501708060503,
        -0.007211382035166025,
        -0.006608464755117893,
        0.018304234370589256,
        0.05386359617114067,
        -0.02868451550602913,
        0.008811659179627895,
        -0.0032357159070670605,
        0.0695800706744194,
        0.03257136791944504,
        0.034415215253829956,
        0.05498180910944939,
        -0.013339079916477203,
        -0.05307028442621231,
        0.06454877555370331,
        0.09022942930459976,
        -0.0172868799418211,
        0.06694759428501129,
        0.06906367093324661
    ]
}