{
    "id": "kXzCejBVnTA",
    "title": "HP made it BETTER!!! - Spectre X360 14\"",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-12-31T21:31:54Z",
    "video_url": "https://www.youtube.com/watch?v=kXzCejBVnTA",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Spectre",
        "x360",
        "Laptop",
        "14 Inch",
        "Intel 11th Gen",
        "Iris XE integrated graphics",
        "PC",
        "Notebook",
        "Alex",
        "Unboxing",
        "2-in-1",
        "Type C"
    ],
    "views": 741405,
    "likes": 26006,
    "comments_count": 1390,
    "description": "Check out the DROP THX Panda Wireless headphones today at   HP Spectre x360 Laptops this year was already pretty good but I guess they decided to make it better! See what Alex thinks and how they made it better!  Buy HP Spectre x360 14\" Laptop On HP (PAID LINK):  On Amazon (PAID LINK):    On BestBuy (PAID LINK):   Buy Dell XPS 15 9500 On Amazon (PAID LINK):  On NewEgg (PAID LINK):   On BHPhoto (PAID LINK):  On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dro.ps/shortcir-panda",
        "https://howl.me/chrOhdePywu",
        "https://geni.us/MesZ7B",
        "https://geni.us/BuS8keJ",
        "https://geni.us/GGov",
        "https://geni.us/Zu6IJ",
        "https://geni.us/KswDnFk",
        "https://geni.us/8yptO3",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- And here we have the brand new HP Spectre x360 14 inch and it is the epitome of listening to what people want. So HP had this problem before where they're kind of only two reasons that you would get a Spectre x360 laptop. The first is that you couldn't afford a Dell XPS 13 2-in-1 and the second is that you had never heard of HP's Envy lineup because their Envy x360 was basically, especially with the AMD processor, nearly as good in every single way and also outperformed it and had better battery life and was a lot cheaper. But HP finally has updated their Specter lineup so I'm really excited to check this out. Alright, let's get the unboxing it I guess. This unboxing is 100% a lie, I've actually been using this for about a week cause I could not wait to open it up. (chuckles) - [Jono] You took it home? - Yeah I took it home. I used it over all of Christmas break. (laughing) Here we have a little leather carrying case. I love the HP includes these in their laptops. And the star of the show here. Du-du-du-du... (box toots) Oh. (laughing) Excuse you HP. Alright well, let's get past the laptop for a second. But you do get a pen with this. It attaches magnetically to the side and also it goes into the, oh, where did it go? And also it goes into your little leather carrying case right here. So you should be, you'd have a decent time at not losing this. Onto the power brick, cute little Type-C do add. That is, let's see, 65 watts, not too bad. It's also awesome that it's Type-C because I didn't even open this up over the past week because I could just use chargers that I already had around the house. And on to the main event. (Jono exclaims) Yeah. (chuckles) Here it is. And actually, Jono what do you think of the look of this? - [Jono] Looks pretty good. Like it doesn't look too shiny or showy. - Yeah, what really surprised me about it though is that when I showed it to my girlfriend who I think is the key demographic for this, has a business degree, currently owns a surface laptop, she absolutely hated it. She would have this nowhere near her at all. She was like, that is the stupidest looking thing ever. What is fantastic on this is the IO. So we have a little micro SD card reader, Thunderbolt 4, I believe headphone and then another Thunderbolt 4 port there. Then on the side, you get a single USB Type-A which is so awesome compared to something like the XPS 13. I guess let's get into our sponsor really, who's it Drop Panda? The Drop + THX Panda wireless headphones provide an audio file audio experience without the wires. It has a THX AAA technology amplifier, it has a detachable gaming mic and weighs only 375 grams. Check it out in the link below. Alright, let's do it (upbeat music) Tu-du-du. (device chimes) So this right here is the star of the show and why I'm so excited. We have a 3 by 2 display, that's 14 inches across and you just get so much extra vertical space for activities. This one right here, we actually specked it with the OLED screen, which is 3000 by 2000 P and it looks absolutely fantastic. Let's just turn it up here for a second. Now you should not buy this panel. This panel is really dumb. They have an IPS version that's Full HD that's a lot cheaper, has probably much better uniformity this right here, the OLED panel still has some issues I would not trust it despite it being color calibrated. These little connector thingies are supposed to be this nice, brilliant bronze color, (chuckles) but I have put electrical tape over it. It turns I did that because they are really, really shiny. So if you're setting it in office with overhead fluorescent lighting, it bounces directly off of that and into your eyes and that's why I was getting a headache while using this thing. I don't know, that's the sort of thing that I would never think of, but I did try it and I gave it to multiple people and they all immediately were like, something's off about this. So another reason why you don't want to get this OLED panel despite it looking amazing, is that it destroys your battery life. Just get the Full HD display, that's what I'm saying here. One thing that really surprised me about this laptop is that it has a lot of smart things in it that are actually smart. So one of the ones that it just showed is that they have automatic color space changes. So depending on what you're doing, it'll switch between Adobe RGB, DCI-P3 and sRGB which is awesome cause it means that whatever you have on your computer is going to look like it should, like whoever made it, intended it to look. So if you go to a YouTube video it's not going to be over-saturated but then if you go into a photo editing program it's going to properly represent all of those colors without you having to go in and change to the Adobe color space. Fricking awesome. Another thing that's just so smart is in-bag detection. So when you close this and you chuck it in a bag, it knows that it should just be hibernating. This is something that's bug me so much about the XPS 15 cause I have to turn it so that it just automatically hibernates when I close the lid so that it doesn't warm up and use the whole battery in my bag. Another thing that really surprised me about this, and I don't know if this is a Windows thing or an HP thing is that facial recognition has worked with a mask on. So let's just try this one more time here. (upbeat music) Yeah it just worked. Every single other laptop that I have used, that has facial recognition has not worked with a mask on. And again I don't know if this, actually, we can just test it. This has updated Windows and it has facial recognition. Mondo... It's hibernated. Frickin', this is the problem come on. (upbeat music) Yeah so the XPS 15 cannot use facial recognition while I'm wearing a mask. But immediately it gets it when I take it off. My personal biggest problem with the Spectre x360 13 inch though, was just that my hands physically wouldn't fit on it. So it had a fantastic keyboard as far as the switches were concerned, but that doesn't matter if your hands sort of awkwardly half off of the laptop, half on it, that's an exaggeration but it feels like you're typing like this cause you can't rest your palms on it. This right here, because of the taller screen, also means you have way more space for your palms and for the track pad. So I have right here, a great big Excel sheet that tells you basically what percentage of males and females will be able to comfortably type on a laptop. This is based off of the standard deviation of hand sizes, there's some ratios in there, whatever. You're from the home row down to the bottom, let's see 140 millimeters compared to 129 for the old 13 inch. So you might think 11 millimeters. How big of a difference can that be? It's friggin' massive. The number of males that were comfortable on the old one was only 32%. And even half of females on the old 13 inch, their hands just simply won't fit. On this one right here though, 60% of males and 80% of females will be able to type with no problems at all. That's just so many more people that can use this laptop and enjoy it, fantastic. It also means have this really nice and large track pad, that's just so much better to use, the old one just didn't have enough vertical space, so I constantly found if I was going from the bottom of the screen to the top, I would just, well, run out of space. Whereas now, no problem. It's just generally an excellent track pad. The only thing that slightly bothers me is that they have these keys on the right here that are full size and that that on the left, you're really close to the edge. And that means that for things like copy and paste and so on my hand is off the left hand side but that's a very minor complaint compared to my hands always hanging off of the back before. Let's see how these speakers are. (upbeat music) Yeah, this to. (heavy upbeat music) So like, yes, the XPS 15 is better, but like it better be. It's a 15 inch laptop. It's just massive compared to this thing, this is so much lighter. And at the same time, the HP, I think has better clarity. Like you can hear more of what's happening in the song. Well you don't get the deep bass, but at the same time it's, for something of this size, excellent. One thing that I actually totally forgot about until now is the power cause in a thin and light, it matters, but it doesn't really matter. So we had an 11th gen Intel Core i7-1165G7 so that's only four cores, but they're pretty speedy. And you also get Iris Xe Graphics which are just so much better than any other integrated graphics that have existed. Well, yes AMD's are good, but they're not as good as this. Well, you'll be able to play some games. (chuckles) That's about it. You'll not be able to play Cyberpunk on this obviously. You also get a Wi-Fi 6 card and in this one 16 gigabytes of RAM. Now should you go for 16 gigabytes of RAM? You might not need it in a thin and light but if it's not upgradable, then you really should. So yeah, I guess let's find out. We're gonna have to remove these rubber feet and they're never gonna go back on the same. (plastic clicks) Okay, here we go. (upbeat music) You can't see the whole lot. What there is though is just a massive battery. Look at how much of the laptop this takes up. We've got a good old 66.5 watt-hour dude right here. Okay, so HP's numbers for this battery are with the OLED screen, 12.8 hours of video playback, whereas with the Full HD screen, which is the one you should get, it's 19 hours and Netflix streaming which is a bit more realistic, the OLED screen gets 10.2 hours. Whereas the Full HD gets 15.4, which is wick it. I think we're able to upgrade the SSD under this. There's the SSD, so that's fairly easy to replace. You don't need to go ham on that if you don't feel like it As for RAM though, I'm not seeing anything. Yeah, no. There's not a lot in the way of cooling. If you're planning on using it for video editing, well, I don't know just get something that's more powerful if you wanna do video editing. If you wanna do photo editing, then maybe you'll run into some situations where you'd wish that you'd gone for the Razer Book. In my use with it, I don't think I've heard the fans once. I think that's about it for this laptop. Hand fit on it, loads more space vertically for activities and fun times. I think this thing's awesome. If you're looking for a laptop, that's like this, it starts at what? Oh geez. So it starts at $1,300. That gets you an i5, 8 gigabytes of RAM, the Full HD screen and 256 gigabyte SSD. Not amazing but at the same time for a lot of people that's probably enough power. The one that I'd recommend, holy crap that's almost $1,600. 1,589 99 that gets you an i7, the Full HD screen again, 16 gigabytes of RAM and a 512 gig SSD. That's pretty steep but at the same time, the XPS 13 2-in-1 is really expensive so I guess that's what you could. And then the model we have right here is $1,700 which gets you a terabyte SSD and the OLED screen. All of them come with the pen and don't buy the OLED. If this is the kind of laptop that you want, it's pretty hard to do better. Anyway, I quite enjoy giving this thing a look. I might continue, actually, that's a lie. I'm gonna use the XPS 15, but it was close. (chuckles) It was pretty close. You know, if I didn't quite need power for like solid works, I would legitimately use this every single day. It's a great laptop and I hope you guys have a great day. Hit like get subscribed and salam.",
    "transcript_keywords": [
        "laptop",
        "thing",
        "OLED screen",
        "OLED",
        "XPS",
        "Full",
        "Spectre",
        "screen",
        "Yeah",
        "epitome of listening",
        "space",
        "RAM",
        "SSD",
        "time",
        "Dell XPS",
        "lot",
        "gigabytes of RAM",
        "OLED panel",
        "awesome",
        "battery"
    ],
    "transcript_entity_values": [
        "almost $1,600",
        "Drop Panda",
        "4",
        "15 inch",
        "65 watts",
        "Windows",
        "Adobe RGB",
        "Windows",
        "Spectre",
        "Netflix",
        "66.5 watt-hour",
        "2",
        "Frickin",
        "Dell",
        "16 gigabytes",
        "Tu-du-du",
        "12.8 hours",
        "Excel",
        "15",
        "HP",
        "Adobe",
        "Iris Xe Graphics",
        "13 inch",
        "8 gigabytes",
        "256",
        "first",
        "AMD",
        "14 inches",
        "only two",
        "XPS",
        "SSD",
        "Spectre",
        "the past week",
        "RAM",
        "one",
        "1,589 99",
        "Intel Core",
        "only 32%",
        "second",
        "14 inch",
        "10.2 hours",
        "13",
        "1,300",
        "11th",
        "only four",
        "19 hours",
        "DCI-P3",
        "512",
        "YouTube",
        "11 millimeters",
        "140 millimeters",
        "2000",
        "3",
        "half",
        "USB Type-A",
        "Panda",
        "100%",
        "Specter",
        "One",
        "chuck",
        "80%",
        "only 375 grams",
        "60%",
        "3000",
        "IO",
        "the Razer Book",
        "Jono",
        "HP Spectre",
        "IPS",
        "129",
        "15.4",
        "Envy x360",
        "OLED",
        "1,700",
        "Christmas",
        "XPS",
        "about a week"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "PRODUCT",
        "DATE"
    ],
    "vector": [
        -0.06940522789955139,
        0.022163601592183113,
        0.004716862458735704,
        -0.07402817159891129,
        0.057634539902210236,
        0.022979961708188057,
        -0.01248776726424694,
        0.0596877783536911,
        -0.02037757821381092,
        0.02138347364962101,
        0.08606629073619843,
        0.07837290316820145,
        0.020887572318315506,
        -0.0458655059337616,
        0.06110683083534241,
        -0.021858282387256622,
        0.09548132121562958,
        -0.11618852615356445,
        -0.005351834464818239,
        -0.0472581721842289,
        -0.05528608337044716,
        -0.08412422239780426,
        0.03232748433947563,
        0.005868050269782543,
        0.0657883733510971,
        -2.022806711465819e-06,
        0.011102050542831421,
        -0.05595764145255089,
        -0.020657991990447044,
        -0.04608165845274925,
        0.006027749739587307,
        0.10274600982666016,
        0.013275884091854095,
        -0.02581533044576645,
        -0.040265750139951706,
        -0.053178660571575165,
        0.05377894267439842,
        -0.07944630831480026,
        -0.02912203036248684,
        -0.0923055037856102,
        -0.030344316735863686,
        -0.07272373884916306,
        -0.04498901963233948,
        0.020696541294455528,
        0.006934850476682186,
        -0.055897049605846405,
        -0.007082116324454546,
        0.0006491187959909439,
        -0.008751497603952885,
        0.02859794721007347,
        0.029103239998221397,
        -0.054428815841674805,
        0.06271348893642426,
        -0.0003353340143803507,
        -0.08522970974445343,
        0.01913130097091198,
        -0.0562308095395565,
        0.0022895969450473785,
        0.03677646815776825,
        0.01222771406173706,
        0.051335789263248444,
        -0.09147990494966507,
        -0.02676568552851677,
        0.05492343753576279,
        -0.02732212096452713,
        -0.04097479581832886,
        -0.008110391907393932,
        0.009684943594038486,
        -0.10939270257949829,
        0.0230612400919199,
        -0.023708738386631012,
        0.019992925226688385,
        0.06039104983210564,
        0.03202279657125473,
        -0.0034939153119921684,
        0.048967741429805756,
        0.10464243590831757,
        -0.0698203444480896,
        0.05893459916114807,
        0.053956348448991776,
        -0.011714289896190166,
        0.03166210278868675,
        -0.037437379360198975,
        -0.009007709100842476,
        0.015260485000908375,
        -0.06973958015441895,
        -0.02001824602484703,
        -0.0043365443125367165,
        -0.047666795551776886,
        -0.10761623829603195,
        0.05106528848409653,
        0.11338058114051819,
        -0.02218816429376602,
        0.046024832874536514,
        -0.011558040045201778,
        0.0005980637506581843,
        0.020695885643363,
        -0.03127780184149742,
        0.028992963954806328,
        0.027029763907194138,
        0.05433264374732971,
        0.058303769677877426,
        0.03544587269425392,
        -0.059062737971544266,
        -0.07577922195196152,
        -0.10459321737289429,
        -0.013369373045861721,
        0.07218766957521439,
        -0.0037293334025889635,
        -0.001288639148697257,
        -0.06313750892877579,
        -0.0441146120429039,
        -0.05749949440360069,
        -0.031606096774339676,
        -0.03320381045341492,
        0.0423702634871006,
        -0.06149262189865112,
        0.044365573674440384,
        0.12216749042272568,
        -0.08151359111070633,
        -0.025491507723927498,
        0.04793820157647133,
        -0.020513655617833138,
        -0.005727384705096483,
        -0.018856128677725792,
        0.05435022711753845,
        -0.0872119665145874,
        4.352961742928489e-33,
        -0.04417796432971954,
        0.08238872140645981,
        -0.0891958475112915,
        -0.10977461189031601,
        0.01853928528726101,
        -0.040838226675987244,
        0.021996064111590385,
        -0.010555840097367764,
        -0.07824461907148361,
        0.0626986026763916,
        -0.0993502214550972,
        -0.0009086228674277663,
        -0.056927572935819626,
        -0.021759718656539917,
        0.038707975298166275,
        -0.04739287495613098,
        -0.035198550671339035,
        0.040517546236515045,
        -0.04667399823665619,
        0.028228217735886574,
        0.05062862113118172,
        0.0004126408020965755,
        0.0527019202709198,
        0.010794014669954777,
        0.07527700811624527,
        -0.0012761191464960575,
        -0.027859138324856758,
        0.0016618163790553808,
        0.02128470316529274,
        0.01904813013970852,
        -0.06782816350460052,
        -0.05034990236163139,
        0.034715987741947174,
        -0.03148002550005913,
        -0.037046026438474655,
        0.02898135967552662,
        -0.04988344758749008,
        -0.08727183192968369,
        0.029861316084861755,
        -0.045152101665735245,
        -0.05435916781425476,
        0.07790327817201614,
        -0.03924798592925072,
        -0.08796201646327972,
        0.022212734445929527,
        0.038293108344078064,
        -0.09360169619321823,
        0.01866539753973484,
        0.05049758031964302,
        0.012911636382341385,
        -0.11776476353406906,
        -0.002465371508151293,
        -0.008998092263936996,
        -0.012232321314513683,
        0.025974199175834656,
        0.004964937921613455,
        0.01512199081480503,
        0.014839598909020424,
        0.06860209256410599,
        0.0317637175321579,
        0.06954734027385712,
        -0.016384484246373177,
        -0.017371686175465584,
        -0.08172817528247833,
        -0.015538303181529045,
        0.019407151266932487,
        0.09275148063898087,
        0.019485939294099808,
        -0.12610448896884918,
        0.04487241804599762,
        -0.0323004275560379,
        0.047251466661691666,
        0.05319482460618019,
        -0.043455444276332855,
        0.07765717059373856,
        -0.019639436155557632,
        -0.13147442042827606,
        0.024844713509082794,
        -0.01650736853480339,
        -0.004378404002636671,
        -0.009172910824418068,
        0.09643614292144775,
        0.02568427473306656,
        0.05217693746089935,
        0.028400816023349762,
        0.015960918739438057,
        -0.03633177652955055,
        -0.01515863835811615,
        -0.02529701218008995,
        0.016524020582437515,
        -0.034492671489715576,
        -0.01802745647728443,
        -0.04706811532378197,
        -0.005465100985020399,
        0.022713813930749893,
        -6.839894529535739e-33,
        -0.03289327397942543,
        0.01983626000583172,
        0.017802700400352478,
        0.05344610661268234,
        -0.011096476577222347,
        0.02136307582259178,
        0.038951627910137177,
        0.01753205619752407,
        -0.0025650120805948973,
        0.003681986127048731,
        0.0509374663233757,
        0.07200725376605988,
        -0.08692500740289688,
        -0.014660636894404888,
        0.01941705122590065,
        -0.06555671244859695,
        -0.022686544805765152,
        -0.12918557226657867,
        0.0866020917892456,
        -0.055256325751543045,
        0.06692254543304443,
        0.028772786259651184,
        -0.013582026585936546,
        0.06122099980711937,
        -0.050727713853120804,
        -0.03880084678530693,
        -0.05029008165001869,
        -0.0011681830510497093,
        -0.010068479925394058,
        0.0013075191527605057,
        -0.01606713980436325,
        -0.018290042877197266,
        -0.007182203698903322,
        0.036135245114564896,
        0.1458982229232788,
        0.0091807646676898,
        -0.0050536938942968845,
        0.06784765422344208,
        0.03872636333107948,
        0.03184734284877777,
        0.04860687628388405,
        -0.0021125860512256622,
        0.0823199525475502,
        -0.015351234003901482,
        0.0876547321677208,
        -0.08992641419172287,
        -0.042864058166742325,
        -0.12730278074741364,
        0.036786362528800964,
        0.004606847185641527,
        0.012153537943959236,
        0.0009086422505788505,
        0.028211159631609917,
        -0.012496436946094036,
        -0.10437912493944168,
        -0.06340230256319046,
        -0.06886394321918488,
        0.01338705513626337,
        -0.00019150026491843164,
        -0.03719499707221985,
        -0.006192895118147135,
        -0.03075696900486946,
        -0.04087971895933151,
        0.07792128622531891,
        -0.033678583800792694,
        0.008950642310082912,
        -0.015532491728663445,
        0.005033474415540695,
        0.00359719293192029,
        -0.02997022122144699,
        -0.07688643783330917,
        -0.02769787609577179,
        -0.04382028803229332,
        -0.07572902739048004,
        -0.03746335953474045,
        0.027447791770100594,
        -0.06702312082052231,
        -0.0006599591579288244,
        -0.022878708317875862,
        0.03515216335654259,
        0.03273412585258484,
        0.0423419289290905,
        0.042506128549575806,
        -0.03869876638054848,
        0.02880329266190529,
        0.046537961810827255,
        0.003194458782672882,
        -0.07208183407783508,
        -0.07578211277723312,
        -0.020019082352519035,
        -0.005447969771921635,
        -0.006066329311579466,
        -0.020382774993777275,
        0.020597726106643677,
        -0.03072221577167511,
        -5.486445431301945e-08,
        0.0038201238494366407,
        0.061911050230264664,
        0.03790072724223137,
        -0.001007751445285976,
        0.025264963507652283,
        -0.0819849893450737,
        0.01679837331175804,
        0.01021306961774826,
        0.08050398528575897,
        0.0927174910902977,
        0.05955924093723297,
        -0.11371700465679169,
        -0.053420357406139374,
        0.050016604363918304,
        0.0023636226542294025,
        0.011058053933084011,
        -0.027084795758128166,
        0.08216820657253265,
        0.012863204814493656,
        -0.053599338978528976,
        -0.005801059305667877,
        0.09460371732711792,
        0.052613515406847,
        -0.0453333705663681,
        0.0814298689365387,
        0.02559513971209526,
        0.01411350630223751,
        0.017720330506563187,
        0.0778479054570198,
        -0.04022839292883873,
        -0.084852434694767,
        0.032311372458934784,
        -0.015426003374159336,
        0.022848568856716156,
        0.002815202111378312,
        -0.09214171022176743,
        -0.012598970904946327,
        0.07036712765693665,
        0.07924104481935501,
        0.052314143627882004,
        -0.005477879662066698,
        -0.042196258902549744,
        -0.06619472056627274,
        0.005112805403769016,
        0.07949706166982651,
        0.010082395747303963,
        0.030231889337301254,
        -0.062241364270448685,
        -0.0196832288056612,
        0.05359041690826416,
        -0.02541898936033249,
        -0.002411783207207918,
        0.06253552436828613,
        -0.06539594382047653,
        0.03441452607512474,
        -0.00631686020642519,
        0.02818993479013443,
        0.039121709764003754,
        0.006199737545102835,
        0.04215678572654724,
        0.028986262157559395,
        -0.12293381989002228,
        -0.009479938074946404,
        0.104836605489254
    ]
}