{
    "id": "kz-ehTBUgbk",
    "title": "OFFICIALLY BACK FROM THE DEAD",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-08-10T16:50:58Z",
    "video_url": "https://www.youtube.com/watch?v=kz-ehTBUgbk",
    "category": "Howto & Style",
    "tags": [
        "HTC",
        "smartphone",
        "technology",
        "gaming",
        "mobile game",
        "HTC u24 pro",
        "u24 pro",
        "iphone",
        "android",
        "durability test"
    ],
    "views": 2070307,
    "likes": 63630,
    "comments_count": 3785,
    "description": "Ive never seen a smartphone released from beyond the grave... but here we are with the new HTC U24 Pro. At first glance the HTC U24 Pro appears as a midrange smartphone with normal specs. But under the surface... is there more than meets the eye? Lets durability test and take apart this newest release from HTC. Are you ready for the comeback?",
    "description_links": [],
    "transcript": "May I present the world's first smartphone launched from beyond the Grave. HTC coming back isn't something I had on my 2024 bingo card, but here we are with a brand new HTC U24 Pro. HTC was a fairly decent sized player in the smartphone market about 7 years ago. With about 10% market share. Before they sold a good chunk of their smartphone business, and about 2,000 employees, to Google for $1.1 billion dollars. And even though that deal was non-exclusive HTC just kind of stopped making smartphones after that. Besides a weird crypto phone in 2019 they've just been riding that 1.1 billion off into the sunset. And well I guess that cash ran out cuz here's the space blue U24 Pro that just dropped. They're branding it as a one-of-a-kind smartphone with unique brilliance and a $600 price tag. We're here to find out if it's actually, truly, uniquely brilliant, or if it's just the kind of uniquely brilliant that your mom uses to describe her kids to her friends. First thing that pops out is that the sides of the smartphone are angular taking a page from the Cybertruck handbook. The aluminum rails aren't curved or straight like we see on the iPhone or Samsungs and I'm not opposed to it, don't get me wrong, but it's also impossible to describe a polygon as cozy or comfortable to hold. There's a curved glass screen. I guess HTC didn't get the memo from the grave that curved glass just isn't cool anymore, but since they just came out of hibernation will let it slide. Back in the day though, HTC was pretty prime. One of the very few smartphone manufacturers using actual level 9 sapphire crystal on their displays. That was some truly unique brilliance right there. But alas, this new U24 Pro appears to be just using standard scratch resistant Gorilla Glass. Which scratches at level six with deeper cruise at level 7. So far this phone is coming across as pretty normal and regular. Making our way up to the 50 megapixel upper front-facing camera. You heard that right 50 megapixels. That's pretty unique! It's protected by the same front glass. And it looks like instead of putting the proximity sensors under the screen, like an Apple's Dynamic Island, HTC has slipped them into a portion of the angled frame near the earpiece grill. There is no speaker grill just a long slit but there is, holy moly, a headphone Jack! Audience: Hooray! Zack: HTC exited the smartphone scene right about when the headphone jacks were getting phased out, and I guess they didn't get that memo either. Which is great news for us. The top of the phone is mostly aluminum with a plastic edge near the screen we'll see how that affects durability here in a few minutes. The right side of the phone is also aluminum with a smooth metal, non-textured power button and metal volume rocker. Nothing to see here on the left side. The bottom of the phone has the loudspeaker with a 60 watt wired USBC port. And dare we hope for another perk of a bygone era? Indeed the HTC U24 pro has an SD card slot. Audience: Hooray! Zack: Crazy how unique Brilliance in 2024 perfectly describes a normal smartphone of 2018. It's also got a red rubber ring to maintain the IP67 water resistance. Making our way to the back of the phone; We have a triple camera setup a 50 megapixel two times telephoto camera up top. Another 50 megapixel normal camera in the center, and an 8 megapixel ultra wide depth sensor at the bottom. All protected with glass. There is a single LED flash with a plastic lens off to the right and speaking of plastic, the glistening space blue back panel of the U24 Pro is plastic. Which is fine. Plastic backs don't bother me, and it's pretty normal to see in a phone in the $600 price range. I just hope that the plastic structurally survives the rest of this test, so HTC doesn't end up back underground with a headstone. The curved glass contains basic specs here in 2024. A 6.8 in 120 hertz 1080p whole punched OLED. Which lasts for about 30 seconds under the heat from my lighter. Nothing too uniquely brilliant about that. When it comes to the underscreen fingerprint scanner though, we get zero functionality. Even after about 15 attempts the scanner couldn't recognize or analyze my prints enough to register them. To be fair though I did spend most of yesterday laying pavers and my fingertips are pretty wrecked. I imagine that I'm not the only one who works outside though so that's pretty disappointing. Finally the bend test. I don't think HTC has ever failed one of my durability tests before Oh wait, there was the HTC U11 that snapped in half right before they quit making smartphones. Oh, sorry about that. The good news though is that the angular aluminum rails of of this year's phone hold up much better when bent from the back. And again the plastic back and glass screen remain fully intact when bent from the front. The HTC U24 Pro survives my durability test. However, back in the day HTC phones were a monstrosity to take apart and repair. So, let's hope this reinvented, regenerated, and rejuvenated HTC is a little more organized internally. Without any heat I can slide my Jerry rig knife underneath the back panel taking special care not to puncture the battery. And I can yoink that thing back like a $600 banana peel. Plastic backs are nice because they don't shatter. And here we have our first look at the square NFC patch in the top right of the phone. And the 15watt wireless charging coil in the center not a bad look for someone who's been dead for 6 years. There's 18 Phillips head screws holding down all the protective plastics to the frame. And with the top rear plastics taken out we can thankfully glimpse a relatively simple motherboard, and regular ribbons that all unplug just like little Legos. The lower loudspeaker can also come out. There is a circular sticker covering the vent hole but no balls anywhere to be found. There's a waterproofing mesh over the speaker opening though, which is good. I'll remove the two extension ribbons that cross over the battery. It's interesting that this battery has two plugs. We've seen this a few times in smartphones before having two cells that both charge up at the same time is how we get these super fast 60 watt charging speeds. And even though there aren't any pull tabs the adhesive is reasonable enough for removal that with some gentle prying it still gets a thumbs up from Me. We got 4,600 milliamp worth of capacity in this thing. I'll remove a few more of the wire cables and snag the main 50 megapixel camera. You can see quite a bit of OIS as the lens moves around. I'll unplug and move aside the headphone jack and the motherboard can come free from the phone. The 50 megapixel two times telephoto lens does not have any OIS. Just focusing. And the lower 8 megapixel wide angle depth camera also does not have any of that optical image stabilization. The weird little sensors up here in the top frame of the earpiece slit are hopefully not needed. You can see the sensors here at the end of what used to be the proximity ribbon. I'll remove the SD card tray and pop off a few more of those signal wires, so we can get a better look at the 60 watt USBC port. Which does have a rubber ring of its own. and right below that tiny square haptic vibrator motor we have a little white waterproofing membrane for the lower microphone hole which when stabbed becomes much less watertight. Something to keep in mind. The fingerprint scanner that doesn't scan fingerprints good is still attached to the lower charging port board. HTC was super innovative back in the day not only with sapphire displays and transparent phones, but they are also one of the only if not the only smartphone brand to ever put optical image stabilization into the front camera. Which after we put back the battery and the main cameras we can see that this new front-facing selfie camera on the U24 Pro doesn't have any OIS. But maybe someday they'll bring it back again. I'm excited to see HTC still making phones. I imagine and they're just getting their feet back in the water with a few mid-range devices, but someday and hopefully someday soon we'll see some flagships with even more unique brilliance in the pipeline. At least until they sell to Google again. Thanks A ton for watching. I'll see you around.",
    "transcript_keywords": [
        "HTC",
        "back",
        "smartphone",
        "phone",
        "Pro",
        "HTC coming back",
        "day HTC phones",
        "plastic",
        "camera",
        "glass",
        "HTC phones",
        "megapixel",
        "present the world",
        "Plastic backs",
        "unique brilliance",
        "curved glass",
        "pretty",
        "smartphone launched",
        "making smartphones",
        "unique"
    ],
    "transcript_entity_values": [
        "HTC",
        "about 30 seconds",
        "Google",
        "1.1 billion",
        "USBC",
        "2019",
        "50 megapixel",
        "iPhone",
        "8 megapixel",
        "6.8",
        "9",
        "2024",
        "Zack: Crazy",
        "about 2,000",
        "4,600 milliamp",
        "SD",
        "50 megapixels",
        "two",
        "six",
        "the HTC U11",
        "jack",
        "about 7 years ago",
        "2024",
        "60 watt",
        "Legos",
        "half",
        "120 hertz 1080p",
        "Samsungs",
        "yesterday",
        "6 years",
        "Phillips",
        "zero",
        "Jack",
        "$1.1 billion dollars",
        "IP67",
        "600",
        "Brilliance",
        "Cybertruck",
        "year",
        "Apple",
        "Dynamic Island",
        "NFC",
        "15watt",
        "2018",
        "first",
        "a few minutes",
        "First",
        "18",
        "about 15",
        "Zack",
        "about 10%",
        "One",
        "50",
        "one",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        0.022652382031083107,
        0.052759356796741486,
        0.05415503680706024,
        -0.06696849316358566,
        0.03845832496881485,
        -0.023331167176365852,
        0.006952969823032618,
        0.08784005045890808,
        -0.01866074465215206,
        0.011681628413498402,
        0.05616195127367973,
        0.05163998156785965,
        0.08655945956707001,
        0.002934721065685153,
        0.027034517377614975,
        -0.01535787433385849,
        0.004541291389614344,
        -0.12917840480804443,
        -0.03011663630604744,
        0.03814464807510376,
        -0.0977444127202034,
        -0.026858674362301826,
        0.020960146561264992,
        -0.0008723392966203392,
        0.014941483736038208,
        -0.013034047558903694,
        -0.04072102904319763,
        -0.056248895823955536,
        -0.023227984085679054,
        0.0198030024766922,
        -0.016579942777752876,
        0.1073307916522026,
        0.04481591656804085,
        -0.012759550474584103,
        0.03908691555261612,
        -0.047233641147613525,
        0.033525824546813965,
        -0.016643784940242767,
        -0.047477900981903076,
        0.00042358008795417845,
        0.030611244961619377,
        -0.03484519571065903,
        -0.05589008703827858,
        0.04670591652393341,
        0.04503246396780014,
        -0.042589448392391205,
        0.08440053462982178,
        -0.027520032599568367,
        -0.05012694001197815,
        -0.007436176296323538,
        0.07879605144262314,
        0.01721755415201187,
        0.04023474454879761,
        -0.010949164628982544,
        -0.0928892269730568,
        0.012974580749869347,
        -0.03216618299484253,
        0.039046261459589005,
        0.11098595708608627,
        0.02069229818880558,
        0.024541927501559258,
        -0.026230935007333755,
        0.02326100319623947,
        -0.04432898014783859,
        0.03838128596544266,
        0.06155494228005409,
        -0.04672858864068985,
        -0.05703095719218254,
        0.005918165668845177,
        0.04722137376666069,
        0.032783910632133484,
        -0.013658481650054455,
        -0.008430062793195248,
        0.052958305925130844,
        -0.03429063409566879,
        0.04967861250042915,
        0.07814687490463257,
        -0.008240992203354836,
        -0.03805146738886833,
        -0.019038889557123184,
        0.11615218222141266,
        -0.046492159366607666,
        -0.0020925519056618214,
        -0.06344994157552719,
        -0.006215344648808241,
        0.03593357279896736,
        0.048546358942985535,
        -0.018461957573890686,
        -0.009653210639953613,
        -0.11037693917751312,
        -0.07173551619052887,
        0.06725592911243439,
        -0.04609677568078041,
        0.0003863158926833421,
        0.030438408255577087,
        -0.02700270339846611,
        -0.020190848037600517,
        0.028043555095791817,
        -0.005464338231831789,
        0.016134807839989662,
        0.027563991025090218,
        0.03211437538266182,
        -0.04793786257505417,
        -0.07318364083766937,
        0.05384167283773422,
        -0.007378336042165756,
        0.015972275286912918,
        0.06307246536016464,
        0.06658075749874115,
        0.049609024077653885,
        -0.031088588759303093,
        0.00502117769792676,
        -0.0798693522810936,
        -0.01884276419878006,
        -0.01945694349706173,
        -0.02304515801370144,
        -0.053764816373586655,
        0.017512191087007523,
        0.037480324506759644,
        0.018088938668370247,
        0.06132343038916588,
        0.05760801210999489,
        -0.021090898662805557,
        -0.09095630794763565,
        0.04637840390205383,
        -0.05133921280503273,
        -0.04763151705265045,
        5.1506793927033563e-33,
        -0.010832803323864937,
        0.11409791558980942,
        -0.027438558638095856,
        0.010182366706430912,
        -0.06562475115060806,
        0.006811453495174646,
        0.026008661836385727,
        0.03715460002422333,
        -0.018725711852312088,
        -0.00987949501723051,
        -0.03678251802921295,
        0.0262982789427042,
        -0.06265046447515488,
        0.02859658934175968,
        0.025541823357343674,
        -0.09782953560352325,
        -0.024414513260126114,
        -0.06246761232614517,
        0.05270370841026306,
        0.006047355011105537,
        -0.04940493777394295,
        0.04209714010357857,
        0.010374755598604679,
        -0.02147977612912655,
        -0.00451171537861228,
        -0.010753363370895386,
        0.004073865246027708,
        -0.011255007237195969,
        0.11149179190397263,
        -0.010440727695822716,
        -0.11978863924741745,
        -0.016819126904010773,
        0.04482235014438629,
        -0.05373460799455643,
        -0.061613548547029495,
        0.0545649453997612,
        -0.039654482156038284,
        -0.07508556544780731,
        0.0011399295181035995,
        0.01691318489611149,
        -0.06363872438669205,
        0.09798802435398102,
        -0.07858201116323471,
        -0.04393981024622917,
        0.030585141852498055,
        0.019954534247517586,
        -0.05536748468875885,
        -0.0036166347563266754,
        -0.022336523979902267,
        -0.051319420337677,
        -0.04644579440355301,
        0.04307277873158455,
        -0.02368347905576229,
        -0.045086730271577835,
        -0.07632405310869217,
        -0.07407420873641968,
        -0.033237606287002563,
        -0.055330973118543625,
        0.058987610042095184,
        0.025882618501782417,
        0.05121399089694023,
        -0.0053651477210223675,
        -0.13770319521427155,
        0.08700955659151077,
        -0.06998109817504883,
        0.05459897965192795,
        0.04294607788324356,
        0.011228566989302635,
        -0.08373746275901794,
        0.05668202042579651,
        0.021744467318058014,
        -0.10544460266828537,
        0.022566523402929306,
        -0.04242950305342674,
        0.03606608510017395,
        0.03379368036985397,
        -0.01842273771762848,
        -0.036560650914907455,
        0.045440562069416046,
        0.0025913899298757315,
        0.015763059258461,
        0.028659146279096603,
        0.130988210439682,
        -0.025405729189515114,
        0.0028748197946697474,
        0.002164266537874937,
        0.03733856976032257,
        -0.10024729371070862,
        0.029235029593110085,
        0.1044813022017479,
        -0.06099052354693413,
        -0.017855610698461533,
        -0.003588637337088585,
        0.0016123588429763913,
        0.0070971595123410225,
        -5.5372227102140186e-33,
        -0.03561002016067505,
        0.004141439683735371,
        0.01641082391142845,
        -0.008176326751708984,
        -0.015970049425959587,
        -0.020214330404996872,
        0.004975335672497749,
        0.06785973161458969,
        -0.04361758008599281,
        0.015725957229733467,
        0.0815926045179367,
        -0.016035962849855423,
        0.04514533281326294,
        0.02782086469233036,
        -0.005863105412572622,
        -0.03001875802874565,
        0.02752762846648693,
        -0.07473532110452652,
        0.0865284726023674,
        0.009624838829040527,
        0.09893002361059189,
        -0.017158111557364464,
        -0.06463649123907089,
        0.07258208841085434,
        -0.03368590027093887,
        0.04174645617604256,
        0.013674546964466572,
        -0.010541879571974277,
        0.03413945436477661,
        -0.08060557395219803,
        -0.07858724892139435,
        -0.09927966445684433,
        0.059421781450510025,
        0.08528687804937363,
        0.06313621997833252,
        0.01841544546186924,
        -0.04087339714169502,
        -0.04928693547844887,
        0.028443364426493645,
        -0.048616595566272736,
        -0.04723891243338585,
        -0.020459208637475967,
        -0.0033942111767828465,
        -0.00562442559748888,
        0.044410888105630875,
        -0.06113176420331001,
        0.03768215328454971,
        0.006670237518846989,
        0.06178336963057518,
        0.02051660604774952,
        0.08539712429046631,
        0.054343800991773605,
        -0.05910469964146614,
        -0.08003377169370651,
        -0.13261207938194275,
        -0.04245767369866371,
        -0.03434004262089729,
        -0.03579668700695038,
        0.02930842712521553,
        -0.012439988553524017,
        0.0565585158765316,
        0.027848748490214348,
        0.011215363629162312,
        0.05124279484152794,
        -0.06639114767313004,
        0.023143192753195763,
        0.040258072316646576,
        0.006593585480004549,
        -0.049268804490566254,
        -0.015676653012633324,
        0.0014443849213421345,
        -0.015525481663644314,
        -0.050653912127017975,
        -0.08695787191390991,
        0.008971037343144417,
        0.11795850098133087,
        -0.06242123991250992,
        -0.05358708277344704,
        -0.04086954891681671,
        -0.08704526722431183,
        -0.004241618327796459,
        0.043147481977939606,
        0.07955645769834518,
        -0.01753484643995762,
        0.049365606158971786,
        0.022891035303473473,
        -0.001759191625751555,
        -0.0034531611017882824,
        -0.06913731247186661,
        0.01868804730474949,
        -0.044699810445308685,
        -0.03941855579614639,
        -0.10868210345506668,
        0.05573336407542229,
        0.006145494990050793,
        -5.550023729483655e-08,
        0.04160454869270325,
        0.0002892016782425344,
        0.042647585272789,
        0.020245397463440895,
        0.017828088253736496,
        -0.01121172308921814,
        0.018617192283272743,
        -0.013936886563897133,
        0.12960819900035858,
        0.05719975382089615,
        -0.05550553649663925,
        -0.0886976569890976,
        -0.1116182804107666,
        -0.028476139530539513,
        0.04197125509381294,
        0.0671258494257927,
        -0.07468489557504654,
        -0.021977344527840614,
        -0.0021339012309908867,
        0.05758070573210716,
        -0.022645043209195137,
        0.11660579591989517,
        -0.010163579136133194,
        -0.07510583847761154,
        0.020792528986930847,
        0.01660764217376709,
        -0.011513386853039265,
        0.04646414518356323,
        0.03850839287042618,
        -0.004870960954576731,
        0.021515384316444397,
        -0.062485773116350174,
        -0.04272204264998436,
        -0.03861619904637337,
        0.03744378685951233,
        -0.07900021970272064,
        0.02069636434316635,
        0.051593899726867676,
        0.02624588832259178,
        0.02029808983206749,
        0.038707707077264786,
        -0.0037628968711942434,
        -0.01150299422442913,
        0.057892777025699615,
        0.004465718287974596,
        -0.09608980268239975,
        -0.0990133136510849,
        -0.034296855330467224,
        0.02041337825357914,
        0.0009752789046615362,
        0.00039354056934826076,
        -0.019625278189778328,
        -0.007706372998654842,
        -0.044676680117845535,
        0.07324660569429398,
        0.006243485491722822,
        -0.007387684192508459,
        0.004262587521225214,
        -0.09610439091920853,
        -0.0011327468091621995,
        0.054219551384449005,
        -0.1398107409477234,
        0.0433129258453846,
        0.12353599816560745
    ]
}