{
    "id": "L0s_oDfTDgE",
    "title": "No! This is worse! - Nreal Air AR Glasses",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-18T19:45:35Z",
    "video_url": "https://www.youtube.com/watch?v=L0s_oDfTDgE",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "nreal",
        "air",
        "light",
        "vr",
        "ar",
        "mr",
        "mixed reality",
        "virtual reality",
        "augmented reality",
        "wear",
        "wearble",
        "metaverse",
        "meta"
    ],
    "views": 978603,
    "likes": 23352,
    "comments_count": 1424,
    "description": "Get 20% OFF ($400) the NIU BQi-C3 Pro 17th Nov to 4th Dec. Link below to learn more at  + Take part in their 1000-Mile Challenge for a chance to win an additional 50% OFF.  Riley tried out the Nreal Light AR glasses last year and was impressed by their simple looks and diverse feature set, so when we got the new Nreal Air glasses, he was excited to see how the tech has improved. Is Nreal changing the AR game by making fashion-first smart glasses, or should they focus more on the tech?  Buy a pair of Nreal Air AR Glasses:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Riley's stealing his own jokes 0:38 Unboxing/What are these for? 1:53 Trying them on for the first time 2:46 What else is in the box? 4:28 Buttons and design 5:26 Sponsor - NIU 6:03 Attempting to use the glasses 7:16 Quirky design features 7:59 Worse than the Nreal Light? 9:20 Successfully using the glasses 12:23 Crab Rave speaker test 13:12 SteamVR supposedly works?  14:28 Overall thoughts 16:50 Outro",
    "description_links": [
        "https://shop.niu.com/LMG",
        "https://geni.us/GDUPYP",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Come on kids, let's get Nreal, Nreal? Nreal. N... Help. - [Bell] You already made this joke. - I know I did, in the Nreal- (laughs) (beep) I know I did, in the Nreal Light video that I did almost a year ago. That was December. This, I was waiting and in that video I said, I'm you know what? This one's okay, but I really want to try out the Nreal Air. At that time I thought the Nreal Air was basically just gonna be an upgraded version of the Light. It's actually not, it's actually sort of like a side grade or maybe even a downgrade in some areas, but on the plus side, you won't look like as much of a dork while wearing them. Oh, that feels good. What am I dealing with here? This is, I open it like this. Oh, okay. Cleaning cloth, a manual. This is not a toy for children. No children. If you think that I'm just about to unbox a regular pair of sunglasses right now, no, that's not right. These are augmented reality glasses although they can also do VR apparently. - [David] Why did you say aougmented? - Aougmented. That's the proper German pronunciation. - [David] Uh huh. - Aougmented reality. And yeah, I mean like a lot of companies have been trying to do this kind of thing. HoloLens is, obviously everyone knows about this, but you know, now with Quest Pro they have like a bit more, you know, it's a VR headset but they're adding in more augmented reality stuff. A lot of like smaller, lesser known companies trying this stuff out. Nreal seems to be one of the few companies that is trying to make commercially available products that don't look like full on developer prototypes. This one, if you forget about the fact that there's these like dinky little things behind the front glass, you might be tricked into thinking that's just a regular pair of sunglasses. I can't see anything because I think there's a film on the lens first of all. But second of all, how do I look? - [Bell] Very weird. (laughing) It's like you have fake eyes behind the glasses. - Very weird. So I mean, you know, in terms of general design it's very similar to the Light. It's just that the front lens portion is, you know a lot more like that standard Wayfair design. But in terms of the thick module here and the angled lenses here, it is very similar to the Light. You can adjust the angle of the arm because when I'm putting it on, I feel like it's, when it rests on my ears, it's a little too much. Like, can you see that? - [David] Yah. - Like it, I feel like it wants to be here, but my ears are here. - [David] Screw your ears, dude. - And this ear is even lower than this ear. - [David] What the heck is wrong with you? - What can Nreal do about that? This is a US, I'm guessing it's USB-C, USB-C to C cable with an angled section because that's gonna plug into the end of the glasses there. It looks like there's other things in here. Okay, so I think this is the prescription lens. If you wanna wear these in public for some reason, shade, throwing shade, you can take these to like an optometrist and get prescription lens cut for them, apparently. - [Bell] Please wear those. - They won't stay unless I do this. - [David] It's for librarian. - You've found my secretly lair, hero character. The metaverse is amazing. And you got different nose adapters and then a shade, I guess a cover for the lenses. I feel like that should go on easier but I have to like squish it on a little bit. All right. One thing to notice right off the bat is that this does not have an internal battery. They say that it can go, I didn't realize this until I was looking on the site because the site says, up to five hours streaming in Air Casting mode. And I'm like, okay, it's got a five hour battery life. And then you scroll down and at the very bottom it says, using fully charged 4,000 milliamp our phone. And I'm like, wait, what? Cause this does not have an internal battery. It's fully dependent on your phone, which is you know we'll get into this, the possibilities with AR devices, but like, you know there's a reason the HoloLens is so freaking bulky. Although I don't know, I'm not making them, maybe Elon Musk will fix it. He's got nice batteries. Okay, external. So obviously we got the USB-C port here that is going to plug into your phone through the cable provided. It looks like we got speakers here. So they do have two open ear speakers is what they call them. Bass boost, virtual rendering, echo noise cancellation. I'm guessing that's for the microphones because there are two microphones as well, somewhere. There's maybe one microphone there and the other microphone is right there on the top of the right arm. Both microphones on the right side, which I guess would make sense if they just wanted to have all the micro circuitry like on this one side. But what's on this side then? Nothing. Volume rocker here. I'm guessing this is a power button and looks like that's all the IO or buttons that we have. Let's start using it. Let's get into the, let's get into the verse, apostrophe. Hey, thanks to NIU for sponsoring today's video. Their BQi-C3Pro is the evolution of the urban E-bike. Whether you're commuting across the city on the daily or a weekend warrior exploring the parks outside of town the BQi-C3Pro will get you where you're going quickly and safely. It offers up to 62 miles in range, swapable battery capabilities for extended range and comes in three colors, white, glossy gray and matte black. Get 20% off the NIU BQi-C3Pro from November 17th to December 4th, and for the most avid writers a chance to get an additional 50% off. Click the link down below. All right, it's time to enter the non-branded metaverse. As I said, we have to jack in for that. - [David] The line is, we need to jack-in and jack-off. - Wait, no. Okay, one thing right off the bat that is not great compared to the Light is the fact that there's no clip over here. Like I guess they're saying that this goes down right away so it can go down from here onto your phone but I guess these aren't falling off anytime soon so that's all right. Okay, I'll give you a pass on that Nreal. Let's plug it in. Nebula is Nreals like Google Play Store or like, it's the software that runs here. It's like when you put on your Quest. Sometimes you set it to Canada and it's like, oh, we can't do that in Canada. Canada isn't on here. Date of birth, do I need to put that in? Okay, AR space, take me home. Is that this is supposed to be, do I need to turn them on or something? - [David] Is the world 3-D yet? - Hey, there we go. Oh, I can't see it. Oh, it's updating. After it updates, I should be able to see fine. - [David] It should fix your eyes by then. - Yeah, yeah, yeah. So while the glasses are being updated, one thing I figured out while reading the booklet is that those that cover, this is not for style, this is so you can cover the exterior lenses and like be more immersed in VR. So like to block out the outside world. And the other thing is, is that this is not a volume rocker it's a brightness control. Also, while I'm waiting, I figured this out. So I thought there was a way to adjust, but I don't I never wanna force things with tech products. You never, you never wanna just push it until it something clicks. But that's exactly what you're supposed to do here. So you can adjust the angle by just- (clicking) Just doing that. - [David] Ah. - It doesn't, yeah it makes me a little uncomfortable, but that's the norm. Let's go to Pandora, baby. (imitating machinery) Ah! I should have expected this because this was basically the experience with the Nreal Light as well. But a lot of stuff was really janky. So, oh, the phone crashed. (car crashing) I expected this to be a little smoothed out, honestly, I'm a little disappointed. We've got lowered specs in a number of areas. It's only got three degrees of freedom compared to six degrees of freedom in the Light. So you're not gonna be able to like move around and have it track you in 3-D space. It will be able to tell where you're looking and the display will track and if you're in a VR experience, it's like your station, it's like a stationary VR experience instead of a room scale. It doesn't have hand tracking. The other one didn't have hand tracking but the other one did have- - [Bell] The other one did have hand tracking. - It did? (clapping) Editor, just put this in there a little bit. Just kidding, it did have hand tracking. There's no hand tracking on this as well because there's there's no external sensors other than the proximity sensor here to tell when your head goes in. The Nreal Light did have hand tracking and you could either use your phone as a remote or kind of like, I think you could pinch, I forget, play the clip. Oh, oh, okay. This is where we crashed last time and it didn't do this before so this is good. Good, okay. Ah, updating again! Something's happening. It's happening, it's working! Your Nreal glasses are activated. Oh. (laughing) I was looking over here and I heard something but I didn't see anything and you're like, it looks like there's something on and I'm like, what? And I looked over here and there's the screen cause it thinks I'm- All right. Your phone is your controller is what it says. Try and move your phone around. There it is. So it says it's supposed to do head tracking or body tracking. It's only 3-D- I guess maybe it like tries its best. For a more stable experience in vehicles we have enhanced the anti shake effect of this mode. You can disable in the settings page. You can see that I don't, I mean you guys can't see but on my screen you can see the little screen recording. Oh, there's a time limit again! It can only record like 20 seconds. Okay, so what you're seeing right now is, I guess you must only be seeing the Nebula screen and not the real world behind it cause there's no cameras here. On the other one you could see, like they won't be able to see you guys. - [David] No. - Right, there's no cameras here? - [David] No. - So that's too bad thing number one. The other too bad thing is the fact that the FOV in this, is smaller than in the Light. This is 46 and it used to be, it's 52 in the Light. And so when I move my head around like I can only see this very tiny thing and there's so much space around the available screen. Vertically, it's not too much of an issue. Actually well it is. (David laughing) But it's not as much as an issue to me as the left and right motion. Over here I can see one, two, three, four, five, six, seven, eight, eight rows and then there's like another eight rows here and then another over here. I will say that like in the Light I'm impressed by the resolution here, like things look sharp and that's really cool. All right, so since we didn't have time to go to the optometrist and get my prescription lenses that I totally will do after this. We just taped my glasses and put a little bit of tape on the proximity sensor cause it kept going away. So now we're set up. Now we're ready. Okay, I could live like this. Did I say it's got a 3840 by 1080 resolution per eye? Which is pretty good. That rocker that I pointed out as a volume rocker falsely is the brightness control. So in order to control the volume, you have to use the phone volume I believe. Yeah, yeah, here we go. Come on. Nope, it stopped. See this is funny. The widest full screen you can do here, is still limited by the field of view. So the actual screen that I see is only this big instead of like, this could fill my entire field of view and it's this big. (clapping) You know. (crab rave playing) I mean, they're not great speakers but I think they are, I think they're quite a bit better than the ones in the Light, maybe I'm tripping. I'll accept it. Based on what I've tried so far, this seems very similar to Light in terms of the like default Nebula experience. You know, I haven't done one of their experiences. You're about to enter a third party application. So what I was saying, it's pretty janky. I'm sure that if you used this for a long time you could probably get used to it. There were ways, like there's a browser, there's Google, Wikipedia, YouTube. You're not just limited to the phone. There also are experiences that you can use controllers with. The headset I guess through a PC and use SteamVR. So one of the things that I wanted to try real quick before we end is SteamVR. Let's go. Cause I'm not an AR mode anymore. Whoa, do I look cool guys? - [David] Yah. - Well after trying to figure out how to do the SteamVR situation for a while there, we figured out that you actually, the only way that it streams VR games is using Invidia's Cloud XR streaming over wifi technology. And once we figured out that we had to like install things and set things up and do that whole thing we were like, all right, you know what? This is actually probably not worth it based on the low FOV cause I can only like, I'm gonna play a VR game but all I can see is just a square in front of me. There are some people who say they enjoy it but I'm also finding a number of Reddit posts talking about how it's not good because the FOV is so small, but for like other augmented reality experiences, maybe it might be worth it. The option is there if you really wanna make it work but it's probably not gonna be the best experience in the world. Okay, so this was a bit of a learning experience primarily because I'm just confused about what Nreal is trying to do here. On the one hand they launched the Nreal Light and that kind of seemed like, all right we're gonna build this platform based on these six degrees of freedom AR headset with AR headsets with a lot of cool features, high resolution and we're gonna build out an app ecosystem. And work as well was another big selling point was the fact that you could, like there's browsers in there you can connect it to your computer and have like a virtual office set up. But instead of kind of releasing a new version of the Light that had more features, they released this the Nreal Air that is cut down in a lot of ways. It's got a smaller field of view, it can only do three DOF tracking instead of six DOF which leaves one of the only real benefits to the Air over the Light being the fact that it looks a little more like regular sunglasses, which is definitely improvement, like an improvement. Like if we're going to have AR glasses get anywhere close to the mainstream, they can't look like you are a cyborg and you have a giant frigging thing on your face. You know, they have to look like regular sunglasses. That's one of the only things going for the Nreal Air other than the fact that it's cheaper. It's launching a 379 USD instead of $599, that which is what the Light launched at. Their whole website, like the product page for the Air is just covered in people look like they're models just kinda like looking cool and like, oh, putting the case in my purse. You know, there is a positive side here which is that if you are into AR and you wanna tinker and you like early adopting things, you can get this and play around. It's just disappointing because the people who would do that would probably pay the $599 for the Light instead of paying $379. I'm confused by companies like Nreal, what are you- Who are you? Nreal, no matter who you are, thanks for making new, weird things. I appreciate that, you know. We need people like that. I just wish that once the products actually arrived here on the ShortCircuit set, I wouldn't have a short circuit, try and understand what's going on in my brain. You know what I mean? Thanks for watching. Subscribe to ShortCircuit for more videos like this and if you, Hey, if you're looking for something to watch, watch the Nreal Light video. I think I had a better time in that one. No offense. (laughing)",
    "transcript_keywords": [
        "Nreal Light",
        "Nreal",
        "Light",
        "Nreal Light video",
        "Nreal Air",
        "thing",
        "things",
        "phone",
        "Air",
        "hand tracking",
        "tracking",
        "Light video",
        "experience",
        "hand",
        "guess",
        "glasses",
        "screen",
        "yeah",
        "time",
        "lot"
    ],
    "transcript_entity_values": [
        "3",
        "up to five hours",
        "five",
        "seven",
        "Nreal Air",
        "IO",
        "almost a year ago",
        "Nreal",
        "three",
        "One",
        "the Light",
        "US",
        "one",
        "20%",
        "Reddit",
        "Nebula",
        "David]",
        "Google",
        "FOV",
        "the Nreal Air",
        "an additional 50%",
        "YouTube",
        "4,000 milliamp",
        "second",
        "five hour",
        "VR",
        "20 seconds",
        "599",
        "HoloLens",
        "only 3",
        "David",
        "Quest Pro",
        "November 17th to December 4th",
        "NIU",
        "third",
        "December",
        "DOF",
        "Nreal",
        "379",
        "first",
        "three degrees",
        "Wikipedia",
        "two",
        "six degrees",
        "46",
        "1080",
        "Elon Musk",
        "German",
        "Wayfair",
        "Canada",
        "four",
        "Invidia's Cloud XR",
        "up to 62 miles",
        "USB-C",
        "Air Casting",
        "52",
        "Air",
        "VR",
        "six",
        "ShortCircuit",
        "jack",
        "eight",
        "today",
        "the Nreal Air"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "NORP",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "GPE",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "LOC",
        "TIME",
        "MONEY",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "EVENT"
    ],
    "vector": [
        -0.039186958223581314,
        -0.03709500655531883,
        -0.005974940024316311,
        -0.01919732242822647,
        0.04879903420805931,
        -0.044072043150663376,
        0.07951024174690247,
        -0.02641906775534153,
        -0.0859709233045578,
        0.051104966551065445,
        -0.037489909678697586,
        0.07654546201229095,
        -0.014640269801020622,
        0.018946679309010506,
        0.02747265063226223,
        -0.028013955801725388,
        0.033680155873298645,
        -0.10741371661424637,
        -0.0037517654709517956,
        0.04450096935033798,
        0.01734776608645916,
        -0.037666816264390945,
        0.0348188579082489,
        -0.04925280436873436,
        0.07149446755647659,
        -0.042789336293935776,
        -0.014972420409321785,
        -0.039509572088718414,
        -0.011596729047596455,
        -0.06131899729371071,
        0.0011935359798371792,
        0.03534283488988876,
        0.023722713813185692,
        -0.025199154391884804,
        -0.021778535097837448,
        -0.07579909265041351,
        -0.01968657225370407,
        0.02506691962480545,
        -0.09650985896587372,
        0.010665751062333584,
        -0.07166820764541626,
        -0.089124396443367,
        -0.09311925619840622,
        -0.0013299592537805438,
        -0.012913049198687077,
        0.012155437842011452,
        0.06805255264043808,
        -0.013038440607488155,
        -0.018045542761683464,
        0.01145590003579855,
        -0.09255009889602661,
        -0.08694756031036377,
        0.03451930359005928,
        -0.08795859664678574,
        0.10339080542325974,
        0.07580786198377609,
        -0.08525892347097397,
        -0.02554633840918541,
        0.013170048594474792,
        -0.024136481806635857,
        0.06377457827329636,
        -0.06876852363348007,
        -0.04957079887390137,
        0.05158001929521561,
        0.036245230585336685,
        0.02538183145225048,
        0.028663095086812973,
        -0.016519960016012192,
        0.024684768170118332,
        -0.060279399156570435,
        0.0011868063593283296,
        0.04784083366394043,
        0.06575633585453033,
        0.05183729529380798,
        0.07445967942476273,
        0.025172604247927666,
        0.07639304548501968,
        -0.07924031466245651,
        0.03714356571435928,
        0.05505990609526634,
        0.03841773048043251,
        -0.013788806274533272,
        -0.026951704174280167,
        -0.015743263065814972,
        -0.030957551673054695,
        -0.028362931683659554,
        -0.011458822526037693,
        -0.0761418491601944,
        -0.027183419093489647,
        -0.11513130366802216,
        0.033070433884859085,
        0.012880148366093636,
        0.013292566873133183,
        -0.051835063844919205,
        0.06361384689807892,
        0.01472572609782219,
        -0.06609438359737396,
        -0.022936532273888588,
        -0.03889179229736328,
        0.03675039857625961,
        0.06465394049882889,
        0.03797053173184395,
        -0.0028764461167156696,
        -0.0223948135972023,
        -0.044707734137773514,
        -0.04204651713371277,
        0.05834696814417839,
        0.032205644994974136,
        0.01390229631215334,
        0.0763217881321907,
        0.00479148468002677,
        0.05726375803351402,
        0.0009961151517927647,
        -0.038976896554231644,
        -0.058040324598550797,
        0.06737679988145828,
        -0.04118525981903076,
        0.04963678494095802,
        0.08291937410831451,
        0.0115169957280159,
        0.001317409216426313,
        -0.011040826328098774,
        0.05830063298344612,
        0.05128397047519684,
        0.022707795724272728,
        0.03754638880491257,
        -0.029787354171276093,
        3.1381280042879954e-33,
        -0.026652684435248375,
        0.133079394698143,
        -0.06226146221160889,
        -0.02461557276546955,
        0.004907894413918257,
        -0.03075466677546501,
        0.00477974396198988,
        -0.0006312097539193928,
        0.00240686465986073,
        -0.011486224830150604,
        -0.04067405313253403,
        0.06665074825286865,
        -0.030518118292093277,
        -0.02726079523563385,
        0.09494533389806747,
        -0.0762653723359108,
        -0.0592036135494709,
        0.08321670442819595,
        -0.10570430010557175,
        0.03886391595005989,
        -0.08110968768596649,
        -0.02290079928934574,
        0.003294552443549037,
        0.04635247588157654,
        0.028314832597970963,
        0.013054204173386097,
        0.026467688381671906,
        0.0026926915161311626,
        -0.0037928905803710222,
        0.015594241209328175,
        0.04179670289158821,
        0.06653483957052231,
        -0.059855636209249496,
        0.01680334098637104,
        -0.030886530876159668,
        -0.02617228776216507,
        -0.0062532140873372555,
        -0.0067385220900177956,
        0.009175478480756283,
        -0.024574991315603256,
        -0.05950278043746948,
        0.1319795548915863,
        0.0141448387876153,
        0.034970592707395554,
        -0.025195494294166565,
        0.025876173749566078,
        -0.017466621473431587,
        0.08425956219434738,
        -0.0763721913099289,
        0.026067692786455154,
        -0.07079260051250458,
        -0.0015589958056807518,
        -0.08652273565530777,
        -0.020174862816929817,
        0.04693463072180748,
        -0.030783293768763542,
        -0.004791403654962778,
        -0.05804501473903656,
        0.09474503993988037,
        -0.14797177910804749,
        -0.0015004187589511275,
        -0.04922183230519295,
        0.03372637555003166,
        0.00860960315912962,
        -0.025752097368240356,
        0.07088932394981384,
        0.08298832178115845,
        0.03747449815273285,
        -0.035548582673072815,
        0.007231292314827442,
        0.018200453370809555,
        0.02242397889494896,
        -0.09626564383506775,
        -0.05165184661746025,
        0.05109002813696861,
        0.013178424909710884,
        0.009749314747750759,
        0.00490792840719223,
        0.07097979635000229,
        -0.017170526087284088,
        -0.018867895007133484,
        0.07103396207094193,
        0.005294476635754108,
        -0.009444990195333958,
        0.0072423131205141544,
        -0.06307254731655121,
        0.034849222749471664,
        -0.05344896391034126,
        -0.013159970752894878,
        -0.04637643322348595,
        0.03417573496699333,
        -0.02919897809624672,
        -0.0842602550983429,
        -0.027423175051808357,
        -0.04152827337384224,
        -4.0348637880463625e-33,
        0.033631302416324615,
        -0.030075011774897575,
        -0.0177496038377285,
        0.030265837907791138,
        0.02597375586628914,
        -0.05704191327095032,
        0.05994901433587074,
        0.01545026060193777,
        0.059495389461517334,
        -0.016045549884438515,
        0.08980072289705276,
        0.06233976408839226,
        -0.11839115619659424,
        -0.029636623337864876,
        0.033815138041973114,
        -0.14427533745765686,
        0.08369652181863785,
        -0.050593193620443344,
        0.028834939002990723,
        -0.00860503502190113,
        0.14377275109291077,
        -0.03180241584777832,
        -0.06951253116130829,
        -0.014950127340853214,
        -0.04331089183688164,
        0.04968319088220596,
        0.01651560328900814,
        0.010282290168106556,
        -0.09789396822452545,
        -0.018793800845742226,
        0.05964108556509018,
        0.011180824600160122,
        -0.030918948352336884,
        0.08243042975664139,
        0.03869539871811867,
        0.04889519512653351,
        0.0218832828104496,
        0.023201413452625275,
        -0.07512864470481873,
        -0.037795018404722214,
        0.028752004727721214,
        0.02134685590863228,
        -0.0017599368002265692,
        -0.013736014254391193,
        0.0027628173120319843,
        -0.10213202983140945,
        0.034566935151815414,
        -0.08212114870548248,
        -0.027739519253373146,
        -0.09758680313825607,
        0.0111167524009943,
        0.002768712118268013,
        0.010922552086412907,
        -0.0780438482761383,
        -0.08266118913888931,
        0.018781114369630814,
        0.019070373848080635,
        0.06426718086004257,
        -0.02303529717028141,
        0.035104043781757355,
        0.03277814760804176,
        0.031340621411800385,
        -0.009770394302904606,
        -0.062306687235832214,
        -0.06476300954818726,
        0.009905888698995113,
        0.03738055378198624,
        0.0675230622291565,
        0.034665487706661224,
        -0.011549236252903938,
        0.015955112874507904,
        -0.049432188272476196,
        0.007210843730717897,
        -0.015421736054122448,
        -0.04977322742342949,
        0.009468958713114262,
        0.10208092629909515,
        0.06851918250322342,
        0.0065903388895094395,
        -0.009219808503985405,
        -0.03670889139175415,
        0.0015697440830990672,
        0.02553919143974781,
        0.05582951009273529,
        -0.019975101575255394,
        0.06982158869504929,
        0.019185110926628113,
        -0.10854834318161011,
        -0.0441291481256485,
        0.05001499131321907,
        -0.0679362416267395,
        0.01881391555070877,
        0.03794626519083977,
        0.031056789681315422,
        -0.03420015797019005,
        -5.1890822305722395e-08,
        -0.009592397138476372,
        0.0809115320444107,
        0.08484012633562088,
        0.07340864837169647,
        -0.01581554301083088,
        -0.02909310907125473,
        -0.07556980848312378,
        0.03959965705871582,
        -0.0821995660662651,
        -0.034755218774080276,
        0.011018333025276661,
        0.0432271808385849,
        0.03948370739817619,
        0.03097018040716648,
        0.08413735777139664,
        0.02024264819920063,
        -0.004109927918761969,
        0.003272209782153368,
        -0.0813894048333168,
        -0.01081956084817648,
        0.03907833620905876,
        0.018292846158146858,
        0.0338987298309803,
        0.014786787331104279,
        -0.05194803327322006,
        0.06858880072832108,
        -0.015739817172288895,
        -0.030029406771063805,
        0.08542738109827042,
        0.02954280376434326,
        -0.02384759671986103,
        0.05024675279855728,
        0.04934712126851082,
        0.07889352738857269,
        -0.017623653635382652,
        -0.09523069113492966,
        -0.03832654654979706,
        0.07080984115600586,
        0.007947918958961964,
        -0.021660059690475464,
        -0.08372345566749573,
        -0.1085510402917862,
        0.0104789724573493,
        0.05286995694041252,
        -0.026210065931081772,
        -0.06341653317213058,
        -0.002382526872679591,
        -0.08929632604122162,
        -0.03390904515981674,
        -0.006939118728041649,
        0.03654445335268974,
        0.03126535192131996,
        -0.029477214440703392,
        0.005066813435405493,
        -0.04167985916137695,
        -0.04159202426671982,
        0.04190196841955185,
        -0.03197091445326805,
        -0.04762813076376915,
        0.03792281076312065,
        -0.009626663289964199,
        -0.07983413338661194,
        -0.08449743688106537,
        0.11587350815534592
    ]
}