{
    "id": "L4AKeW0Y-F0",
    "title": "This is an SSD?! - PureStorage FlashBlade Tour",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-28T17:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=L4AKeW0Y-F0",
    "category": "Science & Technology",
    "tags": [
        "PureStorage",
        "Pure Storage",
        "SSD",
        "Datacenter",
        "Tour",
        "Data Center",
        "Flashblade",
        "flash blade",
        "FlashBladeS",
        "FlashBlade//S",
        "Flash Blade S"
    ],
    "views": 1340932,
    "likes": 57384,
    "comments_count": 2155,
    "description": "Thanks to Pure Storage for sponsoring this video! You can learn more about FlashBlade//S at  and follow Pure Storage on LinkedIn at   SSDs are fast, but in the datacenter, fast is never fast enough. So why did Pure Storage switch to slower QLC flash, and how is it FASTER than TLC?  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00  Intro 0:50  This is an SSD?! 1:59  How do SSDs work? 2:59  The Method to Pure Storages Madness 6:17  The FlashBlade//S 8:12  Touring the Datacenter 11:44  Who could need this much storage!? 13:15  An NVIDIA DGX A100 in action 14:08  What happens after the SSD array is retired? 15:10  The File System and what happens when you yank one out 17:45  Who is Pure Storage? 18:32  Conclusion",
    "description_links": [
        "https://purefla.sh/3u1ySFF",
        "https://purefla.sh/3xMZlIk",
        "https://linustechtips.com/topic/1446048-this-is-an-ssd-sponsored/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This is an SSD. No, no, seriously. This whole thing is a complete SSD and it's designed for massive data centers Like what you might find at the likes of meta. So how come I've never heard of it? Well, Pure Storage wonders that too And they've sponsored this video for us to take a tour of their facilities here in Sunny Mountain View, California and dig deeper into just how these things work. And maybe while they're at it, they can explain a little bit about how they can make the slowest flash used in SSDs today run twice as fast as last year's good stuff. Let's take a look. (techno music) (robot blipping) (techno upbeat music) From the beginning, Pure Storage's secret sauce has been in their approach to software. While their solution is proprietary, with it, they're able to tightly control each individual NAND flash chip in array potentially the size of a whole rack. But there's no way that I know of to drill down to that level of detail with any normal SSD. Like even enterprise grade SAS and U.2 drives have controllers that make the drives show up as disks. Like you don't get direct access to the chips, so what's up with that? This is a direct flash module, or DFM for short. It's a strange looking module. It's a lot larger than any SSD form factor I've seen before. And there's a lot of NAND flash on there. Up to 48 terabytes in the current generation. Along with super capacitors to make sure writes complete properly in the case of a sudden power loss. Pretty standard for data center SSD, yes, but while you'd expect loads of DRAM cache to make it fast, there's no DRAM on here. That is a terrible thing for performance under normal circumstances, just because of the way SSDs work. Whenever an individual die is busy performing some action, the data on it is completely inaccessible and you have to wait. DRAM caches collect the data and delay writing it until there's enough of it that it actually makes sense to spend the time actually writing it out, because in order for an SSD to write that data, any blocks that aren't totally empty first have to be erased. As you add additional levels of storage to a cell, so from single to multi, to triple, to quad, the time it takes to actually do this increases exponentially. And if you remember from our review of Intel's early DRAM list QLC drives, you would know that it can be slower than a hard drive. This could be catastrophic for real-time applications if your DRAM was array, decided that it was time for some spring cleaning. So have Pure Storage just gone completely mad? If so, well, there may be a method to their madness. Up to four of these DFMs can slot into a blade like this one, which itself is a self-contained server running a socketed Xeon processor. There's the DRAM. Yes, this Xeon CPU is acting as a glorified SSD controller. Now, it does other array management stuff too, but to talk to the storage, it actually runs a very low level interface bootstrap from Linux that talks to a custom controller on each DFM. These controllers do one very simple task, provide an interface to all the flash on the module. It doesn't really do anything that you'd expect from a typical SSD controller. All of that is handled by the CPU. While it does use the NVMe protocol and a U.2 connection, it won't show up as a disk in any other system simply because it doesn't have the brain. This arrangement lets them directly control when, where, and how new data gets soared. That is kinda like Apple Silicon in a way except they can handle multiple vendors of flash in the same array. More importantly, there's no pretending to be a hard drive. So while block sizes can vary between vendors, you're not forced to write out a whole four kilobytes each time you need to write a couple of bytes. So because the blade knows what the whole array looks like, data that's changed very frequently can be grouped together to prevent a situation known as tombstoning, where deleted but not erased data can stick around because uneconomical to evicted, which means that that cell is effectively never touched again. That's partly why overprovision space, which is where a percentage of the raw capacity is reserved for system use is important for SSD performance. A workaround that Pure Storage doesn't really need. In a nutshell, each of these blades is basically an SSD with extra steps. Because of that, Pure Storage is able to control things like when and where to start where leveling, which is incredibly important to QLC flash because it's typically only rated for less than a thousand program erase cycles. So obviously, there's a lot of incentive to never have to cycle a cell if you don't have to. To help with that, data is compressed wherever possible. There's another component to this too, because you can only ever read or write flash memory. Not both. The more you can avoid writing to frequently red cells or overwriting frequently written data to those cells, the less often you're stuck waiting for the SSD to come around and actually speed out the data you need, and that's especially important with QLC because of how long it takes to erase and rewrite data on that type of flash. Remember, at this kind of scale, you're talking databases that are massive enough and accessed often enough that even a delay of tens of milliseconds could be a major problem. (machine humming) And of course, they've thought about that too. What if I told you that in the time it takes for a write cycle to end, the inaccessible bits can be rebuilt from parity data. Yeah, that's not something you can do with the traditional SSD. The controllers that pretend that they're still spinning disks for the PC's sake quickly become the bottleneck. Let's meet a complete system and see it at work. This is a FlashBlade S chassis, Pure Storage's newest product. Each of these can hold 10 blades with four DFMs each, which add up to 48 terabytes per DFM, is a staggering 1.9 petabytes of storage and a single 5U chassis. Remember the lengths we had to go to in order to get a petabyte of hard drives? And then how many boxes a petabyte of flash took up? This is next level. There are four power supplies on this thing that are all modular, each with the capability of drawing 2.4 kilowatts from the wall. And while they don't sell them right now, multi-chassis configs with up to 10 of these things in a rack are in the pipeline. A fully-loaded FlashBlade//S has enough redundancy that it can lose a whole blade and a DFM in another blade and be totally fine. The blades connect to each other via the same back plane that the blades slot into, called fabric I/O modules, or FIOMs for short. Each FlashBlade//S has two FIOMs, which automates managing the blades and chassis units with a total of eight 100 gigabit per second links. Only four of which are currently used. They say that when they're ready to enable the others, they'll be able to do it for free via software update, something they're able to do, thanks to their evergreen model. There's a lot to this, but basically, they don't charge for new software features and their modular approach to hardware means that you can continuously upgrade to the point where one of their alpha stage clients from 10 years ago has continuously upgraded their array with a no downtime to this very day. It's like the array of thesis, none of it is still the same except for the data. And even that might be different now. But enough talk, let's see them roar in the data center. This is a rack full of the previous generation versions of what we were just looking at a little while ago. These are all connected together with a fabric link, this is I think all fibre. And they're all connected via these back planes here. So this top one here is set to go all of the pink cables. And this bottom one is gonna be mostly blue, there's some pink here as well. And all of these are communicating with each other in a maximum layout. So this whole rack is acting as basically a single SSD. As you can see, all of these power connectors are modular. The actual power cables themselves have tabs on them, so you can't just pull them out. So yeah, this is all of their last gen stuff. This over here is a rack full of their new gen stuff. This is FlashBlade//S. What we're looking at here is more or less a setup of a bunch of standalone units. Rather than having everything built together into one giant array, each one of these is a smaller array. Compared to spinning disks, this is actually pretty good power density. Like for the amount of storage you're actually getting here, it's significant savings, like it's something like 1.3 watts per terabyte or something like that. This is one of the first modules that they actually built for this type of array. It actually has an FPGA on it that takes all of its information from an SD card here. And that is a mini-USB port that tells you how long ago this was. But this was NVMe before pretty much anybody was using NVMe. It uses a U.2 connector here to connect directly to the backplane. Basically, I had to create a PCI express backplane for this, because actual controllers, HBAs, didn't really exist at the time for this kind of storage. And I was just handed one of these. This is a tray-less version. It's been taken out of the tray of the DFM that's currently being used. We can see that there are super capacitors on here in order to make sure that in case, say for example, one of these were unceremoniously yanked out the server. Any data that was already being written will be written. So it won't be partially written, it won't get corrupted in that way. Also, on the back, we can see here that we have extra NAND flash chips. This is a 48 terabyte module. 48. 48. That is a massive amount of storage. No hard drive could possibly even come close to this within the next, I don't know how long it would take, because currently, at the rate of growth for hard drives, it would probably be another 10 years or so assuming hard drive is still relevant at that point in time, which is something that Pure Storage is trying to actually avoid. They feel that flash storage is inherently superior to spinning disks. And quite frankly, from what I've seen so far, it definitely kinda looks like it. You get better density, better power draw, and you get a much, much lower level ability to like just manage the data on the drive than you would get from a traditional type of hard drive. Now, you might be asking yourself, who could possibly need this much storage? Well, the answer... Aww, there's rails and stuff here. (host laughs) This is great. So the answer is anybody who's in deep learning. So like, this is an NVIDIA DGX. This is one of the things that Pure Storage has actually partnered with NVIDIA for. Meta recently partnered with Pure Storage and, I think, also NVIDIA for their AI deep learning platform. So the DGX is powering the brains, whereas, Pure Storage is powering all of the data sets that they need to crunch through. So you're never going to get a GPU with petabytes of a video memory, at least, not in the next, I don't know, several decades, at least. So what we're looking at here is an array that's fast enough to keep up with those deep learning workloads on those GPUs to keep them fed, so they can actually be doing their job more often. Otherwise, what you would need is a massive amount of memory for the system to cache that kind thing, which is just impractical. So here, we have NAND flash doing that exact job. It is very responsive and very dense. So for those reasons, basically, like if you have a huge deep learning workload, this is pretty much the premier solution right now, as far as I can tell. Both NVIDIA and Pure Storage seem to think so. We're looking at here is an example of an NVIDIA DGX A100 in action. Right now, this is actually computing deep learning data and it's connected via 100 gig per per second links through these switches here to the Pure Storage arrays. So there's the previous generation FlashBlade. And I believe there's also a FlashBlade//S there as well, which the third generation. I think, they're doing performance testing on those right now to see which is faster and how to basically optimize for these workloads. It's pretty amazing that we're basically at a point where SSDs aren't fast enough and yet the SSDs they're replacing them with are technically slower, because they're using QLC memory instead of TLC, which is just mind boggling. It's supposed to be an order of magnitude, less efficient, and yet they're making it work. Now, you might be thinking to yourself, these are full computers in these blades and server chassis that are basically just being used as SSD arrays. Like what happens after the SSD array is retired, like when you no longer need it or when you upgrade to a new one? Is the whole chassis just kind of thrown out? Well, no. What Pure Storage is doing is they have whole bunch of completely empty chassis here running virtual machines and other workloads that don't require that kind of storage. So they're repurposing those Xeon processors that would otherwise just be, I don't know, like if you retired an SSD and put it on yourself, what does that make it? So in this case, these live on even if the flash has died or it's been upgraded because it was too small in capacity. And in fact, behind you there are a whole bunch of processors and RAM and other stuff that's just sitting there waiting to be tested or reused. Now, you might be wondering how you even manage to talk to these things. Well, the file system that they use, I say file system very loosely, it's actually more like a database that you can actually then create what they call authorities on top of it with 128 of the split across the entire array. The larger the array is, the faster they go. All of those authorities can be used to do things like create object stores like Amazon S3. And from there, you could also create SMB. So Samba, Windows file sharing, or NFS for Linux file sharing support. So pretty much, it doesn't look any different to the end user. You can use it however you feel like you need to use your data. So you can pull stuff directly down through Amazon through your cloud services deployments. Or you can just use it as network storage if that's what you really want. And what's really cool, they probably wouldn't let me do it, but if you take out one of the DFMs and like rearrange it or something, within 10 minutes, it picks right back up without having to do anything special. You just slot I back in and it's like nothing happened. So you can, say for example, if you've got a blade that's misbehaving or you wanna upgrade it, you can completely migrate over without having to change anything about your configuration. Your users basically won't know what happened, because nothing will have happened. It's kind of magic. It's really, really warm back here. But these switches we were looking at earlier with all of these chassis plugged in, this is one of them. Not only is this a network switch but it's also basically the same type of thing you find in a FIOM in the back of a FlashBlade//S. So it's got an x86 processor here that handles all of the communications. And in fact, when you plug in multiple FlashBlade chassis, this thing takes over and actually orchestrates the entire model. So they're no longer doing their own individual arrays. This thing takes over automatically. Also, each one of these ports can do 40 or 100 gigabits per second, depending on the FlashBlade chassis. The older models can only do 40, whereas, the newer model FlashBlade//S, that can do 100. So it's a massive amount of data that will flow between this thing and, well, the rest of the rack. - Now, that you've seen the tech, let's talk about who these guys even are. Pure Storage was founded in stealth mode back in 2009 and debuted in 2011 as one of the first companies to introduce all flash infrastructure solutions in the industry. In the early days, they used consumer grade SSDs, which (chuckles) if you look back on the state of SSDs back then was pretty ballsy. But the solution was always software-driven. And they quickly began developing their own flash modules, which started shipping in 2015. Fast forward to today, and they partnered with companies like Cisco and NVIDIA with clients across the globe. So big thanks to Pure Storage for sponsoring this video and letting us show off their gear. You can learn more and maybe deploy one of these for yourself, if you're a straight baller or if you're an IT manager at the links below. Thanks for watching, guys. Maybe go check out one of the Intel design center tours that Linus did a little while ago. Like those are really, really next level in terms of how behind the scenes we're seeing, like Intel basically never lets anybody see that kind of stuff. And I'm glad that we got to see this kind of stuff here.",
    "transcript_keywords": [
        "Pure Storage",
        "Storage",
        "SSD",
        "Pure",
        "data",
        "Pure Storage arrays",
        "flash",
        "array",
        "SSDs",
        "NAND flash",
        "basically",
        "kind",
        "DRAM",
        "FlashBlade",
        "back",
        "SSD controller",
        "Pure Storage secret",
        "thing",
        "data center SSD",
        "stuff"
    ],
    "transcript_entity_values": [
        "40",
        "A100",
        "one",
        "less than a thousand",
        "tens of milliseconds",
        "second",
        "U.2",
        "Apple Silicon",
        "four",
        "128",
        "first",
        "100",
        "SSD",
        "up to 10",
        "48 terabytes",
        "California",
        "SD",
        "DGX",
        "last year's",
        "several decades",
        "fed",
        "Only four",
        "5U",
        "another 10 years or",
        "GPU",
        "DFM",
        "FIOM",
        "2009",
        "today",
        "NVIDIA",
        "2011",
        "2015",
        "up to",
        "four kilobytes",
        "Amazon S3",
        "Samba",
        "1.9 petabytes",
        "this very day",
        "FlashBlade//S",
        "Sunny Mountain View",
        "SAS",
        "10",
        "Pure Storage's",
        "eight 100 gigabit",
        "PCI",
        "Meta",
        "RAM",
        "FlashBlade S",
        "FPGA",
        "48 terabyte",
        "Pure Storage",
        "48",
        "CPU",
        "TLC",
        "the early days",
        "FlashBlade",
        "Cisco",
        "Amazon",
        "third",
        "Linux",
        "Linus",
        "NAND",
        "10 years ago",
        "1.3 watts",
        "two",
        "the Pure Storage",
        "Intel",
        "100 gigabits",
        "2.4 kilowatts",
        "10 minutes",
        "Xeon"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "ORG"
    ],
    "vector": [
        -0.0729723572731018,
        -0.02479606494307518,
        -0.03961077332496643,
        0.01827109418809414,
        0.06306997686624527,
        -0.037930700927972794,
        -0.0544264018535614,
        0.0266775693744421,
        0.12091796845197678,
        0.006076794117689133,
        0.06359540671110153,
        0.05366935953497887,
        -0.04201091453433037,
        -0.0024337039794772863,
        0.006534933112561703,
        -0.06575515866279602,
        0.06666973233222961,
        -0.06563270837068558,
        -0.03320092707872391,
        0.006169352680444717,
        -0.054178036749362946,
        -0.13517695665359497,
        0.0008206017664633691,
        -0.01900484599173069,
        0.04441160336136818,
        0.004210824146866798,
        -0.13448740541934967,
        0.023841504007577896,
        0.059212956577539444,
        -0.03169051930308342,
        -0.021763773635029793,
        0.0771801546216011,
        -0.022450437769293785,
        0.010622791014611721,
        -0.013122723437845707,
        -0.03280576691031456,
        0.009705956093966961,
        -0.0415911003947258,
        -0.07661284506320953,
        -0.04784184321761131,
        -0.005662005394697189,
        -0.0552373006939888,
        -0.04164495691657066,
        0.03570494055747986,
        -0.01415481511503458,
        -0.013115164823830128,
        -0.007378623355180025,
        0.017649628221988678,
        -0.035019662231206894,
        -0.08723241090774536,
        -0.08144714683294296,
        0.052835121750831604,
        -0.061508554965257645,
        0.03417993709445,
        -0.0383809469640255,
        0.067964106798172,
        0.038800839334726334,
        0.029892176389694214,
        0.013538411818444729,
        0.052108410745859146,
        -0.00921306386590004,
        -0.05556401237845421,
        0.08419474959373474,
        0.01609557494521141,
        0.02562001347541809,
        -0.01868818700313568,
        -0.017605476081371307,
        0.015838082879781723,
        -0.001436347607523203,
        -0.07711594551801682,
        0.025020092725753784,
        0.0077804820612072945,
        -0.03754262626171112,
        0.06589050590991974,
        -0.005190121941268444,
        -0.12057030200958252,
        0.033108387142419815,
        0.031814493238925934,
        -0.03552727401256561,
        -0.018113134428858757,
        0.04502327740192413,
        -0.10722798854112625,
        -0.005736725404858589,
        -0.047517258673906326,
        0.043972428888082504,
        -0.04336794838309288,
        -0.024563848972320557,
        -0.019506705924868584,
        -0.1029883623123169,
        -0.05317629873752594,
        0.07031625509262085,
        0.13842585682868958,
        0.0077370828948915005,
        -0.0037380277644842863,
        0.007405697368085384,
        0.030873697251081467,
        -0.015997955575585365,
        -0.005580313969403505,
        -0.012875651009380817,
        -0.001869053696282208,
        0.017390424385666847,
        0.06612949818372726,
        -0.00867427233606577,
        0.017214177176356316,
        -0.04641637206077576,
        -0.1044238731265068,
        0.11463583260774612,
        0.1287480592727661,
        -0.04783634841442108,
        -0.02421697787940502,
        0.03796982765197754,
        0.03259474039077759,
        -0.07143018394708633,
        -0.03541369363665581,
        -0.08438251912593842,
        -0.007068110164254904,
        -0.1268293857574463,
        0.04795584827661514,
        0.036845460534095764,
        0.0270430576056242,
        -0.04301903769373894,
        0.025000907480716705,
        -0.0392908975481987,
        0.016682714223861694,
        0.035812899470329285,
        0.05023990944027901,
        0.022611040621995926,
        -6.048644853755279e-34,
        0.05721358582377434,
        0.008813380263745785,
        -0.06359928101301193,
        -0.06930215656757355,
        -0.022327685728669167,
        -0.01944568380713463,
        0.03461962938308716,
        0.01963631436228752,
        -0.05391068011522293,
        -0.021599575877189636,
        -0.03681435063481331,
        -0.018435349687933922,
        -0.06999775022268295,
        0.04037519544363022,
        0.05120177939534187,
        -0.09022341668605804,
        -0.055795103311538696,
        -0.020609036087989807,
        0.02582579292356968,
        -0.053617510944604874,
        0.08388349413871765,
        0.0753336101770401,
        -0.006308041978627443,
        -0.021304836496710777,
        0.07850349694490433,
        0.02003457210958004,
        -0.01769942045211792,
        0.005747936200350523,
        0.047985684126615524,
        0.05251885950565338,
        -0.10153064131736755,
        -0.019932111725211143,
        -0.018715623766183853,
        -0.11484748870134354,
        0.11965618282556534,
        0.04588983952999115,
        -0.0805339515209198,
        -0.043447889387607574,
        -0.04314091429114342,
        -0.04265449568629265,
        0.023660046979784966,
        0.01951741613447666,
        -0.06762470304965973,
        -0.07122614979743958,
        -0.11326564103364944,
        0.0779779702425003,
        0.003483101725578308,
        0.048348743468523026,
        0.017261670902371407,
        0.053845543414354324,
        0.002126295119524002,
        0.033464305102825165,
        -0.09667040407657623,
        0.06378941237926483,
        0.02603943645954132,
        0.038059256970882416,
        0.0495271161198616,
        -0.025693507865071297,
        0.026148121803998947,
        0.09291427582502365,
        -0.0026376238092780113,
        -0.015089292079210281,
        -0.03306685388088226,
        0.020910343155264854,
        -0.08157452195882797,
        -0.01073369849473238,
        0.10033170878887177,
        0.028203753754496574,
        -0.005426302552223206,
        -0.002098091645166278,
        0.013788470067083836,
        -0.02910650335252285,
        0.08443380147218704,
        -0.04205029830336571,
        0.10900408774614334,
        -0.01602528616786003,
        -0.04106885567307472,
        -0.03131234273314476,
        -0.036136262118816376,
        -0.05969911068677902,
        -0.0943097472190857,
        -0.014104185625910759,
        0.024817995727062225,
        0.06174309179186821,
        -0.01065079402178526,
        0.00419008731842041,
        0.015556592494249344,
        0.03371765837073326,
        -0.02120342291891575,
        -0.04143268242478371,
        0.007457530125975609,
        -0.004633867647498846,
        0.048166777938604355,
        -0.025568753480911255,
        -0.02425769343972206,
        -1.6028049144454206e-33,
        0.015479165129363537,
        -0.024310609325766563,
        0.007598245516419411,
        0.06579489260911942,
        -0.025835763663053513,
        -0.013252049684524536,
        -0.0332973450422287,
        -0.02574796788394451,
        0.012566487304866314,
        0.01528781559318304,
        -0.010050300508737564,
        -0.029569681733846664,
        -0.11928857117891312,
        -0.07453736662864685,
        -0.04566635191440582,
        -0.004935784265398979,
        0.044817183166742325,
        -0.08053603768348694,
        0.013899518176913261,
        0.005027382634580135,
        -0.006422311998903751,
        0.018016712740063667,
        0.08756735175848007,
        0.09680241346359253,
        0.03051595576107502,
        0.007989040575921535,
        0.060823675245046616,
        0.04924220219254494,
        -0.026824865490198135,
        -0.00035275518894195557,
        -0.014080403372645378,
        -0.04439141973853111,
        -0.05583181604743004,
        -0.025732209905982018,
        -0.010799483396112919,
        0.017064210027456284,
        0.001818567281588912,
        0.030092405155301094,
        -0.03423309326171875,
        -0.05486278235912323,
        -0.0023882747627794743,
        -0.009008033201098442,
        -0.03709888085722923,
        -0.026494532823562622,
        0.03495485708117485,
        0.05442928150296211,
        -0.06013188138604164,
        -0.04236867278814316,
        0.04991870000958443,
        0.016836613416671753,
        0.07638069242238998,
        0.026148399338126183,
        0.06344142556190491,
        0.03487774357199669,
        0.0018612724961712956,
        -0.06543611735105515,
        -0.059931572526693344,
        0.0542827844619751,
        -0.05184539780020714,
        -0.029202990233898163,
        0.12339290976524353,
        -0.033317986875772476,
        -0.057827528566122055,
        -0.025993432849645615,
        0.027028603479266167,
        -0.008311513811349869,
        0.08030592650175095,
        -0.009357636794447899,
        -0.05948523432016373,
        -0.02598130702972412,
        -0.02338118851184845,
        -0.06087271124124527,
        0.007657169830054045,
        0.0003094835265073925,
        -0.06826452910900116,
        -0.03095279633998871,
        0.016612499952316284,
        0.02919764444231987,
        0.045536208897829056,
        -0.05975789949297905,
        -0.04983482137322426,
        0.05834381282329559,
        -0.027484923601150513,
        -0.03713873401284218,
        -0.04779898002743721,
        0.017059531062841415,
        0.03425346314907074,
        -0.032251983880996704,
        -0.006932107266038656,
        0.005812349263578653,
        -0.04802814498543739,
        0.057103291153907776,
        -0.03867888078093529,
        0.057015690952539444,
        0.024272682145237923,
        -4.90652745099851e-08,
        0.03683801740407944,
        0.01238126028329134,
        -0.03332174941897392,
        0.02472502738237381,
        0.0581481009721756,
        -0.061335884034633636,
        -0.004249021410942078,
        0.09963258355855942,
        0.08830702304840088,
        0.006840142421424389,
        0.019009718671441078,
        -0.02147401124238968,
        -0.06177213415503502,
        -0.0548350065946579,
        0.046375822275877,
        0.041079893708229065,
        -0.061327170580625534,
        -0.08739249408245087,
        -0.008654368110001087,
        -0.07412087917327881,
        0.009379260241985321,
        0.06350867450237274,
        0.006261324509978294,
        -0.08994518220424652,
        0.009144509211182594,
        0.05600414797663689,
        0.03296632692217827,
        0.049694664776325226,
        0.12029550969600677,
        -0.09268375486135483,
        0.011959327384829521,
        -0.02822856977581978,
        0.007501695305109024,
        0.03764563798904419,
        0.07149328291416168,
        0.022801142185926437,
        0.023363251239061356,
        0.034302353858947754,
        0.05240369215607643,
        0.07182078063488007,
        -0.04429762437939644,
        -0.007718889974057674,
        0.061925895512104034,
        -0.015116545371711254,
        -0.053043097257614136,
        -0.03782464936375618,
        -0.09053076058626175,
        0.05512722581624985,
        0.02092294581234455,
        0.10030815750360489,
        -0.006991900037974119,
        -0.06542237848043442,
        -0.06844029575586319,
        0.031858403235673904,
        0.03983842581510544,
        0.0018856400856748223,
        0.033047519624233246,
        -0.0025736261159181595,
        -0.039025984704494476,
        0.061438508331775665,
        0.09511614590883255,
        -0.07867179065942764,
        0.02118840627372265,
        0.11424925178289413
    ]
}