{
    "id": "L5eSaFIIUpM",
    "title": "Samsung Note 9 Teardown! - Is there Water inside?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-08-21T15:12:49Z",
    "video_url": "https://www.youtube.com/watch?v=L5eSaFIIUpM",
    "category": "Howto & Style",
    "tags": [
        "Note 9 Teardown",
        "Note 9",
        "Samsung note 9",
        "not 9",
        "Note 9 review",
        "Note 9 Hands on",
        "samsung note",
        "android",
        "best smartphone",
        "iphone",
        "new iPhone",
        "Note 9 Disassembly",
        "how to take apart note 9",
        "water carbon",
        "heat pipe",
        "fortnite",
        "fortnight",
        "gaming phone",
        "best phone for gaming",
        "tear-down note 9",
        "variable Aperture camera",
        "Jerryrig",
        "Note 9 water cooling"
    ],
    "views": 4916283,
    "likes": 81344,
    "comments_count": 5719,
    "description": "Lets teardown the Samsung Galaxy Note 9! Grab your free audio book with a 30 day trial of Audible:  or text jerryrig to 500 500! I recommend Ready Player One. Seriously one of the best books Ive listened to in awhile. Thanks for sponsoring this video!   The Galaxy Note 9 has been teasing us with its water carbon cooling system since launch day. And its time to open up Samsung's newest Note 9 Phone and reveal its secrets. Lets get a close look at the Heat Pipe, and the Variable Aperture Camera.  There is so many cool things to look at inside this high tech piece of technology. Do you think that heat pipe is enough for some Fortnite Gaming? Note 9 Durability Test Video:   Fix your Note with parts and guides from iFixit!:   Current Galaxy Note 9 Pricing on Amazon:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.audible.com/jerryrig",
        "https://youtu.be/sfwkl3Qegtg",
        "https://ifix.gd/2zNeWuJ",
        "https://amzn.to/2XU0zm1",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It's time to tear down the brand new Galaxy Note 9, and take an inside look at that water carbon Fortnite ready heat dissipation system. Normally I'd suggest removing the s-pen first, but we already took that apart in my last video. Huge thanks to Audible for sponsoring this video. Let's get started. [Intro] Getting inside watertight phones is never super fun, but heat is our best friend. Softening the adhesive holding the back glass layer to the metal frame of the phone, this is much harder than it looks. The phone is trying to hold itself together while simultaneously melting my fingers off. I'll use a bit of card stock around the curved glass corners to avoid the pressure a metal tool would inflict. Once the adhesive is completely cut from around the edges of the glass, the whole thing pulls away from the phone body. Still attached is the fingerprint scanner ribbon, but it looks like I didn't nick it with any of my tools, so we should be okay. It's the same solid slab of black glass we've come to expect from Samsung, so a clear phone is definitely an option, but we'll save that for another day. The teardown gets easier at this point with eleven normal Philips head screws surrounding the top plastics and that wireless charging pad. Once those screws are out and set off to the side in an organized fashion of course, I can pull away the wireless charging from the phone. And we get a closeup look at the golden contact pads it uses to transfer power and communicate with the motherboard, as well as what I believe is the battery temperature sensing niblet in the top right corner. I'll unplug the battery from the motherboard so we don't have to worry about anything shorting out, and then we can mosey on down to the 7 screws holding the bottom plastics over the charging port. Pulling that off reveals a large loudspeaker along with it's gold contact pads, the water damage indicator, and another foam ball pit for ants, like we saw inside of the OnePlus 6. These foam balls realistically have something to do with sound dampening, but I honestly still have no idea. This time around, the Note 9's motherboard has 3 screws holding it to the frame: two screws down at the bottom and 1 screw up at the top left. Then I can start unplugging the ribbons like little Legos. The front sensor ribbon, the iris scanner ribbon up at the top, and the charging port ribbon down at the bottom of the motherboard. Along with the larger screen ribbons on the right side. And, of course, the SIM and SD card tray is also holding the motherboard in place and then still needs to be removed. Pulling the motherboard out of the frame is easy enough - just navigating around all the ribbon we unplugged. And finally we get our first look at the incredibly large copper heat sink. We'll commence the autopsy on that guy in just a second, but first we'll remove the front facing 8 megapixel camera. No image stabilizing on this guy the dual rear cameras though should both have it. The whole unit is very well-adhered to the motherboard. Samsung definitely doesn't want these moving around. But once it's off, each lens does indeed have it's own hardware stabilizing built in. The 12 megapixel variable aperture camera, which you can see opening and closing here, has a physical aperture mechanism which changes automatically to let in more or less light as the camera needs it. It's also hardware stabilized. The 2x telephoto zoom lens on the left is also optically stabilized. This is probably the most high tech complex system of cameras in any smartphone on the market right now. I'll plug all 3 cameras back into place so that they'll still function if the phone still survives the rest of this teardown. The charging port has changed a bit this year with the Note 9. It's quite a bit smaller than the previous Note 8. All that's included on the itty bitty board is the quick charging USB-C docking port with it's water resistant rubber ring around the tip, as well as a tiny little microphone. Replacement charging ports for last year's Note 8 are only about $12 right now, so it definitely pays to know how to fix your phone. Down at the bottom of the phone we have our normal water resistant mesh for the loudspeaker, the headphone jack, and the circular vibration motor with it's golden contact pads. There is one more water damage indicator up at the top of the phone, visible through the SIM and SD card tray when it's pulled out. And of course we have the gigantic earpiece speaker. One question I get surprisingly often is 'what happens if I stick my SIM card tool in the wrong hole'? The answer to that is nothing happens. As you can see from inside the phone, the water resistant mesh and corresponding microphone hardware are off at an angle to the hole itself. So no matter how far you stick your tool inside, it won't damage or puncture anything important. Thumbs up for that. The only things inside the phone we have left to remove are the large 4,000 milliamp hour battery, and the large water carbon heat dissipation system. Once again, Samsung has added enough adhesive under this battery to glue an elephant to the ceiling. It's a ridiculous amount...even bending my metal pry tools during the removal. There are no magical pull tabs either like we've seen in some of the iPhones. The battery does finally come out though. If you remember the Note 7 battery, the one that kept exploding, it was 3500 milliamp hours. Last year's Note 8 dropped down to 3300 milliamp hours. But this year Samsung has regained it's confidence and is rocking a massive 4000 milliamp hour battery. Hopefully it works out for them. Now for that water carbon heat dissipation system. It's definitely one of the larger heat pipes that we've seen inside of a cell phone, way bigger than last year's Note 8, and looks to be about the same size as the massive heat pipe we found inside the gaming Razer Phone. The only way we can truly understand this thing is with an autopsy, which means it needs to come out of the phone. Under the copper heat sink is the same adhesive Samsung slathered under the battery. Once it's out, we see that the cylindrical heat pipe itself has a large rectangular copper pad over the top of it. Remember, copper itself is a fantastic thermally efficient conductor, so a solid copper plate is useful next to a super hot processor. But that doesn't give us any insight into the water carbon stuff Samsung was mentioning. Supposedly inside this vacuum sealed tube is liquid usually a super small amount. And realistically, because of that minut amount, the moment it's opened up, any liquid or vapor will evaporate instantly. The tube itself is hollow and slicing it open reveals a copper wick inside. The mesh screen inside this tube acts as a wick to help transport the small amount of liquid from the hot end of the pipe to the cool end of the pipe during high temperature loads, like gaming or texting an angry girlfriend. It's a capillary weave of copper you could say. The whole thing looks very much like a normal heat pipe, just like we've seen in other smartphones, so I'm not sure where the carbon part comes into play, but at this point we would just be nitpicking the advertising jargon. Either way, this thing is massive, and it's copper, so it's pretty safe to assume it's going to do it's job of cooling down the phone during long fortnight gaming sessions. Speaking of video games, you've probably heard of the movie Ready Player One. It sounds clich, but the book is really so much better and more detailed. The tasks that Wade Watts needs to complete for the contest are entirely different in the book, and it just expounds on the universe as a whole. Huge thanks to Audible for sponsoring this video. If you enjoyed the movie, Ready Player One, you can grab the book version for free with a 30-day trial using the code 'jerryrig' that I'll link in the description. Or go to Audible.com/jerryrig. Texting the word 'jerryrig' to 500-500 works too. J-E-R-R-Y-R-I-G. Ready Player One is definitely one of my current favorites. Obviously I won't be able to reuse this cut up copper contraption when I reassemble the phone, but everything should still function just fine without it. I won't be winning any of those fortnight chicken dinners or whatever because it might throttle a bit, but let's see if the phone still turns on. The battery is back into place, along with the small charging port and it's 2 screws. And then of course the motherboard can settle down taking special care enough to pinch any of the ribbon cables underneath the board. Every Lego connection is on top this time around, and surprisingly has no wire cables. I'll plug the screen ribbons along the right side, and the charging port ribbon down at the bottom, along with the front sensors. I'll put the 3 motherboard screws back into place before plugging in the battery. And then the loudspeaker plastics, and the wireless charging plastics can be set into place with the 18 screws holding everything together. The back glass with it's short fingerprint scanner is kind of tricky, but after that's plugged in, the whole thing turns on and we're good to go. Samsung has been doing some pretty innovative stuff with the Note 9. This was definitely a fun teardown. The cameras and heat pipe were incredibly interesting from the inside. Do you thing mobile gaming is the way of the future? Don't forget to grab your free copy of Ready Player One with a 30-day trial of Audible in the description. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Fortnite ready heat",
        "phone",
        "Galaxy Note",
        "brand new Galaxy",
        "water carbon Fortnite",
        "carbon Fortnite ready",
        "Note",
        "Fortnite ready",
        "inside",
        "heat",
        "charging",
        "charging port",
        "charging port ribbon",
        "battery",
        "carbon Fortnite",
        "Ready Player",
        "motherboard",
        "water",
        "Samsung",
        "year Note"
    ],
    "transcript_entity_values": [
        "4000 milliamp hour",
        "Ready Player",
        "Galaxy Note 9",
        "Wade Watts",
        "bitty board",
        "8 megapixel",
        "9",
        "3300 milliamp hours",
        "4,000 milliamp hour",
        "30-day",
        "8",
        "SD",
        "Lego",
        "two",
        "jack",
        "Philips",
        "fortnight",
        "1",
        "2x",
        "Legos",
        "12 megapixel",
        "only about $12",
        "SIM",
        "Audible",
        "Last year's",
        "eleven",
        "this year",
        "last year's",
        "the OnePlus 6",
        "iPhones",
        "Razer Phone",
        "first",
        "second",
        "500-500",
        "Ready Player One",
        "Samsung",
        "18",
        "3500 milliamp hours",
        "3",
        "One",
        "USB",
        "another day",
        "one",
        "7",
        "Fortnite",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "EVENT",
        "NORP",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.11131946742534637,
        0.07438614219427109,
        0.10023263096809387,
        -0.04053912311792374,
        0.07725661993026733,
        -0.028825854882597923,
        0.020299265161156654,
        0.0994735062122345,
        -0.07179761677980423,
        0.007543811574578285,
        -0.05620632693171501,
        -0.014399372972548008,
        -0.010362925939261913,
        0.03211374208331108,
        0.05473380535840988,
        -0.01693582534790039,
        0.03434133529663086,
        -0.030059542506933212,
        -0.04862649738788605,
        -0.014173864386975765,
        0.009405341930687428,
        0.01959911547601223,
        0.020354708656668663,
        -0.06323060393333435,
        0.05243907868862152,
        0.06777491420507431,
        0.02891918644309044,
        0.0362168587744236,
        -0.0799972414970398,
        0.05200272053480148,
        0.010518371127545834,
        0.016925249248743057,
        -0.1214611753821373,
        0.020756810903549194,
        0.03202301636338234,
        -0.0394987091422081,
        0.009390171617269516,
        -0.05770517513155937,
        -0.07819585502147675,
        -0.02541232481598854,
        -0.05907454714179039,
        -0.02223992347717285,
        0.09137426316738129,
        -0.059193141758441925,
        0.042602088302373886,
        -0.0017442593816667795,
        0.022673850879073143,
        -0.029492560774087906,
        -0.024308158084750175,
        0.022082781419157982,
        -0.04012438654899597,
        -0.055352628231048584,
        0.03976776823401451,
        0.07853040844202042,
        -0.06010213866829872,
        0.0012818091781809926,
        0.020485050976276398,
        -0.12106907367706299,
        0.01671532355248928,
        -0.027764465659856796,
        0.12383175641298294,
        -0.01220700703561306,
        -0.0787402018904686,
        0.05981624498963356,
        0.019681455567479134,
        -0.012755167670547962,
        0.03340516611933708,
        -0.024306844919919968,
        0.041058652102947235,
        -0.012330452911555767,
        -0.0012028546771034598,
        0.08333159983158112,
        -0.007742129731923342,
        -0.10157671570777893,
        -0.03569934144616127,
        0.02747906744480133,
        0.03565694019198418,
        -0.03051343373954296,
        -0.04689430817961693,
        0.04962405189871788,
        0.09963011741638184,
        -0.04652717709541321,
        0.03565544635057449,
        0.037012796849012375,
        -0.03088301420211792,
        0.07659200578927994,
        0.08317147195339203,
        -0.009152247570455074,
        -0.08315872400999069,
        -0.05614309012889862,
        -0.02735365368425846,
        0.08243752270936966,
        -0.014164392836391926,
        -0.009019264951348305,
        -0.004366930574178696,
        0.01036247331649065,
        -0.11324380338191986,
        -0.08769821375608444,
        -0.0444527193903923,
        0.029501574113965034,
        0.0016943748341873288,
        -0.021657485514879227,
        0.030748611316084862,
        -0.007120175752788782,
        0.10912920534610748,
        -0.0356319360435009,
        -0.011625507846474648,
        0.06259225308895111,
        0.015619170852005482,
        -0.07913344353437424,
        -0.061848416924476624,
        0.005064553115516901,
        -0.040530793368816376,
        0.005063897464424372,
        0.038767583668231964,
        -0.04379766061902046,
        -0.06320390105247498,
        0.04896150901913643,
        0.057117026299238205,
        0.12262649089097977,
        0.00883086584508419,
        0.04199475049972534,
        -0.06952160596847534,
        0.015650685876607895,
        0.06560035049915314,
        0.023217402398586273,
        -0.06556368619203568,
        2.990024348621026e-33,
        0.06228876858949661,
        0.044773947447538376,
        -0.0012510045198723674,
        -0.049565501511096954,
        0.04127354547381401,
        0.015368727035820484,
        -0.01044285949319601,
        0.039107438176870346,
        -0.03260926157236099,
        -0.03388797119259834,
        0.04397102817893028,
        -0.009686124511063099,
        -0.08791974186897278,
        0.07192326337099075,
        0.028046652674674988,
        -0.12813657522201538,
        -0.03282666206359863,
        -0.0169734675437212,
        -0.05757912993431091,
        0.01031199935823679,
        -0.07181328535079956,
        -0.05800718814134598,
        0.024559788405895233,
        -0.020211193710565567,
        0.0857405886054039,
        0.09718569368124008,
        0.02840387634932995,
        0.06940420717000961,
        0.009014585055410862,
        0.011462745256721973,
        -0.11665602028369904,
        -0.04027479514479637,
        -0.026110077276825905,
        -0.014442446641623974,
        0.00972564797848463,
        0.018247051164507866,
        -0.0434090718626976,
        -0.04836039990186691,
        0.031954143196344376,
        -0.004945634864270687,
        0.0013943009544163942,
        0.04782019183039665,
        -0.006774473935365677,
        -0.009574858471751213,
        0.026454109698534012,
        -0.022785549983382225,
        -0.036647312343120575,
        0.007968071848154068,
        0.010458888486027718,
        -0.05766640603542328,
        0.06044495478272438,
        -0.0059233736246824265,
        -0.029048651456832886,
        0.053708478808403015,
        -0.05642138794064522,
        -0.0784398764371872,
        0.07670725136995316,
        -0.032892871648073196,
        0.002583675552159548,
        0.032891836017370224,
        -0.053243283182382584,
        0.025137389078736305,
        -0.03256990388035774,
        0.031909480690956116,
        -0.09685831516981125,
        0.061334989964962006,
        0.059079915285110474,
        0.025981619954109192,
        0.013250898569822311,
        -0.07930418848991394,
        -0.06812439113855362,
        -0.03588296100497246,
        0.07503765821456909,
        -0.012303144671022892,
        0.026164690032601357,
        0.06525707244873047,
        0.025064975023269653,
        -0.06561031937599182,
        0.0016468465328216553,
        -0.04235047101974487,
        -0.05741919204592705,
        -0.055195074528455734,
        0.08885505050420761,
        0.033726051449775696,
        -0.023243213072419167,
        -0.10519573092460632,
        0.007900216616690159,
        -0.11877057701349258,
        0.048021622002124786,
        0.015665093436837196,
        -0.051645442843437195,
        -0.031186429783701897,
        0.008507074788212776,
        -0.04972656071186066,
        -0.044473499059677124,
        -4.1557178316223404e-33,
        0.02284129709005356,
        -0.029040547087788582,
        -0.019371123984456062,
        0.0337856151163578,
        0.031149089336395264,
        0.014261960983276367,
        0.12048142403364182,
        0.02801409736275673,
        0.01841205731034279,
        -0.0639106035232544,
        -0.020521843805909157,
        0.045239657163619995,
        -0.011158891022205353,
        -0.11228277534246445,
        0.009954143315553665,
        -0.026441706344485283,
        0.005956924986094236,
        -0.0706929862499237,
        0.05752841755747795,
        0.031204232946038246,
        0.04580972343683243,
        0.023494882509112358,
        0.10478051006793976,
        0.036600660532712936,
        -0.0333438366651535,
        0.006176035385578871,
        0.011601240374147892,
        -0.08137881755828857,
        0.03278414532542229,
        -0.02237660624086857,
        -0.02050258032977581,
        -0.017269913107156754,
        -0.006789448205381632,
        0.022738782688975334,
        0.0015569942770525813,
        0.051635999232530594,
        0.13375669717788696,
        -0.014398889616131783,
        0.023149916902184486,
        -0.0543098971247673,
        0.06525184959173203,
        0.007170358207076788,
        -0.015466851182281971,
        -0.027737144380807877,
        -0.06674470752477646,
        0.06849119067192078,
        0.0516291968524456,
        -0.03836172819137573,
        -0.09052520245313644,
        0.03306172043085098,
        -0.005174008663743734,
        -0.06663630902767181,
        -0.03297513350844383,
        0.03891495242714882,
        -0.012765398249030113,
        -0.019935404881834984,
        0.069908507168293,
        -0.05250005051493645,
        -0.07679112255573273,
        0.004696906544268131,
        0.11375389248132706,
        0.11423470824956894,
        -0.038162972778081894,
        -0.04652107506990433,
        0.014771922491490841,
        0.0007283291197381914,
        0.022429460659623146,
        0.050626471638679504,
        0.03606836497783661,
        -0.01799437776207924,
        0.014887289144098759,
        -0.06421824544668198,
        0.0121304327622056,
        -0.04624329134821892,
        0.03549236059188843,
        0.02572903409600258,
        -0.0380861796438694,
        -0.062455516308546066,
        -0.03466644510626793,
        0.03508634865283966,
        0.006069913040846586,
        0.05344272404909134,
        -0.04964105412364006,
        0.026022443547844887,
        0.17079880833625793,
        -0.06940165162086487,
        -0.0030729121062904596,
        -0.01680498756468296,
        -0.028220271691679955,
        0.07455373555421829,
        -0.04244431108236313,
        0.013668706640601158,
        -0.006192188244313002,
        0.04717230424284935,
        -0.008183005265891552,
        -4.865220049055097e-08,
        0.0003398485714569688,
        -0.005651914980262518,
        0.03780839219689369,
        0.00788498017936945,
        -0.052405111491680145,
        -0.09344524890184402,
        0.06876229494810104,
        0.018922971561551094,
        0.07840151339769363,
        -0.03329239785671234,
        0.007631995249539614,
        -0.06813719123601913,
        -0.036899060010910034,
        0.03130999207496643,
        -0.06377735733985901,
        -0.006284025032073259,
        0.03707677870988846,
        0.0008875590283423662,
        -0.03604615479707718,
        -0.02767140232026577,
        -0.01893332041800022,
        0.00019124668324366212,
        0.06862515211105347,
        -0.02612951584160328,
        0.01983671821653843,
        0.07376950979232788,
        -0.061241354793310165,
        0.012413740158081055,
        0.08651590347290039,
        0.04482065886259079,
        -0.06821200251579285,
        -0.021313637495040894,
        -0.03490495681762695,
        -0.03402957692742348,
        0.05075431242585182,
        -0.04987692832946777,
        0.05387575179338455,
        0.03189216926693916,
        0.032315973192453384,
        0.05584707111120224,
        -0.004737288225442171,
        -0.012979097664356232,
        -0.05041038617491722,
        0.026663169264793396,
        0.009197419509291649,
        -0.10393452644348145,
        -0.04130466282367706,
        -0.06319594383239746,
        -0.02324688993394375,
        0.09945859760046005,
        0.017999989911913872,
        0.0002273019345011562,
        -0.09514674544334412,
        0.024036988615989685,
        0.010601275600492954,
        0.007306305691599846,
        0.008148175664246082,
        0.032689377665519714,
        -0.07852298021316528,
        0.030537042766809464,
        -0.0003037604910787195,
        0.006064774468541145,
        -0.024612927809357643,
        0.05658508464694023
    ]
}