{
    "id": "LCeSCk2JYnU",
    "title": "This doesn't seem SAFE - Redmi Note 11 Pro + 5G",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-03-29T20:25:39Z",
    "video_url": "https://www.youtube.com/watch?v=LCeSCk2JYnU",
    "category": "Science & Technology",
    "tags": [
        "RedMi",
        "Xiaomi",
        "Smartphone",
        "Mobile Device",
        "Display",
        "Flagship",
        "120W charging",
        "Charge",
        "Hyper Charge",
        "Is this safe?",
        "It's Really FAST",
        "The fastest I've ever seen"
    ],
    "views": 2380355,
    "likes": 73224,
    "comments_count": 3710,
    "description": "Learn more about Grid Studio at:  Enter to win a Grid studio frame today at:   You wanted affordable phones; well, you got it! The RedMi Note 11 Pro+ Plus 5G is a reasonably priced smartphone with a few excellent flagship features, such as the 120W charging that you can get on a Xiaomi Mi 12 Pro! We tested it, and it was a bit mind-blowing.   Buy the Redmi Note 11 Pro+ Plus 5G:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Are we going to be ok? 0:10 - Specs and unboxing 0:45 - Now that's a power brick 1:07 - Camera specs 1:36 - Exterior impressions 1:59 - Challenge accepted! 2:17 - Ports and buttons 3:15 - Display specs 3:29 - Speaker impressions 4:11 - Sponsor - Grid Studio! 4:46 - Display impressions 5:26 - 120W charging thoughts 6:20 - Linus Battery Tips 6:56 - Fast charging can make sense 7:29 - Charging from dead 7:45 - Camera impressions 8:15 - Pricing thoughts 8:32 - This fricken GOES!",
    "description_links": [
        "https://gridstudio.cc/sc",
        "https://gridstudio.cc/page/giveaway",
        "https://geni.us/DRNr",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- It is fricking going. Nine, 10. Especially when you're almost dead. This thing fricking goes, 11. What caught my eye about the Redmi Note 11 Pro Plus 5G, is not the Dimensity 920 Octa-Core SOC, or the Mali-G68 GPU, the six to eight gigs of RAM, or the 128 to 256 gigs of expandable, although that did catch my eye a little bit, storage. But, this. I mean, it's right there. Right, front and center. 120 Watt Xiaomi HyperCharge. What the actual living (beep) A 120 Watt charging? Look at the size of this power brick. - [David] Whoa! - Apple's all like, we don't need to send a power brick, Xiaomi's like, we're gonna sell you a power brick. And oh, by the way, there might be a phone in the box. Look at this thing. 15 minutes, they claim, to charge the 4,500 milliamp hour battery. - [David] Woo! - It's got a 108 megapixel main shooter, along with an eight megapixel wide, as well as a two megapixel macro camera. That 108 megapixel camera can operate, in a more reasonable 9:1 pixel mode. So that's basically combining nine pixels into one, and using pixel binning to improve the performance, of a, whatever that is, divided by nine. What's a 108 divided by nine? Help me! 90, 99. 12, 12. So it'd be a 12 megapixel shot. It's got a flat Gorilla Glass 5 front, with a Gorilla Glass 5 back. They actually sent over a cup of different colors. We've got their black and their gre-- Oh, wow. That green looks way better in person, than it does on the box. That looks like crap on the box and it looks like the (beep) in person. Jono, one small challenge. We're gonna need a travel adapter. Xiaomi did not send us, a North America version of this charger. Wow. That is, uh, not the best thing I've ever seen. Do we have another one? (laughs) Okay, while Jono's finding that, let's go ahead and boot this puppy up. Got USB-C for charging on the bottom, as well as data transfer. We've got our SIM slot here, which should also include a micro SD slot. I hate how budget phones, are the ones that get more features these days. It's also got a headphone jack. How ridiculous is that? Right? It's even IP 53 splash resistance. So it's not like they went and were like, oh yeah, the expandable storage and headphone jack. We can't have any water resistance. It still has reasonable water resistance, even though it's not rated for submersion. Yeah. Look at that. SIM one. SIM two can also be a micro SD. It's almost like there's a whole like, system for this, that everyone else just ignores. Along the left we've got a whole lot of nothing, which I actually like, 'cause it means you'll never accidentally mash a button, on the left side while you're pressing on the right. I already mentioned the headphone jack. Is that an IR emitter too? Oh, that looks like stereo speakers. Volume rocker as well as lock button. And this is gonna be a huge relief to some of you out there. It's not my personal favorite, but they've got a completely flat front glass. 120 Hertz O-LED. Up to 360 Hertz touch sampling, that's excellent for gaming. Really well positioned speakers for gaming as well. So you could see they, they come right, they rise right above where your fingers would rest, if you were gaming on it. I'm really liking the speaker, so far. A little label on here. Sound by JBL. That partnership might be kind of paying off for them. All right. I've had enough of that. It sounds awesome though. (upbeat music) These speakers sound great. I am really surprised. Wow. All right. Big thanks to Grid Studio for sponsoring this video. Grid Studio's art frames, show off the art hidden inside technology. Using the art of knolling, every part of your favorite phone or console, is carefully extracted, laid out and labeled in clear view. They've got over 30 different frames available, from the Game Boy Color to the iPhone X, and Grid Studio is giving you the chance, to win your very own frame for free. They're giving away frames of the iPhone 4s, the Game Boy Color and both Apple A5X and A7 chips. So, get your Grid Studio frame, or enter to win at the link down below. HDR works immediately. It's rated for 700 nits typical, 1200 nits peak. Looks very HDR-ey. And one of the things I noticed also right out of the gate, is that it doesn't seem to be in a vivid ugly display mode, out of the box. I'm gonna double check that. Oh, it is vivid. Oh, so saturated does it all the time, and vivid does it only sometimes. Interesting. Yeah, it really wasn't that bad or noticeable. Sometimes you fire up a new phone, you're just like, oh wow. And you just have to change it immediately. Yeah. It's really not that bad. It's just a cooler color temperature. Huh. That's still pretty weak. You know what? If we start a fire, at least we've got it on camera. What could go wrong? - [David] What's, uh, three two-letter words, that mean small? - Okay, hit me. - [David] Is it in? - Is it in. Okay. Okay. (David laughing) It could be that this receptacle is just really loose. (David laughing) - [David] No! - Are you guys ready? The time is now 16:03 and it's at 38%. Quick charge. - [David] Whoa. - Charging rapidly. It's at 41% now. - [David] Wow. - [Jono] What. - Hasn't even been a minute yet. It's not warm to the touch yet. If it was me personally, I wouldn't use a super fast charging speed like this. Okay, it's been three minutes, and we've made it from, what did we start at? 38? - [David] Yeah. - To 51. - [David] Wow. - [Jono] Wow. (laughs) - I can't say this would be my preference, but if you're the kind of person, who just cannot manage your battery, I could see this working for you. And another thing to consider, is that part of managing your battery's health, is not charging it too fast. But another big part of managing your battery's health, is not letting it discharge too low or charge too high. So if you were able to stay in like a 20% to 80% range, all the time, by just quickly juicing it for a little bit, and juicing it for a little bit, juicing it for a little bit, you might actually be able to offset any disadvantage, of quick charging like this. Yeah, this could be a great phone, for people who travel a lot, like I've been, I've done it. I've been sitting in an airport going like, oh, I just made it to my gate. There's no power on this flight. I have like 10 minutes. And if I could juice up my phone by 50, 60, 70%, in that 10 minutes, it'd be unbelievable. Frankly, it's not as fast as advertised. Right? They said 15 minutes for a full charge, but something you've gotta keep in mind, is that it'll charge faster at the beginning, so it's probably already tapering off, even. Why don't we take a few camera shots, with our second phone here. Oh, this one's battery is dead. Okay. I'm actually kind of more curious about that. - [David] Yep. Switch them out. - Let's do it. The time is now 16:09. Okay. While we play around with the camera on this one then, let's let this one charge and let's see how far it gets. Immediately I can tell you that the color performance, of this camera is not amazing. I would describe this smoothing anti-shake as not amazing, but definitely functional. It works better as an anti-shake than as smoothing, 'cause when you're moving around, it kind of doesn't really know what to do. But it's pretty on rails as far as anti-shake goes. I mean, that's what happens, when you're not using the highest performance SOC, but that's gonna be reflected in the pricing, and it does have other redeeming features, that's for sure. For a six gig, 128 gig expandable with headphone jack phone, especially with the speaker sounding this good, and like 120 Hertz display, that's damn reasonable. All right, the time is now 16:12. And this is, oh, it's only at 1%. Oh, I wonder if it took a little while, to figure out its shizz. Does it actually have to be powered on to use hyper charge? Okay. It's going-- Whoa. Holy crap. Hold on. Boost. - [David] Oh yeah, baby. Let's go. - Okay. Now it's going. Since we booted up, we went from two to five, like it just-- Seven. It is fricking going. Nine, 10. Especially when you're almost dead. This thing fricking goes. 11. Confirmed. It's really fricking fast. 16. Thanks for wat-- 17. Thanks for watching \"Short Circuit\". 18. Subscribe, so you don't miss more unboxings, and first look videos like this. 19. Bye.",
    "transcript_keywords": [
        "Grid Studio",
        "yeah",
        "wow",
        "phone",
        "charge",
        "Game Boy Color",
        "charging",
        "camera",
        "Studio",
        "megapixel",
        "thing",
        "Grid",
        "power brick",
        "time",
        "minutes",
        "headphone jack",
        "Gorilla Glass",
        "fricking",
        "battery",
        "Color"
    ],
    "transcript_entity_values": [
        "120 Watt",
        "IR",
        "10 minutes",
        "16:09",
        "700",
        "six to eight",
        "Grid Studio's",
        "three minutes",
        "A7",
        "4,500 milliamp hour",
        "Hertz",
        "three",
        "RAM",
        "108 megapixel",
        "one",
        "iPhone",
        "12 megapixel",
        "Grid Studio",
        "17",
        "two to five",
        "99",
        "90",
        "nine",
        "60",
        "second",
        "SOC",
        "108",
        "20% to 80%",
        "Pro Plus 5",
        "11",
        "18",
        "4s",
        "David",
        "Xiaomi",
        "51",
        "Short Circuit",
        "128",
        "Jono",
        "1%",
        "North America",
        "50",
        "256",
        "10",
        "first",
        "9:1",
        "70%",
        "16",
        "two",
        "120",
        "JBL",
        "15 minutes",
        "1200",
        "41%",
        "Seven",
        "a minute",
        "12",
        "19",
        "SD",
        "over 30",
        "38%",
        "jack",
        "six",
        "Nine",
        "eight megapixel",
        "Apple",
        "5",
        "53",
        "12"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.12779371440410614,
        0.01754864677786827,
        -0.01914663054049015,
        -0.03172421455383301,
        0.065329410135746,
        0.025065483525395393,
        0.0252459067851305,
        0.052514344453811646,
        -0.05358200892806053,
        0.0332460030913353,
        0.04477579891681671,
        0.05374589562416077,
        0.0379258431494236,
        -0.0005963963340036571,
        0.02656181901693344,
        -0.06632456183433533,
        0.0321318581700325,
        -0.045385804027318954,
        -0.07485504448413849,
        0.02507764659821987,
        -0.00044827672536484897,
        -0.08155751973390579,
        0.028571726754307747,
        -0.03989236429333687,
        0.07288981229066849,
        -0.057096805423498154,
        -0.005112076178193092,
        0.005428697913885117,
        -0.031729619950056076,
        0.0023671849630773067,
        -0.03367757424712181,
        0.04616889730095863,
        0.015187554061412811,
        -0.09557391703128815,
        0.059692054986953735,
        -0.0026749083772301674,
        -0.0014599703717976809,
        -0.0836198553442955,
        -0.020028630271553993,
        -0.05658629164099693,
        -0.021975969895720482,
        -0.06509894877672195,
        0.03313661739230156,
        0.03529069572687149,
        0.015823494642972946,
        -0.03351946175098419,
        0.013309517875313759,
        -0.007028174586594105,
        -0.014054769650101662,
        0.01913553662598133,
        0.03790992125868797,
        -0.033405743539333344,
        -0.018975352868437767,
        0.0005773422308266163,
        -0.09884955734014511,
        -0.02974715642631054,
        -0.00934075377881527,
        -0.011392118409276009,
        0.09993496537208557,
        -0.05530606955289841,
        -0.0012083649635314941,
        -0.06329623609781265,
        -0.09302427619695663,
        0.051110606640577316,
        -0.0892358347773552,
        0.03499652072787285,
        -0.014294561930000782,
        0.07396933436393738,
        0.00917843822389841,
        0.004876777995377779,
        0.05810784921050072,
        -0.03941726312041283,
        0.04550011828541756,
        -0.006297328509390354,
        0.021946631371974945,
        0.02313738875091076,
        0.0561571903526783,
        -0.02107076719403267,
        -0.07883202284574509,
        0.009346882812678814,
        0.08694571256637573,
        -0.003949100151658058,
        -0.008245982229709625,
        -0.05840018019080162,
        0.10275883972644806,
        -0.028541410341858864,
        0.008686951361596584,
        0.038423459976911545,
        -0.022766269743442535,
        -0.1150042936205864,
        0.025292862206697464,
        0.19167017936706543,
        0.054002467542886734,
        0.051423054188489914,
        -0.03693043813109398,
        0.02173456735908985,
        -0.12145870923995972,
        -0.11668625473976135,
        -0.09788069874048233,
        0.06003151461482048,
        0.053801942616701126,
        0.08361899852752686,
        0.06459615379571915,
        -0.014606532640755177,
        -0.0074109225533902645,
        -0.053909700363874435,
        -0.04467392712831497,
        0.04887065291404724,
        0.008620621636509895,
        -0.008993064984679222,
        0.022029047831892967,
        -0.006852497346699238,
        -0.10455949604511261,
        -0.006440412253141403,
        0.05382173880934715,
        0.043992213904857635,
        -0.04299129918217659,
        0.006102895364165306,
        0.06079144403338432,
        -0.04537788778543472,
        0.013100902549922466,
        -0.027252376079559326,
        -0.059782110154628754,
        -0.07094945013523102,
        -0.033346593379974365,
        0.0025561104994267225,
        -0.08239025622606277,
        -1.754171852632868e-34,
        0.019628236070275307,
        0.04738624393939972,
        -0.03794627636671066,
        -0.020014315843582153,
        0.07285743206739426,
        0.024124465882778168,
        -0.020282989367842674,
        0.05778014287352562,
        0.03271085396409035,
        0.004756866954267025,
        0.007445209193974733,
        0.007965832948684692,
        -0.04388343542814255,
        0.04179029539227486,
        -0.019383544102311134,
        -0.016473084688186646,
        0.007064981386065483,
        0.01600704900920391,
        0.05046619847416878,
        0.00033630465622991323,
        0.004880800843238831,
        -0.13023534417152405,
        -0.012242411263287067,
        -0.0838417112827301,
        0.1026892140507698,
        0.06623750925064087,
        0.053237952291965485,
        -0.022021247074007988,
        0.10069195926189423,
        0.019479094073176384,
        -0.0937461256980896,
        -0.08951158076524734,
        0.02331015095114708,
        -0.008078345097601414,
        -0.0534885935485363,
        0.03188088908791542,
        -0.05786402150988579,
        -0.040683746337890625,
        0.06883499771356583,
        -0.019100893288850784,
        -0.06221582368016243,
        0.052831120789051056,
        -0.05689907446503639,
        -0.01957210898399353,
        0.026693033054471016,
        0.02422473579645157,
        0.022290371358394623,
        -0.06876327097415924,
        -0.036623042076826096,
        0.01278841495513916,
        -0.06583134084939957,
        -0.06219152361154556,
        -0.03757702186703682,
        0.06461156159639359,
        -0.026447856798768044,
        -0.02614942006766796,
        0.01630011759698391,
        0.04362693801522255,
        0.07807640731334686,
        0.04458027333021164,
        0.02652771957218647,
        0.017739808186888695,
        0.0007508156122639775,
        0.03165443241596222,
        -0.08746175467967987,
        0.012493869289755821,
        -0.012869552709162235,
        -0.06800100952386856,
        -0.07685153186321259,
        -0.010017819702625275,
        -0.03463718295097351,
        -0.022385986521840096,
        0.04450573772192001,
        -0.0242701955139637,
        -0.005596068687736988,
        0.0018277709605172276,
        -0.03598880022764206,
        -0.0031638971995562315,
        -0.005995928309857845,
        0.012285290285944939,
        -0.03516163304448128,
        -0.019271420314908028,
        0.0515567921102047,
        0.05196230858564377,
        -0.01763608306646347,
        0.039851002395153046,
        0.01450433861464262,
        -0.0758872851729393,
        -0.04590339958667755,
        0.035559941083192825,
        0.01573728211224079,
        0.025312485173344612,
        0.023222442716360092,
        -0.019434267655014992,
        -0.03493306785821915,
        -2.403358260670654e-33,
        -0.08616986125707626,
        0.05138508602976799,
        -0.09750136733055115,
        -0.06503118574619293,
        -0.02762320078909397,
        -0.028474941849708557,
        0.05712750554084778,
        0.012039624154567719,
        0.004655381198972464,
        -0.013804223388433456,
        -0.04059410095214844,
        0.04636210948228836,
        -0.06382014602422714,
        -0.03733270242810249,
        0.004250624217092991,
        -0.04139142110943794,
        0.011286420747637749,
        -0.027897998690605164,
        0.006538113579154015,
        -0.03393808752298355,
        0.05036945641040802,
        -0.008328772149980068,
        0.06951911747455597,
        0.11218300461769104,
        0.04055130109190941,
        -0.00870379526168108,
        0.015870312228798866,
        -0.041502680629491806,
        -0.004255766049027443,
        0.04146946221590042,
        -0.00016350505757145584,
        -0.07463031262159348,
        -0.045067887753248215,
        -0.006602883338928223,
        0.07098133116960526,
        -0.008823314681649208,
        0.0529535636305809,
        0.01320663932710886,
        0.011875633150339127,
        -0.005732000805437565,
        0.11049290746450424,
        -0.02080610953271389,
        0.020069358870387077,
        -0.034550901502370834,
        -0.03892100974917412,
        -0.08818293362855911,
        -0.0012552295811474323,
        0.025238964706659317,
        -0.0649067685008049,
        0.012783356010913849,
        -0.017604783177375793,
        -0.03607090190052986,
        -0.018680106848478317,
        0.012322762049734592,
        -0.04691131412982941,
        -0.05443602055311203,
        0.108344167470932,
        0.04614147171378136,
        -0.08475404232740402,
        -0.04297138750553131,
        0.027027204632759094,
        0.009865814819931984,
        -0.027429213747382164,
        -0.008260790258646011,
        0.032786041498184204,
        0.02767864242196083,
        0.11843522638082504,
        0.004576422274112701,
        0.003973382990807295,
        0.11761601269245148,
        0.0015142163028940558,
        -0.010022589936852455,
        -0.03383940830826759,
        -0.04133107140660286,
        -0.04346064478158951,
        0.016187071800231934,
        0.024810176342725754,
        -0.006167171522974968,
        0.005592165514826775,
        -0.09030932933092117,
        0.0421578548848629,
        0.040094245225191116,
        0.059933535754680634,
        -0.06248005852103233,
        0.029371555894613266,
        -0.10735107958316803,
        0.031894974410533905,
        -0.029471322894096375,
        0.029258014634251595,
        0.040503665804862976,
        -0.03742223605513573,
        -0.009848946705460548,
        -0.04117213562130928,
        0.08727627992630005,
        0.00311396480537951,
        -5.551254389501992e-08,
        -0.020944535732269287,
        0.026280352845788002,
        -0.014627913013100624,
        -0.011483561247587204,
        -0.06613696366548538,
        -0.07983656227588654,
        -0.0026499691884964705,
        -0.1003914400935173,
        0.09615012258291245,
        0.027942286804318428,
        0.04049457237124443,
        -0.1172710657119751,
        -0.002210032194852829,
        0.018431885167956352,
        -0.051769472658634186,
        0.05334702879190445,
        0.019958628341555595,
        0.0717291533946991,
        -0.044275619089603424,
        0.030324794352054596,
        0.011291105300188065,
        0.10428424179553986,
        -0.025601865723729134,
        -0.017608189955353737,
        0.07179297506809235,
        -0.007131235208362341,
        0.01784530095756054,
        0.01598040573298931,
        0.09999416023492813,
        -0.08182356506586075,
        -0.05423665791749954,
        0.0012023457093164325,
        -0.035712312906980515,
        0.04816560819745064,
        -0.01775406114757061,
        -0.0031255241483449936,
        0.03054291196167469,
        0.01232896652072668,
        -0.019100695848464966,
        0.08075057715177536,
        -0.07929524034261703,
        -0.037456072866916656,
        -0.01526737306267023,
        -0.006904443260282278,
        -0.011890295892953873,
        -0.06791306287050247,
        -0.025807740166783333,
        -0.14481723308563232,
        0.07564584910869598,
        0.11001869291067123,
        -0.07056726515293121,
        0.022812940180301666,
        0.019083911553025246,
        -0.027248075231909752,
        -0.0334889180958271,
        0.022454023361206055,
        -0.02239261008799076,
        0.07065894454717636,
        0.013567591086030006,
        0.09083901345729828,
        -0.0023376636672765017,
        -0.09561868011951447,
        0.00977624487131834,
        0.11350088566541672
    ]
}