{
    "id": "leCHry5R6xc",
    "title": "AirPods 3 review: new shape, new fit",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-10-27T13:30:10Z",
    "video_url": "https://www.youtube.com/watch?v=leCHry5R6xc",
    "category": "Science & Technology",
    "tags": [
        "airpods 3",
        "apple airpods 3",
        "airpods 3 vs airpods pro",
        "airpods 3 review",
        "airpods pro 2",
        "airpods pro",
        "airpods",
        "apple airpods",
        "apple",
        "apple event",
        "apple keynote",
        "iphone 13",
        "iphone 13 pro max",
        "wireless buds",
        "earbuds",
        "wireless earbuds",
        "Apple’s third-generation AirPods",
        "best earbuds",
        "best earbuds 2021",
        "best wireless earbuds",
        "mic test",
        "sound test",
        "microphone",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 339588,
    "likes": 9197,
    "comments_count": 515,
    "description": "Apples third-generation AirPods have a new design with shorter stems, and they now look similar to the AirPods Pro. Sound quality has improved with new support for spatial audio head tracking. Battery life is also better, and theyre rated IPX4 for water and sweat resistance. If your AirPods are getting old and its time for an upgrade, the AirPods 3 dont disappoint.   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get Apples third-generation AirPods here:   Read more:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3Gs3chk",
        "https://bit.ly/30ZvpM9",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- These are Apple's 3rd generation AirPods. And for the first time since the original pair of back in 2016, they've got a completely new design. They sound better, are now water and sweat resistant, and have better battery life. Apple's also added some new tricks like spacial audio head tracking. And if you lose your AirPods, they're now easier to find than ever before. What hasn't changed about the AirPods is their seamless integration with Apple's ecosystem of devices. That's what has always set the AirPods apart and help Apple sell an ungodly number of these things. But we're near the end of 2021, and the game has changed a lot since the last AirPods came around. You can get a great set of earbuds for much less than the $179 that Apple ones for these. (upbeat music) Take a quick look at the new AirPods hardware and, well, they look like the AirPods Pro if you chopped off the ear tips. Their stems are now 33% shorter, and on each earbud is the same force sensors on the pros. You can squeeze once to play or pause, twice to skip to the next song, or three times to go back. These controls are the same on either earbud. You can press and hold the sensor too to bring up Siri, or use, \"hey, Siri\" for hands-free voice commands. The charging case now opens in a landscape orientation. Again, like the pros, but it's smaller than the pro case and comes in pretty close to the old one. Just a bit thicker. It's still totally pocketable and has wireless charging. And while the 2nd gen AirPods supported wireless charging, the newer AirPods are specifically designed to work with Apple's MagSafe charging system. Magnets on the case guarantee a perfect alignment on the circular charging pad. But don't expect reverse wireless charging on your fancy new iPhone 13. That's still not an option. And as I have to drive that point home, the AirPods case won't stick to the back of maxi iPhones. Now, while the design is new, the 3rd gen AirPods are still very much one size fits most hard plastic. They rest inside your ears instead of going deep into your ear canal. Apple says it did a ton of research, thousands of years scans, heat maps even, to improve their fit and comfort. And at least in my case, it really has made a noticeable difference. I've got friends and colleagues who love the barely-there-fit of the previous AirPods, but my ears were never a great match for them. They just came loose way too easily. These new buds are still super lightweight and comfortable, but something about the contours feels more secure. And I don't have that same constant anxiety about them just falling out and down a sewer grade or something. I do still prefer regular earbuds with tips over this open style that lets in so much outside noise, but I can finally say now that AirPods fit my ears. If you've had trouble with the older design, it's worth trying this new one, for sure. As for how they sound, Apple says the new AirPods have custom drivers and amplifiers, and they also have the same adaptive EQ feature as the AirPods Pro and AirPods Max. Each earbud has an inward facing mic that analyzes what you're hearing and tunes in real time, so Apple claims, the low and mid frequencies based on the shape of your specific ears for the best sound. The thing though, it's hard to know what different steps if EQ is actually making. How are you supposed to tell what it's doing? I'd say if there's one area it does seem to be helping, its base. The 3rd gen AirPods sound fuller and have more body than the original, and 2nd gen models did. It's about the best you can expect from these open style earbuds. But it still won't match the deeper low-end of buds that fully seal into your ears. The AirPods are clearly tuned to sound pleasing across a wide span of content. Music, podcasts, movies, TV, and games, and they continue to excel at that. Now, I'm not talking about some big upgrade in sound quality here. These still sound like AirPods, but maybe with a little extra something that wasn't quite there before. But that brings us to one of the big features that Apple is pushing with these new AirPods, and that spatial audio. (relaxing music) Spatial audio is supposed to provide a more immersive experience than stereo by placing sounds anywhere and everywhere in space. It's all meant to sound more multi-dimensional, or at least that's what they say. There are already thousands of songs on Apple music that have these Dolby Atmos spatial audio mixes, and you can find the same kind of thing on Tidal and Amazon Music, but Apple is pushing this new way of hearing your favorite songs, hard. And this isn't just for music. Some of the biggest video apps like Netflix, HBO Max, Amazon Prime Video, and others, also support spatial audio listening. But what makes Apple's approach special is head tracking. Like the AirPods Pro and Max, now the 3rd gen AirPods can adjust the audio in each earbud as you turn your head from side to side. Keeping the soundstage fixed in place in front of you. Watching movies is where this effect is most impressive. On my big iPad Pro or at home on my Apple TV, it makes for a really cool surround sound experience that pulls you in more than any stereo mix ever would, but music is where things get a lot more inconsistent. Frankly, I could live without spatial audio on Apple music or anywhere else for that matter right now. See, regardless of whether you've got head tracking on or off, many of these Dolby Atmos music tracks sound objectively worse than their stereo counterparts. Instruments and effects sound out of place. Vocals can get drowned out in the mix, and so on. Point being, it takes a lot of effort from artists and producers to make this format really shine. And so far, it's very obvious that most of these mixes are not getting that level of work. It's easy to switch back and forth between Atmos and regular stereos in control center on iOS, which is great. And sometimes it is fun to hear how your favorite songs come through in spatial audio, but on the whole, this concept just is not a reason to buy these AirPods. Spatial audio can definitely value in watching movies, but it's very, very meh for music. These new AirPods have longer battery life. Up to six hours of straight listening from the previous five. And a total of 30 hours when you include the charging case. Both the earbuds and case are now rated IPX4 for water resistance, so, they're much better suited for use at the gym or on a run. AirPods have always been the best earbuds for voice calls, so, we had to put these through a thorough mic test. Apple says it's using a new codec for a better voice quality on FaceTime and the outer mesh on each earbud should do a better job, reducing wind noise. So, then let's hear how these things sound. What do you think so far, Becca? - What up, Chris. Today, we are putting head to head a bunch of open earbuds. Look at all... Look look at all these. Eh, huh. The first stop is the classic OG 1st gen AirPods. Next up we have the OnePlus buds, which are incredibly colorful. They came out in July, 2020. Also open ear and they'd run for around 60 bucks now. And of course the headphone of the hour, these are the 3rd gen AirPods. Their stem is a bit shorter this year, so, I don't know how this mic quality is gonna be. And now, we have the open ear offerings from Samsung. These are the Galaxy Buds Live also known as the Beans. Okay, now I want to throw in a wired pair of apple headphones just because this mic always sounds so damn good. And before we had wireless, well, we had these. Let's go to medium. Ooh boy. All right, we're back. I liked the fan test the best, because most of the time people can't hear me because there's a lot of wind happening on the earbuds. I always did love the color options of the OnePlus buds. I mean, there's very few buds you can get in this color. Ah, man, sometimes I get really worried about doing the wind test because I know that it drives my hair into a particular direction and I don't always love, but anything for you buds. Well, what I love about the beans is that their design is like super unique and it fits so well in my ears, even with this like annoying piercing that kind of gets in the way of so many other buds. Man, I remember using these headphones and just like running the cable at my shirt always to try to hide it or keep it out of the way, whoo, I'm so happy I don't have to do that anymore. Wow! Competition is getting stiff in the mic department. It is good to know that the 3rd gen sound just as good as the 1st gen AirPods, and nothing, nothing can beat the wired headphones still. I mean, the mic is like right here, so of course not. But anyway, back to you, Welch. (upbeat music) - Rounding out the 3rd gen AirPods are some new software tricks. They've now got full integration with Apple's Find My app. And there's a new air taps like interface for hunting them down if there's somewhere or close by, but it's not quite as precise. What's more helpful, at least I think is that you can now be notified if you leave your AirPods behind somewhere, which is awesome. And if there are still truly nowhere to be found, you can turn on lost mode and be alerted if they come and range of millions of other iOS devices. One last kind of neat thing I want to mention has to do with your skin. See, earbuds have always paused automatically if you take one out of your ears, but these new ones have a more advanced skin detection sensor that Apple claims can tell the difference between your ears and something like your pants pocket. So, if you shove them in there without the case on, they won't play music anymore, whereas they might have before. With their all new design, sweat resistance, longer battery life, and new software features, Apple's 3rd gen AirPods are easy to recommend over the previous pair. Personally, I'd lean towards the AirPods Pro for their active noise cancellation and ear tips, but if you love that original AirPod design, that open style, and you're ready for an upgrade, here it is. And the main reason for buying them is still that unmatched simplicity and convenience for people who live inside Apple's ecosystem. The one step set up, automatic device switching, audio sharing, and so on. But having said all of that before you get locked further into Apple's world, it's worth giving other earbuds a serious look. There are so many more options now than there were even a few years ago when the 2nd gen AirPods came out. I'm talking about earbuds from Samsung, and Jabra, and Sennheiser, and Amazon, and Sony, and Nothing, and Anker, and any number of companies. In some cases, they definitely sound better or have features that the AirPods don't. The question is if you want the easy thing. Just like every other pair of AirPods, these are meant to be the perfect companion to your iPhone. And perhaps more than any other apple product nowadays, AirPods still just work. (wind whooshing) - [Woman] I was walking up the middle of the street. (indistinct) (chuckles) You own this city.",
    "transcript_keywords": [
        "AirPods",
        "Apple",
        "gen AirPods",
        "AirPods Pro",
        "sound",
        "gen",
        "earbuds",
        "spatial audio",
        "audio",
        "Apple music",
        "ears",
        "Music",
        "Pro",
        "gen AirPods sound",
        "case",
        "buds",
        "charging",
        "spatial",
        "ear",
        "earbud"
    ],
    "transcript_entity_values": [
        "Today",
        "Chris",
        "Tidal",
        "HBO Max",
        "the Galaxy Buds Live",
        "Atmos",
        "one",
        "Apple",
        "Amazon Prime Video",
        "three",
        "the AirPods Pro",
        "millions",
        "Sennheiser",
        "the AirPods Pro and",
        "the AirPods Pro",
        "FaceTime",
        "2020",
        "a few years ago",
        "iPhones",
        "Becca",
        "iPhone 13",
        "2016",
        "Up to six hours",
        "AirPod",
        "33%",
        "Samsung",
        "the AirPods Pro and AirPods Max",
        "thousands",
        "Apple TV",
        "the hour",
        "Siri",
        "iPad Pro",
        "Amazon",
        "around 60 bucks",
        "One",
        "Jabra",
        "AirPods",
        "this year",
        "3rd",
        "July",
        "2nd",
        "thousands of years",
        "Sony",
        "the end of 2021",
        "Dolby Atmos",
        "five",
        "30 hours",
        "Netflix",
        "EQ",
        "Anker",
        "first",
        "Max",
        "iPhone",
        "179",
        "Amazon Music",
        "1st",
        "Welch",
        "a ton",
        "OnePlus"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "DATE",
        "TIME",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "PERSON",
        "QUANTITY",
        "PRODUCT"
    ],
    "vector": [
        -0.05558743700385094,
        -0.06559855490922928,
        0.019732169806957245,
        0.012869182974100113,
        0.08162683248519897,
        -0.0580863393843174,
        -0.009686548262834549,
        -0.01969749666750431,
        -0.02077319659292698,
        0.003028628882020712,
        0.032700762152671814,
        -0.029282350093126297,
        -0.04725266993045807,
        0.013494620099663734,
        0.08024138957262039,
        0.009342899546027184,
        0.07739506661891937,
        -0.04896308109164238,
        -0.025987233966588974,
        0.022768216207623482,
        -0.0398133285343647,
        -0.021972745656967163,
        0.09548544138669968,
        0.049332134425640106,
        -0.004165119957178831,
        0.026711590588092804,
        -0.0035407631658017635,
        -0.0668797716498375,
        -0.0643547773361206,
        -0.02795223705470562,
        -0.00910769123584032,
        0.10058426856994629,
        0.07850723713636398,
        -0.07347775995731354,
        0.036741070449352264,
        -0.09024057537317276,
        0.10920296609401703,
        -0.0029321564361453056,
        -0.02836947701871395,
        -0.02776213362812996,
        -0.03953352943062782,
        -0.00828523188829422,
        0.018225738778710365,
        0.056260932236909866,
        0.00035713647957891226,
        0.0024175099097192287,
        -0.05138532444834709,
        -0.07910693436861038,
        0.04423689842224121,
        0.08349094539880753,
        -0.04348013177514076,
        -0.14168496429920197,
        0.1324838101863861,
        -0.02903766557574272,
        -0.03286579251289368,
        0.0017288181697949767,
        -0.04149361327290535,
        0.026541369035840034,
        -0.007726010400801897,
        -0.01789182797074318,
        0.09925859421491623,
        -0.09279226511716843,
        0.012991582974791527,
        -0.035161178559064865,
        0.026672882959246635,
        -0.015748560428619385,
        -0.02184986136853695,
        -0.008087177760899067,
        0.03195410594344139,
        0.03351850435137749,
        -0.07538246363401413,
        0.038255248218774796,
        -0.011170596815645695,
        -0.035175878554582596,
        0.014817344024777412,
        0.0783592090010643,
        0.07779249548912048,
        -0.02806386537849903,
        -0.04830750450491905,
        0.03610331192612648,
        0.0033603941556066275,
        -0.00583246536552906,
        0.03881646692752838,
        0.00826326385140419,
        -0.009775997139513493,
        -0.029744120314717293,
        -0.020994365215301514,
        -0.08662484586238861,
        -0.17473338544368744,
        0.0029210515785962343,
        -0.05992799997329712,
        0.06433254480361938,
        0.0020375768654048443,
        -0.04195008799433708,
        0.05625947192311287,
        0.01901392452418804,
        -0.05595409497618675,
        -0.024378357455134392,
        0.022379688918590546,
        0.015933014452457428,
        0.06512521207332611,
        0.04271679371595383,
        0.05132228881120682,
        0.005227706395089626,
        0.061086248606443405,
        -0.08101289719343185,
        -0.09917911887168884,
        -0.04101676866412163,
        0.05228932574391365,
        0.11267697066068649,
        0.00977196916937828,
        -0.0904170423746109,
        -0.020181739702820778,
        0.027710992842912674,
        -0.03601905703544617,
        0.08147827535867691,
        -0.07613324373960495,
        0.04098736494779587,
        0.09950746595859528,
        -0.00965129490941763,
        0.006631278898566961,
        0.05488666892051697,
        0.021785292774438858,
        -0.03771762177348137,
        -0.045484788715839386,
        -0.0312074963003397,
        -0.11696802824735641,
        3.2554026675657194e-33,
        -0.028760384768247604,
        0.030042171478271484,
        -0.026023412123322487,
        -0.012977796606719494,
        0.006690143141895533,
        -0.06071292608976364,
        -0.014560461975634098,
        -0.02911568433046341,
        -0.04116223007440567,
        0.00937250629067421,
        -0.14531269669532776,
        0.008684176951646805,
        -0.001825201092287898,
        -0.0059926994144916534,
        0.03502670302987099,
        -0.11401418596506119,
        -0.14288438856601715,
        0.04666567221283913,
        -0.10845262557268143,
        0.050512220710515976,
        0.058233603835105896,
        -0.022406160831451416,
        -0.018065575510263443,
        0.0630049929022789,
        0.06213006749749184,
        -0.04861483722925186,
        0.045617666095495224,
        -0.03293383866548538,
        -0.007741640787571669,
        -0.00554842222481966,
        -0.024731038138270378,
        0.046622373163700104,
        0.03125014901161194,
        -0.056674327701330185,
        -0.013908183202147484,
        0.015052158385515213,
        0.009133716113865376,
        -0.03419137001037598,
        -0.016883686184883118,
        -0.03491736948490143,
        -0.029724102467298508,
        0.024324672296643257,
        0.030833495780825615,
        -0.04744343459606171,
        0.04148491472005844,
        0.05777882784605026,
        0.00872438307851553,
        -0.005971717648208141,
        0.07368378341197968,
        -0.0683262050151825,
        -0.020566396415233612,
        0.011014189571142197,
        -0.053493525832891464,
        0.021601656451821327,
        0.029503274708986282,
        -0.08550404757261276,
        -0.018479779362678528,
        0.05045760050415993,
        0.0038721601013094187,
        -0.04555089399218559,
        -0.025527657940983772,
        0.020230866968631744,
        -0.06186899170279503,
        -0.037042245268821716,
        -0.1137775108218193,
        0.09126392751932144,
        -0.0028078611940145493,
        0.050285838544368744,
        -0.031205208972096443,
        0.0839475765824318,
        0.04936106130480766,
        0.05735884606838226,
        -0.029236815869808197,
        0.0029502420220524073,
        0.012227530591189861,
        -0.03310839459300041,
        -0.04335155710577965,
        -0.009565310552716255,
        -0.017395775765180588,
        -0.008518471382558346,
        0.008309883996844292,
        0.08655598759651184,
        0.006630905903875828,
        0.010224306024610996,
        -0.022560078650712967,
        -0.06354394555091858,
        0.04609040170907974,
        -0.031682249158620834,
        0.02010757103562355,
        0.03059675730764866,
        0.02172546647489071,
        0.04536070674657822,
        -0.02535894885659218,
        0.021985402330756187,
        -0.05967669188976288,
        -4.523219977359605e-33,
        0.05651553347706795,
        0.012668835930526257,
        0.006112815346568823,
        0.024943668395280838,
        -0.024735618382692337,
        0.07310574501752853,
        0.022190526127815247,
        0.05632597580552101,
        0.04681607335805893,
        -0.05275490880012512,
        0.015348994173109531,
        0.040112655609846115,
        -0.03150823339819908,
        0.008720647543668747,
        0.03314489126205444,
        -0.05570550262928009,
        -0.044823870062828064,
        -0.12556584179401398,
        0.04762741178274155,
        -0.025867097079753876,
        0.07895603775978088,
        0.016363929957151413,
        0.009441057220101357,
        0.008534880355000496,
        -0.08684816211462021,
        0.0013883158098906279,
        0.05829035863280296,
        -0.013083066791296005,
        0.018517429009079933,
        -0.019985303282737732,
        -0.07718274742364883,
        0.03041989915072918,
        -0.04716622456908226,
        0.07600640505552292,
        0.07821908593177795,
        -0.010939482599496841,
        -0.05885215476155281,
        -0.00047698471462354064,
        0.004831929225474596,
        -0.03306812793016434,
        -0.046268660575151443,
        0.04001099616289139,
        0.05765834078192711,
        -0.05509963631629944,
        0.0011718525784090161,
        -0.017141688615083694,
        -0.05786116421222687,
        0.05781374126672745,
        -0.045249976217746735,
        -0.05707986280322075,
        0.017266444861888885,
        -0.00916148629039526,
        -0.03128309175372124,
        0.00393363181501627,
        -0.05448736622929573,
        -0.047206804156303406,
        -0.036153148859739304,
        -0.003002073150128126,
        0.006311153993010521,
        0.03318355232477188,
        -0.01063453033566475,
        -0.0314006581902504,
        0.07276357710361481,
        -0.014609981328248978,
        -0.07870276272296906,
        0.06523559242486954,
        -0.011206315830349922,
        0.06921462714672089,
        0.017885178327560425,
        0.06552132219076157,
        0.005910796113312244,
        -0.001120042405091226,
        0.00874202512204647,
        0.01724988780915737,
        0.05911082401871681,
        -0.06284582614898682,
        -0.018423156812787056,
        0.03558145463466644,
        -0.019324446097016335,
        0.01753925532102585,
        -0.027524171397089958,
        0.0952390804886818,
        0.03610451519489288,
        0.08483757078647614,
        0.08233605325222015,
        0.0480324812233448,
        0.006821817718446255,
        0.01641552709043026,
        -0.06539591401815414,
        0.10631190240383148,
        -0.02235494740307331,
        -0.015960952267050743,
        -0.08063735067844391,
        0.1087808758020401,
        0.015061900019645691,
        -4.7888502052728654e-08,
        0.04526186361908913,
        0.025097768753767014,
        0.06456439942121506,
        0.0238756462931633,
        -0.04077095165848732,
        0.0032507972791790962,
        -0.025359734892845154,
        0.08761637657880783,
        0.034674350172281265,
        -0.0003855459508486092,
        0.03819723054766655,
        -0.06423139572143555,
        -0.05691112205386162,
        0.03742048516869545,
        0.048622772097587585,
        0.02639525569975376,
        -0.05542082339525223,
        0.032633014023303986,
        -0.012405832298099995,
        -0.08928690105676651,
        -0.10379230231046677,
        0.05149057134985924,
        0.0640442967414856,
        0.008183429948985577,
        -0.04176545515656471,
        0.07557020336389542,
        -0.0271748173981905,
        -0.0225971806794405,
        0.02238190919160843,
        -0.010919470340013504,
        -0.08470044285058975,
        0.02763376012444496,
        -0.01999524235725403,
        -0.03561403974890709,
        -0.05738095939159393,
        -0.055008888244628906,
        -0.045843206346035004,
        0.011914907954633236,
        -0.04218762740492821,
        0.051800623536109924,
        -0.025997662916779518,
        -0.0655461922287941,
        -0.03393316641449928,
        0.008876318112015724,
        0.023830711841583252,
        -0.11396681517362595,
        0.061122242361307144,
        -0.03979044035077095,
        -0.03541494905948639,
        0.05046587437391281,
        -0.005825744476169348,
        0.001378920511342585,
        0.04760553687810898,
        0.10631941258907318,
        -0.006401888560503721,
        0.062318943440914154,
        -0.07409296184778214,
        -0.024971259757876396,
        -0.057429470121860504,
        0.07582386583089828,
        0.04718298465013504,
        -0.047753337770700455,
        0.05340859666466713,
        0.11118408292531967
    ]
}