{
    "id": "LGu-sUyp-58",
    "title": "It's GREAT. But it's not perfect... - Blade Stealth 2020 Laptop",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-02T22:00:59Z",
    "video_url": "https://www.youtube.com/watch?v=LGu-sUyp-58",
    "category": "Science & Technology",
    "tags": [
        "Razer",
        "Gaming",
        "Stealth",
        "Laptop",
        "Intel",
        "AMD",
        "ASUS",
        "PC",
        "Notebook",
        "G14",
        "Performance",
        "Heat",
        "1080p",
        "NVIDIA",
        "1650 Ti",
        "RTX"
    ],
    "views": 657403,
    "likes": 23224,
    "comments_count": 1688,
    "description": "Sign up for Private Internet Access VPN at    It seems like AMD is winning on both fronts so far with their desktop and laptop CPUs. Razer hasn't entirely made the switch yet on their latest rigs.  Buy Razer Blade Stealth 2020 Laptop On Amazon (Paid Link):    On BHPhoto (Paid Link):   On NewEgg (Paid Link):   Buy ASUS Zephyrus G14 Laptop On Amazon (Paid Link):   On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://geni.us/ojfj5k",
        "https://geni.us/BZaWDw",
        "https://geni.us/g0vP",
        "https://geni.us/8pA5",
        "https://geni.us/r3KX",
        "https://geni.us/XHoY",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- The Razer Blade Stealth 2019 was just, it was so close to being great. Instead of being the gaming Ultrabook was kind of just a bad Ultrabook that was also pretty bad at being a gaming laptop. That said though, the Razer Blade Stealth 2020 should improve in every single way compared to what we thought of last time. Let's get right into it here. Opening it up. Razer always absolutely nails the packaging of their devices. It just has this premium look about it. Just the texture of this is so great. Looking at the power adapter here. What kind of power can we expect? 100 watts. Actually, that's quite a bit for a laptop of this size. You've got to remember, it's a 13-inch Ultrabook. We've also got the power adapter here. Power cord I guess. And now onto the actual fun stuff. That's a fine-looking machine. I have to say for a Razer machine, it's even just a bit classy. Actually, before we look at that too much, what else has Razer included in here? Thank you for choosing a Razer system. That's actually surprisingly not cult-y for Razer. Is there anything else in here? Microfiber cloth, awesome. Stickers. Oh, here we go. Congratulations, there is no turning back. Everyone knows that it's not just brute force that wins battles, it also requires strategy and agility and joining a cult. That's more like what we expect. The overall look of this thing is pretty good. It's kind of just like a black rectangle but in a really good way. It's like rather classy for Razer surprisingly enough. There are these little green accents on the USB ports here. Aside from that, nothing really gives away that this is anything any other than an Ultrabook. For I/O, we have, on this side right here, there's Thunderbolt 3 and a full-sized USB Type-A. Then on this side, we have another USB Type-A, headphones and this is USB Type-C but it supports charging, which is freaking awesome because then you can take your charger here, we can plug it in over on this side or swap it over to here so you don't have to worry about the power cord has to go over here so it goes around. But oh no, it's an infomercial and I just can't figure it out. It's actually pretty hard to do sometimes. Let's open it up. And here's the first complaint. All of down here, just this kind of wasted space. In fairness to Razer, I don't know if they're like 16-by-10 or three-by-two displays that are 120 hertz. That is what we have here. It's probably gonna be pretty awesome for gaming but for productivity, the XPS 13 or the Surface Laptop 3, you're going to have that extra vertical real estate on your screen to just see a bit more on like your Word document or your web page or what have you. I guess it's the kind of trade-off you have when it's a gaming-focused system. Now, what they have changed that's fabulous here is the right Shift key. It's like a proper Shift key now. It's just awesome. So in the last one, they had full-sized arrow keys here and the top one took up half of the Shift key, which was absolutely infuriating because you have the double doozy of not only do you miss the Shift key when you go to hit it but you hit the up arrow at the same time, so you highlight the whole row that you're typing on and then just immediately write over it. Linus used last year's model as Daily Driver for probably a month or so and he just made that mistake so many times that everybody got really mad at him and made him change and he's been on the XPS 13 2-in-1 ever since. So I guess there's nothing else to do, except for power it on, just like you're going to power on your privacy with Private Internet Access. With PIA, you can access services and websites as though you're in a different country. It encrypts all of your internet traffic and uses a safe, protected IP. Connect up to five devices at once with clients for Windows, macOS, Android, iOS and Linux. Try PIA risk free with a 30-day money-back guarantee at the link below. Now we actually get to turn it on. Okay, I did it. Let's see if there's anything interesting in here. I'm not expecting like super duper overclocking in the BIOS but when you see it, you just wanna take a look. So hyper-threading enabled, virtualization, yeah, we want all of that. Power and performance. Speedstep and turbo mode are on. On occasion, there might be like two power profiles in the BIOS and you might just get lucky and be able to choose like the make my chip in inferno option. No such luck here. Oh well. It's nice to see like a BIOS anyway. A lot of laptops just can't even do anything. Let's prepare for some gaming here 'cause we know that's the first thing that we're gonna wanna do. Actually, let's just use the keyboard for a little bit first. How is this keyboard? I think that... Yeah, as expected, this keyboard is awesome. So it has this like snappy feel. I guess it's one way to describe it. I have to say I really like. I think I can get up to full speed on this after just like a minute or two. I have to say it's pretty awesome. As for the track pad here, yeah, unsurprisingly, its thing is awesome. Razer has been absolutely nailing their track pads. This is maybe among the best track pads that you can get on a Windows machine. Dell's really been stepping up their game lately so they might take the cake but at the same time, they're both A pluses. You're not gonna complain about this track pad experience. This might have to take the win simply because of the display. 1080p, 120 hertz is so awesome. It just feels great and is oddly surprising on a machine of this size. It's just something you don't expect and then it's like oh, like, I just move the mouse around and it's just snapping immediately to where I want it to go. It adds an immediacy to even just things like dragging around this folder screen right here. It's awesome. High refresh rate, 10 out of 10. Now, am I willing to give up 16 by 10 for the 120 hertz? I'm not entirely sure. I guess it really depends on how well it games and looking at the specs, it should be pretty frickin' good, so for the processor, we have the Intel i7-1065G7. For the GPU, this is what really makes the Razer Blade Stealth 2020 stand out compared to the 2019, we now get an NVIDIA GTX 1650 Ti. The last one had an MX150, which is, it's not a good GPU. There's really no way around it. That's the sort of GPU that you put in like a Dell Inspiron for when you want to like have your Excel sheet open up faster or something. It's not what you want for when you're actually going to be gaming. So I guess let's just get right to it. Let's game a bit. DOOM Eternal. So what we're gonna try and do is really test this thing and push it to its limits. I'm hoping for high, maybe medium 1080p. We're gonna try and record the footage at the same time kind of just to make the editor's life easier but also it's a pretty good test for basically a worst-case scenario. (booming) So we're going for high 1080p. Hoping for playable. And what, 70 FPS, thereabouts? It feels pretty jello-y though. One second. Maybe medium. All right, so on medium, this is like a pretty good experience. I definitely feel that my aim is worse than I would normally expect for it to be. While playing DOOM, I'm pretty sure that's because the FPS is just lower than normal. So maybe we should just knock it down to low here. Low. So we're right around 100 FPS. (booming) So compared to something like an XPS 13, this is just a completely different sort of experience. So I am actually, well, I'm straight up just able to game. And also, it's like a pretty enjoyable experience now because like high refresh rate display, I kind of feel like is just necessary for a good gaming experience these days. Now, this does have one really big issue though is that's that for this machine as it's specked, it is $1,800, which honestly, compared to like an Intel machine is really not that bad but we don't have to compare it to an Intel machine. So you guys are probably very familiar with the ASUS Zephyrus G14. It is probably going to be the laptop of 2020 and that's basically just because ASUS went with an AMD Ryzen CPU. So we could face these two laptops off in a game but honestly, that would just be embarrassing for Razer. So this guy right here has an eight core CPU compared to the four core that's found in the Razer. It also clocks higher and beats the eight core versions of the Intel processor in here. It also have an RTX 2060, which is going to stop the 1650 in here. It also, in our testing, got 10 hours of battery life. I'm expecting with, I think this is a 53.1-watt-hour battery. You're probably getting eight, nine if you're really gentle on it. Also, all of that, the Zephyrus G14 is $1,450. So it's cheaper, it's better graphics, has a better CPU, like literally twice as fast, probably more than twice as fast in multi-threaded applications. Why would you buy the Razer? The first reason for one, this is all plastic. And the Razer is aluminum. It just generally feels better. You also get the Thunderbolt 3 port. That's pretty awesome. And the track pad. One other thing that the Razer Blade also really has going for it is Windows Hello Facial Recognition. So you're able to just open it up and boom, you're in. Now, the Zephyrus does have the fingerprint reader here, which actually is pretty awesome because this fingerprint reader caches your fingerprint after you touch it, so then when you get to the Windows login screen, it should just do it. This is kinda tough if I'm honest. Actually I lied, I don't think that this is too tough. I'd get the ASUS. Realistically, this is probably going to be a huge problem for every laptop manufacturer for the next year or so. I don't think anyone, including ASUS, given that like that this laptop has been out of stock basically since it launched. I'm pretty sure no one expected for the AMD CPUs to be as good as they are. I don't know, I'm kinda sorry Razer, honestly. Like you've done everything right. You fixed the keyboard, you have maybe the best track pad, 120 hertz display is frickin' awesome on a 13-inch thing. Compared to who I thought you would be competing against, so the XPS 13, the Surface Laptop 3. This is awesome. This is like the gaming Ultrabook but at the same time, you can get so much more performance out of this guys. If like a really nice aluminum chassis and facial recognition are what you want, Razer Blade Stealth 2020, pretty frickin' awesome. If you have a desktop that already has all of the muscle that this guy right here provides, the Razer Blade Stealth is a nicer-feeling machine. I'm grasping at straws here. But it is pretty good. Anyway, I hope you guys liked this video. Hit like, get subscribed and I don't know, have a great day. Sorry Intel, sorry Razer. No one saw this coming.",
    "transcript_keywords": [
        "Razer Blade Stealth",
        "Razer",
        "Razer Blade",
        "pretty",
        "Blade Stealth",
        "awesome",
        "pretty awesome",
        "power",
        "kind",
        "pretty good",
        "good",
        "Blade",
        "Ultrabook",
        "laptop",
        "Shift key",
        "machine",
        "Stealth",
        "Intel",
        "gaming",
        "guess"
    ],
    "transcript_entity_values": [
        "Ultrabook",
        "3",
        "half",
        "Excel",
        "FPS",
        "53.1-watt-hour",
        "USB Type-A.",
        "the Zephyrus G14",
        "Intel",
        "Razer",
        "last year's",
        "Private Internet Access",
        "One",
        "XPS 13",
        "MX150",
        "30-day",
        "one",
        "USB",
        "16-by-10",
        "NVIDIA",
        "70",
        "AMD Ryzen CPU",
        "2019",
        "13-inch",
        "IP",
        "Windows",
        "1650",
        "nine",
        "second",
        "PIA",
        "13",
        "2060",
        "120 hertz",
        "2020",
        "the next year",
        "Razer Blade Stealth",
        "1,450",
        "100 watts",
        "Linux",
        "a month",
        "10",
        "first",
        "these days",
        "AMD",
        "16",
        "Razer",
        "two",
        "120",
        "up to five",
        "Razer",
        "Android",
        "1,800",
        "four",
        "10 hours",
        "GPU",
        "the Razer Blade",
        "Zephyrus",
        "USB Type-C",
        "Linus",
        "XPS",
        "three-by-two",
        "the ASUS Zephyrus G14",
        "CPU",
        "ASUS",
        "eight",
        "Dell",
        "ASUS"
    ],
    "transcript_entity_types": [
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT"
    ],
    "vector": [
        -0.08943217992782593,
        -0.01365081500262022,
        0.04566225782036781,
        -0.024925796315073967,
        0.07549626380205154,
        0.06399966776371002,
        0.015632137656211853,
        0.0678647831082344,
        -0.02577962540090084,
        0.046983808279037476,
        0.024802086874842644,
        0.0822845920920372,
        0.0598965659737587,
        -0.03353806957602501,
        0.04167927801609039,
        0.038803890347480774,
        0.13524271547794342,
        -0.080563485622406,
        0.006636797450482845,
        -0.053646478801965714,
        -0.04586458206176758,
        -0.08057207614183426,
        0.017328495159745216,
        -0.05043813958764076,
        0.05663188174366951,
        -0.032419055700302124,
        0.0425567589700222,
        -0.04721342772245407,
        -0.015895698219537735,
        0.001644773525185883,
        0.04240048676729202,
        -0.012409043498337269,
        -0.03927361220121384,
        -0.006990309804677963,
        -0.00661612581461668,
        -0.07304991036653519,
        0.021471992135047913,
        -0.07925517112016678,
        -0.07480849325656891,
        -0.06458713114261627,
        0.00801499467343092,
        -0.05019570514559746,
        -0.004995669238269329,
        0.00865497812628746,
        0.03736000508069992,
        -0.0696108490228653,
        0.07269278913736343,
        0.0008985446766018867,
        0.027295829728245735,
        -0.027492182329297066,
        0.038066767156124115,
        -0.08699402213096619,
        0.04898926615715027,
        -0.06365467607975006,
        -0.11213546246290207,
        0.07155252993106842,
        -0.007513027638196945,
        -0.07346642017364502,
        0.07188118249177933,
        0.029276534914970398,
        0.11520256847143173,
        -0.1270412653684616,
        -0.0401524119079113,
        0.049759622663259506,
        0.015573721379041672,
        -0.061319079250097275,
        0.019472824409604073,
        0.022409508004784584,
        -0.03483254835009575,
        -0.00997965782880783,
        0.06132759526371956,
        -0.013499367982149124,
        0.04865710809826851,
        0.0031173350289463997,
        -0.06752925366163254,
        -0.010997053235769272,
        0.0932166576385498,
        0.019237253814935684,
        0.11156023293733597,
        0.043053038418293,
        0.008555235341191292,
        -0.03522900491952896,
        0.013284995220601559,
        -0.07484232634305954,
        0.031124386936426163,
        -0.045125093311071396,
        0.026124607771635056,
        0.038322001695632935,
        0.007221975363790989,
        -0.0897550880908966,
        0.009819382801651955,
        0.09035296738147736,
        0.021464424207806587,
        0.018542557954788208,
        -0.0102229043841362,
        -0.005255135707557201,
        0.0675216093659401,
        -0.015760602429509163,
        -0.05704522132873535,
        0.02117599919438362,
        -0.008400500752031803,
        0.08326316624879837,
        0.05712790787220001,
        -0.04592512175440788,
        -0.07092077285051346,
        -0.02350609004497528,
        -0.013379218988120556,
        0.09052620083093643,
        0.02776694856584072,
        0.02202310413122177,
        -0.06517503410577774,
        0.03787275776267052,
        -0.07301065325737,
        0.014330991543829441,
        -0.018809407949447632,
        0.08926207572221756,
        -0.04983781278133392,
        -0.032189641147851944,
        0.1266888827085495,
        -0.005228498484939337,
        -0.03589818626642227,
        0.043100450187921524,
        -0.0029783789068460464,
        0.051299188286066055,
        0.07069099694490433,
        0.05779063701629639,
        -0.08885176479816437,
        4.534830555467867e-33,
        -0.009052718058228493,
        0.06826004385948181,
        -0.08316969871520996,
        -0.07278526574373245,
        -0.0033908705227077007,
        0.06912447512149811,
        0.06387659907341003,
        0.015346555039286613,
        -0.0738581195473671,
        0.015499687753617764,
        -0.08925250172615051,
        0.012642700225114822,
        -0.027736928313970566,
        0.052259042859077454,
        0.05195963382720947,
        -0.03452911227941513,
        -0.006121672689914703,
        -0.025342434644699097,
        0.038295503705739975,
        0.005905796308070421,
        0.028456751257181168,
        0.010353141464293003,
        0.026989396661520004,
        0.008612583391368389,
        0.036442678421735764,
        -0.04207329824566841,
        -0.07119376957416534,
        -0.02367629110813141,
        0.055237989872694016,
        0.026471367105841637,
        -0.024524420499801636,
        -0.03512478992342949,
        -0.04929104819893837,
        -0.014929560013115406,
        -0.07580176740884781,
        0.007860660552978516,
        -0.10727652162313461,
        -0.08572623133659363,
        0.046210091561079025,
        0.01752656325697899,
        -0.07649088650941849,
        0.08956999331712723,
        -0.10554089397192001,
        -0.15238432586193085,
        0.012677392922341824,
        0.04414644464850426,
        -0.056060124188661575,
        -0.019089436158537865,
        -0.031465839594602585,
        0.03854602202773094,
        -0.11500772833824158,
        0.0757460668683052,
        -0.022535067051649094,
        -0.01950344443321228,
        -0.0004867741954512894,
        0.002029881812632084,
        0.0323585569858551,
        0.007816067896783352,
        0.08035655319690704,
        0.023983199149370193,
        0.02684042789041996,
        -0.0005794224562123418,
        -0.07112206518650055,
        0.001906743855215609,
        -0.10899553447961807,
        0.0958665981888771,
        0.08416591584682465,
        -0.0037135188467800617,
        -0.023368677124381065,
        0.044250015169382095,
        -0.030555516481399536,
        -0.01416537631303072,
        0.027783941477537155,
        -0.021887751296162605,
        0.03660015016794205,
        -0.01702110841870308,
        -0.06097421795129776,
        0.011020679026842117,
        0.0022196031641215086,
        -0.002738573355600238,
        0.015527640469372272,
        0.1066085696220398,
        0.05191655457019806,
        0.05451352894306183,
        -0.003062462667003274,
        0.010543499141931534,
        -0.024168388918042183,
        -0.018037568777799606,
        -0.006613836158066988,
        0.02463231049478054,
        -0.04045155644416809,
        -0.027836039662361145,
        0.00020306732039898634,
        0.09215294569730759,
        -0.03042244166135788,
        -4.7782151914376834e-33,
        -0.07441243529319763,
        0.006951568182557821,
        -0.022749926894903183,
        0.05004926770925522,
        -0.015028471127152443,
        0.03431110456585884,
        0.03956564888358116,
        0.04143699258565903,
        -0.027537789195775986,
        -0.09424715489149094,
        0.029065193608403206,
        0.0941261500120163,
        -0.00035130532342009246,
        -0.002139428397640586,
        0.010003205388784409,
        -0.08260910958051682,
        0.02774856425821781,
        -0.0991118997335434,
        0.055045969784259796,
        -0.08406801521778107,
        0.05661633238196373,
        0.054787684231996536,
        -0.004737693816423416,
        0.046058811247348785,
        0.012813607230782509,
        -0.06949612498283386,
        -0.009512174874544144,
        -0.04961647465825081,
        -0.0009621934732422233,
        0.043075524270534515,
        0.0007636656519025564,
        -0.005666711367666721,
        0.048403702676296234,
        0.0016430296236649156,
        0.06855714321136475,
        0.026558207347989082,
        -0.036697253584861755,
        0.07511221617460251,
        0.03930533677339554,
        0.003130085999146104,
        0.03927524387836456,
        -0.024233760312199593,
        -0.015096300281584263,
        0.0025075471494346857,
        0.01190910767763853,
        -0.011530419811606407,
        -0.0554158017039299,
        -0.08230879157781601,
        -0.017974043264985085,
        -0.005752637982368469,
        -0.041926123201847076,
        -0.057577963918447495,
        0.040502723306417465,
        -0.005081408657133579,
        -0.07142482697963715,
        -0.04404384642839432,
        -0.03889572247862816,
        0.04377748444676399,
        -0.040433619171381,
        0.0006595953600481153,
        0.024155138060450554,
        0.02770307846367359,
        -0.03667498752474785,
        -0.0017964706057682633,
        0.01625504158437252,
        -0.01359738688915968,
        -0.029381277039647102,
        0.053760893642902374,
        -0.001004296587780118,
        -0.04686013236641884,
        -0.048041392117738724,
        -0.04982059448957443,
        -0.024387335404753685,
        -0.0037201899103820324,
        -0.03896849974989891,
        0.029158303514122963,
        0.0164895448833704,
        0.007698885165154934,
        -0.049099151045084,
        0.008316054940223694,
        -0.004984608385711908,
        0.010173654183745384,
        0.06940627843141556,
        -0.049556635320186615,
        0.04757687449455261,
        0.02338363789021969,
        0.04472944140434265,
        -0.10786349326372147,
        -0.029296105727553368,
        -0.05268918350338936,
        -0.06175556778907776,
        -0.06384250521659851,
        -0.060749080032110214,
        0.018177689984440804,
        0.041483908891677856,
        -5.432223204593356e-08,
        0.033452559262514114,
        0.029769230633974075,
        0.07497063279151917,
        0.059984240680933,
        0.003285645507276058,
        -0.02825150266289711,
        0.04073204845190048,
        -0.05388723313808441,
        0.03541593626141548,
        0.12193065136671066,
        0.016496727243065834,
        -0.07480385154485703,
        -0.07881249487400055,
        0.006243004929274321,
        -0.07131459563970566,
        0.0915425643324852,
        -0.018332067877054214,
        0.039030369371175766,
        0.015814820304512978,
        -0.04454994946718216,
        -0.029662270098924637,
        0.05839875340461731,
        0.029178094118833542,
        -0.01940395124256611,
        -0.0050698923878371716,
        0.028221171349287033,
        -0.01354238297790289,
        -0.02647506445646286,
        0.09176812320947647,
        0.014118712395429611,
        -0.10147632658481598,
        -0.02829974889755249,
        0.08545265346765518,
        0.05039631202816963,
        -0.04251587390899658,
        -0.05786483734846115,
        0.035277437418699265,
        0.032746028155088425,
        0.06937786191701889,
        0.042107515037059784,
        0.007696853019297123,
        -0.0189049132168293,
        -0.004122985061258078,
        -0.040615592151880264,
        -0.009625445120036602,
        -0.015976687893271446,
        -0.02149803936481476,
        -0.10156013816595078,
        -0.006851458456367254,
        0.023107508197426796,
        0.02610037289559841,
        -0.021434443071484566,
        -0.008112123236060143,
        0.008180409669876099,
        0.05760881304740906,
        0.0030127360951155424,
        -0.012718481943011284,
        -0.01460412796586752,
        0.03259218484163284,
        0.07378561049699783,
        0.08300013840198517,
        -0.15950579941272736,
        -0.05705439671874046,
        0.07945796847343445
    ]
}