{
    "id": "lHvMHuF9Cq4",
    "title": "Did Fuji make my PERFECT camera?! - Fujifilm XT4",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-02-28T02:40:30Z",
    "video_url": "https://www.youtube.com/watch?v=lHvMHuF9Cq4",
    "category": "People & Blogs",
    "tags": [
        "Fujifilm",
        "Canon",
        "Nikon",
        "Camera",
        "Photography",
        "Cinematography",
        "Lenses",
        "Digital",
        "Video",
        "4K",
        "Slow motion",
        "Brandon"
    ],
    "views": 412138,
    "likes": 18851,
    "comments_count": 899,
    "description": "Fujifilm just released press samples on the X-T4 camera, and well it's a bit obvious who would want to check it out at Linus Media Group.   Pre-Order Fujifilm XT4 on BHPhoto (Paid Link):   Buy Fujifilm XT2 On Amazon (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/hLzxOR",
        "https://geni.us/HmwygPD",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- So this is the FUJIFILM X-T2 and it came out about three years ago and it's been my stills camera for the last three years. And I'm very happy with it. It's been my favorite stills camera that I've ever owned. I didn't upgrade to the X-T3 because it didn't feel like enough of a upgrade. But today we have Fuji's brand new X-T4. And I'm wondering if this is finally enough of an upgrade for me to switch. At 1699 US, it's not the cheapest camera, but Fujifilm is also very competitive in lots of their features compared to Canon, Sony and Panasonic. Well, we're starting off with no instructions in the box because this is a press sample unit, but no big deal, we don't need any of those. Oh. They sent me the silver one. I've always been, not like clean black finish on all the cameras, but I'm glad that Fuji offers two different colors. They offer the X-T4 in both silver and black. Physically, it feels a little bit heavier. I believe it's about a hundred grams heavier than the previous two models before. So my X-T2 versus, wait, this has a lens on it so it's a little bit unfair, take the lens off. Definitely feel a weight difference, but this also has a 2,200 mAh power battery. So that is a significant improvement on the 1,200 mAh power battery that the Fuji X-T2 has. Unfortunately for me, that means also that the batteries themselves are a brand new type of battery, this new NP-, whatever the number is editor. Thank you. It's apparently has double battery lifetime overall. So in the box we have a type C cable, cool. This new, this new X-T4 also has the type C port on it, which is really nice. It allows charging and it doubles as a headphone jack within adapter, which here is that tiny little adapter, not the biggest fan of that, honestly. I would have, as someone who shoots prominently video, it would have been nice to have included a direct dedicated 3.5 millimeter jack. But I also sort of understand the logic here. You kind of get the best of both worlds and then they save space on the ports themselves. We have the typical camera strap. What is this? Oh little charger, USB little ward. With the new type C port you can actually charge the battery through the camera, or you can just do what normal people do and buy a separate charger to charge more than one battery at the same time. That's probably the way to go. It doesn't seem to come with a separate charger. So actually, as it stands, you have to charge battery in the camera in order to charge it when you have just the camera. That's a little bit, I don't know about that. I mean, I'm all for the option to power your camera off of type C, type C is amazing, but that means you can't use your camera while your battery is charging, which is kind of annoying. Which okay, to be fair to Fuji, they've also included as an optional accessory, this X-T4 battery grip, which also includes, wow this thing is heavy. So this battery grip that Fuji's released in conjunction with the X-T4 also has a ded, is the only way that you can get a dedicated 3.5 millimeter jack on the X-T4. So one of the main reasons that I bought a Fujifilm camera to begin with when I was looking for a stills camera, is that there, the bodies themselves are so compact. And so when you look at having to add the battery grip, if you want a dedicated 3.5 millimeter jack, it just adds weight, it adds vertical height to the camera, that's sort of awkward cause then this is not usually a very friendly height adjustment to 15 millimeter rails, If you want to rig it. I mean, there's going to be people third-party manufacturers that are gonna make rigging parts that allow you to rig this well, but, I don't know, this is not, this is not the ideal video centric form factor that I personally liked very much. One of the benefits is like, look how small Fuji's lenses can be because it's APSC size sensor and the cameras themselves aren't that big. I mean, comparatively, this is an 85 mil lens that you'd use for video, which is a little bit unfair to compare this to. But I mean, to give you some context, this is Fuji's lenses. So small, so good. If you look at the top of the dials, they haven't really changed that much. The shutter button is apparently improved. What? I don't know, it actually on this press unit, the shutter feels a little bit mushier than my X-T2. Interesting. So the dials is overall the same. They added the ISO 160 unlike, instead of the low little bit like low logo here. So that's nice. You have a more precise idea of what your ISO is when you're at the low setting. I mean, you could always just look at it through the EVF. Wouldn't be a big deal. It has a little nice touch though. So there's a couple small dial changes with the X-T4 in the, my X-T2 specifically, there's this new stills and movie dial, which allows you to go from stills only shooting or only video shooting, which actually, having used the X-T2 briefly for video, that's a nice touch, because going through the menus before and having to deal with, oh, is this the video menu or is this stills menu? When you're trying to move quickly. A little annoying, so now, the menus themselves, all of the movies settings are here. For the stills menu, you have only still setting. All those nice, new, easy to think about still settings. And then when you want to go to movie mode, you go back to the menu and oh, look, movie settings, H265, 4k recording. All that stuff is much easier to access versus having to deal with both menu simultaneously with the X-T2. Guys, Fuji has finally listened to all our, all of the users that have said for years that every camera, every stills camera that can shoot video should follow something that Canon has been doing for how long now? Since, 10 years ago probably, they've had this awesome flip out screen. And when I got my X-T2, I was like, okay, they did this weird, like hybrid flip out screen thing that also allows you to do this angle. Like when would I ever use, I mean, in this mode, you might use that a little bit, but not nearly as useful for video, even stills as something like this. Well, the X-T4 has fixed that problem. Flip out screen. Guys, look at this. It's beautiful. I love it. I mean, okay. You know what, Fuji, I'm, I'm very happy that you finally listened and saw the way forward and now people can selfie video with your camera. How great is that? Also, in addition to it being a flip out screen, it is now also a touch screen. Ooh, that brand new camera click. The first time you put a lens on it, you hear that? Guys, I can listen to this all day. So the IPS is new on the, the new X-T4. I've lost my IPS for my X-T2 multiple times. So it just, it locks, it just presses in and then it doesn't go anywhere unless you want it to. And then you can take it off when you want to replace it with something else. But I mean, really why would you ever replace it? You just don't want to lose it. Overall, I am actually appreciating the fact that even though they made the camera slightly heavier, slightly bigger, the grip itself, if you can tell from right here is quite a bit bigger than the grip on the X-T2, which that was probably one of my biggest complaints about my X-T2, is while it's nice and compact and small, the grip also leaves something to be desired where something like even Canon's old DSLRs, the grip was much more significant, but I mean, you also think about how thick this camera is compared to this. Now this improved battery and extra size allows a nice, nicer grip. And that actually feels really premium, very nice. So a couple of things that Fuji has also added is they have those, their typical film simulations. Probio, Valvia, Astia soft, classic Chrome, pronag high, pro neck standard, but then these new ones, the Eterna and the Eterna Bleach Bypass, which are ideal for video use. I mean, you get this kind of weird, contrasty, bleached bypass look, if you want that baked into your video, which again, personally, I wouldn't use, but it's nice that they included it. For Eterna though, I might actually use for stills. It seems like an interesting picture profile for that, but I'm, I'm definitely a classic Chrome guy, classic Chrome. Anyone who use Fuji will probably know what I'm talking about. Classic Chrome, so nice. Okay, let me just dial in our white balance so we can start taking a couple of photos. Oh, look, they've changed the white balance. The way that the white balance is done, that's a little nice touch. That's really small versus my X-T2 in custom white balance, you have to select from presets and you could never define exactly to the 50th Kelvin that you want. Guys, it's the little details in the settings like that, that really make me a happier shooter. So one of my favorite new features of the X-T4 is that it has a in-body stabilization, which is something Sony has had for a while, but Fuji has out done themselves. 6.5 stops of in-body stabilization on this camera, which I'm going to try to take a photo at one eighth shutter now of Andy over here and see how that feels. Wow. And the shutter sounds nice. Here David, I'm gonna take a photo of you too. Oh damn. Look at David's glasses right there. Guys, pin sharp. That was very low effort on keeping my body steady. Impressive. One thing I want to compare between these two is just how the shutter sounds. This is my X-T2. It's pretty loud. And then let's see how the X-T4 sounds in comparison. Wow, guys, if you're an event shooter or just someone who wants to be very discreet when you're taking photos, that is a nice sounding shutter and that's a mechanical shutter, not electronic, electronic a solid obviously, but, yeah, that sounds good. I mean, again, so with all these improvements, the sensor is the same as the X-T3. So you'll get that very good 26 megapixel performance that you got out of that camera, just with all these little bells and whistles, which, and guys, I can't get over this screen, come on. Okay, so for those of you who own an X-T3 or have used an X-T3, you will probably be familiar with the improved 4k video, versus my X-T2, which was always a little unfortunate. I couldn't really ever shoot video that I was super happy with out of this camera, but with the X-T4, all of those video improvements that came from the X-T3 transfer here, but they've also added 1080p, 240fps. Should we test it? I think so. Let's just make sure our setting is on and we're at 29.97, 240p. Nice. All right. lttstore.com Ooh. That feels good. Impressed. 1080p, 240 FPS and a camera this size. That's pretty freaking awesome. So for all you sports photographers out there, the continuous shooting mode has improved from even the X-T3. It is now a whopping 15 FPS. Listen to that. 15 FPS. And guys, if you wanted to shoot with an electronic shutter, it is 30 FPS. Whereas my X-T2 unfortunately only has eight. And it's so much louder. Holy crap. So many shots of Andy, I can now see Andy at 15 FPS, no blackout on this EVF. So with the files on my X-T2, when you go into the raw recording setting, you have uncompressed and lossless compressed, but the X-T4 has uncompressed, lossless compressed and then compressed. So guys, if you want the benefits of raw, but you don't want the file sizes, you can get a slightly, not quite as fat file, but smaller sizes and a lot of the main benefits like white balance change and better control of your exposure overall. So all these changes that they've made to the X-T4 might feel like small changes overall, but like the addition of Ibis and the fully articulating touchscreen. I mean, like all of these things together, especially from my use case of using the X-T2 feel like very significant upgrades. I mean, things like the continuous 15 FPS mechanical shooting, just really nice. And the camera itself feels better in the hand than my X-T2 did with the extended battery life for longer shoots, that's going to improve the usability a lot. So thank you guys for watching this short circuit on the X-T4. I'm probably going to upgrade to this cause I like, I really do. Man, this, this, this touchscreen and this variable angle screen, plus the in-body stabilization really bring this together to be a much more functional camera than the one that I already own. Great job Fuji. Subscribe to short circuit. See you guys later.",
    "transcript_keywords": [
        "camera",
        "Fuji",
        "nice",
        "video",
        "battery",
        "Guys",
        "FPS",
        "bit",
        "grip",
        "shutter",
        "battery grip",
        "screen",
        "feels",
        "type",
        "classic Chrome",
        "Fuji lenses",
        "small",
        "Chrome",
        "menu",
        "nice touch"
    ],
    "transcript_entity_values": [
        "240 FPS",
        "about three years ago",
        "the Eterna Bleach Bypass",
        "1,200",
        "FPS",
        "eight",
        "15",
        "29.97",
        "6.5",
        "Probio",
        "One",
        "15 millimeter",
        "Classic Chrome",
        "Fuji",
        "US",
        "one",
        "USB",
        "85 mil",
        "EVF",
        "Panasonic",
        "4k",
        "Valvia",
        "Astia",
        "50th",
        "ISO 160",
        "about a hundred grams",
        "the X-T4",
        "one eighth",
        "1699",
        "Andy",
        "the last three years",
        "26 megapixel",
        "240fps",
        "David",
        "Chrome",
        "years",
        "10 years ago",
        "EVF",
        "IPS",
        "third",
        "Fuji",
        "first",
        "Eterna",
        "Fujifilm",
        "Sony",
        "Ibis",
        "two",
        "Canon",
        "1080p",
        "2,200",
        "3.5 millimeter",
        "30",
        "Kelvin",
        "more than one",
        "jack",
        "H265",
        "today"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "FAC",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.005019879899919033,
        -0.011861024424433708,
        -0.004966754000633955,
        -0.034166645258665085,
        0.04695594310760498,
        -0.05290365591645241,
        0.061838794499635696,
        0.10123835504055023,
        -0.0015809626784175634,
        -0.002631508046761155,
        0.03390248492360115,
        0.029118774458765984,
        0.055238425731658936,
        0.045788660645484924,
        0.06301605701446533,
        -0.017968328669667244,
        0.04844896122813225,
        -0.08891735970973969,
        0.027341725304722786,
        0.019472524523735046,
        -0.05460729822516441,
        -0.09459451586008072,
        0.08512558788061142,
        -0.03773966431617737,
        0.015710841864347458,
        0.029512759298086166,
        -0.11808096617460251,
        -0.10379878431558609,
        -0.034646667540073395,
        0.00884890928864479,
        -0.11354272812604904,
        0.09822971373796463,
        -0.006223243661224842,
        -0.046380847692489624,
        0.0746084675192833,
        -0.00644875830039382,
        0.14930646121501923,
        -0.014259716495871544,
        -0.057073723524808884,
        -0.04694327712059021,
        0.02090393379330635,
        0.006745453923940659,
        0.013068807311356068,
        0.011743924580514431,
        0.015614623203873634,
        0.061332590878009796,
        0.0792946144938469,
        -0.05578913539648056,
        0.042086873203516006,
        0.002737676724791527,
        -0.04419488087296486,
        0.03418079391121864,
        0.0352739654481411,
        -0.014510064385831356,
        0.030539823696017265,
        0.04687631130218506,
        -0.02886604703962803,
        -0.08993759006261826,
        0.004650026559829712,
        -0.048994701355695724,
        -0.018520886078476906,
        -0.05128581449389458,
        -0.00508221285417676,
        0.08786160498857498,
        0.016467709094285965,
        -0.02930566482245922,
        0.024956557899713516,
        -0.07958649843931198,
        0.029840152710676193,
        -0.0024801972322165966,
        -0.007596330717206001,
        0.05450019985437393,
        0.0020430150907486677,
        0.016884706914424896,
        -0.15047678351402283,
        0.008521584793925285,
        0.12814180552959442,
        -0.0569666251540184,
        0.00694325240328908,
        -0.025996986776590347,
        0.05600437894463539,
        0.01647842861711979,
        -0.024141540750861168,
        -0.010966761969029903,
        -0.002082792343571782,
        -0.03851110115647316,
        0.0706295371055603,
        -0.007841210812330246,
        0.002213406842201948,
        0.07347369939088821,
        0.03006971813738346,
        0.07080505788326263,
        0.01173548772931099,
        -0.0012347523588687181,
        -0.08286575973033905,
        -0.040600720793008804,
        0.054422877728939056,
        0.013745543546974659,
        -0.010194245725870132,
        0.014506399631500244,
        0.038172703236341476,
        0.0001830848923418671,
        -0.014559782110154629,
        -0.06812216341495514,
        0.0076997289434075356,
        -0.06774169951677322,
        -0.0459618866443634,
        0.05452326312661171,
        -0.024178406223654747,
        0.03316982090473175,
        -0.042896587401628494,
        -0.022077495232224464,
        -0.018374493345618248,
        0.004322475288063288,
        -0.016886547207832336,
        0.056813664734363556,
        -8.158183845807798e-06,
        -0.026701193302869797,
        0.00508167315274477,
        -0.005924328695982695,
        -0.0012061758898198605,
        -0.04172322526574135,
        -0.015705028548836708,
        -0.004715905990451574,
        -0.02621457539498806,
        -0.00016754512034822255,
        -0.03394090384244919,
        2.4417814975791884e-33,
        -0.001961309928447008,
        0.1582793891429901,
        -0.02613626793026924,
        -0.06392431259155273,
        -0.049261342734098434,
        0.01315081212669611,
        0.06935989856719971,
        0.08611981570720673,
        -0.07886295765638351,
        0.010714740492403507,
        -0.06019410118460655,
        -0.0822717547416687,
        -0.053199272602796555,
        0.012620623223483562,
        0.024351585656404495,
        -0.03409717604517937,
        -0.0076675680465996265,
        -0.0004135624913033098,
        0.0804085060954094,
        0.045366376638412476,
        0.034440211951732635,
        0.04050944000482559,
        0.03547193109989166,
        -0.020350569859147072,
        0.004084519110620022,
        -0.007965728640556335,
        0.07841841131448746,
        0.0028775290120393038,
        0.005328914150595665,
        0.0067082662135362625,
        -0.08631201088428497,
        0.005533908493816853,
        0.025153720751404762,
        -0.0503976047039032,
        0.030732411891222,
        -0.03962895646691322,
        -0.032892268151044846,
        -0.03361749276518822,
        -0.0029849368147552013,
        -0.019109059125185013,
        -0.08542218804359436,
        0.07109680771827698,
        -0.05062057450413704,
        -0.05657372996211052,
        0.0759611651301384,
        0.016250312328338623,
        -0.031135817989706993,
        -0.005660852417349815,
        -0.06485594063997269,
        0.03486678749322891,
        -0.01977364532649517,
        -0.008306487463414669,
        -0.03159302845597267,
        0.039406079798936844,
        -0.0015018638223409653,
        0.003987899515777826,
        0.023447493091225624,
        -0.033419374376535416,
        0.004782541189342737,
        0.04921657592058182,
        0.028612712398171425,
        -0.051365964114665985,
        -0.12505345046520233,
        -0.0073824538849294186,
        -0.05419173091650009,
        0.1001892015337944,
        0.02030416578054428,
        -0.031035244464874268,
        -0.10303626954555511,
        0.027472438290715218,
        -0.005713541526347399,
        -0.13665759563446045,
        0.02248193882405758,
        -0.055192600935697556,
        0.16881783306598663,
        0.0023920985404402018,
        -0.09807337820529938,
        0.009393302723765373,
        0.05073093622922897,
        0.026393558830022812,
        -0.11978485435247421,
        0.06602305918931961,
        0.060671333223581314,
        0.0774894580245018,
        0.02135169692337513,
        0.009019013494253159,
        0.0706767588853836,
        0.10043972730636597,
        0.020662358030676842,
        0.015709426254034042,
        0.04208504408597946,
        -0.037912603467702866,
        0.019502094015479088,
        0.013336379081010818,
        -0.017249969765543938,
        -3.1655662464880954e-33,
        0.05619402602314949,
        0.05142022296786308,
        -0.01692112721502781,
        0.04252724349498749,
        -0.08234461396932602,
        -0.034522730857133865,
        -0.04000961035490036,
        0.033768415451049805,
        0.008911898359656334,
        -0.033744506537914276,
        0.09405377507209778,
        -0.01776810735464096,
        -0.0427250973880291,
        0.022345630452036858,
        -0.03743576630949974,
        -0.043480005115270615,
        -0.0019921923521906137,
        -0.0944015234708786,
        -0.049424849450588226,
        -0.07116962224245071,
        0.08832916617393494,
        0.032672006636857986,
        -0.00024299760116264224,
        0.035017192363739014,
        -0.027342870831489563,
        0.028834858909249306,
        -0.006078850477933884,
        0.009159890003502369,
        0.034465987235307693,
        -0.05103430896997452,
        -0.12202581018209457,
        -0.011396288871765137,
        0.043343983590602875,
        0.018563710153102875,
        0.04899336397647858,
        0.013675147667527199,
        -0.0031804731115698814,
        0.053458597511053085,
        -0.0019921218045055866,
        0.15781210362911224,
        -0.05634976178407669,
        0.08407355844974518,
        0.0850381851196289,
        0.0760260596871376,
        0.009249037131667137,
        0.012226819060742855,
        0.006646561436355114,
        0.0075753009878098965,
        0.07380928844213486,
        0.08389998227357864,
        -0.013819628395140171,
        -0.016709476709365845,
        0.0025623422116041183,
        0.012653537094593048,
        -0.07559839636087418,
        -0.07782353460788727,
        -0.030134472995996475,
        -0.004111872054636478,
        -0.0887097641825676,
        0.028672965243458748,
        0.0442483052611351,
        -0.035065870732069016,
        0.0093185193836689,
        0.0010471699060872197,
        0.018455753102898598,
        -0.04226239398121834,
        -0.01789024844765663,
        -0.007581941783428192,
        -0.008579796180129051,
        -0.02595454268157482,
        -0.0656222328543663,
        -0.08247923105955124,
        -0.014925478957593441,
        -0.0677591860294342,
        0.048281390219926834,
        -0.03256246820092201,
        -0.04225175827741623,
        -0.017401695251464844,
        0.08759333938360214,
        -0.03290235251188278,
        0.031859613955020905,
        0.060108281672000885,
        0.03710831701755524,
        0.003916936460882425,
        0.04671848565340042,
        0.06153271719813347,
        0.023606102913618088,
        -0.07442976534366608,
        -0.015769783407449722,
        -0.02932467870414257,
        -0.03325444087386131,
        0.02390170656144619,
        0.016970157623291016,
        0.013754893094301224,
        0.02046896331012249,
        -4.602187786417744e-08,
        -0.051126714795827866,
        0.019074926152825356,
        0.0005904677091166377,
        0.04392532259225845,
        -0.0023583583533763885,
        -0.0873541384935379,
        -0.08084653317928314,
        0.0579657144844532,
        0.09995362162590027,
        -0.02422221563756466,
        0.03538022190332413,
        0.011251604184508324,
        0.006813815329223871,
        -0.047455813735723495,
        -0.048173628747463226,
        -0.026383958756923676,
        0.003019650699570775,
        -0.004473340231925249,
        -0.01499002892524004,
        -0.011225917376577854,
        -0.029352428391575813,
        -0.014829354360699654,
        -0.019891832023859024,
        -0.05898020789027214,
        -0.029587963595986366,
        -0.04556944966316223,
        -0.03991759940981865,
        -0.0038300638552755117,
        0.08840827643871307,
        -0.04483399912714958,
        -0.07925324887037277,
        -0.012636257335543633,
        0.01592136360704899,
        0.06325806677341461,
        0.0038763557095080614,
        -0.0825507640838623,
        -0.07985998690128326,
        -0.006799073424190283,
        0.06649667769670486,
        0.03615063056349754,
        0.015985803678631783,
        -0.029596950858831406,
        -0.06615765392780304,
        0.01193837821483612,
        0.022113805636763573,
        0.010589919053018093,
        -0.005204710178077221,
        -0.07302016764879227,
        -0.04516957700252533,
        0.05623487010598183,
        0.02340829372406006,
        -0.008439654484391212,
        0.008532015606760979,
        -0.06117929145693779,
        0.03268760070204735,
        0.03275733068585396,
        0.007996740750968456,
        0.02261974848806858,
        -0.04228708893060684,
        0.10714228451251984,
        0.05605592951178551,
        -0.14175555109977722,
        -0.043357864022254944,
        0.09134387224912643
    ]
}