{
    "id": "ljdd26UH94E",
    "title": "I can't believe I BROKE it! - OneXPlayer AMD 5700U Version",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-29T19:30:20Z",
    "video_url": "https://www.youtube.com/watch?v=ljdd26UH94E",
    "category": "Science & Technology",
    "tags": [
        "OneXPlayer",
        "Aya Neo",
        "Handheld",
        "Gaming",
        "Performance",
        "Ryzen",
        "AMD",
        "5700U",
        "5800U",
        "Zen Processor",
        "Desktop",
        "AGPU",
        "Integrated Graphics",
        "Game",
        "Handheld Gaming is AWESOME",
        "Not sure if this could be the steamdeck",
        "More powerful than the steamdeck",
        "Valve",
        "Steamdeck"
    ],
    "views": 686457,
    "likes": 25018,
    "comments_count": 1138,
    "description": "Check out how iFixit can help you restore your devices at:   OneXPlayer has another handheld player that allows you to play even higher-end games at a decent FPS. Also, it uses an AMD Processor, so you know it's going to be good.,  Check out the OneXPlayer (w/ AMD 5700U):   Learn more about the AYANEO NEXT:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS ---------------------------------------------------   0:00 - Handheld gaming! 0:10 - Unboxing and overview 2:07 - I/O ports and buttons impressions 3:15 - Specs 4:00 - Ergonomics impressions 4:20 - Display thoughts 4:49 - Weight impressions 5:10 - Blacklight bleed 5:33 - Gaming and resolution impressions 6:43 - Cooling fan noise 7:00 - Display and performance comparison 8:00 - Sponsor - iFixit! 8:31 - Kickstand impressions 9:00 - Battery specs and thoughts 9:35 - Component placement 10:41 - OneXPlayer specific custom buttons 11:54 - Continued gaming impressions 12:20 - I broke it 12:35 - Final thoughts 14:02 - Tough decisions",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://lmg.gg/F6uGW",
        "https://lmg.gg/R5pSQ",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- My previous beef with the OneXPlayer has been that it uses Intel Xe graphics, which granted is plenty fast, but has cost some driver snags that we've run into. This version, whoa, not only does it have a massive, nearly nine inch screen, this is an 8.4 inch IPS display, but it now uses a Ryzen 5000 series mobile processor, the 5700U. So packed within this... Wow, dual fan cooling? This thing is sick. Packed in here are eight CPU cores, eight Vega GPU cores, this gigantic 2560 by 1600 resolution display, and actually, those are some pretty nice feeling ABXYs. Little bit of a mushy D-pad. Ooh, triggers and joysticks, feeling pretty good. Oh, I wanna get this fired up now. Okay, hold on, first though, let's see what's inside. Instructions. (gasps) It has a night mode switch. This is one of my big complaints about the AyaNeo 2021, as well as the AyaNeo Next, it doesn't get dim enough when I'm playing at night, which a lot of the time is when I'm playing. So I wanna know all about night mode. Just wait, it mutes. Oh, I thought maybe it would turn down the display. Oh, it's for the fan. Oh, all right. Well, I got really excited, but it's a fan profile. Ooh, what's in here? Charger. Oh. Oh, I did not have to do that at all. (crew members giggle) This is a compact looking charger though, I like that. That's sick. This has gotta be like a gallium nitride charger or something. Ah, it's only like 65 watts. Maybe not. Maybe not. Where's my, where are my plugs at? (groans) Oh really? Okay, let's talk IO here. It's got dual USB three point, whatever the crap they call them at this point, one of which is marked for power input and the other one's not, which makes me kind of wonder, will they not both accept a power input? I don't know. That one definitely does. And that one appears to too. The light turns on regardless. A type A, super nice to see, micro USB, headphone microphone combo jack, you got your shoulder buttons, got your triggers on the back. No rear buttons like the Steam Deck, but there's our night mode, little mute thing. It does warn you that the unit will get hotter if you put it in night mode. Got our volume up and down where they're out of the way. Fingerprint sensors, as well as power button. Then on the bottom, you've got this little magnetic interface for like a keyboard dock thing. They didn't send over one of those, so I can't show that to you. And no bottom USB ports. That's one of the things I really like about the AyaNeo, is depending on where I'm using it, sometimes I like to have the charger plugged into the top, sometimes I prefer the bottom. With both the OneXPlayer and the Steam Deck, you are stuck plugging in on top, which in this particular circumstance is actually kind of inconvenient. Ah yes, and we should talk about what makes the OneXPlayer AMD version special, because this thing is crazy, freaking powerful. It's got a Ryzen 5700U, which is about a hundred megahertz slower than the 5800U that's in the AyaNeo Next, across the board. But it's got the same 8 CPU core 16 threads, and the same 8 Vega GPU cores. They're just clocked a little bit slower. And what I would be interested to see is how that works out in the real world, because what I suspect, once we open this thing up, is that we are gonna find a much, much beefier cooling solution. I mean, there's already two fans and two heat sinks, compared to one fan and one heat sink, right? Ergonomics, pretty good. Like the AyaNeo Founders though, it's got kind of a sharp edge on the bottom where your palm is, and the weight is substantial, but not as much more as I would have expected, given the dramatically larger screen. Now, one a really cool thing about having such a high resolution screen, 2560 by 1600 at this size is flipping crazy, is that you don't have to run it at that. You can run it at 1080p, you can run it in 720p. And because the pixel density is so high, you don't get the same kind of really awful interpolation that we used to get way back in the day when we tried to run non-native resolutions. To be clear, it's still not gonna look as sharp as it would if it was at native res, but it's a lot less bad. If that kinda makes sense. So here's the OneXplayer AMD, 821 grams, AyaNeo Next, 717. So this is definitely a hands on the table kinda gaming device. The additional size though, makes it feel like it's balanced, it's a balanced heavy, not like a super dense heavy. For now, these black bars are a good opportunity to look for backlight bleed. Obviously, this isn't a darkened room or anything like that, but if it was nearly as bad as the AyaNeo Pro 2021, it would be noticeable here. And I'd say, yeah, there's a little bit of backlight bleed, but not much. Pretty good show. Definitely appreciating the front-facing speakers compared to a lot of the other handhelds that I've checked out lately. Makes a big difference to the spatiality. Ooh, their vibration motors are getting pretty good too. Okay, so we're managing anywhere from around 50 to 55 FPS, even in these busy areas. Not bad. That is certainly, certainly playable. Let's go through some trees there. I saw a little bit of a stutter there, but, man, are AMD's GPU drivers ever an improvement compared to Xe, from my limited time with them. I mean, just all those years of experience, they show, right? I wanna see if we can manage 1920 by 1200. Let's see how bad this is. Ooh, that's a lot sharper. I don't think this is gonna be... Yeah, okay. If you're already with 30 FPS, that's actually not bad. And remember, this is at medium settings. I would take the lower resolution, personally, but if you're playing this game more for the eye candy of it, then this is definitely more eye candy. Pretty darn quiet. Like here, can you even hear that, Andy? You can hear it? Okay, yeah. I'm liking the dual fan cooling solution for sure. It seems like the one on the right's doing the bulk of the work. I'd be interested to see how the heat pipes are laid out. We will get it opened up. Don't you worry, guys. I do like the cooler display profile that OneXPlayer's using on their units compared to the warmer display profile that Aya's using. Holy crap, this performance though. Wow, in spite of the OneXPlayer AMD having a lower tier processor, it is sitting, looking down the same road in nearly the same spot, getting about 20% more FPS. We're talking 45 versus 55 FPS right now, sitting here in this same spot pretty much. That's flipping crazy. I guess extra cooling's a good thing, right? Hold on, let me make sure I'm in the right performance. Lemon power saving. Okay, that was close. (Jono laughs) And the AyaNeo Next is out ahead of it by three FPS. Okay. Yeah, it's just out, maybe like two FPS out ahead. Not much, but it is out ahead now. Now we could run some more games, but I think you guys wanna see what makes it tick. iFixit wants you to help join the right to repair movement. They make it easy to prepare your own devices by following their step-by-step guides, to replace integrated batteries and get more life out of the stuff that you own. Check out how iFix can help you repair your devices at the link in the video description. They've got over three thousand guides, they've got their ASP tools, with lifetime warranties, all that good stuff. Yeah, iFixit. Oh, by the way, since we're back here, now is as good a time as any to talk about this sweet kickstand. Clearly OneX, whoop! Clearly, OneXPlayer noticed that this thing's a bit of a chunk, so they put a nice little kickstand on the back. So you can adjust it at any angle you want. Boom! You're ready to game, boys. Wait, was that a Nintendo trademark? Please, Nintendo, be nice to me. - [Jono] I thought it was a- - Aah! Well, there's the ribbon cable for our power button and touch, wow, this is a, holy bananas, that is a big battery, okay. Well, there may not be a performance advantage compared to the AyaNeo Next, but that battery is flipping huge. And I would expect that to be an advantage. That is a 58.9. It's nearly a 59 watt hour battery. That is, that's like over 25% bigger. I would expect a solid, anywhere from a half an hour to 40 minutes to even up to another hour of battery life out of this guy. There's our front-facing speakers. This looks like our vibration motors right here on these little, like, foam dampers. Definitely a little less clean on the internals and way more work to swap up the SSD. There's a one terabyte SSD in here, but with the AyaNeo Next, I've actually upgraded it to an eight terabyte SSD, 'cause it's super easy to get at once you're inside. A little bit more involved, but it is definitely something that could be done. You just have to pull off these fans. And then presumably, this buddy right here, which has the heat pipe running over it as well. I don't think it's happening today, but this does give us a good look at the mechanism for the trigger buttons here. Oh, and the specs. I know the RAM wasn't on the spec sheet, but it's 16 gigs, Jono. It's on this little label inside. (Jono laughs) - [Jono] Nice. - We'll check what frequency it runs at when we put it back together here. I do like how easily the back cover comes off of this one compared to the Mini, which I also opened up and had these like double-sided tape tabs that I had to pull off the top and the bottoms. So this is really nice. They both have this cool button. So the bring-up-the-desktop button now. On the OneXPlayer, it's this guy right... Hello? At least I thought it was. Man, I'm super confused now. Yeah. See, this one does it. I gotta assume that that's just a temporary nonsense thing. There's no way that that's not gonna work. So the other buttons we have here are the turbo button, which is gonna run our CPU in its highest performance profile, obviously on a device like this. That means the GPU as well. And this keyboard button, which seems to have the long press configured to... Okay, yeah, now I'm like super confused. (chuckles) I don't know what that's supposed to do right now. Okay, now my controls are all over the place. What is this right analog stick doing? Oh! Oh it does have a built-in joystick to mouse thing. I've just activated it, through a long press, maybe? (Jono laughs) Yes! I think a long press activates that. Okay, well that's actually, maybe pretty cool, I guess. Okay. Oh, yeah. Oh, there we go. Oh, that's sick. I love the size of this screen. Like seriously, man, are you seeing this? You know what's another thing that's really nice? I can really feel it. This display, great input lag. Like, even though I'm running it only 40 to 50 FPS right now, it just feels really responsive, like really good. Whops. Whoops, whoops, whoops. Wait, is this shoulder? Oh no, I broke this trigger. I wanna put it back together. I didn't put it back in right. Ah, shoot. Okay, well, we'll have to fix that later. Okay, what's the memory running at? 4266, so same as the AyaNeo Next and the last Gen products for that matter. In a nutshell, performance is similar, but it's gonna come down to what kind of a form factor you want. Do you want the large 8.4 inch display? Do you want the compact seven inch display with of course the associated challenges that come with both of them? One of the things that's actually been kind of annoying for me, I've been playing through Final Fantasy Tactics on this thing, and getting at the select button, eh, it's kind of risk breaking actually. That's not a problem that you'd have on a device like this, where they're both easily accessible. But, I think this would dig into your palm a little bit more and obviously it weighs considerably more, about a hundred grams or like a fifth of a pound, for our Yankee friends. Both of them are freaking cool and both of them are way more expensive than the Steam Deck. Although the difference is that these actually exist, and the Steam Deck, unless you've already ordered it many months ago, is not gonna be shipping to you anytime soon. So how desperate are you to play your PC games on a handheld device at freaking anywhere from 30 to 60 FPS, depending on how demanding it is? Well, that's gonna determine whether you pull the trigger on something like one of these or wait a little bit longer, 'cause we're expecting the performance of the Steam Deck to be as good or better because of its RDNA 2 graphics. Although CPU performance is actually going to be worse than either of these 'cause they both have Zen 3 cores and Steam Deck is using Zen 2. You know what I want? I want the hardware of the AyaNeo Next with the more like the lower profile shape of the original Neo. The ergonomics are definitely better in some ways on the Next, but I also find them a little bit more challenging in other ways. But the hardware, man. Between these two though, boy am I ever torn? The full desktop-size joysticks on the Neo Next, really nice. Definitely like the easier access to start and select. Like the front-facing speakers. That's a big deal. Like the screen color profile. Ah, I don't know. (crew members laughing) - [Jono] It's like I asked you who's your favorite kid. - I know, right? (crew members laughing) If I'm playing more sightseeing type games, like, if I'm playing like a Tomb Raider or something like that, like adventure games, playing new Psychonauts or whatever, I take this. Better speakers, bigger screen. But if portability is my main concern and I just want that performance in the smallest possible form factor, man, you cannot beat this. This is crazy. I'm gonna stick with the Neo Next. But if my SSD was in here, I wouldn't bother switching it. I think they're both excellent choices. - [Jono] I'll take the OneXPlayer, but you gotta fix the trigger. - I gotta fix the trig, you fix the trigger! I'll take it. I'll take it off your hands. (crew members laughing) This guy! This guy here, he'll take nothing. Subscribe to ShortCircuit.",
    "transcript_keywords": [
        "Steam Deck",
        "thing",
        "AyaNeo",
        "FPS",
        "good",
        "kind",
        "bit",
        "OneXPlayer",
        "yeah",
        "Steam",
        "Deck",
        "pretty",
        "pretty good",
        "display",
        "back",
        "nice",
        "button",
        "performance",
        "OneXPlayer AMD",
        "run"
    ],
    "transcript_entity_values": [
        "Yankee",
        "a half an hour to 40 minutes",
        "59 watt hour",
        "8",
        "USB",
        "fifth",
        "up to another hour",
        "8.4 inch",
        "Mini",
        "Aya",
        "AMD",
        "Final Fantasy Tactics",
        "5700U.",
        "30",
        "Xe",
        "2",
        "today",
        "Next",
        "AyaNeo",
        "FPS",
        "OneXPlayer",
        "Andy",
        "5700U",
        "the AyaNeo Next",
        "first",
        "AMD",
        "58.9",
        "two",
        "55",
        "GPU",
        "Xe",
        "OneXplayer",
        "Ryzen",
        "CPU",
        "eight",
        "three thousand",
        "about a hundred megahertz",
        "SSD",
        "1600",
        "the AyaNeo Pro 2021",
        "ASP",
        "1920",
        "RAM",
        "4266",
        "one",
        "2560",
        "iFixit",
        "Zen 2",
        "Nintendo",
        "the AyaNeo Next",
        "Vega GPU",
        "1200",
        "OneX",
        "45",
        "Steam Deck",
        "1080p",
        "ShortCircuit",
        "about 20%",
        "over one",
        "3",
        "the day",
        "IO",
        "seven inch",
        "Intel",
        "three",
        "One",
        "nearly nine inch",
        "about a hundred grams",
        "night",
        "only 40 to 50",
        "5800U",
        "717",
        "Psychonauts",
        "Jono",
        "Neo",
        "iFix",
        "16",
        "821 grams",
        "25%",
        "the Steam Deck",
        "around 50 to",
        "AyaNeo Next"
    ],
    "transcript_entity_types": [
        "NORP",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.01736769825220108,
        -0.01803419180214405,
        0.06562215089797974,
        -0.061523497104644775,
        0.011909957975149155,
        0.022122027352452278,
        -0.05296405777335167,
        0.006353381555527449,
        -0.03831031918525696,
        0.062316931784152985,
        -0.061581723392009735,
        0.009699282236397266,
        -0.022653456777334213,
        -0.04812672361731529,
        0.023402852937579155,
        0.0032737257424741983,
        0.03858049586415291,
        -0.017563551664352417,
        -0.020921172574162483,
        0.008410084061324596,
        -0.058099668473005295,
        -0.047710828483104706,
        -0.002583753317594528,
        -0.02452278696000576,
        0.04803414270281792,
        -0.056631628423929214,
        0.01706659235060215,
        -0.04125237464904785,
        -0.04671579226851463,
        -0.012571683153510094,
        0.04688294231891632,
        0.023404333740472794,
        0.011996566317975521,
        -0.018602872267365456,
        -0.02673286199569702,
        0.03265838325023651,
        0.04614077880978584,
        -0.13372179865837097,
        -0.1351463347673416,
        -0.06859548389911652,
        0.014560050331056118,
        0.03219642490148544,
        -0.008482965640723705,
        -0.00017283369379583746,
        -0.04396520182490349,
        -0.029377300292253494,
        -0.00792711228132248,
        0.013201932422816753,
        0.05760451778769493,
        0.029994674026966095,
        -0.00759349949657917,
        0.003488110611215234,
        0.05847611278295517,
        -0.086641326546669,
        -0.088526651263237,
        0.06910330802202225,
        0.020774995908141136,
        0.021840455010533333,
        0.022956309840083122,
        -0.0030380000825971365,
        0.05042610317468643,
        -0.07788504660129547,
        0.074299655854702,
        0.05650432035326958,
        0.028270665556192398,
        -0.009445669129490852,
        0.04168523848056793,
        -0.029360540211200714,
        -0.06997648626565933,
        -0.02705766260623932,
        -0.04272182285785675,
        0.055198680609464645,
        0.041753094643354416,
        0.04969492554664612,
        0.011342429555952549,
        0.014493358321487904,
        0.03784480690956116,
        -0.013039587996900082,
        0.009985247626900673,
        0.008312096819281578,
        0.00047945152618922293,
        -0.07424728572368622,
        -0.03925634175539017,
        -0.07675879448652267,
        0.020755840465426445,
        -0.014290649443864822,
        0.05588801950216293,
        0.02411026321351528,
        0.017417723312973976,
        -0.06772878021001816,
        -0.04634609445929527,
        0.07724175602197647,
        0.1221269965171814,
        0.04973853379487991,
        0.0040793945081532,
        -0.004455584101378918,
        0.02304302528500557,
        -0.020259635522961617,
        -0.0629892647266388,
        0.06431547552347183,
        0.012972251512110233,
        0.03718854486942291,
        0.03656046837568283,
        0.019428545609116554,
        -0.11054466664791107,
        -0.030270596966147423,
        0.010112572461366653,
        0.003441789885982871,
        -0.06052050739526749,
        0.0033032752107828856,
        0.0010879887267947197,
        0.002956545678898692,
        -0.03702132776379585,
        -0.009588373824954033,
        0.09678541868925095,
        0.07797060161828995,
        -0.08411496132612228,
        0.03206893429160118,
        0.03531399369239807,
        -0.016635192558169365,
        -0.05036093294620514,
        -0.06332515925168991,
        -0.011205167509615421,
        0.055223386734724045,
        0.03312749043107033,
        0.09584546089172363,
        0.0043721371330320835,
        1.396238781924274e-33,
        -0.051907122135162354,
        0.008738969452679157,
        -0.02052551507949829,
        -0.023226235061883926,
        -0.026381269097328186,
        -0.016276244074106216,
        0.07154624164104462,
        0.006317733321338892,
        -0.07013458013534546,
        -0.03885851427912712,
        -0.005351165775209665,
        0.051808927208185196,
        -0.12560616433620453,
        0.07312865555286407,
        0.0011730729602277279,
        -0.07952263951301575,
        0.02150844782590866,
        0.02285403572022915,
        0.01905996724963188,
        0.025527527555823326,
        0.02035336196422577,
        -0.03586074337363243,
        -0.0475393682718277,
        -0.05385398492217064,
        0.09783703833818436,
        0.02258233353495598,
        -0.008629455231130123,
        0.0049111382104456425,
        0.04656776040792465,
        0.0012395244557410479,
        -0.035342562943696976,
        -0.11793702840805054,
        -0.034137990325689316,
        -0.14385829865932465,
        -0.006637102458626032,
        0.005975882522761822,
        -0.10148748010396957,
        0.03731343895196915,
        -0.021623557433485985,
        0.009701005183160305,
        -0.07664802670478821,
        0.045620113611221313,
        -0.09739463776350021,
        -0.07771962881088257,
        -0.08794824033975601,
        0.01968088559806347,
        0.01278983149677515,
        0.0160053838044405,
        -0.03899560496211052,
        -0.006514060311019421,
        -0.03662479668855667,
        0.03735294193029404,
        -0.07034438103437424,
        -0.07453632354736328,
        -0.028217952698469162,
        -0.13559791445732117,
        0.04875166341662407,
        -0.01779049076139927,
        0.05394452065229416,
        0.09242900460958481,
        0.07428382337093353,
        -0.005723056383430958,
        -0.02802923321723938,
        -0.03958719223737717,
        -0.07705410569906235,
        0.05509403347969055,
        0.10323498398065567,
        0.025562049821019173,
        -0.05453002080321312,
        -0.03868801146745682,
        -0.04051898419857025,
        -0.008381756022572517,
        0.12232115119695663,
        -0.03626393526792526,
        0.029961340129375458,
        0.047233350574970245,
        -0.07802969217300415,
        -0.08392912894487381,
        -0.06289829313755035,
        -0.024273449555039406,
        -0.012230108492076397,
        -0.018932387232780457,
        -0.027679800987243652,
        0.05354313179850578,
        0.03981957957148552,
        0.025093255564570427,
        0.012084043584764004,
        0.017490431666374207,
        -0.043487343937158585,
        0.06063287332653999,
        -0.005289930384606123,
        0.024194521829485893,
        -0.017313379794359207,
        -0.008082196116447449,
        0.017065376043319702,
        -3.36692659207403e-33,
        -0.08296523243188858,
        -0.029859919100999832,
        -0.0810617208480835,
        0.01126631535589695,
        -0.001192471943795681,
        -0.017899075523018837,
        0.04009469226002693,
        0.062307439744472504,
        -0.013385267928242683,
        -0.10037627816200256,
        -0.02762853540480137,
        -0.04288217052817345,
        -0.04827423393726349,
        -0.03835206478834152,
        -0.06074139103293419,
        -0.05666808784008026,
        0.06226250156760216,
        0.003299442818388343,
        0.07655628025531769,
        -0.029348483309149742,
        0.05789961665868759,
        0.0289709884673357,
        0.05656268075108528,
        0.03783860057592392,
        -0.005015532486140728,
        0.006427628453820944,
        0.024278046563267708,
        0.039811957627534866,
        0.011214948259294033,
        -0.0037197053898125887,
        0.07605984061956406,
        0.0028086432721465826,
        0.04462999105453491,
        -0.021604381501674652,
        0.11705072969198227,
        0.002980788704007864,
        0.04226100817322731,
        0.016393529251217842,
        -0.043026745319366455,
        -0.05622916296124458,
        0.05703666806221008,
        0.03208637610077858,
        -0.03521054610610008,
        -0.00031802323064766824,
        0.0693809986114502,
        0.025664223358035088,
        -0.09632967412471771,
        -0.04574621096253395,
        0.024199776351451874,
        0.020965322852134705,
        -0.03834417834877968,
        -0.01584646664559841,
        0.08491384983062744,
        -0.0896119475364685,
        -0.005311055574566126,
        -0.07315395772457123,
        -0.025447828695178032,
        -0.003693108446896076,
        -0.032705433666706085,
        0.008354710415005684,
        0.06629549711942673,
        0.010354951024055481,
        -0.06480959802865982,
        -0.0011219180887565017,
        0.03412819653749466,
        -0.004355983342975378,
        0.082414910197258,
        0.0038343691267073154,
        -0.0024311209563165903,
        0.03811473026871681,
        -0.06255993247032166,
        -0.015610205009579659,
        0.04482709988951683,
        -0.025380847975611687,
        -0.006921083200722933,
        0.07548252493143082,
        -0.041373927146196365,
        0.03791819140315056,
        0.054021548479795456,
        -0.03912782296538353,
        -0.034012969583272934,
        0.034417301416397095,
        0.07096899300813675,
        -0.027701620012521744,
        0.0615265890955925,
        -0.005652416031807661,
        0.10927730053663254,
        -0.043203115463256836,
        0.04349419102072716,
        -0.04316503182053566,
        0.005443495232611895,
        0.08562833070755005,
        -0.06599300354719162,
        0.0012865145690739155,
        0.06098133325576782,
        -5.797636504212278e-08,
        -0.041416797786951065,
        0.01014798041433096,
        0.040103308856487274,
        0.020399872213602066,
        -0.013924489729106426,
        -0.05461276322603226,
        0.024779366329312325,
        -0.04296879470348358,
        0.0906868651509285,
        -0.07306640595197678,
        -0.021771954372525215,
        -0.060701631009578705,
        0.028424985706806183,
        -0.0015556116122752428,
        0.0526784285902977,
        -0.028910575434565544,
        -0.015958119183778763,
        0.057761333882808685,
        -0.011316044256091118,
        -0.009973703883588314,
        -0.041720546782016754,
        0.028234796598553658,
        0.0864701122045517,
        -0.11105520278215408,
        0.03913307934999466,
        -0.013433581218123436,
        0.05362161621451378,
        -0.007294766139239073,
        0.16203445196151733,
        -0.07268880307674408,
        -0.10155162215232849,
        -0.0654664859175682,
        -0.020229315385222435,
        -0.057120636105537415,
        0.07176581025123596,
        -0.01885923556983471,
        -0.028796378523111343,
        0.12343110144138336,
        0.04074345529079437,
        0.029960228130221367,
        -0.060518912971019745,
        -0.01107791904360056,
        0.014204515144228935,
        -0.02653808332979679,
        0.032282035797834396,
        -0.015428966842591763,
        -0.02019362710416317,
        -0.05976302549242973,
        0.0404755100607872,
        0.02349945157766342,
        -0.03191813454031944,
        0.014898884110152721,
        -0.02360532246530056,
        -0.04005353897809982,
        0.06822772324085236,
        -0.043161313980817795,
        -0.05795079097151756,
        0.11936533451080322,
        -0.03477003797888756,
        0.03812335804104805,
        0.019169237464666367,
        -0.10363934934139252,
        -0.062218111008405685,
        0.11205915361642838
    ]
}