{
    "id": "Ljnn0TI1uu0",
    "title": "New Head Of YouTube Neal Mohan Spills the tea! The algorithm, product changes, dislikes and more!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-03-08T22:20:30Z",
    "video_url": "https://www.youtube.com/watch?v=Ljnn0TI1uu0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 49832,
    "likes": 1928,
    "comments_count": 384,
    "description": "Check out Neal Mohan's letter here!    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://blog.youtube/inside-youtube/2023-letter-from-neal/",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) - Hi Neil, welcome to my channel. - Hi Justine. It's great to be with you. Thank you very much for making the time. - I'm so excited to chat with you. And before we get started, do you want to introduce yourself to my audience so they can get to know you a little big better? - Sure, yeah, so my name's Neil Mohan. I'm the new leader of YouTube, after my longtime friend and mentor, Susan Wojcicki announced that she was stepping back. I think it's been a whirlwind, I think about a week ago or maybe a little bit longer, but very new to my brand new role heading up YouTube. But I have been at YouTube for a very long time. I've been at YouTube now for seven years. And some of your audience might know me as the guy who was responsible for all of our products and user design, and also our trust and safety and content policies. And so, I've been very familiar, of course, with all the products that all of our creators use, all of our viewers enjoy on a regular basis. Before YouTube, I was at Google for a very long time. I was responsible for a lot of our ad products here. And my career has really been building tools and ad products and things like that for content creators, whether on YouTube, across the internet, etc. And just a very kind of anecdote that very few people knew about but was something I mentioned in the letter that I sent out yesterday to the YouTube community is, I've been working with YouTube before either I or YouTube were part of Google. I remember visiting YouTube when it was, you know, a startup above a pizza parlor in downtown San Mateo, where the company was started, and just remembering, like, how crazy fast this company was growing. And all the feedback I was getting from founders at the time was like, can my products keep up with the growth of YouTube, etc.? And then fast forward a decade and a half later, this incredible creator economy that exists, people like you, creators, business people, etc., experiencing enormous success on our platform. And so that's a little bit about my background and my involvement with YouTube. - Yeah, I mean, it's wild. And I think, you know, Susan has obviously done so much for Google and for YouTube, so we're definitely gonna miss her. But I know she has promised us that we're in good hands. So I'm so excited to talk to you more about kind of your plans and things like that. But it really is wild to think about. I mean, I've been on YouTube for almost 17 years, maybe longer than that. I guess a lot of creators, and of course, me included, are wondering how do you think YouTube will change or how will it look under your leadership? So what would you say to them? - You know, I'll start off with what I think is not gonna change. And Susan and I, had the privilege of working with her almost every day for 15 years. And so, a lot of what I think creators in our community can expect is a lot of continuity, particularly in one area, which was very important to Susan and is gonna be my top priority, which is spending time with creators and building products and services that are about making our creators successful on YouTube. As you know, through your own experience, creators are the lifeblood of YouTube. All of the viewers, all of the fans come to the YouTube product every day because they want to engage with you, they wanna interact with you. One thing I will say that obviously I should acknowledge is that the environment that we're in, the macroeconomic environment, you know, some of the uncertainty in the world, I do think that those are things that manifest in our creators' business in terms of how they think about their presence on our platform. And so paying particular attention to that to make sure that we come out of this uncertain times even stronger and really write the next chapter of YouTube, which I'm extremely, extremely optimistic about. - Yeah, it's super exciting. And I mean, your letter was pretty extensive and it covered so much. So do you wanna kind of give us just a quick little overview of everything that you mentioned? - I mean, I think that the way I try to organize it in sort of the way that I think about it in my own head is really kind of three buckets. And the first bucket and where I started the letter on purpose is a lot of what I just said, which is about supporting creators. And so, you have seen some of the work that we've done over the last few months in terms of revamping our monetization program, bringing monetization to Shorts, the expansion of our YPP to include a fan-funding tier, and on and on. And so just really focusing on helping our creators build businesses on our platform, finding ways to better support their businesses. So that can be everything from, you know, ad supported, to channel memberships, to super chat, to all of those types of opportunities that we're working on. That is one area of priority for me. That was sort of the first bucket. Other things like, you know, multi-track audio, being able to extend audiences as both audience growth opportunities, but also business opportunities fell into that bucket. So that's the first area that's a priority for me and I wanted to call that out. The second, of course, is making sure that YouTube is set up for the future, that we're investing in, our background has been at the, try to be at the cutting edge of innovation, and I wanna continue that forward. And so, you know, a couple examples in that bucket are making it so that the living room screen, the large screen that people have in their homes, television screen, what have you, which is our largest and fastest-growing screen, is one that we continue to invest in. And so what that means is bringing the magic of YouTube that all of our viewers know and enjoy when they pick up their mobile phones to that living room screen. And so interactivity, for example, being able to connect with their favorite creators on that screen, bringing the Shorts experience to that screen, but also investing in new ways of creation. So I think you know this, like, the line between sort of creation and consumption is a blurry line. So making sure that we have the right set of creative tools, investing in our camera effects and things like that. And then also supporting all formats when it comes to creation. And so one of the areas I'm very excited about this year where we have a lot in store is podcasts. I know that's something that's important to you, but also to lots of other creators. And so how do we make it work seamlessly in studio from a tool standpoint? How do we bring, you know, distribution to podcast content by bringing it to the YouTube Music app and things like that. And then finally, kind of what underpins the third bucket of course, that underpins the first two buckets is we're a global platform, continuing to live up to our responsibility to keep our entire community of viewers, creators, partners safe, but also making sure it's an enjoyable experience by investing in things like policies, enforcement of those policies to do the right thing for our creators. And so that's the third bucket. And so I wanted to highlight all three of those as areas of priority for me and where the company is gonna invest in in 2023. - Something that you also didn't really bring up, but I feel like everyone is talking about is AI. Now, obviously, I know Google has been talking about Bard and all the things that they're doing as well. So how do you see AI kind of changing the way that YouTube operates as a whole? - So the first thing that I'll say about that, and you're right, there is a lot of talk in the industry about it. We read about it, we watch videos about it every single day. It's been an area that, frankly, at YouTube, we've been investing in for years. And I'll just give you some examples. I mean, you open up the app, you see the home feed, there's recommendations in that home feed. I finish watching one of your videos, I'm recommended a bunch of videos right below that on the watch page. That is a product of AI, that's us investing very heavily in machine learning algorithms, deep learning to make it so those recommendations get better and better and better, which obviously helps our creators, but also makes YouTube, YouTube for our viewers. And so that's been going on for years. I mentioned responsibility, all the work that we do to make sure that we are dealing with anything that might be harming our creators or our viewers, whether it's abuse or scams or other sorts of deceptive practices. I think the area that I would, you know, kind of build on there is a lot of what's being talked about in terms of generative AI, right? You can imagine the tools that I was describing around creation getting augmented through this technology. And so everything from being able to change your outfit on the fly or your hair color on the fly or what the background is, puts you in a different drop, fix pixelation in a video, remove something that is distracting from the background in the video that you're working with, on and on and on, so that our creators can focus on the actual creative part of the process and let the magic of AI take care of the rest. And it's in the term, generative AI. We are in the business of helping content creation be, you know, content be generated on our platform, and that is where you should expect YouTube to be focused in terms of our investments going into the rest of 2023, but actually more importantly, for years to come. - Yeah, and I think now kind of that buzzword that's being tossed around AI is mostly thinking about generative art, you know, ChatGPT, like, these sorts of things. But, like, people sometimes don't even realize that the algorithm and the recommendation engine, all of that stuff is also AI. So I'm glad you kind of brought that up because I feel like there is some misconception of what is this AI machine, like, what does it do? I know personally, I'm waiting for an AI generated thumbnail designer because I've been making thumbnails for 17 years and for some reason I just can't give up that. - Or I think, you know, in that example, it might be that the first place where AI can really help there is to augment that creative process, 'cause that is part of your process, that's, like, part of the product that you're putting out there for your audience. But if there's things that AI can do to make that process more seamless and efficient so that you can focus on the creative aspect of the thumbnail, that would be a win for my team as well. And so it's about potentially generating the full thumbnail, but it's also about actually giving you tools to make it easier for you to go about doing what you've already been doing. - Right, even things like, you know, changing titles or descriptions or helping kind of assist with that. I mean, 'cause I feel like you get so exhausted after you're done with this whole content procedure, you're like, oh my gosh, I need a title. I mean, we're at this weird kind of point where I feel like I always trust everything that AI says as the full truth. So I've definitely had AI write me a script, and I'm like, wait a minute, you're making this up. Like, this is not actually anything that's true. So like, is there anything that YouTube has been doing to kind of help kind of stop these false narratives? - It's a really interesting question, and I think it's gonna be one where that story is gonna continue to evolve, frankly, as the technology starts to get out there in more and more products. It is front and center in the conversation today. And all I can say about that is we have invested very heavily in recognizing that what happens on YouTube impacts the real world and vice versa. And what that means is really living up to our responsibility to be a platform that isn't, you know, spreading harmful misinformation or what have you. Our community guidelines, the way that we enforce them, all that will continue to apply. The scale will certainly change. And so we need to remain vigilant in that regard, and that's something that the teams at YouTube have on their radar that we're gonna continue to make sure we are staying ahead of. The other thing that I'll say, which your question brings up is how these technologies are actually brought to market in terms of products. And so I think that that's an area too where I think we have to be responsible actors, and so one of the ways that we think about incorporating generative AI into, say, our creation tools is to look at things through that lens. Could they be misappropriated in a certain way, abused in a certain way? And so, being very responsible and thoughtful about how we bring these tools to the market, to our creators, to our viewers, etc., is another important part, I think, of the product development process. - Yeah, that's all really great, and I'm just glad that you guys are kind of forward-thinking because obviously, you guys are such a huge marketplace. So I feel like kind of setting that as a standard is very important for the industry. As a long-form content creator, Schwartz has just come in and kind of taken everybody by storm, and it's a whole different way of, I feel like, creating content because I love making vertical videos. At first, you know, back when everyone started doing it, I was like, oh, I'm not really sure if I'm into this. Like, let's flip our cameras around. I remember, like, yelling at my parents, like, no, don't film vertical. And now I'm like, you have to film vertical. I'm like, please switch it. I guess as a long-form content creator. Is there anything that we should be concerned about? Like, are you guys gonna still be supporting long-form or kind of moving more towards Shorts? - Yeah, I mean, I'll just say it straight for me and just so that you and your audience hear it, you know, long-form, and, you know, it's funny that we use a long-form term 'cause that was the original short-form when you started back in the day and so. - Right? - So that's been core to YouTube, will remain core to YouTube, not just this year, but for many years to come. What is interesting about short-form is that it is something that augments the long-form experience on YouTube, both for creators and our viewers. It's not just even between short-form and long-form. I like to talk about it in terms of true multi-format capabilities. And so, whether it's something that you wanna share with your audience that's 15 seconds long or 15 minutes long or a 15-hour live stream you wanna do, YouTube should be the place that you can do that and build an audience around that and build a business around that. You can add to that, not just live and long-form content and Shorts, but also audio content. I mentioned podcasts earlier. Whatever way you wanna express yourself as a creator and connect with your audience, YouTube should be the place that allows you to do that. We're gonna continue to invest in that, both in terms of creator tools, but also in terms of audiences discovering that. But that is meant to be part of this broad multi-format journey as opposed to something that is short versus long. - Yeah, I love it because I do feel like, even before I would feel like I would unbox something that I could have probably done in a minute, but I would stretch that out until 10 minutes long, and I'm like, that did not need to be a 10-minute video. Like, I could have just done this in, like, 15 to, like, 35 seconds. So I love kind of having that other avenue to be able to just create different types of content that might not otherwise fit my normal pipeline. - And I think the interesting thing there is that you should be able to connect your audience across these formats too, right? There's sort of a path that your audience can take. If they're consuming Shorts, then they can continue to consume Shorts, but they can also move Shorts to your longer form, from Shorts to your longer-form videos or what have you. As somebody who has invested in long-form for such a long time and, you know, you obviously produce a lot of short-form content too, you're great at it. How do you think about the distinction between those two types of content? Do you think about them differently vis-a-vis your audience or topics, or kinda how do you think about that as you go about your week? - Yeah, I mean, I'm still kind of trying to figure it out, as I think everyone is, but what I've loved about kind of this vertical content is it kind of reminds me of the early days of YouTube when I first started making content. It's almost like I can be more myself. Like, I could just be sillier in, like, this little 15 to, like, a minute bite-size chunks. It's kind of reinvigorated sort of my content creation, 'cause I don't have to sometimes feel like I have to be so serious. Like, I have to sit down, have a script, have a plan, and talk for 10 minutes. Like, I can just show you my dog, I can show you my day, or I can give you a one-minute breakdown of a new piece of tech. You really can do anything. And I think that's why I'm so excited about the future of it. - And do you feel like your audience sort of picks up on that vibe very quickly? Like, they know, that's their expectation with your Shorts content versus your long-form? - I think the problem with my channel is they never know what they're gonna get. So I guess it's pretty on brand that they're like, oh, today she is at the premiere for \"Mandalorian,\" and tomorrow, I don't know, she's giving her dog a bath. So it's definitely on brand for my channel, and I think that's why I've just really loved it 'cause it is just, like I said, it's another way to kind of just create. - Yeah, no, that makes a ton of sense. Yeah, and it's an area that we're gonna continue to invest in, kinda tying back to your AI question, that is where you can see a lot of the innovation showing up in that camera, right? Like, you hit the plus button, you should be able to give a prompt that allows you to change the background or your outfit or what have you, and then kind of building from there. - Yeah, so is there anything that we can look forward to? I mean, especially, like, being able to change the thumbnail, like, that's definitely high on my wishlist. - Yeah, that's a good question. And so, that's feedback that we've gotten on Shorts. And one of the reasons we didn't start there immediately or it didn't occur to us to start there immediately is because of the consumption modality of Shorts, right? Like, you're consuming it in a feed-like autoplay type of an environment as you see in the Shorts player, and that's where most of the Shorts views tend to come from. But we have gotten a lot of the feedback. I'm excited about is that we're working, we're having a capability, both on Android and iOS, where you'll be able to pick the frame from your short and make that the thumbnail, which is obviously a very natural way to have the thumbnail for Shorts. We have also gotten feedback from creators about having parody between Shorts thumbnails and, you know, what you just described, Justine, in terms of what you do for long-form thumbnails. It's a conversation that we're having. I think there, just to kind of call it out, it's a bit trickier because part of the Shorts is kind of what you just said, right? Like, you can be more natural yourself, it's less sort of prepared. And if we introduce an element that, like, that you have to do above and beyond after having produced a short, that sort of becomes like this whole other thing that gets added onto what otherwise would've taken a minute or two, then I think it sort of defeats the purpose of that short-form content in the first place. And so, that's a little bit of the trade off we're looking at, especially if thumbnails sort of become this competitive thing, just like they are on long-form, on Shorts, and we don't want that, we don't wanna create that additional burden for short-form creators. But I guess I'm curious, how do you think about that? Do you think that having the ability to actually pick the frame that you would like as your custom frame thumbnail for Shorts kind of sufficiently moves in that direction? - I mean, I like it. I definitely think, like, on the go, I would do that, but then there's just something about going to my channel, and then aesthetically, like, having, like, a curated thumbnail, even if it's something that you don't see in the short speed, it would just be like a presentation, kind of like your channel as a package, as a whole. Like okay, all of your thumbnails line up. You can do it, like, today or, like, a week from now. So it's not something I feel like you would have to do immediately, but I definitely think in the near term having, just being able to choose that frame I think is super helpful. - That's an interesting way of sort of splitting those two things. So obviously, to get the short up and running, being able to pick within the frame so that you don't have that post-production type burden kind of piece. But then potentially being able to come back to it because these Shorts do live on and that are consumed, you know, in future days and weeks kind of a thing. So yeah, that's the way we're prioritizing it is, let's give creators the ability to pick that frame on both platforms as quickly as possible. But we are talking about that longer-term piece that you brought up as well. So that's really interesting feedback. - Yeah, I think that's great. But I'm super hyped on Shorts. But also another thing is monetization, obviously, that's top of mind for almost all creators. And it's been kind of a controversial topic recently with a lot of channels getting demonetized with a lot of the new policy changes. So what can you say to those who have been affected by this, and what can we do moving forward to ensure that our content is still monetizable? - It's a good question, and as I said, you know, in kind of my introduction up front, like, my entire career has been really focused on helping creators and content creators produce to generate revenue, building ads products, building monetization products. It's something that's near and dear to my heart. I know what you're referencing, and I'll come to your specific question, but just to give a broader context, we do make policy changes in terms of our monetization policies from time to time. And really the purpose and spirit behind those, including the change I think you're alluding to that happened back in, I think it was November now, is really about increasing monetization for our creators, making it so that the pathway from advertiser demand to creator monetization is a smoother one, allows more content to be monetized at higher rates. And that was really the spirit of the change that we announced around profanity and things like that in the videos. Since then, we've heard the feedback, my teams have heard the feedback loud and clear, and hopefully you'll be happy to hear that we're taking that feedback into account and figuring out ways that we can potentially incorporate that feedback. I don't have anything specific to say there today, but stay tuned 'cause that feedback has been heard. The spirit of that change and any policy change we make on monetization is to really improve monetization for our creators. And so, I want to take into account that feedback that I've gotten from creators, be true to that original spirit of actually creating a policy that drives more dollars to our creators' videos. - Yeah, and I think that's the hard part, you know, as a creator who has been, has very clean content pretty much my entire existence, you know, I've never had to worry about that, but it is hard, especially for those who have been creating other types, but also if I were to be an advertiser, like, I understand because I wouldn't wanna be advertising my brand over, you know, that type of content. So I think sometimes creators also have to think of it as an advertiser, you know? So I think there are certain advertisers that would want to, so it's a very fine line. So I'm glad that you guys are, you know, working on that and addressing it, because I mean, there's so many creators out there with so many different types of content that it's really hard to kind of pick and choose who can advertise on what. - Yeah, and actually, your insight is precisely right. Like, and so if you think about it, you know, putting yourself in the shoes of the advertiser, given all that amazing choice that exists on YouTube, which is kind of the magic of YouTube, you have to make it so that it feels to the advertiser, not just safe, but relatively clear in terms of where they're advertising is gonna run, to your point, because, you know, they don't want to inadvertently damage their brand in any particular way. And so, our policies are really oriented towards that. When I say increase creator monetization, one of the best ways to increase creator monetization is to make advertisers more comfortable with the content, and that is the goal of our policy changes. And so, but the feedback's been received, and so stay tuned. - So something else, some feedback, speaking of, I'm sure you don't wanna talk about it as I'm sure you've been hearing about it nonstop, but the dislikes. So how have you seen removing dislikes improve the platform, and what metrics can we now use instead to see if people actually like our videos? - I think what might be most useful to your audience is actually giving you a little bit of color in terms of how we went about making those types of product decisions. And that's actually how my team operates on all sorts of decisions we make, and really, it's about making sure that we're doing the right thing for the entire community by balancing creators, and viewers, and partners, and what have you. And in this particular case, it was really about protecting our creators, and as we dug, in terms of had the conversations, got a lot of feedback from creators, and we got a lot of feedback, even before we rolled this out, as you can imagine. Because what we wanted to do was set up the right sorts of tests and experiments to understand whether the product change we were designing was gonna accomplish what we wanted to. And what we wanted to accomplish was to protect creators from, you know, dislike bombing, those sort of coordinated attacks that would happen that eventually would start to become a form of harassment. And it was our theory going into it anecdotally that creators that came from underrepresented communities, creators that were smaller in nature were disproportionately harmed by that type of action. And you can imagine, just as you know from where YouTube started, protecting those creators is a core part of what YouTube is. That is why there is so much diversity of content and ideas and the like on YouTube. And so we ran the tests, we ran the experiments, and we saw a few things. The first is that when you remove the count, the incentive for someone to dislike is lower. So that's point number one. That seems kind of intuitive, but that came across in the testing. The second is that actually, it was true, that creators that were of that smaller-in-nature underrepresented communities were disproportionately subject to those types of dislike attacks. And then the third piece, which is impact on our viewers didn't actually show up in terms of any change to the relative distribution of views and watch time on videos. So it wasn't used as a signal in that particular way, at least in terms of what our data showed. And so that gave us the conviction to remove it. Now it's been about a year. We've gone back and looked at the data, and what I can tell you is that those things that we were seeing in the experiment ended up being roughly true, both in terms of creator impact, sort of the positive impact in terms of protecting creators from those types of dislike attacks, but also in terms of negligible impact on viewers. For that reason, I feel like not only did we go about the decision in the right way, and I recognize it's always a trade off, especially for something that has been part of YouTube for so long, but I also think that the data a year later has borne out some of the original thesis behind why we made that change. And so I appreciate the question, and I know it's something that pops up in the community, but I wanted to address it thoroughly because we have looked at this pretty closely. - Yeah, I mean, it's great that you do have that data to back it up. I think it's just hard for a lot of creators because, you know, people have been on the platform for so long and it's such a drastic change. I think it was definitely hard for a lot of people to kind of still understand, like, why would you do this? But I mean, I think it is comforting to know that you guys do have the data to back that up. So that is great to hear. In that same vein, is comment spam, I mean, I have done so many giveaways, I've been giving away phones, I've been giving away cash on Telegram, like, all of this stuff. It's comical because these comments are so bad that the fact that people still fall for them is kind of disheartening, that that's where people think I would be doing my giveaways. What are you guys doing to kind of combat this, and what can creators do to protect their audiences from this type of behavior? - We have a really robust investment from a trust and safety standpoint in terms of going after these bad actors. I think the latest numbers I saw was we terminated on the order of over 5 million channels that were in this area. And so we have a pretty robust enforcement regime, but we're also thinking about it from a product design standpoint. So let me give you a few examples. One of the changes that I know you're aware of that we made was you can no longer hide the subscriber count on your channel, right? Because that was an abuse vector, an impersonation vector. We have invested very heavily in creator tools, moderation obviously. Back to the artificial intelligent machine learning conversation, that is an example of where we have to make the right trade offs in terms of making sure that comments are not being over-held, but also making sure that it's a useful tool for creators. And so we're always tuning that algorithm, and we just introduced a new control which allows creators, if they so choose to, to pick a stricter standard for comments being held in review. So that's been something that I think creators have found to be a valuable tool, and then creators can make a choice in terms of how much they wanna be reviewing comments on their channel. We just introduced a change, I think a little while back, in terms of minimizing special characters, repetitive characters, things like that, which was another vector that people use to create channels that would lead to comment abuse. And so those are some of the product changes above and beyond all the work that we do on the trust and safety side there. But I'm curious, I know you're part of some of the betas. How's your experience been? How's it been playing out on your channel? - Yeah, I was just gonna say, I have been a part of the beta for a couple of months and it's been significantly so much better. Like, it's actually kind of shocking. Like, I can go in and I barely see any at all. So whatever kind of secret sauce or magic stuff you guys are doing behind the scenes, it definitely seems like it's working. So as a trusted tester, it's been working out pretty well. So I think one of the things that we always hear is so much talk about the algorithm, and I know there's a ton of stress with a lot of creators about chasing views and engagement. So what can you tell us about the algorithm? - Replace the word algorithm with audience. What I mean by that is the algorithm is a personalization algorithm that is meant to reflect the interests of your audience. That is what I would ask creators to really, really think about, and focus on what they're passionate about for that audience. And that is what's gonna result in the best possible content. And it is really the best possible content, that is what gets recommended over time and the like. And so it's really about truly understanding the audience. And we are investing in that in terms of giving tools to creators. So the audience insight cards, for example, in Studio. You can try to understand the interests of your audience, what other type of content they're watching. But, you know, you asked me the question. I think you would actually be able to answer that question better than, certainly better than I would. So what would be the things that you would call out, given your 17 years of experience? - No, I love that 'cause I sometimes like blaming the algorithm when I know it's a me problem. I'm like, but I wanna make this type of content, but I know that's not really what my audience wants to see. So I kind of play this fine line between, what do I think they want and how can I kind of integrate what I wanna do? So like, I used to love to vlog, but it seemed like my audience wasn't enjoying that anymore. So I kind of now wrap a vlog inside of, like, a tech review. So I'll go out and test something and go on a little adventure. So it's just kind of changing your outlook on, like, the type of content that you're creating, and just know that you can't be creating the same type of thing thing all the time. Like, you do have to evolve. And I think that's one of the questions people always ask me is like, how have you done this for so long? And I'm like, well, I just haven't quit. I mean, that's fine line, like, that's the real answer, because I've had the ups and the downs, and then you just kind of figure out something new. And I think that's why YouTube is so fun because a lot of us have that ability to, if we wanna make a feature film tomorrow, like, we can do that and it's just so great that you guys are giving us that ability and that freedom to do so. - Yeah, that's such an awesome answer, and I think that's what inspires all of us at YouTube to do what we do because, like, your whole journey is, like, what gets us super fired up, and the fact that you get to do the type of content that you love, find a way for your audience to connect with it is just, like, it's just so awesome to hear. - So one of the priorities from last year's letter is you were talking about NFTs. Now, is that still a focus? Also, just to say, I'm actually an NFT fan. I love the technology, I love the future thinking, the possibilities that really lie in this tech. And I think if it's done correctly, it can be super powerful. - I think the technology is really interesting as well. And I do think that there's probably lots of interesting future possibilities. A lot of what we're focused on this year is, you know, short-form creation, mobile tool, mobile creation, etc. And so it's a less of a priority for 2023 for us. You know, creators shouldn't expect anything around NFT capabilities on their channels this year, and that's really driven by where our creator's interests are and where their priorities are. - Yeah, definitely, sometimes can be quite negative, and it's always really sad because I can see the possibilities, and I've seen so many incredible projects come out of the NFT space, but I've also seen the downside, the scams and things like that. So it's like, you have to be very careful that when you guys do do it, it's gonna be right. So I feel like just knowing that it's in there somewhere is pretty exciting for me. One last question before I let you go. Like, having been on YouTube for so long, I know we keep talking about this, there's so many things, like little secrets that I'll be like, oh my goodness, I didn't even know that we could do this now. There's things like shopping, the channel subscriptions, and so many more. Like, how do you see all of these features kind of working together to help creators? - The common thread in everything that we've invested in, especially a lot of these features that you've described, has been really about helping our creators grow. That's fundamentally what it's about. So you mentioned, you know, channel memberships, that is a great way for creators to really connect with their most engaged fans. And notice, I said connect, I didn't say, you know, monetize, because the monetization piece of course is part of it growing their businesses, but it's fundamentally about connecting, right? Giving them access to the backstage, exclusive content, maybe an exclusive livestream. Shopping is another example where you have a lot of content like this yourself with your tech reviews. Lots of people come to YouTube, they will consume your content, and they will go down a purchase journey or consideration journey around a particular product, whether it's a laptop or a headphone or what have you, a means for you to connect with your audience, but also have a business opportunity there is the way that we think about shopping. And, you know, obviously, I talked about expanding our fan funding tier, right? So that you can get started generating revenue even before you're big enough for advertisers to be interested through things like Super Thanks, etc. So all of these are about making sure that we have ways for creators to grow regardless of where they are on their journey. They might start with a really small, you know, Shorts channel or long-form channel, and they might only monetize through Super Thanks. We just brought Super Thanks to Shorts, for example. But then they grow bigger and then they can turn, you know, they are part of the ads program, they can generate revenue from ads, they can drive shopping demand, or they move from there to live streaming. And that could be about Super Chat or Super Stickers or channel memberships. And so, it's really about having a basket of capabilities and features, not about creators using every single one of them, but using the right ones for where they are in their business today. And so that's how I think about. - That's awesome. Well, thank you so much. I'm so glad I got a chance to chat with you, and congrats again on the new role. Super exciting. - Thanks, Justine. I appreciated the conversation and look forward to seeing you in person. Thanks so much. Bye. - Bye now. (upbeat music)",
    "transcript_keywords": [
        "creators",
        "kind",
        "YouTube",
        "Shorts",
        "content",
        "things",
        "terms",
        "lot",
        "audience",
        "creator",
        "yeah",
        "longform content creator",
        "make",
        "thing",
        "making",
        "change",
        "super",
        "feedback",
        "channel",
        "sort"
    ],
    "transcript_entity_values": [
        "every day",
        "every single day",
        "the early days",
        "a couple of months",
        "a minute",
        "about a year",
        "a week from now",
        "second",
        "10 minutes",
        "Super Stickers",
        "one",
        "Neil Mohan",
        "many years",
        "Shorts",
        "10-minute",
        "a year later",
        "Schwartz",
        "Justine",
        "YouTube",
        "seven years",
        "one-minute",
        "15 seconds",
        "years",
        "NFT",
        "three",
        "Bard",
        "the day",
        "a ton",
        "future days",
        "YouTube",
        "YPP",
        "Google",
        "November",
        "Telegram",
        "a decade and a half later",
        "last year's",
        "15 minutes",
        "15-hour",
        "15 years",
        "17 years",
        "35 seconds",
        "today",
        "this year",
        "third",
        "San Mateo",
        "about a week ago",
        "two",
        "2023",
        "YouTube",
        "2023",
        "almost 17 years",
        "the last few months",
        "AI",
        "15",
        "weeks",
        "over 5 million",
        "Super Chat",
        "Android and iOS",
        "first",
        "tomorrow",
        "Neil",
        "Susan",
        "Mandalorian",
        "yesterday",
        "Susan Wojcicki",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "TIME",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "ORDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.08920583128929138,
        -0.0629630759358406,
        -0.024306392297148705,
        -0.14174939692020416,
        0.05050335079431534,
        0.03749563544988632,
        0.07402192801237106,
        0.01834275759756565,
        -0.04742230102419853,
        0.04172088950872421,
        -0.00764499744400382,
        0.010621406137943268,
        -0.021733922883868217,
        0.04610278829932213,
        0.004930261522531509,
        0.020594187080860138,
        0.029836731031537056,
        -0.03509669378399849,
        -0.024999331682920456,
        -0.03310292214155197,
        -0.059171296656131744,
        -0.0015886829933151603,
        0.04073746129870415,
        -0.002976695541292429,
        0.01760002039372921,
        0.12264550477266312,
        -0.023819994181394577,
        -0.0029732482507824898,
        -0.07050387561321259,
        -0.09325769543647766,
        -0.008977844379842281,
        0.02015756256878376,
        0.0773734599351883,
        -0.008956801146268845,
        -0.05411965027451515,
        -0.05725694075226784,
        -0.00817722175270319,
        0.03545824810862541,
        -0.01844577118754387,
        -0.015481123700737953,
        0.02300732024013996,
        -0.036590781062841415,
        -0.021183691918849945,
        -0.030719952657818794,
        -0.030232487246394157,
        -0.05174463242292404,
        -0.04505985230207443,
        -0.03462352976202965,
        0.06879933178424835,
        0.05381498485803604,
        -0.13914844393730164,
        -0.07885294407606125,
        0.047230690717697144,
        0.00046620643115602434,
        -0.09633318334817886,
        -0.04543914273381233,
        -0.0297551192343235,
        0.04004495590925217,
        -0.003788720816373825,
        -0.008577362634241581,
        0.007588626816868782,
        -0.06572739779949188,
        -0.03800568729639053,
        0.06407773494720459,
        -0.0025713215582072735,
        -0.06886465102434158,
        -0.04910511150956154,
        -0.0014995785895735025,
        -0.019855711609125137,
        0.06777017563581467,
        -0.07145708799362183,
        0.06585180014371872,
        -0.03833524137735367,
        -0.00475826021283865,
        -0.050560373812913895,
        0.00675980793312192,
        0.011138681322336197,
        -0.047841668128967285,
        -0.027931276708841324,
        0.03353535756468773,
        0.07200229912996292,
        -0.06793402880430222,
        -0.042817823588848114,
        0.011653590016067028,
        0.007574876304715872,
        0.04208257421851158,
        0.01449460070580244,
        -0.02091243676841259,
        -0.050606079399585724,
        -0.06383505463600159,
        -0.07883049547672272,
        0.04576227068901062,
        0.016017213463783264,
        0.03117820993065834,
        -0.024232611060142517,
        -0.03446240723133087,
        -0.022129205986857414,
        -0.009577949531376362,
        -0.031810276210308075,
        0.12578244507312775,
        0.0026657073758542538,
        -0.07054096460342407,
        -0.0070235407911241055,
        -0.07031269371509552,
        -0.03931253403425217,
        -0.10128630697727203,
        -0.02085237205028534,
        0.032409679144620895,
        0.036112528294324875,
        -0.022601163014769554,
        -0.030187390744686127,
        0.05835350230336189,
        -0.04637155309319496,
        -0.03626161068677902,
        -0.010650687851011753,
        0.08203984051942825,
        -0.05565366521477699,
        0.06453412771224976,
        0.0026834767777472734,
        0.017637627199292183,
        -0.008802731521427631,
        -0.012834095396101475,
        0.01526910625398159,
        0.015010696835815907,
        0.010799804702401161,
        0.03144524246454239,
        -0.06476079672574997,
        1.0586460981203243e-32,
        -0.03177417814731598,
        0.044939201325178146,
        0.006093039643019438,
        0.013874175027012825,
        -0.007148364093154669,
        -0.0013569500297307968,
        -0.021339176222682,
        0.05754382908344269,
        -0.023648323491215706,
        0.009446851909160614,
        0.005832976661622524,
        0.01934133470058441,
        -0.05234142020344734,
        0.046284206211566925,
        0.054180681705474854,
        -0.06711383163928986,
        -0.02738368883728981,
        -0.009331763722002506,
        -0.047137755900621414,
        -0.03745026886463165,
        0.05403730645775795,
        -0.006174252834171057,
        -0.012042301706969738,
        0.0652838870882988,
        0.035358741879463196,
        0.1121060848236084,
        0.06527328491210938,
        0.003176119877025485,
        0.08662117272615433,
        0.04456306993961334,
        -0.09463954716920853,
        0.02041424624621868,
        -0.06345122307538986,
        -0.10201533138751984,
        -0.018414178863167763,
        3.666326665552333e-05,
        -0.07155518233776093,
        -0.01787903718650341,
        -0.009851091541349888,
        -0.023727774620056152,
        -0.008501139469444752,
        0.05330846458673477,
        -0.09299709647893906,
        -0.03077143244445324,
        0.00044597426312975585,
        0.07476070523262024,
        0.015869855880737305,
        0.11280938982963562,
        -0.006701153703033924,
        0.04217706248164177,
        -0.019424570724368095,
        0.014511913992464542,
        0.005122485104948282,
        0.03502795472741127,
        -0.026234101504087448,
        -0.034774892032146454,
        0.0016614118358120322,
        0.03172650560736656,
        0.08955835551023483,
        0.025148509070277214,
        0.04236168786883354,
        0.03179145231842995,
        -0.010551812127232552,
        -0.03763042390346527,
        -0.05186159163713455,
        0.06632909178733826,
        0.08156323432922363,
        -0.049479927867650986,
        0.05726135894656181,
        0.060716357082128525,
        0.014084892347455025,
        -0.008469577878713608,
        0.03726174682378769,
        0.02731897495687008,
        0.028895625844597816,
        0.0020954380743205547,
        -0.06440061330795288,
        -0.04152553528547287,
        0.0315115824341774,
        -0.035149961709976196,
        -0.09752191603183746,
        0.10275247693061829,
        0.034004729241132736,
        0.023972472175955772,
        -0.02475305087864399,
        -0.09697825461626053,
        0.031953152269124985,
        -0.02480448968708515,
        -0.06525501608848572,
        0.06702090054750443,
        -0.002344030188396573,
        0.10456389933824539,
        -0.044920917600393295,
        -0.04740256443619728,
        -0.017301395535469055,
        -1.0949444820529534e-32,
        0.0004742101300507784,
        0.04328937828540802,
        -0.017677070572972298,
        0.004449683241546154,
        0.051991306245326996,
        -0.04212656244635582,
        0.04387756437063217,
        0.08073479682207108,
        0.10304046422243118,
        -0.03699389845132828,
        0.045901402831077576,
        -0.03868187963962555,
        -0.119446761906147,
        0.01419968530535698,
        -0.024500111117959023,
        -0.04802190139889717,
        -0.03291957825422287,
        -0.04114595055580139,
        0.05362905561923981,
        -0.023787248879671097,
        0.07409494370222092,
        0.13678696751594543,
        0.04151463508605957,
        0.02216999977827072,
        0.00437437929213047,
        -0.013516436330974102,
        -0.005179387982934713,
        0.0779896229505539,
        0.041461292654275894,
        0.05238844454288483,
        -0.05647564306855202,
        -0.05254025012254715,
        -0.09682054817676544,
        -0.005156714469194412,
        0.0400492288172245,
        0.06379975378513336,
        0.008514592424035072,
        0.0215789582580328,
        0.006736281793564558,
        -0.036809541285037994,
        0.038723595440387726,
        0.015259931795299053,
        0.005500034894794226,
        -0.0214889794588089,
        0.05212889984250069,
        -0.11877129971981049,
        -0.09067822247743607,
        0.006757037714123726,
        -0.05823443830013275,
        -0.01784653402864933,
        -0.04725682735443115,
        -0.015028955414891243,
        -0.026068514212965965,
        -0.04451867565512657,
        -0.014004385098814964,
        -0.007420117035508156,
        -0.04984230920672417,
        -0.044592369347810745,
        0.012359579093754292,
        0.001563055906444788,
        0.022921772673726082,
        -0.06121712177991867,
        -0.08182590454816818,
        -0.05680384486913681,
        -0.009750971570611,
        -0.03250138461589813,
        0.09197934716939926,
        0.010964487679302692,
        0.03389253094792366,
        -0.013741889037191868,
        -0.025560270994901657,
        -0.034207187592983246,
        0.033701203763484955,
        0.022090891376137733,
        0.009501009248197079,
        0.02381928265094757,
        -0.10994147509336472,
        0.0706389993429184,
        0.0575973317027092,
        -0.05295978859066963,
        -0.01740606501698494,
        -0.0026078899390995502,
        0.014237547293305397,
        0.07345936447381973,
        0.12061190605163574,
        0.08034766465425491,
        0.07442954927682877,
        -0.05760324001312256,
        -0.037874285131692886,
        0.12388526648283005,
        0.0466255322098732,
        0.04958392679691315,
        0.05276965722441673,
        0.1649165153503418,
        -0.044189658015966415,
        -6.29920577921439e-08,
        0.015645524486899376,
        -0.02987474389374256,
        0.01152596715837717,
        0.04801812022924423,
        0.054701562970876694,
        -0.06982460618019104,
        -0.05351507291197777,
        0.036988914012908936,
        0.05684509500861168,
        -0.06387694180011749,
        0.07504425197839737,
        0.01717979460954666,
        -0.012735758908092976,
        0.16909177601337433,
        0.011111450381577015,
        0.010066519491374493,
        -0.05397910252213478,
        0.09424100071191788,
        -0.06503057479858398,
        -0.062372032552957535,
        -0.035204771906137466,
        0.07694770395755768,
        0.061172179877758026,
        -0.05067402869462967,
        0.04240908473730087,
        -0.014415476471185684,
        -0.00917411781847477,
        -0.0018969362135976553,
        0.00869052018970251,
        -0.025179550051689148,
        -0.07427121698856354,
        0.03240957111120224,
        -0.024845203384757042,
        -0.02204017899930477,
        -0.029332231730222702,
        -0.0651000365614891,
        -0.06929708272218704,
        -0.0037733917124569416,
        0.01143960002809763,
        -0.012027280405163765,
        -0.04302165284752846,
        -0.11128467321395874,
        -0.0024136255960911512,
        0.01982729323208332,
        0.016817821189761162,
        -0.01942896656692028,
        0.036741599440574646,
        -0.08824845403432846,
        -0.0262779388576746,
        -0.04264390468597412,
        -0.027037546038627625,
        0.044801563024520874,
        0.04808994010090828,
        -0.021957719698548317,
        0.10260015726089478,
        0.002109028398990631,
        0.02015799656510353,
        0.04047982394695282,
        -0.05470798537135124,
        -0.05152919888496399,
        0.029704580083489418,
        0.005008711479604244,
        -0.020282717421650887,
        0.028035897761583328
    ]
}