{
    "id": "LmcWMjBpYBU",
    "title": "Be gentle with the Apple Vision Pro - ITS PLASTIC!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-02-06T00:54:02Z",
    "video_url": "https://www.youtube.com/watch?v=LmcWMjBpYBU",
    "category": "Howto & Style",
    "tags": [
        "Apple Vision Pro",
        "Vision Pro",
        "Virtual Reality",
        "VR",
        "AR",
        "Apple",
        "iphone",
        "Technology",
        "Apple vision",
        "apple glasses",
        "Apple vr",
        "apple headset",
        "Vision Pro durability"
    ],
    "views": 6732812,
    "likes": 236077,
    "comments_count": 12464,
    "description": "Turns out Apples new Apple Vision Pro has a plastic exterior AND interior lenses. Check out Anker MagGo, the ultrafast magnetic charging lineup HERE: Amazon:  and on Anker.com:  I was SUPER excited to test out the Apple Vision Pro myself... the experience is literally otherworldly. But here on this world we still have the laws of physics, and durability to content with. And the Apple Vision Pro's exterior screen is with a permanent plastic layer on the outside.  The interior lenses of the Apple Vision Pro - are also made form plastic.",
    "description_links": [
        "https://ankerfast.club/qGJjsh",
        "https://shop.anker.com/0dGjWv"
    ],
    "transcript": "The Apple Vision Pro. Not going to lie, when this was first announced, I thought Apple had lost their collective minds and that this headset was going to be the biggest flop in the history of tech. But then I tried it. And as a diehard Android user and a PC consumer, the Apple Vision Pro rocked my socks. I used it for a total of about 2 hours, knowing that eventually the time would come to, you know, do what I do. And I'll leave this software reviewing to the likes of iJustine or MKBHD, I'm just here to talk about the build quality, hardware, and durability. I will say, however, that the first time I stood up while wearing it, I subconsciously ducked to avoid hitting one of the virtual displays hanging in front of me. And if that's not an indicator of how real this thing almost feels, I'm not sure what is. Right out of the box, the Apple Vision Pro comes with a protective sock for the supposedly glass lens on the front. There's a magnetically detachable light shield, and I'm going to be honest again, the best piece of construction on this Vision Pro is the solo-knit headband strap. Apple says this thing is made from 70% recycled yarn, but holy smokes if this thing isn't the softest, most cuddliest piece of fabric I've ever felt in my whole life. Feels like it's been knitted with the love of a thousand grandmas. There's a little snowboard binding style tightener on the side, which fits the vibe since these already look like snowboarding goggles. The solo-knit band is detachable with a tiny orange pull tab and seems sturdy enough all by itself. There are cameras splattered all over the front, inside, and on the bottom of the Vision Pro with very large fan vents built into the frame to cool down the internal hardware. After all, the Apple Vision Pro boils down to being just a computer for your face. We'll see all of its hardware glory in just a few seconds. The proprietary twist lock power cable is fine. There's no way a USB-C or lightning cable would have been able to handle a moving user like this thing is able to. And I have plenty more thoughts on the battery, but we'll also get to that in just a second. Let's commence with the scratch test. Now this thing is a whopping $3,500 and it feels solid and good in the hand. I fully expected this front surface to be made from glass, especially after watching some other reviewers. But as we work our way up the Mohs scale of hardness, we start seeing scratches at a level 3 with deeper grooves at a level 4. I was so shocked I had to go back and check again. Level 2 seems to be unaffected, but wow. I first thought to myself, don't worry Jerry, you just got bamboozled by a screen protector. But there is no screen protector. This scratched plastic is permanently attached to the unit. Apple's calling this laminated glass on their website, but when I read that I thought the laminate would be in the middle or underside, like on a windshield, not on top where it can get permanently scuffed up. Any keys, coins, or metal object that comes in contact with the Apple Vision Pro will leave a permanent, unrepairable mark. Yeah, Apple does sell AppleCare for $500, but even with that AppleCare, the cover glass replacements the word glass is doing a lot of heavy lifting here cost $300 additional. That's a total of $800 to replace the front glass, which is also conveniently what the cracked cover glass replacements would have cost if you didn't buy AppleCare at all. I'm not super good at math. Someone can double check my work there. But AppleCare doesn't seem like all that great of a deal on the Apple Vision Pro. Now don't get me wrong, being laminated is absolutely phenomenal when it comes to drops. The glass is far less likely to shatter with the laminate being on the outside. Plastic will absorb most impacts without the glass shattering. But plastic on the outside means it will scratch easier. And if those scratches appear on top of one of the mini cameras or sensors around the outside, it's going to really mess up your world view, literally, figuratively, and economically. The sock that comes with the Vision Pro best to be on at all times. Or Apple needs to start selling an easily replaceable screen protector. Also, I would highly recommend against smoking anything or standing near a campfire while wearing the Vision Pro for obvious reasons. The silver anodized metal body of the Apple Vision Pro is milled from one solid piece of aluminum. Extremely impressive actually. The deeper my own team gets into manufacturing wheelchairs, the more I appreciate what other companies are able to accomplish. And this Apple Vision Pro body is truly a work of art. The lower cameras are covered with glass. The front facing units are obviously covered with soft scratchable plastic, so definitely keep an eye out for that. The buttons of course are also made from metal. And continuing onward with the scratchable theme, scratches on the exterior might not affect the viewing experience, but scratches on the interior most definitely will. I cannot stress how important it is to not clean or wipe the interior plastic lenses of the Apple Vision Pro with paper towels, tissues, or napkins, since all of these paper products have wood fibers that will completely and permanently absolutely wreck the plastic lenses. I wore glasses for about a decade, so I know firsthand. You should only use soft cloths to clean the inner lenses since they can scratch very easily. The rubbery flexible ear speakers are pretty nifty, quite enough to fire directly down into your ears, but loud enough to also be heard by nearby neighbors. The housing is made from metal, but seems durable enough so far. The interior of the Apple Vision Pro with its lightsill removed is kind of a fluffy, stretchy, black cloth thing with a slightly translucent rubber underliner. The rubber is probably there to help keep moisture, makeup, sweat, and tears of loneliness from entering into the motorized internals, which we'll see more of in just a second. There are no visible screws on the outside, which is fine. Personally I kind of like the industrial look of visible screws like on the Apple Watch Ultra, but I'm also totally fine with finding them on my own. I was really good at those Where's Waldo books as a kid. And yeah, it did look a little bit better with the cloth in place. Even with it gone, we still don't see any screws. So quick little bend test to see if that might be the quickest way inside. But the sheer girth of the aluminum frame makes any flex impossible. There's no movement when bent from the front or the back. Thumbs up for that. So it looks like we have to actually find those screws if we want to see what's powering this thing and what the internal and external displays look like from the inside. I thought that maybe I could heat up the exterior laminated glass and pop it off that way, but my first attempt only damaged the laminate more. Instead I found that there is a removable black plastic shield on the inside hiding some of the inner workings with a lot of T5 and T4 screws in really weird places. This comes as a shock to no one, but the Apple Vision Pro is not designed to be repaired. With a plethora of screws removed, the lens mechanism can lift up and away from the frame to reveal dual turbo fans, very similar to what we see inside of a MacBook. And this thing does look incredibly awesome from the inside. The lenses can automatically motorize left and right, measuring interpupillary distances between 51 millimeters all the way to 75 millimeters. The near instant functionality of this thing is exquisite. I do have some thoughts on accessibility improvements, but we'll get to that later. Every screw in here is different and there are about 4 or 5 different types of screws. Repairability is again an afterthought. With the plastic lenses gone, we can dig even deeper to find the inner screen. Apple says there are 23 million pixels inside the Vision Pro, micro OLED pixels to be exact, all of which are jam-packed into two rectangles, one for each eye. These rectangles are about 32 millimeters wide and 27 millimeters tall. Don't let its small size fool you though. The experience of visiting the moon in these things is otherworldly, and I really am a fan of the Vision Pro. Not enough to actually go back to an iPhone, not at least until they have scheduled text messages, but I am still a fan. And speaking of fans, again, we find ourselves with no more visible screws from this side of the Vision Pro, not even under the carbon fiber looking structure in the middle. Apple's making this teardown difficult, but that's okay. I enjoy a challenge. And it'll give us another opportunity to enter in from the screen. Especially now that I know this is the only way left to get inside, I can be a bit more aggressive. We still need to find the outer screen and the processing hardware. And finally, with some heat and some razor accurate penetration, thanks to my jerry-rig knife, I'm able to slice around the exterior of the Apple Vision Pro and remove that top laminated glass layer. Hard to believe that Apple charges $800 for this procedure when my razor knife only costs $15. But alright. There you have it. The Apple Vision Pro's 3 dimensionally formed laminated cover glass removed in one piece. Wild that this piece of glass alone costs more than some iPhones. A question I get quite a lot is why I don't continue my Mohs hardness scratch test all the way up to level 9. Well, let me show you. The grand canyon level grooves left by a level 9 pick compromise the glass enough to shatter it out of existence. But at least now we know that there really is glass underneath all that plastic. Screws still somehow manage to elude us, but don't worry, my patience is immeasurable. Turns out there is another black plastic layer on this side containing some sort of filter for the RoboCop style front display screen. Turns out the reason why this screen is displaying people's eyes so uniquely is because it's a lenticular lens, a ribbed display which produces the illusion of depth by having a holographic effect. It definitely produces a memorable visual animation, that's for sure. And it's under this lenticular display that we finally see the hardware. Buckled down with a smorgasbord of screws and ribbon cables, the front facing camera array comes off as one complete unit. Not surprising since so many of the cameras and LiDAR sensors have to be perfectly positioned so they can all work in unison with that new R1 chip. And I learned the hard way, there is a copious amount of thermal paste on Apple's circuit boards. Joined together by a flexible hinge over the nose, there are dual boards, one in front of each eye. And they both use a metal plate directly attached to the backside of the turbo fans for cooling. With the thermal paste removed, we see the glorious M2 chip and the phenomenal R1 chip. The R1 chip is what takes all the inputs from the cameras, microphones, sensors, and within 12 milliseconds creates a nearly lag free real time view of the world around you inside the mask. Since as we have clearly seen, the Vision Pro itself is not transparent. The world is digitally recreated for the viewer inside of the headset on the screens that we ripped out earlier. I feel like the Vision Pro is the first generation of something really special. It does feel weird to say, but seeing Apple branch out for the first time in a decade and try something new is really exciting. I do wish Apple could make it slightly more accessible though to people with physical impairments. Maybe instead of making the click a fingertip tap, for people without finger function there could be an option for a wrist twist, which could be the click, or a double blink which would make the Vision Pro more usable for high spinal cord injuries. Accessibility is pretty important, and the Vision Pro is nearly there already. The whole Vision Pro contraption of course is powered by a rather small external battery pack. And at first glance, the 3,166 milliamp hour capacity seems rather small. But the real number to look at though is the watt hour, since the voltage of this battery pack is far higher than the voltage of a normal cell phone battery. The 35.9 watt hours of this battery bank should last for about 2 hours. Unfortunately, the proprietary plug to the battery though makes expanding battery life impossible. The plug is removable with a SIM card tool and looks like a lightning plug, but can't be used anywhere else. Enter my channel sponsor, Anker. With their Anker MagGo 10,000 milliamp hour power bank can almost double the run time of the Apple Vision Pro, or almost completely charge up an iPhone 15 Pro twice, and can charge them both up at the same time, since there's a USB-C output and a wireless charging pad. Links are down in the description of course. The smaller power bank is articulatable and can magnetically display an iPhone wireless charging. Anker's been exceptionally busy this year. All of these Anker MagGo chargers are fully compatible with Apple's MagSafe, and can charge just as fast as the original chargers that didn't come in the box. And last but not least is the Anker MagGo portable wireless charging station that can charge an iPhone, AirPods, and Apple Watch all at the same time. The Apple Watch gets a 47% charge in just 30 minutes. We can't have your virtual reality ending early due to lack of battery juice. Anker can portably keep you in the Oasis for longer. Link is down in the description. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Apple Vision Pro",
        "Vision Pro",
        "Apple Vision",
        "Apple",
        "Pro",
        "Vision",
        "Vision Pro rocked",
        "Vision Pro body",
        "Vision Pro boils",
        "Vision Pro contraption",
        "Apple Watch",
        "glass",
        "Apple Watch Ultra",
        "front",
        "screws",
        "plastic",
        "inside",
        "thing",
        "screen",
        "battery"
    ],
    "transcript_entity_values": [
        "RoboCop",
        "Anker",
        "3,500",
        "Anker MagGo",
        "AppleCare",
        "iPhone",
        "47%",
        "9",
        "Oasis",
        "M2",
        "just 30 minutes",
        "T5",
        "the Apple Vision Pro",
        "12 milliseconds",
        "a decade",
        "15",
        "power bank",
        "a thousand",
        "MagSafe",
        "two",
        "The Apple Vision Pro",
        "15",
        "the watt hour",
        "T4",
        "about 2 hours",
        "Jerry",
        "800",
        "Where",
        "this Vision Pro",
        "Waldo",
        "300",
        "about a decade",
        "between 51 millimeters",
        "4",
        "just a few seconds",
        "75 millimeters",
        "this year",
        "5",
        "the Apple Watch Ultra",
        "Apple",
        "the Vision Pro",
        "The Apple Vision Pro's",
        "iPhones",
        "iJustine",
        "3,166",
        "first",
        "second",
        "500",
        "35.9 watt hours",
        "27 millimeters",
        "the Vision Pro",
        "Anker MagGo",
        "70%",
        "Android",
        "23 million",
        "3",
        "AirPods",
        "about 4",
        "The Apple Watch",
        "Apple Watch",
        "Vision Pro",
        "MacBook",
        "the Vision Pro",
        "about 32 millimeters",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "TIME",
        "PERSON",
        "MONEY",
        "GPE",
        "FAC",
        "PERSON",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "FAC",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.09946730732917786,
        -0.009035376831889153,
        0.08255750685930252,
        -0.03098282217979431,
        0.08031817525625229,
        -0.1025049164891243,
        0.12544803321361542,
        0.04460754990577698,
        -0.045269470661878586,
        0.02286875620484352,
        0.01975616253912449,
        -0.052580639719963074,
        0.002487262710928917,
        0.030393879860639572,
        -0.003978312481194735,
        -0.017433835193514824,
        0.011732264421880245,
        -0.045511394739151,
        0.00599856348708272,
        0.10052681714296341,
        0.040516018867492676,
        -0.05878520756959915,
        0.05850132182240486,
        0.00016045421943999827,
        0.02161380462348461,
        0.1040160059928894,
        0.10180404037237167,
        -0.05161658301949501,
        -0.057259298861026764,
        -0.0903850868344307,
        -0.012458283454179764,
        0.04449746385216713,
        -0.043629441410303116,
        0.03721852973103523,
        0.04253140464425087,
        -0.022607460618019104,
        0.007965040393173695,
        -0.00042810969171114266,
        -0.08879010379314423,
        -0.10699235647916794,
        -0.0764065608382225,
        -0.014138343743979931,
        -0.034871604293584824,
        0.022809280082583427,
        0.04538745805621147,
        0.00695696659386158,
        0.1055428683757782,
        -0.05143754184246063,
        0.008835803717374802,
        -0.023773839697241783,
        -0.044401444494724274,
        -0.050144344568252563,
        0.06040950119495392,
        -0.05511011928319931,
        0.03008788824081421,
        0.07695510983467102,
        0.03420329466462135,
        -0.02773222327232361,
        -0.005898153409361839,
        -0.002961958758533001,
        0.08442584425210953,
        -0.051883917301893234,
        0.025923870503902435,
        0.041340332478284836,
        -0.019267618656158447,
        0.027245404198765755,
        -0.017938517034053802,
        -0.021942509338259697,
        0.0649978369474411,
        -0.04780488833785057,
        0.0021829435136169195,
        0.09435413032770157,
        -0.004914974793791771,
        -0.005661586299538612,
        0.03537164255976677,
        -0.013147388584911823,
        0.0661344975233078,
        -0.1118071973323822,
        -0.025552617385983467,
        -0.01980697549879551,
        0.012933210469782352,
        0.08682636171579361,
        -0.015443343669176102,
        -0.030868254601955414,
        0.048282671719789505,
        0.0020858447533100843,
        0.03686952963471413,
        0.038975901901721954,
        -0.0927494615316391,
        0.016287852078676224,
        -0.012533984147012234,
        0.09844111651182175,
        -0.112653449177742,
        -0.09750092029571533,
        0.04201183468103409,
        -0.0486956350505352,
        -0.06267445534467697,
        -0.08583175390958786,
        0.00821522157639265,
        0.027206145226955414,
        0.03188671916723251,
        -0.016558624804019928,
        -0.01932671293616295,
        -0.013738867826759815,
        0.011675299145281315,
        -0.0948915183544159,
        0.014199549332261086,
        -0.012233509682118893,
        -0.009451617486774921,
        0.1431904435157776,
        0.041959140449762344,
        -0.02335538901388645,
        -0.03457168862223625,
        0.03093213401734829,
        -0.0513022355735302,
        0.05808861181139946,
        -0.042765870690345764,
        0.11576332151889801,
        0.11697153747081757,
        0.010709566064178944,
        0.013857654295861721,
        0.01660388894379139,
        -0.013032102026045322,
        -0.07974612712860107,
        -0.0011010038433596492,
        -0.025660457089543343,
        0.011084437370300293,
        1.5062012274914103e-33,
        -0.0013553256867453456,
        0.016141418367624283,
        -0.017926622182130814,
        -0.05009130761027336,
        -0.07370345294475555,
        -0.06651569157838821,
        0.05209188908338547,
        0.07865460962057114,
        0.03643249720335007,
        -0.014988251030445099,
        -0.004961158614605665,
        -0.03265739604830742,
        -0.028926827013492584,
        0.06713886559009552,
        0.0648590549826622,
        -0.09024094045162201,
        -0.04964636266231537,
        0.02706821821630001,
        -0.09503010660409927,
        0.0013904353836551309,
        -0.0399450808763504,
        0.009651169180870056,
        -0.0007883855141699314,
        0.017328061163425446,
        0.01792481355369091,
        0.010625692084431648,
        0.06358831375837326,
        0.042695075273513794,
        0.027488190680742264,
        0.0470961332321167,
        -0.03418901562690735,
        0.0567191056907177,
        -0.010313840582966805,
        0.050971075892448425,
        0.03219294175505638,
        0.06139653921127319,
        -0.040631622076034546,
        -0.04875916242599487,
        0.044328268617391586,
        -0.005253025330603123,
        -0.08527425676584244,
        0.044574011117219925,
        0.07672162353992462,
        -0.002751954598352313,
        0.009055452421307564,
        0.023033205419778824,
        -0.03309255465865135,
        0.026898732408881187,
        -0.1072445884346962,
        -0.026241658255457878,
        -0.0009875159012153745,
        -0.043415628373622894,
        0.005239490419626236,
        -0.06167638301849365,
        -0.05219661071896553,
        -0.013483517803251743,
        -0.015895435586571693,
        -0.04129145294427872,
        0.025523334741592407,
        0.03092457726597786,
        0.014505516737699509,
        0.061185322701931,
        -0.02173411101102829,
        0.04408334940671921,
        -0.06913779675960541,
        0.10736431926488876,
        0.04909772425889969,
        0.056677769869565964,
        -0.10707885771989822,
        0.035859446972608566,
        -0.009693239815533161,
        0.027853455394506454,
        -0.04186248779296875,
        -0.04216714948415756,
        -0.03869486600160599,
        -0.02932097762823105,
        -0.026086414232850075,
        0.015285376459360123,
        -0.01657867431640625,
        0.007701723836362362,
        -0.061078161001205444,
        0.058145612478256226,
        -0.012123648077249527,
        -0.02445596642792225,
        -0.012898238375782967,
        0.04496447741985321,
        0.04405227303504944,
        -0.06487639248371124,
        0.025882359594106674,
        0.012815755791962147,
        0.008604065515100956,
        0.006866146344691515,
        -0.03235793113708496,
        -0.08676066249608994,
        -0.048773426562547684,
        -3.550499136738131e-33,
        0.05304396525025368,
        -0.07325581461191177,
        0.06575952470302582,
        -0.04939691349864006,
        -0.04515675827860832,
        -0.07718206942081451,
        -0.027238667011260986,
        0.10012401640415192,
        0.0018063111929222941,
        -0.06542019546031952,
        -0.007605765480548143,
        0.0789376050233841,
        -0.045953601598739624,
        -0.02838110364973545,
        -0.06459192931652069,
        -0.050002455711364746,
        -0.05484253168106079,
        -0.026482217013835907,
        0.0060499561950564384,
        -0.01213688775897026,
        0.10066556930541992,
        0.11076053231954575,
        -0.007883359678089619,
        0.01659422181546688,
        -0.047404300421476364,
        -0.004699139855802059,
        -0.04349115490913391,
        0.010629345662891865,
        0.03162002190947533,
        0.006293008569628,
        0.02140328660607338,
        -0.028335561975836754,
        -0.0489705465734005,
        0.027416778728365898,
        0.04924040287733078,
        -0.016739238053560257,
        -0.01923629269003868,
        -0.07742168754339218,
        0.014411523006856441,
        -0.05913390591740608,
        -0.04040064662694931,
        0.04181702435016632,
        0.05011993274092674,
        -0.0012946247588843107,
        0.02806178294122219,
        -0.0367320291697979,
        -0.011212333105504513,
        -0.0020271046087145805,
        0.011769711971282959,
        -0.013767007738351822,
        -0.08819364011287689,
        0.00810080673545599,
        -0.05399184674024582,
        -0.03755055367946625,
        -0.05801611766219139,
        0.012651612050831318,
        0.002086181426420808,
        0.008086450397968292,
        -0.0088279340416193,
        -0.0007281893049366772,
        0.06767606735229492,
        -0.0011098722461611032,
        0.0513472817838192,
        -0.024371400475502014,
        -0.03220615163445473,
        0.011829848401248455,
        0.0873815268278122,
        -0.024235999211668968,
        0.06099153682589531,
        0.004623996093869209,
        0.0964173972606659,
        0.0341622568666935,
        -0.085406094789505,
        -0.033814772963523865,
        0.028457175940275192,
        0.0373409129679203,
        0.000821723835542798,
        0.04395068436861038,
        -0.0699220672249794,
        0.05334268882870674,
        0.07345226407051086,
        0.04914238303899765,
        0.01708340458571911,
        0.10963365435600281,
        0.031195104122161865,
        0.03505031764507294,
        0.007873613387346268,
        -0.03405982255935669,
        -0.0759778842329979,
        0.0546334907412529,
        -0.05628959834575653,
        0.04124383628368378,
        -0.050175346434116364,
        0.09248164296150208,
        -0.0785626694560051,
        -5.225242105666439e-08,
        0.0321250818669796,
        0.052796605974435806,
        0.053734105080366135,
        -0.03600266948342323,
        -0.029624173417687416,
        -0.061893563717603683,
        -0.050201013684272766,
        -0.03375408798456192,
        0.07315707951784134,
        -0.07736747711896896,
        -0.03750539571046829,
        -0.01933569461107254,
        -0.06873632222414017,
        0.015083398669958115,
        0.021826133131980896,
        0.09350171685218811,
        -0.05012248829007149,
        0.06806691735982895,
        -0.03237362205982208,
        0.0014554805820807815,
        -0.05554366111755371,
        -0.003510270966216922,
        0.0026650805957615376,
        -0.031277403235435486,
        -0.0543929859995842,
        0.09502606838941574,
        -0.03137444704771042,
        0.004443163517862558,
        0.03017912618815899,
        0.05026058107614517,
        -0.0007658326649107039,
        -0.017626402899622917,
        -0.006055832374840975,
        0.06406701356172562,
        -0.00554859172552824,
        -0.05871301516890526,
        -0.019180504605174065,
        0.018689027056097984,
        0.03972075507044792,
        0.04097304493188858,
        -0.029486902058124542,
        -0.09216491878032684,
        0.012096391059458256,
        0.04193047434091568,
        -0.021401934325695038,
        -0.10712377727031708,
        0.013242668472230434,
        -0.065301313996315,
        -0.09186036139726639,
        0.07912040501832962,
        -0.014143217355012894,
        -0.019609173759818077,
        -0.03916186839342117,
        0.06696071475744247,
        -0.02099454775452614,
        0.052685756236314774,
        0.057005416601896286,
        -0.09819260984659195,
        -0.05011410266160965,
        0.05748901143670082,
        0.04019992798566818,
        -0.053250838071107864,
        0.05982615053653717,
        0.11727268993854523
    ]
}