{
    "id": "LMk1PYowq8M",
    "title": "Apple September 2020 event in 12 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-09-15T18:37:17Z",
    "video_url": "https://www.youtube.com/watch?v=LMk1PYowq8M",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "apple watch 6",
        "apple event",
        "event",
        "apple watch",
        "september event",
        "apple event supercut",
        "supercut",
        "watch 6",
        "ipad 8 gen",
        "ipad 8th gen",
        "ipad 10.2",
        "new ipad air",
        "new ipad",
        "apple ipad",
        "ipad air",
        "apple ipad air",
        "ios 14",
        "ipados 14",
        "ipad os",
        "ipad os 14",
        "tim cook",
        "what to expect",
        "apple family setup",
        "family setup",
        "fitness plus",
        "fitness+",
        "apple fitness plus",
        "apple fitness",
        "fitness",
        "virtual classes",
        "blood oxygen",
        "iPhone",
        "announcements",
        "subscription",
        "apple one",
        "verge",
        "the verge"
    ],
    "views": 1480978,
    "likes": 23159,
    "comments_count": 2565,
    "description": "Apples Time Flies event is over, bringing some new hardware. Apple announced the Apple Watch Series 6 with blood oxygen monitoring and a more affordable Watch SE. The company also unveiled an all-new iPad Air with an edge-to-edge display and an A14 Bionic chip as well as a new eighth-generation iPad. Heres everything from the hour-long event in 12 minutes.  Learn more:   0:00  Intro 0:10  Apple Watch Series 6 1:23  Watch Faces & watch bands 2:48  Family Setup  4:23  Apple Watch SE 5:22  Apple Fitness+  8:27  Apple One 9:10  iPad 8th Generation 10:27  iPad Air 11:26  A14 Bionic processor  Subscribe:  Subscribe to Verge Science:   Read More:  Community guidelines:  Wallpapers from The Verge:  More about our podcasts:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:",
    "description_links": [
        "https://bit.ly/3iyfNDr",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://www.theverge.com/podcasts",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX"
    ],
    "transcript": "- Good morning and welcome. We are so pleased that you can join us today. We've got some really exciting product announcements to share with you. - This is the new Apple Watch Series 6. Series 6 is our most colorful lineup ever. There's a new blue aluminum case. This updated classic gold stainless steel finish. A new gray black stainless steel called graphite. And for the first time a stunning new Apple Watch Product Red. With Apple Watch Series 6, you can measure your blood oxygen right from your wrist. The new health sensor in Series 6 shines red and infrared light onto your wrist and measures the amount of light reflected back. Advanced algorithms use this data to calculate the color of your blood, which indicates the amount of oxygen present. The new blood oxygen app lets you take a measurement in just 15 seconds. And Series 6 also captures periodic background readings and stores them in your Health App. Inside Series 6 is our sixth generation system and package. It includes a high performance dual core processor based on the A13 Bionic in iPhone 11 but optimized for Apple Watch. Series 6 has an even better always on display. Now it's 2 1/2 times brighter outdoors when your wrist is down. Series 6 also features a new always on altimeter that provides continuous elevation throughout the day. The watch face is fundamental to the Apple Watch experience, and we're taking faces further this year. In watchOS 7 we also gave developers new tools to build even more specialized watch faces, so if you're into surfing, there's a watch face for that, with apps like Dawn Patrol to check surf conditions. Or if you're into photography, there's a watch face for that, with apps like Lumi to help you track the sun's position. Or if you're a healthcare provider, there's a watch face for that, with apps like Notable to see your upcoming appointments. Another is interchangeable bands. We're excited to introduce something completely different. The Solo Loop. The Solo Loop is remarkably simple. No clasp, no buckle, no overlapping parts. Just one continuous piece. Made from custom liquid silicone, the Solo Loop is stretchable so you can easily slip it on and off your wrist. It's available in a range of sizes so you can find your most comfortable fit. And it comes in seven fantastic colors. This new band style is so comfortable, we did another version called the Braided Solo Loop. It's made from 100% recycled yarn that's meticulously braided with ultra-thin silicone threads, and it will be available in five colors. We're also offering a new take on the leather band with the new leather link, with no loop back or class of any kind. That's Apple Watch Series 6, the most advanced Apple Watch ever. - Right now, Apple Watch needs to pair with an iPhone, which is something they might not have. This is why we're excited to introduce Family Setup. With Family Setup, you can use your iPhone to pair watches for your children or older members in your household who don't have their own phones, and they will have their own phone number and account. You can specify which contacts your kids can communicate with when using messages and more. And you can set up automatic location notifications. So whether it's grandma's house, school, or basketball practice, you'll get the reassurance your child is exactly where you expect them to be. To help them stay active, kids can now track movements and use all the other great features of activity and workout in a way that works best for them. Kids can create a Memoji with just their watch and share it as stickers and messages or in the new Memoji watch face. Whether they're learning at home or in the classroom, the new school time mode helps kids stay focused with do not disturb, restricted interaction, and this distinctive look which teachers or parents can recognize at a glance. Family Setup requires a cellular model of Apple Watch Series 4 and later and will be available at launch with these carrier partners in these regions around the world, with more coming later this year. - The second thing we're doing to make Apple Watch available to even more people is to create a new model that combines elements of Series 6 design with the most essential features of Apple Watch, all at a more affordable price. We call it Apple Watch SE. Apple Watch SE uses the S5 chip for up to two times faster performance in Series 3. And staying connected is even easier with the cellular models, which allow you to make phone calls and messages and more even without your phone. An Apple Watch SE has the same accelerometer, gyroscope, compass, and altimeter as Series 6. And because it has the latest motion sensors, Apple Watch SE also supports fall detection. With all of these features and more, including the new capabilities in watchOS 7, we think Apple Watch SE will be the perfect watch for many new customers. Apple Watch SE starts at just 279. In addition, we're announcing Apple Card financing for Apple Watch so customers can easily pay across 24 monthly payments. Apple Watch Series 6 with a breakthrough new blood oxygen sensor starts at just 399, and Series 3 continues at its great entry price of just 199. - Introducing Apple Fitness+, a new service for Apple Watch designed to inspire you to get fit and stay fit. With Fitness+, you simply choose the workout you wanna do from the catalog videos on your iPhone, iPad, or Apple TV. And when you start the video, it automatically starts the correct workout in your Apple Watch Workout App, and it sends those metrics in real time right to the screen you're viewing the workout. So you have all of your data on your wrist and on the screen in front of you. When the trainer reminds you to check your heart rate, your numbers get larger, making it easy to see the details you need. When you're in the middle of a tough interval, you see a countdown timer to motivate you to push through every last second. Your activity rings are also right on the screen so you can see how your workout is helping you make progress towards closing your rings for the day. And if you happen to close one of your rings in the middle of your workout, you won't miss the celebration. You'll see it in real time right on the screen. When the workout is over, you get a comprehensive summary. And all of that data captured from your watch's sensors is shown right on the summary screen. Fitness+ is launching with the most popular workout types, so there is something for everyone. Yoga. Cycling. Dance. Treadmill walk and treadmill run. Strength. Core. Hit. Rowing. And even mindful cooldowns. You can do the workouts with any brand of equipment, and many of the workouts require just a set of dumbbells or no equipment at all. Each week, our incredible trainer team will deliver a wide variety of workouts from the Fitness+ studio to help keep you engaged. And if you're also an Apple Music subscriber, it's easy to save the playlist from Fitness+ and then listen to them later in Apple Music, whether you're working out or not. We wanted to make it easy to find all the workouts you love in Apple Fitness+, so they're all located inside the Fitness App on the iPhone, right in the center tab. And you can access the same workouts from the new Fitness App on your iPad and Apple TV. And that's Fitness+. You get 10 different types of studio workouts so there's something for everyone, incredible music built into each workout to keep you moving, and the world's best trainers. All your Fitness+ workout recommendations are powered using on device intelligence. And when using Fitness+, neither calories nor the workouts and trainers you choose will be stored along with your Apple ID. The price is 9.99 per month or just 79.99 for a whole year. And your family will also be able to enjoy Fitness+ for no additional charge. Fitness+ will be available in these countries at launch. The service will be available before the end of the year. And for those purchasing a new Apple Watch, you get Fitness+ free for three months to help make 2021 your fittest and healthiest year ever. - So today I'm excited to introduce Apple One. Apple One gives you and your family all the services you love in one simple plan, starting with the individual plan, which offers the best of entertainment, including Apple Music, Apple TV+, Apple Arcade, plus 50 gigabytes of iCloud. The family plan lets you share all these services with up to five members of your family, plus 200 gigabytes of iCloud. And in countries where available, there's premier, which adds Apple News+, Apple Fitness+, and a massive two terabytes of iCloud. Apple One will be available this fall and it includes 30 days free, so you can try any of the services you don't already have. - Now let's turn our attention to iPad. - The new iPad eighth generation. It's more capable than ever, and it starts with the A12 Bionic. It features a powerful CPU and super fast GPU. Compared to the already fast chip in last year's iPad, it has a 40% faster CPU and delivers a massive two times jump in graphics. They include powerful custom technologies like the Neural Engine for machine learning, which comes to our most popular iPad for the very first time. And of course this new iPad works with one of our most beloved accessories, Apple Pencil. These powerful handwriting and note-taking features join a host of other new features that continue to push what's possible on iPad. And it all runs beautifully on the new iPad eighth generation, with its 10.2-inch retina display, huge performance boost from the A12 Bionic, keyboard and pencil support, great cameras and so much more. And it starts at just 329. And it's just 299 for education customers. Customers can order iPad eighth generation today, and it will be available starting this Friday. - And today we are thrilled to introduce an all new completely redesigned iPad Air. - The all new thin and light enclosure and neuroborder design features a beautiful all-screen display. Each element of iPad Air is meticulously crafted, from the precisely machine top button to the sculpted detail around the camera. And the new iPad Air design comes in five gorgeous colors, including a new rose gold, green, and sky blue finish. The new iPad Air features a larger 10.9-inch liquid retina display with a resolution of 2360 by 1640. And it has advanced display technologies like full lamination, white color, true tone, and an anti-reflective coating that combined deliver an amazing visual experience. So we designed a next generation Touch ID and integrated it right into the top button. It uses a sapphire crystal lens and next generation custom sensor that more efficiently captures the details of a fingerprint. - I'm super excited to tell you about the powerful new chip we've built into the new iPad Air, our latest A series processor, A14 Bionic. A14 Bionic includes a big update to our CPU. 14 also features our newest GPU architecture. So that's the new A14 Bionic. It delivers big performance updates for the CPU and GPU, it makes iPad Air much more powerful for machine learning, and also features the latest ISP for higher quality videos and photos and even faster secure enclave for Touch ID. - Another great feature we're bringing to iPad Air is USB-C. It'll start at 599. It will be available beginning next month. - Thank you all for joining us. (bright music)",
    "transcript_keywords": [
        "Apple Watch Series",
        "Apple Watch",
        "Apple",
        "Watch",
        "Watch Series",
        "Apple Watch Workout",
        "Apple Watch Product",
        "Apple Fitness",
        "Series",
        "make Apple Watch",
        "Fitness",
        "watch face",
        "advanced Apple Watch",
        "iPad Air",
        "Apple Watch experience",
        "Apple Watch designed",
        "Apple Music",
        "Watch Workout App",
        "iPad",
        "Solo Loop"
    ],
    "transcript_entity_values": [
        "iCloud",
        "Each week",
        "A14 Bionic",
        "just 279",
        "just 399",
        "the A13 Bionic",
        "every last second",
        "the day",
        "1640",
        "two terabytes",
        "2360",
        "Series",
        "CPU",
        "Family Setup",
        "7",
        "eighth",
        "6",
        "Apple Watch SE",
        "Bionic",
        "Apple Pencil",
        "Dawn Patrol",
        "this Friday",
        "just 15 seconds",
        "the Neural Engine",
        "299",
        "GPU",
        "Lumi",
        "Family Setup",
        "iPad",
        "Memoji",
        "three months",
        "iCloud",
        "9.99 per month",
        "40%",
        "this year",
        "Series 3",
        "2 1/2",
        "Apple",
        "first",
        "ISP",
        "199",
        "just 79.99",
        "Memoji",
        "10",
        "Apple Card",
        "Apple Arcade",
        "iPad Air",
        "up to five",
        "30 days",
        "Apple News+",
        "100%",
        "Apple Watch Product Red",
        "10.2-inch",
        "next month",
        "An Apple Watch SE",
        "200 gigabytes",
        "second",
        "the Apple Watch",
        "five",
        "later this year",
        "Apple One",
        "329",
        "50 gigabytes",
        "2021",
        "Apple Music",
        "iPad Air",
        "10.9-inch",
        "one",
        "the Braided Solo Loop",
        "up to two",
        "Apple",
        "Touch ID",
        "USB-C.",
        "14",
        "today",
        "the Solo Loop",
        "The Solo Loop",
        "599",
        "S5",
        "monthly",
        "3",
        "the end of the year",
        "Apple TV",
        "two",
        "sixth",
        "Apple Watch Workout App",
        "24",
        "Apple Watch",
        "this fall",
        "iPhone",
        "last year's",
        "seven",
        "Apple Watch Series 6"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "LOC",
        "DATE",
        "GPE",
        "DATE",
        "PERCENT",
        "DATE",
        "EVENT",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.0796157643198967,
        -0.05238717794418335,
        0.05430145189166069,
        -0.015515998005867004,
        0.0882006511092186,
        0.011718341149389744,
        -0.03339826688170433,
        -0.03948299214243889,
        0.03726309537887573,
        -0.03341862931847572,
        -0.03835407271981239,
        0.037067655473947525,
        -0.11273720115423203,
        -0.02160639688372612,
        -0.007923838682472706,
        -0.007916568778455257,
        0.09713193029165268,
        -0.1361483633518219,
        -0.028747152537107468,
        0.020925486460328102,
        -0.03008987009525299,
        -0.03681518882513046,
        0.08344907313585281,
        0.046408168971538544,
        -0.019520733505487442,
        0.020529646426439285,
        0.00833260640501976,
        -0.02026049606502056,
        -0.017201317474246025,
        -0.005575577262789011,
        0.0036783001851290464,
        0.0408959724009037,
        0.046207867562770844,
        0.05006937310099602,
        -0.04177914187312126,
        -0.0690559521317482,
        0.0853864774107933,
        -0.021353933960199356,
        -0.08682570606470108,
        -0.02943682111799717,
        -0.0036763346288353205,
        -0.05122004449367523,
        0.0051305522210896015,
        0.07225467264652252,
        0.031082769855856895,
        -0.006152777932584286,
        -0.0015829381300136447,
        -0.07108750194311142,
        0.05111009627580643,
        0.04151448234915733,
        -0.030126014724373817,
        -0.11648570746183395,
        0.05333773419260979,
        -0.06416493654251099,
        0.010826162993907928,
        -0.001985810464248061,
        -0.06549625843763351,
        -0.03080335631966591,
        0.08486521244049072,
        0.009063094854354858,
        0.04209719970822334,
        -0.08716369420289993,
        -0.015166743658483028,
        0.04619460180401802,
        -0.01966742053627968,
        0.007126258220523596,
        0.00790540874004364,
        0.0434577502310276,
        0.04168752580881119,
        -0.07130826264619827,
        -0.04620831087231636,
        0.013999474234879017,
        0.09441670030355453,
        -0.0055960011668503284,
        -0.004423103760927916,
        0.09799160808324814,
        0.055985309183597565,
        -0.1253201961517334,
        0.009009812958538532,
        -0.061308279633522034,
        -0.016348915174603462,
        -0.06880490481853485,
        -0.02715798281133175,
        0.041426558047533035,
        0.045500509440898895,
        -0.014388367533683777,
        0.022523649036884308,
        0.008522354066371918,
        -0.0959724709391594,
        -0.022030599415302277,
        -0.03519359976053238,
        0.09915528446435928,
        0.01645878329873085,
        -0.04985668882727623,
        -0.010173813439905643,
        0.05864638462662697,
        -0.02570412866771221,
        -0.004910295829176903,
        -0.0017596028046682477,
        0.0207847710698843,
        0.04752049222588539,
        0.045951731503009796,
        0.008942500688135624,
        0.062352169305086136,
        -0.010610931552946568,
        -0.08996415883302689,
        -0.04550991579890251,
        0.030417541041970253,
        0.01284526102244854,
        0.07657281309366226,
        0.04653966799378395,
        0.014240856282413006,
        -0.030402522534132004,
        -0.020725324749946594,
        0.0031157638877630234,
        0.06514666229486465,
        -0.06449390202760696,
        0.06715622544288635,
        0.12741923332214355,
        0.0975499376654625,
        0.06047957390546799,
        0.08009298145771027,
        -0.01872960291802883,
        -0.06883827596902847,
        0.034536778926849365,
        0.01303908135741949,
        -0.006452916190028191,
        6.404351097353034e-33,
        -0.0279734805226326,
        0.039263684302568436,
        -0.034227482974529266,
        0.006421613972634077,
        -0.006255693733692169,
        -0.037588004022836685,
        -0.042259376496076584,
        0.04465808719396591,
        0.001024192781187594,
        0.07296856492757797,
        -0.04945867881178856,
        -0.005743811838328838,
        -0.03275253623723984,
        0.02643369510769844,
        0.057342253625392914,
        -0.16754066944122314,
        -0.005885293707251549,
        -0.03535256162285805,
        -0.04991402104496956,
        -0.003921490628272295,
        -0.04981764778494835,
        -0.07230182737112045,
        -0.04375610128045082,
        -0.020825384184718132,
        -0.021848982200026512,
        0.07800361514091492,
        0.036058131605386734,
        0.026581348851323128,
        0.05698109418153763,
        0.019990863278508186,
        -0.06268507987260818,
        0.037144456058740616,
        -0.0006631631986238062,
        -0.0593976229429245,
        -0.014528253115713596,
        -0.03635925054550171,
        -0.00010118975478690118,
        -0.04837693274021149,
        0.02244889922440052,
        0.005264459177851677,
        -0.05703599378466606,
        0.030717410147190094,
        -0.1244032084941864,
        -0.09145472943782806,
        0.039948489516973495,
        0.03257168084383011,
        0.04033159464597702,
        0.01803172565996647,
        0.07530100643634796,
        -0.0030140543822199106,
        -0.06986416131258011,
        -0.029258258640766144,
        0.05469287186861038,
        -0.07185432314872742,
        0.017139442265033722,
        -0.02038826420903206,
        0.001140853390097618,
        -0.05081024765968323,
        0.04164658486843109,
        0.05591116100549698,
        -0.0056092822924256325,
        0.04449410364031792,
        0.004700399469584227,
        0.03545913100242615,
        -0.10504286736249924,
        0.06934352964162827,
        0.06841160356998444,
        -0.02792809158563614,
        -0.07483971118927002,
        0.05247016251087189,
        -0.02880932204425335,
        0.015667254105210304,
        0.012454410083591938,
        -0.05355585739016533,
        -0.02253900282084942,
        0.035438112914562225,
        0.007191652897745371,
        0.009844680316746235,
        -0.05178821459412575,
        -0.02799057960510254,
        0.03399747610092163,
        0.0012608623364940286,
        0.10997447371482849,
        0.03359617665410042,
        -0.017138710245490074,
        0.018949130550026894,
        -0.03000805713236332,
        -0.012352961115539074,
        -0.03582683578133583,
        -0.04926353320479393,
        0.041086599230766296,
        -0.049945954233407974,
        0.02785130962729454,
        -0.0048315091989934444,
        -0.059268005192279816,
        -7.912476553995443e-33,
        0.03715023025870323,
        -0.018713796511292458,
        -0.02548920549452305,
        -0.07569285482168198,
        0.0628201887011528,
        -0.044155269861221313,
        0.04353105276823044,
        0.08175641298294067,
        0.020901363343000412,
        0.02968706004321575,
        0.04633282497525215,
        0.030210962519049644,
        -0.02048473432660103,
        -0.010472852736711502,
        -0.01992148905992508,
        0.017260685563087463,
        -0.01758170686662197,
        -0.06731845438480377,
        0.04009316861629486,
        0.010477405041456223,
        0.06779030710458755,
        0.0030388080049306154,
        -0.036431752145290375,
        -0.07335745543241501,
        0.0772637203335762,
        0.03789630904793739,
        0.09008876234292984,
        0.04396528750658035,
        0.03343967720866203,
        -0.06070402264595032,
        -0.0817788764834404,
        -0.04070527106523514,
        0.026699652895331383,
        0.08081290870904922,
        0.04973503574728966,
        0.04284099116921425,
        0.07703988999128342,
        -0.060947854071855545,
        -0.060702934861183167,
        -0.010220825672149658,
        0.04501006752252579,
        0.026082975789904594,
        0.016815420240163803,
        0.009927869774401188,
        -0.02323335036635399,
        0.026139121502637863,
        -0.04324053227901459,
        0.10178489983081818,
        -0.08044188469648361,
        -0.04757782071828842,
        -0.026922360062599182,
        0.010243551805615425,
        -0.030688757076859474,
        -0.017452683299779892,
        -0.04850877448916435,
        0.005254675634205341,
        0.03847461938858032,
        -0.026482105255126953,
        -0.049102697521448135,
        0.01915796287357807,
        0.011158771812915802,
        -0.0397777296602726,
        -0.022188670933246613,
        -0.055446650832891464,
        0.016706367954611778,
        0.03718600049614906,
        0.05061075836420059,
        -0.01066377479583025,
        -0.026944387704133987,
        -0.010349716059863567,
        -0.021286388859152794,
        0.004380923695862293,
        -0.1382444202899933,
        -0.14745943248271942,
        -0.012581981718540192,
        0.01394945103675127,
        0.03344652056694031,
        -0.03680684044957161,
        -0.09440439939498901,
        -0.00472573796287179,
        -0.06106506660580635,
        0.05965394526720047,
        0.02784564159810543,
        0.013739414513111115,
        0.10920063406229019,
        0.06765997409820557,
        0.02699330635368824,
        0.04044894501566887,
        -0.026835335418581963,
        0.0724778100848198,
        -0.044686947017908096,
        0.009266069158911705,
        -0.05346500128507614,
        0.0781954824924469,
        -0.0219736285507679,
        -5.711470052460754e-08,
        0.024522121995687485,
        0.013455113396048546,
        0.05252853408455849,
        -0.08246921747922897,
        0.06299808621406555,
        -0.06987053155899048,
        -0.024803442880511284,
        0.008457187563180923,
        0.046066541224718094,
        0.032559964805841446,
        0.02881377562880516,
        -0.06225819140672684,
        -0.034093987196683884,
        0.03834448754787445,
        0.06507791578769684,
        0.004889069590717554,
        -0.1198052167892456,
        0.01687568984925747,
        -0.05350827798247337,
        -0.05437343940138817,
        0.030200432986021042,
        -0.0069110943004488945,
        0.029057737439870834,
        -0.04106781631708145,
        0.015972048044204712,
        0.033073145896196365,
        -0.10461670905351639,
        0.029142174869775772,
        0.04060877487063408,
        0.008893022313714027,
        -0.025969062000513077,
        0.04952072352170944,
        -0.01822238229215145,
        -0.09632119536399841,
        -0.03573451563715935,
        -0.08304642140865326,
        0.0026062054093927145,
        -0.006145720835775137,
        0.05244813859462738,
        0.045989856123924255,
        -0.021594351157546043,
        -0.11181885004043579,
        -0.05044259503483772,
        0.05791863426566124,
        -0.004783847834914923,
        -0.07701816409826279,
        -0.040306948125362396,
        -0.11276362836360931,
        0.029717640951275826,
        0.007648841943591833,
        0.005601482465863228,
        -0.07355784624814987,
        0.014025046490132809,
        0.017504319548606873,
        0.04836421087384224,
        0.03190574795007706,
        0.01419950369745493,
        -0.05546289682388306,
        -0.01312869880348444,
        0.03943362832069397,
        0.1409253180027008,
        -0.08094576001167297,
        -0.036807600408792496,
        0.03561606630682945
    ]
}