{
    "id": "LnskLqLrq18",
    "title": "Microsoft Has LOST Their Minds",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-10-28T18:24:10Z",
    "video_url": "https://www.youtube.com/watch?v=LnskLqLrq18",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 200252,
    "likes": 5545,
    "comments_count": 545,
    "description": "The new Microsoft Surface Laptop 5 is really great, except... TikTok Made Me Buy It:  I Built A Laptop, Again:  Apple Kills the Lightning Port:  Wish.com for ALPHAS Only:  YouTube, Fix This:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 MICROSOFT IS OUT OF THEIR MINDS 0:25 The New Surface Line 1:01 The Best Laptops You SHOULDNT Buy 2:00 You Dont Buy a Surface for the Specs 3:05 The Surface Doesnt Fit In 3:52 Lets Talk About Price 5:08 Its MADE To Go On Sale 5:58 The Surface is WORSE Than Apple 7:06 This Does NOT Make Sense 7:58 If I Were Head of Surface 8:58 I ALMOST Recommend It 10:10 WHY Its So Expensive 11:01 It WILL Be On Sale 12:04 Its BETTER But 13:04 Its Made For Universities 13:58 What Do You Think?",
    "description_links": [
        "https://youtu.be/vUBtSnsWL_0",
        "https://youtu.be/AKgL1v6wtfk",
        "https://youtu.be/1uYsT8C3974",
        "https://youtu.be/yfeoywyBdkw",
        "https://youtu.be/ZHgdxomXWOM",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Microsoft is out of their 'got dam minds. (explosion of electric guitar) - That's how we're starting this video? - That is how I am starting this video. - Oh boy. - [Matt] So we got some new Surface products in, and I got some words. - [Austin] Okay - [Matt] I got some thoughts. - Let me hit you, right. So, we went up to take a little tour of the Microsoft campus. They, you know were very kind in showing us some of the prototypes. (bell chime) We've got some neat footage of that. There are a bunch of new Surfaces that have all been released, and are actually all on sale right now. So, there's the Surface Laptop 5, which is what I'm using right now, the Surface Pro 9, which Ken is currently making a video on for \"Danky\". On top of that, they also have the new Surface Studio, right? Now, I think we've had a bit of a love-hate relationship with the Microsoft Surface line for quite a while. - I think the last like three videos we did with the Surface was do('nt), - Do('nt), - buy the Surface, whatever. And it feels like our reaction is pretty much the same across the board, and, which is getting frustrating to me. - Matt, hit me, you teased the, you wanna make this video 'cause you had a hot take, throw, hit me with the hot take. - My hot take is, Microsoft Surface Laptops, any, like all of their Surface products, are some of the best laptops you can buy. It's unmatched quality wise. In fact, I actually think it's better than, than a lot of Apple products in certain ways. But, - But. - But, - But, - the pricing on them is ludicrous. - Mmmmm. Microsoft does not know what, like where these fit into a market. What you can get for a pretty decent like, Asus, - Yeah. - or an Acer. What you can get premium product wise with like a Razor. - Okay, well hold on, hold on. I do disagree on that a little bit, right? - Ah. Hmm. - You don't buy a surface for the specs, right? - But that's the problem. - No, but no, but if you're, if you're comparing a Surface to something like Asus, or an Acer, which let's be clear: very high quality, fine laptops, but you can't compare a plastic, - No, no you can't. - or flimsy sort Bell quality, to this. I mean this is all aluminum. It's incredibly well machined. It feels nice. Like, there's a clear price that you are paying for the hardware, for the sort of fit and finish. There is definitely something different to that. So I, I agree in general. - If we have the Venn Diagram though, of what you're gonna use your, your computer for it's productivity, it's gaming, it's creative, whatever. - [Austin] Sure. - This doesn't fit into, nicely into any like, - Okay. - it's, it's all productivity. (groaning) If I'm an employee at a business, or am I a student, whatever, this is a productivity beast. It's, it's super solid. Like, I do love this thing. - Yeah. - However, at the end of the day, and this is kind of what we talked about with the last laptop video, I still want to game. I don't buy them for the specs. I agree with you on that. - [Austin] Yeah. - But, I can't game on a Surface Laptop. I can't game on any of these Surface products. - [Austin] No. - But, you can go get a decent, cheap Asus laptop, that's gonna give you the same level of productivity performance. - Hundreds of dollars less. - Yeah. - Absolutely. - Hundreds. And then you still have money to do either like a gaming computer, a console, whatever. Say you go and get like a Razor. - Mhmm. - Razor's more expensive than the the the Surface, - Yeah. - in a lot of cases. But, you don't necessarily need a gaming desktop. - Oh. - You're still getting the premium. So like, that's what I'm talking about. - [Austin] Okay. - Like you can either go way cheaper, - [Austin] Yeah. - and have options for doing something else, or you can go a little bit more expensive, and have an all-in-one solution. That's where I'm saying that this is fitting, weirdly fitting, in to this bracket because, this is an expensive laptop that still requires you to have some other thing attached to it to be able to game. I would say most of our audience, let's, let's, let's let's pander, let's target. - Sure. Pandering. - Most of our audience wants to do at least some form of gaming. - [Austin] Sure. - You don't necessarily have to be like a hardcore gamer, and if you're a hardcore gaming, you are definitely not- - Of course. - considering this, - Absolutely. - as your primary, let's, let's be real with that. - So your argument would be either spend a little bit more, and get something like a Razor Blade 14, which we have taken a look at in the past. While bigger, not insanely large, and is going to have a completely different level of performance. - [Matt] Yeah, I agree with that. - Okay, so let's, can we talk about price for a second? - [Matt] Yes. - Specifically with the Surface Laptop 5, which is again, this beautiful sage model that I've got right here. This laptop starts at $1,000, a expensive, but reasonable price tag. The thing that I cannot under any circumstances justify, are the upgrade prices. Okay? So for $999.99, you're getting yourself, a core i5, 8G's RAM, 256GB SSD. Now, that's something that I think you could be happy with, although 8G's of RAM doesn't feel great to me on a $1,000 plus laptop. Now, if you want to jump up to a 512G SSD, that is going to be a $300 upgrade going from 256 to 512. I can tell you, - That's so much. - that while you can upgrade the SSD in the Surface Laptop 5, it is not recommended for you to do as an end user. 'Cause unlike something like the Pro, which has a little just door, you could swap out that SSD in two seconds. You actually have to pretty much fully disassemble this, it's not practical. But, it gets worse because I could kind of get by with 256 gigs. But, what I really want is 16 gigs of RAM. That's another $200. Meaning you can't just get 16 gigs of RAM and 256. You either have to go for the $1,300, or the $1,500 configuration. If you want to upgrade to 16 gigs of RAM, you're forced to get 512 gigs of storage, and spend $500 more. That is outrageous! - Ludicrous! - Like, we actually almost made a different version of this video when we had this whole discussion because Surface products go on sale, almost every bit of tech goes on sale. That's totally fine. What it feels like, is that Microsoft are pricing Surface products, specifically the upgrades that you're probably gonna want, at a almost artificially high sort of price, just so they can go on sale later. There's nothing wrong with that. But, I would almost prefer to charge me like $1,200 for the base model or something, and then charge reasonable upgrades, right? 'Cause I get it, this is an expensive chassis, you've gotta make profit, that's all fine. But, the fact that a reasonable configuration with 16 gigs of RAM is 50% more. Even something like Mac, right, the MacBook Air, which we have absolutely lambasted for a very similar sort of issue. Even that, I can pick a MacBook Air base model, throw 16 gigs of RAM into it, pay that, you know, very expensive upgrade, but that's it. I'm not forced to get that 512 gig SSD. I'm not forced to spend the extra $300. We give Apple so much (censored) for their upgrade pricing. - Yeah. - And the fact that it is way, way more expensive than it should be on that new MacBook Air, and most of their devices. This laptop is worse when it comes to those upgrades, right? And to me, as much as I love this hardware, I can't in good conscience tell you spend $500 more just to get a little bit more RAM and more SSD. - But it feels like what they're doing is, jacking these prices up. - [Austin] Mhmm. - Let's sell these in mass to whatever university, - Yeah. to whatever, to whatever business, whatever. And then, once those orders are filled, that's when they tend to go on sale, and those prices seem to come back down to a reasonable level. - For context, looking at the MacBook Air, that is a $200 upgrade to go to 16 gigs RAM, and a $200 upgrade to go to 512. But, at least the difference is, is that I can do those individually versus having to get them together. The only way to get a Surface Laptop 5 with 16 gigs of RAM, is to spend $1,500. You know what's even crazier about this? Is that, if you wanna go up to the i7, you have to get the full maxed out configuration, which is another $200. But you know what, I know that Intel charge a lot of money for the i7, right? I would not be surprised if Intel are charging another 50 to $100 for that $200 upgrade, which obviously have profit margins. It is more expensive to go from a 256 to 512 SSD, than an i5, to an i7. And, I can guarantee you that SSD cost to Microsoft's probably like 30 bucks more, and the i7 cost, is probably like way more than that. All right, so just this does not make sense. - That brings me to, like you say, people don't buy a Surface for specs. They're buying it for the the build quality, and feel of it. - Which is terrific! It's such a good laptop! - But that leads me to ask, \"Why is there even an i7 model?\" - I would rather them delete the i7, and bring in a 16 gigs, 256 model SSD for like a $100 more, or $200 more. - Well, what it like I, I, like someone helped me out here because I'm, I'm baffled at this. What like, whatever I can think of to be doing on this laptop. Is it the like the one weird case, like an architecture who's, who's like rendering something? - I mean, look, an i7 is nice to have, but like it's not gonna make a significant difference. - You're not, again, you're not gaming on it. There's no GPU. - If I were head of Surface, I get that Microsoft are not Dell, they're not going to have a hundred versions of the Surface Laptop. Like there's every possible configuration of the XPS, and different colors, RAM, storage, blah blah blah. I get that. But, having four configurations of this laptop, plus four colors, and having them all tied to if you want more SSD, then you have to get more RAM, which is in an i7. Like, you can't decouple those at all. But, at least with the MacBook, you can choose the 16 gigs of RAM, and I don't want extra storage. - What is important to you. - Exactly. Right. So, it frustrates me because this is a phenomenally great laptop. Now, are there some quirks and some quibbles? Yeah, absolutely. Right? I think these bezels are starting to look a little bit dated compared to something again, like that new XPS or whatnot. I also think that the port selection, even on the 13, especially on the 15 is not great. All you get is a service connector, USBA, thunderbolt, headphone jack. - [Matt] Yeah. - That's it. I feel there could be at least like an SD card reader, or something on these laptops, but other than that I cannot complain. Like this is a phenomenal laptop, and it's so good that, I actually would almost recommend getting that base model at $1,000. I feel like it's hard to spend $1,000, and I get at least 16 gigs of RAM. Like to me that feels important. If you're gonna have a bunch of tabs, and you know you wanna get real work done. I know I keep harping on this but like. - It's, no, this is why I wanted to do this video. It's, this is why I would say, \"Microsoft is out of their goddam minds!\" As much as we're harking on them for this, - [Austin] Mhmm. they do a good job of going on sale later on. When they go on sale, they are ludicrously cheaper. - Can I read you some sales right now on BestBuy.com? - Yeah. Yeah. - So, you can now get these Surface Laptop Studio on Best Buy, with 16 gigs of RAM, for $1,400. Again $200 off. The upgrade pricing does not make sense, right? And if you look at this thing once you start upgrading it, you might as well buy the Surface Laptop Studio because it's actually got the trick little hinge. - [Matt] Yep. - You've still got 16 gigs of RAM. It's almost the same price. In fact, it's actually cheaper. I struggle with the idea of charging so much money for what it is admittedly a really nice product. But, the problem is the upgrade pricing is wacky. If it really is as expensive as it is to make, which I believe, then why is the base model so much less expensive? Look, I don't know how much it costs to them, but I would be shocked if both of those combined, are more than like 60 bucks more. Like it's not $500. - I, the only, and you're right, the only way I can say that this is making any sense to me, not making sense price wise by the way. - [Austin] No. - But making sense strategy wise is again, they're coming out full price, marked up, letting institutions front that bill, because they're the ones who are buying these things in mass. - Mhmm. - Yeah, it gets released to the public right away, but I guarantee that, that like individual sales, - Yeah. - is barely a fraction- - [Austin] Yeah. - of what like, how many they're selling to a school. - This is to be very clear, a problem that we have had many times. In fact, I feel that most of the product videos we do on \"This Is\", run into same issues. Whether it's a Razor product, whether it's a Pixel product whether it's Surface products, we're like, \"Oh this is great, but we can't recommend it to you.\" It's brand new, we like it, it's shiny. There's lots and lots of good things. But, the problem is that we know it's gonna be on massive fire sale in 3, 4, 5, 6 months, and like I get that other products go on sale, right? That's not the thing, but it feels like there's a certain class of products lately where they're basically pricing the sale in. But, the people who have to pay the extra money, are the early adopters. - Yeah. - I want the new shiny thing. I've gotta pay extra, even though I know that it's gonna be massively discounted very soon, and it's just like, that's not cool. - It's one thing if it was like, you know, 10%, 15%, whatever, we're seeing 30% discount, like- - Hundred dollars off! - Like it's, I'm fine using this eight, compared to the nine because there's not enough difference for me. It's not like you're getting a GPU in here, that suddenly this is gonna be a video editing beast. That's never gonna happen in something like this. If I want to do some productivity work with, which is what I do for this, I'm fine with even something like an i3. If they came out with a, like the base as an i3, 8 gigs of RAM, and then like a mid tier with an i5 with 16, at that $1,000 price point, that would be a really, really good price point for that laptop. - Honestly, the move is kind of to wait. Right? Because as much as I love the Surface Laptop 5, which again is the one that I specifically have, and spent some time with. While it is good, it's not a massive jump over the previous model, and that previous model is on sale for hundreds of dollars less. This thing is better, but it is not hundreds of dollars better, and it's just tough 'cause like, you as a consumer have such a hard time trying to figure out when to buy the thing. 'Cause, I, we can tell you all day how great all this hardware is, but when the price is wildly fluctuating, it almost feels like it's been artificially, sort of expanded just to make sure that they have some room to come down on sales. It's a bad thing when Apple does it, it almost feels worse when Surface does it, when they bundle all these things together, and charge even more for it. Man, fired up right now. - We get asked constantly, \"Should I get this one or should I wait till next year?\" Whatever, blah blah. You should 100% wait till next year and then get this one. But, coming back to the whole, \"These are corporate products.\" Not so much for the laptops, but when you're talking about like the, the Surface Tablets. It was a big deal when these ports shrunk because there's so many 3rd party accessories that are meant to, to work around these Surface products, that it would cost way more money to replace those, than it would be to just buy, like, to keep the Surface the same body shape. - Yeah. - So at the university I used to work at, every one of our podiums was using a Surface Tablet, the seven inch tablet, which had the big chunky bezzles, but we replaced those tablets out two, three times. So when we actually upgraded them, all we did was swap out the actual Surfaces and that's it. We didn't have to get new locking mechanisms, we didn't have to get new mounting hardware. We didn't have to do anything like that. That's why they kept, they, they don't really move forward with specs on these, as far as like the externals, - Yeah. - Because they're just expecting all these institutions to have established guidelines for 'em. - It's just frustrating to me because these devices are so good, there's so much to like about them, and yet I can't tell you to buy one. Maybe, buy yourself the base model, but even at that point, as of right now, when we're recording this video. Buy a four, which is already gonna have all those upgrades, the 16 gigs of RAM, more SSD, all of that kind of stuff, for the same price. I get that it's really hard to do this stuff. Like I, I don't wanna just sit here, and like it's easy for us to make a video saying how, \"You're wrong for charging this, or that, or whatever.\" I get it. Like, it's hard to design these products, to price them right, to make sure all the retailers are getting their margins, blah, blah, blah. I get that, and I understand. I just wish that if you are going to charge for upgrades, first of all, give us as many options as we can. 'Cause not everyone's gonna want a bigger SSD, when they just want some RAM, or not everyone's gonna want more RAM or SSD, if they just want an i7, or whatever the case is, give us some more options. But, even if you can't do that, please don't charge us such inflationary kind of prices for your upgrades when in reality, we might just want something that's far simpler, and far more straightforward. I, gah! - Let us know what you think in the comments. Do you love the Surface Laptop? Do you think it's overpriced? Do you think we are under-priced? Like, follow, subscribe, and we'll catch you in the next one. (upbeat music)",
    "transcript_keywords": [
        "Surface Laptop",
        "Surface",
        "Surface products",
        "Surface Laptop Studio",
        "Microsoft Surface Laptops",
        "RAM",
        "Laptop",
        "gigs of RAM",
        "Microsoft Surface",
        "SSD",
        "Yeah",
        "gigs",
        "Microsoft",
        "products",
        "buy",
        "price",
        "upgrade",
        "sale",
        "Microsoft Surface line",
        "video"
    ],
    "transcript_entity_values": [
        "Razor",
        "15%",
        "1,300",
        "three",
        "G's of RAM",
        "Asus",
        "30%",
        "5",
        "the end of the day",
        "300",
        "Microsoft Surface",
        "jack",
        "Acer",
        "50%",
        "1,000",
        "30 bucks",
        "the Surface Pro 9",
        "Microsoft",
        "seven inch",
        "500",
        "RAM",
        "Asus",
        "a hundred",
        "another 50 to $100",
        "GPU",
        "Microsoft Surface Laptops",
        "6 months",
        "USBA",
        "Matt",
        "Bell",
        "Austin",
        "100",
        "4",
        "MacBook",
        "Asus",
        "first",
        "a Surface Tablet",
        "the Surface Tablets",
        "the Surface Laptop",
        "two seconds",
        "Surface",
        "next year",
        "Dell",
        "the MacBook Air",
        "Razor Blade",
        "the Venn Diagram",
        "14",
        "999.99",
        "nine",
        "8",
        "512",
        "100%",
        "Danky",
        "13",
        "256",
        "SD",
        "XPS",
        "3rd",
        "200",
        "second",
        "at least 16",
        "more than like 60 bucks",
        "Intel",
        "BestBuy.com",
        "1,500",
        "one",
        "Apple",
        "four",
        "the Surface Laptop Studio",
        "10%",
        "Hundreds of dollars",
        "1,400",
        "5",
        "eight",
        "3",
        "15",
        "1,200",
        "hundreds of dollars",
        "a Surface Laptop",
        "two",
        "MacBook Air",
        "SSD",
        "Ken",
        "Mac",
        "the MacBook Air",
        "16",
        "Surface Studio"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "MONEY",
        "MONEY",
        "LAW",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "FAC",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "PERSON",
        "PRODUCT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "MONEY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.051874373108148575,
        0.011731688864529133,
        0.08968803286552429,
        -0.07578454166650772,
        0.07192631810903549,
        -0.03242716193199158,
        0.044428084045648575,
        0.039491284638643265,
        0.030176742002367973,
        0.05084758251905441,
        -0.007633496075868607,
        0.04024165868759155,
        0.012208092026412487,
        0.010306788608431816,
        0.017910504713654518,
        0.023417286574840546,
        -0.008736148476600647,
        -0.14689041674137115,
        -0.07310143858194351,
        0.05148402601480484,
        -0.009116290137171745,
        0.017517877742648125,
        -0.045888423919677734,
        -0.012860871851444244,
        0.05457201972603798,
        0.05868108943104744,
        0.0030801892280578613,
        -0.006291226018220186,
        -0.06728889048099518,
        0.01587727852165699,
        -0.08385597914457321,
        0.06268739700317383,
        -0.019571157172322273,
        0.052954260259866714,
        0.008460120297968388,
        -0.09136398136615753,
        0.0024020455311983824,
        -0.011928554624319077,
        -0.039257943630218506,
        -0.09458636492490768,
        -0.0691998153924942,
        -0.04103067144751549,
        0.0035455727484077215,
        0.07151558250188828,
        0.05406960844993591,
        0.005556361749768257,
        0.005156069993972778,
        -0.07426609098911285,
        0.011459046974778175,
        0.05642829090356827,
        -0.08759458363056183,
        -0.07773934304714203,
        0.020183132961392403,
        -0.1270482987165451,
        -0.05056846886873245,
        0.02692721039056778,
        0.01827194169163704,
        0.059328071773052216,
        0.038190994411706924,
        0.0014092745259404182,
        0.03791029378771782,
        -0.11536405235528946,
        -0.0457758754491806,
        0.027441678568720818,
        0.054054223001003265,
        -0.056444793939590454,
        -0.04256754741072655,
        -0.03663772717118263,
        -0.05909845605492592,
        0.045437976717948914,
        0.000354876829078421,
        -0.00576403085142374,
        0.04141228646039963,
        0.0016787381609901786,
        0.008311210200190544,
        0.014034266583621502,
        0.059068527072668076,
        -0.021931923925876617,
        -0.04263462871313095,
        0.02229081653058529,
        0.01752638816833496,
        0.04758516326546669,
        -0.07852745056152344,
        0.0015690821455791593,
        -0.02737080305814743,
        -0.032066959887742996,
        0.0012284856056794524,
        0.05304376035928726,
        -0.0337347649037838,
        -0.012660813517868519,
        -0.01345946453511715,
        0.025608789175748825,
        -0.04225988686084747,
        0.06276145577430725,
        0.06438451260328293,
        -0.026059919968247414,
        0.0004684876766987145,
        -0.04711780324578285,
        -0.023731153458356857,
        0.03689980506896973,
        0.011148144491016865,
        0.05199825391173363,
        0.04268084838986397,
        -0.023734629154205322,
        -0.029015259817242622,
        -0.09354224801063538,
        -0.0071600209921598434,
        0.06533565372228622,
        -0.02047019638121128,
        -0.02559439092874527,
        -0.006059670355170965,
        0.0027986797504127026,
        -0.07063896209001541,
        -0.0013760317815467715,
        0.007592644076794386,
        0.014316323213279247,
        -0.04272446036338806,
        0.0197922270745039,
        0.09567609429359436,
        0.008329846896231174,
        -0.03752436116337776,
        0.05078314617276192,
        -0.04320066049695015,
        -0.04080427438020706,
        -0.0292708408087492,
        -0.01186518557369709,
        -0.04165675491094589,
        2.883583886167045e-33,
        -0.01908566802740097,
        0.024150656536221504,
        -0.07594315707683563,
        -0.07565571367740631,
        0.01651799865067005,
        -0.024936838075518608,
        0.008280191570520401,
        0.04074396193027496,
        0.07157903164625168,
        0.03717769682407379,
        -0.07149320095777512,
        -0.011427583172917366,
        -0.06045891344547272,
        -0.05864167958498001,
        0.10574740171432495,
        -0.04607272893190384,
        0.015604563057422638,
        -0.0010291954968124628,
        -0.09882067143917084,
        0.006514803972095251,
        0.019534273073077202,
        0.017836514860391617,
        -0.004381487146019936,
        -0.11660033464431763,
        -0.06687145680189133,
        0.0022590719163417816,
        -0.0045499918051064014,
        0.00999718252569437,
        0.0703742727637291,
        0.031607262790203094,
        -0.051907651126384735,
        -0.03689726069569588,
        -0.043059807270765305,
        -0.0646088719367981,
        -0.011159668676555157,
        -0.004775765351951122,
        -0.02279510162770748,
        -0.09068881720304489,
        0.10945791751146317,
        -0.009204608388245106,
        -0.1262456327676773,
        0.061030495911836624,
        -0.0050126719288527966,
        0.01619374006986618,
        0.12003661692142487,
        0.07320410013198853,
        -0.01165070105344057,
        -0.014620129019021988,
        -0.0012537376023828983,
        0.015042243525385857,
        -0.05134376883506775,
        0.0446370393037796,
        0.0797991082072258,
        0.018738696351647377,
        -0.03168635442852974,
        -0.04469701275229454,
        0.04221973568201065,
        0.00037995976163074374,
        0.03864935413002968,
        0.09612157940864563,
        0.017816737294197083,
        -0.013362599536776543,
        0.017739107832312584,
        -0.027573006227612495,
        -0.10011997073888779,
        0.07346438616514206,
        0.17133352160453796,
        0.03292740508913994,
        -0.09185902774333954,
        0.0455489344894886,
        -0.01670113205909729,
        -0.007461623754352331,
        -0.031679559499025345,
        0.002632282907143235,
        -0.030089886859059334,
        -0.017906304448843002,
        0.02205444872379303,
        0.013317241333425045,
        0.01168396882712841,
        -0.04347364231944084,
        0.014316098764538765,
        0.040399570018053055,
        0.03502921387553215,
        -0.06385429948568344,
        -0.061550840735435486,
        0.057186126708984375,
        0.050864335149526596,
        -0.0359453484416008,
        0.03052571602165699,
        0.016062434762716293,
        -0.06835881620645523,
        -0.02685091830790043,
        -0.012185227125883102,
        0.00888571422547102,
        -0.02201497182250023,
        -3.9669988257535455e-33,
        -0.021488763391971588,
        -0.08476957678794861,
        -0.05885612964630127,
        0.045747995376586914,
        -0.07990912348031998,
        0.010971096344292164,
        0.004131168592721224,
        -0.038100965321063995,
        -0.0271319467574358,
        0.003482000669464469,
        -0.020329048857092857,
        0.05960632488131523,
        0.022935273125767708,
        0.051355503499507904,
        0.02353532426059246,
        -0.02959754876792431,
        -0.005866052582859993,
        -0.06220340356230736,
        0.06892172992229462,
        0.013222936540842056,
        0.0491340309381485,
        0.0642813891172409,
        -0.06889909505844116,
        0.05115934833884239,
        -0.017379499971866608,
        -0.028101999312639236,
        -0.08448784798383713,
        -0.032009024173021317,
        -0.005617396906018257,
        0.01925312913954258,
        -0.009321109391748905,
        -0.045181602239608765,
        0.0012850383063778281,
        0.03835386410355568,
        0.1040266677737236,
        -0.008609598502516747,
        0.012170297093689442,
        -0.08689766377210617,
        -0.030327389016747475,
        0.07293657958507538,
        0.06161760538816452,
        -0.030438626185059547,
        -0.02468441054224968,
        -0.0015343019040301442,
        0.020387964323163033,
        0.02069249376654625,
        -0.03446858376264572,
        -0.019514309242367744,
        0.0298505537211895,
        0.042626116424798965,
        0.03191488981246948,
        0.04773879051208496,
        0.020030418410897255,
        -0.04631217196583748,
        -0.060273438692092896,
        -0.06933955103158951,
        -0.024637440219521523,
        -0.023007890209555626,
        0.0014319996116682887,
        0.005875816568732262,
        0.021630844101309776,
        0.008664661087095737,
        -0.004246252588927746,
        -0.051043134182691574,
        0.00325396447442472,
        0.12570182979106903,
        0.11959849298000336,
        0.03251948207616806,
        -0.030699079856276512,
        -0.04627145826816559,
        -0.0448402538895607,
        -0.05145799368619919,
        -0.10362529009580612,
        -0.08465299010276794,
        -0.06124061346054077,
        0.05578138679265976,
        0.06262736767530441,
        0.008480612188577652,
        -0.04326828569173813,
        0.010004879906773567,
        0.04804366081953049,
        0.07084888219833374,
        0.058284942060709,
        0.0309238750487566,
        0.029654165729880333,
        0.015179171226918697,
        0.059105128049850464,
        0.006353380158543587,
        -0.11302037537097931,
        0.008498093113303185,
        0.0011640893062576652,
        -0.026224559172987938,
        -0.04245320335030556,
        0.12155638635158539,
        -0.033418186008930206,
        -5.381300027806901e-08,
        0.00231244252063334,
        -0.01647244021296501,
        0.06748387217521667,
        0.05198073014616966,
        -0.0012668251292780042,
        -0.043752316385507584,
        0.06375593692064285,
        0.08188808709383011,
        0.05510249361395836,
        0.08415002375841141,
        -0.0125442985445261,
        -0.146545872092247,
        -0.1045839712023735,
        0.07950633764266968,
        0.02263665944337845,
        0.13761772215366364,
        -0.0530218780040741,
        0.007624753285199404,
        -0.0019104169914498925,
        -0.05952806770801544,
        0.013590361922979355,
        0.05464979633688927,
        0.10047785192728043,
        -0.04585085064172745,
        0.002196261193603277,
        0.04368727281689644,
        -0.050937291234731674,
        0.06352774053812027,
        0.022523870691657066,
        0.04185036942362785,
        -0.06819900125265121,
        -0.024443287402391434,
        -0.013272725977003574,
        0.03293626010417938,
        -0.023534035310149193,
        -0.07584786415100098,
        0.011711212806403637,
        0.08582887798547745,
        0.09061617404222488,
        0.05243096500635147,
        -0.07044269889593124,
        -0.039139728993177414,
        -0.04904412105679512,
        0.030297445133328438,
        0.02342212200164795,
        -0.021524615585803986,
        -0.07468706369400024,
        -0.05344473198056221,
        -0.012430687434971333,
        0.018563950434327126,
        0.032958630472421646,
        -0.02489541284739971,
        0.05283895134925842,
        0.06293405592441559,
        0.03552482649683952,
        0.026368001475930214,
        -0.03367064520716667,
        0.003424663795158267,
        -0.05196649581193924,
        0.07902663946151733,
        0.045652758330106735,
        -0.0651663988828659,
        -0.05102284997701645,
        0.04430822655558586
    ]
}