{
    "id": "lpdDkFx0r2k",
    "title": "The OnePlus 8T is ICE COLD!",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-10-17T20:00:43Z",
    "video_url": "https://www.youtube.com/watch?v=lpdDkFx0r2k",
    "category": "Science & Technology",
    "tags": [
        "OnePlus",
        "8T",
        "Android",
        "Smartphone",
        "Mobile Device",
        "Charging",
        "Warp Charge",
        "OLED",
        "Camera",
        "2020",
        "Jake",
        "Unboxing",
        "Samsung",
        "120hz"
    ],
    "views": 291718,
    "likes": 13495,
    "comments_count": 911,
    "description": "Get 20% OFF + Free Shipping @Manscaped at    The T line of OnePlus phones has always been known to be incremental upgrades after the model release early every year. The OnePlus 8T shows some strengths to what will be coming for the OnePlus 9!  Check out the OnePlus 8T at   Buy OnePlus 8T On Amazon (PAID LINK):  On BHPhoto (PAID LINK):   Buy OnePlus 8 On Amazon (PAID LINK):  On NewEgg (PAID LINK):      On BHPhoto (PAID LINK):      Buy Samsung Note20 Ultra On Amazon (PAID LINK):  On NewEgg (PAID LINK):  On BHPhoto (PAID LINK):  On Samsung (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://www.oneplus.com/8t?from=head",
        "https://geni.us/ioOZho",
        "https://geni.us/0OPIQ",
        "https://geni.us/GGo3K",
        "https://geni.us/vV0i6IK",
        "https://geni.us/jbEg",
        "https://geni.us/9LPBrvG",
        "https://geni.us/4AX0QUJ",
        "https://geni.us/K80Cx2v",
        "https://shop-links.co/1725432049818051352",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You know what's really funny? - [David] Ultra stops. Ultra stops at nothing. - [David] Ultra stops. - Ultra stopped (laughs). Today, we look at the latest and greatest from OnePlus. It's not actually the greatest per se because the Pro still exists, but it is, at least, the latest. All over the box is ultra. And we have no idea why. So this is actually the reviewers' packaging. It's not quite what you would get if you were to purchase this phone yourself. I don't know if they were trying to take a jab at Samsung, maybe. There's nothing else about this phone that they advertise as ultra. It's not the OnePlus 8T Ultra. It's just the OnePlus 8T. Now this is pretty fancy packaging. It's like soft-touch everything, feels so nice. (laughs) Full disclosure. I did actually open this before. Ooh, reviewer's guide. Good think there's a knife right here. - [David] You're not allowed to use the knife, Jake. - [Jono] No knives. - [David] You have to use a pen. A pen? What are the odds, I can open this with a light bulb? Ah, I did it! - Ah, that works! - [Jake] Yes. Inside the phone. This is the OnePlus 8T. - [David] No, it's a book. - No, this is a book. I guess these are the important things about this phone. A, 120 hertz screen. B, warp charge 65. Video done. Oh man, this is just like, mm. OnePlus is really happy with themselves. Cha Okay, so again, this is the reviewers' packaging. So we do have a few things that you will not receive unless you, I guess, you buy it separately. They got their fancy warp-charge specific case. Here, we have the sandstone bumper case in cyan. Ooh, it's actually, it feels nice. Let's get to the phone. That's what you people are here for, anyways. (groans) Wow, that's a big box for a smartphone. It's almost like a watch box. (box thuds) Ah Come on, slide faster (sighs) Oh, god dammit. (assistants laugh) More propaganda. Dang it, OnePlus. Got a quick-start guide. What is this? - [David] SIM card removal tool. - But what is under here? The OnePlus 8T is more than a phone. It's a challenge. I think we'll leave it at that. I don't know what this is. What's that SAR value? Apparently the SAR values are only collected by the FCC to make sure that cell phones do not exceed the FCC's maximum permissible exposure levels. So it's a highest SAR value? Safety information. There is nothing in here we need. Ooh, we got some stickers. Oh, yay. And here is the phone. Ah Wow. Okay. So there's definitely some differences here, right off the bat. We'll get into those in a sec. What else is in the box here? You got the typical OnePlus cable. So this is actually a special cable, sort of. It's got to support what is in this box down here, the warp charge 65 brick. And this is really the important part of the OnePlus 8T, at least according to OnePlus. This charger supposedly can charge the OnePlus 8T to 58% in just 15 minutes. And 100% in 39 minutes. If you really hate your battery, would not recommend using this all the time. 10 volts at 6.5 amps, that's their 65-watt warp charging. That's a lot of both. (laughs) I would be concerned that this phone would get pretty, pretty freaking hot. Maybe we'll plug it in to see. OnePlus. But before we get into the phone, I need to tell you about our sponsor, Manscaped. Manscaped is a brand dedicated to below-the-waist grooming and hygiene that's safe, simple, and effective. That means you can only expect the best from their products made from the best materials to give you the best grooming experience possible. And guess what? Their products aren't just for men. Their Lawnmower 3.0 body trimmer's the perfect gift for a girlfriend or wife in your life. Go to a manscaped.com/circuit for 20% off and free international shipping on your order. So right off the bat, of course, the 120 hertz, buttery smooth. It's like its predecessor, the OnePlus 8. This is still a 6.5-inch OLED. We actually have a little bit lower screen-to-body ratio. I think, 'cause the side bezels are a little bit more pronounced. We have less of a top bezel this time. It feels more balanced. It looks like it's framed nicely because of the bezels. And we still have that same pinhole camera. For the 8T in either color. This is their aquamarine green. There's also lunar silver with 12 gigs of Ram and 256 gigs of storage. You're looking at 749 U.S. That's pretty pricey for a phone. Like this is, ah, but is it? I guess maybe not. David, like what's a? - [Jono] I think standards these days are like. That's pretty cheap, actually. For a flagship phone, I think, you're spending a thousand bucks, usually. So I guess it is under that. On the outside, aside from the screen, having slightly different bezel layout, it's mostly the same on the front. We have the same buttons on the side. You've got the mute switch. You got your same power button and volume on the other side. The only big change we're going to see here is the cameras. Now on previous OnePlus phones, you'd see the cameras sort of in the middle, which it's kind of a dated look, but finally they've switched over to a more modern status quo, left-justified camera. There is some changes to the camera this time. We actually have laser auto focus. As for the sensors in the camera, we're still using the same Sony 48-mega pixel main shooter. We have a 16-megapixel ultra wide, that's actually a few degrees wider, which is nice. For the macro lens, we've gone from two megapixels to five, and they've actually included a monochrome sensor, which I think is just OnePlus's nomenclature for depth sensor. In terms of feel, this phone like feels really nice in the hand. It's weighted beautifully, maybe a little bit top bias, which is fine. Sh, nobody saw that. (laughs) One thing I didn't mention actually is the front camera. Ah. (shutter clicking) Hey, David, smile. We get our macro, and then ultra wide. I find that ultra wide camera's always look so weird. Yeah, the distortion fixing is never that great. Okay. Let's move on. Back to the internals of the phone, this time, we have the same Snapdragon 865 processor, the same RAM layout. You can either get 8 or 12 gigs. For storage, depending on region availability, you're looking at 128 or 256, although this time it's UFS 3.1 rather than 3.0, so maybe that'd be a little bit faster. We of course have the warp charge 65 that I mentioned earlier, and there's some changes to the battery to accommodate that sort of charging. So rather than a traditional single cell battery, like you'd see in most smartphones, this one actually has two discrete cells, and supposedly they can each handle 30 watts of charging at the same time, which is pretty impressive. Now to keep this thing from blowing up, unlike the Note 7, (coughs) Samsung, maybe that's a dead meme at this point, we should probably stop beating that corpse. (laughs) They've actually integrated 12 discrete temperature sensors throughout the phone. I don't know how many temperature sensors a usual phone has. I'm guessing that's probably at least a couple. So maybe they've added a few more, but they say it should be good. And with the new heat dissipation system that they've integrated, supposedly it should stay cool even while you're using it and charging with warp charge 65. So I think I should actually plug it in and try that. Ah, cha Hey at 69%, what? - [Jono] Nice, nice. - Oh, damn it. It's 70 already. Wow. That's fast. (laughs) I wonder if we can watch this go up again? (video scrubbing) Ah, 71! Wow, look at that! That's so crazy. This battery will not last very long if you keep using this. (laughs) Let's try the fingerprint sensor here. Oh, that's pretty quick. - It's really hard. - It's so similar. I'm going to say maybe the OnePlus one a little bit, but when you're getting this fast anyways, like it doesn't even matter. - [Jono] At a fraction of the cost. - Yeah, a fraction of the cost. It's like probably 40% cheaper than that phone. Now there's one thing I wanted to check inside the settings here. Ah-ha, this is the first OnePlus phone to have an always-on ambient display. This is pretty slow to the party. (laughs) This feature will be disabled below 5%. Okay. I locked the phone. Look at that. One thing we didn't mention is like other OnePlus phones, same with the OnePlus 8 and the OnePlus 8 Pro, there's no expandable storage, but I think if you're getting the 256, that's probably plenty for most people. If you're a power user, you're probably going for a more expensive phone anyways. So I guess leave that up to you guys. We're going to plug the phone back in just to see if it actually gets hot. 'Cause we wanted to try that. We've got our warp charge going, 76%. For speakers, it looks like we do have an earpiece speaker here. Hopefully that works as stereo. And then on the bottom, it's not front facing, but it's downward firing, and hopefully they work together. - [Linus] And the brand new Xbox Series X. Yes, my friends. - Yep. Okay, so it's definitely using both speakers for stereo audio. Sounds kind of tangy. I mean we are listening to Linus's voice, so... (upbeat music) Mm. Ah, it's hard to say. For the price difference here, I think they're both pretty good (laughs). You're not going to be stressing about the speakers on this phone. They're pretty good. So we've been warped charging for five minutes, probably, at least, now. It doesn't even feel warm at all. If you told me this was charging, like you handed me two phones, and one was charging and one was not, and told me to pick which one it was, I probably wouldn't be able to tell you. I bet you if I plugged the Note 20 Ultra in right now, it would get hot, like immediately. Okay. Let's leave it for a minute, two, a minute or two here and see what happens. We'll have to for a few more minutes. It's now at 88%. It's like ice cold, dude. If I told you this phone was charging at 65 watts, would you believe me? - No, it's not charging. It's off. - It's literally (laughs). - [David] It just feels like it's doing its thing. - It's not doing anything. What do you mean? It's like cold. Like it's actually- - [David] It's not cold, but it's- - I mean, the ambient temperature in here is like 18 degrees or whatever, it. - [Jono] Your hand will probably warm it up faster. - Well, that's why I tried to leave it for a bit. Is it starting to feel warm? And I was pretty sure it was my hand. That's crazy. So I guess if charging, while staying completely ambient temperature is on your list of things for a phone, maybe the OnePlus 8T is for you. You're probably gonna want to wait for the next generation. I always feel like the T series devices from OnePlus are kind of a tease. You never get the same software support as the previous gen. Like they're going to treat this like a OnePlus 8 in terms of updates, probably. It's nice. The screen feels good. It's fast. So I guess if you like the latest and greatest from OnePlus, this could be the phone for you. Can I throw it now? - [Jono] Yep. Go long! - Catch it, Jono. - [Jono] No. - (laughs) No? - [Jono] You can just like (screams). - There's a bed over there. (laughs)",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "Ultra",
        "Ultra stops",
        "pretty",
        "charging",
        "OnePlus phones",
        "guess",
        "nice",
        "phones",
        "feels",
        "ultra wide",
        "camera",
        "warp charge",
        "warp",
        "bit",
        "charge",
        "time",
        "thing",
        "box"
    ],
    "transcript_entity_values": [
        "65",
        "a thousand bucks",
        "40%",
        "below 5%",
        "OnePlus",
        "Jake",
        "100%",
        "6.5",
        "One",
        "OnePlus",
        "RAM",
        "65-watt",
        "8",
        "20%",
        "Ram",
        "U.S.",
        "one",
        "a few more minutes",
        "20",
        "sec",
        "65 watts",
        "749",
        "Today",
        "70",
        "6.5-inch",
        "16-megapixel",
        "18 degrees",
        "SAR",
        "OnePlus 8T",
        "76%",
        "David",
        "Samsung",
        "the Note 7",
        "128",
        "48",
        "Jono",
        "Xbox Series X. Yes",
        "256",
        "10 volts",
        "first",
        "3.0",
        "Sony",
        "FCC",
        "two megapixels to",
        "3.1",
        "two",
        "120",
        "58%",
        "mm",
        "39 minutes",
        "30 watts",
        "69%",
        "71",
        "Manscaped",
        "OnePlus 8",
        "a minute",
        "88%",
        "just 15 minutes",
        "12",
        "Linus",
        "Mm",
        "David] Ultra",
        "five minutes"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "GPE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "ORG",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "TIME",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "PERSON",
        "PRODUCT",
        "TIME",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME"
    ],
    "vector": [
        -0.12661099433898926,
        0.021624011918902397,
        0.10517138242721558,
        -0.005040020681917667,
        0.04734495282173157,
        0.021960115060210228,
        -0.04029535502195358,
        0.17978535592556,
        -0.005389390978962183,
        0.040249522775411606,
        0.050950225442647934,
        0.01340489275753498,
        0.03905906155705452,
        -0.03298724442720413,
        0.05495467036962509,
        -0.05341120809316635,
        0.04344935342669487,
        -0.10901619493961334,
        -0.039790984243154526,
        -0.04548393189907074,
        0.04372391477227211,
        -0.051407232880592346,
        0.015509013086557388,
        -0.022980011999607086,
        0.09511050581932068,
        -0.07150127738714218,
        -0.06287933140993118,
        -0.08177156001329422,
        -0.011979457922279835,
        -0.04653993993997574,
        -0.01620938815176487,
        0.0696018785238266,
        0.0028921517077833414,
        0.03319500759243965,
        -0.017695162445306778,
        -0.05899998918175697,
        0.08744069188833237,
        -0.05223320797085762,
        -0.05110950022935867,
        -0.0004246181051712483,
        -0.0018543131882324815,
        0.00024973019026219845,
        -0.027259429916739464,
        -0.010989287868142128,
        0.02114761993288994,
        -0.05190490558743477,
        0.06481717526912689,
        0.037263836711645126,
        -0.042196933180093765,
        -0.0007868115208111703,
        0.038380421698093414,
        0.018846789374947548,
        -0.026112549006938934,
        -0.018785417079925537,
        -0.08251050859689713,
        -0.01024483609944582,
        -0.006840826943516731,
        -0.012168019078671932,
        0.06254816800355911,
        -0.053462278097867966,
        0.03354359790682793,
        -0.09198421984910965,
        -0.00671394495293498,
        0.08178980648517609,
        -0.01064310036599636,
        -0.011424965225160122,
        0.005787193775177002,
        -0.04190260171890259,
        -0.051394689828157425,
        -0.03714768961071968,
        0.006153482012450695,
        0.014964565634727478,
        0.03468579053878784,
        0.033222686499357224,
        -0.020641226321458817,
        0.09915873408317566,
        0.1254628300666809,
        0.0041255769319832325,
        -0.036685019731521606,
        0.011129354126751423,
        0.0015077353455126286,
        -0.06792346388101578,
        -0.054089002311229706,
        -0.07818615436553955,
        0.05919425189495087,
        -0.023441258817911148,
        -0.0026948051527142525,
        0.08791583776473999,
        0.008928603492677212,
        -0.11935417354106903,
        0.02935631386935711,
        0.09784359484910965,
        0.029237663373351097,
        0.015447757206857204,
        -0.08130395412445068,
        0.005472898483276367,
        -0.08752427250146866,
        -0.05038699135184288,
        -0.07624156773090363,
        0.0011972124921157956,
        0.03794854134321213,
        0.02793535590171814,
        0.06460918486118317,
        0.07588350027799606,
        -0.013285401277244091,
        -0.026628240942955017,
        -0.010542841628193855,
        -0.01604144461452961,
        0.03941287472844124,
        -0.028562795370817184,
        -0.030140221118927002,
        -0.016228370368480682,
        -0.04106009006500244,
        -0.012906125746667385,
        -0.05270998179912567,
        -0.001932355109602213,
        -0.1108592301607132,
        0.008375653065741062,
        0.10528886318206787,
        -0.029043326154351234,
        -0.007576571777462959,
        -0.05146770924329758,
        -0.034401632845401764,
        -0.044144898653030396,
        -0.0741736963391304,
        0.05013120174407959,
        -0.04376528039574623,
        5.798141313794288e-33,
        0.01571030355989933,
        0.09088515490293503,
        -0.06769831478595734,
        -0.06794558465480804,
        0.008856409229338169,
        -0.0012281474191695452,
        -0.0031146646942943335,
        0.04603886976838112,
        -0.0073558855801820755,
        0.02552644908428192,
        -0.09116543084383011,
        0.007825720123946667,
        -0.06373197585344315,
        0.07055783271789551,
        -0.011663873679935932,
        -0.05496636778116226,
        0.0010021490743383765,
        0.004884533584117889,
        0.06114891543984413,
        0.06260155141353607,
        -0.02345396764576435,
        0.012459025718271732,
        0.006121261045336723,
        0.011698296293616295,
        0.10466538369655609,
        0.01457031350582838,
        0.03858957067131996,
        0.0031433645635843277,
        0.03367483243346214,
        -0.009962092153728008,
        -0.07070969045162201,
        -0.020259151235222816,
        -0.014437304809689522,
        -0.039907969534397125,
        0.021835222840309143,
        -0.039304301142692566,
        -0.020682815462350845,
        -0.054735440760850906,
        0.09584905952215195,
        -0.06328384578227997,
        -0.06710373610258102,
        0.028806306421756744,
        -0.08042532205581665,
        -0.06461438536643982,
        0.042127955704927444,
        -0.021524453535676003,
        -0.09571186453104019,
        -0.03807149827480316,
        0.0674375668168068,
        -0.00497446907684207,
        -0.06076217070221901,
        0.0068682595156133175,
        -0.06986608356237411,
        -0.01619136333465576,
        -0.03958560898900032,
        -0.02990802936255932,
        0.05553242564201355,
        -0.01209045760333538,
        0.10210120677947998,
        0.060523707419633865,
        0.01860225759446621,
        -0.029101388528943062,
        -0.03393149748444557,
        -0.046224575489759445,
        -0.09403371810913086,
        0.07213295251131058,
        0.04922552406787872,
        -0.037316229194402695,
        -0.05076150596141815,
        0.00010583904077066109,
        -0.018451018258929253,
        -0.04868363216519356,
        0.033114396035671234,
        0.022968564182519913,
        0.05417260900139809,
        0.022917337715625763,
        -0.06890439987182617,
        0.007218590006232262,
        0.049325380474328995,
        0.003777668811380863,
        -0.05452175810933113,
        0.009966125711798668,
        0.01685493439435959,
        0.0735909715294838,
        0.06549568474292755,
        0.0398041233420372,
        0.027529245242476463,
        0.0023975123185664415,
        0.003669760189950466,
        0.01990632340312004,
        0.01650344580411911,
        -0.025388309732079506,
        -0.01639367826282978,
        0.02872985228896141,
        0.03307241573929787,
        -7.605540285316358e-33,
        -0.08135616779327393,
        0.02015143819153309,
        -0.05884552747011185,
        -0.0145011767745018,
        0.01335128489881754,
        -0.012721380218863487,
        0.016337700188159943,
        0.05417123809456825,
        0.0066188666969537735,
        -0.049325354397296906,
        -0.008520808070898056,
        0.030718708410859108,
        -0.011620712466537952,
        -0.0925137847661972,
        -0.017575131729245186,
        -0.07231324166059494,
        0.040672142058610916,
        -0.062248971313238144,
        0.059681009501218796,
        0.00015787436859682202,
        0.029463570564985275,
        -0.021118083968758583,
        0.0035634501837193966,
        0.07877364009618759,
        -0.026016592979431152,
        -0.05455392226576805,
        -0.02553027682006359,
        -0.004876643884927034,
        0.0006644680979661644,
        -0.009858290664851665,
        -0.01645440049469471,
        -0.011783398687839508,
        -0.02000715397298336,
        0.057613637298345566,
        0.02854648232460022,
        0.009802045300602913,
        0.0203698743134737,
        -0.0038651986978948116,
        0.0728704184293747,
        0.018534474074840546,
        0.09555269032716751,
        -0.0652821809053421,
        0.08042877912521362,
        0.03136641904711723,
        0.03941400349140167,
        0.012247626669704914,
        -0.06652361899614334,
        -0.04172445833683014,
        -0.043748803436756134,
        0.0770902931690216,
        0.0355096235871315,
        0.05726657435297966,
        0.0494123250246048,
        -0.05470012128353119,
        -0.02678314968943596,
        -0.09010005742311478,
        0.03937443345785141,
        -0.037690337747335434,
        -0.07809619605541229,
        0.00950346328318119,
        0.05256248638033867,
        0.03417420759797096,
        0.02474679984152317,
        -0.005524497479200363,
        -0.07988730072975159,
        0.03613695129752159,
        0.053953323513269424,
        -0.01503875944763422,
        -0.026033997535705566,
        0.04064321890473366,
        -0.003853391157463193,
        -0.0684487447142601,
        -0.0531933568418026,
        -0.1144227534532547,
        0.004009254742413759,
        0.03909541293978691,
        -0.11146625131368637,
        -0.019647853448987007,
        0.05659988522529602,
        -0.0525360181927681,
        -0.029622698202729225,
        0.07000982761383057,
        0.07983081042766571,
        -0.01150208804756403,
        0.05192995071411133,
        -0.054777342826128006,
        0.06673459708690643,
        -0.038828395307064056,
        0.06176586449146271,
        0.013052803464233875,
        -0.05722423642873764,
        0.011946012265980244,
        -0.05452017858624458,
        0.030150404199957848,
        -0.006489480379968882,
        -5.417063775325914e-08,
        0.0051152510568499565,
        -0.018480952829122543,
        0.06916740536689758,
        0.0017655969131737947,
        0.06226051598787308,
        -0.12311704456806183,
        0.006216476205736399,
        0.00887995958328247,
        0.11105873435735703,
        0.004869278520345688,
        0.02617119811475277,
        -0.06409434229135513,
        -0.08021240681409836,
        0.003452534321695566,
        0.011085080914199352,
        0.034079451113939285,
        -0.0018061500741168857,
        0.06489987671375275,
        0.019223231822252274,
        -0.017859002575278282,
        -0.01956011913716793,
        0.046148981899023056,
        0.08834732323884964,
        -0.0980941578745842,
        0.11360247433185577,
        0.010762762278318405,
        -0.018461424857378006,
        0.024116666987538338,
        0.1418585330247879,
        -0.024718333035707474,
        -0.022176232188940048,
        -0.02387046627700329,
        -0.03075270541012287,
        -0.03821540251374245,
        0.04937953129410744,
        -0.07231657207012177,
        -0.005449516233056784,
        0.0779159739613533,
        0.08577623218297958,
        0.027204081416130066,
        0.008580729365348816,
        -0.0017964941216632724,
        -0.00686252536252141,
        0.02790115214884281,
        0.010644514113664627,
        0.0022643229458481073,
        -0.06584763526916504,
        -0.07676927000284195,
        0.0025709527544677258,
        0.04336998239159584,
        -0.052829086780548096,
        -0.02931124158203602,
        -0.07222194224596024,
        -0.08178309351205826,
        -0.06037001311779022,
        -0.0632428228855133,
        -0.0017400226788595319,
        0.043262675404548645,
        0.002834114944562316,
        0.07593504339456558,
        0.039437584578990936,
        -0.12909173965454102,
        -0.0011396927293390036,
        0.06725427508354187
    ]
}