{
    "id": "lpJE3bQrXIU",
    "title": "Get on the Waitlist NOW!!! - Hyundai Ioniq 5",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-05-04T02:03:56Z",
    "video_url": "https://www.youtube.com/watch?v=lpJE3bQrXIU",
    "category": "Science & Technology",
    "tags": [
        "Hyundai",
        "Motors",
        "EV",
        "Electric Vehicle",
        "EV6",
        "Ioniq 5",
        "Ioniq",
        "Electric",
        "Daily Driver",
        "DD",
        "Get on the waitlist NOW",
        "You're going to need to bribe someone to get THIS"
    ],
    "views": 678362,
    "likes": 24330,
    "comments_count": 1356,
    "description": "Answer your emails faster, in the appropriate tone, and with confidence with Grammarly! Go to  to sign up for a FREE account and get 20% off Premium!   Hyundai's Ioniq 5 has been on everyone's radar, and there's a big reason for it. It's because it's WICKED! It ticks pretty much off all the boxes for a fantastic daily driver at a price that you could consider it as an alternative to the Tesla Model Y.   Thanks to Openroad Hyundai Richmond for lending us this car! Check them out at    Buy a Tilta Hydra Mounting System:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - This car looks WICKED! 0:20 - Exterior impressions 1:34 - Liftgate and trunk impressions 3:00 - Rear seat impressions 3:25 - Front seat impressions 4:06 - Which trim we got and what are the differences 4:43 - Center console impressions 5:10 - Infotainment and climate control impressions 7:44 - Sponsor - Grammarly! 8:26 - Driving impressions 14:18 - Speaker impressions 14:48 - Charging info 15:32 - Pricing 16:20 - Final thoughts",
    "description_links": [
        "https://grammarly.com/ShortCircuit",
        "https://lmg.gg/Mi3ts",
        "https://geni.us/XHEjt",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Concept cars always look wicked and then they become production cars and they look like not wicked. The Ioniq 5 though, looks freaking sweet. Hyundai has barely changed it. I've seen lots of people compare it to Lancia Delta and I could see no higher praise for their engineers, especially like Lancia Delta and Cyberpunk combined together. Freaking sweet. Let's look at like just the headlights. The daytime running lights have this really cool Tetris look. That's just unlike any other car on the market and the whole front end of it. I think looks great. The only thing that kind of doesn't fit really is the Hyundai badge. It's sort of old school for how freaking modern this thing looks. Below the badge is a vany plate from OpenRoad Hyundai Richmond. Huge thanks guys for giving this, by the way. And below that, is this, well right now it's not a duct but it opens up and allows for ducting for your radiator. For when, I'm guessing it opens in sport mode. It definitely opens when you're charging. Moving around the side, we have the 19 inch alloy wheels. They're diamond cut, and I would just replace them. They're... they look fine. They make it a tiny bit more efficient than the twenties but I'm just over diamond cut wheels on SUVs. They just all look the same and kind of blah. it's so freaking big. Look at this. Like look, look at the wheel base. We did this on the EV6 as well but like the wheel base on this thing's longer than like a seven seater Hyundai. Around the back, I have to say the Ioniq 5 has a fine arse, like these little LEDs that are square, just look so cool. And we've got sort of a spoiler. I really hope that they do an N version of this with just a ridiculous spoiler. I would absolutely love that. Pulling up the trunk though, it's pretty practical. We don't have the top range version so we don't have the fancy, you know, open up auto lift gate, whatever. This one works great. I can kinda like it more than a powered one, honestly. In the trunk, you do get heaps of space. Although I did find something really weird down here. So first of all, if we remove this, so the first weird thing, well, we have tow hooks but they're just kind of laying in here. Probably not great for the trunk. What's even worse for the trunk though, whatever's on the go down here. It's soaked like, look at this. There's definitely a bit of wax but like, what's on the go here? There's a drain port and it's not draining very well. If someone that knows more about cars than me can tell me what's on the go here. It seems like this is gonna be a moldy mess in a couple months. It's just so wet. Like, this thing's actually drenched like that- ugh. Look at all that water. Weird condensation aside though, the trunk is pretty functional. They could have definitely given you more trunk space. If they made it look less cool and didn't have like the sloping trunk, but then we wouldn't compare it to a Lancia and say \"it looks sweet\". So, whatever. There is one cool thing that you can do, though. One second. You get a tiny bit more trunk space by moving the backseats forward. But it's sort of weird. Like if you look at it, you just get this weird \"no man's land\". It seems like a good spot to just lose your big mac. Getting into the rear seats. There's so much space back here. Like we have what, maybe three fingers of space between my head and the roof. I'm six feet tall. I also have like two hands worth of space between my knees and the front seat. There's heaps of space back here. You also have two charging ports, some vents and you can even recline. Whoa. All right, also the floor back here is completely flat. So if you're an Andy and you want to put a tripod in the center, you can. Moving into the driver's seat, the first thing that I noticed in here is that whoever does the plastic finishes at Hyundai deserves a huge raise. Like, look at this. This is hard plastic, this is hard plastic. We've got hard plastics all around here but all of them feel super premium and look awesome. We also have some, what is this? Like, fake leather of sorts, Andy? IT feels nice. It's a good spot to rest your arms. My only complaint about the driving position really is that this center console is just higher than the armrest on the side here. It's kind of this weird like, I feel like I'm leaning sideways when I'm in it. As you probably noticed, we don't have the top-spec option. This right here is the long range, rear wheel drive, Preferred. And so that's $5,000 less than the fancy version that you've probably seen all the reviewers have. I personally think that this is what you're gonna want to go for. Now, you don't have the lounging seats that are super fancy and this thing doesn't move. You also don't get a pano roof, but like, none of that really affects your day to day drive. And these cloth seats right here, they are very comfortable. The only thing that I wish that they had was seat memory. That's unfortunately not an option. All that said, layout up here is not perfect. The storage is kind of strange. We have phone chargers here and here but the one that you need to use for Android Auto for whatever reason, is up in the front. So that's where your phone has to go every single time that you get in. At least if you have a purse though instead of just chucking it in the passenger footwell, you can put it right here. They have this cool kind of little area for your purse to go. I like it. You can also open up this. It's where I've been storing my sunglasses. What I find really shocking about the interior of the Ioniq 5 and how the infotainment works is just how similar it is to the EV6, but how not annoying it is to use. And it's not like they've done an incredible job of it either. We do get a dedicated volume knob and a couple hard buttons and like a little tune switch. But at the same time like, the climate controls kinda suck. At least we do have dedicated up and down for the temperature and it works pretty great. I do wish that you could like swipe it and get larger increments but whatever, it served its purpose but like, where's my seat heaters? You have to hit warmer and then go in here and swipe up and then you're gonna go and go to like Android Auto or something. So if you wanna do it again you have to press warmer and go there. It's not a huge deal, but it just seems like they probably could have just put another little capacitive thing like there and there or something. I think the biggest reason though that this hasn't annoyed me when the EV6 just made me go bonkers, is that you're able to develop a muscle memory, even for stuff on touch screens. So we were able to come in here, hit this and it's totally fine. I don't need to look at it after a day or two. Same thing with like in the EV6, I didn't have to look at the climate controls that were there. But half the time when I didn't look, there're the media controls and it was just infuriating. I'm flabbergasted of how much more I like this, even though it's so similar. (laughs) Up front, we have two 12 inch displays and they look pretty great. They have this iMac like white bezel around them. And I think it looks pretty good. We've seen so much piano black, and this is just better. Like, look at this, I'm touching it. And you're not able to see that I have just a whole bunch of smudges there. It's great. Unlike, the steering wheel, which is smudge city right now because these are buttons that I press all the time. They look horrible and they're always going to look horrible. Another mild annoyance is that some of the buttons here that I press the most are Android Auto and set up and those are pretty far away. So you're kind of reaching, and especially on a bumpy road you can accidentally just swipe it instead of clicking the thing that you wanted. Overall though, my first couple days with this were very painless. It just comes with the settings pretty much how you want it. Unlike the EV6 where I had to change a bunch of things and turn a bunch of things off to make it like Hyundai just gets it to you. The gear lever is um, it's very phallic and you just give the tip a little bit of a twist and you're good to go but not until I tell you about our sponsor Grammarly. Thanks to Grammarly for sponsoring this video. Communicating online through email slack or discord can be easily misinterpreted and become a huge time block. This is why all working professionals need a tool like Grammarly. Grammarly is an all-in-one writing tool that helps you with grammar and spelling suggestions. Simply install the free desktop app, log in and start typing. There's also Grammarly Premium, which provides you with more in-depth feedback on your writing. We recommend checking out the tone transformation and clarity tools. They help you by rewording phrases to make sure you sound more confident by removing unnecessary jargon to help get your point across clear. Work smarter, not harder. Go to grammarly.com/shortcircuit to sign up for a free account and get 20% off Grammarly Premium today to help you save time and work more efficiently. Now that's drive her. (upbeat music) I'm gonna get some nitpicks out of the way here first. This screen that's in front of me it's 12 inches and I can't get over how dumb the way this is arranged. Pretty much my entire seating position is dictated by being able to see how fast I'm going and how much my charge is. Those are all locations where it's very easy for your steering wheel to cut it off. If you're sitting just a little bit too high. - Yeah. Just move something into the center and move the whatever the car thing to the side. I don't need to see my car all the time, right? - It's so dumb because this big center area that's the majority of the display does not show me any useful information. We have a car that's right there now. That'll tell me if there's like, someone in front of me. Like, I can't see it or like, let's see what else we have. Nothing of use. Oh, shut up. I can check my tire pressures. Great. I'll do that once every now and then, I don't know. It just seems like a waste. Every single other electric car or car with a digital dash has just had a reduced mode where it's pretty just, you know, your speed in the center and that's it. Love that. In my opinion, driving the Ioniq 5 is great. Now it's not particularly sharp and the suspension setup is not the best, if I'm honest. It's this weird combination of wallowy and harsh at the same time, because you know it's an electric car and it weighs 4,500 pounds or whatever. You need to have pretty stiff suspension. But at the same time, they've wanted this to be a comfort orientated car. So they've loosen up the dampers a bit. It's the setting where like the EV6 had adjustable dampers and I wanted like a softer setting. This is the softer setting, but I still want the option to have those stiffer settings as well. Also, the rebound on these dampers are, it's just terrible. Rebound is when your spring compresses, how it bounces back. And in this, you kinda get a two for one on big bumps. Like, you get the first bump and then you get a bump after that bump. And it's pretty crap. Same thing where like, if you hook it into a corner, it'll load up and then rebound and then load up again in this way. That's really just kind of concerning. And doesn't allow me to go very fast. - I think addict's little kind to this car. I personally don't like the suspension, 'cause it's like a little stiff, but when you try eye to corner- Geez, bye. It does not have enough support. Like the body roll control on this car. It's not great. - Now, we do have the rear wheel drive model. So it's a little bit on the slow side, but you wouldn't really know if you just step on it. So let's put it in sport mode here and just floor it- Oh yeah. That initial electric hit is really good. And then after that, it kind of just tapers off but you can destroy basically everyone off the line. What I cannot excuse as easily though, is the steering. They have four and a half degrees of casters. Basically, the more castor means it's going to physically lift up your car as you turn the steering wheel. Four and a half degrees isn't a whole lot. Instead, they've kind of just added in some weight into the steering wheel for you. And it takes way more effort than you would expect in a car like this, that's so easy to drive otherwise. - I don't really like the weight. It feels a little heavy even though it's just like in the drive mode but it still feels like a lot of time I'm using a lot of force on here, upper arm, and like the upper arm here. The handling is pretty good. It has the real world drive type of feeling. But like even in low speed you see like the body roll is, yeah. Like, if you like a tail-happy car, get this one. 'Cause the rear wheel drive works. - Now after a review of the EV6, I had to like reflect on why I was so annoyed while driving it. It really didn't ride all that bad. I should have been just fine driving it. But the reason that I wasn't was that it was just really loud in that car. Like you're just driving down the road and you can hear the tires. And maybe part of that was that they were on winters but I don't think it was a whole lot. There just wasn't the sound isolation that there is in this and it makes the whole thing feel so much more premium, especially in an EV where you don't have the engine noise to drown out the tires and the creaking and so on and so forth. You need to put so much more effort towards sound isolation and Hyundai has done that. Like I guess not silent, but it's more than usable in here and much better than like your typical car in this price range, at least in Canada. But we'll get to that later. (bottle clanks) We need to move that bottle. What I do like though is that Hyundai has understood the assignment. This is never going to be a sports car, no matter how much Kia stiffens up the chassis. It's gonna be something that millennial moms take their kids to soccer practice in and feel kind of cool while they do it. It is not going to become like an RS4 or something like that. - [Andy] Is this SUV though? - is it an SUV? Do we call it a mega hatch? Mega hatch is cool. I like that. Now, the range in this is excellent. In our long range rear wheel drive you get 480 kilometers of range and I've found that you're able to do the better part of 400. Now, if I had the all-wheel drive it probably would be the same as the EV6. Not so much because on paper it's different but just because the all-wheel drive has more power and my right foot has no self-control. Okay. There must be a cop up here. Everyone's just blinking their lights at me. Oh, they got a lot of people. Now we don't have the Bose premium system in here but from what I've heard, that's not fantastic. And neither are these. There's a lot of mid base and no sub base. And the whole thing kind of lacks the richness that I really want from a car stereo. But at the same time, like if you're coming from a base Civic, you'll be pretty impressed. (upbeat music) One other thing, a lot of people got really mad at me after the EV6 video because I didn't talk about charging. And after doing some more research, they are right. In Canada, I could not care less that this does 350 kilowatt charging. There are some 50 kilowatt and some that in theory do like 2- or 300 but those are mostly from Petro Canada. And they're always broken. They've left me stranded before. Awful time. If you're here and in basically all of North America, you need to have at-home charging because it's just such a bad time doing it elsewhere. If you're in Europe though and hopefully here in the future having the 350 kilowatts in this, is gonna be wicked. You can go from 10 to 80% in just 18 minutes. That is freaking awesome and I should have brought it up in the EV6 video, to be fair. What's extremely compelling about this car though is the price, at least in Canada. In Canada, this car right here is $53,000. The only two things that I really miss that are options in the limited package are memory seats and auto wipers. All of this means that in Canada at least, the Ioniq 5 just takes a dump on the model Y's face. That thing starts at $82,000 here. The value proposition's just not there. In the U.S. it's a little bit more interesting. I think there's only a three grand price difference between this and the model Y down south. So, ah, try them both. See which one you like more, I guess. But yeah, if you're in Canada, get on that wait list now. This thing's fricking sweet. I like it. So the Ioniq 5. it's a car that understood the assignment. If you want to get from your house to your job in a fairly comfortable, very nice looking car, this is what you want to get. And if you live British Columbia, especially with like the tax rebates and the fact electricity is cheap here, 'cause it's all hydro- - [Andy] And the gas price! - Yeah. And the current gas prices, it's hard to justify not getting one of these, really. Geez. Huge thanks to OpenRoad Hyundai in Richmond for hooking us up with this thing. It's been very difficult to get cars because it's very difficult for anyone to get cars right now. So if you want one of these, hit them up get on the wait list. Actually, do they even have a wait list right now, Andy? - [Andy] Yeah, they paused the wait list. - They paused So get on the list to get on the wait list, I guess.",
    "transcript_keywords": [
        "car",
        "thing",
        "kind",
        "Hyundai",
        "pretty",
        "time",
        "wheel",
        "drive",
        "Canada",
        "rear wheel drive",
        "wheel drive",
        "great",
        "Ioniq",
        "Lancia Delta",
        "trunk",
        "cars",
        "Grammarly",
        "bit",
        "space",
        "lot"
    ],
    "transcript_entity_values": [
        "82,000",
        "Y",
        "half",
        "seven",
        "some 50 kilowatt",
        "Hyundai",
        "19 inch",
        "Ioniq 5",
        "EV",
        "Grammarly Premium",
        "just 18 minutes",
        "three",
        "OpenRoad Hyundai",
        "One",
        "Four and a",
        "Europe",
        "six feet",
        "Lancia",
        "20%",
        "U.S.",
        "British Columbia",
        "Lancia Delta",
        "5,000",
        "Tetris",
        "a couple months",
        "Petro Canada",
        "iMac",
        "Bose",
        "half degrees",
        "my first couple days",
        "Andy",
        "second",
        "spring",
        "the 350 kilowatts",
        "53,000",
        "Grammarly",
        "winters",
        "daytime",
        "300",
        "North America",
        "350 kilowatt",
        "first",
        "four and a",
        "RS4",
        "two",
        "The Ioniq 5",
        "two 12 inch",
        "Canada",
        "10 to 80%",
        "400",
        "12 inches",
        "only two",
        "Richmond",
        "Kia",
        "EV6",
        "4,500 pounds",
        "the Ioniq 5",
        "Android Auto",
        "today",
        "day",
        "480 kilometers"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "LAW",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "GPE",
        "GPE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "GPE",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "EVENT",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY"
    ],
    "vector": [
        -0.07186055183410645,
        0.02582227997481823,
        0.07402437180280685,
        -0.06228364259004593,
        0.05908255651593208,
        0.036904461681842804,
        0.004596218466758728,
        0.07597361505031586,
        0.018644174560904503,
        -0.019478004425764084,
        0.010817120783030987,
        0.023745767772197723,
        0.07071385532617569,
        -0.06361949443817139,
        -0.02186836116015911,
        -0.020337173715233803,
        0.010998479090631008,
        -0.033122215420007706,
        -0.01862618513405323,
        -0.0370941236615181,
        -0.03457340598106384,
        -0.049035269767045975,
        0.01040191762149334,
        0.04700108990073204,
        -0.05086417496204376,
        0.012408299371600151,
        -0.0013178769731894135,
        0.03374408930540085,
        -0.044913746416568756,
        -0.12133332341909409,
        -0.0077277799136936665,
        0.019785786047577858,
        -0.0035289826337248087,
        -0.08641660213470459,
        -0.037684664130210876,
        -0.04048115387558937,
        -0.025232184678316116,
        -0.07200770080089569,
        -0.12640605866909027,
        -0.06106998398900032,
        0.015248236246407032,
        -0.07883840799331665,
        -0.06717102974653244,
        -0.06120869144797325,
        -0.0069478279910981655,
        -0.029805095866322517,
        0.06691247224807739,
        -0.045852404087781906,
        0.03789214789867401,
        0.03204016759991646,
        -0.09380478411912918,
        -0.05374867841601372,
        0.05689942464232445,
        -0.06948933005332947,
        -0.13377058506011963,
        0.006034460850059986,
        -0.018423566594719887,
        -0.01230225246399641,
        0.06628353893756866,
        -0.03738543391227722,
        0.10815373808145523,
        -0.054273586720228195,
        -0.07680721580982208,
        0.0795646384358406,
        0.0006688731955364347,
        -0.013963302597403526,
        0.011641936376690865,
        0.059272900223731995,
        -0.001241974881850183,
        0.028201932087540627,
        0.03681934252381325,
        0.007433433085680008,
        0.018646014854311943,
        0.0386720709502697,
        -0.0028407180216163397,
        -0.023810261860489845,
        0.08388375490903854,
        -0.07214591652154922,
        0.0028992441948503256,
        0.037747226655483246,
        0.005667694378644228,
        0.010412285104393959,
        -0.055718425661325455,
        -0.021820977330207825,
        0.009878184646368027,
        -0.012591431848704815,
        -0.005936282686889172,
        0.03582041710615158,
        -0.04019991308450699,
        -0.06849243491888046,
        -0.024851592257618904,
        0.03494473174214363,
        0.018237382173538208,
        -0.047994937747716904,
        -0.027730146422982216,
        0.06808999925851822,
        -0.02423725090920925,
        -0.05912131443619728,
        -0.06356413662433624,
        0.10093442350625992,
        0.0825120136141777,
        0.009744049981236458,
        0.002761540934443474,
        0.014224792830646038,
        -0.07675077021121979,
        -0.046364665031433105,
        -0.006664319895207882,
        0.07300256192684174,
        -0.046899668872356415,
        0.003333702916279435,
        -0.043589282780885696,
        -0.021098667755723,
        -0.0677204430103302,
        -0.0173628032207489,
        -0.04723667725920677,
        0.01637539267539978,
        -0.050340622663497925,
        0.05443006753921509,
        0.026670293882489204,
        -0.0007268121116794646,
        0.07187718898057938,
        -0.0675610825419426,
        0.005889121908694506,
        0.015727782621979713,
        0.05256165191531181,
        0.02924911119043827,
        -0.07919688522815704,
        3.1222907893045575e-33,
        -0.0291629396378994,
        0.09780803322792053,
        -0.02176240086555481,
        0.008147955872118473,
        -0.002990070963278413,
        0.012032215483486652,
        0.022536246106028557,
        0.07995889335870743,
        -0.11394651234149933,
        0.05240505561232567,
        0.02226480282843113,
        0.045588258653879166,
        9.041072189575061e-05,
        0.010445625521242619,
        -0.02429625764489174,
        -0.027860654518008232,
        -0.054291240870952606,
        0.0006321920081973076,
        -0.06391396373510361,
        -0.04562264308333397,
        -0.0007665595621801913,
        -0.017632044851779938,
        0.017497943714261055,
        0.07139229029417038,
        0.0632903203368187,
        0.03346740081906319,
        0.05966243892908096,
        -0.05008772015571594,
        0.010179978795349598,
        0.04519622400403023,
        -0.08892356604337692,
        0.030596571043133736,
        0.027159912511706352,
        -0.02930491417646408,
        0.007177889812737703,
        0.010109773837029934,
        -0.1302712857723236,
        -0.043889306485652924,
        -0.04055454954504967,
        -0.010708875954151154,
        0.10900741815567017,
        -0.0023240402806550264,
        -0.11215383559465408,
        -0.012108223512768745,
        0.008726255968213081,
        0.03479277715086937,
        0.0297223050147295,
        -0.02211560495197773,
        0.034341178834438324,
        0.015141635201871395,
        -0.019710781052708626,
        0.007514312397688627,
        -0.09380809962749481,
        -0.03343852981925011,
        -0.039392489939928055,
        0.01576891355216503,
        -0.006137090735137463,
        -0.005129479803144932,
        -0.01001681201159954,
        0.03540348261594772,
        -0.017748957499861717,
        0.04855412244796753,
        0.048584092408418655,
        -0.02290382981300354,
        -0.0970090925693512,
        0.0116701889783144,
        0.010533569380640984,
        -0.02766796201467514,
        -0.05439433827996254,
        0.053959328681230545,
        0.017120754346251488,
        0.03981756418943405,
        0.018850795924663544,
        0.031092381104826927,
        0.010444125160574913,
        0.017200283706188202,
        -0.07908926904201508,
        -0.025049040094017982,
        0.04777097702026367,
        0.03765411674976349,
        -0.03326045349240303,
        -0.0030293683521449566,
        0.07728904485702515,
        0.08068464696407318,
        0.04928058013319969,
        -0.05770518258213997,
        0.021992655470967293,
        -0.01846247725188732,
        -0.031900737434625626,
        0.024111395701766014,
        0.01617560349404812,
        0.056940194219350815,
        -0.026094213128089905,
        -0.01953110471367836,
        -0.035223089158535004,
        -6.474866064722986e-33,
        0.03724885731935501,
        -0.024301627650856972,
        0.012774751521646976,
        -0.013085206970572472,
        0.07395248860120773,
        0.04671754688024521,
        0.06803935766220093,
        0.021744750440120697,
        -0.010857936926186085,
        0.02558683231472969,
        -0.00204759300686419,
        0.012231557630002499,
        -0.056842658668756485,
        0.002986681181937456,
        0.005480241030454636,
        -0.020976489409804344,
        0.08073266595602036,
        -0.14725027978420258,
        -0.034582480788230896,
        -0.03913605213165283,
        0.10408797115087509,
        0.07822109758853912,
        0.032092515379190445,
        0.039267104119062424,
        0.01261583436280489,
        -0.02550218440592289,
        0.06058003753423691,
        0.04294547438621521,
        -0.04195774719119072,
        0.031922973692417145,
        -0.04381147399544716,
        -0.07255622744560242,
        -0.013491141609847546,
        0.0269200149923563,
        0.03660203143954277,
        0.01692267693579197,
        0.03680472448468208,
        0.018720777705311775,
        -0.06530320644378662,
        -0.0247549619525671,
        -0.0368129201233387,
        0.02541954256594181,
        0.07416502386331558,
        -0.028499018400907516,
        0.042863212525844574,
        -0.07045292854309082,
        0.02052913047373295,
        -0.014336742460727692,
        0.008050825446844101,
        -0.0026645648758858442,
        0.02330016903579235,
        -0.058974772691726685,
        -0.009638099931180477,
        0.12114343792200089,
        -0.04434533417224884,
        -0.012779380194842815,
        0.03521931171417236,
        0.025668958202004433,
        -0.03866720572113991,
        0.038063064217567444,
        0.06143052875995636,
        0.014061812311410904,
        0.012411972507834435,
        -0.07974366843700409,
        0.023832548409700394,
        -0.17282597720623016,
        0.11232826858758926,
        -0.030129192396998405,
        -0.08009596914052963,
        -0.0002574558602645993,
        0.08497229218482971,
        -0.041866011917591095,
        0.01853531040251255,
        -0.0703825131058693,
        -0.05235408619046211,
        0.06678781658411026,
        -0.012231582775712013,
        0.012479751370847225,
        0.01923539862036705,
        -0.0983147844672203,
        -0.02162688411772251,
        0.0005979280103929341,
        0.03700239956378937,
        0.03352733701467514,
        0.086783766746521,
        0.056414347141981125,
        0.03362666442990303,
        0.017070135101675987,
        0.06103581190109253,
        0.09656352549791336,
        -0.018950538709759712,
        -0.011094529181718826,
        -0.027423014864325523,
        0.029156643897294998,
        -0.044201772660017014,
        -6.740896196788526e-08,
        0.023995008319616318,
        -0.014013142324984074,
        -0.08294989913702011,
        0.00943115446716547,
        -0.008393542841076851,
        -0.04130668565630913,
        -0.029062123969197273,
        -0.019443798810243607,
        0.0486082062125206,
        -0.035822365432977676,
        0.06656990200281143,
        -0.11228378117084503,
        -0.026003006845712662,
        0.09651831537485123,
        -0.02683502621948719,
        0.005044909194111824,
        -0.0303774643689394,
        0.0969289168715477,
        -0.07476145774126053,
        -0.03239506483078003,
        -0.05392690375447273,
        0.05434611439704895,
        0.014589752070605755,
        -0.05040295422077179,
        0.031016550958156586,
        -0.009745673276484013,
        -0.017460769042372704,
        -0.0021537651773542166,
        0.1733361780643463,
        -0.15950359404087067,
        -0.14816172420978546,
        -0.01695253513753414,
        0.029566416516900063,
        -0.06749992072582245,
        0.026876000687479973,
        -0.03202994912862778,
        -0.028138017281889915,
        0.03807182237505913,
        0.02692587301135063,
        0.015663912519812584,
        0.054372597485780716,
        -0.0388929508626461,
        -0.008004887960851192,
        0.013988563790917397,
        0.023011263459920883,
        0.028100550174713135,
        -0.043394651263952255,
        -0.11954861134290695,
        -0.019942380487918854,
        0.0339461974799633,
        -0.04264269769191742,
        -0.07754126936197281,
        -0.02281186170876026,
        0.08152259886264801,
        0.04316994175314903,
        0.04013257101178169,
        0.01927734911441803,
        -0.03473931923508644,
        -0.010927174240350723,
        -0.01322726346552372,
        0.04580715671181679,
        -0.06272336840629578,
        -0.05096516013145447,
        0.07557244598865509
    ]
}