{
    "id": "LQ4xNJ7L3kE",
    "title": "3D Printing for HOW MUCH? - Anycubic Kobra Go",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-09-25T19:25:09Z",
    "video_url": "https://www.youtube.com/watch?v=LQ4xNJ7L3kE",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "3d printer",
        "anycubic",
        "kobra",
        "go",
        "entry level",
        "starter",
        "hobby",
        "hobbyist"
    ],
    "views": 480225,
    "likes": 18372,
    "comments_count": 941,
    "description": "Thanks to Anycubic for sponsoring this unboxing of the Anycubic Kobra Go! Purchase your own on their official website at  or Amazon at   Anycubic sent their new entry level printer, the Kobra Go, for Dan to check out. At a price of $200, does this offer the performance you need at such a competitive price?  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:23 Unboxing 2:00 Looking over the components 4:25 Building the Anycubic Kobra Go 7:25 Powering on and autoleveling 8:36 Preparing our test print 10:25 Printing 12:04 Evaluating our prints 15:14 Conclusion",
    "description_links": [
        "https://bit.ly/3euWRrP",
        "https://amzn.to/3qMA3GT",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Anycubic has sent over a 3D printer. This one I'm actually quite excited about as well. I mean, I just love 3D printers in general, but this one, for the price that it costs and for the features that it has, is probably going to be the best entry level printer I have seen. I'm very excited. So thanks to Anycubic for sponsoring this video, and let's see what they sent us. Got our assembly instructions. It's quite... Quite the booklet. It's all nicely laid out in foam packaging. It's got all our little bits and bobs. Let's just get in there and start taking it apart. This one does ship semi-disassembled. Most of the base plate is going to be all together, and then we pretty much just have to stuff the top access on top of it. Nice thing about this one, is it comes with this textured metal, magnetic build plate, so that'll pop off really nice and then you just... Your part's right off. And then we get to the main event, the bottom plate. Let's see if I can get this out without destroying everything. Okay. That's easier. We have a USB stick. So I'll have our firmware and our profiles for Cura, which I believe this uses. There we go. Yeah, it's a little USB stick and it even has a little SD card reader slot on the side. Spare nozzle, what size is this? Spare, 0.4 millimeter nozzle. Probably comes one with attached. We haven't quite got there yet. And what on Earth is this? Oh! This will be our PTFE lining tube for the bowden. This is a bowden-drive printer. It comes with an eight gig micro SD card there. Let's get this out and have a look at our base plate. Oh! There's even more stuff that I didn't even see. Get that out of the way. So here is gonna be the big brains of our 3D printer. This design is a little bit different than some of the other ones. A lot of the cheaper models like this one run on wheels. So the Y-axis here, as well as the X-axis and jaggery-axis on this, run on these V wheels, and then they run into these little slots on the side of the aluminum extrusion, and they just sort of glide along there. It's a little bit of quieter operation than if you have a ball bearing, but it's a less precise mounting option and it's even less precise than something like a linear rail. But at this price in this category, I think V wheels is completely acceptable. Our hot end assembly looks quite nice. It looks like it's a standard E3D V6. And one of the most exciting features about this printer, is it comes with mesh bed leveling. So it looks like we have an inductive probe at the bottom here. That's what this little orange protrusion is, and that'll detect the bed, and the magnetic field will get in the way and then it can know exactly how level your bed is, so you don't have to worry about that as much. It makes this easier for beginner. Anycubic is calling this technology Anycubic LeviQ. I don't know if there's any proprietary magic in there or if they're just making up fun names. But it seems like it's just magnetic inductive leveling. It'll be good enough. And especially at this price performance ratio, upgrading that down the line, we'll be talking about that a lot. Upgrading is more than a possibility, because it's here in the base. I guess, the last thing to do now is just to assemble the thing. Kyle has assured me that the default pit set for our LTT screwdriver, lttstore.com, come with pretty much every bit that you would need to assemble a 3D printer. So we'll see if he's lying or not. I think these are our jet access profiles. This one is blank, and this one here has a little nub-in on the side of it. There's the nub-in. What's the front? The front has the thing with the dingle arm. Nice and light. I'm impressed at all. The extrusion is nice and sturdy. One thing that you don't want and you do get on some of the cheaper printers, is they're really wobbly. It looks like they've spent the budget for this printer in the areas that matter, rather than... It's designed to be made cheaply, it's not made cheaply. Okay, well, I'm gonna disappear and get some more of this assembled, and when we get to something interesting like maybe, I don't know, this gantry assembly, we'll see you again. Bye. (upbeat music) And we're back. It's another day. We've got the printer mostly assembled. It wasn't very difficult. It only took roughly an hour. Very simple. The instructions were okay. They're not the best I've ever seen, but they were easy to follow, and all the parts fit into each other. There's no confusion. All the little bags of screws are nicely labeled. All the cables for the various axis and end stops are all really nicely labeled, and it just sort of put itself together. It was great. We do have some steps to do now, that are a little more complicated than some other types of printers. Because we have these V wheels, you can see we've got a hell of a lot of play everywhere. We're gonna need to do some, basically, tramming and calibration. They've given us this wrench, and most of these wheels here have an eccentric nut, which allows us to tighten them up and make sure we can get this slop out of the system. One thing I'm not entirely enthused about, is that it's only driven and supported on one side. I guess, as they've done that as a cost saving measure. But I'm not entirely sure this is gonna tram up the way that I want it. That feels really tight now, but I'm concerned it's not gonna move very well. What's kind of interesting is they recommend that we take this little cardboard box that all the tools came in and bring the X-axis... Sorry, the... Bring the Z-axis up, throw this over here and then lower the Z-axis down onto the toolbox. That's sort of like squaring it, I guess. And now we've gotta loosen some of these screws. I've got the V wheels all nice and tight now, and there's no more flex in this X-axis gantry. One of the things that's a little bit interesting, is there's no adjustment for the bed at all, and I wonder if they've done this as an extreme cost saving measure, because we only have one support on this side to drive the Z-axis up and down. But I think they've included bed mesh leveling, specifically, to address the tramming issue. So what I'm seeing right now, even though I have everything relatively tight and perfect... We can't go too tight, because then the motors won't be able to move it. But if this is your bed, what I'm seeing on the nozzle right now, is it sort of starts here and then it comes in an angle towards the right hand side of the bed. And if we didn't have bed mesh leveling, there would be really no way in this printer, at least, that I see, with no adjustments on the bed, to get rid of that. But with bed mesh leveling, I can measure all the different points on the bed and then I can move the Z-axis up, right? I can... Sorry. Yeah, the Z-axis would come up as the nozzle moves to the right, and it would effectively get rid of that completely. Okay, we've got the power in. It's got a nice color screen on the front there. We will start off, I guess, by giving it a home. I can hear, rather, loud fan, not super loud. But you'll notice it from the power supply, I guess. There we go. And let's try the auto leveling feature. So it's gonna home all the accesses, and then it's going to, hopefully, do an auto level. So it should do a full probe of the entire bed, and my hope is that it stores that internally so that I don't have to do an auto level every single print, 'cause this is rather slow. Especially with the Z-axis only being driven on one side, I don't think it wants to do super fast Z movements. But you'll never need that anyway, really. For me, I always run a bowden set up because it does allow for those faster print speeds. I want my prints now, and this is a great way to do it. The shorter the tube, the better. So by having it really, really close to the carriage here, you're gonna have less of that slot. So this is a really good setup and a nice trade off. I always like to see that. The test print I've done, I've tried to go sort of balls to the wall, and they're claiming 10 centimeters a second to a hundred millimeters a minute. Sorry, a hundred millimeters a second. So I've asked the print to make it do a hundred millimeters a second, pretty much the whole time. So I'm excited to see that. See if we lose any steps. It appears that this printer uses the Marlin firmware, which is quite nice. That's what I use at home too. You could have, I guess, then technically flash whatever you wanted, but... I don't know. And that also means that you can pretty much, use whatever slicing software and host you want. For me, I like PDA host, or Repetier, or Repetiter. It's nice for machine control. I run my machines at home via USB, so I don't print with SD cards 'cause I'm weird. Don't add me. The nice thing about that, is you get to see real time feedback of your print. We're gonna be doing this little, fidgety, spinnery thing, which should give us some indication of tolerances that this can achieve, and also, should print nice and quick too. It's mostly just... It's mostly just external perimeters and a little bit of infill. I couldn't get the USB connected. I don't know if that's my fault or if it doesn't contain it, but I can't really find any information on that. Maybe it was just a guess on my part. But I've got my SD card in now, and let's... Let's get this print sliced up. I'm gonna use PrusaSlicer for this, 'cause that's what I like. Now I'm just getting the filament now. We've moved over to the build corner because we gotta do some other filming, and this print's gonna take 20 minutes or so. Let's just push it through manually and then we'll do some feeding. I just wanna get it through the bowden tube and make sure it's not encountering any resistance as I push it into the hot end. The more resistance you get through your hot end assembly, the worse your volumetric speeds are gonna be, 'cause your stepper motor's not gonna be able to keep up. And if we wanna be printing fast, then we need no resistance. That's printing nice and fast. So first layer of doing at about, I don't know, 60 millimeters a second, which is still pretty aggressive for our first layer. And it's laying it down quite nicely. I am seeing some issues with that tramming, though, so maybe I didn't do the mesh bed leveling properly. We're getting a little bit of over extrusion there, but again, this is all my fault. The printer is moving absolutely silently, so I think it has to use the TMC 2130s. Really what you're buying at this price point, is just a base and a platform to go off of, and if they've included all the mechanical stuff that you could possibly need, then you can go through and upgrade it, like the fan and the power supply, or you could get a different power supply or a quieter power supply. You could put a different firmware on it, you could adjust the settings, adjust the tune, that sort of thing. The software they've included has got some really nice quality of live features too. I can pause the print. And it also has power loss protection. We're not gonna test that, 'cause I just kind of want this print to finish. But if I unplug the cable or you have power outage, and the print will resume. It'll reheat the hot end, it'll re-home itself and start back from where it left off, which is nice. I guess we'll let this print finish and see if the quality's good, see if the tolerances are good enough. I mean, minus all the stringing. But again, that's my fault. That's not necessarily the printer's fault. Okay, I'll see you in a bit. I've got it assembled, we gave it some testing, and I spent the rest of the afternoon kind of fiddling with it. Now when you're 3D printing, you have a bunch of variables. You have, how fast you're moving the tool or the print head, or the X carriage. Every single one of these variables needs to be correct and controlled. And for a beginner, I think it's quite difficult to know which one of these may be tens to 30 variables you have to target to get a proper print or a part. We'll start with this one here, which I printed quite aggressively. This was done at a hundred millimeters a second, which is sort of the upper echelon of what Anycubic is claiming for this printer. And as you can see, we had X-axis layer shift. So the stepper motor that controls the position of this axis here, was moving too fast, there was too much tension on the V wheels, whatever, and the computer thought that the tool was in a spot that it wasn't. The next one, this was... I was just printing and screwing with the printer at the time, so this doesn't really count. And now we can see we're kind of... We're getting better as we go down the line here. When you buy an expensive printer, sort of maybe double the cost of this one, triple the cost of this one, what you're really paying for, in my opinion, is less variables that you'd have to control an account for. That doesn't necessarily mean that they're gonna be the best. I think if you're gonna be buying a cheap printer like this, there's going to be a long learning curve. Even for me, just getting the V wheels to be the exact correct tension so that there wasn't sag on the far side of the axis, and that the Z-axis height adjust was actually moving both of them, on the first couple of prints here, I didn't have them tension quite correctly, and so when the Z-axis height adjust was moving the X carriage, it was just pulling this side up and down, and this side was not really moving that much. So this came off the printer and they're all free, but it's got some blobs and things. I was playing with the retraction settings, quite a lot. There seems to be some issues with over extrusion. It likes to blob. That could be this filament, but it's new and it's dried. We can see some under extrusion artifacts along this side here, which is very interesting. And, yeah, a lot of stringiness. I will give credit to the bed. The bed works extremely well. It's nice rough surface, it's not peeling. Everything stuck to it really quite well. One quality of light feature that I think it's missing, is end stops along the backside, so that when you put the bed on it's sort of square. I was finding I'm having to grab the the hot 60 degree bed just to get it straight. The only problem is that this printer is $200. It's even cheaper right now, as it's offered as an early bird thing. That's incredibly good value for what you get. You get a... You get a 3D printer for 200 bucks. I guess for $200, this is a fine printer that can squirt plastic where you want it to squirt. The problem is that if you're a little more advanced, you might not have this as a good base for the long run. But for 200 bucks, it's a great gateway drug into the 3D printing hobby. And as you've only spent $200, you've still got loads of money left over to go buy like a $600 touchscreen toaster. Sarah did a review of that, you can check out here. Thanks to Anycubic for sponsoring this video. They make a lot of other good stuff too. Checking 'em up. Thanks, bye.",
    "transcript_keywords": [
        "printer",
        "bed",
        "Nice",
        "print",
        "Zaxis",
        "side",
        "thing",
        "sort",
        "guess",
        "Anycubic",
        "bed mesh leveling",
        "wheels",
        "bit",
        "leveling",
        "power",
        "good",
        "bed mesh",
        "Nice thing",
        "mesh bed leveling",
        "lot"
    ],
    "transcript_entity_values": [
        "60 degree",
        "Spare",
        "a hundred millimeters a minute",
        "Kyle",
        "PTFE",
        "One",
        "20 minutes",
        "one",
        "USB",
        "PrusaSlicer",
        "another day",
        "micro SD",
        "Anycubic",
        "roughly an hour",
        "afternoon",
        "second",
        "tens to 30",
        "LTT",
        "V6",
        "Anycubic",
        "Marlin",
        "a hundred millimeters a second",
        "first",
        "Repetier",
        "10 centimeters a second",
        "Sarah",
        "the stepper motor",
        "200",
        "600",
        "Earth",
        "200 bucks",
        "Cura",
        "SD",
        "the TMC 2130s",
        "eight",
        "Repetiter",
        "0.4 millimeter",
        "60 millimeters"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "EVENT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "LOC",
        "MONEY",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY"
    ],
    "vector": [
        -0.12105204910039902,
        -0.0012399584520608187,
        -0.07377976924180984,
        -0.034709300845861435,
        0.012136331759393215,
        0.01446081418544054,
        -0.03878231719136238,
        -0.00399330398067832,
        -0.03458327427506447,
        0.005818737205117941,
        -0.0008783843368291855,
        -0.033427245914936066,
        0.02399163320660591,
        -0.025676628574728966,
        0.015008198097348213,
        -0.07663212716579437,
        0.02971021831035614,
        -0.019928399473428726,
        -0.059686329215765,
        0.02797628752887249,
        -0.011644840240478516,
        -0.03887312114238739,
        0.04953997582197189,
        -0.03346962481737137,
        0.05006648972630501,
        -0.019967975094914436,
        0.012320469133555889,
        -0.09270898997783661,
        0.008935033343732357,
        -0.07929928600788116,
        -0.004219775553792715,
        0.07038535177707672,
        0.03482287377119064,
        -0.03917231038212776,
        0.09828754514455795,
        -0.07379651814699173,
        0.02650701068341732,
        -0.06460664421319962,
        -0.06960926204919815,
        -0.005444811657071114,
        -0.00966364424675703,
        0.005972385406494141,
        -0.05374067276716232,
        0.016284683719277382,
        -0.019892318174242973,
        0.019550438970327377,
        -0.025804173201322556,
        -0.01720999740064144,
        0.01007192861288786,
        0.021961020305752754,
        -0.040213193744421005,
        -0.12957248091697693,
        0.010101412422955036,
        -0.09185459464788437,
        -0.03212064504623413,
        0.035962462425231934,
        -0.030573468655347824,
        -0.04401758685708046,
        0.01739613153040409,
        -0.012022129260003567,
        0.025244934484362602,
        -0.03658898547291756,
        -0.09430421143770218,
        0.08001165837049484,
        0.03198958560824394,
        0.004256310407072306,
        -0.057810090482234955,
        0.04831074923276901,
        -0.03378749266266823,
        -0.0017940906109288335,
        0.021062590181827545,
        0.009681244380772114,
        0.06810954213142395,
        0.09122058004140854,
        0.09049509465694427,
        -0.05062754824757576,
        0.13628265261650085,
        -0.04083939641714096,
        0.007107850629836321,
        0.04272627830505371,
        -0.019235774874687195,
        -0.03264231234788895,
        -0.07081611454486847,
        -0.0019526229007169604,
        -0.014238972216844559,
        -0.06570366770029068,
        0.019532395526766777,
        0.07999236136674881,
        -0.0011558345286175609,
        -0.06279025971889496,
        0.03944271802902222,
        0.06646925210952759,
        -0.024336377158761024,
        -0.008580371737480164,
        -0.10341201722621918,
        0.03287731483578682,
        0.004123191814869642,
        -0.010705267079174519,
        0.024235688149929047,
        0.03782087191939354,
        0.05672045797109604,
        0.03725668787956238,
        0.07868899405002594,
        -0.08074044436216354,
        -0.06962063908576965,
        -0.07067632675170898,
        0.019695760682225227,
        0.04291345924139023,
        0.014093756675720215,
        0.056688565760850906,
        -0.075259730219841,
        -0.016681518405675888,
        -0.05618123337626457,
        -0.05256238952279091,
        -0.020656079053878784,
        -0.006875515449792147,
        -0.025042908266186714,
        -0.05562896654009819,
        0.08074165135622025,
        -0.08687125891447067,
        -0.006536782719194889,
        -0.0385592095553875,
        -0.006408421788364649,
        0.04650416225194931,
        -0.10333117097616196,
        -0.025455553084611893,
        -0.04740022122859955,
        -7.67201540921032e-34,
        -0.02661343477666378,
        0.06945385038852692,
        -0.04962047562003136,
        -0.09156864136457443,
        0.05458875000476837,
        0.030543778091669083,
        -0.020050013437867165,
        0.011747006326913834,
        -0.058564797043800354,
        0.0005964732845313847,
        -0.10386341065168381,
        0.0893341600894928,
        -0.03152969852089882,
        0.14368537068367004,
        0.011537795886397362,
        -0.06916038691997528,
        0.030600259080529213,
        0.03686051070690155,
        -0.035087551921606064,
        0.029618067666888237,
        -0.019706426188349724,
        -0.08171629160642624,
        0.027667559683322906,
        0.05487669259309769,
        0.09255965054035187,
        0.012307730503380299,
        0.0129732396453619,
        -0.03413574770092964,
        0.05002717673778534,
        0.0221872441470623,
        0.034360527992248535,
        -0.05354300141334534,
        0.006086915265768766,
        -0.06811841577291489,
        -0.03832614794373512,
        0.016399439424276352,
        -0.09846428781747818,
        -0.054351806640625,
        -0.003655824577435851,
        0.06520570069551468,
        -0.0290850717574358,
        0.04610969498753548,
        -0.04025651142001152,
        -0.0160247590392828,
        -0.02902405895292759,
        0.03462477773427963,
        0.050945017486810684,
        0.06220482662320137,
        0.039524227380752563,
        -0.031158603727817535,
        -0.04524596035480499,
        0.006062809843569994,
        -0.11636561900377274,
        0.028602322563529015,
        0.03005874902009964,
        -0.046853456646203995,
        0.050232451409101486,
        -0.0050844899378716946,
        0.05180177837610245,
        -0.029948122799396515,
        -0.008200970478355885,
        0.0942845568060875,
        0.06906809657812119,
        0.02278324030339718,
        -0.06007898598909378,
        0.05731487274169922,
        -0.03666963055729866,
        0.02254132740199566,
        -0.06050051376223564,
        -0.025681881234049797,
        -0.08635084331035614,
        -0.015513238497078419,
        0.04427593946456909,
        -0.059450436383485794,
        0.01329493522644043,
        0.057930540293455124,
        -0.06631267070770264,
        -0.11831087619066238,
        0.030490493401885033,
        0.03528297320008278,
        -0.08938305824995041,
        0.03825991600751877,
        -0.015231386758387089,
        -0.0472496822476387,
        0.02015187218785286,
        -0.015371891669929028,
        0.039946168661117554,
        0.014345178380608559,
        -0.08877062052488327,
        0.020930107682943344,
        -0.00860729068517685,
        0.011572958901524544,
        -0.04570138826966286,
        -0.04706403240561485,
        -0.002664626343175769,
        -3.583257225559671e-33,
        -0.006783778313547373,
        0.026762980967760086,
        -0.02995261922478676,
        0.03426803648471832,
        0.08443079888820648,
        0.041891805827617645,
        0.028160003945231438,
        0.03513491898775101,
        0.029544532299041748,
        -0.02905384451150894,
        -0.05288499966263771,
        -0.03690364211797714,
        0.007555469870567322,
        0.013640949502587318,
        0.02535966783761978,
        -0.07052623480558395,
        0.024073878303170204,
        0.02356814220547676,
        -0.0011363239027559757,
        -0.08981635421514511,
        0.0719522014260292,
        0.04004383459687233,
        -0.02922832779586315,
        0.08946529030799866,
        0.02067515067756176,
        0.015263405628502369,
        0.04118674248456955,
        0.02944096364080906,
        -0.03144308179616928,
        0.11817310005426407,
        -0.03780120238661766,
        -0.09721802175045013,
        -0.00962801743298769,
        0.04169687256217003,
        0.04044753685593605,
        0.001846648403443396,
        0.0760117918252945,
        0.09680790454149246,
        0.010217245668172836,
        -0.05451162904500961,
        0.00915958359837532,
        -0.011884968727827072,
        -0.0018525703344494104,
        0.022184567525982857,
        0.0016542254015803337,
        -0.049285758286714554,
        -0.07497887313365936,
        -0.033981163054704666,
        0.057989392429590225,
        0.02845032513141632,
        -0.03985953330993652,
        -0.004006633069366217,
        0.08905350416898727,
        0.0012228136183694005,
        -0.00903523899614811,
        0.018768683075904846,
        -0.04852025955915451,
        0.0341109074652195,
        -0.051339201629161835,
        -0.022964973002672195,
        -0.010546567849814892,
        -0.022348618134856224,
        9.417906403541565e-05,
        0.002807362237945199,
        0.02605823613703251,
        -0.017496662214398384,
        0.09275273978710175,
        0.015093520283699036,
        -0.06326345354318619,
        0.0165166687220335,
        -0.01985006406903267,
        -0.009206818416714668,
        0.011738634668290615,
        -0.026167191565036774,
        -0.08628800511360168,
        0.06459947675466537,
        0.00355347478762269,
        0.07205519080162048,
        0.0651881992816925,
        0.013027641922235489,
        0.007074853405356407,
        0.008431363850831985,
        0.0859425887465477,
        0.011067894287407398,
        0.06807132065296173,
        -0.05173570290207863,
        0.00831877812743187,
        -0.05144486948847771,
        -0.02140345610678196,
        0.03746843338012695,
        -0.006625558249652386,
        0.02278822846710682,
        0.025087082758545876,
        0.006894806399941444,
        0.026747766882181168,
        -5.47348193435937e-08,
        -0.01973036490380764,
        -0.022501274943351746,
        0.04200144112110138,
        -0.017666663974523544,
        0.013335315510630608,
        -0.027033215388655663,
        0.061348479241132736,
        -0.03262980654835701,
        -0.03558381274342537,
        -0.034134238958358765,
        0.06957615166902542,
        -0.13920636475086212,
        -0.032297082245349884,
        0.0029122987762093544,
        0.05772637948393822,
        0.009931276552379131,
        -0.00912188459187746,
        0.028777213767170906,
        -0.03830341622233391,
        -0.09825506061315536,
        -0.026791797950863838,
        0.046220071613788605,
        0.06003852188587189,
        -0.045590903609991074,
        -0.025606922805309296,
        0.0809381976723671,
        -0.0011204290203750134,
        0.059265948832035065,
        0.09305833280086517,
        -0.13797025382518768,
        -0.046327706426382065,
        -0.031195135787129402,
        0.04278052598237991,
        0.07022115588188171,
        0.036610040813684464,
        -0.09353363513946533,
        -0.09698382765054703,
        0.015087182633578777,
        -0.010933217592537403,
        0.03988376259803772,
        -0.060077063739299774,
        0.006289394572377205,
        -0.021235423162579536,
        0.014898915775120258,
        0.08943960070610046,
        -0.004325162619352341,
        0.02562926523387432,
        -0.05831199884414673,
        -0.018908033147454262,
        0.04845862090587616,
        -0.05059688910841942,
        -0.009692997671663761,
        -0.05197426304221153,
        0.04460728168487549,
        0.011401531286537647,
        0.06886991858482361,
        -0.09878318011760712,
        0.01553348544985056,
        -0.018030058592557907,
        0.13417105376720428,
        -0.03303089737892151,
        -0.1560293734073639,
        -0.037621159106492996,
        0.08769490569829941
    ]
}