{
    "id": "lT1sps72_sE",
    "title": "I tried the Metaverse - Meta Quest Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-01T21:08:29Z",
    "video_url": "https://www.youtube.com/watch?v=lT1sps72_sE",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "meta",
        "quest",
        "pro",
        "headset",
        "vr",
        "professional",
        "ar",
        "virtual reality",
        "augmented reality",
        "mr",
        "mixed reality"
    ],
    "views": 3162985,
    "likes": 62144,
    "comments_count": 5810,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   Linus may be a big fan of VR, but does Meta's new Quest Pro provide a convincing argument for the Metaverse, or is this $1,500 headset a complete miss?  Buy a Meta Quest Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Taste the metaverse  0:44 These controllers are WILD 2:39 The headset is kind of heavy 3:15 Trying it on (and smelling it) 4:15 What else is in the box? 4:58 The charging dock is okay 5:38 Trying out the included light blockers 7:05 Display specs and ports/button walkthrough 8:42 Passthrough camera impressions 10:19 Battery life and other specs/tracking features 11:38 Display/Image clarity impressions 12:25 Headset fit adjustment system 13:04 Logging into the Metaverse 13:23 Trying out the face/expression tracking 14:55 Sponsor - SecretLab 15:39 Hanging out in the Metaverse  17:20 Linus gets scared after waving at someone 17:45 The Metaverse nightmare 18:23 Linus plays Metaverse Call of Duty 19:56 Playing Beat Saber 20:28 Overall thoughts 20:59 Outro",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://geni.us/vjr8b0",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Even at its new higher price the value proposition of the MetaQuest two is undeniable like Mark Zuckerberg or Hadum. It's the best bang for the buck VR headset out there, which I cannot say about the MetaQuest Pro coming in at a whopping 1500 US dollars. This is by far the most expensive VR headset that Meta or Facebook or Oculus or whatever you wanna call them has ever released. And while initially I was looking at the price going how could it possibly cost that much? Now that I've looked a little closer it's fairly obvious how, let's start with the controllers. Each of these contains not one, not two, but three cameras for spatial tracking as well as a Snapdragon 662 processor. That's right. Each controller has a processor that would be more at home in your smartphone than in a controller. Wow these are hefty too. On the one hand, I wanna call them reassuringly heavy. On the other hand, I enjoy playing Beat Saber and these are just kind of heavy. We've got charging contacts on the side for the integrated battery rather than a slide out battery compartment for a double A like we saw on the Quest two. That's a plus for me from that perspective. Anyway, there we go. So that's what the old one looks like. And other than that, it'll be a pretty familiar hand shape and feel for anyone who's ever used an Oculus controller. Obviously a big thing that's missing is this ring on the top. This was for tracking, right? So the headset could monitor the position of the controllers, but now obviously if the controllers are doing their own inside out tracking for the entire room, then you don't need that anymore. That should also mean that the controllers won't suffer from occlusion problems. Like say for example, if you had it down by your side to reload and the headsets cameras could no longer see its position. I think the wildest thing about these controllers is that they're not even over spec. If you wanna process three simultaneous video feeds and then calculate your position with extremely low latency in 3D space, yeah, that's uh It's probably about what you need. Oh, they have true touch haptic feedback whatever that means. I'm looking forward to trying that. And ah, the rated weight is 153 grams. Yeah that I believe. And the controllers aren't the only thing heavier than last gen. While the optics meta claims are 40% thinner than on the Quest too. And I'm really looking forward to seeing these optics. Man, their, their lenses are just, ugh. I mean, I love my index but they are just so much better than valve's lenses. The headset itself is about 200 grams heavier and this has gotta be in no small part thanks to the the like the wrap around headband that seems to be designed for much longer wearing sessions. Now this is interesting. Okay. The Quest Pro is designed for both VR and AR applications. Meta claims... Ew, it stinks. The plastic smell vaguely of like mold. Does it smell like mold to you? - It smells like, like new plastic. - Okay. - Yeah out of the box. - It's probably just manufacturing stain. - Yeah yeah. - Okay, cool. I mean, to be clear I didn't think there'd be mold growing on plastic. Like it's not... - Doesn't smell good. - Edible yeah. It's, it is particularly right where the nose is which is really unfortunate. I'm sure that'll go away in no time though. Sorry it's designed for VR and AR applications with full color camera pass throughs through that apparently has four times the resolution of the Quest two, which wouldn't be that difficult. The Quest two some passthrough resolution not, There you go. Okay. Power adapter USB type C. It's heavy, it's small. Wouldn't surprise me if this is like a GaN power adapter. Yeah, this is a 45 block power brick. It's tiny. Almost certainly using Gallium Nitride. Hello. What this is, Are you pro are you pro enough to use the MetaQuest Pro? Can you unravel their cable? Okay. Oh yeah, there's the integrated charging dock that's actually kind of sleek. I'm liking it and ah, yes. Here's our light blocking blinders. This boy goes here I guess. It's a spatial puzzle Brandon. I need to get both of these on their things. Yeah, there we go together there. Hey, cool. I wish it had kind of a magnetic lock into place. Ah, the controllers do, but the headset itself they expect you to be able to align on your own. Oh in case you don't wanna use the dock. They do include a little magnetic charging cable that you can use to charge the controllers independently if you want. Why the devil's the port on this so hard. Obviously for augmented reality you don't mind having light spilling through right. See, I'm quite open to the surrounding world but for VR applications, that's a little less desirable. So they include these little rubber light blockers that can be installed on both sides of the headset. I see what looks like little thing. Oh, oh, is it magnetic? Ooh. Okay. That's pretty cool. And that is quite a bit more isolated but there's definitely still some gaps. They're apparently still working on a full enclosure that will block all outside light for now. I mean, and this kind of makes sense given the professional targeting of this headset. It's intended, I guess more as an AR headset or for like, you know, your corporate VP to come in and preview a design or something like that. So very business environment type use rather than, you know full immersion for hours at a time at home kind of use. Which isn't to say that some people won't try to do that. Yes, it's $1,500 but if the index has taught us anything it's that VR enthusiasts will spend and on paper this thing should actually offer pretty good performance and in some ways not as good in others. So one thing that Oculus has done well here is the resolution of the display. Apparently they're using a quantum dot LCD with 500 local dimming zones which should give it outstanding contrast compared to a regular LCD display, but it only runs at a maximum of 90 hertz rather than 120 or 144 hertz like some other headsets on the market. What I suspect though is that thanks to the individual 1920 by 1800 resolution displays, one for each eye. The perceived realism is likely to be pretty high. They're claiming 37% more pixels per inch and 10% more pixels per degree. So it actually has a wider field of view than the Quest two as well. Oh, I haven't even talked about all the cameras on the headset itself. One, two, three, four, five. These work together for positioning as well as mixed reality pass through. We've also got a three and a half millimeter headphone jack. Built in speakers that I am hoping are a lot better than the Quest two which does not have good speakers. Volume control button, another three and a half millimeter jack. So you can just have a dedicated cable per ear so you don't have to run it around the back. This doesn't seem to be like removable in any way. If you wanted to substitute the strap, I, I bet I bet there is a way to do it if you really want to. Holy crap. I can already tell just looking at these lenses I'm gonna love them. Like I can't even see the fennel circles or anything like that. They just look clear. Okay, here we go. Where's the power button at? Oh wow. You know what's kind of wild? The pass through was so good that it wasn't even really bothering me that I had a headset on. So immediately when you pop into VR you've got mixed reality pass through and like obviously I can tell I'm looking at a video feed rather than the real world but what is happening right now? It's just that the tips of my fingers are gray so it almost feels like it's tracking my hands. I have, I've not done really a ton of research on this at all. I just wanted to experience it. The other thing is that unlike other objects that move kind of naturally my hands kind of like judder around, this is so trippy because it's not just passing a camera feedback to me when I occlude an object behind something, right? Like if my hand's in the way it actually distorts the lines of that object. Because what I'm interfering with is the real time 3D map of the environment that the headset is creating. So like this microphone that's pointed towards me for example, when I move around it it kind of like (jittering sound) like like jitters around because it's being 3D mapped. It's not just a two-dimensional image that I'm looking at. Ooh, I'm getting a bit of a headache, not gonna lie. Okay, I think I'm recording. I have a little red dot, so that's good. Oculus claims one to two hours of battery life with the headset and then two hours for a recharge. So I've got about 50% battery that should give us plenty of time to try some stuff. They can accommodate inter pupillary distance ranges from 55 to 75 millimeters with continuous IPD adjustment. That's a lot better than the Quest two. To be clear, I have to blow up the text like this big Okay. To be able to read it inside the headset, but I can do it. They've got three eye tracking cameras and this I'm already noticing certain parts of the setup will track where you're looking with a little dot and it's exactly where I'm looking. They've also got two face tracking cameras so that your facial expressions will be transmitted to other friends in Horizon or whatever. This is the 256 gig version and unlike the controllers it uses a Snapdragon XR2 processor that meta claims is what did they say? 50% faster than the Quest two or something like that. XR2 plus 50% more power. Okay it also has 12 gigs of ram. I am wearing more RAM than I would've had in my entire house like 10 years ago. Oh, on that note, I haven't even discussed the clarity of the image. It's really good. I can definitely see a little bit of fringing on the top of white text, particularly up at the top. Definitely tolerable. A little bit of yellow fringing at the bottom, little bit of blue fringing at the top, but wherever I'm actually looking is extremely clear, very focused. And that actually brings me to another feature that's supported by the Quest Pro Foviated rendering. Because it can track where your eyes are, it can actually render anything outside of this narrow spot where your vision is sharpest at a lower resolution which dramatically boosts performance. Quest Link is supported, so you could use Steam or whatever else. Okay we have to do a fit adjustment in order to go into Horizons, adjust lens spacing towards 64. What like... How do you, Oh, okay. Oh. Wow. It makes you set your inter pupillary distance correctly. Move the headset up. Okay it wants it higher on my face. Move it up. Move it down. Okay placement is good. Okay. Okay well that's, I didn't really change anything. Oh, whoa. Okay we're headed to Horizon Worlds Preparing for visitors now. Whoa. Meta World is currently only available in English. Okay. Okay. - Hello and welcome to Horizon. Ready to get started. - Speakers are better. They're not very loud though. Like I have them maxed right now, but not super loud. - Looking good. - I am sad. (laughing) Okay. That is not bad. Can I raise one eyebrow? Yes. Both. All right. Like squint. Ah. Can't detect the tongue. Got frowns yes. All it manages to work around the beard which is pretty impressive. Like obviously it's not on par with the latest, you know super sophisticated mocap games or anything like that. But if you enunciate and you really move your mouth while you're talking, it's pretty on point. Being able to gauge the attentiveness of someone that you're talking to and get real reactions instead of saying lol, saying ROFL, that's that's has the potential to be a total game changer in terms of online interaction for sure. With that said, video chat, totally a thing that exists but video chat doesn't give you the same kind of anonymity that chat rooms do which is why Discord is like totally still a thing. Could this be the best of both worlds? Most people won't know because it's 1500 US dollars. Oh, I'm still in the mirror. Oh and I'm still telling you about our sponsor. Thank you Secret Lab for sponsoring this video. Secret Lab chairs are designed to keep you comfortable for those long nights of work and play. The Titan Evo 22 series chair offers four way lumbar support comes with a magnetic memory foam head pillow and is offered in different upholsteries like hybrid leatherette software fabric, and Napa leather. Best of all, a five year extended warranty is included along with a 49 day return policy. So you're covered if anything goes wrong. Oh, I could be using my hands to talk. Head to the link in the video description to check out Secret Lab today. Okay house rules. No vulgar profanity or graphic sexual topics. Performances may be recorded and shared on social media. Sign up for three minutes of stage time. Am I, is my mic live? Ooh, we're gonna mute my mic here real quick. - Roses are red, violets are blue. - Just look. - Oh right. There's spatial tracking. I probably shouldn't be making this face. There's a bunch of people out here. - I've been moving a lot faster myself. 49.99 a month. - What nice. Where do you live again? Good for you. Stitcher, Florida. Florida Optic coming straight into my house. - Sound quality. Based on how these guys are coming through I would say the mic quality is quite strong. The positional audio is excellent. I can really tell where people are talking at me from. I'm still muted right? Oh, thank goodness. I don't know what's more surprising to me the fact that Meta has spent billions of dollars creating something that like a handful of people are using or the fact that people are on, ironically, actually using it. This 100% reminds me of the Palace. It was a two dimensional version of this the world we're in right now. That was called a palace. Okay and then palaces had rooms and you could actually navigate around the different rooms by like clicking from one to the next. So, and they would be themed like a living room in dining room or, or whatever else right. It's the Palace which was a predecessor to Habbo Hotel. For those of you, you young kids. So you can wave at people. Okay sure I waved. This is weird. This is weird, man. Maybe this is only so bizarre to me because I don't hang out. You know, don't really like have friends. There's definitely some bugs. I found a little sign that said Network connection lost in the middle of the courtyard. How do I get out of here? Unable to load content, blah. Okay worlds network connection lost. What are you talking about? What are you talking about? I can see people moving. Unable to load content. Come on. Are you serious? Network connection lost again. Headset power is low. Please plug in your heads for crying out loud. Whew given that the way people seem to use this is to stand around and have long conversations. That hour or two of battery life could be an issue. Today's 100 most visited worlds Action Island Sandbox. Oh, okay. This has seven out of eight people here. We're traveling. Is there like a weapon? Oh. Okay. - That's insane. I'm about to Metaverse game. - I'm sorry. I'm everywhere right now. - How do I reload? Oh, okay I reloaded. What the crap. Oh, that's out of ammo. Oh, I dropped my pistol. I'm gonna go for a swim. - Okay. I am swimming oh, good graphics. What's this? I'm jumping shut. Ah, I died. A shotgun. Come on. And I'm dead. What now? I'm holding a grenade and a pistol. Do I not have any ammo? No I'm gonna make this guy, What is happening right now? And I'm dead. I can't put this gun down so I can't press my thing - Much better than the Quest two. I didn't think we'd get inside out tracking this good. Then again, it never occurred to me to put phone processors in the controllers themselves so that they could do their own inside out tracking. Yeah, sure. It's like it's mobile graphics, right? Compared to rendering on a full pc. But like man these lenses, it's so clear. Almost no screen door effect whatsoever. I'd love to see this thing hooked up to like a real machine. - Mark you got some kinks to wrinkle out. Hardware feels good. Very expensive. Overall, more impressed than non impressed. But there are definitely some game breaking bugs both in horizon worlds and with the product itself the battery life being only one to two hours and we saw that in action. It's a little rough and the product feels a little incomplete overall. Not even including light blockers for the bottom. This is short circuit, so we don't really draw conclusions but those are my impressions. Make sure you subscribe.",
    "transcript_keywords": [
        "Zuckerberg or Hadum",
        "Quest",
        "headset",
        "good",
        "controllers",
        "thing",
        "Quest Pro",
        "yeah",
        "kind",
        "people",
        "Mark Zuckerberg",
        "tracking",
        "MetaQuest Pro",
        "Quest Pro Foviated",
        "Pro",
        "Meta",
        "Hadum",
        "Zuckerberg",
        "Worlds",
        "Power"
    ],
    "transcript_entity_values": [
        "37%",
        "Habbo Hotel",
        "USB",
        "49.99",
        "90",
        "Secret Lab",
        "Gallium Nitride",
        "Napa",
        "the Quest Pro Foviated",
        "two hours",
        "1,500",
        "The Quest Pro",
        "LCD",
        "500",
        "about 200 grams",
        "50%",
        "IPD",
        "today",
        "40%",
        "Action Island Sandbox",
        "This 100%",
        "3D",
        "55 to 75 millimeters",
        "Today",
        "five year",
        "GaN",
        "Beat Saber",
        "the MetaQuest Pro",
        "Discord",
        "256",
        "1500 US dollars",
        "That hour",
        "Hadum",
        "two",
        "144",
        "Snapdragon",
        "Meta World",
        "eight",
        "three minutes",
        "1920",
        "Mark Zuckerberg",
        "RAM",
        "Stitcher",
        "one",
        "Evo",
        "Horizons",
        "662",
        "about 50%",
        "Metaverse",
        "10 years ago",
        "Brandon",
        "120",
        "Quest two",
        "45",
        "Oculus",
        "hertz",
        "12",
        "only one",
        "five",
        "jack",
        "Florida Optic",
        "English",
        "seven",
        "153 grams",
        "Horizon Worlds Preparing",
        "49 day",
        "three",
        "One",
        "MetaQuest",
        "100",
        "64",
        "Quest",
        "one to two hours",
        "billions of dollars",
        "Palace",
        "three and a half millimeter",
        "1800",
        "Facebook",
        "Florida",
        "four",
        "hours",
        "Horizon",
        "VR",
        "Meta"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "DATE",
        "PERCENT",
        "FAC",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "LANGUAGE",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "MONEY",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "TIME",
        "EVENT",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.031895190477371216,
        -0.03481843322515488,
        -0.038795676082372665,
        -0.09828628599643707,
        0.09233535826206207,
        0.02206125110387802,
        -0.015197302214801311,
        0.0700024664402008,
        -0.004562396090477705,
        0.04498567432165146,
        -0.07127135246992111,
        -0.01991591416299343,
        -0.06281120330095291,
        -0.0569961741566658,
        0.0643838495016098,
        -0.0687892884016037,
        0.04506398364901543,
        -0.06829231232404709,
        -0.05690440908074379,
        0.03965122997760773,
        -0.012723419815301895,
        0.015642454847693443,
        0.08303280174732208,
        0.04674837738275528,
        -0.0325629748404026,
        -0.04618799313902855,
        -0.09361474961042404,
        -0.04546346887946129,
        -0.0032863568048924208,
        -0.03975365683436394,
        0.009913802146911621,
        0.11050262302160263,
        -0.05464749410748482,
        -0.06065981462597847,
        0.00788773875683546,
        0.004805967677384615,
        0.01750931516289711,
        -0.023764440789818764,
        -0.15962430834770203,
        -0.05158931761980057,
        -0.016093937680125237,
        -0.04483266919851303,
        -0.052485547959804535,
        -0.052461616694927216,
        0.006910704541951418,
        -0.028515467420220375,
        -0.027304494753479958,
        -0.029989998787641525,
        0.05718548595905304,
        0.06582015752792358,
        -0.038144104182720184,
        -0.06932230293750763,
        -0.0034185401163995266,
        0.03193288668990135,
        -0.06921081244945526,
        0.0967596098780632,
        -0.03297983482480049,
        -0.052154529839754105,
        0.021106239408254623,
        -0.0010817140573635697,
        0.02808219939470291,
        -0.07889941334724426,
        -0.06279119104146957,
        0.07411455363035202,
        0.03717603161931038,
        0.05871134623885155,
        -0.024861028417944908,
        0.00549531914293766,
        -0.024289017543196678,
        -0.07065888494253159,
        -0.05239330604672432,
        0.04665857180953026,
        -0.021730730310082436,
        0.06442319601774216,
        0.048578519374132156,
        0.10768456757068634,
        0.04339002072811127,
        -0.07564610987901688,
        0.06133836507797241,
        0.0604974664747715,
        0.08233647048473358,
        -0.017835136502981186,
        -0.010500510223209858,
        -0.02447695843875408,
        -0.013296707533299923,
        -0.042146798223257065,
        0.012476938776671886,
        -0.01958286017179489,
        -0.02563714236021042,
        -0.09472952038049698,
        -0.04549209773540497,
        -0.005601039156317711,
        0.040484171360731125,
        0.054566044360399246,
        -0.01918567717075348,
        0.02808048203587532,
        -0.07134038209915161,
        -0.02645878493785858,
        -0.015948107466101646,
        0.09795147180557251,
        0.02549092471599579,
        -0.04190035164356232,
        -0.03175532445311546,
        -0.03262631595134735,
        -0.04982856661081314,
        -0.016679862514138222,
        -0.012935812585055828,
        0.036057598888874054,
        0.01631614938378334,
        0.034830980002880096,
        -0.07742083072662354,
        -0.006045885384082794,
        -0.002593487733975053,
        -0.06472639739513397,
        0.05279826000332832,
        0.09130118042230606,
        -0.00038316010613925755,
        0.026832612231373787,
        0.026636989787220955,
        -0.09205886721611023,
        0.03294375538825989,
        0.02290154993534088,
        0.010863563045859337,
        -0.046338874846696854,
        0.01070888340473175,
        -0.04910816252231598,
        -0.02366177923977375,
        -1.7237270999595478e-33,
        -0.05063681676983833,
        0.07758578658103943,
        0.06058412417769432,
        -0.05092499405145645,
        0.1184205710887909,
        -0.0063483500853180885,
        -0.028913158923387527,
        0.027714407071471214,
        -0.03141392022371292,
        -0.017144426703453064,
        -0.013234062120318413,
        0.053051065653562546,
        -0.024742335081100464,
        0.018605336546897888,
        0.008959845639765263,
        -0.04143485426902771,
        -0.02831084094941616,
        0.0380338691174984,
        -0.06250856071710587,
        -0.07885883003473282,
        0.021929247304797173,
        -0.010048707947134972,
        0.02285649999976158,
        -0.02746271900832653,
        0.04248343035578728,
        -0.001021000323817134,
        -0.03333006799221039,
        0.03430243581533432,
        0.01087932288646698,
        0.03598862513899803,
        -0.10068638622760773,
        -0.030717549845576286,
        0.04382774233818054,
        -0.05505417287349701,
        0.0027941714506596327,
        0.06349118053913116,
        -0.0157619696110487,
        -0.09405475109815598,
        0.01752289943397045,
        0.046723924577236176,
        0.02900080382823944,
        0.03495817631483078,
        -0.06163972616195679,
        -0.04435873031616211,
        -0.042564790695905685,
        -0.05139978602528572,
        -0.00019785930635407567,
        -0.010720083490014076,
        0.00040246263961307704,
        0.08333615958690643,
        -0.04551319405436516,
        0.0052299173548817635,
        -0.1351466327905655,
        -0.05957702547311783,
        0.059303298592567444,
        -0.05572310462594032,
        -0.021242985501885414,
        0.0007747156778350472,
        0.027976782992482185,
        -0.00409932853654027,
        0.07260619848966599,
        -0.03267396241426468,
        0.0027149743400514126,
        0.03812267631292343,
        -0.09294534474611282,
        0.09188041090965271,
        0.04766644909977913,
        -0.04325506091117859,
        -0.04737260937690735,
        0.007061430718749762,
        -0.03395450860261917,
        0.05781867355108261,
        -0.055321648716926575,
        -0.057755157351493835,
        -0.017167340964078903,
        0.027294032275676727,
        -0.0423138365149498,
        -0.021372778341174126,
        0.06226395070552826,
        0.06904557347297668,
        -0.048881128430366516,
        0.02680140733718872,
        -0.05328601971268654,
        0.056667253375053406,
        0.040941230952739716,
        -0.05394800007343292,
        0.012537527829408646,
        -0.03846012428402901,
        0.001722971792332828,
        -0.08387339860200882,
        0.008982554078102112,
        0.033487945795059204,
        -0.02379535138607025,
        -0.006495901849120855,
        -0.0657624825835228,
        -2.436052248315876e-33,
        -0.08092183619737625,
        0.05403154715895653,
        -0.04459836706519127,
        0.055122051388025284,
        0.06464095413684845,
        0.0556841678917408,
        0.034610360860824585,
        -0.048681680113077164,
        0.011211207136511803,
        -0.014133141376078129,
        -0.044792380183935165,
        0.010028144344687462,
        -0.06929633766412735,
        -0.008783767931163311,
        0.015106054954230785,
        -0.10415375232696533,
        0.06553450226783752,
        -0.09736745804548264,
        0.029514966532588005,
        0.019590377807617188,
        0.13329578936100006,
        0.040744733065366745,
        -0.06608501076698303,
        0.0347624272108078,
        0.008976436220109463,
        -0.051324065774679184,
        0.07625796645879745,
        -0.002804060000926256,
        0.007420527748763561,
        0.0336434431374073,
        0.027240194380283356,
        0.007995556108653545,
        -0.08793484419584274,
        -0.06490238010883331,
        0.07374367117881775,
        0.0700564831495285,
        0.08643575012683868,
        0.03730439767241478,
        -0.062408048659563065,
        -0.04342709854245186,
        -0.009678978472948074,
        -0.04213106632232666,
        -0.027110718190670013,
        -0.09063498675823212,
        -0.04065787047147751,
        -0.08319315314292908,
        -0.023557625710964203,
        0.013483327813446522,
        0.09335141628980637,
        -0.02397012896835804,
        0.006828918121755123,
        -0.016565434634685516,
        0.07279317826032639,
        -0.01991039514541626,
        -0.07696351408958435,
        -0.0012778999516740441,
        -0.09165044128894806,
        0.030774518847465515,
        -0.011761884205043316,
        -0.03731175512075424,
        0.06232237070798874,
        -0.010891874320805073,
        -0.08706176280975342,
        -0.07864537090063095,
        0.06043635681271553,
        0.043843820691108704,
        0.040187884122133255,
        -0.001069925376214087,
        -0.028082294389605522,
        -0.010945205576717854,
        0.0009451495134271681,
        -0.025382712483406067,
        -0.007200297433882952,
        -0.05345191806554794,
        -0.004491748753935099,
        0.10426056385040283,
        0.008531477302312851,
        -0.037652309983968735,
        0.021313181146979332,
        0.040036868304014206,
        -0.0055820695124566555,
        0.01729428581893444,
        0.11858104169368744,
        -0.047408003360033035,
        0.04798881337046623,
        0.0402836836874485,
        -0.08413422107696533,
        -0.00040079967584460974,
        -0.09434299170970917,
        0.07863380014896393,
        -0.020241493359208107,
        -0.0017637219280004501,
        -0.025484420359134674,
        0.062190938740968704,
        0.023928357288241386,
        -6.145707942550871e-08,
        0.031047653406858444,
        0.035721395164728165,
        0.01004021242260933,
        0.015520676039159298,
        -0.028527963906526566,
        -0.00504923053085804,
        -0.009692464023828506,
        -0.10376057028770447,
        0.023914720863103867,
        0.04248270392417908,
        0.019127659499645233,
        0.00020545022562146187,
        0.03076787106692791,
        0.10061444342136383,
        0.013093658722937107,
        0.06651552766561508,
        -0.017552467063069344,
        0.08227077126502991,
        -0.06193634495139122,
        -0.05879925563931465,
        -0.0014477907679975033,
        0.11361486464738846,
        0.09066253900527954,
        -0.13493314385414124,
        0.05437779054045677,
        0.04395598545670509,
        0.02039298787713051,
        0.061337150633335114,
        0.07727782428264618,
        0.015852374956011772,
        -0.03474816679954529,
        0.007644400931894779,
        -0.06899034976959229,
        -0.005478100851178169,
        -0.023976916447281837,
        -0.09658760577440262,
        -0.050461962819099426,
        0.07672575116157532,
        -0.04257836192846298,
        -0.03813427314162254,
        0.02315598540008068,
        0.044586315751075745,
        0.03947341814637184,
        0.05581393092870712,
        0.01537299994379282,
        0.05475488305091858,
        0.01699325628578663,
        -0.034500494599342346,
        -0.05741184204816818,
        -0.03333558887243271,
        -0.029420921579003334,
        -0.014026708900928497,
        -0.00041974434861913323,
        0.03336372226476669,
        0.00510232662782073,
        0.05331013724207878,
        0.008188916370272636,
        0.0377974808216095,
        -0.07190943509340286,
        0.023499974980950356,
        -0.011757807806134224,
        -0.03438704460859299,
        0.003622183809056878,
        0.071726493537426
    ]
}