{
    "id": "ltD4TVN9wAY",
    "title": "World's First Intel ARC PC Build! (A770)",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-09-19T22:59:24Z",
    "video_url": "https://www.youtube.com/watch?v=ltD4TVN9wAY",
    "category": "Science & Technology",
    "tags": [
        "Building a PC",
        "PC build",
        "Intel Arc",
        "LinusTechTips",
        "LTTstore",
        "LTT screwdriver",
        "screwdriver",
        "building a PC"
    ],
    "views": 3238518,
    "likes": 141174,
    "comments_count": 6622,
    "description": "Thanks to LTT for sponsoring today's video! Pre-order your screwdriver today at  If you want to win the MKBHD edition screwdriver giveaway, enter at   Get an MKBHD Desk Mat:   Get the JerryRigEverything Razor Knife at   PC Part List Intel A770 limited edition:  Intel i9-12900k CPU Processor:  Corsair H150i Elite LCD CPU Cooler:   ASUS ProArt Z690 Motherboard:   G.Skill Trident Z5 RGB 64GB DDR5 Ram:   Sabrent Rocket 4 Plus NVMe SSD:   Corsair 4000X RGB PC Case:   ASUS Thor 1200W PSU:   CableMod RT-Series Pro ModMesh PSU Cable Kit:  Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://geni.us/lttscrewdriver.",
        "https://twitter.com/MKBHD/status/1571997810572017666",
        "https://MKBHD.com",
        "https://geni.us/verysharpknife",
        "https://geni.us/rUciWIx",
        "https://geni.us/fQs5UX",
        "https://geni.us/N95M",
        "https://geni.us/b0Ds2",
        "https://geni.us/bv8zqQ",
        "https://geni.us/ARx4v",
        "https://geni.us/ME3A",
        "https://geni.us/H3OxOs",
        "https://geni.us/IJbq",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(bright electronic music) - All right, what's up? MKBHD here. Welcome to the first PC that I have built in, I had to look this up, nine years. So I've made a lot of videos about computers and we've had prebuilt PCs in here, but I've never actually built one from scratch since 2013, which, if you look back, was actually a Hackintosh, but we don't talk about that. I'm gonna be doing this again with a bunch of parts here, and I have decided I'm only gonna be using YouTuber merch here to build it. So I've got the desk mat here, mkbhd.com. I've got a knife, 'cause we've got someone boxings to do. This is the JerryRigEverything knife. You've probably heard of it. It's pretty sweet. It's actually the sharpest knife my own. And then we have this video's sponsor, yes, actually, the Linus Tech Tips Screwdriver both in the Creator Edition and the regular edition. But shout-out to Linus and the team who have been working on this for apparently three-plus years to put this together, which is pretty sweet. So let's take a look at this one. Let's unbox the screwdriver. Oh, they've got the nice Linus orange colors in here. So there it is. Feels very solid. And you've probably got some bits in here. So it comes with all 12 of these bits here and you can store all 12 of those bits up here in the top. That's really satisfying. Nice. Yeah, this is made in partnership with Megapro Tools, who has tons of experience making tools like this. And there's a magnet in the shaft. So if you have trouble, like, grabbing a screw, that should be no problem. I'm probably gonna use the Phillips a lot. I'm just gonna preload that. Oh, I forgot to mention, we are gonna be doing a quick giveaway. Stay tuned to the end for a little bit of details, but this is a Creator Edition of the screwdriver. And the only thing that means for me is it's red and black, which is a special little bit of a colorway. So you got the stealth matte black version and you've got a red and black version. I'm gonna give these away. Again, we'll talk about it at the end. Actually, for this video, I'm going to build this PC with the red screwdriver to be that much more special, so when I give it away, you'll have a one of one that built this PC. But hey, if you wanna get one of these in the standard colors yourself, you can. You can go to lttstore.com and pre-order yours today. So I've got all the parts over here. Let's just go through them one by one. (upbeat electronic music) All right, so first up, we've got the case. This is CORSAIR's 4000X. It's a mid-tower PC case and it's pretty simple. It's 130 bucks. It's got some fans in the front, tempered glass, rectangle, nothing crazy. This is just gonna be a standard high-end PC build. Then next up, I think it's important to introduce the motherboard and the CPU we're using. This is an ASUS ProArt Z690, you can see a pretty sweet black and gold box here, which is using Intel's 12th Gen chip here, Intel Core i9. So we're gonna pop that in there. And I'll go over all the details as we start to install them, but I'm just gonna give you the quick run through. The all-in-one liquid cooler for the CPU. It's CORSAIR's H150i. It's got a bunch of fans and it's really solid. We'll get to that when we install it. Then I also have here our ram, 64 gigs of ram from G.Skill, and also a bunch of M.2 SSDs. They're very fast. We've got two four terabytes and two two terabytes. Yes, the board has enough to support it, and I'll install them all in front of your very eyes. And then last but not least, here is, we'll get to that, this is our power supply, so ASUS 1,200 watt modular power supply and a bunch of our cables here. Modular power supply means, of course, we're picking our cables. And our GPU might look a little bit different. As you can see, that's an Intel Arc A770. We've talked about Nvidia and AMD in the past. This is a little bit of a different option. But I think we'll start with the motherboard. (upbeat electronic music) This is our board. This is a ASUS's new ProArt motherboard. This comes with three months of Adobe's Creative Cloud for free. So you can kind of get a sense of who they're aiming at with this board. All right, wow. It's got some heft to it. It's a very solid board. I want to put together as much of the computer as possible on the board here in front of me before I try to put it in the case. So I'm gonna put the CPU in, I'm gonna put the ram in, I'm gonna put the SSDs in, and then we'll see about the cooler, how much I can do before I actually have to start cable managing and putting it in the case. All right, so here is our CPU. This is Intel's Core i9-12900K I haven't seen CPU packaging in a while and this is definitely much fancier than I remember. So that's pretty cool. Twist to open. This is the fanciest... Very nice, very nice. I mean, at the end of the day, it's a CPU in a plastic case, but, you know, this is nice presentation. So I'm gonna not even take it out yet, but I'm gonna open this latch here and this will open. I'm gonna line up that arrow we see on the bottom corner with the arrow that I saw here on the bottom left corner. I'm just gonna place that down right there. So then I'm gonna push this cover down, push this down, and our cover pops off and our CPU is installed. All right, I'm gonna do ram next. I think the ram is probably some of the best-looking stuff in the inside of a PC, especially if it has lights on it, which this one does. So we've got two sticks of memory here. These are two 32-gig DDR5 memory sticks. And you could go double it up in the future. I only have four slots on this board, but that's fine. And I'm gonna make sure I install dual channel memory in the appropriate slots on the board here. It's a good crunchy sound when you do it right. Beautiful. We've got our SSDs, our incredibly fast M.2 SSDs. And on this board, we have our PCI slots, but then under these, we have our M.2 ports. I'm gonna just use the screwdriver and pop these open. What should I use here? I'm gonna go flathead to unscrew these. So there's the first M.2 slot. If you told somebody in 2013 when I last built a PC that you could get a four terabyte drive in the palm of your hand, they would not have believed you. I would not have believed you. Trying to tell me that is four terabytes? Get those pins connected. They are seated, cool, and then I'm just gonna push this down to the screw here and then use that to lock it in place. That's actually super easy. All right, so we've got a bunch more. I actually don't need all of these drives, but I'm gonna install some more anyway. So this is the bottom. This is the last two M.2 PCIe 4.0 slots. I assume they're next to each other. So actually what's interesting now is these drives have their own heat sinks in their little covers, as you can tell. So my job now is to peel off this cover and pop the heat sink back on and that'll be good for the drives. I'm gonna take this, move it to the side, and start working on the case. I'm gonna go power supply and then we'll go from there. I'm gonna save this peel for when it's done. That'll be my reward. So, okay, with the door off, and we can see what's sort of a canvas we have to work with. It's got three fans here, space for the power supply down here. This is a hard drive bracket, but we don't have hard drives in this build. We have literally terabytes of SSD. So I think I should just be able to take that out. Yeah, matter of fact, let's take that out. So let's come from the back, take this other panel off, and make space for the power supply. All right, let's take this bracket out the way. Oh, thumb screws. I was about to... I thought I was gonna have to use the screwdriver again. Actually, ooh. That's pretty tight. There we go, okay. (mellow electronic music) This is the part where gets fun 'cause it's been a long time, like I said, since I've built a PC. Power supply. Yep, solid metal. All the ROG stuff is so consistently ROG. Like, the ROG phone looks like the ROG monitor, which looks like the ROG power supply, which looks like the ROG graphics cards. I mean, these things are consistent. So as a modular power supply, it of course comes with a box of cables. I'm not gonna be using any of these, but it does have your main power cables and all that good stuff. But we're using some CableMod cables, as you already saw. I also just noticed this, just like the ROG phone, there is a screen on this power supply. But the thing about this screen and this case is it's going to be sitting in there blocked by the door. So you're not actually gonna be able to see it. But that would just show you, I guess, the amount of watts of power you're drawing. So here, these are the cables we're going to be using with this power supply. CableMod Pro Series Cable Kit. So the last time I built a PC, I definitely just used the included cables with the modular power supply. Oh, these look way better. Nice. And these are specifically matching. These are for this power supply, which is sweet. There's a little air intake at the bottom so we know the orientation of the power supply in the case, which will be like that. And then all the cables will come into the case and be routed up the back through here. So let's start by attaching them. Okay, so this is actually kind of nice. It's labeled right here. So these two are for the motherboard. This is gonna go here, which means this is gonna go here. (mellow electronic music) Fan down, oriented correctly. Let's line her up. All right, so now that we've got the cables in the power supply, the power supply in the case, I'm just gonna check to make sure all of our parts fit. Swivel this around so you can check with me. So the board's obviously got its spot up here. It's going be oriented that way. I'm also gonna double-check this CPU cooler. It's pretty, I don't know, it's pretty big. We'll see if it fits in this case. And I'm hoping... Oh. This is a three fan, three times 120, it's a 360-mil radiator. This case is not designed to fit those. It'll only fit a 240. We're gonna get a little bit creative with this one. Since there are three fans in the front, that's still big enough for a 360. So I'm gonna replace the three front fans with this radiator. Should still work. I'm gonna have to take the fans out, take the front off. It's a little bit of extra fun. This is what PC building is all about. Unfortunately, we'll have to put the tubes at the top to get it to actually fit and connect. You're not supposed to do that, but, I don't know, LTT spec'd this build with this exact config. So I'm gonna make the best of it. Luckily, I have my handy LTT screwdriver, which makes this all super easy. (cash register dings) So now I'm gonna put these fans into this radiator. Typically don't want to put the cables or the tubes at the top, but we're making do with the parts we have. So now, next up, I'm going to put this back plate behind the motherboard, which is gonna help us put the CPU cooler on and then I'm gonna put the motherboard in the case. So I've gotta line up all of these spots. Okay, so it's actually not too hard. See, this is nice. Magnetic screwdriver holds onto the screw. Pop it in the corner. I wonder if anyone's ever built a PC and it just went perfectly. And our motherboard is now seated. So then our next step here, I've got it all ready to put the CPU cooler on the CPU. Get it on in one go, leave it there, screw it in. Okay, this is the final major piece, which is the GPU. This is the different one. As you guys have probably seen over the past few years, AMD versus Nvidia war is raging on as far as discreet GPUs. And then when you see an integrated GPU, it's typically a good Intel one. They're jumping in the game of discreet GPUs and this is the Arc A770. It's gonna feel somewhere in the range of an RTX 3060 or 3060 Ti maybe. You can see the fans on the outside. It's matte black. It's kind of a pretty simple looking card if you ask me. And I'm gonna be putting it right in this top PCI slot here. And this is the RGB controller cable. So I do have some pins to get this guy to light up. Oh, is that the light right there? Probably. There you go. Oh, all the way around. Nice. And it's a dual-slot card. So I'm gonna need to take the top two out. (bright music) That should do it. So now I gotta line these up and listen for the click. (computer parts click) Yep. (bright music continues) I like that. There's a lot of matte black going on in this build and it speaks to me and I'm very happy with that. Gotta plug it in. In fact, we gotta do a whole bunch of cable management and cable plugging in. Nobody really wants to watch me do that. So with the magic of video editing, let's fast-forward a couple hours. All right, here we are. As you can see, this is the finished build, and spoiler, yeah, I did go a little bit beyond that, plugged some things in, booted it up for the first time, and got everything working. But I am happy to say the PC works. It's alive. I do wanna deliver those last few peels that I promised. (upbeat music) (upbeat music continues) I'm pretty proud of the way the red and black aesthetic turned out. So here we are now that it's fully booted. I feel like I learned a lot both about building a PC today in 2022 with all the new and interesting parts that we have here, how clean we are able to make it look. Obviously having the M.2 SSDs in here keeps it looking particularly sparse. There's lots of clean, open spaces, airflow moving through here. But also just remembering back on the other PCs that I built, which were for very different purposes, the Hackinstosh was very much a hack. Like, one of the things I remember about it was we literally couldn't turn it off or it might not turn back on again, like that type of thing. This is just an all-round high-end, fun, great daily driver. Matter of fact, we got \"Forza\" on here already. All right, in the controls, I can change video settings to 1440p and on high at 144 fps. That should look pretty good. And now we're way up at 90 to 100 fps. So you guys might remember we tried some of this crazy \"Forza\" demo on 8K on that machine, on the super high-end MAINGEAR. This, even at 1440p on high settings, which looks incredible, I'm pretty much locked at upper 80s, lower 90s fps. Suffice to say, this Intel card can definitely handle some pretty solid gaming. So this is the screwdriver I will be giving away. This exact one. It's one of one in this red and black colorway. I will leave all the bits in it. This is the exact bit I just used to finish this build. And all you have to do is check the description and that could be yours. That's been my first PC build in a really long time, and I'm glad I did it. Thanks, Linus. Thanks, y'all, for watching. And I'm gonna get back to gaming. Catch you guys in the next one. Peace. (upbeat electronic music)",
    "transcript_keywords": [
        "power supply",
        "power",
        "CPU",
        "supply",
        "modular power supply",
        "case",
        "put",
        "pretty",
        "cables",
        "ROG",
        "ROG power supply",
        "bit",
        "Screwdriver",
        "board",
        "Intel",
        "CPU cooler",
        "nice",
        "build",
        "fans",
        "built"
    ],
    "transcript_entity_values": [
        "Megapro Tools",
        "today",
        "three-plus years",
        "the Linus Tech Tips Screwdriver",
        "three",
        "a Creator Edition",
        "Hackinstosh",
        "Hackintosh",
        "one",
        "nine years",
        "Linus",
        "ASUS",
        "AMD",
        "a couple hours",
        "YouTuber",
        "four",
        "64",
        "the end of the day",
        "144",
        "CORSAIR",
        "Nvidia",
        "ROG",
        "8",
        "2022",
        "Intel",
        "12",
        "Intel Core",
        "upper 80s",
        "3060",
        "first",
        "360-mil",
        "the Creator Edition",
        "LTT",
        "90 to 100",
        "1,200 watt",
        "3060 Ti",
        "M.2 PCIe 4.0",
        "PCI",
        "Adobe",
        "three months",
        "AMD versus",
        "GPU",
        "four terabytes",
        "130 bucks",
        "2013",
        "RGB",
        "Forza",
        "MAINGEAR",
        "CableMod Pro Series Cable Kit",
        "terabytes",
        "4000X. It's",
        "CableMod",
        "the past few years",
        "Creative Cloud",
        "90s",
        "CPU",
        "ASUS",
        "four terabyte",
        "ROG",
        "two",
        "240",
        "Phillips",
        "SSD",
        "12th",
        "120",
        "G.Skill"
    ],
    "transcript_entity_types": [
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "LOC",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.04297757148742676,
        -0.060648541897535324,
        0.029122602194547653,
        -0.011857785284519196,
        0.0073384810239076614,
        0.06018678471446037,
        0.008950799703598022,
        0.03655927628278732,
        -0.08166415989398956,
        -0.025093842297792435,
        0.04513409361243248,
        -0.02328214980661869,
        -0.05170266330242157,
        -0.02047274075448513,
        -0.051201898604631424,
        0.018505478277802467,
        0.1057819202542305,
        -0.13117331266403198,
        -0.02091860957443714,
        -0.0697205513715744,
        -0.04556429013609886,
        -0.057790741324424744,
        -0.08137376606464386,
        0.004930747672915459,
        0.03226538747549057,
        0.034272897988557816,
        0.1063813716173172,
        0.007340526673942804,
        -0.042610637843608856,
        -0.04041343554854393,
        0.03584103658795357,
        0.016138048842549324,
        0.08833903074264526,
        0.04821982979774475,
        -0.0072093019261956215,
        -0.052171751856803894,
        0.09705939143896103,
        -0.06664931774139404,
        -0.03929043188691139,
        -0.06964685022830963,
        -0.039997514337301254,
        -0.018538955599069595,
        0.0846879705786705,
        0.06741853058338165,
        0.004681043326854706,
        0.06704278290271759,
        0.03237674757838249,
        -0.13893353939056396,
        0.027873877435922623,
        -0.00582645321264863,
        -0.0697421282529831,
        -0.016863161697983742,
        0.027522923424839973,
        -0.0425371490418911,
        -0.031984440982341766,
        0.030586177483201027,
        0.021519651636481285,
        -0.0440625436604023,
        0.04626992717385292,
        -0.06522718071937561,
        -0.006593238562345505,
        -0.12012845277786255,
        0.03401380777359009,
        -0.02261282503604889,
        0.014775590971112251,
        -0.038544949144124985,
        0.011033614166080952,
        -0.04066901281476021,
        0.042191602289676666,
        0.011400934308767319,
        0.050021618604660034,
        0.03939570114016533,
        0.010656672529876232,
        0.08315198123455048,
        -0.01248314417898655,
        0.03663301467895508,
        0.01645038276910782,
        -0.038785338401794434,
        -0.00686555216088891,
        -0.057947125285863876,
        0.007352728396654129,
        0.03737104684114456,
        -0.013305212371051311,
        -0.02989479899406433,
        -0.030416211113333702,
        0.04302964732050896,
        0.022401142865419388,
        -0.03365075960755348,
        -0.03382791951298714,
        -0.0727933719754219,
        0.02030912972986698,
        -0.022489033639431,
        0.08238833397626877,
        0.014067564159631729,
        0.04393108934164047,
        0.036407772451639175,
        -0.004914936609566212,
        -0.07713494449853897,
        -0.036297619342803955,
        0.07170005887746811,
        -0.008618822321295738,
        0.04213500767946243,
        0.061493344604969025,
        0.06217512860894203,
        -0.061648424714803696,
        -0.04194404184818268,
        -0.07031375169754028,
        0.11276472359895706,
        -0.060344696044921875,
        -0.030816320329904556,
        0.015375006012618542,
        0.01907557062804699,
        -0.020223468542099,
        0.007230257149785757,
        0.03845730051398277,
        -0.03903517499566078,
        -0.07184645533561707,
        0.07848014682531357,
        0.07416873425245285,
        0.06503945589065552,
        0.07869010418653488,
        -0.023873787373304367,
        0.005568344611674547,
        0.06437614560127258,
        -0.006932522170245647,
        -0.0432051382958889,
        -0.061010606586933136,
        1.296071271605059e-32,
        0.056885067373514175,
        -0.011408175341784954,
        -0.04675314202904701,
        0.04538531228899956,
        -0.060073792934417725,
        -0.08744009584188461,
        -0.03408993408083916,
        0.03469575196504593,
        0.003805645275861025,
        0.062109969556331635,
        -0.00229798280633986,
        -0.00544090336188674,
        -0.038970306515693665,
        0.03234245628118515,
        0.011676977388560772,
        -0.06984731554985046,
        -0.013890539295971394,
        -0.014979511499404907,
        -0.057108864188194275,
        0.011476523242890835,
        0.030848857015371323,
        0.02529134228825569,
        0.02357390522956848,
        -0.04677927866578102,
        0.06879790127277374,
        0.03756856545805931,
        -0.030073542147874832,
        -0.028041446581482887,
        0.051763005554676056,
        0.013459550216794014,
        -0.07122962176799774,
        -0.09062093496322632,
        -0.025095274671912193,
        -0.04070402681827545,
        -0.016838092356920242,
        -0.00488801347091794,
        -0.009353839792311192,
        -0.09143410623073578,
        -0.015069345943629742,
        -0.028584428131580353,
        -0.04910476878285408,
        0.02313270978629589,
        -0.06632457673549652,
        -0.03725619986653328,
        0.0018922832095995545,
        -0.013886626809835434,
        -0.007551318965852261,
        0.038581639528274536,
        0.028848396614193916,
        0.043924350291490555,
        -0.048516515642404556,
        0.02435281127691269,
        0.019887614995241165,
        -0.00036145272315479815,
        -0.03958291560411453,
        -0.03034585528075695,
        0.04037872329354286,
        0.02377150021493435,
        0.15960390865802765,
        0.09565908461809158,
        0.030403712764382362,
        0.012258893810212612,
        -0.012557679787278175,
        -0.017502155154943466,
        -0.08371857553720474,
        0.05040457472205162,
        0.09468309581279755,
        0.04568851366639137,
        0.0393158495426178,
        -0.05454409494996071,
        -0.04611745849251747,
        -0.0975499227643013,
        0.06757786124944687,
        0.005373313557356596,
        0.05201560631394386,
        0.0514652244746685,
        -0.049798332154750824,
        -0.10196636617183685,
        -0.03372294083237648,
        -0.06316341459751129,
        -0.08330439776182175,
        0.045955590903759,
        -0.053909361362457275,
        0.04526504501700401,
        0.054123543202877045,
        0.033095743507146835,
        -0.01639847829937935,
        -0.05790745094418526,
        0.03543926030397415,
        -0.03043988347053528,
        -0.04697583243250847,
        0.004011776298284531,
        0.003847436746582389,
        0.05289270728826523,
        -0.016480615362524986,
        -1.1642158498681323e-32,
        0.013643234968185425,
        -0.07350460439920425,
        -0.028267310932278633,
        0.008241493254899979,
        0.03477567434310913,
        0.033227626234292984,
        0.019137993454933167,
        -0.01795610599219799,
        -0.03259638696908951,
        -0.07187531888484955,
        0.08269955217838287,
        -0.03783642500638962,
        -0.053030990064144135,
        -0.0705648809671402,
        0.05683238059282303,
        0.02386728674173355,
        0.02242136187851429,
        -0.045705948024988174,
        0.057810645550489426,
        0.025384824723005295,
        0.026029646396636963,
        0.026245364919304848,
        -0.042348939925432205,
        -0.06900975853204727,
        -0.013802175410091877,
        0.05290810391306877,
        0.017906824126839638,
        0.011232689954340458,
        0.08851858973503113,
        0.09360646456480026,
        -0.02116357907652855,
        0.038493525236845016,
        -0.0067219980992376804,
        0.021564414724707603,
        -0.021493107080459595,
        0.028256908059120178,
        0.03124253638088703,
        -0.040666427463293076,
        -0.017970535904169083,
        -0.06257957220077515,
        0.060360752046108246,
        0.07494980841875076,
        -0.04003303498029709,
        0.020785365253686905,
        -0.04326707124710083,
        -0.0004722768208011985,
        -0.037654075771570206,
        0.01964830979704857,
        0.1214577779173851,
        0.014654351398348808,
        -0.002823757939040661,
        -0.04563849791884422,
        0.054802533239126205,
        -0.09081953018903732,
        -0.060920409858226776,
        -0.08277999609708786,
        -0.02687780000269413,
        0.037218380719423294,
        0.09394102543592453,
        -0.03125130757689476,
        0.05281462147831917,
        -0.028047243133187294,
        0.014682827517390251,
        -0.07141532748937607,
        -0.02224491536617279,
        -0.037565678358078,
        0.04919202998280525,
        0.06643278896808624,
        -0.046815041452646255,
        -0.07462051510810852,
        -0.09927043318748474,
        -0.020474188029766083,
        -0.025369921699166298,
        -0.06922389566898346,
        -0.008995363488793373,
        -0.03908289968967438,
        0.020627915859222412,
        0.013623190112411976,
        0.0709691196680069,
        0.001694400212727487,
        -0.07888441532850266,
        0.0263722762465477,
        0.0064512318931519985,
        0.04209660738706589,
        0.08350265771150589,
        0.01388298999518156,
        -0.008797528222203255,
        0.05162304267287254,
        0.04826757311820984,
        -0.0369630791246891,
        0.01438815239816904,
        0.039159391075372696,
        0.011552671901881695,
        0.07401832938194275,
        -0.014107105322182178,
        -6.370267158217757e-08,
        0.04964941740036011,
        -0.016571659594774246,
        0.004066483583301306,
        0.06608086079359055,
        0.06141391396522522,
        -0.12659062445163727,
        -0.004510039929300547,
        0.02180507220327854,
        -0.022165954113006592,
        -0.07338924705982208,
        0.09324537217617035,
        -0.023634247481822968,
        -0.04659771919250488,
        0.004265935625880957,
        0.028677593916654587,
        0.05457061156630516,
        -0.0890551432967186,
        0.04678832367062569,
        -0.05281096696853638,
        -0.058841753751039505,
        0.02741069532930851,
        0.02012072689831257,
        0.13645172119140625,
        -0.06912542134523392,
        -0.015025988221168518,
        0.023346683010458946,
        0.0058220792561769485,
        0.01721380092203617,
        0.058555930852890015,
        -0.01063541043549776,
        -0.045884694904088974,
        0.012377558276057243,
        0.011873277835547924,
        -0.11984913796186447,
        0.12312626093626022,
        -0.026293428614735603,
        0.06716451793909073,
        0.08585909754037857,
        0.12332618981599808,
        -0.03332731872797012,
        -0.05741928145289421,
        -0.08677438646554947,
        -0.04421636462211609,
        0.03200609236955643,
        0.0070715914480388165,
        0.019349711015820503,
        -0.1026293933391571,
        -0.0459546223282814,
        -0.05302991345524788,
        0.016887474805116653,
        -0.057818684726953506,
        0.03715740144252777,
        -0.027403699234128,
        0.042662061750888824,
        0.03250638023018837,
        0.023118741810321808,
        -0.028034739196300507,
        0.08019868284463882,
        -0.0027750723529607058,
        0.043234482407569885,
        0.05506489798426628,
        -0.03481808304786682,
        -0.04301818087697029,
        0.0069158365949988365
    ]
}