{
    "id": "LuVpwB1s8iU",
    "title": "Noctua's New Cooler Voids Your Warranty - AM5 Direct Die Cooling @ Computex 2023",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-31T18:26:43Z",
    "video_url": "https://www.youtube.com/watch?v=LuVpwB1s8iU",
    "category": "Science & Technology",
    "tags": [
        "noctua",
        "computex 2023",
        "new nh-d15",
        "next gen noctua",
        "direct die cooling",
        "cooling delidded cpu"
    ],
    "views": 1508208,
    "likes": 55826,
    "comments_count": 1652,
    "description": "Switch up your camera set up! Check out the SwitchPod at   Learn more about NexiGo's family of webcams here:   In this video we visit Noctua's booth at Computex 2023 where they're showing off some really cool pieces of plastic that can knock double-digits off of your CPU temps! PLUS a new version of the NH-D15!  Discuss on the forum:   Need your Noctua fix now? Check out their current generation NH-D15 CPU fan:  Buy a Thermal Grizzly Ryzen 7000 Delid-Die-Mate:  Buy a Thermal Grizzly Ryzen 7000 Direct Die Frame:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:01 The Problem with Ryzen 7000 3:15 Cooling delidded CPUs!! 6:18 Good Guy Noctua 6:49 Next Gen NH-D15 8:41 Outro",
    "description_links": [
        "https://lmg.gg/SwitchPod",
        "https://viraln.link/LTTWebcams23",
        "https://linustechtips.com/topic/1510359-amd-hates-this%E2%80%A6-but-i-love-it-noctua-booth-computex-2023/",
        "https://geni.us/iwHAjd",
        "https://geni.us/67ksld",
        "https://geni.us/HueMM0c",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I don't know what's worse. Being the sort of madman who specializes in voiding your customer's warranties? Or enabling his reckless behavior the way that Noctua has done here? This small plastic spacer kit for their iconic brown coolers is not only 100% Trust Me Bro guaranteed to get your RMA rejected by AMD, but it also increases the chance that something will go wrong. I mean, who in their right mind would take a cooler this size and bolt it directly to the fragile dyes that live under AMD's protective heat spreader? 20 degrees. 20 degrees? 20 degrees? Look, that's impossible. Impossible to explain until I finish this segue to our sponsor. Nexigo, whether you're in need of webcams or accessories for your VR device, Nexigo has a great selection of products to choose from. You can learn more about them at the link in the video description. (gentle music) If it was anyone else, I'm not even sure if I would believe this. But after Noctua explained it, the whole thing kind of makes sense. And it starts with the creatively named Noctua NM-AMB15 Offset AM5 mounting bars. You see, the thing is, when AMD designed their AM5 CPUs, they put the IO dye in the middle and they put the actual compute dyes, the CCDs, down at the bottom of the IHS. This puts the hotspots of Ryzen 7000 CPUs in a very unconventional place. And you can see in Noctua's illustration here how this hurts the performance of a typical cooler. By having the hotspot down here, you can see we are overutilizing the heat pipes on this side and underutilizing the ones over here. That's where the offset bar comes into play. Watch this, by simply shifting the mounting mechanism seven millimeters downward, Noctua says they can drop the temperature on your CPU by up to three degrees. This is because of two effects. First, it concentrates the pressure over those heat generating dyes, improving thermal transfer. And second, it means more effective heat distribution throughout the base of the cooler. So you're making better use of all of your heat pipes rather than oversaturating some and underutilizing others. These results are really impressive and reinforced what we found in water cooling through the ages where we saw that from generation to generation the performance improvements were less about actually just building a better water block and more about tuning the water block better for modern processors. So while Ryzen 3000 and 5000 can benefit from this offset mount, it's not to the same degree, pun intended, as Ryzen 7000 because those ones have much thinner IHSs. We'll be talking about that in a second. In typical Noctua fashion, it'll be available affordably for all their desktop class coolers going back to 2005. \"But, Linus,\" you might say, \"up to three degrees, is not almost 20 degrees. What's the deal with the rest of that?\" That is where this comes in. These small plastic spacers allow Noctua coolers to be mounted to delidded CPUs and they're the result of a collaboration with der Bauer. I mean, it looks like the simplest thing in the world. A little piece of plastic. How could that drop you 15 degrees? Except the devil's in the details. Look how thick this is. Ah, so I haven't played around with delidded Ryzen 7,000 yet but it seems that to maintain cooler compatibility with the lower profile LGA socket compared to their last generation pin CPUs AMD made the IHS much thicker, which is contributing to some of the thermal challenges that users are seeing. The solution? Well, if you hate having a warranty, you can do this. Step one, get your hands on a delidded Ryzen 7000 series processor. Given they developed the products collaboratively, Noctua recommends the one from Romans sold under the Thermal Grizzly brand. They've been doing a lot of that collab sort of stuff lately. Step two, install a direct die mounting frame like this one again from Thermal Grizzly. This isn't strictly necessary, but it dramatically reduces the risk of accidentally cracking one of these delicate dies as you're tightening down your cooler. I wouldn't even consider mounting a cooler direct die these days without one of these frames. Next, you're gonna need some liquid metal thermal compound. Okay, you don't actually need it. But the issue is that the benefit of this modification with traditional thermal paste is very low, only about two to four degrees. This is because even though AMD's IHS is too thick, at least it's soldered. So it's pretty fast at moving heat from the hottest parts of the dies. I mean, it's right in the name, right? It's a heat spreader. So if we use a traditional thermal compound right on these dies, it can be somewhat overwhelmed by the concentration of these hotspots. Heat flux density is the term that Noctua used but for all but the most technical of our viewers that's unlikely to mean anything. So finally, you'll need Noctua's offset mount that I showed you guys before. Okay, you don't need it. But if you're gonna avoid your warranty, why settle for 10 to 17 degrees of improvement when you can have anywhere from 12 to 19? That is the cumulative benefit of all of these little changes. Though, now that your warranty is void, there are a couple of more things to consider. Die cracking, that's less of a concern thanks to the contact frame. But liquid metal on any one of these little surface mount components would be a big problem. So I would suggest some nail polish or conformal coating or some protective covering for the ones that aren't already covered. And here's the coolest part. Noctua isn't even forcing you to buy this spacer. If you get your direct die contact frame and all this stuff from other companies, they will make literally nothing, providing you the STL files of these spacers on principles.com. But they're doing it anyway. Then all you need to do is source slightly longer screws and they're gonna have the information about which screws you'll need on the printables page. Again, this works with the vast majority of Noctua coolers since 2005 and is launching at the end of July. But that doesn't mean that all cooling innovation is down to changing the position and voiding your CPU warranty. Meet the next gen NHD 15. It's got a whopping eight heat pipes now, compared to six on the original, and that's just the beginning. The heat pipes are optimized for better performance. Optimizing wall thickness, wick structure, all that kind of stuff. But the big one is this fan. It's finally here after, what is this, eight long years of product development? Their new 140 millimeter fan and thanks to its incredible performance giving it up to three degrees better performance compared to their old one on a radiator, they were able to increase the surface area of the fin stack here by 20%, meaning that this should be good for anywhere in the neighborhood of about three to four degrees of improvement over the already legendary NHD 15. Now, of course, that's on a 300 watt heat load, so you better be running an Intel CPU. Got 'em. Which is why Noctua actually doesn't recommend buying this if you have a 65 watt CPU. What they would recommend is that I do this segue to our sponsor. - Thanks to SwitchPod for sponsoring this video. Are you a video creator looking to upgrade your on the go or vlogging setup? Look no further than SwitchPod. Compatible with any camera from a phone to a DSLR, this handheld tripod was designed by passionate video creators like us just trying to make their lives a little easier. It's lightweight, compact, and nearly indestructible, so you can experience the freedom of quickly switching between handheld and tripod mode in seconds. Use the two threads on the legs to add accessories of your choice and turn the switch pod into a full-blown video rig. Head to link below and check out SwitchPod today. - If you enjoyed this video, what the? Hey, why don't you go check out our one on the development of the screwdriver, which this actually reminds me a lot of because for better or for worse, I take a ton of inspiration from these guys only shipping things once they are absolutely ready.",
    "transcript_keywords": [
        "Noctua",
        "degrees",
        "heat",
        "Noctua coolers",
        "thermal",
        "AMD",
        "Ryzen",
        "cooler",
        "heat pipes",
        "CPUs",
        "CPU",
        "video",
        "Noctua offset mount",
        "CPUs AMD",
        "coolers",
        "Noctua offset",
        "Thermal Grizzly",
        "performance",
        "AMD IHS",
        "AMD protective heat"
    ],
    "transcript_entity_values": [
        "three degrees",
        "IO",
        "second",
        "up to",
        "Romans",
        "20 degrees",
        "LGA",
        "eight",
        "RMA",
        "Bauer",
        "First",
        "Ryzen 7000",
        "300 watt",
        "Ryzen 3000",
        "seconds",
        "Noctua NM-AMB15",
        "65 watt CPU",
        "four degrees",
        "Noctua",
        "the end of July",
        "Ryzen 7000",
        "today",
        "STL",
        "about three to",
        "10 to 17 degrees",
        "seven millimeters",
        "2005",
        "12 to 19",
        "eight long years",
        "15 degrees",
        "5000",
        "DSLR",
        "a ton",
        "AMD",
        "only 100%",
        "140 millimeter",
        "20%",
        "polish",
        "Thermal Grizzly",
        "CPU",
        "Ryzen",
        "six",
        "only about two",
        "Linus",
        "NHD 15",
        "CPU",
        "almost 20 degrees",
        "two",
        "Intel",
        "Nexigo",
        "these days",
        "IHS"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "EVENT",
        "PERSON",
        "ORDINAL",
        "FAC",
        "QUANTITY",
        "PERSON",
        "TIME",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "PERCENT",
        "NORP",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "LAW",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.08816665410995483,
        -0.00028438091976568103,
        0.07488119602203369,
        -0.01927809789776802,
        0.06163023039698601,
        -0.10616403073072433,
        0.015340025536715984,
        -0.04169167950749397,
        -0.01390658039599657,
        0.0036385024432092905,
        0.06140166148543358,
        -0.05177326127886772,
        -0.05777907371520996,
        0.04140867665410042,
        0.022305423393845558,
        -0.015570614486932755,
        0.07102950662374496,
        -0.12740620970726013,
        -0.04246004670858383,
        -0.06538694351911545,
        -0.005333323031663895,
        -0.024858443066477776,
        -0.030731627717614174,
        0.018645010888576508,
        0.03595365211367607,
        0.004786929581314325,
        0.05534270405769348,
        -0.021058810874819756,
        -0.02954993210732937,
        -0.047923386096954346,
        -0.007651703432202339,
        0.04183734953403473,
        -0.10927195101976395,
        -0.03109528310596943,
        0.1155710518360138,
        -0.06845711916685104,
        0.0018687763949856162,
        -0.057369183748960495,
        -0.08374657481908798,
        -0.029225552454590797,
        -0.021971365436911583,
        -0.024120567366480827,
        0.0223921500146389,
        0.015991544350981712,
        -0.005764362867921591,
        0.06370487809181213,
        0.04969526082277298,
        -0.08357372879981995,
        0.07608781009912491,
        -0.07909062504768372,
        -0.06284461170434952,
        -0.0703318789601326,
        0.12893739342689514,
        -0.03811837360262871,
        -0.03766064718365669,
        0.03189678490161896,
        -0.0418303944170475,
        -0.10193562507629395,
        -0.02255898341536522,
        -0.052068546414375305,
        0.11544293910264969,
        -0.049386635422706604,
        -0.0779448077082634,
        0.0031437701545655727,
        0.07200908660888672,
        0.020622095093131065,
        -0.0007900136988610029,
        -0.02455793134868145,
        -0.009214372374117374,
        0.05974568426609039,
        0.01379506103694439,
        0.01974332332611084,
        0.02514795958995819,
        -0.030476130545139313,
        -0.02235577069222927,
        0.0200708769261837,
        0.030296802520751953,
        -0.0691014900803566,
        0.1183413714170456,
        -0.03840987756848335,
        0.03837259113788605,
        -0.0015807852614670992,
        0.05009279027581215,
        -0.05354839190840721,
        0.05278368666768074,
        0.014804236590862274,
        0.12499938160181046,
        0.021335428580641747,
        0.019388670101761818,
        -0.07137785851955414,
        -0.07034119218587875,
        -0.005482234992086887,
        0.048028383404016495,
        0.019608737900853157,
        -0.02021905779838562,
        0.03796795383095741,
        0.00820268876850605,
        -0.004004676826298237,
        -0.011767510324716568,
        0.047706831246614456,
        0.06556665152311325,
        -0.03618888929486275,
        0.01805581897497177,
        0.0870533213019371,
        -0.07295539230108261,
        0.0770183652639389,
        -0.03374314680695534,
        0.013380605727434158,
        0.032911136746406555,
        0.0046385726891458035,
        -0.10375107079744339,
        0.1122257187962532,
        -0.0003516161232255399,
        0.013696149922907352,
        0.023181553930044174,
        -0.0541558712720871,
        -0.04499271884560585,
        0.004938475787639618,
        0.0028409650549292564,
        -0.012216828763484955,
        0.023769602179527283,
        -0.02362213283777237,
        -0.07388094067573547,
        0.07315386086702347,
        0.006748640909790993,
        0.022573770955204964,
        -0.048087071627378464,
        4.461768438776477e-33,
        0.12228025496006012,
        0.06463693082332611,
        -0.030768657103180885,
        0.001765660592354834,
        0.004283456597477198,
        0.008637707680463791,
        0.011254070326685905,
        -0.018952272832393646,
        -0.029949156567454338,
        0.01111531350761652,
        -0.0019606214482337236,
        -0.05840570107102394,
        -0.05379004031419754,
        0.005277322605252266,
        -0.027239229530096054,
        -0.04132061451673508,
        0.010891735553741455,
        0.0006270279409363866,
        0.002322371816262603,
        0.036825794726610184,
        0.002933062380179763,
        0.030599214136600494,
        -0.040572214871644974,
        0.07983443140983582,
        0.023273900151252747,
        0.011013423092663288,
        0.020710306242108345,
        0.008536468259990215,
        0.00763188349083066,
        0.02349036931991577,
        0.0005002483958378434,
        -0.07155947387218475,
        0.003040400566533208,
        0.02608238346874714,
        -0.0065369801595807076,
        -0.010011442005634308,
        -0.06864898651838303,
        -0.0316375195980072,
        0.045318447053432465,
        -0.040934205055236816,
        0.0146176777780056,
        0.07511310279369354,
        -0.06100139394402504,
        -0.030269481241703033,
        -0.034822989255189896,
        0.06873466074466705,
        -0.012849394232034683,
        0.04015200212597847,
        0.0160121638327837,
        0.007621483877301216,
        -0.04082750156521797,
        0.01070050522685051,
        -0.08749235421419144,
        -0.03278477117419243,
        -0.033871494233608246,
        -0.030916446819901466,
        0.06343653053045273,
        -0.004436383955180645,
        0.06609443575143814,
        -0.004713003057986498,
        -0.019782274961471558,
        -0.014061037451028824,
        -0.0013784775510430336,
        -0.05085841938853264,
        -0.018055187538266182,
        0.06510830670595169,
        0.0014463834231719375,
        0.016211098060011864,
        -0.04425499588251114,
        -0.014340607449412346,
        -0.078202024102211,
        0.04198320582509041,
        0.019601456820964813,
        -0.011059816926717758,
        0.04363147169351578,
        0.004085904452949762,
        -0.05470816791057587,
        -0.0786728784441948,
        -0.06131891906261444,
        -0.006558927241712809,
        -0.014861399307847023,
        0.0069895777851343155,
        -0.0042864191345870495,
        -0.06664669513702393,
        -0.02813681960105896,
        -0.07213781774044037,
        0.007443591486662626,
        0.056741151958703995,
        0.014392247423529625,
        0.019804416224360466,
        0.010746007785201073,
        -0.06451328843832016,
        0.02287420444190502,
        0.029411891475319862,
        -0.044464949518442154,
        -3.826620188352394e-33,
        -0.0009878058917820454,
        -0.026654018089175224,
        0.01608124189078808,
        0.03609209507703781,
        -0.048898909240961075,
        -0.02543368935585022,
        0.07187678664922714,
        0.0758814886212349,
        0.04310160502791405,
        -0.07651323825120926,
        0.04623560607433319,
        -0.04420757666230202,
        -0.05664372071623802,
        0.015518572181463242,
        0.04413487762212753,
        -0.02389669232070446,
        -0.03203662112355232,
        -0.04327020049095154,
        0.023161618039011955,
        0.018528558313846588,
        0.0772252231836319,
        0.031350359320640564,
        -0.05663317069411278,
        0.030849331989884377,
        -0.010940236039459705,
        0.09812386333942413,
        -0.028149710968136787,
        -0.006458187475800514,
        0.03167746216058731,
        -0.014589055441319942,
        -0.01951901614665985,
        -0.0046431696973741055,
        -0.013023259118199348,
        0.025767574086785316,
        0.06916472315788269,
        -0.02358759194612503,
        0.09729249030351639,
        0.020609239116311073,
        -0.007526228670030832,
        -0.07861198484897614,
        0.017704114317893982,
        0.1010473296046257,
        0.0664958506822586,
        0.09699468314647675,
        -0.04083143547177315,
        -0.008313845843076706,
        -0.04219793900847435,
        -0.08483759313821793,
        0.0652398094534874,
        -0.030700186267495155,
        0.012068177573382854,
        -0.09582820534706116,
        0.030626604333519936,
        0.059487007558345795,
        0.012477191165089607,
        -0.026386408135294914,
        0.07391705363988876,
        0.04045134782791138,
        -0.019123800098896027,
        -0.05185087025165558,
        0.07649020105600357,
        -0.022417718544602394,
        -0.02921522781252861,
        -0.05639176070690155,
        0.0360124409198761,
        -0.03331683203577995,
        -0.02822207100689411,
        0.03354210779070854,
        0.0273953415453434,
        0.01143040880560875,
        -0.025403359904885292,
        0.04565795138478279,
        -0.024259762838482857,
        -0.1311795860528946,
        -0.00886471290141344,
        -0.0073324041441082954,
        -0.0044412761926651,
        0.013275879435241222,
        0.05004880949854851,
        0.020717645063996315,
        -0.0716291144490242,
        -0.032602716237306595,
        -0.030437985435128212,
        -0.010915887542068958,
        0.13207772374153137,
        -0.029954008758068085,
        0.07764481008052826,
        0.0004195925430394709,
        0.018061930313706398,
        -0.01666167750954628,
        -0.030632127076387405,
        -0.014862915500998497,
        -0.02794867940247059,
        0.0790741890668869,
        -0.004545056726783514,
        -4.541145059988594e-08,
        0.015290179289877415,
        -0.04533998668193817,
        -0.007482320535928011,
        0.06221615895628929,
        0.043147433549165726,
        -0.054896995425224304,
        0.011781849898397923,
        -0.006878844927996397,
        0.07009976357221603,
        0.00024058633425738662,
        0.11082093417644501,
        0.007158492226153612,
        0.011959262192249298,
        -0.027983451262116432,
        0.0024717566557228565,
        -0.00011551485658856109,
        -0.07033012062311172,
        0.07238946855068207,
        0.027653666213154793,
        -0.10783866792917252,
        -0.035764239728450775,
        0.003114574821665883,
        0.08156713098287582,
        -0.036572497338056564,
        -0.010107684880495071,
        0.06356745958328247,
        0.06226776912808418,
        0.026317616924643517,
        0.1293238401412964,
        -0.06036616116762161,
        -0.1711946576833725,
        -0.007868779823184013,
        0.11407436430454254,
        -0.08267377316951752,
        0.03826679661870003,
        -0.03195624798536301,
        0.005430839955806732,
        0.12172529846429825,
        0.10393843799829483,
        -0.034357137978076935,
        0.002057562582194805,
        0.008858934044837952,
        -0.056638941168785095,
        0.05748605728149414,
        0.0545218251645565,
        -0.06337989866733551,
        -0.03543718159198761,
        -0.07806067168712616,
        -0.022067686542868614,
        0.01610458642244339,
        -0.03007735125720501,
        0.014132398180663586,
        0.009538562968373299,
        0.13133187592029572,
        -0.06915215402841568,
        -0.04479401558637619,
        -0.05531134456396103,
        0.04816233366727829,
        -0.04667628929018974,
        0.05698130652308464,
        0.03923790156841278,
        -0.11198506504297256,
        -0.09787710011005402,
        0.028982656076550484
    ]
}