{
    "id": "lUY1rgxcfWA",
    "title": "Can an Electric Skateboard PULL A TESLA?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-02-24T15:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=lUY1rgxcfWA",
    "category": "Howto & Style",
    "tags": [
        "Boosted Board",
        "Tesla",
        "Electric Skateboard",
        "Electric Long board",
        "Best electric long board",
        "Battery Powered Skateboard",
        "Electric vehicle",
        "Boosted 2",
        "2nd gen boosted board",
        "Dual+ boosted",
        "boosed board specs",
        "Compare bosted",
        "Casey Neistat",
        "Whatsinside",
        "Whats inside",
        "Boosted",
        "jerryrigeverything"
    ],
    "views": 862787,
    "likes": 14193,
    "comments_count": 696,
    "description": "Can a battery powered skate board pull a battery powered car? The results may surprise you. Get 1000 miles of free Tesla supercharging when you buy a Tesla with my link:  When I first stood on a Boosted Board and felt how powerful it was.  I was curious to see if It could actually PULL a full sized car. And what better kind of car to pull then a BATTERY powered Tesla? Lukilly Dan, over at the YouTube channel 'WhatsInside' let us borrow his for this test.   We also talk about the differences between the first version boosted board, and the second version of the boosted board.   Casey Neistats wet boosted board:   Music:  lifepainting by Muciojad  Creative Commons  Attribution-ShareAlike 3.0 Unported CC BY-SA 3.0   provided by Audio Library   Hitman by Kevin MacLeod is licensed under a Creative Commons Attribution license ( Source:  Artist:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://ts.la/zack10701",
        "https://youtu.be/SIT8EhUkPxI",
        "https://soundcloud.com/muciojad",
        "https://creativecommons.org/licenses/by-sa/3.0/Music",
        "https://youtu.be/3feCSMbSZQA",
        "https://creativecommons.org/licenses/by/4.0/)",
        "http://incompetech.com/music/royalty-free/index.html?isrc=USUAN1300013",
        "http://incompetech.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "[Zack] Okay! I should not be doing this! Whoa, this is powerful! This is sketchy. I should really learn how to ride this before I actually attempt something. Okay, Im at full blast right now on the boosted. [Intro] So I just barely got the brand new Boosted Board 2 the other day, this one, and Ive never really ridden a Boosted Board before. Ive ridden snowboards, but Ive never been like a skateboarder or a long boarder. So being on this is slightly weird, but the first thing that came to my mind when I got this board, and I dont know why, but can it pull a Tesla? Cuz they are both battery powered. One is significantly heavier than the other, but it would be interesting to find out. If your Tesla dies, can your Boosted Board save you? So looking underneath the Tesla, there are no points to attach like a tow strap or anything, but Dan here can pull off that front grill type thing, and that leaves us with some holes in the frame that hopefully we can attach something to for our towing adventure. So we tried attaching this yellow tow strap, but it doesnt have any hooks on it. Like theres only one little spot for the tow strap to grab on right here. Luckily Jerry Rig Everything has more than one tow strap in his truck. So Im going to attach that here. I have a bad feeling about this. [Dan] We got to put the car in neutral. [Zack] Well see what happens. [Zack] Dan, has your Tesla ever died on you before? [Dan] Just this last week. Like, we went to Hawaii. We went to the Haiku Stairs trail thing. Over those 4 days we lost the 40 miles that were remaining on our battery range. They tell me that you lose 2-5 percent a day. And so I get to the airport and I dont know what to do. What do you do when an electric car dies? So we made an entire video off of it, but one thing that I did learn is that you cant even put your car into neutral unless you take off this front guard and you jump start the 12 volt battery that I didnt even know existed. And then you can put it in neutral. [Zack] So how do you put a Tesla in neutral, man? [Dan] Alright, put your foot on the brake. Just barely halfway push this right here, the gear shifter. And now were in neutral. So if I let go, were pretty much stopped. Oh, it automatically put it into park. Yeah. How are we going to do this? [Zack] So as soon as you let go of the neutral it put it into park? [Dan] Yes. Maybe I have to stay in it. Oh cuz the doors open. Let me try it with the door shut. Alright Im in neutral. Okay, were stuck in neutral. I just have to sit in the car. The cars smart enough it knows not to stay in neutral if youre out of it. [Zack] If you roll down your window and you come out of the car, will it still stay in neutral? [Dan] Nope, it just already went into park. [Zack] Alright. [Dan] So youre going to have to have a passenger. [Zack] You stay there. Ill grab the board. So quick think about the Boosted Board. You have this little handle right here that basically gives you the battery life of your Boosted Board and it has this knob up top. So if I pull this trigger and roll the knob forward and backward, its going to move the Boosted Board. So right now Im in something called like the Beginner Mode, which is like what newbs are supposed to be using, cuz I havent ridden a Boosted Board that often. So Im going to use that first mode and try to move the Tesla here in the garage. And if that first mode doesnt work, I have three other modes after that that might end up working. So lets see what happens. [Dramatic music playing] [Zack] Were moving! Were moving! Okay, but its not strong enough. That was pretty cool. We were only in Beginner Mode and the car was moving. So Im going to jump up to mode number four by pressing this button three times. So now that it beeped four times, we are now in the fourth mode which is what the Pro Mode is, or the Advanced Mode, which I shouldnt be in right now. So lets see what happens. [Dramatic music playing] [Zack] Okay! I should not be doing this! Whoa, this is powerful! This is sketchy. I should really learn how to ride this before I actually attempt something. Okay, Im at full blast right now on the boosted. Oh, this is sketchy! Its working! Its working! Yeahhhh! [Dan] Look at that! Were going one mile an hour! Its rolling! [Zack] Woohoo! Nice! [Zack] So here we have two different Boosted Boards, we have mine, which is the version 2 and we have Whats Insides, which is the version 1. There are a couple differences between the two. One right here, if you can see inside of this motor as its turning, you can see the little brushes inside and the copper wires that make the motor turn. This one is all sealed shut on the version 2 Boosted Board. If water ever gets inside it wont damage the motors. Also, these cables are waterproof there. Lengthwise, the boards are about the same, but it looks like with the version 2, the tires are slightly bigger. And on the version 1 you can kind of see the lines where the cables run from the back to the front. The version 2 doesnt have those yet. Not sure if its just because I havent ridden it enough or if they hid the wires some other way. [Dan] How about this? [Zack] Nice. This is why we have Whats Inside! So why is this one cut in half Dan? [Dan] This is one of our first videos we ever did. First collaboration; we did it with Shonduras, and we cut open a Boosted Board. We took it to a skate park first. But I didnt know that these wires went from one side to the other underneath the grip tape. So that was an interesting thing to find out. And then you can also see down in here the circuit board. This isnt the battery, this is what chargesgets the motor going here. But the batterys on the other side. It talks to eachother with this running down through there all the way into those holes. And then from there, the battery was on therereally strong Lithium Ion batteries that I was hitting with a hammer, before I knew that Lithium Ion batteries are dangerous to puncture. And that was the only thing that Boosted Board officially said to us. They sent us a Tweet saying: Dont ever hit batteries. It could be very dangerous. So they saw our video obviously and thats all they chose to say on it. So, I learned my lesson. The one wish that I have is that the version 1 was waterproof because in our Gold Play Button video I accidentally launched Lincolns Boosted Board, which is actually Caseys, which Lincoln was borrowing, into the East River in New York City. And I had to buy him a new one and it cost me 1,300 hundred dollars. But if we would have had the other one, you could have fished it out like he did and it would have still worked. So yeah. [Zack] So I did not expect that to work. The Tesla weighs about 5,000 pounds, and including me on top of the Boosted Board trying to pull a car, I didnt think it was going to happen. The motor on the Boosted Board is pretty small. Obviously its probably not the best thing to do with your Boosted Board since the Boosted Board was struggling pretty hard, and the motors were stuck in one spot. They werent able to spin and cool down and keep themselves cool as they were moving. And even though this project was pretty fun, it is slightly unrealistic just because when the Tesla dies, just like Dan said, you cant put it in neutral, the batterys dead. Maybe in my next video well see if a DJI Mavic can pull a helicopter. You never know whats possible these days. Ive linked both Casey Neistats and Whats Insides YouTube videos for your Boosted Board viewing enjoyment. Hit that thumbs up if you like seeing technology tested in weird ways. And thanks a ton for watching. Ill see you around!",
    "transcript_keywords": [
        "Boosted Board",
        "boosted",
        "Board",
        "Lincolns Boosted Board",
        "Tesla",
        "neutral",
        "Boosted Board save",
        "Mode",
        "Boosted Board officially",
        "Boosted Board viewing",
        "put",
        "thing",
        "car",
        "version",
        "battery",
        "Tesla dies",
        "Beginner Mode",
        "Boards",
        "Lincolns Boosted",
        "inside"
    ],
    "transcript_entity_values": [
        "Boosted Board 2",
        "Shonduras",
        "the Boosted Board",
        "a Boosted Board",
        "Lengthwise",
        "Lincoln",
        "Hawaii",
        "Zack]",
        "Zack] Woohoo",
        "Gold Play Button",
        "Casey Neistats",
        "one mile an hour",
        "the Pro Mode",
        "the other day",
        "four",
        "Zack] Nice",
        "two",
        "three",
        "Caseys",
        "Luckily Jerry Rig",
        "DJI",
        "1",
        "Tesla",
        "1,300 hundred dollars",
        "half",
        "about 5,000 pounds",
        "the Beginner Mode",
        "2 Boosted Board",
        "Lincolns Boosted Board",
        "Zack] Dan",
        "12 volt",
        "more than one",
        "Dan]",
        "the East River",
        "Beginner Mode",
        "Boosted Board",
        "Tesla",
        "first",
        "the Advanced Mode",
        "those 4 days",
        "Dan] Alright",
        "First",
        "Lithium Ion",
        "Mavic",
        "the 40 miles",
        "Dan",
        "2-5 percent",
        "Lithium Ion",
        "Zack",
        "One",
        "fourth",
        "these days",
        "Dan] Nope",
        "one",
        "New York City",
        "Boosted Boards",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "LAW",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "FAC",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "EVENT",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "LOC",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "ORDINAL",
        "FAC",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.07169347256422043,
        0.00240090093575418,
        -0.05316118150949478,
        0.013901454396545887,
        -0.006686124484986067,
        0.011812450364232063,
        0.0006825485033914447,
        0.09955092519521713,
        -0.05989326164126396,
        -0.011623946949839592,
        0.06332435458898544,
        0.04411568492650986,
        0.057491570711135864,
        0.037056080996990204,
        -0.03115101344883442,
        0.0395096093416214,
        0.1014690026640892,
        0.035777173936367035,
        -0.023197460919618607,
        0.14127762615680695,
        0.04318428412079811,
        -0.027234135195612907,
        0.019815567880868912,
        -0.02199135720729828,
        0.008944877423346043,
        0.0089356554672122,
        -0.10450582951307297,
        0.08560720086097717,
        -0.0253913477063179,
        -0.042497728019952774,
        -0.010347106494009495,
        0.0025662491098046303,
        0.005613683722913265,
        -0.042388416826725006,
        0.017551466822624207,
        -0.012157303281128407,
        -0.012627621181309223,
        0.03993073105812073,
        -0.007635203655809164,
        -0.03043767437338829,
        -0.009713851846754551,
        -0.0762849673628807,
        0.03786680847406387,
        0.07063263654708862,
        -0.017342254519462585,
        0.05065784603357315,
        0.07709011435508728,
        -0.03818322718143463,
        -0.06288133561611176,
        -0.08647470921278,
        -0.06951282918453217,
        -0.07741415500640869,
        0.08237197995185852,
        -0.018956132233142853,
        -0.09531356394290924,
        -0.03982962667942047,
        -0.004530963953584433,
        0.027229169383645058,
        0.06047067791223526,
        -0.009447447955608368,
        -0.010651549324393272,
        -0.017364654690027237,
        0.028111854568123817,
        -0.0038353868294507265,
        0.0459948405623436,
        -0.0820527896285057,
        -0.07627662271261215,
        -0.0556986965239048,
        -0.049816716462373734,
        0.012525810860097408,
        0.12975244224071503,
        -0.0847901999950409,
        -0.033630408346652985,
        -0.031563788652420044,
        -0.006362804677337408,
        -0.00028734689112752676,
        -0.010321189649403095,
        0.06607935577630997,
        -0.05859289690852165,
        -0.01711045391857624,
        -0.006421729456633329,
        -0.049497537314891815,
        -0.017530372366309166,
        -0.036576464772224426,
        0.008115457370877266,
        0.03029368259012699,
        0.0313132219016552,
        0.0534687265753746,
        -0.05663776770234108,
        0.03986551612615585,
        -0.0236193984746933,
        0.06666552275419235,
        0.08090002089738846,
        0.04251328483223915,
        -0.02735757827758789,
        -0.011816192418336868,
        -0.062463730573654175,
        -0.06450721621513367,
        -0.012094870209693909,
        -0.007049076724797487,
        0.07452782243490219,
        0.11082783341407776,
        0.02157662622630596,
        -0.04326527938246727,
        -0.037496887147426605,
        -0.03496401384472847,
        -0.07369261234998703,
        0.06930229812860489,
        0.010882765986025333,
        0.019323552027344704,
        0.024569405242800713,
        -0.02014489844441414,
        0.0018065253971144557,
        -0.01587560586631298,
        -0.04850766435265541,
        -0.0034490670077502728,
        -0.031923115253448486,
        0.033707231283187866,
        0.019384702667593956,
        0.05218906328082085,
        0.02542983740568161,
        -0.07670442759990692,
        0.11847224831581116,
        0.0632740780711174,
        0.018327660858631134,
        0.025580501183867455,
        0.005894486326724291,
        4.417357527518442e-33,
        -0.06313832104206085,
        0.009113406762480736,
        -0.021832771599292755,
        -0.01795221120119095,
        0.03778056427836418,
        -0.02987990342080593,
        -0.013814760372042656,
        0.016340777277946472,
        -0.00037367030745372176,
        0.08599137514829636,
        0.020003478974103928,
        0.09808140248060226,
        0.06442829966545105,
        0.099711574614048,
        0.0004792960826307535,
        0.026665495708584785,
        -0.04791301116347313,
        -0.1415935456752777,
        -0.09294737130403519,
        0.023063382133841515,
        0.06585175544023514,
        -0.013790762983262539,
        0.12191523611545563,
        0.08647367358207703,
        0.09891006350517273,
        -0.04425809532403946,
        0.007706659846007824,
        0.049723342061042786,
        0.036130186170339584,
        -0.0075155748054385185,
        -0.0576908178627491,
        -0.09385465085506439,
        -0.0465427041053772,
        0.014412686228752136,
        -0.0018963280599564314,
        0.025813419371843338,
        0.02195744775235653,
        -0.08720418065786362,
        -0.032709989696741104,
        -0.018457135185599327,
        -0.014871359802782536,
        -0.07459184527397156,
        -0.05057684704661369,
        -0.06475415825843811,
        -0.03766760602593422,
        -0.015446518547832966,
        0.010970978997647762,
        -0.055359676480293274,
        -0.06972679495811462,
        -0.06989501416683197,
        0.02800765447318554,
        -0.04819430038332939,
        0.022753138095140457,
        -0.01891828328371048,
        -0.0036731630098074675,
        0.030865736305713654,
        0.020024769008159637,
        0.11456938832998276,
        0.04940169304609299,
        0.018111931160092354,
        -0.047328732907772064,
        0.08077559620141983,
        0.013355979695916176,
        -0.007952296175062656,
        -0.10852759331464767,
        0.06799659878015518,
        -0.035006333142519,
        0.02214590460062027,
        -0.059690218418836594,
        0.02397717535495758,
        0.03625594452023506,
        -0.043531667441129684,
        -0.015539388172328472,
        -0.01959199458360672,
        0.004505403805524111,
        -0.022281896322965622,
        -0.06952176988124847,
        -0.03179106488823891,
        0.02785278856754303,
        -0.06279866397380829,
        -0.10150989145040512,
        0.025841547176241875,
        0.04317128285765648,
        -0.028534140437841415,
        0.08454645425081253,
        0.026717592030763626,
        -0.06728871911764145,
        -0.03583499416708946,
        0.04413316026329994,
        0.008125076070427895,
        0.0035962730180472136,
        -0.013355297967791557,
        -0.03547457605600357,
        -0.012574510648846626,
        0.01072301622480154,
        -5.990520147855971e-33,
        -0.049613505601882935,
        -0.0007681715651415288,
        0.023991165682673454,
        0.019406983628869057,
        0.09633026272058487,
        0.019582638517022133,
        -0.06853948533535004,
        -0.01257497351616621,
        0.028591927140951157,
        -0.011616594158113003,
        0.009724142029881477,
        -0.0087180370464921,
        -0.026443418115377426,
        0.03335125371813774,
        0.06933309882879257,
        -0.0064557939767837524,
        -0.015168027020990849,
        -0.01554771140217781,
        -0.05524005368351936,
        -0.006383297499269247,
        0.03996085375547409,
        -0.0010955894831568003,
        0.049272142350673676,
        0.10302821546792984,
        -0.03245912864804268,
        0.030701350420713425,
        0.03762756288051605,
        0.02576897107064724,
        0.04566046595573425,
        0.009345232509076595,
        0.01138288713991642,
        -0.022204367443919182,
        -0.06017625331878662,
        0.02617151103913784,
        -0.058522678911685944,
        -0.0055071404203772545,
        -0.006312184035778046,
        0.05613045394420624,
        0.024082651361823082,
        -0.057326894253492355,
        -0.0410054586827755,
        0.009777053259313107,
        0.02255128137767315,
        0.02146439626812935,
        -0.05973069742321968,
        -0.029208969324827194,
        -0.02518477477133274,
        0.04618392139673233,
        0.02565791830420494,
        0.023836659267544746,
        0.05206199362874031,
        -0.016245556995272636,
        0.022515226155519485,
        0.0715952068567276,
        -0.01629508100450039,
        -0.045651838183403015,
        0.11987229436635971,
        0.026478147134184837,
        -0.0583285428583622,
        -0.04854787141084671,
        0.05644919350743294,
        0.008582054637372494,
        -0.06975825130939484,
        -0.02866765670478344,
        -0.004807686898857355,
        -0.0967487022280693,
        -0.010186728090047836,
        -0.029751861467957497,
        -0.016568562015891075,
        0.010231820866465569,
        -0.020244227722287178,
        0.03563632816076279,
        -0.020181600004434586,
        -0.05701698362827301,
        -0.0859358161687851,
        0.11620276421308517,
        0.025883011519908905,
        0.02297549694776535,
        0.033832304179668427,
        -0.16215473413467407,
        -0.017865274101495743,
        -0.00028398350696079433,
        0.10297975689172745,
        -0.053069256246089935,
        0.07857377827167511,
        0.021499354392290115,
        -0.05501285195350647,
        0.011515732854604721,
        0.06921277195215225,
        -0.03313713148236275,
        0.09443584084510803,
        0.003720373148098588,
        0.017712585628032684,
        0.03400256857275963,
        -0.11040347814559937,
        -5.4612240063534045e-08,
        0.04734759032726288,
        0.07173493504524231,
        -0.020895501598715782,
        -0.06132842227816582,
        0.014174174517393112,
        0.032850589603185654,
        0.05003974586725235,
        -0.04938294738531113,
        -0.04362400621175766,
        0.018034223467111588,
        0.03287723287940025,
        -0.023735571652650833,
        0.016230739653110504,
        0.05583158880472183,
        -0.03152310103178024,
        0.030381940305233,
        0.04798588156700134,
        0.06642036139965057,
        -0.012689485214650631,
        0.028730647638440132,
        -0.008884330280125141,
        -0.03784541040658951,
        -0.02955404296517372,
        0.09517142921686172,
        -0.016484368592500687,
        -0.03786848857998848,
        -0.04314630851149559,
        -0.00890843104571104,
        0.043990813195705414,
        -0.0988360270857811,
        -0.041645098477602005,
        0.0290131364017725,
        0.038006603717803955,
        -0.01962408423423767,
        0.025614146143198013,
        -0.031366635113954544,
        -0.04178337752819061,
        -0.040027324110269547,
        -0.045991744846105576,
        0.010010050609707832,
        0.0798962339758873,
        -0.05689924582839012,
        -0.0254603810608387,
        0.006096080876886845,
        -0.13536958396434784,
        -0.022031234577298164,
        -0.06348975747823715,
        -0.11675003916025162,
        -0.015142830088734627,
        0.09480688720941544,
        -0.03466637805104256,
        -0.06034798175096512,
        -0.04967604950070381,
        0.015644855797290802,
        0.024816781282424927,
        0.1223517581820488,
        -0.06509175896644592,
        0.02624678425490856,
        -0.019407177343964577,
        -0.07462352514266968,
        0.01221555471420288,
        -0.08601260930299759,
        0.059783533215522766,
        0.04809138551354408
    ]
}