{
    "id": "lW7Mxj8KUJE",
    "title": "Here's why Chrome is SLOW (It's NOT your RAM)",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-05-14T16:57:59Z",
    "video_url": "https://www.youtube.com/watch?v=lW7Mxj8KUJE",
    "category": "Science & Technology",
    "tags": [
        "chrome",
        "google chrome",
        "chrome broswer",
        "chrome is slow",
        "microsoft chrome",
        "microsofte edge",
        "vivaldi",
        "safari",
        "brave",
        "edge",
        "internet is slow",
        "internet broswer",
        "chrome sucks"
    ],
    "views": 1458912,
    "likes": 54410,
    "comments_count": 4787,
    "description": "Get a free 14-day trial of Odoos all-in-one business solution and see how it can make your life easier! Check it out at   Google Chrome isn't as good as it used to be. While it was a great replacement for Internet Explorer and Firefox and Safari, but as it's become the dominant browser, it seems like it ain't quite how it used to be. And now that browsers like Microsoft Edge, Brave, Opera GX and Vivaldi have all switched to run on Chromium, we decided to get to the bottom of those performance woes.  Discuss on the forum:   Buy an Intel Core i5-13400F CPU:  Buy a Noctua NH-D15 CPU Cooler:  Buy a Gigabyte Z790 Aorus Master Motherboard:  Buy an EVGA GeForce RTX 3060 XC GAMING Graphics Card:  Buy XPG Lancer 5200MTs CL338 2x8GB DDR5 RAM:  Buy a Samsung 980 Pro 2TB NVMe M.2 SSD:   Purchases made through some store links may provide some compensation to Linus Media Group.    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:53 How To Test A Browser 3:40 RAM Utilization 4:50 Broswer Performance 6:49 What Can YOU Do? 10:05 Outro",
    "description_links": [
        "https://www.odoo.com/r/5eLS",
        "https://linustechtips.com/topic/1570169-here%E2%80%99s-why-chrome-is-slow-it%E2%80%99s-not-your-ram/",
        "https://geni.us/J5uls",
        "https://geni.us/oPunILL",
        "https://geni.us/nfXb1",
        "https://geni.us/ksIB73",
        "https://geni.us/8LGaz",
        "https://lmg.gg/EGim6",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Man, Google Chrome kind of sucks now, right? I remember when everyone was screaming, \"Stop using Internet Explorer! \"Chrome is so much faster!\" Is that all a lie? No, actually. Chrome was a revolution. It was lightweight, fast as all get out, and it brought great features, like tabs and \"boxing\", so that if one of your tabs froze, your entire browser didn't have to crash like the old days. So what changed then to turn Chrome into this bloated, ram-devouring behemoth? Maybe it was... YOU! Me? I mean, I don't have the best browsing habits, I leave way too many tabs open, but... Chrome has a way of dealing with that, using dynamic caching for the tabs I'm not using. Sure, but is Google the one who installed all of those extensions? I mean, I don't have that many, I just have Zotero for tracking my research, Language Tool for... teleparty, and an adblocker. Could it be that his insatiable thirst for extra functionality is bogging down his browser? As it turns out, yes. I need to make some changes. But not every extension is made equal. While some had no effect on browser performance, others, like LastPass, reduced performance by as much as 12%, an effect that stacks across your library of resource-sucking add-ons. With 2/3 of people using Chrome as a default browser, it's clear that we need to see just how bad the situation is, explore what can be done to fix it, and talk about Google's solution. Including why it might be a bad one. So quickly now, to the lab! Wait, this isn't the lab. This is the segue to our sponsor, Odoo. If you own a business, you'll know what I mean when I say you probably have too many apps running at the same time. With Odoo's all-in-one business software, you can combine all of those into a single unified platform. So click the link in the description to learn more. Our labs team has a fair bit of experience under their belt, testing video games and productivity apps, but this is one of our first forays into browser performance and how exactly you measure browser performance is a big question, primarily because browsers are big programs. Chromium, the open source framework that Chrome is based on is 31 million lines of code. \"That is almost as much as the Linux kernel.\" The core of Linux-based operating systems, and it's close to the estimated count for older, complete operating systems like Windows XP. Which probably sounds ludicrous, right? Until you consider that, I mean, outside of games, how many programs do you run that aren't in your browser? And of those ones, how many of them are just web apps that could run in your browser? So the thing is, modern browsers need to be able to support pretty much everything from 28 year old GeoCities pages to full blown Photoshop clones. So coming back to the question of how to measure their performance, it's challenging because browsers do a lot of different things. But we're going to do our best, starting with a machine that is based on the most common specifications in a recent Steam hardware survey. To look at memory use, we opened up Chrome to a set of common web pages and on a clean system measured our idle RAM usage at around 1.1 gigabytes which increased to 1.25 when we were streaming 4k video. Even on a system with just 8 gigs of RAM that's not a problematic amount of usage and it's important to note that even if it was higher that isn't necessarily a bad thing. Programs that need to access information quickly will benefit from using up more RAM and as long as they give it up in the event that your OS or another program needs it it's not really a problem. But what happens when we add extensions? Well, as it turns out it depends on the type. Our password manager LastPass and our third-party spell checker Grammarly both used considerably more RAM than say coupon code collector Honey. One extension, insert usual disclaimer about the impact on creators, actually reduced our overall RAM usage and that was uBlock Origin which is clearly effectively blocking ads and trackers from sapping our system resources. Though... Funnily enough, the more popular Adblock extension didn't have the same effect, which kind of makes us question its effectiveness, especially when they advertised that their extension saves memory. Overall, with 10 of the most popular extensions, we observed a nearly 50% increase in RAM usage. With half a dozen tabs open, that's not that big of a deal, but as your tab addiction grows, so unfortunately... does your problem. By the time we reached 48 tabs, we were looking at a whole two gigabytes of extra RAM usage for what is functionally the same user experience. I mean, you're not looking at all those windows at once, are you? I mean, of course, if you have ample system memory, you're probably not gonna notice the difference anyway. Will you? Actually, you might. To gauge performance of our browsers, we ran several benchmarks that aim to test the many features of the web. In MotionMark, which measures graphics performance in our browser, most of our extensions caused virtually no change in performance, except, this is kind of a funny one, our ad blockers. You see, ad blockers need to interact with the rendering pipeline in order to hide ads without turning your web pages into a completely fragmented mess. And that appears to have resulted in a reduction in in-browser rendering performance. Now, in the real world, this slowdown is gonna be masked by other speed benefits, but we thought it was an interesting observation nonetheless. Moving on to speedometer a benchmark that's focused on simulating user experiences like working with a to-do list Editing rich text rendering charts and reading news sites. We found a totally different story here It's the last pass causing a big slowdown and our best guess is that this is due to last pass trying to scan Every text field for potential autofill opportunities in jet stream 2 a benchmark that's focused on smooth operation We found that Adblock and Grammarly did a lot of damage, but then LastPass was relatively benign, and then in WebExpert 4.0, we measured just 3% reduced performance with all of our extensions enabled at once. So sometimes your extensions matter, sometimes they don't, and sometimes different ones will or won't. The results just don't really seem to add up to a clear picture, but hey, maybe the problem is we're looking too closely. If we zoom out and look at the overall. A clear trend develops, especially when we configure our browser like a regular person would, and we have multiple extensions running concurrently. With everything enabled, we lose something like a quarter of our performance in the Chrome web browser. If you're a major surfer, 25%. That's the kind of difference that you could really notice in day-to-day use. I mean, think of all the extra LTT behind the scenes that you could watch on lmg.gg/floatplane with all that extra time. So what do we do about this? Well, some extensions are always consuming some level of system resources, and you can track this yourself by pressing Shift + Escape to open the Chrome Task Manager. At the bottom of your list will be your extensions, and writing this right now, I'm noticing some of my extensions being needlessly active. Page Downloader Single File, why is that open? I'm not downloading anything. But then the PDF editing extension that I'm using seems to respect the fact that I don't always need it running, and it's not consuming anything. Now's a perfect time then, to go through and cull some of your more inconsiderate extensions, especially if you aren't using them that much anymore. All it'll cost you is a few seconds to click that little puzzle block and, here's a good rule of thumb, if you don't remember the last time you used it, or what it's for, just get rid of it. You can always reinstall it later. If you have lots of RAM, and good tab management, turning off the memory saving feature in Chrome will speed things up as well, as Chrome will spend less time reloading pages. Preloading pages can also speed things up, but if you're someone who uses an ad blocker or a privacy extension, preloading isn't really an option. Speaking of privacy, this is unrelated to extensions, but while you're in the menu, why not stop by the ad privacy section and turn all of that tracking off? We can't really give you an after result for the impact of all the changes you just made. I mean, your mileage may vary depending on what you removed or didn't and your overall web browsing habits. But from what we've seen anecdotally, it is very possible that you'll notice a difference. Just not in startup times. This was a really interesting part of our test that we're tacking on the end here. We found that with a reasonable extension loadout, the application takes about the same amount of time to launch regardless of what you do or don't have active. Then again, I guess who cares anyway, because when's the last time you closed Chrome? I see that update button. The last thing that you can do is to uninstall Chrome. And I'm only kind of joking right now. The rollout of Google's Manifest V3 is set to dramatically change the capabilities of Chromium extensions, which, by the way, also affect Microsoft Edge now, especially hindering the effectiveness of ad blockers and privacy- enhancing extensions. We haven't tested Firefox's performance with extensions or without, because realistically, most of you aren't using it. But hey, maybe next time we do an update on this, the situation will have changed because you'll have listened to our advice. Why not give it a try? And while you're at it, why not try out our sponsor? Odoo. If you're running a business, keeping track of a hundred different apps all running at once can be a pain. I mean, just imagine all those Chrome tabs. With Odoo's all-in-one business management software, you can combine them into a single unified operating system. Check out their CRM and sales apps, which make lead generation and closing deals easier than ever. Their timesheets app helps you keep close track of your employee schedules, and their accounting app lets you auto-create and send invoices, and it integrates with 28,000 banks from all around the world. And if you only need one single app to shore up some holes, hey, you can get access to that for free. So start saving time and resources by unifying your processes with Odoo. You can check them out in the description for a free 14-day trial or to set up a demo with their expert team. Thanks for watching. If you guys liked this video, maybe you'll enjoy another deep dive into minor differences in computer performance. Check out our video where we tested 12 of the same CPU so that we could find a set of them that were nearly identical in performance. Why did we need those? We'll never tell. Well, we will in that video, but not here.",
    "transcript_keywords": [
        "Chrome",
        "extensions",
        "performance",
        "RAM",
        "browser",
        "RAM usage",
        "time",
        "Internet Explorer",
        "Google Chrome kind",
        "extension",
        "browser performance",
        "Chrome web browser",
        "tabs",
        "Google Chrome",
        "Odoo",
        "system",
        "Google",
        "web",
        "browsers",
        "apps"
    ],
    "transcript_entity_values": [
        "PDF",
        "GeoCities",
        "Stop using Internet Explorer",
        "one",
        "14-day",
        "Google",
        "first",
        "One",
        "31 million",
        "hundred",
        "a few seconds",
        "Firefox",
        "28 year",
        "4k",
        "the old days",
        "2/3",
        "half a dozen",
        "just 3%",
        "nearly 50%",
        "Adblock",
        "1.25",
        "Grammarly",
        "10",
        "Microsoft Edge",
        "RAM",
        "around 1.1 gigabytes",
        "8",
        "25%",
        "Language Tool",
        "uBlock Origin",
        "LTT",
        "28,000",
        "48",
        "CRM",
        "CPU",
        "Zotero",
        "LastPass",
        "2",
        "WebExpert",
        "as much as 12%",
        "Chrome",
        "12",
        "Odoo",
        "Linux",
        "third",
        "Odoo",
        "MotionMark",
        "Windows XP"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT"
    ],
    "vector": [
        -0.02278534509241581,
        0.009272952564060688,
        0.04334999993443489,
        0.04828520491719246,
        0.059751786291599274,
        -0.03952901065349579,
        -0.08787626773118973,
        0.017282923683524132,
        -0.057644836604595184,
        -0.08768581598997116,
        -0.0458773672580719,
        -1.677706495684106e-05,
        -0.04726219177246094,
        0.0032527928706258535,
        0.0694136843085289,
        0.039613667875528336,
        0.10569124668836594,
        -0.03791781887412071,
        -0.023000327870249748,
        0.008424634113907814,
        -0.12054602801799774,
        -0.12429909408092499,
        -0.048158351331949234,
        -0.04913734644651413,
        0.0012033936800435185,
        0.10338681191205978,
        -0.08195522427558899,
        -0.055838167667388916,
        0.001675640232861042,
        -0.0788971483707428,
        -0.0008540695416741073,
        -0.023669620975852013,
        -0.011824254877865314,
        0.014058512635529041,
        -0.047152820974588394,
        -0.025549139827489853,
        -0.01439872570335865,
        -0.022816624492406845,
        -0.06324056535959244,
        0.021275578066706657,
        -0.008812475949525833,
        0.09041030704975128,
        -0.04708230122923851,
        -0.008336175233125687,
        0.029821576550602913,
        -0.06853600591421127,
        0.02417207695543766,
        0.015115726739168167,
        0.023370064795017242,
        -0.07776094228029251,
        -0.04478313773870468,
        0.006843005307018757,
        0.006504847668111324,
        -0.049401529133319855,
        -0.1125360056757927,
        0.09145721793174744,
        -0.013985996134579182,
        -0.0672479122877121,
        0.08889970928430557,
        0.02894420363008976,
        0.02241489291191101,
        -0.06005913019180298,
        0.08101796358823776,
        0.05603272467851639,
        0.008338703773915768,
        0.04883512854576111,
        0.045639339834451675,
        -0.038264404982328415,
        -0.024673527106642723,
        0.05592009052634239,
        -0.0025049573741853237,
        0.08302448689937592,
        0.0047204094007611275,
        0.006847952492535114,
        -0.046936508268117905,
        -0.05728907138109207,
        0.06238393858075142,
        -0.03534011170268059,
        0.04021730646491051,
        -0.0032341103069484234,
        -0.019256092607975006,
        -0.0789962187409401,
        -0.007293722592294216,
        0.0016700634732842445,
        0.079078309237957,
        0.009688358753919601,
        0.057395610958337784,
        -0.05947905406355858,
        -0.07598324865102768,
        -0.056262094527482986,
        0.030389130115509033,
        0.04550379514694214,
        0.06393242627382278,
        0.022068137302994728,
        0.06442148983478546,
        0.030002687126398087,
        0.08709757030010223,
        -0.014929129742085934,
        -0.03978751227259636,
        0.06066768616437912,
        0.06065785139799118,
        0.06408802419900894,
        0.07407060265541077,
        -0.02412007749080658,
        -0.0761021226644516,
        0.04604727029800415,
        0.03155237436294556,
        0.1137082502245903,
        -0.03974788263440132,
        -0.030653374269604683,
        0.02975882589817047,
        0.03406185656785965,
        -0.02392464317381382,
        0.01830625906586647,
        -0.02688498981297016,
        -0.044595446437597275,
        -0.06971057504415512,
        -0.015174778178334236,
        0.1495792120695114,
        0.14250604808330536,
        0.03359725698828697,
        0.041626058518886566,
        -0.08732783049345016,
        0.014157569967210293,
        0.0505758561193943,
        0.010016173124313354,
        -0.0222261194139719,
        9.192242396523452e-33,
        -0.013148843310773373,
        0.012747831642627716,
        -0.04801235720515251,
        -0.08971260488033295,
        -0.013013703748583794,
        0.026086097583174706,
        0.01000543124973774,
        0.007705716881901026,
        0.002973890630528331,
        -0.012843708507716656,
        0.03672129288315773,
        -0.002873621415346861,
        -0.0740339607000351,
        0.005860098171979189,
        0.08411867171525955,
        -0.024294408038258553,
        -0.03276488929986954,
        -0.026463551446795464,
        0.033499594777822495,
        0.007648791652172804,
        0.04714387282729149,
        -0.016080405563116074,
        -0.08486852794885635,
        -0.016276605427265167,
        -0.02320476621389389,
        0.046133287250995636,
        -0.024533789604902267,
        0.016959190368652344,
        -0.06404778361320496,
        0.01376668456941843,
        -0.010968235321342945,
        -0.04287182539701462,
        -0.07556330412626266,
        0.027420617640018463,
        0.03333841264247894,
        -0.0408114492893219,
        0.030755095183849335,
        -0.05306951329112053,
        0.011185789480805397,
        -0.005963700823485851,
        -0.06404225528240204,
        0.07032082229852676,
        -0.037800490856170654,
        -0.03942359611392021,
        -0.08820659667253494,
        -0.04513952136039734,
        -0.012981061823666096,
        0.007863495498895645,
        0.0070273978635668755,
        0.03814404830336571,
        -0.05152002349495888,
        0.03437403216958046,
        -0.038221631199121475,
        0.08494666963815689,
        -0.013675385154783726,
        -0.029307899996638298,
        0.07663526386022568,
        0.03402528539299965,
        0.03582710027694702,
        0.04071320220828056,
        -0.014129550196230412,
        -0.06868170946836472,
        -0.10314930975437164,
        0.044311974197626114,
        -0.03998846560716629,
        -0.033367712050676346,
        0.054192956537008286,
        0.08249155431985855,
        -0.12174229323863983,
        -0.04416355490684509,
        0.00439206138253212,
        -0.013435921631753445,
        0.09144485741853714,
        -0.023702895268797874,
        0.05453617498278618,
        -0.025914987549185753,
        -0.001799723831936717,
        -0.05172153189778328,
        -0.06491678208112717,
        -0.052289996296167374,
        0.0010101849911734462,
        0.08967283368110657,
        0.031425751745700836,
        -0.05324813723564148,
        0.03215152397751808,
        -0.008773013018071651,
        0.02335342951118946,
        0.024351904168725014,
        0.006403626874089241,
        0.054189532995224,
        -0.0782417505979538,
        0.03002256341278553,
        0.028373684734106064,
        0.0229063481092453,
        -0.01455303281545639,
        -7.232127607046365e-33,
        -0.06800683587789536,
        -0.044307950884103775,
        0.042095642536878586,
        0.10367456078529358,
        -0.0029018810018897057,
        0.015426954254508018,
        0.000798691064119339,
        -0.01673627458512783,
        0.0010775283444672823,
        -0.06706967204809189,
        0.0006888830102980137,
        -0.015647633001208305,
        0.010481754317879677,
        0.029962487518787384,
        0.02862265147268772,
        0.048572007566690445,
        0.03668423369526863,
        -0.0868571475148201,
        0.045193981379270554,
        -0.07455943524837494,
        -0.021284716203808784,
        0.061371661722660065,
        -0.017177844420075417,
        0.03869728744029999,
        0.011136699467897415,
        0.03848421946167946,
        -0.0681660920381546,
        -0.0217667818069458,
        0.02898995392024517,
        0.0007034080917946994,
        -0.02226397767663002,
        0.05305851250886917,
        0.00921369343996048,
        0.0030343050602823496,
        0.07787621021270752,
        0.0496879443526268,
        0.013838190585374832,
        -0.008309722878038883,
        0.02959425188601017,
        -0.004621574655175209,
        0.02320372872054577,
        0.020851993933320045,
        0.03766418993473053,
        -0.025962913408875465,
        0.08880127966403961,
        0.1359698325395584,
        -0.036231886595487595,
        -0.07197680324316025,
        0.03461884707212448,
        0.09409848600625992,
        0.044309262186288834,
        0.02243032306432724,
        -0.03283318504691124,
        -0.024555178359150887,
        0.016787059605121613,
        -0.12319231033325195,
        -0.07229582220315933,
        -0.07439329475164413,
        0.009690910577774048,
        -0.06307924538850784,
        0.021623486652970314,
        0.013313932344317436,
        -0.07800894975662231,
        -0.008571453392505646,
        0.061417073011398315,
        0.013415660709142685,
        -0.03878914937376976,
        0.014964292757213116,
        0.0241528507322073,
        0.05257263034582138,
        -0.11591164022684097,
        -0.019606325775384903,
        -0.036760713905096054,
        -0.023855941370129585,
        -0.060993876308202744,
        0.05883263796567917,
        0.11374229937791824,
        0.017836324870586395,
        -0.014932128600776196,
        -0.030318763107061386,
        0.05196993052959442,
        0.08519992232322693,
        -0.002694997936487198,
        -0.10510837286710739,
        -0.03858289122581482,
        0.055174071341753006,
        -0.012730979360640049,
        -0.03208404779434204,
        0.003290602471679449,
        0.033488985151052475,
        -0.02256878651678562,
        0.035064321011304855,
        -0.0547998882830143,
        -0.016919953748583794,
        0.0026101870462298393,
        -4.920202201219581e-08,
        0.06267701089382172,
        -0.030152324587106705,
        -0.006652413867413998,
        0.08601117879152298,
        0.039361223578453064,
        -0.073632150888443,
        -0.013669558800756931,
        0.008909297175705433,
        0.09247053414583206,
        -0.047252535820007324,
        0.07030948996543884,
        -0.017558926716446877,
        -0.00948493741452694,
        -0.013012383133172989,
        0.04807950556278229,
        0.059903405606746674,
        -0.023798834532499313,
        -0.03270714357495308,
        0.03990856185555458,
        -0.05352143198251724,
        0.024501074105501175,
        0.02670888602733612,
        0.055006448179483414,
        0.003832989139482379,
        0.026987668126821518,
        0.030964769423007965,
        0.08949856460094452,
        0.015106587670743465,
        0.01610608398914337,
        0.010896735824644566,
        -0.13827699422836304,
        -0.016840076074004173,
        -0.05475277453660965,
        -0.05024033412337303,
        0.0855432078242302,
        -0.05431392416357994,
        -0.012367136776447296,
        0.01496602687984705,
        0.07855009287595749,
        0.016388187184929848,
        0.03909088298678398,
        0.056153055280447006,
        -0.04853875935077667,
        -0.021406758576631546,
        0.0382823571562767,
        -0.06726191937923431,
        -0.09509270638227463,
        -0.019368300214409828,
        0.11351649463176727,
        -0.029084645211696625,
        -0.08961290121078491,
        -0.08960583806037903,
        -0.007614396512508392,
        0.018367648124694824,
        0.03395099565386772,
        -0.016453934833407402,
        0.06087878346443176,
        -0.0058126444928348064,
        0.017632588744163513,
        0.052601542323827744,
        -0.02051270566880703,
        -0.037273142486810684,
        -0.03295798599720001,
        0.0159001387655735
    ]
}