{
    "id": "Lx6K35Acm-w",
    "title": "Why Minecraft is BIGGER Than Ever",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-07-26T16:31:15Z",
    "video_url": "https://www.youtube.com/watch?v=Lx6K35Acm-w",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "gaming",
        "minecraft",
        "fortnite",
        "minecraft monday",
        "pewdiepie",
        "james charles",
        "pewdiepie minecraft",
        "minecraft pewdiepie",
        "minecraft memes",
        "Chandrayaan",
        "nintendo switch",
        "joycon drift",
        "Vikram Sarabhai",
        "chandrayaan 2",
        "chandrayaan-2",
        "joy con drift",
        "joycon drift fix",
        "joy con drifting",
        "chandrayaan 2 news",
        "chandrayaan 2 isro",
        "how to fix joycon drift",
        "india's moon mission",
        "technoblade",
        "fix joycon drift",
        "joy con fix",
        "Indian Space Research Organization",
        "ISRO",
        "mr beast",
        "news"
    ],
    "views": 162131,
    "likes": 7717,
    "comments_count": 685,
    "description": "After 10 years, why is Minecraft suddenly so popular again? RAIDING Area 51?:  So You Want to Be an Astronaut:  How Japan Took Over 7-Eleven:  Where Do Banks Keep Your Money?:  Why There's a Traffic Jam on Mount Everest:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/HmW2MUiIIcI",
        "https://youtu.be/p7J63sLw_dU",
        "https://youtu.be/CU9vL6zdhso",
        "https://youtu.be/8Guyxz_-wEo",
        "https://youtu.be/l_3KVwHa36M",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys and welcome to This Is Now. Minecraft is officially 10 years old and it is arguably more popular than ever. For those of you who are out of the loop, it is still the same $26 it has been, but there are now two versions, Java and Bedrock. The Java version is the classic game available for PC or Mac, which usually gets updates first and generally has more features which of course makes it more popular with the hardcore redstone creators. Bedrock, however, is available on pretty much every platform such as iOS, Android, PC, Xbox One, Nintendo Switch, PS4, and more importantly, it allows cross play between platforms across different realms. Now, realms are severs that you can pay a monthly fee for and they allow you to have a multiplayer world with your friends and Java also does have realms, but there's no cross play across the different platforms since it is locked to be only PC and Mac, so you're pretty much only forced to have friends who are on the Java version. I haven't said the word Java this many times since like 2009. If you look at Google Trends over the last couple years, Minecraft's popularity was on the decline and games like Fornite and Apex Legends certainly played a big part in that, however, over the last few months, Minecraft's popularity has absolutely skyrocketed. Now, Mojang and its parent company, Microsoft, have definitely played a big part in the game's comeback. To a player who hasn't played in a while, such as me, the game is almost unrecognizable. Since Minecraft's debut 10 years ago, Mojang has continued to add more and more features and content. Last year, they introduced Update Aquatic which was a massive overhaul of the underwater biome and gave players a completely new way to play. They've also continued to develop the brand into spin-offs. In WWDC, they showed off Minecraft Earth, an augmented reality mobile game which is coming soon and has garnered some huge buzz. At this year's E3, they showed off yet another spin off game called Minecraft Dungeon which is releasing early next year and looks to be a lot of fun. It's a very Diabloesque Minecraft-style game, however, as much as Microsoft might not want to admit it, they really have YouTubers to thank for their newfound victory lap. Newfound victory lap, that's a weird way of saying that, but I'm gonna continue. Good old PewDiePie played Minecraft during his gaming week and he's played it almost everyday since, and for good reason, it's rare that his Minecraft videos don't eclipse 10,000,000 views. Even Jack Black joined in on one of the let's plays to get people to donate money to charity. Besides PewDiePie, other huge YouTube stars like James Charles, Mr. Beast, and TechnoBlade have all teamed up for Keemstar's Minecraft Monday which have been insanely popular, to the point where they actually out-streamed Fortnite for the first time. Even, I don't know if you saw, but Ninja actually jumped in one of them and he like rage quit 'cause he's just so mad at Minecraft. He should probably stick to Fortnite. - I can't do it anymore. Guys, thank you so much for watching, man, unfortunately I'm camping out. - Nostalgia definitely plays a big factor here. The fact that we're talking about a 10 year old game which is infinitely re-playable and of course it's gotten so much new content over the years, it means that instead of going back and being like, oh, I remember this game, it's like, oh, wait that wasn't there last time I played it. So my real thoughts on Minecraft is of course I used to play back in the day. We actually used to have a Minecraft server in like 2010, 2011. Yo, you were on the Minecraft server? Oh, look at this, Ken, being a supporter all the way back in 2010, but to me it's crazy that when you consider that Minecraft was purchased, or Mojang more specifically, was purchased by Microsoft four or five years ago and yet they've never brought out a Minecraft two. They're bringing out these spin-offs which is great, but the nice thing is is that if you bought that original copy of Minecraft like I did in 2010 in dev or whatever for like six bucks, it has still been up-to-date with 10 years of updates and that is so cool to see. On the main channel, we play a lot of Fortnite and PC gaming tutorials and all that kind of stuff 'cause they need a game to demo. You know there's a long time where I tried to play Minecraft on games because, believe it or not, in 2010, Minecraft was actually mildly challenging to run on some systems, so I was like, ah, my benchmark, Minecraft. Now it runs on like a $5 Raspberry Pi. (laughing) Fresh off the 50th anniversary of the Apollo 11 moon landing India has launched their own on-man mission to the moon, the Chandrayaan two, I think that's how you say it. The Indian Space Research Organization, otherwise known as the ISRO, launched a three stage rocket earlier this week from the Satish Dhawan Space Center. I'm just gonna roll with it. Its objectives are to soft land on the dark side of the lunar surface and deploy a robotic rover that will collect samples of the moon's surface as well as take seismic readings of any moonquakes, which is of course the moon equivalent of an earthquake. Originally, the launch was set for July 15th, but due to a technical glitch, the entire launch had to be scratched a near 56 minutes before the scheduled launch, however the recently schedule launch went off without a hitch and the Chandrayaan two completed its first orbit of Earth on Wednesday. The spacecraft will orbit Earth, slightly increasing the size of the orbit until it's close enough to be picked up by the moon's gravity. Basically like a slingshot where it goes around and around and around and then it gets picked up by the moon and kind of, you see the GIF, you understand. From there, they will launch the Vikram lunar lander module which is named after one of the pioneers of the Indian space program, Vikram Sarabhai. Sarabhai, that sounds like Celebi the Pokemon. - [Matt] I think it was Serabhai. - Sarabhai? Oh. Look, why do you make me says things that I just-- I can't say anything, I can't-- I can barely speak English. The Vikram will orbit the moon, this time decreasing the size of the orbit with each rotation until it's close enough to touch down on the lunar surface and the ISRO expects this entire process to take a total of 48 days with an estimated landing on September 7th. If the mission is successful, India will become just the fourth country to land on the moon behind China, the United States, and of course the former Soviet Union. Because of how cold the dark side of the moon is, minus 170 degrees Celsius and minus 274 degrees Fahrenheit, the lunar rover is only expected to last for one moon day, which is about 14 Earth days. So technically India did beat China, who also successfully landed earlier this year. The first version of the probe didn't perform a soft landing, instead it was literally crashed into the lunar surface as the deployment of the mission. A.K.A., you know, it's fine, it doesn't have to nice, soft ledge, just like crash, and they're like, oh look, we got a signal. They did mean to crash it, but obviously crashing something into the moon is easier than soft landing it. While the Indian Space Research Organization has been around for 50 years, they really have been ramping up the number of missions over the last decade, including a Mars orbiter mission as well as they launched 104 satellites in a single rocket which happens to be a world record. Now, a successful Chandrayaan two landing will be a big leap forward toward future man missions on the moon for India and of course, when it comes to space stuff, it is absolutely awesome to see anyone spending money and spending time and trying new things, right? So I think a lot of the headlines these days has been around SpaceX, and while it's great to see private companies spending lots of money to try to commercialize space, there's still a huge market for countries such as India as well as of course lots of other countries around the world to really take this stuff to the next level. The more space stuff, the better. The Nintendo Switch has been a massively successful console, but it has been plagued by one big issue. The dreaded Joy-Con drift. There have been reports of Joy-Con drift for quite a while now, especially on the Nintendo Switch subreddit, however the issue has been brought to the mainstream recently after Kotaku wrote an article on the issue and dozens responded with their own similar experiences and if you're not familiar with idea, basically what's happening is that users are reporting their Joy-Cons detecting motion even if they're actually not touching the controller. While this drift issue can definitely affect both the controllers, it seems to affect the left Joy-Con significantly more, of course the left on is primarily used for motion which really causes issues when you're playing. Now it is unclear right now on what causes this issue, but there are a couple of theories. The first is that the dust is getting underneath the protective rubber of the joystick, which sort of forces it to kind of move a little bit, and the other is that the contacts are worn down from the continuously docking and undocking of the controllers with the body. What angered the Reddit users the most, however, was just how expensive it is to fix the issue, and if you're outside of warranty, it reportedly costs $40 to fix a Joy-Con, which, considering as you can pick up a brand new Joy-Con for $50 is not exactly a good deal. Last week, the law firm Chimicles Schwartz Kriner and Donaldson Smith, that's a mouthful, had a class action lawsuit filed over the defective Joy-Cons. Now, Nintendo has been pretty vague about the entire issue as a whole. (clearing throat) Sorry, let me get my Nintendo voice on. At Nintendo, we take great pride in creating quality products and we are continuously making improvements to them. We are aware of recent reports that some Joy-Con controllers are not responding correctly. We want consumers to have fun with the Nintendo Switch, and if anything falls short of this goal we always encourage them to visit support.nintendo.com so we can help. A.K.A. go yourself. While there have been no official announcements, this week an internal memo from Nintendo leaked out that instructed customers service reps to process the repairs for free without proof of warranty which is probably a good call generally speaking. Now, the only real question here is whether or not the new Switch Lite will be affected by the drift issues, but regardless, it is good for this kind of stuff to be addressed. So obviously, Apple's had a ton of issues with the Macbook keyboards and a lot of the speculation has been that dust has gotten in there, so seriously, the main takeaway, if dust ruins everything, clean your house more and you'll be just fine, or Nintendo has some huge manufacturing defect and you should just call them and complain. Otherwise, Chimicles the law firm will go after them. Thank you very much for watching this episode of This Is Now. Make sure to subscribe for these weekly updates and be sure to go check out some of our other episodes. I mean, why not, you're already on YouTube. You might as well watch some more.",
    "transcript_keywords": [
        "Minecraft",
        "Nintendo Switch",
        "Nintendo",
        "moon",
        "game",
        "Java version",
        "Java",
        "Indian Space Research",
        "years",
        "Keemstar Minecraft Monday",
        "Minecraft popularity",
        "game called Minecraft",
        "Indian Space",
        "Space",
        "Minecraft Earth",
        "PewDiePie played Minecraft",
        "Space Research Organization",
        "Minecraft server",
        "played Minecraft",
        "play Minecraft"
    ],
    "transcript_entity_values": [
        "July 15th",
        "Android",
        "Celebi",
        "WWDC",
        "three",
        "the day",
        "Update Aquatic",
        "Ninja",
        "This Is Now",
        "September 7th",
        "10,000,000",
        "Joy-Cons",
        "Beast",
        "English",
        "minus 170 degrees Celsius",
        "Soviet Union",
        "Nintendo",
        "Minecraft Dungeon",
        "YouTube",
        "Microsoft",
        "50 years",
        "James Charles",
        "Joy-Con",
        "Vikram",
        "this week",
        "2010",
        "about 14",
        "Chandrayaan",
        "Matt",
        "dozens",
        "redstone",
        "Chimicles Schwartz Kriner",
        "SpaceX",
        "TechnoBlade",
        "YouTube",
        "26",
        "Xbox One",
        "Reddit",
        "2009",
        "Switch Lite",
        "$5 Raspberry Pi",
        "Indian",
        "China",
        "Last week",
        "2011",
        "10 years",
        "first",
        "a Joy-Con",
        "The Nintendo Switch",
        "Minecraft",
        "a ton",
        "Diabloesque Minecraft",
        "10 years ago",
        "earlier this year",
        "48 days",
        "six bucks",
        "E3",
        "Kotaku",
        "Sarabhai",
        "56 minutes",
        "50th",
        "four or five years ago",
        "Keemstar",
        "Donaldson Smith",
        "Yo",
        "the last couple years",
        "50",
        "Fortnite",
        "Apollo",
        "10 year old",
        "Vikram Sarabhai",
        "YouTubers",
        "the Satish Dhawan Space Center",
        "early next year",
        "Last year",
        "the Indian Space Research Organization",
        "Joy-Con",
        "Jack Black",
        "Minecraft Earth",
        "Serabhai",
        "Google Trends",
        "India",
        "the last decade",
        "Minecraft",
        "these days",
        "Monday",
        "10 years old",
        "minus 274 degrees Fahrenheit",
        "Nintendo Switch",
        "PewDiePie",
        "Macbook",
        "the last few months",
        "Vikram",
        "one moon day",
        "one",
        "Mac",
        "The Indian Space Research Organization",
        "fourth",
        "PS4",
        "Fornite",
        "Apple",
        "ISRO",
        "Earth",
        "Mars",
        "year",
        "Java and Bedrock",
        "Mojang",
        "the years",
        "monthly",
        "the Nintendo Switch",
        "the United States",
        "two",
        "40",
        "earlier this week",
        "Pokemon",
        "Wednesday",
        "Java",
        "Ken",
        "104",
        "weekly"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "LANGUAGE",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "MONEY",
        "NORP",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "LOC",
        "GPE",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "LOC",
        "LOC",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        0.08071675896644592,
        -0.029516052454710007,
        0.1029495894908905,
        -0.06200125813484192,
        0.05087798088788986,
        -0.05238383263349533,
        -0.0488673634827137,
        0.06135328486561775,
        -0.026995981112122536,
        0.043178193271160126,
        -0.05911215394735336,
        0.031492941081523895,
        0.01945585384964943,
        0.008390120230615139,
        0.12134184688329697,
        -0.08796770125627518,
        0.0401475764811039,
        -0.11100561916828156,
        -0.009166027419269085,
        -0.0485101118683815,
        -0.09856576472520828,
        -0.014158564619719982,
        0.02025463804602623,
        -0.0181245356798172,
        0.023356696590781212,
        0.049045734107494354,
        0.006508687045425177,
        -0.012552976608276367,
        -0.06958766281604767,
        -0.0211865846067667,
        -0.05401592329144478,
        0.08642648905515671,
        0.017220862209796906,
        -0.017829522490501404,
        -0.04846325144171715,
        0.0241450946778059,
        -0.00932791642844677,
        0.020503409206867218,
        -0.11671622097492218,
        -0.08480766415596008,
        -0.05536641553044319,
        -0.012519076466560364,
        0.0370149202644825,
        0.020987095311284065,
        -0.10189509391784668,
        0.035839516669511795,
        -0.016395997256040573,
        0.001462989137507975,
        -0.007529773283749819,
        0.08000294864177704,
        -0.025626780465245247,
        -0.07175993174314499,
        0.0524895116686821,
        -0.07531358301639557,
        0.008761496283113956,
        -0.06599493324756622,
        -0.06415039300918579,
        0.07596122473478317,
        0.0218432005494833,
        0.005973735358566046,
        -0.05206386372447014,
        -0.09743260592222214,
        -0.01139974407851696,
        0.014315801672637463,
        0.0038330871611833572,
        -0.0752030685544014,
        0.10493573546409607,
        0.007286746986210346,
        -0.03623573109507561,
        -0.10263816267251968,
        -0.030100878328084946,
        -0.002317287726327777,
        0.01723409816622734,
        -0.02955327369272709,
        0.0012672721641138196,
        0.03040454164147377,
        0.04486527666449547,
        0.013352014124393463,
        -0.012021639384329319,
        0.023003261536359787,
        0.020862122997641563,
        0.05851542949676514,
        -0.04858998954296112,
        -0.035223282873630524,
        -0.025348398834466934,
        -0.007913365960121155,
        -0.028801022097468376,
        0.032742392271757126,
        -0.04117920994758606,
        0.0022265377920120955,
        0.07671140134334564,
        0.08304418623447418,
        0.06489333510398865,
        0.06349998712539673,
        -0.040779389441013336,
        0.03215649724006653,
        0.0022445975337177515,
        0.024453718215227127,
        0.012308568693697453,
        0.04071778431534767,
        0.06072507053613663,
        0.016925254836678505,
        0.06505303829908371,
        0.023328997194767,
        0.06722957640886307,
        -0.0013448698446154594,
        -0.017765674740076065,
        0.07429700344800949,
        0.04966839775443077,
        0.030505530536174774,
        -0.05976790562272072,
        -0.01812244951725006,
        -0.05281245708465576,
        -0.03338371962308884,
        0.019263720139861107,
        -0.04716457426548004,
        0.027863845229148865,
        0.05381122976541519,
        0.031814657151699066,
        0.06556341797113419,
        0.029786087572574615,
        0.018493257462978363,
        -0.03796008601784706,
        -0.05320672318339348,
        0.013569491915404797,
        0.08872875571250916,
        -0.07283342629671097,
        2.4863615698211467e-33,
        -0.016264868900179863,
        -0.03486727923154831,
        -0.005375830456614494,
        0.04395151510834694,
        -0.0016229123575612903,
        -0.014432470314204693,
        0.015152695588767529,
        0.07366365194320679,
        -0.03846927732229233,
        -0.02959212101995945,
        -0.0021948774810880423,
        0.07426940649747849,
        -0.004732456989586353,
        9.755684732226655e-05,
        0.09802158176898956,
        -0.0670613944530487,
        -0.0020631221123039722,
        -0.04358493536710739,
        0.037878748029470444,
        0.07012928277254105,
        0.0007336639100685716,
        -0.015811912715435028,
        0.047933463007211685,
        0.05572596564888954,
        -0.05492542311549187,
        -0.03184607997536659,
        -0.004635074641555548,
        0.025311172008514404,
        0.03480252996087074,
        0.008272836916148663,
        0.020820846781134605,
        -0.16843603551387787,
        -0.052863094955682755,
        -0.04482942074537277,
        0.05851491540670395,
        -0.013382609002292156,
        0.053322188556194305,
        -0.10789118707180023,
        -0.007962794043123722,
        -0.1235673576593399,
        -0.12309455871582031,
        -0.02656036987900734,
        -0.09305057674646378,
        -0.050657112151384354,
        0.028705516830086708,
        -0.02147608809173107,
        -0.018020713701844215,
        -0.0439101941883564,
        -0.12150327861309052,
        -0.0020345994271337986,
        -0.020278597250580788,
        0.013581991195678711,
        0.03577819839119911,
        0.01939365826547146,
        0.004388773813843727,
        -0.021638307720422745,
        0.04522792622447014,
        0.0027244635857641697,
        0.011679412797093391,
        0.06803235411643982,
        -0.03209049254655838,
        0.06217231601476669,
        0.006414129864424467,
        0.08583642542362213,
        0.015875713899731636,
        0.05518636107444763,
        0.12168330699205399,
        0.005647127516567707,
        -0.06267811357975006,
        0.06320064514875412,
        0.0641353502869606,
        0.05249042063951492,
        -0.0097713153809309,
        0.04621763899922371,
        0.02361874468624592,
        -0.036917828023433685,
        -0.021084336563944817,
        -0.08881624788045883,
        0.020257536321878433,
        0.04765091836452484,
        -0.05590054765343666,
        0.029897373169660568,
        -0.03137172758579254,
        0.02191782556474209,
        0.014945317059755325,
        0.0048395502381026745,
        0.026796508580446243,
        -0.03737255185842514,
        0.044360801577568054,
        0.016065564006567,
        -0.04525502771139145,
        -0.031179236248135567,
        0.07085716724395752,
        0.03079770877957344,
        0.040273189544677734,
        -2.573940490732215e-33,
        -0.006407588720321655,
        -0.019041629508137703,
        0.011739833280444145,
        -0.008747056126594543,
        -0.03521611914038658,
        -0.038270819932222366,
        0.036093875765800476,
        0.04509876295924187,
        -0.09489311277866364,
        -0.09631875902414322,
        -0.06299351900815964,
        0.03914481773972511,
        0.09956377744674683,
        0.03955233842134476,
        0.008701295591890812,
        -0.006116500124335289,
        0.01694706827402115,
        -0.013635560870170593,
        0.04295824095606804,
        0.012790245935320854,
        -0.01810254156589508,
        0.03679783642292023,
        -0.028858650475740433,
        0.03677735477685928,
        0.005278909113258123,
        -0.01766791194677353,
        -0.10471498221158981,
        0.03150613233447075,
        -0.006910931784659624,
        0.08258324861526489,
        0.03126613050699234,
        0.0035172863863408566,
        0.05183015391230583,
        -0.05754532665014267,
        0.057390663772821426,
        -0.027867207303643227,
        -0.021357599645853043,
        -0.008108827285468578,
        -0.04001772403717041,
        -0.03736082836985588,
        -0.06713256984949112,
        -0.04206760972738266,
        -0.025190046057105064,
        -0.018336448818445206,
        0.0038290871307253838,
        0.12583428621292114,
        -0.04872124269604683,
        0.11889941990375519,
        -0.0009964578785002232,
        -0.08242885023355484,
        0.016984974965453148,
        0.009259373880922794,
        0.0505535714328289,
        -0.06704074144363403,
        -0.030350452288985252,
        -0.045605581253767014,
        -0.06714623421430588,
        0.03969941660761833,
        -0.00892951712012291,
        0.0715516060590744,
        0.061813510954380035,
        -0.03472514823079109,
        -0.010622170753777027,
        0.06137867271900177,
        -0.01081211119890213,
        0.05485354736447334,
        0.040657445788383484,
        -0.007540543098002672,
        -0.0836707055568695,
        -0.015784461051225662,
        -0.11972919851541519,
        0.00595694687217474,
        -0.11191758513450623,
        -0.004310372285544872,
        -0.05053132772445679,
        0.07146798074245453,
        0.05687081813812256,
        0.04983210191130638,
        0.010967898182570934,
        -0.023127788677811623,
        0.07377255707979202,
        0.10354293882846832,
        0.029066331684589386,
        -0.01330395508557558,
        0.08225929737091064,
        -0.011119061149656773,
        0.03547072410583496,
        0.016479671001434326,
        -0.12234006822109222,
        -0.040670815855264664,
        -0.005163056310266256,
        -0.0014747382374480367,
        -0.10132748633623123,
        0.048119209706783295,
        0.009064676240086555,
        -5.2431744279601844e-08,
        0.010781287215650082,
        -0.04488322511315346,
        0.0017773056169971824,
        -0.08605412393808365,
        0.06151425465941429,
        0.07474609464406967,
        0.05903807282447815,
        0.02853938564658165,
        0.08338097482919693,
        0.0859556496143341,
        -0.011226835660636425,
        -0.024847978726029396,
        -0.048188649117946625,
        0.03606898710131645,
        0.055830828845500946,
        0.06099521741271019,
        -0.06763170659542084,
        -0.015057587996125221,
        -0.01589386537671089,
        0.09259475022554398,
        0.037277039140462875,
        -0.029591312631964684,
        -0.00554489204660058,
        -0.0672006756067276,
        0.003871347289532423,
        -0.0004714258830063045,
        0.005240830592811108,
        -0.01792028546333313,
        0.06484939157962799,
        -0.03056170791387558,
        -0.020957112312316895,
        -0.03200972452759743,
        0.03535700589418411,
        0.02573304809629917,
        -0.015201481990516186,
        -0.0078099868260324,
        -0.011370817199349403,
        0.03263063356280327,
        0.007061160169541836,
        -0.018609771504998207,
        -0.04888607934117317,
        0.017690349370241165,
        -0.0063200038857758045,
        -0.01907879300415516,
        -0.028217699378728867,
        -0.03013358823955059,
        -0.1225651204586029,
        0.03202057257294655,
        -0.04580354690551758,
        0.014962594024837017,
        -0.03114030696451664,
        0.03725161403417587,
        0.049433063715696335,
        -0.032457735389471054,
        0.10941945016384125,
        -0.006726231426000595,
        0.01342824473977089,
        -0.033812906593084335,
        -0.029934344813227654,
        0.04674900323152542,
        0.10093484073877335,
        -0.1029437780380249,
        -0.01698455773293972,
        0.0008895821520127356
    ]
}