{
    "id": "lxNKtKTihko",
    "title": "Is the Samsung Galaxy S10 Worth It?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-03-01T16:03:36Z",
    "video_url": "https://www.youtube.com/watch?v=lxNKtKTihko",
    "category": "Science & Technology",
    "tags": [
        "galaxy s10",
        "galaxy s10 plus",
        "galaxy s10e",
        "samsung galaxy s10",
        "samsung galaxy s10 plus",
        "samsung s10",
        "samsung",
        "s10",
        "s10 plus",
        "s10 review",
        "galaxy s10 review",
        "galaxy s10 camera",
        "samsung galaxy s10e",
        "samsung galaxy s10 review",
        "s10 camera",
        "galaxy",
        "android",
        "review",
        "tech",
        "smartphone",
        "this is",
        "austin evans"
    ],
    "views": 971066,
    "likes": 22506,
    "comments_count": 2691,
    "description": "After 10 years, Samsung nailed the Galaxy S10, Galaxy S10e and Galaxy S10 Plus. The Samsung Galaxy S10 on Amazon:  Is the Notch Really THAT Bad?   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/galaxys10",
        "https://www.youtube.com/watch?v=oMXbucj3ULQ",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. There's a lot that can be said about the brand new Galaxy S10, but it can be summed up pretty quickly: this is the phone to beat for 2019. After 10 years of Galaxy devices, we have one seriously nice piece of hardware with the S10. Put it side-by-side with an earlier model and it is absolutely crazy at how far Samsung has come. Now, you can't talk about this phone without acknowledging its most unique feature, the hole punch display. Yeah, it's definitely there alright. Now I recently did a video talking all about the hole punch display versus the notch, which you guys can go check out. But there's no getting around the fact that while this is a pretty much full screen display, it is kind of distracting to look at that hole punch all the time. Now, because of this, there is one key disadvantage to the S10+ versus the standard S10 and the S10E. Both of those phones have a single camera front, which means the hole punch display is much, much smaller than the double camera on the S10+. Sure, it looks a little bit more distinctive, but you're losing basically double the real estate like that. Now, I've kinda gotten used to it at this point, to be totally honest, but it is a little bit obtrusive still, and I think this is one of those things where time will definitely whether this is a good idea or whether we'll look back on the hole punch as something that's even worse than the notch. The screen itself is typical Samsung. Bright, vibrant and pretty much as good as it gets as far as smartphones go today. What's new this year is that the fingerprint sensor is moved from the back of the phone to the front. Now it's underneath the display, and generally speaking, it works pretty well. So it's very similar, in fact, to the OnePlus 6T, not only in accuracy but as well as speed. Now, you can't just put your fingerprint anywhere on the display. There is a fairly small sensor in the middle. But once you get used to it, you can pretty easily unlock the phone without having to tap the screen or do anything. You just set your fingerprint, it will wake up, and you're good to go. The only Galaxy S10 that misses out on this feature is the S10E, which instead has a fingerprint sensor on the side of the phone. Now, personally, I actually don't think this is a huge loss. Even though it is a cool feature to have it underneath the display, it still feels a little bit more like a gimmick than a must-have feature. The rest of the hardware is absolutely top notch. After all these years it's weird that Samsung is still the only ones to really pull off the curved front and back glass. Not only does it look nice, but importantly, it gives a very nice feel in the hand. Amazingly, if you look on the bottom of the phone, you will find that there is still a headphone jack. Now, I don't know how much longer this is going to stick around. At this point it feels like the S10 is one of the very few flagships that still has it. But huge props to Samsung on this one. And to top it all off, Samsung now allows you to remap the Bixby button. This is an incredible, brave new world we live in. - [Robotic Voice] Welcome to the new Bixby. I've been feeling kinda cooped up, cooped up - If that's not enough, we also still have stereo speakers on board, even though we don't have really kind of any top bezel. There's a tiny little driver up top, which sounds pretty good. There is not a lot to complain about with this hardware. I'll be totally honest with you. Samsung absolutely nailed it this year. Speaking of hardware, something that returns this year is DeX. So Samsung is one of the few companies that really fully takes advantage of the USB-C port. A lot of other phones just use it for charging. But with this, you can kind of turn it into a full desktop. All you need to do is take a single USB-C cable and while you could use a DeX dock, what I personally prefer is running it to a USB-C monitor. Not only do you get a full display, but you also get stuff like mouse and keyboard support. And honestly, Android apps have come a long way as far as being able to be used in a windowed sort of fashion. Now, no, DeX is not the fastest thing in the world. It does feel a little bit stuttery compared to running the apps natively on the phone, but this is absolutely the dream, right? You take your phone, you use it all day, you drop it into a dock or you plug something in and it turns into essentially a full desktop computer. If only it was just a little bit faster. Don't let that fool you though. This is an absolute performance beast when you're using it as a phone. Here in the US, all models of the Galaxy S10 use the same Snapdragon 855. The main difference is just in the amount of RAM as well as the amount of storage. There are a ton of different SKUs, but pretty much all of them have eight gigs of RAM with the exception of the base model of the S10E, which has six gigs, as well as the high end version of the S10+, which has 12. Regardless though, you shouldn't see any major difference between the different phones. It's very nice to see that you're not getting sort of a skimped down version when you go to the lower end models. Performance should be very similar across the board. Speaking of that 855, it is a big step up over the 845 of last year. Now, it's still an eight-core processor, but they've done something a little bit different. So you have four cores, which are a little bit more on the power efficient side, and you have three big cores for heavier tasks. But there is also a single core, which is a higher clock speed, which is especially helpful for single-threaded performance, which, let's be real, is a lot of what you do on your phone every day. That plus the new 7 nanometer process really pays off. Put it side by side with not only last year's model but as well as the brand new iPhones and you'll see that, while yes, it's not quite as fast as that iPhone XS, it is much closer than Qualcomm and Snapdragon have been in years. Graphics are also an improvement. We're looking at a solid uplift versus last year's model. And again, it is not quite there with the iPhone A12, but it is a lot closer than it used to be. Now a small note about cooling. While the S10 and the S10E have fairly standard cooling, the S10+ actually has a vapor chamber. Now, I don't have those other two phones in to test, but with this guy, it actually does a very good job of staying fairly cool even when you're under extended gaming loads. I saw it top out at around 40 to 41 degrees Celsius. The Galaxy S10 line is also one of the first phones to support the brand new WiFi 6. Now this isn't going to be dramatically faster than the previous generation of WiFi. It's maybe 20% or so. But the big difference is that this should be much more reliable in more congested areas, which, of course, is basically everywhere at this point. Now, I haven't had a ton of time to try with a WiFi 6 router yet, but definitely stay tuned. This is actually something that could be a pretty big deal going forward. Battery life is definitely a strong suit with the S10+. And a big part of that is due to that huge 4100 milliamp hour battery. I've had no problems making it through a full day of use. Now, as you'd expect, the S10 is water-resistant, and it does support fast wireless charging. But what's really cool about this is that it supports reverse wireless charging. Turn on Power Share, and all you need to do is take another phone or another accessory, and the S10 will begin to charge it via Qi Wireless Charging. This is a dope feature. And especially considering that you have such a big battery on the S10+, it's a legitimately super, super useful thing to do. Especially if you're a nice friend who wants to top off after the end of the day. Be like, oh, I got 40% left, here you go. When it comes to the cameras, the 10 megapixel front-facing camera on the Galaxy S10 is all new this year. Now on the Plus model, you do get a secondary depth sensor, which is nice for portraits, but also means that the little hole punch thing is, well, not so little. So if we take a normal shot, it looks pretty decent. But we also do have the improved portrait mode. Now, the blur effect actually looks pretty decent. It still does have an issue with my glasses, like every other front-facing camera ever, but not bad. So there are some very interesting effects with the portrait. So you can do a sort of weird zoom, which actually doesn't look that bad. I mean, some of this stuff is really fun. If you have the right kind of shot, you can get a really cool effect. You also have the color pop mode, which makes the background not only blurred, but also black and white, which is very sad. Yo, you know what? Some of this stuff is actually really cool. Like, I know a lot of times the portrait mode stuff is gimmicky, but the different options here are totally unique and actually do work pretty well. Of course, though, that's not the entire story. On the back of the Galaxy S10+, we have a full three cameras. So the main wide angle camera is essentially unchanged from last year. You still have optical image stabilization as well as that cool dual pixel autofocus and the dual apertures, if that's not enough duals for you. And on top of that, the telephoto camera is also very similar. It does have OIS, but you're really not seeing any kind of major differences on the actual hardware side of things. What's new is a brand new wide angle camera, which is standard on the S10E, the S10 and the S10+. The only thing that the E really drops is that telephoto camera. So for an example, this is what the telephoto looks like. This is the standard shot. And this is the wide angle. You can see that there's a pretty wide range here. Now, I personally find that the wide angle is probably the most useful. Obviously you're gonna be using the main camera 90% of the time. I always just find the telephoto is usually not that much higher quality than just digitally zooming in. But that wide angle camera actually does work really well. Video is also pretty impressive on the S10. So this is what the wide angle camera looks like, but if we punch into the standard, you can see that we're still getting a lot of range. And if we go all the way into the telephoto as it kind of stutters for a second, you can see you get some very different focal lengths. But the camera goes a lot farther than just that, especially when it comes to video. You're also getting double the record time on the super slow motion. And I gotta say, even though it's not something I would use every day, when you pull it off, it is a very, very cool effect. Now, sure, will the S10 match something like the Pixel 3 as far as raw image quality? Not really. But because you have all of these different modes, the video is so solid, and especially considering that you have that super wide angle lens, I don't think anyone's gonna be particularly disappointed with the camera of the Galaxy S10 this year. There is no getting around that the Galaxy S10 is an expensive phone. Now while the S10E is kind of reasonable at $750 bucks, if you wanna get the S10+ like this model, it's going to start at $1,000. And if you go for the full maxed out one terabyte ceramic model, it is $1,600. Realistically though, this is just kind of the world we live in at this point. The $1,000 flagship is here to stay. And beyond price, there's really not a lot I have to complain about with the S10. As far as an Android flagship goes, there is really no other recommendation that I have right now beyond the S10, and especially this S10+. It really is that good. So of course, the question is: is the Galaxy S10 worth it? Yeah. Simple as that, yeah.",
    "transcript_keywords": [
        "Galaxy",
        "phone",
        "camera",
        "pretty",
        "hole punch",
        "hole punch display",
        "Samsung",
        "year",
        "kind",
        "wide angle camera",
        "display",
        "lot",
        "wide angle",
        "punch",
        "wide",
        "punch display",
        "angle camera",
        "phones",
        "model",
        "hole"
    ],
    "transcript_entity_values": [
        "six",
        "41 degrees Celsius",
        "a full day",
        "this year",
        "1,600",
        "last year's",
        "$750 bucks",
        "three",
        "iPhone",
        "iPhones",
        "2019",
        "USB-C",
        "4100 milliamp hour",
        "855",
        "first",
        "RAM",
        "iPhone XS",
        "10 megapixel",
        "eight",
        "the Galaxy S10",
        "jack",
        "Samsung",
        "Qualcomm",
        "Austin",
        "two",
        "the end of the day",
        "3",
        "four",
        "Robotic Voice] Welcome",
        "Snapdragon",
        "12",
        "7 nanometer",
        "A12",
        "90%",
        "Galaxy S10",
        "one",
        "second",
        "years",
        "S10",
        "the Galaxy S10+",
        "10 years",
        "DeX",
        "Galaxy",
        "a ton",
        "Bixby",
        "S10+ versus",
        "OnePlus 6",
        "every day",
        "last year",
        "the 845 of last year",
        "Yo",
        "40%",
        "20%",
        "1,000",
        "Bixby",
        "US",
        "today",
        "Qi Wireless Charging",
        "Android"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERCENT",
        "PERCENT",
        "MONEY",
        "GPE",
        "GPE",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.10489135980606079,
        0.04960525780916214,
        0.06526535749435425,
        -0.06858696788549423,
        0.004549247678369284,
        0.0770142674446106,
        -0.024846045300364494,
        0.09912120550870895,
        -0.0479467548429966,
        -0.02680942229926586,
        0.01980658806860447,
        0.027839940041303635,
        0.07521621137857437,
        0.043331388384103775,
        0.02087472565472126,
        -0.07541286945343018,
        0.07596762478351593,
        -0.06407827138900757,
        -0.050078410655260086,
        -0.034345220774412155,
        -0.029495807364583015,
        0.006562868598848581,
        -0.031082063913345337,
        -0.03294496238231659,
        0.04698790982365608,
        -0.02584536001086235,
        -0.035254303365945816,
        -0.031722165644168854,
        -0.03175877407193184,
        -0.0387091226875782,
        0.055099595338106155,
        0.11368606984615326,
        0.053195204585790634,
        0.048632796853780746,
        -0.04845597967505455,
        -0.14652568101882935,
        0.05711406469345093,
        0.019171476364135742,
        -0.028480442240834236,
        -0.03780604153871536,
        -0.07534738630056381,
        -0.009161660447716713,
        0.021891964599490166,
        -0.06386911123991013,
        -0.006269745994359255,
        -0.04806307703256607,
        0.08440674096345901,
        -0.029138978570699692,
        -0.001563201891258359,
        -0.0540025569498539,
        0.005395462270826101,
        -0.03992988169193268,
        0.023852679878473282,
        -0.03852888196706772,
        -0.015879210084676743,
        0.040259331464767456,
        0.013026454485952854,
        -0.048104532063007355,
        0.024511588737368584,
        -0.04861433804035187,
        0.08337416499853134,
        -0.04988066852092743,
        -0.06121234595775604,
        0.08545688539743423,
        0.016693562269210815,
        -0.022599877789616585,
        0.026555754244327545,
        -0.08117508888244629,
        0.029496412724256516,
        0.06083590164780617,
        0.0928347259759903,
        -0.03957938402891159,
        -0.028570597991347313,
        -0.011660506017506123,
        -0.0100912656635046,
        0.055667340755462646,
        0.03296738117933273,
        -0.023170238360762596,
        0.0121370954439044,
        0.07468588650226593,
        0.06914114952087402,
        -0.043443936854600906,
        -0.06109181419014931,
        -0.03130584955215454,
        -0.01415474433451891,
        -0.035294245928525925,
        0.04310346022248268,
        0.035974059253931046,
        -0.0549110509455204,
        0.0024104455951601267,
        0.012886075302958488,
        0.06700652092695236,
        -0.0019528367556631565,
        -0.021026598289608955,
        0.014359517022967339,
        0.030901199206709862,
        -0.06153055652976036,
        -0.013937764801084995,
        -0.04870876297354698,
        -0.02262214943766594,
        -0.0008508398314006627,
        0.03980452939867973,
        0.05330443009734154,
        -0.042864568531513214,
        0.08562114089727402,
        -0.0055580055341124535,
        0.042272645980119705,
        0.01865665428340435,
        -0.026323867961764336,
        -0.048664629459381104,
        0.025816503912210464,
        0.02753116749227047,
        -0.04599781706929207,
        0.03670273348689079,
        -0.011150356382131577,
        -0.03674161434173584,
        0.011562538333237171,
        -0.0390908382833004,
        0.06805028021335602,
        0.01815754920244217,
        0.01805000565946102,
        -0.07634757459163666,
        -0.1120481938123703,
        -0.03461407870054245,
        0.0008295663283206522,
        0.05556143447756767,
        -0.036356665194034576,
        2.5055955961364764e-33,
        0.028625136241316795,
        0.06297046691179276,
        -0.07845837622880936,
        -0.03475499525666237,
        0.03273869305849075,
        0.06235868111252785,
        -0.01893416792154312,
        0.10111511498689651,
        -0.0011445826385170221,
        0.02990010380744934,
        -0.0753583014011383,
        0.015064015984535217,
        -0.02633805386722088,
        0.05977121740579605,
        0.04553145542740822,
        -0.05883098021149635,
        -0.0520082488656044,
        -0.044940948486328125,
        -0.07914223521947861,
        0.023615717887878418,
        -0.014697899110615253,
        -0.07449314743280411,
        -0.0036902029532939196,
        -0.01601521670818329,
        0.06743323057889938,
        0.024787213653326035,
        0.09052059799432755,
        0.012100585736334324,
        -0.04414747282862663,
        0.014164291322231293,
        -0.08875846862792969,
        0.022665197029709816,
        0.031781088560819626,
        0.015528593212366104,
        -0.01896827667951584,
        0.03350807726383209,
        0.11311773210763931,
        -0.028022509068250656,
        0.05372272804379463,
        -0.060831230133771896,
        -0.08887860924005508,
        0.07176631689071655,
        -0.13569247722625732,
        0.09377852082252502,
        0.029626639559864998,
        0.001388085656799376,
        -0.0053771319799125195,
        -0.033787015825510025,
        -0.07405424118041992,
        0.002835736842826009,
        -0.054782968014478683,
        0.022510815411806107,
        0.03291493281722069,
        0.018670307472348213,
        -0.06805090606212616,
        -0.002517473418265581,
        0.022244317457079887,
        -0.02255920134484768,
        0.04773718863725662,
        0.05272936075925827,
        0.020100919529795647,
        -0.003490234725177288,
        -0.06659795343875885,
        0.10476633906364441,
        0.022954517975449562,
        0.11399001628160477,
        0.06093044579029083,
        0.0404217429459095,
        0.007317352574318647,
        -0.0009502330794930458,
        0.04313099756836891,
        -0.08017098903656006,
        0.011371931061148643,
        -0.032055553048849106,
        0.0897337794303894,
        0.016296347603201866,
        0.0479663722217083,
        -0.06432897597551346,
        0.07095953822135925,
        0.01672232523560524,
        0.06804829090833664,
        0.041201621294021606,
        0.08077177405357361,
        0.0036572853568941355,
        0.036162085831165314,
        -0.01954442262649536,
        -0.014292762614786625,
        -0.09093029797077179,
        0.04305234178900719,
        0.03857408091425896,
        -0.040700338780879974,
        -0.06711316853761673,
        0.07905178517103195,
        0.061208877712488174,
        -0.00939173810184002,
        -3.1014261319194465e-33,
        -0.03812875971198082,
        -0.059521209448575974,
        -0.01332519855350256,
        -0.001800432917661965,
        -0.04054667055606842,
        0.011128116399049759,
        0.05127721279859543,
        0.04105256497859955,
        -0.005276079755276442,
        -0.026777267456054688,
        0.014039332047104836,
        0.06299832463264465,
        -0.03938068822026253,
        -0.08288784325122833,
        -0.0009042509482242167,
        -0.048897698521614075,
        0.017359677702188492,
        -0.10468778759241104,
        -0.04137177765369415,
        -0.018846137449145317,
        0.06741148978471756,
        0.052843693643808365,
        -0.0419127494096756,
        -0.03479679301381111,
        -0.016160640865564346,
        0.016247611492872238,
        -0.03042440675199032,
        -0.01623048447072506,
        -0.04578499495983124,
        0.08080296218395233,
        0.03489241003990173,
        -0.08302383124828339,
        0.016277913004159927,
        -0.0072423252277076244,
        -0.0028438197914510965,
        0.03884600102901459,
        0.08367140591144562,
        0.02175443433225155,
        0.04651045799255371,
        -0.06379726529121399,
        0.05801967531442642,
        0.03762509673833847,
        -0.02010161802172661,
        -0.02581688016653061,
        0.09451135247945786,
        -0.036254603415727615,
        -0.026224998757243156,
        0.020335495471954346,
        -0.024005046114325523,
        0.013677563518285751,
        0.003888679202646017,
        0.0518793947994709,
        0.005549284163862467,
        0.045323360711336136,
        -0.029263772070407867,
        -0.04024478793144226,
        -0.03301919996738434,
        -0.0020832440350204706,
        -0.036789052188396454,
        -0.0156685933470726,
        0.033092498779296875,
        -0.004310584627091885,
        -0.022578008472919464,
        -0.0532524511218071,
        0.03503568097949028,
        -0.01875462755560875,
        0.03648235648870468,
        -0.03865344822406769,
        0.008196257054805756,
        -0.014572971500456333,
        -0.07837408781051636,
        -0.06938418745994568,
        -0.06264934688806534,
        -0.028910208493471146,
        0.05808095261454582,
        0.14643679559230804,
        -0.033633776009082794,
        -0.028671542182564735,
        -0.014688943512737751,
        0.05263163894414902,
        0.03954795002937317,
        0.009202615357935429,
        0.029171621426939964,
        -0.04455556347966194,
        0.09400703758001328,
        0.03748398646712303,
        -0.0804641917347908,
        -0.007293824106454849,
        -0.011005551554262638,
        -0.0017796877073124051,
        -0.07727186381816864,
        -0.01494618970900774,
        -0.11461871862411499,
        -0.0294539462774992,
        0.038955554366111755,
        -4.614421200699326e-08,
        0.05833844095468521,
        -0.031548887491226196,
        0.06354603916406631,
        -0.050309546291828156,
        0.006599354092031717,
        -0.04249059036374092,
        -0.015837889164686203,
        -0.01394716463983059,
        0.10537729412317276,
        -0.007251168135553598,
        0.04992085322737694,
        -0.11211502552032471,
        -0.13622702658176422,
        0.0062947142869234085,
        -0.019716596230864525,
        -0.014600243419408798,
        -0.0048577310517430305,
        0.07123462110757828,
        -0.05483012646436691,
        0.07746940851211548,
        -0.025451935827732086,
        0.10886343568563461,
        0.0543653778731823,
        -0.07056520879268646,
        -0.03711684048175812,
        0.022692572325468063,
        -0.06066007539629936,
        0.011240184307098389,
        0.038193609565496445,
        -0.05482096970081329,
        0.029292458668351173,
        -0.04727832227945328,
        -0.06399764865636826,
        0.051167502999305725,
        0.028042346239089966,
        -0.09018682688474655,
        0.029505180194973946,
        0.03969310596585274,
        0.08568631112575531,
        0.035993967205286026,
        0.012876464053988457,
        -0.08412561565637589,
        0.001953710801899433,
        0.06865661591291428,
        -0.02532341144979,
        -0.03077845461666584,
        0.011153697967529297,
        -0.011162255890667439,
        -0.0679285079240799,
        0.04678751900792122,
        -0.013775876723229885,
        0.0036503265146166086,
        -0.09432220458984375,
        -0.041835132986307144,
        -0.00859322864562273,
        -0.062393467873334885,
        0.10765610635280609,
        -0.02798609435558319,
        -0.017572397366166115,
        0.08834988623857498,
        0.04802774637937546,
        -0.06830763816833496,
        -0.032540298998355865,
        0.06463883817195892
    ]
}