{
    "id": "LXQj-ry4CR4",
    "title": "Can I Switch To RYZEN?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-11-17T16:25:03Z",
    "video_url": "https://www.youtube.com/watch?v=LXQj-ry4CR4",
    "category": "Science & Technology",
    "tags": [
        "ryzen",
        "amd",
        "ryzen mobile",
        "ryzen laptop",
        "laptop",
        "surface",
        "surface laptop 3",
        "surface laptop 15",
        "surface laptop 3 15",
        "surface 15",
        "ryzen surface",
        "microsoft",
        "surface ryzen",
        "amd vs intel",
        "intel vs amd",
        "amd laptop",
        "notebook",
        "tech",
        "windows",
        "computer",
        "pc",
        "intel",
        "this is",
        "austin evans"
    ],
    "views": 400879,
    "likes": 12073,
    "comments_count": 1134,
    "description": "AMD has gotten a LOT better with Ryzen but is it good enough for me to switch to yet? My first foray into switching to Ryzen   The Microsoft Surface Laptop 3 on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=OfM2XstqKBg",
        "https://austin.tech/surfacelaptop3",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. Can I switch to Ryzen? Ever since the first Ryzen Mobile laptops came out a few years ago, it's been an incredibly compelling value proposition. What you're getting is competitive CPU performance, and honestly impressive enough GPU performance that you could do some light gaming even on a thin and light system, I mean, what's not to like? I actually came really close to switching to Ryzen last year when I bought an HP Envy with Ryzen 7. Now the performance was absolutely there, but it had a lot of problems. Not only did it run incredibly hot, but it had lots of random issues, and it actually died while we were filming an episode of Mystery Tech. So when Microsoft announced their new Surface Laptop 3 with Intel as well as AMD options, well it felt like the perfect time to see if I could actually switch to Ryzen this time around. So for full disclosure, I have in the past been sponsored by Intel, as well as AMD and Microsoft, but none of them are sponsoring this video. The only company involved is Microsoft, and that's just because they sent this out as a review unit. Really my question here is very straightforward and very simple, can I switch to Ryzen? The laptop I'm using is a mid-spec Surface Laptop 3, which is outfitted with a Ryzen 5 processor, 16 gigs of RAM, and 256 gig SSD, all of which seems to be just fine for me, but before we get into the actual hardware, we have to talk price. So the 13 inch Surface Laptop starts at $1000, and the 15 inch starts at $1200, which isn't anything all that crazy for a premium device. However, if you want more than eight gigs of RAM and 128 gig SSD, things get crazy, and they get crazy quick. On this laptop, if you wanna go from a 128 gig SSD to a 256, it is $300. - [Ken] Whoa! - Yeah, so I mean, even if you get a premium, really nice 256 gig SSD, it should cost no more than like 50, 60 bucks, maybe 70, and that's not of course accounting for the difference in price between 128 and 256. The fact that they're charging this is insane. The RAM really isn't much better. Eight gigs of RAM is okay, but if you wanna jump up to 16, it's another $200 on top of that. Very quickly with some pretty basic upgrades, you can spend $500 just upgrading this guy. $500 to go from eight to 16 gigs of RAM and 128 to 256, like, that's worse than Apple pricing, and Apple pricing is already ridiculous. I don't understand how they're justifying this. I don't even think Apple charges $300 to go from 128 to a 256 gig drive, and I know this is starting off the video with a very negative connotation, and to be fair, there's lots of positive stuff with this, but not everyone gets the ability to try all these things and spend time. It's hard for me to justify spending $1700 on this. I can't tell you to spend $1700 on this, and that's just straight up the beginning of this video. I mean if the price isn't right out of the box, how are you supposed to even go from there? Now beyond that, the hardware of the Surface Laptop 3 continues to be killer. So there are now two models, so the 13 inch which we saw last year has been upgraded with 10th gen Intel chips, however if you wanna go with the 15 inch, you have to opt for the AMD option. Now it's a little bit weird that you can't do 13 inch with AMD, or 15 inch with Intel, although technically there's this weird Intel 15 inch enterprise model, but regardless, this is what you have to go for if you wanna pick up the 15, which is fine, although personally I do prefer a 13 inch form factor, but there's a lot going for this guy. Now the design is basically just a scaled up 13 inch Surface Laptop 3, which isn't a bad thing, there's a lot of really great stuff that Microsoft has always done with their hardware, and the Surface Laptop, as far as I'm concerned is one of the best feeling devices on the market. I mean even little things like the hinge is really nicely weighted, all the edges are really finely machined, you've got obviously the matte black, there's a lot of stuff that they do right here. The keyboard is great, the touch pad is great, the screen actually I really wanna give that some props, because not only is it a nice large 15 inch display, but importantly it's a 3:2 aspect ratio. I wish more people would do this, it gives you so much more screen real estate when you're browsing or anything like that. It looks great, it's a multi-touch display, there's a lot to like with that front, but that's all shared with the standard Surface Laptop 3, and there's some things that I wish weren't shared. Like for example, the port selection. So on the Surface Pro, you get a Surface connector, a USB-A, and USB-C. Totally reasonable, it's a 10 or 13 inch, or a 12 inch tablet, whatever size it is, it's fine, right? Now when you go to the 13 inch Surface Laptop, it has those same small port selection, it's fine, again, but it's a little bit odd. But then when you go to a 15 inch laptop, with a USB-A and a USB-C port? Hmm? You okay? Alright, that's a choice, I guess, even though there seems to be plenty of room for another USB-C, or a Thunderbolt port, or something like that, and to top all of that off, this also has the same size battery as the 13. So even though you have a physically larger laptop with what I presume would be more space inside, it's still pretty much the same components as you find in the smaller version of the laptop. Now supposedly the Surface is pretty easy to upgrade, so let's put that to the test. And once you remove the four screws, it should be pretty much as simple as that, so let's flip it over and see if iFixIt has led me astray. So literally, just by prying it up, be very careful not to pull that little cable, we have access to everything inside. I'm just gonna set that here. So that's a lot of empty space. Right here, and here, and here, and here, and here, okay, so obviously, this is based on the 13 inch design. However, we do have access to the 256 gig SSD. The only real problem here beyond the mildly difficult installation, honestly I think most people could probably get into it, is the fact that this is not a completely standard size. Now it's not a proprietary SSD, it is the 2230 form factor, so you actually can, especially on eBay, pick up some of these drives after market, the problem is it's not a standard size M2, which is going to make it a lot more difficult. But, considering that that's a $300 upgrade, it might be worth looking into. To me, this chassis seems like it was designed to do a lot more than just this. I feel like you could probably squeeze another fan, reorder some of these components, and you could probably fit some more powerful components in here. I mean you could definitely some more ports right here. This whole space, look at that, you could have USB-C ports. It's weird to look at this 15 inch laptop and see this much empty space. What really drew me to the Surface Laptop 3, however, is what's inside, as this is running a semi-custom AMD Ryzen processor. Now I say semi-custom, and while it technically is semi-custom with a name like the AMD Ryzen 5 Microsoft Surface Edition, what it actually is is slightly less impressive than that. So inside you're getting essentially the same second generation Zen+ chip, as you'll see on a variety of other different laptops. The real difference here is not in the CPU but in the GPU, as both the Ryzen 5 as well as the Ryzen 7 versions have slightly more graphic capability. When I say slightly more, I mean slightly more. Now with one extra CU on the graphics side, we technically should be getting a little bit more performance, however the real advantage here is in the optimization work. So Ryzen has actually been pretty performant in the testing that I'd done over the last couple years, with all of the Ryzen laptops I've had. The issue really has just been, it's not really as well optimized, as well- - [Ken] Stable. - Okay, look, we've had some problems. When it came to using that HP Envy with Ryzen inside, really what killed it was well, obviously, the fact that it committed suicide when I plugged it in, however, the other thing was, it just wasn't all that stable, and honestly, this is actually an area where the Surface Laptop 3 does better. Now, there's obviously the idea that with a year of development, AMD have got their drivers better sorted, the chipset and everything, but also Microsoft have done a ton of work to make this as smooth of an experience as possible. And generally speaking, I'm actually pretty impressed. Now yes, I've had a couple of blue screens of death, however, I am also testing an Intel 10th gen Ice Lake system at the same time, and I've also gotten a few blue screens on that, so I'm not really going to blame AMD. This so far has been maybe not quite as good as the Intel stuff, but it is a lot better than it was last year, which gives me a lot of hope going into the future. They've done a good job of optimizing this. So considering that the only real difference between standard Ryzen and the Surface edition is on the graphics side, it shouldn't be a big surprise that the CPU performance, while good, can't quite match up to Intel, especially when you compare it to the 10th gen chips. It's fine, and honestly for normal day to day use, I didn't notice a major difference, but you're losing a little bit there. The thing that I'm really curious about though are the graphics, because traditionally this has been where Ryzen's been very strong. So what you're getting here is something which seems to perform a bit better across the board, even compared to the latest 10th gen stuff. Now mind you, there's probably some versions of 10th gen which might out perform this, some of the 25 watt chips, but generally speaking, Ryzen still does have an advantage on the graphics front. And of course, what better way to test that than with some games? - No, don't do it. - And with a specific game. - [Ken] Nooo. - With everyone's favorite game. - [Ken] Nooooooooo! - Oh yeah, it's Fortnite time. - No! - So we're running at roughly 720p low, and while it might not be the best looking version of the game, we're now at 45, 50 frames per second. The one thing I'm not super impressed with here is the battery life. So especially considering that this doesn't have a bigger battery than the 13, I'm only getting about six hours, which is acceptable, it's fine, but that is definitely an area where I am taking a sacrifice compared to a similarly specced Intel system. I feel like generally speaking you're getting a little bit more for your money there. This is the best Ryzen Mobile implementation that I've seen yet, and it gives me a lot of hope, specifically for a lot of the mid-range systems that we're seeing on the market. Honestly, it is impressive though just how close this comes to competing with Intel, considering that just a few years ago AMD on mobile was an absolute joke. Now all that being said, with a $1700 15 inch Laptop, I don't think the Surface Laptop 3 is for me. There's a lot of good stuff here, but the benefits really don't outweigh the downsides of, I mean honestly with a form factor like this, I want more, I want more ports, I want more power, I would love to have at least a dedicated graphics card. But all this being said, what this really does get me excited for is the next generation of Ryzen Mobile. So it's rumored to be coming out in the next few months, and with it it should bring a much improved CPU, potentially even up to six cores in a form factor like this, as well as improved graphics, better battery life, I mean, that to me could very very easily challenge the crown of my next laptop. However for now, gotta say, the Laptop 3, it's not gonna make my next system. It's good, it's just, not quite there. (laid back electronic music)",
    "transcript_keywords": [
        "Surface Laptop",
        "inch Surface Laptop",
        "Ryzen",
        "Laptop",
        "Surface",
        "Ryzen Mobile laptops",
        "inch",
        "inch Surface",
        "gig SSD",
        "inch laptop",
        "AMD Ryzen",
        "lot",
        "standard Surface Laptop",
        "Intel",
        "Ryzen Mobile",
        "AMD",
        "Surface Laptop starts",
        "Ryzen laptops",
        "midspec Surface Laptop",
        "Microsoft Surface Edition"
    ],
    "transcript_entity_values": [
        "13 inch",
        "15",
        "a few years ago",
        "Ryzen Mobile",
        "5",
        "25 watt",
        "256",
        "first",
        "10th",
        "3:2",
        "two",
        "AMD",
        "a year",
        "four",
        "Surface",
        "one",
        "500",
        "the Surface Laptop 3",
        "a ton",
        "last year",
        "Thunderbolt",
        "the Surface Pro",
        "GPU",
        "Ryzen",
        "six",
        "Surface Laptop 3",
        "15 inch",
        "USB",
        "Austin",
        "the Surface Laptop",
        "CU",
        "the Ryzen 7",
        "16",
        "the last couple years",
        "SSD",
        "the next few months",
        "Ken] Nooo",
        "1000",
        "12 inch",
        "AMD Ryzen",
        "10 or 13 inch",
        "Eight",
        "13",
        "1200",
        "about six hours",
        "AMD",
        "iFixIt",
        "eight",
        "the Laptop 3",
        "300",
        "Apple",
        "1700",
        "60 bucks",
        "Ice Lake",
        "more than eight",
        "HP Envy",
        "70",
        "200",
        "Microsoft",
        "Ryzen 5",
        "CPU",
        "eBay",
        "Ryzen",
        "Mystery Tech",
        "Surface Laptop",
        "USB-C.",
        "between 128",
        "Ryzen Mobile",
        "RAM",
        "Surface Laptop 3",
        "50",
        "second",
        "45",
        "Fortnite",
        "128",
        "Intel",
        "2230"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "LOC",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.06834648549556732,
        -0.05687175691127777,
        0.05802737548947334,
        0.014934425242245197,
        0.009163664653897285,
        -0.01727202720940113,
        0.005711087491363287,
        0.017384981736540794,
        -0.07316012680530548,
        -0.003480441402643919,
        -0.048455651849508286,
        0.031067682430148125,
        -0.01691712811589241,
        0.0491134375333786,
        0.08151055127382278,
        0.03654759004712105,
        0.0918063297867775,
        -0.040584128350019455,
        -0.011945660226047039,
        0.053250186145305634,
        0.0007830512477084994,
        -0.05733688548207283,
        -0.005277889780700207,
        -0.06527208536863327,
        0.09328598529100418,
        0.051706310361623764,
        0.07856600731611252,
        0.00973152182996273,
        -0.05115729197859764,
        0.04196472093462944,
        -0.007561735808849335,
        -0.04134581238031387,
        -0.07664235681295395,
        -0.03166867047548294,
        0.0017547148745507002,
        -0.07201029360294342,
        -0.0045499978587031364,
        -0.07696021348237991,
        -0.021887363865971565,
        -0.06782184541225433,
        -0.0587787851691246,
        -0.053243909031152725,
        -0.018393533304333687,
        0.02322372980415821,
        0.060565173625946045,
        -0.002901797415688634,
        0.05693536996841431,
        -0.08435985445976257,
        0.0026085583958774805,
        -0.009244827553629875,
        -0.017340954393148422,
        -0.09431389719247818,
        0.037254344671964645,
        -0.06444986909627914,
        -0.056178875267505646,
        0.08422849327325821,
        0.01999986730515957,
        0.03717938810586929,
        -0.04876251518726349,
        -0.012064984068274498,
        0.04869819059967995,
        -0.11249304562807083,
        -0.021355679258704185,
        0.02997313253581524,
        0.054002795368433,
        -0.0614197812974453,
        0.0514351986348629,
        -0.0015277382917702198,
        0.09618069976568222,
        -0.002269444288685918,
        0.021578311920166016,
        0.015096268616616726,
        0.04675576090812683,
        -0.007998988963663578,
        0.04631217196583748,
        0.07426530867815018,
        0.08215460181236267,
        -0.06930849701166153,
        0.02536921761929989,
        -0.05148975923657417,
        -0.005273725837469101,
        -0.02507421001791954,
        0.039373960345983505,
        -0.07539313286542892,
        0.05940602719783783,
        -0.06418424099683762,
        0.010272742249071598,
        0.08358877897262573,
        0.020672142505645752,
        -0.05526731535792351,
        -0.005588090512901545,
        0.09817130118608475,
        0.03738380968570709,
        0.019441109150648117,
        0.04513709992170334,
        0.01499820314347744,
        0.006748619955033064,
        -0.036988839507102966,
        -0.006182077340781689,
        -0.0007308889762498438,
        0.025669094175100327,
        0.07770447432994843,
        0.010887600481510162,
        0.06093486770987511,
        0.006673545576632023,
        0.003834974952042103,
        -0.030170679092407227,
        0.04310603812336922,
        -0.04440973326563835,
        -0.05626249685883522,
        0.00320839649066329,
        0.06918638199567795,
        0.01751743257045746,
        0.029049905017018318,
        0.0018877026159316301,
        -0.008800225332379341,
        0.012520061805844307,
        -0.039693962782621384,
        0.05981045961380005,
        0.09400974959135056,
        -0.03490283340215683,
        0.00033160843304358423,
        -0.02398386038839817,
        -0.02569478005170822,
        -0.042936403304338455,
        0.055002983659505844,
        -0.09757190942764282,
        3.5960796648752346e-33,
        -0.013563417829573154,
        0.05029669031500816,
        -0.0593147799372673,
        -0.05097273737192154,
        -0.0021669012494385242,
        -0.032007940113544464,
        0.0007395351422019303,
        -0.09395982325077057,
        -0.02757006697356701,
        0.025758255273103714,
        -0.03225194662809372,
        0.019650833681225777,
        0.019557427614927292,
        0.015094940550625324,
        0.05486156418919563,
        -0.06823281943798065,
        0.00828934833407402,
        -0.010813281871378422,
        -0.011914151720702648,
        -0.010953224264085293,
        0.023749951273202896,
        0.011468601413071156,
        -0.0014964485308155417,
        -0.012154195457696915,
        -0.029147258028388023,
        0.005849873181432486,
        0.035685207694768906,
        0.0209509264677763,
        0.008520707488059998,
        0.01686871610581875,
        -0.03188144043087959,
        -0.09805577248334885,
        -0.10679180175065994,
        -0.05650726333260536,
        0.002914584241807461,
        0.010094289667904377,
        -0.04110806807875633,
        -0.0648261308670044,
        0.05640845000743866,
        -0.02146684192121029,
        -0.04354975000023842,
        0.03799648955464363,
        -0.009960629977285862,
        -0.013889888301491737,
        -0.027358485385775566,
        0.049264613538980484,
        0.0020610021892935038,
        -0.003088041441515088,
        -0.05584225058555603,
        -0.058322805911302567,
        -0.05262798070907593,
        0.0071060024201869965,
        0.011726555414497852,
        0.015001978725194931,
        0.06322930008172989,
        -0.05557006224989891,
        0.032808639109134674,
        0.0320485457777977,
        0.17046894133090973,
        0.10874408483505249,
        -0.04306323081254959,
        -0.02903992123901844,
        -0.04800011217594147,
        0.06727080792188644,
        -0.06600723415613174,
        0.032945144921541214,
        0.07679568976163864,
        0.0072196610271930695,
        -0.04368874430656433,
        0.027682321146130562,
        0.03962312266230583,
        0.007228005677461624,
        -0.01371497381478548,
        -0.06789098680019379,
        0.05846443399786949,
        0.030932897701859474,
        0.0010837919544428587,
        -0.0663917288184166,
        -0.07934470474720001,
        -0.020220348611474037,
        0.01835877262055874,
        0.10017289966344833,
        -0.04611819237470627,
        -0.025991057977080345,
        -0.03965148702263832,
        0.0456535741686821,
        -0.034086667001247406,
        -0.05551798641681671,
        0.02855774015188217,
        -0.021347731351852417,
        0.0362747460603714,
        0.009340851567685604,
        0.06582814455032349,
        -0.003972712438553572,
        -0.06587962806224823,
        -2.6395626465378615e-33,
        -0.04452306404709816,
        0.013615507632493973,
        0.01104740984737873,
        0.0670614168047905,
        -0.03208980709314346,
        0.03999371454119682,
        0.07728470861911774,
        -0.0014036508509889245,
        -0.02954530529677868,
        -0.0863635316491127,
        -0.019952701404690742,
        -0.03466656059026718,
        -0.0029896863270550966,
        0.007656562607735395,
        -0.05442662164568901,
        0.025419630110263824,
        -0.05641210824251175,
        -0.06420109421014786,
        0.09743301570415497,
        0.011040358804166317,
        -0.012041112408041954,
        0.08225823193788528,
        -0.08531411737203598,
        0.06330204010009766,
        -0.0681329295039177,
        0.027395831421017647,
        -0.10098154097795486,
        -0.052516255527734756,
        0.0020931335166096687,
        0.037204232066869736,
        0.03512931615114212,
        -0.015011807903647423,
        0.01659512333571911,
        0.049130022525787354,
        0.10936800390481949,
        0.07177392393350601,
        0.10996156930923462,
        -0.04770440608263016,
        -0.006835347507148981,
        0.08275381475687027,
        0.024419330060482025,
        0.03173006325960159,
        0.013844079338014126,
        0.006404719781130552,
        0.008500415831804276,
        0.0842256247997284,
        -0.03412224352359772,
        -0.07637154310941696,
        -0.04049969092011452,
        -0.05620253458619118,
        -0.020766502246260643,
        -0.04628491401672363,
        0.010966208763420582,
        -0.05757173150777817,
        0.022874414920806885,
        -0.11175671219825745,
        0.019777406007051468,
        -0.003822171362116933,
        -0.03861304745078087,
        0.0045573655515909195,
        0.05667437985539436,
        0.014369022101163864,
        0.048159610480070114,
        -0.054287247359752655,
        0.05912214517593384,
        0.06856056302785873,
        0.07244716584682465,
        0.04172583296895027,
        0.021321991458535194,
        -0.06292349845170975,
        -0.07470767945051193,
        -0.07624596357345581,
        -0.005703040864318609,
        -0.06509734690189362,
        0.05990739166736603,
        -0.015253431163728237,
        0.06131816655397415,
        0.0321972519159317,
        -0.09162653982639313,
        -0.004269197583198547,
        0.005236606113612652,
        -0.0336071141064167,
        0.023723870515823364,
        -0.031714729964733124,
        0.04788420721888542,
        -0.019460177049040794,
        -0.03852331265807152,
        -0.037187498062849045,
        -0.04508032277226448,
        -0.08446871489286423,
        -0.010226291604340076,
        -0.02023983746767044,
        0.004238219931721687,
        0.05393790453672409,
        0.04370126128196716,
        -4.269120879030197e-08,
        0.10345549881458282,
        -0.02812495268881321,
        0.10100214928388596,
        0.05197739228606224,
        0.00015824026195332408,
        0.006991633214056492,
        0.03537223860621452,
        0.009984796866774559,
        0.043971139937639236,
        0.06346364319324493,
        -0.012950556352734566,
        -0.06892067939043045,
        0.043126754462718964,
        0.015058130025863647,
        0.013653518632054329,
        0.0688096433877945,
        0.01703222654759884,
        0.06870608031749725,
        0.04326045513153076,
        -0.027986085042357445,
        -0.0074708908796310425,
        0.10498620569705963,
        0.02046268805861473,
        -0.0745633989572525,
        0.03824828565120697,
        0.015363006852567196,
        -0.06353647261857986,
        0.029170669615268707,
        0.054033827036619186,
        -0.05297979339957237,
        -0.06418681144714355,
        -0.004935698118060827,
        0.12644430994987488,
        0.01987513154745102,
        -0.032452814280986786,
        -0.14557808637619019,
        0.07475486397743225,
        0.10750267654657364,
        0.06988938897848129,
        0.0062199607491493225,
        -0.06790397316217422,
        0.00026792549761012197,
        -0.06323134899139404,
        0.03655236214399338,
        -0.04480279982089996,
        -0.05431530997157097,
        -0.04153748229146004,
        -0.12956519424915314,
        -0.003520560683682561,
        0.0018520514713600278,
        0.04151848703622818,
        -0.008654281497001648,
        0.0899585410952568,
        0.05096829682588577,
        0.003990262746810913,
        0.010923339985311031,
        -0.09158641844987869,
        0.06185741722583771,
        -0.02732028253376484,
        -0.006524754222482443,
        0.06873340159654617,
        -0.11894980072975159,
        -0.05628492683172226,
        -0.03341102972626686
    ]
}