{
    "id": "LyVlvu8BoNU",
    "title": "The Worst Product We’ve Tried in YEARS! - Bykski External Cooler",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-04-20T17:17:05Z",
    "video_url": "https://www.youtube.com/watch?v=LyVlvu8BoNU",
    "category": "Science & Technology",
    "tags": [
        "External Cooler",
        "Bykski",
        "Terrible lol"
    ],
    "views": 3226259,
    "likes": 96770,
    "comments_count": 4452,
    "description": "Thank you Guard.io. Save 20% on a monthly subscription plus a 7-day trial of Guard.io at   Create your build at   We wanted to test the Bykski External Cooler, but instead it tested our patience.  Buy a Cooler Master NR200P Mini-ITX Case:  Buy an Intel Core i9-13900K CPU:  Buy an ASUS ROG Strix Z690-I Motherboard:  Buy an EK Quantum Velocity 2 CPU Water Block:  Check out the EK Quantum Vector 2 GPU Water Block:  Buy a Sabrent Rocket 4 Plus 8TB NVMe M.2 SSD:  Buy an ASUS Strix GeForce RTX 4090 GPU:  Buy a Silverstone Extreme 850R Platinum PSU:   Purchases made through some store links may provide some compensation to Linus Media Group.  Discuss on the forum:    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 0:58 - Build Redux 1:08 - Why do we want an external rad? 2:05 - Exterior Tour 4:00 - Interior Tour 5:53 - SFF PC with a 4090 8:38 - Filling the loop 11:23 - How you actually have to fill the loop 12:30 - Linus and Alex start to loose it 14:11 - Fixing the flow path 16:04 - Wow we actually filled it 17:52 - Guard.io 19:01 - Outro",
    "description_links": [
        "https://guard.io/LinusTechTips",
        "https://www.buildredux.com/linus",
        "https://geni.us/QJbved",
        "https://geni.us/uK3UAK",
        "https://geni.us/zAwSnn",
        "https://geni.us/oL39W",
        "https://lmg.gg/UdAUI",
        "https://geni.us/s3VHjY4",
        "https://geni.us/Yrp5i",
        "https://geni.us/gbaVQp",
        "https://linustechtips.com/topic/1502017-the-worst-product-we%E2%80%99ve-tried-in-years/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(water splashing) - Oh! Seriously? Did they ever try this thing? In the old days, we could cram top-of-the-line components into the tiniest of cases and still manage to cool them. But sadly, that is no longer the case because the PC industry has gone utterly bonkers to the point where you simply cannot fit a new GPU into a small form factor chassis, let alone cool it. That is until now, hailing from Japan, this is the Bykski 1080 External Cooler, an absolutely massive radiator that goes beside your computer, not inside it. And Bykski says that it can cool 2000 watts worth of computer, which- Here, here, there we go. You know that we are going to be testing. Just like we're gonna test your patience for my terrible segues to our sponsor. Build Redux. Is building a PC not your wheelhouse? No problem. Let the experts at Build Redux help you out. Just pick the parts and they'll do all the hard work. Check them out at the link down below. I'm not sure where I got the idea but I thought it would be smaller. While I've never seen one like this though, the idea of an external water cooling system is nothing new. And in fact, back in the early 2000s, external water coolers were more common than sticking radiators inside your case. And most cases that had a \"water cooling capable\" sticker on the box, simply had a couple of holes punched in the back with grommets that you could run tubes through. By contrast, modern cases are designed so that pretty much anywhere they leave space for a fan, they also try to leave space for a radiator because, well, what else were they gonna take up that room with? Three and a half inch hard drives? So then you're probably asking yourself, why, in the modern era, are we looking at an external water cooler? And the answer is, since Nvidia's 3000 series, we haven't really been able to pack the same tier of hardware into our small form factor PCs. That amount of heat just, I mean, even if we could stick it in there, isn't practical. Because even if we can keep temperatures under control, it's gonna be super loud. Like, sure, the water block on this RTX 4090 does make it a lot smaller than it was out of the box, but these things are so darn tall that in a lot of smaller cases it ends up interfering with the fans. And I mean, that's before we even stick a radiator on the thing, meaning it's basically impossible. Until you have one of these. By using an external cooler, we can still have a nice compact PC sitting on our desk while the heat and noise get chucked somewhere else. So let's take a closer look at it. Bykski is one of those brands that I've heard of before but only in the context of super cheapo budget stuff on AliExpress. So I've never really had a reason or an opportunity to look more closely at their products. Overall though, I gotta say my first impressions are pretty good. It's using what appears to be anodized aluminum, pretty much anywhere. It's got a very, kind of industrial vibe to it, but I like that function over form kind of design, right? Like, this grill is gonna keep your fingers out, sure. (fan spinning) But it is not gonna interfere with airflow. Around front I've got what seems to be some kind of integrated flow distribution thing, though it doesn't distribute water anywhere. - [Alex] It's a fill line. - In-out and I guess this is presumably fill? - [Alex] Yup. - Now you were saying you wanted to do a leak test on it before we take it open. I don't think that sounds very exciting but I can also see where you're coming from, so why don't we do that real quick. (suspenseful music) For the uninitiated, we are pressurizing the system because if air can get out, then probably water can also get out. This looks really expensive. Ah-ooh! This has a very hand-built vibe to it, doesn't it? On the one hand, obviously these are all mass produced parts. I think I'm looking at a DDC pump over here with a custom top that's integrated into this distribution plate. We've got what appear to be just off-the-shelf Bykski RGB controllers. These are clearly fans that are generally available outside of this system, but the actual integration of all of these components looks very hand-done. And all of the individual parts of the enclosure are just either sheet aluminum or extrusion, meaning that it's probably a pretty low volume product. Goes in here, pumps out to... Here, the bottom of the radiator, right? That makes sense for bleeding the air bubbles out. You wanna push the water into the bottom so that the air... Duh duh duh duh... Comes out the top. That goes way down to here and then up here and then out. - [Alex] I feel like there could have been a more elegant way to do that. - Me too. One thing I really like about the design is that this radiator is designed with an extremely low density fin structure. What that means is that it should perform very well with low RPM fans, meaning I expect this to be extremely quiet. We've got a simple adapter from 12V and 5V Molex, so it appears they expect you to simply run this inside your computer somehow to this 4 pin bad boy right here that screws on a little something like that. It's great that they have this high security, can't be accidentally unplugged connector here, but if you were to trip over the cord, nothing would prevent this from: (A) pulling out, and (B) yanking your computer off the desk. My enthusiasm is a little dampened. But if the performance is outstanding then I think I can get over it. Let's move on. (screwdriver whirring) Nice. Now let's take a look at the challenges we ran into trying to build a small form factor system with modern hardware. Will the 4090 fit this way? No. Not only can we not fit a radiator up in the top, we can't even fit fans. And if we took the fans out of here and we just put fans on a radiator on the bottom, there is absolutely no way that that would handle the heat load of a 4090 and our CPU, which I'm assuming is crap. I don't actually know. I think there's a spec list on here. Wait, also on the prompter, Bykski only accepts defects within 10 days of delivery? - [Alex] Yep, that's cool. - A 10 day warranty? Anyhoo, it's an i9-13900K in here with a Strix Z690-i motherboard and 8TB Sabrent Rocket PCIe Gen4 drive, EK Velocity2 CPU and GPU blocks, and an 850 watt Silverstone modular power supply. This is a top-of-the-line rig, and we're gonna have links to all of these parts down below. Alex, I guess we're go- Ooh. I guess we're gonna have to just remove these fans then- - [Alex] Yeah, they cannot live. - Okay. See you later, fans. - [Alex] GPU out for a second. - I just- What the heck? (Alex laughs) I mean, how is it even gonna close with the fans removed, Alex? - [Alex] It's very close. - I see. - The power switch has not really been working, so we want to plug that in. - Okay, so first of all, the motherboard, things come on little, little daughter riser things. So we're looking at that. You know, the external water cooling paradigm might feel inelegant compared to what people do these days, but it's actually kind of smart, like, yeah, you have to pay extra for the chassis for it, but that's a one-time thing, and it's the sort of thing that no matter how many times you change your CPU, or GPU or your blocks here, or even your case, you can continue to use. I can't say this makes me very comfortable. Do you see the angle this GPU is sitting at right now? - [Alex] You can see the whole back of the chassis move. - [Linus] Oh wow. We're just taking all that flex from the back and putting it on the bottom. Aah, okay. - [Alex] You said we could put fans in there, but I want art. - [Linus] I see. What? Really? - [David] It'll look... Yeah. - [Alex] I don't wanna be responsible for this, David. - What? No! Hold on. Wait, what are you doing? You're just gonna... Oh my God! (babies crying sound) - [David] Thank you so much for allowing me that pleasure. - This is optional but I would strongly recommend using quick disconnects with any kind of external water cooling system, just because it means that moving the system around is gonna be a lot easier. Can he do it? Oh, what, seriously? If we just power it up, that might do it. We're just gonna power it on and power pour. - The worst part is, I was about to suggest that too, so. - [David] Oh no. - I wonder if the power button works now. That would be cool. - You closed up the side panels without testing it. - Yeah. - Bad GBs. Okay. How much you wanna bet I can plug in that thing behind the GPU? I made the problem worse. - Just pull it out. - I think I pulled the daughterboard out. - Oh geez. (crew laughs) This is gonna be very difficult. - Yeah. - I think we might have to pull the GPU. - Nope, nope. I've got it, I've got it. - Oh, we should probably turn on the power supply. - Are you (beep) kidding me? (Alex laughs) Alex! Okay. - Oh geez. - Okay. Oh, shoot. There you go. Just never turn it off again. - Why is it still spewing? - Well, remember how I was saying I didn't really understand their reservoir design? - Yeah. - I still don't. - [Alex] This is very wet. - [Linus] I have no water in the system, sir. - What? - [Linus] No water. (fans whirring) That pump sounds so unhappy. I'm sorry, pumpy. I'm trying. We are not getting any water to the system yet. - Yeah, this thing's bone dry right now. - I'm working on it. I can feel water on my sandals toe. We're gonna try something bold. We're gonna crack a fitting. - Oh, there we go. - Whoa-whoa. Hey, oh, how you doing? - Hey, your computer might get water soon. - [Linus] Okay, so there's water making it to the computer now? - [Alex] Um, I don't see any yet. - Aah. For how much they're charging for this thing, I can't say I'm especially impressed. - Oh, the computer shut off. Excellent. - Oh crap. Oh... - Now it's on? - Okay. The power button works. I'm going, I'm going! (crew laughs) It's for testing. Come on, come on. - [David] Oh, water! Water! - Do we have water? - [David] Yeah, water's in the GPU. - Oh, heck yeah. - [Linus] Yeah, boys! - GPU is going to be so much happier now. - [David] Do you think it needs more water? - Look, David, I am working on the additional water. - Oh, it posted. - Yes! Yes, we successfully computer build. Okay, power down. This actually seems to be pretty effective. - [David] Where is all the water going? (Alex laughs) - Where is all the water going, David? - [Linus] Okay. Whoa! All right. Okay, hit it again. Nevermind. Did I lose more than I actually put in that time? - [Alex] Almost definitely. - What on earth? Oh, the babies. (crew laughs) Oh seriously? - Ugh! - All that progress un-progressed! - I'm legitimately concerned we're going to kill this with how much water is going out of this and into all of the electronics. - [Linus] It had it coming, Alex. You know, it is a question that we used to find ourselves asking more than we do now, but it still comes up. Did they ever try this thing? - And like your fill indicator will always be full because the pump's pumping the water through it and out. - Trying to use my thumb to kind of control the acid reflux this poor computer is suffering from. - [Alex] This deserves some babies too. - I'm changing the description of our channel to \"We Build Bad Computers So You Don't Have To\". Wait are you stuffing babies in there? Why are you doing that? Stop! - [Alex] I wanna get one in the fan. - [Linus] No! - Or I can just... Whoa! - No, you can't do that. Okay, recently I said there's no such thing as a bad product, just a bad price. I stand entirely corrected. Okay. Stop putting babies in the computer! Okay, we've got a bubble here, but the trick is that we need to fill it. Like it's pretty clear that this is a do not buy. Bykski, you aren't making a great first impression here. I gotta say. Okay, good. Now lower that, and I'll get this above you. Come on, bubbles. - [David] Oh yeah. - [Alex] That's working? - The issue is that moving the bubbles around doesn't help us. We have to get them replaced with water. And we can't put more water into the system because there's no way to fill the reservoir directly. This would take hours and hours and hours to fill a system. Fail, Bykski. It's so freaking loud! Meaning I expect this to be extremely quiet. I am outraged that I spent this much money on this thing. From a content point of view, I'm fine with it because this is hilarious. But if I bought this thing, what is it? 700 US dollars? - $690. - [David] Ooh, no! - I bet Alex and I could design a better this, in like, an afternoon. - Yeah, we would try it once and be like, \"Wow, that was the worst water cooling experience we've had in weeks, at least.\" - We wouldn't need to because we'd put a reservoir in the bloody thing! So let's have a look at the flow path in here and figure out why this isn't working. So here's where we're filling. This goes into the reservoir, right? But you can see, see this coagulation effect here? I think the issue is that there's not enough room for the air to travel up this. If this was like a big fat, like three quarter inch tube or something like that, it might be all right. But this right angle fitting here is absolutely killing it. You can see here that even though the reservoir theoretically keeps bubbles from getting to the inlet of the pump, right? They should all rise to the top and then be replaced by this fill here. Theoretically- - [Alex] Oh yeah, I see what's going on. - But in practice, it's not able to clear the bubbles from the impeller. So it's creating this like, pressure on the other side of the pump that then shoots this water back up the fill port. Also, the inlet for the reservoir is so close to the inlet for the pump, that it actually sucks the bubbles, even though they should float. - [Alex] Yeah. - Should we try to fix their design? - [Alex] Yeah. - Alex, you got any stop fittings? - Uh, yes. - [David] What's up, Tynan? - Hi. (David laughs) - Don't worry. What we're doing is fine. - [Tynan] I've seen worse. Although, the babies are marginally concerning. (David laughs) - Where does this go? - It goes where Tynan's finger is, 'cause there's nothing gonna be in there. - [Alex] Okay. (crew laughs) - So you cut it, like, I'm thinking, like, here. Okay, don't cut my finger, and then I'm gonna get in there immediately. Oh, okay. And this goes on here, and this goes on here. Oh my God, this plate goes back there. Okay. How's our CPU temps doing, Alex? - 79 degrees. - [Linus] 79 degrees. Okay, wait for it. I can fix that. - [David] Watch out for the baby! - No, I'm not watching out for the baby. They didn't even put any lock tight on these stupid pass throughs. So they just spin freely as you're trying to tighten things. Okay, I'm powering up the pump. Okay. So now, our bubbles... - [Alex] Go to the fill port! - [Linus] Go to the fill port! (Alex laughs) You're welcome, Bykski. The fact that that's what it took to fix their design, that's not on us. That's on them. The reason I could think that they would use that is because I don't know if we're gonna be able to close this panel, now that we've moved it to the right spot. That's a really tight run there. - [Alex] Oh yeah, we can't. - Oh, yeah. How are we doing? Does it work? - It's 31 degrees right now. - Nice! - Great. - Nice! Also, Alex, your concerns about not having fan control? Very valid. These are spinning at like 3000 RPM. (fans whirring) Maybe more. (fans whirring) - It looks like something we would've made. - No, you take that back. We would've made it better than this. - We're able to dispel 313 watts. Cool. You can do that with a 360 Rad. - [David] Yeah. - [Alex] Oh, almost 40K in Cinebench. That's pretty good. - Yeah. I mean, it's gonna keep your water temps down near ambient. - Once you fill it, it should work. You just can't ever put it back together again. - Just like this segue to our sponsor. - Guardio. Guardio is a browser extension designed to help protect you as you browse online. It seems everyone and their grandma knows about LMG getting hacked at this point. The nature of the attack on us was done through something known as cookie hijacking, which unfortunately has become far too common online. This type of attack works around things like two-factor authenticators which can make the mess harder to clean up. The best preventative tools a person can have are knowledge and safety nets. Guardio doesn't rely on blacklisting sites, but rather detects crypto, phishing and other types of scams and preemptively stops them from reaching you at all. This means even in a moment of inattentiveness, Guardio can intervene in times when unscrupulous links find their way to your inbox, and in under 30 seconds, Guardio offers a free scan to see how at risk you currently are. After the scan, you'll get a seven day trial to remove current threats and enable realtime protection, alerting you if your information is leaked somewhere, so you can take immediate action. They have over a million current users and they're offering our audience 20% off a monthly subscription. So to start securing your browser and personal information today, check out Guardio at guard.io/linustechtips and stay ahead of scammers. - If you guys enjoyed this video... - What did I want to throw to? I want to throw to the fastest Xbox. A small form factor build that was actually good. - And self-contained. - Yes. - All right, sure, they can watch that. But also watch the car radiator one. It has the same chaotic energy. This is great. This is all the additional equipment Alex was expecting to use while we tested the 2000 watt capacity claims. Won't be needing that. I wouldn't hook that thing up to anything.",
    "transcript_keywords": [
        "water",
        "Yeah",
        "external water",
        "thing",
        "GPU",
        "external water cooling",
        "water cooling",
        "Alex",
        "Bykski",
        "fans",
        "fill",
        "system",
        "computer",
        "External",
        "radiator",
        "water cooling system",
        "power",
        "back",
        "external water coolers",
        "pretty"
    ],
    "transcript_entity_values": [
        "EK",
        "seven day",
        "one",
        "weeks",
        "second",
        "TB Sabrent Rocket",
        "Bykski RGB",
        "first",
        "5V Molex",
        "One",
        "31 degrees",
        "Guardio",
        "monthly",
        "the Bykski 1080 External Cooler",
        "3000",
        "850 watt",
        "Guardio",
        "10 days",
        "GPU",
        "Japan",
        "David",
        "AliExpress",
        "Alex",
        "today",
        "12V",
        "the old days",
        "4090",
        "10 day",
        "690",
        "hours and hours and hours",
        "the early 2000s",
        "three quarter inch",
        "Tynan",
        "8",
        "Three and a half inch",
        "Cinebench",
        "over a million",
        "Xbox",
        "Silverstone",
        "4",
        "LMG",
        "20%",
        "We Build Bad Computers",
        "700 US dollars",
        "Build Redux",
        "CPU",
        "Bykski",
        "Linus",
        "Nvidia",
        "2000 watt",
        "Bykski",
        "under 30 seconds",
        "Linus",
        "DDC",
        "4090",
        "David] Watch",
        "two",
        "79 degrees",
        "these days",
        "313 watts"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "TIME",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "MONEY",
        "FAC",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY"
    ],
    "vector": [
        -0.1377258002758026,
        0.019720671698451042,
        0.009521973319351673,
        0.07697100192308426,
        0.07669202983379364,
        -0.03210654854774475,
        -0.0407608225941658,
        0.08300410956144333,
        -0.04713551327586174,
        -0.03894738480448723,
        0.0016333576058968902,
        0.028958365321159363,
        0.014139783568680286,
        0.010542519390583038,
        0.02755526266992092,
        -0.0008169910870492458,
        0.1384417712688446,
        -0.06086103618144989,
        -0.03969135135412216,
        -0.05886434018611908,
        0.010131295770406723,
        -0.07299943268299103,
        -0.028843147680163383,
        -0.017382534220814705,
        0.008006613701581955,
        0.010834920220077038,
        0.03486500680446625,
        -0.01922248862683773,
        0.008179418742656708,
        -0.023257439956068993,
        0.004615315236151218,
        -0.01025325059890747,
        -0.05465153604745865,
        -0.029412250965833664,
        -0.003929480444639921,
        -0.0652858316898346,
        0.06203310564160347,
        -0.05200478434562683,
        -0.015595531091094017,
        -0.08337347954511642,
        -0.0021315033081918955,
        -0.022187070921063423,
        0.013024174608290195,
        0.0514700710773468,
        0.04383533075451851,
        -0.004640557803213596,
        0.03862851485610008,
        -0.054786793887615204,
        -0.027234874665737152,
        -0.05434868857264519,
        -0.054335616528987885,
        -0.07536034286022186,
        0.025031503289937973,
        0.022567175328731537,
        -0.09740179777145386,
        -0.013459369540214539,
        -0.06231408193707466,
        -0.10990436375141144,
        0.011658061295747757,
        -0.051795486360788345,
        0.07761524617671967,
        -0.12696628272533417,
        -0.026696661487221718,
        0.03942517563700676,
        0.04778939485549927,
        -0.015222880989313126,
        -0.047877147793769836,
        0.053706031292676926,
        0.011922580190002918,
        0.07511018961668015,
        0.024969030171632767,
        0.02702690102159977,
        -0.0022200692910701036,
        0.051625609397888184,
        -0.007017018739134073,
        0.006995287258177996,
        0.05020738020539284,
        -0.09442012012004852,
        0.036218173801898956,
        0.02576897293329239,
        0.035058822482824326,
        -0.07767104357481003,
        -0.024520864710211754,
        -0.06034374237060547,
        0.017306316643953323,
        -0.01873098872601986,
        0.1093735545873642,
        0.017871493473649025,
        -0.0031717908568680286,
        -0.10326717793941498,
        0.04359058663249016,
        0.018301015719771385,
        0.09690092504024506,
        -0.003176202066242695,
        0.05522022768855095,
        0.05035240948200226,
        -0.03597361594438553,
        -0.06459887325763702,
        -0.03964987397193909,
        0.048114877194166183,
        0.037123654037714005,
        0.043488599359989166,
        0.025258980691432953,
        0.06751547753810883,
        -0.01953442208468914,
        0.021030250936746597,
        -0.030659282580018044,
        -0.0015401996206492186,
        -0.024578744545578957,
        -0.02463497221469879,
        -0.07030397653579712,
        0.020388253033161163,
        -0.06161750480532646,
        -0.000781147857196629,
        0.0012906629126518965,
        -0.06495022773742676,
        -0.04441171884536743,
        0.027599923312664032,
        0.06332840770483017,
        0.019238533452153206,
        -0.02890307456254959,
        0.017405223101377487,
        -0.008584690280258656,
        0.11011702567338943,
        0.03827759623527527,
        0.07788234204053879,
        -0.06373707205057144,
        6.690398831418006e-33,
        -0.0016706106252968311,
        0.07317974418401718,
        -0.0461016483604908,
        -0.03766491636633873,
        0.019650384783744812,
        -0.00671523017808795,
        0.04349394887685776,
        -0.051185622811317444,
        0.018552377820014954,
        0.09836399555206299,
        0.004461778327822685,
        -0.015920590609312057,
        -0.05297452211380005,
        0.057351406663656235,
        0.07843193411827087,
        -0.08335048705339432,
        -0.031090613454580307,
        0.014770477078855038,
        -0.009690310806035995,
        0.04063062369823456,
        0.07705583423376083,
        -0.007502998225390911,
        -0.02457289770245552,
        -0.009177768602967262,
        0.05520284175872803,
        -0.019025694578886032,
        0.05051436647772789,
        -0.02483675256371498,
        0.0563887320458889,
        0.017720498144626617,
        0.011739223264157772,
        -0.0888148620724678,
        -0.055363673716783524,
        0.03336150199174881,
        0.010914070531725883,
        0.01505298726260662,
        -0.08140669763088226,
        -0.06928936392068863,
        0.04497399181127548,
        -0.04487483203411102,
        -0.02378074824810028,
        0.05017886310815811,
        -0.05908359959721565,
        -0.036252692341804504,
        -0.03177882358431816,
        -0.00691277626901865,
        0.010716755874454975,
        -0.002353306859731674,
        0.016907719895243645,
        -0.06483656167984009,
        -0.06263308227062225,
        0.04942796006798744,
        -0.07341510057449341,
        0.05296818166971207,
        0.004859255161136389,
        -0.07234150171279907,
        0.06477536261081696,
        -0.018617616966366768,
        0.09227064996957779,
        0.0846070870757103,
        -0.04029880091547966,
        -0.03738611191511154,
        -0.04184417426586151,
        -0.034477781504392624,
        -0.082436703145504,
        0.07819937914609909,
        0.024081556126475334,
        -0.011328314431011677,
        -0.07721593976020813,
        -0.0069418721832334995,
        -0.03057602420449257,
        0.012121020816266537,
        0.04433911666274071,
        -0.053593892604112625,
        0.08201364427804947,
        -0.003314840840175748,
        -0.017275992780923843,
        -0.05215984955430031,
        -0.06327714771032333,
        -0.0727812796831131,
        -0.06602215021848679,
        0.014689859934151173,
        0.003533930517733097,
        0.048233382403850555,
        0.020586611703038216,
        -0.043344829231500626,
        -0.05640653520822525,
        0.024435505270957947,
        0.014352277852594852,
        0.028291290625929832,
        -0.017672179266810417,
        -0.04455358162522316,
        0.06871827691793442,
        0.054975517094135284,
        -0.04170050472021103,
        -6.113351225993238e-33,
        -0.05228995904326439,
        -0.06481970101594925,
        0.04089875519275665,
        0.078447625041008,
        0.06225857138633728,
        -0.02119855396449566,
        0.06715239584445953,
        0.03086668811738491,
        0.05678805708885193,
        -0.028248384594917297,
        0.019010307267308235,
        0.07058638334274292,
        0.04056020453572273,
        0.010782533325254917,
        0.046025462448596954,
        -0.011291742324829102,
        0.008398431353271008,
        -0.04249648377299309,
        0.10045118629932404,
        -0.07386858761310577,
        0.06546103954315186,
        0.0884610265493393,
        0.028549138456583023,
        0.05617327615618706,
        -0.035465482622385025,
        0.052816733717918396,
        0.04018640145659447,
        -0.01670866645872593,
        0.0044236560352146626,
        0.0075340899638831615,
        0.014163783751428127,
        0.0297363493591547,
        -0.021026194095611572,
        0.021411458030343056,
        -0.0038017965853214264,
        0.005372923333197832,
        0.07948383688926697,
        0.055072296410799026,
        -0.027785658836364746,
        -0.05222371220588684,
        0.056860171258449554,
        0.04204912856221199,
        0.01661846600472927,
        0.005760533269494772,
        -0.004727791994810104,
        0.019146766513586044,
        -0.022305147722363472,
        -0.04392416402697563,
        0.04176797717809677,
        -0.008119606412947178,
        -0.023953814059495926,
        -0.08303418755531311,
        0.013225819915533066,
        0.05958747863769531,
        0.0035444728564471006,
        -0.08892368525266647,
        0.008126676082611084,
        0.05528591200709343,
        -0.012213866226375103,
        -0.026769092306494713,
        0.08550044149160385,
        0.003940995316952467,
        -0.021508626639842987,
        -0.04184897989034653,
        0.010967903770506382,
        -0.06822068989276886,
        0.011541683226823807,
        0.07561615854501724,
        -0.02666684426367283,
        0.02350926212966442,
        -0.017987065017223358,
        -0.009303214959800243,
        -0.0382576584815979,
        -0.06979448348283768,
        0.005701812915503979,
        0.06711942702531815,
        0.040820252150297165,
        0.0011851846938952804,
        0.04456138238310814,
        -0.03534533083438873,
        -0.1129843220114708,
        0.028878364711999893,
        0.005614872556179762,
        -0.022373568266630173,
        0.12401697039604187,
        -0.03246516361832619,
        0.029351629316806793,
        -0.027050307020545006,
        0.018395109102129936,
        -0.053961381316185,
        -0.07820434123277664,
        -0.038528379052877426,
        0.0019179373048245907,
        0.03394773229956627,
        -0.003348186146467924,
        -5.477290798694412e-08,
        0.026568040251731873,
        -0.03221220523118973,
        0.025443919003009796,
        0.08986862748861313,
        -0.009030194021761417,
        -0.10428573936223984,
        0.005001422017812729,
        -0.006865131203085184,
        0.02610212378203869,
        -0.04062464460730553,
        0.06563323736190796,
        -0.0776996985077858,
        -0.014823117293417454,
        -0.006276163272559643,
        -0.01070368755608797,
        -0.02408973127603531,
        -0.05074614658951759,
        0.10437163710594177,
        0.0109049491584301,
        -0.13173940777778625,
        -0.011467293836176395,
        0.028489837422966957,
        0.09270422905683517,
        -0.02270478568971157,
        -0.04860341548919678,
        0.09793253242969513,
        0.06601490080356598,
        -0.03287858888506889,
        0.16134428977966309,
        -0.04205302894115448,
        -0.10862555354833603,
        -0.004276546649634838,
        0.04341995343565941,
        -0.03462245315313339,
        0.0744374543428421,
        -0.038125425577163696,
        -0.023379283025860786,
        0.12291961908340454,
        0.07017912715673447,
        0.04187347739934921,
        0.012591851875185966,
        -0.04851927608251572,
        -0.03955306112766266,
        0.03091273456811905,
        0.026548422873020172,
        -0.009968683123588562,
        -0.07744771987199783,
        -0.10790986567735672,
        -0.007256306242197752,
        0.05572405084967613,
        0.005680088419467211,
        -0.03498707711696625,
        -0.04260716587305069,
        0.02849428355693817,
        0.03538725897669792,
        0.0002909006434492767,
        -0.07144706696271896,
        0.023862438276410103,
        -0.03490930050611496,
        0.04062015935778618,
        0.0694536343216896,
        -0.11121511459350586,
        -0.10164668411016464,
        0.08667267858982086
    ]
}