{
    "id": "LZ-M2WWf2e0",
    "title": "Asus ROG Phone 2 Teardown! - Is the rear vent Fake?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-10-17T12:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=LZ-M2WWf2e0",
    "category": "Howto & Style",
    "tags": [
        "ROG Phone 2",
        "ROG",
        "Asus ROG",
        "ROG 2",
        "ROG phone 2 teardown",
        "Republic of gamers",
        "gaming phone",
        "gaming smartphone",
        "Asus",
        "Best gaming phone",
        "best smartphone",
        "flagship",
        "mobile phone",
        "iphone",
        "pubg",
        "fortnite",
        "120hz display",
        "video game",
        "gaming",
        "mobile game",
        "ROG 2 review"
    ],
    "views": 3548967,
    "likes": 77203,
    "comments_count": 3916,
    "description": "Lets teardown the ROG Phone 2! Download Turo for free here:  Use promo code RIG15 to get $15 off your first trip! Thanks to Turo for sponsoring this video. The ROG Phone 2 is one of the most powerful phones of 2019. With its 120hz display and 6000mah battery its hard to dispute the specs. Today we are going to take apart the ROG Phone 2 and see whats inside that metal vent on the back.   ROG Phone 2 Durability test:  Current ROG Phone 2 Pricing:  Here is the OLD ROG 1 Price:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://turo.onelink.me/1712264037/516ea010",
        "https://youtu.be/fYhnLvIZST0",
        "https://amzn.to/2n13V58",
        "https://amzn.to/2oILJh2",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're taking apart the ROG Phone 2. Probably one of the feature rich smartphones of 2019. We're going to look under that crazy metal protrusion on the back panel and see if it actually does anything besides just look cool. And we'll see how the glowy LED lights on the back panel work. It should be pretty interesting. This video is sponsored by Turo. Let's get started. [Intro] So last year when I took apart the ROG 1, this metal contraption felt more like decoration than anything else. This year my razor blade slide underneath the growth so we know that it's not a built in part of the frame. But it's also still connected underneath the back glass. So I'll have to break out my trusted heat gun to remove the glass before getting to the metal chunk. The adhesive holding down the rear glass panel with its colorful accent lines can be warmed up and cut away with my suction cup and razor blade. Working my way around the hard angles of the metal vent is fairly complicated. Glued shut phones are never the easiest to take apart. Finally though, with enough heat and persuasion, we can rotate the back cover off revealing an absolutely massive internal battery and a self lit LED reflective back panel. The lights inside the ROG 2 aren't deflected from separate LEDs. The LEDs are actually built into the reflector itself. Much better design than last year's ROG 1 that had the LEDs off to the side shooting into a white piece of plastic. This new method is much more efficient and more secure, and since it has it's own gold contact pads, these can basically be added anywhere inside the back panel on future phones. And can just shine through wherever the glass is clear. So let's cross our fingers for even more lights in the future. It's nice to see that the ROG lighting on gaming smartphones is improving. ASUS is really shaking things up. Speaking of brands that are shaking things up, huge thanks to Turo for sponsoring this video. Turo is a car sharing service that has vehicles in more than 5,000 cities across the U.S., Canada, Germany, and the U.K. It's just like renting a car, but way easier. And the price on average is usually 30% less than a normal car rental service. There are some pretty nice cars on here as well. Turo has 24/7 customer support and roadside assistance, and you also have access to insurance through the Turo insurance agency. Personally I'm eyeing these Teslas that I can rent all day for super cheap. Turo can be accessed via the web or by downloading the app for iPhone or Android. Use the link in the description along with the discount code RIG15 for $15 off your first trip. If you need a truck to move something or just want to try out a Tesla for the first time, or maybe just need a cheap car to get around while you're traveling, Turo's pretty simple. And you can even rent out your own vehicle to make some extra cash. I'll leave the link in the description if you want to learn more and get that $15 off. And thanks to Turo for sponsoring this video. To get deeper inside the ROG Phone 2 we got to remove the 8 screws holding on the bottom plastics, and the 5 screws holding down the top plastics. You would think at this point when those screws are off that the back panel could come away from the phone. But it turns out that there are 2 more screws hidden underneath the metal vent. And since the glass is now off, I can slice underneath that metal vent and remove it from the frame. This guy is it's own little unit stuck to the phone with adhesive, and it is hollow inside. The underside of the hump is made from plastic with only a very thin outer metal shell, about as thick as a pop can. The metal hump itself definitely does not provide any active thermal cooling. The tiny copper grill however does have a direct opening to inside the phone, which from a water resistance perspective, is a nightmare. But once again, there is no direct contact with anything on the motherboard. The tiny vent just allows passive heat dissipation for any heat that happens to radiate through the air off the motherboard itself. Let's just say this thing looks more impressive from the outside than the inside at least this time around. We'll see if there's any more copper cooling on the underside of the motherboard in just a second. Let's go deeper. The massive battery is plugged into the center of the motherboard. I'll unsnap that like a little Lego and then I'll make my way down to the three small ribbon cables at the bottom of the motherboard. This phone does not have any wireless charging or water resistance might be deal breakers to some, but it does have a headphone jack, which are getting pretty rare these days. This tiny little daughterboard also comes soldered together with the lower vibration motor. There are 2 vibrators in this phone. We'll find the other one in just a second. I'll remove the dual SIM card tray. And then lucky for us, ASUS has added a magical pull tab underneath the battery. It's a narrow little guy, and eerily silent compared to Apple's pull tabs. But it gets the job done in a safe manner and doesn't break. There is a bit of gentle adhesive on the far side of the battery, but nothing that's super dangerous. This is a 6,000 milliamp hour lithium polymer pack which is the largest we've seen inside of a cell phone all year. Check out what's underneath the battery a solid wall of copper. Now we're talking. This is where the real cooling happens. This is an underscreen vapor chamber. We've run into a few of these in the past. We'll have to pull it out to see how big it really is in just a second. First I'll remove the rubber plug out of the side dual USB-C accessory and display ports, and unclip the dual real facing camera and pull it away from the phone. It's got a 48 megapixel main sensor on the left, and a 13 megapixel wide-angle camera on the right. Neither of which are advertising optical image stabilization. The front 24 megapixel camera also does not have OIS, but does come with a gray rubber ring around the lens. Kind of random. I can finally pull the motherboard out from inside the phone frame. It's got a long thin design that basically wraps around the whole phone. The design of the ROG 2 seems like things were added kind of at random. It's not quite as organized as other flagships we've been inside. It does have thermal paste between the processor and the massive internal heat sink. The little copper square that touches the processor is located up near the top small circle vibrator. I imagine there are two vibrators inside to give better haptic feedback on either side of the phone while gaming, just like we would see inside of a normal video game controller. The top and bottom stereo speakers are also a bit different. The top speaker is much smaller, and the bottom speaker doesn't appear to have any balls inside like we saw inside the Galaxy Fold. The underscreen fingerprint scanner is also down here at the bottom of the phone near the loudspeaker. It's a little camera that shines up through the thin AMOLED screen to read your fingerprint. Now normally, we do try to keep these phones in working condition. I like putting them back together. But this particular design puts the copper vapor chamber between the frame of the phone and the screen because that AMOLED panel is so thin, the ROG uses that to it's advantage to allow heat to escape out the front of the phone. Which is pretty smart except that the only way for us to see it is by removing the screen and removing the screen breaks the screen. Screen removals are usually only performed when the screen is already broken. The ROG Phone 2 has a large 6.6 inch 1080p display, but the thing that makes it special is the 120 Hertz refresh rate. It shows images twice as fast as normal phones do. And yeah, cracking a 120 Hertz display hurts me a little bit on the inside. But at least now we get to see what we came here for. Look at the size of this copper layer. We might have a new vapor chamber world champ right here. This looks larger than even the Razer Phone 2 vapor chamber. Normally vapor chambers have, you know, vapor inside. Vapor wicks along the little copper capillaries to keep things cool. And usually this vapor is visible when we slice it open, at least for a second. But, in my particular ROG Phone 2, no vapor is visible inside. It's bone dry in here. But even without liquid, it's still a substantially large heat sink, and copper does a good job of dissipating heat all on it's own. I think it was definitely worth taking off the screen. Even if the phone didn't quite survive. On paper, the ROG 2 is one of the best phones of 2019 with it's impressive screen and large battery. But with that open rear ventilation system that's more for looks than anything else. It's also very much the least water resistant phone we've seen in a very long time. Would that major lack of water resistance in a phone this powerful make you nervous? Let me know down in the comments. Don't forget to check out Turo next time you need to borrow a car. You can use that RIG15 code to get $15 off. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see your around.",
    "transcript_keywords": [
        "Phone",
        "ROG Phone",
        "ROG",
        "inside",
        "Turo",
        "back panel",
        "phones",
        "back",
        "screen",
        "vapor",
        "metal",
        "panel",
        "heat",
        "copper",
        "underneath",
        "motherboard",
        "vapor chamber",
        "battery",
        "glass",
        "car"
    ],
    "transcript_entity_values": [
        "all year",
        "AMOLED",
        "2019",
        "iPhone",
        "Vapor",
        "30%",
        "8",
        "Lego",
        "the Galaxy Fold",
        "Instagram",
        "Turo",
        "two",
        "15",
        "all day",
        "6.6 inch",
        "jack",
        "ASUS",
        "three",
        "120",
        "Tesla",
        "ROG",
        "more than 5,000",
        "U.S.",
        "This year",
        "last year's",
        "Hertz",
        "5",
        "Apple",
        "24 megapixel",
        "Canada",
        "ROG 1",
        "last year",
        "first",
        "second",
        "6,000 milliamp hour",
        "Glued",
        "First",
        "13 megapixel",
        "Germany",
        "Android",
        "these days",
        "Today",
        "the ROG 2",
        "48 megapixel",
        "U.K.",
        "one",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "GPE",
        "LAW",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.1253606677055359,
        0.08192631602287292,
        0.037237219512462616,
        -0.018512537702918053,
        0.07959238439798355,
        -0.10824161767959595,
        0.04351130127906799,
        0.05514456331729889,
        -0.009496504440903664,
        0.013037338852882385,
        0.06182260811328888,
        0.040664754807949066,
        0.02618321217596531,
        -0.007704868447035551,
        -0.015857065096497536,
        -0.04107600450515747,
        0.05352020636200905,
        -0.03899083286523819,
        -0.05409247800707817,
        0.09935364127159119,
        0.0423848032951355,
        0.022358840331435204,
        0.022859079763293266,
        0.00798364169895649,
        0.07208774983882904,
        -0.043619051575660706,
        -0.01591249369084835,
        0.006165775004774332,
        -0.04129566252231598,
        -0.07710473984479904,
        0.0640466958284378,
        0.09504029154777527,
        -0.033714137971401215,
        0.008470077998936176,
        0.028574516996741295,
        -0.050236716866493225,
        0.07189477980136871,
        -0.02300044521689415,
        -0.11482254415750504,
        -0.007531626150012016,
        -0.042080141603946686,
        -0.0038134704809635878,
        0.045635923743247986,
        -0.018013956025242805,
        0.0068413084372878075,
        0.011183388531208038,
        0.090392105281353,
        -0.04002232104539871,
        0.04904680326581001,
        0.007732115685939789,
        -0.02661539427936077,
        0.027443651109933853,
        0.01864284835755825,
        0.011266314424574375,
        -0.09754990041255951,
        0.07329287379980087,
        -0.0220195185393095,
        -0.07177187502384186,
        0.07561815530061722,
        -0.011863264255225658,
        0.11402387171983719,
        0.05948495492339134,
        -0.06949945539236069,
        0.07531779259443283,
        -0.030295971781015396,
        0.007871394976973534,
        -0.011415011249482632,
        -0.13500654697418213,
        0.05854908749461174,
        0.011376137845218182,
        0.010648053139448166,
        -0.023335780948400497,
        -0.010643822140991688,
        -0.009504019282758236,
        -0.012067883275449276,
        0.10511616617441177,
        0.03450433164834976,
        -0.009624318219721317,
        -0.0025275859516113997,
        -0.013363499194383621,
        0.07691248506307602,
        -0.0819045677781105,
        0.013327396474778652,
        -0.03933686017990112,
        0.01815994270145893,
        0.02184494584798813,
        0.029840020462870598,
        0.05352802947163582,
        -0.07954900711774826,
        -0.03277372568845749,
        -0.006270374171435833,
        0.05408969148993492,
        0.02730311080813408,
        -0.004452978260815144,
        0.006415273062884808,
        -0.08354395627975464,
        -0.07188410311937332,
        -0.03618331253528595,
        -0.027549978345632553,
        0.05574285611510277,
        0.00020485688582994044,
        0.004315661732107401,
        0.043825019150972366,
        -0.014642981812357903,
        0.05037505924701691,
        -0.06730905175209045,
        -0.05680018290877342,
        -0.005046784412115812,
        -0.02756926789879799,
        0.0026223945897072554,
        -0.02309230901300907,
        0.06918540596961975,
        0.007754733320325613,
        -0.016868356615304947,
        0.0587213858962059,
        0.05753757804632187,
        -0.05344357341527939,
        0.0333571583032608,
        0.04597659781575203,
        0.004871702753007412,
        0.021079612895846367,
        -0.01372191309928894,
        -0.06015412509441376,
        -0.04660729691386223,
        0.08994275331497192,
        -0.03980198875069618,
        -0.037020210176706314,
        5.7707552341560054e-33,
        0.03463512659072876,
        0.12461666017770767,
        0.036008041352033615,
        -0.02563031017780304,
        -0.055081140249967575,
        0.03069780394434929,
        0.03038942813873291,
        0.002972578164190054,
        0.014786001294851303,
        0.0864945650100708,
        -0.0419912189245224,
        0.049296919256448746,
        -0.02450968138873577,
        -0.006645568180829287,
        0.04046832025051117,
        -0.046498339623212814,
        -0.04583092778921127,
        -0.05126533284783363,
        -0.054855599999427795,
        -0.008147867396473885,
        -0.03635986149311066,
        -0.010790597647428513,
        0.0016933713341131806,
        -0.0026467537973076105,
        0.07629621028900146,
        0.03523513302206993,
        0.06538692116737366,
        -0.02307865582406521,
        0.02404109761118889,
        0.04240688681602478,
        -0.04374290630221367,
        -0.023979801684617996,
        0.027607126161456108,
        0.0247707050293684,
        -0.08580780029296875,
        0.01956256851553917,
        -0.08957983553409576,
        -0.135983407497406,
        -0.050181467086076736,
        0.0034718792885541916,
        0.0017407399136573076,
        0.005436656530946493,
        -0.06631724536418915,
        0.021151572465896606,
        0.0387234203517437,
        -0.08059818297624588,
        -0.06274184584617615,
        0.022433796897530556,
        -0.003429161151871085,
        0.008365927264094353,
        -0.009796432219445705,
        -0.028111182153224945,
        -0.01970183476805687,
        0.012349779717624187,
        -0.06895765662193298,
        -0.02341119386255741,
        0.032711148262023926,
        -0.0007855804869905114,
        0.05943561717867851,
        0.07165855914354324,
        0.04515121132135391,
        -0.011635947972536087,
        -0.029383394867181778,
        0.03595491498708725,
        -0.06629344820976257,
        0.016629043966531754,
        0.04373019561171532,
        -0.05413477495312691,
        -0.08386141806840897,
        -0.007409500889480114,
        0.002911480376496911,
        -0.03782389312982559,
        -0.023439018055796623,
        -0.04292712360620499,
        -0.018979763612151146,
        -0.007420496549457312,
        0.02535529062151909,
        -0.009331969544291496,
        -0.026865363121032715,
        0.019778039306402206,
        -0.10097000747919083,
        0.018177837133407593,
        0.06238509342074394,
        0.0062925610691308975,
        -0.019876061007380486,
        -0.1103663370013237,
        0.00676729204133153,
        -0.10363975167274475,
        0.003078381298109889,
        0.08657616376876831,
        -0.02549174055457115,
        -0.0363919660449028,
        -0.07246242463588715,
        0.005666394252330065,
        0.002082550898194313,
        -5.580326251348749e-33,
        -0.10460890829563141,
        0.005062618758529425,
        0.02457905374467373,
        0.034114621579647064,
        0.0012800926342606544,
        -0.06260602921247482,
        0.09346579015254974,
        0.13601087033748627,
        -0.005510783288627863,
        -0.0913226529955864,
        0.027383385226130486,
        0.03202179819345474,
        -0.004609289113432169,
        -0.01996045745909214,
        0.08415602147579193,
        -0.08376812189817429,
        0.04428515583276749,
        -0.14057455956935883,
        0.03460250794887543,
        0.0931142270565033,
        0.04193897545337677,
        0.09218127280473709,
        0.09147877991199493,
        0.09015809744596481,
        0.012193070724606514,
        0.023986097425222397,
        0.064301036298275,
        -0.046163950115442276,
        0.05029519647359848,
        -0.031124142929911613,
        0.04035935923457146,
        0.02154378592967987,
        -0.003535517491400242,
        0.09169837832450867,
        0.02409561723470688,
        0.033576883375644684,
        0.06719981133937836,
        0.029799597337841988,
        -0.022898288443684578,
        -0.10565228015184402,
        0.019846081733703613,
        0.10265882313251495,
        0.001859894604422152,
        -0.021031640470027924,
        -0.01680869236588478,
        -0.087432861328125,
        0.037168268114328384,
        -0.059750158339738846,
        0.0012096306309103966,
        -0.057290803641080856,
        0.011648120358586311,
        -0.028663402423262596,
        -0.006727381143718958,
        0.06669251620769501,
        -0.02408936619758606,
        -0.017169620841741562,
        0.008175204508006573,
        -0.038303010165691376,
        -0.0005101889837533236,
        0.0007205533911474049,
        0.1464802622795105,
        0.03441919758915901,
        -0.03413332253694534,
        -0.0857689306139946,
        -0.03322813659906387,
        -0.03448646143078804,
        0.041621580719947815,
        0.0021638923790305853,
        -0.038003288209438324,
        0.04194219410419464,
        -0.011162081733345985,
        0.006615369115024805,
        0.010747859254479408,
        -0.028259670361876488,
        0.02539556287229061,
        0.03584054857492447,
        -0.07054809480905533,
        0.022266147658228874,
        -0.021186793223023415,
        -0.031175103038549423,
        0.051979538053274155,
        -0.03294384479522705,
        0.012430235743522644,
        0.03644233196973801,
        0.06713958829641342,
        -0.05281204730272293,
        -0.0395946241915226,
        0.054530754685401917,
        -0.033575721085071564,
        0.022074975073337555,
        -0.08547196537256241,
        -0.028268903493881226,
        -0.07505566626787186,
        0.07330994307994843,
        0.026451582089066505,
        -5.6410399906781095e-08,
        0.037230949848890305,
        0.034188997000455856,
        0.08526892215013504,
        -0.02032255195081234,
        -0.035609036684036255,
        -0.030067425221204758,
        0.004406133200973272,
        -0.06912501901388168,
        0.004785187542438507,
        -0.0488710030913353,
        -0.0385056808590889,
        -0.07191608846187592,
        -0.012404111213982105,
        0.003726037684828043,
        -0.04584119841456413,
        0.10612785816192627,
        -0.10647116601467133,
        0.0643230527639389,
        0.010421307757496834,
        0.02842295728623867,
        -0.004229261074215174,
        0.020025651901960373,
        0.03487846627831459,
        0.0022623708937317133,
        0.0478341318666935,
        0.05399457365274429,
        -0.10976351797580719,
        -0.014239300973713398,
        0.0816904753446579,
        0.010060668922960758,
        0.005290261935442686,
        -0.04203038662672043,
        0.04670584201812744,
        0.003326553152874112,
        -0.0465310774743557,
        -0.037205033004283905,
        -0.015310385264456272,
        -0.01805199682712555,
        0.045071087777614594,
        -0.01843803934752941,
        0.007934682071208954,
        -0.07763878256082535,
        0.01787819154560566,
        0.02703268453478813,
        -0.06275074928998947,
        -0.03423800691962242,
        0.04343198239803314,
        -0.14821071922779083,
        -0.08369272202253342,
        -0.0037564474623650312,
        -0.011845538392663002,
        -0.07656429708003998,
        -0.0748455822467804,
        -0.027071254327893257,
        -0.005770538002252579,
        0.014352474361658096,
        0.061061520129442215,
        -0.03900890797376633,
        0.00851950328797102,
        0.019170692190527916,
        -0.014144602231681347,
        -0.01997152715921402,
        -0.021178370341658592,
        0.0788537859916687
    ]
}