{
    "id": "LZ16tE65AlE",
    "title": "Should AMD Be Afraid? - Intel Alder Lake",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-10-27T17:03:45Z",
    "video_url": "https://www.youtube.com/watch?v=LZ16tE65AlE",
    "category": "Science & Technology",
    "tags": [
        "Intel",
        "Alder Lake",
        "12th Gen",
        "Processor",
        "10nm",
        "Gaming",
        "Performance",
        "Benchmark",
        "Chip",
        "Silicone",
        "FAB",
        "CPU",
        "Z690",
        "ASUS",
        "ROG",
        "WiFi 6",
        "TB4",
        "Thunderbolt 4"
    ],
    "views": 745249,
    "likes": 29472,
    "comments_count": 1579,
    "description": "Buy a Seasonic Ultra Titanium PSU On Amazon:  On NewEgg:   Intel has been taking its lumps from AMD for the last few years, but their new CEO and their newest chip, the 12th-gen Alder Lake, might be the marks for a comeback!  Anthony explains and shows off their latest gear in today's video!  Like Anthony's Hoodie? Get it now at   Buy Intel Core i9-12900k CPU (Once Available) On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy Intel Core i5-12600k CPU (Once Available) On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy ASUS Z690 Motherboard (Once Available) On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------  0:00 - It's ALDER LAKE time! 0:44 - Pressbox unboxing 1:38 - Alder Lake expanded look 2:56 - Alder Lake processor unveil and size comparison 5:27 - Z690 Socket impressions 6:34 - ASUS ROG Z690 Unboxing 7:50 - ASUS Ryujin II 360 cooler 8:44 - Sponsor - Seasonic! 9:04 - ASUS Z690 Maximus Hero Motherboard unboxing 9:20 - DDR5 Notes 10:22 - IO Information 10:49 - Final thoughts",
    "description_links": [
        "https://lmg.gg/SnhUJ",
        "https://lmg.gg/8KV3S",
        "https://lmg.gg/nAZju",
        "https://geni.us/cDPd",
        "https://geni.us/Ry3Oz",
        "https://geni.us/3RPUm",
        "https://geni.us/cJkjKL",
        "https://geni.us/jTSS",
        "https://geni.us/jSsKA2o",
        "https://geni.us/Ovn4YcK",
        "https://geni.us/a32TeW",
        "https://geni.us/kPVKTA",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I've already seen what's in here. Intel's a bit of an underdog lately and it feels great to be able to say that because they've been on top for so long and honestly were (energetic rock music) more or less responsible for stagnation in the CPU industry for so long that it feels really fitting. Today, maybe that changes a little bit because Alder Lake is unlike anything that has come before from anyone. at least in terms of desktop processors. I mean, Apple Silicon is technically similar, but that's not x86 and it's not something you can go out and buy for yourself unless you buy a Mac. So these CPU's are really special. And as a result, Intel decided to send over this here press kit to us in order to kind of drive home that specialness that makes it special. So there's a little magnetic flap here I mean, nobody's gonna have an unboxing experience like this outside of the press so I'm not gonna talk too much about it. And, that's real neat. That says here on the top, built for the next generation of gaming in nice bronzeish coloring and copper. And yeah, we've got this here, CPU. So I guess these are the performance cores, these eights cores around the middle here. (playful music) These look like clusters of efficiency cores, and I'll get into what those are, momentarily. That's really nice, what's on the back? Oh, it's Alder Lake. That's cool. So yeah, the big thing about Alder Lake, it has two different kinds of cores. The performance cores, these big boys here in the middle, and the efficiency cores, these small guys that are in clusters of four on the side here. What that means is that these performance cores can handle your foreground tasks like your games or your 3D renders, that kind of thing. While the efficiency cores can handle your background tasks, things like windows update or a virus scan or even, in some cases maybe like a code compile or something, if you don't really care that much about it. So, that makes it very different from any other x86 processor that has ever existed and very different from hyper-threading too, which is something that we've had for a while. Hyper-threading is supported on these, performance cores, but not on the small boys. It's got a little stand, I think. Yeah. - [Jono] That's cool. - Yeah. See - [Jono] There's a reckon to that. - You can show off Alder Lake or you can show off Alder lake. But it's just us who can show off Alder Lake because nobody else is getting one of these. This is actually like printed on metal. (metal clings) It's quite nice. - [Jono] Can I have it? - Um, no. No, that plank is cool, but there's more under here as well. So, these, are our new CPUs. Core i5-12600K. And the core i9-12900K. Yeah. So full disclosure. There's nothing in this. It is, in here. And the reason it's in here is because I'm already benchmarking it. It's like, what is today? 22nd. Right. And yup. I'm on that, I'm already on it. Yeah, so let's take a look (small box falls) at the core i5 and see what that looks like. It's a really different form factor. Actually um, can you get me a Intel CPU? - [Jono] Yeah. - That makes a lot of sense because the dye is just rectangular shaped, and it's actually a lot longer than it normally is because of those extra cores on the end. And presumably also because of the Intel Xe graphics that's baked into it as well. Okay, this is a core i7-11700K. (cheerful music) And, oh boy, that's actually quite a bit smaller. Is it smaller width wise? No. Just in terms of length. - [Jono] You're making everyone at home really uncomfortable with you sliding the chip like that. - Why? This is not a (sighs). (man laughing) (chips rubbing) - [Group Member] Anthony (man laughing) (Anthony chuckles) - Okay, so the IHS doesn't look significantly thicker, but it is a different shape that makes it look kind of thicker. So like it's pretty much the same height, I think. I think the fact that the IHS has so be so much bigger because it's a bigger chip. It just looks kind of more imposing. So normally on an Intel processor, you'd have these little notches on the left and right when you put it down to kind of lock it into position. Alder Lake, doesn't have that on the left and right, it has it on the top and bottom. So as you're sliding it into the socket, the top and bottom is whats kind of aligns it. Rocket Lake and Comet Lake only had them on the front and on the left and right. That's interesting. I was wondering why it was a little bit easier for me to kind of home this into the socket when I built up this bench here. I guess I'll have to show the socket soon too, huh? Well, let's get this cooler off and take a look. Yeah, that socket looks weird, doesn't it? Okay, let's take these nuts off. What we've got here there are actually two holes on each of these sides. That is because Asus decided to support the previous arrangement. However, the official spacing is (playful music) quite a bit wider. It is that outer bit. Also you'll note on the back, the shape of this is actually different from the shape of a previous LGA socket, obviously, but there's no like little knock down here. It's actually very similar to, what is it similar to? I don't know. Unlike previous LGA is the socket itself. Yes, it's like that. Like the arm has to be so long, um, but it doesn't pop up automatically. It's locking it down this way. So the lever here comes out towards the bottom of the motherboard rather than coming up from the top with the arm. The arm just locks that down in the position. Okay, this is a much bigger box. Um, as you can imagine, I've already been into it, but I haven't opened it properly. So let me open it properly. (kit tearing) Oh. Really? - [Brandon] Go from the other side. - Yeah, the other side kind of already ripped so I can just like stick my finger in there and, (kit tearing) This is an imposing box. and what's under? Ah, it's not a maximus number anymore. It's now a Maximus Z690, which honestly that's a lot easier to keep track of, thank you, Asus. (grunting) Let's put this outta here. Oh, but wait, there's more, look inside. (kit rubbing) Um. Full disclosure, I'm not sure if this hasn't been modified, but as far as I know, this is standard and there's a little card in here. I don't think there's anything else in this section box, but there's another section of the box, which contains (grunts) an ROG Ryujin II 360 with LGA 1700 compatibility. Unfortunately we're not gonna be using that, we're gonna be using our NH-D15 because we have more of those and they're the same, but this is really nice to have. Yeah, this is an update there are kind of three and a half inch full color LCD on this thing. With a 7th gen Asus tech pump, interesting. I'm not sure what that means. Noctua industrial PPC fan. Okay, I'm starting to regret not using this. - [Jono] Oh! - Well, it's not too late, but the thing is I would need more Ryujin II 360s for the rest of our testing platforms so I'm not going to be using it, sorry Asus. But, this is gonna make for some pretty sick builds later on. But it's a 360 millimeter radiator with 120 millimeter fans, and it's got a six year warranty, which is a half of what our sponsor Seasonic can offer you. Seasonic's Prime Ultra Titanium, PC power supply feature ultra high efficiency with their 80+ titanium rating. They're fully modular and they feature hybrid fan control that control overall fan noise with their fluid dynamic bearing fans. They offer up to a 50,000 hour life expectancy along with a 12 year warranty. Check them out at the link below. \"Thank you for reviewing the awesome Asus Z690 motherboard. Please leave an awesome review. Asus NA marketing.\" (energetic music) How generic. It is handwritten and sharpie. - [Jono] Okay. - So, you know somebody actually took their time, the time out of their day to write that. One of the cool things with Alder Lake is the ability for to use a DDR5 memory. And that happens to be what I have right here. This Corsair Vengeance. We also have G.SKILL and this HyperX Fury ram as well. This stuff here is rated for 5,200 megahertz or mega transfers per second, it says megahertz. So, sorry Dr. Katress with 38, 38, 38, 84 timings, which, that's a very different from DDR4, like very different. DDR4 is like in the teens for the first three of those and then in the 30s, maybe for the last one. But there's a lot of interesting things that DDR 5 can do. First of all, it takes the power management interface from the motherboard and puts it on each of these modules. What that lets you do is each of these modules can control its own voltage and that can be baked into the XMP profile. So you can get that overclock dialed in with more voltage on this dim and not so much on this one because it doesn't need it. Let's see, what else do we have here? Right, PCI express 5. Not a thing we can test right now. There's no such thing as a PCI express 5 video card or really any card that I'm aware of, but the slot is there. And the CPU has a bunch of PCI express Gen 4 lanes as well to the chip set and to the storage. So overall IO is going to be a big thing for Alder Lake here. So Alder Lake already exists for sale, apparently. It was listed on Micro Center briefly, and apparently it was sold at a German retailer. So there are actual 12900Ks in people's hands right now. In fact, I wish I had the retail packaging because it looks pretty cool, even as cool as this looks. I would like to have it, but we're gonna have to buy it for that. In order to buy it, we're gonna have to shell out $619 or 669, depending on where you look. - [Jono] Nice. - Nice, which is dangerously close to the 5950X. The 12900K is gonna have a total of 16 cores, eight and eight. So eight performance, eight efficiency along with hyper-threading cores for the eight performance cores. It's gonna be an interesting time. I think AMD is gonna be coming out with something similar in terms of, well, not necessarily IO, but a kind of a lateral thinking kind of thing with their V-Cache their vertically stacked cash on top of their cores in the next little while. For now, we'll just have to wait for the review to see if any of this makes any sense. And you can wait around here for a little bit. Maybe watch some more unboxings that may or may not be more technical. Get subscribed, so you don't miss any in the future. - [Jono] Watch the retro tech stuff. - Retro time! I can't do it, it's retro time because it's not retro time right now, but when it's retro time you'll know.",
    "transcript_keywords": [
        "Alder Lake",
        "Lake",
        "cores",
        "Alder",
        "performance cores",
        "kind",
        "yeah",
        "efficiency cores",
        "thing",
        "CPU",
        "Asus",
        "bit",
        "Core",
        "Intel",
        "performance",
        "time",
        "cool",
        "top",
        "nice",
        "socket"
    ],
    "transcript_entity_values": [
        "619",
        "Alder Lake",
        "Alder Lake",
        "three and a half inch",
        "12 year",
        "IO",
        "i7-11700K.",
        "Intel",
        "Asus",
        "three",
        "One",
        "84",
        "a 360 millimeter",
        "Seasonic",
        "This Corsair Vengeance",
        "LGA 1700",
        "Katress",
        "669",
        "Micro Center",
        "NH-D15",
        "their day",
        "megahertz",
        "Gen 4",
        "Today",
        "120 millimeter",
        "Asus",
        "5,200 megahertz",
        "second",
        "six year",
        "AMD",
        "Asus NA",
        "Alder",
        "80",
        "Alder Lake",
        "IHS",
        "5",
        "G.SKILL",
        "first",
        "Anthony",
        "Comet Lake",
        "Noctua",
        "38",
        "Asus",
        "ROG Ryujin II 360",
        "7th",
        "two",
        "50,000 hour",
        "16",
        "German",
        "four",
        "LCD",
        "Ryujin II 360s",
        "a half",
        "Mac",
        "Xe",
        "Seasonic",
        "PCI",
        "the 30s",
        "Jono] Watch",
        "Rocket Lake",
        "Alder Lake",
        "CPU",
        "First",
        "Prime Ultra Titanium",
        "CPU",
        "eight",
        "Apple Silicon",
        "today",
        "XMP",
        "LGA"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PERSON",
        "LOC",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "FAC",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.12191978842020035,
        -0.012768249027431011,
        0.053253933787345886,
        -0.0031153629533946514,
        0.09712757170200348,
        -0.003977272659540176,
        0.02370285429060459,
        0.03780118376016617,
        -0.03003566712141037,
        -0.009470678865909576,
        0.030643854290246964,
        0.019400296732783318,
        0.030432967469096184,
        -0.06023060530424118,
        -0.02094096504151821,
        0.0015602889470756054,
        0.10402480512857437,
        -0.08327024430036545,
        -0.04451308026909828,
        -0.022005097940564156,
        -0.035097651183605194,
        -0.056251268833875656,
        -0.03463493660092354,
        -0.025776250287890434,
        0.09504446387290955,
        0.012844495475292206,
        0.024346912279725075,
        -0.05769358575344086,
        -0.012121233157813549,
        0.015616918914020061,
        0.004804555792361498,
        -0.003349859733134508,
        0.005091255530714989,
        0.017616435885429382,
        0.0515432171523571,
        -0.07578706741333008,
        0.05613692104816437,
        -0.10526570677757263,
        -0.04061620309948921,
        -0.07609646767377853,
        0.003058680333197117,
        -0.04055044427514076,
        -0.013433137908577919,
        0.07154881209135056,
        -0.015946898609399796,
        -1.150880351019623e-07,
        0.06626766920089722,
        -0.08713693171739578,
        0.00441115815192461,
        -0.0019487377721816301,
        -0.05201445147395134,
        -0.06285601109266281,
        0.029095811769366264,
        -0.053479745984077454,
        -0.07585588097572327,
        0.004476103000342846,
        -0.02194654941558838,
        -0.09379760921001434,
        0.04707725718617439,
        0.03386013209819794,
        0.0317811444401741,
        -0.12252657115459442,
        0.03018704243004322,
        0.08216046541929245,
        0.05382198095321655,
        -0.01990719698369503,
        -0.02236432023346424,
        -0.0602119043469429,
        -0.004422561265528202,
        -0.0027846957091242075,
        0.06728024035692215,
        -0.014510366134345531,
        0.02142300270497799,
        0.02743251994252205,
        -0.0006486816564574838,
        0.0315166711807251,
        0.11810377240180969,
        -0.08141820132732391,
        0.0012511953245848417,
        -0.013169964775443077,
        -0.04642773047089577,
        -0.03870144113898277,
        0.07315488159656525,
        -0.08624514192342758,
        0.02824389562010765,
        0.0012452268274500966,
        0.045431070029735565,
        0.01865873672068119,
        0.011340421624481678,
        -0.09022626280784607,
        0.03362026810646057,
        0.011341453529894352,
        0.06094872206449509,
        0.05609521642327309,
        0.062494371086359024,
        0.06658067554235458,
        -0.0338093601167202,
        -0.04683889448642731,
        -0.06316908448934555,
        0.002476830268278718,
        0.013709108345210552,
        0.06864134222269058,
        0.08082521706819534,
        0.02433232218027115,
        -0.08001123368740082,
        -0.0035998248495161533,
        -0.08162063360214233,
        0.08297529071569443,
        -0.07533475756645203,
        -0.01049019768834114,
        -0.03589963912963867,
        0.011221270076930523,
        0.007960541173815727,
        0.054142486304044724,
        0.01611088030040264,
        0.008238057605922222,
        -0.07361561059951782,
        -0.024286748841404915,
        0.07972363382577896,
        0.01680961437523365,
        0.014897620305418968,
        0.015977833420038223,
        -0.022161269560456276,
        0.07176195830106735,
        -0.032622937113046646,
        0.08017612993717194,
        -0.11735336482524872,
        4.363551845003444e-33,
        -0.00627893814817071,
        0.09350109100341797,
        -0.0755947157740593,
        -0.10815878212451935,
        -0.042446598410606384,
        0.019339805468916893,
        0.024752192199230194,
        0.00982674490660429,
        -0.016090035438537598,
        0.07522255927324295,
        -0.10282199829816818,
        -0.047931477427482605,
        -0.04744778573513031,
        0.05170625448226929,
        0.053452879190444946,
        -0.07492149621248245,
        0.007859784178435802,
        -0.023830043151974678,
        0.014808865264058113,
        0.020088519901037216,
        0.024182194843888283,
        -0.0026811689604073763,
        0.004191962070763111,
        -0.025645527988672256,
        0.0003062369942199439,
        -0.034443486481904984,
        -0.03135693818330765,
        -0.03734750673174858,
        0.05046853423118591,
        0.009236990474164486,
        -0.05211807042360306,
        -0.04420978203415871,
        -0.025297410786151886,
        -0.01573691889643669,
        -0.011188537813723087,
        0.02279796078801155,
        -0.06216732785105705,
        -0.04696939140558243,
        -0.054475173354148865,
        -0.04634055495262146,
        -0.02928849123418331,
        0.12441258132457733,
        -0.09961976110935211,
        -0.013253980316221714,
        0.06481967866420746,
        0.019625011831521988,
        -0.04624321684241295,
        -0.0243753120303154,
        0.0016905826050788164,
        -0.03782166540622711,
        -0.09763335436582565,
        0.029130807146430016,
        0.006431193090975285,
        -0.016836071386933327,
        0.007298430893570185,
        -0.0036366437561810017,
        0.03975781425833702,
        0.009322978556156158,
        0.08803907781839371,
        0.09775876998901367,
        -0.057991527020931244,
        -0.05227433890104294,
        -0.014348270371556282,
        0.04626142606139183,
        -0.08923162519931793,
        0.09199924021959305,
        0.07779250293970108,
        0.027189157903194427,
        -0.0814356654882431,
        0.044307559728622437,
        -0.06591194868087769,
        -0.03235870227217674,
        0.05121546611189842,
        0.030046269297599792,
        0.03759900853037834,
        -0.0006197012262418866,
        -0.044540174305438995,
        -0.024107329547405243,
        -0.004915694240480661,
        -0.08228710293769836,
        0.00794282928109169,
        0.052539024502038956,
        0.056759871542453766,
        0.06673137098550797,
        0.033438101410865784,
        0.025421597063541412,
        -0.017903611063957214,
        0.04924440756440163,
        0.04604208841919899,
        0.00973567459732294,
        0.03242238983511925,
        -0.03950738534331322,
        0.036189161241054535,
        0.03814007714390755,
        -0.018406011164188385,
        -5.4971853726250115e-33,
        -0.0873146578669548,
        -0.06205105409026146,
        -0.06486424058675766,
        0.051713261753320694,
        -0.048002973198890686,
        -0.010998914949595928,
        0.055677227675914764,
        0.008194814436137676,
        0.0043266103602945805,
        -0.08773703128099442,
        0.023731978610157967,
        0.0768963173031807,
        -0.010633030906319618,
        0.0261751189827919,
        0.006631765514612198,
        -0.040125153958797455,
        -0.013483822345733643,
        -0.07087212055921555,
        0.12389091402292252,
        -0.019590681418776512,
        0.10004685074090958,
        0.04543427750468254,
        -0.031118173152208328,
        0.01712740957736969,
        0.004031131509691477,
        -0.0009425371536053717,
        -0.03891967236995697,
        -0.011213643476366997,
        0.014834663830697536,
        0.00044516829075291753,
        -0.02952168509364128,
        0.02297135815024376,
        0.03948301821947098,
        0.03629881888628006,
        0.0520743690431118,
        0.03841056302189827,
        0.03583356738090515,
        -6.781885076634353e-06,
        -0.017953863367438316,
        0.02908260188996792,
        0.06875907629728317,
        0.043845660984516144,
        0.002896964782848954,
        -1.8984281268785708e-05,
        0.028496917337179184,
        0.024209987372159958,
        0.031017402186989784,
        -0.0512227900326252,
        0.030736491084098816,
        0.02482493221759796,
        -0.07351503521203995,
        -0.0701155960559845,
        0.07469421625137329,
        -0.015239482745528221,
        -0.017120903357863426,
        -0.07297728955745697,
        0.011870107613503933,
        0.03808137774467468,
        -0.07298082113265991,
        -0.026113590225577354,
        0.036389630287885666,
        0.03634382039308548,
        0.03870706260204315,
        -0.0626746118068695,
        0.02491414174437523,
        0.010222183540463448,
        0.05690103396773338,
        0.013045637868344784,
        -0.021960599347949028,
        -0.025090370327234268,
        -0.035068731755018234,
        -0.08428753167390823,
        -0.05251458287239075,
        -0.06605643779039383,
        -0.01586809754371643,
        0.009488530457019806,
        -0.007911045104265213,
        0.040344808250665665,
        -0.01861746609210968,
        -0.04692848026752472,
        -0.06677863001823425,
        0.03560628741979599,
        0.02949340268969536,
        0.022541264072060585,
        0.10356491059064865,
        -0.00538667431101203,
        0.03791556879878044,
        -0.032745614647865295,
        -0.03557061776518822,
        -0.0599365308880806,
        -0.09341453015804291,
        -0.0069635044783353806,
        -0.08361617475748062,
        0.02368999272584915,
        -0.04991666600108147,
        -5.068142527875352e-08,
        0.07390168309211731,
        -0.0013883844949305058,
        0.09360555559396744,
        0.03086210787296295,
        0.12758058309555054,
        -0.05015690252184868,
        0.004187137354165316,
        -0.022460248321294785,
        -0.0068587358109653,
        0.04818681627511978,
        0.06205230951309204,
        -0.06761783361434937,
        -0.005721854977309704,
        -0.04705113545060158,
        0.01241160649806261,
        0.06495238840579987,
        -0.04384854435920715,
        0.04216039925813675,
        -0.019605278968811035,
        -0.0851358100771904,
        -0.04904370382428169,
        0.07745223492383957,
        0.06632155179977417,
        -0.042281512171030045,
        -0.012097860686480999,
        0.009082827717065811,
        0.027934882789850235,
        -0.015610743314027786,
        0.08516093343496323,
        0.007354774512350559,
        -0.09285946935415268,
        -0.027929190546274185,
        0.07957971096038818,
        -0.08198689669370651,
        0.0515776164829731,
        -0.04431696981191635,
        0.039668433368206024,
        0.06448645889759064,
        0.11355970054864883,
        0.0020799250341951847,
        -0.052416250109672546,
        -0.019526012241840363,
        0.016484718769788742,
        -0.005472587421536446,
        0.0708879604935646,
        0.040657974779605865,
        -0.05140240117907524,
        -0.14107026159763336,
        0.017147814854979515,
        0.038658469915390015,
        -0.029641717672348022,
        -0.03338323533535004,
        -0.03482852131128311,
        0.07220719754695892,
        0.045728813856840134,
        0.030431998893618584,
        -0.030076920986175537,
        0.0009313107584603131,
        -0.005746087525039911,
        0.06487460434436798,
        0.039356790482997894,
        -0.1547688990831375,
        -0.005069911479949951,
        0.02055884525179863
    ]
}