{
    "id": "M1GP-9Agkso",
    "title": "Buy This Instead - Razer Blade 15 (2022)",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-04-08T18:07:47Z",
    "video_url": "https://www.youtube.com/watch?v=M1GP-9Agkso",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo",
        "razer",
        "blade",
        "laptop"
    ],
    "views": 198021,
    "likes": 4221,
    "comments_count": 305,
    "description": "I want to love the new Razer Blade 15 BUT... Amazon needs to CHILL:  We Tried Netflix Gaming So You Dont Have To:  I SCAMMED Goodwill:  This Should be BANNED:  We Tried WISH for Rich People:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Austin breaks Matts prized possession 0:18 Razer Blade 15 and specs 1:17 One of the best but.. 2:02 Should you buy the max spec? 3:28 Blade has some heat issues 4:30 I want to like this 5:10 Comparison to Macbook Pro 6:15 Screen and keyboard review 7:09 Final thoughts 7:45 What do you think?",
    "description_links": [
        "https://youtu.be/-0xlIlwRrQA",
        "https://youtu.be/-DlpJHcbtHE",
        "https://youtu.be/cvFZdvdEC_w",
        "https://youtu.be/jA_cGZpgYK8",
        "https://youtu.be/sPOu5YN7X94",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- I've broke your slate Matt. - I've had this for 20 years. Hello and welcome to, This Is. Have mobile gaming laptops gone too far or they have not gone too far enough? Austin, may I present to you, - Yes. - The 2022 Razer Blade 15. - Ooh. - On the surface, this looks very similar. In fact, I don't think from the outside you can tell any difference at all between this and the last couple of generations of Razer laptops. They're thin, they're very Mac booky, and they feel generally speaking, nice. We have the fully speced out model of this - A review unit Razer let us borrow by the way cuz we're not gonna spend $4,000 on a laptop - Correct. - Most of the time. - We just wanna, we wanna clarify that so this unit has an I nine 12th gen GPU, a 3080 TI, 32 gigs of Ram, It is a 4K on 144 Hertz display. The ports on this are amazing. It's got USB 3.2. - Thunderbolt. - Thunderbolt it's got a A, it's got C, it's got wifi six E. This thing is an absolute monster. Or a red bull. - I, you beat me to the joke man, you beat me to the joke. - Yeah. - So I'd like to shout out red bull. Thank you very much for providing me lots of entertainment on F1 races. - We are not sponsored by any of these things. We're never gonna make money on this if when you just keep giving away free sponsorships. Look, this thing, one of the best laptops out on the market spec wise. - Yeah. - But, Should you get it? And the answer is probably not. - So, one of the things that just right off the back I think is worth talking about is that the top end configurations on thin and light Razer laptops generally aren't worth it. Not only because they're very expensive, but because with these thin and light chassis, they are very limited by cooling. And regardless if you get this 15 with a 3060, 3070, 3080, 3080 TI they all have about, what's it 105 Watts of GPU - Maximum 105 across the board. - You're gonna hit the law of diminishing returns, which is I even though I have a 3080 in my Blade 14, honestly probably should get like the 3060 or 3070 because you don't see that much additional advantage because you don't have enough power to really kind of let it stretch its legs. It's nice to see that you have this as an option but, just right off the bat, even though you might look at the $4,000 price tag and be like. (hisses) I think it's really worth considering these things from a slightly different perspective of don't max them out, especially because with the 15 or like the 14 you can upgrade the RAM, and it has an additional M2 slot inside that you can just drop a drive right into. 14 is not upgradable RAM. I think you can still upgrade the SSD on it. But, the 15 is a sort of more upgradeable device. However, it is fairly expensive right? - I mean $4,000 for anything is a lot and its. - You're turning 2,500 to $3,000 for what I would consider to be like a reasonable spec. If you were considering buying a razor laptop good general advice is that the low to mid specs are usually where it's at specially when it comes to a 15. You can easily buy this the 2,500, a $3,000 spec upgrade the Ram If you need a little bit more, add an extra SSD. But by spending so much extra on the GPU you're not gonna get that much more performance going from like a 3060 to a 3070 or a 3080 like, the price differences are huge. - We had kind of talked before this that you probably should just do the 14 as opposed to the 15. - Which is about three to $500 cheaper based on the configuration. - Now, if you did want the larger screen, I get it, whatever. The kind of the issue I had with the 15 here it's supposed to be a thin and light form factor, but you're not really getting any of the benefits off of a thin and light after a while because, me using this on a day to day basis it's a laptop, a lap top. Now, I'm not expecting to play AAA games on this thing while on the lap. - You should. - Well I wanna be able to play some games on this. You know, like I like to play like city skylines or watch like a movie or something like that. I would call this, unusable on my lap. - ooh. - Because of how hot this thing got. I'm not expecting to push things at ultra high settings like turn down. - Yeah. But like I was playing balloons tower defense, any phone on the planet can play that game. - Yeah. And this thing was still ramping up and getting a crazy amount of heat on there. It wasn't so hot on my lap. It was hot on my hands. So like, I almost feel like with this device you have to treat this as a full desktop replacement. That just is thin and light in your backpack. But, if you wanna do really anything with this on the go, you should be expecting to bring like a keyboard, a mouse with it. - I'm Looking here just feeling the laptop, which is not doing anything, but it's surprisingly warm toward the palm. - Just like where you naturally would have well like rest your hands on this device. - It's so warm. You don't want to touch this thing. - It's not comfortable to even use the keyboard to me. - That's a problem. - Like I wanna like this form factor. I wanna really like this device but, if it's not physically comfortable to use. - Huge problem especially when you're spending this kind of money. - Razer very intentionally tries to make these, the MacBooks of windows. It's very hard for me not to compare these two because the M1 is cold to the touch constantly. The fan, even at load barely turns on. Whereas, this one playing a minor game starts to ramp up. This laptop is just sitting here idling. And it is very warm to the touch on the back doing nothing but sitting on the windows like a home screen. So yeah, I mean, to be fair Razer laptops tend to be a little warm. Sometimes they are little bit on the louder side which fair enough especially when you got this full CNC aluminum chasis. - Yeah. - There, that is just kind of part of where the heat goes. - It's not like crazy loud on this when you're doing minor task, but the fact that you're doing minor task and it's turning on kind of at all. So like, again, I know it's not a one to one comparison, but like when I'm talking about a thin and light laptop. That's the kind of stuff I want with this. Can I game on the Mac? No, absolutely not. But you know what I can do. I can play those games like city skylines. - Yeah. - On my lap comfortably. I'm not trying to, to say that the MacBook is so much better of a device. It's just that like, once you get a taste of what that life is like, it's so hard to go to anything else that doesn't give you that. - I get your point in that if apple is able to deliver incredibly powerful performance, mind you, a GPU is not gonna touch this but, you've got a lot of performance in a foreign factor which does not have to get loud or hot and whatnot. - Yeah. - And the thing is this is not really something that Razor can truly fix because they can only use the chips that they can get from Intel AMD and Invidia. And, the trend is very much to push for more and more and more performance on higher and higher TDPs. So, I get it. There are some Razery issues when you go this thin, this light and this kind of form factor. I will say though, based on my brief hands on time with this blade 15. This screen is terrific. - Yeah. - So this is the 4K, I believe it's it says 144 Hertz right? - 4K, 144 Hertz. - Looks phenomenal. Although I will say part of your power draw issues and whatnot, refreshing the 4K screen at 144. Probably not doing any favors to your battery life into the overall heat that's being generated. But, regardless, I think. - I'm gonna, and I'm giving the battery life. I'm not saying a pass. Cause it is actually like fairly good battery life with how much it's shoved in this thing. - Yeah. The battery life is not bad at all. - My thought is this right? If you are in the market for a Razer laptop. You know what you're looking for. You want that thin design, you want the Razer sort of aesthetic. Which, I am personally a big fan of I think that Razer make the most handsome gaming laptop as far as from an aesthetic point of view. - We haven't talked about the, you know, the per RGB Chroma. - Yep, absolutely. - That's all great in there. Like we've just come to expect all those like good things from it. I just think that this model. - It's too much - Aint it. - If you go and you buy the maxed out 15 configuration they've turned things up to 11 in a way that has compromised the usability of this device. But that being said, it is a high end Razer Blade gaming laptop. Obviously it's got the most up to date cutting edge specs which you would expect. But, what it is not gonna do is give you any kind of revolutionary experience If you've already been used to using Razer laptops in the past. - I wanna like this laptop a lot. And I don't think that the Blades are bad laptops in any way. I just think this is the configuration that no one should buy. - Yeah. - Get the base model. I think you're gonna be happier in the long run. You're gonna save a lot of money. - But let us know what you think in the comments below. Are you ready to go and shell out your hard earned Razer bucks to buy yourself a new Blade or would you rather buy a G 14, or alien wear or a Matt's special sauce laptop. Let us know in the comments below, make sure to subscribe and we will catch you in the next one. (soft upbeat music)",
    "transcript_keywords": [
        "Razer",
        "Razer laptops",
        "laptop",
        "Yeah",
        "thing",
        "thin",
        "Razer Blade",
        "kind",
        "laptops",
        "light Razer laptops",
        "things",
        "light",
        "thin and light",
        "Blade",
        "broke your slate",
        "GPU",
        "device",
        "Razer Blade gaming",
        "Razer laptops generally",
        "Ram"
    ],
    "transcript_entity_values": [
        "about three to $500",
        "M1",
        "11",
        "F1",
        "3080 TI",
        "one",
        "Razor",
        "Razer",
        "MacBooks",
        "Razery",
        "GPU",
        "2,500 to $3,000",
        "2,500",
        "USB",
        "14",
        "105",
        "AMD",
        "nine 12th",
        "Razer Blade",
        "Razer",
        "3070",
        "six",
        "Matt",
        "4,000",
        "CNC",
        "Hertz",
        "3060",
        "15",
        "RGB Chroma",
        "Austin",
        "3,000",
        "two",
        "3080",
        "Invidia",
        "the 4K",
        "20 years",
        "Ram",
        "3080",
        "4",
        "MacBook",
        "32",
        "144",
        "SSD",
        "Mac",
        "Razer",
        "Intel",
        "a day to day",
        "RAM",
        "2022"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "EVENT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.0636850893497467,
        -0.0445888377726078,
        0.06312088668346405,
        -0.050910696387290955,
        0.06085432693362236,
        -0.021347517147660255,
        -0.03722330555319786,
        0.035138070583343506,
        0.008013357408344746,
        0.07793163508176804,
        0.06327536702156067,
        0.031951360404491425,
        0.006359191611409187,
        0.007951882667839527,
        0.0430721715092659,
        0.053129538893699646,
        0.10538265854120255,
        -0.08438888192176819,
        -0.05829421058297157,
        0.00931479874998331,
        0.0025472603738307953,
        -0.022745007649064064,
        -0.027920639142394066,
        -0.012396151199936867,
        0.012091842480003834,
        0.08174293488264084,
        0.022056257352232933,
        -0.012919324450194836,
        -0.1298428177833557,
        0.024890858680009842,
        0.0234684981405735,
        0.07076204568147659,
        -0.05954103171825409,
        0.02270590141415596,
        0.039771873503923416,
        -0.11754801869392395,
        -0.009507047943770885,
        -0.037479791790246964,
        -0.048179175704717636,
        -0.10105927288532257,
        -0.09400249272584915,
        -0.052914608269929886,
        0.05734202265739441,
        0.05920853465795517,
        0.04159974679350853,
        -0.08877870440483093,
        0.010113215073943138,
        -0.07941339910030365,
        0.07618296146392822,
        0.028095286339521408,
        -0.04090137034654617,
        -0.03709904104471207,
        0.046290140599012375,
        -0.054873593151569366,
        -0.05311289802193642,
        0.08442056179046631,
        -0.015475153923034668,
        -0.0460977703332901,
        0.07784105092287064,
        0.014021186158061028,
        0.09084495902061462,
        -0.10940582305192947,
        -0.07496881484985352,
        0.009557993151247501,
        0.029723402112722397,
        -0.07961666584014893,
        0.03142881020903587,
        -0.06399857997894287,
        -0.032928045839071274,
        0.1178293377161026,
        -0.0008053272613324225,
        -0.012890989892184734,
        0.06528982520103455,
        -0.04267578572034836,
        0.009085545316338539,
        -0.04224622994661331,
        0.029358239844441414,
        -0.06506011635065079,
        0.038552943617105484,
        0.01978808455169201,
        -0.0023696653079241514,
        -0.014185931533575058,
        0.05944471433758736,
        -0.024036463350057602,
        0.020398961380124092,
        -0.060174666345119476,
        0.07587768137454987,
        0.0674964189529419,
        -0.02952280081808567,
        -0.014546383172273636,
        -0.024521123617887497,
        0.0669306293129921,
        0.052298255264759064,
        0.042049504816532135,
        -0.05358315259218216,
        -0.0260552316904068,
        0.017930492758750916,
        -0.044405076652765274,
        -0.04623139649629593,
        0.03221624344587326,
        -0.005653964821249247,
        0.0193192008882761,
        0.08207616209983826,
        0.010991644114255905,
        -0.02061523124575615,
        -0.04224115610122681,
        -0.047613680362701416,
        0.04649265110492706,
        -0.0539376363158226,
        -0.015104549936950207,
        0.0036953960079699755,
        0.04947638511657715,
        -0.10112164169549942,
        0.017304036766290665,
        0.0882687121629715,
        0.04695499688386917,
        0.006696436554193497,
        0.00725874537602067,
        0.1480352133512497,
        0.07850565761327744,
        -0.005733835976570845,
        0.01793384924530983,
        -0.01869877241551876,
        0.03097064420580864,
        0.022998197004199028,
        0.0018686037510633469,
        -0.06652050465345383,
        7.232151851617351e-34,
        0.005933437962085009,
        0.07585711777210236,
        -0.04041985049843788,
        -0.012156525626778603,
        0.03576654940843582,
        0.002472101477906108,
        0.03534075617790222,
        0.07682885974645615,
        -0.01845044456422329,
        0.0019235252402722836,
        -0.0035739000886678696,
        0.017097316682338715,
        -0.06410346925258636,
        0.011750658974051476,
        0.08793894946575165,
        -0.055383630096912384,
        0.022893542423844337,
        -0.013744205236434937,
        -0.08588267862796783,
        -0.0012838710099458694,
        0.018659263849258423,
        -0.028083274140954018,
        -0.0022548262495547533,
        -0.0317840650677681,
        0.0367843396961689,
        -0.0008330263081006706,
        0.015623277053236961,
        -0.009026928804814816,
        0.03558263182640076,
        0.056214407086372375,
        -0.061915021389722824,
        -0.05820425599813461,
        -0.04327747970819473,
        -0.07331734150648117,
        -0.05933413654565811,
        0.031549979001283646,
        -0.05356897413730621,
        -0.059090256690979004,
        0.05888047069311142,
        -0.03386653959751129,
        -0.10058316588401794,
        0.07257725298404694,
        -0.040536221116781235,
        -0.027602532878518105,
        0.05608389154076576,
        0.0419786162674427,
        -0.013039466924965382,
        0.014600589871406555,
        -0.028775600716471672,
        0.0017370051937177777,
        -0.09200568497180939,
        0.03764099255204201,
        0.07786098122596741,
        0.013588108122348785,
        -0.08639504760503769,
        -0.004701180849224329,
        0.06981449574232101,
        0.014646779745817184,
        0.08692729473114014,
        0.06976951658725739,
        0.04464265704154968,
        -0.012436974793672562,
        -0.05401107296347618,
        -0.008923067711293697,
        -0.08779078722000122,
        0.11348719894886017,
        0.08808954060077667,
        0.002747258637100458,
        -0.0665796548128128,
        0.04671328142285347,
        -0.050804007798433304,
        0.014347893185913563,
        0.04724728316068649,
        -0.03239421546459198,
        0.02152393013238907,
        -0.009881190955638885,
        -0.01815071888267994,
        0.00831553339958191,
        -0.10363155603408813,
        -0.04693661257624626,
        -0.026464542374014854,
        0.028506796807050705,
        0.01850799098610878,
        -0.03677117079496384,
        -0.03776029497385025,
        -0.01445738598704338,
        -0.022372491657733917,
        -0.008542409166693687,
        0.018438592553138733,
        -0.01864994876086712,
        -0.07148183137178421,
        -0.051228057593107224,
        -0.005655576940625906,
        0.0542217381298542,
        -0.033354081213474274,
        -1.5884794953997356e-33,
        0.007420605514198542,
        -0.06953966617584229,
        -0.012724134139716625,
        0.0897355005145073,
        -0.03429893031716347,
        -0.003368402598425746,
        -0.016381043940782547,
        0.029801655560731888,
        0.007461319211870432,
        -0.1254812777042389,
        -0.02215917408466339,
        0.06684061139822006,
        -0.014185737818479538,
        -0.06797150522470474,
        0.0032952737528830767,
        -0.03423743322491646,
        -0.0524466373026371,
        -0.10411278903484344,
        0.03624080866575241,
        -0.05369676277041435,
        0.03955048695206642,
        0.08530246466398239,
        -0.008743985556066036,
        -0.029767625033855438,
        -0.021055864170193672,
        -0.03389943763613701,
        0.0008783013909123838,
        -0.04432043060660362,
        0.011197805404663086,
        0.032739706337451935,
        -0.01699240133166313,
        -0.026364751160144806,
        0.07757474482059479,
        0.062012676149606705,
        0.06369022279977798,
        0.010974684730172157,
        -0.015148865059018135,
        0.00375727447681129,
        -0.009283432736992836,
        0.050296347588300705,
        0.0964411273598671,
        0.06056063994765282,
        0.0026471989694982767,
        0.006871703080832958,
        0.010590724647045135,
        0.015868574380874634,
        0.012176132760941982,
        -0.06000831723213196,
        0.07103476673364639,
        -0.02236143685877323,
        0.017377575859427452,
        -0.05989175662398338,
        -0.030558926984667778,
        -0.01734231598675251,
        -0.052179936319589615,
        -0.05868539586663246,
        -0.009269550442695618,
        0.012048807926476002,
        -0.004147087689489126,
        -0.06223592907190323,
        0.019418252632021904,
        0.060897015035152435,
        -0.0043034786358475685,
        -0.02792784944176674,
        0.05825543403625488,
        -0.013060208410024643,
        0.007867499254643917,
        0.013271242380142212,
        0.055196333676576614,
        -0.016193151473999023,
        -0.09969357401132584,
        -0.014978663995862007,
        -0.02912353351712227,
        -0.007680092938244343,
        -0.020946014672517776,
        0.05234353616833687,
        0.05086818337440491,
        -0.02969791740179062,
        -0.04507456347346306,
        0.03210749477148056,
        -0.0010808389633893967,
        0.02449101395905018,
        0.022695576772093773,
        0.020599858835339546,
        0.05862817168235779,
        0.005768599919974804,
        0.05432327464222908,
        -0.01797289215028286,
        -0.03256842866539955,
        -0.020354745909571648,
        0.015697846189141273,
        -0.006047755014151335,
        -0.05407283082604408,
        0.008053869009017944,
        -0.06666797399520874,
        -4.942114273376319e-08,
        0.02160971239209175,
        0.03334159404039383,
        0.02424456737935543,
        0.09190314263105392,
        0.022384734824299812,
        -0.03248707577586174,
        0.051867030560970306,
        -0.014285583980381489,
        0.10505830496549606,
        0.07900930941104889,
        0.04621148481965065,
        -0.05595017969608307,
        -0.010400909930467606,
        0.03276180475950241,
        -0.04506659135222435,
        0.0793459340929985,
        0.0067210569977760315,
        0.05150412768125534,
        0.008184135891497135,
        0.012900530360639095,
        -0.029368750751018524,
        0.05408456549048424,
        0.13809509575366974,
        -0.049868352711200714,
        -0.009091806598007679,
        0.06987418979406357,
        -0.13098393380641937,
        0.020017951726913452,
        0.05534211918711662,
        0.010804473422467709,
        -0.12549282610416412,
        -0.03449970483779907,
        0.04531177505850792,
        -0.004603724926710129,
        -0.014699341729283333,
        -0.11730937659740448,
        -0.042881354689598083,
        0.030283650383353233,
        0.06810730695724487,
        0.04539548233151436,
        0.013363461010158062,
        -0.09972203522920609,
        -0.06282941997051239,
        0.0035010420251637697,
        0.015287896618247032,
        -0.06155163794755936,
        -0.023360267281532288,
        -0.08849573135375977,
        -0.03253091499209404,
        0.060533229261636734,
        -0.0008967511239461601,
        -0.017745666205883026,
        0.006567522883415222,
        0.0306684710085392,
        0.006886277347803116,
        0.042460259050130844,
        -0.045080143958330154,
        0.024994783103466034,
        -0.025132136419415474,
        -0.008088820613920689,
        0.11259616911411285,
        -0.11146082729101181,
        -0.10537713021039963,
        0.09429134428501129
    ]
}