{
    "id": "M4o3E1Yjvp8",
    "title": "Is it worth the premium price? - Sony X95K",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-10-08T21:00:53Z",
    "video_url": "https://www.youtube.com/watch?v=M4o3E1Yjvp8",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 588706,
    "likes": 16863,
    "comments_count": 869,
    "description": "Check out Jackerys Solar Generator 1000 Pro at:   Sony's X95K is a mini-LED TV with wide viewing angles, great colour, a ton of dimming zones,  Dolby Vision, and it works great with the PS5, but does this premium TV stand out against the competition at its high price tag?   Buy Sony X95K 4K HDR Mini LED TV:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 I see you've played knifey-spoony 0:05 Unboxing 0:43 Design impressions and unique feet 3:03 IO, central speaker feature, and cable management 6:50 Grand reveal (and awful peels) 7:01 Do the feet look weird? 7:52 Looking at the remote 8:42 Sponsor - Jackery 9:12 Setup, OS, and picture modes 12:00 Checking out the dimming zones 13:20 Speaker impressions 14:12 Overall impressions 15:19 Outro",
    "description_links": [
        "https://geni.us/aL7Ys",
        "https://geni.us/NYzhXhz",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is a knife and this is the Sony X95K. Ugh. The knife slices, it dices, but the TV can display your favorite content with over 400 dimming zones and a bunch of mini LEDs. Yeah. We're gonna unbox it and see if it's cool. Check out the buttons, the remote, which is new and improved, and maybe the OS. And most importantly, does the chassis look good, because it's got that Sony premium? Did I do this wrong? Knock knock. (hand bangs) Hello? (packaging ruffles) Oh, nice. You certainly can't see the TV with all this crap on it. So let's get it off. (packaging ruffles) (cardboard whistles) All right. She's outta the box, and as you can see it has a checkered pattern kind of backing and it's all plastic. (hand knocks) You might think a premium set like this would have some metal but it doesn't, but at least it makes it a little bit lighter. Parts of it are perforated so some heat can come out. I think I might be looking at some active fans behind this. Not sure though. But what we're here to do is put the feet on. In the box there were two feet. They're very slim and slick. They've got this kind of bronze kind of look to them. Brush, metal finish. I think that this is kind of a versatile color. I think it's gonna look good in a all white kind of Nordic looking room. I think it'll match different wood tones. It seems pretty versatile. It looks good with black and that's what this is, so. Let's get these legs on. There's a number one here. Should I do this without instructions, guys? Now there's actually three different configurations that you can put the legs in, which is pretty cool. You can go narrow or you can go wide, and when you go wide, you can also go low, or you can go high, and that's to accommodate a sound bar, much to my chagrin. Guys, just buy bookshelf speakers please, please. I don't need the extra height for a sound bar because I'm not a sound bar person. I and aesthetically I think the wider looks, it just looks cooler. But the ideal is obviously wall mounted with a cable channel that goes behind the wall so it just has that cordless-like floating look. That's the best. And if you're above a fireplace, which so many people are, just get a pull down mount and then people will forgive you for having a fireplace TV. Look how sucked up the feet are to the screen. Whoa. Depending on how deep set your TV is on the console, you might even just use that taller setting without a sound bar just so it doesn't look weird. 'Cause otherwise, if you're using this, like, sucked up version, you might want to, you might need the TV to be closer to the front edge, but we'll take a look at what that looks like once we get this stood up. You know, I actually think this is my first time screwing something with the LTT screwdriver. Ah. We got it. Wow. I'm pretty surprised with, even what I would describe as a fairly wide console like this, this barely fits on. I was just shy of 55. (tape measure winds) Ow. That's that's pretty far. You're gonna have to have one of those really long, wide IKEA ones. I don't know why they do this. I guess it just has to do with the, the nature of the board. Like if the board is just square like this, you're getting more IO per edge, but convenience wise it'd be better if it was just all on the side 'cause the side IO is just so much easier to access, especially if you wall mount this thing. I used to have a a wall mounted TV that was not on any kind of arm that you could pull out, and I was always just like trying to bend it off the wall, getting like my chrome cast between my fingers, and like literally 25 minutes to try to plug this crap in, and there's no way you're gonna be able to do it from the bottom. The side was a blessing, but if it could all be side that'd be better. On, off built in mic switch. That's interesting. You got HDMI one here and then the remainder of the HDMIs are down here. Number three and four are the HDMI 2.1 that can do 4K, 120 hertz. Then you've got LAN. It probably only supports a hundred up a hundred down, which is lame but that's the standard in the industry. You've got an optical digital audio out. That's good for like toss link. I actually did have to use that before 'cause I had an older AVR. If you have like vintage speakers and stuff that can come in handy. Then they've got a connector for the remote if you wanna have, like, a remote extension for your IR blaster. Then there's a USB, and back up to this side, another USB, a video in, S center speaker in. So this is unique to this TV. It's basically, what it allows you to do is to have a surround speaker configuration. Let's say it's 5.1 or even 3.0. The point is you can have a left and right speaker and then wire this into your AVR as a center speaker. Using your TV as a center speaker. Would I recommend it? Probably not. The reasons why is you're probably not gonna have a good sound match with your left and right speaker. So if a sound pans across the screen, like, let's say it's a car driving by, and it goes (imitates car engine) (engine revs) you might have a timber mismatch, so it does doesn't sound consistent as it switches from one speaker to the next. And the second reason why I wouldn't do that is 'cause the center channel speaker is in some ways the most most important speaker, but it's also kind of the least important speaker 'cause there's such a thing as a phantom center speaker which is just an illusion that your brain makes when you have a left speaker and a right speaker. Your brain just, like, kind of creates a center speaker if you hear sound coming out of left and right equally, you'll think it comes from the center. So I probably just wouldn't screw around adding what are probably bad soundings TV speakers to your mix. Just me. Also another stupid thing about this port. I believe it only supports Sony speakers. I believe you can only, that's why it's S center. So yeah, three reasons to not use that port. Another thing that's in the box is all of these panels which you can use to cover up all this IO. You can see that there's cable management channels here and then you can route the cable out the bottom which is very cool. But let's see how these go on and off. You can route your power cable at the bottom of this. If I was wall mounting this I might just not bother putting this panel on because, especially if you have an arm that's mounted to say, these (indistinct) mounts right here, the arm's right here, you're gonna want the cable to go up the arm. So you might end up just having these sit in a shoebox in a closet for six years 'cause you're not gonna throw 'em out in case you sell the thing at some point, right? And then there's actually these curved ones that belong on this side. (panel clicks) (hand slaps) Honestly, it doesn't really matter what the back of the TV looks like for most people. (sneezes abruptly) But if you are one of those people who has the back of the TV in the middle room 'cause you have like a great room or something like that, this could look worse. (hand slaps) (man scoffs) Ah. That was so climactic. Plus two points to the amount of fun peels they let you have. (tape squeaks) Okay, now I'm finally in a position to evaluate the look of the feet and whether or not I'd use the low or high setting. See what I mean? Like how sucked up that is. It's only like a centimeter or like a half inch off the table. This is as close as it can be to the front unless you have the feet hanging off. So you're gonna have that. I think it's fine if you're kind of at eye level with it, but if it was high up on, like, some kind of mantle or something, you might actually not be able to see the very bottom of the screen and then imagine if you will, if it was really far back you would need to have a deep ass table for that but. Sit on the couch here, Bell. Take a seat. - I love sitting - It looks good? - Yeah. - Looks fine? - [Bell] The feet look smaller when it's farther back. so it looks better. - Interesting. - [Bell] I like big feet. - Mm. Oh. Now I wanna see the new remote. Comes with batteries. They are Sony branded. I would say this is not a very premium feeling remote. It is plasticky. It does have a brushed look on the front. I don't think that's metal though. It has some flex in this direction. But tactility is pretty good. It has four, count 'em, four different streamer specific buttons. Normally you cannot remap these which is annoying for people with kids because if you have kids you know it doesn't matter too much if your kid hits the settings button or the volume button while you're watching something or while their sibling's watching something. As soon as they hit one of these streamer buttons, everything shuts down and the channel changes and then the other kid gets mad and then you gotta stop what you're doing and you got. But they pay the bills with these buttons so that's the way it is. We're gonna turn this puppy on, but first a message from our sponsor Jackery. Thanks to Jackery for sponsoring today's video. Jackery's new solar generator 1000 Pro is their fastest solar and wall charging generator yet. It consists of a Jackery Explorer 1000 pro portable power station and 80 watts solar panels. Plug it into the wall and get a full charge in under two hours, and deliver up to a hundred watts of power thanks to the two 100 Watt power delivery ports. Check out the new Jackery solar generator 1000 Pro at the link below. It rhymes. Ha. Oh cool. I just used the Google Home app. That's a nice thing about this TV's OS being just Android. You don't have to mess around with, like, the LG apps. They don't ask you to use them, but LG apps suck if you do have to use them. I like the option to use the phone. You didn't have to use the phone for setup. There was an option to use the TV but then you've got to use your remote to type stuff, which sucks. Bravia. Yeah, I'm reading this, Sony. I'm reading all of it. I wonder if I even have to agree to all of these. (scoffs) I agreed to none of them. (laughs) That is a dark pattern. Okay, so they have voice recognition, but you remember that switch on the back of the TV? You can toggle with this hardware switch on and off. If you don't wanna the microphone stuff at all just switch it off. Acoustic auto calibration optimizes the audio output of your TV speakers by measuring the listening environment using the microphone on the TV remote control. Sit where you normally do watching TV, hold it at chest level, point it toward your TV and then don't move. (TV beeps) I guess I moved, whatever. All right, here we are. And this looks super familiar to me because I am an Nvidia Shield user and that also runs on Android. So here it is. Now one thing though, is that this TV uses the same SOC as the last year's model. So that's why it's actually running Android 10 and not 11 or 12. Kind of a drag. One thing I wanna check out is some of the settings in terms of the image modes. For picture modes you've got vivid, standard, cinema is gonna be the most color accurate on this display. And you'll note that there's no filmmaker mode. Like, what the heck, Sony? The other brands have filmmaker mode and it's great because it's not just a color profile, it also turns off other things that enthusiasts tend to hate like motion interpolation or motion smoothing. So filmmaker mode is like your best bet, once if you see that on a TV, you just know it's probably the most color accurate and it's not gonna have that other malarkey turned on. Just makes it easier. One of Sony's claims to fame is its SOCs though and it's processing. like its AI picture modes, and sharpening and stuff like that. I and other purists tend to just turn that processing off anyway, so if you're going to do that then that's another reason not to pay a premium for a Sony. For some reason this \"Pinocchio\" thing just creeps me out. Ambient light sensor could be useful if you're in a room where, you know, you're watching your TV day and night, you don't wanna screw with the settings in terms of having it be super bright during the day if it's a sun bathed room, and you want the brightness to be sufficient, but you don't have to change the setting so later that evening you make it dark 'cause it's it's too dang bright and searing your eyeballs, you can just use this ambient light sensor feature where it's gonna read the room, if you will, and adjust accordingly. One thing I wanna talk about though mainly is the technology behind the backlight. The dimming zones and stuff. So let's head over to YouTube and turn on one of those cool dimming zone test videos to see what it looks like. So this TV has something like 425, 435 dimming zones. It's 36 by 12 I believe. So right now we're watching this little dot go around and I can see there's a bit of a halo around it that looks like it's about that big. This TV is kind of a hybrid in that it's a VA panel or vertical alignment, which are known to have great blacks, not known to have great viewing angles, so Sony actually incorporates another layer in their panel stack that kind of helps the viewing angles out. But even still, if you're off axis to any large degree, you're gonna see way more blooming and other artifacts than you will if you're sitting in a more regular position in the front. And keep in mind, guys, that even if you're using an OLED or some kind of futuristic micro LED TV where each pixel is a self missive and can turn right off, you will still have blooming. It's called veiling glare and it'll actually just, it's an artifact of your own eye's lenses. So you could never completely remove it. Don't kid yourself that you're not gonna see any halos if got an OLED, you still will. You'll just see less. On that moon I can see, like, the whole ball is pretty much like this. Try the speakers out here. - [Nick Fury] There was an idea. - Oh boy, that's tinny. - [Tony Stark] To bring together a group of remarkable people. - It's like they're talking to me through a tin can. (Music on TV peaks) Oh boy. All right. There's obviously zero bass, but that's par for the course of the TVs 'cause people want thin TVs, you just can't get enough speakers in there. It doesn't sound great. Get a sound bar, it'll help it be more hearable, understandable, comprehensible. (chuckling mischievously) Now be aware, guys, as far as HDR and this does support Dolby Vision HDR, you will get better backlight performance out of the larger versions of this TV, as they have more dimming zones. The 75 inch has 600 dimming zones and the 85 inch has 768 zones. So even accounting for that size, it's more zones per square inch. So my overall impressions with this TV and this picture quality is it's fine. It's a nice TV. It's gonna be nicer than a lot of people's TVs out there, but it just really comes down to a value. This thing typically retails for 2,800. You can get it for 2,300, but at that price point you can get one of the entry level LG W OLEDs. You might even be able to get a C series for that. And if not, you could always go down to a B 'cause there's really not much difference with the B's unless you're watching sports in a really bright environment, maybe there's an argument to make for a brighter, full array of local dimming LCD. Although if you really wanna go large and have the 85 inch, it's gonna be cheaper to not get an OLED in that case, and if you really want a premium set I would go for a QD OLED from Samsung display. If you are into the LCD's and you want a mini LED, you can get a value one from TCL. They're already on their third generation mini LED and this is Sony's first generation of it. So I just don't see myself going for this TV. I'm either gonna go for a cheaper but still good mini LED, or if I'm gonna pay this premium price, I'm gonna get an OLED. All right, so thanks for watching, guys. If you like this video, hit like, hit subscribe, and check out our other content covering displays. We've got a lot of TV reviews and monitor reviews too. In fact, we covered those QD OLED's on this channel and our sister channel, Last Tech Tips. Check it out. Oh look, the earth.",
    "transcript_keywords": [
        "speaker",
        "kind",
        "Sony",
        "center speaker",
        "thing",
        "sound",
        "speakers",
        "sound bar",
        "OLED",
        "center",
        "good",
        "wall",
        "people",
        "dimming zones",
        "zones",
        "feet",
        "remote",
        "dimming",
        "watching",
        "supports Sony speakers"
    ],
    "transcript_entity_values": [
        "two feet",
        "the day",
        "three",
        "25 minutes",
        "One",
        "425",
        "Bravia",
        "zero",
        "4",
        "one",
        "Number three",
        "USB",
        "Jackery",
        "a hundred",
        "VA",
        "Nvidia Shield",
        "Pinocchio",
        "Bell",
        "Brush",
        "100",
        "YouTube",
        "2,800",
        "SOC",
        "second",
        "LTT",
        "AI",
        "768",
        "600",
        "11",
        "IO",
        "120 hertz",
        "Nordic",
        "today",
        "Dolby Vision",
        "QD",
        "Samsung",
        "LAN",
        "under two hours",
        "LG",
        "third",
        "the last year's",
        "first",
        "Sony",
        "IKEA",
        "3.0",
        "2,300",
        "TCL",
        "two",
        "Jackery",
        "Android",
        "Nick Fury",
        "Tony Stark",
        "four",
        "400",
        "Android 10",
        "LCD",
        "The 75 inch",
        "85 inch",
        "1000",
        "a hundred watts",
        "12",
        "36",
        "2.1",
        "55",
        "six years",
        "80 watts",
        "Google Home",
        "the 85 inch",
        "5.1",
        "IR"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.04615363851189613,
        -0.026498571038246155,
        0.02400766871869564,
        -0.08347558975219727,
        0.11568467319011688,
        0.06765414774417877,
        0.02076033130288124,
        0.05600418895483017,
        -0.009196886792778969,
        0.04370668902993202,
        -0.06291929632425308,
        0.02760598063468933,
        0.012271026149392128,
        -0.020814310759305954,
        0.020513635128736496,
        -0.014701987616717815,
        0.0853923037648201,
        -0.0827140137553215,
        -0.02652905136346817,
        -0.015672903507947922,
        -0.03043554164469242,
        -0.07872533798217773,
        -0.03393053635954857,
        -0.03908924385905266,
        0.05767935514450073,
        -0.01778555102646351,
        0.015548178926110268,
        0.005260704085230827,
        -0.028583070263266563,
        -0.01661519892513752,
        -0.06232697516679764,
        0.07444131374359131,
        0.006694392301142216,
        -0.03834696486592293,
        -0.027302809059619904,
        0.005657351575791836,
        0.001972892787307501,
        -0.06697823852300644,
        -0.12404116988182068,
        0.02054842747747898,
        -0.0025765772443264723,
        -0.0756354033946991,
        -0.07252264767885208,
        -0.022703230381011963,
        -0.034580957144498825,
        -0.011954035609960556,
        0.017481127753853798,
        -0.05562048405408859,
        -0.022580258548259735,
        0.007493794895708561,
        -0.011902647092938423,
        -0.05154725909233093,
        0.03512488678097725,
        -0.03115926869213581,
        -0.0369831919670105,
        -0.011554631404578686,
        -0.03428029641509056,
        -0.024077503010630608,
        0.05603057146072388,
        -0.07444850355386734,
        0.03411397337913513,
        -0.06190468743443489,
        -0.01790028251707554,
        0.06257522851228714,
        0.0013736924156546593,
        -0.008937027305364609,
        -0.007013125345110893,
        -0.005221104249358177,
        -0.017959797754883766,
        -0.033962447196245193,
        -0.05152881518006325,
        0.08427633345127106,
        0.07989544421434402,
        0.0356682687997818,
        -0.032297663390636444,
        0.004055671859532595,
        0.11055923998355865,
        -0.10411591082811356,
        0.025817018002271652,
        0.013362913392484188,
        0.03131290152668953,
        -0.015068365260958672,
        -0.15371102094650269,
        -0.0066150277853012085,
        0.01890726573765278,
        -0.022108184173703194,
        0.06433756649494171,
        0.006147478707134724,
        -0.043654367327690125,
        -0.0569719560444355,
        -0.00957438349723816,
        0.03604528307914734,
        0.044609639793634415,
        0.00857845414429903,
        -0.09196800738573074,
        0.01538811158388853,
        -0.06270336359739304,
        -0.09205936640501022,
        -0.06403348594903946,
        0.05963724106550217,
        0.03735079988837242,
        0.0008902173722162843,
        -0.03773055598139763,
        -0.0655745267868042,
        -0.06021319702267647,
        -0.13404934108257294,
        0.028144797310233116,
        0.0647820234298706,
        0.012092025019228458,
        0.025980794802308083,
        -0.09430883824825287,
        0.04282034933567047,
        -0.0670085921883583,
        -0.019209690392017365,
        0.017666274681687355,
        0.0472111813724041,
        0.011857198551297188,
        -0.03474408760666847,
        0.061160098761320114,
        -0.08647987991571426,
        0.022568905726075172,
        -0.05575856566429138,
        -0.006747737526893616,
        0.07887175679206848,
        0.016686266288161278,
        -0.06246689707040787,
        -0.03226594254374504,
        2.1423412094385037e-34,
        -0.09812464565038681,
        0.10095473378896713,
        -0.00940227322280407,
        -0.12913760542869568,
        0.008874310180544853,
        0.023702526465058327,
        0.029910501092672348,
        0.09748026728630066,
        -0.024678906425833702,
        -0.0033895354717969894,
        -0.017228830605745316,
        0.022869525477290154,
        -0.028246307745575905,
        0.03225310519337654,
        0.03380442410707474,
        -0.05786757171154022,
        0.03495115414261818,
        0.044414862990379333,
        -0.09091515839099884,
        0.036976855248212814,
        -0.05390976741909981,
        0.0024286150000989437,
        0.010430777445435524,
        -0.010077647864818573,
        0.027080565690994263,
        0.008418736048042774,
        0.03472262620925903,
        0.005071345716714859,
        0.05429133027791977,
        0.025065535679459572,
        -0.061201032251119614,
        -0.017847228795289993,
        0.02343648299574852,
        -0.03390073776245117,
        -0.009471660479903221,
        0.02416931465268135,
        -0.04466521367430687,
        -0.02386782132089138,
        -0.0013326206244528294,
        -0.00010412750270916149,
        -0.04530582204461098,
        0.0865098387002945,
        -0.10611454397439957,
        -0.01589561440050602,
        0.0313253216445446,
        0.07571684569120407,
        0.032741133123636246,
        0.0026063548866659403,
        -0.07642681151628494,
        -0.04222901538014412,
        -0.022444933652877808,
        0.03659024089574814,
        -0.1091533973813057,
        0.016212409362196922,
        0.06993668526411057,
        -0.06166253983974457,
        -0.019577864557504654,
        -0.0021093138493597507,
        0.029943905770778656,
        0.0018751447787508368,
        0.08081625401973724,
        0.007771169766783714,
        0.012276314198970795,
        -0.03304889798164368,
        -0.12861818075180054,
        0.08006934076547623,
        0.13122498989105225,
        0.027048863470554352,
        -0.043847206979990005,
        -0.05233335494995117,
        0.027252331376075745,
        0.013480190187692642,
        0.031991466879844666,
        -0.05139370262622833,
        0.026718715205788612,
        0.04891502857208252,
        -0.03424831107258797,
        -0.01450904831290245,
        0.05804082378745079,
        0.06962242722511292,
        -0.009984192438423634,
        0.01734818145632744,
        0.04587632417678833,
        -0.0010829881066456437,
        -0.018658196553587914,
        0.09946229308843613,
        0.08368244022130966,
        0.005070739891380072,
        -0.10344472527503967,
        -0.025204306468367577,
        0.03769340366125107,
        0.019041411578655243,
        -0.047732818871736526,
        -0.021741217002272606,
        -0.04639742895960808,
        -3.1169577183716706e-33,
        0.016307489946484566,
        -0.0021508957725018263,
        -0.03140432760119438,
        -0.028170673176646233,
        -0.026579635217785835,
        0.011344916187226772,
        -0.038351427763700485,
        -0.05785679817199707,
        -0.011179914698004723,
        -0.0007950197323225439,
        0.012906030751764774,
        -0.007998884655535221,
        -0.08112062513828278,
        -0.004936876706779003,
        0.008604556322097778,
        -0.07329496741294861,
        0.014426486566662788,
        -0.04431679844856262,
        0.050587672740221024,
        -0.05855999141931534,
        0.11610522866249084,
        0.09669984132051468,
        -0.012540251016616821,
        0.05485900118947029,
        -0.002918100915849209,
        -0.007908823899924755,
        0.022479545325040817,
        0.09488976746797562,
        -0.03991364315152168,
        0.0249900184571743,
        -0.042511235922575,
        -0.0550658144056797,
        -0.02994387224316597,
        -0.07486318796873093,
        0.037796251475811005,
        -0.02004014141857624,
        0.056512195616960526,
        0.06325549632310867,
        -0.04912782832980156,
        -0.0015993166016414762,
        -0.03703814372420311,
        -0.007779715117067099,
        0.027738768607378006,
        -0.005528939422219992,
        -0.0038860177155584097,
        -0.057825274765491486,
        -0.009261349216103554,
        -0.02214326523244381,
        0.11161904036998749,
        0.02465023472905159,
        0.008512026630342007,
        0.006592811085283756,
        0.009314893744885921,
        0.02495097555220127,
        -0.06580349802970886,
        0.0035438768099993467,
        -0.08703731000423431,
        0.12169487774372101,
        -0.001270681619644165,
        -0.06621696799993515,
        -0.005325470119714737,
        0.013379165902733803,
        -0.01880590245127678,
        0.008217450231313705,
        0.025843806564807892,
        0.010660691186785698,
        0.13676293194293976,
        -0.028029173612594604,
        0.03995499014854431,
        -0.05510767921805382,
        -0.02124639041721821,
        -0.08919648081064224,
        0.007080186624079943,
        8.08878248790279e-05,
        -0.027612565085291862,
        0.08521942049264908,
        0.04077037796378136,
        0.05079502612352371,
        0.047329820692539215,
        0.02121184580028057,
        -0.06534276157617569,
        -0.005162282846868038,
        0.06780671328306198,
        -0.031083080917596817,
        0.01321323774755001,
        -0.05432595685124397,
        0.02742903120815754,
        -0.04545014351606369,
        -0.03269568458199501,
        0.08564803749322891,
        -0.02885063737630844,
        0.03533392399549484,
        -0.03611692786216736,
        -0.016526030376553535,
        0.05660144239664078,
        -5.259866497908661e-08,
        0.009365612640976906,
        -0.02894464321434498,
        0.027745328843593597,
        0.006355511490255594,
        -0.05523564666509628,
        -0.09634135663509369,
        -0.0032816375605762005,
        -0.014153077267110348,
        0.06104486063122749,
        0.012549111619591713,
        0.06865378469228745,
        -0.07481709122657776,
        0.016046658158302307,
        0.041996974498033524,
        -0.03211136534810066,
        -0.023976216092705727,
        0.03398868069052696,
        0.05296036973595619,
        0.005593004170805216,
        0.03432596102356911,
        -0.0163358636200428,
        0.07311797887086868,
        0.04156426340341568,
        -0.09591598808765411,
        0.004011127166450024,
        0.06789945811033249,
        -0.021473541855812073,
        -0.021244138479232788,
        0.09530270099639893,
        -0.1201738715171814,
        -0.052829310297966,
        0.04218118637800217,
        -0.003983025439083576,
        -0.020788120105862617,
        0.05888158082962036,
        -0.019273683428764343,
        -0.08983764797449112,
        0.041623715311288834,
        0.0351136177778244,
        0.051009710878133774,
        0.014696359634399414,
        -0.09005574136972427,
        0.013053322210907936,
        0.023911630734801292,
        0.04913047328591347,
        0.02261081151664257,
        0.02808495983481407,
        -0.10257052630186081,
        0.006933469325304031,
        -0.007928065955638885,
        0.003370520658791065,
        0.09129959344863892,
        -0.023479338735342026,
        -0.060760777443647385,
        0.029783716425299644,
        -0.010104131884872913,
        0.03477085754275322,
        0.02383434772491455,
        -0.08113688975572586,
        0.08410924673080444,
        -0.009892860427498817,
        -0.10555814951658249,
        -0.061674490571022034,
        0.12593229115009308
    ]
}