{
    "id": "m7m5u7_2x2o",
    "title": "MaxWatch: Knock-Off Apple Watch Scam (Kinda) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-10-08T20:14:58Z",
    "video_url": "https://www.youtube.com/watch?v=m7m5u7_2x2o",
    "category": "Science & Technology",
    "tags": [
        "MaxWatch: Knock-Off Apple Watch Scam (Kinda) - Krazy Ken's Tech Talk",
        "MaxWatch",
        "Apple Watch",
        "Apple Watch Series 6",
        "Apple Watch Knock-Off",
        "Knock-Off Tech",
        "Scam",
        "Cheap",
        "watchOS",
        "Apple",
        "Tech",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan"
    ],
    "views": 303133,
    "likes": 9573,
    "comments_count": 690,
    "description": "Be one of the first 200 people to sign up with this link and get 20% off your subscription with Brilliant.org!   The MaxWatch is an Apple Watch knock-off, but is it fully a scam? Not exactly. There's some redeeming qualities here, but there's some misleading messages coming from the companywhich makes this cheap product turn deceitful.  Watch my Apple Watch Series 6 first impressions   Support our channel and get cool stuff   Watch more knock-off / scam episodes   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - MaxWatch: Knock-Off Apple Watch Scam (Kinda)   Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://brilliant.org/computerclan/",
        "https://bit.ly/clan365XstU",
        "https://Patreon.com/KrazyKen",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Sponsored by Brilliant. (mouse clicks) (electronic tone) Hey, buddy. You wanna buy a watch? Trust me. They're all legit. (electronic upbeat music) Hey, guys. How are you all doing? Really? That's just great. You know, I'm doing pretty great today too. If you're new here, welcome. My name is Krazy Ken and lately I've been dabbling in knockoff products and tech scams like the Blaux Portable AC, the Lit Mobile Solar Charger, the Open Core computer, Pokemon muscle show for big boy. Wait, what the hell? And now I wanna look at smartwatches because Apple just released the Series Six and it is freaking awesome. I love it. But I was wondering, can I get something for dirt cheap and thanks to Freezing Bear, I found Max Watch. It looks just like a freaking Apple Watch, I mean, from a distance, you really couldn't tell so hey, it looks like it. It's cheap. Oh, that's gotta be legit. Right? Let's take a look at who Max Watch actually is and what they are. And then we'll compare this to a real Apple Watch, a First Gen and a Series Six. Max Watch is a- I'm not really sure what entity they are but we'll just say company that sells knockoff and look like Apple watches. Their website is operated by Commerce Core UAB in Lithuania, located on that street. On their website, you can claim your BS discount and buy a Max Watch for only $49.99, valued at $76.91. Their checkout process is laid out very similarly to the Blaux guys. So I'm guessing they're using some similar server sites software here. And frankly, that's about all I know about them, at least in terms of their backstory and history. So, I haven't seen any annoying ads pop up about Max Watch or anything, unlike what happened with the Lit Mobile saga. So, what exactly was it that tripped my radar? Well, it was the product images on the website. For starters, the product images give off an Apple-esque vibe, mainly because the product itself is designed to look like an Apple Watch. I'm sure the engineers knew exactly what they were doing. In reality, it has a cheap plastic case in a very, very subpar display. But in the product photos, it looks semi-legit, like an actual Apple Watch, especially to the untrained eye. So, originally I was like, whatever, this is just some cheap fitness tracker, just, you know, move on no big deal but my BS detector would not shut up. So something else was wrong. So I kept digging. On their website, I saw product images which looked eerily similar to Apple's watchOS software. And by eerily similar, I mean direct rip-offs. This is Apple's heart rate monitor, their move ring, their music player, their messaging interface, even their call interface. Ah, okay. They wanna play a little dirty now. Okay. I get it. Well, two can play at that game. Ow! Not only does it show Apple software, it shows what looks like Apple hardware. Now, they never show the digital crown which is a key distinguishable feature of the Apple Watch but they show other attributes like the edge to edge display. Yes. That's something you get with the Apple Watch but that's nowhere near what the Max Watch is. The Max Watch display is a small square and high definition, yeah, I don't think so. The rainbow speckly effect is all over the display. It's very low quality and the software renders many of the shapes and UI elements with lots of jagged curves. So, the overall quality is just crap but don't worry, it's premium quality guaranteed. And they say that with another stolen screenshot from Apple's watchOS. Yeah. I've said this before, but I'm gonna say it again. If you're gonna sell a cheap or crappy product, just sell the cheap or crappy product. There's nothing wrong with offering a cheap alternative to something that's a little more premium. That's okay. The problems start when you begin faking the images on your website, because now you're teetering on false advertising. At least, they're not overcharging too much for what this thing is. I mean, the Blaux guys were charging through the roof for their product. 50 bucks for a cheap fitness tracker, I don't think is horrible. But yes, you could also go to Alibaba and get the same thing for $4.50 but, shhh, don't tell anyone. Now due to the inconsistent images on their website, I couldn't actually tell what the watch truly looked like, from a hardware perspective and a software perspective. So, I tried going to their social media to see if I could find any lifestyle photographs. Sure enough. I found some, but of course, they didn't do a great job at featuring the watch. The watch is either slightly out of frame or it's out of focus. But thankfully, I found some less exciting photos which showed exactly how it looked. And the big telltale sign that I was looking at this particular knockoff, was this little circle at the bottom of the screen. Truth be told, that little circle down there was the huge deal breaker that made me really, really, really dislike this product. I had low expectations for it but that stupid thing brought the expectations even lower. But my BS detector still wouldn't shut up. So, something else was still wrong. So I decided to do some more digging and even give the company a call. But before we get into all that stuff, I wanted to thank everyone, who's been watching my show lately because this show, Krazy Ken's Tech Talk, it's actually kind of new. I only started it about eight months ago but in that short amount of time, it has outgrown everything else I've ever hosted on this channel. And I'm a firm believer in my holistic approach to education. I don't just teach the what, I teach the why. If you learn what a concept is, that's a good start but then you only learn what that one concept is, nothing else. But if you learn the why, if you learn why that concept is the way it is then you can identify other concepts in the future and self-teach yourself. And that is why I have partnered with Brilliant. Watching informative videos online is a great start, but it is passive. So, the best way to build on top of those skills is to do something active. And I've been running this tech channel for years. So, I know tons of people who come here are techies or there are people who are at least curious about tech and that's great because it all starts with curiosity. So, here's a couple of computer related courses that Brilliant offers. Think about artificial intelligence. How does that work? How does the iPad's neural engine work? How can it use machine learning to teach itself things and recognize handwriting? Brilliant has interactive courses which help you understand, how artificial neural networks work. And it's interactive. It's not just some sit and get lecture. Brilliant can also help you learn about search engines, quantum computing, computer memory and even cryptocurrency so you can master that Bitcoin craze. And then once you master that and make some moolah, you can learn about casino algorithms and take that moolah to the casino and make even more money. Okay. I'm mostly joking now, but you get the idea. So here's the deal, click the link in the description and you can sign up completely for free. But if you're one of the first 200 people to click the link, you can get 20% off of an annual Brilliant premium subscription, which offers a lot more than the free version. And when you do sign up through that link, you'll also be supporting the computer clan. So, thank you for your support and thanks to Brilliant for sponsoring this episode. All right. So back at it. While I was investigating the Max Watch some more, I found a couple of reviews that claimed it wasn't a scam. While I was watching Freezing Bear's breakdown of other sketchy products, I came across a channel called Patricia Scam Reporter, which for some reason has 14,000 subscribers, which is ridiculous for a channel that posts content like this. - [Robotic Voice] Hello, I am Patricia. You are watching Patricia Scam Reporter. Guys, welcome back here on Patricia Scam Reporter. Daily, I am talking about all type website reviews. So, today we are talking about Max Watch. - [Ken] I agree Tom, worthless video. In addition to that video, I found these articles defending the Max Watch. To an extent, I kind of agree. The product isn't really a scam. It's just a cheap knockoff. The main problem I have is them stealing Apple screenshots and some product photos and putting them on their website. So, for all intents and purposes, we'll just say it's a semi-scam. However, the articles are full of clickbaity special offers. And I honestly think the writer was really confused when making this because, Abigail, embedded a video on the article and it's not even about the product she's talking about. It's about a completely different watch brand that just happens to have the same name. - Today, I'm going to explain Max Watch website review that it is legit or a scam. - Those reviews felt incredibly fakey. And pretty much any time you see those flashing clickbaity things on a review, it's probably a load of crap. But even though that was raising a bunch of red flags, I still bought one, of course. Why? One, for science and two, so you don't have to. The purchase process was incredibly annoying because I kept getting hit with upsell after upsell with more of those fake scarcity countdown timers and, oh, look an AirPods knockoff, how original. And they have a 4.6 average rating. Seriously though, how come all of these questionable scam products have a 4.6 rating? What? Anyway, one thing that caught my attention was this attention box. \"We are constantly suffering damages\" \"due to transaction dispute fraud.\" \"When buyers request for a dispute,\" \"even when they have received products\" \"or before the delivery date is due,\" \"this is considered fraud.\" I'm sure this company knows a thing or two about fraud. Now, they're probably posting that because they have experienced that problem. But it was probably not from people being malicious. It was probably from people, who legitimately weren't receiving the product. I'm just guessing. Don't take that as gospel. Maybe these guys are better, but I do know there are companies that do not reply to anybody. With Lit Mobile, I didn't hear back about that purchase ever. I never received the product and I never heard back from a single person at the company. I had to dispute the charge with my bank. But on the other hand, there are people that do a better job, like with Blaux. Those people actually picked up the phone. Those people actually answered their emails. Heck, they even reached out to me before I sent my first email, if I recall correctly. So, there's good people and bad people in this space. We'll see how well they handle a refund cause I'm definitely not keeping this thing. So, I bought the thing and later I got an email saying it shipped. But according to their tracker, it didn't. Well, at least I can enjoy a nice picture of a cactus. To their credit, it arrived in about two weeks. That's pretty freaking awesome. The Lit Mobile Solar Charger never arrived. And the Blaux took two months to arrive. and when it did get here, it wasn't the one I ordered so, two weeks, not too bad. All right. So now let's pit the knockoff Apple Watch against a real Apple Watch, Series Six. And also for fun, why not? Let's pit it against the First Gen Apple Watch too and just see how much you're missing out on, when you cheap out. Back to this tiny circle. The big deal breaker for me was the stupid little touch sensitive button. I knew this thing was cheap, but I thought it, at least, have a touchscreen. Boy, was I wrong. The only way to interact with this device is by touching the button and it's incredibly tedious. A single tap simulates a swipe and a long press simulates a select action. On the Apple watches, you have a touchscreen, a side button, a digital crown for scrolling, which also functions as a button. This combination works a lot better to make the user experience great. And that's much better than a single button. In fact, the Max Watch kind of reminds me of the Mac teeny. - Rata tat tat. (crowd laughing) - [Ken] On the max watch, like I said before, the display is trash. Despite their website saying high definition and showing an edge to edge display, it's none of that. It's a small speckly display and the software renders many graphics and low resolution. By the way, many of the screenshots of software I see on the website, I can't even get on this watch. Maybe there's third party ways to change that. But with all the stock stuff in here, I can't see anything that looks like some of these screenshots, let alone the Apple screenshots they stole. Weird. But yeah, the display is crap. Even the First Gen Apple Watch has a higher quality display. Also with Max Watch, you don't have inductive charging. You have to strip off the band and then awkwardly plug this USB connection into a port. But I mean, honestly, hey, you get what you pay for. I didn't expect inductive charging on a $50 watch. You also don't have Raise to Wake. So, you have to touch the button each time you wanna see the display or even read the time. Really, the only semi-redeeming qualities I found from the Max Watch were the fitness features. I noticed the step tracking and the pulse monitoring worked decently for such a cheap device, but I wouldn't rely on this watch for anything much more than that. And as you may expect, even though it does feel lighter, it's just cheap plastic. They make it look kind of like metal, especially in the product photos but it's just cheap plastic and the band is poor quality. Like, this lays flat. Like you can't even, like you can't even get this thing to lay flat. And this pin for when you snap it all together, it's loose. So, one time I was putting this thing on my wrist and I fastened it together and my skin got pinched under this, like metal pin here. And that hurt a little bit. You're design shouldn't hurt the user. So yeah, pretty crummy design. Honestly, you're better off getting an older Apple Watch First Gen on eBay. It's about the same price as a brand new Max Watch. And even though it's older, I still think it works a lot better for about the same price. Plus, you get a much higher quality design, a much higher quality display, the digital crown, inductive charging, a bigger app ecosystem, a much more pretty user interface, Raise to Wake, so when you lift your arm up, the screen turns on. So honestly, if you don't have a ton of money, but you want a smartwatch, I implore you do not get these knockoff things. Just get an older Apple Watch first-gen, Series 1 whatever you wanna get just, don't get these knockoff things. You're not gonna like them. And if you honestly wanna try them, go ahead, let me know what you think. I'm curious. So, now let's give these guys a call and see if anybody on the phones is aware of the BS they have on their website. And while I'm at it, let's try to get a refund. - [Woman] Hi there. You have now been connected to our customer service. Please hold and one of our amazing support agents will answer your call as soon as possible. - [Man] Why was I billed? How do I cancel my order? Can I get a refund? - [Woman] We do apologize but we are currently experiencing a high volume of calls. Please do not hesitate contacting us via support email provided on our website and we will be in touch within couple of hours. We do apologize but we are currently experiencing a high volume of calls. Please do not hesitate contacting us via support email provided on our website and we will be in touch within couple of hours. - [Ken] This probably doesn't go anywhere. There's no person on the other end of this. (phone beeping) They hang up on me. Well, that was a load of help, wasn't it? Thank you very much 24/7 customer service. But wait a minute, I called the number on the website and the confirmation email I received when I purchased this, there was a different phone number. Let's try that. - [Man] The service you are attempting to use has been restricted or is unavailable. (bleeping) - So, I did what the first call said. I just contacted them via email, asking for a refund and we'll see what they say. Now, don't worry. I still wanna pry a little bit and see if they're aware of the fake images they're putting on their website. But I wanna open up with a more standard question, just to kind of warm up the conversation a little bit and then I'll see if I can actually get an answer out of them. But that's probably gonna take a little bit. So while we're waiting, I have plenty of other episodes coming soon about new tech products, rare tech and lots of other awesome stuff. So, make sure you're subscribed and stay tuned for that, so you don't miss it. Also, if you have any other recommendations for knockoff products or tech scams you want me to look into, feel free to let me know in the comments below because I love looking into that stuff. Also, if you have any opinions about the Max Watch or you tried it yourself, let me know about those two. And if you'd like to support this channel plus get some awesome perks, check me out on Patreon and feel free to pledge if you'd like. Thank you in advance for your support. If you like this episode, you know what to do. Thanks for sticking with me, catch the crazy and pass it on. (electronic upbeat music)",
    "transcript_keywords": [
        "Max Watch",
        "Apple Watch",
        "watch",
        "Gen Apple Watch",
        "Apple",
        "older Apple Watch",
        "real Apple Watch",
        "Max Watch website",
        "Max",
        "knockoff Apple Watch",
        "Max Watch display",
        "freaking Apple Watch",
        "found Max Watch",
        "product",
        "Max Watch kind",
        "website",
        "actual Apple Watch",
        "Apple Watch firstgen",
        "cheap",
        "Gen Apple"
    ],
    "transcript_entity_values": [
        "Bitcoin",
        "Patricia Scam",
        "USB",
        "Tom",
        "Ken",
        "the Max Watch",
        "200",
        "third",
        "the Series Six",
        "two months",
        "4.50",
        "1",
        "Alibaba",
        "Blaux",
        "Lithuania",
        "a minute",
        "years",
        "an Apple Watch",
        "The Lit Mobile Solar Charger",
        "two",
        "the Blaux Portable AC",
        "Apple",
        "a Max Watch",
        "Robotic Voice",
        "max",
        "eBay",
        "Freezing Bear's",
        "14,000",
        "50 bucks",
        "the Open Core",
        "AirPods",
        "Commerce Core UAB",
        "Mac",
        "two weeks",
        "iPad",
        "Patreon",
        "4.6",
        "today",
        "Krazy Ken",
        "Krazy Ken's",
        "20%",
        "Freezing Bear",
        "Pokemon",
        "the Max Watch",
        "Abigail",
        "about two weeks",
        "Blaux",
        "UI",
        "first",
        "one",
        "Lit Mobile",
        "quantum computing",
        "Raise to Wake",
        "Max Watch",
        "Patricia",
        "the Apple Watch",
        "One",
        "Tech Talk",
        "Apple Watch",
        "the Max Watch",
        "76.91",
        "couple of hours",
        "only $49.99",
        "Apple Watch First Gen",
        "a ton",
        "about eight months ago",
        "the Lit Mobile Solar Charger",
        "First",
        "Patricia Scam",
        "50",
        "Six",
        "the Max Watch"
    ],
    "transcript_entity_types": [
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "EVENT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "GPE",
        "NORP",
        "GPE",
        "TIME",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PERCENT",
        "PERSON",
        "PERSON",
        "FAC",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "TIME",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.12217722088098526,
        -0.057243213057518005,
        0.039965055882930756,
        -0.07589264214038849,
        0.0450134351849556,
        0.05065330117940903,
        0.09237576276063919,
        -0.01182051282376051,
        -0.006273756735026836,
        -0.019835012033581734,
        -0.013295288197696209,
        0.05587255209684372,
        0.015993749722838402,
        -0.03604908287525177,
        -0.02585042454302311,
        -0.0453345961868763,
        0.17852577567100525,
        -0.07890667766332626,
        -0.04221262037754059,
        -0.024924607947468758,
        -0.03917539119720459,
        -0.117314912378788,
        0.07593151181936264,
        0.05778104439377785,
        0.009411289356648922,
        -0.003257564501836896,
        -0.05870949104428291,
        0.03898513317108154,
        -0.04080218821763992,
        -0.010786677710711956,
        -0.014558698982000351,
        -0.0016223309794440866,
        0.014451135881245136,
        0.001261264318600297,
        0.011105252429842949,
        -0.06523589044809341,
        -0.015613757073879242,
        -0.029122596606612206,
        -0.12196990102529526,
        -0.052057404071092606,
        -0.028889203444123268,
        -0.014139777049422264,
        -0.04431496188044548,
        0.05401385575532913,
        -0.0038724460173398256,
        0.03434895724058151,
        0.027335084974765778,
        -0.011766631156206131,
        0.032297756522893906,
        0.05898931249976158,
        -0.048936329782009125,
        -0.06524388492107391,
        0.10600979626178741,
        -0.0027612694539129734,
        0.005022637080401182,
        -0.0684623271226883,
        -0.027066845446825027,
        -0.0011825411347672343,
        0.11550717800855637,
        -0.0010077098850160837,
        0.05159774422645569,
        -0.07276852428913116,
        -0.042722348123788834,
        0.04530952870845795,
        -0.011428278870880604,
        0.005364006385207176,
        -0.06097227334976196,
        0.08143419027328491,
        0.028485631570219994,
        -0.05049449950456619,
        0.019086934626102448,
        -0.030185095965862274,
        0.08864636719226837,
        0.11664793640375137,
        0.028631780296564102,
        -0.0034832200035452843,
        0.01200186088681221,
        -0.10442246496677399,
        0.0197120513767004,
        -0.017336249351501465,
        -0.05029607564210892,
        -0.07225220650434494,
        -0.031188225373625755,
        -0.03576093912124634,
        0.06298390030860901,
        -0.015168036334216595,
        -0.008675584569573402,
        -0.01816927269101143,
        0.03465944901108742,
        0.005222555715590715,
        0.015214110724627972,
        0.07806611061096191,
        0.014204324223101139,
        -0.03690676391124725,
        -0.0054025654681026936,
        0.04517137631773949,
        -0.05849388614296913,
        0.031414877623319626,
        -0.05965106189250946,
        0.026584742590785027,
        0.024864299222826958,
        0.02079727314412594,
        0.004880476742982864,
        -0.06242877617478371,
        0.0405726321041584,
        -0.14348746836185455,
        -0.051512375473976135,
        0.05794081836938858,
        0.07873564213514328,
        0.10044265538454056,
        -0.006263860035687685,
        0.05735819786787033,
        0.015229951590299606,
        0.004520142450928688,
        0.04898957163095474,
        0.12187979370355606,
        -0.049265164881944656,
        0.05917840451002121,
        0.1144014298915863,
        -0.02047649584710598,
        0.11320377141237259,
        0.05699753388762474,
        -0.023464443162083626,
        -0.010687271133065224,
        0.07075686007738113,
        -0.0012605974916368723,
        -0.005793677177280188,
        5.334462791666636e-33,
        -0.005405611824244261,
        0.07339941710233688,
        0.0025955166202038527,
        -0.04535359889268875,
        -0.053090792149305344,
        -0.055601149797439575,
        -0.036189962178468704,
        0.10044100135564804,
        -0.03076994977891445,
        0.09499305486679077,
        -0.05654831603169441,
        0.02132248319685459,
        -0.010281636379659176,
        0.03550314903259277,
        -0.011659309267997742,
        -0.02862059324979782,
        -0.062372591346502304,
        -0.05712613835930824,
        -0.01978844590485096,
        0.005451414734125137,
        0.018412813544273376,
        -0.06160486489534378,
        -0.00961045641452074,
        -0.0101923868060112,
        -0.07008133083581924,
        0.006767776794731617,
        -0.027686309069395065,
        0.025372084230184555,
        0.09041958302259445,
        0.04160341992974281,
        -0.0831410139799118,
        -0.06503380835056305,
        0.05744653195142746,
        -0.02930762618780136,
        -0.04083755984902382,
        -0.051921211183071136,
        -0.033017609268426895,
        -0.04700223356485367,
        0.0025806985795497894,
        0.028965691104531288,
        -0.09532664716243744,
        0.0049268268048763275,
        -0.07886737585067749,
        -0.09942105412483215,
        -0.03018120862543583,
        0.026317760348320007,
        0.045457761734724045,
        0.003531547961756587,
        0.019441727548837662,
        0.010369640775024891,
        -0.043715137988328934,
        -0.037296444177627563,
        0.015268872492015362,
        -0.031940244138240814,
        -0.07025804370641708,
        0.06307171285152435,
        0.04561838135123253,
        -0.07256966084241867,
        0.03171393275260925,
        -0.005850367248058319,
        0.01025907788425684,
        -0.017185870558023453,
        0.055048082023859024,
        0.08802385628223419,
        -0.08669167011976242,
        0.007275156676769257,
        0.03872152790427208,
        0.024588318541646004,
        -0.0699741393327713,
        0.0632777288556099,
        -0.026124371215701103,
        0.019621185958385468,
        0.02082190290093422,
        -0.041784193366765976,
        0.01064599584788084,
        -0.051784880459308624,
        0.001995829399675131,
        0.07430117577314377,
        0.024870790541172028,
        0.0338076613843441,
        0.023006772622466087,
        -0.011907298117876053,
        0.06647460162639618,
        0.05828133597970009,
        -0.03261401876807213,
        0.06586533784866333,
        -0.04110441356897354,
        -0.05482269078493118,
        -0.006413541734218597,
        -0.022399574518203735,
        0.032259751111269,
        -0.04605007916688919,
        0.023212064057588577,
        -0.007051633670926094,
        -0.05672997981309891,
        -6.841306592124664e-33,
        -0.025739656761288643,
        -0.05535132810473442,
        0.04693196341395378,
        -0.09815888851881027,
        0.03367403894662857,
        -0.009280439466238022,
        -0.036604396998882294,
        0.05344123765826225,
        0.04566508159041405,
        0.056914862245321274,
        0.08645492047071457,
        -0.031087828800082207,
        -0.05474844202399254,
        -0.013503565452992916,
        0.019608326256275177,
        -0.0841541737318039,
        0.025772705674171448,
        -0.02196955680847168,
        0.034963209182024,
        -0.0878925547003746,
        0.09678154438734055,
        -0.020687729120254517,
        -0.0003414098173379898,
        -0.003779233666136861,
        0.06337451189756393,
        -0.031176568940281868,
        0.049581993371248245,
        0.12613780796527863,
        0.049590278416872025,
        0.0278218612074852,
        0.018448710441589355,
        -0.009142068214714527,
        -0.01406770758330822,
        0.06924618780612946,
        0.04365021735429764,
        0.02435717172920704,
        0.06098282337188721,
        0.02141629345715046,
        -0.06550086289644241,
        -0.05964370444417,
        0.06541476398706436,
        0.0411326140165329,
        -0.023936381563544273,
        -0.023828035220503807,
        -0.007084825541824102,
        -0.009532204829156399,
        -0.042297039180994034,
        0.06163202226161957,
        -0.005850860849022865,
        -0.0671992227435112,
        -0.018252387642860413,
        -0.012337244115769863,
        0.0493784062564373,
        -0.01035227905958891,
        -0.11691004037857056,
        0.053345222026109695,
        -0.01542005967348814,
        0.0628291666507721,
        0.02085782028734684,
        -0.03244355320930481,
        0.008938217535614967,
        -0.028216727077960968,
        -0.03516331687569618,
        -0.030148116871714592,
        0.01341304276138544,
        0.028342576697468758,
        0.047498323023319244,
        0.012917251326143742,
        -0.013364543206989765,
        -0.0018507033819332719,
        -0.0026549736503511667,
        -0.0064175743609666824,
        -0.04897795990109444,
        -0.06536969542503357,
        -0.011826775968074799,
        0.009788733907043934,
        0.03053155541419983,
        0.006249100901186466,
        -0.12146113812923431,
        -0.039235614240169525,
        0.08436266332864761,
        0.003952984232455492,
        0.10893270373344421,
        0.016701217740774155,
        0.08815110474824905,
        0.04150082916021347,
        -0.03272552043199539,
        0.02238614112138748,
        -0.026316549628973007,
        0.07953482121229172,
        -0.0426708422601223,
        -0.04523313418030739,
        -0.014897016808390617,
        0.07931579649448395,
        -0.0038132776971906424,
        -5.3550806455859856e-08,
        -0.010606055147945881,
        0.019622182473540306,
        0.016539316624403,
        -0.061265695840120316,
        0.004046410322189331,
        -0.032897669821977615,
        -0.05238829553127289,
        0.00965938437730074,
        0.003516465425491333,
        -0.023410877212882042,
        0.04760672152042389,
        -0.053627315908670425,
        -0.07994571328163147,
        -0.0006754118949174881,
        -0.037370715290308,
        -0.07283814251422882,
        -0.05939263850450516,
        0.0543256551027298,
        -0.031656328588724136,
        0.0010063296649605036,
        -0.028712540864944458,
        0.018585147336125374,
        0.044221337884664536,
        -0.07733707129955292,
        0.012706167064607143,
        0.07946565747261047,
        0.0008336357423104346,
        0.055669888854026794,
        0.07829475402832031,
        -0.041310105472803116,
        -0.09784706681966782,
        0.012707349844276905,
        -0.010218341834843159,
        -0.022704174742102623,
        -0.05696653574705124,
        -0.08706192672252655,
        -0.05895828828215599,
        -0.005086410325020552,
        -0.0029847596306353807,
        0.056567657738924026,
        -0.011721845716238022,
        -0.08690983057022095,
        -0.008488940075039864,
        0.027381449937820435,
        -0.03308684378862381,
        -0.004633981268852949,
        -0.037069935351610184,
        -0.09656210988759995,
        0.09292583912611008,
        -0.011131453327834606,
        0.016067763790488243,
        -0.03845049440860748,
        0.05339459329843521,
        -0.003267949679866433,
        -0.02901262231171131,
        -0.021974287927150726,
        0.025163009762763977,
        -0.04925934597849846,
        -0.029585814103484154,
        0.03435831516981125,
        0.11061183363199234,
        -0.10142583400011063,
        0.008089845068752766,
        0.06066218763589859
    ]
}