{
    "id": "mBIdAMcvRhY",
    "title": "I Water Cooled My Bed - Genius or Insanity?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-20T17:01:57Z",
    "video_url": "https://www.youtube.com/watch?v=mBIdAMcvRhY",
    "category": "Science & Technology",
    "tags": [
        "ltt",
        "gaming",
        "watercooling",
        "pc",
        "pcmr",
        "linus",
        "tech",
        "tips"
    ],
    "views": 2977076,
    "likes": 105844,
    "comments_count": 5487,
    "description": "Thanks to Eight Sleep for sponsoring todays video! Better sleep makes a better you! Check out Eight Sleep at  and use code LMG for an exclusive $300 off during their Memorial Day Sale. Offer ends June 6th 2023.  Discuss on the forum:    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Sneak Peek 0:47 Why would you want a watercooled bed? 2:04 Let's put it together 4:40 Prepping 14:24 How are you gonna bring this all upstairs? 19:09 Dead Meme 23:33 Sorry, Yvonne :( 26:05 It works! 28:32 Uh oh",
    "description_links": [
        "https://www.eightsleep.com/lmg",
        "https://linustechtips.com/topic/1508206-i-water-cooled-my-bed-genius-or-insanity/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Okay. (upbeat music) - Ooh. - What just happened? What are the odds that my house will be put back together at the end of this day? You know, sometimes I really do feel like my life is stranger than fiction. There's this company that makes water-cooled beds, not water beds, water-cooled beds. They sent over their fancy mattress topper for our sponsor deal and I really like it, but that's not the strange part. The strange part is I was looking at this thing going, man, I bet we could make like a bigger, badder, cooler one. And they were like, sure, we'll sponsor that. Because for whatever reason they think our solution, which I'm gonna make with this guy, - Yeah. - Is gonna make theirs look good. To which I say, does theirs have RGB? (Alex grunts) I think not. Let's prove 'em wrong, lads. Before we go any further, the first question we need to answer is why on earth would you wanna water cool a bed? But if your relationship is anything like mine, you probably have a pretty good idea of the answer already. In the winter, she's practically dying of hypothermia unless we put like six blankets on her, and in the summer, I can be lying there buck naked with a good like 18 inches from my wife, and still sweating bullets. Well, Eight Sleep has a pretty cool solution to that. Instead of heating or cooling the entire room, which is super inefficient, you heat or cool your bodies directly. And because they have two separate loops, you can actually heat or cool either side. Wait, does ours do heating? - [Alex] No. - Oh, balls. Well, that's gonna be a disadvantage. The whole thing's app controlled and with their subscription service and the app, it helps keep you at the optimal temperature throughout the night for a restful sleep. To do all of that, you need more than just a radiator and a fan. That's where the pod comes in. It contains a reservoir, a pump, a heat sink, and a thermoelectric cooling module that handles both heating and cooling. But if a little cooling is good, then more must be better, right? - Oh, yeah. - I have no idea what the plan is today, but it involves this so... - Yeah, let's run some tubes. - This is all really cool, but where's the mattress topper? - Oh, it's up there. - Oh, easiest way to hide something from me, put it above about seven feet. - This has some very cool features that the Eight Sleep doesn't. It came with dirt on it. - Really, did you buy it used? - No, brand new, outta the box already dirty. Like, you can see all of this right here. - [Linus] Oh yeah, that corner up there. - [Alex] Yeah, it's disgusting. - Okay (grunts) excellent. Now I do have a question. How do these manifolds work? - So it's in both sides, out all of these. So these are 20 ports right here and those are going to be the 20 tubes that'll run along your side. We have the ability to break two more. This is how many spares we have. - Excellent. - Great. - Holy crap, you've gone very ambitious here. Your intention is to do two separate zones for the two sides? - Oh, yeah. - Okay, I see. - We're gonna retain that feature. - Oh my god, you really are trying to beat it. Okay. With the kind of stuff I've seen him do, I mean I hope the sponsor will still pay us for the video 'cause we might just beat it. I mean that's about as advertised. - I like the bits where I need to wash my hands after I- - Okay, all right, all right. You have a sheet on it? - I'm kind of allergic to it. - Are you? - Yeah. - Oh, you're allergic to latex? - I guess so, I don't know. - Oh, I see you've brought along other options for cooling as well. We have this Peltier cooler. - [Alex] Yeah, we have two Peltier coolers. That one right there is from your chair. - Oh, so my chair is no longer cooled. - No, and did you realize that the six pin had melted on it? That was by your butt. - The thing about Peltier coolers is that they consume so much power for the amount of cooling and heating that they can do that there are only a handful of applications where they really make sense compared to phase change cooling. It just so happens that this application is one of them because any efficiency gains you might get from using an air conditioning system are lost when you factor in that you are chilling the air around you that you are mostly not occupying, rather than taking that cooling and applying it directly to your skin where not only is it not wasted to the room, but it's able to be passed using conduction rather than convection, which is way more efficient. Air is a terrible, terrible conductor of heat. Now obviously the tubes are not gonna be able to be right against your body because that would be, that's some \"Princess and the Pea\" level stuff right there. I think I'd be able to feel that. But I think the plan is for us to embed it in the foam. Kind of like what we did with the water cooled chair, though hopefully not taking as long as we did with the water cooled chair because that took a long time. - I'm not 100% sure that we have enough to do all 40 runs like we do in feet wise, but we might not just by like the way that you cut it up. We bought all of Home Depot's quarter inch tubing. - How much did we spend on tubing this morning? - It wasn't that much, I don't remember. But this stuff is pretty cheap. That's 300 feet of tube. We need 260 by my calculations. - Oh my god, how on earth are we gonna do this? Okay, sure fine. - Which way is up? - I was just thinking the exact same thing, I have no idea. This is the kind of thing where your buddy asks if you can come over and help with a project and you're like, yeah, sure, I could spare some, you arrive and it's like, really like this? - So this right here is width, this right here should be 80, it's not, it should not be a square - Really. - It should be four inches longer in one of the directions. But it also means we can't screw this up- - Because they already did. - Yup. What are you doing there? - Well, I'm showing a loop going from you know, the end to the back to the end. - Oh, well, so what I was thinking is we have like one here, one here. - Oh my god, you just wanna go across. - Yeah, so then we go across, they combine over here and we have this absolutely fantastic control valve right here so you can adjust how much cooling each side gets with these wonderful ball valves. It's a very analog approach. You don't have to worry about like your wifi going down and your bed not cooling, right? - And where does this get affixed to? - The end of your bed. - So you want this at the head and the foot? - Yes. - (laughs) I need a nap. Now when we did the water-cooled chair, we used our laser to make tubing channels. Obviously that's not the plan today. Even if we had a laser this big, I mean the fumes alone would be enough to kill the half of our team. - So we have two options, the first is a hot wire, which fumes may be still a problem. Second option is a knife and we just send it. - I've never tried a hot wire, that sounds fun. - Yeah, that sounds fun. - Okay, hot wire foam cutter. Yes, this looks very affordable. - Now the best way to do it is with this one right here. So you would just go straight through something. That we can't do 'cause we're not going straight through it. So instead, that pops off. - [Linus] This looks very I bought this on AliExpress and I'm reselling it on Amazon. - I think this right here might be our best bet. You see the little hooky chum, we might be able to just (mimics ripping sound) - I see. - And then have little tubing channels. If that doesn't work then I don't know, we take this and... - [Andrew] Go on. - I mean I wonder how hot it gets. It's only one way to find out for sure. - We have a much better way to find it for sure. - The answer's quite hot. See I know before you're even got your even better way yet. - Compared to your 10,000 IQ move of touching the hot thing, I think that getting out the FLIR is a much better idea. Greater than 130 degrees Celsius we know that much. - So this will burn me then? - If that's all that you wanted to know? - Yeah. - Yeah, it'll burn you. - That was pretty much it. Okay, why don't we start on Yvonne's side. (laughs) I guess I just, you know, maybe like about halfway deep. - Well, we don't even know if it'll work yet. - [Andrew] But didn't you need to figure out if it was the right way around? - Didn't you need to figure it was the right (mumbles) - [Alex] It's working. - [Linus] This is quite slow. Well that definitely goes in there. I wouldn't say it stays in very well though. I think it's time for us to try another method. (saw buzzes) I'm kidding, I'm kidding. This is here for something unrelated. Let's try the really sharp knife. What the hell is on here? This is covered in glue. Look, it's got people's fingerprints on it. - It was in a bin with my CA glue, which tipped over and spilled only on that knife. - Perfect. - [Andrew] It's faster, isn't it? - Oh, it's faster. It's just a matter of if it'll actually like go in there, - [Alex] Which seems like it does. - The hole's not very big. Put it in there. This could work. My only question is, once it's in there, how on earth do we keep it in there? - Why do you think I have the CA glue? - Oh, to glue it back together? Does that work? Have you tried it on this foam? - I have tried nothing, Linus. (Linus whines) Today is an experiment. I also brought a whole bin of silicone adhesive if we want to use that and make a huge mess. - No, hopefully the CA works. - I also brought the instant set. - Is this a spray bottle? - Oh no, that's the activator. So you put the CA down, then you spray it with that when you have the stuff in the position that you want. - I see, okay we definitely need more than that, but it does work on this foam, which was a concern. So let's try and do this like we would do it. So I'm gonna put a bit more and then you spray it or? - No, you put it together. - Yeah. So you go like that and then, oh sorry. - Thanks for that. Well, how's that supposed to hit it? - I dunno, it's probably enough. - Oh, okay. This corner here is not gonna be the most comfortable part of this mattress topper. - Hmm, this mattress topper is not gonna be the most comfortable part of this mattress. - That's fair, this is not the best tubing for this. We should have used a more silicone based tubing. - Yeah, in talking to Eight Sleep, one of the things that took them the longest to develop were special like pliable tubes that weren't uncomfortable. So this is the top now, right? - No, no, no. The white one's the top. You want the less memory foam on the top. - Yeah, but I was thinking that like these right here, this is a super good insulator of heat. So if we have this much foam between the tube and you, our cooling will be severely compromised. - You wanted this in the top of the topper? That's gonna be so uncomfortable. - Well, your comfort is not the priority. The pure watts that we can extract from your body is. - No, no, no, well, well no, no. You know what? No, no, we can test this. We can put this in here. We can just go like this. Run some cold water through it and aim the thermal camera at it. Can see if we can get enough cooling to go through it. Just plug the chiller into it. - Plugging the chiller in is not the most trivial of things. - Wait, the chiller's 240 volt, right? Oh Alex, how the hell are we gonna plug in the chiller? - How the hell are we gonna plug in the chiller? (laughs) This right here is called the Quick220. As long as you're able to find two outlets that are out of phase, boom, you have 240 now. That's how we're gonna run the chiller. - These look exactly how I feel right now. - (laughs) But soon you'll look like this. - Oh wait, oh my god, no, that's... Why would you convert this? Technically there are plenty of devices that you could plug into this that can handle 240 volt, like say for example the DC power adapter for your laptop. But converting outlets to be not the correct standard for what's supposed to be inside them is a big no-no, oh my god. The two out of phase outlets go into the Quick220, which goes into this adapter from a proper 240 volt outlet to a 120 volt outlet, which goes to the back of the chiller. - Right. - Ooh, a receptacle tester. You didn't even talk about this. - Oh, that's a GFCI tester. Because if you have it on GFCI, this will not work 'cause it'll see the two like circuits put together and be like bleurgh. - How do we tell then if they're on different phases? - If they're on different phases, then the 240 volt light lights up. - I see, I do like to get lucky. - We got lucky, haha, there we go. - 238, let's go. - Good stuff. - Yeah, how are we adapting to that tubing? - Great question. - Oh no. This is a really sketchy way to do this, but I've done it before. If you get lucky, the outer diameter of your one tube is about the same as your inner diameter of the other. - Or will this just work? Oh, that works too. - [Andrew] Wow. - Before we fire this up, should we move the foam away? 'Cause we've got the foam soaked, it's gonna be a real bad time. - No, no, it should be fine. I got perfect control of this, look. (water sprays) See. - Sure. - What could go wrong? And full. I am waking up. Hello. - Okay, that worked. - [Andrew] Yeah, it's freaking out. - [Linus] Okay, so what we need to know is if it manages to cool this through this. - And so far the answer is no. - Might need time. - Like there's nothing there, like I touched it. You can see the heat. It needs to be way closer to the top. We need to have these like right against your skin. - That's not gonna be very good. Have you felt it with the CA glue? - No. - It makes like a hard thing. Like it's very noticeable and our chiller is broken. - Do we just have it so that we know that it'll be comfortable-ish and maybe not cool great. Or do we have it so that we know it'll be uncomfortable, but also we'll cool very well. - I think our most earnest honest attempt at this would be to make it comfortable and then see if we can actually cool it in a way that's comfortable. - I can't wait to cut this for the next two hours. - There's gotta be a faster way. (tape screeches) - All right, and about an hour later, this is complete. Now I just have to put all the tubes in. So I'll see you in another hour. (tape screeches) - Quick question for you. - [Alex] Yeah. - Did you buy any chance bring quick disconnects? - [Alex] No. - Sick. - Yeah. - That means we have no choice but to fill this upstairs then. I don't think we can carry it full of water. - No, that seems like a bad idea. Also, getting that chiller up there is going to be absolute hell. - Should we make a call to logistics now? I don't think we can do it. - I think we can. My plan is to take this guy. We'll have to put like a piece of wood down here. Ratchet strap the chiller to it and then I'll plant, lift it up, you go on the bottom. Or we can do the opposite - So if it falls then it's on me. - Well, but also I'll be the one taking most of the weight. - Yes, I have ratchets straps. - All right, cool. - But unfortunately our corporate overlords have forbidden us from using them as long as these are available. LTT cable ties available now from lttstore.com. Oh crap, I've already got it all over my finger, perfect, it's burning. - [Yvonne] Hello, how are you guys doing? - Oh, hey, are you excited to sleep on this this evening? - Um, that's gonna live in our room. How loud is it? Where's it gonna go? - If you killed me, they'd never identify the body because I have no fingerprints. - What, why? - I got CA glue all over my fingers. - Oh my gosh, okay, I must leave. - [Alex] I don't think that's good. - Yeah, oh, trust me, I know. Okay, so what I'm gonna do is I'm gonna like go quick and give her to all of them and then you're gonna kind of kick that in for me and I'll kind of like try to hold it together without getting CA all over my fingers. Here you go, let's go, go plan. Okay, it's, yeah, it's everywhere. It's everywhere, it's everywhere, it's everywhere. My side's going fast, oh crap. How do I manage to glue this one with the tube out here? Whoa, you're putting on a lot more CA than me. - [Alex] Yeah, it's kind of stinky. - This is acceptable, right? - [Alex] It's so great I give it to my boss. - Your boss sounds like a dick. Okay, is this good enough? - [Alex] I think so, yeah. - You know what, hold on. I need to know how bad those spots are to lay on. Ah, you know what? I can definitely detect tubes. (Alex laughs) - Oh that's not (groans) (Linus laughs) - See that's why I was like, you know? - Maybe this way's better. - [Linus] Ah, I actually think the other way would be way better. - This way's better. 'Cause you're not getting 'em like jammed into as much. They're like go on lengthwise. Still not great. - Yeah, I mean it helps that the most padded part of my body is the part that digs into it the most. But I can definitely feel that 100%. Uh, how the devil are we doing this? - I was thinking that we'd worry about that after we get the chiller upstairs 'cause that's gonna be worse for sure. - Oh my God. - Oh geez. - Alex, I don't know if this is gonna happen. Wait, could we just run a really long tube up the stairs? - Oh my god, that's a terrible idea. We don't have tubes that long. Do you have tubes that long? - No. Guys, for real though. Make sure you go check out Eight Sleep's big sale promotional event that they're promoting with this 'cause like they're clearly cool folks. Oh yeah, we can't even go too horizontal. Did I just go too horizontal? - It's probably fine. - It wasn't for very long. But horizontal is bad for phase change cooling systems like these because all the oils go in the wrong place and the compressor can get pretty bummed up. Your genius plan then here is what? Drag it up the stairs basically? - [Alex] Oh, yes. - Oh my god, can it, oh, (dolly crashes) can this fit through the door? - [Andrew] I hate to be the guy laughing. - I don't think it's going work, Alex. - Yeah, the door's what, 33? - The door is not this, whatever this is. You know what, the front door. (Alex grunts) - Well yeah (beeps), well yeah right. (Alex grunts) - There we go, one stair. - Oh my god, this is so dumb. - Yeah, this is really heavy, 3, 2, 1. - I thought it was 1, 2, 3. Who needs to go to the gym tonight? These tires on the hand track should really be a lot more inflated than they, okay, are. - [Alex] Are we fine? - [Linus] You wouldn't be the first LMG employee to put a big gash in the wood floors. - That was not easy for three stairs. - I'm sweating. I can tell you are too. - So one advantage of Eight Sleep's solution is that it's not... - This. - Yeah, like maybe 500 pounds. So bring your mattress in there. - Are you kidding me? What are the odds that my house will be put back together at the end of this day? It is 4:40. - It's fine, it's fine. All right, Linus, if you want your house back together when I leave... - I'm up. (groans) Oh, very good way to help cool down. Normally I have it on a schedule, but you can also just set your temp dial do-do-do-do-do-do cooling to -10. That doesn't mean negative 10 degrees Celsius. It's just a dial that goes from -10 to zero to 10 for cooling and warmth. We're gonna bring up the thermal camera so we can show you guys how the real one works. Oh, that is so nice right now, that's 10 degrees Celsius. That's not the kind of thing I would actually want for sleep, but for right now, it's amazing. Hey, this is my job, I'm benchmarking. Notice how much quieter the Eight Sleep is compared to the chiller? That's as loud as it gets. It's just got the one Noctua fan in there. So much better. - Okay, this actually bodes really well for our solution. On the thermal camera, it's just showing up as like 25 degrees everywhere on the bed. - Really? - Yeah. - Because I am very chilled right now. - Oh, whoa. Okay, this is pretty funky. Look here. - Look at the spot where I was. - Oh my god, (laughs) that is really cool. So it is insulating like everywhere where's no tubes, but the second that you like press down on it. - Yeah, so what does my back look like then? - Oh yeah, you can see the squares and also where you're really sweaty. - By the way, their tubes are significantly more comfortable than yours. I'm just saying. - Well, I'd hope so. - I mean it definitely works. So now I get to take it off. New plan, we cannot safely get the chiller up here. You guys have seen me do some sketchy stuff over the years, even I don't think that's okay. - Yeah, no. - So we're gonna drag the guest bedroom mattress downstairs. Hi! - Hi. - We decided we're filming in here. I know how you are, sometimes you just, you know, can't wait. So now there's a bed right here so I'm ready. (Alex sighs) Everything's ready. - This is painful. - So I'm kind of thinking, I couldn't help noticing you're a couple of tubes short on some of these. - [Alex] Yeah. - Wait. - We didn't have quite enough. - How did you manage to glue foam down to the floor of the garage? Alex, what the heck? - That's when my bottle tipped over and spilled a little bit on the ground. - Alex, you know what? My next big investment is gonna be a house that I pretend to live in that we film all the my house content at so that I don't have to have you guys in my actual house, gouging floors, spilling bottles of CA, taking all my bed apart. - Yeah, but then you won't have all the cool things that we make videos about in your house. - You know what? I could just hire professional movers to take them from the fake house to the real one. I'm sure that the final edit of this video is gonna be leaving out a lot of stuff. So make sure you're subscribed floatplane.com/ltt for all the extras. (mattress knocks) Ooh. And that is why we have these little stoppers here. Good job, Linus, it's still dented. - So which side do we want to be the top. - The white side. Hey, Yvonne, this is now the guest bedroom. - [Yvonne] Hmm, okay. - Unless you want to use it. - Once you see the cooling performance, you will. - If only that was how to impress women, I'd be a stud. My computer runs so cool, we wouldn't even believe it. - This bed has so many BTUs. - Comfort-wise, how we doing here? I can feel them with my feet so that's something. (sighs) You know what? This way around, it's better. - It's also on a mattress. (Alex sighs) - It's definitely better. - [Alex] Oh yeah, it's fine. I don't even notice. - The test now is whether it actually cools the user. Oh, aesthetic. You know, one time we could go a week without saying, this is the worst thing we've ever done. What is Alex planning to do here with these extra four fittings on each one? You know what I bet it is? He's probably just gonna loop them and then we don't have to use them, okay. You know how your mom said that I didn't have that cool factor? Do I have enough cool for her now? No, her mom never said that. What she did say was that I'm not tall enough. - Oh, do you know what we really need to do? - Cap off these extra ones? - Yes, we need to just, I was thinking a little loop ugh. - Oh, that is what you were gonna say. - Yeah. - Oh. - Man, with my bed this close to my gaming setup, I will never have to move again. - [Alex] Oh, you have the scissors now. - Oh, I can give them back to you. Let me just... - I'll go get other scissors, better scissors. (tool hums) - Oh my god, that. - It's not even working. - It's not fair. It's not fair. - Oh, interesting. Alex, this one has more than two on the one side here. - [Alex] As in four. - Three. - Ooh, he is correct, it's not great. - So basically we're just one run short in this side. That's okay, that can be Yvonne's side. - What do we do about the water? - Are we out of tubing? - Yes. - I see. - One thing that we can do. - Put a little scrap of tube and a big clamp on the tube. - That's exactly what I was going to say. - See, this is our problem. Neither of us is able to stop the other. We reinforce the behavior. That's what makes our relationship so destructive. Not to us or each other. - [Alex] Ugh, this is terrible. - This is terrible, this is your threshold, Alex, we left terrible behind in the rear view mirror a long time ago. - [Andrew] Any idea how much water this thing is gonna? - Nope, we're just gonna keep pouring water into it until it doesn't need water anymore. - How are you gonna drain it? - Don't worry about it. Man, I tell you, this has gotta be a whole sponsored series. Linus and Alex one day build the sponsor's product and compare it to the real thing. This compression fitting collar is just for decoration, but the barb works. - For that one, what about we use this guy? - Sure. - 'Cause that one I think will want to leave. The other ones won't. - [Linus] Absolutely atrocious. - [Andrew] I mean, the water's in there now, there's no going back. - Yep, point of no return, baby. One more call out again to Eight Sleep for sponsoring this video. Guys, check out their promotion down in the link below and let's do this thing. - Yeah. (machine gargles) (machine beeps) - What's making that gurgling noise? (Linus shushes) - I wouldn't be too concerned yet. (water tinkles) - Okay, there we go, there we go. She's working now. - Low P1, low P1 is good? - [Alex] No. - Oh, I think P1 is that it's too cold. Follow steps one to four to release trapped air in the pressure transducer. - So Linus, how are you feeling? - Great. - We didn't get to do your bedroom. We didn't get the RGB that we wanted. - I forgot about the RGB. - Yeah. - Yeah, we promised RGB. That was a dumb promise. Basically the whole flipping thing has to come apart. All the panels come off. (drill hums) - [Alex] There we go. Well this is our pressure transducer. - [Linus] It says to push on the valve until water flows. - What a side quest. - How the devil am I supposed to get this off? When we offer this thing for free in the group chat at work? Any bets on who's gonna be the one to take it? - Oh, the mattress topper. - Yeah. - No one. - Lunch says that someone wants it. - Okay. (laughs) - Hold on just a gosh darn second here. The res is empty. This is so gunked up, (Alex groans) that water can't get out of it. - That would probably do it. - [Andrew] That makes sense. - [Alex] So that's our problem. - You can actually see right down into the res that it's bone dry. But I think what's happening is it's circulating the water back into this thing and it's so slow to come out of it that it's running dry. Totally makes sense now, okay. (machine hums) Okay, go for it, go, go, go, go. Okay, she's flowing, boys. Temperatures dropping. Go figure, you have to fill your chiller with water. I'm gonna try hopefully you know what, here we go. Open there. That is how it is supposed to work. - (laughs) Oh, that's gnarly. - Hey, shout out Thermo Scientific though. This is a very user friendly filter system. We just didn't know how to use it, okay. - Any leaks? - Is it working? - It's working, yeah. - Are you sure? We don't need this at 10 degrees, eh? - [Alex] No, we should have it at five. - Set it to five? - Yeah. - What, it's gonna be freaking freezing. - Well, the Eight Sleep goes down to 10 degrees. We've gotta go lower than that. - The point is not to just go cold, well, some of the... - [Andrew] Oh, there you go. - What just happened? - [Alex] Oh (beep) no, turn it off. That's a lot of water. Wow, what even failed? - [Linus] Is that a quick connect? - No, this is a whole fitting thing. - [Linus] What? - It's a male to male adapter. I was about to say, I'm really shocked that none of this leaked. - [Linus] It's not through the rug yet. - Oh excellent. - [Linus] Holy crap, it's not through the rug. - Oh my God, it's all up the wall. - Ah, relatively minor. Okay, and so what was this? - [Alex] This is a rotating male to male. - Oh wait. - Oh, it's an adjustable length thing. - That's what was, Alex, it's an SLI fitting. (Alex laughs) Oh, it's working. - It's working. - Yeah. - The bed's cold? - Okay, good, good, good, good. - Aren't you glad that we didn't do this in your bedroom? - Yeah, I mean, at least we're in the room that already has a water damaged floor. - [Alex] Oh my god, this looks like a crime scene on the FLIR, oh, you can already see it. - Hold on, hold on. - [Alex] Wow, that's working really well. - You know, even without the RGB, I'd say we succeeded. Think about it. While we can't do heating for the water, we do heat the air with our handy dual purpose white noise generator here. Here, check it out. Does it, is it cold under where I was? Should be. - [Andrew] Oh yeah. - If you want. - You can't really tell. - You can't tell? - [Alex] Not, not really. - Oh, okay, I promise you where my thigh is right now. Hold on, huh? - [Alex] You can sort of see it but like not as much as I was expecting. - Really? - Yeah. - I can feel it though. Hey Yvonne, come try it. See if you can feel the chill. - [Yvonne] No, I'm cold. - [Alex] You can hold the camera. - [Andrew] Careful of that side. - Like you can feel it, right? - Not really. - What, not even like? - I was expecting it to be way more. - Well there's so much more foam though. - I was hoping for like an extreme cooling effect. - Oh, yeah. - This is not nearly as cold as I hoped. - The point is, if you were to try to DIY something like this, I think you kind of could. But by the time you put in that much time and money, I don't know man... I think you're crazy, I can totally feel it. Then again, maybe I'm crazy 'cause if the FLIR can't see it, then I must be imagining it. Like my back right now is freaking chilled. You know what I think it is? I think it's that we were really inconsistent about the depth of our cuts. That's why there's kind of cold spots. - Oh, and one of the sides I did with the knife that's way longer and the other side Andrew did with the knife that's shorter. Oh yeah, the side's way colder. It's not as much as I was hoping for though. - And considering how cold we have the coolant, it's not very effective. - Yeah, what's the coolant at right now? Five, 7.9. - Good effort. In summary then we learned a lot and I think you could conceivably DIY something like this. However, I doubt that Eight Sleep considers this solution to be a significant threat to their business. Well played Eight Sleep, well played. If you guys enjoyed this video, maybe check out the one where we introduced the chiller and I think we used it to cool a computer. - Yeah. - Probably.",
    "transcript_keywords": [
        "Yeah",
        "cool",
        "thing",
        "Sleep",
        "cooling",
        "water",
        "good",
        "put",
        "chiller",
        "god",
        "side",
        "Alex",
        "tubes",
        "make",
        "work",
        "kind",
        "back",
        "foam",
        "bed",
        "tube"
    ],
    "transcript_entity_values": [
        "40",
        "18 inches",
        "the years",
        "one",
        "20",
        "One",
        "RGB",
        "DC",
        "Yvonne] Hmm",
        "Noctua",
        "300 feet",
        "Three",
        "1",
        "7.9",
        "500 pounds",
        "Yvonne] Hello",
        "LTT",
        "three",
        "Linus",
        "SLI",
        "Linus",
        "the summer",
        "only one",
        "half",
        "first",
        "2",
        "Andrew",
        "the night",
        "four inches",
        "a week",
        "80",
        "AliExpress",
        "Greater than 130 degrees Celsius",
        "Today",
        "Amazon",
        "FLIR",
        "-10 to zero",
        "240 volt",
        "this this evening",
        "about an hour later",
        "quarter inch",
        "six",
        "DIY",
        "240",
        "four",
        "GFCI",
        "10 degrees",
        "Home Depot's",
        "Alex",
        "10,000",
        "120 volt",
        "more than two",
        "five",
        "10",
        "100%",
        "3",
        "LMG",
        "Five",
        "the winter",
        "one to four",
        "260",
        "Thermo Scientific",
        "two",
        "10 degrees Celsius",
        "33",
        "second",
        "the next two hours",
        "about seven feet",
        "Eight Sleep's",
        "Second",
        "Eight",
        "Yvonne",
        "another hour",
        "today",
        "238",
        "a long time ago",
        "tonight",
        "25 degrees",
        "Eight Sleep",
        "2",
        "this morning",
        "barb",
        "the end of this day"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.1024031788110733,
        -0.030431685969233513,
        0.06108401343226433,
        -0.024142013862729073,
        0.10332154482603073,
        0.03030262142419815,
        0.06495808809995651,
        0.029456624761223793,
        -0.015982631593942642,
        -0.040780313313007355,
        -0.04824589937925339,
        -0.021126803010702133,
        0.016234146431088448,
        -0.0323147177696228,
        -0.024774353951215744,
        0.004833653103560209,
        0.04348454996943474,
        -0.06497863680124283,
        -0.04467581585049629,
        -0.0365925058722496,
        0.052453938871622086,
        0.003532089525833726,
        0.010519426316022873,
        0.042108550667762756,
        0.023064324632287025,
        0.06938391923904419,
        -0.017036771401762962,
        -0.04805973544716835,
        0.024555329233407974,
        -0.01248505525290966,
        -0.004659292753785849,
        0.10251826047897339,
        -0.0778283178806305,
        -0.11079007387161255,
        0.05187026038765907,
        -0.014888772740960121,
        -0.03451212868094444,
        -0.06963936239480972,
        -0.10063101351261139,
        -0.0031618874054402113,
        -0.011103013530373573,
        -0.10082787275314331,
        0.024893740192055702,
        -0.026108969002962112,
        -0.0003036879934370518,
        -0.02618379145860672,
        0.0017549758777022362,
        -0.12047987431287766,
        0.010310118086636066,
        0.03843555971980095,
        -0.015143435448408127,
        -0.1059868112206459,
        0.015830090269446373,
        -0.020352691411972046,
        -0.06492359936237335,
        -0.004535261541604996,
        -0.009438134729862213,
        -0.016180668026208878,
        0.023240962997078896,
        0.04964887723326683,
        -0.0049982029013335705,
        0.022886237129569054,
        -0.06437492370605469,
        0.038507286459207535,
        0.1056649461388588,
        0.013690135441720486,
        -0.1066211685538292,
        0.13072316348552704,
        0.012487353757023811,
        0.018415480852127075,
        -0.03505605086684227,
        -0.010455465875566006,
        0.049013398587703705,
        0.038734808564186096,
        0.010007539764046669,
        -0.048427484929561615,
        0.07148826867341995,
        -0.08030852675437927,
        0.059195540845394135,
        -0.01786443218588829,
        0.026188675314188004,
        -0.10392703860998154,
        0.033302102237939835,
        -0.07577075809240341,
        0.005611463449895382,
        -0.015898318961262703,
        0.11371438205242157,
        0.05220940336585045,
        -0.0045973253436386585,
        -0.01065609697252512,
        -0.011273585259914398,
        0.0731988325715065,
        0.0066048866137862206,
        0.043161895126104355,
        0.014987397007644176,
        0.07640504091978073,
        -0.07577189803123474,
        -0.03445199131965637,
        -0.04210352525115013,
        0.08988302946090698,
        0.047827161848545074,
        0.06420265883207321,
        -0.024267124012112617,
        -0.007975350134074688,
        0.020759107545018196,
        -0.07802277058362961,
        0.046558741480112076,
        0.09894892573356628,
        0.03543351590633392,
        -0.0924108475446701,
        -0.09863104671239853,
        -0.0019830588717013597,
        -0.02596341073513031,
        -0.009088033810257912,
        0.014548507519066334,
        0.03351010009646416,
        -0.03424656763672829,
        0.08039268106222153,
        0.07316181808710098,
        -0.05809642747044563,
        0.06171111762523651,
        0.016801264137029648,
        0.0014519899850711226,
        0.02460583671927452,
        0.0292056817561388,
        0.010615533217787743,
        -0.05707121267914772,
        -2.9538068166592144e-33,
        0.009220890700817108,
        -0.03088686801493168,
        -0.04263507202267647,
        0.02314453199505806,
        0.11336538940668106,
        -0.05809062719345093,
        -0.06195353716611862,
        0.00034065297222696245,
        -0.036878801882267,
        0.11257991939783096,
        -0.046805791556835175,
        -0.013845069333910942,
        -0.09026170521974564,
        0.018790002912282944,
        -0.016289761289954185,
        -0.10252538323402405,
        -0.029701337218284607,
        0.004659521859139204,
        -0.07388360053300858,
        -0.023776119574904442,
        -0.05472668260335922,
        0.019285310059785843,
        0.014931775629520416,
        -0.022672051563858986,
        0.029750492423772812,
        -0.000892411102540791,
        0.031746458262205124,
        -0.04022794961929321,
        0.06246291846036911,
        0.038863301277160645,
        -0.0407135933637619,
        -0.023368367925286293,
        0.0056770676746964455,
        -0.01152539812028408,
        -0.03114301897585392,
        0.010486505925655365,
        -0.06800798326730728,
        -0.09515354782342911,
        -0.02464905194938183,
        -0.026089521124958992,
        -0.0017101430566981435,
        0.04590451717376709,
        -0.07422426342964172,
        -0.07226889580488205,
        0.0009864357998594642,
        0.024897444993257523,
        0.040936652570962906,
        0.061607517302036285,
        0.045196857303380966,
        -0.016595380380749702,
        -0.01275334507226944,
        0.024427911266684532,
        -0.14330652356147766,
        -0.028223205357789993,
        -0.023068906739354134,
        -0.005038231611251831,
        0.029633313417434692,
        -0.01213303953409195,
        0.05527842417359352,
        0.03674185276031494,
        0.0011075881775468588,
        0.02740209922194481,
        0.016140414401888847,
        -0.0837598368525505,
        -0.05808411166071892,
        0.034842558205127716,
        0.015945157036185265,
        -0.03213797137141228,
        -0.04591973125934601,
        -0.058678921312093735,
        -0.08168508857488632,
        -0.059756889939308167,
        0.0735141858458519,
        -0.04852036386728287,
        0.048729781061410904,
        0.0009668580023571849,
        -0.023582739755511284,
        -0.06673485040664673,
        -0.08388499915599823,
        -0.00563792185857892,
        0.01282033696770668,
        0.014550008811056614,
        0.03327080234885216,
        0.01530331838876009,
        0.009437787346541882,
        -0.029039189219474792,
        0.004015072248876095,
        -0.02999180369079113,
        -0.017737198621034622,
        0.03292281925678253,
        -0.10925455391407013,
        -0.04683772847056389,
        0.12328614294528961,
        -0.05091191455721855,
        -0.10281066596508026,
        -1.3295552832895296e-33,
        0.03399204835295677,
        -0.004784935154020786,
        -0.011723630130290985,
        0.029614459723234177,
        0.1059921458363533,
        -0.0012075627455487847,
        0.04796459898352623,
        0.012388697825372219,
        0.038075417280197144,
        0.030902942642569542,
        0.04050622507929802,
        0.014182393439114094,
        -0.12655016779899597,
        -0.09914955496788025,
        0.07108663022518158,
        -0.08939247578382492,
        0.03833862394094467,
        -0.034844666719436646,
        -0.021982751786708832,
        0.04851504787802696,
        0.0447295680642128,
        0.055254898965358734,
        0.039675578474998474,
        0.04603924602270126,
        -0.01927853934466839,
        0.04066820070147514,
        0.092641681432724,
        0.12786318361759186,
        0.027928654104471207,
        -0.01852354221045971,
        -0.00838000699877739,
        -0.029593322426080704,
        -0.055401258170604706,
        -0.006666315719485283,
        0.02391248568892479,
        0.059319429099559784,
        0.09492547065019608,
        -0.006242483388632536,
        -0.1262023150920868,
        -0.037194497883319855,
        0.030444283038377762,
        -0.04654093459248543,
        0.015611225739121437,
        0.023225026205182076,
        0.005654702894389629,
        0.023644037544727325,
        -0.08164317160844803,
        -0.062426529824733734,
        -0.005970351863652468,
        -0.007494229823350906,
        0.0448232963681221,
        -0.08322256803512573,
        0.008078007027506828,
        0.020047055557370186,
        -0.03981286287307739,
        -0.03222997114062309,
        -0.008285503834486008,
        -0.023928707465529442,
        -0.045173343271017075,
        0.028744975104928017,
        0.10010162740945816,
        0.003122984664514661,
        -0.04381624981760979,
        -0.07791756838560104,
        0.018459876999258995,
        0.006275843363255262,
        0.017641274258494377,
        0.01704704947769642,
        -0.02928638830780983,
        0.024957699701189995,
        0.019936304539442062,
        -0.021941734477877617,
        -0.045371949672698975,
        -0.005805301479995251,
        -0.027020838111639023,
        -0.009439367800951004,
        0.0005711907288059592,
        -0.04390810430049896,
        -0.03231479972600937,
        -0.1351572424173355,
        -0.045756272971630096,
        0.036173272877931595,
        -0.011209550313651562,
        -0.0006908084615133703,
        0.07532164454460144,
        -0.01970168761909008,
        0.039194975048303604,
        0.010173741728067398,
        0.014708957634866238,
        0.006159045733511448,
        -0.020235463976860046,
        -0.015804143622517586,
        -0.07181272655725479,
        0.04423606023192406,
        0.08238132297992706,
        -6.462421708874899e-08,
        -0.04854537919163704,
        0.0032133993227034807,
        0.016432134434580803,
        0.011960763484239578,
        0.036138858646154404,
        -0.07975543290376663,
        0.025852978229522705,
        -0.0035476062912493944,
        0.02112594246864319,
        0.017106374725699425,
        0.02263633720576763,
        -0.053077805787324905,
        0.04540889710187912,
        -0.00524592911824584,
        -0.024295633658766747,
        0.00816620048135519,
        -0.09351252019405365,
        0.04767056554555893,
        -0.06040915474295616,
        -0.1059001237154007,
        -0.0006086667999625206,
        0.007647390943020582,
        0.062465600669384,
        -0.05250365287065506,
        0.03739583492279053,
        0.03868764266371727,
        0.03206402435898781,
        0.12420201301574707,
        0.11704321205615997,
        -0.04217034578323364,
        0.007479234132915735,
        0.032457344233989716,
        -0.021460801362991333,
        -0.030635502189397812,
        -0.012515192851424217,
        -0.05531345307826996,
        0.013399103656411171,
        0.023275109007954597,
        0.003908201120793819,
        0.016758162528276443,
        -0.03518559783697128,
        0.002007662784308195,
        0.035166092216968536,
        0.04607585445046425,
        0.019838357344269753,
        -0.07307061553001404,
        0.01797219179570675,
        -0.06675361841917038,
        -0.010016268119215965,
        0.05275394022464752,
        0.02118780091404915,
        -0.021401163190603256,
        -0.060545288026332855,
        0.06618350744247437,
        0.06736714392900467,
        -0.019867796450853348,
        -0.07213690876960754,
        0.027008432894945145,
        -0.06798703223466873,
        0.030156509950757027,
        0.07294759899377823,
        -0.06830527633428574,
        -0.0676620826125145,
        0.033575624227523804
    ]
}