{
    "id": "Mc9XaeEyZ8M",
    "title": "Running on empty: surviving a hydrogen-powered road trip",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-08-20T14:00:26Z",
    "video_url": "https://www.youtube.com/watch?v=Mc9XaeEyZ8M",
    "category": "Science & Technology",
    "tags": [
        "hydrogen",
        "hydrogen car",
        "hydrogen gas",
        "Fuel Cell Electric Vehicle",
        "energy",
        "hydrogen bubble",
        "california hydrogen stations",
        "arnold schwarzenegger",
        "green hydrogen explained",
        "renewable hydrogen",
        "hydrogen fuel",
        "hydrogen power",
        "hydrogen explained",
        "hydrogen fuel cell",
        "water for fuel",
        "how is hydrogen fuel generated",
        "how to use hydrogen",
        "h2",
        "toyota mirai",
        "new tesla",
        "hydrogen pros and cons",
        "new hydrogen car",
        "hydrogen gas generator",
        "hydrogen vs electric cars",
        "hydrogen energy"
    ],
    "views": 311965,
    "likes": 8057,
    "comments_count": 845,
    "description": "We attempt to cross California in a car powered entirely by hydrogen gas  a Fuel Cell Electric Vehicle (FCEV). Along the way, we meet other early adopters of this tech, and find out why the world seems to be choosing battery electric cars over hydrogen.   This video is part of a larger multimedia story about Californias hydrogen highway. Listen to our podcast episode here:   Check out an interactive map of our journey here:    Read The Verges latest coverage of hydrogen-powered boats, planes, and more here:    0:00 Intro 01:01 The rise and fall of hydrogen-powered cars 02:07 California's Hydrogen Highway today 02:48 Picking up our Toyota Mirai 03:32 Learning how to fuel 04:37 Bay Area hydrogen drivers 06:31 Roadtripping to Harris Ranch 07:41 Harris Ranch rest stop 08:36 Waiting for other hydrogen road trippers 09:27 The largest Tesla supercharger 10:00 James Sweet Bonsai 10:25 The Steakout 12:23 Roadtripping to Los Angeles 13:15 Los Angeles hydrogen drivers 15:03 Is there a future for hydrogen fuel?  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://trib.al/BGXitOH",
        "https://www.theverge.com/e/23959828",
        "https://www.theverge.com/e/23985859",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- All right, it's done. 1.3. That doesn't feel like a full tank's worth. I don't know what I'm doing wrong. (pump beeping) I'm doing something wrong. (pump beeping) \"Please seek attendant.\" I don't think there is an attendant here. Okay, I know it looks like I don't know how to use a gas pump, but this is not a normal gas station, and it's not a normal car. This is a Toyota Mirai. It's powered entirely by hydrogen. We're trying to drive it from the Bay Area to Los Angeles, about 320 miles. And we may have just broken one of the only fuel pumps between those two cities, which could strand us and every other hydrogen road tripper at this very strange rest stop in the middle of nowhere. We just hosed everyone else who is trying to make this road trip this weekend. Let me back up a little. Okay, a lot. - Thank you very much for a nice introduction. - [Narrator] In 2004, Governor Arnold Schwarzenegger cut the ribbon on something he called California's hydrogen highway. - We were not just dreaming about the hydrogen highway. We will build it. - [Narrator] California wanted to be the launchpad for hydrogen fuel cell technology, a really promising alternative to gasoline. Fuel cell cars use hydrogen gas to generate power for electric motors. The only byproduct is pure water. - They are all producing water rather than pollution. - [Narrator] So here's how that went. Initially, lots of people got really excited about a hydrogen-powered future. - We believe the ultimate solution is hydrogen. - [Narrator] Auto companies built fuel cell cars. - Look at the fantastic cost that the hydrogen road to has brought to us. - [Narrator] And California shelled out more than $250 million to build a network of fuel stations. But as that was happening, battery electric cars got a lot better. They eventually beat out hydrogen as the more practical successor to gasoline. But here's the odd part. In California, the hydrogen dream never quite ended. Today, there are still thousands of people driving fuel cell cars, and around 50 stations to support them. But those stations are unreliable. Fuel costs are skyrocketing, and frustrations are bubbling over. - Why so many zero emission car owners are having zero luck filling up. - [Narrator] So what are we doing here? We wanted to take a road trip in one of these cars. Lock it. Ooh, and meet as many other drivers as we could find to see what life is like on the hydrogen highway and find out how far it could really take us. Here's what happened. First, we flew into San Francisco and rented a Mirai in Toro. The owner immediately warned us about our travel plans. - When I came to know you were in LA, I was like, \"Wait a second.\" I was a little uncomfortable. From between LA and here, I think there's like one or two pumps. So if that pump is down- - Yeah. - Then you know you're stuck. - [Narrator] The 50-ish fuel stations in California are overwhelmingly clustered around San Francisco and LA. There were plans to put pumps every 20 miles along highways, but that never happened. You've never driven down to- - No, not yet. - Yeah. - I didn't wanna take a chance yet. - [Narrator] So we're almost to the mountain view. We spent the day driving the Mirai across the Bay Area. The car drove great, but we really wanted to check out the fuel stations around here. On paper, there were about 17, but a handful were offline for one reason or another. - [GPS] Your destination is on the right. - [Narrator] One in Silicon Valley has been broken for two years. - Two years of not being operable. That sounds pretty sad that it's not working. - And the working stations seemed kind of iffy. The sign is glitching out in a way that makes me very nervous. Oh, I think it timed out or something. It turns out that putting cold compressed hydrogen gas into a car is a lot more complicated than filling a tank up with gasoline. Pump ready. Okay. Oh no, wait, wait, wait. No, no, no, no, no. It's just time to- it just reset again. We also discovered just how much it costs to fuel these cars right now. A little bit of quick math. 36 bucks a kilogram times five kilogram tank would be $180 to fill up. But we were newbies to all of this. So we went and found some experts. - This is the third station we are right now, we came. - [Narrator] Oh, you tried to go to two others? - Yeah, there's one station in Sunnyvale, one in San Jose, and this is one in Cupertino. - Half the time, these don't work here. - Yeah. - Manadeep and Rupesh have only had their car for about four months, and that whole time, they've had to hunt for fuel and ration what they have. - I was averaging about 70 or 65 miles, sir. Miles per gallon, I could say. - Yeah, yeah. - Yeah. - [Narrator] Boy, so you have to really think about how you're driving the car. - You have to focus on the road and also on your mileage here. - Yeah, yeah. - Yeah, yeah. - [Narrator] So you said you just got the car? - So this car I got for 15,000. Hard to beat, right? - Yeah, absolutely. Rebecca wanted a battery electric car, but she couldn't find anything for less than 40 grand. But then, a dealership offered her a killer deal on a Mirai with only 23,000 miles on it. For that price, she's willing to put up with the rest. - That's it, I'm paying a fortune in hydrogen. - Yep. - But it'll take something like 13 years. I did my math. It'll take 13 years before this vehicle will cost me more than if I were to buy a 40,000 something electric vehicle. - Yeah. We told everyone about our road trip, and they gave us some tips for making our hydrogen last. Okay, no AC, go easy on the pedal. - Yeah. - Always know where the next station is. - Yeah. - Call the station. - Stick to the speed limit. - Stick to the speed limit. - If possible, go below the speed limit. Try to be in the rightmost lane. - This is not the road trip that we were looking forward to having. - I'm really sorry for spoiling your road trip. (laughs) - [Narrator] And then it was time to hit the open road for Los Angeles. Not the send off we were hoping for. - [GPS] The route guidance will start now. (bright music) - It's about 320 miles from the last fueling station in the Bay Area all the way down to the first in the Los Angeles area. And that is right at the maximum range of the Mirai we're driving. So it would be pretty foolhardy to try to make it all the way on one tank. There is one fueling station on Interstate-5 in between the two cities. It's at a place called Harris Ranch, and we really wanna find drivers who are putting the hydrogen highway to the test the way that we're trying to do it. And so if we're gonna find any of those other people, it's gonna be at Harris Ranch. (bright music) I see it in the distance. I see the, oh, I see the sign. It's a big sign. 101 degrees, and it smells overwhelmingly like cow. Oh my God, it's beautiful. - [Speaker] It looks like a little oasis. - [Narrator] It is. Harris Ranch turned out to be this huge sprawling, weirdly fancy watering hole in the middle of nowhere. It's right next door to a huge cattle ranch. And over time, it's blossomed into a tourist destination unto itself. There's a Spanish hacienda style resort hotel, a sprawling restaurant, a gift shop with its own butcher counter. There's a roadside stand that sells bonsai trees. But in the midst of all that, it is a rest stop. There's a big Shell gas station and the largest bank of Tesla supercharger plugs in the world. And often its own little corner, the loneliest little hydrogen pump, which brings us back to where we started: trying to get fuel. I hope I didn't just break it for everybody else. I'm just gonna strand them in this lovely oasis in the desert. But I'm gonna try to just put my credit card in and start another transaction and see if that does anything. Ha-ha, 337. Without AC, we are back to about 330 miles. I think we have a full tank. We did it. Oh God. But we couldn't just piece out for LA. We had to find other hydrogen road trippers like us. So we hung out at the fuel pump in 100 degree heat and waited and waited and waited. It was a Friday evening, so we were sure we'd catch some weekend travelers, but no one showed. Eventually, we got bored and wandered over to the Tesla area. And do you take it on a bunch of road trips like this? - Oh yeah, so we live in Manteca, we go to Yosemite, we go to San Francisco. We haven't ticketed up north, but we've gone all the way to San Diego just last week. - Road trips are amazing when you have a Tesla and you have the whole thing. - Super reliable and super easy to get charging everywhere. - [Narrator] Any trouble finding charging stations or having range or any of that? - No, not at all. (light music) - Elm tree, this 30-year-old. - 30 years? - Yeah. - This 32-year-old. - A succulent, 22-year-old. - 22 years old, wow. (birds chirping) Night fell, we got hungry. We ordered dinner at the gas station convenience store, which was also a barbecue pit. We sat on a little porch looking out at the hydrogen pump. We dubbed this, sorry in advance, the stake out. We were really tired. Stake out. But then finally, around 8:00 PM- - Hey. - Someone showed. - So I guess I'll probably have to wait a little bit. Did you guys just fill up or- - [Narrator] It was earlier today. - Have you seen anybody else? - Nope. - Oh really? - No, no one else. Billy was the hydrogen road warrior we dreamed of. He lives in LA, and he's taken his Mirai up to The Bay a bunch of times. He loves the car, and he isn't too phased by the fuel situation. - 'Cause I live by a station relatively nearby. So we don't really have that problem and- - [Narrator] Gotcha. - My commute is only like eight miles. - Yeah. - One way, so. - [Narrator] Billy even told us about an alternate route between the two cities. There's a station in Santa Barbara, about 100 miles north of LA. And from there, it's a straight shot up the 101, all the way to San Jose. - It's a better drive. - Yeah, yeah. - It's more scenic drive. And at the same time you- - Little scary. - Yeah, you get a little bit anxious, because by the time you get to the next station, you have like 50 miles left. - [Narrator] Have you never run out of gas? - Ah, almost, almost. But I mean, Toyota gives you the service where you can, they'll tow it for free. - [Narrator] Yes, that is a real service Toyota offers Mirai drivers. - I have not used that at all. - Yeah. - So luckily. (laughs) - Yeah, yeah. - Knock wood. - Totally. - [Narrator] And that was it. Our hydrogen vigil was ended. We let Billy go. Took in the stale gasoline-y night air, and crashed at our hotel. We had another big day of driving ahead of us. (bright music) Day three on the road. My leg is so mad at me. Finally pulling into LA. The first station, it's in San Fernando. It's online, got plenty of hydrogen. So we'll check that out, see if there are drivers there. And then that's kind of it. Like if I zoom out, all those gray icons are offline stations. So is these three ones that are online, and then all of this is offline. Look at that, it's kind of crazy. Yeah, I think this is the worst I've seen the map honestly since we've been looking at it. (bright music) Okay, I see it. We'd heard about a month's-long hydrogen supply disruption in Los Angeles. That's why lots of the stations were offline. Not great, especially because there are more fuel cell drivers in LA than anywhere else in the state. So we wondered what's life been like for early adopters down here? - It's been awful, to be completely honest. - [Narrator] Yeah, how do you like it? - I don't like it. - The gas is just too expensive. - $36 a kilos, it's insane. - Yeah. We heard lots of familiar things. Fueling glitches, brutal prices, range anxiety. Once again, there was a lot of love for the cars. - I like the car. It runs well. - Car is perfect, no problem. - It's an amazing car. - How it drive, it's an awesome car. - [Narrator] Undercut by the experience of using them. - The truth is, when you get this car, like you have to program yourself mentally. Like you have to have calculations every distance that you're going. - It's kinda painful for me. - Yeah. - Yeah, because if you will use ordinary sedan, you'll just pay for your gas like 200 per month. But for this one, it's like 400, 450. - [Narrator] Does it feel like you're just in this kind of pilot program? - Yes. - Yeah. - But it wasn't sold like that when I got it. - [Narrator] Okay. - It was like, oh, you just go to, it's like filling up your gas at a regular station. You just go put it in and you're done. Most days, it doesn't just work. - [Narrator] It doesn't just work, yeah. And lots of the drivers agreed on one thing. What do you think you're gonna do with it long-term? - Get rid of it. - I'm trying to take it back to Toyota. - I would go to hybrid. I'm thinking of buying a hybrid now. - [Narrator] So what do you think you're gonna do with the car long term? - The resale value's very bad. (narrator laughing) (light music) - [Narrator] Before this trip, everything we'd read about the hydrogen highway made it seem like an alternate reality. A little bubble where batteries had lost and fuel cells had won. We came to California to see how much of that was real. So what can I say now about the hydrogen highway? Well, it's there, it's real, but it's hanging by a thread. California is still investing money in stations, and Toyota and others are still selling fuel cell cars. But the drivers we talked to, the picture they painted was of an exciting, frustrating experiment winding down, which might not spell the end of fuel cells as a technology. Lots of hydrogen boosters aren't throwing in the towels so much as pivoting away from passenger cars to trucking, to industrial equipment, to boats, planes, mobile power stations, other things that hydrogen could power without the need to build a fuel station every few miles across America. So is the future full of hydrogen? Maybe. Is it a highway? Maybe not. At least not the way we think of one. For now, that leaves a very few early adopters sticking with hydrogen come hell or high water, riding that highway as far as it'll take them. - I'm gonna stick with my Mirai as long as I'm in California. - So I've been standing here for five minutes trying to yank it off. - Yeah. - And sometimes, it's just, okay, like right now is a good example. - [Narrator] Okay, this has happened to me. - So it gets like really cold. Like you could tell there's like ice. - [Narrator] Oh, okay. So that's, it is just like- - Yeah, freezing.",
    "transcript_keywords": [
        "Yeah",
        "hydrogen",
        "fuel",
        "car",
        "station",
        "Fuel cell cars",
        "road",
        "stations",
        "hydrogen highway",
        "Mirai",
        "California",
        "cars",
        "fuel cell",
        "hydrogen road",
        "miles",
        "San",
        "fuel stations",
        "Los Angeles",
        "gas",
        "San Francisco"
    ],
    "transcript_entity_values": [
        "zero",
        "Harris Ranch",
        "three",
        "Two years",
        "the day",
        "about 17",
        "San Diego",
        "32-year-old",
        "San Jose",
        "40,000",
        "thousands",
        "some weekend",
        "earlier today",
        "One",
        "around 8:00 PM- - Hey",
        "around 50",
        "50-ish",
        "Mirai",
        "Rebecca",
        "Most days",
        "Harris Ranch",
        "400",
        "200",
        "third",
        "15,000",
        "Sunnyvale",
        "450",
        "Toro",
        "Spanish",
        "every few miles",
        "Billy",
        "30-year-old",
        "20 miles",
        "Yosemite",
        "Toyota",
        "the Bay Area",
        "LA",
        "first",
        "Mirai",
        "2004",
        "Friday",
        "22-year-old",
        "337",
        "Today",
        "101 degrees",
        "50 miles",
        "Mirai",
        "Cupertino",
        "about 100 miles",
        "Tesla",
        "Silicon Valley",
        "about 320 miles",
        "Rupesh",
        "California",
        "AC",
        "only like eight miles",
        "36",
        "more than $250 million",
        "about 330 miles",
        "Shell",
        "Santa Barbara",
        "about four months",
        "100 degree",
        "evening",
        "less than 40",
        "second",
        "22 years old",
        "only 23,000 miles",
        "1.3",
        "just last week",
        "San Francisco",
        "13 years",
        "First",
        "Los Angeles",
        "five kilogram",
        "one",
        "65 miles",
        "The Bay",
        "101",
        "San Fernando",
        "180",
        "Arnold Schwarzenegger",
        "Stick",
        "30 years",
        "two years",
        "America",
        "Tesla",
        "five minutes",
        "two",
        "about 70",
        "36 bucks",
        "so many zero",
        "Manteca",
        "Mirai",
        "this weekend"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "NORP",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "GPE",
        "ORG",
        "LOC",
        "GPE",
        "ORDINAL",
        "NORP",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "GPE",
        "QUANTITY",
        "ORG",
        "LOC",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "ORDINAL",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "GPE",
        "MONEY",
        "PERSON",
        "FAC",
        "DATE",
        "DATE",
        "GPE",
        "LOC",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.004243258852511644,
        0.003942656796425581,
        -0.0006027552881278098,
        0.037871360778808594,
        0.06232102960348129,
        0.0025344081223011017,
        -0.07435829192399979,
        0.06321655213832855,
        -0.056703489273786545,
        -0.060984909534454346,
        -0.014581263065338135,
        -0.008786016143858433,
        -0.005523581989109516,
        0.022847436368465424,
        0.039215389639139175,
        -0.013928969390690327,
        0.06934038549661636,
        -0.17625215649604797,
        0.003263992490246892,
        -0.0021239190828055143,
        0.033100806176662445,
        -0.05357623100280762,
        0.0659361407160759,
        0.013172819279134274,
        -0.006455505732446909,
        0.04165322706103325,
        -0.00776955159381032,
        0.04158040136098862,
        -0.08376819640398026,
        -0.037884633988142014,
        0.014567513950169086,
        0.07803647220134735,
        0.007140765897929668,
        -0.05318581312894821,
        0.034700170159339905,
        0.02903064526617527,
        0.02360275387763977,
        -0.015972532331943512,
        0.0805470272898674,
        0.006615313235670328,
        -0.039689723402261734,
        -0.13202768564224243,
        0.014823599718511105,
        0.008845905773341656,
        -0.016401559114456177,
        -0.03477120026946068,
        0.05367385596036911,
        -0.08862750232219696,
        0.033723752945661545,
        -0.108229860663414,
        -0.03882641717791557,
        -0.03927680850028992,
        0.10113373398780823,
        -0.03805048018693924,
        0.005436744540929794,
        -0.017962928861379623,
        0.030856801196932793,
        0.019638746976852417,
        0.03758674114942551,
        -0.03578045964241028,
        -0.02157573401927948,
        -0.09232611209154129,
        0.019650978967547417,
        -0.006814240477979183,
        -0.06876324117183685,
        -0.02970556542277336,
        -0.005882146768271923,
        0.01040969043970108,
        0.005117792636156082,
        -0.03100280463695526,
        0.02597227320075035,
        0.012840806506574154,
        -0.009852307848632336,
        -0.025553632527589798,
        0.009199322201311588,
        -0.013457613997161388,
        0.12893295288085938,
        0.021421808749437332,
        0.030006255954504013,
        -0.06821088492870331,
        0.04188190773129463,
        -0.056791871786117554,
        -0.0774395540356636,
        -0.04957980662584305,
        -0.009523335844278336,
        0.010617636144161224,
        -0.004582041408866644,
        -0.03826293721795082,
        0.0018870830535888672,
        0.0072025153785943985,
        -0.07631217688322067,
        -0.0031551735009998083,
        0.04745561629533768,
        -0.009422654286026955,
        -0.029695531353354454,
        0.06548403948545456,
        -0.032928600907325745,
        -0.08281328529119492,
        0.0709780901670456,
        -0.0655703991651535,
        0.0516992062330246,
        0.054599329829216,
        -0.017608104273676872,
        -0.04297938942909241,
        -0.00846419483423233,
        0.010275806300342083,
        -0.06803561002016068,
        0.10497281700372696,
        0.07898396253585815,
        -0.04750523716211319,
        0.08218309283256531,
        -0.013105426914989948,
        0.025983555242419243,
        0.008143304847180843,
        -0.14133237302303314,
        0.06268485635519028,
        0.010428269393742085,
        -0.0028160568326711655,
        0.030839823186397552,
        0.018858367577195168,
        -0.04198100045323372,
        -0.034160275012254715,
        0.04548308625817299,
        0.01842266134917736,
        0.09434069693088531,
        0.026598772034049034,
        -0.06048246845602989,
        4.593895105834856e-33,
        -0.026856418699026108,
        -0.022796742618083954,
        -0.030495749786496162,
        0.00021157936134841293,
        0.03300371393561363,
        0.002649970119819045,
        -0.03307395800948143,
        -0.002752222353592515,
        0.0193308275192976,
        -0.0673290342092514,
        -0.0002895986835937947,
        -0.017078567296266556,
        0.0159232746809721,
        -0.03224816173315048,
        -0.05432450398802757,
        -0.10229048877954483,
        -0.076781265437603,
        -0.07909594476222992,
        -0.11953972280025482,
        -0.0624842569231987,
        0.028648847714066505,
        -0.02195814624428749,
        0.017652297392487526,
        -0.028790490701794624,
        0.0459415502846241,
        -0.012192528694868088,
        0.10855235159397125,
        -0.042024172842502594,
        0.024545643478631973,
        0.05178710073232651,
        -0.07935360074043274,
        0.015521591529250145,
        -0.022892339155077934,
        0.05056516453623772,
        0.017824435606598854,
        0.03902694210410118,
        -0.022366046905517578,
        -0.02474338747560978,
        -0.07341477274894714,
        -0.030457263812422752,
        -0.01663408987224102,
        0.026410512626171112,
        -0.08258597552776337,
        -0.022717414423823357,
        -0.004352661781013012,
        0.007771901320666075,
        0.10703504085540771,
        -0.010375868529081345,
        -0.041294511407613754,
        -0.012066705152392387,
        -0.07511691004037857,
        0.008036642335355282,
        0.017676085233688354,
        -0.029860327020287514,
        0.02973637357354164,
        0.05214168503880501,
        0.026693148538470268,
        -0.06225039064884186,
        0.018901269882917404,
        -0.01011977531015873,
        -0.06554470956325531,
        0.1304924041032791,
        -0.08511277288198471,
        0.019645050168037415,
        -0.08475598692893982,
        0.05883833393454552,
        0.026404552161693573,
        -0.019384341314435005,
        -0.023426977917551994,
        0.1079670637845993,
        0.09591806679964066,
        -0.053619153797626495,
        -0.020887115970253944,
        -0.0023524246644228697,
        0.05334896594285965,
        0.038039833307266235,
        -0.00925755500793457,
        -0.03907142952084541,
        0.011847672052681446,
        -0.014716130681335926,
        -0.005035792477428913,
        -0.002848750213161111,
        0.09557785093784332,
        0.009162282571196556,
        0.11375301331281662,
        -0.048416249454021454,
        -0.011063860729336739,
        -0.07458556443452835,
        -0.01223329734057188,
        0.005080047994852066,
        -0.022342780604958534,
        -0.040940407663583755,
        0.08784288913011551,
        -0.00798695720732212,
        -0.012707511894404888,
        -6.014044361209817e-33,
        0.03564779460430145,
        0.06713079661130905,
        0.021164819598197937,
        -0.026178214699029922,
        0.09788867086172104,
        0.0039590769447386265,
        0.054962001740932465,
        -0.06251206994056702,
        0.03872176632285118,
        -0.05622591823339462,
        -0.09445114433765411,
        0.008699205704033375,
        -0.0003082828188780695,
        0.008857239037752151,
        0.032912567257881165,
        -0.05053234472870827,
        0.04433710128068924,
        -0.06423471868038177,
        -0.05698694661259651,
        0.01628665067255497,
        0.011752285063266754,
        -0.02639003098011017,
        -0.035719115287065506,
        0.06220516189932823,
        0.025225825607776642,
        0.02707521617412567,
        0.02614551968872547,
        0.07524529844522476,
        0.002175530418753624,
        -0.02800358273088932,
        -0.05608091503381729,
        -0.028619088232517242,
        -0.01039142906665802,
        -0.051097720861434937,
        -0.04758528620004654,
        0.05077139660716057,
        0.02638387307524681,
        0.012017275206744671,
        -0.05466444417834282,
        -0.01845928467810154,
        0.005941359326243401,
        -0.1259375810623169,
        -0.007959473878145218,
        0.007329693529754877,
        -0.09451979398727417,
        0.017628615722060204,
        -0.06785818934440613,
        0.016626616939902306,
        -0.014298760332167149,
        0.10720784962177277,
        0.003997574094682932,
        -0.002836354309692979,
        -0.06579163670539856,
        0.08247288316488266,
        -0.04162517189979553,
        -0.0648500844836235,
        0.09560347348451614,
        0.13192656636238098,
        -0.08682426065206528,
        0.00925889890640974,
        0.02790065109729767,
        0.022844301536679268,
        0.06799402832984924,
        0.04570282623171806,
        -0.02203497476875782,
        -0.12569819390773773,
        0.06119008734822273,
        -0.05307439714670181,
        0.012595213018357754,
        -0.027754776179790497,
        0.03780500218272209,
        -0.014855769462883472,
        -0.08671696484088898,
        0.019595647230744362,
        -0.07234279811382294,
        0.022810226306319237,
        -0.034440021961927414,
        -0.02748737297952175,
        0.03052377700805664,
        -0.034804269671440125,
        0.05285629630088806,
        0.031019452959299088,
        0.006750280037522316,
        0.03291366249322891,
        0.10033533722162247,
        0.036920808255672455,
        -0.05457037314772606,
        -0.0004788072546944022,
        0.02545648254454136,
        0.06194611266255379,
        0.010328339412808418,
        0.004358437843620777,
        -0.09727305173873901,
        0.0699954554438591,
        -0.057426806539297104,
        -5.345675191392729e-08,
        0.023090645670890808,
        0.010391213931143284,
        -0.0007342954631894827,
        -0.015823857858777046,
        0.054705455899238586,
        -0.0266327615827322,
        0.0434875451028347,
        0.049861595034599304,
        0.002545655006542802,
        0.02872919663786888,
        0.06896854192018509,
        0.04889947921037674,
        0.07389402389526367,
        -0.0011394063476473093,
        -0.02839338406920433,
        -0.008703540079295635,
        0.06304597854614258,
        -0.012218184769153595,
        -0.046176373958587646,
        0.014134064316749573,
        -0.038033127784729004,
        -0.012172054499387741,
        -0.10589170455932617,
        0.026654794812202454,
        0.06848492473363876,
        -0.005471342708915472,
        -0.06914985924959183,
        -0.010673980228602886,
        0.06398050487041473,
        -0.11471646279096603,
        -0.05893563851714134,
        0.025662971660494804,
        0.020182767882943153,
        0.007216761354357004,
        0.02146468125283718,
        -0.027385441586375237,
        0.019444046542048454,
        0.017994657158851624,
        0.006675193086266518,
        0.03169991448521614,
        0.060299310833215714,
        0.009182860143482685,
        -0.01868314854800701,
        0.010594464838504791,
        -0.050463784486055374,
        -0.013894215226173401,
        -0.1110074371099472,
        -0.013948919251561165,
        0.004904629662632942,
        0.10776619613170624,
        -0.0199762973934412,
        -0.09605102986097336,
        -0.007204916328191757,
        0.04815610125660896,
        0.07722863554954529,
        0.061805982142686844,
        -0.08679462969303131,
        -0.029255127534270287,
        -0.012184804305434227,
        0.02434167079627514,
        0.11687184125185013,
        0.0015677077462896705,
        0.017873814329504967,
        0.04793018847703934
    ]
}