{
    "id": "MCDEY2MFnF8",
    "title": "Why I Like The OnePlus 6",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-06-09T22:01:10Z",
    "video_url": "https://www.youtube.com/watch?v=MCDEY2MFnF8",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "One",
        "Plus",
        "OnePlus",
        "OnePlus 6",
        "OP6",
        "Best budget smartphone",
        "best cheap smartphone",
        "versus",
        "s8",
        "s8+",
        "samsung",
        "best phone for $500",
        "best $500 smartphone",
        "smartphone"
    ],
    "views": 554451,
    "likes": 16895,
    "comments_count": 1730,
    "description": "My review on the OnePlus 6 after using it for about a month. Solid device but very much a OnePlus device. I'd consider it the best $500 phone on the global market. Neon Green Tea -  Teal Glass Jar -   Background Music: Fili - Up Coast  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2JH0FFu",
        "https://amzn.to/2McxjNF",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Ready? It's going? Hey, how's it going? (the man the myth) Dave 2D here. So this is being shot on a OnePlus 6 So it's gonna look and sound quite different from my regular videos, but this is a video about the OnePlus 6. Hence the... \"different look\" and sound... so I wasn't gonna do a regular review on this phone, but I like this phone enough that I felt like it deserved some kind of video some kind of discussion about my experience about this phone so I'm gonna do this video in kind of three stages I'm gonna talk about things that really like about it- No, you know what? Let's talk about things that I don't like about it first, then I'll talk about things I'm okay with, then I'll kind of close off with things that I do like about this one. The thing that I dislike about this one the most is the speaker. By far it is the thing that sticks out as being like it's worst feature It's tinny, it's mono and in 2018 so many phones out there are bringing stereo speakers that sound good that just really sticks out as being \"subpar\", In the industry. The other than that don't love about this phone. It's the brand It's like not the brand OnePlus but their support, OnePlus's support of their phones isn't amazing The industry, like the phone industry doesn't have great support to begin with Apple and Google stick out as being good ones. The rest are kind of ehh, and this is one of them Things that I'm okay with about this phone; The camera. It's kind of like, it's a camera that... some people say is really good for the money like because it's a $530 phone it's really good; other people say it's a trash camera because objectively speaking It's not particularly great. My stance on it is this: It's not a camera that you would kind of be like \"Hey, this is an amazing camera\" Definitely not that and it's certainly not improved that much from the previous generation So the OnePlus 5, OnePlus 5T had a relatively similar looking image to this camera. This.. The hot(?), the dynamic range in this is improved, but across the board. It's not a massive improvement. I would consider it like a... B-Tier Camera. But I consider it also a good enough camera like not- Forget about the price It's a camera that if you needed to take a shot, you double tap to get the camera open It's a fast. It's like, it's quick, it gets job done and it captures whatever memory you're trying to capture that's what it's good for if you want to have like You know want to zoom into photos and kind of example(lol) the pics examine the pixels and and kind of like Really drill down to these photos. You will find flaws in it You will find things that you dislike about the images but for most people I really mean this for most people this is a great camera, but for the hardcore photographers, Look elsewhere... Okay other things I really like about this thing Or I guess let's move on to things that I do like with this cam- about this phone the build quality I think that's actually one of its most unique features: The glass backs. Like you have three glass options and two of them have this kind of like matte finish this like satin kind of textured glass. I really like that feel It's not something that you see often on other flagship devices And it just it really makes the OnePlus phone this year stick out as being something \"aesthetically special\" and something that I found is that the textured material. I thought this would scratch or scuff... relatively easily because it's... I mean on a lot of kind of satin finished... products, this finish will kind of wear out quickly if you scratch it. I've brought keys up to this thing, it's very very durable. It is Gorilla Glass 5 and it's strong. It's a nice looking material and it's also a very durable material. Other things I like about this phone: The Software Oxygen OS is something that... Well if you've never used a OnePlus device and you're kind of interested in it It's a very stock feel. It's not super smooth. Like if you're looking for the absolute smoothest Android experience you're gonna have to go to a Pixel device. But these are quite smooth and it's very fast device. Like, the processor in here is like the fastest the Snapdragon 845. It's a very fast device, but it's not the smoothest device out there very smooth, but not the smoothest. Um Other things I like about the software, is like They have features on the OnePlus phones that are Like they don't put stupid stuff on here that you see on other phones. Like, every feature in here has some utility. Like there's no superfluous crap that they're just trying to stick in here So they just kinda like \"one-up\" other companies in terms of like the feature race They don't do that .The obstin- The OxygenOS feels pretty lean and things like; okay so, Face Unlock This is something that they didn't invent, but they do it really well, It's super fast and they do this thing that at night... If you have like the iPhone So the iPhone X if you try to use face unlock on this at night, It's difficult and you kind of... A iPhone or iPhone X user out there, They know this like if you try to use a phone at night you bring it up to your face, and it has problems recognizing your face The OnePlus phones they do this thing where if it's nighttime and you're trying to unlock it with your face, it'll shine a light onto your face to just make it easier for the camera to identify your face. And stuff like that, that is across the software. It's just it's so- it's smart and it's not like super difficult to implement, but they do it and it just makes the software feel kind of complete. So I want to talk about one last thing. It's the big thing on this phone. It's the price. So, this is a $530 phone. and I think there's a lot of like kind of- People take that price tag with Different opinions and I think a lot of it comes from the fact that there's like regional differences in pricing. So, in US, A $530 phone isn't that special. because you can get really really good phones for that price as well. For ex- as an example like the S8 and like the S8+, you can get those for like $500 bucks right now $550 bucks and those are really good phones. So when you look at a used or refurbished Samsung S8. And you compare to this... the S8 has a better camera, t's got a better... Like it's just a better phone overall So when you look at this, it doesn't seem like a special phone... So, A lot of people that look at like discussions about phones and prices like, they don't really see the value of this phone, because it's like \"Wow, like I can just go onto Craigslist or Ebay and find a $530 phone that's better than the OnePlus\" But, that only applies to the US If you look outside of there, like if you look at Canada or most parts of Europe, the pricing on this thing really sticks out as being something special. It's(x3)... It's not just special. You can't get a better phone, With the features that this phone has for that price. Like I would say the competitor to this, in terms of like specs, for the money... would probably the Xiaomi phone (Mi 8) That's like $500 Yeah, it's around $500. After you import and stuff like that. And that is comparable to this. But aside from that Xiaomi Mi 8. There's nothing on the market that hits this... So, if you want like the fast phone, like really really fast specs and like a pretty good camera and like the full package... I don't think that there's a better phone than this \"brand-new\"... Now, if you live in the US You can probably pick up other phones You can get like a $600 S9 right now... Which is like so much better than this and, I think if you're in that market and you can pick up a $600 used S9... Then, This doesn't look that appealing. But everyone else in the world if you're looking for that $500 phone, this should be the one that you look at. Like, it should be on the short list. At the top of the short list. Because I really like it. I think most of the world likes it. It's a good phone. Okay. That's basically it. This was like a really rambly video. I Don't think you guys will like it, but I'm probably gonna publish it. Anyways. Okay. Hope you guys enjoyed it Thumbs be liked it. Subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "phone",
        "kind",
        "camera",
        "things",
        "phones",
        "thing",
        "OnePlus",
        "good",
        "Face",
        "good phones",
        "OnePlus phones",
        "people",
        "fast",
        "device",
        "price",
        "special",
        "video",
        "glass",
        "talk",
        "Software"
    ],
    "transcript_entity_values": [
        "$550 bucks",
        "Europe",
        "three",
        "Samsung S8",
        "Dave",
        "600",
        "Face",
        "Craigslist",
        "one",
        "this year",
        "S9",
        "Apple",
        "iPhone",
        "this at night",
        "Google",
        "OnePlus",
        "530",
        "Mi 8)",
        "2018",
        "the OnePlus 6",
        "two",
        "US",
        "first",
        "500",
        "S8",
        "Ebay",
        "B-Tier Camera",
        "Canada",
        "OnePlus 5",
        "OnePlus",
        "Xiaomi Mi",
        "around $500"
    ],
    "transcript_entity_types": [
        "MONEY",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "EVENT",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "MONEY"
    ],
    "vector": [
        -0.05837012454867363,
        -0.00015704688848927617,
        0.06254690885543823,
        -0.06185963377356529,
        0.0365520603954792,
        0.0017004824476316571,
        -0.010455748997628689,
        0.06927479058504105,
        0.029314080253243446,
        0.028864800930023193,
        -0.036854542791843414,
        0.026326673105359077,
        -0.0110634109005332,
        -0.046727221459150314,
        0.019281048327684402,
        -0.0479087308049202,
        0.0892486721277237,
        -0.12574872374534607,
        -0.0923861488699913,
        0.016055408865213394,
        0.011305849999189377,
        -0.023513630032539368,
        0.0791337639093399,
        -0.008348260074853897,
        0.05607059225440025,
        -0.01020318828523159,
        -0.05555979534983635,
        0.0489080473780632,
        -0.012765921652317047,
        -0.10044167190790176,
        0.08452341705560684,
        0.15086862444877625,
        -0.036438290029764175,
        -0.013388769701123238,
        -0.05601810663938522,
        -0.06256496161222458,
        0.08557956665754318,
        -0.021977845579385757,
        -0.06607141345739365,
        -0.02689429372549057,
        0.011583030223846436,
        0.011260892264544964,
        0.003542315913364291,
        -0.013848264701664448,
        -0.009777533821761608,
        -0.010950029827654362,
        0.023596802726387978,
        -0.06611556559801102,
        0.017835918813943863,
        -0.09539058804512024,
        0.021329613402485847,
        -0.030379021540284157,
        0.07444311678409576,
        -0.05503535643219948,
        -0.08367801457643509,
        0.04695897549390793,
        -0.03635422885417938,
        -0.02097059227526188,
        0.0932445377111435,
        -0.07529281824827194,
        0.07624683529138565,
        -0.051810938864946365,
        0.02827918902039528,
        0.09857821464538574,
        0.0344000943005085,
        0.004345294088125229,
        -0.021514520049095154,
        -0.08012229949235916,
        0.007970696315169334,
        -0.01848103664815426,
        -0.06977198272943497,
        0.0341922752559185,
        0.06305930018424988,
        0.04887072741985321,
        0.003452308475971222,
        0.05771717429161072,
        0.06238101050257683,
        -0.030080951750278473,
        -0.05592566728591919,
        0.015282397158443928,
        0.06812119483947754,
        -0.044671766459941864,
        -0.049365293234586716,
        -0.07429927587509155,
        0.03084230236709118,
        0.006007424555718899,
        0.08003773540258408,
        0.02107718586921692,
        -0.07306375354528427,
        -0.08971154689788818,
        0.028171343728899956,
        0.14144323766231537,
        0.021607428789138794,
        0.005115939769893885,
        -0.04118257015943527,
        0.025598153471946716,
        -0.08478738367557526,
        -0.07465273886919022,
        -0.02342086285352707,
        0.04301426559686661,
        0.05762273445725441,
        0.03321072831749916,
        0.022850360721349716,
        -0.027077175676822662,
        0.026396045461297035,
        -0.07908347994089127,
        -0.058329787105321884,
        0.013898124918341637,
        0.07996979355812073,
        0.02878446690738201,
        -0.04022470861673355,
        0.007392996922135353,
        -0.03137537091970444,
        0.06283528357744217,
        0.045427460223436356,
        0.08869180828332901,
        -0.09891313314437866,
        0.07822177559137344,
        0.08137635886669159,
        -0.036226384341716766,
        0.037769872695207596,
        -0.0720529556274414,
        -0.05824153125286102,
        0.003718699561432004,
        -0.010934609919786453,
        -0.050967033952474594,
        -0.006728334818035364,
        1.0283314658700735e-36,
        0.016987692564725876,
        0.09062180668115616,
        -0.05660867318511009,
        0.03614051267504692,
        0.025336366146802902,
        -0.039318256080150604,
        -0.002274877857416868,
        -0.01582355797290802,
        -0.061979830265045166,
        0.05386662483215332,
        -0.035235125571489334,
        -0.014951062388718128,
        -0.05535291135311127,
        0.06348271667957306,
        0.009615442715585232,
        -0.04868417978286743,
        -0.06255181133747101,
        -0.0234222412109375,
        0.024764614179730415,
        0.01977451890707016,
        0.04298723489046097,
        -0.0021942995954304934,
        -0.01183322723954916,
        -0.003243005136027932,
        0.11611326783895493,
        0.022467266768217087,
        0.08167609572410583,
        -0.022131340578198433,
        0.1013728454709053,
        0.01557435467839241,
        -0.1368112564086914,
        -0.00687058549374342,
        -0.005465968511998653,
        -0.032103169709444046,
        0.004088575020432472,
        0.016256902366876602,
        -0.05966445803642273,
        -0.010429468005895615,
        0.019598545506596565,
        -0.07636070996522903,
        -0.05875712260603905,
        0.05005669966340065,
        -0.13198718428611755,
        0.026628490537405014,
        0.004722875077277422,
        -0.0044580078683793545,
        0.005420265719294548,
        -0.005772922653704882,
        -0.04202210530638695,
        -0.016047345474362373,
        -0.04376129433512688,
        -0.011990138329565525,
        0.0108192702755332,
        0.01852651871740818,
        -0.048380885273218155,
        -0.003122993279248476,
        0.06379112601280212,
        -0.016930537298321724,
        0.1040773019194603,
        0.04699718579649925,
        0.05782589316368103,
        -0.008589738048613071,
        -0.05824686959385872,
        0.05822159722447395,
        -0.11715871840715408,
        0.05113257095217705,
        0.01771624945104122,
        -0.024459730833768845,
        -0.030194640159606934,
        0.02819790318608284,
        -0.03175530955195427,
        -0.034306082874536514,
        0.03911571577191353,
        -0.045780058950185776,
        0.03651158884167671,
        0.005671725142747164,
        -0.03349277749657631,
        -0.06104312464594841,
        -0.006297519896179438,
        0.02052728459239006,
        0.022014081478118896,
        -0.016774527728557587,
        -0.0210269708186388,
        0.020328016951680183,
        0.00481100520119071,
        -0.010148019529879093,
        -0.006419240031391382,
        -0.07988101243972778,
        -0.0018923592288047075,
        0.07154065370559692,
        0.035387683659791946,
        -0.013523297384381294,
        -0.032335348427295685,
        0.018404239788651466,
        0.07676895707845688,
        -1.4208778782014784e-33,
        -0.04870662838220596,
        0.03812661021947861,
        -0.0007550197769887745,
        0.003375164931640029,
        0.020831715315580368,
        -0.011869382113218307,
        0.05544392019510269,
        0.08276476711034775,
        0.054876867681741714,
        -0.038811080157756805,
        0.01577482372522354,
        -0.022064179182052612,
        -0.06369031220674515,
        -0.023950781673192978,
        -0.038994915783405304,
        -0.051424067467451096,
        0.07918473333120346,
        -0.04189753904938698,
        0.07307250797748566,
        0.029458262026309967,
        0.01796657219529152,
        0.009320387616753578,
        -0.06395339220762253,
        0.018449176102876663,
        -0.06994525343179703,
        0.07228554785251617,
        0.008828362450003624,
        -0.027468815445899963,
        0.01133342832326889,
        -0.01838294044137001,
        0.010679103434085846,
        -0.024766143411397934,
        -0.011622109450399876,
        -0.004266136325895786,
        0.02960815653204918,
        0.059761207550764084,
        0.04155950993299484,
        -0.04409472644329071,
        0.008866569958627224,
        -0.04928048700094223,
        0.025841986760497093,
        0.07902095466852188,
        0.01654965803027153,
        -0.0555751733481884,
        0.04263056069612503,
        -0.09417799115180969,
        0.009898832999169827,
        0.0292042326182127,
        -0.05767856538295746,
        0.04770728200674057,
        0.02992124855518341,
        0.09380562603473663,
        0.033092983067035675,
        -0.018742090091109276,
        0.022970320656895638,
        -0.09829556196928024,
        0.040366653352975845,
        -0.05940519645810127,
        -0.06282156705856323,
        0.04672064259648323,
        0.06570376455783844,
        0.05297524109482765,
        -0.03792262449860573,
        -0.03100060112774372,
        -0.05900956317782402,
        0.012459776364266872,
        0.10027002543210983,
        -0.0014518998796120286,
        0.027167486026883125,
        0.04078543931245804,
        -0.01584986411035061,
        -0.045078177005052567,
        -0.05636787787079811,
        -0.0859936848282814,
        0.07471531629562378,
        0.032066695392131805,
        -0.1084846556186676,
        -0.029059695079922676,
        0.01900571398437023,
        0.01697416603565216,
        -0.04649687558412552,
        0.019986139610409737,
        0.01271078921854496,
        0.008910628966987133,
        0.10639246553182602,
        -0.01084272749722004,
        0.11228387802839279,
        0.03734838217496872,
        -0.05393597483634949,
        -0.004224962089210749,
        0.03646594285964966,
        0.019504517316818237,
        -0.06614304333925247,
        0.027298862114548683,
        0.08308190107345581,
        -5.2115119331119786e-08,
        0.022618183866143227,
        -0.09785410761833191,
        0.06281261891126633,
        -0.0031454197596758604,
        0.014807643368840218,
        -0.05619151145219803,
        0.03934702277183533,
        -0.0017983263824135065,
        0.04835688695311546,
        -0.033352311700582504,
        -0.0341884084045887,
        -0.02190491370856762,
        -0.1153315007686615,
        0.027761397883296013,
        -0.007861964404582977,
        0.05668884515762329,
        -0.053397368639707565,
        0.06442650407552719,
        -0.02401534467935562,
        0.03861558809876442,
        -0.0005531184142455459,
        0.024002496153116226,
        0.029571525752544403,
        -0.1248413622379303,
        0.09327977150678635,
        0.048063311725854874,
        0.0027507031336426735,
        0.015263810753822327,
        0.06317727267742157,
        -0.02846127562224865,
        -0.06993771344423294,
        -0.03157070651650429,
        -0.09833437204360962,
        -0.011096005327999592,
        -0.02516273409128189,
        -0.062432534992694855,
        -0.01936078816652298,
        0.02552005834877491,
        0.04547644779086113,
        0.01776024140417576,
        -0.003427100135013461,
        -0.016663454473018646,
        0.03843555226922035,
        0.054746583104133606,
        -0.04112716391682625,
        0.0066786580719053745,
        -0.0491684190928936,
        -0.12304337322711945,
        -0.03127904608845711,
        0.03961567580699921,
        -0.06045083329081535,
        -0.03951869532465935,
        -0.02261365018785,
        -0.03478113189339638,
        0.014725489541888237,
        0.020668869838118553,
        -0.021637262776494026,
        0.08183649927377701,
        -0.04279915243387222,
        0.04303836449980736,
        0.03474351018667221,
        -0.06750492006540298,
        -0.008404823020100594,
        0.06865164637565613
    ]
}