{
    "id": "mcW88-USgGA",
    "title": "I'm in LOVE with this mouse! - Logitech G Pro X Superlight",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-23T21:29:21Z",
    "video_url": "https://www.youtube.com/watch?v=mcW88-USgGA",
    "category": "Science & Technology",
    "tags": [
        "Logitech",
        "G Pro Wireless",
        "Logitech G Pro X Superlight",
        "Gaming",
        "PC",
        "Mouse",
        "Mice",
        "PTFE",
        "Non-Slip",
        "60 grams",
        "Wireless",
        "Hero Sensor",
        "DPI",
        "Glide Pads",
        "FPS",
        "Best",
        "Keyboard",
        "Peripherals"
    ],
    "views": 511174,
    "likes": 18698,
    "comments_count": 1741,
    "description": "Get $25 off all pairs of footwear using offer code SHORTCIRCUIT at   The Logitech G Pro Wireless is the gold standard of wireless gaming mice for it being lightweight, accurate, and just overall a great performer. How did they make it even lighter and better?   Buy Logitech G Pro X Superlight Wireless Mouse On Amazon (PAID LINK):  On Best Buy (PAID LINK):   Buy Logitech G Pro Wireless Mouse On Amazon (PAID LINK):  On NewEgg (PAID LINK):  On BHPhoto (PAID LINK):  On Best Buy (PAID LINK):   Buy Glorious PC Gaming Model O Wireless Mouse On Amazon (PAID LINK):   Buy Steelseries Aerox 3 Wireless Mouse On Amazon (PAID LINK):  On Best Buy (PAID LINK):   Buy Razer Viper Ultimate Wireless Mouse On Amazon (PAID LINK):  On NewEgg (PAID LINK):  On Best Buy (PAID LINK):   Buy Razer Huntsman Mini  On Amazon (PAID LINK):  On NewEgg (PAID LINK):       Buy ASUS ROG Swift PG259QN 360hz Monitor On Amazon (PAID LINK):  On BHPhoto (PAID LINK):    Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.vessi.com/shortcircuit",
        "https://geni.us/UFTfk",
        "https://geni.us/tqX9npC",
        "https://geni.us/h8Af",
        "https://geni.us/ZA1tBX",
        "https://geni.us/Q5i7GYY",
        "https://geni.us/Or8tu0R",
        "https://geni.us/qg2pk",
        "https://geni.us/oj0XOe",
        "https://geni.us/SoCXKB",
        "https://geni.us/IM0HQb",
        "https://geni.us/UwtHErt",
        "https://geni.us/AC8lQ2",
        "https://geni.us/sirSXGQ",
        "https://geni.us/HK2T",
        "https://geni.us/DBjexh",
        "https://geni.us/kZzXjLQ",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- All right. Today we're gonna unbox the G PRO X Super Light which is the iteration on the G PRO. And as you may or may not know the G PRO is kind of the go-to gaming mice. It's what most gaming pros use. There's certainly a variety of choices but this is the one you'll see the most. It's been the most consistent, It's got a great sensor, pretty good buttons, okay reliability, but it just works, it feels good, every button feels good and it does what you need it to do. And it's been one of the lightest mice of its form factor since it came out. But now, it's even lighter. What used to be 80 grams is now 63 grams. So let's get into this. I'm so excited. We have the white and the black. I don't know if it's a special edition white, on the previous G PRO, there was the Ghost, it was white. And that was just like a limited time thing. So hopefully they have two options even though I definitely will not use white. My hands are just too gross for that. I had a PS5 controller in my hands all weekend, and by the end of the weekend it was definitely a shade dirtier. All right. So here we go. Pretty nice feeling box. We got all the Esports team logos on the side because you have to know this thing as hardcore. It's pretty nice minimal box. (tapping sounds) This is the hardest part of every on box. And it's like a drummer, a little bit. I'm breaking stuff. And there it is. It's a G PRO. It looks exactly the same. At first glance I would have a hard time telling the difference. At first hold I've a hard time telling the difference It feels like about the same shape. The scroll wheels, are a different color which I like this nice little white accent. I think that looks good. Buttons feel the same. The side buttons are just about the I think they're the exact same size. So as I said, this mouse is super light. It's almost 25% lighter than the previous G PRO which was already really light. And in order to get it quite that light they had to obviously cut that weight in many places. So they cut like five grams off the PCB of the mouse. They cut a little bit off the body of the mouse. They took out the Powerplay magnet. So I'm gonna test later if there's still some form of Powerplay or if it's just straight gone in this. - [Linus] What? - Yeah, it's gone. - [Linus] No more Powerplay? - Yeah. Sorry. You and the 12 other people using it. - [Linus] Powerplay's frikkin' awesome! - I don't doubt it, but how many of you in the audience are actually using Powerplay? I wanna know. (Linus Chuckles) - [Jono] It's great. - (laughing) You said that. All right. I guess before we go too deep in the mouse, let's keep unboxing. Let's see what else is here. So you get another little box inside, a box-box exception. My favorite kind of exception, I guess. Nice. That's it for the box-box? So you get your dongle, your PRO X dongle X. That's how you know it's hardcore like the previous G PRO it goes right into the mouse which I think is an absolute necessity on wireless mice or else you will lose that dongle. Anytime you move it. It has a little adapter, which is nice. So you can use the charging cable and plug in the dongle here so that you can have it closer to your mouse. I find that I generally wanna have my dongle above the desk sometimes, maybe it's just like a psychological thing but having the proximity, nothing in between, it makes me feel better about it. So that's what I'm going to do today. This cable feels okay because it's not a wired mouse and you're not expected to use it. It's just like a plastic rubbery kind of feel. That's fine. What's kind of annoying is Micro-B . We're past that. We're way past that consoles are USB-C and I get it. Micro-B is a lighter connector than type C, but I think I'm ready to make that sacrifice of like one to two grams to get type C on everything. I'm sick of having all these different connectors, the perfect connector exists. It's called USB-C Logitech, get it. (laughing) All right. Inside here, we have more things. Oh, that's cool. So inside you get another little replacement for this disc, for this cover, but actually has the glide, the extra glide pad, which I think is really cool. I think it's actually, I think it's pretty cool that they've designed this mouse, even though it's lighter they put more glide pads. So you can see in comparison to the previous one, yeah. That's sweet. Like even around the sensor they have that. The sensor is the HERO sensor. It's 25K DPI. So this sensor, the HERO sensor is the classic Logitech one. It's great. This one does up to 25,000 DPI, but higher DPI isn't what matters, It's the IPS. So this does 400 inches per second and that's how fast it can track movement. Higher DPI isn't actually an indicator of the quality of the sensor. Yeah. In terms of body, if you've held a G PRO you've basically held this, just remove 20 grams. Logitech really does make some of the best mice. So also in the box is some kind of texture rubber-pads. If you don't like the texture of the G PRO you could put these on. It's a lot stickier. I think that would kinda get gross pretty quick. I wouldn't use that, yeah. It's up to you. G sticker, cleaning pad, I guess. All right. I think that's it for the outside. I'm really excited to plug it in, but before we do, let's talk about our sponsor Vessi. Vessi Footwear is known for being waterproof and lightweight and comfortable. Their diamond text material makes it breathable too. And it'll keep your feet cool in the summer and warm in the winter. They have everyday styling that most occasions they're gonna keep your feet dry for the wet future months that are coming up. Oh, so miserable. They have a black Friday sale right now. So don't miss out. If you did miss out you can still save $25 with our offer code shortcircuit@vessi.com/shortcircuit. Right? So that's what the white one looks like, like the black one, but white I'm just too nasty of a human. And I eat at my desk. I can't do the white. Before I plug it in I actually wanna weigh the G PRO Super Light versus a bunch of other mice. One of the things that's kinda of a little unfortunate in terms of cutting weight is that they've reduced a little bit of the modularity of the original G PRO. On the original one, you had buttons for the right hand side as well that you could remove and put covers. Oh no. All right, here we go. But in order to keep the body as light as possible, they've just removed that. So it's only a right-handed mouse now. Okay. Let's see if these claims are true. They say it's under 63 grams, so somewhere between 62 and 63 makes sense. That's still super light. To get anything lighter than that, you have to go wired, honeycomb. Like even the SteelSeries Aerox 3 which is a pretty sweet mouse cause it's got a bunch of high-end gaming features. And its honeycomb is quite a bit more heavy. I think it's like in the close to 70. They rated that 66 grams, so it's heavier even with the honeycomb design. What's that one? Oh, man this is the Model O Wireless. We're gonna make a video on this, so get subscribed right now, if you don't want to miss that. I'm actually really excited about this. So let's compare this as well. 70 grams? Some, still heavier. Even with the honeycomb shape. - [Jono] Will you feel four grams? - Oh gosh, no. You're not gonna feel four grams. And like, it's nice to have, and if you're at the competitive edge of gaming, you'll want the four grams lighter, that's six grams lighter. I'm impressed. Let's compare it to the Razor Viper Ultimate. So that's 70. I think they say that it's 74. Yeah, probably with the dongle. And I've been on record saying, I don't like this mouse. It doesn't feel good. I really don't like the way the texture plastic is. So we're still gonna compare it. But man, Oh, this is fun. This is like Christmas mousing, Christmas morning, mouse morning. So like an apple, an average apple is like 100 grams. And so if you can imagine an apple in this hand take 40% off (crunching sound) and then you have this one. So while we're setting up the game, one thing I'm curious about, and is not in the scope of this video, is that the Logitech G PRO and actually a lot of Logitech mice that use the Omron 20 million switches. We're having some double-click issues. That's because they're over-volting the switches. And so it's not a mechanical failure, it's an electrical failure. And so a lot of people were having to get replacement either switches or mice. And I haven't seen anything in the documents to say that they've changed that. So that's definitely something to keep an ear to the ground about. In terms of durability, the previous one was rated for 250 kilometers of use. So I calculate that's like 615-ish like 16 inch swipes across a mouse pad. So I don't know, you can try and do that yourself but I don't really wanna do that 615,000 times. Oh, the last thing I wanted to see before, was the scroll wheel. And so if you look at the scroll wheel, they look similar but this one looks like it's got a little bit more of a gap and maybe you can tell over this way. And so yeah, the click wheel still feels good. And I know a lot of people really like the G PRO click wheel. The original one feels a little more solid. Like this one feels a little mushier and like it's such a small amount that it might just be in my brain, but I think people will find it like five, 10% a little bit softer through those clicks. This might be too new of a mouse. This mouse we're unboxing this mouse before it comes out. So it might not be part of the G HUB software. So there you go early. I mean, as early as possible we've opt to be aware. (playful music) (keyboard keys clacking) Yeah. It feels fast. Man, it's so smooth. These extra glide pads actually do make a difference. This is the smoothest mouse I've ever used. (playful music) I'm going to have to get used to it for this setup, but dang, I know I often say this, and I'm gonna like try taking them home, but I'm absolutely gonna buy this mouse. (laughing) Not even a second thought. All right. So we're gonna give the original G PRO a try. (playful music) So immediately off the bat. It's a little bit more heavy. Again, it's like whatever, 28 grams, it's not a huge deal but I'm really noticing the lack of glide pads. The fact that the glide pad is so much smaller, makes it feel a little rough. I'm feeling the texture of the table a little bit more. And maybe that doesn't really matter to you, but I'm starting to really appreciate the better glide pads on mice. So these glide pads are actually made from PTFE material which is the same stuff that they put on Teflon pans for to not stick. Wow. Yeah. So this is amazing. I am kind of really blown away. (light ticking sounds) Oh, okay. All right. So let's now try this Steel Series Aerox 3. This is a mouse I haven't tried as much, but I've heard good things and it has all the right specs. I mean, it has the same problem, I have a lot of minds that the side buttons are too small and I actually use them for like Mili and Grenade but overall It feels pretty good. It definitely feels a little bit cheaper, but it is cheaper. It's like $20, $30 cheaper than the original G PRO Jono, do you know how much the new G pro is going for? - [Jono] The super light is gonna be $149.99 - So in terms of shape, it's fairly similar, it's an ambidextrous mouse. So you can see it comes out both on both sides. The palm goes a little bit higher, so I find I can cup it a little bit more and I can kinda like steer the mouse with just like the top of my palm which on my 403 is what I currently do. So it feels a little more comfortable. The plastic's definitely a lot less high quality you can see in comparisons to this one. You can see probably in the shimmer of the light the way that this kind of is a more uniform matte. And this one is a little bit rougher. It doesn't feel bad, but it certainly feels cheaper. But man, this one is RGB up the wazoo. But it eats into battery, like on the G PRO it's like 60 hours without RGB and like 40 width. So I would rather have the battery life anyway but let's try this one. (light airy music) I mean, I'm not gonna blame missing the shots on the game or on the mouse blame it on me. Yeah. In terms of like build quality, it's just not as nice. It's heavier, I don't like these buttons as much. It's a good mouse, and like if you've got a good deal on it, I would say, go for it. It's like some people just like the honeycomb. In terms of like palm being cooler, the honeycomb's always going to be better cause there's just more place for the heat to go. So this mouse is $129 American, the G PRO original is also $129 American and the super lights $149. And so for that $20 I would definitely say the build quality and the overall experience's smoothness is definitely worth it. All right, let's do the Viper. (clicking sounds) No, that's not. I just don't like the Viper, oh. This might be the best mouse money can buy right now. It's super light, the construction quality is excellent. The durability, the buttons remains to be seen but in terms of an experience for just gaming, pure gaming, this is as good as it gets right now. I'm really excited to get one for myself and finally switch over my 403 to this beast. So thanks for watching. please get subscribed, please like this video. If you wanna watch more content like this, I've unboxed a lot of mice on this channel. Most recently, the Model D minus which is a wired mouse, but I also really liked. But yeah, be on the lookout for this one, it's out. It's gonna be worth it.",
    "transcript_keywords": [
        "PRO",
        "mouse",
        "feels",
        "grams",
        "bit",
        "Super Light",
        "Light",
        "Yeah",
        "PRO Super Light",
        "feel",
        "good",
        "kind",
        "mice",
        "white",
        "feels good",
        "Super",
        "glide",
        "previous G PRO",
        "glide pads",
        "Powerplay"
    ],
    "transcript_entity_values": [
        "40%",
        "up to 25,000",
        "74",
        "Linus",
        "20 grams",
        "30",
        "PTFE",
        "$129 American",
        "five grams",
        "Viper",
        "One",
        "the Model O Wireless",
        "40",
        "100 grams",
        "one",
        "Omron",
        "20",
        "70",
        "60 hours",
        "the summer",
        "615,000",
        "Vessi Footwear",
        "25",
        "66 grams",
        "the wet future months",
        "Logitech",
        "Today",
        "63 grams",
        "second",
        "615-ish",
        "20 million",
        "28 grams",
        "two grams",
        "Friday",
        "Logitech G PRO",
        "USB-C Logitech",
        "between 62 and 63",
        "Mili",
        "Esports",
        "six grams",
        "PS5",
        "250 kilometers",
        "first",
        "Grenade",
        "the SteelSeries Aerox 3",
        "16 inch",
        "80 grams",
        "all weekend",
        "the end of the weekend",
        "two",
        "10%",
        "400 inches",
        "149",
        "Razor Viper Ultimate",
        "four grams",
        "12",
        "Linus",
        "USB-C",
        "70 grams",
        "RGB",
        "Christmas",
        "Christmas morning",
        "PCB",
        "149.99",
        "Vessi",
        "403",
        "today",
        "25",
        "almost 25%"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "MONEY",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT"
    ],
    "vector": [
        -0.08326807618141174,
        -0.018283728510141373,
        0.012135250493884087,
        -0.013024372048676014,
        0.08158164471387863,
        -0.058610305190086365,
        0.11141424626111984,
        0.045780301094055176,
        -0.07057115435600281,
        0.10926225036382675,
        0.029425092041492462,
        0.06901101022958755,
        0.012010022066533566,
        -0.02071952074766159,
        0.04049232229590416,
        0.029350491240620613,
        0.10412594676017761,
        0.00414699874818325,
        -0.02555219642817974,
        -0.022328194230794907,
        0.019453562796115875,
        -0.11743103712797165,
        0.059585731476545334,
        0.037513189017772675,
        0.03701961040496826,
        -0.018160291016101837,
        -0.005254318937659264,
        -0.018968963995575905,
        -0.038620851933956146,
        -0.03233133628964424,
        -0.04112184792757034,
        0.04472305253148079,
        -0.0044892048463225365,
        -0.0016163976397365332,
        -0.07421945035457611,
        -0.12660245597362518,
        0.034084271639585495,
        -0.0030736003536731005,
        -0.08414174616336823,
        -0.0365525484085083,
        -0.09170681983232498,
        -0.03301192447543144,
        0.03349961340427399,
        0.11507528275251389,
        -0.06239217519760132,
        -0.038264524191617966,
        0.030648311600089073,
        -0.0194378849118948,
        -0.01752125658094883,
        0.05006169527769089,
        0.04387185722589493,
        -0.058049701154232025,
        0.02271331287920475,
        -0.011097769252955914,
        -0.04466095566749573,
        0.04399115964770317,
        -0.04100881889462471,
        -0.06025562807917595,
        0.0545366033911705,
        -0.010255116969347,
        0.008042987436056137,
        -0.0843915268778801,
        -0.07982686161994934,
        -0.0072578731924295425,
        0.03434767574071884,
        -0.08459394425153732,
        -0.009451375342905521,
        -0.011329718865454197,
        -0.036478810012340546,
        0.027301795780658722,
        -0.010257376357913017,
        0.0008097590762190521,
        0.00520273856818676,
        0.06202270835638046,
        -0.023601112887263298,
        -0.03369089215993881,
        0.09244395792484283,
        0.004788519348949194,
        0.05949316918849945,
        0.04405421391129494,
        -0.03231840953230858,
        -0.020356887951493263,
        0.008108127862215042,
        -0.0056933690793812275,
        0.10769739001989365,
        -0.00466565415263176,
        0.01624157838523388,
        0.04784076288342476,
        -0.005894202273339033,
        -0.07702651619911194,
        0.004981561563909054,
        0.09109640121459961,
        -0.029975958168506622,
        -0.011207127943634987,
        0.008985582739114761,
        -0.022763526067137718,
        0.050673019140958786,
        -0.012386884540319443,
        -0.0020007796119898558,
        0.013408049941062927,
        0.04173045605421066,
        0.005159091670066118,
        0.06781303882598877,
        -0.03996134176850319,
        0.029902935028076172,
        -0.06351841241121292,
        -0.018962780013680458,
        0.05801798775792122,
        0.014636432752013206,
        0.0653667151927948,
        -0.06061390042304993,
        -0.027943825349211693,
        -0.06919348984956741,
        0.006461665499955416,
        -0.0021930758375674486,
        0.04591728374361992,
        -0.06606627255678177,
        0.06509198993444443,
        0.15748295187950134,
        0.013963560573756695,
        -0.03847862035036087,
        0.014770789071917534,
        -0.027785595506429672,
        -0.0554407574236393,
        0.046023137867450714,
        0.05359278991818428,
        -0.0030261354986578226,
        9.496625638409344e-33,
        -0.054421596229076385,
        0.09985765814781189,
        -0.08369883894920349,
        -0.12111703306436539,
        -0.04240231588482857,
        0.043353430926799774,
        0.03514319285750389,
        0.01222044974565506,
        -0.09498526155948639,
        0.09817073494195938,
        -0.08033902198076248,
        0.015899332240223885,
        -0.08479003608226776,
        0.04421091079711914,
        0.07769725471735,
        -0.11224155873060226,
        -0.0012420634739100933,
        -0.0007880576886236668,
        -0.031224118545651436,
        0.017503326758742332,
        -0.0005296599119901657,
        0.054064877331256866,
        0.0319707915186882,
        0.010044191963970661,
        0.006981733255088329,
        0.027898937463760376,
        -0.03359165042638779,
        0.017811734229326248,
        0.010573259554803371,
        0.04076176509261131,
        -0.06128281354904175,
        -0.03351885452866554,
        -0.012625630013644695,
        -0.026529865339398384,
        -0.05056889355182648,
        -0.0075698005966842175,
        -0.04723701626062393,
        -0.11207061260938644,
        0.007760039996355772,
        -0.02554338611662388,
        -0.041937343776226044,
        0.01402225624769926,
        -0.06741802394390106,
        -0.09505161643028259,
        0.04965369030833244,
        -0.006237131077796221,
        -0.058627545833587646,
        -0.02684507519006729,
        0.01286012027412653,
        -0.005757845472544432,
        -0.07011756300926208,
        0.02440142072737217,
        -0.011605064384639263,
        0.02524775266647339,
        0.009408957324922085,
        -0.03219129890203476,
        0.06332840770483017,
        0.008448434993624687,
        0.0609312579035759,
        0.04410357400774956,
        -0.017838716506958008,
        0.013325306586921215,
        0.028750743716955185,
        -0.013789307326078415,
        -0.014261553063988686,
        0.025859324261546135,
        0.0652012974023819,
        0.02245112881064415,
        -0.10958102345466614,
        0.05479178577661514,
        0.02013576775789261,
        -0.0013167584547773004,
        0.050221219658851624,
        -0.0678817480802536,
        0.04428497329354286,
        0.021636784076690674,
        -0.03059864230453968,
        0.029472211375832558,
        -0.06745704263448715,
        -0.03783642500638962,
        -0.05135376378893852,
        0.11222580075263977,
        -0.032105304300785065,
        0.11427933722734451,
        -0.031201886013150215,
        -0.06211692839860916,
        -0.0371125191450119,
        -0.053475525230169296,
        -0.0712495669722557,
        -0.017881810665130615,
        -0.0060448250733315945,
        -0.014350071549415588,
        -0.06849724799394608,
        -0.040605586022138596,
        -0.0021860310807824135,
        -9.086018114827427e-33,
        -0.05449533089995384,
        0.05086401104927063,
        0.0620308555662632,
        0.08318561315536499,
        -0.03329269215464592,
        0.008826157078146935,
        0.009927572682499886,
        -0.05979229509830475,
        0.00024150183890014887,
        -0.04705711081624031,
        0.06582678854465485,
        0.0356716625392437,
        -0.10556717216968536,
        0.04404270648956299,
        0.04852265864610672,
        0.01810280978679657,
        -0.0046774460934102535,
        -0.051277872174978256,
        0.11022742837667465,
        -0.1025165393948555,
        0.17683598399162292,
        0.059769079089164734,
        0.0044427718967199326,
        0.027076296508312225,
        0.008612380363047123,
        -0.11375879496335983,
        0.10877131670713425,
        0.030683370307087898,
        0.023386791348457336,
        0.002787483623251319,
        0.024273987859487534,
        0.06271253526210785,
        0.03826211392879486,
        0.013927366584539413,
        0.10958126187324524,
        -0.029081245884299278,
        0.02652627043426037,
        0.06363006681203842,
        -0.00690271332859993,
        -0.03822534531354904,
        0.03742730990052223,
        0.015178675763309002,
        0.09984401613473892,
        -0.006675746291875839,
        0.06859140843153,
        -0.04239104315638542,
        -0.0801248773932457,
        -0.08146275579929352,
        0.05477028340101242,
        0.03380104899406433,
        0.0059105693362653255,
        -0.08426478505134583,
        -0.04291540011763573,
        -0.054744768887758255,
        -0.10185595601797104,
        -0.06063498929142952,
        -0.03185103461146355,
        0.008991848677396774,
        -0.016224702820181847,
        -0.01650949940085411,
        -0.008326695300638676,
        0.007110397331416607,
        -0.04038253426551819,
        0.04734019562602043,
        0.010199196636676788,
        0.004083750303834677,
        0.034318551421165466,
        0.00711777014657855,
        0.002342219464480877,
        0.0029914123006165028,
        -0.08525536954402924,
        -0.0025701222475618124,
        0.0505618155002594,
        -0.0019701113924384117,
        -0.0016569006256759167,
        0.07433954626321793,
        0.0781339481472969,
        0.05910513177514076,
        -0.0013831816613674164,
        -0.03620824217796326,
        0.04459257423877716,
        0.011983524076640606,
        0.09397260844707489,
        -0.008060967549681664,
        -0.021628733724355698,
        0.037973251193761826,
        -0.041740674525499344,
        0.027953699231147766,
        -0.052752818912267685,
        0.025928325951099396,
        0.0032986283767968416,
        0.021742116659879684,
        -0.020401280373334885,
        0.02543984353542328,
        -0.0425550639629364,
        -4.9647116640016975e-08,
        -0.023459451273083687,
        0.04363732039928436,
        0.07656498998403549,
        0.010158225893974304,
        0.09908366203308105,
        0.03472235053777695,
        0.02116047777235508,
        0.0024196512531489134,
        -0.008350195363163948,
        0.05572723224759102,
        -0.03988777473568916,
        -0.008920762687921524,
        0.00538519024848938,
        0.04289349541068077,
        0.040058497339487076,
        0.07606692612171173,
        -0.05906127765774727,
        0.012124799191951752,
        0.025891821831464767,
        0.023707689717411995,
        -0.018627004697918892,
        0.037316180765628815,
        0.04722868278622627,
        -0.05203018710017204,
        -0.029397374019026756,
        -0.005989446304738522,
        -0.07247418165206909,
        0.023849213495850563,
        0.045343875885009766,
        -0.031207602471113205,
        0.009752558544278145,
        0.03892343118786812,
        0.07212506979703903,
        0.009422221221029758,
        -0.019808299839496613,
        -0.07843154668807983,
        -0.019417699426412582,
        0.0424356572329998,
        0.010854186490178108,
        -0.0019342447631061077,
        -0.029915744438767433,
        -0.10723929852247238,
        -0.046311166137456894,
        -0.06057073548436165,
        -0.024080555886030197,
        -0.03093765676021576,
        -0.06149052083492279,
        -0.07848174124956131,
        -0.06280916929244995,
        0.03147388622164726,
        -0.02955574169754982,
        0.0070181190967559814,
        0.0007718668784946203,
        -0.04985644668340683,
        0.06617224961519241,
        0.01791420765221119,
        -0.0004582878900691867,
        -0.0747605562210083,
        0.04047505185008049,
        -0.014990409836173058,
        0.021492961794137955,
        -0.08299301564693451,
        -0.027869869023561478,
        0.07335413992404938
    ]
}