{
    "id": "MEhqzqD3MPU",
    "title": "$20 MacBook",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-11-07T18:07:32Z",
    "video_url": "https://www.youtube.com/watch?v=MEhqzqD3MPU",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 121289,
    "likes": 4491,
    "comments_count": 187,
    "description": "MacBooks for 20 dollars...no, really! Tech We REALLY Wish Came Back:  Microsoft Has LOST Their Minds:  TikTok Made Me Buy It:  I Built A Laptop, Again:  iJustine Hates Me:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Austin Threatens Aron 0:08 NEVER a Better Time to Buy a MacBook 1:08 Three Plan Options 2:07 Which Option is BEST? 3:04 Why is Best Buy Doing This? 3:47 Which MacBooks Can I Buy? 5:01 Is This a Good Idea? 6:20 Three Years is a Good Plan 7:10 Why We Use MacBooks 8:06 The Drawbacks 9:07 The Big Picture 10:27 The Opposite of a Shortage 11:22 What Do You Think?",
    "description_links": [
        "https://youtu.be/IF8QJEovEcY",
        "https://youtu.be/LnskLqLrq18",
        "https://youtu.be/vUBtSnsWL_0",
        "https://youtu.be/AKgL1v6wtfk",
        "https://youtu.be/UdWcEBZwiBk",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "(Aaron laughs) - Cold open! Buttholes, here we go! (Austin laughs) There we go. - Aaron, if you make that the opening of this video, I swear. - [Electronic Voice] Hello, Aaron, I will be your best friend. - Hello and welcome to this is, it has never ever, ever been - It's only funny when I do it - A better time to get a MacBook than it is at this exact moment. Every MacBook has been delayed until next year. So right now, this is the moment. This is the time my friend, go to Best Buy. - Okay - And get yourself a MacBook. - What the hell are you talking about? - So, Best Buy has pretty quietly released a new program called the Upgrade Plus Program, at which you can go into any Best Buy, pick out a MacBook, - Okay - And for a very low monthly payment, take home a A MacBook starting from $19.99 a month. - So what do you get for your $19.99 a month? - So pricing varies depending on the model you get which obviously, let's use the very base entry level MacBook Air, which starts at - thousand dollars. - Yeah, a thousand bucks. - Okay - [Aaron] So it is $19.99 for 36 months. - [Austin] So a three year, $20 a month plan, which three years is reasonable. - Yes. - I think you can easily get three years out of a MacBook, if not more. - [Aaron] Now on the 37th month there is a final payment. - [Austin] Oh - [Aaron] Which you have different options. - Okay. - Option A (dings) is to upgrade the Mac. So you can either upgrade to the next equivalent model, So then that just starts the process over again. - So you start over again. - Yep. - Okay, got it. - [Aaron] You can return the original and just be done with it. Or, option (whoosh) tres, you make one final payment and you keep it. So the final payment in the case of the MacBook Air is $280 and 35 cents. - Why would you not do that? There's zero shot that three years from now a MacBook Air that you bought for a thousand dollars is not gonna be worth at least $280. I get the flexibility if you don't have the 280 bucks, maybe but there's almost no chance that that MacBook is not gonna be worth at least four or five hundred dollars would be my guess at that point. But I would actually kind of argue, in a lot of cases that a Mac can last more than three years. I mean obviously you can upgrade however often you need but they're almost kinda banking on you being lazy just handing the MacBook in, they make the profit 'cuz you know, it's $280 but they're gonna, you know, resell it for whatever. Just giving it up and just calling it a day seems like the worst option, 'cuz - I do, I agree. - You should - Like just giving it, just - Do something that's not that. - Sure. It is slightly more expensive, - Okay. - Than if you were just to buy it in the store today. - Sure. Makes sense financing - By a whopping 99 cents. - That's a really good deal. - Yeah - So the financing is basically - It's, it's basically 0% financing. - Oh. - Which is, - Sure. - [Aaron] It's great. The closest thing that Apple has to this is that they have 0% financing if you use the Apple card. - Oh. - But that's over 12 months. - Yes. So you have to pay - So payments are - A hundred bucks a month or whatever, - Triple whatever, whatever you're doing here. - Interesting. And also, I'm assuming it's harder to qualify for an actual credit card than this because typically, - Yes. - Although not always, this is kind of treated in like a little bit of a lower tier when it comes to financing in the same way that you would go to like a carrier and pay for a phone, or you know you sign up for like the Apple thing, whatever where you still need some credit for this but it's not maybe quite as hardcore as actually signing up for an all new credit card or something like that. - Right. It it - This seems reasonable. - This is, this is a pretty good deal. - I guess my thought here is that Best Buy are gonna make money on this because they're going to assume that you A, will give them the laptop back and they will be able to resell it for a profit, or B, just keep paying them, you know, monthly forever and keep staying on the upgrade plan. Because clearly financing something a thousand-dollar laptop for three years on a 99 cent charge is probably not gonna make them tons of money, but it's more of a long term play. Unless there's a catch and I am completely open to the idea that we're maybe missing something. This seems like a very reasonable, interesting idea. - [Aaron] The catch to this - [Austin] Uh-oh - [Aaron] is it's not eligible for for any sales, and - Oh! - So - No! Okay, yeah - Not every model is available. - Yeah, just the popular ones or something - [Aaron] More than you think. - [Austin] Yeah. - [Aaron] But like for example I'm using the 14-inch M1 max, that is not available. - But the 14-inch Pro is. - Both, both models of the pro. - Which, to be clear, the 14-inch MacBook Pro is quite possibly one of, not only the best computers you can buy today, but I think one of the most well-rounded laptops ever made. - Period. - So it's a $200,000 MSRP, Right? We've talked about this thing, it's been out for a year now. Yes, it will be replaced soon, but you can get this on sale. So, they're currently selling it right now for $1,600, 400 bucks off. For 1600 bucks, you are not gonna find a better computer than that 14-inch MacBook Air with the 120Hz mini-LED display. Incredibly powerful M1 Pro, 16 gigs RAM, 512-gig storage. That's awesome, but here's the thing, you can't finance the $1,600, - No. - You have to finance it at $2,000, the full price. - Yeah. - Which almost means that you would wanna do this for a branding Mac that's down on sale yet. 'Cuz as soon as it goes on sale, your upgrade pricing goes out the window. 'Cuz now they're sort of pocketing that $400 sale - Yeah. - That they had, - Which is, going back to the base Apple M1, because obviously 20 bucks is what most people are gonna see. If you go and get it today, - Yeah. - You're gonna end up paying $200 more in the long run. - Right - Now it, take some solace that it's not too, you're not paying $200 more by doing this program, like it's not like they're marking it up. I don't think it's all that nefarious to be giving you this pricing on, on the normal price of it. If you have the money, I would say buy it out, right? - Yes. - Because you will, most of the time, you will save money. - Yeah. - But like - 20 bucks a month is, that's a - 20 bucks a month, zero down, - Yeah. - That's insane to get you in this ecosystem, - And you have the ability to upgrade later or buy it out, right? Which my only thought would be, it doesn't make sense when there are great sales, right? If there's a full price MacBook - Right. - Then it's like actually approaching no-brainer territory. 0% interest, you know, 20 bucks a month, 30, 40, whatever kind of model you wanna, you wanna choose. - Yeah. - But if you're losing out on two, four hundred dollars worth of sales, that's still not unreasonable. I mean, if you have a car payment, take a look at that interest payment you're paying every month. I guarantee you, you're paying a whole lot more than the MSRP of that car over your three years, five years, seven years or whatever. Obviously, anytime you finance something they've gotta make some money on the back end. But, that being said, this seems like a reasonable plan that, honestly, I'm kind of surprised that Apple don't do. - I think that they actually, Apple has a really good program of 0% interest on these, - On the Apple card. - Yeah. But it's, again, it's for 12 months, payments are a lot higher, which is not unreasonable, just - This is just a better deal. - Like it, yeah, it's - Why would you split up across one year, when you can split up across three years and there's no real extra amount you have to pay? 'Cuz I'll tell you, who doesn't also honor sales very often is the Apple store! You're usually going to the Apple store and paying full price, which - Whatever, whatever is listed, you're paying. Now let's, let's talk though, like three years is kind of a long time. Am I gonna have a three year-old laptop? Am I, am I gonna be paying monthly on an outdated laptop? And I think the answer when it comes to this is no, like - [Austin] Yeah. Even the base MacBook Air that thousand dollars to you which is $800 on sale, right? Even that I would feel pretty confident in saying that will be a perfectly solid laptop three years from now. Now mind you, my big caveat with all laptops when you want to use them for long periods of time, 8 gigs of RAM is not super comfy. - No. - Whether it's a surface, whether it's a MacBook, whatever. All of these Apple silicon Macs are terrific. They all have incredibly solid performance, and I will be shocked if any of them are feeling significantly old in three years time from now. - Yeah. like kind of talking, I mean often I talk sometimes outside of videos - We do? - Sometimes - You know the clause in my contract is I don't speak to you unless a camera's recording, right? (Aaron laughs) - That's why they're always recording. (beep) When we bought our round of the M1 max laptops across the office, ever, all of them are M1 maxes, - And basically we said like, this is so good. - Yeah. - It's not like it used to be, you know, five, six years ago where like every year was like kind of a massive upgrade. - Yeah. - Now we had like this huge leap between the Intel Macs and then the Apple silicon Macs. These upgrades are gonna be so minuscule over the next couple years, - Well, I mean there will be upgrades, it's just a matter of, we've kind of hit a point of performance - Right. - on these systems where, yes, you can add more performance, but what are you gonna do with it? - In the case of this series here we have a minimum of three cameras, and - [Austin] All 4K, all running at the same time, MultiCam handled easily by these MacBooks, - Easy. - There's no reason for us to upgrade, right? Like I know for me, I'm on a 14-inch MacBook Pro, it's a year old now and until that battery dies, or until M4 comes out that's absolutely amazing, I can't imagine myself upgrading. like I'm perfectly happy with it, right? - What I'm assuming you can't do, is go and get like multiple of these from Best Buy, like - Yeah probably one per person. - One, one per person, - Yeah. - You start the process over again. But like, we saw this and I think, like, this is a really good deal. And like it's uncharacteristically altruistic of, (Austin laughs) - of like a company to like, - Man, are you trying to say that you're surprised that you're not getting scammed by a company? - Yeah, Yeah. Like, - Obviously this is an interesting time for Macs, right? Because the rumor was that we would be seeing some M2, you know, 14-inch MacBook Pros, iMacs, all that kinda stuff, we've not seen that. It does seem like the rumors have flipped. So instead we're going to be seeing these new Macs next year probably in their Spring event, like maybe March or April or something like that, that's totally fine! Like we don't need more performance. Now, is it a little bit weird that the iPad got an M2 chip before the iMac or the MacBook Pro or any variety of Mac Minis? Yeah, I think that is a little weird. - Yeah (laughs) a little bit. Just, just a tad. - But you know what? Whatever, it's fine, it's fine. Like, and I think that's where the Apple lineup is really strong right now in a lot of ways. Now, one of the big picture things to consider right now is that with the economy sort of teetering on some uncertainty, there's certainly a major pullback when it comes to the PC industry. The last few years have been massively profitable for pretty much anyone who's been making laptops, computers. The chip shortage has meant that they've been able to raise prices, they've been able to, kind of, gather up all that they can. But now we've almost caught the flip scenario, in which now there's an oversupply. There are really good deals, like we're talking about with MacBooks and all kinds of PC laptops where these companies who put these orders in for the computers a year ago now they're sitting on a big oversupply, right? As consumers who've just spent the last few years blowing all their discretionary cash on buying upgrades and new systems, they're like, you know what? I don't need new laptop for five years and Best Buy is sitting on warehouses of unsold laptops going \"Uh-oh, what do we do? Let's have a financing program,\" or whatever the case is. Which I think is an interesting kind of dilemma, right? For, you know, if you're Timmy Cook, or if you're Mr. Buy, or whatever the case is, of what's the plan to incentivize customers to come back and to get back into spending the money on new systems, whatever, when basically the vast majority of consumers now have a terrific laptop or terrific computer, that is gonna easily, sort of, last them for years. And you're now sitting on these huge orders that you've put in and these huge, you know, supply warehouses, - Right. - And all this kinda stuff and all these orders that you've got sort of in the pipeline. There's enough of these sales going on that maybe Apple delayed the M2 Pros - Yeah. - And the M2 Macs, just because they wanted to sell through the existing sort of inventory before they bring out the new ones. 'Cuz you know, the second that an M2 comes out, of the 14-inch MacBook Pro or whatever, no, they're gonna have to cut the prices even more - Yeah. on the M1's to kind of actually get them out the door. Which, as a consumer, this is terrific, right? If you are in the market for one of these laptops or really in the market for most tech right now, now that you have Black Friday deals to take advantage of, but you also have this oversupply that so many companies have which just means they're slashing price like crazy to kinda get stuff off the shelves. And that means that you can either finance something for a pretty reasonable price, or just buy outright on a proper sale. All kinds of laptops and TVs and all kinds of happy, fun things. As always, cash is king. And when you have it, you can be the king - All right, Saul Goodman. - And if you don't have it you're the pauper who has to beg Mr. Buy to finance you a $20 a laptop month thing. - Let us know in the comments what you think about this program. Like, subscribe, follow, catch you in the next one. And Austin, you're shirt is very orange. - You know, I'm just gonna just say I've been waiting the whole video to do this. - I, I Know. - Can I just point out that the orange of the light, the orange of my chair, and the orange in my shirt are actually the exact same thing. (crash) And that I'm really proud of that. Thank you very much for watching. We will see you next time when we tell you about how you can finance a monthly subscription to this (laughs) - I think that's just called only fans. (Austin laughs) (background music plays)",
    "transcript_keywords": [
        "Yeah",
        "MacBook",
        "Apple",
        "years",
        "Buy",
        "MacBook Air",
        "kind",
        "MacBook Pro",
        "month",
        "Pro",
        "year",
        "Apple silicon Macs",
        "Macs",
        "Upgrade",
        "laptop",
        "laptops",
        "bucks",
        "time",
        "cuz",
        "Air"
    ],
    "transcript_entity_values": [
        "zero",
        "12 months",
        "a thousand dollars",
        "Saul Goodman",
        "Aaron",
        "19.99",
        "three",
        "six years ago",
        "one year",
        "the last few years",
        "the Upgrade Plus Program",
        "three years",
        "280",
        "1,600",
        "2,000",
        "March",
        "iMacs",
        "36 months",
        "at least $280",
        "RAM",
        "M1",
        "30",
        "0%",
        "iMac",
        "1600 bucks",
        "MacBook Pro",
        "iPad",
        "Austin",
        "MacBook Air",
        "the MacBook Pro",
        "three years from now",
        "MacBook - Right",
        "over 12 months",
        "MacBook",
        "800",
        "35 cents",
        "Best Buy",
        "a year ago",
        "month",
        "MacBook Pros",
        "thousand-dollar",
        "next year",
        "MacBooks",
        "14-inch",
        "a year old",
        "M2",
        "20",
        "M1 max",
        "280",
        "M4",
        "MultiCam",
        "8",
        "three year",
        "Timmy Cook",
        "512",
        "thousand dollars",
        "the 37th month",
        "a thousand bucks",
        "4",
        "five,",
        "120Hz",
        "400",
        "Macs",
        "200",
        "the next couple years",
        "seven years",
        "second",
        "at least four",
        "20 bucks",
        "Intel",
        "Mac Minis",
        "five hundred dollars",
        "one",
        "Mac",
        "five years",
        "Apple",
        "today",
        "at - thousand dollars",
        "a - 20 bucks",
        "The last few years",
        "years",
        "a year",
        "MacBook",
        "four hundred dollars",
        "monthly",
        "every month",
        "three year-old",
        "two",
        "M1 Pro",
        "$200,000 MSRP",
        "Black Friday",
        "more than three years",
        "40",
        "99 cents",
        "Mac",
        "99 cent",
        "400 bucks",
        "the MacBook Air",
        "16",
        "April"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "DATE",
        "FAC",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "EVENT",
        "DATE",
        "DATE",
        "MONEY",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.04024706035852432,
        0.004553564358502626,
        0.09130888432264328,
        -0.034091077744960785,
        0.0748055949807167,
        0.027914954349398613,
        -0.007135926745831966,
        0.07620477676391602,
        0.0678272694349289,
        0.043317507952451706,
        0.019072530791163445,
        0.04291241988539696,
        0.046772316098213196,
        -0.04598436504602432,
        0.05468614399433136,
        -0.018643302842974663,
        -0.002873159945011139,
        -0.10592815279960632,
        0.004639904946088791,
        -0.01347631961107254,
        0.04703043773770332,
        0.0361722856760025,
        -0.05844161659479141,
        -0.008792093954980373,
        0.005214343778789043,
        0.027309464290738106,
        0.05464032292366028,
        -0.04014560952782631,
        -0.10477082431316376,
        0.04904259368777275,
        -0.018673455342650414,
        0.055348943918943405,
        0.01335463859140873,
        -0.034841399639844894,
        0.016103126108646393,
        -0.10264543443918228,
        0.0571913979947567,
        -0.006317154038697481,
        -0.02499265782535076,
        -0.06606780737638474,
        -0.06928012520074844,
        -0.045121945440769196,
        0.03660304844379425,
        0.06638199836015701,
        0.01722826436161995,
        -0.03428705781698227,
        0.01609826646745205,
        -0.056470900774002075,
        0.08067614585161209,
        0.022996099665760994,
        -0.06791269779205322,
        -0.08366615325212479,
        -0.02791503816843033,
        -0.020793937146663666,
        -4.9222755478695035e-05,
        0.03704473376274109,
        -0.021845340728759766,
        -0.056429166346788406,
        0.06058892235159874,
        -0.027423487976193428,
        -0.001022949698381126,
        -0.1538863331079483,
        -0.06765501201152802,
        0.02102971449494362,
        -0.01966334506869316,
        -0.037813905626535416,
        -0.031439486891031265,
        0.003371142316609621,
        -0.07409672439098358,
        0.08160776644945145,
        0.05474504828453064,
        -0.03394114971160889,
        0.07083253562450409,
        0.053874921053647995,
        -0.04173222929239273,
        0.01859661377966404,
        0.11089067906141281,
        -0.06422211974859238,
        0.03564860299229622,
        0.002121614757925272,
        -0.037470005452632904,
        -0.030522752553224564,
        -0.017206519842147827,
        -0.054746806621551514,
        -0.07189898192882538,
        -0.04192061722278595,
        0.007284266408532858,
        0.017733685672283173,
        -0.017495732754468918,
        0.01674688048660755,
        -0.006610468029975891,
        -0.002815823070704937,
        0.005160074681043625,
        0.0028399056755006313,
        0.006777062080800533,
        -0.01388025376945734,
        -0.011801115237176418,
        -0.034351591020822525,
        -0.023501861840486526,
        0.027964727953076363,
        0.016251740977168083,
        0.07402341067790985,
        0.11284177005290985,
        -0.04892008379101753,
        0.02914699912071228,
        -0.06592929363250732,
        0.03640013188123703,
        0.0058920481242239475,
        0.04705784469842911,
        0.021791310980916023,
        -0.016555417329072952,
        -0.004764295183122158,
        -0.04541028290987015,
        0.008116254583001137,
        0.015583403408527374,
        0.013930635526776314,
        -0.011545012705028057,
        0.024087773635983467,
        0.1167663037776947,
        0.044855788350105286,
        -0.0028318576514720917,
        0.0772574320435524,
        0.011339662596583366,
        -0.02207230031490326,
        -0.006675895303487778,
        -0.0205780491232872,
        -0.04052707180380821,
        3.596412844055296e-33,
        -0.0741516649723053,
        0.015247263014316559,
        -0.05408082529902458,
        0.0012864029267802835,
        0.04900970682501793,
        -0.047924213111400604,
        -0.009258669801056385,
        0.042239848524332047,
        -0.042587243020534515,
        0.043092209845781326,
        -0.021969527006149292,
        0.0060644084587693214,
        -0.06837932765483856,
        0.049480997025966644,
        0.09427686035633087,
        -0.03536658734083176,
        -0.07291591167449951,
        -0.004947925452142954,
        -0.05358341336250305,
        0.04199764505028725,
        0.03040498122572899,
        -0.020616494119167328,
        0.044161971658468246,
        -0.08951115608215332,
        0.00996769592165947,
        -0.07710099220275879,
        0.03924082964658737,
        -0.05845252051949501,
        0.0645916536450386,
        0.025455063208937645,
        -0.10233978182077408,
        0.005027529317885637,
        -0.030243078246712685,
        -0.11708445101976395,
        -0.027926819398999214,
        -0.03139106556773186,
        -0.003979801200330257,
        -0.07173474133014679,
        0.037397049367427826,
        -0.04110688716173172,
        -0.12076374143362045,
        0.06394580006599426,
        -0.025012733414769173,
        0.0075197708792984486,
        0.10934364795684814,
        0.05311243236064911,
        0.01800667680799961,
        0.019676784053444862,
        -0.007958428002893925,
        0.02491595409810543,
        -0.08886752277612686,
        -0.0238064993172884,
        0.06069690361618996,
        -0.008239139802753925,
        -0.05634503811597824,
        -0.035842616111040115,
        0.03988628089427948,
        -0.0464368611574173,
        0.040399014949798584,
        0.0793144702911377,
        0.013382862322032452,
        0.037564706057310104,
        0.09249670058488846,
        -0.03875501826405525,
        -0.07314156740903854,
        0.13060687482357025,
        0.08326685428619385,
        0.04055272042751312,
        -0.03173007443547249,
        0.03821916505694389,
        -0.05363881587982178,
        -0.029542280361056328,
        0.01059612538665533,
        -0.0910295844078064,
        -0.018413452431559563,
        0.013865855522453785,
        -0.01931600645184517,
        0.007759376894682646,
        -0.023896874859929085,
        0.0038976697251200676,
        0.029042745009064674,
        -0.04117830842733383,
        0.022462379187345505,
        0.05682696774601936,
        0.04027847200632095,
        0.08801952004432678,
        0.046616215258836746,
        -0.028861718252301216,
        -0.024190880358219147,
        0.005710489582270384,
        -0.023123275488615036,
        0.0003750964824575931,
        0.019696328788995743,
        0.04634835943579674,
        -0.035772621631622314,
        -4.801654181451095e-33,
        0.06708338856697083,
        -0.08319847285747528,
        0.011553343385457993,
        0.08062239736318588,
        -0.01214332040399313,
        0.015062212944030762,
        -0.014254213310778141,
        0.011170163750648499,
        0.015580050647258759,
        -0.051182083785533905,
        -0.05534786358475685,
        0.09122385829687119,
        0.005342460703104734,
        -0.036239754408597946,
        -0.009897620417177677,
        -0.06390857696533203,
        -0.04640893638134003,
        -0.09529904276132584,
        -0.004834811668843031,
        -0.08013000339269638,
        0.01961151696741581,
        0.03403446823358536,
        -0.06689436733722687,
        0.015880096703767776,
        0.008384348824620247,
        0.021027205511927605,
        -0.05753156542778015,
        0.027854522690176964,
        -0.036990854889154434,
        0.04386768490076065,
        -0.07069244235754013,
        -0.045880988240242004,
        0.06987226009368896,
        0.039170533418655396,
        0.07736712694168091,
        0.022713663056492805,
        0.008161172270774841,
        -0.011947407387197018,
        0.03297346085309982,
        0.04733395203948021,
        0.09226872026920319,
        -0.00021767635189462453,
        -0.0011445211712270975,
        0.008266521617770195,
        -0.03144897520542145,
        0.018154317513108253,
        -0.06354396045207977,
        -0.01353527046740055,
        0.021455492824316025,
        -0.018809178844094276,
        0.007383269723504782,
        -0.00576539384201169,
        -0.02470994181931019,
        -0.026435883715748787,
        -0.06423071771860123,
        -0.055667776614427567,
        -0.02867012843489647,
        0.038177572190761566,
        0.08985664695501328,
        0.008563787676393986,
        -0.08270914852619171,
        0.01414826512336731,
        0.06318533420562744,
        -0.04571559652686119,
        -0.001658976194448769,
        0.025363173335790634,
        0.039086971431970596,
        0.02935975044965744,
        0.009769313037395477,
        -0.030748063698410988,
        -0.03401156887412071,
        0.0053756097331643105,
        -0.061699289828538895,
        -0.09993142634630203,
        -0.01984018087387085,
        0.11403788626194,
        0.09030280262231827,
        -0.07585831731557846,
        -0.0725124180316925,
        0.018227718770503998,
        0.010910038836300373,
        0.02934206835925579,
        -0.01081667561084032,
        0.0723351314663887,
        -0.017145929858088493,
        -0.0015824337024241686,
        0.012254606932401657,
        -0.003136508632451296,
        -0.06840052455663681,
        0.03199011832475662,
        -0.042406730353832245,
        -0.0070350938476622105,
        -0.03695670887827873,
        0.03467871621251106,
        -0.0704454556107521,
        -5.8207337616522636e-08,
        -0.08005601167678833,
        -0.025638656690716743,
        0.0631798803806305,
        0.049400102347135544,
        0.06418050825595856,
        -0.03138084337115288,
        0.03131229802966118,
        0.050712037831544876,
        0.09176194667816162,
        0.09205828607082367,
        0.07947687804698944,
        -0.06878172606229782,
        -0.0664827972650528,
        0.02297256700694561,
        -0.027557263150811195,
        0.06561639904975891,
        -0.01963425613939762,
        0.058169886469841,
        -0.012391709722578526,
        -0.07338167726993561,
        -0.025334088131785393,
        0.08681843429803848,
        0.0717642679810524,
        -0.005156859289854765,
        -0.03377837315201759,
        0.027587438002228737,
        -0.007250986527651548,
        0.08931469917297363,
        0.011360900476574898,
        0.06372213363647461,
        -0.06416791677474976,
        -0.014375404454767704,
        -0.1041971892118454,
        0.06335456669330597,
        0.010395684279501438,
        -0.10094528645277023,
        -0.0996636226773262,
        0.08761165291070938,
        0.08045431971549988,
        -0.0019972212612628937,
        -0.06679373979568481,
        -0.05519450455904007,
        -0.08155090361833572,
        -0.007619807031005621,
        -0.06372033059597015,
        -0.049921855330467224,
        -0.10031766444444656,
        -0.007972447201609612,
        -0.060081563889980316,
        0.010427432134747505,
        0.02435060776770115,
        -0.028359534218907356,
        0.03196476399898529,
        0.03994056209921837,
        0.02871119976043701,
        0.04197182506322861,
        -0.027733255177736282,
        -0.061906907707452774,
        -0.04886360093951225,
        0.06826502829790115,
        0.0899449810385704,
        -0.11436506360769272,
        -0.06055128574371338,
        0.0639573186635971
    ]
}