{
    "id": "MEiq0oCUb_8",
    "title": "Dope Tech: The Most Extreme Gaming Monitor!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-08-15T14:16:31Z",
    "video_url": "https://www.youtube.com/watch?v=MEiq0oCUb_8",
    "category": "Science & Technology",
    "tags": [
        "Dope tech",
        "MKBHD",
        "Odyssey Ark",
        "Odyssey Ark monitor",
        "curved gaming monitor",
        "gaming monitor",
        "curved monitor",
        "transparent battery",
        "insta360 link",
        "insta360",
        "webcam",
        "insta360 webcam"
    ],
    "views": 4761041,
    "likes": 161437,
    "comments_count": 4363,
    "description": "Dope Tech is back! Transparent batteries, massive curved monitors and swiveling webcams   Thanks Samsung for sponsoring a portion of dope tech! Check out the Oydssey Ark at   Shargeek Storm2:  Shargeek Storm2 slim:  Insta360 Link:  The USB-C Power Display Cable:   MKBHD Merch:   Intro Track: Jordyn Edmonds:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://geni.us/4Hby",
        "https://geni.us/uurob",
        "https://geni.us/evpu",
        "https://geni.us/2T1mknp",
        "https://geni.us/YEX8d9E",
        "http://shop.MKBHD.com",
        "https://lnk.to/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Yo what's up? MKBHD here. Welcome back to Dope Tech, I love doing these, the series where I find the dopest tech and then share it with you. So we got a couple things with this one. First one is these. These are battery banks. This is the Shargeek Storm 2 and Storm 2 Slim. Let's be honest. Most battery banks are basically the same thing, right? They're all kind of boring, but I have gone on to basically replace all of my functional battery banks in my life with these because they're the same thing, but cooler. Maybe transparent tech is having a moment here in 2022 because we've seen the nothing phone, the nothing earbuds, and some other transparent stuff. Logically, why not try it with power banks too? And it turns out it looks sick. So basically all power banks inside, they have gotta have batteries. They also have a logic board and some ports. This one does a great job of being able to see straight inside, I would say in a tasteful way, but I also haven't flown with this yet. And so I kind of wonder what the TSA would think about this design. Luckily it's got a little label that says airline safe on it. That should do it. But I think the best part is it's actually a really good power bank. So all the ports are on one side here. The small one, the slim, has one USB A and one USB C, and it's 20,000 milliamp hours. That's enough to fully charge a brand new MacBook Air. And I say that because it also outputs enough power to do exactly that. The USB C port here will outport up to 100 watts. And the best part is there's this little screen here on the power bank that lights up when it's doing something, it has all kinds of nerdy information about every single little thing that's going on in real time. So your charging power, wattage, amperage, temperature, and everything. It's actually sick. So yeah, as soon as I plug something in, I know how much power it's giving or receiving. I don't know if you remember that cable I showed that's in the what's in my bag video, that also showed how much power was going through it on a tiny screen. But this is kind of like that but with any cable you want. So the bigger version has more ports and it's also bigger so it has more capacity. This one is 25,600 milliamp hours, that will charge a 14 inch MacBook Pro from zero to 100 in an hour and a half. So I guess what I'm trying to say is unless the airlines take them from me, I'm gonna use these for everything now. I really like them. Currently we use it literally to power the Mix Pre3, my audio device for recording videos. They have this terrible design where you need a power bank instead of putting batteries on the back because it blocks the SD card slot. Anyway, I'm loving them. They're both $200, not cheap, but hey, this is Dope Tech. Okay. So this thing is ridiculous. So Samsung reached out and they wanted to sponsor a look at their new Odyssey Ark gaming monitor. I've seen some pretty crazy monitors in my time but nothing like this. So this is a massive 55 inch corner to corner 165 Hertz curved gaming monitor. Pretty sure it's the only monitor in the world with that exact spec. And it has a one millisecond response time. Plus it's AMD FreeSync Premium Pro certified. So it's definitely built for gaming and in every way, this thing is ridiculous. It basically feels like putting a TV on your desk, but way more powerful. And it needs some pretty serious hardware like this huge foot wide metal stand and the mount that's attached to it to hold the whole thing above your desk. So why would someone get something like this? What is this capable of? Well it turns out pretty much everything. So it plugs in via this box back here like some other Samsung TVs and there's four total HDMI 2.1 ports on the box. So you can give it a bunch of inputs. And then there's this remote, looks like a skinny TV remote that comes with it. And there's also this, which is called the Ark Dial. It's kind of crazy. I've never seen anything like this before, but basically instead of having to reach all the way around the back of this huge monitor, you have the controls on this dial and it connects wirelessly via Bluetooth. And that's how you get to your settings and control this monitor. So you can sit it anywhere you want at your desk for controls and both this and the remote have solar panels on them so you should actually pretty much never need to charge them, which is super smart. So this Ark Dial will let you control pretty much everything about this monitor, but while you're just using it like a normal monitor, not even gaming, just for productivity and stuff like that, it's still very impressive. It is a huge monitor. And at this resolution it can fit a ton of stuff on the screen, any app or program that benefits from spreading things out will never look better than it does on this monitor. Also the whole thing has a matte anti-glare finish that cuts down on reflections or any lights that may be in your living space. And you can put tons of things on the screen to your heart's content. And I feel like because of the curve, it's not as neck breaking as something this size would be if it was flat. So just so you know, this is called a 1000R curve monitor because the radius of the circle that this monitor would make if you extended it all the way around into a circle is 1000 millimeters. So the smaller the number, the more pronounced the curve. And this one curves so much that the upper and lower corners really do stretch into your peripheral vision. It just gives you maximum immersion. And then, as you can imagine, it's incredible for gaming. So I've gamed on a lot of nice monitors in the past couple of years and also tried gaming on TVs in the past. This isn't quite like either one of those experiences because the size and the height and the sheer curve and the image quality, it's just an amazing setup for pretty much any game that you throw at it. Also the speakers built in aren't bad, either. There's four speakers at each corner and 2 central woofers. So just with the monitor's built in speakers you're getting a Dolby Atmos setup and it can help with object tracking sound because the left and right channels are so far apart. This is a quantum mini LED display at 4K resolution. So there's legitimately details in the darkest and brightest parts of scenes in games, but also Samsung says there is a multi-layer neural network for upscaling, but just like playing a game full screen, obviously it's incredible, but let's say your neck does get tired. You're not really so used to turning your head as much or maybe you're just super used to playing a game on a smaller screen, like a 24 inch or 27 inch screen. All right, no problem. So this Ark Dial lets you pop into a setting called flex move screen. You hit that. And then you can literally drag down the size of the monitor to whatever size you want it to be. You want a 30 inch monitor? You want a 27, you want a 24, 22, whatever, all of these different sizes are available to you. It kind of looks crazy tiny, and you can move it around, maybe put it in the middle so you're not looking down all the time. There's your smaller monitor. It's convenient. Fun fact, this graphic that's behind whatever your screen would be actually changes based on what's on your screen. So it matches the colors. If it's dark, then it'll be dark. If it's bright and colorful, then it'll match the colors. But probably the most extreme feature of them all, this whole thing, this gigantic panel rotates 90 degrees to create this towering 55 inch diagonal monstrosity that's literally curved over your head basically towering over you. So seeing this monitor in portrait mode is wild and there is even a couple window management features to help you make the most of this ridiculous amount of vertical screen real estate. Here you can see it mimicking three 27 inch monitors stacked on top of each other, each with something completely different going on the screen. So productivity can be fun. Each of these windows is the size of an entire monitor. And if you're feeling bold, it's actually the world's best shorts or reels or TikTok monitor where you can truly kick back and immerse yourself and waste unbelievable amounts of time. There's actually also a feature called Eclipse Sync which has 2 lights on the back of the monitor that will change colors based on what's in the game to reflect off the wall for even further immersion. But let's be honest. Most of the time, your eyes are gonna be all over this display all the time. Now this is Dope Tech. So we know it's the craziest bleeding edge stuff. But if you do wanna actually get your hands on something like this, it'll run $3,500. And if you wanna justify it, you could say it's kind of like having three or four monitors in one. So yeah, shout out to the Odyssey Ark for that. That brings me to my third and final item here. Now, as you can imagine, the webcam situation with a huge monitor, with any huge monitor can be pretty crazy, but also webcams generally are pretty trash. But then this Insta360 Link webcam started showing up on my feed actually a lot in the last couple days, there's a bunch of sponsored videos. This one clearly isn't sponsored by them but I did get my hands on it and I wanted to check it out and it turns out it is really cool and very impressive for certain groups of people. So first of all, if you're just looking for a quality upgrade, a dedicated webcam will always give you that over a built in. So with this one, you're getting a half inch sensor, 4K 30 FPS video, face detect auto focus. This is easily miles better than any normal built in webcam into any computer. It's kind of like the Opal C1, but they're both like a step below using your literal iPhone as your webcam with Continuity Camera. But as you can tell just by looking at it, it's this little rig here. It's about more than just the camera quality. It is all about the features. So you can see it's got an entire gimbal built in like someone sawed it off the bottom of a drone and stuck it onto a webcam. And the world of motion controlled video camera just opened up a world of possibilities. So having a swiveling, tilting, articulating camera as your webcam means it can follow you around and track you around a room no matter where you go. And it is 1,000% faster and more responsive than like what we've seen when Apple does the super ultra wide camera and then does center stage and crops in. This just, this is, I feel like I can walk around the room and it'll follow me. So this will clearly be pretty sick for streamers but I think underrated, it would actually be even better probably for remote work and remote learning, things like that. Because continuing along the theme of this being the smartest webcam I've ever used, it can obviously use the gimbal to point in any direction. So it's a really solid desk view because as you can imagine, it literally just tilts down and points more directly at your desk and then proceeds to use sort of extra processing to create a pseudo top-down view kind of like what Apple did with Continuity Camera. But then probably the most useful one, there's these tracker stickers that come with the webcam. All you have to do is put one on each corner of a whiteboard and then move the whiteboard somewhere into frame. And then all you have to do is give it a peace sign and it'll go into whiteboard mode. You can see the whiteboard over there behind me. It's not even like in the normal frame of view of the webcam. I'm just gonna give it a piece sign. It blinks. It goes into whiteboard mode. And it sort of locates the whiteboard, takes a second. You can see it going over my shoulder there. That's the whiteboard. And then it snaps in and now you are fully on the whiteboard. Look at this, I'm teaching, I'm instructing things on the whiteboard from across the room. So easy. Like this is everything Apple Center Stage ever wanted to be. Obviously they want you to be able to put your iPad down and walk around the kitchen and it follows you. But yeah, this will literally follow you and complete 360 degree around your laptop. It's much better. So yeah, I'll give it another peace sign. It'll realize it can go back to me, snaps back to me. And then yeah, we're just using the webcam like normal again. But it also has a feature which is when you stop using it, so I'll stop recording and then you close the app and it goes to sleep, after a while it just shuts down and faces straight down, which is sort of a privacy feature which just means it won't be able to look up and at you. It's nice that a webcam that can turn around doesn't when you're not using it. It's a privacy feature. So yeah, that's gonna easily qualify for the smartest webcam I've ever tried, but it's pretty smart that a camera company, which Insta360 is, is making a webcam. So that's why it's also fantastic quality and everything else that's around it works pretty well. So yeah, pretty sick. That's why it's Dope Tech. So that's it for this one, a super cool clear battery bank, an insane 55 inch super curved gaming monitor, and the smartest web cam that I've ever tried. I really enjoy doing Dope Tech videos and I'm glad we're bringing them back. Kind of surprised we haven't done more. We'll probably do another one soon. Any case, thanks for watching this one. Subscribe to see the next one when it comes out. And I'll talk to you guys in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "monitor",
        "Dope Tech",
        "webcam",
        "pretty",
        "screen",
        "power",
        "thing",
        "kind",
        "Tech",
        "huge monitor",
        "back",
        "Ark Dial",
        "inch",
        "whiteboard",
        "gaming monitor",
        "power bank",
        "Camera",
        "Ark gaming monitor",
        "Ark",
        "Dope"
    ],
    "transcript_entity_values": [
        "20,000 milliamp hours",
        "Apple Center Stage",
        "24 inch",
        "three",
        "Apple",
        "1000 millimeters",
        "one",
        "iPad",
        "14 inch",
        "Hertz",
        "the Odyssey Ark",
        "four",
        "1,000%",
        "55 inch",
        "MacBook Air",
        "MacBook Pro",
        "the past couple of years",
        "third",
        "2022",
        "200",
        "2",
        "3,500",
        "the last couple days",
        "Continuity Camera",
        "up to 100 watts",
        "30 inch",
        "Odyssey Ark",
        "4",
        "USB C",
        "first",
        "the Ark Dial",
        "TSA",
        "165",
        "this Ark Dial",
        "90 degrees",
        "Ark Dial",
        "27",
        "First",
        "webcam",
        "100",
        "zero",
        "SD",
        "27 inch",
        "2.1",
        "22",
        "three 27 inch",
        "second",
        "the Opal C1",
        "USB",
        "the Shargeek Storm 2",
        "Eclipse Sync",
        "Dolby Atmos",
        "TikTok",
        "webcam",
        "25,600 milliamp hours",
        "a ton",
        "Dope",
        "Samsung",
        "24",
        "1000R"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "LOC",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.06796390563249588,
        -0.0024299263022840023,
        -0.021672559902071953,
        -0.03320778161287308,
        0.06531279534101486,
        -0.05790000781416893,
        0.07335718721151352,
        0.05757363140583038,
        0.04444059729576111,
        -0.03155108913779259,
        -0.05074244737625122,
        -0.03435305878520012,
        0.05387390777468681,
        -0.015125017613172531,
        -0.009100799448788166,
        0.038045816123485565,
        0.12605734169483185,
        -0.0936429351568222,
        0.031804170459508896,
        0.029759246855974197,
        0.026085466146469116,
        -0.12310584634542465,
        0.01608894020318985,
        -0.016909528523683548,
        -0.034430790692567825,
        0.08223732560873032,
        -0.01085896696895361,
        0.03482688218355179,
        -0.09940994530916214,
        -0.05831131339073181,
        -0.023204883560538292,
        0.0595925934612751,
        -0.07822773605585098,
        -0.02579551376402378,
        0.011065548285841942,
        -0.0431411974132061,
        0.09259216487407684,
        0.016254857182502747,
        -0.05837459862232208,
        -0.0987534150481224,
        -0.01599968783557415,
        -0.012139847502112389,
        0.05848138779401779,
        0.01962774433195591,
        -0.012492107227444649,
        0.001999990548938513,
        0.027676822617650032,
        -0.08501414209604263,
        -0.07520841807126999,
        -0.02528700977563858,
        -0.012991846539080143,
        -0.12424694746732712,
        0.024922089651226997,
        -0.015428334474563599,
        -0.010946239344775677,
        0.041164178401231766,
        -0.029640862718224525,
        0.027101991698145866,
        0.08828573673963547,
        -0.04335721582174301,
        0.09398955851793289,
        -0.043940551578998566,
        -0.030871817842125893,
        0.01390272006392479,
        -0.0049318233504891396,
        -0.017599383369088173,
        0.029319308698177338,
        0.06233184039592743,
        0.03510592132806778,
        -0.03641214221715927,
        -0.048089370131492615,
        -0.002699906937777996,
        -0.018067875877022743,
        -0.07613696902990341,
        0.010081513784825802,
        0.04705960303544998,
        0.04584943875670433,
        0.015962084755301476,
        0.017997941002249718,
        -0.027801575139164925,
        0.04586814343929291,
        -0.09423494338989258,
        -0.033905744552612305,
        -0.00246411026455462,
        0.020282994955778122,
        -0.038381557911634445,
        -0.007718132808804512,
        -0.012112431228160858,
        -0.01553300954401493,
        -0.08484698086977005,
        -0.011598270386457443,
        0.10191723704338074,
        0.032706987112760544,
        -0.011752721853554249,
        -0.0074564008973538876,
        -0.03142343461513519,
        -0.01142040640115738,
        -0.04528666287660599,
        0.018779674544930458,
        0.12198085337877274,
        0.05246903747320175,
        0.007270270027220249,
        0.11011224240064621,
        -0.020352188497781754,
        0.006393338553607464,
        -0.07664963603019714,
        -0.03430630639195442,
        0.006919839419424534,
        0.03970630466938019,
        -0.027791334316134453,
        0.01729288510978222,
        0.029975350946187973,
        0.03030446171760559,
        0.05110013112425804,
        0.04141882434487343,
        0.061125610023736954,
        -0.08339855074882507,
        0.051760315895080566,
        0.0986054390668869,
        -0.00044901695218868554,
        0.0009641544311307371,
        0.007666763849556446,
        0.014440893195569515,
        -0.0010586729040369391,
        0.057253651320934296,
        0.07023981213569641,
        -0.06270702183246613,
        7.446377615531051e-33,
        0.02952643856406212,
        0.06282859295606613,
        -0.017111092805862427,
        0.036576129496097565,
        0.046884745359420776,
        0.029476014897227287,
        -0.016064487397670746,
        0.028328921645879745,
        -0.013261023908853531,
        0.09155832976102829,
        -0.043908439576625824,
        0.0376431979238987,
        -0.035184286534786224,
        0.08672947436571121,
        0.061755575239658356,
        -0.12019484490156174,
        -0.010284656658768654,
        -0.033308062702417374,
        -0.03146638721227646,
        0.005240389611572027,
        -0.018646856769919395,
        0.005000860895961523,
        0.03334854543209076,
        -0.022020045667886734,
        0.16714920103549957,
        0.008522159419953823,
        0.04308890923857689,
        0.008225543424487114,
        0.06783683598041534,
        0.0475597158074379,
        -0.03419121354818344,
        -0.04970391467213631,
        0.033147405833005905,
        -0.022203369066119194,
        -0.049897417426109314,
        -0.002496353816241026,
        -0.08216395229101181,
        -0.09740063548088074,
        0.027921825647354126,
        -0.0894366055727005,
        -0.002649956848472357,
        0.06589943170547485,
        -0.10069043934345245,
        -0.03524986281991005,
        -0.014823591336607933,
        0.015300446189939976,
        0.06874105334281921,
        0.02213616482913494,
        -0.025688543915748596,
        0.029534228146076202,
        -0.13786938786506653,
        -0.06543853133916855,
        -0.056921832263469696,
        -0.06943618506193161,
        -0.05123646929860115,
        -0.043475277721881866,
        0.0017961158882826567,
        -0.02188621461391449,
        0.06986593455076218,
        0.027010995894670486,
        -0.00046307104639708996,
        0.036347776651382446,
        -0.017512034624814987,
        -0.053274162113666534,
        -0.002419976517558098,
        0.045390550047159195,
        0.03208881989121437,
        0.08188284188508987,
        -0.06598550081253052,
        -0.007187018170952797,
        -0.020142795518040657,
        -0.0027835466898977757,
        0.03987231105566025,
        -0.08358428627252579,
        0.06232825294137001,
        0.005790845490992069,
        -0.02158345840871334,
        0.016590746119618416,
        -0.08124618232250214,
        -0.028748808428645134,
        -0.08331239223480225,
        -0.011361292563378811,
        0.004371121991425753,
        0.029515428468585014,
        -0.06187758594751358,
        -0.031219078227877617,
        0.04650625213980675,
        -0.08432887494564056,
        -0.049000415951013565,
        0.029713116586208344,
        -0.04401650279760361,
        -0.02316848374903202,
        0.06434730440378189,
        0.024174658581614494,
        -0.03285657986998558,
        -6.999191646487421e-33,
        -0.01874958537518978,
        -0.0339195653796196,
        -0.00424075685441494,
        0.012305679731070995,
        0.07130837440490723,
        0.0006430570501834154,
        0.04419220983982086,
        -0.035540103912353516,
        0.01777677610516548,
        -0.03592152148485184,
        0.0523255430161953,
        0.026782343164086342,
        -0.1034226268529892,
        -0.060522668063640594,
        0.026838921010494232,
        -0.045377034693956375,
        0.030450068414211273,
        -0.06113998591899872,
        0.02065693773329258,
        -0.017542855814099312,
        0.11280997097492218,
        0.04152577742934227,
        -0.0432671420276165,
        0.013658151961863041,
        0.014577623456716537,
        0.06968628615140915,
        0.047355830669403076,
        -0.005338793620467186,
        0.06910122185945511,
        0.08048798888921738,
        -0.009551243856549263,
        0.016529472544789314,
        0.05388423800468445,
        0.0440903976559639,
        -0.007384903263300657,
        -0.021614551544189453,
        0.11362310498952866,
        0.004543804097920656,
        -0.029548954218626022,
        -0.043601252138614655,
        0.01350092887878418,
        0.06131599843502045,
        -0.04423828050494194,
        -0.002564319409430027,
        -0.013288293033838272,
        0.06042339652776718,
        -0.07447084039449692,
        0.02324727177619934,
        -0.05099613964557648,
        -0.06811821460723877,
        -0.005390152335166931,
        -0.04780257120728493,
        -0.04060925170779228,
        0.014282342046499252,
        -0.08596835285425186,
        -0.03997600078582764,
        0.06714705377817154,
        0.0887381061911583,
        -0.08661355078220367,
        0.012667970731854439,
        0.039732012897729874,
        -0.04401945695281029,
        -0.03306476026773453,
        -0.07865068316459656,
        -0.05575982481241226,
        0.000898278784006834,
        0.05099249258637428,
        0.012601015157997608,
        0.01583033986389637,
        -0.04565655440092087,
        -0.04343577101826668,
        -0.027519602328538895,
        -0.07704997807741165,
        -0.0891559049487114,
        -0.0006156662129797041,
        0.017547661438584328,
        0.016354268416762352,
        -0.052013762295246124,
        -0.023421544581651688,
        -0.03656109794974327,
        -0.027412477880716324,
        0.02976088970899582,
        0.06952308863401413,
        -0.024891886860132217,
        0.055104732513427734,
        0.02776222489774227,
        0.02668069861829281,
        0.031877774745225906,
        0.0021996654104441404,
        -0.03393511474132538,
        -0.002909112488850951,
        0.011762761510908604,
        -0.055972885340452194,
        0.09390375018119812,
        0.022145897150039673,
        -5.883405052031776e-08,
        0.027064938098192215,
        0.009829974733293056,
        -0.00522881094366312,
        -0.0028127646073698997,
        -0.045447591692209244,
        -0.0640593022108078,
        0.014082334004342556,
        0.04263776168227196,
        0.015275281853973866,
        -0.031460124999284744,
        0.022413644939661026,
        -0.07068759948015213,
        0.02170724980533123,
        -0.021127182990312576,
        0.09535099565982819,
        0.09226945042610168,
        -0.036642372608184814,
        0.009885699488222599,
        -0.06912069767713547,
        0.07700129598379135,
        -0.009287730790674686,
        -0.006646881345659494,
        0.02746903896331787,
        -0.031154988333582878,
        0.030559809878468513,
        0.018598975613713264,
        -0.058568090200424194,
        0.009240731596946716,
        0.1246083527803421,
        -0.0223408006131649,
        -0.020506201311945915,
        0.03758114203810692,
        0.03895514830946922,
        -0.056407440453767776,
        -0.0024633510038256645,
        -0.058846332132816315,
        0.020980656147003174,
        -0.02789471298456192,
        0.06741920858621597,
        0.13121704757213593,
        -0.015900321304798126,
        -0.15258267521858215,
        -0.0524541512131691,
        0.060004349797964096,
        -0.04792298004031181,
        -0.08928519487380981,
        0.022549159824848175,
        -0.047956433147192,
        -0.04329857975244522,
        0.07174382358789444,
        -0.028818298131227493,
        0.007703547831624746,
        -0.016490228474140167,
        -0.00442635640501976,
        0.020939335227012634,
        0.02106349915266037,
        -0.03179432824254036,
        0.051406580954790115,
        -0.05241299420595169,
        0.04762955754995346,
        0.1418243944644928,
        -0.0433112308382988,
        -0.03422095254063606,
        0.014430422335863113
    ]
}