{
    "id": "MG_NRcy5mxU",
    "title": "The Apple Store Genius Bar Broke My $5,000 iMac Pro",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2018-05-26T04:44:12Z",
    "video_url": "https://www.youtube.com/watch?v=MG_NRcy5mxU",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "imac pro",
        "screen repair",
        "apple",
        "repair",
        "genius",
        "right to repair",
        "imac",
        "broken",
        "fix",
        "refused",
        "service",
        "servicing",
        "computer repair",
        "smashed",
        "screen",
        "apple support",
        "apple store",
        "apple authorized service provider",
        "genius bar",
        "apple fail",
        "imac fail",
        "imac broken",
        "warranty",
        "applecare",
        "applecare +",
        "ifixit",
        "teardown",
        "technology",
        "mac pro",
        "most expensive computer",
        "imac pro linus",
        "imac pro repair",
        "apple repair",
        "iphone repair"
    ],
    "views": 5868322,
    "likes": 148090,
    "comments_count": 25470,
    "description": "Getting your iMac Pro repaired is even harder than expected... Update video -   Apple's new iMac Pro is a $5,000+ machine but many users are reporting that Apple Support isn't servicing themeven under warranty. They repaired ours, but the Genius Bar destroyed it in the process. What a disaster!  Follow Snazzy Labs on Twitter -  Follow me on Instagram -",
    "description_links": [
        "https://www.youtube.com/watch?v=6OceuTkSYNo",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "Buckle up because this: is quite the story. All right. Let me give you a little background I purchased the five thousand dollar base model iMac Pro back in January of this year And for the most part, it's been a great machine Yeah, it's a bit overpriced but it's been a good performer nonetheless Now, ever since the 5k iMac came out back in 2012 Apple has made you choose at checkout whether you want the classic iMac stand or a VESA adapter to mount onto a monitor arm Which is the choice that a lot of tall people like myself choose But they made you pick when you were configurating the machine Because it was not removable by the end user. Whatever you chose, stand or VESA mount, That's what you were stuck with but much to my delight, This was changed with the iMac Pro The stand is included on every single iMac Pro by default and if you want the VESA adapter Apple cells a user installable one on Apple.com for $80 Sadly, this thing sucks and it has been the source of my worst Apple repair experience ever So back in January, I installed the mount for the first time and it went just fine It comes with a little credit card size tool that allows you to reveal the nine screws that hold the iMac onto the stand and Once you remove all of those screws the stem comes off very easily and then you can put the VASA mount on Which surprisingly only uses five of the nine available screw holes, but I thought you know, whatever. Apple is great to design I'm sure it's not an issue Well, fast forward to March I'm filming a video and I want to take the iMac off of the VESA kit and put it back on the stand Now look, I'm sure it's not designed to be pulled on and off and on and off over and over and over But it never says that you shouldn't take it off or that you can't take it off And so I did and in the process when I was backing out one of the five screws Which was not over tightened, by the way The screw had just broke clean off from the screw body and had left the screw stuck inside of the screw hole threads The end result. Well, this: I couldn't remove the VASA adapter, ever. I considered using a screw extractor However, the screw was so tiny that I just- I couldn't back it out. So I called Apple on the phone, explained the situation, And the representative told me that he couldn't provide support or warranty because the VASA adapter was not manufactured by Apple And I was just sure that the guy was confused This was a new computer and I told them no look the iMac Pro is different from the other iMacs Apple does sell an Apple branded VESA kit on your website. I mean, it's $80, it comes in an Apple box with Apple documentation, etc It has Apple- It's an Apple product, and the guy says that even though it was branded as an Apple product It was actually a licensed OEM that made the part It was made by another company and just had the Apple logo on it and that only that company could provide warranty, replacement parts and support I was irritated because I said, well the number for support inside of this kit is to you, Apple But whatever if you give me the OEM support number, I'll call them and figure it out with them He told me that he couldn't give me the number and that I was just on my own I was so frustrated that I just hung up the phone, grabbed a drill and went ham on the computer I was able to thread the screw Just far enough so that I could pull the VESA adapter kit off of the back of the iMac But then I had one of the, you know, nine holes plugged up But whatever. I was able to successfully put the original stand back on with eight of the nine screws I filmed my video and honestly I kind of forgot about the whole thing until I tried to put the VESA kit back on about a month later Now when I did try to put it on I figured I would try Using four of the five screw holes and to see if it would hold But I didn't even get that far because the first screw went in and fine But the second screw as I was screwing it in- you guessed it, broke clean off, just like the first one Now remember this is only the second time that I'm putting this thing on and I was super careful to barely Tighten those screws given that I saw how, you know, easily the first one broke it's just that Apple includes the crappiest zinc screws ever on this $90 kit for their $5,000+ machine. It's absurd I don't know why they don't include stainless steel screws that cost like a penny more and are way more durable. Obviously, I've got a problem. I can't mount a 25 pound computer with three dinky little screws So I ended up finding an Apple discussions forum thread on Apple.com with a couple of other users saying that they've also experienced broken screws Consequently, I thought well surely Apple's figured out a solution in the last 30 days because other people are having the problem It's gonna be fine. Nope! Not only that, but the phone representative told me to just go to the Genius Bar at an Apple store because he didn't even have training or even access to the support documentation for iMac Pro, That the only way to receive support for iMac Pro was to go to an Apple Store. It's flabbergasting to me that nobody on the phone at Apple can support the customers who give them thousands and thousands of dollars for a computer but [sigh] Whatever. Luckily, unlike most iMac Pro buyers, probably, I live near several Apple stores. So I figured it's not that big of a deal I went to one of the stores, and it was a breeze and everything got fixed in a jiffy Right? No Mm, no So I got to the Apple Store five minutes early and had to wait nearly an hour for the \"head genius\" Which was a term I've never heard of before by the way because he's the only one at that store who was trained to work on a iMac Pro, A computer that has been out for nearly six months Now, to give my Apple store credit, once I did finally meet with the genius He was very understanding of the situation and he told me that even though their system said it was considered accidental damage Was not covered by warranty and would incur an eighty dollar minimum repair fee That he saw it as a clear design flaw and that the store would do the repair for free in three to five days Great, not the most elegant repair experience ever, but we're finally making progress three to five days. I can handle that Well seven days pass and I've heard nothing So I called the store and I asked him what's up The guy on the phone tells me that they had already attempted the repair but quote failed to perform it correctly End quote whatever that means so additional parts and tools that were needed for the repair had been ordered But they had no ETA on when those parts would arrive or when the repair would be finished All right. Well not five minutes after hanging up the phone I get a call from the store manager who tells me a completely different story That the repair is going fine that the parts have already arrived and then the genius who started my repair isn't working over the weekend But that they've prioritized the repair the other geniuses know what to do and it will be done by Monday Finally on Monday morning I get a call telling me that they need the iMac stands that I had here at the office and I told them that They could put it on the stand if they needed to but I would prefer them to just install it on the base amount It'd be easier for me easier for whatever and they said that they would but they need the stand to finish the repair Okay, so Monday afternoon, I dropped the stand off at the Apple store and they told me that would probably be done by Monday evening Monday evening passes nothing Tuesday passes nothing I call Wednesday morning day 13 of this 3 to 5 day repair, and I'm told the following quote This iMac Pro is new and some of the geniuses were confused They didn't know that the vase amount was removable. But our head geniuses back today says he knows how to fix it And hopefully it'll be done by tonight end quote. Ok. First of all that vase amount is the whole entire repair Secondly, how can the genius not know that that's removable trained on the iMac Pro or not? That's literally something that's told in the store. I mean, they should know that But whatever Wednesday night at 9:00 p.m I'm delighted to see an email that says the repair is complete and I'm just ready for pickup the next morning, huh? Now the story's over No It's not I went into the Apple store Wednesday morning picked up my computer and as I'm getting in my car noticed that the stand that they requested on Monday was Completely chowder not only were there scratches all over the thing But the aluminum anchor points were so warped that I didn't even know if I could ever put the stand back on the iMac So I went back into the store said hey What's up, and here's a recorded snippet of the event I Don't know what happened like we had document like we had documentation of the scratches being there But not this there weren't even scratches brand-new. Oh really? It's I mean, it's fine. I don't even care about the scratches Cosmetically, but if I can't even know Okay, so I get a new stand but now I'm kind of curious to see if the stand was so screwed up He's my iMac damaged below the vase amount. So let's take a look Okay, so I'll remove the iMac from this protective sleeve II See if they take the screens over, okay? Yeah, that's good. They didn't break the glass. So we're off to a good start Okay now I need a Torx TR ten screwdriver And we'll just remove these And good, that's not very tight so I have high hopes that the genius didn't well yeah, that's okay Okay one screw comes out, okay? Two screws come out, okay And now we get to the trouble part. Okay, so hopefully the genius didn't over tighten these We're gonna just back him out one by one very gently and Wow ya know he was he was nervous. These are barely Finger tight even look at that So he was he was even spooked just careful not to over-tighten, which was good Okay, we've got two out successfully No way are you kidding me? Look at that that's broken clean off look That's broken I don't I'm not gonna be able to get this thing off again This is the worst designed Apple product I've ever ever laid my hands on. Okay, that one came out fine Here comes the last one. Hope it doesn't break - All right that came out. Okay You've got to be kidding me This is a joke, I mean, I guess at least it broke to the point where I can pull it off But look at that, that's one of the screws broken We're already back to square one Okay It's not messed up as badly as the stand but almost got a nick there Nick there Nick there this whole Bottom row is like shaved off You gotta be kidding me so We're back to square one. It's broken again I'm probably just gonna leave it on the VESA mount I'm sure if I went back to the store and really complained they'd fix it again for free but how first of all can Apple sell an $80 adapter for a $5,000 plus computer with screws that break off every single time. It wasn't just mine adapter that had a bad batch of screws This is a brand new one that Apple shipped three days ago to the Apple store already broken. It's bananas Not only am I flabbergasted by that, but I am just so surprised at the sheer lack of training From both the phone reps and the geniuses in the Apple Store with Apple's flagship $5,000 plus computer Now look sure Very few consumers are actually going to go out and buy an iMac Pro so it doesn't really make sense to train everyone on iMac Pro, but I've been buying Apple Pro machines for years and I have always always received top-tier support In fact Apple has historically gone above and beyond to make sure that their pro users are happy when my out of warranty Mac Pro GPUs burned up They replaced them back when I had my trashcan Mac Pro every time I called for support I immediately got to a high tier advisor. No phone tree. No, wait required but not anymore I'm just a regular customer with a machine that nobody knows how to fix and I don't know about you but That doesn't sound very Pro to me. Well folks that's all for me You should share this video with your friends with your Twitter followers with the intern I don't I feel like more people need to know about this if you enjoyed this video Please give it a like if you didn't. Oh that other button seems to work Okay to check out some awesome other videos that I've made in the past They are wonderful and you will learn quite a lot but most importantly and as always stay snazzy",
    "transcript_keywords": [
        "Apple",
        "Apple store",
        "iMac Pro",
        "VESA adapter Apple",
        "Pro",
        "Apple Pro machines",
        "Apple store Wednesday",
        "iMac",
        "iMac Pro back",
        "Apple branded VESA",
        "Apple Pro",
        "buying Apple Pro",
        "store",
        "screws",
        "back",
        "screw",
        "stand",
        "VESA",
        "Apple store credit",
        "Apple product"
    ],
    "transcript_entity_values": [
        "three days ago",
        "5k",
        "three to five days",
        "2012",
        "five minutes",
        "Wednesday",
        "Wednesday night",
        "Torx",
        "the weekend",
        "80",
        "ETA",
        "eight",
        "nearly six months Now",
        "evening",
        "five thousand dollar",
        "OEM",
        "a penny",
        "eighty dollar",
        "an Apple Store",
        "$5,000+",
        "90",
        "afternoon",
        "years",
        "Tuesday",
        "This iMac Pro",
        "two",
        "Apple",
        "VESA",
        "II",
        "Monday",
        "9:00 p.m",
        "ten",
        "tonight",
        "VASA adapter",
        "iMacs Apple",
        "about a month later Now",
        "3 to 5 day",
        "iMac Pro",
        "today",
        "25 pound",
        "Secondly",
        "nick",
        "Mac Pro",
        "iMac Pro",
        "Apple Pro",
        "Nick",
        "Apple.com",
        "thousands and thousands of dollars",
        "the next morning",
        "first",
        "one",
        "four",
        "morning",
        "the Genius Bar",
        "nearly an hour",
        "iMac",
        "January of this year",
        "five minutes early",
        "nine",
        "Two",
        "the iMac Pro",
        "five",
        "seven days",
        "March",
        "First",
        "second",
        "5,000",
        "Twitter",
        "the iMac Pro The",
        "January",
        "the last 30 days",
        "three",
        "the Apple Store"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "TIME",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "FAC",
        "MONEY",
        "MONEY",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "ORG",
        "LAW",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.055365707725286484,
        -0.003564693732187152,
        0.10308081656694412,
        -0.05165325105190277,
        0.02481270208954811,
        -0.03255569934844971,
        0.0071286787278950214,
        0.07282905280590057,
        -0.01322671677917242,
        0.09645924717187881,
        0.07792376726865768,
        0.07772715389728546,
        0.08667930960655212,
        0.020807789638638496,
        0.00023379441699944437,
        -0.007494249846786261,
        0.009179811924695969,
        -0.1247478798031807,
        -0.02575758472084999,
        0.03873256593942642,
        -0.06961926072835922,
        -0.09610725194215775,
        -0.033655110746622086,
        0.016113173216581345,
        -0.05168187618255615,
        0.06574925035238266,
        0.029834628105163574,
        -0.0017587433103471994,
        -0.07142745703458786,
        -0.04886673763394356,
        -0.06510023772716522,
        -0.03880191966891289,
        0.036709532141685486,
        -0.03467009589076042,
        0.0032234014943242073,
        -0.05736096203327179,
        0.09286845475435257,
        -0.017491092905402184,
        -0.0987110435962677,
        -0.12321330606937408,
        -0.01212634239345789,
        -0.005990542471408844,
        -0.016277657821774483,
        0.05957624316215515,
        0.10304882377386093,
        0.007761216256767511,
        0.09941067546606064,
        -0.060231756418943405,
        0.034315623342990875,
        0.05906692519783974,
        -0.007858929224312305,
        -0.05317514017224312,
        0.025646403431892395,
        -0.018585454672574997,
        -0.03041747212409973,
        0.06256939470767975,
        0.06891503930091858,
        -0.0574260875582695,
        0.055153947323560715,
        0.09287893027067184,
        0.06481152027845383,
        -0.06187143921852112,
        -0.004888756666332483,
        -0.008104473352432251,
        0.04795068874955177,
        -0.004230996128171682,
        -0.026696253567934036,
        -0.011802339926362038,
        -0.06730236113071442,
        0.01144970953464508,
        0.015063098631799221,
        -0.06797522306442261,
        0.046889591962099075,
        0.08637788146734238,
        0.0585743710398674,
        0.034957122057676315,
        0.005824116989970207,
        -0.15139518678188324,
        0.03802252933382988,
        0.05214624106884003,
        -0.0357767790555954,
        -0.00055086420616135,
        -0.07795125246047974,
        -0.01338563859462738,
        0.04099908843636513,
        -0.000805534771643579,
        0.019788023084402084,
        -0.02946738339960575,
        0.06035728380084038,
        -0.05945902690291405,
        0.056660883128643036,
        0.0378517247736454,
        0.07366375625133514,
        -0.008789711631834507,
        0.031095335260033607,
        -0.011153334751725197,
        -0.039626456797122955,
        -0.0015970930689945817,
        -0.03770974278450012,
        0.030158696696162224,
        0.044050030410289764,
        0.03327745571732521,
        0.10822925716638565,
        -0.06982708722352982,
        -0.004484659060835838,
        -0.08095359802246094,
        0.0017061528051272035,
        0.059378527104854584,
        0.0067958831787109375,
        0.009057730436325073,
        0.004258235450834036,
        -0.0349571593105793,
        -0.0391240268945694,
        0.052580978721380234,
        0.05704003944993019,
        0.019267156720161438,
        -0.047196660190820694,
        -0.0004399523895699531,
        0.07822205871343613,
        -0.038293298333883286,
        0.02836485765874386,
        0.0381842702627182,
        0.022418459877371788,
        0.025777069851756096,
        -0.041179265826940536,
        0.046859320253133774,
        -0.050275638699531555,
        6.078073538499107e-33,
        -0.08938515186309814,
        0.019370609894394875,
        -0.03757284954190254,
        0.054860539734363556,
        0.0040310826152563095,
        -0.06480800360441208,
        0.052525922656059265,
        0.033826038241386414,
        -0.020740263164043427,
        0.010895914398133755,
        -0.028592174872756004,
        0.03265064209699631,
        -0.030404770746827126,
        0.014903362840414047,
        0.02767220512032509,
        -0.0423767976462841,
        -0.0144495265558362,
        0.02350670099258423,
        -0.025473006069660187,
        0.02966846153140068,
        0.03182224929332733,
        -0.05411753058433533,
        0.033096663653850555,
        -0.07236053794622421,
        0.02869974821805954,
        0.09078235924243927,
        0.030296484008431435,
        0.0852588564157486,
        0.024800539016723633,
        -0.003154107602313161,
        -0.09203366935253143,
        0.017157921567559242,
        0.0915759727358818,
        -0.025771383196115494,
        -0.0004920646315440536,
        -0.03522077202796936,
        0.015046185813844204,
        -0.022353027015924454,
        0.0006712554604746401,
        0.005052666179835796,
        -0.1063242107629776,
        0.04065445438027382,
        -0.03213382884860039,
        0.03725292906165123,
        0.07290921360254288,
        0.05852603167295456,
        -0.02149682119488716,
        0.03695520758628845,
        -0.029475025832653046,
        0.006327878218144178,
        -0.11535903066396713,
        0.051433853805065155,
        -0.004602999426424503,
        0.04548677057027817,
        -0.10367569327354431,
        -0.00016926301759667695,
        0.01631183922290802,
        0.010261506773531437,
        0.09926743805408478,
        0.03031526505947113,
        -0.04734571650624275,
        0.09134124219417572,
        -0.03409701585769653,
        0.0455002523958683,
        -0.021722834557294846,
        0.0815260037779808,
        -0.035362161695957184,
        0.028374189510941505,
        -0.04543619230389595,
        0.029116123914718628,
        0.020173287019133568,
        0.021255571395158768,
        -0.017822585999965668,
        -0.053588371723890305,
        -0.04133226349949837,
        -0.0164643581956625,
        -0.09906371682882309,
        0.015121720731258392,
        -0.13189807534217834,
        -0.0074713630601763725,
        0.04822959750890732,
        0.03694317117333412,
        0.006178634706884623,
        0.0852508693933487,
        0.010417450219392776,
        0.10172972083091736,
        0.11726892739534378,
        -0.016569428145885468,
        0.025738222524523735,
        -0.0327310785651207,
        0.08084234595298767,
        -0.03456876054406166,
        0.039065610617399216,
        -0.01661703549325466,
        -0.0294688418507576,
        -5.3472124972692424e-33,
        0.06403928250074387,
        -0.11560212820768356,
        0.021341942250728607,
        0.04597119987010956,
        0.019326459616422653,
        -0.0739397406578064,
        -0.010081988759338856,
        0.018278203904628754,
        -0.09646757692098618,
        -0.04100717231631279,
        0.016041584312915802,
        0.01202126033604145,
        -0.024718355387449265,
        0.03533942997455597,
        -0.030919326469302177,
        0.04191650077700615,
        -0.04019862413406372,
        -0.043795205652713776,
        0.01774933747947216,
        -0.02622080221772194,
        0.08586619049310684,
        0.03478359431028366,
        0.015745237469673157,
        0.014650462195277214,
        -0.028739994391798973,
        0.03743559122085571,
        0.009960781782865524,
        -0.002393563510850072,
        0.032295797020196915,
        -0.029564714059233665,
        -0.04645480960607529,
        -0.021496625617146492,
        0.028724947944283485,
        -0.0062662274576723576,
        0.09589672088623047,
        0.025019142776727676,
        -0.030203651636838913,
        -0.05676255375146866,
        -0.01836371049284935,
        -0.002427760511636734,
        0.02504900097846985,
        0.12261530011892319,
        -0.009351029060781002,
        -0.023505186662077904,
        0.009470704942941666,
        0.05361178144812584,
        -0.013169358484447002,
        0.005878699477761984,
        0.0420234277844429,
        -0.045730672776699066,
        -0.04289265722036362,
        -0.06790687143802643,
        0.008719907142221928,
        -0.045556001365184784,
        -0.05020955204963684,
        -0.0589071623980999,
        0.03714148327708244,
        0.09640363603830338,
        -0.04985475912690163,
        0.01596331037580967,
        -0.06502289324998856,
        -0.02856026589870453,
        0.017015086486935616,
        -0.07729174196720123,
        0.033326175063848495,
        -0.003640497103333473,
        0.06864061206579208,
        0.003560764715075493,
        -0.04743901267647743,
        -0.010550783947110176,
        -0.017755383625626564,
        0.01838023029267788,
        0.027118707075715065,
        -0.14337940514087677,
        0.011546047404408455,
        0.10235614329576492,
        0.007247515022754669,
        -0.019277675077319145,
        -0.014876948669552803,
        -0.029042314738035202,
        -0.016338881105184555,
        -0.038375649601221085,
        0.04744844511151314,
        -0.02934720367193222,
        0.02448171377182007,
        0.046962443739175797,
        -0.021033110097050667,
        -0.004773829597979784,
        -0.015488498844206333,
        0.01070424821227789,
        -0.06569817662239075,
        -0.01397108193486929,
        -0.05231824517250061,
        -0.004059066064655781,
        -0.015115572139620781,
        -5.444890760486487e-08,
        -0.05210515484213829,
        0.013150316663086414,
        0.02727602608501911,
        0.0226398017257452,
        0.07062345743179321,
        -0.051803022623062134,
        -0.01960185170173645,
        -0.010610155761241913,
        0.11092063784599304,
        0.027868926525115967,
        -0.0248123649507761,
        -0.07882454246282578,
        -0.0688905268907547,
        0.0620037280023098,
        -0.08421910554170609,
        0.03716988116502762,
        -0.05452030897140503,
        0.11172749847173691,
        0.0014655686682090163,
        -0.03222944214940071,
        -0.08165331184864044,
        0.05270766466856003,
        0.04686467722058296,
        -0.06823290139436722,
        -0.041231490671634674,
        -0.020514462143182755,
        -0.05777863413095474,
        0.04194088280200958,
        0.02813420630991459,
        -0.046144116669893265,
        -0.09035041183233261,
        -0.043811820447444916,
        0.037003569304943085,
        -0.029223229736089706,
        0.06691890209913254,
        -0.08414667844772339,
        -0.060853295028209686,
        0.09118541330099106,
        -0.0017368501285091043,
        -0.009015388786792755,
        0.02239847742021084,
        -0.06590531021356583,
        -0.11467503756284714,
        0.010544105432927608,
        -0.009703820571303368,
        -0.006220171228051186,
        -0.07997628301382065,
        -0.01720152236521244,
        -0.04679194092750549,
        0.06010020524263382,
        -0.01020161621272564,
        -0.014371002092957497,
        0.028272300958633423,
        0.010908129625022411,
        0.00775805814191699,
        -0.03884049132466316,
        0.012029278092086315,
        -0.012446367181837559,
        -0.026934603229165077,
        0.09261520206928253,
        0.07981371879577637,
        -0.09778185188770294,
        -0.014424063265323639,
        0.022938000038266182
    ]
}