{
    "id": "mh1LC0M2zLc",
    "title": "Modbook Mac Tablet: Where Did You Go? - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-10-22T20:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=mh1LC0M2zLc",
    "category": "Science & Technology",
    "tags": [
        "Modbook Mac Tablet: Where Did You Go? - Krazy Ken's Tech Talk",
        "Modbook",
        "Axiotron",
        "Modbook Pro",
        "Modbook Pro X",
        "MacBook",
        "MacBook Pro",
        "Apple",
        "Steve Wozniak",
        "Andreas Haas",
        "Steve Woz",
        "Newton",
        "MessagePad",
        "Mac Tablet",
        "Wacom",
        "Rare",
        "Rare Modbook",
        "Rare Mac",
        "Mac OS X",
        "macOS",
        "iPad",
        "iPhone",
        "Macworld",
        "Snazzy Labs",
        "InkWell",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Tech",
        "Computer Clan",
        "Crowdfunding",
        "First Sale Doctrine",
        "Kickstarter",
        "Crowdfunder",
        "Wefunder",
        "GPS"
    ],
    "views": 244938,
    "likes": 7494,
    "comments_count": 437,
    "description": "The now rare Modbook Mac tablet was successful at one time, but when $1,800,000 is raised for a product that never shipped, the investors grow impatient, and the story gets a little dicey  Watch more knock-off / scam episodes   Watch my Modbook first impressions   Support our channel and get cool stuff   Subscribe for more tech videos!    Notes: When I talked about the 2016 MacBook Pro, I accidentally said \"16-inch\" when I meant \"15-inch.\" The \"16-inch\" model came out in 2019. Also, in regards to first sale doctrine, I'm not an attorney, so don't take that as legal advice. ; )  Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - What Happened to the Modbook Mac Tablet?  Watch Snazzy Labs' Modbook video     Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "http://bit.ly/clan3o1EdZ2",
        "https://youtu.be/443qmsUxjds",
        "https://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "https://youtu.be/2AoX-5KIh9Q",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- A MacBook A tablet. And a global positioning system. (audience laughing) A MacBook. A tablet. (audience laughing) Are you getting it? (audience applauding) These are not... three separate devices. This is one device... and we are calling it... Modbook. (audience cheering) Oh, hi. I'm just waiting for the new Modbook Pro X to come out. Yeah, it's been six years, but I'm patient. And hey, they raised $1.8 million, right. So it's got to come out soon. No worries. (upbeat music) Hey guys, how are you all doing? Really, that's just great. You know, I'm doing pretty great today too. If you're new here, welcome. My name is Krazy Ken, and today we gonna dive into the mystery of the Modbook. That's right, the rare Mac tablet that won best in show at Macworld 2007. it was a pretty big deal. Heck, even Apple's co-founder, Steve Wozniak helped to work on it. But what happened to these guys? They raised $1.8 million, probably more than that, for their latest product, and the shipping date kept slipping and slipping. And it's been two years, over two years, and we have not received any updates from the company. So that sounds kind of bad, but right off the bat, I'm gonna say, this is not a typical scenario. A lot of times when I cover a scam or knockoff products and companies on the show, a lot of the stuff is fake and people try to run these scam operations and take people's money when there's really nothing there to sell, or it's just a piece of crap. This is completely different, they had physical products that's sold, and the products were good. So how come they had success and they had actual things to sell and then this happened? Why? Well, that's what we're gonna talk about today. So buckle in because we're gonna go through a journey through this rare semi Apple hardware. The first Modbook was released in 2008 by Axiotron, a California-based company headquartered in Los Angeles. Leading the project was former Apple employee, Andreas Haas. And he brought on Apple's co-founders, Steve Wozniak, as an advisor. Haas worked at Apple in Europe, particularly in the Newton Systems Group. Remember the Newton? This was Apple's stab at a portable pen-input device. It launched in August, 1993 with the MessagePad, and when Steve Jobs returned to Apple, he threw the project into a fiery pit. The last Newton product was the MessagePad 2100, introduced in 1997 and discontinued February, 1998. So it appears that Haas' interest in pen-input Apple products was birthed from the Newton line. And even though the line died, his passion for it did not. Now Apple was still thoroughly interested in bringing touch-based products to the market. And they did a lot of R&D before announcing the first iPad on January 27, 2010. I made a separate episode about the first-gen iPads history, by the way. So if you're interested, check that out too. Anyway, the Newton's death aside, Haas's wanted to persist. And he showed off the first Modbook prototype at Macworld 2007, which was also the first year Apple introduced their first multi-touch device, the iPhone. Not sure if that was a coincidence or not, but it probably was. Anyway, let's take a look at this thing. The Modbook is exactly how it sounds. It's a modified MacBook. Axiotron would take a white MacBook, rip off the screen and keyboard, and stick a Wacom digitizer on top, and a magnesium bezel around the sides. Other than the Wacom display, and a few other tweaks, the rest of the hardware was an authentic MacBook. All the ports were still present, even the SuperDrive. I mean come on, when was the last time you saw a tablet with an optical drive? So you could buy the Modbook as a standalone product, if you want, or if you had a white MacBook laying around, you could ship this in and use ModService. They would take your MacBook and convert it into a Modbook for you. So, that saved you some money. You can go either way. My particular model is based on a 2.13 GHz, Intel Core 2 Duo, Mid-2009, MacBook5,2. It has six gigabytes of Ram, and NVIDIA GeForce 9400M, and a 120 GB SSD. The pen input is managed by Wacom Penabled Technology, and it refreshed the pen's positioning 133 times a second. On top, the eyesight camera is still present and functional, and on the side we have two buttons. One is the power button and the other is the Modkey. A long press of the Mod key resets, the touch digitizer. So if your pen input isn't working, this button can help fix that. And a short press enables the GPS. Yeah, a Mac with GPS. Brave new world. So how do you interact with this thing? You can hover the pen over the screen to control the cursor and then tap the pen to click. You can also use the buttons on the pen for other actions. For example, the top button triggers a right click and you can program the opposite end of the pen to perform application-specific functions. For example, in Photoshop, you can turn the pen over and use it as an eraser. For typing you can use the quick clicks onscreen keyboard, or you can plug in a physical keyboard if you'd like, but you can also use Apple's InkWell feature. This let you use handwriting to enter in text, which is a feature iPadOS 14 just now received in 2020, kinda funny. So let's recap, let's say it's 2009. You have this model, it's a Mac OS X tablet, 13-inch screen, battery-powered with a camera USB, ethernet, wifi and SSD, dual-core processor, an optical drive, all in one package. That's pretty nice. I don't know the price of this exact configuration, but the baseline model in 2008 sold for $2,290, which is a pretty fair price for what you get. Especially when you look at the MobileStudio Pro today, that 13-inch model sells for about the same price. So you're probably wondering why didn't Apple stop this from happening. I was actually kinda surprised when I found out Steve Wozniak himself was on the advisory board. So, what's the deal. They shut down Psystar. Remember those guys, they were selling those hackintoshs and OpenCore Computer, not associated with the bootloader by the way. They almost went down that same path that Psystar took, but thankfully they shut down before they got into legal trouble. So if Apple was able to shut companies like Psystar down, why didn't they do anything about Axiotron? Well, remember there's still an authentic Mac inside this product. And this is what brings us to United States Code Title 17, which is all about copyright law. So if you need an interesting date conversation starter, oh yeah, this is a good one to talk about. Anyway, section 109 of Title 17 has this thing called the First Sale Doctrine, and that gives us certain rights to sell copyrighted work. So for example, let's say I have this Blu-ray and I don't watch it anymore. I could sell it to you. No problem. But then that's it. That's my first and only sale. I can't duplicate this Blu-ray and sell all of those duplicates. That doesn't work, that would be illegal, but I'm protected on the first sale. That's what the First Sale Doctrine lets us do. So because they're purchasing this authentic Mac hardware and doing these modifications to it, they can sell it and they're within the boundaries of the law. So the Modbook goes on sale. People like it. Congratulations. Everything's good. So what happens next. In 2009, Haas and Woz showcased the new Modbook Pro at Macworld 2009. This model was based off the newer 15-inch MacBook Pro and it was repackaged into an all new design. Unlike the last model where the custom design was on top and Apple's original case was on bottom. The Modbook Pro's entire exterior was custom made. - So the new design basically it's your own original design. And if Apple decides that they wanna totally, not totally revamped, but they wanna do some major changes to the Modbook or Modbook Pro, this gives you more flexibility in how you construct your touch pad, your touch book. - Yeah absolutely. - But here's the weird thing. It was announced in 2009, but it didn't go on sale until 2012. So why the three year gap? Well, unfortunately, actually Axiotron was dissolved in 2011. They had to shut down. There's been some speculation as to why this happened. Some say The Great Recession didn't help at all. I mean, it didn't. Some we'll talk about the first-gen iPad that went on sale, you know, that maybe affected the sales for the Modbook. And yeah, those two things probably played a role. But according to Ars Technica, Haas was reported saying that Lehman Brothers bankruptcy was the main reason, they couldn't get more capital and ultimately they had to shut down. But in 2012 Haas reportedly secured enough private equity, he didn't wanna go with anybody else anymore. He wanted it to be all private investors and apparently he got enough money together. And in 2012, February 2nd more specifically, he formed the new company, Modbook Incorporated. I don't have any official sales record or anything for the actual Modbook Pro itself. But from what I hear, there's probably only several hundred that have been sold. So that very likely makes that model way more rare than the model I have. So, why didn't it sell well? I mean, technology was changing. There was the iPad now. it was kind of expensive, I mean the Modbook Pro was $3,000, about $3,000. And when it was first talked about in the Macworld video back in 2009, it was going to sell for $5,000. But low sales aside, Haas continued forward with an all new vision for an all new Modbook. And this is where things just get a little dicey, and a little mysterious. Let's look. Haas envisioned a completely new Modbook called MacBook Pro X. It was based on the new MacBook Pro with a retina display, boasting a quad core CPU, a 2880 by 1800 display, and depending on the configuration an Nvidia GeForce GT 750M. More or less, this is the same configuration of the MacBook Pro I've been rocking for almost seven years. So in my opinion, that's a solid foundation. And on top of that, there was a new detachable keyboard stand and key bars for programmable shortcuts. So the future of the Modbook was radical and new and pretty exciting. But as with any new vision, there was always that one thing that wants to get in the way and crush all of your dreams, money. So, Haas turned to Kickstarter. If you pledged at the 3,999 level, you would get your own Modbook pro X with an estimated shipping date of February, 2015. Yeah. And hypothetically that saved you $600 off the estimated 4599 retail price. And in the end 331 backers helped raise nearly $320,000 for the product, which is way higher than the original goal of 150,000. I'm not pretending to be one of the guys on Shark Tank or anything, but when I was researching this and I looked at that number, I was like, there's no way a $150,000 is gonna cover all of the engineering, and the R&D, and the marketing, and everything else for a new product, there's just no way. But, Haas is this a smart guy. I'm pretty sure he knew what he was doing. The $300,000 or the original hundred $150,000 was never supposed to be enough to actually complete the product and do everything. But it was supposed to be enough to get the attention of new backers and to entice those new backers with really deep pockets to fund the rest of the project. So the team sought more investments through Crowdfunder, which works kind of like Kickstarter, but with Kickstarter, you pledge and you get an award or a perk or a product or whatever. But on Crowdfunder you get equity in exchange for your investment. But in a future update, Haas said he began hosting an equity crowdfunding campaign at wefunder.com, not crowdfunder.com. So either Crowdfunder didn't work out or it didn't make enough money, I don't know. The web pages video is restricted and there's no indication of any funds raised. So if anyone can shed some light on that confusion, lemme know. And just when you thought things couldn't get worse, literally 15 days after that update, Apple launched the all-new 16-inch MacBook Pro with Touch Bar. This was a completely different computer than what the Modbook Pro X was built on. - But they wanna do some major changes to the MacBook or MacBook Pro. - So the Modbook team announced the new Modbook Pro X with a tweak design, a remote, and a touch bar. This was met with mixed results. As some backers have looked forward to having the latest and greatest while some grew inpatient and merely wanted the thing they paid for years ago. So the team persisted, and despite being incredibly behind schedule, they kept posting updates. Things seemed optimistic. So, on the wefunder.com. Haas launched a campaign to gain more funds. And the first update on the site was published on November 24th, 2017. So I'm guessing the campaign started a little before that time. And in the end they raised $1.5 million from 286 backers. Then on August 3rd, 2018 Haas posted photos of the preproduction parts, finishing off with a photo of the bezels and the display panel put together, giving people a general idea as to how the finished product would look in its physical form. And finally, he tied it up with the words \"That's all I've got for today.\" And then, silence. It's been two years at the time of this episode, and there has been, actually over two years, and there's been no updates on Kickstarter or on Wefunder. A few days later, they posted an unrelated item to their Facebook page. In fact, many of the posts on their Facebook page weren't related to the project's development, but I suppose that's okay. But after that, nothing, they were quiet. But the backers, they weren't so quiet. There's tons of questions and negative comments popping up. Many I saw were posted within the last year. One poor guy claimed to have pledged $7,500 on Kickstarter. Yeah. I haven't seen a reply from anyone on the Modbook staff. And I know Andreas did reply to a bunch of people, at one time. He was really persistent and he kept up with all the questions, but now there's nothing. Heck even Quinn from Snazzy Labs emailed them, he heard nothing back and he went the extra mile, literally. He drove to their office and there was nobody there. But he did talk to a security guard to see if Haas was ever on the property. And, I won't spoil the results, he does cover that in his video, so go check it out, it's pretty good too. So here we are $300,000 on Kickstarter, $1.5 million on Wefunder. And if there's no overlap, that's about $1.8 million that was sunk into this project, and nothing shipped. So, where's the money going? It can't just disappear. I mean, it could, but did it? Well, according to the annual reports on the SEC website, they are in debt, they are losing money. So, that's likely where the money is going. There could be some other things going on that we don't know, but yeah, they're in debt and we're probably never going to hear from Haas again. But if we do that would make for one hell of a followup story. So maybe. Like I said, at the beginning, this is kinda different from the other scam and knockoff products and companies I cover on the show, because there was legitimate experience here. Haas worked at Apple, Steve Wozniak was the fricking co-founder of Apple, and they worked together on this. This wasn't just some smoke and mirrors, scammy thing with a bunch of fancy computer generated renders and stuff, they had physical products and sales and success. So, I like to think the effort was there, the passion was there. It's just, they dug themselves into a financial hole and now they're stuck and they can't face the backers. Let's think about the product for a second. Nowadays, is it really something we need? You can get an iPad Pro for not very much money. You could even get a Surface Studio for less money than that. You can connect drawing tablets to your computer, your Mac, or your PC. Heck you can even use an iPad with Sidecar to connect to your Mac over Lightning and use it as a drawing tablet. So, I don't know if the Modbook Pro X is really needed anymore, the status quo has changed. But back in 2008, this was a pretty bitching device and who knows, maybe Apple will even launch their own Mac equivalent of a Surface Studio. We'll see. So lemme know what you think about this rare piece of tech history and check out Snazzy Labs' video as well. It's really good. And if you're interested, feel free to check out my first-impressions episode, I made a few weeks ago, with my artist friend. That was really fun too. And speaking of rare tech by popular demand, I will be doing an episode about this rare one-of-a-kind Macintosh. So, stay tuned for that. And if you'd like to help fund the future of the Computer Clan, plus get some awesome perks along the way. And trust me, I will actually give you the stuff, like I won't make you wait six years, feel free to pledge to our Patreon. Thank you in advance for your support. And if you can't pledge right now, at least share this episode with some friends or put it on your social media. Thank you very much. And hey, if you liked this episode, you know what to do. Thanks for sticking with me, catch the crazy and pass it up. (upbeat music)",
    "transcript_keywords": [
        "Modbook Pro",
        "Modbook",
        "Apple",
        "Pro",
        "MacBook Pro",
        "Haas",
        "actual Modbook Pro",
        "MacBook",
        "Modbook Pro entire",
        "Steve Wozniak",
        "product",
        "Mac",
        "money",
        "products",
        "Sale",
        "years",
        "Modbook called MacBook",
        "Apple products",
        "Kickstarter",
        "sell"
    ],
    "transcript_entity_values": [
        "ModService",
        "OpenCore Computer",
        "3,999",
        "SEC",
        "Los Angeles",
        "Modbook Pro",
        "Modbook",
        "NVIDIA GeForce 9400M",
        "331",
        "two",
        "3,000",
        "February 2nd",
        "Nvidia GeForce",
        "Andreas Haas",
        "SSD",
        "Steve Wozniak",
        "Lehman Brothers",
        "a Surface Studio",
        "Ram",
        "16-inch",
        "Snazzy Labs",
        "about $1.8 million",
        "14",
        "MacBook",
        "15 days",
        "the MobileStudio Pro",
        "three year",
        "Modbook Pro X",
        "Modkey",
        "one",
        "Modbook Pro",
        "MacBook Pro",
        "two years",
        "Mid-2009",
        "Newton",
        "the Newton Systems Group",
        "Blu-ray",
        "Psystar",
        "7,500",
        "2020",
        "November 24th, 2017",
        "United States",
        "Facebook",
        "iPads",
        "Modbook",
        "Wacom",
        "section 109",
        "Apple",
        "Haas",
        "January 27, 2010",
        "the Modbook Pro",
        "Mac",
        "February, 1998",
        "August, 1993",
        "150,000",
        "first",
        "A few days later",
        "Newton",
        "Modbook",
        "Kickstarter",
        "2,290",
        "2.13 GHz",
        "Shark Tank",
        "MacBook5,2",
        "years ago",
        "MacBook",
        "600",
        "three",
        "USB",
        "13-inch",
        "Intel Core 2 Duo",
        "133",
        "2009",
        "Macworld 2007",
        "hundred $150,000",
        "Kickstarter",
        "almost seven years",
        "GPS",
        "$1.5 million",
        "iPad",
        "MacBook",
        "2880",
        "today",
        "the Modbook Pro X",
        "Krazy Ken",
        "Patreon",
        "MessagePad",
        "six gigabytes",
        "about $3,000",
        "August 3rd, 2018",
        "CPU",
        "Woz",
        "Steve Jobs",
        "1997",
        "Crowdfunder",
        "300,000",
        "The Modbook Pro's",
        "Modbook Incorporated",
        "$1.8 million",
        "iPhone",
        "the MacBook Pro I",
        "5,000",
        "Ars Technica",
        "2011",
        "the Computer Clan",
        "SuperDrive",
        "a few weeks ago",
        "annual",
        "February, 2015",
        "150,000",
        "Wacom Penabled Technology",
        "Macworld 2009",
        "Wefunder",
        "Haas",
        "the last year",
        "the first year",
        "Europe",
        "Mac",
        "Macintosh",
        "15-inch",
        "only several hundred",
        "nearly $320,000",
        "Andreas",
        "1800",
        "2008",
        "InkWell",
        "California",
        "Macworld",
        "286",
        "Quinn",
        "Title 17",
        "Axiotron",
        "Snazzy Labs'",
        "One",
        "MacBook Pro",
        "Modbook pro X",
        "120",
        "MacBook Pro with Touch Bar",
        "First",
        "second",
        "six years",
        "2012",
        "The Great Recession"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "EVENT",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "FAC",
        "DATE",
        "FAC",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "PRODUCT",
        "EVENT",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "FAC",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "GPE",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "NORP",
        "MONEY",
        "FAC",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "LOC",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.056008923798799515,
        -0.002320583676919341,
        0.07335896790027618,
        -0.12160810083150864,
        0.04732269421219826,
        -0.012020094320178032,
        0.000747768790461123,
        0.09979459643363953,
        -0.010873779654502869,
        0.07138869166374207,
        0.11304468661546707,
        0.08479545265436172,
        0.031605470925569534,
        -0.028531372547149658,
        0.052685901522636414,
        0.0170524250715971,
        0.05790846794843674,
        -0.08411753922700882,
        -0.054843127727508545,
        0.02287270687520504,
        0.04553063213825226,
        -0.021477924659848213,
        -0.03072189912199974,
        -0.05202542617917061,
        0.032097190618515015,
        0.014848950318992138,
        0.04384971410036087,
        -0.027612200006842613,
        -0.056927114725112915,
        0.016973014920949936,
        -0.028756234794855118,
        0.060890696942806244,
        -0.007036677561700344,
        -0.0065460470505058765,
        0.09423011541366577,
        -0.1316625475883484,
        0.0389544740319252,
        -0.05698714405298233,
        -0.02178996056318283,
        -0.08886146545410156,
        -0.019026126712560654,
        -0.04800383746623993,
        -0.06553315371274948,
        0.02863958105444908,
        0.015428894199430943,
        -0.018335334956645966,
        0.09412645548582077,
        0.042775318026542664,
        0.06247939541935921,
        0.008591418154537678,
        -0.014714724384248257,
        -0.04008832573890686,
        0.042840518057346344,
        -0.001687434851191938,
        -0.025873474776744843,
        -0.020002558827400208,
        -0.024801485240459442,
        -0.04043891280889511,
        0.08647619187831879,
        -0.002421968150883913,
        0.030314931645989418,
        -0.093596450984478,
        -0.05658320337533951,
        0.03582702949643135,
        -0.002772553125396371,
        -0.02016635052859783,
        0.06288798153400421,
        -0.09619186073541641,
        -0.03853074088692665,
        -0.04069681465625763,
        0.07667926698923111,
        -0.019115032628178596,
        0.05439474433660507,
        0.09482479840517044,
        -0.05953894183039665,
        -0.06198013201355934,
        0.06916079670190811,
        0.026804663240909576,
        0.03645240515470505,
        -0.014038820751011372,
        -0.04827820509672165,
        0.016504796221852303,
        0.02603941224515438,
        -0.06349455565214157,
        -0.048392631113529205,
        0.027481134980916977,
        0.0005854640039615333,
        0.05076150968670845,
        0.018138518556952477,
        0.012321325950324535,
        0.026339920237660408,
        0.017732419073581696,
        0.03593727573752403,
        0.052444230765104294,
        -0.07133686542510986,
        -0.10154815018177032,
        0.05119157209992409,
        -0.029571587219834328,
        -0.02597021870315075,
        0.049635715782642365,
        0.021226204931735992,
        0.10861542820930481,
        0.0823037400841713,
        -0.04597633704543114,
        0.015830693766474724,
        -0.06283408403396606,
        0.005471195559948683,
        0.04397347941994667,
        0.04054684937000275,
        0.03473161533474922,
        -0.02882731333374977,
        -0.016882698982954025,
        -0.012495414353907108,
        0.01182214543223381,
        0.017136823385953903,
        0.0014170568902045488,
        0.00017746275989338756,
        0.07434601336717606,
        0.10676605254411697,
        -0.030839405953884125,
        0.0761682316660881,
        0.06792982667684555,
        -0.037333227694034576,
        -0.01504387054592371,
        -0.013080722652375698,
        -0.009678743779659271,
        -0.0466369204223156,
        3.470634948517311e-33,
        -0.009551860392093658,
        0.06285161525011063,
        -0.05560990422964096,
        -0.006097942590713501,
        0.01107222493737936,
        0.004612473305314779,
        0.06323958188295364,
        0.06045501306653023,
        -0.06551184505224228,
        0.041241519153118134,
        -0.07415825873613358,
        -0.014713553711771965,
        -0.09030091017484665,
        -0.005979620385915041,
        -0.004175754729658365,
        -0.01770523563027382,
        -0.08197421580553055,
        -0.06706583499908447,
        0.043449532240629196,
        0.04991373419761658,
        0.03899768367409706,
        -0.023047134280204773,
        0.042175181210041046,
        0.011625745333731174,
        -0.05854114517569542,
        -0.020450767129659653,
        -0.034764956682920456,
        -0.014398884028196335,
        0.07484296709299088,
        0.0361369326710701,
        -0.08843956142663956,
        -0.038655392825603485,
        -0.0031713235657662153,
        -0.1702946424484253,
        -0.05236154422163963,
        -0.06062472239136696,
        0.013491110876202583,
        -0.13676512241363525,
        0.05266008898615837,
        -0.016500379890203476,
        -0.10037942230701447,
        0.00944326538592577,
        -0.07544771581888199,
        -0.04646526649594307,
        0.022218024358153343,
        0.03456752002239227,
        -0.03493810445070267,
        -0.0025319454725831747,
        0.04828663170337677,
        -0.010568465106189251,
        -0.09063927829265594,
        0.003863163525238633,
        0.0721629187464714,
        -0.040222179144620895,
        -0.1229020208120346,
        -0.04248996824026108,
        -0.03387861326336861,
        -0.06031803786754608,
        0.07146366685628891,
        0.04857945814728737,
        0.029382865875959396,
        0.006890207529067993,
        0.010379812680184841,
        0.049536850303411484,
        -0.14702796936035156,
        0.015255698934197426,
        0.0308257844299078,
        0.0020262114703655243,
        -0.06436270475387573,
        -0.03536521643400192,
        -0.029744228348135948,
        -0.0015719711082056165,
        0.02081969752907753,
        -0.07141917943954468,
        0.022863365709781647,
        -0.07589452713727951,
        -0.03236626461148262,
        0.03346620500087738,
        -0.015462800860404968,
        -0.03537992388010025,
        0.04182213544845581,
        -0.014712314121425152,
        0.04795009642839432,
        0.06939772516489029,
        -0.022756149992346764,
        0.08965155482292175,
        0.07420683652162552,
        0.0063652778044342995,
        -0.008341725915670395,
        -0.005400741007179022,
        -0.02783936820924282,
        0.021453849971294403,
        -0.04940810799598694,
        0.043619509786367416,
        0.03854629024863243,
        -4.944678415825566e-33,
        0.007930399850010872,
        -0.04605228081345558,
        -0.05791638419032097,
        -0.024457653984427452,
        -0.04498106986284256,
        0.013220266439020634,
        -0.0014913963386788964,
        0.07280763983726501,
        -0.03392802178859711,
        -0.08127209544181824,
        -0.0014104152796790004,
        0.04591399431228638,
        -0.0011462447000667453,
        -0.027920613065361977,
        -0.007084629964083433,
        -0.005128344055265188,
        -0.05542610585689545,
        -0.05267883464694023,
        0.014667159877717495,
        -0.08813545852899551,
        0.03548912703990936,
        0.0021364407148212194,
        -0.011290822178125381,
        0.018219538033008575,
        -0.007329513318836689,
        -0.06830951571464539,
        0.007352742832154036,
        0.05803326144814491,
        -0.010095017030835152,
        0.049256332218647,
        0.02866128273308277,
        -0.03147530555725098,
        0.04848098009824753,
        0.09986574947834015,
        0.061239562928676605,
        -0.027091333642601967,
        0.0010971251176670194,
        -0.06916239112615585,
        0.03815582022070885,
        -0.015950581058859825,
        0.07158543169498444,
        0.02967665158212185,
        0.002342068124562502,
        -0.0021238403860479593,
        -0.014759271405637264,
        -0.007903165183961391,
        0.07038230448961258,
        -0.05971401557326317,
        0.05506414547562599,
        -0.059457309544086456,
        -0.02613276243209839,
        0.021766120567917824,
        0.038372598588466644,
        -0.05372125655412674,
        -0.03260258212685585,
        -0.029392782598733902,
        0.025016576051712036,
        0.012237231247127056,
        0.03720848634839058,
        -0.02944399043917656,
        -0.051357705146074295,
        0.030861562117934227,
        0.010687991976737976,
        -0.021484926342964172,
        0.042617764323949814,
        -0.023083308711647987,
        0.06480173021554947,
        -0.009070738218724728,
        0.0592912994325161,
        0.010131023824214935,
        -0.050176020711660385,
        -0.02722087688744068,
        0.01713833399116993,
        -0.09341767430305481,
        0.03021395020186901,
        0.09883362054824829,
        0.028339913114905357,
        -0.012092922814190388,
        -0.044848356395959854,
        -0.017527790740132332,
        0.042559195309877396,
        0.017824450507760048,
        0.03658491000533104,
        -0.0024982772301882505,
        -0.005203221458941698,
        0.018977733328938484,
        0.08091127127408981,
        -0.02968377061188221,
        -0.06979169696569443,
        0.06217425689101219,
        -0.044175609946250916,
        -0.04790997505187988,
        -0.049847785383462906,
        0.07065238803625107,
        0.024799300357699394,
        -4.955034071940645e-08,
        -0.009076302871108055,
        0.05558481067419052,
        0.03183848783373833,
        0.07344543188810349,
        0.0541839562356472,
        -0.01954130455851555,
        0.10116419941186905,
        0.02386864274740219,
        0.03999662026762962,
        0.017309805378317833,
        0.026590919122099876,
        -0.08567400276660919,
        -0.08102745562791824,
        0.0454375222325325,
        0.010252763517200947,
        0.03742825612425804,
        -0.020490268245339394,
        0.09142718464136124,
        -0.02225940302014351,
        -0.04969825595617294,
        -0.026027336716651917,
        0.04457264393568039,
        0.09971743077039719,
        -0.0623173862695694,
        0.021223358809947968,
        0.03737364336848259,
        -0.07455424964427948,
        0.07013656198978424,
        -0.001455678720958531,
        0.0011193223763257265,
        -0.09792447090148926,
        -0.03208788484334946,
        0.02057156339287758,
        -0.03015008382499218,
        -0.02434065192937851,
        -0.10334436595439911,
        -0.12384791672229767,
        0.0821191668510437,
        0.07731166481971741,
        0.0049076625145971775,
        -0.025508958846330643,
        -0.08947670459747314,
        -0.03625432774424553,
        -0.008934750221669674,
        0.008464466780424118,
        0.05501938983798027,
        -0.09383333474397659,
        -0.019965827465057373,
        0.014012638479471207,
        0.028683405369520187,
        0.07952499389648438,
        -0.002257854677736759,
        0.050099633634090424,
        0.020506175234913826,
        -0.0197313129901886,
        0.03070571832358837,
        -0.030531352385878563,
        0.038926977664232254,
        -0.03189084306359291,
        -0.006212514825165272,
        0.0833275094628334,
        -0.07298749685287476,
        -0.09296636283397675,
        0.05230690538883209
    ]
}