{
    "id": "MILbVcSiboQ",
    "title": "The Samsung Galaxy S20 Ultra",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-01-18T18:39:47Z",
    "video_url": "https://www.youtube.com/watch?v=MILbVcSiboQ",
    "category": "Science & Technology",
    "tags": [
        "galaxy s20",
        "samsung galaxy s20",
        "galaxy s11",
        "s20",
        "galaxy s20+",
        "galaxy s20 plus",
        "samsung",
        "galaxy",
        "5g",
        "2020",
        "galaxy s20 ultra",
        "galaxy s20 5g",
        "smartphone",
        "android",
        "tech",
        "rumor",
        "specs",
        "review",
        "camera",
        "myke hurley",
        "this is",
        "austin evans"
    ],
    "views": 625105,
    "likes": 20196,
    "comments_count": 2162,
    "description": "Samsung Galaxy S20 hands on:  Samsung Galaxy S20+ 5G Ultra is a ridiculously overkill looking phone...but does it matter?  The BEST of CES 2020   The funniest gaming PC build we've ever done    Thanks to Myke for co-hosting!  Shoutout to Max Weinbach for the many excellent Samsung Galaxy S20 rumors:   Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/C6W4jbMnJrY",
        "https://youtu.be/jFQEwfuS3G0",
        "https://youtu.be/skedCEbX-6k",
        "https://twitter.com/imyke",
        "https://twitter.com/MaxWinebach",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. On February 11th, Samsung will unveil their brand new flagship for this year, the Samsung Galaxy S20. Like pretty much each every smartphone these days, the Galaxy S20 is pretty thoroughly leaked to this point. So we're looking at five variants, the Samsung Galaxy S20, the S20 5G, the S20 Plus, the S20 Plus 5G, and of course the Samsung Galaxy S20 Ultra 5G, because why not. So in addition to 5G being an option across the entire range, we're also looking at a ton of major upgrades on the spec front. So cameras, specifically this year, seem to be a major focus. We're talking about four cameras on pretty much all the Galaxy S20s. So on the standard S20, S20 Plus range, we're looking at a 12-megapixel camera, a 64-megapixel camera, as well as a three-times optical zoom, as well as the little sensor for depth of field. Depth of what, no, no, what is it? - [Ken] Time of flight. - Time of flight, thank you very much. Time of flight, thanks, Ken. What would I do without you? Be wrong, I would be wrong. Jump up to the Samsung Galaxy S20 Ultra and the specs get even more ridiculous. So the main camera's upgrade to 108 megapixels. Sorry, I'm just gonna let that sink in, 108 megapixels. Oh, and it'll also record 8K video, because why not. You'll also have a 10-times optical zoom camera with 48 megapixels, which is actually kind of cool. I'm, like, kind of excited for that one. We also have 12-megapixel ultra wide camera, as well that same time of flight sensor. There's a lot of ridiculous specs here, and that's just on the camera side. All of the S20 models this year should be taking advantage of either the Snapdragon 865 or the Exynos 990. And when you go up to the Ultra edition, that is going to have an option to go 16 gigabytes of RAM on your phone, as well as 512 gigs of storage which you could back up with a one-terabyte micro SD card. 'Cause obviously, 1.5 terabytes of storage is about what I what I need in my phone. Now this is all being powered by a 5,000 milliamp-hour battery, according to the rumors. And all of the S20 models supposedly will be taking advantage of a 120 Hertz display this year. Now when you look at all of these specs, it is very clear, Samsung are going hard for the most spec-ripped, over-the-top ridiculously powerful phone that they can do. But really, what I'm curious about is is it actually worth it? See, I got the Is It Worth It in there. You didn't see that one coming, did ya? The real question here is obviously the Galaxy S20, and pretty much all the 2020 flagships are going to be insanely high end. You've got all the specs you could ever hope for. But at what point does it not matter any more? I mean, sure, I'm a nerd, I'm a geek, I love that sweet Geekbench score and that extra 37 megapixels on my camera. But at the end of the day, we're all doing very similar things on our phones. And while, yes, I love to have a 100-megapixel camera, everyone's looking at that photo on Instagram. Does it really make a huge difference, and is it worth spending that $1,000 plus to upgrade? Probably not. The real differentiator as we go into this decade for smart phones, I think really is on the software side of things. To go a little deeper, I sat down with my good friend Myke Hurley, who's the co-founder of Relay FM and the host of many excellent podcasts, including Cortex, as well as Connected, and many more. What exactly can you do to differentiate? Because everyone's using so many of the same parts. And I argue what you do to differentiate is you focus on software, because that's really what makes these phones different. That's the only thing that really gives you some kind of sense of a, oh look, my phone will take better photos because of the software. It's faster because it's better optimized. Whatever the case is, software is really the key that is making all these phones not just the exact same thing every year. - Yeah, 'cause otherwise you've got gimmicks. - Not everyone needs a brand new phone every year, every two years, every three years. And I think software is a huge part of why that differentiation can even happen. Now, I'll actually single out Samsung for this specific point, because software, I think, entails a lot of different aspects of a phone. One of the things I think goes under the radar a lot is software support. I think in this day and age, a lot of phones are outdated not because their hardware breaks, not because the batteries are out, but because they no longer receive timely software updates. And that's something I will give Apple huge props for. The iPhone 6s, which is like four or five years old at this point, still gets absolute day-and-day updates with every other iPhone out there. Take a look at a Samsung Galaxy S9 even, or an S8, and you're lucky to get a couple of years of updates if even at that. And it sometimes it takes your forever to actually get the correct update at the right time, you might be six months behind. I mean, it's an absolute mess. So when I say that software is incredibly important going into this decade, I mean that in a lot of contexts. Samsung, for a while, was really on top of the Android game, as far as design, right? So especially when like-- - Oh, there was like a few years where they were making better looking phones than Apple. - [Austin] Absolutely. - Like, without a doubt. - Like with the S7 when they started doing, like, the curved edges and everything was super smooth. But now it's like, okay, cool, you've kinda pushed that design as far as you can. Now obviously, companies like Huawei are, like, doing the full waterfall design where the screen almost wraps all the way around. That, to me, kinda feels a lot like a gimmick. It doesn't really change the fact that this sort of, as of now in 2020, is sort of like the ultimate in smart phone design. What it comes down to is that phones today are all excellent, right? Now, back in 2012, 2013, there were massive differences between going for the Samsung, or the HTC, or the iPhone. And while, of course, there are still differences, and some of them can be significant, we are very quickly hitting a point where pretty much any phone, even budget phones, are good enough. I mean, there are a ton of manufacturers who exclusively focus on phones that cost, like, two, three. I mean, even the Google Pixel 3A that was $400 was absolutely fine for almost everyone. And it didn't really sacrifice on a lot of major areas, such as the camera. Now as we continue to go, and as we continue to look at these ridiculous overkill phones, I get why Samsung and Apple and everyone are trying to innovate by, like, oh look, we have four cameras on the back, or five, or we have 16 gigabytes of RAM, or whatever the case is. But at the end of the day, these phones are incredibly expensive, and you have to justify that to consumers. To really illustrate one of the biggest differences, or rather, one of the biggest similarities between phones lately, let me play you a clip from my review of the Galaxy S10 from last year, just with some slight edits to fit the Galaxy S20. On the back of the Galaxy S20 Plus, we have a full four cameras. So pretty much all of them have 12 of ram, with the exception the base model of S20 which has 12 gigs, as well as the high end version of the S20 Plus which has 16. - [Ken] What does that say about your videos? - It says that I am a consistent person with the same opinions that never change, even when I realize that things I say are wrong sometimes. (laughing quietly) I feel like we're reaching peak smart phone, right? This design, which has been around since, what, 2007 with the iPhone, has really kind of hit its sort of ultimate form, because there's a couple of key components that all of these phones share. - There is only so much that can happen, right, in this type of design. And I think that, I mean, again, like the back of these things is where companies are trying to push themselves now to show that they're a little bit different. But the smart phone design now is becoming very iterative. They add new little things every now and then. But I agree with you in the sense that, like, this idea of what a device like this looks like, this is probably, I mean, you say these things and you look silly in a couple of years, I think this is about where as maximum as it can go. - Now there's certainly nothing wrong with having phones that have a, I don't want to say a perfect design, but it very much approaching, like, kind of as far as that we can realistically push things, but it removes a lot of the fun out of it. And especially when it comes to if you're a Samsung, if you're a OnePlus, if you're an Apple of the world, you have to make that new phone. And how do you differentiate? Right now, they're just continuing to push on higher megapixel cameras, higher refresh rate displays, whatever gimmicks or whatever kind of legitimately useful features they can throw at it. There's only so far you can push it when the phones continue to look the same. And for years now, they've largely been good enough. Don't get me wrong, the Samsung Galaxy S20 5G Plus Ultra, whatever they decide to call it, looks like an excellent phone. But the issue is, so does the next generation OnePlus, and iPhone, and Pixel. The differentiation here is not with the hardware, it's not with the specs, it's not with the megapixels. What it's really about is how these phones will continue to age into the future, and how software can really be the main differentiating factor between all of these different devices. It's gonna be a brave new decade, my friends. So if you enjoyed this video, definitely be sure to subscribe. I will certainly be doing a video all about the S20 and all its wonderful variants. And until next time, Uncle Austin signing out from his rant corner. (Austin chuckling) That was the worst outro I've ever done. (laughing)",
    "transcript_keywords": [
        "Samsung Galaxy",
        "Galaxy",
        "Samsung",
        "phones",
        "phone",
        "camera",
        "software",
        "year",
        "years",
        "things",
        "lot",
        "kind",
        "design",
        "Ultra",
        "cameras",
        "Time",
        "smart phone",
        "pretty",
        "Apple",
        "Hey guys"
    ],
    "transcript_entity_values": [
        "5",
        "iPhone",
        "Samsung Galaxy S20 Ultra 5",
        "2020",
        "two",
        "four",
        "12-megapixel",
        "120",
        "Myke Hurley",
        "100-megapixel",
        "every year",
        "a ton",
        "2007",
        "S20 Plus",
        "the Galaxy S20",
        "last year",
        "about four",
        "micro SD",
        "1.5 terabytes",
        "the Galaxy S20s",
        "every three years",
        "Ultra",
        "Ken",
        "Austin",
        "S7",
        "Instagram",
        "the end of the day",
        "Samsung Galaxy S20 Ultra",
        "Hertz",
        "S8",
        "these days",
        "16",
        "1,000",
        "today",
        "Android",
        "48 megapixels",
        "this decade",
        "the Galaxy S10",
        "OnePlus",
        "one-terabyte",
        "Relay FM",
        "Samsung Galaxy S9",
        "every two years",
        "10",
        "Uncle Austin",
        "Samsung Galaxy S20",
        "37 megapixels",
        "this day",
        "400",
        "Apple",
        "a few years",
        "Huawei",
        "years",
        "the Galaxy S20 Plus",
        "5,000 milliamp-hour",
        "One",
        "S20",
        "this year",
        "three",
        "RAM",
        "Samsung",
        "64-megapixel",
        "four or five years old",
        "HTC",
        "12",
        "512",
        "February 11th",
        "Austin",
        "8",
        "Geekbench",
        "six months",
        "Samsung Galaxy S20 5",
        "108 megapixels",
        "2012",
        "five",
        "2013",
        "Connected",
        "G Plus Ultra",
        "a couple of years",
        "16 gigabytes",
        "Ken] Time"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "FAC",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON"
    ],
    "vector": [
        -0.054511964321136475,
        0.012946435250341892,
        0.10993634164333344,
        -0.03543843701481819,
        0.07534705847501755,
        0.0335533432662487,
        -0.01698228530585766,
        0.05328145995736122,
        -0.02593100070953369,
        0.054699841886758804,
        -0.021084386855363846,
        0.05821817368268967,
        0.08260736614465714,
        -0.021703889593482018,
        0.09686795622110367,
        -0.07891874760389328,
        0.07494142651557922,
        -0.09099314361810684,
        -0.05416696146130562,
        -0.012755799107253551,
        0.08437979221343994,
        -0.06555507332086563,
        -0.010267108678817749,
        -0.005373796913772821,
        0.026965005323290825,
        -0.020237693563103676,
        -0.06106313318014145,
        -0.05521571636199951,
        -0.03386790677905083,
        0.026860129088163376,
        0.027448924258351326,
        0.11708591133356094,
        -0.027233699336647987,
        0.008881141431629658,
        -0.029020844027400017,
        -0.13875840604305267,
        -0.009821674786508083,
        0.00695485295727849,
        0.01847250759601593,
        -0.0010360023006796837,
        -0.07190796732902527,
        -0.08133643865585327,
        -0.010181545279920101,
        0.03694680705666542,
        0.05609734356403351,
        -0.04797003045678139,
        0.044205933809280396,
        -0.050596609711647034,
        -0.08103200048208237,
        -0.04117489233613014,
        -0.013731664977967739,
        -0.035792820155620575,
        -0.00022943993099033833,
        -0.025940803810954094,
        -0.044249918311834335,
        0.01779278740286827,
        -0.059191856533288956,
        -0.02753836289048195,
        0.10696699470281601,
        -0.027938390150666237,
        0.02854135073721409,
        -0.0943625420331955,
        0.00406287657096982,
        0.03970944881439209,
        -0.05180230736732483,
        0.0205411147326231,
        0.048698849976062775,
        -0.017947765067219734,
        0.05700087547302246,
        0.049835868179798126,
        0.008240440860390663,
        -0.024194298312067986,
        0.06289074569940567,
        0.01950629986822605,
        -0.014796702191233635,
        0.018691465258598328,
        0.04424954950809479,
        -0.029690904542803764,
        0.04005376622080803,
        -0.05007477104663849,
        0.09908974915742874,
        -0.10380930453538895,
        -0.036882687360048294,
        -0.07350542396306992,
        0.013044998981058598,
        -0.03347867727279663,
        -0.05679880082607269,
        -0.0009189907577820122,
        -0.039891473948955536,
        -0.07870262861251831,
        -0.03913450241088867,
        0.03273390233516693,
        -0.08657129853963852,
        0.01137958187609911,
        -0.05409519746899605,
        0.07527705281972885,
        -0.1026424840092659,
        -0.04427090287208557,
        -0.02128484472632408,
        -0.016684018075466156,
        0.027390511706471443,
        0.057193201035261154,
        0.09525904804468155,
        0.030141770839691162,
        0.043526653200387955,
        -0.021287303417921066,
        0.024213889613747597,
        -0.009394409134984016,
        -0.009714209474623203,
        0.0013196467189118266,
        0.009558181278407574,
        0.04801774397492409,
        -0.06136825680732727,
        -0.00634580897167325,
        -0.0008092551142908633,
        -0.0069205681793391705,
        -0.01420144084841013,
        0.03391837701201439,
        0.017635928466916084,
        0.04143757373094559,
        -0.01921221800148487,
        -0.05704706534743309,
        -0.06143493950366974,
        -0.016900893300771713,
        -0.016984762623906136,
        0.07427553087472916,
        -0.07656538486480713,
        7.170625742611343e-33,
        -0.05084144324064255,
        0.08837397396564484,
        -0.04128507152199745,
        0.0479593500494957,
        0.0023044347763061523,
        0.0034370997454971075,
        0.04258311167359352,
        0.057417698204517365,
        0.018383482471108437,
        0.04609082266688347,
        -0.04065693914890289,
        0.01192599255591631,
        -0.0499308779835701,
        0.05711781606078148,
        0.10052256286144257,
        -0.032963961362838745,
        -0.09128295630216599,
        -0.03216101601719856,
        0.018552325665950775,
        -0.008688811212778091,
        0.024976570159196854,
        -0.020687980577349663,
        0.029087992385029793,
        0.003238275181502104,
        0.07364163547754288,
        -0.015161876566708088,
        0.12032198905944824,
        -0.02808523178100586,
        0.006399068981409073,
        0.02707066759467125,
        -0.09543870389461517,
        -0.037663791328668594,
        0.05971570312976837,
        0.020291997119784355,
        0.01815302111208439,
        -0.00705741485580802,
        0.006594175938516855,
        -0.02940044179558754,
        0.06135106459259987,
        -0.0345882810652256,
        0.006288990844041109,
        0.0710686445236206,
        -0.09888891130685806,
        0.07016292959451675,
        0.01792163960635662,
        0.07752729952335358,
        -0.04063871502876282,
        0.015374375507235527,
        -0.09494763612747192,
        0.0018927700584754348,
        0.015857476741075516,
        0.005217719357460737,
        -0.04994708672165871,
        0.0035738341975957155,
        -0.010498308576643467,
        0.003479669103398919,
        -0.015308589674532413,
        -0.06938029080629349,
        0.03382353112101555,
        0.05397087708115578,
        -0.048242274671792984,
        0.004865598864853382,
        -0.06749013811349869,
        -0.0004082904488313943,
        0.03364122286438942,
        0.09954695403575897,
        0.07575859129428864,
        0.04543953388929367,
        -0.01648872345685959,
        0.044175777584314346,
        0.051027167588472366,
        -0.03126884251832962,
        0.05562150850892067,
        -0.023123010993003845,
        0.09892039000988007,
        0.04464655742049217,
        0.013629002496600151,
        -0.058697573840618134,
        0.0308147631585598,
        0.07810971885919571,
        -0.06147817149758339,
        0.07537367939949036,
        0.039811018854379654,
        0.07400069385766983,
        -0.002389578614383936,
        -0.04979706183075905,
        0.014544251374900341,
        -0.018474450334906578,
        0.04152124002575874,
        0.016656041145324707,
        -0.009225600399076939,
        -0.03683238476514816,
        0.05701175704598427,
        0.039490021765232086,
        -0.0449545681476593,
        -6.632491775644593e-33,
        -0.014049669727683067,
        -0.021539993584156036,
        -0.028952917084097862,
        0.025329239666461945,
        0.017597269266843796,
        -0.04000042751431465,
        0.031891778111457825,
        0.009287243708968163,
        0.041049543768167496,
        -0.012760056182742119,
        0.05735652521252632,
        0.08178503811359406,
        -0.025261346250772476,
        -0.0025572574231773615,
        -0.06224803626537323,
        -0.029429685324430466,
        -0.016183633357286453,
        -0.10819710046052933,
        -0.004973157774657011,
        -0.02636081352829933,
        0.07327117770910263,
        0.03565292805433273,
        0.019262995570898056,
        0.07884927093982697,
        0.01724216900765896,
        0.0633726567029953,
        -0.05595323443412781,
        0.02128608711063862,
        0.02162349596619606,
        -0.02759426459670067,
        0.05011332407593727,
        -0.0646921768784523,
        0.08778045326471329,
        0.007699376903474331,
        0.030728626996278763,
        0.028725065290927887,
        0.051543284207582474,
        0.011562541127204895,
        -0.014676147140562534,
        0.027649253606796265,
        0.02058698982000351,
        0.01538707036525011,
        0.023025592789053917,
        -0.006264158524572849,
        0.0622832328081131,
        0.018152758479118347,
        0.013259408995509148,
        0.008006916381418705,
        0.0397241935133934,
        -0.06242910400032997,
        0.04430074989795685,
        0.0012243371456861496,
        -0.10432019084692001,
        0.010563951916992664,
        -0.06805386394262314,
        -0.03486775979399681,
        -0.006054827012121677,
        -0.021869968622922897,
        -0.057112567126750946,
        0.01221291534602642,
        0.0573013573884964,
        -0.00816336739808321,
        -0.006202377378940582,
        -0.06841681152582169,
        -0.03445200249552727,
        -0.0063727842643857,
        0.03176013007760048,
        -0.05164031311869621,
        -0.022930433973670006,
        -0.002243299735710025,
        -0.04465798661112785,
        -0.0869554802775383,
        -0.1079847514629364,
        -0.06493417173624039,
        -0.011389261111617088,
        0.11270249634981155,
        -0.012762162834405899,
        -0.02223745547235012,
        0.015841705724596977,
        -0.0536043755710125,
        -0.021583572030067444,
        0.02195133827626705,
        0.01136965211480856,
        0.024196699261665344,
        0.04449668899178505,
        0.004093941766768694,
        -0.08147075772285461,
        -0.0452389121055603,
        -0.003761678235605359,
        -0.020301800221204758,
        -0.09506038576364517,
        -0.04084309935569763,
        -0.10614780336618423,
        -0.014068227261304855,
        -0.010540037415921688,
        -5.275158443396322e-08,
        0.009962169453501701,
        0.032828524708747864,
        -0.002607288071885705,
        -0.023915868252515793,
        0.07030322402715683,
        -0.05337856709957123,
        -0.08434707671403885,
        0.011145156808197498,
        0.1919161081314087,
        0.019835175946354866,
        0.05664539337158203,
        -0.09357845038175583,
        0.00963588897138834,
        0.03970029950141907,
        0.008082677610218525,
        0.07599906623363495,
        -0.02155120112001896,
        0.011960032396018505,
        -0.017888206988573074,
        0.04170094057917595,
        -0.02081972546875477,
        0.07526228576898575,
        -0.010055970400571823,
        -0.037392761558294296,
        0.05058356747031212,
        -0.06290861964225769,
        -0.04665861278772354,
        -0.05465710535645485,
        0.03184456378221512,
        0.01015144120901823,
        -0.031507402658462524,
        -0.05884595587849617,
        -0.05970121547579765,
        0.08435492217540741,
        0.03219837695360184,
        -0.04603763669729233,
        -0.013449495658278465,
        0.015964442864060402,
        0.08435873687267303,
        0.06661351025104523,
        -0.03635328263044357,
        -0.09982778131961823,
        -0.017236365005373955,
        0.10075840353965759,
        -0.015505727380514145,
        -0.1592506617307663,
        -0.009701427072286606,
        -0.06465689837932587,
        -0.05734638124704361,
        -0.040066756308078766,
        -0.10139816999435425,
        -0.0436214879155159,
        -0.057078637182712555,
        -0.048059094697237015,
        0.013891803100705147,
        0.014311005361378193,
        0.04528433084487915,
        -0.03690441697835922,
        -0.01937193050980568,
        0.05754466727375984,
        0.05841195210814476,
        -0.07341419905424118,
        -0.03976861387491226,
        0.10575824975967407
    ]
}