{
    "id": "MjobHJ2Y_f4",
    "title": "This will make you hate your desk - Corsair Platform:6",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-12-12T23:26:37Z",
    "video_url": "https://www.youtube.com/watch?v=MjobHJ2Y_f4",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "corsair",
        "platform:6",
        "desk",
        "creator",
        "office",
        "gamer",
        "gaming",
        "esports",
        "pegboard",
        "ikea",
        "cool"
    ],
    "views": 592233,
    "likes": 20737,
    "comments_count": 1199,
    "description": "Stand out from the crowd and design your own RHINOSHIELD case! Use code SHORTCIRCUIT15 and save 15% at   SC stars Sarah and Dennis are here to build Corsair's first desk -- the Platform:6! With a build-in pegboard system, included monitor arms, and sit/stand functionality, is this the new creator/gamer/office desk to beat?  Check out the Corsair Platform:6:   Purchases made through some store links may provide some compensation to Linus Media Group.   Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 A desk built for creators? 0:25 Getting everything unboxed 2:26 Sponsor - Rhinoshield 2:58 Building the desk and rail system 8:07 Dennis tries to slickback 8:27 Back to the monitor arms 9:21 Adding the Multi Frame system 11:16 Platform:6 pricing and overall thoughts 12:34 Outro",
    "description_links": [
        "https://url.rhinoshield.io/Shortcircuit",
        "https://lmg.gg/Kyfxr",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "Hello, it's me, Dennis here. This is Corsair's first desk they ever made, and it's built for Creator. Platform 6, Creator Edition. It comes with four giant boxes, and this one is so heavy. Obviously, I wouldn't be able to do this by myself. I need the strongest person at OMG. What, you just hop out like that? I'm excited to see what this looks like. Look at this giant piece. What's this? That must be the wire management tray. Oh, it goes under the desk. Beautiful. This is the cable management tube thing, I assume. Technical terms. Safety, safety. What she did wasn't safe. The wood looks so nice. This is rubber wood with walnut stain, and really solid. Yeah, maybe on the couch. On the couch? That's a good idea. It's even in the couch. It's 72 by 30 inch. Look at this thing. Huge desk. Don't break the couch. I think the couch would break first. Let's open that one. Well, it looks like they are labeled. So this one is box two of three. So we should probably do number two first. Pretty well packaged. Huge foam. Column toolkit. We'll look and see what's in there later. Monitor arms. This desk comes with monitor arms? This is thick. With how many C's? Holy, this is really thick. Say it again, I dare you. Metal. These are the corner supports. Due to the thickness that Dennis indicated earlier, you know the corners are really gonna be supported. And we've got the legs, which are adjustable, which is super nice. So if you wanna sit, stand, oh, do whatever your heart desires. It looks like all of their little tools are packaged in glassine bags, which is nice because it's reducing plastic usage and waste. And it's labeled with step one, step two, step, what the is three? Step three. Here. With that amount of parts, the least thing you wanna have is being frustrated with all this random stuff everywhere. Let's get building. Let's start it. Okay, let's go build this desk. But before, oh, we need to do our sponsor spot. Not the sponsor spot. Thanks to RhinoShield for sponsoring today's video. Their phone cases are extremely protective. They're customizable and also use mono material for easier recycling. RhinoShield's printing process is designed to prevent scratching and fading. Now you can design your own case with their super intuitive and easy to use DYOC function. Just from a vast library of premium prints and make your case your own, or even upload image of your own to make it truly unique. Use code ShortCircuit15 and save 15% and RhinoShield, we got a link below. Now that the sponsor spot is done, can we finally put this desk down? Yes. Oh my God. That's a lot of work out. Lttstore.com. If you don't have an LTT screwdriver, fine, you can use this, but we're not going to use this. Wait, I don't think we can use it. We don't have, I don't have the thread. Oh, actually it's kind of cool. Look at this fancy tool from Corsair. Done. Oh, you already finished? You already finished? I finished like five minutes ago. Based on the pictures here, it looks like this goes downwards and this goes over the D bracket. Like that? Yeah, exactly. Oh, cool. And then we'll need to open step three. Dennis, can I give you a tip? A tech tip? Let me show you. If you use this side, you can use the rest as a handle. Is it not long enough? It should be this side. Oh my gosh. Wait, is it? No, it's right. What? We just spent 10 minutes trying to screw this screw in here following the manual. Apparently the manual's wrong. We're just going to take a longer screw from the spare kit. Yeah, now we're talking. The desk at the bottom actually has little clips here for the cables. Oh, that's so nice. Right? So you don't need to do extra work. No. You can just open it up. Yeah. One of the things, there's no built-in cable management from here to there. So this part just kind of dangling. The screw is missing. Do you think there's an extra one in the spare parts bag? Don't lose any more. No, we don't. Are you sure? Oh God. Now we're losing more parts. Oh God. So somehow we managed to lose the power cable. So we found one within the office, which we'll use and hopefully it works. Should we do some like warmup stretches first? Some squats. Just turn it up for now. Okay. Watch out. All right. And now we just need to lift the top. Okay. Move it onto the carpet. Remember, move with your back, with your legs. Look at the finish. It looks really nice. Dennis, did we lose step four? Of what? How does this keep happening? Step four. They already have screw here, so you don't need to take it from the package. We just slide it in. Okay, there we go. I think I have my, oh. There we go. That was very satisfying. Now I get to watch Dennis struggle. What? This is not clicking. Did you click the bottom part? Yeah. How many people does it take to build a desk? Apparently more than two. Yay. There you go. And top. Okay. Now your side. Perfect. Could you imagine if that was our power cord? Pfft. But why is it in box three? That's why you open all the boxes before you start. We have Bell to blame. We did not lose, at least we didn't lose anything. We didn't, yeah. There are two different ways we can install it. You can attach on here, or you can attach on the bar, like here. Personally, I prefer it off the table because I want more space here, right? I agree. I feel like this looks a lot cleaner too, having it mounted underneath the bar. So I think with this plate, actually we should just be able to- You can unscrew it. Yeah, so we can take it off of that if we don't want to mount it on the desk and use this one to mount it on here. This reminds me a lot of the NZXT build kit video that I did. It's kind of like an adventure. Okay, this one's done. This is just the optional, if you want the bigger one. Oh wait, actually this is just- No, it goes under. It just connects to this bar underneath here. So these are wire management trays. Thankfully it comes with two trays, but for us, we're only going to put one in. There you go. You're getting better at that. Yeah, I don't know why this one is so easy to put in. We're going to go step six. Adjusting desk height. So that means we should plug it in. Woo! The weight limit is 330 pounds. I'm 150 pounds. It's very smooth. It doesn't do the jerk motion. Yeah. It's not loud either. Yeah, it's quite quiet. On our button display here, we have up, down, the LCD display, set button, and then preset memory heights. So you can actually set it if you want to have like whatever your perfect height is for standing, you can set it so that when you're ready to stand, you just have to press one button and you don't have to readjust it every single time. So the lowest height you can get is 29 inches and the highest is 48. Now we need to do the monitor arm assembly. So we'll bring it back down. Okay, the arms are here. So those are the gas spring arms. And then what you're pulling out now is the extension arms. And there's the- Connector. Connector. And now our little pieces. So it looks like the base comes apart, which is what you're doing. The bar toward this way. Oh, this should be this way. Yeah, that's the back. Perfect. Well, building this is too boring. So I'm going to do a couple TikTok train. I'm going to play the music. Cue crab rave. Is it right? Can you see? Can you tell? I'm floating. I'm not sure I would call that floating. So these bad boys support up to 18 pounds. That's a hefty monitor. And you can slide it if you like, you want to change your setup later on. You can move this setup to the left or to the left or to the right. I'm going to put on the monitor. So should we put this on even? We're not going to put out the whole setup, but this is basically going here. You forgot to mention, you have a cable management here. Oh, it does. Look at that. You can put a cable along here and go all the way down here and you can feed it through down to the bottom. Yeah, that's great. So one thing really good with Corsair's Platform 6 setup, you can use the Elgato stuff with this desk with additional features. It comes with Elgato Flex Arm Adapter. You literally just, you can put them right here or in the middle of here. What you see here is elevator version, but it doesn't end. We are transforming this desk to the creator version with their multi-frame. So what this multi-frame system does is it comes with a pegboard and a little shelf on the left and right. So you can put your speaker or a picture frame there if you want. So now we got a pegboard. Oh, it's metal as well. So it's called the multi-frame. Elgato multi-frame system. So we've got all of our pieces here. We've got another wire management tray. So there's a small shelf, two small shelves and one large shelf. We've got our toolkit, everything in here. Cable ties, screws, spare parts, and then hooks, lots of hooks. Yeah, that's just for the pegboard. The first step, you have to remove this cover, but it's really difficult to open this cover. But what you can do is open the big cover and then, and then, there you go. And we can insert The posts? The posts. Oh, oh, oh, oh, oh, oh. Yeah, like that. Okay, great. Beautiful. So it says here in the manual to hook the pegboard onto the four pre-installed screws, but there aren't any pre-installed screws here. So we're going to have to do that ourselves. And then we can finally put up the pegboards. Now the pegboard's set up. Look at how clean that is. And you're just gaming. You know what? I want to move this one here. There you go. So instead of taking over your desk space, you get more space on top. And you can put a little, like, Christmas. Beautiful. So there are three different versions from Corsair. First one is standard fixed, which means like you can adjust the height, but it also comes with monitor arms. It's 1,000 USD. The Elevate version, which you can adjust the height, 1,500. And what you see here is Creator Edition. You got everything, 1,800 USD. And if you want to buy a pegboard separately, you can also do that later on. It's a little higher end side of the desk. It's 1,800 for this whole setup. I was going to say, based on pricing, we've got to consider, we've got the monitor arms, we've got the adjustable legs, this beautiful walnut tabletop here. The pegboard's in the back. Comes with shelves, pegs. And it took us two and a half hours to build. Two hours? Two and a half? I mean, you could go on Ikea's website and look for some pegboards. You could assemble your own monitor arms and get those separately. But at the end of the day, I feel like this desk is really about the experience of having everything built together. Something I would choose is something a little more simple. If you want to pay your $100 extra, you can get this walnut finish, but they do also offer a black particle board version. There will be a slight difference in quality between the two. I really love the way that this walnut looks. If you enjoyed this short circuit, you should check out Colton and Dennis' unboxing of the Secretlab Magnus Pro.",
    "transcript_keywords": [
        "Yeah",
        "desk",
        "put",
        "Monitor arms",
        "step",
        "arms",
        "Monitor",
        "pegboard",
        "Dennis",
        "cable",
        "management",
        "open",
        "screw",
        "Corsair",
        "couch",
        "Creator",
        "nice",
        "height",
        "cable management",
        "lose"
    ],
    "transcript_entity_values": [
        "10 minutes",
        "TikTok",
        "150 pounds",
        "three",
        "1,800 USD",
        "One",
        "one",
        "Elgato",
        "Corsair",
        "Creator Edition",
        "1,500",
        "Corsair",
        "Bell",
        "1,000 USD",
        "Colton",
        "30 inch",
        "72",
        "RhinoShield",
        "LTT",
        "Pfft",
        "Two hours",
        "five minutes ago",
        "Dennis",
        "1,800",
        "29 inches",
        "more than two",
        "Ikea",
        "two and a half hours",
        "100",
        "first",
        "330 pounds",
        "Lttstore.com",
        "two",
        "48",
        "four",
        "LCD",
        "DYOC",
        "Elgato Flex Arm Adapter",
        "the Secretlab Magnus Pro",
        "the end of the day",
        "Two and a half",
        "15%",
        "six",
        "First",
        "Christmas",
        "NZXT",
        "18 pounds",
        "today"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "TIME",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        -0.03689957410097122,
        0.011740944348275661,
        -0.01705632545053959,
        -0.0970626249909401,
        0.06445090472698212,
        0.06742045283317566,
        -0.008612257428467274,
        0.07144978642463684,
        -0.015381792560219765,
        0.01804131083190441,
        0.0071604689583182335,
        0.002877600723877549,
        0.02280261367559433,
        -0.09225160628557205,
        0.021922610700130463,
        -0.04458167403936386,
        0.027745811268687248,
        -0.01869145967066288,
        -0.018862882629036903,
        0.028534114360809326,
        -0.07566888630390167,
        -0.13288795948028564,
        -0.04907368868589401,
        -0.001088722376152873,
        -0.02909769117832184,
        -0.032879788428545,
        0.035671621561050415,
        -0.00504987733438611,
        0.021333836019039154,
        -0.07561317086219788,
        0.016036663204431534,
        0.0024265898391604424,
        0.04902925714850426,
        0.060625869780778885,
        0.007634153123944998,
        0.005610140040516853,
        0.04887455329298973,
        -0.12286155670881271,
        -0.06928975880146027,
        -0.07547038793563843,
        -0.047367554157972336,
        -0.025378985330462456,
        0.010084442794322968,
        0.11074768751859665,
        0.05550675839185715,
        0.007450615055859089,
        -0.02458301931619644,
        -0.058987706899642944,
        -0.004402529913932085,
        0.0487479604780674,
        0.02475585602223873,
        -0.09650667011737823,
        0.04466923698782921,
        -0.049414243549108505,
        -0.0688270851969719,
        0.04063119366765022,
        -0.02588733844459057,
        -0.04145216941833496,
        0.07578971982002258,
        -0.053101781755685806,
        0.06826776266098022,
        -0.04708255082368851,
        0.010849526152014732,
        0.05840850993990898,
        0.008976266719400883,
        0.00201678485609591,
        -0.05442488566040993,
        0.05877863988280296,
        -0.03402328863739967,
        0.06012371554970741,
        0.014693197794258595,
        -0.037772174924612045,
        0.030567513778805733,
        0.04986118525266647,
        -0.019209958612918854,
        -0.020344281569123268,
        -0.0070837875828146935,
        -0.09310444444417953,
        0.052587904036045074,
        0.03127840533852577,
        -0.014840053394436836,
        0.04010346531867981,
        -0.03776686638593674,
        0.03320660442113876,
        -0.030511023476719856,
        -0.044973306357860565,
        0.027336493134498596,
        0.04635685682296753,
        -0.03543386980891228,
        -0.13401031494140625,
        0.03520965576171875,
        0.041269902139902115,
        0.09418490529060364,
        0.026832353323698044,
        -0.07011429220438004,
        -0.02372051402926445,
        0.017161833122372627,
        -0.05601005256175995,
        -0.03845464810729027,
        0.0685708299279213,
        -0.044023122638463974,
        0.08997203409671783,
        0.11131918430328369,
        0.02880879119038582,
        -0.07127078622579575,
        -0.043283455073833466,
        -0.026780379936099052,
        0.032287467271089554,
        -0.05554095283150673,
        -0.02192535437643528,
        -0.1396571397781372,
        0.006450096610933542,
        -0.10317462682723999,
        -0.02201405167579651,
        -0.0047470154240727425,
        0.011726049706339836,
        -0.07258676737546921,
        -0.02059316821396351,
        0.07637612521648407,
        -0.04310556501150131,
        0.14335137605667114,
        0.00764749338850379,
        0.0230536088347435,
        0.010850940831005573,
        -0.017232529819011688,
        0.03263895586133003,
        -0.02468389831483364,
        1.9555263207470486e-33,
        -0.030103880912065506,
        0.022488471120595932,
        -0.03066263161599636,
        -0.006647729780524969,
        0.06675592809915543,
        -0.012173888273537159,
        0.038245417177677155,
        0.08018133789300919,
        -0.0504433736205101,
        0.053365472704172134,
        -0.005186066031455994,
        0.027908023446798325,
        -0.04516053944826126,
        0.09502526372671127,
        0.06466668844223022,
        -0.07111828029155731,
        0.053386565297842026,
        0.055878378450870514,
        -0.023080717772245407,
        0.01806287281215191,
        -0.027577923610806465,
        -0.016230827197432518,
        -0.004328342620283365,
        -0.006482934113591909,
        0.05901554226875305,
        0.010580120608210564,
        -0.0406123585999012,
        0.012378724291920662,
        0.01661132648587227,
        0.013213197700679302,
        -0.06807518005371094,
        -0.027321290224790573,
        -0.0016770940274000168,
        -0.031766314059495926,
        -0.029993442818522453,
        -0.052309710532426834,
        -0.09394849091768265,
        -0.09031540900468826,
        0.07120833545923233,
        0.03762921690940857,
        -0.018786123022437096,
        0.025111010298132896,
        -0.043204013258218765,
        -0.07413960248231888,
        0.005689290352165699,
        0.03582730516791344,
        0.02069011889398098,
        -0.026452194899320602,
        0.09245441854000092,
        -0.08631862699985504,
        -0.054615411907434464,
        0.054425474256277084,
        -0.07180053740739822,
        -0.011875208467245102,
        0.031159846112132072,
        -0.16502980887889862,
        -0.052120935171842575,
        -0.035669632256031036,
        0.1218724250793457,
        0.013233383186161518,
        0.0004697629774454981,
        0.06520761549472809,
        0.05434395372867584,
        0.02209625206887722,
        -0.06118050590157509,
        0.047728005796670914,
        0.03590394929051399,
        0.00018549407832324505,
        -0.04297808185219765,
        -0.05955991521477699,
        -0.04780534654855728,
        -0.0467422716319561,
        -0.0018758242949843407,
        0.0005348734557628632,
        0.012286371551454067,
        0.06816840171813965,
        -0.07146398723125458,
        -0.06485021859407425,
        -0.02929684892296791,
        -0.09162717312574387,
        -0.008464743383228779,
        0.020420555025339127,
        0.043200504034757614,
        -0.002091547241434455,
        0.06339432299137115,
        -0.01398461777716875,
        -0.03672259673476219,
        -0.08008842170238495,
        -0.09738881886005402,
        0.0010831652907654643,
        -0.050165917724370956,
        -0.04647194594144821,
        -0.03971691429615021,
        0.04775790125131607,
        -0.036332566291093826,
        -4.58573166491038e-33,
        -0.027951620519161224,
        -0.03892382234334946,
        -0.0375545471906662,
        -0.013138278387486935,
        0.06128401681780815,
        0.06806137412786484,
        0.04723609611392021,
        -0.0775642916560173,
        0.03071606531739235,
        0.06331278383731842,
        0.0017843068344518542,
        0.03953590616583824,
        -0.06492191553115845,
        -0.02034432254731655,
        0.019390491768717766,
        0.0404910184442997,
        0.03161764517426491,
        -0.0077205137349665165,
        0.0004718636046163738,
        -0.040469102561473846,
        0.12691141664981842,
        0.012956209480762482,
        -0.04559328407049179,
        0.03267761319875717,
        0.05293871462345123,
        0.04011644423007965,
        0.07551126182079315,
        -0.09572577476501465,
        0.005785351153463125,
        0.08375763148069382,
        -0.09698180854320526,
        -0.046288833022117615,
        0.01943347230553627,
        0.027213525027036667,
        0.09654643386602402,
        -0.06489968299865723,
        -0.04840676486492157,
        0.05156116187572479,
        -0.005554223898798227,
        -0.03315610811114311,
        0.0631842315196991,
        -0.019327053800225258,
        0.012447954155504704,
        0.005017434246838093,
        0.03242894262075424,
        -0.08649236708879471,
        -0.039181455969810486,
        -0.01977374218404293,
        0.07179945707321167,
        0.026499008759856224,
        -0.0693027451634407,
        -0.051658082753419876,
        0.09981679916381836,
        -0.0793594941496849,
        -0.030791303142905235,
        -0.0231485515832901,
        -0.021700507029891014,
        -0.009582806378602982,
        0.05852294713258743,
        -0.018251236528158188,
        0.020503705367445946,
        -0.014705725945532322,
        -0.03620413318276405,
        -0.013351294212043285,
        0.04794054478406906,
        0.013866477645933628,
        0.01702415943145752,
        0.07329181581735611,
        -0.05723968520760536,
        -0.024980463087558746,
        -0.028582492843270302,
        0.008115234784781933,
        -0.030775774270296097,
        -0.08381210267543793,
        -0.04964093863964081,
        0.06352416425943375,
        0.07186072319746017,
        -0.006931891664862633,
        0.06680075824260712,
        0.0015967019135132432,
        -0.06010157987475395,
        0.03105027787387371,
        0.08280833065509796,
        -0.04531988501548767,
        0.010629593394696712,
        0.009417185559868813,
        -0.03645923361182213,
        -0.001215622527524829,
        -0.021560722962021828,
        0.02031131274998188,
        -0.037867043167352676,
        0.04293349012732506,
        0.056233104318380356,
        0.006265133619308472,
        0.021666571497917175,
        -6.242358807639903e-08,
        -0.002575991675257683,
        -0.04675650596618652,
        0.03401460871100426,
        -0.0018393939826637506,
        0.00030208969837985933,
        -0.06646560877561569,
        -0.01640559919178486,
        -0.05130843445658684,
        -0.003665141761302948,
        -0.019745321944355965,
        0.03891291469335556,
        -0.08696680516004562,
        -0.0039153555408120155,
        0.04977187514305115,
        0.00884786807000637,
        0.04224689304828644,
        -0.04350963234901428,
        0.06623797118663788,
        -0.06247691437602043,
        -0.031091641634702682,
        0.03129461035132408,
        0.06536556035280228,
        0.12637954950332642,
        -0.014292897656559944,
        -0.051278624683618546,
        0.015391157940030098,
        0.015847939997911453,
        0.05547810718417168,
        0.07147488743066788,
        0.005554758477956057,
        -0.0038144856225699186,
        0.021269742399454117,
        0.024885786697268486,
        -0.01260776724666357,
        0.07240106165409088,
        -0.044547710567712784,
        -0.027977248653769493,
        0.08300331979990005,
        0.020324384793639183,
        0.03622487932443619,
        -0.07038351893424988,
        -0.034510478377342224,
        -0.03638012334704399,
        0.017182545736432076,
        0.03887379541993141,
        0.036857541650533676,
        -0.024007609114050865,
        -0.06064220145344734,
        -0.04802275449037552,
        0.006161624100059271,
        -0.04650777578353882,
        -0.05290643498301506,
        -0.03739586099982262,
        0.05531548708677292,
        0.022297190502285957,
        0.04821476340293884,
        -0.01982085406780243,
        0.075966976583004,
        0.06089028716087341,
        0.012372923083603382,
        0.003515771124511957,
        -0.12172485142946243,
        0.009553949348628521,
        0.10419823974370956
    ]
}