{
    "id": "mL7em34jMUE",
    "title": "Why Does Nokia Exist in 2018?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-04-27T14:14:44Z",
    "video_url": "https://www.youtube.com/watch?v=mL7em34jMUE",
    "category": "Science & Technology",
    "tags": [
        "nokia",
        "nokia 2",
        "nokia 6",
        "nokia 7 plus",
        "smartphone",
        "unboxing",
        "android",
        "hmd global",
        "gadgets",
        "tech",
        "review",
        "nokia 3310",
        "mobile",
        "is it worth it",
        "why does this exist",
        "austin evans"
    ],
    "views": 1475363,
    "likes": 33049,
    "comments_count": 3894,
    "description": "In 2018, is there a place for Nokia in the world of Android smartphones? $100 Nokia 2 on Amazon:  $200 Nokia 6 on Amazon:  $430 Nokia 7 Plus on Amazon:  $60 Nokia 3310 on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/nokia2",
        "http://austin.tech/nokia6",
        "http://austin.tech/nokia7plus",
        "http://austin.tech/nokia3310",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, this is Austin. Nokia used to be one of the biggest tech companies in the world. However, after a few dark years of Windows phone, they've actually emerged sort of better than ever. And they actually have a full lineup of Android phones, and some non-Android phones. But of course the question is, why does Nokia exist in 2018? Of course, we have to start with the Nokia 3310. Now if this looks familiar to you, we actually did an entire video on the 3310 pretty recently. The sort of gist of it is that the original 3310 was an absolute legend. And this is a modern remake with some update internals, and sort of more importantly, some retro style. So sure, for a lot of people this is going to be a novelty rather than a phone that you're actually going to want to use everyday. However, this is only one of a surprisingly large amount of phones that Nokia sells today. Where things get a little bit more interesting is with the Nokia 2. Now this takes the huge step all the way up to running Android. And with only $100 price tag, there's a lot to like here. Crack this guy open, and the first thing we see is the phone itself. Now something that sort of separates this from a lot of other super-budget phones is actually going to be the build. Around back, you're going to see it's got a plastic shell. However, around the actual edges and the frame, it's going to be made out of aluminum. And that makes a surprisingly big difference to the actual feel in the hand. It does feel a lot nicer than the $100 price tag would suggest. But if we pop off that back panel, and what you'll find is not only a pair of sim card slots, but you're also going to be getting micro SD card expandability. And you can use all three of those at the same time. Something else you're going to find here is unfortunately an unremovable battery. But it's going to be a massive 4100 milliamp hours. So that is a very big battery for pretty much any phone. For context, most Android flagships are somewhere in the 3500 milliamp hour range. When you consider this is a $100 budget phone with $100 budget specs, that battery is going to make this thing last forever. What you're getting here is a pretty solid five inch 720p display. Now what's really impressive about this, is it actually gets surprisingly bright. I mean, yeah, of course you see $100 phone you're going to think that it's not going to be super cutting edge. But I think for most people you're going to be totally fine with this screen. Now at this point, this is all sounding a little bit too good to be true. And where things fall apart is with the specs. So inside this guy is powered by a Snapdragon 212 processor. Now that is not exactly going to be fast. It is going to be quad core, but it's only going to be using Cortex A7 cores, which are old-school and very, very slow. Making things a lot worse is the idea that this only has one gigabyte of RAM. Now it's going to be kind of usable. It's going to be fine for a lot of things. But the issue is that multi-tasking is pretty much going to be a no go. And apps are going to constantly being ejected out of the memory. The good thing is, this is going to be running on Android 7.1.1 Nougat, and it will be getting an update to Oreo soon. And for the most part, the software is going to be nice and clean. There's really no extra bloatware. It's going to be pretty much as you would expect to find on something like a Pixel. Around back it's rocking an eight megapixel camera. Now if we take a look here, you know what, that's actually not going to be that bad. I mean, it's going to be a little bit low on dynamic range. And it's still going to be a touch soft. For $100, what you're getting here is going to be solid build quality, pretty crazy battery life, at the expense of a little bit of performance. However, luckily, Nokia also has a range of other devices available, including the Nokia 6. Open this guy up, and it's immediately apparent that it's going to be a larger phone. So this guy, oh wow, you actually can tell immediately. Is going to be a little bit more of a premium build. So where as the Nokia 2 had a little bit of plastic on the back. How do you actually open this? As I was saying, the build quality is going to be a little bit more premium here. So as opposed to having just an aluminum chassis, what we're getting here is a full uni-body design with actual aluminum on the back. Now the only thing that kind of jumps out to me a little bit and honestly, that's because I've been looking at so many flagships lately, is that the bezels are going to be a little bit large. But that does leave room for the actual haptic buttons on the bottom, as well as you're going to be getting an earpiece, which doubles as a stereo speaker. Along with the little tiny one on the bottom. For $1000, today though, I was able to pick it up. It actually doesn't sound that great. So you can tell it is using both speakers, but it sounds a little bit muffled. I mean it's not terrible, mind you, but it just doesn't sound very clear. Which is a little bit odd for dual speakers. Inside you're going to be getting an octicore Snapdragon 430 processor. Now in addition to having double the cores of the Nokia 2, they're also going to be Cortex 853 based which is going to be significantly faster while still giving you decent battery life. Now the rest of the specs are going to be with three gigs of RAM as well as 64 gigs of storage. However, one of the only things that's going to slowly let this phone down is the idea that it only has a 3000 milliamp hour battery. Now, with a spec like that, it's not actually going to be that bad, but it is definitely not going to last anywhere near as long as the Nokia 2 with its massive 4000 milliamp hour battery. However just like the Nokia 2 we are going to be getting a super clean build of Android, and yet again it's going to be running Nougat with a future upgrade to Oreo. It's also using the same camera app, but it actually looks like this is a little bit of a better sensor. So as opposed to the 8 megapixel sensor on the Nokia 2, this guy is rocking 16 megapixels. Yeah that's a lot better. Especially the white balance is much more accurate. Oh yeah, that is going to be a big, big change. Might not be the greatest camera on a smartphone you've ever seen, but for the price, I'm not complaining. That's actually looking super nice. It might not be super exciting, but this is a fairly decent looking midrange device. Especially considering that there's a new version coming out soon. Might be worth checking out. I've gotta say, Nokia's actually been doing a pretty good job so far. All these phones are decent if not actually pretty solid. However, the next and the newest phone I had to take a look at today is the Nokia 7 Plus. So this is a brand new device. In Europe, it should cost around 400 Euros, or once it comes around to the States, somewhere in the neighborhood of about $450. Now what makes this interesting, is that not only does it have Android 8.0 Oreo out of the box, but it's also going to be an Android One device. Meaning that it's going to get two years of guaranteed Android updates, as well as that same fairly stock build of Android that's going to come pre-installed. And that's actually something that Nokia is going to be doing across the board with their new phones. So everything above the Nokia 2 is going to be Android One certified. So if you want to make sure that you're getting the latest updates, that's actually going to be a big win. Pop this guy open, and we're getting something that should actually look a lot more modern. Even though these all look almost identical when you actually open them up. Whoa! This is copper? Yo, that looks really cool, I didn't realize. So when you're looking at it straight on from the back it's mostly black. But especially when you flip it over to the side it's got this sort of brushed copper look. And that even comes across to little things like around the camera which also has the little Zeiss logo. Aw, man, this is a really good looking phone. I can't get over how just how nice this feels in the hand. So because it's got that sort of copper ridge around it, it actually does sort of settle really nicely. And on top of that, what we're going to be getting is a six inch display, with an 18 by nine aspect ratio, so it's not going to be bezel-less, but it looks a little bit nicer, and we're also going to be getting a full 2160 by 1080 resolution. Around back you're going to be finding not only the fingerprint sensor, but also your dual cameras. So, like a lot of higher end flagships, one is going to be the wide angle camera, and one is going to be the telephoto option with a 2x zoom. All right, so if I take a picture of Ken on the wide angle camera, and then zoom in to 2x, yeah. Yeah, like most of these, the telephoto camera doesn't look quite as nice, but it should be available and it should be kind of helpful to have. Especially when you want to get a little bit of a different perspective on things. Interestingly, this also has a 16 megapixel camera up front. Actually, it's going to be higher megapixels than the rear. And, dude, that's not bad at all actually. There's even a little bit of depth of field there, too. Spec wise, you're going to be getting something that's going to be basically on par with what you'd expect at the price point, a Snapdragon 660. That being said it actually does perform pretty well. And it going to be backed with four gigs of ram, as well as 64 gigs of storage. But the question is, is it worth it? So we're going to be getting only a single speaker unlike the duel speaker on the Nokia 6. But thankfully, it actually does sound better. And even more thankfully, this still does have the headphone jack. Just so you know. So this guy is going to be rocking a 38000 milliamp hour cell which while not on par with the Nokia 2, it's going to be on the upper end of what you would find on most flagships. Especially considering the slightly lower end internals in this guy. If the Nokia 7 Plus does come to the U.S. around $450, it's actually going to be a really hard phone to beat. Now sure you're going to be giving up a little bit of performance, but at this kind of price, you're getting nice build quality, a solid camera, a good screen. I mean really the only thing I can complain about is it doesn't have stereo speakers. And even then, the speaker itself here sounds pretty good so... Nokia has seen a massive turnaround. And of course some people are going to miss the old Windows phone days, but now that they're making Android devices, they're actually doing a really good job of making decent mid-range, as well as budget devices that have solid build quality, good battery life, and just have a nice clean build of Android that's actually going to get updates. So should they exist in 2018? Yeah, of course they should. They're doing some really cool stuff. I've gotta say, I'm actually happy that I got to give a good answer on one of these. Anyway guys, hopefully you enjoy this video. If you wanna check out any of this stuff, the link will be in the description. And I will catch you in the next one.",
    "transcript_keywords": [
        "Nokia",
        "Android",
        "bit",
        "phone",
        "pretty",
        "lot",
        "build",
        "camera",
        "good",
        "guy",
        "phones",
        "things",
        "sort",
        "battery",
        "Austin",
        "back",
        "thing",
        "Android phones",
        "Windows phone",
        "nice"
    ],
    "transcript_entity_values": [
        "a few dark years",
        "only $100",
        "around 400 Euros",
        "one gigabyte",
        "about $450",
        "the Nokia 6",
        "the Nokia 7 Plus",
        "Nougat",
        "Europe",
        "three",
        "38000",
        "2018",
        "Cortex A7",
        "Android",
        "1080",
        "first",
        "States",
        "RAM",
        "Windows",
        "two years",
        "450",
        "2x",
        "Ken",
        "jack",
        "3000 milliamp hour",
        "64",
        "Austin",
        "Snapdragon 430",
        "8 megapixel",
        "Windows",
        "four",
        "one",
        "U.S.",
        "Android 7.1.1 Nougat",
        "Zeiss",
        "Snapdragon 212",
        "18",
        "2160",
        "SD",
        "eight megapixel",
        "3310",
        "five inch",
        "1000",
        "Android One",
        "Yo",
        "only one",
        "4100 milliamp hours",
        "3500 milliamp hour",
        "six inch",
        "nine",
        "100",
        "today",
        "Oreo",
        "16 megapixels",
        "4000 milliamp hour",
        "Nokia",
        "16 megapixel"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "EVENT",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.13622479140758514,
        0.036216266453266144,
        0.07630591094493866,
        -0.044433221220970154,
        -0.016210924834012985,
        -0.03038892336189747,
        -0.07987953722476959,
        0.0520770289003849,
        0.06411971896886826,
        0.02796713262796402,
        -0.011051101610064507,
        0.07334128022193909,
        0.10124794393777847,
        -0.0274394229054451,
        0.015121562406420708,
        -0.02690320648252964,
        0.03365623205900192,
        -0.08838947862386703,
        -0.039894282817840576,
        0.03348710387945175,
        0.005753715056926012,
        -0.023224037140607834,
        -0.009124734438955784,
        -0.02298283390700817,
        0.08969700336456299,
        0.015899745747447014,
        -0.0826738178730011,
        0.02780936099588871,
        -0.0019095978932455182,
        0.038119010627269745,
        0.009313980117440224,
        0.17445021867752075,
        0.04110037907958031,
        0.017518464475870132,
        -0.08938717842102051,
        -0.05881548672914505,
        -0.009169839322566986,
        -0.005439921282231808,
        -0.021375220268964767,
        -0.02352861687541008,
        0.007541759870946407,
        0.004822554066777229,
        -0.03516120836138725,
        0.025658393278717995,
        -0.02309008501470089,
        -0.07717504352331161,
        0.07389440387487411,
        0.005327786784619093,
        -0.06165828928351402,
        -0.03874701261520386,
        -0.022444788366556168,
        -0.03205261379480362,
        0.03603871539235115,
        -0.0808119848370552,
        -0.04187488928437233,
        -0.06326712667942047,
        -0.02448219247162342,
        0.01899181306362152,
        0.0901690348982811,
        -0.0026994559448212385,
        0.09405919164419174,
        -0.060939762741327286,
        -0.011990307830274105,
        0.04878408461809158,
        -0.009093265049159527,
        -0.024999679997563362,
        -0.03543555736541748,
        0.00024454540107399225,
        0.026758180931210518,
        -0.05212828889489174,
        -0.033084139227867126,
        -0.033450741320848465,
        0.01049650926142931,
        0.03649483621120453,
        -0.033324528485536575,
        0.028572842478752136,
        0.08650998771190643,
        0.005072626750916243,
        -0.08454404771327972,
        0.02353697642683983,
        0.09449827671051025,
        -0.04462628811597824,
        0.021933453157544136,
        -0.05569366365671158,
        0.006175226531922817,
        0.021351486444473267,
        0.024379273876547813,
        0.09873312711715698,
        -0.12671582400798798,
        -0.06776291131973267,
        -0.0010266425088047981,
        0.0896720439195633,
        -0.019115205854177475,
        -0.005582483951002359,
        -0.023416979238390923,
        0.03303813189268112,
        -0.02567618153989315,
        -0.013049742206931114,
        0.04150589928030968,
        -0.01756017655134201,
        0.03078729286789894,
        0.022022340446710587,
        0.047564323991537094,
        0.0066148960031569,
        0.02383151464164257,
        -0.08418301492929459,
        -0.0269512627273798,
        0.028308484703302383,
        0.021786591038107872,
        0.02284621261060238,
        -0.061777081340551376,
        -0.015695594251155853,
        -0.09473342448472977,
        -0.0596868060529232,
        -0.07653011381626129,
        -0.014440994709730148,
        -0.039710912853479385,
        0.08085818588733673,
        0.06553517282009125,
        0.015201306901872158,
        0.01087680459022522,
        -0.02165166661143303,
        -0.0772782415151596,
        -0.09107095748186111,
        0.02768169902265072,
        0.03280950337648392,
        -0.05007976293563843,
        -7.291726456330002e-34,
        -0.010986032895743847,
        0.10188912600278854,
        0.0025647960137575865,
        0.014739194884896278,
        0.005756307393312454,
        -0.015445801429450512,
        -0.009484764188528061,
        0.008255889639258385,
        0.010754399932920933,
        -0.023101916536688805,
        -0.00433682044968009,
        0.01339736208319664,
        -0.05340785160660744,
        0.0018215287709608674,
        0.06725142151117325,
        -0.015997489914298058,
        -0.09864417463541031,
        -0.07148122787475586,
        0.018579619005322456,
        0.01279071532189846,
        0.013800923712551594,
        -0.004756959620863199,
        0.021848279982805252,
        0.01725824363529682,
        -0.060315269976854324,
        0.07789676636457443,
        0.08371125906705856,
        -0.021091582253575325,
        0.05294594168663025,
        -0.019028382375836372,
        -0.027957733720541,
        -0.03850176930427551,
        -0.011248738504946232,
        -0.027161553502082825,
        -0.02164001204073429,
        0.05713004991412163,
        -0.002668070374056697,
        -0.130631223320961,
        0.03440059348940849,
        -0.024672266095876694,
        -0.06090538576245308,
        0.06864875555038452,
        -0.07620548456907272,
        0.013697275891900063,
        0.06633930653333664,
        0.0035044439136981964,
        -0.018506642431020737,
        0.002733588917180896,
        0.0017152754589915276,
        0.0055968076921999454,
        0.014426305890083313,
        0.012989007867872715,
        -0.03394167870283127,
        0.03378605842590332,
        -0.0411127433180809,
        0.01445668563246727,
        -0.015431546606123447,
        -0.03400030732154846,
        0.08069878816604614,
        0.044266123324632645,
        0.03443731740117073,
        -0.06600264459848404,
        -0.04630371183156967,
        0.04532253369688988,
        -0.04323795437812805,
        0.07878854125738144,
        0.09643088281154633,
        -0.04640243947505951,
        -0.05735725536942482,
        0.13572797179222107,
        0.02775709703564644,
        -0.05336849391460419,
        -0.019297083839774132,
        0.040214136242866516,
        0.05216780677437782,
        0.07942228019237518,
        0.009910550899803638,
        -0.07752548158168793,
        0.0019110344583168626,
        0.045867208391427994,
        -0.025357011705636978,
        0.017495356500148773,
        0.04333886131644249,
        -0.00263982149772346,
        0.03811536729335785,
        -0.04499058797955513,
        -0.03323286399245262,
        -0.05932224169373512,
        0.017593801021575928,
        0.06260792165994644,
        -0.015241365879774094,
        -0.05049458146095276,
        -0.03710281848907471,
        0.07265130430459976,
        0.05608362331986427,
        -1.8776042695989777e-33,
        0.04590502753853798,
        -0.03341054916381836,
        0.02520562708377838,
        -0.03300382196903229,
        0.006242039613425732,
        -0.05588740110397339,
        -0.02197623811662197,
        0.05296509340405464,
        -0.031441036611795425,
        0.017100296914577484,
        0.040682047605514526,
        -0.003221250604838133,
        0.04152476415038109,
        0.0550910048186779,
        -0.032542258501052856,
        -0.03667723014950752,
        0.035468265414237976,
        -0.06819592416286469,
        0.00011373131565051153,
        -0.009935195557773113,
        -0.011974203400313854,
        0.04553854465484619,
        -0.02532561495900154,
        0.06224943697452545,
        -0.08608350902795792,
        -0.005419005174189806,
        -0.08259633183479309,
        -0.048132624477148056,
        -0.03107588365674019,
        -0.009402601979672909,
        -0.02665793150663376,
        -0.09280318766832352,
        -0.003637913381680846,
        0.02909194678068161,
        0.07276080548763275,
        0.05865102261304855,
        0.008138450793921947,
        -0.024402812123298645,
        0.03642770275473595,
        0.05286630615592003,
        0.025968758389353752,
        0.031521908938884735,
        -0.001588959596119821,
        -0.008788660168647766,
        0.05729932337999344,
        -0.07730773836374283,
        -0.02710004895925522,
        0.05015981197357178,
        0.007452423218637705,
        -0.050696879625320435,
        0.12111792713403702,
        0.09185375273227692,
        0.029434900730848312,
        0.021291285753250122,
        -0.06211749464273453,
        -0.06042735278606415,
        -0.004840098787099123,
        -0.02438594587147236,
        0.025133762508630753,
        0.01710752211511135,
        0.05007984861731529,
        0.0057010049931705,
        -0.03030221536755562,
        0.0069821178913116455,
        -0.08561374247074127,
        0.08691081404685974,
        0.02683657594025135,
        0.006045069545507431,
        -0.0985870212316513,
        -0.012570713646709919,
        -0.0015236521139740944,
        -0.04493002966046333,
        -0.11376684904098511,
        -0.018476583063602448,
        -0.005833697039633989,
        0.10250406712293625,
        -0.11493990570306778,
        -0.02749771997332573,
        -0.020774856209754944,
        -0.03150171786546707,
        0.03945332393050194,
        0.09097632765769958,
        0.0806572362780571,
        0.002179540228098631,
        0.07682489603757858,
        0.02219036966562271,
        0.035793956369161606,
        0.011701571755111217,
        -0.11797038465738297,
        -0.025337528437376022,
        -0.06366732716560364,
        -0.045587632805109024,
        -0.1026635617017746,
        0.0822443962097168,
        0.03966487571597099,
        -4.4806125032437194e-08,
        0.012746233493089676,
        0.005850906949490309,
        0.015689052641391754,
        -0.04981577396392822,
        -0.005089852027595043,
        -0.05292735993862152,
        -0.03885206952691078,
        0.041579827666282654,
        0.13169583678245544,
        0.04213423654437065,
        -0.020111223682761192,
        -0.09973631054162979,
        -0.1032295748591423,
        0.06034717336297035,
        0.048828598111867905,
        0.10862476378679276,
        -0.06157107278704643,
        0.017671970650553703,
        -0.005902592092752457,
        0.07761573046445847,
        0.03334256634116173,
        0.0608571395277977,
        0.008840884082019329,
        -0.046671658754348755,
        0.05031665414571762,
        -0.0031513499561697245,
        -0.061316587030887604,
        -0.018175041303038597,
        0.06786409765481949,
        -0.03581424430012703,
        0.02861945517361164,
        -0.0536789633333683,
        -0.007362070493400097,
        -0.01214095763862133,
        -0.09140821546316147,
        -0.018801115453243256,
        0.024309689179062843,
        -0.033648744225502014,
        0.036930155009031296,
        -0.048571180552244186,
        0.014800800010561943,
        -0.10146866738796234,
        -0.02228773944079876,
        0.01782107725739479,
        0.018067901954054832,
        -0.037044625729322433,
        -0.049034249037504196,
        -0.06620753556489944,
        -0.06646121293306351,
        0.022093981504440308,
        -0.026746435090899467,
        -0.048625171184539795,
        0.03311148285865784,
        -0.050473228096961975,
        0.012196305207908154,
        -0.051811281591653824,
        -0.02086489275097847,
        0.057042501866817474,
        -0.0157065037637949,
        0.008990878239274025,
        0.04860944673418999,
        -0.08365653455257416,
        0.09517323225736618,
        0.06044299155473709
    ]
}