{
    "id": "mLt7JRCS1po",
    "title": "Microsoft Duo 2 Durability Test! - There's one big problem...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-11-22T14:45:03Z",
    "video_url": "https://www.youtube.com/watch?v=mLt7JRCS1po",
    "category": "Howto & Style",
    "tags": [
        "Microsoft duo 2",
        "microsoft phone",
        "windows phone",
        "microsoft",
        "surface phone",
        "surface duo 2",
        "android",
        "iphone",
        "mobile phone",
        "dual screen phone",
        "durability test",
        "scratch test",
        "microsoft surface duo",
        "surface duo",
        "duo 2"
    ],
    "views": 673731,
    "likes": 30179,
    "comments_count": 1674,
    "description": "Today we find out how durable the Surface Pro 2 really is! Get a 4-week trial, free postage, and a digital scale at  Thanks to Stamps.com for sponsoring the show! Dual screen phones have alway appealed to me. Maybe because Ive always had dual displays for my desktop PC. But.... This Microsoft Surface Duo 2 (running android) doesnt really move my meter. I wish Microsoft would do something new in the moble space... like make a pocket sized computer. What do you think? Let me know down in the comments.   Get my Shirts or Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.stamps.com/jerryrig.",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to be doing a durability on Microsoft's newest phone The Surface Duo 2 that costs $1,500. It's got two screens though which means our durability test will be twice as fun. This video is sponsored by Stamps.com. Personally, I use Stamps.com on a very regular basis. I ship out my JerryRigEverything knives, and I will be shipping out this limited edition Art Class with Jerry T-shirt. Links are down in the description. Why use Stamps.com do you ask? Well it's because I never have to leave my house. Time is money and with Stamps.com I have all the access I need to UPS and to USPS. I can compare rates and print labels right from my own computer. If you spend more than a few minutes a week dealing with mail and shipping, Stamps.com is a real time saver. Join the 1 million other businesses using Stamps.com and save time and money this holiday season. Head to Stamps.com/JerryRig for a special 4-week trial, free postage, and a free 5 pound digital scale. No long term commitment or contracts. It's super easy. Stamps.com/JerryRig and I will literally be using it right after we finish this durability test. Speaking of which, let's get started. [Intro] In front of us today we have the Microsoft Surface Duo 2. Last year's Duo 1 was concerningly flexible in some weird places, but did ultimately survive my durability test so this should be interesting. Inside the box we see there is no charging brick, just a USB-C charging cable. Lack of a brick is fine with me, I have about 700 sitting in a drawer. I'm not sure what the rest of y'all are doing though. Apparently the Duo 2 is all about multitasking...kind of like having 2 displays on your desktop. The biggest difference between this year's Duo and last year's Duo is that Microsoft has actually added cameras this time around and that camera bump is slightly angled so the phone can still flip all the way around and kind of close together...kind of. Seems a little out of place, not going to lie, but not a deal breaker. Having cameras is more important than it folding flat. But it's kind of a bummer we have to compromise. The hinge holds it's place at any point during the opening process and can be propped up like a laptop so you can set it on a table and watch YouTube videos on the upright screen. It's also got magnets on the back which can be used to mount Microsoft's stylus to the phone. And once again, I am a fan of this design, with some caveats though, but I'll get to those in a second. First, let's scratch the screens. Normally with folding phones like the Samsung Z Flip and the Z Fold, the folding screen is made from a super soft plastic. We can see what material the screen is made from on this Duo 2 by using the Mohs scale of hardness. A level 2 or 3 would be plastic. A level 5 or 6 would be glass, and a level 8 or 9 would be sapphire. Luckily we start seeing scratches at a level 6 with deeper grooves at level 7. And scratches at a level 6, with deeper grooves at a level 7, which does make this the most scratch resistant folding phone we've tested so far this year. No plastic screens here. Now this does mean there is a substantial gap and bezel between the two halves, just like you would expect on dual desktop displays. The front facing camera is protected by that same Gorilla Glass Victus. The sides of this $700 smartphone in 6 months are made from plastic, like we see around the USB-C port and the plastic SIM card tray. Microsoft actually tweeted that their phone is IPX1, which means it's water resistant to singular droplets of vertically falling water, like the tears of Duo owners after seeing the price drop. You should still grab a tissue though because the IP rating system only counts in fresh water and not salt water. And this entire frame and buttons are made from plastic...minus the hinge. The hinge is made from metal. One cool little gimmick though, if we plug in my Anker power bank we can see that the charging indicator notifies us through the curved glass on the spine of the phone. This also works for notifications, and if you have a magnifying glass you can even see a little clock. Samsung, of course, solved the notification issue by adding a whole front display which would have been useful here on the Duo 2 instead of just peeking through the hinge. If you have to pick up and kink your phone to the side to see notifications, you might as well just open it. One substantial improvement over last year's Duo though is that this time around instead of only having one internal selfie camera to work with, we finally have some real cameras on the back. A 12 megapixel normal camera, a 12 megapixel telephoto, and a 16 megapixel ultra wide all protected under that same angled glass camera bump. I'm a fan of this improvement. However, I don't deal much with software during my reviews, but having watched other reviews on YouTube, I understand that this Duo 2 is still just as finicky as the Duo 1, which is unfortunate. With it's dual 5.8 inch 90 hertz displays, Microsoft could really come out swinging...if they ditched Android. And hear me out. Microsoft should own what they own, drop Android and plop a full fledged Windows operating system on here. The Surface Pro tablets running full Windows are pretty amazing. Luckily we have two screens to burn so I can keep on talking. Microsoft could crush the mobile productivity space in ways that no one else can. But here they are, trying to adapt a super creative phone to an Android operating system that prefers boring rectangles. The Surface Duo 2 is just begging to be a full fledged PC in my pocket, but it's being held back by Android. Can you imagine pulling a full Windows 11 PC out of your pants. It already does 4K video over USB-C so I could connect to external monitors while traveling by adding a Bluetooth, mouse, and keyboard...I'm getting excited just thinking about it. I'd never bring my laptop anywhere ever again, which is actually probably the very reason why Microsoft doesn't do it. The dual AMOLED screens both lasted an incredibly long time under my lighter though without leaving much of a mark at all. Finally, we do have a side mounted fingerprint reader, which normally I do prefer, but since this one is made from plastic, and I already scratched it, it's having a hard time performing. I think we can let it slide though, it's kind of had a hard day. Now it's time to see how structurally solid this multitasking glass and plastic sandwich really is. Yeah, I can fold at 360 degrees minus a few for that camera bump, but one annoying thing is that the phone does have to be opened each time you get a phone call and closed again after the call is over. Luckily, even when slammed shut with an exorbitant amount of force, the glass is not cracked. Slamming it shut backwards also has no effect on the phone. Nice work so far, Microsoft. Now the bend test. When bent from whatever side this is, we don't see any flex from the hinge, but we do see some massive flex from the other end of the phone. I'm going to say the true winner here is the Gorilla Glass Victus bending and flexing to the extreme on all sides without shattering. It's the only thing holding this phone together cuz it sure is an Android. Well, Microsoft Surface Duo 2 has survived my durability test. I'm curious though, would you swap your Android phone for a dual screen full fledged pocket computer? Do you think Android is holding the Duo series back from something epic? Let me know your thoughts down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Microsoft Surface Duo",
        "Duo",
        "Surface Duo",
        "year Duo",
        "phone",
        "Microsoft",
        "Stamps.com",
        "Microsoft newest phone",
        "Android",
        "glass",
        "Time",
        "Microsoft Surface",
        "plastic",
        "level",
        "Surface",
        "Gorilla Glass Victus",
        "camera",
        "durability test",
        "Microsoft newest",
        "made"
    ],
    "transcript_entity_values": [
        "Anker",
        "Microsoft",
        "Windows",
        "9",
        "6",
        "8",
        "7",
        "5.8 inch",
        "Stamps.com",
        "Instagram",
        "1 million",
        "two",
        "6 months",
        "6",
        "about 700",
        "12 megapixel",
        "Microsoft Surface Duo 2",
        "The Surface Duo 2",
        "4",
        "Gorilla Glass Victus",
        "USPS",
        "Last year's",
        "700",
        "year",
        "last year's",
        "Samsung Z Flip",
        "5",
        "this year",
        "USB-C",
        "the Z Fold",
        "360 degrees",
        "second",
        "a few minutes",
        "Time",
        "First",
        "today",
        "Samsung",
        "1,500",
        "Android",
        "The Surface Pro",
        "Today",
        "4-week",
        "Stamps.com/JerryRig",
        "the Microsoft Surface Duo 2",
        "3",
        "One",
        "16 megapixel",
        "YouTube",
        "USB",
        "Mohs",
        "AMOLED",
        "one",
        "Jerry T-",
        "2",
        "Twitter",
        "IP",
        "Windows 11",
        "this holiday season"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE"
    ],
    "vector": [
        -0.12316090613603592,
        0.052564866840839386,
        0.04783666506409645,
        -0.06861789524555206,
        0.0220428965985775,
        -0.05327458307147026,
        0.011113392189145088,
        0.07049337774515152,
        -0.047154318541288376,
        0.009973312728106976,
        0.05733156576752663,
        -0.018958427011966705,
        0.012606319971382618,
        0.0336972139775753,
        0.006220302078872919,
        0.023051075637340546,
        0.08317497372627258,
        -0.025823194533586502,
        -0.015432991087436676,
        0.1460951715707779,
        0.019797896966338158,
        -0.0769558921456337,
        0.009408247657120228,
        -0.07489617168903351,
        0.016231300309300423,
        0.04015813395380974,
        -0.031237304210662842,
        0.008349098265171051,
        -0.06696134805679321,
        -0.05717175826430321,
        0.00414974195882678,
        0.05375156179070473,
        -0.053955741226673126,
        0.049491699784994125,
        0.03576655685901642,
        -0.06891097873449326,
        0.0660703033208847,
        -0.0011552583891898394,
        -0.10524857044219971,
        -0.11568757146596909,
        -0.024474550038576126,
        -0.0047941673547029495,
        0.02048342488706112,
        0.02260012738406658,
        0.038779549300670624,
        -0.012507574632763863,
        0.05973917618393898,
        -0.0017099383985623717,
        -0.006554531864821911,
        0.036183230578899384,
        -0.028580639511346817,
        -0.10059310495853424,
        0.0678858757019043,
        -0.03112717531621456,
        -0.07541511207818985,
        0.07067965716123581,
        0.03778669238090515,
        0.02846573479473591,
        0.002728422172367573,
        -0.05437678098678589,
        0.07491516321897507,
        -0.004842578899115324,
        -0.041387222707271576,
        0.0805296003818512,
        0.009310595691204071,
        -0.020941639319062233,
        0.012279918417334557,
        -0.07494932413101196,
        -0.06363791227340698,
        -0.005595562048256397,
        -0.10783010721206665,
        -0.02114291302859783,
        0.01867900788784027,
        -0.005761817097663879,
        0.039370063692331314,
        0.021815897896885872,
        -0.030479291453957558,
        -0.03217604383826256,
        0.0007524703396484256,
        0.011347885243594646,
        -0.020765263587236404,
        -0.02841184101998806,
        -0.06748966127634048,
        0.04448022320866585,
        0.03747089207172394,
        -0.010761001147329807,
        0.021891999989748,
        0.09079238772392273,
        -0.07916245609521866,
        -0.13947497308254242,
        -0.003179387655109167,
        0.08286742866039276,
        -0.0067494576796889305,
        0.01842748187482357,
        -0.031236492097377777,
        -0.07427666336297989,
        -0.054258305579423904,
        -0.04041200876235962,
        -0.03064744733273983,
        0.040236696600914,
        0.006569788791239262,
        0.036047790199518204,
        0.09133642166852951,
        -0.05163510516285896,
        0.010320983827114105,
        -0.08372925221920013,
        -0.043666739016771317,
        -0.03189057111740112,
        0.05714985728263855,
        0.013063445687294006,
        0.03867466002702713,
        0.01852763630449772,
        -0.06826036423444748,
        0.0348222590982914,
        0.06647414714097977,
        0.018209535628557205,
        -0.06369798630475998,
        0.08208872377872467,
        0.13724398612976074,
        -0.011688937433063984,
        0.001407058909535408,
        -0.010149137116968632,
        -0.06848723441362381,
        -0.05712100863456726,
        0.07387948781251907,
        0.07601410895586014,
        -0.014763583429157734,
        3.41341408757119e-33,
        -0.021032921969890594,
        0.09364617615938187,
        -0.00504280673339963,
        0.023058054968714714,
        -0.01437166053801775,
        0.0037789116613566875,
        0.01260100957006216,
        0.0680854395031929,
        0.04694489762187004,
        0.025699974969029427,
        0.0025156240444630384,
        0.03370046243071556,
        0.004056508187204599,
        0.08168381452560425,
        0.058423835784196854,
        -0.0753437951207161,
        0.0712638795375824,
        -0.0477740615606308,
        -0.006925241556018591,
        0.002785708988085389,
        -0.0057823024690151215,
        -0.062146566808223724,
        0.03395991027355194,
        -0.04038344323635101,
        0.06344548612833023,
        0.022308170795440674,
        0.037172138690948486,
        0.0323653519153595,
        0.10903991758823395,
        0.019289497286081314,
        -0.10579407215118408,
        -0.04375728592276573,
        0.015647122636437416,
        0.005574844311922789,
        -0.0688311904668808,
        -0.012772247195243835,
        -0.05644824355840683,
        -0.09409352391958237,
        0.027676941826939583,
        -0.005430408287793398,
        -0.10105280578136444,
        0.004909472540020943,
        0.05706331133842468,
        -0.09279721975326538,
        -0.013022242113947868,
        -0.06822029501199722,
        0.008127138949930668,
        0.019461169838905334,
        0.028395580127835274,
        -0.039939429610967636,
        0.017649739980697632,
        -0.05898793041706085,
        -0.03319428116083145,
        0.007319267373532057,
        -0.07225050777196884,
        -0.0361739881336689,
        -0.005281178280711174,
        -0.01825028471648693,
        0.07100215554237366,
        0.10076336562633514,
        0.029441434890031815,
        0.0016074195737019181,
        -0.02322888933122158,
        0.0568261556327343,
        -0.08742553740739822,
        0.016324123367667198,
        0.10452982783317566,
        0.03801564872264862,
        -0.09558156132698059,
        0.031224867329001427,
        -0.005275573115795851,
        -0.031446557492017746,
        0.0617542639374733,
        -0.04529457539319992,
        0.007948669604957104,
        0.0037861736491322517,
        -0.0054524121806025505,
        -0.021091777831315994,
        -0.003141371998935938,
        -0.018260685727000237,
        -0.05016802251338959,
        -0.006640600506216288,
        0.07549719512462616,
        -0.03382294997572899,
        -0.05035519599914551,
        -0.040914956480264664,
        -0.020445503294467926,
        -0.08745478838682175,
        -0.02128097042441368,
        0.041418205946683884,
        -0.012837599031627178,
        -0.01588403433561325,
        -0.06604839116334915,
        -0.024969326332211494,
        0.005464611109346151,
        -4.888763822976796e-33,
        -0.05327406898140907,
        -0.01844802126288414,
        0.005000002216547728,
        0.015904797241091728,
        0.022949719801545143,
        -0.024160215631127357,
        0.083748459815979,
        -0.017379775643348694,
        -0.03275593742728233,
        -0.039080407470464706,
        -0.010759709402918816,
        0.07404299080371857,
        -0.0025947755202651024,
        0.02918839082121849,
        0.03614027425646782,
        0.008953999727964401,
        0.013000517152249813,
        -0.052566275000572205,
        0.0743197426199913,
        -0.03409920260310173,
        0.08773771673440933,
        0.037564441561698914,
        0.045247845351696014,
        0.06388875097036362,
        -0.015171701088547707,
        -0.009355736896395683,
        0.009428742341697216,
        -0.08910693973302841,
        0.04710755497217178,
        0.048450324684381485,
        -0.023456720635294914,
        -0.03137681633234024,
        0.037100061774253845,
        0.012989317998290062,
        0.0997539758682251,
        0.011746837757527828,
        -0.0037581652868539095,
        -0.07852250337600708,
        0.01905248500406742,
        0.014371827244758606,
        -0.003509740112349391,
        0.0433150939643383,
        -0.02868095226585865,
        -0.006660884246230125,
        0.04683120176196098,
        -0.020991187542676926,
        -0.010768304578959942,
        -0.023873494938015938,
        -0.028087396174669266,
        0.0016281281132251024,
        -0.032570190727710724,
        0.06925459951162338,
        -0.04216321185231209,
        -0.06230457127094269,
        -0.05684338137507439,
        0.0012521493481472135,
        0.02812858298420906,
        -0.0284892488270998,
        -0.008400145918130875,
        -0.04082239791750908,
        0.05968652665615082,
        -0.020386913791298866,
        -0.032741762697696686,
        -0.0220017172396183,
        -0.019866056740283966,
        0.08499577641487122,
        0.10661712288856506,
        0.01582655869424343,
        -0.01187425572425127,
        0.06584223359823227,
        -0.022938387468457222,
        0.003280084580183029,
        0.015918737277388573,
        -0.10308092087507248,
        0.0051426454447209835,
        0.038844380527734756,
        0.0087599977850914,
        -0.0030450772028416395,
        0.007739164400845766,
        -0.024033060297369957,
        0.0397825725376606,
        -0.023724442347884178,
        0.07812610268592834,
        0.016876816749572754,
        0.04416957497596741,
        -0.034557439386844635,
        -0.001327256322838366,
        0.02075066603720188,
        -0.09975067526102066,
        -0.009143276140093803,
        -0.07085083425045013,
        0.018351156264543533,
        -0.035470180213451385,
        0.10175005346536636,
        0.012899576686322689,
        -5.9404065666512906e-08,
        0.010052457451820374,
        0.034874077886343,
        0.05781169980764389,
        -0.016649926081299782,
        -0.0517316497862339,
        -0.05710536241531372,
        0.02428334578871727,
        -0.0011001594830304384,
        0.033097296953201294,
        -0.022642964497208595,
        -0.06819354742765427,
        -0.13504204154014587,
        -0.025492360815405846,
        0.09256646782159805,
        0.039048932492733,
        0.12407805770635605,
        0.017247898504137993,
        0.01705949939787388,
        -0.06166110187768936,
        0.0033860986586660147,
        -0.017957361415028572,
        0.04671180993318558,
        0.05174336954951286,
        -0.021232327446341515,
        0.01977860927581787,
        0.054155685007572174,
        -0.10778984427452087,
        0.064003124833107,
        0.08182862401008606,
        -0.021468862891197205,
        -0.009561886079609394,
        -0.034318339079618454,
        -0.030531957745552063,
        0.005866421852260828,
        -0.03570020943880081,
        -0.07036776095628738,
        -0.05903942510485649,
        0.05507923662662506,
        0.15571311116218567,
        0.05673167109489441,
        -0.053461797535419464,
        -0.04522110894322395,
        -0.042966578155756,
        0.05039334297180176,
        0.03401871770620346,
        -0.09714709967374802,
        -0.020307764410972595,
        -0.1467972695827484,
        -0.07425297796726227,
        0.018990913406014442,
        -0.02604946307837963,
        -0.009074554778635502,
        -0.022472422569990158,
        0.025497939437627792,
        0.04199383407831192,
        0.02402864769101143,
        -0.022309698164463043,
        -0.004127785563468933,
        0.010553144849836826,
        0.0807548388838768,
        0.03350190445780754,
        -0.07677047699689865,
        -0.0726422667503357,
        0.05544150620698929
    ]
}