{
    "id": "mRWe5Kv745Y",
    "title": "This Robot is SO fun! New DJI Robomaster S1",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-06-12T04:07:56Z",
    "video_url": "https://www.youtube.com/watch?v=mRWe5Kv745Y",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "dji",
        "robomaster"
    ],
    "views": 581274,
    "likes": 14449,
    "comments_count": 977,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- I can't believe it either. - [Vintage Voiceover] Well, I have a wonderful electronic invention I want you to see. It looks something like this. (warp sound) - This probably isn't what you thought DJI was going to be launching next, did you? 'Cause I sure didn't but I'm so glad they did. They're calling this an educational robot. This is the DJI RoboMaster S1. Since 2015, China has been having this competition. It's called the RoboMaster Competition and I had not heard of this until DJI announced this. So this is kind of like a smaller consumer version of what they use in the competitions. I have no idea what I've gotten myself into with this unboxing because this is something that is programmable. You also have to put it together, so this thing comes in a bunch of different pieces. What I love about it is they're calling it an educational robot so this isn't something that just comes in the box already put together. This is something that you put together, that you learn how it works and using Scratch and Python you can program it. You can write programs on your computer, on mobile tablets, on Android, on iOS and you can share them instantly with your friends or maybe even your not friends because this thing is made for competitions. So after this unboxing, I'm going to put this together and then I'm going to go meet up with some friends who also have one. Hmm, okay, this is substantial box. The box is actually not very heavy though which is kinda cool. Oh my gosh. It's all in pieces. So, here's our instructions and this is the one time that you will see me place these delicately off to the side because I think that's something I'm gonna need. So this looks like it's probably important. This is like a massive LEGO set. There's a lot of pieces. Look at this lovely, thoughtful little toolbox. That's... that's something. Oh my, this is gonna be really fun. If you guys are new here, one of the things that I love so much is, I love LEGO sets and I used to love the Technic sets too 'cause you could actually make things move and happen. I don't even think this is going to be that difficult to put together. Am I missing something? Oh, there's more. I should probably just timelapse myself putting this together 'cause I'm probably going to be here for awhile. Oh look, it's all together. Just kidding, this is the one that they sent that was already assembled and ready to go. It's crazy how steady this is. So it has the two-axis mechanical gimbal and using AI, it can identify other S1s, it can identify people. If you guys are fans of DJI and their drone line then you know that their technology and their software, they integrate so well together. There's also one other thing that's not out when it's launched. Don't roll off the table 'cause you're not on and you don't know your name yet. Controller. There's also these little water pellets. So these soak in water for about four hours and then they have like this little chamber that you put these in and then you load it into the S1. Here it is, it's like the size of a Nintendo Switch. Okay, I gotta start getting this thing together because I'm running out of time. How am I gonna have time to learn Python in six hours? We're about to start the installation. It is currently 9:34 pm, we start now. Think I might have to pick this up tomorrow 'cause I don't think I'm gonna get it done tonight 'cause I'm already tired. (upbeat electronic music) This took me way too long to do because I didn't follow the directions (giggle). Here's to following the directions a little bit more closely. Let's go. (upbeat electronic music) It's going well. I'm actually having a lot of fun doing this. I'm gonna stop now because I'm getting tired and I'm gonna finish the rest up tomorrow so I'll be right back little robot. Back for day two. We're finishing this up because tomorrow we're gonna be taking this out to a warehouse and I'm going to be playing with a bunch of my friends who also have this. Jenna is also here to help me, that's my sister, and I'm going to put the building instructions on my iPad. This is so hard to see, I had to get my glasses. 'Kinda elderly now (laughs), I can't see. (upbeat electronic music) - [Jenna] Show me what the screen... oooh. Oh! - [Justine] Wait, where are we at? We're over here. - [Jenna] It's going to take some getting used to. It has a personality. (upbeat electronic music) - This is so freaking cool. Oh, this is on slow (upbeat electronic music) (zapping noises) Now that it's unboxed and all assembled I met up with some friends that also have one of these and this is where it's going to be really fun. You can connect them all to one router and you can battle each other. So, let's battle. (upbeat electronic music) We're about to start our battle so let's meet our contestants. - My name is Faruk aka iPhonedo. Word comes from taekwondo, to break stuff. - Friendly breaking? - Friendly breakdancing. - (laughter) I'm Justine aka iJustine. This is my first time battling. That's all I've got. - Aldryn Estacio aka FlytPath and this is gonna be interesting. - I'm Jenna aka Jenna and I'm here for fun. Well switch away. (upbeat electronic music) - Three, two, one, let's go. No! (upbeat electronic music) Oh my gosh, who's hitting me? Am I hitting myself? - [Jenna] I've already got taken down - Who's behind the TV? Ohhh! You caught me, whoever is behind the TV. Oh, I got destroyed, I got destroyed. Oh, I just came back to life and I got destroyed, not cool. - (yelling and laughing) Oh (beep), sounded not good. - Oh no, I'm stuck, I'm stuck. - Shoot. - Arg. (upbeat electronic music) Oh, sorry. Not really. - [Everyone] Ohhhhh. - Whoa. - [Aldryn] Oh, I gotta hit everyone, seriously. Oh my god. - [Justine] This is incredible. - Holy cow, this is cool. Oh, no, no, no, no. - [Justine] Oh, I hit the TV. (upbeat electronic music) - (laughter) - I didn't see that. Definitely didn't see that. - Ohhhh. - Guys, I think mine maybe died. - That was incredible. - That was unbelievable. - Holy cow. - So, we planned on originally doing a battle mode but so much stuff is happening so we just kind of were going into like a free for all mode just kind of trying to eliminate each other. This was unlike anything I've ever experienced. - Wow - I'm sweating. - Oh my gosh. - That was intense. - It was educational, if I might say. - I learned a lot about myself. - Yeah, me too. (laughter) - Well, the best part about not having a score is we all won. - Yeah, except I got stuck in the ladder so I probably lost. (intense rock music) - There's a couple different modes. You can use the infrared beams or there's something else that you have already set up on yours. - Yeah, like you said, the infrared beam is a little light that comes out so you can kind of... has audio in there. But if not, you can actually activate the beads which are really cool. Takes about three to four hours to enlarge the beads. They come in these really small pellets. - And there's just a selection here that you switch from the infrared to the gel beads. - Yup. Then you just have to turn that blaster safety on and then you can now trigger the beads that come out. - [Justine] No way! (robot zaps and clicks) Oh (laughter). - Definitely one of my favorite features of this thing. (robot zaps and clicks) - We've done so many fun videos together but this one, by far, I mean, granted the flamethrower stuff was really fun, but this was so cool. - This is something else. - What's one of your favorite features? - The ability to program this because when you program this, it helps you with the artificial intelligence. - I saw you had yours programmed so it was actually tracking me as we were going and firing off the lasers at the same time. - Yes, yes, and I wasn't even touching the controller. - No, it was amazing. - So if you're capable of programming that way you have advantage. That's why it becomes more than just a regular game. - I think one of my favorite things though is we actually were able to bring it here and all play together. That was awesome. - By itself, yes it's a lot of fun, but with friends, it's completely something else. - It was so great, this was so much fun. Thanks so much for being in my video. - Thank you so much for having me. - Thank you guys so much for watching. Make sure you go check out all of our channels. I will put links in the description and let's do this again soon. - We should. We gotta. - So great. - We have to, this is not over. - They'll be more. We'll see you guys later. (intense rock music)",
    "transcript_keywords": [
        "put",
        "fun",
        "DJI",
        "kind",
        "friends",
        "cool",
        "thing",
        "time",
        "guys",
        "love",
        "things",
        "start",
        "lot",
        "aka",
        "battle",
        "beads",
        "Jenna",
        "DJI RoboMaster",
        "program",
        "educational"
    ],
    "transcript_entity_values": [
        "Faruk aka iPhonedo",
        "9:34 pm",
        "DJI",
        "one",
        "iPad",
        "iJustine",
        "S1",
        "the RoboMaster Competition",
        "about three to four hours",
        "Justine",
        "tonight",
        "S1s",
        "2015",
        "LEGO",
        "Aldryn Estacio",
        "the infrared beam",
        "six hours",
        "Justine] Wait",
        "Nintendo Switch",
        "China",
        "two",
        "Three",
        "about four hours",
        "AI",
        "FlytPath",
        "Android",
        "Python",
        "Technic",
        "first",
        "tomorrow",
        "day two",
        "Jenna"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "TIME",
        "LANGUAGE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "NORP",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.037600405514240265,
        -0.07407139986753464,
        -0.05162749066948891,
        -0.15972626209259033,
        -0.003833826631307602,
        0.0038473480381071568,
        0.048600587993860245,
        0.007895350456237793,
        -0.038669075816869736,
        0.06142242252826691,
        0.031959883868694305,
        0.0005357498303055763,
        0.0065679089166224,
        -0.01266575325280428,
        -0.008192666806280613,
        0.04740452766418457,
        0.033393315970897675,
        0.02484055981040001,
        0.00035298432339914143,
        0.03652769699692726,
        -0.01578332856297493,
        -0.04783283919095993,
        0.047413986176252365,
        -0.010008588433265686,
        -0.05326901003718376,
        0.08236607164144516,
        0.016541024670004845,
        0.029622305184602737,
        -0.08909078687429428,
        -0.10408677905797958,
        -0.007768220268189907,
        0.031180160120129585,
        0.07886636257171631,
        -0.02943151630461216,
        0.02879878133535385,
        0.00042434889473952353,
        0.02027132920920849,
        0.0008513953071087599,
        -0.024614768102765083,
        -0.018737373873591423,
        0.017914243042469025,
        -0.032637931406497955,
        0.052787840366363525,
        -0.05708741024136543,
        -0.06432478874921799,
        -0.05895741283893585,
        -0.012042010203003883,
        -0.08539387583732605,
        0.1112092137336731,
        0.053560130298137665,
        -0.108445905148983,
        -0.04235200583934784,
        0.08086136728525162,
        0.009625892154872417,
        -0.08200957626104355,
        0.01972237601876259,
        -0.07500598579645157,
        0.01645602658390999,
        0.04392227903008461,
        -0.11019749939441681,
        0.025897471234202385,
        -0.016982171684503555,
        0.020075498148798943,
        0.03322507068514824,
        -0.03436146676540375,
        -0.07351185381412506,
        -0.025575269013643265,
        -0.03866403177380562,
        0.0029483542311936617,
        0.024517640471458435,
        -0.10483439266681671,
        0.0506993867456913,
        -0.026122242212295532,
        0.02622154727578163,
        -0.03264536336064339,
        0.04282122105360031,
        0.061023563146591187,
        -0.0687260702252388,
        -0.017741195857524872,
        0.06575007736682892,
        0.02920418046414852,
        -0.05313970521092415,
        -0.07747022807598114,
        -0.021895987913012505,
        -0.018890785053372383,
        0.051655203104019165,
        0.026888538151979446,
        0.029521388933062553,
        -0.008163012564182281,
        -0.03808959200978279,
        -0.05377274751663208,
        0.004542545415461063,
        -0.031067736446857452,
        -0.04364655911922455,
        -0.02170921303331852,
        -0.059917155653238297,
        -0.025372406467795372,
        -0.057968396693468094,
        -0.0363231897354126,
        0.08393357694149017,
        0.04248502850532532,
        -0.08065835386514664,
        0.012805755250155926,
        -0.05762191116809845,
        -0.04643429443240166,
        -0.08785109221935272,
        -0.032293789088726044,
        0.004120664671063423,
        0.03382386267185211,
        0.011059108190238476,
        -0.05547687038779259,
        -0.010972759686410427,
        -0.0289766788482666,
        -0.0549679733812809,
        0.032589204609394073,
        0.09470897912979126,
        -0.04376691207289696,
        0.10542763024568558,
        0.01821592077612877,
        0.01126375887542963,
        0.026536786928772926,
        -0.1096045970916748,
        -0.00910686980932951,
        0.05530208349227905,
        0.0584387481212616,
        0.021329857409000397,
        -0.07023881375789642,
        1.2154967909227546e-32,
        0.010771910659968853,
        0.07735512405633926,
        0.03629857301712036,
        0.06067753583192825,
        0.003378467634320259,
        -0.02346765622496605,
        -0.006411761045455933,
        0.0939725935459137,
        -0.047096796333789825,
        0.024513015523552895,
        -0.011740056797862053,
        0.027463123202323914,
        -0.07565755397081375,
        0.048843998461961746,
        0.027169853448867798,
        -0.052071597427129745,
        0.014271540567278862,
        -0.05710378289222717,
        -0.07573214173316956,
        0.016402700915932655,
        0.027718540281057358,
        0.00531389145180583,
        0.018114827573299408,
        0.0950540229678154,
        0.09870924055576324,
        0.06306339800357819,
        0.050242748111486435,
        -0.011250568553805351,
        0.0870172306895256,
        0.006369452923536301,
        -0.06788589805364609,
        -0.025121474638581276,
        -0.062360405921936035,
        -0.04833924397826195,
        -0.021809043362736702,
        0.014876235276460648,
        -0.08157360553741455,
        -0.02214755304157734,
        -0.05478580668568611,
        -0.04376714676618576,
        -0.006499549839645624,
        0.0002898691163863987,
        -0.045413173735141754,
        -0.06372372806072235,
        0.04057927429676056,
        0.00038703891914337873,
        0.0394156277179718,
        0.056769248098134995,
        0.0024949335493147373,
        -0.009844377636909485,
        -0.023291002959012985,
        0.01587294600903988,
        -0.05708956718444824,
        0.017512958496809006,
        -0.020285358652472496,
        -0.09755917638540268,
        -0.013854223303496838,
        0.04727068170905113,
        0.026748212054371834,
        0.05422215908765793,
        0.02109580859541893,
        0.009405475109815598,
        0.0007119073416106403,
        -0.010544728487730026,
        -0.04915909096598625,
        0.08561158180236816,
        0.08742097020149231,
        -0.025114521384239197,
        0.10928822308778763,
        0.05601327866315842,
        -0.004031108692288399,
        -0.007033663336187601,
        0.04948337376117706,
        0.014118833467364311,
        0.050905123353004456,
        0.05814271420240402,
        -0.09086243808269501,
        -0.07726583629846573,
        0.030535580590367317,
        -0.001649580430239439,
        -0.09820296615362167,
        0.08745436370372772,
        -0.034240201115608215,
        0.0932336077094078,
        0.0022130245342850685,
        -0.039487313479185104,
        0.01352963037788868,
        -0.04558141902089119,
        -0.044476643204689026,
        0.00515100359916687,
        -0.03158580884337425,
        0.03098173812031746,
        -0.10565400123596191,
        -0.01222904957830906,
        -0.044000294059515,
        -1.2532527143820064e-32,
        0.018804969266057014,
        0.02276197448372841,
        0.033217962831258774,
        -0.006491326726973057,
        0.03273450583219528,
        -0.029065130278468132,
        0.015900369733572006,
        0.08375602215528488,
        0.06000203639268875,
        -0.04207390546798706,
        0.015825709328055382,
        -0.05828988924622536,
        -0.08416923880577087,
        -0.0006139380857348442,
        0.010313255712389946,
        -0.013029156252741814,
        -0.04210997372865677,
        -0.04559265449643135,
        0.04159018397331238,
        -0.033210404217243195,
        0.06430560350418091,
        0.15622733533382416,
        0.0675962045788765,
        0.020346786826848984,
        0.023150956258177757,
        -0.006411132402718067,
        0.021037548780441284,
        0.06523678451776505,
        0.04195466637611389,
        0.04359809309244156,
        -0.041362252086400986,
        -0.03300958871841431,
        -0.05516831576824188,
        -0.0017259533051401377,
        0.0488482341170311,
        0.043796710669994354,
        -0.0162306260317564,
        0.03910670801997185,
        0.023409845307469368,
        -0.05360940843820572,
        0.034833379089832306,
        -0.012086045928299427,
        0.01353011466562748,
        0.014270253479480743,
        0.008197440765798092,
        -0.1470385491847992,
        -0.06102992966771126,
        0.0351107120513916,
        -0.003898005932569504,
        0.021881066262722015,
        -0.08562902361154556,
        -0.03664712607860565,
        -0.0086561543866992,
        -0.057611480355262756,
        0.017848368734121323,
        -0.0003661361406557262,
        -0.05834926664829254,
        -0.008397901430726051,
        0.03646215796470642,
        0.02624061517417431,
        0.008138122968375683,
        -0.056711193174123764,
        -0.06412629783153534,
        -0.02341424860060215,
        -0.02629501186311245,
        -0.045919112861156464,
        0.0889573022723198,
        0.025125091895461082,
        -0.004381106700748205,
        0.000473734486149624,
        0.056327883154153824,
        0.06077701225876808,
        0.045647211372852325,
        0.04933520033955574,
        0.0560879148542881,
        -0.0014806130202487111,
        -0.07552266120910645,
        0.011880597099661827,
        0.09744816273450851,
        -0.042044155299663544,
        -0.06418506801128387,
        -0.010499534197151661,
        0.018536092713475227,
        0.07900148630142212,
        0.06972869485616684,
        0.12445221096277237,
        0.07510972768068314,
        -0.0333222821354866,
        -0.01595439203083515,
        0.06264499574899673,
        0.06650763750076294,
        0.07439623773097992,
        0.08864157646894455,
        0.09060604870319366,
        -0.13992345333099365,
        -5.962302651596474e-08,
        0.045095350593328476,
        0.023444561287760735,
        -0.015397705137729645,
        -0.0093229990452528,
        0.02547290362417698,
        -0.046808380633592606,
        -0.01877150684595108,
        -0.005155876744538546,
        0.024016978219151497,
        -0.0524633564054966,
        0.11326943337917328,
        -0.013778803870081902,
        0.017510350793600082,
        0.09958617389202118,
        0.02608773671090603,
        0.036136116832494736,
        -0.05238454043865204,
        0.0879509374499321,
        -0.037646081298589706,
        -0.05040952190756798,
        -0.03389452397823334,
        0.033467695116996765,
        0.029767580330371857,
        -0.002137694973498583,
        0.012202156707644463,
        -0.004303468856960535,
        -0.05443393066525459,
        -0.021620003506541252,
        0.009579352103173733,
        0.008269669488072395,
        -0.04885876923799515,
        -0.009487292729318142,
        0.022333674132823944,
        0.011825752444565296,
        -0.04263284429907799,
        -0.04756991192698479,
        -0.09370682388544083,
        -0.040236469358205795,
        0.0027311034500598907,
        0.012074305675923824,
        0.02939293533563614,
        -0.1047484427690506,
        -0.04285392537713051,
        -0.010048804804682732,
        -0.030089212581515312,
        -0.050061244517564774,
        0.012839267030358315,
        -0.1300935447216034,
        -0.05793321505188942,
        -0.06565076112747192,
        -0.05168677866458893,
        0.03897494450211525,
        0.025518739596009254,
        -0.0004969167639501393,
        0.09905333817005157,
        0.008508962579071522,
        0.04416611045598984,
        0.020397843793034554,
        -0.01586749404668808,
        -0.011369534768164158,
        0.014587357640266418,
        0.03358414024114609,
        -0.07479498535394669,
        0.015957485884428024
    ]
}