{
    "id": "mtz-6CZIV6o",
    "title": "Root Android (Kali Linux NetHunter install)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-04-09T14:00:35Z",
    "video_url": "https://www.youtube.com/watch?v=mtz-6CZIV6o",
    "category": "People & Blogs",
    "tags": [
        "android",
        "kali linux",
        "nethunter",
        "kalilinx nethunter",
        "root",
        "rooted",
        "android root",
        "android rooted",
        "hack android",
        "kali linux nethunter",
        "kali linux nethunter android wifi hack",
        "kali linux nethunter android",
        "kali linux net installer",
        "install kali linux on android",
        "kali linux on android",
        "nethunter rootless",
        "kali linux android",
        "how to install nethunter",
        "kali linux install",
        "hwo to install nethunter",
        "nethunter install android",
        "kali linux on android mobile",
        "wifi",
        "wifi hack"
    ],
    "views": 568428,
    "likes": 11724,
    "comments_count": 994,
    "description": "Get the full power of Kali Linux NetHunter by rooting your Android Phone. In this video I'll show you to root your phone so you can install Kali Linux and hack WiFi networks.  Disclaimer: This video is for educational purposes only. You root your device at your own risk. Do not attempt to root your device without understanding what you are doing. Rooting a device may void the warranty on the device and may result in the device not functioning correctly. You could also brick the device.  // Instructions // PDF instructions:  NetHunter Rooted Install:  NetHunter Rootless Video:   There are different versions of Kali NetHunter: NetHunter Rootless, NetHunter Lite and NetHunter. If you want to attack wifi networks (WiFi Injection) or use HID attacks, you need to use Kali NetHunter and that means that you need a rooted phone.   Documentation:   // MENU // 00:00 - Coming up 00:21 - Intro and disclaimer 00:27 - Kali Nethunter for mobile // Rooting an Android phone 03:23 - Download PDF tutorial 03:41 - Requirements 04:10 - SDK Platform-Tools 04:42 - Unlock Bootloader & Installing drivers 09:45 - Rebooting and setting up the phone 10:46 - Downloading the correct software 12:18 - Downloading payload-dumper-go from Github 14:30 - Installing Magisk 16:40 - Phone is now rooted! 17:14 - Conclusion  // David SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // MY STUFF //   android kali linux nethunter wifi termux kali linux nethunter android rooted root android  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #wifi #android #kalilinux",
    "description_links": [
        "https://davidbombal.wiki/rootandroid1",
        "https://youtu.be/wGCmiEnW4ms",
        "https://youtu.be/KxOGyuGq0Ts",
        "https://www.kali.org/docs/nethunter/",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- Here I've got an Android phone. But if I selected the Root Checker app, I can verify that this phone has been rooted. In this video, I'm gonna show you how to root an Android phone in preparation for the installation of software such as Kali NetHunter. You need to root your phone if you want to use the full power of Kali NetHunter, for example, to attack wifi networks. (electronic sounds) Kali can run on many types of devices. You could run it within a virtual machine. You could dual boot your computer. But in this example, we're gonna use a mobile device. We're going to use NetHunter, but there are two versions of NetHunter. We've got NetHunter Pro, which you would use on a PinePhone. I'll demonstrate that in a separate video. In this video, we're going to look at rooting the Android phone in preparation for installing NetHunter. Various phones are supported. So you could use a Nexus phone as an example, and Nokia, various other phones. But the phone that we are using for this demonstration is a OnePlus Seven T. So on this device, I'll go to Settings, About Phone. You can see that it's a OnePlus Seven T. In this case, we're using Android 11. And this specific bold number. Now in this example, I'm not gonna upgrade the phone to a later release of Android. The reason for doing that is I want to get official drivers for the phone. I don't wanna install some kind of dodgy software. On the OnePlus website. For the OnePlus Seven T. The latest software that I can download is 11.0.9.1.HD65BA. And that's the version of software running on this phone. If I look at System, there is an upgrade to the software. So I could install Oxygen OS12. But in my tests that didn't work. So I'm not gonna do that. I'm gonna stay with this release of Android 11 per this download. Now you can use the timestamps to jump to a specific part of this video. I wanna talk about the reasons that I'm using this phone. I want to talk about Kali NetHunter, the different types of Kali NetHunter that you have. Again, use the timestamps if you're only interested in certain parts of the video. Now there are different additions of Kali NetHunter. You have a Rootless install. Have a look at this video if you wanna see how to install Kali NetHunter using a rootless installation. That's the simplest installation of all. There's also NetHunter Lite, which is a full Nethunter package for rooted phones without a custom kernel. And then you have the full NetHunter package with custom kernel for supported devices. To be honest, if you want the power of NetHunter, you need to use a rooted device. As an example, if you want to use WiFi injection, you need a rooted device running NetHunter. If you wanna run HID attacks, you need to use NetHunter, not NetHunter Lite or NetHunter Rootless. So again, what I'm gonna show you in this video is how to root the device in preparation for the NetHunter installation. I'll do the actual NetHunter installation in a separate video. In this video I just wanna show you how to root this device. OnePlus devices are my recommended device if you wanna learn how to root an Android phone. There are instructions out there on how to root other devices. Please let me know in the comments below if there are any other devices that you want me to demonstrate. I will be covering additional devices. But in this example, we're doing a NetHunter installation for the OnePlus Seven T, version 11. So that's the NetHunter software that I'm going to want to download. But before I even get to that, there are various steps that you need to complete. And to make this easier for you, my team and I have created a PowerPoint presentation. So download the PDF below if you want to have written instructions, rather than just follow the video. As always, do not use the information that I'm showing you here for illegal activities. It's only for educational purposes. What you need to do, this is a Windows 10 or 11 computer. Now you can use other operating systems. But because most people use Windows, I'm gonna be demonstrating this with a Windows computer. If you want to install Kali NetHunter, you need a virtual machine as an example running Kali Linux, so that you can compile the Kali NetHunter kernel. Again, I'll show you that in a separate video. You also need a USB-C data cable, and obviously you need a phone. So in this example, the OnePlus Seven T. Okay, so as mentioned, we're not gonna upgrade the phone to Android 12. We're gonna use Android 11. Next step is we need to download the platform tools. So we go to developer Android.com, studio releases, Platform Tools, and in this example, I'm gonna download the SDK Platform Tools for Windows. You have to agree to the license and make sure that you read that. Agree to the license and then download the platform tools. I'm gonna save that to my desktop and what I'll do is extract that software. So I've now got the software extracted. What we now need to do is unlock the bootloader on the phone. So I'm gonna go to Settings once again on the phone. I'm gonna scroll down to About Phone. And I'm gonna tap the bold number seven times. And what we're told now is we've become a developer. We need developer mode because what we want to do is go to System Settings, Developer Options. And what we want to do is enable OEM unlocking. And we want to enable USB debugging. And you need to accept those two options. So again, we need both OEM unlocking, as well as USB debugging enabled. Okay, so the next step is we need to install drivers, so that if we brick the phone, we can un-brick it. Some people struggle with this. What you have to do is hold the up and down volume button and power button at the same time. So you might see the volume go up or something else happen, but basically you just need to hold it and the phone will reset and we'll go into faster boot mode. If you have a problem, make sure up and down volume button held at the same time as the power button. Keep holding it until it goes into Fastboot mode. Okay, so back on Windows, we're going to go the Windows update. We're gonna make sure that we check for updates. Go to Advanced Options, Optional Updates. And what you wanna see is Google Inc., Other hardware, Android BootLoader Interface. If you don't see that, make sure that you press those three buttons again. Volume up and down, power button. Make sure that you see the Fastboot mode. Go back into Windows. Click Check for Updates, Advanced Options, Optional Updates. And we want to see the software. Okay, so what we need to do is select the Google Inc., Other Hardware, Android Bootloader Interface and click Download and Install and install that software. We want that once again, in case we brick the phone and we need to un-brick it. Okay, so if I check for updates now, software's up to date. Now I've had problems if I don't do this. So the next step is to restart Windows. (gentle dinging) Okay, we need to make sure that the phone is plugged back into the Windows computer. What I'll do is press the power button to start the phone again. Okay, phone has rebooted. I'm gonna allow USB debugging. In the Platform Tools, I'm gonna open up a terminal. LS shows us the software. I'm gonna use the command adb devices to see if devices are attached. You can see if this device is attached. You may see that it says, \"Service is starting,\" and you might have to run this again. You may have to unplug the phone and plug it back in again. You basically need to have a device attached. Okay, we need to boot into EDL mode. So we're gonna use the command, adb, reboot, edl. Phone reboots now. So if you don't see that, make sure that the device is attached. Reboot your Windows computer if necessary. Type the right commands to get the phone rebooted. Okay, we're going to run the Windows update software again. So Check for Updates, Advanced Options, Optional Updates. And what you should see now is that the drivers are displayed. Again, we need this in case we need to un-brick the phone. So I'm gonna download and install that. Okay, Check for Updates, Advanced Options, nothing available now, because we've installed the right drivers. And again, at this point, you may have to reboot Windows. I've had problems with Windows if I don't reboot it. Okay, so the next thing I need to do is hold the up and down volume and power button at the same time to get it to reboot. We wanna boot into Fastboot Mode. Okay, so there you go. You might just have to hold it. Takes time, okay? And once that boots, then you press the power button to get it to boot up. Phone is now rebooting. The phone may prompt you to allow USB debugging. So if you've asked that, then make sure that you permit it. Okay, in the Platform Tools directory, once again, I'm gonna open up a terminal. LS shows us our software. I'm gonna use the command ADB devices to see if the device is connected. Okay, I'm gonna need to allow USB debugging. You can see that it says device unauthorized because I had to allow USB debugging. Now it's showing as a device because I allowed USB debugging. Okay, now we're gonna use adb reboot bootloader. Phone reboots as you can see over there. And we should see this on the screen. Make sure that you see something like this, where we see Start as an example at the top. And now we can use the command fastboot devices. So you can see the device is shown as fastboot and then we're gonna use fastboot OEM unlock. You should see it says okay, finished in a certain amount of time. And now we're going to use the volume button to move down to unlock the phone. So we're gonna unlock the bootloader and then we're gonna press the power to reboot the phone. Now this wipes the phone, may take it a while. Wait until you see a Hello message. It's important that you don't set up any face or fingerprint or screen lock once the phone restarts. But you can set up the phone normally with that caveat or caution. Okay, so there you go. The phone has rebooted, Hello's displayed. I can press start to get started. Agree to the license agreement. In this case I'll skip connecting to a mobile network. But what I'll do is connect to a WiFi network. I'm not gonna copy apps. Okay, I need to log in with my Google account. Click I Agree. Okay, I'm not gonna enable all the services, click Accept. Okay, so I'm not gonna enable the assistance, so I'm gonna do that later. I'll skip Google Play, I'll accept Co-Creation Labs. I'll skip the screen lock. Click Next. Click Next. Click Start. Do the home screen thing like normal and press Start. Okay, so now I've set up the phone as normal. I didn't set up fingerprint or face ID. Didn't put a pin on the phone. Next thing I need to do is get the model information once again. I'll go to About, Android version is 11. This is the bold number. That's really important because I need to download the right version of software. So in this example, this phone is a 1903 phone. HD 1903. That's because it's a European phone. So I'm gonna download the software from this link. If you've got a Chinese phone as an example, you use this link. If you've got an Indian phone, you'll use this link. US Global is this link. And then if it's T-mobile US, you have to go to the XDA forums 'cause you're gonna have to change that phone to a global US phone. So in my example, this is the version of software that I'm running. Phone that I've got is a Seven T. So the version that I want for my example is this 11.0.9.1.HD65BA. Make sure that you use the right software that it matches your phone. As mentioned previously, I don't wanna upgrade this, because this is the only version available. So I'm going to download that software to my computer. Okay, software is downloaded, it's 2.6 gig in size. What I'm gonna do is extract the file. (fast-forwarding sounds) And there you go. The file is extracted. Notice we've got a payload.bin file. What I'm actually gonna do with this file is copy it to the Platform Tools folder that we've been using previously. It's easier for me just to put all the files in one place. So the payload.bin file has now been copied to that directory. So next step is to go to GitHub and download the payload-dumper tool. So I'm gonna click on the link in the PowerPoint slide. I'm gonna go to latest and I'm gonna download the dumper tool for Windows AMD 64 because that's the operating system that I'm using and I can't open this. So I'm gonna download Seven-Zip. So download the executable and I'll run that software, install it so I can right click on that tar.gz file. I'm gonna show more options here. Seven-Zip extract the files. That is now extracted. But it's a tar file here, so I'm gonna have to show more options. Seven-Zip extract that file. So now I've got the go-dumper tool. And what I'm gonna do to make it easier is I'm gonna copy that file into my Platform Tools directory. Okay, so LS in my directory. I'm gonna use the command payload-dumper. Path to firmware, which I've put in that directory. So it's payload bin. And notice the files are being extracted. The file we actually want is the boot image file. Okay, so under extracted now, there's our boot image. So I'm gonna copy that and I'm gonna put it in Platform Tools so that I've got all the files in one directory. You don't have to do it that way. I just prefer having the files in one directory. So back on the phone, go to Settings. We're gonna go to About Phone, and then we are going to select Software Version or bold number, depends on your phone. But actually, I'm gonna do bold number and I am now a developer. Under System Developer options, I'm gonna enable USB debugging. Allow that. So I'll clear the screen here. And now I can use adb push boot image. And make sure that you get the spelling correct. So it's sdcard, lowercase. Download with an uppercase D, and it's Download, not Downloads. So we're gonna push that software to the phone and you can see that the software has now been pushed. Okay, so on the phone, once again, open up a browser and I'm gonna search for Magisk on GitHub. First hit is my GitHub link. So you can see Magisk here. I'm gonna scroll down to the latest release, which is 25.2. I'm gonna download the first file, which is the APK file. I'm gonna click Okay to install it, click Open, Settings. Allow that to be installed, go back, install the software, press to open it. So Magisk is now installed. I'm gonna select Install, select a patch file, go to File Manager, go to Download, select Boot Image. Select Let's Go. Software is now being installed. Okay, so that's been completed. Now all done, go back. Go to File Manager. Say Okay, go to Downloads. Make sure that you take a note of the name of the file because now back on Windows, we're gonna pull that file. So in Windows adb, pull, sdcard, Download, Magisk, patch 25200. And press Enter. Okay, so you can see that so many bytes were copied in so many seconds, so that's good. So I'll just do a sanity check here. I'm gonna do LS and make sure that Magisk is shown. And you can see here that that file is in my directory on my computer. So I'm gonna do adb reboot bootloader to reboot the phone. As you can see there, the phone is rebooted. Now we're gonna do fastboot flash boot, Magisk patched file. So that's the file that we copied to our Windows computer previously. And I'm gonna press Enter. That's been sent to the phone. And you can see that it's now finished. Now we need to make sure that we're on Start as we can see there. And then press the power button. Phone will reboot now. Okay, phone is now rooted. I'm gonna allow USB debugging. Under my apps, I can see Magisk. So Magisk is installed. So on Magisk, once again, as you can see now, Magisk is installed. So in the Play Store, I'm now gonna search for Root Checker to check that the phone is actually rooted. It is rooted at this point, but I'm gonna install this app to verify that is the case. So I'm gonna open up the software. Say Agree. And I'm gonna verify Root Grant access. And as you can see there, the phone has been rooted. Okay, congratulations, phone has now been rooted. I'll put a link below to the next video, where I'll show you how to install Kali NetHunter on a rooted phone such as this.",
    "transcript_keywords": [
        "phone",
        "Kali NetHunter",
        "Windows",
        "NetHunter",
        "software",
        "Android phone",
        "platform tools",
        "download",
        "install Kali NetHunter",
        "file",
        "Android",
        "Kali",
        "USB debugging",
        "device",
        "install",
        "make",
        "Magisk",
        "USB",
        "platform",
        "tools"
    ],
    "transcript_entity_values": [
        "first",
        "three",
        "USB",
        "Windows AMD 64",
        "OnePlus",
        "Android",
        "European",
        "Magisk",
        "Root Checker",
        "Oxygen",
        "seven",
        "Co-Creation Labs",
        "Kali NetHunter",
        "Download",
        "Updates",
        "NetHunter Lite",
        "Seven",
        "two",
        "PinePhone",
        "Advanced Options, Optional Updates",
        "Seven-Zip",
        "25200",
        "Windows",
        "Nokia",
        "Updates",
        "Advanced Options",
        "Android BootLoader Interface",
        "Android 11",
        "Rootless",
        "Google",
        "Downloads",
        "so many seconds",
        "Windows",
        "Kali",
        "Open, Settings",
        "Download",
        "the Play Store",
        "NetHunter",
        "edl",
        "11.0.9.1.HD65BA",
        "Android.com",
        "one",
        "PowerPoint",
        "NetHunter Pro",
        "Chinese",
        "Indian",
        "2.6",
        "Magisk",
        "Platform Tools",
        "11",
        "Google Inc.",
        "un",
        "US Global",
        "Android 12",
        "Nethunter",
        "Fastboot Mode",
        "GitHub",
        "System Settings, Developer Options",
        "the Google Inc.",
        "25.2",
        "NetHunter Lite",
        "Google Play",
        "NetHunter Rootless",
        "Kali Linux",
        "Boot Image",
        "Nexus",
        "1903",
        "LS",
        "Windows",
        "First",
        "Other Hardware",
        "Platform Tools",
        "EDL",
        "US",
        "OnePlus Seven T",
        "the Root Checker"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "NORP",
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.04594217240810394,
        0.006888990756124258,
        0.015842128545045853,
        -0.019893255084753036,
        0.01770073175430298,
        -0.05518703535199165,
        -0.029081620275974274,
        -0.011690789833664894,
        -0.04125062748789787,
        0.0381758026778698,
        0.07722101360559464,
        -0.011540594510734081,
        0.03451124578714371,
        0.04210136830806732,
        0.015750490128993988,
        -0.006340512074530125,
        0.013485495001077652,
        0.027667149901390076,
        0.0181121863424778,
        -0.027576085180044174,
        0.01675201952457428,
        0.012026000767946243,
        0.02098025009036064,
        -0.10104452818632126,
        0.0027398590464144945,
        -0.08383706957101822,
        0.02578611485660076,
        -0.018861744552850723,
        -0.015888428315520287,
        -0.010192487388849258,
        -0.017779618501663208,
        0.018685558810830116,
        -0.004043993074446917,
        0.0341225303709507,
        -0.0509149543941021,
        -0.09203411638736725,
        -0.04817460849881172,
        0.0947624146938324,
        -0.04833418130874634,
        -0.013072121888399124,
        -0.030479425564408302,
        -0.06778141856193542,
        0.009028575383126736,
        0.037225037813186646,
        0.015291503630578518,
        -0.06022629886865616,
        -0.053451940417289734,
        0.01354958675801754,
        0.05301956459879875,
        -0.10112310945987701,
        0.015627829357981682,
        0.041240256279706955,
        0.008679056540131569,
        0.0028540550265461206,
        -0.04182932525873184,
        -0.04763644561171532,
        -0.007876447401940823,
        0.0674532875418663,
        0.09803647547960281,
        0.000796473235823214,
        0.09209208935499191,
        0.06668918579816818,
        -0.04960270971059799,
        0.032667845487594604,
        -0.025697361677885056,
        0.006731764413416386,
        0.07722461223602295,
        -0.001010584644973278,
        0.0092401634901762,
        0.00151154980994761,
        -0.025279704481363297,
        0.016036422923207283,
        0.06937847286462784,
        -0.029474811628460884,
        0.00891193374991417,
        0.05588563531637192,
        -0.016911717131733894,
        0.00533756660297513,
        -0.026692796498537064,
        0.06642509996891022,
        0.039750538766384125,
        0.04492277279496193,
        0.024498198181390762,
        0.032271597534418106,
        0.011074541136622429,
        0.03339191898703575,
        -0.03844861686229706,
        0.048449184745550156,
        0.030556032434105873,
        -0.023708948865532875,
        -0.02066889964044094,
        0.05885646864771843,
        -0.05892321467399597,
        0.0076837544329464436,
        0.016786852851510048,
        0.007840048521757126,
        -0.0709296315908432,
        0.025048835203051567,
        -0.1315980702638626,
        0.07091488689184189,
        -0.07504168897867203,
        -0.03976377472281456,
        -0.057278670370578766,
        -0.0397099107503891,
        -0.025049924850463867,
        -0.031975094228982925,
        -0.017616325989365578,
        -0.022928116843104362,
        0.015401814132928848,
        -0.010944835841655731,
        -0.008703709580004215,
        -0.009770793840289116,
        -0.07998479902744293,
        -0.04930052161216736,
        0.07340507209300995,
        -0.0037816918920725584,
        0.03726675361394882,
        0.04350978136062622,
        0.040468841791152954,
        0.06256742030382156,
        0.003178816055878997,
        -0.013898811303079128,
        -0.03555659204721451,
        -0.07941249012947083,
        0.023673275485634804,
        0.03537123277783394,
        0.017201077193021774,
        2.4010779853010512e-33,
        0.09755495190620422,
        0.0888676643371582,
        -0.05044223368167877,
        -0.0301875751465559,
        0.030307495966553688,
        -0.050877645611763,
        0.011536085978150368,
        -0.05615712329745293,
        -0.10092440247535706,
        0.08938799053430557,
        0.02435019239783287,
        -0.031031237915158272,
        -0.07658800482749939,
        -0.027358222752809525,
        0.079219751060009,
        0.021774079650640488,
        0.03333817049860954,
        -0.061489902436733246,
        0.014587540179491043,
        0.03732353076338768,
        0.010648565366864204,
        -0.0818248838186264,
        -0.020527733489871025,
        -0.029653308913111687,
        0.08949197828769684,
        0.036423444747924805,
        -0.06158091872930527,
        -0.01894848421216011,
        0.03264021500945091,
        0.0069326660595834255,
        -0.033926643431186676,
        -0.026154272258281708,
        -0.015907568857073784,
        -0.0051173618994653225,
        -0.06249966472387314,
        -0.0504714734852314,
        -0.03395052254199982,
        -0.034991826862096786,
        0.028338545933365822,
        -0.11805815994739532,
        -0.025408972054719925,
        -0.05022655054926872,
        -0.016247427091002464,
        -0.02415858767926693,
        0.09431236982345581,
        -0.02940398082137108,
        -0.08369026333093643,
        0.027799805626273155,
        0.02371492050588131,
        0.03800369054079056,
        -0.010910693556070328,
        -0.02580125816166401,
        0.04695828631520271,
        0.006325995083898306,
        0.057878781110048294,
        0.06385783851146698,
        0.030104417353868484,
        0.012251644395291805,
        0.012073824182152748,
        0.02053327113389969,
        -0.03252510726451874,
        -0.07066799700260162,
        -0.018550820648670197,
        0.016503972932696342,
        -0.04310157522559166,
        -0.08682166785001755,
        -0.026384444907307625,
        -0.01287312712520361,
        -0.048670507967472076,
        0.01903875172138214,
        -0.08078078180551529,
        -0.07021340727806091,
        -0.014807567931711674,
        0.015465129166841507,
        -0.06386454403400421,
        0.04712909460067749,
        0.0868622288107872,
        0.04698890820145607,
        -0.11170677840709686,
        -0.003976494073867798,
        -0.011576792225241661,
        -0.053718432784080505,
        0.04522697627544403,
        0.01944725587964058,
        0.057313062250614166,
        -0.015978513285517693,
        -0.008813375607132912,
        -0.10956881940364838,
        0.0733741745352745,
        0.05391742289066315,
        -0.043324489146471024,
        0.09205123782157898,
        -0.011099785566329956,
        0.020983584225177765,
        -0.0016538476338610053,
        -4.217146227660436e-33,
        -0.04286941513419151,
        0.008723338134586811,
        -0.009166797623038292,
        -0.06618713587522507,
        -0.0013137514470145106,
        -0.061165325343608856,
        -0.048891887068748474,
        -0.047730810940265656,
        0.00937732495367527,
        -0.013323348946869373,
        -0.053058136254549026,
        0.012148345820605755,
        0.07433939725160599,
        -0.0796818733215332,
        -0.010775809176266193,
        -0.04623296111822128,
        0.05632581561803818,
        -0.020225390791893005,
        -0.02456226572394371,
        -0.0022513377480208874,
        -0.06567464023828506,
        0.19369783997535706,
        0.051067497581243515,
        -0.03502930700778961,
        0.0010863953502848744,
        -0.040572043508291245,
        0.06153896078467369,
        0.18637117743492126,
        -0.03971649706363678,
        0.048399318009614944,
        0.04331335425376892,
        -0.04644854739308357,
        0.08220592141151428,
        0.02076982706785202,
        0.027826931327581406,
        0.032599903643131256,
        0.09055488556623459,
        -0.03663606569170952,
        0.01595412567257881,
        -0.02585085853934288,
        0.06786593794822693,
        0.024740315973758698,
        -0.022874509915709496,
        -0.05229199305176735,
        0.010471559129655361,
        -0.06426061689853668,
        0.09967345744371414,
        -0.0013653552159667015,
        -0.03150087222456932,
        -0.07039275765419006,
        0.11601939052343369,
        0.050219886004924774,
        0.00806850753724575,
        0.08493601530790329,
        -0.03562173992395401,
        0.053577881306409836,
        0.07533080130815506,
        -0.05240902304649353,
        0.10133660584688187,
        -0.01819753274321556,
        0.045751169323921204,
        -0.03774445876479149,
        -0.057076822966337204,
        0.019396798685193062,
        -0.04393188655376434,
        -0.02995404414832592,
        -0.009271403774619102,
        0.028949668630957603,
        -0.008531348779797554,
        0.018298638984560966,
        -0.11436451971530914,
        -0.016118809580802917,
        0.009509172290563583,
        0.09834478050470352,
        0.07537747919559479,
        0.0517173670232296,
        -0.06099594756960869,
        0.02186751738190651,
        -0.01649191789329052,
        -0.048715099692344666,
        0.017844995483756065,
        0.00020818454504478723,
        -0.045930758118629456,
        -0.05734517425298691,
        0.05681534484028816,
        -0.019666748121380806,
        0.004030261654406786,
        0.0217808298766613,
        0.05816233158111572,
        -0.03999527916312218,
        -0.10835522413253784,
        0.015556465834379196,
        -0.03847995772957802,
        0.060096245259046555,
        0.014719187282025814,
        -4.789710672525871e-08,
        0.10288890451192856,
        0.06504325568675995,
        0.018842807039618492,
        0.001426367904059589,
        0.057318314909935,
        0.002066354500129819,
        0.07804793119430542,
        -0.12399999797344208,
        0.03262265771627426,
        0.025904709473252296,
        -0.046184610575437546,
        0.02407672069966793,
        0.0009684751858003438,
        0.07058963924646378,
        0.07185542583465576,
        0.013767080381512642,
        -0.015446742996573448,
        -0.005874108988791704,
        -0.03985730931162834,
        0.03448830917477608,
        0.025572579354047775,
        -0.028903216123580933,
        -0.007728515658527613,
        0.017649974673986435,
        0.04216381907463074,
        -0.053770240396261215,
        0.05654066801071167,
        -0.02299756556749344,
        -0.022137867286801338,
        0.06597471982240677,
        -0.11749295145273209,
        0.028304612264037132,
        0.019870974123477936,
        -0.009818024933338165,
        -0.08175212889909744,
        0.12418383359909058,
        -0.031027616932988167,
        -0.026393286883831024,
        0.03466467931866646,
        -0.004820508416742086,
        -0.10967109352350235,
        -0.021835070103406906,
        0.034147754311561584,
        -0.013701948337256908,
        -0.1556260883808136,
        -0.0610312856733799,
        -0.0074890474788844585,
        -0.008779618889093399,
        0.0930674597620964,
        0.008094854652881622,
        0.07994170486927032,
        -0.010624757036566734,
        -0.05794638767838478,
        -0.08455482870340347,
        0.013340040110051632,
        0.011324159801006317,
        0.03889073431491852,
        -0.08335501700639725,
        0.013185505755245686,
        -0.014843975193798542,
        0.005587627645581961,
        -0.04104422405362129,
        0.01764623075723648,
        -0.031994644552469254
    ]
}