{
    "id": "MuEVSZYtDl4",
    "title": "This is the PS5 Controller...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-04-07T23:09:01Z",
    "video_url": "https://www.youtube.com/watch?v=MuEVSZYtDl4",
    "category": "Science & Technology",
    "tags": [
        "ps5",
        "dualsense",
        "playstation 5",
        "ps5 controller",
        "controller",
        "playstation 5 controller",
        "gaming",
        "tech",
        "reveal",
        "announcement",
        "xbox",
        "sony",
        "xbox series x",
        "series x",
        "dual sense",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans",
        "playstation"
    ],
    "views": 6209511,
    "likes": 120301,
    "comments_count": 27021,
    "description": "The PlayStation 5 DualSense controller for PS5 is...unique.  Gaming LIFE HACKS  Hands on with the Xbox Series X   More on the DualSense for PS5:   My new podcast The Test Drivers!  Our second channel This Is!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=Y80ZTbjtz5c",
        "https://youtu.be/7Fjn4GRw8qE",
        "https://blog.us.playstation.com/2020/04/07/introducing-dualsense-the-new-wireless-game-controller-for-playstation-5/",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today Sony surprise announced the brand new DualSense controller for the PS5, and it is, well it's different that's for sure. There are a ton of new futures so let's jump straight in. First of all is that DualSense name. The idea is that as opposed to focusing on the DualShock like we've had since the very beginning, instead the DualSense name is more so about a better haptic feedback experience. So part of that comes down to what is supposedly better haptic feedback inside the actual controller itself. So I'm gonna quote Sony as saying that it adds a, \"Powerful sensation like the slow grittiness of driving a car through mud.\" Which I'm not sure how that gives you a strong sensation, but yeah supposedly the actual haptic feedback motors have been significantly improved from the Dual Shock 4. However, that is only just the beginning of what makes this new PS5 controller so unique. I'm gonna find a lot of interesting ways to not call this thing ugly in this video. There are now adaptive triggers built in to the L2 and the R2 trigger buttons. Now this is something that the Xbox One has had, well since the Xbox One first came out. However, I'm gonna be very curious to see how Sony implements this with the DualShock 5. Where you actually get some vibrations, and the actual trigger say when you're playing Forza, and you brake too hard and your ABS locks or something like that. There have been many rumors, and if you've seen any of our coverage of the PS5 as well as the Series X, you'll know that the Series X has the lead right now. It is a more powerful console, and even in the best case scenario the PS5 is like 20% slower in many cases. But realistically, based on how much it throttles, it may be even more. So it does make sense to me, that Sony is focusing less on the actual raw pixels and the pure performance, and much more so on the experience of the PlayStation 5, and therefore the DualSense Controller can give you. Now if you take a look at the controller itself, you'll see it is very clear that they have changed not only the size, but the shape. So Sony talked a little bit about this in their blog post which of course I'll have linked in the description, but essentially, it seems to be a little bit of a sharper angle. They claim that this is done partially to fit a lot of these extra technologies such as all these different haptic feedback motors and everything, but just like with the Xbox Series X, I do believe that this is also a plan to just make these controllers more family-friendly; more friendly for all gamers of all sizes, of shapes, of hands. Sizes and shapes of hands. Sizes and shapes of hands. The quarantine is getting to me. Now based on whether or not you follow the PlayStation or the Xbox side of the camp, you may or may not be happy to see that the standard dual stick layout has returned. This is not really a surprise, of course the Xbox One has always had the offset sticks, which I personally prefer, but the DualShock has always had that and of course it comes over to the DualSense controller. Now, beyond that, they're also some interesting design decisions. So, look at this image. Take a close look at it. Do you see anything weird? It's, again I almost called it ugly. It's a unique two-tone white and black color finish. Now personally I'm not against trying something different, and as we'll talk a little bit about later, the Xbox Series X certainly does not push very far in that front. Meanwhile, I'm definitely not a huge fan of it in this sort of first impression. I feel like as we spend more time with it, it will probably start to grow on me. But it's, it's unique, and, side note, I feel like this give us a very good idea of what the actual PlayStation 5 will look like. This kind of design language, and certainly this two-tone color scheme seems like an absolute lock for that PS5, which I'm not totally against. I feel like when you look at the PS4, it is certainly a little bit on the angular side, a little bit on the boring side where this gives it a little bit more of a future robot look. Now because the DualSense Controller still requires backwards compatibility with the PS4 games which you will be able to play on the PS5. It still has a light bar, however the light bar has been moved from the back of the controller to around the touchpad, which also is still prominently featured on the DualSense controller. This is something which I feel like is almost more of a legacy thing than anything else. I mean it's cool to see, you know, the different lights that you have on the controller, but like does anyone really care about the light bar? I will say one thing. Sony definitely took a shot at Xbox when you look through this press release. Talking about how it has strong wireless battery life with its rechargeable battery. You know the thing that the Xbox Series X still doesn't actually ship within the box. So, kudos for Sony for still shipping a rechargeable battery like they've been doing since 2006. Now one thing that is missing, or at least has been changed, is the lack of a share button. So Sony are being very coy with this one. So, instead of having a traditional share button, which before you would be able to use to take screenshots, record video, or go live on Twitch, or whatever you wanted to do. Instead, they're taking advantage of a create button. Which quote they will be focusing on sharing more details later. That's actually not a direct quote, that's a paraphrase. Honestly, one of the biggest features might actually be one of the ones that you can't really see from the photos, but it is the fact that the new controller actually has a built in microphone array. This actually seems like kind of a no-brainer. Now of course you can still use a headset with the controller, but as far as I'm concerned, this makes a lot of sense. It might not be the highest quality audio in the world, but there have been plenty of times where I wished I had a microphone and I didn't want to have to go dig through like a headset or something. Instead, having it built directly into the controller itself while yes you might get a lot of button presses and clicking noises or whatever, but it is a major new feature. And of course, the controller is taking advantage of USB-C just like on the Series X. Which brings me to I think, one of the biggest comparison points here which of course is that Xbox Series X controller. Having spent some time really using the Series X controller, it is very, very similar to the Xbox One. Now yes they've slightly adjusted the grip, so it's a little bit more comfortable for smaller hands, and they do have a nice new texture compared to the Xbox One, but generally speaking, it is a very, very similar controller. Now that was not a bad thing when I first tried it, however now that we're looking at this DualSense controller, it is, I don't want to say it's looking a little bit out of date, but it is certainly not as forward thinking as what Sony has here, and I actually think that some of the stuff, if they really pull of the motion, if they really pull of things like the microphone and they have a built-in rechargeable battery, could make a real difference. In many ways, this looks like an expensive controller, but importantly it looks like something which Sony really has spent a lot of time on to develop, and it's something that's not just the DualShock 5, which I am going to probably call this controller many, many times before it actually comes out. But when you put it side-by-side with what you're getting on the Series X, it does seem like while I might not be the biggest fan of the looks at the moment, it does seem like a major step forward. So I'm really curious, what do you guys think about the DualSense Controller for the PS5? And what do you think about some of the things it really tells us about the PlayStation 5? Again, we are getting very, very close to the time where we need to see this PlayStation 5, and we're kind of getting this little bit of information dripped and dropped. Dripped and dropped? Dripped and drop. Dripped and dropped. So subscribe if you want more excellent, really well worded PlayStation 5 coverage like this. I like pride myself on the way I mastered the English language.",
    "transcript_keywords": [
        "Xbox Series",
        "controller",
        "DualSense controller",
        "Xbox",
        "Sony",
        "Series",
        "DualSense",
        "bit",
        "haptic feedback",
        "Today Sony surprise",
        "Sony surprise announced",
        "Today Sony",
        "announced the brand",
        "thing",
        "PlayStation",
        "actual",
        "feedback",
        "haptic",
        "lot",
        "haptic feedback motors"
    ],
    "transcript_entity_values": [
        "R2",
        "the PlayStation 5",
        "USB-C",
        "this PlayStation 5",
        "PlayStation 5",
        "first",
        "PlayStation",
        "DualShock",
        "2006",
        "two",
        "PS4",
        "Xbox One",
        "Xbox",
        "the DualSense Controller",
        "the Xbox Series X",
        "DualSense Controller",
        "Today",
        "Sony",
        "the Series X. Which",
        "one",
        "the Xbox Series X",
        "Xbox Series X",
        "DualSense",
        "the Series X",
        "a ton",
        "Forza",
        "PS5",
        "Twitch",
        "20%",
        "L2",
        "English",
        "First"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "EVENT",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "ORG",
        "EVENT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "LANGUAGE",
        "ORDINAL"
    ],
    "vector": [
        -0.030460840091109276,
        -0.0986626148223877,
        0.020190129056572914,
        0.03407639265060425,
        0.08541888743638992,
        -0.005646230652928352,
        0.055297911167144775,
        0.0767659917473793,
        0.012715165503323078,
        0.06542714685201645,
        -0.035531800240278244,
        0.04914853349328041,
        -0.0189081821590662,
        -0.012857942841947079,
        -0.02370363660156727,
        0.07801121473312378,
        0.13751710951328278,
        0.0024563258048146963,
        -0.03419485315680504,
        0.017602143809199333,
        0.05019812285900116,
        -0.03726711869239807,
        0.030221600085496902,
        0.001167220645584166,
        -0.08129460364580154,
        0.05931074172258377,
        -0.08366671949625015,
        0.04904277250170708,
        -0.04509308934211731,
        -0.04770355299115181,
        -0.032337889075279236,
        -0.05799512937664986,
        -0.0716564729809761,
        -0.040869150310754776,
        -0.036963172256946564,
        -0.032387323677539825,
        -0.012166659347712994,
        -0.003319673938676715,
        -0.04797639325261116,
        -0.052664391696453094,
        -0.06801671534776688,
        -0.04358910396695137,
        -0.013576339930295944,
        -0.033179063349962234,
        0.02745121531188488,
        0.03129627928137779,
        -0.012755579315125942,
        -0.054421715438365936,
        0.05297505855560303,
        0.028029311448335648,
        0.050254251807928085,
        -0.06861536204814911,
        0.12298164516687393,
        -0.08854421228170395,
        -0.012176958844065666,
        -0.0009655588655732572,
        -0.0584743469953537,
        0.02055630460381508,
        0.019508985802531242,
        -0.05088033527135849,
        -0.0022861158940941095,
        -0.02005309797823429,
        -0.0016016411827877164,
        -0.04842430353164673,
        0.04455343261361122,
        -0.04751921817660332,
        0.03235882520675659,
        -0.07043453305959702,
        0.08590033650398254,
        -0.051524825394153595,
        -0.05397656559944153,
        0.049096573144197464,
        0.05285997688770294,
        -0.005658735055476427,
        0.02472059801220894,
        -0.08452853560447693,
        -0.001328473910689354,
        0.066465362906456,
        -0.049323175102472305,
        0.01569005288183689,
        0.09672170877456665,
        0.01677132025361061,
        -0.08158218860626221,
        -0.07253105193376541,
        -0.001457381877116859,
        0.026043202728033066,
        -0.03749476373195648,
        0.030551642179489136,
        -0.014350567944347858,
        -0.0023614983074367046,
        -0.02713390253484249,
        -0.04172850027680397,
        0.0022762983571738005,
        0.006907239556312561,
        -0.07629990577697754,
        -0.07546981424093246,
        -0.10456757247447968,
        0.03225655481219292,
        -0.004331584088504314,
        0.0022477218881249428,
        -0.008129273541271687,
        0.04653867334127426,
        0.013315600343048573,
        -0.009010477922856808,
        0.06887906044721603,
        -0.04102671891450882,
        -0.014930113218724728,
        -0.0287447702139616,
        0.022842053323984146,
        -0.01310755219310522,
        -0.05879848822951317,
        0.033961858600378036,
        -0.06287502497434616,
        0.0689534917473793,
        0.01970258541405201,
        0.03812066838145256,
        -0.04653727635741234,
        0.08404555916786194,
        0.022795923054218292,
        -0.028561346232891083,
        0.005517976824194193,
        -0.05837295576930046,
        -0.01775754988193512,
        -0.03802761435508728,
        0.06280790269374847,
        -0.04716816544532776,
        -0.07305873930454254,
        4.630495224473662e-33,
        -0.04813669994473457,
        0.11404450237751007,
        0.08476128429174423,
        -0.02977261319756508,
        -0.057654913514852524,
        -0.05804092064499855,
        0.005798316560685635,
        -0.007192934397608042,
        0.0032131713815033436,
        0.11778285354375839,
        0.0014102472923696041,
        -0.01762603223323822,
        0.009391757659614086,
        0.04161153361201286,
        -0.001776685006916523,
        -0.06106419861316681,
        -0.022208983078598976,
        -0.08339903503656387,
        0.01599210686981678,
        -0.008504636585712433,
        0.013837242498993874,
        0.13355028629302979,
        0.005414361599832773,
        0.04710809886455536,
        0.021733898669481277,
        0.05962497368454933,
        0.026898540556430817,
        0.05528574436903,
        0.04961490258574486,
        0.025777572765946388,
        -0.12825462222099304,
        0.03079981543123722,
        -0.06751226633787155,
        -0.02212471328675747,
        0.0415310375392437,
        0.03502390906214714,
        0.014833983965218067,
        -0.03762953728437424,
        -0.01376713253557682,
        0.04449796676635742,
        -0.03369201347231865,
        -0.009449941106140614,
        -0.043913885951042175,
        -0.018589599058032036,
        0.017570864409208298,
        -0.03203962370753288,
        -0.01654757931828499,
        -0.019670220091938972,
        -0.057149432599544525,
        -0.034538865089416504,
        -0.06049467995762825,
        0.013567300513386726,
        0.05636029690504074,
        0.08551041781902313,
        0.002256684470921755,
        -0.07312677055597305,
        0.04017693176865578,
        -0.01556591410189867,
        0.0239714402705431,
        0.04674213379621506,
        0.04805079847574234,
        -0.06717970222234726,
        -0.03819499909877777,
        -0.06346577405929565,
        -0.06586175411939621,
        0.08106464147567749,
        0.09069734066724777,
        -0.002439290750771761,
        0.04680248349905014,
        0.06232287362217903,
        -0.0468292161822319,
        0.050091035664081573,
        0.046302445232868195,
        -0.034147731959819794,
        0.025309160351753235,
        -0.0339500866830349,
        -0.05085725337266922,
        0.004888405557721853,
        0.0061669484712183475,
        0.007036528550088406,
        -0.0911293625831604,
        0.04174336418509483,
        0.031862273812294006,
        0.08946934342384338,
        -0.019736219197511673,
        0.026687635108828545,
        0.042205922305583954,
        -0.0033615187276154757,
        -0.0833536684513092,
        -0.007785681635141373,
        -0.003324716119095683,
        -0.02581789530813694,
        0.04322230443358421,
        0.0206997562199831,
        0.0011073522036895156,
        -5.03235927413737e-33,
        0.01828635111451149,
        -0.028766047209501266,
        -0.05097552388906479,
        0.08196717500686646,
        -0.0643058493733406,
        0.0151778943836689,
        0.001685208873823285,
        -0.03462879732251167,
        -0.13020747900009155,
        -0.022665154188871384,
        0.10430373251438141,
        -0.02262386493384838,
        -0.044254474341869354,
        0.08414264768362045,
        0.05164594575762749,
        -0.0177755169570446,
        -0.021877478808164597,
        -0.0007637229282408953,
        0.0656350702047348,
        -0.0194377563893795,
        0.12917575240135193,
        0.09091687947511673,
        0.05047966167330742,
        -0.01390459481626749,
        0.026403646916151047,
        -0.012599177658557892,
        0.005361135117709637,
        -0.018762333318591118,
        0.001708373660221696,
        0.04947960749268532,
        -0.06909756362438202,
        0.026645740494132042,
        0.0889618992805481,
        -0.0056602382101118565,
        -0.003783509135246277,
        0.034016791731119156,
        -0.024533839896321297,
        -0.029522597789764404,
        -0.0362389050424099,
        0.018919384106993675,
        -0.05149291083216667,
        0.05195257067680359,
        0.0546732135117054,
        0.03000207431614399,
        0.011899697594344616,
        0.06174503639340401,
        -0.016906902194023132,
        0.004195702262222767,
        0.021575840190052986,
        0.09228122979402542,
        0.0809222012758255,
        0.039690449833869934,
        -0.1435573399066925,
        -0.05172065645456314,
        0.02561306022107601,
        -0.10090421885251999,
        -0.028915634378790855,
        -0.058210521936416626,
        -0.0731351301074028,
        0.0014998711412772536,
        0.010003351606428623,
        0.07089032232761383,
        -0.0768762156367302,
        0.08211921155452728,
        0.10250458121299744,
        0.04663504660129547,
        0.06489741057157516,
        -0.019999941810965538,
        0.08453092724084854,
        -0.009342708624899387,
        -0.061302296817302704,
        -0.0008159838034771383,
        0.09241487085819244,
        -0.004351301584392786,
        0.03535442426800728,
        0.012694602832198143,
        0.006171158980578184,
        -0.031655874103307724,
        0.005707832984626293,
        0.027850762009620667,
        -0.08319629728794098,
        -0.0647076815366745,
        0.07280430197715759,
        0.08256562799215317,
        -0.018231626600027084,
        0.072917640209198,
        -0.021885350346565247,
        0.036119986325502396,
        -0.014597764238715172,
        -0.022728772833943367,
        0.07711771130561829,
        0.022332416847348213,
        -0.032713741064071655,
        0.011938825249671936,
        -0.007067685481160879,
        -5.2430998209729296e-08,
        0.016524503007531166,
        0.029291944578289986,
        -0.050787314772605896,
        -0.03832990676164627,
        0.0035788645036518574,
        0.007631981745362282,
        -0.09045500308275223,
        -0.055065643042325974,
        -0.08748354017734528,
        0.04813310503959656,
        0.035773247480392456,
        -0.003998822998255491,
        0.03149186819791794,
        -0.04363483190536499,
        0.0024575458373874426,
        0.021442456170916557,
        0.001383653492666781,
        0.1329173594713211,
        -0.009320413693785667,
        0.008507070131599903,
        0.009732172824442387,
        0.0323045440018177,
        -0.01716628670692444,
        -0.06426142901182175,
        0.07178289443254471,
        -0.01760241948068142,
        -0.08679851144552231,
        -0.02155468612909317,
        0.004356550984084606,
        -0.08269930630922318,
        -0.012702914886176586,
        -0.06291484832763672,
        -0.02980486862361431,
        0.007937685586512089,
        -0.01097412221133709,
        0.057237427681684494,
        -0.03322374075651169,
        0.030295342206954956,
        0.05758246034383774,
        0.03494386002421379,
        -0.05425791069865227,
        -0.04481048509478569,
        -0.08274323493242264,
        0.04162231460213661,
        -0.04769490286707878,
        -0.01715620793402195,
        0.03236478939652443,
        -0.13039015233516693,
        -0.04482245445251465,
        0.00985400378704071,
        -0.06062130257487297,
        0.03762171044945717,
        0.05954355001449585,
        0.030483664944767952,
        0.06394638121128082,
        0.08391538262367249,
        -0.07042177021503448,
        -0.04207149147987366,
        -0.02570870704948902,
        0.01782485470175743,
        0.019862012937664986,
        -0.051722146570682526,
        -0.06033974885940552,
        0.08279190957546234
    ]
}