{
    "id": "MugTyyYrTlM",
    "title": "What PS5 & Series X Are Missing",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-10-30T16:07:56Z",
    "video_url": "https://www.youtube.com/watch?v=MugTyyYrTlM",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "ps5",
        "playstation",
        "xbox",
        "series x",
        "series s",
        "sony",
        "microsoft",
        "dual sense",
        "dualsense",
        "dual shock",
        "new ps5 controller",
        "gaming",
        "video games",
        "videogames",
        "consoles",
        "tech",
        "technology",
        "review"
    ],
    "views": 109357,
    "likes": 4972,
    "comments_count": 1059,
    "description": "Should you ACTUALLY buy the Playstation 5 or Xbox Series X?   Xbox Series X vs Series S Unboxing!  Is the iPhone 12 Pro Worth It?  Pixel 5 - I Was Wrong:  iPhone 12 Mini vs iPhone 12 Pro Max:  Why Did Sony Do This?! PS5   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/3B2OzImgn1g",
        "https://youtu.be/crjVuHr-j4M",
        "https://youtu.be/5dE9gwwMoKY",
        "https://youtu.be/PjaQ96i_BkE",
        "https://youtu.be/RlBbKV1D-Co",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome, to This Is. The PlayStation 5 is very, very close now. But there's still a lot of things to talk about with this thing because even though we're, what? Two weeks, three weeks away? - I'm still not convinced that we're very close to PS5. - Matt, it's coming out okay, no matter how many times you say it, Sony is not tricking everyone by pretending to launch the PlayStation. It is a real thing, it is going to come out in just a few weeks. - I'm not saying it's not gonna come out ever, I just think for most people, it's not gonna be available. - Okay, okay, well, we have the DualSense controller here. So we actually have already done a video on the main channel, which feel free to go check that out. But there are a few things we can glean from this. First of all, I really like this controller. - So there's so many comments that we get that we are biased towards Microsoft and we hate on Sony. - We're also sponsored by Apple, Google, Samsung. - Yeah. - Microsoft. Every other company - So the reason that bias comes off like that, is because we have had the Xbox for months at this point. Up until yesterday, everything about the PS5 was speculation. The PS5 we think... We know it's probably gonna be great but- - I mean, it's a PlayStation, yeah. - Right, we know it's probably gonna be great. But until we get things in our hand and test them for ourselves, the key word there is gonna be locked at probably. So this is a perfect example with the controller. I looked at the controller, I saw a very stark, glossy looking white controller. I hated it. Now we get this in our hands. And this kind of... it's still glossy, but it's not quite as glossy - No its pretty matte. I would say. The texture on the back, these are all Xs, Os, squares, triangles, all the face buttons. - So nice. - This is the best feeling texture that I have ever felt on a controller, hands down. So now that we actually can get our hands on something and test things firsthand, my opinion has changed. - Are you trying to say that when we make 100 rumor videos to get clickbait views on YouTube, that our opinion changes when we actually get the real item? - That's exactly what I'm saying. - Wow, novel concept. - Yeah - I will definitely agree, the DualSense controller, I was expecting it to be good, right? Of course, it looked like an improvement. The main things that jump out to me is that it's bigger than the DualShock. But also it feels a little more comfortable to me personally. And that's without trying the impulse triggers, which are at the moment are only working on the PS5. I was able to get this up and running with a couple of devices including xCloud via Android, which to be fair gave me a good sense for how the sticks and the buttons feel. It's a solid controller, but there's a lot more to the PS5 And I think one of the big things that people have been really sort of giving a (hoot) about are the games or rather the lack of games across the entire next generation of consoles. - Another comment that we get a lot, Why do we keep saying that there are no games for the consoles? - There are no games for the consoles. Thank you very much for watching, make sure you subscribe to \"This Is\" for other nuggets of wisdom like this. - This is a comment...(laughing) I hate that you keep ending our videos early. (both laughing) This is a comment that is often taken out of context. What we were saying is there are no next generation console exclusives, which is very different than saying that there are no games. The context of what we're saying this is that there's no real reason to buy the the Xbox or the PS5 right now because it... All these all these new games coming out are available on something else. Whether it be PS4, whether it be PC. So like Miles Morales is one that is brought up a lot. Miles Morales is confirmed for PS4. You do not have to buy the PS5 in order to play Miles Morales. Demon Souls is the exception. And that one's had a kind of turbulent launch. - I mean that's a remake of a PS3 game. - It's a remake of a PS3 game. It was originally announced to be available for PC but then Sony backtracked on that, said that was a mistake. - They backed the dump truck of money up to the studio and like hey, about that PS5 exclusive. - But then we also have... The other day in a Hungarian retailer, Markt, so Media Markt with no e, listed Demon Souls for PS4 complete with a release date of November 19th for PS4- - Interesting. - with box art everything. So if that's the case... So right now Demon Souls is a PS5 exclusive that does qualify of that PS5, that next gen console exclusive. But if it is available for PS4, then it's again no longer a next gen exclusive. - Yeah. - Now on the other side of things, we have Xbox who specifically chooses not to have exclusives. That is Xbox's entire marketing platform right now, is they don't care if you buy Xbox because they're selling Xbox as a service, not as hardware. - I think that might be a half step too far because when you can look at the logistics of it and the optics of a situation like this, I think what Sony, Microsoft is doing on the consumer level is basically the same thing. It made sense and this is always the case, right? I mean, everyone thinks about when the Switch came out. Breath Of The Wild was amazing. You know Breath of the Wild was a Wii U game, they just poured it right through... Breath of the Wild was a Wii U game that you could purchase, right? And I think the similar thing is happening for a lot of these games. They're first of all, cross platform, as always, Call of Duty is going to be on the Xbox One, the PS4 probably two, three more years now easily. Because simply, the gamers have old consoles, right? The install bases for the Xbox One and PS4 are massive. And you'd be crazy to develop a brand new game for what? 2,3,4 million, like a very small amount of those first sort of games. - Phil Spencer had said for Xbox that they want any of the Xbox games to be available on PC or Xbox. - Yes. Yes. - And that is their actual goal. So to say that Xbox doesn't have exclusives, I mean, that's a choice where Sony they're saying we want some exclusives to PS5, we do want to sell that hardware. Now both of them have a feature where they can take older generation games, have some sort of patch, or you get the next gen version if you buy the older version. So with Xbox, it's smart delivery. - Mm hmm - With PlayStation, it is a little badge on the games that says \"PS5 upgrade available\", - Which is great, because obviously, if you are someone who maybe is thinking about getting a PS5, but in two years or a year or whatever the case is, you can still buy those PS4 games now. And you know they will work at least as well if not better when you get your hands on the PS5. - So right now each of the systems has about 30 games on that list, I imagine that we're gonna get some more. And that's not including any of the backwards compatibility, those are games that have been patched to run more efficiently, or they've been optimized for the next generation. - Not a huge amount of games. But I mean, 2020, let's face it, maybe not the easiest year in the world to develop new games, consoles, and whatnot. - Right. - So not surprisingly, we've seen a fair few games slip into next year for the release dates. Obviously, on the Xbox side, there's a major difference between the Series S and the Series X Series S is now disc closed, but also much less powerful. Whereas on the PlayStation side, the digital versus the non-digital, basically the same thing. One has a disk drive, one doesn't. When you think about like if you're taking your old console library with you, if you have a bunch of digital games, cool, sweet. It'll even work on like a USB hard drive on both consoles. But when you think about the idea of oh, I'm gonna bring over my potentially dozens or hundreds of discs of PS4 games or whatever the case is, that won't work because as far as I know, neither of these consoles will ever have any kind of USB, Blu-ray drive, or anything like that to give you access to discs. - I mean, software is obviously the key here, there's theoretically no hardware limitations to adding an external disk drive. - [Austin] USB 3 is absolutely fast enough to set- - Right, right. - You know what the thing is, though? They would lose so much money. How much would they have to charge for those disk drives? Sony has $100 price premium going from the digital edition of the PS5 to the full fat digital, the full fat PS5. And we all know that Blu-ray drive is probably worth like 15, 20 bucks when they buy them in bulk, right? So were they gonna turn on and package that in a USB enclosure and sell it for 100, $150? Who's gonna buy that at that point? - Right. And let's face it, if you already have the library of dozens or hundreds of games, chances are you're already buying the disc version anyway. - [Austin] Yeah. - Another thing I just wanna very clearly address from the comments is, even though we've mentioned it several times in videos, it's still one that we get asked a lot. Can I use my old hard drive to play new games on the new console? - No. Thank you very much. (laughing) - Yes, you can use your old hard drive to play your old games. - Yes. - Anything new that has been optimized for the next generation has to be done with the new either internal SSD, or one of the external SSDs for the Xbox. Now you cannot use your USB hard drive to play next gen games. - Which means that playing Xbox Series X, Series S and PS5 games is quite expensive, right? Because all these consoles have, I would say, fairly small SSDs. I mean, the Series X should get about 800 gigs free, right out of the box. The PS5 is an 800 gig SSD, so once you format that, that's probably 650, seven, maybe even less than that. So when you consider the games can easily be 50, 80, 100 gigs plus, I think that we're gonna be in a situation really quickly, where you're gonna keep a handful of your favorite games on your Xbox or PlayStation. Unless you shelled out for the expansion module or installing another SSD in your PlayStation, you're gonna be probably swapping discs or swapping games in and out. You're not gonna just leave 100 games installed on like some 10-terabyte hard drive behind your Xbox. - Right, another comment that we got was, we were kind of disappointed that the Xbox Series X didn't have Wi-Fi 6 built in. - Which the PS5 does have. - Yes, and a lot of people said well, why does that matter because my internet speed doesn't come anywhere close to that? (exhales deeply) - Look, Wi-Fi 5 is fine, right? It's still dual band. It's what you get on something like the PS4 Pro, the Xbox One X and everything. I mean, it's okay. But there are a couple things to it. Wi-Fi 6 has some advantages. First of all, not necessarily in the raw speed, which to be fair, it actually is faster than Wi-Fi 5, but specifically in the actual responsiveness, the latency and the sort of bandwidth that it will be able to handle when you're in an area with lots and lots of devices, right? There's less interference, Wi-Fi 6 does a better job of making sure that you have priority bandwidth and not, you're getting completely nuked by the Netflix TV down the hall or whatever, right? So fundamentally I do think Wi-Fi 6 is an important thing. And people who say, oh, it's fine, I've got ethernet. Cool, I would say probably the vast majority people who use consoles are running them over Wi-Fi. - Yeah, so we get, real gamers use ethernet. With Wi-Fi 6, what you're doing is future proofing your device for, not today, but maybe two years down the line. Because remember, consoles don't get refreshed every year like other pieces of technology. This is not gonna get an update for two, maybe three years - Easy, yeah. - So technology can change a lot in three years and by not including it right now, you're limiting yourself what's potential in the future. - But ultimately, it's not the end of the world. Most people won't notice it. But it is a nice thing to have on the PS5 - My thing is with not having it though, is that these are next generation consoles. And Wi-Fi 5 is not what I would call next generation. - Well let's just be fair, though, when the PS4 came out, they both had Wi-Fi 4, or whatever they had in - N, yeah. - But the PS4 had 2.4 gigahertz, it didn't even have dual band Wi-Fi, which you know, it sounds like we're getting way into nerd town. But the download performance on the PS4, the launch models was awful, right? And that was an advantage for the Xbox One, it at least had dual band Wi-Fi. Now it's not as huge of a gap this time around. but if you have a good Wi-Fi 6 router, you should see clearly better performance on the PS5 when it comes to gaming, when it comes to downloading, when it comes to just general overall responsiveness and not being clogged up on a network which is something which is important. So I'm curious, now that we have a much better idea of what the PlayStation, the Xbox are all about, which one are you honestly considering picking up? Have you pre-ordered yet? And if so, which one have you picked? Or have you been the done the balling move and just bought both? Let us know the comments below. Make sure to subscribe to This Is for more spicy content, like Matt and Austin's argument corner and we will catch you in the next one. (fingers snapping) (gentle upbeat music)",
    "transcript_keywords": [
        "Xbox",
        "games",
        "Xbox Series",
        "WiFi",
        "thing",
        "consoles",
        "Series",
        "things",
        "Xbox games",
        "drive",
        "game",
        "controller",
        "lot",
        "Sony",
        "Yeah",
        "PlayStation",
        "USB",
        "playing Xbox Series",
        "generation",
        "buy"
    ],
    "transcript_entity_values": [
        "about 30",
        "Android",
        "the easiest year",
        "the Series X Series S",
        "the Series S",
        "2.4 gigahertz",
        "November 19th",
        "yesterday",
        "Demon Souls",
        "Blu-ray drive",
        "three years",
        "Xbox Series X,",
        "three years - Easy",
        "50",
        "Microsoft",
        "some 10-terabyte",
        "80",
        "Xbox",
        "DualShock",
        "Miles Morales",
        "hundreds",
        "Call of Duty",
        "USB",
        "Wi-Fi 6",
        "just a few weeks",
        "Google",
        "PS4- - Interesting",
        "Matt",
        "2020",
        "dozens",
        "DualSense",
        "Media Markt",
        "Austin",
        "Samsung",
        "Xbox One",
        "100",
        "Xbox",
        "Demon Souls",
        "Netflix",
        "first",
        "Wi-Fi 6",
        "next year",
        "about 800",
        "PS5",
        "2,3,4 million",
        "the Xbox Series X",
        "Blu-ray",
        "Wi-Fi 4",
        "650",
        "Wi-Fi",
        "Wii U",
        "Wi-Fi 5",
        "Two weeks",
        "dozens or hundreds",
        "20 bucks",
        "PlayStation",
        "xCloud",
        "First",
        "PS3",
        "two years or a year",
        "Apple",
        "PS4",
        "Hungarian",
        "the PS4 Pro",
        "today",
        "Phil Spencer",
        "three weeks",
        "100, $150",
        "Wi-Fi 5",
        "two years",
        "months",
        "YouTube",
        "Xs",
        "15",
        "half",
        "two",
        "Markt",
        "three more years",
        "Sony",
        "SSD",
        "100",
        "800",
        "seven",
        "Switch",
        "The PlayStation 5"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "EVENT",
        "LOC",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "FAC",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "FAC",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT"
    ],
    "vector": [
        -0.030621077865362167,
        -0.06743307411670685,
        0.12304912507534027,
        -0.09601455181837082,
        0.12268848717212677,
        0.04607648774981499,
        0.013721604831516743,
        -0.0018142786575481296,
        0.054446492344141006,
        0.09289555251598358,
        -0.0546453595161438,
        0.08802877366542816,
        -0.05193793773651123,
        -0.04685727879405022,
        0.060110874474048615,
        -0.08561039716005325,
        -0.0004074123571626842,
        -0.11641184240579605,
        -0.06658265739679337,
        0.043881356716156006,
        0.022533554583787918,
        -0.13705147802829742,
        -0.029672272503376007,
        0.04560635983943939,
        0.027241593226790428,
        0.05267997831106186,
        -0.06027347967028618,
        -0.009395674802362919,
        -0.05299045890569687,
        0.010279601439833641,
        -0.04799573868513107,
        0.10394354164600372,
        -0.07449061423540115,
        -0.025387905538082123,
        -0.01939178816974163,
        -0.05307626724243164,
        0.017289169132709503,
        0.026193009689450264,
        -0.06830140203237534,
        -0.06505615264177322,
        -0.0007010783883742988,
        -0.07158954441547394,
        -0.06063123419880867,
        0.07516882568597794,
        0.04595233127474785,
        -0.007726237177848816,
        -0.01251191459596157,
        -0.05130250006914139,
        -0.008339764550328255,
        -0.0020384250674396753,
        -0.005030924454331398,
        -0.03349586948752403,
        0.05140702798962593,
        0.01966349221765995,
        -0.03494129702448845,
        -0.020919805392622948,
        -0.004683798179030418,
        -0.0047926404513418674,
        0.0787794291973114,
        0.01204893458634615,
        -0.007817533798515797,
        -0.10574846714735031,
        -0.032719165086746216,
        0.029537945985794067,
        -0.029163286089897156,
        0.02866928093135357,
        0.007276697549968958,
        0.024008527398109436,
        0.013782070949673653,
        0.061555683612823486,
        -0.07064685225486755,
        0.04690909385681152,
        0.09499747306108475,
        0.054403237998485565,
        0.008751190267503262,
        -0.009715505875647068,
        0.061349570751190186,
        -0.05496683344244957,
        -0.01244359277188778,
        0.0371490940451622,
        0.07217751443386078,
        0.021665293723344803,
        -0.0977793037891388,
        -0.04727473855018616,
        0.01126397680491209,
        0.06926646083593369,
        -0.011039634235203266,
        0.017206592485308647,
        -0.05306978151202202,
        -0.056033968925476074,
        -0.10382547974586487,
        0.061026185750961304,
        0.09072496742010117,
        0.03748491033911705,
        -0.052432022988796234,
        0.0021479513961821795,
        -0.07654990255832672,
        -0.040949396789073944,
        -0.01286733616143465,
        0.03175748512148857,
        0.026221267879009247,
        0.05606062337756157,
        0.03208232671022415,
        -0.041382886469364166,
        -0.007013572379946709,
        -0.048363447189331055,
        -0.10765358060598373,
        0.01361174788326025,
        0.010851521044969559,
        0.03431635722517967,
        -0.10403372347354889,
        -0.02128423936665058,
        -0.04896217957139015,
        -0.025681238621473312,
        0.033232979476451874,
        0.06527562439441681,
        -0.011741925962269306,
        0.04308995231986046,
        0.06182859465479851,
        -0.0367792509496212,
        -0.01776808500289917,
        0.008472062647342682,
        -0.07067703455686569,
        0.010027228854596615,
        0.029649905860424042,
        -0.04699394106864929,
        -0.021445976570248604,
        2.629448803345982e-33,
        -0.06107214093208313,
        0.06420446932315826,
        0.047493524849414825,
        0.04539228975772858,
        -0.06451921910047531,
        0.0030234537553042173,
        0.05020919442176819,
        0.05307812616229057,
        -0.02234262228012085,
        0.07115713506937027,
        0.015447515994310379,
        -0.0006434960523620248,
        -0.05356988310813904,
        -0.009491337463259697,
        0.059433553367853165,
        -0.01898050494492054,
        0.02174849808216095,
        -0.019833339378237724,
        -0.0007161716930568218,
        0.005355385132133961,
        0.02561132237315178,
        -0.010660297237336636,
        0.005656678229570389,
        -0.020506111904978752,
        -0.011491918936371803,
        0.06867935508489609,
        -0.01866302080452442,
        -0.043370407074689865,
        0.06774470210075378,
        0.008066469803452492,
        -0.11114088445901871,
        0.02666546404361725,
        0.047618038952350616,
        0.02721160091459751,
        0.004674204159528017,
        -0.027120864018797874,
        0.06392466276884079,
        -0.05902232974767685,
        0.05605633184313774,
        0.01065567135810852,
        -0.027218623086810112,
        0.013927139341831207,
        -0.0688038170337677,
        -0.021745115518569946,
        0.07898365706205368,
        0.018832283094525337,
        -0.007894475944340229,
        -0.0971975326538086,
        -0.09180913120508194,
        -0.03178279474377632,
        0.011613979935646057,
        0.05920005589723587,
        0.039657603949308395,
        0.009391029365360737,
        0.03895574063062668,
        -0.06427730619907379,
        -0.03047862835228443,
        -0.044156692922115326,
        0.011026653461158276,
        0.06853305548429489,
        0.06166691333055496,
        -0.03633701801300049,
        -0.006353954318910837,
        -0.009194674901664257,
        -0.09138099104166031,
        0.06495504081249237,
        0.121426522731781,
        -0.008033212274312973,
        -0.054804202169179916,
        0.06489639729261398,
        -0.056749437004327774,
        0.07154030352830887,
        -0.025825154036283493,
        -0.030790084972977638,
        0.0626482143998146,
        0.044077739119529724,
        -0.012583859264850616,
        0.029464969411492348,
        0.006237255875021219,
        0.11593635380268097,
        -0.03815535828471184,
        -0.010519284754991531,
        -0.007022830657660961,
        0.055871594697237015,
        -0.030152704566717148,
        -0.006784000899642706,
        0.1011040136218071,
        -0.009221905842423439,
        -0.05482352152466774,
        0.031761813908815384,
        -0.04930276423692703,
        -0.07040423154830933,
        0.011187785305082798,
        0.11080623418092728,
        -0.024109650403261185,
        -4.426978214095953e-33,
        0.013593067415058613,
        -0.11863133311271667,
        0.0032039755024015903,
        -0.035650186240673065,
        -0.0429052859544754,
        -0.04212802276015282,
        -0.004540928173810244,
        -0.02264198660850525,
        -0.04564357176423073,
        -0.00757782906293869,
        0.0035563025157898664,
        0.00948462076485157,
        0.011479632928967476,
        0.09261255711317062,
        -0.02663334459066391,
        -0.05611782521009445,
        0.03455474227666855,
        -0.06060941517353058,
        0.055884312838315964,
        0.03995015099644661,
        0.13061635196208954,
        0.05688723921775818,
        -0.04105300083756447,
        0.037137363106012344,
        0.008957445621490479,
        0.018710872158408165,
        0.05996507406234741,
        0.017533257603645325,
        -0.007020210847258568,
        -0.016636431217193604,
        -0.027821507304906845,
        -0.04879825562238693,
        0.02151336707174778,
        -0.04465080425143242,
        0.07063133269548416,
        0.04285198822617531,
        -0.03157275915145874,
        -0.002010437659919262,
        -0.03062736615538597,
        -0.024381987750530243,
        -0.026864726096391678,
        0.04322810098528862,
        -0.0321321040391922,
        -0.07351643592119217,
        -0.0059499721974134445,
        -0.02000005543231964,
        0.03970617800951004,
        0.06562713533639908,
        0.09073971956968307,
        0.10175712406635284,
        0.09160466492176056,
        -0.004290387965738773,
        -0.09558109939098358,
        -0.031344179064035416,
        -0.08078167587518692,
        -0.03780381754040718,
        -0.08317314833402634,
        -8.279083704110235e-05,
        -0.0336020402610302,
        0.015024052932858467,
        0.055664099752902985,
        0.004639375954866409,
        -0.03902113065123558,
        -0.038831062614917755,
        -0.017227761447429657,
        0.03145241737365723,
        0.1282089352607727,
        -0.017887502908706665,
        0.02065623365342617,
        -0.023901646956801414,
        -0.05413510650396347,
        -0.0004157459188718349,
        -0.06430826336145401,
        -0.038149286061525345,
        -0.017240120097994804,
        0.06943214684724808,
        -0.02979128807783127,
        0.007237396668642759,
        0.018520167097449303,
        -0.018811862915754318,
        -0.06092052534222603,
        0.057710204273462296,
        0.04328712075948715,
        0.009753814898431301,
        0.05363599956035614,
        0.029928872361779213,
        0.03632286190986633,
        0.032332416623830795,
        0.020494602620601654,
        -0.0536765530705452,
        -0.0022703567519783974,
        -0.0012014263775199652,
        -0.0727778971195221,
        0.02419055998325348,
        -0.014611664228141308,
        -5.513363632303481e-08,
        0.09349004179239273,
        0.01288794819265604,
        0.013009633868932724,
        -0.05012214183807373,
        0.07819110155105591,
        -0.01717543788254261,
        -0.03574095666408539,
        -0.05035542696714401,
        0.1217501312494278,
        0.047096118330955505,
        0.05579905956983566,
        -0.03112475760281086,
        -0.0024300299119204283,
        0.023536546155810356,
        0.020129075273871422,
        0.06021374464035034,
        -0.06835397332906723,
        0.008771550841629505,
        0.004723250400274992,
        -0.004547076765447855,
        -0.06079201027750969,
        0.03988276422023773,
        0.0036358146462589502,
        -0.10115685313940048,
        0.022352349013090134,
        -0.056983381509780884,
        -0.03576312214136124,
        -0.012140118516981602,
        0.03727978840470314,
        -0.014718383550643921,
        -0.03840819001197815,
        -0.07747869938611984,
        -0.05750897526741028,
        -0.03765491023659706,
        0.019069761037826538,
        -0.00257087335921824,
        -0.0015140707837417722,
        0.011546533554792404,
        0.03770101070404053,
        -0.0578729510307312,
        0.02809622325003147,
        -0.10345744341611862,
        -0.016890106722712517,
        0.04235843941569328,
        -0.04892933741211891,
        -0.06517120450735092,
        -0.029349304735660553,
        -0.1096586287021637,
        -0.033774711191654205,
        -0.05576327443122864,
        -0.057078033685684204,
        0.010537066496908665,
        0.01964004524052143,
        -0.03539254888892174,
        0.1155644878745079,
        0.01592976599931717,
        -0.013516825623810291,
        -0.022728849202394485,
        -0.04222916439175606,
        0.033627480268478394,
        0.06008901074528694,
        -0.07076694071292877,
        -0.017381027340888977,
        0.10322576016187668
    ]
}