{
    "id": "mv-P8oTgVOg",
    "title": "COOKING on a Gaming PC!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-07-25T17:04:00Z",
    "video_url": "https://www.youtube.com/watch?v=mv-P8oTgVOg",
    "category": "Science & Technology",
    "tags": [
        "ryzen",
        "amd",
        "cooking",
        "amd ryzen",
        "ryzen 4000",
        "ryzen laptop",
        "lenovo",
        "cringe",
        "tech",
        "cpu",
        "processor",
        "gaming pc",
        "computer",
        "pc",
        "experiment",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 1115229,
    "likes": 40341,
    "comments_count": 3145,
    "description": "We all know AMD Ryzen CPUs are great but this...is a little ridiculous. Go to  and find out how you can get 3 months free! I challenged @iJustines Apple knowledge:   My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://expressvpn.com/austin",
        "https://youtu.be/sd8UfamDJOg",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today we are attempting to cook an entire gourmet meal using nothing but a Ryzen processor. If that sounds like a terrible idea to you, then you'd be correct. This video is sponsored by Express VPN who were kind enough to well enable this madness. So Express VPN is your one stop shop to keep your entire online browsing habits safe and secure. So definitely be sure to go check them out at the link in the description, but for now, well, we have a very questionable idea. So the way this is supposed to work is very simple. So we are taking advantage of a first generation Ryzen 5 and theoretically we will be able to cook food no problem with it. So essentially the way this would work is instead of using a standard like heatsync that you would find on a traditional processor. Instead, we're going to take all that heat and put it into cooking our bacon and our eggs and other equally terrible ideas. If we can take the heat that is coming off of that processor using something like these little copper cups which we hope is the best way to actually transfer the heat over, then we should be able to get that copper incredibly hot close to boiling about 220 degrees or so or about 100 degrees Celsius which should be enough to cook pretty much everything on the table. So as far as building a PC for this, we're keeping it very simple. So all I'm doing is I'm just putting together the most barebones of barebones systems because all I really need to do is get a copy of Windows up and running. I'm going to max the CPU with something like Prime 95. - I bought this with this size in mind 'cause this is about the smallest I could get without going into actual like full miniature size. - This feels so wrong. The thing is that I can't actually apply that much pressure to the top. So I actually want to try to get it sort of evenly spread right out the gate. Oh God, that's disgusting. - Here goes nothing. - Hopefully I get a nice even spread. Yeah, I mean, I stuck. That actually, that's kinda stuck on there. This is not what liquid cooling is all about, dude. That looks so ridiculous. - Alright, so CPU fan error is posting in safe mode. - 91 oh wow, that's super hot. Okay, wait, hang on. Do we even need to get into, oh it's dead. It's hot. - Oh wow, yeah, you can actually feel it. - I think we should probably change the processor though. I think first gen is probably a little bit too warm. So I need to get this Ryzen, oh come look, look how gross that is. (Austin vocalizing disgust) It looks like someone sneezed on the processor. That's so much thermal paste. I should think a little bit more. So now we've swapped out our first gen Ryzen 5 with a third gen Ryzen 5. The main difference here is really going to be in the fact that this is a much more power efficient processor which hopefully means that it won't overheat by the time we try to actually get it up and running. Okay, 81 degrees already. It's not any better. That is so hot. CPU over temperature error, CPU fan error. Now we have a CPU fan attached. Let's try that again. Dude that has legitimate air flow on the cup. I think that actually might fix it, this is so dumb! One good thing is actually I think our job is a little bit simpler now that we know that the BIOS will get it so hot. We actually don't even need to boot into Windows, run Prime 95. Anything like that. Literally just trying to like sit on the BIOS seems like it's enough to cause major issues. What we may have to do is either get more cooling or theoretically, even if it's crashing, it would still work. We can just, as stupid as it sounds. We can just try to restart it until we get to the point where this actually works. So the plan right now is questionable. So we know that it is actually getting obviously very, very warm. That copper cup should be hot enough to cook pretty much anything we want. So what are we gonna do right now? It's going to add a little bit of butter and by a little bit I mean a lot. So we are currently 95 degrees and the butter's almost entirely melted. That's a good sign. Should we crack an egg and get started? - Sure, oh, that was literally the right amount. - Oh dude. - Look at that. - That was an expert pour. This is going to take a while, isn't it? That's a lot of egg. So the egg itself is actually still pretty cold on the top. But if we look at it from the side, we could see that the bottom is actually significantly warmer. So we've been here quite a while. Now, if we take a look at the thermal camera what we see it's about 37 degrees Celsius on top which is not terrible. Problem is, it's not enough to cook an egg. So unless we want to be here all day and slowly warm the egg, I think we need a different strategy. So it is a new day and we have a new plan. So yesterday when we were cooking, we were able to cook the egg. The problem was there was too much egg to cook. So if you actually looked on the bottom of it, it actually was fully cooked but it was only maybe about a millimeter, two millimeters of egg which is obviously not enough. So today we're going to be using the egg whites. Alright, we're at 59 degrees and climbing rapidly. Okay, so I assume it's probably gonna take about, well, I was gonna say five minutes, probably a little less than five minutes to actually properly heat up. So do you like to pour the egg whites or will I have the honor pouring it all over the motherboard? - I don't trust you. - I don't trust me either. - Alright, for safety. - Oh, look at that, you're so smart. Dude, as soon as you poured that in, we actually saw CPU temperature drop. It went up to like 93 and now it's back down to 90. It's actually properly getting cooked there. And the nice thing is the CPU was actually not overheating now it's sort of leveled off. I mean, 94 is incredibly hot but that's good prime cooking temperature. Dude, that's almost cooked. How it's been like three, four minutes. - Yeah. - Have we discovered the key to perfect eggs? A tiny cup and hundreds of dollars of computer hardware? - Yeah that. So I don't want to jinx it, but I think this is a perfect time. - Cheese, do you want to give it another minute? Do you just want to drop the cheese on it. - We're just going to drop it in. - Okay, so I think the key here is that we have heat but we have a small amount of heat. So don't put a lot of cheese. Just add a little bit. - I think this is probably enough, right? Let me see. - Yeah, that should be fine. - Alright, sprinkle it in. Might even restrict it a little bit. Yeah, I think that'd be good. - That is not what you ever want to see. That looks ridiculously hot. But the thing is all that heat is definitely being transferred in. You can actually see the way that sort of the edges have cooked through. Whereas that little bit over here on the right is not quite as warm. So the cheese on the side is starting to attach but the bottom, like the egg is almost cooked all the way through. Weve still not killed, it's now 109. So it was super hot. So the thing is, this gives me an idea. So we know that Ryzen is actually really reasonably power efficient usually. Obviously a cooler is helpful for any processor but I saw a video the other day of someone on Twitter who had taken one of the Ryzen laptops. They like open it up and they were actually running the Ryzen laptop completely bare. So there was nothing on top of the processor, no cooler, no heatsync, nothing. And it was actually able to play a game and like sort of benchmark and stuff. - Oh. - Maybe that's the followup to this. Once we're done with our ridiculous cooking. Oh, like that, we actually should try on the laptop and see what happens. - Yeah, because if it doesn't shut off like this, that's actually really impressive. - That's pretty good, right? - That's basically just a miniature version of what you'd have at IHOP. - Smells like egg and cheese. Alright, let me taste it. Oh, it's very hot. Tastes like eggs and cheese. The cheese is melty though. Should we make some s'mores? - Yes. - I think we can melt some chocolate. - I would like to think so. Maybe not the marshmallows might be a little tough. So I've gone through the trouble now of making a tiny s'more for ants. So I grabbed our animal crackers. I had to get it into a fine chunk that we can use for a smore. - Dude, it's so small. - This is literally gonna be the smallest s'more ever. And for the sake of simplicity because I know this won't do it any favors or maybe it will feel free to chime in. But should we put a top cracker? - No, I want be able to see if it's actually melting or no. Now if you squint a little bit, this looks like a really cool cooking show right now. You've got like the light behind you. You're there carefully crafting your creation. - I will call that good. Oh yeah, there we go. - Those crackers are not going to actually transfer the heat very well. So if this doesn't work, we actually need to knock the chocolate off and then put it back together when we pull it out. - Putting chocolate on the cup itself is really easy. So I want to see how far we can get with making an actual s'more first. And then if not, we can just see how easy it is to melt chocolate. - So while our s'mores are cooking away, let me tell you about the sponsor of today's video, Express VPN. So I use Express VPN because not only do they keep me safe and secure online but also they do it with a high level of speed. No one wants to use the VPN if it ends up slowing you down. So now it is a VPN like Express VPN, keep you safe and secure online when you're say on public Wifi but it even helps you with your privacy when you're at home. So a lot of ISPs specifically here in the United States do a lot of data logging to see what you're doing online. and Express VPN keeps you very much safer than if you're just doing it by yourself. But the other aspect that really is helpful with Express VPN is the ability to sort of change your location anywhere around the world. So say you want to watch a certain video sharing service in a different country well guess what, Express VPN has you covered. And I got you covered as well. So you want to sign up for Express VPN right now you can get three months for free by signing up the link in the description at expressvpn.com/austin. If you want to help support the wonderful sponsor of ridiculous projects like this and get yourself some safety and security. Go check out expressvpn.com/austin and get your three months of free service. Thanks Express VPN. I'm going to go back to making questionable content now so that you can keep all of the audience safe and secure. Oh yeah, the chocolate's getting a little bit melty. So the problem is that that chocolate actually has like essentially the s'more on the bottom. The little Graham cracker is actually not allowing the heat all the way through. We may want to take the spoon and just sort of knock the extra. I can't see that at all. - I mean, you can see the chocolate kind of glazing a little bit, it's nice. - I think let's knock the chocolate and the marshmallow onto the actual copper. - Okay, I mean that ruins our s'more but. - Oh, look at that. It's melted right onto the spoon. That's pretty melty. - Not too bad, hold on, alright ready? - Alright give me that sweet taste test. - Oh its actually really warm. - Sorry, is it too hot? - No, marshmallow was actually really soft. I mean, it was already soft but like the heat did a little more to it. When Ryzen 4000 series comes out on desktop, everyone's going to come out with their benchmarks. Their reviews are gonna be like, can this cook a s'more? Can we cook bacon on it this time? We'll see. - You know what I think it's time for. I think it's time to go find a Ryzen 4000 laptop and see if we can actually get it to work with zero cooler whatsoever. - Are we gonna cook on it? - No, we already cooked, that was a bad idea. - Okay. - Before we tear apart the laptop, I do want to say it actually is a pretty nice piece of hardware. Yes, it is quite plastic-y. But the thing is you get pretty much everything you're expecting at this price point. Obviously, as you'll see in a second, the performance is solid when you have it fully assembled but you have a great keyboard like most Lenovo laptops. The touch pad does feel a little bit hollow since it is so plastic-y, but you have nice features like of course a standard SSD and eight gigs of RAM. But importantly you do have a fingerprint sensor as well as a little cover for the webcam. The thing here though I want to find out is where does it actually come in completely stock. I want to run a series of benchmarks and then we can begin our Frankenstein surgery to see exactly how much Ryzen can handle. So to begin with, I want to get a little bit of a benchmark. So I'm gonna run a few different benchmarks including 3DMark Time Spy to get a good sense of the graphics. I also do have Cinebench which is a good CPU test. And we'll throw in a copy of Geekbench as well just to see how this guy performs completely stock. If you've seen our video on the Asus Zephyrus G14 you'll know that the Ryzen fourth generation series for mobile is incredibly powerful. Not only does it have some of the best GPUs out there but having four, six and even eight cores in such a thin and ultimately cheap form factor is incredibly impressive. So I have pretty high hopes right now. So just for reference, this is a system with the Ryzen 5 4500U. Ideally, I would have gotten something with Ryzen 3 which is a four core processor. However, I couldn't actually get my hands on any of those right now. So instead I'm actually doing the mid range model with six cores. Alright, so I have all my benchmarks run. So I know where we're at for stock which obviously is very impressive since it is one of these new Ryzen laptops. So the next step is to shut this guy down and start the disassembly which I think should be easy. So we have four screws around the CPU socket. We have our two heat pipes which actually don't really seem to be particularly well stabilized. I think the back chassis mostly holds them on and they have one, two, three screws around the fan. So this little die has eight cores and a full GPU on board. It's like the size of my fingernail? But now I want to leave this completely open to the air and I want to take some thermal sort of imagery of it. So what I'm gonna do so I'm gonna essentially hook it up with a mouse, keyboard and an external monitor and see what happens. Hey, it works. Okay, it's working right now, literally with nothing cooling the processor at all, it is working. Oh, look at that, that's not terrible. Two gigahertz. Seems to be working, can I open up a video? A little stuttery, but this straight up works. I am using a Ryzen laptop. Okay, very stuttery. So my next task, I want to get the thermal camera out and start running some benchmarks and see just exactly how this is working. So to test I'm going to be using a Seek Thermal camera attached to the iPhone. So you can see that the camera is a toasty 36 degrees right now. But when we actually look at the laptop, at least on this side it's not crazy, it's seeing 36 degrees which is totally reasonable. So interestingly over here seems to be sort of one of the hotspots which I don't even know what that is. Maybe the VRM for the chip. The chip itself, I mean 56 degrees or so is definitely warm. The problem is that because I'm using a thermal camera, the actual chip itself you can see in the middle is dark which means that because it's reflecting it's actually not showing me the true temperature. Alright, here it goes nothing. Let's fire up Cinebench and see what happens. It literally throttles at 0.38 gigahertz. Oh, it crashed, it was working so well, oh man. So a good question is why does this work and this might not? Well, the difference is that there's really nothing besides air. That's just sort of hitting the back of the laptop right now. Where this is directly attached. So between that thermal paste, the copper heat pipes and this fan, it actually can move a fair bit of air and efficiently transfer the heat from the processor to well the air. So let's see if this actually works. At least it's not crashing now, so that's good. Oh, look at that, that is dramatically better. So right now we're sitting at 2.9 gigahertz. What are you trying to tell me? This actually works? We'll come around back here. Oh, the temperatures were actually a little bit warmer than they were before. So we're still seeing actually really solid performance, before we were stuck at like 400 megahertz. With the actual fan blowing on the laptop? We're now pretty consistently sitting at 2.7 to 2.9 gigahertz on one core. I like don't even really know what to say about this. Like obviously it's very impressive. And now we're starting to throttle down to like one gigahertz but like it's incredibly impressive that we've come so far to the point where, not that long ago a laptop like this would have a dual core processor like two, 2.5 gigahertz. But now we have six cores with essentially zero cooling all still running. I mean, yeah. It's throttle city, but it's not dead. Okay, so surprising no one the multi-thread didn't actually make a big difference. So if you look at the actual score which we should have gotten which is about 2382 that is a big hit with. Well, no cooling but it's still really impressive. The real test. Can we play Crysis without any CPU cooling and GPU cooling whatsoever? So I'm turning down all of my settings to minimum. Let's see if I can actually get a decent frame rate here. Okay, 20, 20-ish FPS. Is this a great experience? Absolutely not. Is it super stuttery? Yeah, but I'm getting like 20 FPS. Come on. Oh, it died. It died! Look do not try this at home but the fact that we're able to play a game which would have stressed a laptop like this from just a couple of years ago even with full cooling is incredibly impressive. So stay in school. Cool your processors. Don't try this at home and subscribe to the channel for more ridiculous nonsense like this. Now if you'll excuse me, I'm gonna go put this back together. I think its a little, little bit much right now. (upbeat music)",
    "transcript_keywords": [
        "Express VPN",
        "Ryzen",
        "VPN",
        "bit",
        "CPU",
        "Express",
        "egg",
        "heat",
        "processor",
        "hot",
        "Yeah",
        "laptop",
        "cook",
        "good",
        "Ryzen laptops",
        "degrees",
        "Alright",
        "sort",
        "pretty",
        "CPU fan"
    ],
    "transcript_entity_values": [
        "2.5 gigahertz",
        "56 degrees",
        "109",
        "Frankenstein",
        "six",
        "IHOP",
        "Graham",
        "Ryzen 3",
        "third",
        "four minutes",
        "three",
        "iPhone",
        "20 FPS",
        "the other day",
        "hundreds of dollars",
        "two millimeters",
        "3DMark Time Spy",
        "first",
        "Ryzen",
        "RAM",
        "2.7 to 2.9 gigahertz",
        "the United States",
        "eight",
        "93",
        "20-ish",
        "a couple of years ago",
        "Twitter",
        "yesterday",
        "Express",
        "Express VPN",
        "two",
        "about 100 degrees Celsius",
        "Windows",
        "59 degrees",
        "Two gigahertz",
        "about 37 degrees Celsius",
        "four",
        "94",
        "2.9 gigahertz",
        "Austin",
        "Crysis",
        "one",
        "Geekbench",
        "second",
        "about 220 degrees",
        "81 degrees",
        "Ryzen 4000",
        "36 degrees",
        "a little less than",
        "0.38 gigahertz",
        "about 2382",
        "90",
        "Lenovo",
        "95 degrees",
        "95",
        "all day",
        "CPU",
        "three,",
        "three months",
        "zero",
        "SSD",
        "Ryzen",
        "Cinebench",
        "20",
        "the Asus Zephyrus G14",
        "VPN",
        "One",
        "five minutes",
        "GPU",
        "today",
        "400 megahertz",
        "one gigahertz",
        "Ryzen"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "LAW",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "QUANTITY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "GPE"
    ],
    "vector": [
        -0.09516588598489761,
        -0.0012427230831235647,
        0.0478610098361969,
        0.048585858196020126,
        0.028559673577547073,
        -0.018126672133803368,
        0.008572226390242577,
        0.006970229558646679,
        -0.017769476398825645,
        -0.037931982427835464,
        -0.033124882727861404,
        0.00772168068215251,
        -0.07843580842018127,
        -0.0502101331949234,
        -0.009277318604290485,
        -0.04521765559911728,
        0.15694420039653778,
        -0.05140725523233414,
        -0.04053886979818344,
        -0.03675922006368637,
        0.0015759456437081099,
        -0.0812678262591362,
        0.05845942720770836,
        -0.02200707420706749,
        0.0034384634345769882,
        0.0029617645777761936,
        0.10038994997739792,
        0.07092874497175217,
        -0.010511636734008789,
        0.04055766761302948,
        0.08606942743062973,
        -0.07122323662042618,
        -0.09625773131847382,
        0.023700829595327377,
        -0.06895879656076431,
        -0.01873675547540188,
        0.0013327294727787375,
        -0.027607476338744164,
        -0.07789324223995209,
        -0.04162922129034996,
        0.03793312609195709,
        -0.02385372668504715,
        0.005537340417504311,
        0.02155502699315548,
        0.06939110904932022,
        0.027993585914373398,
        -0.02175118960440159,
        -0.06018407270312309,
        -0.031185999512672424,
        -0.031935885548591614,
        -0.010960385203361511,
        -0.04007565975189209,
        -0.010052522644400597,
        -0.06571841239929199,
        -0.034604668617248535,
        0.04495468735694885,
        0.005234746262431145,
        -0.026372849941253662,
        -0.02589765004813671,
        0.02494226209819317,
        0.07970347255468369,
        -0.10053148865699768,
        -0.025569874793291092,
        -0.003404410555958748,
        -0.019420241937041283,
        -0.08385846018791199,
        0.07797253131866455,
        0.10571693629026413,
        0.07244254648685455,
        -0.010759415104985237,
        -0.019543124362826347,
        -0.010313685052096844,
        0.02512347884476185,
        -0.009632321074604988,
        -0.02792508527636528,
        0.005500247236341238,
        0.062132325023412704,
        -0.07607131451368332,
        0.02061104029417038,
        0.009916256181895733,
        0.03995666280388832,
        -0.004080421756953001,
        -0.017839692533016205,
        -0.10069815069437027,
        -0.02115115150809288,
        0.019322752952575684,
        0.024666475132107735,
        0.03876881301403046,
        0.08793846517801285,
        -0.08796297013759613,
        -0.015006250701844692,
        0.063742995262146,
        0.05697467923164368,
        0.011167097836732864,
        0.12860341370105743,
        0.039871759712696075,
        -0.0007109517464414239,
        -0.03347227722406387,
        -0.014276372268795967,
        -0.006851256359368563,
        0.004375280346721411,
        0.04879116266965866,
        -0.024046320468187332,
        0.07498542219400406,
        0.012193839065730572,
        0.021005474030971527,
        -0.016216998919844627,
        0.05067001283168793,
        0.0769771933555603,
        -0.020898010581731796,
        -0.10150719434022903,
        0.061351485550403595,
        0.0034441163297742605,
        0.006530109792947769,
        -0.008486414328217506,
        -0.0011098140385001898,
        -0.007872475311160088,
        -0.0361320935189724,
        0.058019936084747314,
        0.0395946279168129,
        -0.03773145005106926,
        0.055382031947374344,
        -0.03184612840414047,
        -0.03173594921827316,
        0.035922590643167496,
        2.6891813831753097e-05,
        -0.05268767476081848,
        5.191654554379129e-33,
        -0.04586652293801308,
        0.062309350818395615,
        0.009143603965640068,
        0.006229682359844446,
        0.0946061909198761,
        0.017022499814629555,
        0.01793326437473297,
        -0.014618968591094017,
        -0.027148667722940445,
        0.022144170477986336,
        0.02978394739329815,
        -0.06279797852039337,
        0.024139031767845154,
        0.0721341148018837,
        -0.029130209237337112,
        -0.10364611446857452,
        0.05756845325231552,
        0.014666344039142132,
        0.06958526372909546,
        -0.021994195878505707,
        -0.028762707486748695,
        -0.07763109356164932,
        0.03315616771578789,
        -0.011026588268578053,
        -0.03594564273953438,
        -0.031875722110271454,
        -0.031283531337976456,
        0.036445192992687225,
        0.04893229901790619,
        -0.018662460148334503,
        -0.033169858157634735,
        -0.07540736347436905,
        -0.13138717412948608,
        0.004509712103754282,
        6.467880302807316e-05,
        -0.012951248325407505,
        -0.024451076984405518,
        -0.021219328045845032,
        0.023162811994552612,
        0.030628979206085205,
        -0.0229866411536932,
        0.014270180836319923,
        -0.07966979593038559,
        -0.001800702535547316,
        -0.0979059711098671,
        0.02059295028448105,
        -0.04505331069231033,
        0.03085056133568287,
        -0.06177779659628868,
        -0.04838400334119797,
        -0.05729624629020691,
        0.007264931220561266,
        0.019076142460107803,
        -0.023344919085502625,
        0.028944678604602814,
        -0.04218019172549248,
        0.07735705375671387,
        0.018510129302740097,
        0.08573142439126968,
        0.007628224790096283,
        0.005757832899689674,
        -0.007067366968840361,
        -0.09282100945711136,
        -0.003552099457010627,
        -0.0629153922200203,
        0.04088066518306732,
        -0.0188602264970541,
        -0.0062662758864462376,
        0.06574924290180206,
        0.026896126568317413,
        0.052408017218112946,
        0.013393987901508808,
        0.04053162783384323,
        -0.06189410760998726,
        0.07891622930765152,
        0.06493488699197769,
        -0.028477007523179054,
        0.01615946739912033,
        -0.09282393008470535,
        -0.001898176153190434,
        0.03741857782006264,
        0.05894160643219948,
        -0.035774607211351395,
        0.023097189143300056,
        -0.05325111001729965,
        0.008221104741096497,
        -0.04098769277334213,
        -0.03290821611881256,
        0.0828920379281044,
        0.034352079033851624,
        -0.03733467310667038,
        -0.03297538310289383,
        0.1615775227546692,
        0.029378172010183334,
        -0.030298694968223572,
        -3.62948133685385e-33,
        -0.0737694799900055,
        0.055241506546735764,
        -0.05447355657815933,
        0.0661163255572319,
        0.037143200635910034,
        -0.004935636185109615,
        0.06656844913959503,
        -0.02162359282374382,
        -0.0007678490364924073,
        -0.12591762840747833,
        -0.009649103507399559,
        -0.05682504177093506,
        0.04111872985959053,
        -0.016908936202526093,
        -0.057734712958335876,
        0.0179507527500391,
        -0.02231907844543457,
        -0.05903851240873337,
        0.04911819100379944,
        0.01825336553156376,
        -0.0481729619204998,
        0.06977838277816772,
        -0.06267817318439484,
        0.04790470004081726,
        0.007990576326847076,
        0.08121418207883835,
        -0.021055061370134354,
        0.045844029635190964,
        -0.03193948417901993,
        -0.014212926849722862,
        -0.026417670771479607,
        -0.07581190019845963,
        0.04481877386569977,
        0.0077181244269013405,
        0.030330682173371315,
        0.04915012791752815,
        0.07761983573436737,
        0.07587023824453354,
        0.0018304242985323071,
        -0.036398570984601974,
        0.05398859456181526,
        -0.0009437971166335046,
        -0.055790454149246216,
        0.08732512593269348,
        -0.05376870557665825,
        0.0733405128121376,
        -0.02069920115172863,
        -0.07186360657215118,
        -0.03511395305395126,
        0.022257931530475616,
        0.015029080212116241,
        -0.07863917946815491,
        -0.05177707597613335,
        -0.006886044517159462,
        0.011233752593398094,
        -0.01681443862617016,
        0.05766081064939499,
        0.01639595255255699,
        0.024778611958026886,
        -0.017465714365243912,
        0.061466578394174576,
        -0.05836040526628494,
        0.07890433818101883,
        0.026493975892663002,
        0.06999145448207855,
        0.0032964397687464952,
        0.028037074953317642,
        0.05611414462327957,
        0.09067776054143906,
        -0.03232986107468605,
        -0.0496453233063221,
        0.06169116124510765,
        0.0689157024025917,
        0.03419545292854309,
        0.01811700128018856,
        -0.02031521685421467,
        0.09529171139001846,
        -0.021817820146679878,
        -0.05434595048427582,
        0.025760140269994736,
        -0.04809439182281494,
        -0.011188222095370293,
        -0.04397761449217796,
        -0.0779801532626152,
        0.10583417862653732,
        -0.06568081676959991,
        0.019613953307271004,
        -0.043493617326021194,
        0.023703137412667274,
        -0.026652144268155098,
        -0.001544593833386898,
        -0.013710937462747097,
        -0.011699842289090157,
        0.06842201203107834,
        0.07668125629425049,
        -5.499925848084786e-08,
        0.08253538608551025,
        -0.11215322464704514,
        0.0005215502460487187,
        0.0844045877456665,
        -0.019007764756679535,
        0.012596751563251019,
        0.019104307517409325,
        -0.17810042202472687,
        0.09903040528297424,
        0.04161117970943451,
        -0.0462397001683712,
        -0.05516006797552109,
        0.04397866502404213,
        -0.019908292219042778,
        -0.0380692221224308,
        -0.02635898068547249,
        0.02111235074698925,
        0.04265941306948662,
        -0.015332954004406929,
        -0.04684222862124443,
        -0.0011968112085014582,
        0.09424859285354614,
        -0.022912662476301193,
        -0.04119173064827919,
        0.040613412857055664,
        4.491845902521163e-05,
        -0.023539505898952484,
        0.015785640105605125,
        0.0040590506978333,
        -0.013247881084680557,
        -0.09419984370470047,
        -0.0404464416205883,
        0.08312713354825974,
        0.027244502678513527,
        -0.0028058765456080437,
        -0.02413265034556389,
        0.009078552946448326,
        0.03599625825881958,
        0.026608994230628014,
        0.008007400669157505,
        -0.04647814854979515,
        -0.04975419491529465,
        0.01283577736467123,
        -0.011511629447340965,
        -0.0660986676812172,
        -0.09275828301906586,
        -0.10560321062803268,
        -0.05088844522833824,
        0.038152359426021576,
        0.11738742142915726,
        0.05994787439703941,
        -0.0033636298030614853,
        0.10010188072919846,
        0.04013463854789734,
        0.07622094452381134,
        -0.04600273817777634,
        -0.043159402906894684,
        0.010601066052913666,
        0.05732303112745285,
        0.0508258119225502,
        0.01812550611793995,
        0.0013033471768721938,
        -0.05805734917521477,
        -0.06006670370697975
    ]
}