{
    "id": "MYBef-Ggm8c",
    "title": "How to Waste $517.23 on Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-09-06T16:19:33Z",
    "video_url": "https://www.youtube.com/watch?v=MYBef-Ggm8c",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "unboxing",
        "amazon",
        "how to waste",
        "flight simulator",
        "microsoft flight simulator",
        "flight simulator 2020",
        "rhinoshield",
        "rhino shield",
        "iphone",
        "iphone se",
        "thunderbolt",
        "thunderbolt 3",
        "magnetic thunderbolt",
        "magsafe",
        "hhkb",
        "happy hacking keyboard",
        "keyboard",
        "wish",
        "ebay",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 2228667,
    "likes": 70527,
    "comments_count": 2813,
    "description": "Today on Mystery Tech we fly Air Austin for the first and last time. 20% Off Code: \"AUSTIN\" (valid for 48 hours!) RhinoShield 3D Impact Screen Protector:  SolidSuit Case:  All RhinoShield Cases:   MagSafe Thunderbolt 3 adapter on Amazon:  Electomagnetic Railgun toy on Amazon:  Happy Hacking Keyboard Hybrid keyboard on Amazon:  idk I'm sure you can find Beyblades on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://bit.ly/AE-3D",
        "http://bit.ly/AE-SSA",
        "http://bit.ly/AE-RS",
        "https://austin.tech/magsafetb3",
        "https://austin.tech/railgun",
        "https://austin.tech/hhkb",
        "https://austin.tech/beyblade",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to Mystery Tech. The show where I unbox Why, what are you doing? - YEET (phone clatters) (drum intro) - Is that an iPhone SE? (cases clatter) You almost got me with that one. You almost knocked me out. Why do I have a RhinoShield Solid Suit case and screen protector and iPhone SE? Is Mystery Tech today just me abusing an iPhone SE? - Thank you very much to RhinoShield for sponsoring this episode of Mystery Tech and allowing us to continue our ridiculousness. So I know that with a standard glass screen protector, it's usually the way to go, right, because you do get that sort of very smooth glass feel but the downside is, if you've ever used one of these, you've probably cracked it chipped it, whatever the case is and as soon as you do that, it's sharp. You just gotta get rid of the whole thing. So this is what it's like if you have a standard glass screen protector. So if I go to break it - [Ken] No, no, no wait, wait, wait no, that's not what I got that's not what I got the - What do you want me to do? - Dude. Dude, dude, dude. You protect your hands. Protect your hands. - Oh. - Dude. That's, oh my God. - Right. Okay, okay. (crack) - Is everyone okay? I definitely saw glass fly all over the room. So this is our RhinoShield 3D Impact screen protector, which I can already tell is not anywhere near as bad because it's super flexible. This is made of some kind of polymeric material which means that it sort of feels like glass but I can bend that. That's not breaking. No, no, no. Here's the difference. So, why don't we actually see how well this works in the real world. And by the real world, I mean an incredibly contrived drop test to see if I can break it. (tapping) That's pretty good. So to really put your RhinoShield to the test, on top of the screen protector you should also take advantage of one of their fine cases or bumpers. In this case, I have the Solid Suit with my name on it. Now this is good for up to eleven feet of droppage. That's more than eleven feet but why don't we give it a try? See if it actually survives? You ready? Three, two, one. (phone clatters) Whew, that was a good bounce. Let's go down, let's go see it. (slow-mo clatter) How's it look Matt? Don't touch it, I mean I'm not really stressed. I'm sure it's fine right? I mean it's a little dirty but it's totally fine. Look at that. I mean the case has definitely eaten up the abuse, but I mean that's a pretty decent drop. - [Ken] Oh look at that. Just as new. - Look at that, no problems whatsoever. It's a little dirty but that's fine. So if you would like to check out RhinoShield I have a link in the description where you can pick up not only one of their excellent screen protectors, but also one of their wonderful cases or bumpers. Stop. Stop. Just, okay we get it. It works. Okay. Can I ask why there's a monitor and a Thunderbolt GPU on my desk? - The MagSafe Type C adaptor. So, if you're familiar with Apple's wonderful MagSafe this was a magnetic charging cable for MacBook that was unceremoniously tossed aside in favor of USB Type C, which has many advantages but one of the advantages it does not have is the fact that it will not actually disconnect when you trip over it. I mean it looks like it's machined well by Upmely. Oh, wow that's a lot of pins. So basically they have to be really on point with the signaling here. So let's try the most simple version of this: charging a phone. So if we plug it in right now (plays note) Hey, okay so at the very least it will charge your device and then if I pull it out boom, stops charging. Plugs in, charges. Okay so let me get my MacBook and actually see if this works via Thunderbolt. So if I attach this to the MacBook theoretically everything will light up. You ready? Oh, it's getting some power. Is my GPU on? No my GPU is not doing anything though. Oh, dude the cable is too thick. Hold on, I actually need to put it here. The cable is so thick that it's thicker than the MacBook so when I set the MacBook down it trips out. So it is, oh, oh! - [Tech Crew] Whoa! - It works! - [Tech Crew] That's cool. - So the cable is pretty thick so if you're using with most laptops you have to be pretty careful because while the magnets are strong it's a little bit of a tight fit. So I don't know how much I can speak to the longevity of something like this and realistically, you're probably not gonna be using it for Thunderbolt all the time. You probably want to use it more for like charging and stuff. At the very least, it actually is unbelievably a real, fully magnetic Thunderbolt three connector. (box thuds) (laughs) A mini electromagnetic rail gun. What is this? What does it shoot? Excellent. Okay, so I got some flags. Oh! With China, India, and Spain. Let's see how this works. I've actually gotten really excited about all this. What's wrong with India? India is a wonderful country, Matt how dare you try to talk (beep) about India. No! I'm giving shout outs to countries. Shout out to India, yo. Shout out to El Spain. (tech crew laughs) Yeah. Not suitable for children under eight years old. Shouldn't have given me this one. So I think I just press the button that works. Do you think it will work if I press the button right now? Ready? Three, two, one. Whoa! Oh that was cool. That was really fast I wasn't really expecting, that was the rubber one. All right let's try one more time, shall we? Okay, I see you, I see you. Save Japan while you can. Oh, that was a little bit more power in that. So, look. This is a fun little toy. It is not as dangerous as it seems. It seems quite dangerous and if I had a more powerful power supply I'd be able to turn it up a lot more but as far as your electromagnetic rail gun needs, it's hard to argue that the Towelie mini electromagnetic rail gun shooting toy is not exactly what it says on the box. They always do. Okay. A generic brown box. How exciting is this? Happy Hacking Keyboard. How much did you pay for the Happy Hacking Keyboard Professional Hybrid? Mm. That is, as the kids say, a lot of (bleep) money, Ken. (all laugh) All right, all right, all right. Let me actually try this one. So that is an interesting stand. So we've got feet for it. What is this? Oh, is this where the batteries go? 300 dollars and you need double A batteries Ken? What, what is this layout? Wait so this is a Mac layout? - [Ken] Yes. - So it's, wait shift, alt, why? Where's my arrow keys. I just have blank spaces. So let's see how my Happy Hacking Keyboard works. This is a little bit of a weird layout so I don't think I'm gonna be super fast. Ready? - [Ken] Yes. - Oh god. Oh god. Oh that's bad. Oh! It's so weird. Oh, Jesus. 69 words per minute, nice, and 87 percent accuracy. So the keyboard actually feels really nice. The layout though is maddening. My delete key is right above my return key whereas a normal keyboard, it is two keys up. I know it's legendary. I know a lot of people like it. This, to me, is a little bit hard to swallow. As is 300 dollars. So, you know. I'm not gonna swallow money don't even think about it. (box rustles) Is this, did you get a bunch of Beyblade stuff? - [Ken] I did. This was actually recommended by our viewers. - I've never felt older in my life. - [Both] Three, two, one. Let it rip! (quack) - [Ken] Oh god. Mine went off. - [Tech Crew] Austin wins! That's a point for Austin. - [Ken] I almost destroyed his MacBook. - [Austin] Don't do that. - All right ready? - [Both] Three, two, one. Let it rip! (quack) - [Ken] Oh, I killed myself. - [Austin] Am I two and oh right now? - [Ken] I killed myself on that one. You know what, I need to be on the other side of this. - [Both] Three, two, one. Let it rip! - Go, go, go, go, go! - Oh no you don't. (quack) - [Ken] Oh, I won yay. - [Austin] Attack! - [Ken] Keep going. Yeah. Keep hitting him. Keep hitting him. Yeah, yeah, yeah, yeah. - [Both] Three, two, one. Let it rip! (quack) - [Austin] Excellent. Thank you very much. - So you don't seem exactly thrilled by Beyblades. - Beyblades, no I'm old. - All right, I got something else. I got something else. - Okay. The Koss Pro4 AA Headphones. So why my dear friend, do I have a pair of Koss headphones on the table? Okay. Oh those are very nice looking. Wow, that's pretty cool. You're gonna take these home right. Yeah. (laughs) They look like pilot headphones. You're totally right. I'm gonna be a pilot today. Oh wow those are, oh these are so heavy. Oh. Is there no adjustment? There's no adjustment is there? Is that a suitcase? Why'd you just bring a suitcase over? Yeah, it's got all the, look. It's got Paris on it, explore the world, Tokyo. Oh wow, yeah, that's Flight Simulator, all right. So a professional access lever simulation controller. This is a whole Flight Simulator setup. Whoa! Hold on a minute. Can you see this? Holy. Thrust master, the PA linear pendulum Okay, I can't read. Hold on, Hold on, Hold on. Thank you very much for flying Air Austin today. We hope you are having a pleasant journey and we hope you are not particularly seasick because we are about to get a little crazy on this one. I'm a true pilot. I fly on instinct. There we go. Okay here we go. Gonna bank a little hard on this turn. Sure it'll be fine. Whoo-hoo! All right, all right We're killing our engines. Okay, hold on. Hold on, we're coming in. We're coming in. It's okay. It's okay Okay it's fine. It's fine! We're going down! Hold on! Hold on! I DON'T KNOW HOW TO STOP A PLANE! NO! Hold on! we're going down! - [Ken] I think we're just dead now. Yeah, I think we're just dead now. - No, no I got it, I got it. We're good, we're good. We're good. - [Ken] No, you're not stopped yet. - It's okay, we're there. We're there. We did it. Thank you very much for flying Air Austin. Please give us a five star review and until next time, thanks for flying the friendly skies.",
    "transcript_keywords": [
        "Mystery Tech",
        "Hold",
        "Yeah",
        "screen protector",
        "Happy Hacking Keyboard",
        "glass screen protector",
        "fine",
        "works",
        "Dude",
        "Hacking Keyboard",
        "screen",
        "Mystery Tech today",
        "India",
        "good",
        "Happy Hacking",
        "Keyboard",
        "MacBook",
        "protector",
        "Mystery",
        "Tech"
    ],
    "transcript_entity_values": [
        "Air Austin",
        "iPhone SE",
        "three",
        "MacBook",
        "USB Type C",
        "Towelie",
        "MacBook",
        "Three",
        "Hacking Keyboard",
        "China",
        "MagSafe",
        "more than eleven feet",
        "Ken",
        "Austin",
        "PA",
        "a Thunderbolt GPU",
        "two",
        "Mm",
        "Apple",
        "Matt",
        "El Spain",
        "Thunderbolt",
        "Beyblades",
        "Beyblade",
        "Japan",
        "Austin",
        "one",
        "India",
        "Paris",
        "the Solid Suit",
        "Whoo-hoo",
        "five",
        "Jesus",
        "RhinoShield",
        "the Happy Hacking Keyboard Professional Hybrid",
        "Spain",
        "87 percent",
        "The Koss Pro4 AA",
        "Thunderbolt",
        "Koss",
        "Mac",
        "up to eleven feet",
        "a minute",
        "69",
        "under eight years old",
        "Mystery Tech",
        "GPU",
        "today",
        "Tokyo",
        "300 dollars"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "GPE",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "MONEY"
    ],
    "vector": [
        -0.10863767564296722,
        -0.045595891773700714,
        0.111429363489151,
        -0.03035668656229973,
        0.07838962972164154,
        -0.007283826824277639,
        0.14634425938129425,
        0.0015862825093790889,
        0.0036608362570405006,
        -0.0019753314554691315,
        0.0558558888733387,
        -0.006269460078328848,
        0.05893469974398613,
        -0.029712852090597153,
        -0.015121902339160442,
        -0.025595003738999367,
        0.08817309886217117,
        -0.08455077558755875,
        -0.08354916423559189,
        0.03925514966249466,
        -0.052723228931427,
        -0.0014113615034148097,
        0.013331963680684566,
        0.019985824823379517,
        -0.050119977444410324,
        0.01072753593325615,
        0.0009017696720547974,
        -0.034334611147642136,
        -0.07345937937498093,
        -0.13809621334075928,
        -0.004395532887428999,
        0.05051468312740326,
        -0.007004528306424618,
        -0.004362656734883785,
        -0.024334700778126717,
        -0.12760968506336212,
        0.01049585361033678,
        -0.023469481617212296,
        -0.0371868833899498,
        -0.025202607735991478,
        -0.0656089261174202,
        -0.06716285645961761,
        -0.018057014793157578,
        0.09069813042879105,
        -0.035391367971897125,
        -0.04177803546190262,
        0.04070664197206497,
        -0.04580901935696602,
        0.04802115634083748,
        0.05083971098065376,
        -0.03977202996611595,
        -0.05524067580699921,
        0.04594356194138527,
        0.014547753147780895,
        -0.026837775483727455,
        -0.021911222487688065,
        0.03882438689470291,
        0.013421093113720417,
        0.08539845794439316,
        -0.010569050908088684,
        0.03795696049928665,
        -0.055637333542108536,
        0.023265257477760315,
        0.053303834050893784,
        -0.0014872608007863164,
        -0.03661029040813446,
        -0.011638479307293892,
        0.04008094221353531,
        0.07889010012149811,
        -0.03275992348790169,
        0.015986280515789986,
        -0.010942605324089527,
        0.03737733140587807,
        0.0511176623404026,
        0.05451996624469757,
        0.08433634042739868,
        0.07922426611185074,
        -0.0492238849401474,
        0.052250709384679794,
        0.05088239908218384,
        -0.045498885214328766,
        -0.08316870778799057,
        -0.033125054091215134,
        -0.038400210440158844,
        0.05305333808064461,
        0.01683894172310829,
        0.013021859340369701,
        0.02531253732740879,
        -0.05155324190855026,
        -0.0059947785921394825,
        0.0006293515325523913,
        0.08959481120109558,
        0.0694858655333519,
        -0.02244645543396473,
        0.005694766528904438,
        -0.0026550767943263054,
        -0.03614281862974167,
        0.021082356572151184,
        -0.04045872017741203,
        0.07394389808177948,
        0.0337226502597332,
        0.024142222478985786,
        0.029508616775274277,
        0.028860608115792274,
        -0.016112493351101875,
        -0.0831206664443016,
        -0.06656987220048904,
        -0.04230531305074692,
        0.06640002131462097,
        0.0094649288803339,
        -0.003957049921154976,
        0.0003392354410607368,
        -0.029275447130203247,
        -0.006594362668693066,
        0.0077744219452142715,
        0.07750620692968369,
        -0.034668609499931335,
        0.09569837898015976,
        0.123795285820961,
        -0.023045845329761505,
        0.038521356880664825,
        0.07055585831403732,
        -0.05607817694544792,
        -0.07007387280464172,
        0.01193299237638712,
        0.02594841457903385,
        -0.11449306458234787,
        6.352977586118284e-33,
        0.028381474316120148,
        0.09308565407991409,
        -0.09036765247583389,
        -0.0059325904585421085,
        -0.009302647784352303,
        -0.04769177362322807,
        -0.03780492767691612,
        0.10380781441926956,
        -0.0565718375146389,
        0.053715791553258896,
        -0.08521254360675812,
        0.05748162791132927,
        -0.007780088577419519,
        0.021600598469376564,
        -0.023553049191832542,
        -0.01400881726294756,
        -0.06538237631320953,
        -0.03919147700071335,
        -0.05896107107400894,
        -0.04902505874633789,
        0.034972988069057465,
        -0.022912202402949333,
        -0.020103218033909798,
        0.03607255592942238,
        0.0030412462074309587,
        0.03255004063248634,
        0.027148885652422905,
        -0.0019639581441879272,
        0.0822528824210167,
        0.052546847611665726,
        -0.11448261886835098,
        -0.013747507706284523,
        0.015181438997387886,
        -0.0318974070250988,
        -0.0028684199787676334,
        -0.046807121485471725,
        0.021180404350161552,
        -0.13888350129127502,
        -0.025243226438760757,
        0.0008538156398572028,
        -0.06768987327814102,
        -0.0009803872089833021,
        -0.07352825254201889,
        -0.04787210747599602,
        0.019120434299111366,
        -0.02954341657459736,
        0.036071695387363434,
        0.002469043480232358,
        0.05026545375585556,
        -0.03726526349782944,
        -0.05341653525829315,
        -0.020214514806866646,
        0.07704191654920578,
        -0.03839404135942459,
        -0.027082467451691628,
        -0.040259718894958496,
        -0.03229431435465813,
        -0.051658421754837036,
        0.11725079268217087,
        0.048455651849508286,
        0.0173414945602417,
        0.0472714900970459,
        0.06514329463243484,
        0.03725312277674675,
        -0.06277056038379669,
        0.0179081242531538,
        0.04315218701958656,
        0.019181210547685623,
        -0.008499021641910076,
        0.052795082330703735,
        -0.030974851921200752,
        0.033964719623327255,
        -0.004688741639256477,
        -0.05579423904418945,
        -0.0033549091313034296,
        -0.026747046038508415,
        -0.05893493816256523,
        -0.049934107810258865,
        0.008442074991762638,
        -0.013580371625721455,
        -0.020374352112412453,
        0.022458650171756744,
        0.027277477085590363,
        0.022587254643440247,
        0.02494911663234234,
        -0.0683889240026474,
        0.011634827591478825,
        -0.05618823319673538,
        -0.018567955121397972,
        0.045891471207141876,
        -0.06240358576178551,
        -0.02528063766658306,
        -0.054392460733652115,
        -0.007522512227296829,
        0.007920529693365097,
        -7.134793736062403e-33,
        -0.0454723984003067,
        -0.08306955546140671,
        -0.05659406632184982,
        0.001428348128683865,
        -0.0009721932001411915,
        -0.03104838728904724,
        0.030612763017416,
        0.053374264389276505,
        0.025400565937161446,
        -0.018261604011058807,
        -0.03104453533887863,
        0.07073445618152618,
        0.030326230451464653,
        -0.0636451318860054,
        0.005089417099952698,
        -0.013158848509192467,
        -0.0298200324177742,
        -0.08439654111862183,
        0.0008511430933140218,
        0.03131581097841263,
        0.04631471261382103,
        0.019879983738064766,
        -0.04662340506911278,
        0.028487827628850937,
        -0.0017722701886668801,
        0.03626825660467148,
        0.06287276744842529,
        0.03785768896341324,
        0.0063962386921048164,
        0.07869087159633636,
        0.0016197283985093236,
        -0.016094667837023735,
        -0.03893851861357689,
        0.058218613266944885,
        -0.016448624432086945,
        0.02721450664103031,
        0.054180808365345,
        0.004566023126244545,
        0.025732120499014854,
        -0.1197412759065628,
        0.007568041328340769,
        0.04405619949102402,
        0.02719300240278244,
        0.04349832609295845,
        -0.005061900243163109,
        -0.04782311990857124,
        -0.014494047500193119,
        0.012446269392967224,
        0.032403502613306046,
        0.031440917402505875,
        0.04503818601369858,
        -0.05799061059951782,
        -0.005268575623631477,
        0.023927221074700356,
        -0.1279418021440506,
        0.019017726182937622,
        -0.01072188001126051,
        -0.004873048514127731,
        0.025996217504143715,
        0.040498945862054825,
        0.05280160903930664,
        0.015729185193777084,
        -0.009988408535718918,
        -0.023288756608963013,
        -0.017645491287112236,
        -0.011190447956323624,
        0.07835952192544937,
        0.07259400933980942,
        -0.0288267582654953,
        -0.04075242578983307,
        0.0003768657334148884,
        0.02652057446539402,
        -0.012744772247970104,
        -0.10094255208969116,
        0.03750211000442505,
        0.09238528460264206,
        0.015092942863702774,
        -0.019788013771176338,
        -0.053403086960315704,
        -0.006199727300554514,
        0.0485445000231266,
        0.032140035182237625,
        0.0470261424779892,
        0.0143257612362504,
        0.09182848036289215,
        0.08932492136955261,
        -0.011783366091549397,
        0.12914688885211945,
        -0.0033832259941846132,
        -0.01646675169467926,
        -0.04876634478569031,
        -0.020547764375805855,
        -0.052367519587278366,
        0.07756511867046356,
        0.0007009925902821124,
        -6.724772561028658e-08,
        0.036029163748025894,
        0.08503184467554092,
        0.02165292389690876,
        -0.007356975227594376,
        0.019245559349656105,
        0.004439744167029858,
        -0.06803346425294876,
        -0.020332209765911102,
        0.02146521955728531,
        -0.009964194148778915,
        0.03908325731754303,
        -0.0817340612411499,
        -0.08749674260616302,
        0.032077886164188385,
        0.05223645269870758,
        0.029349757358431816,
        -0.1271086484193802,
        0.042089082300662994,
        -0.07424408197402954,
        -0.06245245039463043,
        -0.025071589276194572,
        0.043387576937675476,
        0.0471799261868,
        0.014520666562020779,
        -0.018299391493201256,
        0.04850654676556587,
        -0.027547409757971764,
        -0.02117779292166233,
        0.06889034807682037,
        -0.03679009899497032,
        -0.06652311980724335,
        -0.019605815410614014,
        -0.028417186811566353,
        -0.0477508082985878,
        -0.05896986275911331,
        -0.06950371712446213,
        -0.010126215405762196,
        -0.037428244948387146,
        0.04389718919992447,
        0.020073290914297104,
        -0.009651324711740017,
        -0.17834006249904633,
        -0.002059285994619131,
        -0.010699741542339325,
        -0.07792966812849045,
        -0.06866477429866791,
        -0.06788065284490585,
        -0.09023771435022354,
        0.008157446049153805,
        0.05672941729426384,
        -0.008902724832296371,
        -0.13799647986888885,
        -0.010063250549137592,
        0.0929936021566391,
        0.07680071145296097,
        0.012354991398751736,
        0.04479106143116951,
        -0.034957822412252426,
        -0.016171174123883247,
        0.01903851144015789,
        0.11100957542657852,
        -0.10034788399934769,
        -0.028907040134072304,
        0.03046027570962906
    ]
}