{
    "id": "MzQZEcWekK8",
    "title": "The Leftovers: Tech I Missed In 2020",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-12-30T20:57:18Z",
    "video_url": "https://www.youtube.com/watch?v=MzQZEcWekK8",
    "category": "Science & Technology",
    "tags": [
        "galaxy buds live review",
        "galaxy beans review",
        "bose quietcomfort earbuds review",
        "bose earbuds review",
        "stellina review",
        "vaonis stellina review",
        "jaguar i-pace review",
        "chevy bolt 2020 review",
        "oneplus 8t review",
        "mrmobile",
        "best of 2020",
        "best tech 2020"
    ],
    "views": 290662,
    "likes": 14484,
    "comments_count": 766,
    "description": "Sponsored by dbrand. Skin your iPad Pro (or other devices) here:    [THE LEFTOVERS]  It happens during the best of years, so it goes without saying that it happened in 2020: some things just fell through the cracks! For the last MrMobile video of the year, Im purging the backlog to share overdue thoughts on products I didnt get around to covering, from earbuds to electric cars  heck, theres even a smart telescope in there! And in addition to just tying up loose ends, I talk about my coverage plans for 2021  which is good news for foldables and fun phones, and not so much for more mainstream mobiles. Im Michael Fisher; join me for the inaugural round of an annual tradition Im calling The Leftovers.   [SUBSCRIBE TO MRMOBILE]     [ABOUT THE LEFTOVERS]  The Leftovers is a medley of mini-reviews featuring a mix of products both purchased by MrMobile and provided by manufacturers. The comprehensive list follows:  Samsung Galaxy Buds Live / Galaxy Beans: review sample provided by Samsung  Bose QuietComfort Earbuds: review sample provided by Bose  Diesel on Fadelite: review sample provided by Fossil Group  Apple iPad Pro: retail product purchased by MrMobile/Future plc  Samsung Galaxy Fold / Galaxy Z Fold 2: retail products purchased by MrMobile/Future plc  OnePlus 8T: review sample provided by OnePlus  Vaonis Stellina: review sample provided by Vaonis  Jaguar I-PACE EV400 / Chevy Bolt 2020: press vehicles provided by Jaguar and GM   MrMobile does not produce videos sponsored by the subjects of those reviews; no manufacturer was given editorial input, content approval rights or an early preview of this episode. The lone sponsor of this video is dbrand.   [PRODUCTS IN THIS VIDEO]  Samsung Galaxy Buds Live / Galaxy Beans [Amazon Affiliate]:   Bose QuietComfort Noise Cancelling Earbuds [Amazon Affiliate]:   Diesel on Fadelite Smartwatch [Amazon Affiliate]:   Apple iPad Pro [Amazon Affiliate]:   OnePlus 8T [Amazon Affiliate]:   Stellina Smart Telescope [Vaonis]:   Vespera Smart Telescope [Vaonis]:   Jaguar I-PACE [Jaguar USA]:   2021 Chevy Bolt EV [GM]:    [WARDROBE]  MrMobiles space-age wardrobe provided by Volante Design.  Starfleet 2256:   Starfleet 2369:  Volante Masks:    [LINKS]  OnePlus 8T Review [Android Central]:   NebuloCity Episode 1: A Walk in the Stars [Chris Pearson]:   Star Trek LCARS Watchface [Facer.io]:    [CHAPTERS]  00:00 \"Falling Through The Cracks\"  00:30 \"Bose & Beans\"  02:28 Diesel On Fadelite  04:00 Apple iPad Pro  05:35 OnePlus 8T (... kinda)  07:05 Stellina Smart Telescope  09:29 Jaguar I-PACE, and MrMobile's car coverage in 2021   [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #stellina #galaxybudslive #boseearbuds #dieselon #ipad #oneplus #tech #ev #electriccar #jaguar #chevybolt",
    "description_links": [
        "https://dbrand.com/mrmobile-ipad",
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1VD",
        "http://mrmobile.tech/1VE",
        "http://mrmobile.tech/1VF",
        "http://mrmobile.tech/1VG",
        "http://mrmobile.tech/1VH",
        "https://vaonis.com/stellina",
        "https://vaonis.com/stellina-vs-vespera",
        "https://www.jaguarusa.com/all-models/i-pace",
        "https://www.chevrolet.com/electric/bolt-ev",
        "http://bit.ly/2W8swBA",
        "https://bit.ly/3njp04T",
        "https://bit.ly/2INEQpp",
        "https://www.androidcentral.com/oneplus-8t-review",
        "https://youtu.be/cuRYiHNWLpA",
        "https://www.facer.io/explore/search/star%20trek/popular",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- It happens during the best of years, so you knew it was gonna happen in 2020. Some things just fall through the cracks. So, for the last video of the year I'm purging the backlog to share overdue thoughts on products I didn't get around to covering. From earbuds to electric vehicles. There's even a telescope in there. Join me for the inaugural round of an annual tradition I'm calling, \"The Leftovers\". (upbeat music) Starting us off at number six, two pairs of true wireless earbuds that couldn't have less in common. I've been using Samsung's Galaxy Buds Live on and off since they arrived with my Note 20 Ultra review sample. For reasons that have very little to do with their sound. You see, I'm not wild about either the audio or the comfort on these. They don't fit as well in my ears as buds with in-ear gels and their sound is just okay. Partially because of what everyone reported when these came out, the active noise canceling just isn't that effective. But I do still use them because one, the sound is good enough for a guy who listens to podcasts just as often as he pumps Pinback. Two, the convenience is unmatched if you use one or more Samsung phones on the regular and three, after years of shipping earbud capsules that were just too big, this compact cuboid is as fresh a breath as the fanciful design of what we've all come to affectionately call the Galaxy Beans. Now contrast those with the Bose. The maker of the legendary quiet comfort line of headphones brought all its expertise to bear when it made these earbuds of the same name. They plug into the ears with a gel and twist-lock combo, they deliver some of the best noise canceling you're likely to find on earbuds, 11 customizable levels of it. And their sound stage is as rich as the Galaxy Beans are lacking. But just look at this horse pill. And not just in relation to the Beans. The Bose case is literally larger than some bars of soap I have in my bathroom. It'll cause questions in pockets, it'll even take up too much space in some bags, it's just ludicrously large. And at 280 bucks, the quiet comforts cost double what the Galaxy Beans do. Elsewhere in wearables, the most asked about smartwatch of the year is Clear. A lot of you loved the limited edition Clear Diesel On Fadelight when I covered it on Instagram back in September, and it's easy to see why. Transparent technology, even when it's only partially transparent will always catch the eye. And every time this Wear OS smartwatch has cameoed in a video the comments have lit up like a Christmas tree. Sadly, this one's cemented my doubts about Diesel's smartwatches. The foundation they're built on is proven, the generation 5 core from Fossil Group underpins everything from the Skagen Falster 3 to Fossil's own Carlyle. But something about Diesel's implementation always leads to problems. This one works better than the Diesel Axial but thanks to its poultry half gig of RAM and what I assume are a few unresolved software issues. It suffers from all the flaws that gave the Wear OS watches of yesteryear such a bad name. Stutters, slow performance and even occasional lockups. To add insult to injury, the once perfectly transparent band is already showing early signs of yellowing after less than four months. You can still get the translucent red and blue versions but when the same 200 bucks can buy you much better models from Fossil's own catalog, and my personal favorite the third generation Moto360 is now down to $129. Well, no matter how pretty it is, the Diesel On Fadelight is a tough sell by comparison. And speaking of tough sells, let's talk about the iPad Pro. I had plans to review the iPad Pro which I've been buying almost every year since it debuted. And I was gonna call it, \"The review you don't need for the tablet you do.\" Because everyone knows the iPad is the best tablet around. But then something happened which will be familiar to you subscribers. I leaned fully into foldables for 2020 and that meant my iPad took an immediate and permanent backseat to my Galaxy Fold and then Z Fold 2. Because when you have a tablet you can fold up and put in your pocket, you tend not to bother with its big brothers as much. That said, the iPad Pro still has its place with the expensive acreage on my 12.9 inch model really coming in handy when I put it to use as a second screen. In addition to the tablet app ecosystem and all the other conveniences, if you're already an Apple user, Sidecar really cements the iPad as not just another toy but a useful tool when I need some extra desktop. And before we move on I know you're wondering what makes my iPad so H-A-W-T, so a word from my sponsor. You know DBrand as the company that lets you customize your devices with almost as many looks as you can imagine. I know DBrand as the partner in crime I turn to when I drop my gadgets and need to cover up the evidence. Either way, DBrand makes quality skins at fair prices and you can hit 'em up at the link in the description. So, I was sitting here trying to figure out a way to say that I wouldn't be covering phones like the OnePlus 8T anymore. And I was really stuck for a minute until I watched the intro to Alex Dobie's review of this phone at Android Central. - [Alex] Basically take the OnePlus 8, flatten it out and improve the display a whole bunch, bump up the battery and add crazy fast charging. - [Michael] Now, Alex goes on to say that there are many other things to this phone. 'Cause of course there always are. And Android Central always covers them very well. But folks, this kind of mild iteration we're seeing between increasingly alike slabs of glass, it's dull. And that's part of what drove me to cover more cutting edge products like foldables and dual screen phones and dual screen laptops and wild combinations of all three. It's also what inspired my throwback series \"When Phones Were Fun\". Because I wanted to celebrate a time before phones became these indistinguishable anonymous candy bars. To be clear, I'm still covering a ton of phones. The flagship smartphones from the major brands are all on the list. And I'm looking forward to hitting that OnePlus 9, Galaxy S21, the iPhone 13, et cetera. But the in-betweens, those 9T's and FE's and SE's, you'll see fewer videos on those. And you'll see more on the foldables, rollables, wing nuts, throwbacks and sometimes products straight out of left field. Now, a good example of that latter category is a product that's mobile only in the sense that it connects to a phone or tablet, but it so completely appealed to my inner space nerd that I just had to review it. Meet Stellina. No, it's not a turret from portal. Instead, well, its massive price aside, It's kind of a telescope for the rest of us. Manufacturer Vaonis wanted to make a telescope that was easier to use. One that would connect to your phone or tablet, so stargazing wasn't limited to peering through an eye piece one at a time. So, the company sent over a sample of Stellina in winter 2019 when I was house sitting for my mom out in the country. A country whose cloudy November skies were sadly not conducive to sky watching. Fortunately for me, the skies of summer in Suffolk County suck less. Stellina's setup was just as easy the second time around. You just mount it to the tripod and connect its battery pack and then introduce it to your iOS or Android device. That gives the telescope it's GPS fix which it then cross references with a visual fix to get its head on straight. After that, you go into the app and basically shop for what faraway object you'd like to photograph. A half hour to two hours of self-tracking, exposure stacking later, bam! You've got your very own photo of the Dumbbell Nebula. I love being able to say that not only did I take this photo of an object 1,200 light-years away, but that I did it from my dad's porch. Now due to some compromises in the optics and sensor, the images are noisier than higher end scopes can output. And there is still a bit of motion blur, despite the auto tracking. Also don't expect to shoot our neighbor planets with this glass. Stellina is optimized for objects much further out, and it costs $4,000. That's a hefty premium for convenience and relative portability. Still, Vaonis has already announced a much more affordable sibling named \"Vespera\" currently on Kickstarter. And my astrophotographer friend, Chris Pearson sees a lot of potential for this new category of telescope. He shared a lot of great thoughts with me. I'll link to his YouTube channel and of course, to Vaonis and every product in this video in the description. (relaxing music) (wind roaring) Finally, there's the matter of cars. Specifically electric cars, more specifically how they fit into the channel going forward. See, when I started Mr. Mobile in 2016, electric vehicles were gonna be one of the channels tent poles. As such, I tried to log as much time inside alternative fueled vehicles as I could. Tesla test drives, hydrogen powered road trips, EVie excursions, concept car unveilings, single-driver cars, I even took a quick ride in the Cyber Truck. But with more automakers launching electrics, and these videos taking a lot of time and effort to shoot, there was just no way I could maintain the production pace to keep up. And to be honest, while the videos did okay, car videos have always underperformed on average which has real ramifications when it comes to how the YouTube algorithm treats a channel and therefore how healthy that channel can ultimately be. So, my last extended time with an EVie resulted in four days worth of footage that I've been trying to figure out what to do with for over a year. It was spent behind the wheel of the gorgeous and all electric Jaguar I-Pace with friend of the channel David Cogen of TheUnlockr riding shotgun on a Hollywood road trip that took us from the Peterson Automotive Museum to the Griffith observatory, to a variety of bars with questionable characters. To my West Coast hotel Mainstay, the RMS Queen Mary. While my intention was to review the I-Pace, as I say, you're not really here for car reviews and maybe I'm not either. It wasn't until I combined my memories of the I-Pace with a more recent jaunt behind the wheel of a new Chevy Bolt, that I realized, hey, charging an EVie as a new owner can still be really inconvenient. So, I want to talk about EVie charging infrastructure. And I've done a lot of talking about the technology packed under the hood of these things, but not so much about the cockpit and creature comforts, and how they stack up. And most importantly, taking a page out of David Cogen's book, I want to talk a lot more about the experiences these cars enable. A bit less about the cars themselves. Now, whether that takes the form of standalone videos or a new series or a tie-in with the road trip reviews that I now do for smartphones, I don't know. Point is, expect me to shake it a little on the auto front. And if you have suggestions or requests I'd love to hear 'em in the comments. (airplane roaring) But you know, as tiring and miserable and prematurely aging as this year has genuinely been. 2020 has also given me an opportunity to experiment with things like series ideas and new approaches to videos that I don't think would have been possible if I was still constantly on the road, like always. So, thank you for giving me the leeway to experiment with those things and figuring out what the Mr. Mobile of 2020 wants to be. And stay tuned for more surprises in 21. (upbeat music) This video featured a mix of review and retail devices both purchased by Mr. Mobile and provided by or loaned from their respective manufacturers. As always though, the opinions in this video are my own and no manufacturer was given editorial input, copy approval rights, or an early preview of this content. They're seeing it for the first time right alongside you. Until next time, thanks for watching. Keep those masks on when you're around others and cross your fingers for a better new year as you stay mobile, my friends.",
    "transcript_keywords": [
        "Galaxy Beans",
        "Galaxy",
        "Samsung Galaxy Buds",
        "time",
        "Galaxy Buds Live",
        "iPad Pro",
        "review",
        "phones",
        "iPad",
        "Diesel",
        "videos",
        "year",
        "video",
        "tablet",
        "Beans",
        "lot",
        "mobile",
        "phone",
        "cars",
        "Samsung Galaxy"
    ],
    "transcript_entity_values": [
        "Tesla",
        "Bose",
        "Z Fold 2",
        "Pinback",
        "21",
        "this year",
        "Vaonis",
        "the Peterson Automotive Museum",
        "two",
        "almost every year",
        "six",
        "Chevy Bolt",
        "5",
        "Galaxy S21",
        "Vaonis",
        "Two",
        "A half hour to two hours",
        "one",
        "SE",
        "winter 2019",
        "280 bucks",
        "Michael] Now",
        "Wear",
        "Instagram",
        "half",
        "Samsung",
        "DBrand",
        "Fossil Group",
        "Diesel",
        "four days",
        "20",
        "Fadelight",
        "RAM",
        "9",
        "TheUnlockr",
        "September",
        "years",
        "the Cyber Truck",
        "the Dumbbell Nebula",
        "OnePlus 8",
        "David Cogen",
        "three, after years",
        "Griffith",
        "200 bucks",
        "the iPad Pro",
        "iPad",
        "November",
        "Carlyle",
        "the iPad Pro",
        "Vespera",
        "129",
        "Galaxy Fold",
        "1,200",
        "Queen Mary",
        "Bose",
        "Apple",
        "Android Central",
        "YouTube",
        "OnePlus 9",
        "Jaguar",
        "Android Central",
        "less than four months",
        "West Coast",
        "second",
        "Beans",
        "the Galaxy Beans",
        "Alex",
        "a minute",
        "12.9 inch",
        "three",
        "2020",
        "a ton",
        "third",
        "When Phones Were Fun",
        "Alex Dobie's",
        "Stellina",
        "Kickstarter",
        "the year",
        "2016",
        "FE",
        "Chris Pearson",
        "iPad Pro",
        "Mobile",
        "Suffolk County",
        "first",
        "Hollywood",
        "David Cogen's",
        "4,000",
        "11",
        "over a year",
        "Fossil"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "FAC",
        "FAC",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "MONEY",
        "LAW",
        "ORG",
        "DATE",
        "LOC",
        "ORG",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORDINAL",
        "GPE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.1197136715054512,
        0.009775668382644653,
        0.12102177739143372,
        -0.005014521069824696,
        0.07920703291893005,
        -0.007515469565987587,
        -0.00934535264968872,
        0.04044608399271965,
        -0.09230504930019379,
        -0.0021334257908165455,
        0.07676797360181808,
        0.04301859065890312,
        0.04469401016831398,
        -0.007410266902297735,
        0.07711662352085114,
        -0.02932792529463768,
        0.04163181036710739,
        -0.08478109538555145,
        -0.028840402141213417,
        0.01963772252202034,
        -0.08408883959054947,
        0.03072870522737503,
        0.005302667152136564,
        0.011592594906687737,
        0.017439549788832664,
        -0.005056791473180056,
        -0.03752393648028374,
        -0.0632246658205986,
        -0.027557337656617165,
        -0.015615270473062992,
        0.009342918172478676,
        0.15575583279132843,
        -0.031915295869112015,
        -0.006416632793843746,
        -0.024727975949645042,
        -0.08730392158031464,
        0.00943820271641016,
        -0.01873435638844967,
        0.0002454974746797234,
        -0.0625055655837059,
        -0.03859901800751686,
        -0.06437692046165466,
        -0.018354222178459167,
        0.039371389895677567,
        0.01644706167280674,
        -0.07121866941452026,
        0.016393626108765602,
        -0.04948711767792702,
        0.021790510043501854,
        0.01364669669419527,
        0.007511377800256014,
        -0.016413919627666473,
        0.07611221820116043,
        0.050884950906038284,
        -0.048994071781635284,
        -0.016073478385806084,
        -0.051200345158576965,
        0.0353187657892704,
        0.050808846950531006,
        0.04760567843914032,
        0.0388365238904953,
        -0.1079336479306221,
        -0.0035241511650383472,
        -0.03743772208690643,
        -0.0018530851230025291,
        -0.028258830308914185,
        -0.033940885215997696,
        0.02499525621533394,
        0.03671468794345856,
        0.02364521101117134,
        -0.05848318710923195,
        0.020709829404950142,
        0.06412085145711899,
        -0.015422197058796883,
        0.05646603927016258,
        0.10607943683862686,
        0.08148986846208572,
        -0.025921646505594254,
        -0.021381454542279243,
        0.05975488945841789,
        -0.00958758220076561,
        -0.06798127293586731,
        -0.039963249117136,
        -0.08848093450069427,
        -0.007731251884251833,
        -0.0603974424302578,
        -0.024247601628303528,
        0.02001066319644451,
        -0.08279448002576828,
        -0.0017470283200964332,
        -0.046323128044605255,
        0.11280687898397446,
        0.0010496573522686958,
        0.03826303780078888,
        -0.032778482884168625,
        -0.026241235435009003,
        -0.09259387105703354,
        -0.02145496755838394,
        -0.00449425308033824,
        0.05792083218693733,
        0.024920256808400154,
        0.06978893280029297,
        0.08653176575899124,
        -0.0028332534711807966,
        0.03548146039247513,
        -0.08150243759155273,
        -0.0296726543456316,
        -0.054739005863666534,
        0.045595433562994,
        0.013402699492871761,
        -0.00052835006499663,
        0.027876388281583786,
        -0.0287712961435318,
        -0.003690112615004182,
        -0.03407219797372818,
        -0.017354875802993774,
        0.017051680013537407,
        0.08078233897686005,
        0.0914437398314476,
        -0.06321211904287338,
        -0.026029150933027267,
        0.045098740607500076,
        0.009735937230288982,
        -0.122553251683712,
        -0.020571673288941383,
        0.036242786794900894,
        -0.07401613146066666,
        5.0609517048531834e-33,
        -0.07172316312789917,
        0.017178423702716827,
        -0.01766258291900158,
        0.07348240911960602,
        0.0445038266479969,
        -0.012429926544427872,
        -0.07561405748128891,
        0.05259044095873833,
        0.05029011517763138,
        -0.004335368983447552,
        -0.024555891752243042,
        -0.001848822459578514,
        -0.08265704661607742,
        -0.03222839906811714,
        0.03885171562433243,
        -0.10577354580163956,
        -0.1053340882062912,
        -0.03500959649682045,
        -0.019724693149328232,
        -0.00688899727538228,
        -0.023121438920497894,
        -0.07636058330535889,
        0.01488448865711689,
        -0.011507554911077023,
        0.04028584435582161,
        0.05167350545525551,
        0.10273731499910355,
        -0.08633171766996384,
        0.055899910628795624,
        0.0393935889005661,
        -0.0361960344016552,
        0.03940702974796295,
        0.03430521860718727,
        -0.056613314896821976,
        -0.05621766671538353,
        4.898051884083543e-06,
        -0.03886514529585838,
        -0.058855075389146805,
        0.021628111600875854,
        -0.033955272287130356,
        -0.04436619579792023,
        0.025464296340942383,
        -0.04320849850773811,
        0.04352432116866112,
        -0.009027956053614616,
        -0.009299644269049168,
        0.06615336984395981,
        0.06980451941490173,
        0.08116555958986282,
        -0.0015094706322997808,
        -0.054480936378240585,
        -0.045971792191267014,
        -0.07067076861858368,
        -0.05865756794810295,
        -0.049649327993392944,
        -0.01056355144828558,
        0.008160264231264591,
        -0.07381857186555862,
        0.05851505324244499,
        -0.053834836930036545,
        0.02336832322180271,
        0.07266630977392197,
        -0.08814816921949387,
        -0.006434401497244835,
        -0.0676107257604599,
        0.08854115754365921,
        0.007787889335304499,
        -0.0319555327296257,
        -0.059884753078222275,
        0.01884377747774124,
        0.026276595890522003,
        0.0022028449457138777,
        -0.0015590148977935314,
        -0.04891986399888992,
        0.044378750026226044,
        0.01045719999819994,
        -0.02019016072154045,
        0.041225723922252655,
        0.03676411882042885,
        -0.08624476194381714,
        0.057156968861818314,
        0.01913519576191902,
        0.010468057356774807,
        0.018218258395791054,
        0.046240877360105515,
        0.0078017832711339,
        -0.035215750336647034,
        -0.11820454150438309,
        0.04241219535470009,
        0.010218960233032703,
        -0.05063798651099205,
        0.0010213629575446248,
        0.0008482722332701087,
        0.033687423914670944,
        -0.05605649948120117,
        -5.8028076590250675e-33,
        0.028193099424242973,
        -0.013986334204673767,
        0.021100429818034172,
        -0.01449885219335556,
        0.07999584823846817,
        -0.08104291558265686,
        0.015040901489555836,
        0.054576314985752106,
        0.054493844509124756,
        -0.060616858303546906,
        -0.038849007338285446,
        0.0616794191300869,
        -0.051520295441150665,
        -0.012269764207303524,
        -0.06635632365942001,
        0.0033655765000730753,
        -0.00390747981145978,
        -0.10737449675798416,
        0.010596104897558689,
        0.0015402467688545585,
        0.014740818180143833,
        0.030974581837654114,
        0.03370526805520058,
        0.07862400263547897,
        -0.019204087555408478,
        0.02831655740737915,
        0.04492092877626419,
        0.04697398468852043,
        0.03956390917301178,
        -0.0516173280775547,
        0.024779511615633965,
        -0.07862254977226257,
        0.04271717369556427,
        -0.025575440376996994,
        0.04839464649558067,
        0.03240450844168663,
        0.008097300305962563,
        -0.04209260269999504,
        -0.005813061725348234,
        -0.041979193687438965,
        0.06425806134939194,
        0.008168814703822136,
        -0.0440153069794178,
        -0.002727340441197157,
        -0.009338131174445152,
        -0.029670223593711853,
        -0.07557269930839539,
        0.037665341049432755,
        -0.041423965245485306,
        -0.008003192022442818,
        0.049666889011859894,
        0.046411555260419846,
        -0.06257835030555725,
        -0.03442689776420593,
        -0.044478174299001694,
        0.051642268896102905,
        0.05671639367938042,
        0.005763909313827753,
        0.012632197700440884,
        0.0008318058680742979,
        0.01941143348813057,
        0.013396666385233402,
        -0.002859589410945773,
        -0.12127146869897842,
        -0.03804857283830643,
        0.024594560265541077,
        0.10234206914901733,
        0.0010091994190588593,
        0.058235522359609604,
        0.015137674286961555,
        -0.012105242349207401,
        -0.0003906627534888685,
        -0.07085806876420975,
        -0.12930327653884888,
        0.028203684836626053,
        0.12862251698970795,
        -0.05714242905378342,
        -0.08537742495536804,
        0.03038616105914116,
        -0.057835690677165985,
        -0.02489112876355648,
        0.002682786900550127,
        0.013452807441353798,
        0.05878124386072159,
        0.10473208129405975,
        -0.04219011589884758,
        -0.008927805349230766,
        -0.0646137073636055,
        -0.05478207394480705,
        0.11509452015161514,
        -0.015076365321874619,
        0.03402727469801903,
        -0.06766967475414276,
        0.09436308592557907,
        0.07263799756765366,
        -5.889747001219803e-08,
        0.11103610694408417,
        0.06458458304405212,
        0.0030988508369773626,
        -0.03423251584172249,
        0.03626786544919014,
        -0.0782853215932846,
        -0.004619683139026165,
        -0.01144131924957037,
        0.10209617018699646,
        0.03800773620605469,
        -0.003012457862496376,
        -0.025452040135860443,
        -0.03641793131828308,
        0.0725330114364624,
        -0.005520223639905453,
        0.03763609379529953,
        -0.06435339897871017,
        0.08871505409479141,
        -0.06987559795379639,
        0.04429620876908302,
        -0.024277426302433014,
        0.060719601809978485,
        0.06712421029806137,
        -0.028598565608263016,
        0.07373841851949692,
        -0.01608746312558651,
        -0.021801961585879326,
        0.03194955736398697,
        0.0506206713616848,
        -0.021750010550022125,
        -0.039381228387355804,
        0.019064640626311302,
        -0.04910839721560478,
        -0.018819600343704224,
        -0.03181862831115723,
        -0.07415320724248886,
        0.021929342299699783,
        -0.026868682354688644,
        0.03299807384610176,
        0.022366706281900406,
        -0.03110009804368019,
        -0.09487273544073105,
        -0.041208598762750626,
        0.05266309157013893,
        -0.003110386896878481,
        -0.10171255469322205,
        0.0023642072919756174,
        -0.009922097437083721,
        -0.04764925688505173,
        0.09358936548233032,
        0.0017537144012749195,
        -0.046931684017181396,
        -0.017514482140541077,
        0.008806861937046051,
        0.030899416655302048,
        0.0015553528210148215,
        -0.02248573862016201,
        0.03867791220545769,
        -0.021328000351786613,
        -0.019730383530259132,
        0.008163150399923325,
        -0.03772240877151489,
        0.007761756423860788,
        0.12564052641391754
    ]
}