{
    "id": "N3k9lWz48rw",
    "title": "Summer Project - Make an INSANELY LOUD Bluetooth Amplifier!",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2015-08-17T18:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=N3k9lWz48rw",
    "category": "Howto & Style",
    "tags": [
        "amplifier",
        "sound",
        "music",
        "loud",
        "bluetooth",
        "wireless",
        "audio",
        "streaming",
        "ipod",
        "bose",
        "beats",
        "system",
        "melhobankof",
        "dekonifenta",
        "diy",
        "make",
        "bass",
        "project",
        "boombox",
        "Do It Yourself (Hobby)",
        "summer",
        "diyperks",
        "record",
        "cd",
        "tunes",
        "orchestra",
        "drums",
        "bookshelf speakers",
        "vinyl",
        "dj"
    ],
    "views": 2675773,
    "likes": 65448,
    "comments_count": 4090,
    "description": "In this video we'll be making a wireless bluetooth-enabled amplifier so that we can put old bookshelf speakers to good use! Not only is the sound quality fantastic, but it can also go super loud! It's also quite easy to build, and doesn't require any special tools - you can get away with just a hammer, nail, and a screwdriver if needed. Seriously!  Happy building!  Oh, by the way, here's the note about the little switches:  These switches change the gain mode of the amp. If they're both on, the amp can reach insane(er) volume levels. However, to hit these volume levels without distortion, the amp needs 25v, which is more than our batteries can provide. The amp is loud enough with them off, and it also means that the signal to noise ratio is MUCH improved, so I don't really recommend messing with them.  Parts links:   Disclosure: These are affiliate links. If you click them and make a purchase from the various merchants they link to, DIY Perks may earn a commission. Affiliate programs and affiliations include, but are not limited to the eBay Partner Network and Amazon Associates.   Here's the amp we'll be using:         Amazon:     eBay (ships globally):        Full parts list (includes international purchasing links):   OFFICIAL LINKS:  Support me on Patreon:   Official Website:   Discord:   Forums:   Twitter:",
    "description_links": [
        "https://amzn.to/2LTNccl",
        "http://rover.ebay.com/rover/1/711-53200-19255-0/1?icep_ff3=2",
        "https://docs.google.com/document/d/1_QFMFvOnSVxPGSobcSUu6EKzrBZ9FB-dHIpLOE9gW3Y",
        "https://www.patreon.com/DIYPerks/",
        "https://www.diyperks.com/",
        "https://diyperks.com/discord-server/",
        "https://diyperks.com/community/",
        "https://twitter.com/DIYPerks"
    ],
    "transcript": "The sound quality of bookshelf speakers is usually pretty good, and used ones can often be picked up for next to nothing. This makes them excellent value, but using them with modern devices such as smartphones is a bit tricky, requiring the use of a power amplifier and lots of cables. So in this video, to get around this problem, we'll be making an independent super powerful bluetooth amplifier that can turn those dusty old speakers into retro party blasters! Not only is the audio quality absolutely brilliant, but it can also drive the speakers to ridiculously loud volume levels. Check this out. What you're about to hear is all live audio coming from the bluetooth amplifier, and I'm just going to turn up the volume as it plays. So as you can hear I'm already having to raise my voice quite a lot to be heard - but it can go louder. AND LOUDER!... SUPER LOUD! IT'S RIDICULOUSLY LOUD! So hopefully that's gotten you quite excited about this project, so without further ado, let's get building it! Oh, by the way, if you want to hear a distance test where I take it out to the middle of a field to hear how far away it can be heard, do stick around till the end of the video. These are the main components we'll need for this build, and you can find a full list along with international purchasing links in the description. The amp we'll be using features a built-in bluetooth receiver with playback controls, and a dual-channel 50w amplifier chip, yet the whole thing is only $15 including shipping. It's quite a bargain. A minor downside is that it is only available from China, so it can take a while to arrive. Because of this it's a good idea to order it sooner rather than later so that you aren't left waiting for it to arrive when you want to begin this project. So the first thing we'll do is make the aluminium panels, for which we need some 1mm thick aluminium sheets. The first thing we'll do to these sheets is trim them down into 6cm by 27cm rectangles. Thankfully, we don't need any special tools for this, as the aluminium is thin enough for us to trim them down by scoring grooves in the sheets' surface, and then bending the aluminium along these groves until they break free. If your aluminium has protective film on one side like mine did, you'll need to cut through that too. Now that we've trimmed down our sheets to the right size, we can make some holes in them for the supports to screw in to later. Four of these holes need line up with the mounting holes on the amplifier, while the other four need to be on either side of the smaller battery pack. Once we've marked where we want them to be, we can drill through both sheets at once using a 3mm drill bit. If you don't have access to a drill, do keep in mind that you can use a hammer and a nail to make these holes instead. We also need to make some additional holes through one of the sheets so that we can later hold the battery packs in place with cable ties. We'll call this sheet the base sheet now, as it will be on the bottom. The other sheet we'll now refer to as the lid. So, before we finalise these sheets, we need to work on extending the amplifier's playback buttons so that they can be operated easily. To do this we need to cut out a piece of Stratocell packaging foam that's long enough to cover the buttons, and high enough to be level with the top of the supports. I'll cover these supports in more detail later, but for now we need to get some screws and insert them into the foam at 1cm intervals so that the screw heads line up with the buttons on the amplifier. We can now drill matching holes in the lid for these screws to poke through. Whilst we're at it, we might as well make some holes for the output terminals too, so that we can easily connect the speakers to them later. Now we can use a file to clean up the holes and the edges of our sheets, not forgetting to round off the corners as well. The protective film can now be peeled off, and that's the sheets completed. Looking nice. It's now time to put it all together, starting with the battery packs. As you've probably noticed, we're using two of them - one of which holds 6 batteries, while the other holds 4 batteries. They need to be connected in series so that they work like one big battery pack with an output of around 12-15v. We can do this by connecting the red wire of one pack, to the black wire of the other pack. While I do recommend using a soldering iron for this, you can get away with just twisting the wires together. Now we can get a power jack and twist or solder it to the two remaining wires. This time red can be connected to red, and black can be connected to black. Once we're done we can insulate the joints with some tape. The packs can now be attached to the base sheet using cable ties, though keep in mind that it may be necessary to make some holes in the sides of the packs for the cable ties to fit through to make a loop. Now it's time to add the supports. We'll be using PCB standoffs for this, as they actually look pretty cool, and are easy to get hold of. We need four tall 25mm standoffs, and four shorter standoffs that, when combined, are around the same height as the tall standoffs. I've put a link to compatible ones in the description if you can't find any locally. So we'll start by screwing the taller 25mm standoffs to the base sheet on either side of the smaller battery pack. Once that's done, we can screw the shorter standoffs together through the amplifier's holes, and then mount it to the base sheet. Feel free to use washers if additional height is needed to match the height of the taller standoffs. We can now populate the battery packs with batteries. Rechargeables are a good choice for this because you can charge them up using the power jack so that you don't have to replace them every time the amp runs out of power. Before we screw on the lid we need to make sure that the amp's power button is switched on, and that both of these little switches are set to off. These little switches change the amplifier's gain mode, and if you want to know more about them I've written a little note in the video's description. The last thing to do is place our foam button extender over the buttons, and use some tape to hold it in place on the outer edge. Now we can put the lid on, tighten up all the screws, and we're done! Now you can sit back and admire your handiwork. Doesn't it look good? Now we can use some sticky back velcro to attach it to one of the speakers. Using velcro means that the speakers won't get damaged as the tape side of the velcro can be just peeled off if needed. Before we can try it out we need to wire up the speakers to the output terminals. I used an old mains cable for this as it looks quite neat. If you're wiring up two sets of speakers for stereo, remember that the two central contacts are the negative contacts, and the outermost contacts are the positive contacts. Wiring it up correctly just means that the speakers are kept in phase. To power it up, all we need to do is insert the jack into its hole, and after the startup sound, it's ready to pair with any bluetooth device you like. To give you another example of just how loud it can go, let's take it to the middle of a field and see how it fares. I'm going to do a range test now, so you can get a better idea of just how loud these are as it's kinda hard to tell over YouTube. So just remember that this is all coming from a relatively small amplifier, and it's obviously coming from my smartphone as well. So let's hit play. AS YOU CAN HEAR, IT'S SUPER LOUD UP CLOSE, SO WE'LL JUST WALK AWAY AND SEE HOW FAR WE CAN GET BEFORE IT STARTS GETTING TO A LEVEL WHERE WE CAN TALK OVER IT AT A NORMAL-ISH LEVEL. So we're about, I'd say, 30m away. It's a great volume - a good listening levels. So imagine if this was a party - 30m radius - that would serve a LOT of people. So I hope you've found this video and project super awesome, and don't forget to SUBSCRIBE and I'll see you next time. Bye for now!",
    "transcript_keywords": [
        "holes",
        "amplifier",
        "sheets",
        "speakers",
        "make",
        "sheet",
        "base sheet",
        "loud",
        "standoffs",
        "battery pack",
        "hear",
        "pack",
        "packs",
        "battery",
        "power",
        "ridiculously loud",
        "SUPER LOUD",
        "aluminium",
        "bluetooth amplifier",
        "time"
    ],
    "transcript_entity_values": [
        "first",
        "YouTube",
        "6",
        "1cm",
        "3mm",
        "6cm",
        "only $15",
        "China",
        "four",
        "two",
        "4",
        "25mm",
        "30",
        "50w",
        "some 1mm",
        "PCB",
        "jack",
        "Four",
        "one",
        "12-15v",
        "Stratocell",
        "Rechargeables",
        "four tall 25mm",
        "27cm"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "QUANTITY",
        "QUANTITY"
    ],
    "vector": [
        -0.044497277587652206,
        -0.030534597113728523,
        0.009313703514635563,
        -0.04147777333855629,
        -0.08516600728034973,
        -0.03459326922893524,
        0.04513968154788017,
        -0.0021133427508175373,
        -0.07293491065502167,
        0.06800652295351028,
        -0.01162419468164444,
        0.018299836665391922,
        0.05414324998855591,
        0.010148655623197556,
        0.00361235486343503,
        0.1716689169406891,
        0.06653127074241638,
        0.04410179331898689,
        -0.035163696855306625,
        -0.017232513055205345,
        -0.0014356744941323996,
        0.007882659323513508,
        0.02377677522599697,
        0.027239715680480003,
        0.057778142392635345,
        -0.03230249136686325,
        0.00676140608265996,
        0.015042120590806007,
        -0.09979656338691711,
        -0.04862862080335617,
        -0.012040277943015099,
        -0.04070981964468956,
        0.05500274524092674,
        -0.13836674392223358,
        -0.06332989782094955,
        -0.05503053590655327,
        0.019345559179782867,
        -0.005240194965153933,
        0.0631013810634613,
        -0.017539359629154205,
        -0.028883831575512886,
        -0.0016220269026234746,
        0.015620870515704155,
        -0.015687065199017525,
        -0.1150408536195755,
        -0.038972169160842896,
        0.007984230294823647,
        0.030513891950249672,
        0.00949148740619421,
        -0.021573016420006752,
        -0.0039408826269209385,
        -0.08160072565078735,
        0.04272395744919777,
        -0.05711327865719795,
        -0.021074198186397552,
        0.023119309917092323,
        -0.07495228201150894,
        0.07494174689054489,
        0.08284757286310196,
        0.0035806146916002035,
        0.05914868041872978,
        0.03720219433307648,
        0.011010820046067238,
        -0.03965718299150467,
        -0.04439495503902435,
        -0.022877737879753113,
        0.024741753935813904,
        0.06485464423894882,
        -0.008377880789339542,
        0.005440864711999893,
        -0.012651937082409859,
        -0.040553733706474304,
        0.07408129423856735,
        -0.019445400685071945,
        0.044995639473199844,
        0.02203262411057949,
        0.008145475760102272,
        0.011167077347636223,
        0.02267153561115265,
        0.06628669798374176,
        -0.052854299545288086,
        -0.022597920149564743,
        -0.025495026260614395,
        -0.04537230730056763,
        -0.01893676072359085,
        0.001240094774402678,
        0.0592723973095417,
        0.021834861487150192,
        -0.09560668468475342,
        -0.02907838299870491,
        -0.03294821083545685,
        0.010529260151088238,
        0.007789222989231348,
        0.02363366261124611,
        0.10237782448530197,
        -0.014772889204323292,
        -0.03586266562342644,
        -0.08918061852455139,
        0.040561266243457794,
        0.02958519384264946,
        -0.028748387470841408,
        0.04239889979362488,
        0.10353928804397583,
        -0.1638215035200119,
        -0.0029866306576877832,
        -0.047586336731910706,
        -0.05198415741324425,
        0.08473997563123703,
        0.005096685606986284,
        0.003600125899538398,
        0.03280293568968773,
        -0.03281508386135101,
        0.022203104570508003,
        -0.013358224183321,
        0.04693768545985222,
        0.07976248860359192,
        0.0279564019292593,
        0.06353062391281128,
        0.05737883970141411,
        -0.022915055975317955,
        0.026165582239627838,
        -0.0818258747458458,
        -0.05686788633465767,
        0.011680342257022858,
        0.010913428850471973,
        0.08081574738025665,
        -0.07537738233804703,
        3.841926226826054e-33,
        0.11846127361059189,
        0.1660754233598709,
        -0.04180571809411049,
        0.07072324305772781,
        0.049363650381565094,
        -0.010637929663062096,
        -0.006670110393315554,
        0.04729127511382103,
        -0.07096978276968002,
        -0.006703103892505169,
        -0.0016981733497232199,
        0.04416976869106293,
        -0.0024187227245420218,
        -0.05019615590572357,
        0.0019348344067111611,
        -0.10370799899101257,
        -0.008412953466176987,
        -0.039262741804122925,
        -0.013033037073910236,
        0.0046165562234818935,
        -0.06311806291341782,
        -0.004449347034096718,
        -0.05637471377849579,
        0.0715167224407196,
        0.07846620678901672,
        -0.06395141035318375,
        0.09494034945964813,
        -0.019879110157489777,
        0.02583271451294422,
        -0.02036137878894806,
        -0.035732973366975784,
        0.06961899250745773,
        -0.02471226640045643,
        -0.03747981786727905,
        -0.029629027470946312,
        -0.029853107407689095,
        -0.031183721497654915,
        -0.0018798980163410306,
        -0.005268612876534462,
        -0.05595025047659874,
        -0.02470005862414837,
        0.04234779253602028,
        -0.02853265218436718,
        0.028668425977230072,
        0.01864037476480007,
        0.050972044467926025,
        -0.015835104510188103,
        0.021693997085094452,
        0.04566719010472298,
        -0.0018455032259225845,
        -0.11129820346832275,
        0.026798848062753677,
        -0.022991515696048737,
        0.05924714356660843,
        -0.012438791804015636,
        -0.0319569855928421,
        0.0456610769033432,
        0.04331540688872337,
        0.08525631576776505,
        0.029859595000743866,
        0.09941521286964417,
        0.12782630324363708,
        0.06429728120565414,
        -0.06028986722230911,
        -0.07128529250621796,
        -0.0383223257958889,
        0.00947039294987917,
        -0.07496000826358795,
        -0.010011857375502586,
        -0.12794174253940582,
        0.07097574323415756,
        -0.03281038999557495,
        0.04795978590846062,
        -0.10019104182720184,
        -0.030349126085639,
        -0.005270432680845261,
        -0.00805751234292984,
        -0.061925701797008514,
        0.035815298557281494,
        -0.0811062753200531,
        0.006913208868354559,
        -0.0320190005004406,
        0.02164415828883648,
        -0.019164612516760826,
        0.010132201947271824,
        0.02338000200688839,
        -0.07013748586177826,
        -0.058883462101221085,
        -0.045114122331142426,
        0.03359221667051315,
        -0.04062867537140846,
        -0.03319301828742027,
        -0.11893720179796219,
        -0.03356266766786575,
        -0.007608884479850531,
        -4.190414751438768e-33,
        0.09145736694335938,
        0.012628673575818539,
        0.002817706437781453,
        0.05419362336397171,
        0.06943091750144958,
        0.054479558020830154,
        0.023840179666876793,
        0.004663753788918257,
        0.029449889436364174,
        -0.019343025982379913,
        -0.04308314993977547,
        0.035850368440151215,
        0.028036559000611305,
        -0.0023017041385173798,
        -0.021577121689915657,
        -0.05237606540322304,
        0.08048903197050095,
        -0.010629327967762947,
        0.021101143211126328,
        0.01756417006254196,
        0.036782678216695786,
        0.08160936087369919,
        -0.01554659754037857,
        0.07000868767499924,
        -0.03570222854614258,
        0.02114199288189411,
        -0.07224638760089874,
        -0.00652759475633502,
        0.010294177569448948,
        0.041538652032613754,
        -0.048076432198286057,
        0.06768722087144852,
        0.028071779757738113,
        -0.03487406298518181,
        0.019793009385466576,
        0.008610589429736137,
        0.032857589423656464,
        0.05395674332976341,
        -0.001279613352380693,
        -0.0952984094619751,
        -0.003016782458871603,
        -0.0036328709684312344,
        0.04073485732078552,
        -0.023770201951265335,
        -0.0026988419704139233,
        -0.05596209317445755,
        0.013346225023269653,
        0.0456085130572319,
        -0.04758024960756302,
        -0.018974127247929573,
        0.04053397476673126,
        -0.0165092833340168,
        -0.015691623091697693,
        -0.029695065692067146,
        -0.06547269970178604,
        -0.06546557694673538,
        -0.011716680601239204,
        0.020485026761889458,
        0.04105433449149132,
        0.06334584951400757,
        -0.03307121619582176,
        0.0012494397815316916,
        0.04371761903166771,
        0.014030738733708858,
        -0.07064884901046753,
        -0.02157357521355152,
        -0.030343633145093918,
        -0.005004933103919029,
        0.09876905381679535,
        0.039065197110176086,
        -0.016228077933192253,
        -0.06093880906701088,
        0.03720799833536148,
        -0.08658687770366669,
        -0.029028166085481644,
        -0.04448363557457924,
        0.03582889214158058,
        -0.04196604713797569,
        -0.060010384768247604,
        -0.01591530069708824,
        0.024023858830332756,
        0.058159079402685165,
        0.09315073490142822,
        -0.019286945462226868,
        -0.0005171480588614941,
        0.07388094067573547,
        0.03255755454301834,
        -6.91719469614327e-05,
        -0.024072054773569107,
        0.02612076885998249,
        -0.017439577728509903,
        0.004033586475998163,
        -0.01649940013885498,
        0.02291102707386017,
        0.01618673838675022,
        -6.09820958175078e-08,
        0.042998041957616806,
        0.011273795738816261,
        -0.028333252295851707,
        0.044649697840213776,
        -0.043922435492277145,
        -0.06834595650434494,
        0.05325574800372124,
        0.023670360445976257,
        0.07296735793352127,
        0.032752200961112976,
        0.013175341300666332,
        -0.05812389776110649,
        -0.02577286586165428,
        0.06493069976568222,
        -0.020594269037246704,
        0.07255039364099503,
        -0.0583103746175766,
        0.14033977687358856,
        -0.04339953139424324,
        0.018055075779557228,
        -0.0530538447201252,
        0.00017028814181685448,
        0.05732216313481331,
        0.03459557518362999,
        0.07944032549858093,
        0.02312002331018448,
        0.006604988127946854,
        -0.016033727675676346,
        0.09236454218626022,
        -0.019749760627746582,
        -0.018017930909991264,
        -0.0006505599594675004,
        -0.06534114480018616,
        0.007115362677723169,
        -0.05401991680264473,
        -0.03167320042848587,
        -0.13376572728157043,
        0.04684169590473175,
        -0.08873233944177628,
        0.008847273886203766,
        -0.03849542513489723,
        -0.11808948963880539,
        -0.07830268144607544,
        0.06044548749923706,
        -0.029071763157844543,
        -0.08220968395471573,
        -0.028487902134656906,
        0.00384879345074296,
        -0.027666721493005753,
        0.008581189438700676,
        -0.005859616212546825,
        0.0263089369982481,
        0.0023841620422899723,
        -0.09220248460769653,
        0.051436714828014374,
        0.10930090397596359,
        -0.005788120906800032,
        0.08308470994234085,
        0.04668969288468361,
        0.02481004223227501,
        0.03986133635044098,
        -0.030648570507764816,
        -0.08186575770378113,
        0.04178965464234352
    ]
}