{
    "id": "N3zDANNGG3c",
    "title": "Cheating on our RED Camera - Sony Venice 6K Cinema Camera",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-04-22T01:14:36Z",
    "video_url": "https://www.youtube.com/watch?v=N3zDANNGG3c",
    "category": "People & Blogs",
    "tags": [
        "Sony",
        "Venice",
        "Cinema",
        "Cinematography",
        "Film",
        "Camera",
        "RED",
        "Weapon",
        "6K",
        "8K",
        "Sensor",
        "Full Frame",
        "5K",
        "Weight",
        "Accessories",
        "Movies",
        "lighting",
        "ND",
        "Filter",
        "Equipment",
        "Unboxing",
        "Best Film Camera",
        "Cam Corder",
        "Professional",
        "Making",
        "Production"
    ],
    "views": 463065,
    "likes": 25470,
    "comments_count": 2149,
    "description": "Sony's Venice is a serious contender in the film industry, but it records at 6K instead of 8K! What makes it so special?  Learn more about the Sony Venice at  If you're curious to see what's been shot with the Venice, check out   Buy Sony Video Cameras: On BHPhoto (Paid Link):      On Amazon (Paid Link):       Buy Red Cinema Cameras: On BHPhoto (Paid Link):      On Amazon (Paid Link):       Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/nYSLb",
        "https://lmg.gg/vG23Z",
        "https://geni.us/9HZwKd",
        "https://geni.us/f2d6o",
        "https://geni.us/6XKrD",
        "https://geni.us/ND5RjN",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So today is even more special than every other ShortCircuit that I've done so far, because I've looked at two stills cameras, which I loved. But today we get to look at the Sony Venice, which is a Cinema Camera and I'm not a professional photographer but I'm a cinematographer. So this is really exciting because this camera came out in 2018, and I've yet to be able to try it until today. We've been shooting on RED for about three years, and I've used the Arri Alexa as well, but this camera is extra special because it is either as good or better than those cameras. And it's made by Sony. So let's see how they did. Okay well, as you can see, this case is gigantic. So that's a good sign. This is a press unit, so it's not an official like retail package version of this camera, but that's okay. Opening it up. So we have our camera, the Venice here. What else have they included? We also have this viewfinder. As far as I understand, unlike the Alexa or the RED, you don't need the viewfinder to use the camera properly. Though I think a lot of people who do use something like the Venice prefer to shoot with viewfinder. You have some batteries. So standard Vima which is great. All cinema cameras use this, we use these for our REDs. They're awesome, these are pretty standard. So in the box we have this AXSM card reader, which is Sony's proprietary media that can actually adapt to S-by-S, which is a standard that other cameras use also made by Sony. And that's just so that you can use their RAW recorder which is built onto this version of the camera that we have right here. Is that and then a power adapter that allows you to use it with V-mount, that's cool. A bunch of cables and another dual charger. Okay, so let's get this case off the desk. So here it is, this is the Sony Venice. Guys, this camera is six K, not eight K like our RED cameras but it's also full-frame. Look at that sensor. That is gorgeous. So for those of you who don't recognize it, this is a standard locking PL-mount. But the really cool thing about this camera is that the mount itself and the sensor block is really flexible. So Sony, unfortunately didn't send it to us but they also make this thing called the RiaLto extension which just allows you to take the sensor block with the lens mount and the sensor off the Venice and onto this even smaller box which allows you all the features that are in this camera but then allows you to use it in that much smaller space. So you can take what is already relatively small for a cinema camera and make it even smaller and put it into cars or really, really small rooms which is really cool and not something that every camera these days can do. The other awesome thing about this mount is that underneath this standard locking PL-mount is an E-mount which again, for anyone who knows anything about cameras, an E-mount is very, very adaptable. It's the same mount that they use on the a7S II and a lot of other Sony's cameras, the FX9, the FS7. And anyone who uses those cameras you'll know you can adapt anything from Canon PL, basically any lens you can think of that can cover a full frame, you can adapt to this camera, which most people will stick with the standard PL-mount 'cause you're using higher-end lenses but it's nice to have options. All right, let's put a lens on this guy. PL's a little bit different where you just push it in and then lock it down. I feel scared, I mean, for the amount that this camera costs, you'd hope it does because it's more expensive than most cinema cameras out there. So this body in this configuration with this recorder will run you about $90,000 US and that is before you even think factor in which licenses you want because unfortunately, Sony has gone with the decision to limit softwarewise what you can do with the camera depending on your needs. So if you wanted to shoot anamorphic, and you wanted a permanent license for that, that's $4,000 US. If you wanted to shoot slow motion, that's also $4,000 US. And you can also rent the licenses for 30 days at a time at $500 US. (chuckles) So it gets unnecessarily expensive. But again, this is for the highest and this is for TV shows. I don't know if anyone out there is a fan of \"Ozark\", but the last season of \"Ozark\" was shot on the Venice and that show looks awesome. So going through the rest of this camera physically, you have the assistant side of the camera, which is just allows any assistant that's helping you out to change all the settings as they need to on a bigger display on this side. But then it's nice that this camera also has an operator side of the menu. So if you're just using this on your own, for like a documentary or you're a one-man band, and you're somehow using a Venice, you also can change all those settings on this side. For comparison this is, and in the current situation, a similarly built-out RED camera that we use on a daily basis. This is our weapon, it is only a Super 35 sensor., so it's a smaller sensor than the Venice but like you can tell right off the bat, the size difference between these two, like the Venice is quite a bit longer, but it has a couple things that the RED does not. For example, the Venice has built-in NDs. And not only does it have built-in Nds, it has built-in NDs at every stop range that you'd typically use. So it goes in one stop increments, it stops in the whole range, which means you can be very precise with how much ND you're using in this camera, and you don't have to fiddle with a matte box or any screw-in NDs. It's all built in which is really awesome for anyone who wants to move quickly or shoots documentary especially, and that's I think the cool thing about this camera is Sony has taken an approach to make this adaptable to basically any production environment someone would wanna use, you could use it for a documentary, you could use it for a live production, you can definitely use it for cinema, which is what its main use case is for. But the fact that they thought about all those things, and built in the RiaLto system makes this very, very compelling. And unlike our RED, which again I love our REDs, but this thing does have a couple things that it doesn't. It has a dual native ISO. So this camera's two dual ISOs for middle gray are 500 and 2,500. And so dual ISO basically allows you to shoot both in regular lighting settings and low light settings without really compromising on your noise performance, or the dynamic range of the camera depending on where you want your ISO to sit, which is awesome and something that the RED can't do. If you put the RED at 2,500 ISO, you're going to get a fairly noisy image, especially at nighttime, where the intention with the Venice is if you use that 2,500 and you get your six stops over in your highlights and your minus nine in your shadows, you are able then to have full control of where you want the image to sit in your highlights and your shadows, which is just incredibly flexible. And another reason why this camera costs $90,000 US for the basic package, and if you're building it out, you're probably spending quite a bit more than that. Now let's actually just weigh these two 'cause I'm curious to see what the weight difference is. Now to be fair to RED, they do make a camera, the Gemini, which is also made for the purposes of use in low light the way that the Venice is. But at the same time this is a full-frame sensor that is not a full frame sensor and it's five K, this is six K, but again there's a premium on all of that. Just to finish off the last couple things that I missed, the IO on this camera is ridiculous. There are so many monitor outputs, you have genlock and timecode in, which are standard BNC, which are awesome for live production and audio as well, so thank you. And then there's also, unfortunately they didn't include it, but there's this little slot on the side, which allows you to plug in a little XLR module that Sony offers. And then you can get audio in camera the same way that we record on like RC-200. Let's see the difference in weight because again they don't, like that you can see physically the differences. But how much heavier is all of those extra features in a full-frame camera versus our weapon? Okay so we've taken the lenses off and the batteries just to compare roughly with the display and the top handle what the weight difference is between these cameras. So RED is 2.8 kilograms. Not bad, all right? That's not too heavy. And let's see what the Venice weighs. (laughs) Oh, whopping 5.4 everybody. So yes, this has more features mechanically, there's more going on. And it also has a RAW recorder on the back. But then the red can do that built in, it's twice as heavy with just the body, which again makes sense. It's a full-frame camera, there's more cooling, there's more mechanical features going on, and then the viewfinder itself is probably a little bit heavier than this monitor. But that's also not that bad, when I feel it, it feels balanced. Like if this was on my shoulder, I could imagine that it would feel pretty darn good. Even on a long shoot day. Why don't we shoot some footage? And what better way to test the camera than to test the slow motion? So why don't we dump some water on our co-workers heads? (upbeat music) So that was really fun for me. I hope you guys had just as much fun watching those clips. Now there's obviously a lot more to this camera that I didn't get a chance to talk about because this is just a first impressions, but if you guys want a full review where I actually get to try the camera out in multiple different scenarios properly, lemme know in the comments down below and maybe we can do a full review on Linus Tech Tips, please I don't wanna send this back to Sony and I wanna keep testing it out, so let me know. Anyways guys, thanks for watching. Please subscribe to short circuit. All right.",
    "transcript_keywords": [
        "Camera",
        "Venice",
        "Sony",
        "RED",
        "cameras",
        "Sony Venice",
        "Sony cameras",
        "RED cameras",
        "Cinema Camera",
        "standard",
        "sensor",
        "shoot",
        "builtout RED camera",
        "awesome",
        "thing",
        "ISO",
        "Cinema",
        "fullframe camera",
        "side",
        "camera costs"
    ],
    "transcript_entity_values": [
        "Alexa",
        "Vima",
        "BNC",
        "30 days",
        "2.8 kilograms",
        "about three years",
        "US",
        "one",
        "AXSM",
        "the last season",
        "2018",
        "Linus Tech Tips",
        "Venice",
        "XLR",
        "the Sony Venice",
        "K",
        "ISO",
        "Cinema Camera",
        "2,500",
        "Nds",
        "IO",
        "$4,000 US",
        "daily",
        "first",
        "$90,000 US",
        "Sony",
        "RiaLto",
        "these days",
        "two",
        "Gemini",
        "$500 US",
        "Ozark",
        "minus nine",
        "500",
        "ShortCircuit",
        "six",
        "five",
        "eight",
        "the Sony Venice",
        "Canon PL",
        "today",
        "5.4",
        "about $90,000"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "MONEY",
        "DATE",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY"
    ],
    "vector": [
        -0.07747723907232285,
        -0.04070095345377922,
        -0.04777881130576134,
        -0.020168816670775414,
        0.030726632103323936,
        0.07351560890674591,
        0.022376857697963715,
        0.06266847252845764,
        -0.023889606818556786,
        0.01216591615229845,
        0.013879655860364437,
        0.013922120444476604,
        0.035457562655210495,
        -0.003565436229109764,
        0.05196833610534668,
        -0.023509642109274864,
        0.07982030510902405,
        0.0018940253648906946,
        -0.07028067857027054,
        -0.0001519002835266292,
        0.021232085302472115,
        -0.17463229596614838,
        0.028659312054514885,
        0.0076176319271326065,
        0.04498395696282387,
        -0.03582347184419632,
        0.022213781252503395,
        -0.01819884218275547,
        -0.05287327989935875,
        -0.053338490426540375,
        -0.06958688795566559,
        0.09881123900413513,
        0.014927267096936703,
        -0.05807705596089363,
        0.0538402795791626,
        -0.06156910955905914,
        -0.011491953395307064,
        -0.03956494852900505,
        -0.09614676237106323,
        -0.04861067607998848,
        0.02531346119940281,
        0.014361457899212837,
        0.0245269276201725,
        0.046606991440057755,
        0.03659200295805931,
        -0.04312647134065628,
        0.08943869173526764,
        0.10547878593206406,
        0.030639013275504112,
        0.00397720281034708,
        -0.08931808173656464,
        0.024900084361433983,
        0.015902798622846603,
        0.004276045132428408,
        -0.0682351291179657,
        -0.07878517359495163,
        -0.04921673983335495,
        -0.03502396494150162,
        0.06786913424730301,
        -0.02327897399663925,
        0.05271271616220474,
        -0.05112027749419212,
        -0.06936994940042496,
        0.08722461760044098,
        -0.009104637429118156,
        0.061109792441129684,
        0.01675517112016678,
        0.01637858711183071,
        -0.016626467928290367,
        -0.06355586647987366,
        -0.049169931560754776,
        0.01982913352549076,
        0.036092378199100494,
        0.026185370981693268,
        -0.07984767854213715,
        -0.003467161674052477,
        0.06404054164886475,
        -0.02604079619050026,
        -0.004517905414104462,
        -0.050581660121679306,
        0.11111146956682205,
        -0.06037319451570511,
        -0.08937502652406693,
        0.021183669567108154,
        0.05236409977078438,
        0.017516229301691055,
        0.06069692596793175,
        0.03531692922115326,
        0.0006014526588842273,
        -0.04292807728052139,
        -0.04811274632811546,
        0.03385324403643608,
        -0.0033619850873947144,
        -0.057529155164957047,
        -0.047361183911561966,
        -0.016302842646837234,
        -0.05034875497221947,
        -0.005698876921087503,
        -0.011910789646208286,
        0.09975523501634598,
        0.05781247839331627,
        -0.019835934042930603,
        0.028273405507206917,
        -0.016677765175700188,
        -0.004062796477228403,
        -0.03155309706926346,
        0.01240895688533783,
        0.11523707956075668,
        0.004433032125234604,
        0.019044693559408188,
        -0.09612412005662918,
        0.058844536542892456,
        -0.037445180118083954,
        -0.04557473212480545,
        0.008120391517877579,
        0.09280174970626831,
        -0.0439002551138401,
        0.011879323981702328,
        0.028796283528208733,
        -0.018831688910722733,
        0.0273380596190691,
        -0.07063163816928864,
        -0.037335868924856186,
        0.014336447231471539,
        0.035099226981401443,
        -0.03775453940033913,
        -0.03325246274471283,
        1.1649293198377837e-33,
        -0.022057609632611275,
        0.06384089589118958,
        0.03330165520310402,
        -0.09595751762390137,
        -0.018938696011900902,
        0.010572596453130245,
        0.014159862883388996,
        0.03825417160987854,
        -0.10381321609020233,
        0.002361172577366233,
        -0.013942764140665531,
        0.018955394625663757,
        -0.021053731441497803,
        -0.002248304197564721,
        0.06147726997733116,
        0.048277635127305984,
        0.04056951403617859,
        -0.006951663643121719,
        0.04722306877374649,
        0.03822864592075348,
        -0.013751355931162834,
        -0.025780975818634033,
        0.054119281470775604,
        0.018244575709104538,
        -0.06250238418579102,
        0.09067787230014801,
        -0.04073283076286316,
        0.02717946656048298,
        0.0697891041636467,
        0.03078538551926613,
        -0.07379122823476791,
        0.0378970205783844,
        0.04726270213723183,
        0.03588877618312836,
        0.01434177253395319,
        -0.04061464965343475,
        -0.12365579605102539,
        -0.1334892064332962,
        -0.005371278151869774,
        0.04193597286939621,
        -0.08309885859489441,
        0.11326602846384048,
        -0.17950068414211273,
        0.01399566512554884,
        0.02460959181189537,
        -0.007505916990339756,
        -0.04053499549627304,
        0.005342443473637104,
        0.01240498200058937,
        0.0992889255285263,
        0.02516573667526245,
        0.060166578739881516,
        -0.0665498599410057,
        -0.04463904723525047,
        0.03033921681344509,
        0.05025438964366913,
        0.018729139119386673,
        -0.005704354960471392,
        0.039301857352256775,
        0.020096614956855774,
        0.11819367855787277,
        0.009494198486208916,
        -0.04513579607009888,
        0.02448756992816925,
        -0.12083273380994797,
        0.12159469723701477,
        0.07361168414354324,
        0.06571756303310394,
        -0.025586286559700966,
        -0.004001168068498373,
        -0.03794028237462044,
        -0.007894139736890793,
        0.06563328951597214,
        0.00406549172475934,
        0.012891511432826519,
        0.056753601878881454,
        -0.08780345320701599,
        -0.04138262942433357,
        0.04976819455623627,
        0.04183723032474518,
        -0.06066633015871048,
        0.021598348394036293,
        0.04678887873888016,
        0.055923305451869965,
        -0.07535016536712646,
        0.03289073333144188,
        0.0041711172088980675,
        0.06880567967891693,
        -0.014948330819606781,
        -0.014397882856428623,
        0.0470254123210907,
        -0.06789711117744446,
        -0.03078530728816986,
        0.0013101269723847508,
        -0.0040384866297245026,
        -1.2347976734792873e-33,
        -0.02049882523715496,
        0.003574158763512969,
        -0.07054968923330307,
        -0.004329383838921785,
        -0.0184223223477602,
        -0.06969617307186127,
        0.015485597774386406,
        0.014024929143488407,
        0.07421274483203888,
        0.002632292453199625,
        -0.024369239807128906,
        -0.013644037768244743,
        0.004003089852631092,
        0.006543190684169531,
        0.003056724788621068,
        -0.05121652036905289,
        0.09784268587827682,
        -0.058191943913698196,
        0.013485781848430634,
        -0.04907025769352913,
        0.09198883175849915,
        0.021268727257847786,
        0.003179286839440465,
        0.08375851809978485,
        -0.01609870232641697,
        0.02682139351963997,
        -0.04123811796307564,
        0.026819532737135887,
        -0.008403775282204151,
        -0.020156443119049072,
        0.009789057075977325,
        0.011238140985369682,
        -0.006209192797541618,
        -0.06772080808877945,
        -0.022012244910001755,
        0.0325181782245636,
        0.07181181013584137,
        0.03194233775138855,
        -0.013419633731245995,
        0.026896728202700615,
        -0.05008117854595184,
        -0.017758572474122047,
        -0.009225328452885151,
        0.006889213342219591,
        0.02271800860762596,
        -0.008455849252641201,
        -0.037328317761421204,
        -0.02911602333188057,
        0.01345672458410263,
        -0.028662819415330887,
        0.025609087198972702,
        0.022396713495254517,
        -0.020433807745575905,
        0.0026491740718483925,
        -0.0630093440413475,
        -0.01899733394384384,
        -0.08609206229448318,
        0.04953688383102417,
        0.03953763097524643,
        0.08020485192537308,
        0.044736407697200775,
        -0.02832615002989769,
        -0.11719018220901489,
        0.04678817838430405,
        -0.04140257462859154,
        0.01012508012354374,
        0.05293090268969536,
        0.060508791357278824,
        -0.069098100066185,
        0.02139543928205967,
        0.012352527119219303,
        -0.02059495635330677,
        -0.018955932930111885,
        0.00444455910474062,
        -0.04884466156363487,
        0.02552448771893978,
        -0.03161582350730896,
        0.04977547749876976,
        0.07846903055906296,
        0.04416457563638687,
        -0.0286323893815279,
        -0.03608647361397743,
        0.0762118473649025,
        0.07938781380653381,
        0.07143659889698029,
        0.03858188912272453,
        0.04330570995807648,
        -0.08721892535686493,
        0.010068030096590519,
        -0.03618954122066498,
        -0.0409567654132843,
        -0.038596197962760925,
        -0.0262353103607893,
        0.028181957080960274,
        0.01178476307541132,
        -5.270845804261626e-08,
        0.01872529834508896,
        -0.046486545354127884,
        -0.009123834781348705,
        0.01608104817569256,
        0.05544815585017204,
        -0.08027297258377075,
        -0.055618222802877426,
        0.13513976335525513,
        0.051060330122709274,
        -0.043943703174591064,
        0.0370468907058239,
        -0.08648751676082611,
        -0.02782982587814331,
        -0.03226826339960098,
        0.00037278482341207564,
        0.000531095894984901,
        0.0408988893032074,
        0.007917163893580437,
        -0.015931788831949234,
        0.01460839994251728,
        0.03475412353873253,
        0.006726568099111319,
        0.08816070109605789,
        -0.1264355629682541,
        0.009409625083208084,
        -0.05709169805049896,
        -0.032700538635253906,
        0.01149708777666092,
        0.046347878873348236,
        -0.06045667082071304,
        -0.0370914563536644,
        -0.04154590517282486,
        -0.002031277632340789,
        -0.02845887839794159,
        0.011494692414999008,
        -0.004138724412769079,
        -0.015429152175784111,
        -0.004266311880201101,
        0.010590550489723682,
        -0.0021454980596899986,
        -0.04401073232293129,
        -0.07010366022586823,
        0.008967403322458267,
        0.012652460485696793,
        0.09889303147792816,
        0.0937255471944809,
        -0.0016568494029343128,
        -0.0979880690574646,
        -0.0017323866486549377,
        -0.054077014327049255,
        -0.04535225033760071,
        -0.028832463547587395,
        -0.062430813908576965,
        -0.0020819432102143764,
        0.07954761385917664,
        -0.05065248906612396,
        0.06336963176727295,
        0.004258031956851482,
        -0.005462735891342163,
        0.10380706936120987,
        0.04029450565576553,
        -0.08655408769845963,
        -0.06001366302371025,
        0.09525813162326813
    ]
}