{
    "id": "n4xw2fmSCrs",
    "title": "Rewind: Best Gadgets of 2021!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-12-29T14:22:10Z",
    "video_url": "https://www.youtube.com/watch?v=n4xw2fmSCrs",
    "category": "Science & Technology",
    "tags": [],
    "views": 2960404,
    "likes": 92618,
    "comments_count": 3226,
    "description": "The 10 best gadgets of the last 365 days!  Thank you @BestBuy for partnering on this video  All products here:  #10: Beats Fit Pro:  #9: Samsung Z Fold:  #8: Sony Alpha:  #7: Galaxy S21 Ultra:  #6: Nintendo Switch OLED:  #5: Apple AirTags:  #4: Apple iPhone 13:  #3: DJI FPV Drone:  #2: Google Pixel 6:  #1: M1 Pro/Max MacBook Pros:   0:00 Intro 1:30 #10 2:01 #9 3:05 #8 4:00 #7 4:58 #6 5:36 #5 6:35 #4 7:44 #3 8:45 #2 9:40 #1  MKBHD Merch:  Playlist of MKBHD Intro music:  ~",
    "description_links": [
        "https://bby.me/tjngmw",
        "https://bby.me/mvfrme",
        "https://bby.me/upynt5",
        "https://bby.me/jxq88b",
        "https://bby.me/5cf3fk",
        "https://bby.me/z5439k",
        "https://bby.me/umjq2t",
        "https://bby.me/ysfxr8",
        "https://bby.me/2euuxh",
        "https://bby.me/8w3ahg",
        "https://bby.me/pusw8h",
        "http://shop.MKBHD.com",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(gentle tone) - This video is in partnership with Best Buy. All right, what's up, I'm MKBHD here, and we're in that wrapping up 2021 phase, as you already know. Did that first rewind video, which was all about the biggest, most influential tech of all of 2021, and videos like that are way more varied and off the wall, just because there's a lot of different tech that has an impact on the year, but not all that stuff's relatable or stuff that you can get your hands on right now. So this video, this video is specifically for stuff that you can get right now. This is the top 10 gadgets that you can actually get your hands on that came out in the last 365 days. And with partnering with Best Buy on this video, you already guessed it, every single one of the items on this list, you can go to a store right now or go to bestbuy.com and pick up for yourself. But also the benefit of Best Buy having physical stores is you can actually go to a store and see some of these things in person for yourself, which little underrated. So I've had the opportunity to stay ahead of the curve with a lot of this tech this year from Best Buy, and, yeah, getting to see some of it in person before you buy it makes a big difference. You'll see what I mean in a second. So sit back, relax, maybe open another tab, 'cause all this stuff is linked down below if you want to check it out right away. And let's get into it. So number 10, number 10, is the Beats Fit Pro. Okay, so these came out during the second half of the year, pretty late, and I didn't even get to review them, but they are my favorite Beats headphones ever for a couple of reasons. One, they're the best sounding Beats ever by a lot, but, two, it's the design that actually stays locked in your ear, so wingtips, major key. And so because of the great sound and great fit, these pretty much instantly became my favorite workout headphones. So if you're in need of a pair of like that, I'd say look no further. They also have a decently small case and a solid battery life. And, of course, they're sweat resistant for that workout stuff. And if you can, you can go to a Best Buy and see the different colors in person. Plus you can check out pretty much any other headphones. They have it all, so that can help you pick your favorite. So number nine is the Samsung Galaxy Z Fold 3. So I was kind of torn between putting this or the Flip 3 on this list, but the point is they are some of the most interesting phones that came out this year. Yes, of course, we got the candy bar phones getting better and having bigger batteries and better cameras and all that's great, but these phones do a lot different, obviously the hidden selfie camera behind the display, folding in half, and they're just more complete and capable than ever. So the Flip 3 just made the whole folding phone as a daily driver thing way more attainable for many people with the price tag right in line with other phones people buy all the time. It's worth checking out in person in a store if you can just to see how much that crease may or may not bother you, or whether or not you even notice it or care about it. But pro tip, when you're actually using these phones, both the crease and the hidden selfie camera, I noticed really kind of disappear to the eye as you focus on the content on the phone. So you get a much bigger screen as a result. Either way, really looking forward to these continuing to get better. All right, so number eight, and I could have gone kind of anywhere with this, 'cause this was a really good year for cameras, but I'm gonna go with the Sony Alpha 1, one of their flagships. This is an expensive one, but it did a lot of things right, and I really like this camera. So this is a full frame mirrorless camera. It's stuffed to the gills with features, high resolution, high frame rate, high shutter speed, lots of autofocus points, great color science, and that's just for photos. Sony has also been crushing the mirrorless video game for the past few years at a bunch of different price brackets, and this one slots in basically right at the top of their lineup. It's so good. I honestly look forward to shooting videos with it. We shot videos including the setup tour on the studio channel with it and also the Tesla Model Y review on the main channel, which was shot entirely on the A1. With that full frame sensor, we've got plenty of glass for it. The auto focus is great. It was just a great year for cameras. So it's hard to pick just one, but the A1 was a beast. All right, so number seven, the Galaxy S21 Ultra from Samsung again. So this may seem like, okay, now this is a little bit more of a boring option compared to the Fold and the Flip that were here before, but the Fold and the Flip made this list for me, because they're influential and really interesting phones. This makes the list, just because it's their best phone. And honestly, I think it's one of the best phones Samsung has made in a long time, miles better than the S20 Ultra, of course, huge improvement. Great battery, world-class display, great performance, and really great cameras. And honestly, I really like this design, not just because it's matte black, of course, but the whole thing, the intentional leaning into the camera bump, the weight, the materials. Everything about this build, I really like. Now it's also a huge phone. So if you're trying to actually get one, I'd say check it out in person just to make sure it's not dramatically different from what you're expecting, but yeah, huge thumbs up for me on what often doesn't get talked about enough this early in the year flagship. So number six, I am giving to the Nintendo Switch OLED, the new one. They kind of nailed it. (chuckles) So, obviously the original switch was very popular just as a portable handheld gaming console. And we've seen some others now jump into this same form factor, the same space, but the Switch OLED is just an all around better version of the Switch we already knew and loved. Much smaller bezels, better display, of course, it's in the name, deeper blacks, and a much brighter punchier look to it. And it's much better with that full width kickstand. So it's kind of the ideal refresh. And I've had plenty of fun flights with the original Switch. So can't really go wrong with the new Switch here. Switch OLED is great. All right, number five. This one might be kind of out of left field, but I believe in it a lot, Apple's Air Tags. So, this was one of the most influential products of the entire year, mainly because it shined a huge spotlight on this industry. And we got to see how all of the competitors already in it would react, mainly Tile. We got to see how Tile would react. I am somehow always surprised by how many people suddenly have intense and deep thoughts and care a lot about a product category as soon as Apple enters it, even if it was pretty chill before, but the Apple effect is real, and they have pulled a lot of other companies into their orbit too. So not only can you find your keys anytime you lose them with a key chain for Air Tags, but now other companies are making Air Tags compatible wallets and Air Tags backpack sleeves and Air Tags clamps for anything and everything you might lose of any size to find with Apple's Find My network. It's great. It's very handy. And it was a pretty important product of the year. And while we're at it, number four, the iPhone 13 series. But if I can be more specific, I want to shine a spotlight on the iPhone 13 Mini for a second. So tiny flagships are a dying breed. They have been for a while. We've known this already. And so Apple comes out with their entire iPhone 13 lineup. Again, this year, they've got an iPhone 13, an iPhone 13 Pro, a Pro Max, and a Mini, and they did the Mini phone right. They did it the correct way, which is that all of the phones on the whole lineup, more or less have the same specs. So the only difference between them is screen size and battery size. So the iPhone 13 Mini has the exact same super powerful chip as all the bigger phones. It has the same massive new primary camera sensor as all the bigger phones with improved stabilization, and it actually has a physically larger battery than the 12 Mini, which struggled a bit with that last year. So if there were ever a good time to get a Mini phone, I think it's now considering all the rumors that there might not be another one next year. And, of course, you can head into best buy and check out the mini's size for yourself. You can literally hold it up next to your current phone for comparison to see how compact it really is, but shout out to the Mini flagship smartphone. All right, so number three, and this is a really fun one, this is the DJI FPV drone. This thing is incredible. So as I broke down in my review video, this thing is basically combining all of the best of two very different drone worlds, which is the cinematography tools and recreational drones that DJI already kind of dominates and the DIY first person view racing drones that you might catch on TV or in a local park sometimes. And the result combining them is this incredibly fun, high-performance droning experience with a decently high quality camera and a pair of goggles wirelessly connected. I've literally never had more fun with a drone than with this one. It can go 90 plus miles an hour in sport mode, but you sort of slowly work your way up to that. And you can unlock more and more levels of manual control to get there. And don't worry, it comes with a bunch of extra propellors too in case you get too close to some trees or take a tumble or two. I've done that too. We've all done it, but I love this drone. All right, so number two is Google's Pixel 6 series and mainly the smaller, less expensive Pixel 6, which I think is a great phone and a great deal. So this was Google's first time designing the chip inside. So there's a Tensor chip powering this phone, and they're clearly focused a lot still on the cameras, which are quite good too, especially on a phone of this price. And I think it has some room for a little higher ceiling with some software updates, but really this phone is all about having the most convenient Google features, Google Assistant, answering phone calls, and waiting on hold for you and working on the background. It's great. It's one of the reasons I choose to use a Pixel so often as my main phone. All that phone for 599 in the Pixel 6. Now I do personally daily the more expensive 6 Pro. Not a whole ton of difference really between them, but if you want to test your eye to see if you notice the slightly higher refresh rate or the slightly higher resolution display, that's worth a shot. So then last but not least, number one, is the new MacBook Pros, the new M1 Pro and M1 Pro Max, 14 inch and 16 inch MacBook Pros. These things have been incredible. Now, same deal, there have been a lot of really good laptops all over the map this year, but these made the biggest splash, of course, because of the incredible performance and efficiency, all that comes with the new apple silicon that went into these machines. And the way it applied specifically to my own workflow, I loved it. These have been great. So you can check out my entire review video if you want all the benchmarks and details of my real-world experiences with these laptops, but bottom line, it makes a fantastic only computer for a lot of different creatives, professionals, et cetera. I've edited videos on the 16 inch M1 Max. A lot of my colleagues and friends are loving the 14 inch M1 Pro just as much. The notch is kind of like the crease in the Samsung folding phones like when you're actually using the device, it fades away to the eye and becomes a non-factor even if it is a head-scratcher why it's there in the first place. But the displays themselves are world-class with high dynamic range, high brightness, high refresh rate, and high resolution. The speakers are best in class, and the battery life is top of the class. And it has all the ports. I mean, what more could you really ask for? So there you have it, 10 gadgets that came out during the last 365 days that are really influential or really good. Turns out, it was a pretty good year after all. Also I want to toss in, 'cause I was doing my research for this video and I realized it didn't come out this year, but the Quest 2, the VR headset, if you're in the market for one, it's honestly still the best like portable VR experience standalone that you can get right now. So I'm gonna just toss that in there. Also didn't come out this year, but Sony's WH-1000XM4 noise canceling headphones, if you don't have or haven't tried one of the over ear pairs from Sony yet, really good. So I'm just gonna include those at the end, but that's a little extra. And thanks again to Best Buy for partnering on this video. You already know they have all the best tech available all year round. So whether it's actually going into a Best Buy store to check out something physically in person for yourself, or just going to buy what you already know you want from bestbuy.com, they've got it all all year round, and they've been awesome for all things tech. So that's been it. Thanks for watching. Catch you guys the next one. Peace. (chill tone)",
    "transcript_keywords": [
        "year",
        "Buy",
        "phone",
        "great",
        "Air Tags",
        "phones",
        "lot",
        "Pro",
        "video",
        "number",
        "Mini",
        "Switch",
        "Mini phone",
        "Switch OLED",
        "Apple Air Tags",
        "camera",
        "Apple",
        "kind",
        "Beats Fit Pro",
        "good"
    ],
    "transcript_entity_values": [
        "the Samsung Galaxy Z Fold 3",
        "599",
        "Apple",
        "three",
        "the Galaxy S21 Ultra",
        "year",
        "the S20 Ultra",
        "number nine",
        "one",
        "14 inch",
        "DJI FPV",
        "Tile",
        "a pretty good year",
        "One",
        "Flip",
        "Switch",
        "Fold",
        "seven",
        "13",
        "Sony",
        "10",
        "the year",
        "this year",
        "A1",
        "12",
        "M1 Pro",
        "Air Tags",
        "M1 Pro Max",
        "Tensor",
        "five",
        "the entire year",
        "daily",
        "half",
        "first",
        "Pixel 6",
        "3",
        "Mini",
        "2021",
        "Google",
        "DJI",
        "Beats Fit Pro",
        "Tesla Model Y",
        "Air Tags",
        "next year",
        "number four",
        "second",
        "this early in the year",
        "14 inch and",
        "the past few years",
        "Best Buy",
        "DIY",
        "1",
        "six",
        "6",
        "the 16 inch M1 Max",
        "Quest 2",
        "the last 365 days",
        "the second half of the year",
        "two",
        "90 plus miles an hour",
        "MacBook Pros",
        "last year",
        "number eight",
        "Samsung"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.09086795151233673,
        -0.01522207260131836,
        0.08764438331127167,
        -0.10371037572622299,
        0.09637101739645004,
        0.043977271765470505,
        0.01888567954301834,
        -0.007104516960680485,
        -0.05574383586645126,
        0.023569365963339806,
        0.026063619181513786,
        0.043903689831495285,
        0.014487626031041145,
        -0.04451072961091995,
        -0.010828687809407711,
        0.01386276911944151,
        0.03277789056301117,
        -0.017896831035614014,
        -0.10315677523612976,
        -0.01113099418580532,
        -0.05317289009690285,
        -0.00658793281763792,
        0.0033893908839672804,
        0.04484521597623825,
        -0.040962956845760345,
        0.09933498501777649,
        -0.011293201707303524,
        0.022656021639704704,
        -0.08392409235239029,
        -0.059743914753198624,
        0.04197349399328232,
        0.10928676277399063,
        -0.002709193155169487,
        0.0022634644992649555,
        -0.041603367775678635,
        -0.05029178783297539,
        0.023326478898525238,
        0.011816313490271568,
        -0.052915964275598526,
        -0.05166509747505188,
        -0.042510051280260086,
        -0.053565751761198044,
        0.03135640546679497,
        0.002113507827743888,
        -0.020480019971728325,
        -0.009069671854376793,
        -0.026786362752318382,
        -0.08399051427841187,
        -0.0032994975335896015,
        0.010930642485618591,
        -0.07123871892690659,
        -0.059889551252126694,
        0.0017195899272337556,
        -0.040633734315633774,
        0.012096324004232883,
        0.054395150393247604,
        0.027112921699881554,
        -0.013940578326582909,
        0.10904408246278763,
        -0.010559221729636192,
        0.002693136688321829,
        -0.08038266003131866,
        0.04264979436993599,
        0.02031124010682106,
        0.02862614020705223,
        -0.0573682002723217,
        0.0389338843524456,
        0.03623157739639282,
        -0.03344463184475899,
        0.01553910132497549,
        0.03185388818383217,
        -0.01573152095079422,
        0.05094961076974869,
        0.004848378710448742,
        -0.0046413354575634,
        0.014442292042076588,
        0.008106880821287632,
        -0.04673294723033905,
        -0.027278268709778786,
        -0.0161757655441761,
        0.0775773748755455,
        -0.09350009262561798,
        -0.0833740234375,
        -0.023566560819745064,
        -0.03215501084923744,
        -0.011992224492132664,
        0.009576869197189808,
        -0.025916483253240585,
        -0.04177718237042427,
        0.010719090700149536,
        -0.15440021455287933,
        0.0741017535328865,
        0.03604625537991524,
        0.03216281905770302,
        0.03576194867491722,
        -0.029014479368925095,
        -0.04497590661048889,
        -0.046777475625276566,
        0.031087761744856834,
        0.05250173807144165,
        0.049820635467767715,
        0.03977097570896149,
        0.046765368431806564,
        -0.036967821419239044,
        0.0035878256894648075,
        -0.13116468489170074,
        0.016687985509634018,
        0.0850021243095398,
        0.016868028789758682,
        0.014743154868483543,
        -0.01593441143631935,
        0.017766490578651428,
        -0.04899756237864494,
        -0.010325833223760128,
        0.05360160022974014,
        0.040673572570085526,
        -0.0461793951690197,
        0.07793205231428146,
        0.03745080158114433,
        0.006276451982557774,
        0.04390927404165268,
        0.028839722275733948,
        -0.02866245247423649,
        -0.06245039030909538,
        -0.016789861023426056,
        0.034771628677845,
        -0.009836225770413876,
        4.850526093770501e-33,
        -0.0035938541404902935,
        -0.004899243824183941,
        -0.0007627471932210028,
        0.06683464348316193,
        0.05215030536055565,
        0.007962947711348534,
        -0.045428141951560974,
        0.08799383789300919,
        -0.06369100511074066,
        0.029916319996118546,
        -0.05010827258229256,
        0.015860166400671005,
        -0.11404597014188766,
        0.026623044162988663,
        0.02650373987853527,
        -0.0919012501835823,
        -0.12068372219800949,
        -0.0034303211141377687,
        -0.129017636179924,
        -0.0009787969756871462,
        -0.028255818411707878,
        -0.005595815367996693,
        0.02081155776977539,
        -0.06887217611074448,
        0.024478791281580925,
        0.017097285017371178,
        0.04491548240184784,
        -0.005195684731006622,
        0.10222581028938293,
        0.023805569857358932,
        -0.0850473940372467,
        -0.03152061998844147,
        -0.004526469390839338,
        -0.057689301669597626,
        -0.06210331618785858,
        -0.011677595786750317,
        -0.08936452120542526,
        -0.10444375872612,
        -0.04525008425116539,
        -0.008103429339826107,
        -0.024103054776787758,
        0.028832564130425453,
        -0.13165266811847687,
        -0.06436755508184433,
        -0.03427734971046448,
        0.023409608751535416,
        -0.01986863650381565,
        0.04646298289299011,
        -0.0011177227133885026,
        0.01781611330807209,
        -0.01738283783197403,
        0.00789586827158928,
        0.024531781673431396,
        -0.045579273253679276,
        -0.05947040393948555,
        -0.05467838793992996,
        0.021167781203985214,
        0.00015448637714143842,
        0.023868806660175323,
        0.06515717506408691,
        0.011676445603370667,
        0.0769001767039299,
        -0.00544531736522913,
        0.00595930777490139,
        -0.025204595178365707,
        0.06760970503091812,
        0.12405677139759064,
        0.02859208919107914,
        -0.04260614514350891,
        0.07693115621805191,
        -0.029325289651751518,
        0.004720074590295553,
        0.05100136250257492,
        -0.1042652428150177,
        0.06613826006650925,
        0.03324746713042259,
        -0.041353095322847366,
        -0.003662885632365942,
        -0.04145301133394241,
        -0.06041344627737999,
        -0.029343381524086,
        0.032877273857593536,
        0.010607820935547352,
        0.025939946994185448,
        0.010931199416518211,
        -0.032983485609292984,
        -0.0053922925144433975,
        -0.0925726518034935,
        -0.049522701650857925,
        0.0054684351198375225,
        -0.11451434344053268,
        -0.008879715576767921,
        0.044698018580675125,
        0.02526128478348255,
        -0.061227407306432724,
        -8.49937223068621e-33,
        0.04559611529111862,
        0.030027827247977257,
        0.09170115739107132,
        -0.019814301282167435,
        0.07770290225744247,
        0.014580055139958858,
        0.002108208369463682,
        0.08164089918136597,
        0.0010422890773043036,
        -0.04641163349151611,
        0.06458688527345657,
        -0.010816304944455624,
        -0.018552813678979874,
        -0.00762947229668498,
        0.007841414771974087,
        -0.02236240915954113,
        0.00636267988011241,
        -0.11384472995996475,
        0.01290594320744276,
        -0.008199306204915047,
        0.07407017797231674,
        -0.023429039865732193,
        0.02667328342795372,
        0.04459884762763977,
        -0.016785461455583572,
        0.06543908268213272,
        0.07724037766456604,
        0.03756500780582428,
        0.0769425481557846,
        -0.04641713574528694,
        0.03443966433405876,
        -0.04225850850343704,
        -0.01829000748693943,
        0.023595593869686127,
        0.03539976105093956,
        0.048172205686569214,
        0.055255137383937836,
        -0.045061144977808,
        -0.06554941087961197,
        -0.04868577420711517,
        -0.003804579144343734,
        0.08044183254241943,
        -0.058404650539159775,
        0.030558772385120392,
        -0.024438155815005302,
        -0.039028335362672806,
        -0.0839235931634903,
        0.07408158481121063,
        0.0002876101352740079,
        -0.033407773822546005,
        -0.012279976159334183,
        0.010428344830870628,
        -0.04601914808154106,
        -0.026881149038672447,
        -0.07860453426837921,
        0.023998670279979706,
        -0.012237567454576492,
        0.05130568891763687,
        0.030315229669213295,
        -0.00942210853099823,
        0.024753576144576073,
        0.0001803339837351814,
        -0.06579556316137314,
        -0.13511112332344055,
        -0.057088155299425125,
        -0.01859956420958042,
        0.09697306901216507,
        0.0011671382235363126,
        -0.02890944480895996,
        0.03627137467265129,
        -0.03756333142518997,
        -0.012486670166254044,
        -0.08912515640258789,
        -0.07505632191896439,
        -0.058862943202257156,
        0.060192856937646866,
        -0.0002337487821932882,
        -0.04633069783449173,
        0.02414691634476185,
        -0.07124774903059006,
        0.013502095825970173,
        0.04486725851893425,
        0.03266379237174988,
        0.02795935422182083,
        0.08519057184457779,
        0.06562522798776627,
        0.005620809271931648,
        0.0070834653452038765,
        0.018043264746665955,
        0.06988487392663956,
        -0.036496374756097794,
        0.0402311272919178,
        -0.07671715319156647,
        0.08942170441150665,
        -0.040590155869722366,
        -6.544112807205238e-08,
        -0.003175529418513179,
        0.05094899982213974,
        -0.015122334472835064,
        0.02368646301329136,
        0.05282464623451233,
        -0.05978173762559891,
        0.018613038584589958,
        0.035651613026857376,
        0.10735807567834854,
        0.0008024157723411918,
        0.017275415360927582,
        -0.03912781924009323,
        -0.033893804997205734,
        0.07676327973604202,
        0.0178640428930521,
        0.008607279509305954,
        -0.1218605786561966,
        0.034314580261707306,
        -0.036807164549827576,
        -0.03023454360663891,
        -0.015216903761029243,
        0.039469506591558456,
        0.0664239451289177,
        -0.03883332014083862,
        -0.016603147611021996,
        -0.025133445858955383,
        -0.019451411440968513,
        0.005637432914227247,
        0.05907321721315384,
        -0.02421225979924202,
        -0.04051798954606056,
        -0.013988855294883251,
        -0.06476599723100662,
        -0.058777447789907455,
        -0.0024898441042751074,
        -0.06968159228563309,
        -0.04183035343885422,
        0.018051519989967346,
        0.03174344822764397,
        0.01672780141234398,
        0.007355208974331617,
        -0.07208152860403061,
        -0.02525872364640236,
        0.046718779951334,
        -0.0420476533472538,
        -0.11040227115154266,
        -0.01728922687470913,
        -0.057550713419914246,
        -0.08003348112106323,
        -0.0027897211257368326,
        -0.06704815477132797,
        -0.05561213195323944,
        -0.03962693363428116,
        0.02751603163778782,
        0.05776212736964226,
        0.0787198469042778,
        -0.0699886605143547,
        0.041526149958372116,
        -0.06136420741677284,
        -0.015689603984355927,
        0.09639222919940948,
        -0.11669889092445374,
        -0.023975493386387825,
        0.11928070336580276
    ]
}