{
    "id": "N7N2xunvO68",
    "title": "Microsoft Surface Go review: surprisingly good",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-07T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=N7N2xunvO68",
    "category": "Science & Technology",
    "tags": [
        "surface go",
        "microsoft",
        "surface microsoft",
        "tablet",
        "surface pro",
        "surface laptop",
        "ipad",
        "ipad pro",
        "surface pro 4",
        "chromebook",
        "laptop",
        "dieter bohn",
        "windows laptop",
        "windows",
        "review",
        "technology",
        "top 10",
        "gadgets",
        "computer",
        "usb-c",
        "pc build",
        "tech",
        "latest updates",
        "how to",
        "diy",
        "mkbhd",
        "marques brownlee",
        "apple",
        "google",
        "verge",
        "the verge",
        "hands-on",
        "first look"
    ],
    "views": 1278397,
    "likes": 13717,
    "comments_count": 961,
    "description": "The Microsoft Surface Go is a 10-inch Hybrid Windows 10 computer. It's basically a really small Surface Pro. To get it to size, Microsoft had to do a bunch of engineering but also make some compromises from what you might be used to on a bigger machine. We covered a lot of the basics in our last video, so for this review were answering a bunch of questions from some of you.  Subscribe:   Here's a link to buy the Surface Go:   Note: we sometimes place affiliate links directly to the best deals in our video descriptions, so we may earn a commission if you buy something.  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://amzn.to/2IehhEX",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - The Surface Go isn't what you would expect. I was expecting a relatively low end Windows computer to go with it's relatively low end processor. I was expecting to be unimpressed with the tiny keyboard and I was expecting to be unimpressed with it's speed. What I wasn't expecting is how much of a joy this thing is to use. Surface Go is a 10 inch Windows hybrid device. It's basically like a really small Surface Pro. The base model costs 399, but the model everybody should probably get starts at 550 but you have to get a keyboard to go with it and you really should and that's either a $100 or $130 if you want the very soft and nice Alcantara fabric. To get the Surface Go down to size, Microsoft had to do a bunch of engineering, obviously, but it also had to make a few compromises compared to what you might be used to on a larger Windows laptop. Those laptops tend to run Intel Core i5 processors which are pretty speedy but this has an Intel Pentium Gold processor and what that means is it's a little bit slower, but it's still better than what you get in the cheapest Windows or Chrome laptops that are out there. As long as you adjust your expectations accordingly, you can do just fine with this thing. I was able to run a bunch of apps and although they were simple, it still felt relatively responsive. For this review, what I wanna do is answer a bunch of the questions that have come in from the community. Now, I can't answer them all but I really think we're gonna hit on all the major themes here. So the first round of questions that we've got are about how powerful this machine is and a lot of people wanted us to compare it to the cheaper model. So jclardy asked if we'd be able to compare the models and he specifically brought up the EMMC storage on the base model. So, let's talk about that a little bit. The model again starts at 399 and it has only four gigs of ram which maybe isn't enough to run what you want on Windows, but it also has this thing called EMMC storage or 64 gigs of it and that type of storage is a little bit slower than a proper SSD. Unfortunately, I haven't been able to test it. I'm sorry, but my very strong suspicion is you'll wanna get this model which starts at 550 and for that extra price, you get a proper 128 SSD and you get eight gigs of ram which is plenty for running a bunch of apps as long as a relatively easy to use simple apps. Another way to get at this question of how powerful this machine is to talk about gaming. So, here's the real story with gaming. We installed some Windows Store games. Cuphead crashed on launch, I don't know what the deal is there. Ori and the Blind Forest which doesn't seem that intense of a game to me, it ran but it was just a little bit sluggish. As far as Steam goes, I'll be honest, I didn't do anything crazy. I didn't install PUBG. I don't even think this would be great for Fortnite, but I did install a game called Transistor which is really fun and relatively light weight and it ran just fine. So you can game on this thing, but you're not gonna be frightening anybody in a first person shooters on this thing. It's just not that powerful. Jeffry Remick on Twitter what's to know if the screen quality is enough for light photo editing. I wanna talk about that and power at the same time. So, we went ahead and installed Adobe Lightroom CC and Adobe Lightroom CC Classic and it does better than you expect. You can edit a couple of photos in a pinch. There's a little bit of lag, but you can pinch and zoom, things are pretty good. But if you're doing anything super intense in terms of batch photo editing or stitching panoramas together, this is not your machine. The bigger deal when it comes to photo editing is that this 10 inch screen just feels a little bit cramped if you're doing really intense photo editing. There's just not enough real estate here and you end up really zooming in on it really closely and speaking of things being small, a lot of people asked about the keyboard in the trackpad because they're not full size, but you get used to both right away. The keys are really easy to type on. The trackpad is glass and it's precision two and so it's very, very accurate. Haven't had a problem at all. All right, let's get through some other build quality stuff really quick. Steven Harris wants to know about battery life. I've been getting about six hours of active use which is pretty solid. Microsoft rates it for nine hours of video play back, but you should never expect that. The good news is that you can charge it either via the surface connector that comes with it or USB C and depending on how high your USB C thing is, you can charge it relatively fast. I've been impressed with how quickly this thing charges. Nathan Norris wants to know if that USB C port we just talked about is also Thunderbolt 3. Didn't work when I plugged the Thunderbolt 3 into it, but it did work with my dongles to power my monitor and get other USB stuff going on it. Samar Anand asked about the speakers. They are front facing stereo speakers. They're on the left and the right of the screen and they sound really good, especially for a device of this price class. They're much better than I expected. They're great for watching video. Boven Kamptim on Twitter wants to know about the pin, I'm not a huge Surface pin user, but I haven't seen much lag which a bunch of other people have asked about so that's impressive and the build quality here is solid. You're not gonna feel any give or whatever on the screen. It's really, really good. Probably the most questions that we've received have been about S mode and so it's time to talk about S mode and I have feelings. Here's the deal with S mode. It ships on by default on the Surface Go and that means you can only use the Edge browser and apps from the Microsoft Windows Store, and in theory, that could be great because you know that you're getting a bunch of lightweight apps and they'll run really well on the Surface Go. In practice, the apps just aren't there. My personal favorite example is I need one password, not on the Windows Store, but the browser extension is and so I got air messages, whatever. You're gonna end up turning S mode off and that's fine and fast and easy. You don't even have to reboot, but it's gonna mean you're gonna install apps are gonna bog this thing down a little bit. Like I don't know, Chrome kinda bogs this thing down a little bit. It's all emotional for me because Microsoft has the right idea, taking mobile apps and making them for larger screens. They did it before Chrome did it with Android. They did it before Apple did it with Marzipan apps on the Mac. They've got the right idea but the execution is still broken. They don't have the apps yet. We got a lot of questions asking me to compare the Surface Go to Chromebook or to an iPad or to a bigger Windows laptop or even, I don't know, to the Mac. Well, not so much to the Mac. There are so many variables especially in this mid range that making a comprehensive comparison is basically impossible. Compared to an iPad on a basic level, you can probably be more productive with this thing but the tablet apps, they're worse. Compared to a Chromebook, you can get more apps, do more stuff, but it's nowhere near as simple as a Chromebook can be and compared to the Mac, I mean, that's just a whole different category. The bottom line is if you like Windows, this is a really great tiny Windows machine. All right, I think we're gonna cut it off there. Thank you to everybody for your questions, I'm sorry if I didn't get to yours, but hopefully we touched on the major themes. I wanna talk about my take on this machine. One of my favorite things about Windows is it never really stops you from doing anything. One of the questions we got was can you do CAD work on this? And sure, you can do it. I just don't think it'll be a very good experience. When you use a Windows machine, you kind of have to know the limits of that machine and that applies especially to the Surface Go. If you know what to expect and you stay within those limits, this thing will totally impress you and when you use it there's just something about the design and the curves and everything that just makes you kind of love this thing and that at the end of the day is quite an achievement. Hey everybody, thanks for watching. Let me know, if you were to get this thing, what would you use it for? Tell me in the comments and then when you're done, if you're looking for another gadget video to watch, we just did a this is my next of the best smartphone under $300. Jake made it, it's really good advice and a really fun video so you should check that out, bye.",
    "transcript_keywords": [
        "Windows",
        "Surface",
        "thing",
        "Windows Store",
        "apps",
        "Microsoft Windows Store",
        "bit",
        "Windows machine",
        "Windows laptop",
        "low end Windows",
        "model",
        "machine",
        "bunch",
        "Windows Store games",
        "questions",
        "expecting",
        "Mac",
        "good",
        "USB",
        "Intel Pentium Gold"
    ],
    "transcript_entity_values": [
        "Adobe Lightroom CC",
        "Adobe Lightroom CC Classic",
        "Surface",
        "130",
        "Android",
        "Jeffry Remick",
        "Steven Harris",
        "one",
        "Apple",
        "10 inch",
        "128",
        "550",
        "Windows Store",
        "Chromebook",
        "Windows",
        "the Blind Forest",
        "Twitter",
        "USB",
        "Boven Kamptim",
        "EMMC",
        "Windows",
        "eight",
        "Jake",
        "the end of the day",
        "Samar Anand",
        "300",
        "iPad",
        "Alcantara",
        "Fortnite",
        "3",
        "the Windows Store",
        "399",
        "two",
        "100",
        "Chrome",
        "One",
        "Intel Core",
        "only four",
        "Cuphead",
        "Transistor",
        "64",
        "nine hours",
        "USB C",
        "Surface Pro",
        "Edge",
        "Intel Pentium Gold",
        "Microsoft",
        "first",
        "SSD",
        "Marzipan",
        "Mac",
        "the Microsoft Windows Store",
        "about six hours",
        "the Surface Go",
        "Nathan Norris"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "MONEY",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.009888291358947754,
        -0.06535734236240387,
        0.05239863693714142,
        -0.011357678100466728,
        0.012778643518686295,
        -0.004765674937516451,
        -0.011112341657280922,
        0.07499846816062927,
        -0.05007358267903328,
        0.021818676963448524,
        0.01931062340736389,
        0.024730170145630836,
        -0.046946972608566284,
        0.04136613756418228,
        -0.0022849300876259804,
        0.02655467391014099,
        0.114875927567482,
        -0.08889830112457275,
        -0.05250043421983719,
        0.04670170322060585,
        -0.07381904870271683,
        -0.05713513866066933,
        -0.030305419117212296,
        -0.048260945826768875,
        -0.003764290129765868,
        0.03851756826043129,
        -0.026339737698435783,
        -0.02545318379998207,
        -0.006120077800005674,
        0.0029004178941249847,
        -0.052961088716983795,
        0.014690060168504715,
        0.030567804351449013,
        0.02807995304465294,
        -0.036229562014341354,
        -0.051145825535058975,
        0.04930863901972771,
        -0.05291613191366196,
        -0.07664026319980621,
        -0.07358726859092712,
        -0.05212012305855751,
        -0.0036378290969878435,
        0.04189734533429146,
        0.0838380753993988,
        0.10207054764032364,
        -0.010042044334113598,
        0.03627241402864456,
        -0.11316078156232834,
        -0.009839558973908424,
        0.014860888011753559,
        -0.04606109857559204,
        -0.11124365031719208,
        0.04051852226257324,
        -0.09478075057268143,
        -0.09268777072429657,
        0.04135499149560928,
        0.041873522102832794,
        0.026905445381999016,
        0.00288777775131166,
        -0.04095267876982689,
        0.05526197329163551,
        -0.1410064548254013,
        0.00815647840499878,
        0.016145009547472,
        0.03546217456459999,
        0.02152671106159687,
        -0.0077907429076731205,
        -0.05469623953104019,
        0.000153138127643615,
        -0.03906744346022606,
        -0.05273730307817459,
        -0.02362440526485443,
        0.019452856853604317,
        0.038906920701265335,
        0.024014703929424286,
        -0.037212543189525604,
        0.04742053896188736,
        -0.01959792524576187,
        -0.03296429291367531,
        0.017985893413424492,
        0.014465996995568275,
        -0.004119035322219133,
        -0.058564938604831696,
        -0.009665373712778091,
        -0.06246853247284889,
        -0.05012763291597366,
        -0.0018251887522637844,
        0.04629035294055939,
        -0.01579725556075573,
        -0.06217631325125694,
        0.01827036403119564,
        0.058338332921266556,
        -0.02340162731707096,
        -0.0005526123568415642,
        0.05844636261463165,
        -0.041623130440711975,
        -0.021694479510188103,
        -0.1764870136976242,
        -0.03556520491838455,
        0.007166536990553141,
        0.01270355936139822,
        0.054765526205301285,
        0.13821443915367126,
        -0.02870495803654194,
        -0.04804842919111252,
        -0.030744967982172966,
        0.038399551063776016,
        0.07520181685686111,
        -0.007740665227174759,
        0.012674045749008656,
        -0.011131901293992996,
        0.04888305813074112,
        -0.07946217060089111,
        0.028594544157385826,
        0.00817066989839077,
        -0.02095228247344494,
        0.002903369953855872,
        -0.013593352399766445,
        0.06103768199682236,
        0.02880473993718624,
        -0.011688285507261753,
        -0.016117248684167862,
        -0.11322636157274246,
        -0.022904813289642334,
        -0.007751148659735918,
        -0.01846739836037159,
        -0.04812706261873245,
        2.3667100202318615e-33,
        0.005887886043637991,
        0.09262207895517349,
        -0.05835041403770447,
        -0.031978707760572433,
        0.08162343502044678,
        -0.041569069027900696,
        0.056956104934215546,
        0.012233476154506207,
        -0.01613474078476429,
        0.06628721952438354,
        -0.08275594562292099,
        0.027799932286143303,
        -0.04842154309153557,
        0.05208669602870941,
        0.0916624665260315,
        -0.09651529043912888,
        0.009702322073280811,
        0.047653548419475555,
        -0.05805472657084465,
        -0.02764599770307541,
        0.05749577656388283,
        -0.015227511525154114,
        -0.017450688406825066,
        -0.05496685206890106,
        0.02436291053891182,
        -0.008001760579645634,
        -0.04886601120233536,
        0.01148913986980915,
        0.08948488533496857,
        -0.016590045765042305,
        -0.08996529132127762,
        -0.025518136098980904,
        -0.04249197244644165,
        -0.08165722340345383,
        0.03753156214952469,
        0.01738150045275688,
        -0.01869889721274376,
        -0.08416109532117844,
        0.10444492846727371,
        -0.027720874175429344,
        -0.10921869426965714,
        0.0532122440636158,
        0.015790116041898727,
        -0.01958927884697914,
        0.03350543975830078,
        -0.0007216539233922958,
        0.03454551473259926,
        0.013846349902451038,
        0.026483651250600815,
        -0.029044171795248985,
        -0.01461207214742899,
        0.03569979593157768,
        -0.019150275737047195,
        0.11907250434160233,
        -0.017148759216070175,
        -0.02005639486014843,
        0.06921949982643127,
        0.03853244706988335,
        0.06662284582853317,
        0.10902788490056992,
        0.026788996532559395,
        0.0115160271525383,
        -0.05970913916826248,
        -0.0022449565585702658,
        -0.07278814911842346,
        0.030398836359381676,
        0.10846324265003204,
        0.0694417729973793,
        -0.04695892333984375,
        0.02463347092270851,
        -0.02217128686606884,
        -0.010226014070212841,
        -0.021074378862977028,
        -0.020710309967398643,
        -0.008994690142571926,
        0.003128716489300132,
        -0.02275802567601204,
        -0.06853274255990982,
        -0.005917798262089491,
        -0.017173781991004944,
        -0.0039412048645317554,
        0.08504658192396164,
        -0.03756134957075119,
        -0.0831678956747055,
        -0.05433031916618347,
        0.05321536585688591,
        -0.007615597452968359,
        -0.048963285982608795,
        -0.027590341866016388,
        -0.01940230093896389,
        -0.03287743777036667,
        -0.0006668357527814806,
        0.0025674316566437483,
        0.03491610661149025,
        -0.029723873361945152,
        -2.519406369061692e-33,
        -0.07659026235342026,
        -0.09370564669370651,
        -0.035263046622276306,
        0.08360027521848679,
        -0.026921581476926804,
        0.0455046109855175,
        0.06557571142911911,
        -0.017076432704925537,
        -0.01911032758653164,
        -0.007761113811284304,
        -0.016522012650966644,
        0.043808963149785995,
        0.07342584431171417,
        0.02768179401755333,
        0.006451129447668791,
        0.027989959344267845,
        -0.013381198048591614,
        -0.010460258461534977,
        0.13333489000797272,
        -0.024151064455509186,
        0.044940512627363205,
        0.06274832040071487,
        -0.09548407793045044,
        -0.04421451315283775,
        6.611446588067338e-05,
        0.028232118114829063,
        -0.014830476604402065,
        -0.02006678469479084,
        -0.0222761332988739,
        0.0640389621257782,
        -0.01451961975544691,
        -0.01420105155557394,
        0.007512180134654045,
        -0.010874222964048386,
        0.11219099164009094,
        0.02954951673746109,
        0.0472925528883934,
        -0.055654995143413544,
        -0.0015785435680299997,
        -0.024335898458957672,
        0.03527257591485977,
        -0.022478319704532623,
        0.050730008631944656,
        -0.0017830552533268929,
        0.0018396548693999648,
        0.062424156814813614,
        -0.08793654292821884,
        -0.016870955005288124,
        -0.02266477234661579,
        0.02173837460577488,
        0.02532191388309002,
        0.028649484738707542,
        0.03027782402932644,
        -0.05223507806658745,
        -0.02183784730732441,
        -0.06377283483743668,
        -0.04900714010000229,
        0.0009500132873654366,
        -0.01782168075442314,
        -0.026933785527944565,
        -0.00815064087510109,
        0.010870404541492462,
        -0.04305553063750267,
        -0.04080144688487053,
        0.027761593461036682,
        0.08962838351726532,
        0.08486448973417282,
        0.011318836361169815,
        -0.047348763793706894,
        0.007818344049155712,
        -0.06292803585529327,
        0.0218916367739439,
        0.020715028047561646,
        -0.02155887335538864,
        -0.06896308809518814,
        0.027239011600613594,
        0.1205829605460167,
        0.008113873191177845,
        -0.004419097676873207,
        0.03236199915409088,
        0.05422849953174591,
        0.04331018403172493,
        0.09859897196292877,
        -0.012836205773055553,
        0.05569525063037872,
        0.00995249580591917,
        -0.04276305064558983,
        0.008771752007305622,
        -0.09402136504650116,
        0.052474480122327805,
        -0.02961907349526882,
        -0.03240654245018959,
        0.034557685256004333,
        0.07278987765312195,
        0.055931609123945236,
        -5.321080109865761e-08,
        0.017822839319705963,
        0.02468721568584442,
        0.07528945058584213,
        0.017694251611828804,
        -0.043142903596162796,
        -0.006575815845280886,
        0.09265971928834915,
        -0.0014247139915823936,
        -0.028363337740302086,
        0.017454085871577263,
        -0.031585462391376495,
        -0.15273453295230865,
        -0.07167186588048935,
        0.08816801011562347,
        0.09535185992717743,
        0.10975941270589828,
        -0.03420982137322426,
        0.014160051941871643,
        0.002695174887776375,
        -0.07005281746387482,
        0.026369253173470497,
        0.03209420666098595,
        0.0775996521115303,
        -0.05410779267549515,
        0.031042708083987236,
        0.033495932817459106,
        0.0009316600044257939,
        0.09493379294872284,
        0.00030522828456014395,
        -0.06801898777484894,
        -0.027081690728664398,
        -0.02192671410739422,
        -0.005057772155851126,
        0.0038947956636548042,
        -0.0006285204435698688,
        -0.046558927744627,
        0.026614949107170105,
        0.0867081955075264,
        0.09740346670150757,
        0.02843913622200489,
        -0.060477059334516525,
        0.021124038845300674,
        -0.06321393698453903,
        0.011255847290158272,
        0.009227280505001545,
        -0.012538556009531021,
        -0.06116308644413948,
        -0.11523512005805969,
        0.005978511180728674,
        0.0726730078458786,
        0.011791437864303589,
        -0.008262108080089092,
        0.012431168928742409,
        0.09727266430854797,
        0.02279677987098694,
        0.04655040428042412,
        -0.040635690093040466,
        0.019234243780374527,
        -0.01674470119178295,
        0.12351822853088379,
        -0.020918315276503563,
        -0.04656321927905083,
        -0.05297478288412094,
        0.058146506547927856
    ]
}