{
    "id": "n8gOIzWxdNo",
    "title": "iPhone 13: Apple Kills Their Best Product",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-02-28T18:05:10Z",
    "video_url": "https://www.youtube.com/watch?v=n8gOIzWxdNo",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "iphone",
        "iPhone mini",
        "iPhone 12",
        "iPhone 12 pro",
        "iPhone pro max",
        "pro max",
        "iPhone 13",
        "rumors",
        "android",
        "ios",
        "apple",
        "samsung",
        "galaxy",
        "zflip",
        "zfold",
        "microsoft",
        "duo",
        "smartphones",
        "smartphone",
        "tech",
        "technology"
    ],
    "views": 85501,
    "likes": 4899,
    "comments_count": 351,
    "description": "What can we expect of the iPhone 13?   The first 1000 people to use the link will get a free trial of Skillshare Premium Membership:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://skl.sh/thisis02211",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to \"This Is Austin\" - Yes. - This episode is brought to you by Skillshare. - Well, thank you very much Skillshare for sponsoring this episode. You know this episode is also brought to you by wild rumors about the iPhone 13. Sound the alarms pull on your hard hats, and get ready because we're going deep into click bait rumor town, like how Apple's going to ruin the best product they've ever made, the 1984 Macintosh. - No, the actual best product they've ever made is the iPhone 12 mini. I know that there's a lot of people who don't like the mini. - People just disliked the video right now because you said that. - Yeah. - I'm sorry, but you're wrong. - The mini is the best form factor in a phone. - Absolutely - In a long time. - Yes. - And a lot of people immediately wrote it off saying, 'No I don't like it, it's too small', 'the battery life sucks too much', 'the screen's too small' 'I can't type on it.' Look, I got these chubby sausage fingers. I type on it just fine. - Chubby sausage fingers. (chuckles) - So, I feel like the big problem with the iPhone 12 mini is that no one actually tried it. - I think people are so used to the smartphone being the primary computing device in their life. - Yeah. - They want to spend time on Instagram, they wanna watch 'This Is' on YouTube. Number one use case, I think, in the last survey on- - Like literally every one, the top use case is- - Of on the iPhone is just watching. yeah, of course that's right. Yeah, but beyond people- - It makes sense. - Yeah. - Because no one bought the 12 mini (laughing) except you and me. So. - Oh right! That's why we have two views on every video. That's great. - But the thing is with the iPhone 12 mini there been a lot of rumors going around that the iPhone 12 mini had seen its production ceased. That Apple was killing it off for the iPhone 13. This is click bait and trust me I know click bait when I see it cause I'm usually the one who is click baiting other people. So I'm clearly an authority and the space. What happened, Matt? or at least according to rumors. But it definitely checks out is that Apple cut production of the 12 mini, in favor of the standard 12. Now, that sounds bad but when you think about it this is a thing that this is the first time they brought out the mini as a form factor. Also, the first time they've had the mini, the 12, the pro the pro max, there's a lot of different phones before a company like Apple decides to even put these on sale, They have to put in the orders with the suppliers, right? I want 10 million, 12 bennies, and I want 15 twelves and 30 pro maxes, whatever the case is. And in this case, it seems like they maybe slightly overestimated how many people were interested in the smaller form factor, iPhone 12 mini. - Yeah. And so they didn't, there was the low selling of the form factors, this generation and so all these rumors are that, well, no one bought it. So they're just going to kill it off. We know that there's a working iPhone 13 prototype somewhere in the world, right now. - With the mini. Absolutely. Yeah, no. At this point, February, March or so of the year that they're coming out. I mean, Nellie was the design settled probably like six months ago, but yeah, they're absolutely shuttling back and forth on their private jets, you know, testing out the components, kind of finalizing the designs and the components that are inside the 13 mini. - Apple plans these products out years in advance. - Yeah. - So when you have something like this, if they were going to kill it, it just, the ripple of the product wouldn't be in one year, it'd be, you know the 14 or the 15. - Because they've already done the hard work, right? They've already designed the chassis which they're certainly going to be reusing for multiple years. They've already gotten a lot of the software stuff done. Like I don't think at this point, there's a huge incentive for Apple to stop making the iPhone 12 mini style in the future the iPhone 13 mini, the iPhone 14 mini, whatever the case is. Now I will say that there are some rumors that they may pivot that into an iPhone SE right? So the, the SE may kind of come up into the same kind of space as the many, which is fine. We are probably overdue for a new iPhone SE, but- - It's funny because not that long ago we were talking about how the SE is the most powerful smartphone you could buy - At $300, $400, yeah. - And so I feel like they could be. So even if they did decide to kill off the mini, pivoting it to the 12 into the SE 3 or whatever would make a lot of sense where they just take literally the exact 12 mini right now which they already have apparently extra of as far as chassis component. - Sure. - They put in the new A15 or A6, whatever chip they're going to be using, they upgrade the processor and suddenly that's a cheap phone that again will be the SE equivalent, - Yeah. - Which has always been smaller form factors, stuff like that. - Honestly, a lot of this stuff makes sense but what makes even more sense is the Segway to our sponsor, Skillshare. - Yeah. Skillshare is an online community with thousands of classes ranging from anything like digital photography, illustration, web design. I know you're particularly interested in the writing aspects of things. - As a YouTuber, I always want to be able to tell a better story which is why I'm taking the class 'Storytelling for Leaders' by Keith Yamashita. But the great part about Skillshare is that not only do you get unlimited access to this ad free content, but on top of that for less than $10 a month you get to expand your noggins. And beyond that, we actually have ourselves a promo code here on 'This Is' if you check out the link in the description, the first 1000 people to sign up will get yourself a 100% free trial. So thank you very much to Skillshare for sponsoring this content and expanding noggins everywhere. So the thing is, beyond having another iPhone mini I do think that there are some things that are pretty natural improvements for this next generation of iPhones. First and foremost, I want myself a fingerprint reader. Where's my touch ID, Tim Cook? I need you to touch me in my heart via my thumbprint. - So there's a lot of talk, whether it would be like an under display fingerprint sensor. I don't think it will be. I mean, we have the iPad air which now has the touch ID in the power, um the power button. - Which is totally fine, right? As a proud Z flip gang member, I use my side mounted fingerprint sensor all the time. It works completely fine. - I'll be real, me personally, I don't like, uh, display fingerprint sensors. Not because, I mean, not because they don't work that well, it's just where do, like it's not always not always apparent of where to press - You have to learn, yeah. - And like, I just, I just know like there's a physical location there. I mean, that's nitpicky. I know that's a personal preference. - So I know display finger sensors have been around for several years at this point. I will say that the only phone that actually, I think really does it right yet is the Samsung galaxy S21 which has the latest Qualcomm fingerprint sensor. Essentially, it's still under the display. It's a little bit bigger, but importantly, it's fast because most of these fingerprint sensors have been first of all, very small, but secondly, just really slow, right? I don't want to put my finger there. Wait a second for it. And then have it unlocked, right? I don't think any of this means that face ID is going away but in the world we live in where you might not always have clear access to your face is I think it is very important to have touch ID. I do expect we will see that on the iPhone 13 this year. - Yeah. - There's of course talk about a matte black edition. I mean, I don't know if you can imagine a scenario which Tim Cook is presenting this and Marquez walks out and he's like, 'yeah, it's not black' and just drops the mic and leaves. - No, he'd come out and be like 'so I've been using this for a couple of weeks now-' I want to talk about real quick. Like you say, like you you think face ID is not going anywhere. - Yeah. Yeah. Yeah. - But if they do bring back touch ID- - Yeah. - Then we can get rid of the notch. - No, I think it's going to be both. No, no, no. I think face ID is going to be exactly the same. I think they're going to add touch ID's as an option, right? You could, I assume you could use one, you can use both, or maybe there's a scenario in which you have to, you know you have super security mode where you have to have your fingerprint and your face or something. - It's not, I don't think it's an incredibly difficult thing to implement. The face ID part is much harder than putting a fingerprint sensor, which has been figured out since what? the iPhone is? - Long, long time. - Yeah. - But-,So the-, another-, another feature that is supposedly coming which is going to be a very welcome one to me is a significantly improved ultra-wide camera angle. - Yes. - Because right now, as someone who does all the thumbnails using my iPhone, the ultra wide is basically worthless. - It's very much a lower quality sensor - Yeah. - To be fair, this is, uh, something that is fairly common. Most phones don't have great ultra wides but I feel like the iPhones are like I don't wanna say bad but they're not great. - I mean the standard camera, Great. Yeah. Ultra wide, I never use it because it's so much noisier. It's just like, the quality is just such a huge drop-off. - Yeah. - Which, you know, it's one thing if you're like taking like, like a landscape shot of a wide panoramic, but like anything indoors, it's just- - It's just not there. - You know? And when you only have two cameras on, on like something like the mini, you know, it's, it's, it's nice to just have both cameras be the same level of quality. - Yeah, absolutely. Now there are some other things to talk about when it comes to what these iPhone thirteens will look like, right? I don't foresee that we're going to see any kind of different form factors, but specifically when you start to look a little bit farther into the future,there are actually some very interesting rumors that certainly aren't going to happen this year. But it really got me thinking about what the future of the iPhone is going to look like. Now, first and foremost, was actually one that was very recent where there was some talk about how Apple is starting to develop their first 6G modems. Yes. My friends not 4g, not 5g, 6G. - What world ending pandemic is 6G going to start? - 6G is going to cause the locust. I think that's, that's, that's, 6G causes locust. Confirmed. The thing is, so if you're familiar with the way the Apple does things, they like to do it all in house, right? So a lot of the components, the software hardware, a lot of this stuff is designed and developed in house. And pretty much every year, they're sort of adding more and more stuff. So, you know, they started building the chips and then they started building the GPU's inside those chips in the CPU's and like all the individual components that make up an iPhone. Apple's been taking more and more of that in house. They recently, or I say recently, a year or two ago, they purchased the modem division of Intel, which of course the modem is what is the component that allows you to actually, you know send and receive your 4g or your 5g or whatever. Now, something interesting that I actually found out fairly recently even though they've switched to Qualcomm, which they had a whole legal battle about but Qualcomm makes the modems in the current iPhone 12. The antennas, which is usually kind of a package that like Qualcomm would sell or something um, Apple actually has designed the millimeter wave antenna, right? So they're starting to kind of get those chops to do this stuff quite interesting, right? - Yeah and you know, it makes sense that they are working on developing 6G, because what they have to compete with is Qualcomm, who recently just announced that they're working on, on like a 10 GB 5g. - That's crazy. - So, it's not it's not just enough to say, 'Oh we're going to do everything in our, in house.' Again, they have to say, 'we're going to do it in house because we can do it better' - Yeah. - Which is exactly what they did with their original chip. - There's also a real incentive for Apple to be more on the ball. If you think back to the original iPhone, right? All the way back in 2007, that's a film that launched without 3g at a time where 3g was fairly popular, right? They've always been behind. 'I'm bringing up LTE.' I mean, they were a year and a half behind like Samsung when it came to 5g, I can see a scenario in which Apple tries to be a leader in 6g and they try to bring this stuff out. Now, mind you, when we're just talking about 6G this is something that's probably kind of come out in like 2030 , right? Certainly not anytime soon. 5g is going to have a very long run but it's interesting to think about. Something else that of course has been going around for literally two years now at this point, is a folding iPhone. Now we're not talking iPhone 13. We're talking like iPhone 16? - Apple will be the last, the last company to release a folding device. - Yeah. - Because again, Apple always does this. They're not going to release something that they are not exactly happy with. So, the trial and error that Samsung is doing which has been great because you need someone to do it in order to make folding phones popular. But like all the trade-offs that you've had with like the fold or the Z flip with like creases which some people don't like. That's the kind of stuff that Apple would say, 'No we're not happy with this and if we can't have exactly what we want in the first iteration of it,' they're not going to do it. - Right. I guarantee you if you take a peek inside the Apple Park campus, somewhere underneath the fountain, take a left to Johnny I's office, you go down four more floors- - That, that office is empty. - Oh, okay. If you go three more levels below that you'll find an iPhone prototype of the folding display. There's zero reason why they can't take a motherboard hook it up to a screen that opens and closes, right? I'm sure they had some kind of version of this, but you're right. That probably version will not see the light of day until it is far, far more advanced. But it's interesting to think about it because right now in a lot of ways, the smartphone industry for traditional flat boring phones that don't fold is getting a little bit, I don't wanna say stale but the innovation is not hugely there. I mean, sure. Camera's going to continue to get better. There are gonna be better zooms. Screens are going to get maybe a little smoother with like 120 Hertz and whatnot but it is difficult to think if you're Apple, you don't want Samsung to come up And all of a sudden a year from now, two years from now, folding phones are everywhere and they're selling it for $600 and you're being left behind, right? Because that's a major investment you need to make in folding technology to, like you said get the creases right, to get the software, get all these things for the design. And so I think if you're Apple , this is probably more of a fundamental kind of way that they have have to think, you're always thinking about and sort of almost afraid about what's coming. - Yeah. And- - You don't want to get swallowed up. There's billions of dollars on the line. If you make a mistake today that you won't even bring out till three or four years from now but if you make a bet that four years from now people will also be using flat phones. And guess what? That's not the case. You can't undo that you can't just snap a finger throw some cash at it. and all of a sudden, suddenly have some amazing phone, right? So I think it would be very interesting as a thought exercise to imagine if you were Tim Cook right now and you're looking at the next 5, 10 years of the Apple roadmap, what decisions do you make? - I think that we would see a, a duo style phone - Ooh. - Before we would see is a Z-fold style phone. - That is certainly a lot easier. So we did a video all about the Microsoft surface duo which you actually should check out which- - I love. - It's an interesting phone. - I, I, I, I daily'd that for a little while The only reason I didn't like it is because the software was just terrible. - You can imagine though, that phone which is currently running Android, running a version of iOS, I mean, you take off the surface load and you put an Apple logo on there, that hardware totally check out to me as an Apple product. - Right. And so I think that that's where Apple should maybe because like that is something that they can easily just throw money at. - It's interesting. There's a lot to talk about here when it comes to the iPhone 13 and beyond. So, we are curious to know what do you think the future of the iPhone looks like? Are we going to be using folding iPhones in three years time or have we all ascended to our Z-flip Nirvana? That's the actual answer. I just want everyone use the Z-flip I'll feel included and cool, finally.",
    "transcript_keywords": [
        "Apple",
        "iPhone",
        "Yeah",
        "mini",
        "lot",
        "years",
        "people",
        "year",
        "kind",
        "phone",
        "Skillshare",
        "time",
        "fingerprint",
        "make",
        "stuff",
        "interesting",
        "phones",
        "Austin",
        "Qualcomm",
        "thing"
    ],
    "transcript_entity_values": [
        "zero",
        "Storytelling for Leaders'",
        "Android",
        "S21",
        "three",
        "one year",
        "5",
        "Nellie",
        "three years",
        "CPU",
        "300",
        "a year from now",
        "thousands",
        "two years from now",
        "6",
        "less than $10",
        "secondly",
        "four years",
        "billions of dollars",
        "a couple of weeks",
        "YouTube",
        "Microsoft",
        "iPhone 12",
        "millimeter",
        "February, March or so of the year",
        "iPhone 16",
        "GPU",
        "Marquez",
        "a year or two ago",
        "Matt",
        "iPad",
        "Qualcomm",
        "Austin",
        "Samsung",
        "600",
        "12",
        "Keith Yamashita",
        "2030",
        "this year",
        "SE",
        "1000",
        "10 years",
        "first",
        "Instagram",
        "1984",
        "10",
        "A15",
        "the next 5",
        "30",
        "LTE",
        "A6",
        "YouTuber",
        "100%",
        "13",
        "10 million",
        "4",
        "400",
        "second",
        "like six months ago",
        "Intel",
        "Skillshare",
        "First",
        "one",
        "Apple",
        "four",
        "iPhones",
        "day",
        "three or four years from now",
        "Macintosh",
        "14",
        "today",
        "120",
        "Nirvana",
        "two years",
        "years",
        "iPhones",
        "several years",
        "Tim Cook",
        "a year and a half",
        "3",
        "Hertz",
        "15",
        "Johnny I's",
        "multiple years",
        "two",
        "Apple Park",
        "Segway",
        "15 twelves",
        "iPhone",
        "2007",
        "iPhone SE"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.07833575457334518,
        0.03595593199133873,
        0.13817864656448364,
        -0.08550653606653214,
        0.02112302929162979,
        0.005907556042075157,
        0.03735131025314331,
        0.08715786784887314,
        0.003152096876874566,
        -0.0010381480678915977,
        0.08462652564048767,
        0.05206239968538284,
        0.004934622906148434,
        -0.008514762856066227,
        -0.02947535179555416,
        -0.01427941769361496,
        0.061055585741996765,
        -0.059359919279813766,
        -0.09752799570560455,
        0.030002452433109283,
        -0.021939869970083237,
        0.020076069980859756,
        0.07447519153356552,
        0.04357294365763664,
        0.05216183140873909,
        0.07222819328308105,
        -0.06519539654254913,
        -0.06256923824548721,
        -0.0066513135097920895,
        -0.007927238009870052,
        -0.03509955853223801,
        0.08153655380010605,
        0.048594631254673004,
        0.007858071476221085,
        0.010281273163855076,
        -0.09562967717647552,
        0.04349386319518089,
        -0.0035698728170245886,
        -0.03411520645022392,
        -0.0983416959643364,
        -0.06556010246276855,
        0.014554662629961967,
        0.019605416804552078,
        0.04851765185594559,
        0.004020412918180227,
        -0.030812382698059082,
        0.08562647551298141,
        -0.05369308218359947,
        -0.015136310830712318,
        -0.02404273860156536,
        -0.021451644599437714,
        -0.016634531319141388,
        0.01749769225716591,
        0.05394537001848221,
        0.0029681173618882895,
        -0.05714240297675133,
        -0.022920701652765274,
        0.007673127576708794,
        0.12609374523162842,
        0.053699735552072525,
        0.035055696964263916,
        -0.06411772966384888,
        -0.03220628201961517,
        0.020554931834340096,
        0.016848329454660416,
        -0.06872902065515518,
        -0.05901213735342026,
        -0.025210727006196976,
        -0.028611548244953156,
        0.045954734086990356,
        -0.008098735474050045,
        0.004162325523793697,
        0.04045344889163971,
        0.09583716839551926,
        0.016753721982240677,
        0.059709541499614716,
        0.07534370571374893,
        -0.033636048436164856,
        -0.07512049376964569,
        0.05177559331059456,
        0.06146914139389992,
        -0.05218341574072838,
        -0.0291998703032732,
        -0.025589261204004288,
        0.028786512091755867,
        -0.06374771147966385,
        0.0016576754860579967,
        0.010591506958007812,
        -0.03809661045670509,
        -0.047670647501945496,
        -0.05178506299853325,
        0.12330947816371918,
        0.028488734737038612,
        -0.02801479399204254,
        0.034914642572402954,
        -0.03259613364934921,
        -0.0405002161860466,
        -0.07212748378515244,
        -0.05644993111491203,
        0.04052921384572983,
        0.07029170542955399,
        0.0037394301034510136,
        0.0062609645538032055,
        -0.03795751929283142,
        0.027924321591854095,
        -0.08096154034137726,
        -0.05256379023194313,
        -0.01320449449121952,
        0.07517580687999725,
        0.1157408356666565,
        -0.002543455921113491,
        -0.022809753194451332,
        -0.07395132631063461,
        0.02393290214240551,
        0.02374018169939518,
        0.0007219039835035801,
        -0.049076516181230545,
        0.08078579604625702,
        0.0711195319890976,
        0.010322986170649529,
        -0.009513599798083305,
        0.021468905732035637,
        -0.05226683244109154,
        -0.019612915813922882,
        0.012768925167620182,
        -0.0006002580048516393,
        -0.03781639039516449,
        8.318506996448846e-34,
        0.02793438732624054,
        0.10422660410404205,
        -0.04636472091078758,
        0.02093212679028511,
        -0.0015502044698223472,
        -0.06260882318019867,
        0.010650279931724072,
        0.08192141354084015,
        0.01218887697905302,
        0.023979585617780685,
        -0.02374969981610775,
        -0.06211176514625549,
        -0.09165379405021667,
        0.0414172038435936,
        0.1077033057808876,
        -0.053138669580221176,
        -0.1000283882021904,
        -0.06748628616333008,
        -0.0172229316085577,
        -0.050448644906282425,
        0.02516796812415123,
        -0.020134029909968376,
        0.016077030450105667,
        -0.049167465418577194,
        -0.01766769401729107,
        -0.02529187500476837,
        0.07941867411136627,
        0.0023997246753424406,
        0.020273637026548386,
        0.009166911244392395,
        -0.11172451823949814,
        -0.013726988807320595,
        0.037225279957056046,
        -0.05461357161402702,
        -0.04961250349879265,
        0.00910856667906046,
        0.06078314036130905,
        -0.07083110511302948,
        0.08069844543933868,
        0.015497052110731602,
        -0.10262278467416763,
        0.03558533266186714,
        -0.03879965841770172,
        0.023308468982577324,
        0.09178179502487183,
        0.05870026350021362,
        0.029140280559659004,
        -0.007261201273649931,
        -0.04242074117064476,
        -0.02064317837357521,
        -0.02201727218925953,
        -0.05110113322734833,
        0.09347555786371231,
        -0.017089618369936943,
        -0.043039578944444656,
        0.08310703933238983,
        0.018627602607011795,
        -0.049448177218437195,
        0.014494696632027626,
        0.04397678002715111,
        -0.020335011184215546,
        0.012286249548196793,
        -0.04457360506057739,
        0.04741133749485016,
        -0.10355691611766815,
        0.04856733977794647,
        0.09323737770318985,
        -0.006232011131942272,
        -0.06804469972848892,
        0.09044930338859558,
        -0.03883613273501396,
        0.019524240866303444,
        -0.026853060349822044,
        -0.0786275714635849,
        0.01523349154740572,
        -0.007792680524289608,
        -0.028176864609122276,
        0.010815349407494068,
        -0.016299011185765266,
        -0.033559199422597885,
        0.024459050968289375,
        0.010645709000527859,
        -0.011970332823693752,
        0.022262265905737877,
        -0.009730293415486813,
        -0.03963302820920944,
        -0.03732882812619209,
        -0.05836459621787071,
        0.02297440730035305,
        0.10434515029191971,
        -0.030907923355698586,
        -0.039898186922073364,
        -0.0518224835395813,
        0.08317916095256805,
        -0.0316188745200634,
        -2.010837921728045e-33,
        -0.05708504840731621,
        -0.09140974283218384,
        0.012275014072656631,
        0.0070365360006690025,
        -0.04742712527513504,
        -0.07707185298204422,
        0.016817990690469742,
        0.05883403494954109,
        -0.026539962738752365,
        -0.029896441847085953,
        0.007154457271099091,
        0.02078963629901409,
        -0.01764633320271969,
        -0.016821876168251038,
        -0.051236432045698166,
        -0.017656216397881508,
        -0.028518132865428925,
        -0.08759020268917084,
        0.0936230793595314,
        -0.002843569265678525,
        0.07472845166921616,
        0.020901275798678398,
        -0.058276545256376266,
        0.03589147701859474,
        -0.02360525168478489,
        -0.03408164158463478,
        -0.0009659987408667803,
        0.02283920906484127,
        0.05124032869935036,
        -0.06592495739459991,
        0.04209831357002258,
        -0.0839322954416275,
        -0.011563439853489399,
        0.013088746927678585,
        0.03514580801129341,
        0.06277596205472946,
        -0.027057185769081116,
        -0.07271965593099594,
        -0.003477186430245638,
        -0.06667444109916687,
        0.08961847424507141,
        0.04112977907061577,
        -0.04487089067697525,
        -0.06442432105541229,
        0.04331832006573677,
        -0.048882294446229935,
        0.031517136842012405,
        0.011966361664235592,
        0.02977115660905838,
        0.04439496248960495,
        0.029056783765554428,
        -0.029713492840528488,
        -0.03708375245332718,
        0.028778357431292534,
        -0.08260396867990494,
        -0.04308263957500458,
        0.07110583037137985,
        -0.024951903149485588,
        0.009348402731120586,
        0.012153534218668938,
        0.09006404131650925,
        -0.02493283525109291,
        -0.028740279376506805,
        -0.09598234295845032,
        -0.0551658496260643,
        -0.006570245139300823,
        0.0567607507109642,
        -0.0015640351921319962,
        -0.0030205787625163794,
        0.03373270481824875,
        0.023890800774097443,
        -0.00239573628641665,
        -0.03860243409872055,
        -0.08960361033678055,
        -0.013677126727998257,
        0.06963334232568741,
        -0.03416755795478821,
        0.004596194252371788,
        -0.07374592125415802,
        -0.07687174528837204,
        0.04880484938621521,
        0.10749338567256927,
        0.03441411629319191,
        0.004932444076985121,
        0.10067178308963776,
        0.10029667615890503,
        0.04965992271900177,
        0.029144100844860077,
        -0.04265829920768738,
        0.07973406463861465,
        -0.03588511049747467,
        -0.006813067477196455,
        -0.02199218049645424,
        0.08082025498151779,
        -0.07808604836463928,
        -5.2622421975456746e-08,
        0.04775681346654892,
        -0.03039640374481678,
        0.0235318411141634,
        -0.03838086873292923,
        0.01036232803016901,
        -0.00627603055909276,
        -0.00047420160262845457,
        0.07804861664772034,
        0.069952093064785,
        0.00030176519067026675,
        0.009525640867650509,
        -0.04175665229558945,
        -0.09331405162811279,
        0.08659888803958893,
        0.013131953775882721,
        0.10171249508857727,
        -0.029553217813372612,
        0.02058621309697628,
        -0.020619558170437813,
        -0.05552177503705025,
        -0.002065168460831046,
        0.07148399949073792,
        0.037110622972249985,
        -0.00790440384298563,
        -0.0021589461248368025,
        -0.017543718218803406,
        -0.028679203242063522,
        0.030760398134589195,
        0.01788698323071003,
        -0.03042800910770893,
        -0.09102943539619446,
        -0.04174324870109558,
        -0.05541864410042763,
        -0.0038794009014964104,
        -0.05428982153534889,
        -0.04721173271536827,
        0.026764165610074997,
        -0.014110065996646881,
        0.050595931708812714,
        -0.022636843845248222,
        -0.020817039534449577,
        -0.04841892048716545,
        -0.00897846557199955,
        -0.02179456502199173,
        -0.015651900321245193,
        -0.026586782187223434,
        -0.04747280105948448,
        -0.09000544250011444,
        0.028586504980921745,
        0.11579111963510513,
        0.022995388135313988,
        -0.08723752945661545,
        0.0021503358148038387,
        -0.014604484662413597,
        0.06982264667749405,
        -0.01909119449555874,
        0.006807158701121807,
        -0.03987296298146248,
        -0.03562821075320244,
        0.0326949805021286,
        0.1267521232366562,
        -0.019949663430452347,
        0.05531473457813263,
        0.10341371595859528
    ]
}