{
    "id": "N8z30-qZqEk",
    "title": "The World's Newest Foldable – Is A Laptop? [Into The Fold Episode 5]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-11-28T02:22:08Z",
    "video_url": "https://www.youtube.com/watch?v=N8z30-qZqEk",
    "category": "Science & Technology",
    "tags": [
        "lenovo x1 review",
        "x1 fold review",
        "thinkpad x1 review",
        "lenovo thinkpad x1 fold review",
        "lenovo foldable",
        "folding pc",
        "folding screen",
        "into the fold",
        "folding laptop",
        "foldable laptop",
        "folding screen laptop",
        "folding tablet",
        "foldable tablet"
    ],
    "views": 195958,
    "likes": 12290,
    "comments_count": 802,
    "description": "A portion of this video is sponsored by MediaTek, the worlds #1 connectivity provider. Learn more:    [LENOVO THINKPAD X1 FOLD: INTO THE FOLD EPISODE 5]  For the past four episodes of Into The Fold, weve talked about how the folding screen changes the way we use our smartphones. Well, nearly two years ago Lenovo posed the same question to laptop users  and today, we finally get to start answering it.   This is the third time the Lenovo ThinkPad X1 Fold has graced the MrMobile YouTube channel, but the first time its doing so in final retail form. And while the full X1 Fold review will take more time, one thing is already clear: Lenovo has succeeded in porting many of the conveniences from the world of the folding phone  while also avoiding many of the pitfalls weve seen in that space in 2020 The ThinkPad X1 Folds display is more robust than the folding screens of its smartphone cousins, and at the larger scale of a 13.3 laptop, its utility is substantially greater as well. Thats thanks in no small part to the X1 Folds wireless keyboard and Lenovo Mod Pen, both of which have been thoughtfully integrated into every mode of the X1s operation.  Well explore the setbacks that Windows 10 foists upon this experience in the full ThinkPad X1 Fold review. For now, join Michael Fisher to explore the question of what a folding display does for a laptop, in Into The Fold episode 5!   [SUBSCRIBE TO MRMOBILE]     [ABOUT INTO THE FOLD EPISODE 5: DOES A FOLDING SCREEN MAKE A LAPTOP BETTER?]  This is the fifth in a series of episodes exploring the many facets of life on a folding screen. From the best foldable phones of 2020 to the bleeding-edge world of folding-screen laptops, Into The Fold is MrMobiles showcase for the most exciting movement in mobile technology since 2007!   Episode 5, a first look at the retail version of the Lenovo ThinkPad X1 Fold, was produced following three days with a Lenovo ThinkPad X1 Fold retail unit purchased by MrMobile/Future plc. Lenovo did not pay a fee or otherwise offer compensation in exchange for this coverage, nor did Lenovo preview or approve this content before publication.   A portion of this video was sponsored by MediaTek.   [PRODUCTS IN THIS VIDEO]  ThinkPad X1 Fold [Lenovo]:   Collins Vertical Messenger Bag [Brenthaven]:   Microsoft Arc Mouse [Amazon]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #thinkpadx1fold #x1fold #x1 #lenovo #thinkpad #foldingscreen #foldable #intothefold #mrmobile",
    "description_links": [
        "https://www.poweredbymediatek.com/",
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1UN",
        "http://mrmobile.tech/1UO",
        "http://mrmobile.tech/1UP",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- A portion of this video is sponsored by MediaTek. For four episodes of this series for far, we've tackled the question, how does a folding display change the way you use your smartphone? Well, almost two years ago Lenovo put the same question to laptops. And today we finally get to start answering it. (upbeat music) I got my first preview of the ThinkPad X1 Fold before it even had a proper name, back in May of 2019. But if you missed that, and the hands on from CES back in January, let me give you a quick refresher. While you might be tempted to thing of this as a tablet, Lenovo calls it a foldable PC. And that's really how I'd encourage you to think of it too. At 2.2 pounds or about one kilogram, it's beastly for a tablet, and it's not built on the kind of mobile architecture we've come to expect from tablets either. Under the hood, the X1 Fold is a full own personal computer from its Home Edition build of Windows 10, to the fan cooled Intel Core i5 it runs on. So get the whole, should I buy this or buy an iPad question out of your head. This is really just a different kind of ultra portable laptop. I'll cover how well the X1 Fold delivers on that promise in my full review. Today, I wanna focus on the foldable aspect. And the best way to do that is to the answer the question that people have been peppering me with since I teased this video on Twitter. Why? Why would I want a folding screen on a laptop? It's a good question, and to answer it, let's take a look at a conventional laptop of about the same size. The Lenovo Flex 5G I reviewed this past summer. For all its tricks, this will always have the footprint of a 14 inch notebook. Open, closed, open and closed, it'll always be at least this big. Now compare that with the X1 Fold. When I open it to its full 13.3 inches, I get almost as much screen real estate as the Flex 5G. It supports itself in landscape mode using a built in kick stand, so I can move the wireless keyboard anywhere relative to the display. I can use a mouse, or I can interact directly on the touch screen. I can even prop it up in portrait mode if I want with a stand. When I have the space to spread out, this is even more versatile than a standard laptop. But what I don't have the space to spread out? Well, that's where the foldable display starts to pay for itself. I bend the X1 Fold into a laptop shape and click the keyboard into its magnetic landing zone. Just like that, the screen shrinks to half size, I ditch my mouse for the track pad, and I'm netbooking like it's 2009. In a former life, this would've been heaven. For airplane, train, tray tables. Oh, that's clever. In 2020, it mainly comes in handy at Brooklyn coffee shops with their manhole sized outdoor tables. And when it comes time to pack up and go, not only does the X1 Folk collapse into a more petite package than a laptop, it does so with a dazzling display of engineering alacrity. So you don't have to carry the keyboard separately. It stays right in the middle of that OLED sandwich where it also charges wirelessly. It also includes a loop for the Lenovo Mod Pen. So that that's not rattling around in your bag. A bag that can now be much smaller, because the machine's closed footprint is about the size of a hardback novel. One bound in real leather, by the way. Now if that pen perked your ears up, don't worry, we'll come back to it. And of course, no discussion of foldables is complete without tackling the durability question. And I'll have surprises for you in both categories, I think, after a quick word from my sponsor. Know what I like doing a lot? Ordering food delivery. Know what's often expensive and really unhealthy? Ordering food delivery. So my sponsor, MediaTek sent over this smart oven from Amazon. I know, I know, that's like two different flavors of what? But it's true, Amazon sells a smart oven, and it's everything a kitchen newb like me needs it to be. Struggle free, tinker free, and stress free. I mean, it's also a combination microwave, convection oven, and air fryer, but the important thing is that I can control it with my voice. Just like the Star Trek food replicator I've always wanted. Alexa, tea, Earl Grey, hot. (whimsical tune) - [Alexa] Food replication complete. - Splendid. The Amazon smart oven is just one of dozens of smart home devices powered by MediaTek, the world's number one connectivity provider. To learn more, visit this link, and thanks to MediaTek for sponsoring this video. So in a category of devices where durability is still a big focus, just how robust is the X1 Fold? I wanted to be able to answer that question over the long term, so I actually bought this device, and just like I did with folding phones this year, I'll be using the X1 Fold as consistently as I can throughout 2021 to see how well it ages. But my initial experience, at least with the hardware is encouraging. Back at CES, Lenovo showed us how it anchored this LG OLED panel with carbon fiber plates and magnesium alloy. It showed us how that folding display is mounted to hinges that allow you to choose any angle you want, and when fully opened, those hinges impart tension to the display to stretch it taut. One effect of that, is like unlikely every foldable phone we've seen to date, whose screens are bisected by distinctive seems, the X1 Fold has only the fairest hint of a double crease down the middle. If you're not looking for it, you're not gonna see it. And in a world where Galaxy Fold fans are waiting for Samsung to develop a folding screen rugged enough to hold up to an S Pen, Lenovo has already done it. For the past two days, I've been using the X1 Fold's Mod Pen to navigate a tenor face on and off, and in my one extended session using it as a tablet, I spent about a half hour scribbling a little planet scene in Paint 3D. Despite all that, there's not a scratch to be seen on this screen yet. Now I realize that some of this may have sounded like a love letter to the X1 Fold or perhaps a sponsored video, but it is neither. In the full review, I will expound upon the several ways this device falls short of its roughly $3,000 price tag. Spoiler alert, a lot of it has to do with Windows. But \"Into the Fold\" is about how flexible displays change the way we use our technology. With this device, Lenovo brings the portability advantages of folding phones to the world of PCs. It's adding functionality to that world through its very clever accessory design and so far at least, it's proving that we don't have to settle for durability compromises along the way. So yes, it's very expensive, there's a lot of issues with Windows, which again, I'll get to in that full review, but if you're closing out 2020 still thinking foldables won't be a big part of our mobile future, well, based on the hardware alone, devices like the X1 Fold should make you think twice. This video was produced after three days with a ThinkPad X1 Fold retail device purchased by Mr. Mobile's publisher. While there are some great sponsored showcases out there I'd encourage you to check out, this isn't one of them. Lenovo did not provide compensation for this coverage nor was it given copy approval rights or an early preview. The opinions contained here in are mine, and mine alone. Please subscribe if you'd like to help me make more videos like this in the future, and check out the other episodes of \"Into the Fold\" in my series playlist on YouTube. Until next time, thanks for watching, and if you can't stay home, then stay safe, and mask up as you stay mobile, my friends.",
    "transcript_keywords": [
        "Fold",
        "Lenovo",
        "Fold Mod Pen",
        "question",
        "Lenovo Mod Pen",
        "laptop",
        "display",
        "screen",
        "folding",
        "Fold Mod",
        "full",
        "video",
        "Pen",
        "Mod Pen",
        "Galaxy Fold",
        "device",
        "folding display",
        "foldable",
        "Galaxy Fold fans",
        "Lenovo Flex"
    ],
    "transcript_entity_values": [
        "2021",
        "Lenovo",
        "Today",
        "2020",
        "almost two years ago",
        "14 inch",
        "January",
        "Galaxy Fold",
        "half",
        "2009",
        "Brooklyn",
        "Samsung",
        "the past two days",
        "Alexa",
        "ThinkPad X1 Fold",
        "about a half hour",
        "YouTube",
        "2.2 pounds",
        "four",
        "the X1 Fold",
        "Alexa",
        "Mobile",
        "this year",
        "today",
        "first",
        "One",
        "Earl Grey",
        "13.3 inches",
        "Paint 3D.",
        "two",
        "Star Trek",
        "Home Edition",
        "an S Pen",
        "MediaTek",
        "Into the Fold",
        "Intel Core",
        "Windows 10",
        "CES",
        "the Lenovo Mod Pen",
        "LG",
        "this past summer",
        "May of 2019",
        "dozens",
        "the X1 Fold's",
        "iPad",
        "Windows",
        "Twitter",
        "roughly $3,000",
        "three days",
        "just one",
        "tinker free",
        "one",
        "about one kilogram",
        "Amazon"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "ORG",
        "LAW",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.11815032362937927,
        -0.058876048773527145,
        0.008017092011868954,
        -0.07834849506616592,
        0.0737575814127922,
        -0.015898283571004868,
        0.002196368295699358,
        0.11517559736967087,
        0.002534387167543173,
        0.00019067511311732233,
        0.08417291194200516,
        0.10088339447975159,
        0.005765545181930065,
        0.037527650594711304,
        0.09077013283967972,
        0.07041424512863159,
        0.046912308782339096,
        -0.13314974308013916,
        -0.01802641712129116,
        0.029740452766418457,
        0.08958186954259872,
        -0.04624819755554199,
        0.02875901386141777,
        -0.03955715894699097,
        0.05418407917022705,
        0.02440430037677288,
        -0.02950357086956501,
        -0.03709232434630394,
        -0.0034434013068675995,
        0.04947163164615631,
        -0.02597833052277565,
        0.09228616952896118,
        0.023523926734924316,
        -0.004219150636345148,
        -0.01145380362868309,
        -0.06751453876495361,
        0.000958814169280231,
        -0.011052900925278664,
        -0.012433580122888088,
        -0.10158685594797134,
        -0.05090516805648804,
        -0.06893297284841537,
        0.04662469029426575,
        -0.02766447700560093,
        0.014873052947223186,
        -0.05502106249332428,
        0.0517292246222496,
        -0.019742442294955254,
        0.005644305609166622,
        -0.02006381005048752,
        0.04048778489232063,
        -0.011833558790385723,
        0.0021224787924438715,
        -0.03831222653388977,
        -0.04720493033528328,
        0.01217305101454258,
        0.01217991579324007,
        0.08527881652116776,
        -0.019457437098026276,
        0.0803440734744072,
        0.06528794020414352,
        -0.04308741167187691,
        0.0019116050098091364,
        0.029117267578840256,
        0.06251055747270584,
        -0.046095915138721466,
        0.004054929595440626,
        -0.10771776735782623,
        -0.007895587012171745,
        -0.0014011772582307458,
        -0.055580202490091324,
        0.031818293035030365,
        0.007737277541309595,
        -0.07658950984477997,
        -0.06936847418546677,
        -0.008595943450927734,
        0.11685658246278763,
        0.00024785008281469345,
        0.008033938705921173,
        0.04139506816864014,
        0.014381418004631996,
        0.06573585420846939,
        0.012638445012271404,
        -0.033910319209098816,
        -0.01901443861424923,
        -0.04650888964533806,
        -0.0073630353435873985,
        0.007947931066155434,
        -0.08409842103719711,
        -0.05060550197958946,
        0.03340861201286316,
        0.06485094130039215,
        -0.06815279275178909,
        0.04319115728139877,
        -0.06983019411563873,
        -0.047019731253385544,
        0.0182824544608593,
        -0.02857304736971855,
        -0.028709651902318,
        0.038630109280347824,
        0.02454438805580139,
        0.09828624874353409,
        0.14143776893615723,
        -0.01566425897181034,
        -0.025305520743131638,
        -0.0723680779337883,
        0.0491725318133831,
        -0.0002817753120325506,
        -0.06517069041728973,
        0.03773049637675285,
        -0.034903913736343384,
        -0.07059362530708313,
        -0.005827569402754307,
        0.02902737818658352,
        -0.05683884024620056,
        0.037000320851802826,
        0.011471915058791637,
        0.08988404273986816,
        0.07329139113426208,
        0.08084271848201752,
        -0.03958098962903023,
        0.0017041373066604137,
        0.055659759789705276,
        -0.058818519115448,
        0.038001466542482376,
        0.01675225980579853,
        -0.07692047953605652,
        6.408435940222141e-33,
        0.009524674154818058,
        0.07517256587743759,
        -0.041598640382289886,
        -0.01093047484755516,
        0.03181816637516022,
        -0.012174923904240131,
        -0.0253347959369421,
        0.010425567626953125,
        0.037168338894844055,
        0.08492361009120941,
        -0.02376619167625904,
        0.0008673332049511373,
        -0.04695124179124832,
        -0.03726138547062874,
        0.03625647723674774,
        -0.0838305652141571,
        -0.10127301514148712,
        0.019447600468993187,
        -0.06712137162685394,
        -0.023867294192314148,
        0.020792510360479355,
        -0.01750493422150612,
        0.05782743915915489,
        -0.07625848054885864,
        -0.00929634366184473,
        0.0009188733529299498,
        0.019213583320379257,
        0.0040134950540959835,
        0.011160043999552727,
        0.028581516817212105,
        -0.11563414335250854,
        -0.036061037331819534,
        -0.10905513912439346,
        -0.06964167207479477,
        -0.07476075738668442,
        0.014399179257452488,
        -0.03943350538611412,
        -0.10224103927612305,
        0.05506298318505287,
        0.03322945907711983,
        -0.11260035634040833,
        0.03290899470448494,
        -0.019150353968143463,
        -0.0345597080886364,
        0.043316200375556946,
        -0.0019748553168028593,
        0.06835330277681351,
        0.10226757079362869,
        -0.07022304087877274,
        -0.017858566716313362,
        -0.050888899713754654,
        -0.035335805267095566,
        2.229790698038414e-05,
        -0.06686216592788696,
        0.005549474153667688,
        -0.053058113902807236,
        0.05146530270576477,
        0.016329240053892136,
        0.0767851173877716,
        0.0908002033829689,
        0.007384924683719873,
        -0.019980115815997124,
        -0.034905269742012024,
        0.007334721274673939,
        -0.04231934994459152,
        0.07283862680196762,
        0.09464700520038605,
        -0.029947225004434586,
        -0.01970742456614971,
        0.03540507331490517,
        -0.0037497906014323235,
        -0.02143869549036026,
        -0.012101316824555397,
        -0.03094889037311077,
        0.0208992138504982,
        -0.02853582240641117,
        0.03758005052804947,
        0.03270679712295532,
        0.0013747431803494692,
        -0.0077509572729468346,
        -0.0004763123579323292,
        -0.015829602256417274,
        0.07515063881874084,
        -0.04730086773633957,
        -0.03436927869915962,
        0.018636813387274742,
        -0.016856085509061813,
        -0.09787345677614212,
        -0.030145417898893356,
        -0.0060875811614096165,
        -0.054213300347328186,
        -0.028697626665234566,
        0.01465914212167263,
        -0.0330287404358387,
        0.04498332738876343,
        -5.146334839051114e-33,
        -0.054881852120161057,
        -0.02015244960784912,
        0.02390708401799202,
        -0.047243691980838776,
        -0.010835772380232811,
        -0.04979034513235092,
        0.026491735130548477,
        0.042496129870414734,
        -0.0905386283993721,
        -0.045291900634765625,
        -0.03535812720656395,
        0.011297786608338356,
        -4.438131509232335e-05,
        0.004450476262718439,
        0.020488273352384567,
        -0.0009396601235494018,
        0.03179144859313965,
        -0.0758834183216095,
        -0.025491813197731972,
        -0.015129463747143745,
        0.041896168142557144,
        0.02896447852253914,
        -0.024707619100809097,
        0.035124678164720535,
        -0.05469406768679619,
        -0.010757550597190857,
        -0.04530574381351471,
        0.003288223408162594,
        0.1041950136423111,
        -0.03118008002638817,
        -0.030703527852892876,
        -0.10509560257196426,
        0.017978476360440254,
        0.06690552085638046,
        0.10743638873100281,
        -0.018013056367635727,
        -0.0444030687212944,
        -0.04034234955906868,
        0.05598456785082817,
        0.07113545387983322,
        0.08780624717473984,
        0.06041983515024185,
        -0.0013053090078756213,
        -0.013325516134500504,
        0.023080039769411087,
        -0.03794483840465546,
        -0.09232398867607117,
        -0.04697746783494949,
        -0.0016484318766742945,
        -0.09012413769960403,
        -0.02114105224609375,
        0.0705568715929985,
        -0.048117633908987045,
        -0.04719359055161476,
        -0.0631934106349945,
        -0.00965108722448349,
        0.005918967071920633,
        0.026186078786849976,
        -0.03396787494421005,
        0.03299693390727043,
        0.04138169810175896,
        -0.015295637771487236,
        -0.05698775500059128,
        -0.0075964247807860374,
        0.04473034664988518,
        0.05066794902086258,
        0.11048702895641327,
        -0.0009294530027545989,
        0.010273899883031845,
        -0.00818365253508091,
        0.013388347811996937,
        -0.11753182858228683,
        0.033867247402668,
        -0.10880378633737564,
        0.04858028143644333,
        0.07716172188520432,
        0.002432658337056637,
        -0.02925867959856987,
        0.0010882224887609482,
        -0.08226611465215683,
        0.05803163722157478,
        -0.034661997109651566,
        0.04269711300730705,
        -0.015050209127366543,
        0.02320869266986847,
        -0.003996404353529215,
        0.06663062423467636,
        0.03934716805815697,
        -0.025571707636117935,
        0.011288158595561981,
        0.017161769792437553,
        0.011876106262207031,
        -0.04223564267158508,
        0.1493433117866516,
        0.04493632912635803,
        -5.17592511073417e-08,
        0.02960805967450142,
        0.003099568421021104,
        0.08499342203140259,
        0.03733516484498978,
        -0.011132131330668926,
        -0.01979425922036171,
        0.06181475520133972,
        -0.004041740205138922,
        0.04720962792634964,
        0.0530618354678154,
        -0.020036015659570694,
        -0.10512086004018784,
        -0.06322933733463287,
        0.08820080757141113,
        0.06980877369642258,
        0.09758775681257248,
        -0.033005278557538986,
        0.10967829823493958,
        -0.02730846218764782,
        0.0011077361414209008,
        0.002583547728136182,
        -0.03600925952196121,
        0.07824773341417313,
        -0.05054175853729248,
        0.029183590784668922,
        -0.0040863752365112305,
        -0.09065123647451401,
        0.06151347979903221,
        0.053156860172748566,
        -0.011527066119015217,
        -0.09804687649011612,
        0.015159038826823235,
        -0.0008811810985207558,
        0.012822763994336128,
        -0.04910755529999733,
        -0.037758469581604004,
        0.02300572209060192,
        -0.005431624595075846,
        0.050757214426994324,
        0.06615728884935379,
        0.03670280799269676,
        -0.06868128478527069,
        -0.045155081897974014,
        0.053034208714962006,
        0.04476679489016533,
        -0.0032367135863751173,
        -0.0018533357651904225,
        -0.03573691099882126,
        -0.02866537682712078,
        0.04502740502357483,
        -0.018301980569958687,
        -0.013897910714149475,
        0.03791666030883789,
        -0.03922116011381149,
        0.016077406704425812,
        0.048088353127241135,
        0.010808131657540798,
        0.08619391918182373,
        -0.011594423092901707,
        0.06172625347971916,
        -0.002085006097331643,
        -0.05044254660606384,
        0.006009913049638271,
        0.03622140735387802
    ]
}