{
    "id": "na1hqx4Yi68",
    "title": "You Said I Was a Fool - Panasonic 4K Blu-ray Player",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-04-24T16:59:26Z",
    "video_url": "https://www.youtube.com/watch?v=na1hqx4Yi68",
    "category": "Science & Technology",
    "tags": [
        "Blu-Ray",
        "Xbox",
        "Panasonic",
        "LG OLED",
        "Chroma Subsampling",
        "YCbCr",
        "RGB",
        "Display",
        "Bluray Player",
        "Dolby Vision",
        "HDR10+",
        "HDR10"
    ],
    "views": 2185946,
    "likes": 71470,
    "comments_count": 3762,
    "description": "Learn more about CORSAIR's new Xeneon Gaming Monitor:   SmartDeploy: Claim your FREE IT software (worth $580!) at   Several years ago a lot of you weren't happy about us using an Xbox to compare Blu-ray and 4K Blu-ray so we ponied up for a $500 standalone player. It offers some advantages but is it worth spending that much more money on your setup if you already own a game console?  Discuss on the forum:   Buy an LG OLED EVO G1:   Buy a Panasonic DPUB820:   Buy an Xbox Series X:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:15 You Were Right 2:35 YCbCr 6:55 Dolby Vision 9:37 Other Issues 10:20 Conclusion 12:06 Outro",
    "description_links": [
        "https://lmg.gg/XENEONLTT",
        "https://lmg.gg/Sc3KR",
        "https://linustechtips.com/topic/1426986-you-said-i-was-a-fool/",
        "https://geni.us/wyERmk",
        "https://geni.us/KV2X",
        "https://geni.us/o4QI5R",
        "https://lttstore.com",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- When you saw the number one Canadian techtuber using subpar equipment to watch top tier digital content, you got angry. You raked us across the coals for watching ultrahigh definition Blu-rays on an Xbox. And we saw your feedback but it hurt. We needed some time to recover. And also, we're not just going to take your word for it that a proper Blu-ray player will perform so much better reading digital ones and zeros off of a plastic little disk. So we need to test these claims to find out. Is there something to the hype? Or is this yet another snake oil Hi Fi rabbit hole? Can the average person spot the difference? Can I? Can our sponsor? Smart Deploy, now powered by pdq.com. With Smart Deploy, IT professionals can leverage Box, Dropbox, Google Drive or OneDrive to re image Windows PCs from the cloud. Grab your free Smart Deploy licenses worth over 500 dollars at smartdeploy.com/linus. (techno music) You were technically correct, which is the best kind of correct. However, and this is a really big however, you guys. While a standalone Blu-ray player does have advantages over throwing your favorite film into your Xbox, I'm not personally expecting to be able to tell which image I got for free with my Halo machine and which one came out of a 500 dollar, Panasonic DP-UB820PCK, our premium 4K HDR Blu-ray player that has features like a precise chroma HCX processor, Dolby Vision, and 192 kilohertz, 32 bit audio support. For our side by side then, we're using the only TV that we have two of. The LG OLED G1, and of course we don't have stands for them so you'll have to forgive our rudimentary setup back here. Both are in filmmaker mode with stupid features like motion clarity turned off and I still don't know which one is which so I'm going to go try figure it out now. - [Plouffe] Turn around. (calm music) - I think it's the right one. - No, that's the Xbox. - Oh. No it's fine, there just, there was a bit more green in the foliage behind the car, that was the only thing, I was looking for better color or something. But that's not the whole story. Basically, when we look at an image on a screen, we see colors being represented by a set of numbers that your processor understands. When it comes to RGB, the color space, not the pretty lights in your computer. We're assigning different values to red, green, and blue. If you've ever used and RGB software, or say, Photoshop, you might be familiar with setting values for R, G, and B, anywhere from zero to 255. These then get mixed together to give you one of nearly 17 million different colors, each with it's own hex code. When things are instead broken down into YCbCr, which is also often referred to as YCC, it gets a little more confusing. Instead of red, green, and blue, we have Y, which is our lunar, or brightness component, then Cb is blue relative to green and Cr is red relative to green. So in a four, four, four image then, we can an uncompressed signal that easily translates to RGB. But when we compress it to say, four, zero, zero, we keep the same luminance value which defines the majority of the image's contrast and shapes, but we lose color data. So you can see then, this image is still clearly defined. Look at me, you can make out detail on my beard and face, but you probably can't see the exact color of my high quality insulated water bottle from lttstore.com. So I guess you'll just have to buy one and see it for yourself. Scaling up to four, two, zero, we get one quarter of the full four, four, four YCC color space, four, four, two nets us half of our full color space and, for the most part, because we are much more sensitive to contrast than we are to color, going from four, four, four to four, two, two, or even four, two, zero isn't very noticeable to the naked eye and is likely what you've been watching for years. Now obviously, if we were to take a four, four, four image and put it directly next to a four, two, zero image and play spot the difference, you would find some. But nothing anywhere close to, say, thinking someone was wearing a red shirt instead of a green one, or even a dark green shirt instead of a light green shirt. Instead what you'll typically notice is a much shorter gradient when colors mix and the primary reason that we do this compression is because four, four, four uses a lot of data. So, the 4K Blu-rays behind me are stored in a YCbCr four, two, zero 10-bit format. But we've got a problem. Our panel is RGB. So to get there, we typically take our four, two, zero and we need to convert that to YCbCr four, four, four, then RBG-ify that image. Now our Panasonic Blu-ray player handles bit perfect four, two, zero to four, four, four conversion. But our Series X, well it's actually doing and imperfect conversion. First to RGB then back to YCbCr to output to the display. This can and does result in errors. But as we saw, they're extremely hard to spot, even looking at two of the exact same displays on the same frame of content. So if you're not a trained colorist, good luck spotting the differences, especially with moving content on the screen. And even for those folks, the difference between two panels rolling one after the other off the line, even for a high quality set like LG's OLED evo G1 here, is probably greater than the difference that we saw from our two sources. Meaning that unless you've spent actual time, and or money, professionally calibrating your display, any concerns that you have about the chroma sub-sampling errors of your Xbox can be safely put to rest. Is that image technically correct? No. But if I came in here without knowing anything about what was on these two TVs, I wouldn't be able to tell you which one is which. Think I'm lying? - Left is Xbox, right is Blu-ray player. (bell chimes) - Which one do I think is the Xbox? Left. (bell chimes) - Xbox is right. (buzzer sounds) - That one. (buzzer sounds) - Left. (bell chimes) - Right's the Xbox. (buzzer sounds) - I'm going left is Xbox. (bell chimes) - They couldn't tell. But we're not actually done yet, not even close. For those of you who don't know, HDR, or high dynamic range, allows your display to show very dark and very bright images on screen at the same time, improving the perceived resolution and making the content more lifelike and immersive. And there are three major standards for HDR at the time of filming. HDR 10, HDR 10 plus, and Dolby Vision. HDR's 10 metadata says, \"Okay, we looked at the content, here's the brightest scene, here's the darkest scene, let's just throw the rest somewhere in between.\" With HDR 10 plus and Dolby Vision, they use dynamic metadata to apply tone mapping throughout the entirety of the content being displayed, making better effective use of the dynamic range of your panel. Dolby Vision and HDR plus are also typically brighter to the eye when you're viewing them since they're mastered for displays that are capable of a thousand to up to four thousand nits peak brightness. While HDR 10 can end up anywhere from 400 to 4000. That's why most monitors you see are not HDR 10 plus, they often can't go much higher than six or seven hundred nits, let alone the thousand that 10 plus is meant for. HDR 10 also can't go past 10 bit color depth and while very little content is at 12 bit or beyond these days, it will come and these are forward looking standards, with Dolby Vision being widely regarded as better for enjoying films. And unfortunately, that's where this complaint comes in. And it's pretty fair. For movies that support Dolby Vision, we really do need to apologize for our previous oversight and clarify that we would not recommend using the Xbox Series as a Blu-ray player and it's bizarre because the One X handles Dolby Vision streaming content just fine but for Blu-rays, it falls back to the weaker HDR 10 master and for me anyway, the difference is really obvious. Dolby Vision time. Oh well that's a lot more obvious. It's that one. Well not even just the clouds, the reflections off the surface of the beach and the boats and stuff back there, like it's just, this is nice but this is sun shining off stuff. But what about the rest? - The right is the one with Dolby Vision and the left is not. (bell chimes) - The right one, okay. (bell chimes) - Right one. (bell chimes) - Right hand one. (bell chimes) - That one. (bell chimes) Yeah, it looks bluer. - The right one. (bell chimes) Yeah, yeah, that's pretty obvious. - I'm going with right. (bell chimes) Yes. - They could tell. And here's another reason why you might want to choose a proper Blu-ray player over the Xbox. The lack of straight 24 or 60 fps support, so you will actually lose frames playing your Blu-ray on an Xbox. Though, honestly, not many people are going to notice a missing frame every minute or so when they're coming in at 24 per second. At least that's the situation today. If we were having this conversation a couple of years ago, yes. When the Series X launched, there was an issue with black levels and 4K HDR Blu-ray playback. But that has since been resolved, so unless you've never patched your console, the chances of running into that in your life are slim to none. All of which raises the question. If you're not a big gamer and you just want the best home theater experience possible, what do you do? The PS5 doesn't do Dolby Vision at all so it's already out of the equation. Leaving us to choose from our standalone player or an Xbox Series X, both of which cost about 500 US dollars. Neither of them support support super audio CD, but at least the Panasonic is a bit easier to use Dolby Atmos and DTSX. The Series X, meanwhile, supports these standards, but getting them to work properly across all devices can be finicky. As for ease of use and setup, while we haven't experienced any HDCP handshake issues, we have seen reports of it online for the Xbox. And on top of that, the Panasonic clearly has better support for Dolby Vision, with proper chroma sub sampling and better frame rate support. But aside from Dolby Vision, it's really hard to spot the difference even if you know it's there. So if you have a TV with DV, we've got to give it to the big P. But for everyone else, particularly if you want the added functionality of playing video games, or if you only use streaming services anyway, the Xbox is still a great choice. But hey, you guys decide for yourself, we're going to have both of them linked below. And if you want to go really ham, you can get the 1300 dollar DP-UB9000. It has similar features to this Blu-ray player, but a much nicer build quality and high end analog circuitry for those of you looking for analog audio options. Oh, and we also have this message from our sponsor. - Corsair, check out the Xeneon Gaming Monitor. It features an ultra-slim 32 inch QHD IPS panel with up to 165 hertz refresh rate. You'll be clicking heads. And there's quantum dot technology with 100 percent SRGB and 100 percent Adobe RGB coverage and 98 percent of the DCI-P3 gamut, for more vivid, natural colors. And you can mount your camera, your mic, or your lightning with an integrated multi mount point built into the aluminum stand. Learn more at the link below. - Thanks for watching, if you enjoyed this video, make sure to check out our Xbox Series X versus Series S comparison.",
    "transcript_keywords": [
        "Dolby Vision",
        "Xbox",
        "Bluray player",
        "HDR",
        "Dolby",
        "Canadian techtuber",
        "Vision",
        "Xbox Series",
        "Bluray",
        "HDR Bluray player",
        "HDR Bluray",
        "support Dolby Vision",
        "Dolby Vision time",
        "image",
        "Panasonic Bluray player",
        "Series",
        "proper Bluray player",
        "Smart Deploy",
        "color",
        "handles Dolby Vision"
    ],
    "transcript_entity_values": [
        "one",
        "hertz",
        "LG",
        "One",
        "RGB",
        "RBG",
        "zero",
        "about 500 US dollars",
        "Dropbox",
        "K Blu-",
        "HCX",
        "Cb",
        "HDCP",
        "Xbox",
        "HDR 10",
        "three",
        "G1",
        "24 per second",
        "Canadian",
        "YCC",
        "a couple of years ago",
        "192 kilohertz",
        "24",
        "half",
        "400",
        "years",
        "OneDrive",
        "DCI",
        "Blu-",
        "500 dollar",
        "First",
        "32",
        "four thousand",
        "four, zero",
        "Blu-ray",
        "every minute",
        "a YCbCr four",
        "32 inch",
        "nearly 17 million",
        "4",
        "seven hundred",
        "YCbCr four",
        "the Xeneon Gaming Monitor",
        "six",
        "60",
        "DV",
        "Cr",
        "four",
        "4000",
        "up to 165",
        "Google Drive",
        "Dolby Vision",
        "1300 dollar",
        "HDR",
        "the Xbox Series",
        "SRGB",
        "a thousand",
        "10",
        "Xbox",
        "PS5",
        "OLED evo G1",
        "QHD IPS",
        "Panasonic Blu-ray",
        "Dolby Atmos",
        "12",
        "98 percent",
        "two",
        "Xbox Series X versus",
        "these days",
        "Adobe RGB",
        "K HDR Blu-ray",
        "one quarter",
        "Panasonic",
        "DTSX",
        "zeros",
        "today",
        "Photoshop",
        "over 500 dollars",
        "Y",
        "four to four",
        "Panasonic DP-UB820PCK",
        "100 percent",
        "255"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "NORP",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "EVENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL"
    ],
    "vector": [
        0.02149014174938202,
        -0.049133699387311935,
        0.013135286048054695,
        -0.13009189069271088,
        0.095051109790802,
        0.07133585214614868,
        0.039113014936447144,
        0.08525779098272324,
        0.006460155826061964,
        0.06544966995716095,
        -0.046964142471551895,
        -0.00305452779866755,
        0.03976999595761299,
        -0.05334813892841339,
        0.007147838361561298,
        0.008934494107961655,
        0.029413331300020218,
        -0.128191277384758,
        -0.047535501420497894,
        -0.036136236041784286,
        -0.03162746503949165,
        -0.06857477128505707,
        -0.04706401750445366,
        -0.0005039993557147682,
        -0.022882195189595222,
        -0.05166573077440262,
        0.036925818771123886,
        -0.03972432389855385,
        -0.011296601966023445,
        0.023086339235305786,
        0.0043727136217057705,
        0.03200163692235947,
        0.026121748611330986,
        -0.01894862949848175,
        -0.03684830665588379,
        -0.08147810399532318,
        0.09589975327253342,
        -0.11212444305419922,
        -0.13488264381885529,
        -0.08355020731687546,
        0.015980111435055733,
        0.019754447042942047,
        -0.04194144904613495,
        -0.012546222656965256,
        0.01700199767947197,
        -0.021150093525648117,
        0.021938618272542953,
        -0.015292811207473278,
        0.005660601891577244,
        0.052224427461624146,
        0.044836461544036865,
        -0.04934735968708992,
        0.03347911685705185,
        -0.0521966926753521,
        -0.0074975378811359406,
        0.10161253809928894,
        -0.06708870828151703,
        0.017778154462575912,
        0.046461399644613266,
        0.0021832576021552086,
        0.02266618236899376,
        -0.06850147247314453,
        0.015606558881700039,
        0.08412901312112808,
        0.0163736492395401,
        0.006364912260323763,
        0.054769039154052734,
        0.018224403262138367,
        -0.08562031388282776,
        -0.020705528557300568,
        -0.06611350178718567,
        0.01558979693800211,
        0.06138736754655838,
        0.0554402731359005,
        -0.03496924415230751,
        0.0176546610891819,
        0.047903791069984436,
        -0.062104642391204834,
        0.06731342524290085,
        0.009968885220587254,
        -0.010530101135373116,
        0.014639501459896564,
        -0.09342388808727264,
        -0.005455467849969864,
        -0.03311742842197418,
        -0.022205786779522896,
        0.01730264164507389,
        -0.0005597284180112183,
        0.0019379572477191687,
        -0.06461313366889954,
        0.052263956516981125,
        0.07042375952005386,
        0.12246701121330261,
        0.037060730159282684,
        -0.007289411500096321,
        0.03452431783080101,
        0.07557566463947296,
        -0.05968848243355751,
        -0.03354691341519356,
        0.059224631637334824,
        -0.009219474159181118,
        -0.011773407459259033,
        0.02253030613064766,
        -0.005743293557316065,
        -0.09649834781885147,
        -0.11341679096221924,
        0.04564625024795532,
        0.08114498108625412,
        -0.05175869166851044,
        -0.00719744898378849,
        -0.028095075860619545,
        0.004621781408786774,
        -0.050269290804862976,
        0.02450507879257202,
        0.03352159261703491,
        0.06081134080886841,
        0.019580261781811714,
        -0.012388250790536404,
        0.05093705281615257,
        -0.07253146916627884,
        0.030298572033643723,
        -0.10023128986358643,
        0.009029874578118324,
        0.04754810407757759,
        0.01563110016286373,
        -0.024188505485653877,
        0.0034365877509117126,
        3.1110001660649094e-33,
        -0.023628396913409233,
        0.13799381256103516,
        -0.02697419375181198,
        -0.05859319865703583,
        -0.0724935308098793,
        0.01923435740172863,
        0.08028544485569,
        0.10355682671070099,
        -0.027183890342712402,
        0.013868105597794056,
        -0.04291941225528717,
        0.09862732887268066,
        -0.07444193959236145,
        0.01054642628878355,
        0.046036239713430405,
        -0.029177313670516014,
        -0.008083276450634003,
        0.05643811449408531,
        -0.01141284592449665,
        0.0523214191198349,
        0.003469245508313179,
        -0.008741553872823715,
        0.05405030399560928,
        -0.015003551729023457,
        0.0440230667591095,
        -0.023716216906905174,
        -0.029588179662823677,
        -0.07007919996976852,
        0.07408639788627625,
        0.01995868980884552,
        -0.03149360045790672,
        -0.0065604038536548615,
        0.02916775830090046,
        -0.05931931734085083,
        -0.009206175804138184,
        -0.01783152110874653,
        -0.0957956537604332,
        -0.053016748279333115,
        -0.039437804371118546,
        0.01758793741464615,
        -0.0414045974612236,
        -0.0004839911707676947,
        -0.10120957344770432,
        -0.06286215037107468,
        0.011439863592386246,
        0.03240536153316498,
        -0.017367133870720863,
        -0.052737411111593246,
        -0.050942886620759964,
        0.038996413350105286,
        -0.039138615131378174,
        0.04005180671811104,
        -0.09553372114896774,
        -0.011840879917144775,
        0.05425533652305603,
        -0.06841873377561569,
        -0.008916015736758709,
        -0.030499417334794998,
        0.0797463059425354,
        0.026676585897803307,
        0.062496334314346313,
        -0.026340188458561897,
        0.0046878173016011715,
        -0.00741160660982132,
        -0.10127836465835571,
        0.02686311863362789,
        0.09186779707670212,
        -0.02453375793993473,
        -0.11387836933135986,
        -0.06303033232688904,
        0.00891074538230896,
        -0.06564658135175705,
        0.03465428575873375,
        -0.0434698611497879,
        0.09505395591259003,
        0.011159923858940601,
        -0.10044104605913162,
        0.021227655932307243,
        -0.038637831807136536,
        -0.002419309224933386,
        -0.01586199179291725,
        0.020182309672236443,
        -0.008248248137533665,
        0.04109705612063408,
        0.013973680324852467,
        0.052209850400686264,
        -0.0035984141286462545,
        0.0614558607339859,
        -0.03883758559823036,
        -0.04875056818127632,
        -0.006074804812669754,
        -0.02014049142599106,
        -0.008963223546743393,
        -0.003445466747507453,
        -0.02421044185757637,
        -4.450385980040671e-33,
        -0.04307945817708969,
        -0.039598241448402405,
        -0.01289374753832817,
        0.017411639913916588,
        0.040403515100479126,
        -0.023671526461839676,
        0.03746779263019562,
        -0.0074134040623903275,
        0.07464806735515594,
        -0.03800315409898758,
        0.002984312130138278,
        0.01621752604842186,
        -0.05867670848965645,
        0.05469636619091034,
        -0.0037185281980782747,
        -0.03463307395577431,
        0.019754590466618538,
        -0.09792431443929672,
        0.03736121580004692,
        -0.06515435874462128,
        0.0556737445294857,
        -0.008915742859244347,
        0.0605589933693409,
        0.017219820991158485,
        0.012014408595860004,
        0.011619720607995987,
        0.053910307586193085,
        0.027094420045614243,
        0.013067635707557201,
        0.0550742968916893,
        -0.01658502221107483,
        0.04231824353337288,
        0.05730356276035309,
        -0.02010383829474449,
        0.035472746938467026,
        -0.0016083092195913196,
        0.0822894424200058,
        0.011355465278029442,
        -0.06311880052089691,
        -0.013963663019239902,
        -0.06138388440012932,
        0.04317823424935341,
        0.00519152358174324,
        -0.05911259725689888,
        0.03987019881606102,
        -0.03850730136036873,
        0.034951526671648026,
        -0.06349896639585495,
        0.08475138247013092,
        0.08692971616983414,
        0.02469520829617977,
        0.005310052540153265,
        0.0967533141374588,
        -0.040584415197372437,
        -0.07029028236865997,
        -0.07496879249811172,
        -0.08778907358646393,
        0.0608353391289711,
        -0.03798837214708328,
        -0.019353490322828293,
        0.020098743960261345,
        0.01578965224325657,
        -0.0507659874856472,
        0.05154469609260559,
        0.008377074263989925,
        -0.013734937645494938,
        0.0867648497223854,
        0.04036204144358635,
        -0.02790738455951214,
        -0.049356598407030106,
        -0.06634467840194702,
        -0.0923445001244545,
        0.006957462523132563,
        -0.05592961609363556,
        -0.016983365640044212,
        0.07799945026636124,
        -0.03741273283958435,
        -0.04975421354174614,
        0.03509664162993431,
        0.0020611623767763376,
        -0.06219672039151192,
        0.014782310463488102,
        0.1530328243970871,
        -0.020068954676389694,
        -0.019869737327098846,
        -0.026260128244757652,
        0.019560737535357475,
        -0.03970024734735489,
        -0.037330079823732376,
        -0.0331709049642086,
        -0.05172085762023926,
        -0.007214853074401617,
        -0.021293431520462036,
        0.03137228637933731,
        0.09433824568986893,
        -5.542875314290541e-08,
        -0.0215739905834198,
        0.03677234426140785,
        0.03725828602910042,
        0.028574436902999878,
        0.01442424114793539,
        -0.11031068116426468,
        -0.04027104377746582,
        -0.007580893114209175,
        0.1099967360496521,
        -0.08194979280233383,
        -0.016115162521600723,
        -0.11111743003129959,
        -0.01344506349414587,
        0.0014999210834503174,
        0.0301491841673851,
        0.05683451145887375,
        -0.059210360050201416,
        0.0065431441180408,
        -0.019118325784802437,
        0.05722651258111,
        0.05278955027461052,
        0.023434538394212723,
        0.05340488255023956,
        -0.07221115380525589,
        -0.004043052438646555,
        0.01660100184381008,
        -0.03423174098134041,
        0.016905494034290314,
        0.10061419010162354,
        -0.02744654193520546,
        -0.0564412884414196,
        0.014413194730877876,
        0.037204060703516006,
        -0.009724157862365246,
        0.03538636490702629,
        -0.05803293734788895,
        -0.028433797881007195,
        0.08325982093811035,
        0.06868761777877808,
        0.05149426683783531,
        -0.003845015773549676,
        -0.018919354304671288,
        0.017414215952157974,
        -0.012417426332831383,
        0.02963641658425331,
        0.0020640536677092314,
        -0.03343678265810013,
        -0.09279683232307434,
        0.0003534516436047852,
        -0.00022295811504591256,
        0.005400673020631075,
        0.049568843096494675,
        -0.012271145358681679,
        -0.028165705502033234,
        0.08312687277793884,
        -0.0895766168832779,
        0.021406205371022224,
        0.04612461104989052,
        0.027371332049369812,
        0.05767534300684929,
        -0.03473286330699921,
        -0.12047044932842255,
        -0.03549116104841232,
        0.10835643112659454
    ]
}