{
    "id": "nBIdtDwsJow",
    "title": "5G road trip and scavenger hunt with T-Mobile!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-02-26T21:32:40Z",
    "video_url": "https://www.youtube.com/watch?v=nBIdtDwsJow",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "T-Mobile",
        "5G",
        "Samsung",
        "Samsung 21",
        "5G Speed Test",
        "Wireless Provider",
        "Justine Ezarik",
        "iPhone",
        "Samsung Galaxy S21"
    ],
    "views": 139467,
    "likes": 5842,
    "comments_count": 628,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today's video is gonna be a little bit different. I actually left the house and I had the best time ever. So as you know, our lives do revolve a lot around our phones. So with the mainstream adoption of 5G, we're quickly entering into an entirely new era of speed and connectivity. I partnered with T-Mobile to do a road trip from here, Los Angeles, all the way to Phoenix to test out their 5G network. They have America's largest 5G network and they even have coverage in all 50 states. With their extended range, 5G will be able to average two times faster speeds than on a T-Mobile 4G LTE network. Now I use the Samsung Galaxy S21+ 5G as my main device for everything. Navigation, music streaming, places to stop, content creation, and I even used it to tether to my computer and the speeds that I was getting on this thing, it just blew my mind. So I thought it'd be really fun to add another element into this 5G test. So I asked you guys for some suggestions of some random things to take photos or videos of. So you'll be seeing that throughout the trip. And I think though, what really impressed me the most is how much coverage T-Mobile had during the entire drive from LA to Arizona. I have done this drive so many times and I was pleasantly surprised with almost always being connected, even in the middle of the desert. And now my friends, let's officially start this vlog off with me being about five hours late to pick up my sister, Jenna, and our dog, Matty. Would you be surprised if I said I was late and we were supposed to leave three hours ago? I have to finish packing. How much gear are you gonna need for one simple little road trip? It's so heavy. The answer would be this much. And that should be just enough room for all of Jenna's things after I kind of fit in all of the last minute accessories. Gotta pack the essentials. It just started raining. I've hit the curb. I'm pathetic. (laughs) - I think we packed way too much stuff. - Yeah, there's a lot. - What is this for? - We might need it. We might. - I don't think we need it. - We might. So we're in the car, I'm four hours late, five hours, I think at this point. Yeah. - You wanted to leave at seven. I was like, oh, I'm not ready. So like realistically, nine will work for me. I woke up at four. - You know what's great? I was going to ask you what the address was of where we're going, and it just popped up in my notifications. Also, I need to put some tape over the logo of my car. You know why Jenna? It's a sponsored video. Not sponsored by my car. (laughs) You can't even tell. Pretty Carolina, oh-oh, oh-oh Stone cold stunner, she was a winner Started workin' at the diner, oh-oh, oh-oh Serves as a reminder We are five hours, seven minutes left. We've had a lot of different weather over the course of an hour and we're... we got 5G. Are they comin' for you? Yeah yeah, yeah yeah Making our first stop. Four hours 45 minutes ago. (Matty whimpering) Okay, what do you want? - [Jenna] (gasps) I don't know. - I need to get a case for this. Yeah, it's not working out so well. - Isn't going so well- - No. Well buddy, sorry. Okay, but look at that muffin in there. It is shining. It's shimmering. It is absolutely splendid. And we've got 5G. And we also have four hours, 47 minutes. - [Jenna] Well, let me know when you want me to drive. - Okay. - I'm just gonna be over here. - Did you see that? - [Jenna] Yeah. Splashed. Serves as a reminder to count your blessings 'Cause this town ain't fair (This town ain't fair) It'll put you down and leave you there Don't make 'em scared, yet it's the ugly truth - Three hours, 42 minutes. I do have to make a second potty break so I think we're gonna exit here. See that? See that? You see that? You see that? (upbeat music) Fill it up. - [Jenna] Hi, Matty! Matty, ready to go? We're finishing up the road trip! There it is, 5G. - One hour, 22 minutes. We still have 5G. This is crazy because a lot of these places that we've been driving through, normally I hardly even have reception at all. We're thinking about dinner. We're gonna order dinner so that it'll arrive basically like five minutes after we get there. I should probably start searching now, huh? I booked this place last night, like we had no idea where we were gonna stay, I was like, we gotta find somewhere. And of course, pets welcome. Food is here. It has arrived. They gave us silverware for like eight people. I got this healthy salad, but then I also got cauliflower buffalo wings and a meatball that's wrapped in like a noodle. (light instrumental music) There's T-Mobile ads all over by speed test thing. So Tyler edited our podcast and now I need to download it. And I'm so shocked because the tethering speed of my T-Mobile 5G phone, almost double the Wi-Fi of this house, which is kind of shocking. Seven, eight, upload? That's better than- Go to Arizona, do a scavenger hunt, hunt for 5G and you think the weather's gonna be nice. Guess what? It is torrential downpours. We don't have any supplies. Like we don't have an umbrella, Jenna doesn't have boots. - I ran out of socks. - So we're gonna go to the mall and test out the 5G in the parking lot and get Jenna some boots. I've been pretty impressed with my speed so far. It's honestly faster than my internet at home. - Does that thing have a compass? - [Justine] It's telling you where to go. - [Jenna] West? I need like right left. - Almost all of these stores have huge signs out front that says store closing. Here we are everyone, reporting to you, not live at the mall. We are gonna do a 5G test right here at the mall. So here's our T-Mobile check. We have 37.4 download, 41.3 upload. That's wild. Then here on Verizon, we have 15.2 download and 13 megs up. So the thing is like, there's going to be different speeds pretty much everywhere you go. But the best part about having the T-Mobile network is how broad it is, that you'll have more expansive 5G. Yes, some places will be faster than others, but here at the mall, T-Mobile reigns King, or Queen. There's snow on that person's car. It has snowed in Arizona. - We were inside the mall. We missed everything. - This. This is snow. Fricking snow in Arizona. I'm having so much fun just going around and doing random speed tests. (upbeat music) Picture of you going down a slide, bonus points if it's a water slide, and guess what? It's been raining. So technically, I think I get bonus points. Look at this. There's water. That's water. Oh, I gotta take a picture. I can't fit through here! Okay. All right, gotta get this picture. Oh, that was fun. There's a lot of golfing. I'm so glad that one of our scavenger hunt items was to go golfing. Thanks Jenna Ezarik! Scavenger hunt continues. It has been raining pretty much nonstop which makes it ideal for a rainbow. There it is, oh my goodness! Got the rainbow. Scavenger hunt's going well. We've also got 5G. Jen, look at this. 283 download, 52, upload. This is fun. It's like a 5G scavenger hunt. So in this location, we currently have 99 down and 57 up. Still faster than my home upload. (light instrumental music) - [Jenna] Yeah, maybe take a seat, lady. Let's take a look up there. Oh boy. - We've reached the top and Jenna has Verizon. I have AT&T on my phone and on my S21+ that I'm filming on right now has T-Mobile, and we just did a speed test. Oh my goodness, I have 5G on top of the mountain. Now on T-Mobile, I have 28 down, 18 up, and on AT&T, I have 8 down and 2.3 up. What did you have on yours Jenna? - [Jenna] I think I had 11 down and 11 up, and that's on Verizon. (upbeat electronic music) - So our dog, Matty, has a best friend named Josi. and Josi used to live in California and then Josi moved to Arizona. So while we're here, we're doing a meetup of the previous best friends. (light instrumental music) Hey Matty, do you want some eggie? Matt is that good? Just gonna get you a little bit, okay? This is what you get for being a good boy. Matty, you've met your friend, and guess what else? We've got fast 5G. So we've got 103 download, 12 upload. - [Jenna] Get a statement? - Get a statement. That's a microphone. Speak into it. All right friends, what do we see here? Do we see something? Maybe some 5G? Perhaps. I found it. Okay, everybody inside is looking at me. I have to go away now. I've got to go away. (Jenna laughing) They were all looking at me inside. (Both laughing) So the place that we're staying has a batting cage. And this basically the reason that we decided to stay here. I haven't played any sort of baseball, softball, in like, a very, very, very long time. So, let's see what happens. (upbeat electronic music) Oh! - [Jenna] Oh lord! It's coming at me. - I need to watch the ball. - [Jenna] Yeah, keep your eye on the ball. (Jenna mumbles) - So I don't think I'm going to be getting drafted by any professional baseball or softball leagues anytime soon. Anyway, we're gonna go for a hike. It's our last evening here. So we're gonna enjoy the rest of the day. I'm searching for a hike that we can do. This 5G is great because it's so much faster than our Wi-Fi. I'm even watching my own YouTube videos. Did you see the new set that we were working on? - [Jenna] Yeah, it looks good. - I'm so excited about it. Matty check it out. You see? (light instrumental music) We go this way and then we come back here. We come back here. We start here, we end here. It's actually probably gonna get dark very soon. So we need to walk quick. Whoa, like I'm zooming into the moon. (upbeat electronic music) I'm kinda freaking out a little bit because I looked down and I saw my shadow and it's not from the sun. My friends, it is from the moon. I am seeing my moon shadow right now. - [Jenna] I saw mine too. So it's real. - Thank you guys so much for watching this video. I honestly had so much fun doing it and I feel so inspired and kind of just reinvigorated to make content. Being able to kind of get out and safely explore was something that I desperately needed. So a huge thank you to T-Mobile for making that possible and really fueling that entire trip. I was so surprised with the consistency of the speeds that I was getting in various places from, not only from Los Angeles, but all the way up to Arizona. So I had so much fun on that trip and I hope that you guys enjoyed the vlog. If there's anything else you would like to see me make in the future for another fun video, feel free to leave it in the comments below. And I will see you guys in the next one. Bye! (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "Jenna",
        "TMobile",
        "hours",
        "Arizona",
        "Matty",
        "Justine",
        "speed",
        "fun",
        "Yeah yeah",
        "minutes",
        "scavenger hunt",
        "test",
        "trip",
        "lot",
        "hunt",
        "speeds",
        "network",
        "upload",
        "mall"
    ],
    "transcript_entity_values": [
        "five minutes",
        "Matty",
        "nine",
        "second",
        "12",
        "one",
        "our last evening",
        "Carolina",
        "three hours ago",
        "eggie",
        "T-Mobile",
        "an hour",
        "Justine",
        "Three hours",
        "37.4",
        "2.3",
        "50",
        "T-Mobile 5G",
        "LTE",
        "four hours",
        "47 minutes",
        "Jenna] West",
        "5G. - One hour",
        "the day",
        "99",
        "YouTube",
        "5",
        "Los Angeles",
        "LA",
        "57",
        "four",
        "Verizon",
        "about five hours",
        "Wi-Fi",
        "seven minutes",
        "42 minutes",
        "18",
        "8",
        "Jen",
        "Josi",
        "22 minutes",
        "41.3",
        "283",
        "five hours",
        "eight",
        "28",
        "today",
        "Jenna Ezarik",
        "two",
        "California",
        "seven",
        "15.2",
        "America",
        "Tyler",
        "Four hours 45 minutes ago",
        "11",
        "Seven",
        "Phoenix",
        "first",
        "last night",
        "Matt",
        "Queen",
        "13 megs",
        "Arizona",
        "Jenna",
        "103",
        "52",
        "AT&T"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "LOC",
        "TIME",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "TIME",
        "LOC",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.019363021478056908,
        -0.04325500875711441,
        0.022187838330864906,
        -0.09763322025537491,
        -0.0028881116304546595,
        0.020482996478676796,
        0.043962512165308,
        0.03647051006555557,
        -0.029465526342391968,
        0.07481448352336884,
        0.02796064503490925,
        -0.012926490977406502,
        0.011253179982304573,
        0.0004647456225939095,
        0.01389965321868658,
        0.01458488218486309,
        0.04384209215641022,
        -0.046957265585660934,
        0.024760624393820763,
        0.003956613130867481,
        -0.006543243303894997,
        -0.029747290536761284,
        0.013111120089888573,
        0.012794086709618568,
        0.022084442898631096,
        0.04021930694580078,
        -0.018495898693799973,
        0.04684801027178764,
        -0.0613134391605854,
        -0.03341987356543541,
        -0.06745737791061401,
        0.06464892625808716,
        0.03384728729724884,
        0.013411174528300762,
        -0.031974926590919495,
        -0.032279424369335175,
        -0.0017806579126045108,
        0.04026127979159355,
        0.015817753970623016,
        -0.018226195126771927,
        0.021628456190228462,
        -0.023568833246827126,
        -0.0017561066197231412,
        -0.017692897468805313,
        -0.04737475886940956,
        -0.10232232511043549,
        0.00312189687974751,
        -0.03655574470758438,
        0.021672576665878296,
        0.05485335364937782,
        -0.015048854053020477,
        -0.031488582491874695,
        -0.0010412362171337008,
        0.011003125458955765,
        -0.1016215905547142,
        0.01331351138651371,
        -0.09137808531522751,
        0.05819053202867508,
        0.06744136661291122,
        -0.04400377720594406,
        -0.0031641321256756783,
        -0.05416446551680565,
        -0.030911028385162354,
        0.038410041481256485,
        -0.02875944972038269,
        -0.03426935896277428,
        -0.011694573797285557,
        -0.008559015579521656,
        -0.017049748450517654,
        0.01863221265375614,
        -0.104598268866539,
        0.05244577303528786,
        -0.007154615595936775,
        0.03222346305847168,
        -0.05269505828619003,
        0.06732118874788284,
        0.04111378639936447,
        -0.05329925939440727,
        -0.022828154265880585,
        0.03883206471800804,
        0.057744257152080536,
        -0.0335722453892231,
        -0.08504664152860641,
        -0.047267571091651917,
        0.027289384976029396,
        -0.01292822789400816,
        -0.023413226008415222,
        0.07606513798236847,
        -0.008869745768606663,
        -0.11886247247457504,
        -0.07199316471815109,
        0.053011175245046616,
        -0.05634486302733421,
        0.01973090134561062,
        -0.04956412315368652,
        -0.024825068190693855,
        -0.08378063887357712,
        -0.059669990092515945,
        -0.030591191723942757,
        0.06577982753515244,
        0.07391566783189774,
        -0.009372947737574577,
        0.027894288301467896,
        -0.025437116622924805,
        -0.03357413783669472,
        -0.05904140695929527,
        -0.0074759782291948795,
        0.024580666795372963,
        0.02478591352701187,
        -0.002594724763184786,
        -0.05312195420265198,
        0.0644090473651886,
        -0.023795930668711662,
        -0.06130097061395645,
        -0.028403690084815025,
        0.11232476681470871,
        -0.0663222223520279,
        0.09221227467060089,
        0.04597006365656853,
        -0.006388270761817694,
        -0.02630673162639141,
        -0.11371931433677673,
        -0.0017788037657737732,
        0.03263439983129501,
        0.058020420372486115,
        0.02599220722913742,
        -0.010145647451281548,
        1.3535594105791984e-32,
        -0.03496506065130234,
        0.07306227087974548,
        0.010792473331093788,
        0.08871941268444061,
        0.018751101568341255,
        -0.04668427258729935,
        1.082869857782498e-05,
        0.07604871690273285,
        -0.025575926527380943,
        0.060012541711330414,
        -0.01312868483364582,
        0.03601936250925064,
        -0.03708840161561966,
        0.023311741650104523,
        0.03014810010790825,
        -0.04883546382188797,
        -0.03954846039414406,
        -0.07001501321792603,
        -0.00910648237913847,
        -0.01877741701900959,
        -0.012407583184540272,
        -0.0356222540140152,
        -0.003600340336561203,
        0.08718756586313248,
        0.11456401646137238,
        0.09187936037778854,
        0.04464248940348625,
        -0.04690733179450035,
        0.1223144456744194,
        0.017065536230802536,
        -0.06564544141292572,
        -0.05484389886260033,
        -0.01620091311633587,
        -0.0969163179397583,
        0.01685524359345436,
        0.02981158345937729,
        -0.08034145087003708,
        0.029621990397572517,
        -0.0017659144941717386,
        -0.03343602642416954,
        -0.0012356508523225784,
        0.0004119418154004961,
        -0.08289726078510284,
        -0.02199339121580124,
        0.02485889382660389,
        0.018818259239196777,
        0.0345609225332737,
        0.04322163760662079,
        -0.0507027804851532,
        0.041890520602464676,
        -0.02011188678443432,
        -0.0346284955739975,
        -0.08591146767139435,
        0.007959405891597271,
        -0.019116347655653954,
        -0.014465446583926678,
        -0.011013477109372616,
        0.06787440180778503,
        0.060615088790655136,
        0.07648969441652298,
        0.026112815365195274,
        -0.0013108875136822462,
        -0.02394743077456951,
        -0.04152148216962814,
        -0.04189017787575722,
        0.07256162166595459,
        0.015260148793458939,
        -0.06521254777908325,
        0.051644328981637955,
        0.04126337170600891,
        0.054459311068058014,
        -0.011190585792064667,
        0.09007106721401215,
        0.0352509506046772,
        0.094300776720047,
        0.04784344509243965,
        -0.05094277113676071,
        -0.02660081721842289,
        -0.0008424323168583214,
        -0.026316672563552856,
        -0.12308738380670547,
        0.02157084457576275,
        0.015024896711111069,
        0.06902378052473068,
        0.015284526161849499,
        -0.04211251437664032,
        0.027634838595986366,
        -0.09777259081602097,
        -0.038614872843027115,
        0.04411043971776962,
        -0.03685580566525459,
        0.09140504896640778,
        -0.12332352250814438,
        -0.03495985269546509,
        -0.02628283016383648,
        -1.2091555131788468e-32,
        0.007858268916606903,
        0.06338270753622055,
        0.019895881414413452,
        -0.011894859373569489,
        0.05447344481945038,
        -0.05824927240610123,
        0.0519615113735199,
        0.07821647822856903,
        0.05916834995150566,
        -0.04675275832414627,
        0.013648956082761288,
        -0.046300750225782394,
        -0.0849892720580101,
        -0.010420974344015121,
        -0.015824265778064728,
        -0.07251369208097458,
        0.002207273617386818,
        -0.06276708096265793,
        0.05599131062626839,
        -0.007995950058102608,
        0.05820383504033089,
        0.11151175945997238,
        0.07054311037063599,
        0.04502255097031593,
        0.06836152076721191,
        0.07748287916183472,
        0.015305624343454838,
        0.06579077243804932,
        0.040804263204336166,
        0.04497234895825386,
        -0.02652561664581299,
        -0.08166083693504333,
        0.03573945537209511,
        -0.03634621202945709,
        0.04406058043241501,
        0.08642129600048065,
        0.03038344345986843,
        0.0963001549243927,
        -0.007081772666424513,
        -0.0202051792293787,
        0.058449674397706985,
        -0.009022264741361141,
        0.06459125131368637,
        -0.0243237242102623,
        -0.013088174164295197,
        -0.10016346722841263,
        -0.05301665887236595,
        0.052443042397499084,
        -0.01677197404205799,
        -0.012819024734199047,
        0.026478556916117668,
        -0.032687708735466,
        -0.08276961743831635,
        -0.01521126925945282,
        0.007676375098526478,
        0.03265663608908653,
        -0.026850156486034393,
        -0.08220565319061279,
        0.00038629479240626097,
        -0.01888931728899479,
        0.06689216941595078,
        -0.04656120389699936,
        -0.08538766205310822,
        -0.04904480278491974,
        0.015592274256050587,
        -0.07434652745723724,
        0.08457517623901367,
        0.008242292329668999,
        -0.007090881932526827,
        0.027494661509990692,
        -0.09243278205394745,
        -0.0012798159150406718,
        0.0439005047082901,
        -0.023029500618577003,
        0.03290582448244095,
        -0.003888089209794998,
        -0.07700978964567184,
        0.05508048087358475,
        0.10574191808700562,
        -0.06841923296451569,
        -0.05385812371969223,
        0.025333750993013382,
        0.004294428508728743,
        0.05778812989592552,
        0.0941639393568039,
        0.08104407787322998,
        0.03386504575610161,
        -0.04089600220322609,
        0.01418093778192997,
        0.04692322015762329,
        0.015564735047519207,
        0.03672038018703461,
        0.03975927457213402,
        0.09275899082422256,
        -0.06674739718437195,
        -6.33112904324662e-08,
        0.038240883499383926,
        0.03801239654421806,
        -0.04727945104241371,
        -0.01861429028213024,
        0.016366925090551376,
        -0.08087217062711716,
        -0.014673001132905483,
        0.009315170347690582,
        0.11759214103221893,
        -0.03979192674160004,
        0.07670483738183975,
        -0.024599125608801842,
        -0.013105343095958233,
        0.14794223010540009,
        -0.022213848307728767,
        -0.01983661949634552,
        -0.0969133973121643,
        0.02196141704916954,
        -0.06456772238016129,
        -0.04460517689585686,
        -0.0569254606962204,
        0.05352812632918358,
        -0.016209913417696953,
        -0.021420860663056374,
        0.11601120978593826,
        0.024058014154434204,
        -0.06084340438246727,
        -0.027103958651423454,
        0.06727205216884613,
        -0.0068874722346663475,
        -0.08046099543571472,
        0.005067553371191025,
        -0.04994332417845726,
        0.0004870254488196224,
        -0.012390639632940292,
        -0.043229080736637115,
        -0.07924722880125046,
        -0.024404650554060936,
        0.008210222236812115,
        0.029577866196632385,
        -0.0011167050106450915,
        -0.1134214848279953,
        -0.014339813031256199,
        0.00025198879302479327,
        -0.02792634814977646,
        -0.09775833785533905,
        0.004221000242978334,
        -0.035374291241168976,
        -0.010163391940295696,
        -0.00808138120919466,
        -0.09427760541439056,
        0.009996902197599411,
        -0.03656866401433945,
        -0.05108402296900749,
        0.09088477492332458,
        -0.06794781982898712,
        0.06456519663333893,
        0.02264288440346718,
        -0.02308272197842598,
        -0.043691396713256836,
        0.0042966874316334724,
        -0.0007759861182421446,
        -0.06067029386758804,
        0.007235080935060978
    ]
}