{
    "id": "NbT_mdc3uko",
    "title": "My CCNA 200-301 exam experience: Tips & Tricks",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-02-24T23:42:31Z",
    "video_url": "https://www.youtube.com/watch?v=NbT_mdc3uko",
    "category": "Science & Technology",
    "tags": [
        "ccna",
        "ccna 200-301",
        "200-301",
        "cisco ccna",
        "cisco",
        "ccna training",
        "new ccna",
        "ccnp",
        "ccna study",
        "cisco training",
        "cisco certifications",
        "how to study for ccna",
        "david bombal",
        "ccna 2019",
        "ccna 2020",
        "cisco certification",
        "network engineer",
        "networking",
        "packet tracer",
        "cisco devnet",
        "free ccna",
        "certification",
        "200-120 ccna",
        "ccna exam",
        "free ccna video",
        "free cisco",
        "best training",
        "ccna fundamentals",
        "free lab",
        "ccna certification",
        "cisco free",
        "best ccna",
        "why ccna?",
        "python",
        "devnet",
        "ine"
    ],
    "views": 254326,
    "likes": 10821,
    "comments_count": 804,
    "description": "You can get my updated CCNA 200-301 course for $9.99 here (but this price expires in a few days):  - this is all you need as it includes labs. I passed the new Cisco CCNA 200-301 exam! Here are my first thoughts and feedback about the exam. Some good, but some surprises in the ccna exam! However, this experience will help make my CCNA training even better. Good thing I decided to take the exam and see what's on it. I think you will also be happy I did this.  It's the new ccna exam, with lots of updates including wireless technologies, devnet and other technologies to help you launch your career in networking. Once you get your ccna, you are on your path to ccnp and ccie!  Video is about  my ccna 200 301 exam experience: tips & tricks  ==================== Additional Q&A plus tips: ==================== Question: How many questions in the exam? Answer: Over 100. You get about 1 minute per question, so use your time wisely. Tip: Write down your subnetting tables or any other important information before you click start. You will have time to do things before you actually start the exam. Tip: Arrive at least 15 minutes early at the test centre. Tip: Don't stress if you cannot answer one question. Just do your best. You have over 100 questions in the exam.  ====================== Cisco OCGs: ====================== CCNA 200-301 Official Cert Guide Library:  CCNA 200-301 Official Cert Guide Library Premium Edition eBook and Practice Test:   ====================== Referenced Videos: ====================== SDN overview:  Administrative Distance:   CCNA CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!    #ccna #ccna200301 #newccna",
    "description_links": [
        "http://bit.ly/ccna9udemy",
        "http://bit.ly/ccnaocg",
        "http://bit.ly/ocgpremium",
        "https://youtu.be/l-DcbQhFAQs",
        "https://youtu.be/P7pl-hb5-ik"
    ],
    "transcript": "- I'm David Bombal, and I've just passed the new Cisco CCNA Exam, 200-301. And in this video I'm gonna give you some tips and tricks to help you in your preparation for the new Cisco CCNA 200-301 Exam. Today I took both the Cisco CCNA as well as the Cisco DevNet Exam. Fortunately I passed both of them, so really happy about that. Some surprises, however, in this new exam. Some stuff that I thought was really good, some stuff that I thought was strange. Some unexpected stuff, I'll talk about that in this video, so keep watching if you wanna learn more about my experience taking the new Cisco CCNA Exam. (upbeat techno music) Yeah, yeah let's go - Now before we continue, if you enjoyed this video, please consider subscribing to my YouTube channel. Please like this video and please click on the bell to get notifications when I post a new video. But also share it with others. Let other people know about my experience of the Cisco CCNA Exam. Hopefully this will be of benefit to you and others. Hopefully you'll learn something. Okay, so let's get started. Let's go - Let me state this right in the beginning. I felt that the exam was very balanced. It covered a whole range of topics. I think as a version one exam, they call this CCNA Exam version one, I thought it was a good exam. However there were things that surprised me. Things that I didn't expect to see in the exam. But on the whole, I thought it was a good exam. I write a lot of quiz questions. I've written exam questions for vendors before. It's very difficult to write good exam questions. It's much easier to answer any question than it is to write a question. It's much easier to criticize a question than it is to create a question. So I thought they did a great job. A whole balance of various topics. Covered a wide range of topics in their list of topics that you need to know. But some hints would be concentrate on the new stuff. Spend time on the new stuff. Don't get bogged down in trying to memorize huge amounts of commands. So first up is learn the new stuff, especially like wireless. Make sure you understand wireless. Make sure that you understand security topics. Now another tip. What do you need to prepare? Is Packet Tracer enough? And I would say definitely. Spend time using Packet Tracer. So do you need GNS3, do you need VIRL, do you need Eve-NG, do you need physical equipment? I like those products. I like the new VIRL, I'll be creating a video on the new VIRL very soon. I've already got access to VIRL 2.0, great product. I love GNS3, I love Eve-NG. Those products are great. I really think you should use those products for CCNP. For CCNA however, I think Packet Tracer's enough. If you can get access to physical equipment, that always helps. If you can get access to GNS3 or VIRL, that's great as well because it'll have options that you won't see in Packet Tracer. Okay so I think Packet Tracer's enough. I don't think you need to invest in buying hardware, even though I think it's recommended. It's not a requirement. I don't think you have to buy VIRL. However, again, I would suggest that you do that as soon as you can because Packet Tracer's great, but it's at this level, and then VIRL, GNS3, Eve-NG, and physical equipment is at this level. So if you wanna really increase your knowledge, if you really wanna increase your understanding, I'd recommend that you get those products. But it's not required for the CCNA Exam. For my CCNA course, I'm gonna concentrate exclusively on Packet Tracer labs. So in the past, I used to use GNS3 labs, but a lot of people struggled with those labs. It's quite difficult to set up, especially if you're new to Cisco, so I'd recommend Packet Tracer. Easy to set up, official product from Cisco, brilliant simulation software. Allows you to simulate many, many topics specifically for this CCNA, I would highly recommend Cisco Packet Tracer and that's what I'm gonna base my course on. Now one of the best places to look if you're preparing for a Cisco Exam is the Cisco Outline or Cisco Details of the exam. Exam is 120 minutes, 200-301, this kind of stuff you know already. One of the first things I would do if I were you is have a look at the exam topics. And I've downloaded the exam topics here and this is where it got interesting. Okay so let's start with one topic straight away. EIGRP. There is no EIGRP and no VTP. Now when preparing for the exam. Highly recommend Wendell Odom's Official Cert Guides. I strongly suggest that you buy these guides and you use them. Lots of good information in here. I spent a bit of time going through these and I might've missed some stuff. But even then, I was quite surprised by a few things. Okay so in Wendell Odom's Official Cert Guide, he does mention EIGRP multiple places. Such as when he discussed metrics. So I purchased both the physical box as well as the PDF, so I like having both. So in this example I'm looking at the PDF version so that I can share it much more easily in this video. Notice he's got this table here where he talks about the different types of routing calculations. EIGRP calculates based on bandwidth and delay. So even though EIGRP is not in the list of topics for the exam, he actually covers it in the Official Cert Guide. So on the left here, I'm doing searches for EIGRP and what you'll notice is there's a whole bunch of entries for EIGRP, such as administrative distance. Now it's difficult to understand administrative distance if the only routing protocol you're gonna talk about is OSPF. Here we have a table of the administrative distances for various routing protocols. Notice we have both BGP and EIGRP as well as IS-IS. So don't just learn OSPF in isolation and just say I'm gonna learn OSPF and ignore EIGRP, ignore BGP, ignore IS-IS. Make sure that you understand administrative distances, make sure that you understand that if IS-IS advertises a route to you, OSPF advertises a route to you, and EIGRP advertises a route to you, and BGP advertises a route to you, that you know which route is gonna be selected and why. Now I've previously created videos about this. I've created quiz questions about this. Have a look at this video and example where I explain why, for instance, OSPF is chosen over EIGRP. Or why RIP is chosen over EIGRP. Or over OSPF when choosing the best route. Make sure that you know route selections. You really need to understand this stuff for the CCNA Exam. So make sure that you know AD, don't just say I don't need to learn EIGRP. Make sure you understand it. Again, while talking about EIGRP, I mentioned VTP. So doing a search for VTP there's a whole section here talking about VLAN trunking protocol. And he says, \"Before showing more configuration examples, \"you need to know something about a Cisco protocol \"called VTP.\" And he discusses a whole bunch of stuff, including VTP mode transparent. So it's not as if you can just ignore VTP. He discusses it in multiple places in his student guide. And he says, \"This book does not discuss VTP as an end \"to itself for different reasons.\" He says, \"It's not currently in the blueprint, \"and additionally many enterprises choose to disable VTP. \"However it still has an effect.\" My personal opinion is that I won't remove VTP from my new Cisco CCNA course. I'll reduce the amount of information about it, and reduce sort of some of the trouble shooting scenarios, stuff like that, but in my new course, I will definitely cover VTP. Now going back to the Cisco Exam topics, make sure that you know the new stuff. Make sure that you spend time learning the new things. As an example, make sure you know about controllers. Make sure that you know about Cisco DNA Center and wireless land controllers. But also don't forget about traditional stuff, like what's the difference between TCP and UTP. What's the difference between other protocols, so like, DHCP versus DNS. Do you actually understand how those protocols work? Do you know what they're about? I mean all this stuff is covered in the outline. So I found that the exam covered a broad range of topics. I was surprised by some of the topics that are still asked in the exam. But when it comes to addressing, and I, missing it right now is subnetting. Make sure that you know your subnetting. If I give you an IP address and I say, \"Here's an IP address, \"192.168.130/28.\" Make sure that you know network, first host, last host, and broadcast address. Make sure that you know that information. Make sure that you know if you were given a routing table or a subnetting diagram, that you know where devices are in the network. Use tables. I'm not a big fan of tables. But I will be creating videos and publishing them on YouTube as well as my course with subnetting tables to help you do this stuff quickly. You gotta be able to look at a routing table, you've gotta be able to look at a network diagram, you've gotta be able to know where a host is. So subnetting is always important and it's still important. Big topics, Wi-Fi. Make sure that you know Wi-Fi topics. Such as encryption. So what encryption protocols are used on wireless. Make sure that you understand the theory of wireless, but make sure that you also understand how to configure stuff through the wireless land controller. Don't skip that section. New section in the exam. Make sure that you spend time on wireless. And topics such as virtualization as an example. I mean that's not pure routing and switching, but we've got this convergence of technologies. So you need to understand virtualization as well. Traditional topics such as quality of service are also important. My exam is very balanced. A lot of topics from a whole range of areas. For example, routing. Do you understand how routing works? Do you understand a floating static route versus a route such as default route or a route that was added by a routing protocol? Do you understand OSPF? Because OSPF is the only main protocol in the CCNA, make sure that you understand OSPF really, really well. Make sure that you understand elections, neighbor adjacencies. Different types of links, so here they mention point-to-point. If you enable OSPF on a ethernet interface, what kind of network will it be? If you enable it on a point-to-point link, what kind of link will it be? And that's important, because once again, a lot of WAN technologies have been removed from the course. PPP has been removed from the course. But here we've got a point-to-point link in OSPF. So how would they test you about a point-to-point link if you don't have some kind of point-to-point link. The OSPF network type could be point-to-point, which means you need a point-to-point link. So don't just throw out all the old technologies and say I will not touch anything that has a HDLC or point-to-point type of connection. I personally will keep a little bit of that in my course. But it's not as big as it was previously. Okay big section is security fundamentals. I would spent a lot of time on security fundamentals. It's 15% of the exam. Make sure that you understand VPNs, make sure that you understand wireless security protocols, make sure that you know how to configure wireless lands using WPA2, using pre-shared key via the GUI. Make sure that you understand triple A as an example. Do you know the difference between authentication, authorization, and accounting? So I would spend a lot of time on security fundamentals, big part of the course now. And then automation and programmability. This is where things are going. So you would need to know like certain, what is a northbound API, what's a southbound API, what protocols would be used on northbound, southbound? My big advice would be make sure you understand what a controller is. I've discussed this stuff, and I'll create a video showing you a bit of history if you're interested, but I spoke about this stuff on this video many years ago. What's the difference between separation of control plane, data plane, what is a management plane? So if you have a controller, traditionally we have a device like a router with the management plane, the control plane, and the forwarding plane, or data plane, within the device. But with a controller, we take the control plane out of the device, we put it in a centralized controller. Now in the original open flow model, the controller was the brain and the switches became dumb, or the routers became dumb. That didn't work very well, didn't scale. So OSPF kinda died a death. That's in the past now. But the idea with a controller is we can have a controller that, for instance, controls some aspects of forwarding. So in Wendell's CCNA book, he spends a lot of time on SDA. Lot of information on SDA. I don't know if it's necessary to know it at that detail, but make sure that you understand, what is an underlay network? Essentially physical devices, routers and switchers, running traditional stuff. You can however get rid of spanning tree and run a layer three network as the underlay. Then you run an overlay on top of it. Now it sounds all complicated, but it's just traditional stuff that's got a new spin on it, I would say. So in the old, old days, and we've done this for years, the internet, think of the internet as an underlay, it doesn't understand what's going across it necessarily. Especially if we put it in a tunnel. So let's go back even further. In the old, old days, we had a traditional telephone network where the switches in the cloud were intelligent and the phones were dumb. Then the intelligence was put on the phones and then, using Skype as an example, and the networking core became dumb. And we just simply made calls across the internet using Skype. So the traditional telephony network was intelligent, was replaced with an IP core that was essentially dumb, it didn't understand all the applications going across it. And then we made calls across the internet using Skype with the intelligence in the endpoints. Or in the controllers which could be, as an analogy, core manager express, or whatever controller we're using to set up the calls using IP devices. Now here in SDA, we've got an underlay. Think of that kind of like the internet, so we've got just switchers, routers. They are dumb to a point. And then we put an overlay on top of it. So we build a whole network on top of it using VXLAN. Now it sounds complicated, it's just tunnels. But the intelligence is that can automatically be built to apply policy. So we could have a policy on a SDA server. So we could have a policy on a controller and then apply the policy to the overlay, not to the underlay. So rather than trying to manually configure access lists on individual devices, we apply the policy. And this is the whole idea with intent-based networking. We apply a policy on the controller, and then that's going to configure the devices with this overlay network. So from me to you, there might be 20 switches or 20 routers on the internet as an example. But when we set up an IP set tunnel, logically it's a hop from me to you. Same kind of idea here. We've got a whole bunch of physical devices as the underlay, we put an overlay on top of it. Make sure you understand those concepts. Make sure that you understand REST, bit of REST. In the DevNet Exam, there's obviously a lot more about that. Make sure that you understand differences between Puppet, Chef, and Ansible. So Ansible, as an example, doesn't need an agent, it's an agent-less implementation. So I've created a whole Ansible course, so I'll take some of that experience and knowledge and add it to my new CCNA course. Make sure that you understand that with Ansible, it's kind of like with Python scripts, I can just SSH to the devices and make configuration changes on them. But with Puppet and Chef, with Puppet you can do some interesting things, but the idea is you run an agent on the device and you don't use SSH to talk to the agent using HTTPS, so using a web based protocol rather than traditional SSH. So the idea is is your controller, or your controlling device, or your management device, talks to the agent on the device that then configures the device. But with Ansible, it's agent-less. We're not running an agent or special software on the routers and switchers. We're connecting directly to them from a server. Make sure you can also interpret JSON encoded data. Okay I was quite surprised by that one, but, yeah, make sure you spend a bit of time on automation and programmability, but, don't get stuck on this topic. It's a new topic in the exam, don't get stuck on it. Notice security fundamentals has more information, or is more important, it's 15%. IP services is 10%. Talking about traditional stuff like DHCP, DNS, NTP, SNMP, so, SNMP's been around for years. Do you understand which underlying protocols are used by these upper layer protocols? So which protocol does SNMP use? Is it UTP, is it TCP? Which protocol does SSH use? TCP, UTP? Make sure that you understand various protocols and the underlying protocols under them. So I mean I could list all of these topics. I mean my exam was very broad, covered a whole bunch of topics. I think it was a very balanced exam. I think it was a good exam. Okay so hopefully you've learned something. If you have, please consider subscribing to my YouTube channel once again. Please like this video and please click on the bell to get notifications. I'm David Bombal and I wanna wish you all the very best. Yeah, yeah let's go (upbeat techno music)",
    "transcript_keywords": [
        "Cisco CCNA Exam",
        "Exam",
        "Cisco CCNA",
        "CCNA Exam",
        "Packet Tracer",
        "Make",
        "understand",
        "Cisco",
        "CCNA",
        "EIGRP",
        "Cisco Packet Tracer",
        "stuff",
        "OSPF",
        "topics",
        "Cisco Exam topics",
        "Cisco Exam",
        "VTP",
        "Packet",
        "Tracer",
        "exam topics"
    ],
    "transcript_entity_values": [
        "first",
        "three",
        "the Cisco DevNet Exam",
        "CCNP",
        "many years ago",
        "SSH",
        "JSON",
        "Packet Tracer's",
        "10%",
        "EIGRP",
        "192.168.130/28",
        "VXLAN",
        "CCNA 200-301 Exam",
        "Cisco DNA Center",
        "Cisco",
        "Packet Tracer",
        "Cisco Packet Tracer",
        "API",
        "GNS3",
        "120 minutes",
        "One",
        "200-301",
        "CCNA",
        "PPP",
        "years",
        "Wendell Odom's",
        "Eve-NG",
        "Cisco CCNA Exam",
        "BGP",
        "YouTube",
        "WPA2",
        "Ansible",
        "Packet Tracer",
        "Ansible",
        "IP",
        "the Cisco CCNA Exam",
        "Packet Tracer",
        "the CCNA Exam",
        "VLAN",
        "SDA",
        "Python",
        "one",
        "Cisco Details",
        "OSPF",
        "HTTPS",
        "GNS3",
        "NTP",
        "Tracer",
        "UTP",
        "15%",
        "PDF",
        "Cisco",
        "CCNA",
        "the CCNA Exam",
        "GUI",
        "Wendell",
        "SNMP",
        "TCP",
        "DNS",
        "CCNA Exam",
        "VTP",
        "DHCP",
        "BGP",
        "David Bombal",
        "Wi-Fi",
        "CCNA",
        "20",
        "Skype"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "GPE",
        "ORG",
        "EVENT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.03188066557049751,
        -0.01784263364970684,
        0.04796438664197922,
        0.030069677159190178,
        -0.04194613918662071,
        0.019247539341449738,
        0.03097447380423546,
        0.026430748403072357,
        -0.1482781171798706,
        -0.008314191363751888,
        -0.023180527612566948,
        -0.04669981822371483,
        -0.013700484298169613,
        0.01120571605861187,
        -0.011006216518580914,
        -0.02320532128214836,
        0.005487543065100908,
        -0.08135367184877396,
        0.006454117596149445,
        -0.03333955630660057,
        -0.038505833595991135,
        0.025049220770597458,
        0.01578986644744873,
        -0.03612247854471207,
        -0.009701184928417206,
        0.04449242725968361,
        0.05376606434583664,
        -0.039152856916189194,
        0.0028593316674232483,
        0.007848883047699928,
        -0.07792314141988754,
        0.0114811472594738,
        -0.014109949581325054,
        0.00308866985142231,
        0.005254535004496574,
        -0.05337252840399742,
        0.004614484030753374,
        -0.01636447384953499,
        0.002549325115978718,
        0.00028603264945559204,
        0.006230939645320177,
        0.008424127474427223,
        -0.010456375777721405,
        0.03989868611097336,
        0.1034727543592453,
        -0.0528598427772522,
        0.0033753770403563976,
        -0.029930781573057175,
        0.07844680547714233,
        -0.052920348942279816,
        0.02415149100124836,
        -0.07359658926725388,
        -0.037267714738845825,
        -0.00514537189155817,
        -0.025847017765045166,
        0.06444583088159561,
        0.0008782364311628044,
        -0.046408914029598236,
        0.004664544947445393,
        -0.06481627374887466,
        0.003751878859475255,
        -0.07009157538414001,
        0.00020950415637344122,
        0.030647851526737213,
        0.03559863567352295,
        -0.00686067808419466,
        0.025162499397993088,
        0.02921372465789318,
        0.09561648964881897,
        -0.062108587473630905,
        -0.09674615412950516,
        0.03269357606768608,
        0.004638936836272478,
        0.04955146834254265,
        0.04713740944862366,
        0.05338841676712036,
        0.05806915834546089,
        -0.0017611354123800993,
        0.01650574989616871,
        -0.00812242180109024,
        0.08264321833848953,
        -0.010058845393359661,
        0.015882957726716995,
        -0.032429758459329605,
        0.09222039580345154,
        0.01074235886335373,
        -0.0166397076100111,
        0.0010506067192181945,
        -0.057022824883461,
        -0.08907271176576614,
        0.07450832426548004,
        0.023893015459179878,
        -0.0659312978386879,
        0.04065760225057602,
        0.03176005929708481,
        0.04490842670202255,
        0.009632546454668045,
        -0.021341638639569283,
        -0.020642047747969627,
        0.022399352863430977,
        0.10431791096925735,
        0.016652889549732208,
        -0.08135779947042465,
        -0.06990855932235718,
        -0.08425788581371307,
        0.0271163210272789,
        0.06333290040493011,
        0.003989582881331444,
        0.09530986100435257,
        0.018937431275844574,
        -0.010688957758247852,
        0.04732043296098709,
        -0.03476649895310402,
        -0.06979965418577194,
        -0.0022401693277060986,
        0.11218210309743881,
        -0.012644486501812935,
        0.10911667346954346,
        0.09812909364700317,
        0.050110869109630585,
        -0.07831914722919464,
        0.007245973218232393,
        -0.045337237417697906,
        -0.051877204328775406,
        0.03943968191742897,
        -0.09446467459201813,
        -0.034658875316381454,
        5.092149324924007e-33,
        -0.05858375132083893,
        0.06454054266214371,
        -0.05051381140947342,
        0.06770408898591995,
        0.0780869871377945,
        -0.02548934705555439,
        0.07408648729324341,
        0.07604623585939407,
        -0.06914956867694855,
        0.0018875455716624856,
        0.016500579193234444,
        0.039052024483680725,
        -0.08855807036161423,
        0.016320250928401947,
        -0.049443311989307404,
        -0.040200334042310715,
        -0.10077591985464096,
        -0.059557754546403885,
        0.002191754523664713,
        0.026070628315210342,
        -0.007921303622424603,
        -0.05784593150019646,
        0.02346554398536682,
        0.05770697817206383,
        0.09408695995807648,
        -0.01848435029387474,
        0.03756694495677948,
        -0.026130352169275284,
        0.05344972386956215,
        0.005689247045665979,
        -0.11965169757604599,
        -0.0325767919421196,
        -0.07895950973033905,
        0.000280760315945372,
        0.0031168197747319937,
        0.036634963005781174,
        -0.0012255461188033223,
        -0.050899699330329895,
        -0.023337416350841522,
        0.007420199457556009,
        -0.08453238010406494,
        0.029253732413053513,
        -0.03159484267234802,
        -0.0809256061911583,
        -0.015936091542243958,
        -0.029078613966703415,
        -0.0008922108099795878,
        -0.025479398667812347,
        0.042220473289489746,
        0.024050988256931305,
        -0.08706698566675186,
        -0.05078350752592087,
        -0.05722685158252716,
        -0.029256407171487808,
        -0.07945934683084488,
        -0.07589967548847198,
        0.061168234795331955,
        0.020602136850357056,
        0.017167968675494194,
        0.03603469580411911,
        0.015561160631477833,
        0.02509160339832306,
        -0.08296779543161392,
        0.047125063836574554,
        -0.05099109560251236,
        0.061768218874931335,
        -0.09697660803794861,
        -0.030972955748438835,
        0.10379545390605927,
        -0.0344667062163353,
        -0.01645706407725811,
        -0.017834585160017014,
        0.02743172086775303,
        -0.052917398512363434,
        0.08453093469142914,
        0.048299603164196014,
        -0.08038047701120377,
        0.010196240618824959,
        0.01224911492317915,
        0.01408062968403101,
        0.00016976679034996778,
        0.02648419514298439,
        0.02600971609354019,
        0.0037072738632559776,
        0.03260071948170662,
        -0.010284245014190674,
        0.06387035548686981,
        -0.0602717287838459,
        -0.02701803855597973,
        0.04182557016611099,
        0.08927291631698608,
        0.04603489115834236,
        0.03255099430680275,
        0.03960920497775078,
        0.0405566543340683,
        -4.764771944168092e-33,
        -0.01922803744673729,
        0.05663575604557991,
        -0.04929215833544731,
        0.011065991595387459,
        0.005074553191661835,
        -0.0779048353433609,
        0.06776615977287292,
        0.01081374567002058,
        0.0366206094622612,
        -0.075413778424263,
        0.043600600212812424,
        0.03817601501941681,
        -0.017933523282408714,
        0.025922134518623352,
        -0.025936290621757507,
        -0.02403220348060131,
        -0.10253303498029709,
        -0.016618147492408752,
        0.03407209366559982,
        -0.03449789434671402,
        0.055207788944244385,
        0.14547716081142426,
        -0.08920115977525711,
        -0.03653581067919731,
        -0.034760911017656326,
        0.027360020205378532,
        0.01800505816936493,
        0.025343788787722588,
        0.10005494952201843,
        -0.021980339661240578,
        -0.024155957624316216,
        -0.0032441916409879923,
        0.026901479810476303,
        0.041228629648685455,
        0.011529981158673763,
        0.040876470506191254,
        0.11863749474287033,
        0.012394022196531296,
        0.003697780193760991,
        0.0794234499335289,
        0.04230407997965813,
        -0.008678457699716091,
        -0.05627365782856941,
        -0.04152243956923485,
        0.05149818956851959,
        0.033806610852479935,
        0.030585909262299538,
        -0.014358870685100555,
        -0.08405870944261551,
        0.054422326385974884,
        0.06821801513433456,
        -0.01693570986390114,
        -0.055887456983327866,
        -0.01917867921292782,
        0.02937413938343525,
        0.051180388778448105,
        0.0019441837212070823,
        0.01096389815211296,
        -0.004917921032756567,
        0.018720462918281555,
        0.009222425520420074,
        0.061958685517311096,
        -0.02346232160925865,
        0.07436097413301468,
        0.02132228948175907,
        -0.02864728681743145,
        0.009665717370808125,
        -0.018936363980174065,
        0.002032320946455002,
        0.016140352934598923,
        -0.1750410795211792,
        0.06663553416728973,
        0.02740684151649475,
        -0.08742015063762665,
        0.010146381333470345,
        -0.022641992196440697,
        0.05286923050880432,
        -0.013165365904569626,
        0.0053926617838442326,
        -0.056663695722818375,
        -0.06426132470369339,
        -0.008113370276987553,
        -0.016701577231287956,
        0.1167457327246666,
        0.03476189821958542,
        0.09939888119697571,
        0.0652836412191391,
        -0.021749427542090416,
        -0.07104109227657318,
        0.029735634103417397,
        -0.04502298682928085,
        -0.0035344124771654606,
        0.057716578245162964,
        -0.03148653358221054,
        0.028834545984864235,
        -4.74315413612203e-08,
        -0.057839471846818924,
        0.08009998500347137,
        -0.08708075433969498,
        0.01567447930574417,
        0.02922423928976059,
        -0.01679694838821888,
        -0.038548652082681656,
        0.03217700868844986,
        -0.026109039783477783,
        0.009261212311685085,
        -0.0065226624719798565,
        -0.0014525006990879774,
        -0.028123008087277412,
        0.06341295689344406,
        -0.013583571650087833,
        0.053416889160871506,
        0.0059577361680567265,
        0.02244056947529316,
        -0.004398633725941181,
        -0.08630255609750748,
        0.033573687076568604,
        0.006594512145966291,
        -0.024981098249554634,
        0.06059412285685539,
        -0.0679272785782814,
        0.025493720546364784,
        0.051262110471725464,
        0.10488571971654892,
        -0.0011278748279437423,
        -0.09105543047189713,
        -0.07446593046188354,
        -0.061007142066955566,
        0.0023945218417793512,
        0.027082985267043114,
        0.0138676343485713,
        -0.044389620423316956,
        0.021935807541012764,
        -0.03128941357135773,
        0.040440887212753296,
        0.06591551750898361,
        -0.11161992698907852,
        -0.08104774355888367,
        0.02086145617067814,
        0.02242690697312355,
        0.007226253859698772,
        -0.11870461702346802,
        -0.10222845524549484,
        -0.007136800326406956,
        0.02099486254155636,
        -0.020826565101742744,
        0.018976271152496338,
        -0.012854116037487984,
        -0.03344130143523216,
        -0.04265434667468071,
        0.04596899449825287,
        0.05329761654138565,
        0.03716509789228439,
        0.031643178313970566,
        -0.1258016973733902,
        0.11432430893182755,
        0.03616320714354515,
        -0.02131298929452896,
        -0.08453653007745743,
        0.0015351183246821165
    ]
}