{
    "id": "Nc8DLi12Y-Q",
    "title": "Fold, Flip, or Duo: why fold a phone?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-09-02T13:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=Nc8DLi12Y-Q",
    "category": "Science & Technology",
    "tags": [
        "folding phones",
        "foldable phones",
        "foldable",
        "folding",
        "phone",
        "phones",
        "microsoft duo",
        "galaxy fold",
        "galaxy z fold 2",
        "z fold 2",
        "galaxy fold 2",
        "galaxy z flip 2",
        "galaxy z flip",
        "samsung galaxy",
        "samsung",
        "galaxy",
        "microsoft",
        "dual screen",
        "two screens",
        "dieter bohn",
        "processor",
        "price",
        "specs",
        "tablet",
        "folding phone",
        "how to buy",
        "pre order",
        "order",
        "5g",
        "software",
        "hardware",
        "hands on",
        "first look",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "apple",
        "google",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 358608,
    "likes": 9248,
    "comments_count": 875,
    "description": "With the Microsoft Duo, Galaxy Z Fold 2, and Galaxy Z Flip, there are now three kinds of folding phones with real momentum behind them. In this episode of Processor, Dieter Bohn looks at what each type of folding phone is good at and asks why you'd want to fold your phone in the first place.  Learn more:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Surface Duo 2:  Galaxy Z Fold 2  Galaxy Z Flip   0:00 Intro 0:25 Why would you want a folding phone? 1:30 Four basic categories of folding phones 2:27 Purpose of each device 4:29 Benefits of the Galaxy Z Flip 5:09 Benefits of the Galaxy Fold devices 7:36 Benefits of the Surface Duo 10:21 Outro  Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/2YVYsw8",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/32L9y8D",
        "https://bit.ly/2QGZCqW",
        "https://bit.ly/2ELeToc",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(upbeat music) - So the phones, they fold now, they fold like this and they fold like this, and they fold like this. And they also fold like this. So lots of different ways to fold, but here's the question. Why would you want that? What I want to do in this video is talk about all the different kinds of folding phones that are coming out right now, and what their benefits really are. Because look, folding phones are super expensive. You are not getting one of these for less than 1300 bucks. Unless we talk about this weird LG with its extra screen case thing. In general, folding phones are more expensive. They're usually more fragile, and they're also usually thicker than a regular phone when they're folded up. Plus on top of all that, every single one of these phones has its own particular software quirks. That is all a lot of reasons not to buy a folding phone. And honestly, I don't think you should buy a folding phone. Not yet anyway. But assume the price could come down and the durability hit some bar where it's good enough. And that might take a while, but assume all that happens, then the question really is why would you want one of these folded the phones? And the answer turns out to be different for every single one of these phones. Well, maybe some of them are actually kind of like tablets. They're computers? No, we are not going into the what's a computer question. We're just gonna call these Android devices. Okay? (laughs) Done. I put these Android devices into four basic categories. There are flip phones, like the Galaxy Z Flip. There are single screen folding phones, like the Galaxy Fold. There are dual screen folding phones, like the Microsoft Duo. And there's other, like this LG here. You know what? Let's just get other out of the way, because other is where LG lives. This is the LG velvet, with a second screen accessory case for it. And it basically lets you run two apps at once. And I mean, it works sorta, but the thing is just big and thick, kind of fussy. Other is also where LG does other weird things like the LG wing concept, which rotates and shows a second screen behind it. I love you LG, and you deserve to have one of these ideas become a hit. Just not there yet. I just hope you keep swinging for the fences. So really all of the momentum right now is behind these three ideas. The flip phone, the single fold folding phone and the dual screen folding phone. And each has its benefits and drawbacks. And you know, just saying, \"Benefits and drawbacks,\" Is really cliche and it's easy to ignore. So I'm gonna try and hit this a little bit harder because this is really important. They are good at different things. And what that really means is they have different purposes. And you should know what the purpose of each device is going in because that purpose is the answer to the reason why you might wanna buy one of these folding phones. Now, there is one purpose that all three of these phones share. They're just cool. They're cool, and they're different, all right? I mean, this is rad. This is literal glass that folds in half. I mean, come on, you can't be cynical about this. And the Duo is just beautiful. Look how thin it is. Just look at it. It's amazing. Luxury tiers exist in pretty much every major consumer product category. And these are luxury products. Phones aren't just about functionality, they're also cultural artifacts, just like any other thing. There's luxury handbags, and now you've got luxury phones. There's this other benefit to these phones that they all share that's a little bit hard to quantify. You close it, and your phone stuff is shut, it's done inside the phone. You don't just set the phone down, you physically change it's state. It becomes an entity attentional act. It says, \"I am done with this.\" And maybe that also is going to mean that you need to make an equally intentional act to open it up and look at your phone. And maybe that makes you just a little bit less likely to have all of your attention dominated by your phone, Android device, whatever. So let's talk about each of these categories of folding Android devices and what they're good at. Theoretically anyway, sometimes the execution falls a little bit short. The first and the simplest category is the flip phone style. This takes the phone shape that you already know, and maybe love, and then you get to fold it in half and get something smaller. It is a little bit of a thicker package, but it's a smaller one. So it sits in your pocket or your bag differently, and I think better. You get the physical benefit of a more compact device, like literally it's like a compact, like here's my compact that I use for makeup for video. And it's like kind of similar in size. Anyway, that's it. It's a very cool luxury phone that you can close and be done with, that also maybe fits in your pocket or your bag more easily. Really that's enough. The end on flip phones. Okay, then there are the big boys, the Galaxy Fold and this thing right here, the Galaxy's Z Fold 2 5G. Now I literally un-boxed the Galaxy's Z fold 2 5G just a couple of hours ago. So I'm nowhere near ready to review it yet. But I could tell you that I'm already impressed. The build quality on this thing is so much better than the first Fold. This outer screen is actually usable, and the inner screen is made out of glass and it's way nicer 'cause it just has a little hole punch camera instead of a giant notch. But this category overall is really simple. It gives you a phone that turns into a small tablet. So you get a bigger screen when you want it, and a smaller screen when you don't. Overall though, it's pretty thick. And it's also not very easy to carry around. But maybe it's easier to carry around than say like an iPad mini. And actually the screen on the inside is virtually the same size as an iPad mini. You know what? I've reviewed the original galaxy Fold last year, twice. Once on the broken first design, and then once again on the redesign. And in those two reviews, I really did figure out why I think this form factor is so interesting. So I'm just gonna quote myself. Think about this thing that happens all the time with your phone. You pull it out to check something quick, but then all of a sudden, a half hour has gone by while you were scrolling Instagram or whatever. It's a real problem. But it's a problem I didn't really have with the galaxy Fold, because when I was just using the tiny screen, I wanted to get something done and put it away really fast. 'Cause the tiny is not that good. But then when I unfolded it and used it, I was really using it. I had to hold it in two hands, it became an active thing that I chose to be doing. It required some intentionality. So I ended up feeling better about how I was using this phone than I usually do when I use a regular phone. That is the reason to get a folding phone that turns into a little tablet. You have a big immersive screen for phone apps when you're using it intentionally, and you keep everything else short and quick and to be done with it, and you put it away. Now, maybe this year, Samsung and Google are going to wow me with big improvements for how Android works on tablets. And we'll be talking about using Android to to do tablety things instead of just big immersive phones things. But that's gonna have to wait for the full review. My hunch right now though, is mostly what we talking about very big phone apps that feel immersive, and then a lot of split-screen stuff. Which leads me to the dual screen idea of the Surface Duo. Instead of folding glass, you have two separate screens and a big gap in the middle. And by the way, you're probably wondering why I don't show you the device with the screen on and the bezels and how big they are and just show you how everything works. Well, I can't. Microsoft has set the terms of this embargo that lets me tell you everything I want about the hardware itself, but I can't give you anything that I've learned from turning the screen on until the full review. Which is a choice, I guess, but wait for the full review on this thing. Besides we've already got hands on with the Microsoft Duo showing the screen and how some of the software works. Tom Warren got to look at this almost a year ago. Okay. So why would you want a device with two separate screens in a three 60 hinge? Well, a few reasons. One, it has even more of that, \"I am done if I'm having to fold.\" Because there's no screen on the outside at all. More importantly though, is it can be really thin. When it's opened up, it's less than five millimeters thick. It's actually like directly comparable to my very super thin Kindle Oasis e-reader. Plus the screen flips all the way around 360. So then you can use it one handed like a phone. Well maybe not quite one handed, look how wide this thing is. You'll need your second hand. Anyway, the screen in phone mode is quite big. You can also get a bunch of other modes, like sort of a tablet with a gap, and like 10th mode, and a book mode. And Microsoft calls these postures. Postures? Is hinge the posture? 'Cause that's my default posture, is that hinge straight there? Anyway. The gap between the screens actually tells you everything you need to know about what the Duo is about. You're really not gonna want to stretch stuff across these two screens all that often, except for maybe like Kindle books. No. What this thing is for is running two apps side by side and sometimes running one app and then getting a big old thumb keyboard at the bottom. Mostly though it's about multitasking. How often do you wish that you had two windows open on your phone? Maybe you've never even thought of that, but if you could, maybe you would use your phone a little bit differently. And that is Microsoft's bet. That you really do want to have two apps open at once more often than you realize. Having it be two apps side-by-side also gets around that whole Android apps aren't great on tablets thing too, since it's just two phone apps side by side. If you use the Duo like Microsoft intends, I guess it really isn't a tablet or a phone. It's more like two phones. Like dual phones. Like a duo. Got me. So there you have it, there are three main categories of folding phone, all of which are very cool. All of which might help you be just a little bit less obsessed with your phone. And all which honestly have really different visions for how to evolve Android into our folding phone future. And I don't know which one is gonna win out. Maybe all of them will stick around, that's kind of what I'm hoping for, but despite all these big ideas and how fun these phones are to play with, I do have a bet for which one I think is most likely to win out over the long term. And it's the one that ends up costing less than 1000 bucks, because while all these ideas are great, they're all just still too damn expensive. Hey, thanks for watching. You probably wanna know more about the Duo, or maybe you wanna know more about the Z Fold 2. Well, I'm reviewing both of these phones, so let me know what you want to know down in the comments.",
    "transcript_keywords": [
        "phone",
        "phones",
        "fold",
        "screen",
        "folding phone",
        "folding",
        "Galaxy Fold",
        "screen folding phones",
        "Android",
        "Duo",
        "thing",
        "fold folding phone",
        "big",
        "Galaxy",
        "screen folding",
        "Microsoft",
        "apps",
        "phone apps",
        "Android devices",
        "Microsoft Duo"
    ],
    "transcript_entity_values": [
        "last year",
        "Android",
        "less than 1000 bucks",
        "one",
        "four",
        "the Surface Duo",
        "three",
        "less than 1300 bucks",
        "LG",
        "Fold",
        "10th",
        "un",
        "the Galaxy Fold",
        "Google",
        "the Galaxy Z Flip",
        "the Galaxy's Z",
        "the Galaxy Fold",
        "iPad",
        "the Microsoft Duo",
        "the Galaxy's Z Fold 2 5G.",
        "half",
        "Samsung",
        "two",
        "a half hour",
        "this almost a year ago",
        "One",
        "Tom Warren",
        "this year",
        "second",
        "2 5",
        "Microsoft",
        "first",
        "Instagram",
        "less than five millimeters",
        "a couple of hours ago",
        "Kindle Oasis e-reader",
        "Kindle"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "LOC",
        "PERSON"
    ],
    "vector": [
        -0.1554824858903885,
        0.0019588982686400414,
        0.05562245100736618,
        -0.04080133140087128,
        0.01489211805164814,
        -0.015446585603058338,
        0.0024697091430425644,
        0.14855524897575378,
        0.01984524540603161,
        0.052707817405462265,
        0.045225054025650024,
        0.04841713234782219,
        -0.0026085833087563515,
        -0.015350806526839733,
        0.07737357169389725,
        0.028217477723956108,
        -0.02765735797584057,
        -0.02725612372159958,
        -0.07576552033424377,
        0.08311130106449127,
        0.09621638059616089,
        -0.06480185687541962,
        0.02786993235349655,
        -0.029017698019742966,
        -0.0015326107386499643,
        0.03498994931578636,
        -0.06197861209511757,
        -0.012392764911055565,
        0.03496382758021355,
        -0.02829454280436039,
        0.038369156420230865,
        0.1708046942949295,
        0.033664364367723465,
        -0.004925327375531197,
        -0.06433038413524628,
        -0.09743372350931168,
        0.02743087150156498,
        0.000931425194721669,
        -0.06525593996047974,
        -0.04859480634331703,
        -0.042397335171699524,
        0.011651705950498581,
        0.011968301609158516,
        0.010775722563266754,
        0.018048668280243874,
        -0.03481727093458176,
        -0.014835636131465435,
        0.014172311872243881,
        -0.015988187864422798,
        0.003646302968263626,
        0.0462491512298584,
        -0.02922786772251129,
        -0.0568680502474308,
        0.024631911888718605,
        -0.058359112590551376,
        0.1106046661734581,
        -0.06992340087890625,
        0.0549396276473999,
        -0.010380527004599571,
        0.040933843702077866,
        0.08251658827066422,
        -0.011426782235503197,
        -0.05525169149041176,
        0.03423595055937767,
        0.018974600359797478,
        -0.008631320670247078,
        -0.028779039159417152,
        -0.06603457033634186,
        -0.04394816234707832,
        -0.00751012098044157,
        -0.060165707021951675,
        -0.023480810225009918,
        0.0009206629474647343,
        -0.012693912722170353,
        0.023350119590759277,
        -0.037081558257341385,
        0.09599090367555618,
        -0.06895668059587479,
        -0.09761836379766464,
        -0.01898171193897724,
        0.007437561638653278,
        -0.010310701094567776,
        -0.017459670081734657,
        0.04021523520350456,
        -0.0027356562204658985,
        -0.03938048705458641,
        -0.03796936199069023,
        0.03910247981548309,
        -0.11931879818439484,
        -0.07093650102615356,
        0.002579234540462494,
        0.08255665749311447,
        -0.01496109552681446,
        -0.029049325734376907,
        -0.04681684821844101,
        0.027116931974887848,
        -0.051732804626226425,
        0.017796775326132774,
        0.008632609620690346,
        0.006239720154553652,
        0.04714537411928177,
        0.03531870245933533,
        0.12140907347202301,
        0.011004987172782421,
        0.019747070968151093,
        -0.119785375893116,
        0.03624650463461876,
        -0.03657239302992821,
        -0.031236425042152405,
        0.03703391179442406,
        0.009070069529116154,
        0.001710609532892704,
        0.010553431697189808,
        -0.012976267375051975,
        -0.04645846039056778,
        0.013855799101293087,
        -0.008394137024879456,
        0.10059347003698349,
        0.12024533003568649,
        0.001639439957216382,
        -0.06930934637784958,
        0.040370646864175797,
        -0.01396791823208332,
        -0.11039570719003677,
        -0.011603009887039661,
        -0.003982648253440857,
        -0.07992079854011536,
        3.917291945103071e-33,
        -0.020143311470746994,
        0.11561866849660873,
        -0.03443565219640732,
        0.02131996490061283,
        0.022032830864191055,
        -0.009004675783216953,
        -0.08811188489198685,
        -0.026766518130898476,
        -0.020278340205550194,
        0.10478875041007996,
        -0.007916626520454884,
        0.004784939344972372,
        0.04980294778943062,
        0.030830606818199158,
        0.05258329212665558,
        -0.07603439688682556,
        0.008084479719400406,
        -0.015410911291837692,
        -0.08276253938674927,
        -0.06552242487668991,
        0.03902176022529602,
        0.0311743151396513,
        0.08891112357378006,
        0.03591595217585564,
        0.06974224746227264,
        -0.058018025010824203,
        0.03791865333914757,
        -0.07712022960186005,
        0.04941846430301666,
        -0.013452599756419659,
        -0.07485465705394745,
        -0.011348814703524113,
        -0.0025733979418873787,
        -0.04876025766134262,
        0.011551948264241219,
        0.0689283013343811,
        -0.017306871712207794,
        -0.11425714194774628,
        0.03306812047958374,
        -0.011844929307699203,
        -0.11037133634090424,
        0.008744679391384125,
        -0.029917588457465172,
        0.0009833868825808167,
        0.03344368189573288,
        -0.057611797004938126,
        0.025871943682432175,
        0.028940927237272263,
        0.0010859044268727303,
        -0.03565945103764534,
        0.04449671506881714,
        -0.010585187934339046,
        -0.043354589492082596,
        0.004137110430747271,
        -0.011225319467484951,
        -0.025054866448044777,
        0.05588673800230026,
        -0.04374450445175171,
        -0.008912990801036358,
        0.05445951223373413,
        0.009157509543001652,
        0.028940526768565178,
        -0.06798861920833588,
        0.01815330982208252,
        -0.09312290698289871,
        0.0507906973361969,
        0.056407053023576736,
        -0.029246341437101364,
        -0.030570711940526962,
        0.03793545067310333,
        -0.04462795332074165,
        -0.008599760942161083,
        -0.025637108832597733,
        0.00765607925131917,
        0.017474770545959473,
        0.010263960808515549,
        0.013176672160625458,
        -0.04917249083518982,
        0.035066455602645874,
        -0.01531754806637764,
        -0.030364179983735085,
        -0.02209668606519699,
        0.038698792457580566,
        0.005494614597409964,
        -0.03724636510014534,
        -0.0026833508163690567,
        -0.022666756063699722,
        -0.07092496007680893,
        0.00918188039213419,
        0.05367241054773331,
        -0.08301325887441635,
        -0.033452730625867844,
        0.03585781529545784,
        -0.04577258229255676,
        0.013000765815377235,
        -4.5982576592443455e-33,
        -0.052605755627155304,
        -0.03129695728421211,
        -0.0036571966484189034,
        -0.013403640128672123,
        0.053663790225982666,
        -0.04188390076160431,
        0.039916373789310455,
        -0.08214914053678513,
        -0.06667351722717285,
        -0.06659427285194397,
        -0.021451059728860855,
        0.03558129444718361,
        0.07038381695747375,
        0.0015532616525888443,
        0.0008331492426805198,
        -0.03230825066566467,
        0.03231847658753395,
        -0.04345916211605072,
        0.03674699738621712,
        0.058387771248817444,
        0.07911104708909988,
        0.04772662743926048,
        -0.026442330330610275,
        0.07597387582063675,
        -0.05706373602151871,
        0.00454483088105917,
        0.003529967740178108,
        0.00011797354818554595,
        0.1154492199420929,
        0.04138650745153427,
        -0.030622731894254684,
        -0.08795075118541718,
        0.043299078941345215,
        0.0010583787225186825,
        0.031457796692848206,
        0.0584748238325119,
        -0.08236468583345413,
        -0.05106440186500549,
        0.04512929543852806,
        -0.05765875056385994,
        -0.031805746257305145,
        0.012238879688084126,
        0.05847535282373428,
        -0.04328709840774536,
        0.021237831562757492,
        -0.05448150634765625,
        -0.04499460384249687,
        0.03931567817926407,
        -0.056765396147966385,
        -0.061428144574165344,
        -0.008965162560343742,
        0.03682456910610199,
        -0.020154789090156555,
        -0.03716566413640976,
        -0.050138846039772034,
        0.008399195969104767,
        -0.0035166353918612003,
        -0.09084045886993408,
        0.045550327748060226,
        -0.009352070279419422,
        0.07059677690267563,
        0.02402610518038273,
        -0.01796821691095829,
        -0.02740088291466236,
        -0.02644188329577446,
        0.027142714709043503,
        0.09313062578439713,
        -0.02582884207367897,
        -0.028360968455672264,
        -0.044950101524591446,
        -0.058864351361989975,
        -0.004554098937660456,
        0.028239671140909195,
        -0.09149019420146942,
        -0.022278308868408203,
        0.09554865211248398,
        -0.0714765340089798,
        -0.005513897631317377,
        -0.004376937635242939,
        -0.027852380648255348,
        0.004299902822822332,
        0.004111257381737232,
        0.07095227390527725,
        0.07561597973108292,
        -0.06252041459083557,
        0.0019536055624485016,
        -0.027570277452468872,
        0.05653783679008484,
        0.03221006691455841,
        0.0015714714536443353,
        -0.011938233859837055,
        -0.02228289097547531,
        0.004903963766992092,
        0.13432428240776062,
        0.041590616106987,
        -4.4925776876425516e-08,
        0.05312246456742287,
        -0.006761722732335329,
        0.08106347918510437,
        0.0031128518749028444,
        -0.06383726745843887,
        0.0056742215529084206,
        0.04466428980231285,
        -0.048047665506601334,
        0.031824737787246704,
        0.011429422535002232,
        -0.0640442967414856,
        -0.04284239560365677,
        -0.14670786261558533,
        0.07802339643239975,
        0.08213399350643158,
        0.12457822263240814,
        -0.008669285103678703,
        0.07630088180303574,
        0.003671252867206931,
        0.06581193953752518,
        0.03305907920002937,
        -0.032391130924224854,
        0.03006182238459587,
        -0.0011860254453495145,
        0.017736246809363365,
        0.020694009959697723,
        -0.0884597897529602,
        0.04796949401497841,
        0.04761654511094093,
        -0.04544726014137268,
        -0.0001389972458127886,
        -0.011290271766483784,
        0.009819938801229,
        0.046166207641363144,
        -0.05904179438948631,
        -0.06845699995756149,
        -0.008876643143594265,
        -0.021552061662077904,
        0.08439572900533676,
        0.05471424758434296,
        0.1126677468419075,
        0.005536895245313644,
        -0.045410122722387314,
        0.0820842757821083,
        -0.019689718261361122,
        -0.10331548750400543,
        0.03293347731232643,
        -0.03739180415868759,
        -0.018439674749970436,
        0.07960978895425797,
        -0.05736103653907776,
        -0.10775957256555557,
        0.0035821539349853992,
        0.019079556688666344,
        0.028780769556760788,
        0.06583097577095032,
        0.0006033673416823149,
        0.04057370126247406,
        0.020154880359768867,
        0.04541536420583725,
        -0.009019708260893822,
        -0.02528478391468525,
        -0.037085119634866714,
        0.03023526445031166
    ]
}