{
    "id": "NCe4WpoA03Q",
    "title": "iPhone 14 TEARDOWN! - You're not going to believe it...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-09-21T13:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=NCe4WpoA03Q",
    "category": "Howto & Style",
    "tags": [
        "iphone 14 teardown",
        "iphone 14",
        "new iphone",
        "iphone 14 back glass",
        "iPhone 14 repair",
        "iphone 14 pro",
        "iphone 14 plus",
        "Apple",
        "smartphone",
        "android",
        "mobile phone",
        "best smartphone",
        "best iphone",
        "iPhone 14 screen repair",
        "cracked glass",
        "iPhone 14 back glass repair"
    ],
    "views": 3340949,
    "likes": 107450,
    "comments_count": 3611,
    "description": "Finally - an iPhone that's more reparable than an Android! Check out  & use code 'JerryRig' to get 10% off your new wallet and FREE world wide shipping. Huge thanks to Ridge Wallet for sponsoring this video. The new iPhone is here! The iPhone 14 survived my durability test and now we get to see how its assembled. Screen comes off easy! And now... what is this... the back glass comes off easy too?! Who abducted Tim Cook? Blink twice if you need help.... I for one am extremely pleased with the direction Apple is going... a few more steps like this and I might just have to see how it feels having an iPhone in my pocket...   Grab a Teardown Skin for your phone HERE:  Watch the Durability Test HERE:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.Ridge.com/JerryRig",
        "https://www.dbrand.com/teardown",
        "https://youtu.be/GXWcmf2PVxc",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today is the day we find out if Apple has truly fixed the iPhone 14 design. Fingers crossed we might actually get a removable glass panel for the first time in 6 years. It might not sound like a big deal, but that means instead of paying $500 to fix a cracked panel, it's only officially $169. Unofficially, of course, it gets way cheaper. But we'll talk more about that later. If the rumors are true, your wallet is about to be very happy. Speaking of wallets, huge thanks to Ridge for sponsoring this video. I've personally been carrying a Ridge wallet for the past 4 years and surviving 4 years with me is quite the accomplishment. I got the Burnt Titanium version and it's held up extremely well considering that I keep my keys, Jerry Rig Knife, and wallet all in the same pocket. And, of course, my cell phone in the other. I have 8 cards in mine plus some cash. It's cool to see how my wallet has held up against a brand new Burnt Titanium. The new one's looking rather pristine and mine has quite a bit of character. The Ridge wallet can hold up to 12 cards and has 30 different styles to choose from, even one that combines the wallet with an air tag if you're into that kind of thing. All wallets come with a lifetime warranty, and even RFID blocking. Ridge also has a cool key case which consolidates loose keys. I'll have a link down in the description for an extra 10% off. Ridge.com/JerryRig. And if you don't like it you can always send it back within 45 days for a full refund. Now it's time to see what's inside of the iPhone 14. Let's get started. [Intro] I'm actually kind of excited for this one. Apple has been the same for so long, finally having a new design to check out is rather energizing, especially since now it'll be less expensive for people to fix and I'm all about that life. Speaking of fixing, we still have the two pentalobe screws at the bottom, and yes, I do indeed have the new tool sweeping YouTube, but Linus's driver is far too large for my application and we'll have to save the full review for later. Until then we'll stick with my tiny tools. With the screws removed and the phone turned off we can try taking off the screen. Now Apple has set the glass flush with the edge of the frame again, so my normal razor blade prying combo move isn't going to work well this time around. Professional techs use large suction tools with a cup on either side, or even suction hot plates to help facilitate the screen removal. Eventually I'll have to get me some of those machines, but today we're just going to roast the glass with my heat gun until my fingers melt and yoink up with a suction cup while pinning the frame down with the razor blade. After which we can cut away the adhesive that surrounds the edges, taking special care not to damage any of the ribbon cables that line the left side. With the adhesive gone the screen opens up like a book, if you live in the USA. And what's underneath the screen is fascinating. On this iPhone 14 it looks like Apple is taking a very similar approach that Google used in their Pixel line of phones. Google has won my most repairable smartphone of the year awards for several years running now. There's a giant metal mid plate between the screen and the rest of the phone protecting the circuits and the battery. That metal protection makes screen repairs fairly foolproof and makes me very happy. The screen is still functioning after removal which is good. To take it off completely there are two y triple zero screws holding down two metal plates, which are pinning two Lego-style ribbon connectors. And that's it. There might be a sensor to transfer over to the new screen, but at first glance it appears that screen repairs can be done extremely safely and extremely quickly, assuming, of course, that the parts aren't digitally locked to the phone, which is a situation we can discuss later. Nothing else is connected, damageable, or removable from this side of the phone, so the only other access point to the internals would be from the back. Moment of truth. With a lot more heat and a really strong suction cup I can lift the edge of the back panel up and slightly out of the phone, just enough so that my razor blade can start slicing and dicing the adhesive. Remember, I'm like decently good at opening phones but in, like, the same way you don't want a veterinarian performing your appendectomy. The job will get done, of course, in both situations, the results are just a little less than certain. Finally the back glass is detached and opens up just like a book if you live in Japan, exposing all the glorious internals of the iPhone 14. This is the easiest iPhone back glass removal in a decade. The only thing still connected is the wireless charger rear microphone and LED flash, all attached through the same Lego-style ribbon cable to that motherboard. With the metal bracket removed I unplugged what I thought was the battery, turns out what's a bit lower and the back panel is officially on its own. Now it's hard to say for certain but we already know that Apple will perform this exact repair themselves with genuine parts for $169. But I also know people who don't really care about genuine parts and just want a quick, cheap, and easy way to keep glass dust from entering their fingertips. Right now if you were to buy a Samsung Note 20 aftermarket glass replacement it would cost around $20. The iPhone 14 is too new to predict cost-wise, but I would assume since it has a metal plate and a bit more hardware, the unofficial replacement pieces would be in the $20-30 range and probably come without magnets installed, but we'll have to wait and see. Taking a close up look at the LED flash, which you would probably have to transfer over to avoid any non-genuine part detected errors, it does have a rubber ring around the circular lens which makes a watertight seal against the back glass, which means if your glass is compromised, so is your water resistance. Not sure if this has the 9 individual LEDs built into it for the flash variations that Apple was talking about. But there are a whole lot of solder points on the back. We'll have to compare it to the 14 Pro if you want me to take apart one of those. But yeah, huge points to Apple this year for making the two most common repairs on smartphones the screen and the back glass super easy to fix. It's a ginormous step in the right direction for wallets everywhere. The last easy thing to replace before we descend into anarchy and chaos is the battery. Turns out the connector's under the second metal plate below two more tri-point screws. Now the battery is really unplugged and it looks like we have some pull tabs. [Stretching sounds] The world would be a better place if every phone had pull tabs. But that's all the happiness we get for today though, since our other tab broke and we have to use alcohol to drown the rest of our problems. The isopropyl alcohol isn't our first choice obviously, but it does dissolve the stickiness of the pull tab that's left and lets the battery be removed without bending it or prying it since both of those are dangerous to the 3279 milliamp hours of juice left inside of the pouch. Another bracket with its tri-point screws can be removed up top. This gives us access to the front and rear camera ribbon. I'll also pop out three screws near that taptic motor for the phone vibrations. It came out with the standoff still attached which is definitely not supposed to happen, but since I haven't been super nice to the phone we'll let it slide. I'll unplug the Lego-style ribbons for the camera units, along with removing the three screws that hold the housing in place. Up top we have our 12 megapixel ultra wide camera with no OIS. And at first glance it appears that the main camera also does not have OIS, but it turns out that Apple is again implementing their censorship technology which actually stabilizes the sensor of the camera instead of stabilizing the lens of the camera. I showed how this works during the iPhone 12 Pro Max teardown. It's an interesting piece of technology that gets the same job done, just in a different way. With the camera's gone we can remove the 5 standoff screws holding down the motherboard and then unclip the front 12 megapixel camera and the face ID components. Super convenient that these aren't attached to the screen anymore. There's another 5 screws surrounding the top loudspeaker circuits along with a very sneaky little guy tucked up inside of the frame. Kind of annoying but Apple's been doing this kind of thing since day 1. With the loudspeaker out we can check it for balls. And unfortunately there doesn't appear to be any. Now Apple is usually about 5 years behind the curve when it comes to new developments, and we only recently started seeing balls inside of most smartphone speakers. So I bet Apple will invent sound dampening in about 2 more years. They'll probably call it the iBalls or something. The motherboard is released as well at this point. Crazy that the entire brains of the phone is about the same size as a finger. It's double stacked and has more power than the computer NASA used to go to the moon. But yet, all we do nowadays is scroll 15 second TicToks. Our ancestors are probably super proud. My iPhone 14 still has a SIM card tray since it's an international model. And up to this point, the iPhone 14 is pretty reasonable. Yeah, we've seen a lot of different types of screws and a bit of a complex layout, but what we've seen so far is nothing compared to what lies ahead in the charging port. Every other company usually has about 3 or 4 screws to hold down the bottom boards. Apple uses 15, and it's not even a board, it's just a ribbon. I wouldn't recommend diving this deep to anyone. The happiness we experienced with the back panel is all gone now. We have gone far too deep. It's like the dwarves in Morya expecting a Balrog to pop out at any moment, and these aren't even regular screws either. Yeah, we have Phllips, tri-point, and standoff, and even long screws tacking the lightning port to the inner wall. It's like Steve Jobs once said screw it and a designer drew this up as a joke. And then they left it in the final version of the phone as a memorial. There's literally no other reason. Now that we have the completely housing I'm pretty happy with the changes Apple has made this year. Yeah, the charging port's annoying and a lot of parts could have been streamlined both for manufacturing and repairability, but it's not that bad. Definitely not as bad as it used to be. I would imagine that the people out there with a cracked back glass outnumber the people with a broken charging port like 500 to 1. So while the internal design is more chaotic than we normally see in a smartphone, at least the parts that are most often broken are now easy to fix. I think the iPhone 14 screen and back glass are now even more repariable than on most Android phones, which is something I never thought I would say. However, Apple does have a history of software locking individual parts to the phone, which is annoying. Imagine your car locking you out if you replace the windshield wipers. Same situation. But even with that, the iPhone 14 is for sure a step in the right direction. And in my opinion, it's the better of the two iPhones released this year. Did I have some screws left over? Maybe. But at least the screen is happy that it's almost put back together. With the two silver brackets back in place to your surprise as well as mine, the new iPhone 14 from Apple is completely reassembled and fully functional. The screen repairs...easy. The back glass repairs...easy. The rest of the phone? Well let's just focus on the positive. Nice work, Apple. As always, the easier way to see the insides of your phone is with one of my Teardown Skins. You get to see all the screws without voiding any warranties. I'll leave a link down in the description. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And huge thanks to Ridge wallets for sponsoring this video. I'm a fan. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Apple",
        "back glass",
        "back",
        "phone",
        "screws",
        "screen",
        "glass",
        "iPhone",
        "iPhone back glass",
        "Ridge wallet",
        "wallet",
        "Ridge",
        "camera",
        "screen repairs",
        "back panel",
        "years",
        "back glass repairs",
        "Burnt Titanium",
        "wallets",
        "parts"
    ],
    "transcript_entity_values": [
        "Burnt Titanium",
        "Google",
        "Jerry Rig Knife",
        "45 days",
        "iPhone",
        "Teardown Skins",
        "RFID",
        "Ridge",
        "9",
        "8",
        "a decade",
        "10%",
        "Lego",
        "the year",
        "15",
        "about 5 years",
        "Instagram",
        "iBalls",
        "Twitter",
        "two",
        "20",
        "NASA",
        "Phllips",
        "three",
        "one",
        "1",
        "169",
        "4 years",
        "Balrog",
        "12 megapixel",
        "about 3",
        "the past 4 years",
        "6 years",
        "4",
        "zero",
        "several years running now",
        "Morya",
        "around $20",
        "Linus",
        "this year",
        "USA",
        "5",
        "Apple",
        "iPhones",
        "500",
        "first",
        "second",
        "500",
        "Steve Jobs",
        "Samsung",
        "today",
        "up to 12",
        "12",
        "Today",
        "Android",
        "30",
        "YouTube",
        "14",
        "the day",
        "Japan",
        "about 2 more years"
    ],
    "transcript_entity_types": [
        "FAC",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "MONEY",
        "PERSON",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE"
    ],
    "vector": [
        -0.14345122873783112,
        0.11700494587421417,
        0.09956827014684677,
        -0.010813266038894653,
        -0.006391816306859255,
        -0.06414955854415894,
        0.11290628463029861,
        0.036082424223423004,
        0.010307108983397484,
        0.019856847822666168,
        0.08804691582918167,
        0.003859525313600898,
        0.0054162354208528996,
        0.059130746871232986,
        -0.017332756891846657,
        -0.04059915989637375,
        0.05332401767373085,
        -0.035048916935920715,
        -0.06519915163516998,
        0.10590308904647827,
        0.004446369595825672,
        -0.017763977870345116,
        0.036954332143068314,
        -0.05601072683930397,
        0.03999345749616623,
        0.048831358551979065,
        -0.030233245342969894,
        -0.04570986330509186,
        -0.06801377236843109,
        -0.07363782078027725,
        0.03922613710165024,
        0.043823640793561935,
        -0.0383312925696373,
        0.05771540477871895,
        0.029860787093639374,
        -0.031848300248384476,
        0.03569452837109566,
        0.06251184642314911,
        -0.022498393431305885,
        -0.03210097551345825,
        -0.04317522048950195,
        -0.026551401242613792,
        -0.025956392288208008,
        0.05602920800447464,
        0.008491909131407738,
        -0.015757393091917038,
        0.06907506287097931,
        0.011970008723437786,
        -0.001685848692432046,
        -0.018133535981178284,
        -0.01601158268749714,
        0.03279966115951538,
        0.0504922941327095,
        -0.00103843305259943,
        -0.0393599309027195,
        0.031023219227790833,
        0.004815953318029642,
        0.009122923947870731,
        0.03221273422241211,
        0.054040469229221344,
        0.06386595219373703,
        -0.0044501470401883125,
        -0.03221675008535385,
        0.07332798838615417,
        0.009914531372487545,
        -0.03287820518016815,
        0.024152228608727455,
        -0.06835436075925827,
        -0.03741069883108139,
        0.04416440427303314,
        0.02195671945810318,
        -0.021019862964749336,
        0.028713859617710114,
        -0.03451152518391609,
        0.029887737706303596,
        0.021924488246440887,
        0.042003221809864044,
        -0.011548232287168503,
        -0.09775790572166443,
        0.07825346291065216,
        0.044132791459560394,
        -0.025275766849517822,
        0.010448860004544258,
        0.009386126883327961,
        -0.02822761796414852,
        0.0031152423471212387,
        0.006761705968528986,
        0.03927019611001015,
        -0.05672062933444977,
        -0.060042478144168854,
        0.004253480117768049,
        0.1138218343257904,
        0.007257547229528427,
        -0.00034649978624656796,
        0.02052116207778454,
        -0.024168072268366814,
        -0.07040733844041824,
        -0.058830633759498596,
        -0.11089419573545456,
        0.04658511281013489,
        0.012622864916920662,
        0.003740505315363407,
        0.027412161231040955,
        -0.04647679626941681,
        0.04821236804127693,
        -0.07088985294103622,
        -0.08621420711278915,
        -0.04584979638457298,
        0.05841708555817604,
        0.050883710384368896,
        0.012913077138364315,
        0.03889636695384979,
        -0.021783284842967987,
        0.023817142471671104,
        0.01652986742556095,
        -0.008405443280935287,
        -0.07245305180549622,
        0.10843726247549057,
        0.1732778400182724,
        0.03676249831914902,
        0.0379909910261631,
        0.04301195219159126,
        -0.06730054318904877,
        -0.03597623109817505,
        0.023266887292265892,
        -0.00438803480938077,
        -0.039814483374357224,
        1.3236498935445861e-33,
        0.04479258507490158,
        0.16002540290355682,
        -0.01391368918120861,
        0.008608286269009113,
        -0.0032042735256254673,
        -0.05402519553899765,
        0.02227725088596344,
        0.03548571467399597,
        -0.032578304409980774,
        0.04351796209812164,
        -0.0027009518817067146,
        -0.01939944177865982,
        -0.054033685475587845,
        0.029268309473991394,
        0.012409749440848827,
        -0.03716591000556946,
        -0.08003491908311844,
        -0.07388530671596527,
        -0.033227141946554184,
        -0.022973090410232544,
        -0.0545041561126709,
        -0.055950358510017395,
        -0.018798736855387688,
        0.011004000902175903,
        0.017194386571645737,
        0.07487527281045914,
        0.06064147129654884,
        -0.014771201647818089,
        0.026546627283096313,
        0.022636406123638153,
        -0.1369573026895523,
        0.020768428221344948,
        -0.002414014656096697,
        0.029333528131246567,
        -0.08485247939825058,
        0.022830968722701073,
        0.006575426552444696,
        -0.08872312307357788,
        0.0215507410466671,
        -0.03159207105636597,
        -0.11602136492729187,
        0.014840904623270035,
        0.014863279648125172,
        0.0049870931543409824,
        0.022300805896520615,
        0.014903807081282139,
        -0.001035185414366424,
        0.027162497863173485,
        -0.012648508884012699,
        -0.03772861510515213,
        -0.025238288566470146,
        -0.041222766041755676,
        0.07141874730587006,
        -0.041749462485313416,
        -0.13538521528244019,
        -0.035342440009117126,
        0.05130881816148758,
        -0.0610014870762825,
        0.05001116916537285,
        0.0692519098520279,
        0.041354719549417496,
        0.003927233163267374,
        -0.056455858051776886,
        0.029363907873630524,
        -0.08015748113393784,
        0.011082889512181282,
        -0.04110125079751015,
        0.017026271671056747,
        -0.06482154130935669,
        0.0331866480410099,
        -0.0446348562836647,
        0.04063079506158829,
        0.017792778089642525,
        -0.04182441160082817,
        0.0008275991422124207,
        0.02203049696981907,
        0.0017066795844584703,
        0.017478864639997482,
        0.04348982498049736,
        -0.06079420819878578,
        0.0017508879536762834,
        0.0067751044407486916,
        0.058501530438661575,
        -0.04042201489210129,
        0.04500320553779602,
        -0.03651455417275429,
        -0.022550415247678757,
        -0.13517415523529053,
        0.006583495065569878,
        0.04851306974887848,
        -0.058180008083581924,
        -0.05167964845895767,
        -0.01516488566994667,
        -0.037932831794023514,
        -0.006350502837449312,
        -4.572394212132363e-33,
        -0.004628236871212721,
        -0.07030890136957169,
        0.02379954420030117,
        -0.0037263042759150267,
        0.0474197119474411,
        -0.0718473345041275,
        0.019038986414670944,
        0.12198635935783386,
        -0.01998998038470745,
        -0.061990074813365936,
        -0.028529614210128784,
        0.05739223584532738,
        0.006060269195586443,
        -0.01466167438775301,
        0.008361587300896645,
        -0.01813376508653164,
        0.004996788688004017,
        -0.05855624005198479,
        0.025420892983675003,
        0.00453347060829401,
        0.016798771917819977,
        0.04643690213561058,
        0.013290662318468094,
        0.0793343111872673,
        -0.053426701575517654,
        -0.04275224357843399,
        0.031058814376592636,
        -0.03513973951339722,
        0.02311747707426548,
        -0.00026512416661717,
        -0.0062284707091748714,
        -0.15637832880020142,
        -0.009706626646220684,
        0.08005968481302261,
        0.02483300305902958,
        0.0815431997179985,
        -0.023511620238423347,
        -0.018336955457925797,
        -0.04465838894248009,
        -0.116460420191288,
        0.028143733739852905,
        0.03277118131518364,
        -0.036979347467422485,
        0.01830555684864521,
        -0.004066703375428915,
        -0.041009556502103806,
        -0.022109180688858032,
        -0.03646091744303703,
        -0.04662681370973587,
        0.02657519280910492,
        -0.006286995951086283,
        0.006948232185095549,
        -0.02047700062394142,
        -0.014234485104680061,
        -0.13431425392627716,
        0.053458984941244125,
        0.07275670766830444,
        -0.041212502866983414,
        0.006884012836962938,
        -0.009896920062601566,
        0.04915250092744827,
        0.05452832579612732,
        0.027791816741228104,
        0.001984233967959881,
        -0.04545103386044502,
        -0.04883934184908867,
        0.006256327964365482,
        0.006029639393091202,
        -0.05368954688310623,
        0.04872117564082146,
        -0.038309503346681595,
        -0.019212590530514717,
        -0.028368622064590454,
        -0.061566054821014404,
        0.04134591296315193,
        0.05407922714948654,
        -0.010061630979180336,
        -0.04322269558906555,
        -0.13121311366558075,
        -0.02675570733845234,
        0.05793934315443039,
        0.00593939796090126,
        0.007350541651248932,
        0.029183143749833107,
        0.08106748759746552,
        -0.0051809633150696754,
        0.04783240705728531,
        0.03106588125228882,
        -0.07488016039133072,
        0.05768601596355438,
        -0.06300830841064453,
        0.031768638640642166,
        -0.008030838333070278,
        0.11454374343156815,
        -0.035743359476327896,
        -5.362000621289553e-08,
        0.005351904779672623,
        0.035576727241277695,
        0.013313856907188892,
        -0.07335861027240753,
        0.019447989761829376,
        -0.0028375559486448765,
        0.015822937712073326,
        -0.03538323566317558,
        0.024738121777772903,
        -0.07860513031482697,
        -0.04123598709702492,
        -0.03562500327825546,
        -0.05846428871154785,
        0.14771278202533722,
        -0.049850624054670334,
        0.06471250206232071,
        -0.025997402146458626,
        0.036348044872283936,
        -0.010505531914532185,
        -0.005888820625841618,
        -0.07028906047344208,
        0.016293376684188843,
        0.07159537076950073,
        -0.011790521442890167,
        0.0299418643116951,
        0.06493527442216873,
        -0.09257139265537262,
        0.056066080927848816,
        0.019966071471571922,
        0.0351460836827755,
        -0.03270120546221733,
        -0.03464139625430107,
        -0.037190187722444534,
        0.03773803636431694,
        -0.0649634376168251,
        -0.028927896171808243,
        -0.02117096073925495,
        -0.026867415755987167,
        0.10556252300739288,
        -0.00926113873720169,
        -0.010716970078647137,
        -0.08823002874851227,
        0.00799591839313507,
        0.07506346702575684,
        -0.01906750537455082,
        -0.09792465716600418,
        0.011337877251207829,
        -0.12165690958499908,
        0.002229356672614813,
        0.07066049426794052,
        -0.004629585426300764,
        -0.07245689630508423,
        -0.05963374674320221,
        -0.024368561804294586,
        0.10167498141527176,
        -0.016438188031315804,
        0.004387516062706709,
        0.011933614499866962,
        0.02047945000231266,
        0.007335028611123562,
        0.06183285638689995,
        -0.07896164804697037,
        0.01994592696428299,
        0.07871043682098389
    ]
}