{
    "id": "ne1deciumRI",
    "title": "The EV you can't buy... even if you wanted to.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-03-24T14:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=ne1deciumRI",
    "category": "Howto & Style",
    "tags": [
        "Hummer EV SUV",
        "Hummer EV",
        "Electric Hummer",
        "Hummer conversion",
        "off road EV",
        "Hummer Truck",
        "Humvee",
        "HMMWV",
        "Cybertruck",
        "tesla",
        "ford lightning",
        "best hummer suv",
        "Electric SUV"
    ],
    "views": 651068,
    "likes": 24853,
    "comments_count": 1135,
    "description": "Like nothing else on Earth - the HUMMER EV SUV is here! (For a few lucky people anyway.) Check out Dan's video:   Reservations are closed! With no sign of opening in the near future. Would you buy a Hummer EV if you could? Let me know.   Watch all the EV Humvee build videos in order HERE:    Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/fBfZUsFoOcE",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "As you know, Hummers have a special place in my heart. Behind me is Hummer's all-new EV SUV. The fully enclosed version of the Hummer truck and today we get to take an in-depth look at it. It's the one EV that you cannot buy even if you wanted to. If you came up to GM with $100,000 in cash they would not sell you one. I have a lot of thoughts though. Let's get started. [Intro] I was told that California's normally a sunny place, but we have not found that to be the case today. Everything is so wet, but that just makes this vehicle all the cooler. This is not your typical EV and this is not a typical California day so it's the perfect pair. I have quite a lot of experience with EV's and Dan here has even more experience than me. How long have you guys been all-electric? -We bought a Nissan Leaf in 2015. And then a year later we bought our first used Tesla...so however many years that is. -A long time...and I've had a Rivian R1T, the truck, for the past year or so. And driving this is a whole different experience. So we found a road closed that's flooded through that's perfect for the Hummer review. Now only do we have ground clearance but it's good for waterfording up to 32 inches. How we looking? -Great! -How deep is it? -Whoa! [Laughing] -[Zack] Easy. Wow. That's so cool! Woo! Yeah, you might be worried, like people at first glance be like 'oh yeah, batteries and water don't go together', but with the whole battery pack being completely watertight there is really nothing that could get damaged by the water. And we're pretty high off the ground anyway. -This is deeper water right here. Whoa! It's coming in! Oh no! [Laughing] -I brought my handy-dandy tape measure. -Never leave home without it. -I thought it might be up to the door but it's not that bad actually. Oh, this is not even impressive. It's like 6 inches. -What?! Well, measure it. You got a tape measure, I mean you might as well see. -We are at 5 inches of water right now. -[Laughing] Wow! -Which is like what? One sixth of what it can actually handle. I mean if you count the splash though we had a good probably 10 feet of splash on there, so... -Oh here comes the mailman. He's going for it. -Shown up by a mail truck? He's only got two windshield wipers. I don't know if he can handle this. [Laughing] You're going to do it? -[Maillady] I'm going to face it! -[Zack] Good luck! [Laughing] -[Dan] It makes the Hummer look not as impressive as the mail truck. [Laughing] -[Zack] That's funny! One thing that would make the Hummer EV SUV an insta-buy is if it had bi-directional charging like the Ford Lightning. With the Hummers' 212 kilowatt hour battery pack, it could power the average American home for 7 whole days, maybe even a month with some conserving. But let's be honest, Americans don't know what that word means. Unfortunately though, while the SUV can charge up other electric vehicles, it does not have the ability to power a home...for now. Right now we're driving on Lombard Street in San Francisco which is the crookedest street in the entire world and you would think with a vehicle as big as this Hummer EV SUV we would struggle, but the coolest part of this vehicle is that it can steer on both the front and rear tires giving us a turning diameter of 35 feet which might not sound like a lot, but my Rivian has a turning radius of 45 feet, meaning that this Hummer can turn a circle inside of the circle that my Rivian turns. It's pretty awesome how sharp and how agile a vehicle this big really is. Also, for reference, this turns sharper than a Toyota Tacoma. You can hear the wheels kind of squeaking in the back. Easy. That's amazing. But yeah, even though I do see people driving this around in the city, personally I don't feel comfortable with a machine this large on tiny roads. Even though we weigh 9,000 pounds we still have a 0-60 of 3.5 seconds which is just mind blowing. And costing $110,000, it is going to take a special person to buy this vehicle. This is probably the heaviest street legal vehicle that you can drive with a regular license. I've spent a lot of time with the Hummer EV and the Hummer EV SUV...it is super windy...let's go inside the truck. Wow. So I've spent a lot of time with the Hummer EV and the Hummer SUV, and I've built my own electric Hummer myself so I have quite a lot of thoughts about this. Is it the coolest vehicle ever? Quite possibly. The stance is amazing. The sunroof is amazing. The quad wheel turning is amazing. From an aesthetic perspective I think the Hummer line of trucks is perfect. However, from a useful daily driver perspective, not quite so much. The SUV is massive and even though it's 9 inches shorter than the truck version it's still so wide that it fills up an entire lane and the pure presence of the vehicle is crazy. Going up and down the hills here in San Francisco, as you crest the top of the hill you can't see anything at the top because the hood is so high up off the ground and the whole thing is like a giant box. It looks amazing from the outside, but from the inside driving it is a different experience. I've already shown off the interior on the Hummer truck video we made so I'll let you watch that to see more. Basically the SUV is the exact same as the truck, just 9 inches shorter. If you're looking for an SUV though I might recommend the Rivian R1S which has about the same range, same abilities, and same features for $30,000 less. Except for that one's not available for purchase either. It's easy to make a purchasing decision when both of them are not available for purchase. The reason you can't order a Hummer EV anymore is because they ran out of reservation slots. GM has limited the amount of reservations that they're accepting and there's no official word on when they will be accepting reservations again. Dan's coming back. -It's so windy out there. -So what do you think, man? What do you think of the truck? -I mean, it's fun. It's definitely fun to drive. Would I get it for my family? Range is a big thing for me and this has around 300 miles range. My car gets 400 miles of range. The range is a little tough, especially if you're going to go on road trips. If you ever want to do road trips..like we went and saw the Golden Gate Bridge today, it was beautiful. I love going to the National Parks. So if it's something that you're not going to be taking on a lot of road trips and it's just around town, it could be a really good car. So I don't want to sound like I'm totally against it, it's just maybe not the best road trip car. I do like the car. It is fun. -Fun would be the right adjective for it. One really cool thing that Hummer is doing though is they probably have the most futuristic charging setup where the battery pack voltage can be charged at 800 volts, meaning it can charge super, super quick with the right charger...meaning that this vehicle can get about 100 miles of range in about 14 minutes. But that specific charger doesn't really exist at the moment in the wild so it's not really able to be utilized on road trips like Dan was talking about. There's not really one vehicle that's good at absolutely everything. And GM probably knows all of this stuff. They didn't invent the Hummer back in the day to be a commuter vehicle. It was invented because it's massive and it has its prowess, it has its importance, it has its presence on the road. And I think this Hummer EV SUV lives up to the Hummer legacy. And for me, I'm really excited about it. While I personally already have a Hummer and I'm not looking for another one...I can't even buy this one anyway at the moment. So it all works out in the end. If you have any questions leave them down in the comments. Come hang out with me on Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Hummer",
        "SUV",
        "vehicle",
        "Hummer truck",
        "Hummer EV SUV",
        "Hummer SUV",
        "truck",
        "lot",
        "road",
        "range",
        "Rivian",
        "Hummer allnew",
        "Hummer truck video",
        "inches",
        "good",
        "amazing",
        "Hummer back",
        "road trips",
        "experience",
        "electric Hummer"
    ],
    "transcript_entity_values": [
        "400 miles",
        "0-60",
        "the Hummer EV",
        "a year later",
        "35 feet",
        "the National Parks",
        "Rivian",
        "5 inches",
        "6 inches",
        "GM",
        "Tacoma",
        "Hummer",
        "San Francisco",
        "2015",
        "-Which",
        "9 inches",
        "Instagram",
        "California",
        "two",
        "Hummers",
        "about 100 miles",
        "100,000",
        "American",
        "32 inches",
        "45 feet",
        "Rivian R1",
        "110,000",
        "7 whole days",
        "Toyota",
        "the past year",
        "10 feet",
        "Americans",
        "EV",
        "9,000 pounds",
        "daily",
        "about 14 minutes",
        "One sixth",
        "Tesla",
        "first",
        "just 9 inches",
        "Hummers",
        "30,000",
        "today",
        "around 300 miles",
        "Dan",
        "One",
        "Lombard Street",
        "800 volts",
        "one",
        "a month",
        "the day",
        "the Golden Gate Bridge"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "NORP",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "GPE",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "NORP",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "NORP",
        "ORG",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "FAC"
    ],
    "vector": [
        -0.02836601808667183,
        0.07089576125144958,
        0.003596553346142173,
        -0.11520284414291382,
        0.07409975677728653,
        -0.020182058215141296,
        0.054154641926288605,
        0.03198744356632233,
        -0.008296765387058258,
        0.05737562105059624,
        0.08990680426359177,
        -0.005173036828637123,
        -0.01849989965558052,
        0.014512716792523861,
        -0.0017918605590239167,
        -0.02124197594821453,
        0.03833485394716263,
        -0.04165191203355789,
        -0.04066403582692146,
        0.11328796297311783,
        0.012158652767539024,
        0.04213942587375641,
        0.04411998763680458,
        -0.01822763681411743,
        -0.06242669001221657,
        0.010030711069703102,
        -0.02046014927327633,
        0.10126335173845291,
        -0.05708710476756096,
        -0.10869599133729935,
        0.07496574521064758,
        -0.019058912992477417,
        -0.009069208987057209,
        -0.03192298486828804,
        0.05854346975684166,
        0.0003608263796195388,
        0.03299952670931816,
        -0.030799172818660736,
        -0.037261709570884705,
        -0.023240825161337852,
        -0.01590716652572155,
        -0.11253298819065094,
        0.006164484657347202,
        -0.10961994528770447,
        -0.06356453150510788,
        -0.008578186854720116,
        0.10511776804924011,
        -0.11826805025339127,
        0.09556511789560318,
        0.0003281017707195133,
        -0.05235260725021362,
        -0.039949581027030945,
        0.04128234460949898,
        -0.04314511641860008,
        -0.028689110651612282,
        -0.015891479328274727,
        0.005889028310775757,
        -0.035794444382190704,
        -0.03692050650715828,
        -0.06271589547395706,
        0.003910936415195465,
        -0.006421861704438925,
        -0.029260708019137383,
        0.0504552498459816,
        -0.0018635275773704052,
        -0.07029616087675095,
        0.059653390198946,
        -0.06595201790332794,
        -0.07194021344184875,
        -0.000982419471256435,
        -0.057511020451784134,
        -0.05619264766573906,
        -0.06751764565706253,
        -0.03305676579475403,
        -0.03141671046614647,
        0.07535108178853989,
        0.07978391647338867,
        -0.07370255142450333,
        0.02829219400882721,
        0.0019952571019530296,
        0.012964070774614811,
        -0.009595739655196667,
        -0.0130640072748065,
        -0.03609168902039528,
        -0.06780994683504105,
        0.08513584733009338,
        0.024127813056111336,
        0.07585790753364563,
        -0.025371002033352852,
        0.02062338963150978,
        -0.029706675559282303,
        -0.03338726609945297,
        -0.012638832442462444,
        0.048557382076978683,
        0.06032082810997963,
        -0.035145677626132965,
        -0.04513669013977051,
        -0.0894547775387764,
        0.0027519871946424246,
        0.05244244635105133,
        0.03607635945081711,
        -0.05804252624511719,
        -0.0007546431152150035,
        -0.0853201150894165,
        -0.0627245306968689,
        -0.03217693418264389,
        -0.03827833756804466,
        0.026129717007279396,
        -0.007023531943559647,
        -0.02412162721157074,
        -0.06666067987680435,
        0.04542626067996025,
        -0.07430063933134079,
        0.012167687527835369,
        0.005578766576945782,
        0.020293759182095528,
        -0.1023118644952774,
        0.08700811117887497,
        0.04900258779525757,
        -0.01622459478676319,
        0.06984533369541168,
        -0.032038167119026184,
        0.07224217057228088,
        0.07763625681400299,
        0.10704168677330017,
        -0.039708737283945084,
        -0.002397428499534726,
        3.0831905411183465e-33,
        -0.05458107590675354,
        0.058278944343328476,
        0.01914997026324272,
        -0.0006904328474774957,
        0.0015103287296369672,
        0.06751275807619095,
        -0.0066488878801465034,
        0.06373162567615509,
        -0.03204324468970299,
        0.06494191288948059,
        0.01064981333911419,
        0.02303875982761383,
        0.002498229965567589,
        0.006890076212584972,
        0.026972830295562744,
        -0.0051707010716199875,
        -0.05706667900085449,
        -0.013908574357628822,
        -0.0791233628988266,
        -0.08231896907091141,
        -0.024444598704576492,
        -0.04104835167527199,
        0.07117196172475815,
        0.09883975237607956,
        0.046301960945129395,
        0.00987972691655159,
        0.09041393548250198,
        -0.04503459110856056,
        0.07370521128177643,
        0.04208103567361832,
        -0.06356138736009598,
        0.015004594810307026,
        0.056265056133270264,
        -0.02219412289559841,
        -0.019781531766057014,
        0.04994875192642212,
        -0.1486164778470993,
        -0.07085521519184113,
        -0.143680602312088,
        -0.014134395867586136,
        0.04996177926659584,
        -0.01028642151504755,
        -0.06326518207788467,
        0.0049775103107094765,
        0.02080688439309597,
        -0.01682249642908573,
        0.05066097527742386,
        -0.016498200595378876,
        -0.0325314998626709,
        0.06514903157949448,
        -0.016624877229332924,
        -0.06352806836366653,
        0.007623661775141954,
        -0.08667803555727005,
        -0.05934993922710419,
        0.01960456743836403,
        -0.004567141644656658,
        -0.008850695565342903,
        -0.004311266355216503,
        -0.051798440515995026,
        -0.06105280667543411,
        0.03548702225089073,
        0.03520186245441437,
        -0.044789087027311325,
        -0.04699922725558281,
        0.00989559106528759,
        0.05037551745772362,
        -0.014402907341718674,
        -0.025503138080239296,
        0.07305842638015747,
        0.026360660791397095,
        0.008809752762317657,
        0.03253362700343132,
        -0.04472605511546135,
        0.03711282089352608,
        0.027996042743325233,
        -0.1096828281879425,
        0.03129427134990692,
        0.059494465589523315,
        -0.018226077780127525,
        -0.09200768172740936,
        0.06761515885591507,
        0.040940333157777786,
        0.05926066264510155,
        0.04006105661392212,
        -0.05296535789966583,
        -0.03521072864532471,
        0.0465865321457386,
        0.026192789897322655,
        0.026346608996391296,
        0.014759545214474201,
        -0.03203101456165314,
        -0.09747882187366486,
        -0.051831163465976715,
        -0.03942359983921051,
        -5.701734613979536e-33,
        -0.0067632850259542465,
        0.0330471470952034,
        -0.031389281153678894,
        0.023549487814307213,
        0.09200408309698105,
        -0.017562268301844597,
        0.07262047380208969,
        0.09050004929304123,
        0.038964979350566864,
        -0.08420189470052719,
        -0.07276564836502075,
        0.032306745648384094,
        -0.028839105740189552,
        -0.03150290250778198,
        0.061977967619895935,
        -0.01846940815448761,
        -0.0525616779923439,
        -0.07912560552358627,
        0.028689373284578323,
        0.04102737829089165,
        0.039241235703229904,
        0.05179791897535324,
        0.0961356982588768,
        0.05191564932465553,
        0.0295127984136343,
        -0.010040627792477608,
        -0.018866991624236107,
        0.015771174803376198,
        0.035022709518671036,
        -0.030458293855190277,
        -0.026159174740314484,
        -0.0002566167095210403,
        0.023726049810647964,
        0.023639120161533356,
        -0.0008521403069607913,
        0.006506246514618397,
        0.05147002264857292,
        -0.030574863776564598,
        -0.030017534270882607,
        -0.04828667268157005,
        -0.04654167219996452,
        0.04025553911924362,
        0.021227385848760605,
        -0.04843764007091522,
        0.0007884653750807047,
        -0.09294235706329346,
        0.005128338932991028,
        -0.01109106931835413,
        0.026765918359160423,
        0.06267505884170532,
        -0.016740385442972183,
        -0.004225811455398798,
        0.06674827635288239,
        -0.00263777282088995,
        0.005213857162743807,
        -0.03935413062572479,
        0.019557708874344826,
        -0.02974880300462246,
        0.0006298415246419609,
        0.05439767241477966,
        0.032300349324941635,
        0.04684165492653847,
        -0.020161157473921776,
        -0.0014244805788621306,
        -0.019808454439044,
        -0.053308453410863876,
        0.02748679555952549,
        -0.023346316069364548,
        -0.05055085942149162,
        0.0010586365824565291,
        0.061772096902132034,
        -0.039234310388565063,
        0.012965605594217777,
        -0.10541975498199463,
        0.0019791843369603157,
        -0.01610753685235977,
        0.02884664572775364,
        0.0029477039352059364,
        0.07760579138994217,
        -0.0832585021853447,
        0.003394810017198324,
        -0.023044509813189507,
        0.032705675810575485,
        0.1168975755572319,
        0.11044016480445862,
        0.07645925134420395,
        -0.007108461111783981,
        -0.003159938845783472,
        -0.006789275445044041,
        0.05747286230325699,
        -0.02776774950325489,
        0.0731433853507042,
        0.025688571855425835,
        0.09409584850072861,
        -0.00565217575058341,
        -6.103326910533724e-08,
        0.030670886859297752,
        0.06052442267537117,
        0.0495331771671772,
        -0.010921692475676537,
        0.0748269185423851,
        0.025106700137257576,
        -0.0027043467853218317,
        0.012364184483885765,
        -0.013224022462964058,
        0.009431054815649986,
        0.05274774506688118,
        -0.07619965821504593,
        0.04613504558801651,
        0.06222865730524063,
        -0.0749506950378418,
        -0.002320677973330021,
        -0.017207646742463112,
        0.058491118252277374,
        -0.06275231391191483,
        -0.021057266741991043,
        -0.0881110206246376,
        -0.012622310779988766,
        0.0069599635899066925,
        -0.008680552244186401,
        -0.004020635038614273,
        0.023577667772769928,
        -0.058895543217659,
        -0.05666356533765793,
        0.05776524171233177,
        -0.010352209210395813,
        -0.04825460910797119,
        0.015546136535704136,
        0.03322168067097664,
        -0.019625717774033546,
        -0.06926770508289337,
        -0.08503475040197372,
        -0.06096813082695007,
        -0.019235195592045784,
        0.05046209692955017,
        0.03041786141693592,
        0.04027780145406723,
        -0.05922505259513855,
        0.0428425632417202,
        -0.02192678116261959,
        -0.039701055735349655,
        0.04625004529953003,
        -0.05126502364873886,
        -0.17819572985172272,
        -0.10086874663829803,
        0.05531267076730728,
        -0.012453957460820675,
        -0.050966884940862656,
        -0.07954873889684677,
        0.06138276308774948,
        0.036803048104047775,
        0.039868976920843124,
        0.05486217513680458,
        -0.0340164378285408,
        0.02348424680531025,
        -0.005188356153666973,
        0.056192368268966675,
        -0.04307665303349495,
        -0.033807288855314255,
        0.03486759960651398
    ]
}