{
    "id": "NE5H5intsck",
    "title": "Google Pixel 7/Pro Review: Hard Problems? Software Answers!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-10-12T17:00:29Z",
    "video_url": "https://www.youtube.com/watch?v=NE5H5intsck",
    "category": "Science & Technology",
    "tags": [
        "Pixel 7",
        "Googel Pixel 7",
        "Pixel 7 Pro",
        "Pixel 7 review",
        "MKBHD"
    ],
    "views": 4913368,
    "likes": 152781,
    "comments_count": 6533,
    "description": "Pixel 7 and Pixel 7 Pro are the smartest phones in the room. How far can that take them?  Skin your Google Pixel 7 and 7 Pro at  The hoodie!   Get the Google Pixel 7 Pro at   Get the Google Pixel 7 at    Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Phone provided by Google for review.  ~",
    "description_links": [
        "https://dbrand.com/pixel7",
        "https://MKBHD.com",
        "https://geni.us/EM7Pt22",
        "https://geni.us/xC8XD",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - All right, Pixel 7s, 7 and 7 Pro. I've been using these phones for about a week now, and yes, they are very similar to last year. They're the same prices too. But more than ever this year, and you can see it at every corner, the Pixel's special is software solutions to hardware problems. And this is in contrast to say, the Samsung or the Xiaomi special, which is throw as much raw hardware horsepower at the thing as possible. There's just no way that isn't better than before. And there's nothing right or wrong with either of these approaches. Matter of fact, as a tech-head, you can kind of appreciate both. But there is just a little bit of a magic to the software way, at least when it works. So yeah, I can definitely appreciate the slightly updated hardware on the outside of the Pixel. Because even though it isn't super important to the Google mission, it's still important to the users. So initially with my very first hands-on, I didn't love it, but it's kind of growing on me. The main change here being the metal camera bar instead of the all-glass visor from last year. It lets them do some interesting stuff with the colors, but most importantly, lets them make it all one piece of metal, all the way around, with the frame of the rest of the phone. It's polished aluminum on the Pro, and matte aluminum on the Pixel 7. Then both phones also get brighter displays, up to 1,500 nits peak on the 7 Pro, and 1,400 knits on the regular Pixel 7. Can't fake that with software. And then the 7 Pro display is larger, slightly curved over the edges. And a generally better-looking display with less off-axis rainbowing. But interestingly, it's set to 1080p out-the-box by default, even though it's a 1440p panel. I immediately switch that to 1440, and have had no battery issues. So I recommend doing that. Matter of fact, might as well just say it right off the top. I have had great battery experiences with these phones. I've been mostly dailying the 7 Pro. David at the studio's been dailying the 7. And yeah, they've been excellent. Like just this morning, today, drove into the studio, had an hour-long commute with Waze on, full brightness, GPS, streaming Spotify audio through Bluetooth to the car. Got here with like 85% battery left. And I'm consistently ending days with 30 to 40%. Six to 7 hours is not a problem. Yeah, I've had very good battery life on these phones. Very impressive. That's a combination of software optimization better modems, just better chip overall. But speaking of chips, inside the phone, there are very few new specs, but the new second generation Tensor G2 from Google is one of 'em. There's also a little bit extra RAM on the Pro phone. It does benchmark a bit higher than the first Tensor, but in terms of raw power, it's right in line with the Snapdragon 865, fine. But just like I talked about in the problem with benchmarks video, which you can watch here if you haven't seen it already, Google is optimizing this Tensor G2 chip to work more efficiently specifically with its AI stuff, it's AI magic. So while, yeah, the G2 is a little faster than the first Tensor with its smaller 4-nanometer process node, the real improvements are in its machine learning capabilities, which are 60% faster and 20% more efficient than last year. So the things that actually require those AI smarts are dramatically better and faster. So that is where it starts to get interesting. Not to dismiss the slight improvements of the Pixel overall. I mean you can see they even, they painted inside the port and the speakers down here to match the revs of the phone. It's nice, I like it. But that's not what the Pixel is all about. The Pixel is the software. It is the smartest smartphone, and pretty much all of the reasons you'd pick a phone like a Pixel 7 over the rest are in the software. Like for phone calls, for example, Pixel is the only phone with call screening, which to me is still super useful, but it also goes to another level. So when you call a business that has an automated system, the improved Direct my Call feature will surface all the buttons at once so you can press to navigate through an automated system before the robot even finishes saying them. It saves me so much time. I love that. I also like the new home screen search, which still has all the great functionality as before, it's just cleaner and better designed. And then with the new selfie camera, the Pixel has added AI-based face unlock, which is great, but as you can see, it's just a single selfie camera up top here. There's no infrared, depth mapping, or face ID equivalent. So while it's super fast in great conditions, it absolutely struggles as expected when you're in the dark or when you have a mask on. So there's also still an under display fingerprint reader for dual biometric authentication anytime face unlock fails. I will say I was hoping that the fingerprint reader would be one of the things that improved to the Pixel 7 hardware-wise because the one in the 6 was a little bit of a letdown for me. It's not noticeably bigger or faster. It fine, it's not terrible. It's just a slight step behind the ultrasonic ones, which are noticeably faster than this optical one. Oh, also the Recorder app. Most, some people don't even care about this, but the Recorder app is better. It's already the best in the world at doing incredibly fast and accurate speech-to-text. You've seen this before, thanks Tensor. But I got an amazing demo of somebody starting a recording and then putting the phone in their pocket, and we had a full on conversation. They took the phone out of their pocket, and it had perfectly transcribed our entire conversation with speaker labels. So each time the opposite person spoke, it labeled that. Incredibly useful or incredibly creepy depending on who you are. But that's one of the features that's allegedly coming later this year to an update. I'm gonna be using that. And it just definitely feels like anywhere you go on this phone, Google Assistant is waiting right around the corner, waiting to help you out. It was the same with the last Pixel. Android 13 got its improvements with Material You and the under the hood improvements. But just the Google stuff everywhere, the routines, the little reminders, the little chip cards and messages for helpful things you might wanna do to add to a message. There's a lot of good stuff. There's even a new feature called Photo Unblurr. You might have seen the demos. Basically takes any photo in your Pixel 7's library, actually anything in your Google Photos library at all. And if it's a little bit blurry, you hit that unblur button, and it can use AI to identify what the scene should look like and fix the photo, remove the blur. Seems super cool. So okay, after trying this with a bunch of photos, we found that it seems to work best specifically with photos of subjects that are in focus, but the exposure time was too long and so now there's a bit of blur in one direction. In that exact instance, I found it can do a pretty good job of turning a streaky, blurry photo into something much more usable. I wouldn't expect anything magical, but you know, this is pretty cool. It's the definition of using software to solve hardware problems. Also, they do say Pixel 7 exclusive for this feature for now, I don't really buy it. They say it's because of Tensor G2. I give it about a year before this feature is available for more phones, maybe anyone using Google Photos. But hey, for now, gotta have the Pixel 7. But the point is Google is not setting out to make a phone with the absolute best hardware and the best display and the absolute best raw performance. I mean, if they are, they're failing. But Google Pixel is absolutely the smartest smartphone in the room. It's the smartest phone you can get, and it's even more true again this year. Now the Pixel has been known for one other thing, probably as long as anything else, and that's the cameras. And there's an updated suite of cameras on the front and the back of the Pixel 7s this year. So the 50 megapixel primary camera is the same on both, same as last year. The Pro gets a new, even wider ultrawide with autofocus, while the 7 keeps the one from last year. And the Pro also gets a new 5x, 48-megapixel telephoto camera. And as expected, the Pixel 7 and 7 Pro take excellent photos in a variety of different lighting conditions, and they have that very distinct Pixel style, the high dynamic range, contrasty, lots of detail, those shots. This big sensor can create some pretty nice natural depth of field still without using portrait mode. I love that. I know I shouldn't be super impressed that, you know, normal daylight photos look great on the Pixel, but hey, these are really, really good. And then, the new Pro ultrawide does a really good job with macro photography. Doesn't do macro video, but this photo of an ant is really hard to get. And the auto switching to macro mode can be disabled if you're like me, and prefer taking close up photos of things with the main camera. Just beware of minimum focus distance. But then, here's another great example of solving hardware problems with software. The zoom, so the 1x camera, still normal 1x. That's a 50-megapixel main sensor binning down to 12 megapixels. The 2x button is a 12-megapixel crop of the middle of the frame, so a high quality zoom. Then from 2x to 5x, the camera's actually doing some composition. It's adding detail in the middle of the frame from the telephoto camera, and then compositing them together. Then you get to 5X, and it's snapping to the full telephoto camera. That makes perfect sense. Then again, the 10x is taking a 12-megapixel crop of the middle of the telephoto, so another high quality zoom. And it's pretty good. I will say, it's not quite as good as having a dedicated 10x telephoto camera on the back of the phone. Like, having a dedicated camera is always gonna give you the sharper overall image. But for someone like me who only zooms once in a while, the whole Super Res Zoom software solution is very passable as you can see, and then that saves you money. And then you get the zoom stabilization that activates at 15x, and it is really, really stable. Maybe a little too stable sometimes because it kind of makes it hard to track moving objects, which I know you love to do when you're creeping, I mean, bird watching. Anyway, yeah, the Pixel's camera is still top of the heap when it comes to point-and-shoot Android cameras. The shutter speed is super fast. So if you're trying to freeze motion and also capture like an exact moment, this camera's really good at that. The selfie cameras on both are also improved. It's now an 11-megapixel selfie camera. They both do ultrawide selfies now instead of just the Pro. Love that. And video is slightly better too, including 10-bit HDR. Tough to show that in this SDR video, but if you've seen HDR video before, you know where this excels already. Anything with bright, specular highlights loads of dynamic range, et cetera, it's still a step behind the iPhone when it comes to noise levels and autofocus. So for those curious why I still put the iPhone as the overall king of smartphone imagery, that's why. But this is not far behind by any means. Okay, here's a couple other small things that didn't fit into the rest of this review. The speakers on the 7 Pro are slightly louder, but slightly less bassey than the 6 Pro, just a little tinier. So a little less low end for a little bit more vocal clarity. I found that interesting. And then, there's not a whole lot going for sustainability for these phones, other than the metal visor and frame being made with 100% recycled materials. Some pretty specific wording there. But also, the box it comes in which doesn't have a charger, does come with a cable and an adapter and is fully recyclable cardboard. And then a big question, are there bugs? Because my Pixel 6 experience was a roller coaster. I mean, I loved the phone to start, but then, it slowly descended into having more and more bugs until it was like unusable to me, and I stopped using it. Then it got some updates that squashed those bugs, and then I ended up dailying it for like the last two months or so. So are their bugs on the Pixel 7s? Yeah, I have found some. I mean, I had this media player bug where it just shows a blank space where the media player's supposed to be, whether or not there was any media playing. That did go away after reboot. There was also this weird thing where after you hit the X in the Google search bar, that button just disappears, but it's still pressable for some reason. Also, I tried to post the Instagram Story from the Pixel 7 Pro the other day, and it just looked like this for some reason. Honestly, no idea what happened here. Everyone saw it. Apparently, some people thought it was an ad for dbrand's, new Digital Camo. It wasn't. But this is. Hey, if your new metal bar isn't enough, and you want your new Pixel to look even more different from the rest, channel sponsor, dbrand's new skin is pretty sick, and it's a foolproof way to make your phone look unique. Plus, it hopes to hide that dust that sort of naturally accumulates right above and below the camera bar. So link below, of course. Right below that like button. But I've really enjoyed using the Pixel, and that's why it's going in my pocket as my daily driver phone, for now anyway. As far as whether you should get one or not, I think the real question is how much money are you willing to spend? Because same prices as last year, 599, 899. And I think my initial feeling is I still feel the same, which some people got kind of twisted by the way. But the $300 difference between these phones, the Pixel 7 is a way better deal than the 7 Pro. Like they're both well-priced and they're both very competitive, and frankly undercutting most of what they're competing against. But the 7 is just for most people, a no-brainer. So this is the phone I'm gonna be recommending more often. Probably a Value Phone of the Year contender. Again, look, there's a lot of stuff Google didn't do with the Pixels, like they didn't do super fast, 80-watt charging. They didn't do multiple telephoto cameras. It doesn't even fold in half, right? There's a lot of stuff. But for patient Pixel people who prefer pristine programming and pretty pictures, the Pixel Pro is pretty perfect. (bright music)",
    "transcript_keywords": [
        "Pixel",
        "Pro",
        "phone",
        "camera",
        "Google",
        "Pixel Pro",
        "Google Pixel",
        "year",
        "phones",
        "Pixel camera",
        "Google Photos",
        "telephoto camera",
        "software",
        "Photos",
        "Pro phone",
        "Tensor",
        "pretty",
        "super",
        "cameras",
        "good"
    ],
    "transcript_entity_values": [
        "about a week",
        "2x",
        "Pixel 7",
        "just this morning",
        "the Instagram Story",
        "Tensor",
        "half",
        "first",
        "later this year",
        "5X",
        "iPhone",
        "30 to 40%",
        "50",
        "50-megapixel",
        "SDR",
        "about a year",
        "Super Res Zoom",
        "Samsung",
        "12-megapixel",
        "20%",
        "Pixel",
        "Google Photos",
        "599",
        "today",
        "7s",
        "Spotify",
        "the Pixel Pro",
        "one",
        "48-megapixel",
        "David",
        "10",
        "the Pixel 7 Pro",
        "dbrand",
        "Android",
        "the 7 Pro",
        "300",
        "100%",
        "Tensor G2",
        "1x",
        "last year",
        "Tensor",
        "5x",
        "the last two months or so",
        "the 7 Pro",
        "11",
        "7",
        "the Pixel 7",
        "1440",
        "13",
        "Digital Camo",
        "80-watt",
        "this year",
        "Photo Unblurr",
        "the Pixel 7",
        "daily",
        "GPS",
        "Waze",
        "1,400",
        "Tensor G2",
        "Six to 7 hours",
        "second",
        "4-nanometer",
        "15x",
        "1080p",
        "Pixels",
        "G2",
        "AI",
        "1,500",
        "Pixel",
        "the Pixel 7 and",
        "899",
        "hour",
        "Google",
        "85%",
        "12 megapixels",
        "6",
        "60%",
        "Google Pixel"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "EVENT",
        "MONEY",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "ORG"
    ],
    "vector": [
        -0.11030106246471405,
        -0.05436701327562332,
        0.11080177128314972,
        -0.024785446003079414,
        0.02623170055449009,
        -0.01780560426414013,
        0.045547373592853546,
        0.0797310397028923,
        -0.08745456486940384,
        0.036198340356349945,
        -0.03395426273345947,
        0.008940675295889378,
        0.004428681917488575,
        -0.03028964065015316,
        0.02154737524688244,
        -0.030474500730633736,
        0.09495306760072708,
        -0.07723446190357208,
        -0.05849050357937813,
        -0.006074303761124611,
        -0.05442245677113533,
        -0.0778457298874855,
        0.014353948645293713,
        0.09220793098211288,
        0.06633488833904266,
        0.03779543191194534,
        -0.0032834785524755716,
        0.015892207622528076,
        0.014177124947309494,
        -0.05522001162171364,
        0.0014977621613070369,
        0.07482001185417175,
        0.08446886390447617,
        0.003319148439913988,
        -0.011525808833539486,
        -0.03638584911823273,
        0.06995546072721481,
        -0.006699835881590843,
        -0.06669515371322632,
        -0.05777259171009064,
        -0.01091091800481081,
        -0.0817774161696434,
        0.013382885605096817,
        -0.06454699486494064,
        0.009061956778168678,
        -0.04084448888897896,
        0.0498693510890007,
        -0.0868685394525528,
        0.0052461219020187855,
        -0.04322589561343193,
        -0.07271431386470795,
        -0.04677542299032211,
        -0.04660652577877045,
        0.013048592023551464,
        -0.09142620861530304,
        0.04575260728597641,
        0.033759742975234985,
        -0.05037280544638634,
        0.042751241475343704,
        0.04234728589653969,
        -0.025741316378116608,
        -0.09140405803918839,
        -0.0036171316169202328,
        0.046938423067331314,
        0.008854914456605911,
        -0.06053967401385307,
        -0.013303200714290142,
        -0.05641983821988106,
        -0.028886716812849045,
        0.019966231659054756,
        0.017100797966122627,
        0.06326615810394287,
        -0.015757711604237556,
        0.04767957702279091,
        0.016932588070631027,
        0.025532269850373268,
        -0.0006041184533387423,
        -0.058675430715084076,
        -0.05371253192424774,
        -0.06335311383008957,
        0.05854327604174614,
        -0.03361329063773155,
        -0.06014333292841911,
        0.005487628746777773,
        0.028385337442159653,
        -0.037956561893224716,
        0.00043787466711364686,
        0.07575727999210358,
        -0.021202677860856056,
        -0.05917109176516533,
        0.0034780751448124647,
        0.14360669255256653,
        0.06332056224346161,
        0.026106545701622963,
        0.045184426009655,
        0.07034553587436676,
        -0.008219786919653416,
        -0.07897437363862991,
        -0.01616051234304905,
        0.033468302339315414,
        -0.00458778440952301,
        0.03441746160387993,
        -0.0010729932691901922,
        -0.0650489553809166,
        0.019637012854218483,
        -0.04362674057483673,
        -0.03889130428433418,
        0.07752153277397156,
        0.024321652948856354,
        -0.025303183123469353,
        0.030378008261322975,
        -0.0005272603593766689,
        -0.01280005369335413,
        0.057153042405843735,
        -0.053224701434373856,
        -0.05097765102982521,
        -0.00912823062390089,
        0.041573453694581985,
        0.11394553631544113,
        0.04901743680238724,
        -0.03823136165738106,
        -0.03114364668726921,
        -0.042753711342811584,
        -0.06351494789123535,
        -0.02435963600873947,
        -0.02189113385975361,
        -0.08298388868570328,
        3.769388307146734e-33,
        -0.0043370989151299,
        0.022963766008615494,
        -0.006046169437468052,
        -0.02243458479642868,
        -0.09620464593172073,
        0.010457429103553295,
        -0.03442179784178734,
        0.022169435396790504,
        0.025101397186517715,
        -0.004084473010152578,
        -0.02588557079434395,
        0.0027760558295994997,
        -0.06021619960665703,
        -0.023891381919384003,
        0.11326967179775238,
        -0.022283004596829414,
        -0.07777558267116547,
        -0.026047982275485992,
        -0.03379925712943077,
        0.03163142129778862,
        0.04389146715402603,
        -0.04504825174808502,
        -0.03020688146352768,
        0.01864154264330864,
        0.027876850217580795,
        0.019286660477519035,
        0.03247135877609253,
        0.0383378230035305,
        -0.013247712515294552,
        -0.018105531111359596,
        -0.0990598276257515,
        -0.022083604708313942,
        0.11433285474777222,
        0.049815185368061066,
        -0.05167509615421295,
        0.03184652701020241,
        -0.011170782148838043,
        -0.053245507180690765,
        0.017611131072044373,
        -0.01926402561366558,
        -0.12002723664045334,
        0.06722508370876312,
        -0.020349757745862007,
        -0.01616627722978592,
        0.05143764987587929,
        0.09767431020736694,
        0.014671437442302704,
        -0.041121236979961395,
        -0.017439663410186768,
        0.04508887231349945,
        0.0045893630012869835,
        0.03380609303712845,
        -0.01668783649802208,
        0.03734022378921509,
        -0.02022823877632618,
        0.009094097651541233,
        0.047334834933280945,
        -0.006832585204392672,
        0.08684030920267105,
        0.04880363121628761,
        0.055169809609651566,
        0.056949835270643234,
        -0.05895477905869484,
        -0.05998541787266731,
        -0.01383284293115139,
        0.09528683125972748,
        0.08223265409469604,
        0.10994861274957657,
        -0.08006451278924942,
        0.038411982357501984,
        -0.03841562941670418,
        -0.030482934787869453,
        0.05418675020337105,
        -0.044089581817388535,
        0.0700591653585434,
        -0.029709748923778534,
        -0.02724611759185791,
        -0.08551287651062012,
        -0.018156753852963448,
        -0.04904694855213165,
        -0.05750785395503044,
        0.06689654290676117,
        -0.037906747311353683,
        0.10733049362897873,
        -0.05871153622865677,
        0.027385372668504715,
        0.0009465138427913189,
        -0.017346233129501343,
        -0.03294302895665169,
        0.0410194993019104,
        -0.06569977849721909,
        0.005984282121062279,
        -0.04705548286437988,
        0.05407240241765976,
        -0.018165307119488716,
        -4.2860019112858055e-33,
        -0.002934119664132595,
        -0.0252365842461586,
        0.04081759974360466,
        0.09031079709529877,
        -0.01720438338816166,
        -0.05021471157670021,
        0.025854967534542084,
        -0.018173886463046074,
        -0.014549625106155872,
        -0.006756472866982222,
        -0.0020215152762830257,
        0.008546392433345318,
        -0.033598773181438446,
        0.01915041357278824,
        -0.04955512657761574,
        -0.05957111343741417,
        -0.006550682708621025,
        -0.11537421494722366,
        0.04626043513417244,
        -0.027600303292274475,
        0.06510055065155029,
        0.07817026227712631,
        -0.05268879234790802,
        0.016928639262914658,
        -0.05554799363017082,
        0.018223892897367477,
        -0.030518222600221634,
        0.0074274432845413685,
        0.02467915043234825,
        0.015217043459415436,
        0.05881806090474129,
        -0.06337489187717438,
        -0.01303697656840086,
        -0.02573542110621929,
        0.0946914479136467,
        -0.02735242061316967,
        -0.007970166392624378,
        -0.05074271559715271,
        0.06533108651638031,
        -0.03429746627807617,
        -0.01692933961749077,
        -0.002328666625544429,
        0.05340486019849777,
        -0.11018429696559906,
        0.09767570346593857,
        -0.030192825943231583,
        0.0012965794885531068,
        -0.015787273645401,
        0.023151228204369545,
        0.056797344237565994,
        0.0337054617702961,
        0.03862198442220688,
        -0.06873087584972382,
        -0.09291259199380875,
        -0.10672198981046677,
        -0.06121983751654625,
        -0.02864682674407959,
        0.02416364848613739,
        0.0480157807469368,
        -0.01404914353042841,
        0.07340744882822037,
        -0.01762966439127922,
        -0.015374220907688141,
        0.008218139410018921,
        -0.12570907175540924,
        0.06959039717912674,
        0.08410462737083435,
        0.028197187930345535,
        0.04616362228989601,
        -0.005567662417888641,
        -0.0691535472869873,
        -0.0709385946393013,
        -0.012411314062774181,
        -0.06287995725870132,
        -0.044550567865371704,
        0.05352949723601341,
        -0.022458359599113464,
        0.002666556742042303,
        -0.014411226846277714,
        -0.04111131280660629,
        0.02641993574798107,
        0.029183143749833107,
        0.06260333210229874,
        -0.028996234759688377,
        0.022908054292201996,
        0.09965559095144272,
        0.017395131289958954,
        -0.04091348499059677,
        0.026888933032751083,
        -0.014123235829174519,
        -0.032292116433382034,
        0.014579938724637032,
        -0.06861059367656708,
        0.018069056794047356,
        -0.04910982772707939,
        -5.0430724485295286e-08,
        0.06638780981302261,
        -0.07245135307312012,
        0.05930732190608978,
        0.010881883092224598,
        0.039626721292734146,
        -0.08672227710485458,
        -0.047692809253931046,
        -0.033048685640096664,
        0.15133121609687805,
        0.021919630467891693,
        0.04037415608763695,
        -0.07455254346132278,
        -0.06463583558797836,
        0.07573532313108444,
        -0.01827934943139553,
        0.08621107786893845,
        -0.04292869567871094,
        0.018726596608757973,
        -0.0018320553936064243,
        0.001476603327319026,
        0.004708027001470327,
        0.022993478924036026,
        0.04566778615117073,
        -0.045436084270477295,
        -0.0015616703312844038,
        -0.030515074729919434,
        -0.0034230640158057213,
        0.010413226671516895,
        0.04447168856859207,
        -0.035521335899829865,
        -0.013731049373745918,
        -0.012420699000358582,
        0.030485646799206734,
        0.002652351977303624,
        0.0996304303407669,
        -0.09687690436840057,
        0.030519265681505203,
        -0.020823990926146507,
        0.07636436074972153,
        0.005690866149961948,
        0.005141339730471373,
        -0.04297732934355736,
        0.021721355617046356,
        0.0009476090199314058,
        -0.0027163478080183268,
        -0.061427414417266846,
        0.028099125251173973,
        -0.02682545594871044,
        0.033926527947187424,
        0.12442350387573242,
        -0.016195034608244896,
        0.018539436161518097,
        -0.019420672208070755,
        -0.024143042042851448,
        0.09984581917524338,
        -0.009996538981795311,
        0.020462093874812126,
        0.027101868763566017,
        -0.025747066363692284,
        0.08323665708303452,
        0.08873318880796432,
        -0.10141874849796295,
        0.048649340867996216,
        0.10141857713460922
    ]
}