{
    "id": "Ng5sHevRX3w",
    "title": "Why Don't More Smartphones Have This?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-12-07T22:31:39Z",
    "video_url": "https://www.youtube.com/watch?v=Ng5sHevRX3w",
    "category": "Science & Technology",
    "tags": [
        "matte phone",
        "matte",
        "matte display",
        "TCL",
        "TCL NXTPAPER",
        "E-ink",
        "e-paper",
        "epaper",
        "mkbhd",
        "E-INK SMARTPHONE",
        "teléfono mate",
        "mate",
        "pantalla mate",
        "E-Ink",
        "papel electrónico",
        "tinta electrónica",
        "MKBHD",
        "smartphone e-ink"
    ],
    "views": 3182269,
    "likes": 112487,
    "comments_count": 4708,
    "description": "The ultimate anti-reflective matte display... has a catch  MKBHD Merch:   TCL 40 NXTPAPER:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Phone provided by TCL for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.tcl.com/global/en/mobile/tcl-40-nxtpaper",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- Okay, so this is the TCL 40 NXTPAPER, and at first glance, it might not appear to be a particularly special phone. Like, this is a $200 budget Android phone. It's got a 5000 milliamp power battery, a pretty standard issue 50 megapixel main camera flanked by a 5 megapixel ultrawide and a two megapixel macro, and inside, a Mediatek G88 processor, 8 gigs of RAM, and 256 gigs of storage. This design is pretty basic. It's squared up, nothing too offensive, a solid blue color with some sparkles in it, but it has exactly one really interesting feature that's caught my attention, and that's the screen. So this screen, you're looking at a 6.78 inch, flat, 1080p, 90 hertz display, but when you put it up next to another phone, that's when you immediately notice something is very different about it, mainly that there are no reflections at all, none, well, almost none, so this phone is called the NXTPAPER because it has what TCL is calling a full-color electronic paper display to deliver a reflection-free, full-color, paper-like visual experience, which looks way better, has much less fatigue on the eyes, and also feels better in the hand. And so my first thought, when I first saw this, was, okay, why doesn't every phone have this? Like, how is it a super cheap budget phone that's the first one I've seen to pull this off, and why aren't more phones doing this? What am I missing here? And so of course, I had to use it to get all these answers. So, okay, TCL calls it the NXTPAPER because they'd like you to think of it as just like an e-paper display. If you've ever seen a Kindle or any of the other various E Ink displays out there, that tech is actually kinda sick, it's amazing. It minimizes fatigue on the eyes, and it looks and feels like something's literally printed on a piece of paper, like an newspaper, in front of you. It works great in all sorts of different lighting because it's literally rearranging actual ink underneath the display. But this is actually not that. Instead, it's an LCD display with a textured glass on top and some software tricks to resemble a paper-like display and deliver almost all of the eye comfort benefits that come with it, so the result is basically what looks like a normal smartphone screen with zero reflections, and I am very into that. Like, look at this screen next to a glossy regular smartphone glass screen. Typically, when I review phones, like, I have to spend a lot of effort shielding these displays from reflections. That's a little known fact in this, I guess it's kinda inside baseball, but when you shoot reflective things, it is a challenge. I have to angle the phone certain ways, I have to shoot in certain environments, and I often use what we call a flag here, which is literally just to slide it in at a certain angle to block reflections and make the screen easier to see. It's a whole thing. But with this matte display, I mean, I just don't need any of that special treatment, like, it's happy to show up at any angle, and the angles that would normally have a giant reflection, it just kinda looks a little bit lighter, a little faded, but still actually readable, and then when you're straight on, or just kinda regularly reading, it's nice and soft, and it's less stressful on the eyes. It is kinda weirdly a little bit paper-like, like some of those paper-like displays. So almost all of this is enabled by hardware, so there are a bunch of extra layers between the actual LCD display and you, including this textured glass, and so that's all what gives it this anti-reflective look. There's also some other benefits, like physically limiting the amount of blue light that makes it through, so instead of a special mode in the software, there is just physically less blue light making it through an additional filter into your eyes. And another underrated one, the feel. I mean, literally, the way the glass feels under your finger. It kinda has this soft touch effect thanks to the slight texture. So you can actually see the difference up at the cutout at the top. You obviously can't do textured glass over the front-facing camera, because that would ruin the photos, not that they're amazing photos in the first place, but that's the most obvious spot where you can see that difference between the matte finish and glossy glass. And my finger just runs over this glass almost the same way that it does on the back of the phone. (rubbing with no sound) (rubbing creates swishing) So I think all this is shaping up to be pretty cool, the matte finish, the basically zero reflections, the much lower eye strain, the soft touch finish. There's also stylus support, as TCL makes a stylus that actually works with this type of screen. So what's the catch? Why don't more phones have this on them? And you're probably one step ahead of me already, which is, yeah, there are some downsides. So first of all, a bunch of extra layers on the display itself is gonna have some obvious drawbacks, but mainly, it's just that they're cutting a lot of light, like, it hurts a lot of sharpness and just total light getting through to you. So this is the absolute maximum 100% brightness of this screen, and it's 450 nits, so it's good enough to read indoors, as you've seen, but outdoors, it's gonna get pretty quickly washed out and is disappointingly dim. Now, again, this is a $200 phone, so I think if this was an even higher-end phone with a brighter LCD or an OLED back there, maybe it could solve or help some of these issues, but that wouldn't fix the other one, which is sharpness. So this is a 1080p display, as I've said, but it doesn't even really look like that. I mean, I think if I asked you what resolution you think this is, or if I did a blind test or something, it would compare pretty closely to a 720p display. I mean, text is soft, edges of things are soft, all the corners are soft. It just all kinda has a little bit of a glow to the edges, which, again, makes things nice and easy to look at, like nothing is harsh, or super bright, or fatiguing on the eyes, but if it's a sharp photo or a video detail you're after, then putting a bunch of layers between your eyeballs and the actual display is not the best way to see those details. And then same thing with contrast. Just because of how much brightness is limited, the lack of contrast becomes really obvious. This one's rated at just 1500:1 contrast ratio, which, even when compared to other budget phones, is not that great. Oh, and then screen protectors. People usually put screen protectors on their phones, and this one would obviously not make sense to put a screen protector on (chuckling). So suddenly, in this world of feature-rich smartphones with all these big, bright, clear displays, this goes from being an advantage to being a niche feature (chuckles), because most people aren't willing to sacrifice the downsides that come with maybe a little bit less eye strain and less reflections for a matte display. This isn't like a desktop screen, where most people are buying it just based on the panel and the visual display properties. There's a bunch of stuff about a phone people care about, and it turns out people do not like that trade-off. So I've talked about all kinds of other niche features in the smartphone world, and how they're awesome but won't actually sell a ton of phones. This is, like, the perfect addition to that pile. I mean, TCL has these special NXTPAPER modes in the software, and when you turn one of them on, one's called color paper, and it goes the extra mile to, you know, turn down saturation a little bit and reduce the extra-vibrant colors. it adds some texture, and everything, it literally looks like your smartphone screen is, like, a colored piece of paper, with, like, your icons in colored ink, moving around. And then you can go all the way up to ink paper, which goes full black and white. It seems silly to most people, but when you compare it to an actual E Ink display, that's when it looks amazing. Like, an actual e-reader is the least fatiguing version on your eyes, but if you've ever used one, you know that frame rates are pretty slow, Like, you can hardly get like, even a real page-turning book animation on some of the absolute bleeding-edge best versions we have, so a smartphone with a special hardware layer that gets close to the same visual level but is 90 hertz, fully responsive, full color, and can do anything your phone can do on top of being an e-reader, is technically awesome, which is why TCL also makes a tablet version of this and another phone version of this. It is super cool, but almost no one's gonna buy it, and that's why not every other phone is going out to do this too, at least for now, anyway. Thanks for watching. Catch you guys the next one. Peace.",
    "transcript_keywords": [
        "display",
        "phone",
        "screen",
        "TCL",
        "budget Android phone",
        "phones",
        "kind",
        "NXTPAPER",
        "LCD display",
        "glass",
        "eyes",
        "Android phone",
        "reflections",
        "displays",
        "soft",
        "pretty",
        "People",
        "Ink",
        "actual LCD display",
        "literally"
    ],
    "transcript_entity_values": [
        "NXTPAPER",
        "50 megapixel",
        "G88",
        "one",
        "40",
        "LCD",
        "5000",
        "90",
        "256",
        "90 hertz",
        "8",
        "200",
        "Mediatek",
        "Android",
        "first",
        "1500:1",
        "Kindle",
        "5 megapixel",
        "6.78 inch",
        "zero",
        "450",
        "RAM",
        "TCL",
        "two",
        "100%",
        "a ton"
    ],
    "transcript_entity_types": [
        "NORP",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "QUANTITY"
    ],
    "vector": [
        -0.04476353898644447,
        0.06797923147678375,
        0.11442377418279648,
        -0.04005597159266472,
        0.022949621081352234,
        -0.009073087014257908,
        0.014556307345628738,
        0.08441613614559174,
        0.07662917673587799,
        0.00570868793874979,
        -0.040660612285137177,
        -0.0057047270238399506,
        0.10392928868532181,
        -0.0006292052567005157,
        -0.020445676520466805,
        -0.041694071143865585,
        0.10781756788492203,
        -0.1327069252729416,
        -0.06773318350315094,
        0.010393204167485237,
        0.03137029707431793,
        -0.026141034439206123,
        -0.009092953987419605,
        -0.05136585980653763,
        0.04234396293759346,
        0.044874124228954315,
        -0.02055557444691658,
        0.0021471469663083553,
        -0.008677109144628048,
        -0.04566493630409241,
        0.006772981956601143,
        0.19928424060344696,
        0.03784407675266266,
        0.0160685982555151,
        -0.037646759301424026,
        -0.09677499532699585,
        -0.0242872666567564,
        -0.004019191954284906,
        -0.07481150329113007,
        -0.0642695277929306,
        -0.02339375950396061,
        -0.00047999375965446234,
        0.026247316971421242,
        0.06702671200037003,
        -0.04809720814228058,
        -0.09196529537439346,
        0.045919522643089294,
        -0.0485997349023819,
        0.011721915565431118,
        -0.11180952936410904,
        -0.03424990177154541,
        -0.000288304261630401,
        -0.016481667757034302,
        -0.009823858737945557,
        -0.048578016459941864,
        0.07280804961919785,
        -0.0452125146985054,
        -0.026438044384121895,
        0.08341266214847565,
        -0.008731990121304989,
        0.014239146374166012,
        0.039455439895391464,
        0.011630658060312271,
        0.01390761137008667,
        0.05209306254982948,
        0.0015904533211141825,
        -0.014226086437702179,
        -0.050160858780145645,
        0.003455887548625469,
        0.011004826985299587,
        0.009681252762675285,
        -0.014610793441534042,
        0.05806233361363411,
        0.008071979507803917,
        -0.01569865643978119,
        -0.032101601362228394,
        0.01929880492389202,
        -0.014895276166498661,
        0.0072876266203820705,
        -0.02409064583480358,
        0.06900999695062637,
        -0.07945165038108826,
        -0.022047990933060646,
        0.020968424156308174,
        0.08463775366544724,
        -0.028126554563641548,
        0.03701798617839813,
        -0.025302162393927574,
        -0.024462565779685974,
        -0.0534253865480423,
        -0.036258429288864136,
        0.0922698900103569,
        -0.07471875101327896,
        -0.033538296818733215,
        -0.037779536098241806,
        -0.007746977731585503,
        -0.02862202376127243,
        -0.0430537648499012,
        -0.001421676715835929,
        0.05519072711467743,
        0.10978304594755173,
        0.001835419679991901,
        0.0753648653626442,
        0.02872939221560955,
        -0.010863245464861393,
        -0.08437501639127731,
        0.006090365815907717,
        0.05447353050112724,
        -0.003710160730406642,
        0.019008217379450798,
        0.0063650645315647125,
        0.02688021771609783,
        -0.04352429136633873,
        0.03203928470611572,
        -0.019659537822008133,
        0.0021167139057070017,
        -0.0023380436468869448,
        -0.00589591171592474,
        0.10968085378408432,
        -0.02546967752277851,
        0.0076011731289327145,
        -0.07913564145565033,
        -0.12051532417535782,
        -0.032572921365499496,
        0.055036358535289764,
        0.010249624960124493,
        -0.07512713968753815,
        1.8559110723675293e-33,
        0.00659979460760951,
        0.08381424099206924,
        -0.03081027790904045,
        -0.027656052261590958,
        -0.010057608596980572,
        -0.01020226813852787,
        -0.014237871393561363,
        0.030859099701046944,
        0.04395752772688866,
        0.014146445319056511,
        0.003595649963244796,
        0.05694141611456871,
        -0.01632515899837017,
        0.07606285065412521,
        0.06747204810380936,
        -0.04440496861934662,
        -0.04495575651526451,
        -0.02031143754720688,
        -0.036243095993995667,
        0.027676546946167946,
        -0.00083158042980358,
        0.007440115325152874,
        0.013204153627157211,
        -0.02126445434987545,
        -0.011926363222301006,
        0.04968827962875366,
        0.1329105794429779,
        0.028540484607219696,
        0.03759372606873512,
        0.007582378573715687,
        -0.030975807458162308,
        -0.04010094329714775,
        0.08615905046463013,
        -0.07099559903144836,
        -0.025998588651418686,
        -0.018198756501078606,
        0.007462291046977043,
        -0.053875915706157684,
        0.040419891476631165,
        -0.030531592667102814,
        -0.08368749916553497,
        0.07798613607883453,
        -0.08913802355527878,
        0.023071322590112686,
        -0.01156815979629755,
        0.028827205300331116,
        -0.012180807068943977,
        0.00884472206234932,
        -0.09300598502159119,
        0.048498570919036865,
        0.05367439240217209,
        -0.03104459121823311,
        0.0033884153235703707,
        -0.02034730650484562,
        0.0004920432111248374,
        0.001841138582676649,
        0.04945138841867447,
        0.004873434081673622,
        0.033389803022146225,
        0.08537982404232025,
        0.028964662924408913,
        -0.014074369333684444,
        -0.09069608151912689,
        0.03343050554394722,
        -0.02194199711084366,
        0.0643431693315506,
        0.01769131049513817,
        0.05293731763958931,
        -0.11354310065507889,
        0.0720173642039299,
        0.01729234680533409,
        0.0157893318682909,
        0.11737460643053055,
        -0.015469489619135857,
        0.1037164032459259,
        -0.006891211029142141,
        -0.004538445267826319,
        -0.002250067424029112,
        -0.0037058719899505377,
        0.0026894756592810154,
        -0.020610179752111435,
        -0.008055605925619602,
        0.020759839564561844,
        0.012024938128888607,
        -0.04353144019842148,
        -0.07725837081670761,
        -0.003020437201485038,
        -0.027125094085931778,
        -0.06407549977302551,
        -0.0018089127261191607,
        -0.017225604504346848,
        -0.01991475373506546,
        0.034168314188718796,
        0.02945084124803543,
        -0.042411163449287415,
        -2.3402983152078156e-33,
        0.004809688776731491,
        -0.049950648099184036,
        -0.0433969646692276,
        -0.026399485766887665,
        0.027291812002658844,
        -0.03585337847471237,
        0.08474653214216232,
        0.007091881241649389,
        0.0018396871164441109,
        -0.045007459819316864,
        0.04418184608221054,
        0.009925829246640205,
        -0.015431243926286697,
        0.00904796738177538,
        0.010906743817031384,
        -0.0571422278881073,
        0.025999464094638824,
        -0.09090737998485565,
        -0.05123300105333328,
        -0.02952231839299202,
        0.023932579904794693,
        0.07286157459020615,
        0.028078652918338776,
        0.09250228106975555,
        -0.0036960404831916094,
        0.05743234232068062,
        -0.06547844409942627,
        0.04723477363586426,
        0.000701034558005631,
        0.001482918276451528,
        0.020500535145401955,
        -0.05323540419340134,
        0.044021524488925934,
        0.016859330236911774,
        0.04435744881629944,
        0.020113108679652214,
        0.005669608246535063,
        -0.030316267162561417,
        0.004604435991495848,
        0.033414747565984726,
        -0.029708407819271088,
        0.053473059087991714,
        -0.0016837965231388807,
        -0.05214088037610054,
        0.011195684783160686,
        -0.026200100779533386,
        -0.011194443330168724,
        -0.040678415447473526,
        0.035033177584409714,
        -0.006914110854268074,
        0.09958146512508392,
        0.05982409045100212,
        -0.02531534805893898,
        0.0015484123723581433,
        -0.09006290882825851,
        -0.028064798563718796,
        -0.08953564614057541,
        0.016072968021035194,
        0.043792977929115295,
        0.011637343093752861,
        0.15697415173053741,
        0.014998828060925007,
        -0.11355270445346832,
        -0.07449080795049667,
        -0.025354256853461266,
        -0.00021976949938107282,
        0.05488809943199158,
        -0.03271352872252464,
        -0.008984260261058807,
        0.02348967082798481,
        -0.07751926779747009,
        -0.08562427759170532,
        -0.05054713413119316,
        -0.04686296358704567,
        0.04156826436519623,
        0.10621199011802673,
        -0.01616515964269638,
        0.009741304442286491,
        0.00809397641569376,
        0.000688407220877707,
        -0.030422037467360497,
        0.03849353641271591,
        0.07284492254257202,
        0.0014563224976882339,
        0.05400684475898743,
        0.00407947413623333,
        -0.03188565745949745,
        -0.006040561944246292,
        0.02175356075167656,
        0.005923028104007244,
        -0.02335446886718273,
        -0.040924642235040665,
        -0.08998844772577286,
        0.08493098616600037,
        0.0616869255900383,
        -5.3513435460672554e-08,
        0.028680363669991493,
        -0.0550687350332737,
        -0.037621308118104935,
        -0.029249196872115135,
        -0.014144026674330235,
        -0.1370733231306076,
        -0.0007766429334878922,
        -0.05703715607523918,
        0.14587616920471191,
        -0.05768123269081116,
        0.01909065991640091,
        -0.1424912065267563,
        -0.08556850254535675,
        0.04617401212453842,
        0.03589083254337311,
        0.05741264298558235,
        -0.05301465094089508,
        -0.007003833074122667,
        -0.024154525250196457,
        0.04655047878623009,
        -0.08622030913829803,
        0.037837106734514236,
        -0.020897265523672104,
        -0.047179676592350006,
        -0.005622626282274723,
        0.04415423795580864,
        -0.051082395017147064,
        -0.007504825480282307,
        0.10106975585222244,
        -0.01987474039196968,
        -0.021735096350312233,
        0.02066987007856369,
        -0.027151625603437424,
        -0.0014022724935784936,
        0.007871019653975964,
        -0.022772738710045815,
        -0.008421438746154308,
        0.018757011741399765,
        0.0961962342262268,
        0.04538492485880852,
        -0.038306403905153275,
        -0.1424405574798584,
        -0.01677992381155491,
        0.05338958278298378,
        0.04367469623684883,
        -0.10117723792791367,
        0.010013315826654434,
        -0.04360957816243172,
        -0.0179505106061697,
        0.03286965191364288,
        -0.011630836874246597,
        -0.01746303401887417,
        -0.07907027751207352,
        -0.07841581106185913,
        0.059112709015607834,
        -0.07095016539096832,
        0.06448874622583389,
        0.025401489809155464,
        -0.05192631110548973,
        0.026807427406311035,
        0.04415379837155342,
        -0.07360323518514633,
        0.022355560213327408,
        0.07347805052995682
    ]
}