{
    "id": "NHpBytLM4D0",
    "title": "MORE Cool New Tech at CES 2020 / Part 2",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-01-13T21:26:52Z",
    "video_url": "https://www.youtube.com/watch?v=NHpBytLM4D0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "amazon",
        "Guy Fieri cooking demo",
        "Elgato",
        "Corsair",
        "Origin",
        "Shure",
        "Sony",
        "Withings",
        "Sleep Number smart beds",
        "Benji Locks",
        "segway"
    ],
    "views": 310891,
    "likes": 7518,
    "comments_count": 372,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey it's Justine and welcome to part two of my CES 2020 coverage, there is still more to see so let's not waste any time. (upbeat music) Everyone has such a huge presence at CES, mostly because Alexa is enabled in so many different devices, there is over a hundred thousand of them. There's even a grill over here that I see that's Alexa enabled. Works with Alexa, this is definitely something that I never thought that I would see. Here's something else that I never thought I would see, a robotic lawnmower that's Alexa enabled. This is amazing. Do you think that they know that this isn't real grass? (upbeat music) If you've ever wanted to hang out with Samuel L Jackson and you couldn't? Here's your opportunity, you can change the voice on Alexa to be Samuel L Jackson, you can ask him jokes and all kinds of fun stuff. - [Alexa] Allow me welcome actor, Samuel L Jackson. - [Samuel L Jackson voice] I'm in the cloud baby. - [Alexa] Can you set a three second timer? - [Samuel L Jackson Voice] Sure, one Mississippi, two Mississippi, three Mississippi. - So right now we're getting a live cooking demo with Guy Fieri, Amazon has some really cool on-demand cooking classes that you could take on your Amazon Echo Show. Hello, do you guys need anything edited? 'Cause I'm available. - [Dark haired man] Yeah. - Do you need any editing help? - [Dark haired man] (laughs) Yes please. - I got the craziest phone call in the middle of the holidays, they say, \"Do you use Alexa?\" And I said, \"No, but my kids do.\" And they said, \"Well, would you like to come cook with Alexa down in Vegas?\" And I said, \"I've done weird things, that sounds like it's right up my alley, absolutely.\" Alexa, read me this first step. - [Alexa] Squeeze enough fresh limes to measure half cup plus one quarter cup juice and reserve separately. - We're gonna add a little bit of orange juice, add sour orange to my shopping list please? - [Alexa] Sour orange added to your shopping list. - What you gonna ask me real critical technical tips now, huh? This is a little outside of my, yes? - Can I get a selfie? - Absolutely. - Okay! Great, thank you. - There you go, that's the best part of the day. Okay, a little granulated garlic. - I was so inspired by the Guy Fieri cooking demo that I saw over here they have an Amazon Smart Oven. Oh wow, you can air fry, roast and microwave. It's a smart oven. (upbeat music) - We're at the Elgarto Corseair Origin and Scuf booths, one of the things that Elgarto announced here at CES is one of these Elgarto Key Light Airs, what's great about this is you can just set it right on your desk, connect it to wifi and then you can control it on your phone, or on your computer, you can control the color temperature, the brightness, turn it on or off, it's really nice that if used if you are shooting YouTube videos or if you're a streamer, this is a perfect desk setup. They also announced another thing which will be available later in the year, this is the Elgarto 4K60 S, and this is pretty awesome because you can capture game play at 4K60, it also has zero lag 4K HDR 10 passthrough so it leaves your gameplay unaltered. This will allow you to capture on the go and not need a computer so for me this is something that I absolutely love. I've always loved their capture cards and I've been using them for the past several years. So this is a really great addition, especially if you're doing a lot of game capturing So this is the Exo Scuf, now if you ever need to get real comfy, help your posture when you're playing some games, originally I was gonna make fun of this, but it's actually incredibly comfortable. Okay, this chairs actually quite comfy as well. So this is the Corsair Concept Orion, there's 150 ultra bright, ultra efficient Corsair LEDs. It's fitted to a tempered glass with ultra low visibility film, pretty amazing because normally when you have LED lights like this you can see strips, I can't even tell where the LEDs are and where the case is. So Origin decided to make the Big O in consumer reality, if you guys saw a box there at the Unbox the Big O, it's basically a PC that also includes a Nintendo Switch, a PlayStation and an Xbox all on one case. So Origin gives you a choice if you want to have an Xbox or a PlayStation mixed in with your PC. You can also choose to upgrade the consols hard drives, so you can take out the mechanical drive and put solid state drive in, which will increase your performance so if I were to customize one of these obviously I would be going for the Xbox one. So right now I'm playing on the Xbox side, you can also connect dual monitors so this obviously is attached to the Xbox and if you wanna stream and capture, you can be streaming and capture over here on the PC side. Much like most PCs it's easy to update and on the other side here you do have a 4K60 Elgarto pro capture card, this is great for people who are console gamers like me who also wanna be streaming and you don't wanna have a crazy big set up. And this is the PlayStation version so you can customize it if you wanna have an Xbox or a PlayStation, good job Origin, this is cool. (upbeat music) We're at the Shure booth and I gotta a little gift here, so this is their MV88+ video kit, this comes with a mic and a little mount for your phone and a tripod. Jenna's here too! - Hello, I've already unboxed over here privately. - Private unboxing. - [Jenna] I did. - We have been here at CES for several days and I haven't even seen Jenna, 'cause she's had separate things to do. - I haven't seen you in three days. - Three days. - This is nice, on my God, all of the accessories right here. (upbeat swing music) So I have the app all downloaded and this is really cool because in the settings, I can change the direction, for CES I'm probably gonna want to have it kind of more in a shotgun situation, let's get our vlog on. (upbeat swing music) I just got a really cool microphone, that is now attached to my iPhone, I'm at the Shure booth and they gave me one of these to test out and I cannot wait to see what this audio is like, because obviously the iPhone shoots really great video, sometimes the audio's good, but when you're in loud situations like this, being able to control the degree of where the microphone is actually picking up audio is pretty amazing. So right now I have it at 60 degrees and it should be focused kind of right around here. So here's what it sounds like without using the microphone, there's so much ambient sound when you're at a conference or at a convention like this, that it's really hard to kind of just pick up my voice, not everything else. (slow music) So it's no secret that I'm a Sony shooter so obviously stopping by the Sony booth, look what they did to this A7S II? That tripod is massive, look at this rig? They've got the RX0 on top of the A7R. I'm getting a lot of rigsperation from this set up. Sony announced a prototype/concept of an electric car, it's called the Vision-S. - What this prototype vehicle showcases the best of Sony in one, it will have a total of 33 different sensors, from cameras, LIDAR, to ultrasonic sensors, we've introduced things like 360 VDR, they do some great things when it comes to video displays using the front facing or rear facing camera, you can use the footage from the front or rear camera. You can edit that, overlay music and upload it in your social media. (chilled music) - This is one of my favorite parts about CES is checking out all the things that they have for health, wellness and fitness, so lets go see what we can find. A lot of times at CES, you'll find things that are just concepts, they may never actually become something real, there's also a lot of things that can look a little strange. I'm kind of interested, searching for drug-free relief from back pain? I am actually looking for that, so maybe it's not that strange after all. So these are actually Sleep Number beds, I'm sure you guys are all familiar with that brand. It's really cool because they have two sides now so you can control the climate of each side, you have a heating and a cooling element. You can also connect your bed to an app. This bed can also track your heart rate and your circadian rhythm and this will all be right here on your phone after you wake up in the morning. Oh, there's demos! I would like to try the demo but if you think about how many people have probably laid on that bed here at the convention center, I might pass. Wearable biometrics is something I'm also extremely interested in because being able to track your heart health, blood pressure and all of those things I think is very important to know what is happening with your body. What's cool about this company is they basically make the tech that goes into other products. Like kind of the industrial secret ingredient in all of the wearables that you guys see today. Blood pressure is something that is usually difficult to track, especially having to carry around the big arm cuff, well right now Corey is testing out an ear blood pressure monitor. This looks pretty interesting. So that's way easier than putting on an arm cuff? - So much easier and it's less invasive and it's less stressful. - Withings is a really interesting brand, not too long ago they actually got bought my Nokia, but then they bought themselves back from Nokia. So they're back to Withings. Your wifi Smart Sleep Analyzer, nothing to wear. I actually have this, it's a thermometer, I also have their blood pressure monitor. I even have one of their scales, being able to track and quantify if you are doing any sort of fitness plan or working out, being able to actually track and see changes is so important in making sure that you're doing the right things to reach your goals. - So it's the most innovative wearable on the market, for one main reason, so it has an SpO2 sensor that measures your oxygen saturation in your blood. - Oh wow! - So naturally when you sleep your oxygen goes down a little bit and as people age, men and women may tend to snore more, it might be genetic. You might also have breathing disturbances. So not inhaling oxygen while you sleep is a problem and so it's the first wearable on the market to use and Sp02 sensor to help detect sleep apnea. So you see your oxygen saturation is out of a hundred, rates between 90 and 100, this is considered good. We have color coded feedback, to let people know what is good and what is bad. - [Justine] It's really great. - [Sales Lady] Yeah. - [Justine] I'm so excited, when does this come out? - [Sales Lady] (murmurs) but it's pending FDA clearance, so hopefully by the end of April, May so we're hoping to launch in Europe and the US at the same time. - Oh my gosh! You guys can we work on this, can we get this cleared, because I need this immediately, especially the sleep tracking 'cause there isn't anything like this that I've ever seen. - Yeah and it has a 30 day battery life as well. - 30 days! I was gonna think like three! - [Sales Lady] Yeah. - This is awesome, I cannot wait until these are out and available to try because being able to track all of these things I think is very important. (rock music) We're now stepping into the world of smart home tech. (rock music) I was just showing them that you are on the back, you made this, this is your product? - Yup, yup it is. - How cool. - Oh they're so excited for my daughter see you on YouTube all the time. - What's her name? - Lila. - Hi Lila. - So it's a you know, it's exciting to you know like I was telling you earlier from one entrepreneur to another, I started this product downstairs in Eureka Park with a big bulky prototype, and now four years later I'm up here so. - It's so awesome. - Yeah. - Can you give us a demo? - Yeah, yeah so basically it's a BenjiLock, it's the worlds first traditional padlock with fingerprint technology, and you can open it with the ease of your fingerprint. But also with a set of traditional keys, so it's still very traditional, no app needed, no phone needed, if you feel it, it's pretty heavy, sturdy. - Yeah, it's substantial. - It's reliable, the technology to Hampton products, and they're known because they build all the Brinks locks security so you know that this is. - Legit, and you even have bike locks? - Oh yeah. - As well, which is really cool. - Oh yeah. - Because we live in Los Angeles and I'm always riding around on my electric bike, like you do. So this is pretty cool, oh yeah that's nice. - And it's the same technology, fingerprint, but also traditional key. - Oh. - Open, done. - That's so much easier than carrying around keys, 'cause I always loose them. Thank you so much for the demo and congrats. - Oh no, no thank you so much, I appreciate it. - Oh my gosh I just wanna give you a hug. - Oh yes, yes. - I'm so proud of you, even though I just met you. - Yeah. - This is so awesome. - Well that's the beauty of CES. - Yeah. - You just never know who gonna meet and it's just cool to see innovation and people like you that what you do I just admire it 'cause it takes a lot of hard work so. - Thank you, that's awesome. - It all evolves here at CES. - Well good luck, I'm sure I'll see you next year. - [Robbie] Thank you, thank you, appreciate it. (chilled music) - Hey, this is a smart potty, so glad that they put like a little protector here so you don't get sprayed. Oh it's spraying , it's spraying. Is this water? - Yes, not a problem. - Can I try some? I'm so thirsty, this is amazing. So is this just filtered? - [Sales Lady] Yes. - Oh that is really good. Now we're gonna head down to Eureka Park, this is one of my favorite places at CES, because this is where you actually see the future of things that you see here, all of the start up companies showing us some of their demos and concepts. It's amazing, we only have about 30 minutes, so hopefully we can cycle through and see some cool stuff. Right now everybody's actually leaving, because it's about to close, we have 20 minutes to see as much as we can see. (chilled music) - I'm Erica android on television, please enjoy CES today. - This here is providing happening feedback to what is happening in the game so I'm gonna go through here and see if I can find some people and if they shoot me I will actually feel it in my back, okay somethings happening, I think I'm walking over some rocks, so I can feel that in my legs, I think this guy needs to go away. (chilled music) There's so much to see here at Eureka Park that it honestly is overwhelming, but if you ever do come to CES, make sure you stop by and check out all of future tech. Safety always first. We're gonna check out the S-Pod, it's not actually running right now for demos but I'm gonna sit in it and get a picture. The Segway S-Pod, you guys know that I'm such a huge fan of Segway-Ninebot, I have their hoverboard, I even have the little Mario Kart mod that they have for their little hoverboards, but this is the S-Pod, this is it man, I'm gonna be cruising around getting coffee, see me pulling up to the Starbucks drive-through in this, I'll have a chai latte please, I can't wait to try this out for real. All right CES is over, I'm just gonna sit here for the next year.",
    "transcript_keywords": [
        "CES",
        "Alexa",
        "Yeah",
        "things",
        "Samuel L Jackson",
        "Alexa enabled",
        "cool",
        "Xbox",
        "guys",
        "Elgarto",
        "Great",
        "Justine",
        "Sleep",
        "Eureka Park",
        "Elgarto Corseair Origin",
        "capture",
        "pretty",
        "track",
        "Big",
        "Guy Fieri"
    ],
    "transcript_entity_values": [
        "SpO2",
        "Eureka Park",
        "one",
        "about 30 minutes",
        "the next year",
        "the end of April, May",
        "Unbox",
        "Elgarto",
        "Xbox",
        "three days",
        "Three days",
        "Starbucks",
        "later in the year",
        "Segway",
        "the Corsair Concept Orion",
        "Alexa",
        "YouTube",
        "US",
        "first",
        "BenjiLock",
        "this A7S II",
        "Lila",
        "zero",
        "these Elgarto Key Light Airs",
        "Amazon",
        "a hundred",
        "Brinks",
        "20 minutes",
        "4K60",
        "Corsair",
        "Corey",
        "4",
        "Amazon Echo Show",
        "Alexa",
        "YouTube",
        "several days",
        "Withings",
        "Origin",
        "today",
        "next year",
        "FDA",
        "Vegas",
        "the middle of the holidays",
        "Erica",
        "second",
        "Samuel L Jackson",
        "4K60",
        "Europe",
        "Justine",
        "CES",
        "Sony",
        "iPhone",
        "30 days",
        "2020",
        "three",
        "the S-Pod",
        "the day",
        "Los Angeles",
        "Nintendo Switch",
        "Mississippi",
        "Robbie",
        "60 degrees",
        "the past several years",
        "Alexa",
        "the Elgarto Corseair Origin",
        "150",
        "Nokia",
        "Smart Sleep Analyzer",
        "Samuel L Jackson Voice",
        "Shure",
        "Mario Kart",
        "33",
        "PlayStation",
        "Guy Fieri",
        "Eureka Park",
        "a hundred thousand",
        "between 90 and 100",
        "two",
        "Hampton",
        "30 day",
        "Jenna",
        "four years later"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "GPE",
        "ORDINAL",
        "ORG",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "DATE",
        "LOC",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "GPE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.04871511459350586,
        -0.08014940470457077,
        -0.018582288175821304,
        -0.12293311208486557,
        0.037277042865753174,
        0.013579200021922588,
        0.0644087865948677,
        0.04967084527015686,
        -0.01888417638838291,
        0.05945820361375809,
        0.026650767773389816,
        -0.01788865029811859,
        0.013275476172566414,
        0.004599825944751501,
        -0.0022973648738116026,
        0.023613397032022476,
        0.04341907054185867,
        -0.02939530462026596,
        0.0047498601488769054,
        -0.0015478836139664054,
        -0.043580323457717896,
        -0.06817007809877396,
        -0.010250035673379898,
        -0.0026767258532345295,
        -0.050867993384599686,
        0.08410705626010895,
        0.0030084054451435804,
        0.03605654463171959,
        -0.09020419418811798,
        -0.056751612573862076,
        0.001182718900963664,
        0.03778335824608803,
        0.08256209641695023,
        -0.009433102793991566,
        0.004364828113466501,
        -0.06867288798093796,
        0.05765063315629959,
        -0.014769931323826313,
        -0.030756648629903793,
        -0.043441057205200195,
        -0.002180529525503516,
        -0.07504916191101074,
        0.005768678616732359,
        -0.004476428963243961,
        -0.04648314043879509,
        -0.06739482283592224,
        -0.0038844142109155655,
        -0.09770143777132034,
        0.04817438870668411,
        0.04559038206934929,
        -0.07544367015361786,
        -0.054749827831983566,
        0.037135738879442215,
        0.0036149390507489443,
        -0.07083931565284729,
        0.03253976255655289,
        -0.09430180490016937,
        0.01688041351735592,
        0.04592108353972435,
        -0.06988868117332458,
        0.04140673577785492,
        -0.06688256561756134,
        0.007131398189812899,
        0.055287864059209824,
        -0.04038168117403984,
        -0.044743046164512634,
        0.011266345158219337,
        0.01254945620894432,
        0.00539163313806057,
        -0.022371388971805573,
        -0.12207776308059692,
        0.04702713340520859,
        -0.010549373924732208,
        0.022124482318758965,
        -0.007525003980845213,
        0.06700113415718079,
        0.06273066252470016,
        -0.056220222264528275,
        0.020257538184523582,
        0.01807238534092903,
        0.05016438663005829,
        -0.05936860665678978,
        -0.06842933595180511,
        -0.06341855227947235,
        -0.028469379991292953,
        0.0387149378657341,
        0.021950768306851387,
        -0.0005431154277175665,
        -0.01840926893055439,
        -0.06046721339225769,
        -0.09338836371898651,
        -0.004874803591519594,
        -0.012240062467753887,
        0.003943640738725662,
        -0.028845112770795822,
        -0.03625292330980301,
        -0.01615775004029274,
        -0.02354850247502327,
        -0.02203507535159588,
        0.06491155177354813,
        0.014321858994662762,
        -0.03305189684033394,
        0.025818753987550735,
        -0.05153711885213852,
        -0.055427003651857376,
        -0.09590427577495575,
        -0.026470009237527847,
        0.02562805637717247,
        0.014180470257997513,
        -0.0023840737994760275,
        -0.04823627322912216,
        0.0673653781414032,
        -0.07588917762041092,
        -0.07126394659280777,
        0.018486572429537773,
        0.11329758167266846,
        -0.02913118526339531,
        0.07097163796424866,
        0.06463304162025452,
        -0.009011897258460522,
        0.0032533290795981884,
        -0.08370985090732574,
        -0.042590152472257614,
        0.058480747044086456,
        0.007530093193054199,
        0.00613756338134408,
        -0.07264063507318497,
        1.28670390406015e-32,
        -0.03525189310312271,
        0.0833052471280098,
        0.01517153438180685,
        0.06365393847227097,
        0.014394155703485012,
        -0.01746746525168419,
        0.0029023168608546257,
        0.11093126982450485,
        -0.021157486364245415,
        0.007038393523544073,
        0.020722655579447746,
        0.04388502612709999,
        -0.061745211482048035,
        0.025507818907499313,
        0.01944071426987648,
        -0.06060541048645973,
        -0.03486450016498566,
        -0.05005284771323204,
        -0.0763414204120636,
        -0.006248803809285164,
        -0.0058020069263875484,
        -0.005875044967979193,
        0.024175412952899933,
        0.07876865565776825,
        0.12581922113895416,
        0.06507067382335663,
        0.05729429051280022,
        0.006215267814695835,
        0.07015441358089447,
        0.018038809299468994,
        -0.0614691860973835,
        -0.05785853788256645,
        0.0018621744820848107,
        -0.05270569771528244,
        -0.008303577080368996,
        0.00514047360047698,
        -0.041740793734788895,
        -0.00922966469079256,
        -0.0349513478577137,
        -0.029569128528237343,
        -0.019418278709053993,
        0.04427278786897659,
        -0.05159725993871689,
        -0.059643957763910294,
        0.06688424199819565,
        0.036281876266002655,
        0.04602727293968201,
        0.07249815762042999,
        0.009338773787021637,
        0.03666597232222557,
        -0.028747960925102234,
        0.005925212986767292,
        -0.0731680616736412,
        -0.0009979038732126355,
        -0.002406591549515724,
        -0.07834527641534805,
        -0.05891217291355133,
        0.0249796025454998,
        0.03084414452314377,
        0.03910660371184349,
        -0.004592159762978554,
        0.006184380501508713,
        -0.06787040084600449,
        -0.04467645660042763,
        -0.05339186638593674,
        0.1229773461818695,
        0.06853051483631134,
        -0.022803964093327522,
        0.04142924025654793,
        0.06217293068766594,
        -0.010454562492668629,
        -0.010119585320353508,
        0.057532988488674164,
        0.021611278876662254,
        0.0644247755408287,
        0.07123987376689911,
        -0.08735279738903046,
        -0.05348611995577812,
        0.012289552949368954,
        -0.033860113471746445,
        -0.10449690371751785,
        0.08435819298028946,
        -0.009875858202576637,
        0.10122586041688919,
        0.025881489738821983,
        -0.07185504585504532,
        0.022437533363699913,
        -0.009759053587913513,
        -0.01605423167347908,
        -0.0006041581509634852,
        -0.030112391337752342,
        0.04908052086830139,
        -0.06313234567642212,
        0.004891237709671259,
        -0.04335891827940941,
        -1.2436484847254068e-32,
        0.04528617486357689,
        0.03157193213701248,
        -0.011142579838633537,
        0.0031426786445081234,
        0.06918615102767944,
        -0.015449702739715576,
        0.03814861178398132,
        0.11320532113313675,
        0.09721612930297852,
        -0.05961170792579651,
        0.08604844659566879,
        -0.048157889395952225,
        -0.1086236983537674,
        -0.006667241454124451,
        -0.028955766931176186,
        -0.05665060505270958,
        -0.06834681332111359,
        -0.052474308758974075,
        0.04091791436076164,
        0.008485376834869385,
        0.10607026517391205,
        0.14440958201885223,
        0.05494995042681694,
        0.016774050891399384,
        0.011352717876434326,
        0.0288937296718359,
        0.017665667459368706,
        0.07365027815103531,
        0.051631826907396317,
        0.050495218485593796,
        -0.02740040421485901,
        -0.06537150591611862,
        -0.012385159730911255,
        0.021056612953543663,
        0.057762954384088516,
        0.01437736302614212,
        0.034230154007673264,
        0.017852751538157463,
        0.027583260089159012,
        -0.055668339133262634,
        0.018868403509259224,
        0.00666805449873209,
        0.0037350875791162252,
        0.010514182969927788,
        -0.007864014245569706,
        -0.08970732986927032,
        -0.035595573484897614,
        0.0020663815084844828,
        0.025081297382712364,
        -0.0006075308774597943,
        -0.04728033021092415,
        -0.06550648808479309,
        -0.041059404611587524,
        -0.006219006609171629,
        -0.019531261175870895,
        -0.012103124521672726,
        -0.06089873984456062,
        0.004128921777009964,
        0.035389650613069534,
        -0.005976371467113495,
        0.04162374138832092,
        -0.03268584981560707,
        -0.06766147166490555,
        -0.09493179619312286,
        0.03200048953294754,
        -0.059138089418411255,
        0.034481216222047806,
        0.040216606110334396,
        -0.011652062647044659,
        0.02734270878136158,
        -0.019348811358213425,
        0.009642084129154682,
        -0.01174564752727747,
        -0.038789212703704834,
        0.018844617530703545,
        -0.00831328984349966,
        -0.0616435743868351,
        -0.004433861467987299,
        0.09211938083171844,
        -0.03140106052160263,
        -0.05565321072936058,
        -0.005485521629452705,
        0.04018973559141159,
        0.06136016547679901,
        0.12559810280799866,
        0.1206480860710144,
        0.04870178550481796,
        -0.0544794537127018,
        -0.016750644892454147,
        0.027698466554284096,
        -0.007894913665950298,
        0.04969896748661995,
        0.07409637421369553,
        0.11014440655708313,
        -0.07642003148794174,
        -6.40153459130488e-08,
        0.017791617661714554,
        0.06432560086250305,
        -0.07568005472421646,
        0.009170611388981342,
        0.053285568952560425,
        -0.07839883118867874,
        -0.07017195224761963,
        0.017081553116440773,
        0.0754334107041359,
        -0.03494381159543991,
        0.0859774649143219,
        -0.0158039852976799,
        0.012239266186952591,
        0.1220916286110878,
        0.03346318379044533,
        0.020543785765767097,
        -0.12974882125854492,
        0.07483914494514465,
        -0.0423789843916893,
        -0.041559357196092606,
        -0.047232773154973984,
        0.06638117879629135,
        0.04234062880277634,
        -0.003763925051316619,
        0.030565286055207253,
        0.005759411957114935,
        -0.013733225874602795,
        -0.027358505874872208,
        0.05303708091378212,
        0.02383933961391449,
        -0.08556600660085678,
        -0.013865740038454533,
        -0.01485770009458065,
        0.003971003461629152,
        -0.02368704415857792,
        -0.05545453727245331,
        -0.07840889692306519,
        -0.014371435157954693,
        0.0340622141957283,
        0.009005972184240818,
        0.04329049587249756,
        -0.11420836299657822,
        -0.06239475682377815,
        0.04076593741774559,
        0.03502599149942398,
        -0.0788426324725151,
        0.02648361772298813,
        -0.08667854964733124,
        -0.09579923003911972,
        -0.053503476083278656,
        -0.05144159495830536,
        0.035493120551109314,
        -0.012957499362528324,
        -0.04065313935279846,
        0.03518424928188324,
        0.005701093934476376,
        0.03618112951517105,
        0.06345053017139435,
        -0.0033725700341165066,
        0.0014956152299419045,
        0.048030465841293335,
        0.0032201979774981737,
        -0.05405509099364281,
        0.04853074625134468
    ]
}