{
    "id": "nI-Bg6-SgLM",
    "title": "When Phones Were Fun: Motorola PEBL (2005)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-11-14T15:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=nI-Bg6-SgLM",
    "category": "Science & Technology",
    "tags": [
        "motorola pebl u6 review",
        "motorola pebl review",
        "moto pebl",
        "old phones",
        "vintage phones",
        "vintage mobile phone",
        "when phones were fun"
    ],
    "views": 581697,
    "likes": 22469,
    "comments_count": 1456,
    "description": "If you were old enough to know what a cellphone was in the year 2004, then you remember Motorola's iconic RAZR flip phone. But what you might not remember is that the RAZR was just one in a series of \"4LTR\" releases throughout the mid-oughts. These included, among others: the super-slim SLVR; the substandard ROKR; the ultra-premium AURA (covered in episode 2 of this series)  and a phone that looked nothing like any of its siblings, yet blended perfectly into the 4LTR family  because it looked like nothing else on the market, either. On this episode of When Phones Were Fun, were heading back to the latter half of 2005 to unpocket the plump, pudgy and perfectly precious Motorola PEBL U6!   [SPECIAL THANKS]  Avi Greengart:   Techsponential:   Andrew Martonik:    [SUBSCRIBE TO MRMOBILE]     [ABOUT WHEN PHONES WERE FUN  MOTOROLA PEBL U6]  This is the tenth in a series of MrMobile videos exploring the mobile tech world's most vibrant period in design and experimentation. In When Phones Were Fun, Michael Fisher re-reviews cellphones from the golden age of mobile, the decade-long span from the turn of the century to approximately 2009.  When Phones Were Fun: Episode 10 features a Motorola PEBL U6 press unit on loan from Avi Greengart, President and Lead Analyst at Techsponential. No company paid a fee or otherwise offered compensation in exchange for this coverage, nor did any company preview or approve this content before publication.   [LINKS]  Motorola PEBL U6 Review [Cnet]:   Retro Phone Review: Motorola PEBL [TechRadar]:   Stickiness: The Insulting Reality of Rubber Reversion [Polymer Solutions]:     [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #motorola #pebl #motopebl #u6 #tech #vintagephones #oldphones #whenphoneswerefun #2005 #moto",
    "description_links": [
        "https://twitter.com/greengart",
        "https://www.techsponential.com/",
        "https://twitter.com/andrewmartonik",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.cnet.com/reviews/motorola-pebl-u6-review",
        "https://www.techradar.com/news/phone-and-communications/mobile-phones/motorola-pebl-1299291",
        "https://www.polymersolutions.com/blog/stickiness-insulting-reality-rubber-reversion/",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- If you were an American who was old enough to be conscious of cell phones in the year 2004, then you remember the Razr. Motorola's 14-millimeter masterpiece set the cell phone world ablaze, propelling the company to height it hadn't seen since the StarTAC and casting such a long shadow that it spawned not one, but two Razr revivals over the next 16 years. In fact, I carry the most recent reboot today as a daily driver. But what you might not remember is that the Razr was just one in a series of four-letter releases from Motorola throughout the mid-aughts. Among others, you had the super slim Slvr, my first GSM phone, incidentally. The Moto Rokr, aka the iPhone that really wasn't. The ultra premium Aura covered in episode two of this series and this phone that looked like nothing else out there. On this episode of When Phones Were Fun, we're heading back to the latter half of 2005 to unpack it. The plump, the pudgy, the perfectly precious Motorola Pebl. (upbeat music) And you know the company is riding high when the packaging is this elaborate. - [Man] Ah, that doesn't get old. - But this particular Pebl, the first generation model U6 comes to me on loan from friend of the channel, Avi Greengart, and it's an almost new condition with one familiar and frustrating exception. Ughh Yep, rubber reversion is a frequent guest star on When Phones Were Fun, but in the case of the Pebl, it's particularly awful. Some colorways like this one came coated in soft touch rubber, which at the time made for a phone that everyone will want to feel of in the words of Total Mobile, but 16 years of storage later makes it quite a sticky wicket. It also picks up every bit of dust in the air there is. So no the phone isn't this dirty and neither am I, it's just par for the course when you re-review ancient phones. Also included in Avi's press kit. (laughing) Is there any more 2005 mobile accessory than a dedicated Bluetooth ear piece? I forgot about Bluetooth static. (laughing) This wasn't wasn't always fun. I might do a whole episode just on these at some point. Let me know in the comments, if that's something you'd watch. Meantime, this particular model is the Motorola H500 in a matching colorway. Nice. And because it also shares a mini USB charging format with the Pebl, Motorola through in this handy adapter. So you can charge both phone and earpiece at the same time. There's also a wrist strap in here which ordinarily I would ignore were it not for some advice from my friend, Andrew Martonik on Twitter, who informs me that with the Pebl, you can use the wrist strap to open the phone. Now to understand why that is, recall that most clamshells of the time included a fairly simple hinge. So opening them one handed meant wedging your fingernails in the seam between flip and phone body, and just kind of hinky. Oh, for Motorola, that wasn't good enough for this model. Thanks to a special hinge I've never seen on any other phone, you could just pull the flip down with your thumb to unlock it and then a spring inside the hinge would propel the phone open for you. Actually, yeah, if you weren't ready for it, it might just propel itself right out of your hand. And when you closed it, a couple of magnets would pull the two halves together with a delicate click. (phone clicks) Now there were other self opening phones on the market and Nextel in particular sold several push-to-flip clamshells also courtesy Motorola. But the Pebl's implementation was just so sleek and elegant by comparison. Apparently it was also a real headache for repair technicians because it was a devil to fix when it broke. But every time I clumsily open my Razr 5G, I wish this hinge design had made it into the modern era of foldables, if, for no other reason than allowing me to do this. (laughing) What do you know? (upbeat music) And once you got inside the phone, things got a lot more familiar and frankly a lot less impressive. By November 05, when the Pebl was still rolling out to many markets, Motorola's V3i refresh of the Razr was already out with upgrades like a megapixel camera and Micro SD slot. The Pebl's guts though, were essentially copied and pasted from the original Razr. Onboard storage of five megabytes with no expansion options. And despite the dedicated camera button on the side the VGA shooter was barely good enough even for caller ID photos. - [Announcer] Hey Michael, it's a pleasure to hear your voice. - Ah yours too, buddy. On top of that, even in 2005, Motorola wasn't known for a great interface or a particularly attractive displays on which to view them. The software is just layer upon layer of un-intuitive lists. I actually counted and it took a minimum of 13 clicks just to change your ringtone. The same task on my Samsung A600 took half as many keystrokes once you got to know it. The process taking place on a much more vibrant display, and that phone was two years older. (gentle upbeat music) At least, the ringtones themselves made up for it. (polyphonic music) And I'd be lying if I said I didn't appreciate the ability to skin the entire interface. Which is one of my fondest memories about the similar software from the Slvr. These days I'm a neon kind of guy, but back in the mid-aughts, you better believe it techno all the way. (gentle upbeat music) Of course, the Pebl wasn't really for the kind of customer who needed the fanciest feature set. Now those folks might've bought it's flagship cousins like Verizon's E815, or the much higher end Krzr which would debut the following year to wring the last drops of potential profit from the four-letter series. Not to mention the last few bucks from my own overstressed wallet. The Pebl was for the fashion forward flip phone buyer who thought 299 on contract was a fair price to pay for the things that device did well. Namely, take up as little space as possible in a pocket, make calls with a dedicated voice command button, charge its battery through a port on the top, like a weirdo, and look absolutely wonderful doing it. (gentle upbeat music) Now, sadly, unlike the Razr, the Pebl's legacy would ultimately be rather brief. Besides a forgettable budget model, Motorola eked out one proper sequel in the form of the Pebl U9, but slick though it was, it lacked the clever hinge and more to the point, by the time of its release in 2008, smartphones had really become such a dominant force in the industry that the new Pebl could only command half the asking price of the original. For dumb phones like this, the writing was on the wall. And the same would soon be true of Motorola, at least in its independent form. But to me, the Pebl is one of the best examples of why I love this period in mobile texts so much. It embodied the essence of its blockbuster sibling, even as it went completely in the other direction aesthetically with an ergonomic forward nature inspired design that very likely went on to influence some other milestone mobile products. Those are stories we'll tell another time, from the age when messages were instant, hinges were automatic and phones were fun. (gentle upbeat music) This video was made possible by a Pebl U6 device loan from Avi Greengart President and Lead Analyst at Techsponential and friend of the channel. Please join me in thanking him, and you can follow him at the link in the description. Also, please share your own memories of the Pebl, the Razr or other four-letter favorites in the comments. And if you want my take on some of Motorola's modern efforts, my Razr 5G and Edge Plus reviews are live at the Mr. Mobile. Subscribe to the channel so you don't miss the next ones. (gentle upbeat music) As always, Mr. Mobile works for you and not the manufacturers. No company received a preview, copy approval or provided compensation for this coverage. Until next time, thanks for watching. And if you can't stay home, then stay safe and keep that mask on when you're around others, while you stay mobile, my friends. (upbeat music)",
    "transcript_keywords": [
        "Pebl",
        "Motorola",
        "phone",
        "Razr",
        "precious Motorola Pebl",
        "Motorola Pebl",
        "phones",
        "cell phone world",
        "Mobile",
        "cell phones",
        "time",
        "American",
        "GSM phone",
        "phone world ablaze",
        "Avi Greengart",
        "Fun",
        "hinge",
        "Phones Were Fun",
        "Avi",
        "Avi Greengart President"
    ],
    "transcript_entity_values": [
        "Avi",
        "16 years",
        "the Motorola H500",
        "the mid-aughts",
        "Pebl",
        "Avi Greengart",
        "Aura",
        "half",
        "When Phones Were Fun",
        "the latter half of 2005",
        "Razr 5G",
        "Verizon",
        "U6",
        "GSM",
        "American",
        "Avi Greengart",
        "Slvr",
        "the Pebl U9",
        "2008",
        "four",
        "USB",
        "VGA",
        "Mobile",
        "Pebl",
        "Motorola",
        "14-millimeter",
        "13",
        "daily",
        "iPhone",
        "first",
        "Nextel",
        "Micro SD",
        "Michael",
        "two",
        "mid-aughts",
        "the following year",
        "The Moto Rokr",
        "299",
        "Pebl",
        "2005",
        "five megabytes",
        "the year 2004",
        "Total Mobile",
        "Andrew Martonik",
        "November 05",
        "un",
        "two years older",
        "Twitter",
        "Samsung A600",
        "E815",
        "Motorola Pebl",
        "one",
        "Razr 5G and Edge Plus",
        "Krzr",
        "the next 16 years"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "LAW",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.10605227202177048,
        0.02529090829193592,
        0.041833534836769104,
        -0.08882559835910797,
        -0.015052875503897667,
        -0.06436976790428162,
        0.026450758799910545,
        0.115208201110363,
        -0.04785133898258209,
        -0.02001701295375824,
        0.07000046968460083,
        0.050128016620874405,
        0.05543563887476921,
        -0.024600086733698845,
        -0.00410438934341073,
        0.004530780017375946,
        0.023823561146855354,
        -0.07664760947227478,
        -0.01653176359832287,
        0.005186085589230061,
        0.02007560431957245,
        -0.041531600058078766,
        -0.0016243539284914732,
        -0.0044990344904363155,
        0.014219212345778942,
        -0.0014638794818893075,
        -0.037795547395944595,
        0.04641949012875557,
        0.019826434552669525,
        -0.06645352393388748,
        0.02161608636379242,
        0.13904623687267303,
        0.05769402161240578,
        0.022013191133737564,
        -0.06939877569675446,
        -0.09144505113363266,
        0.007826630026102066,
        0.05688149109482765,
        -0.07371716946363449,
        -0.013158903457224369,
        -0.015132175758481026,
        -0.07015028595924377,
        2.981494617415592e-05,
        0.025285502895712852,
        0.006149162072688341,
        -0.020660262554883957,
        0.030954087153077126,
        -0.06132017821073532,
        -0.023654764518141747,
        -0.02649819850921631,
        0.02875337563455105,
        -0.030254051089286804,
        0.009962189011275768,
        0.022048039361834526,
        -0.07494188845157623,
        0.040372904390096664,
        -0.05122365057468414,
        0.02076360583305359,
        0.08006531000137329,
        0.04327372461557388,
        0.03923190385103226,
        -0.0073481337167322636,
        -0.050856463611125946,
        0.017056550830602646,
        -0.005262165330350399,
        -0.013772531412541866,
        -0.027096055448055267,
        -0.051792535930871964,
        0.008557562716305256,
        0.03559311106801033,
        -0.011828513815999031,
        -0.01577080972492695,
        0.030798859894275665,
        0.029129458591341972,
        -0.018134547397494316,
        0.0640314593911171,
        0.02961708977818489,
        -0.023772036656737328,
        -0.09636738151311874,
        0.029424548149108887,
        0.06675660610198975,
        -0.050920769572257996,
        -0.019840329885482788,
        -0.07161968946456909,
        0.06407516449689865,
        -0.029484858736395836,
        -0.003198218299075961,
        0.0027298624627292156,
        -0.07827603071928024,
        -0.053021788597106934,
        -0.05520369112491608,
        0.1257358342409134,
        -0.04332449287176132,
        0.02089436538517475,
        -0.051774732768535614,
        -0.03204613924026489,
        -0.020498555153608322,
        -0.07425147294998169,
        0.04169797897338867,
        0.05292779207229614,
        0.05292687192559242,
        -0.003725047456100583,
        0.06528571993112564,
        0.025859450921416283,
        0.05989665165543556,
        -0.09812881797552109,
        0.025694021955132484,
        0.035905830562114716,
        -0.00513498717918992,
        0.03140950947999954,
        -0.06799466162919998,
        0.016178710386157036,
        -0.009622122161090374,
        -0.016734514385461807,
        -0.08077336847782135,
        -0.09372495114803314,
        -0.10321400314569473,
        0.0543862022459507,
        0.08743943274021149,
        -0.02613196335732937,
        -0.01437514740973711,
        0.06091669201850891,
        -0.02968018129467964,
        -0.07592607289552689,
        0.040549688041210175,
        0.025716427713632584,
        -0.024712327867746353,
        2.3367448325194783e-33,
        -0.011149316094815731,
        0.1053556501865387,
        -0.047885797917842865,
        0.06481211632490158,
        -0.036736566573381424,
        0.046371959149837494,
        0.020299293100833893,
        0.009117931127548218,
        -0.022572167217731476,
        0.00010967733396682888,
        0.0061252536252141,
        0.010764610022306442,
        -0.02604670263826847,
        0.020392222329974174,
        0.05245991423726082,
        -0.08772522956132889,
        -0.09151060879230499,
        -0.03024601936340332,
        0.012992789037525654,
        -0.04968007281422615,
        -0.020958514884114265,
        0.024678358808159828,
        -0.015909912064671516,
        -0.0697050541639328,
        0.023944977670907974,
        0.06441472470760345,
        0.07222595065832138,
        -0.05833330750465393,
        0.0600426010787487,
        0.03166291490197182,
        -0.043431635946035385,
        0.07826636731624603,
        0.022690091282129288,
        -0.04197828099131584,
        0.010334678925573826,
        0.01202565710991621,
        -0.05260763317346573,
        -0.10245727747678757,
        0.013287481851875782,
        -0.02112145908176899,
        -0.008385611698031425,
        -0.017751745879650116,
        -0.10353134572505951,
        0.02658119797706604,
        0.04591398686170578,
        -0.017572036013007164,
        4.796528082806617e-05,
        0.07042554765939713,
        -0.020237015560269356,
        -0.029948793351650238,
        -0.007453836500644684,
        -0.04421709105372429,
        -0.023481199517846107,
        -0.00662396103143692,
        -0.03755071759223938,
        -0.0035389000549912453,
        0.04026306793093681,
        0.0008774340967647731,
        0.012017667293548584,
        0.014514557085931301,
        0.0486808642745018,
        0.09903179854154587,
        -0.03770582377910614,
        -0.031613875180482864,
        -0.04545252397656441,
        0.01167323999106884,
        0.020384876057505608,
        -0.05777662619948387,
        -0.09814728051424026,
        0.09150673449039459,
        0.03611985966563225,
        -0.04729858785867691,
        0.006107578985393047,
        -0.0990154966711998,
        0.09506413340568542,
        0.03300706297159195,
        0.017346948385238647,
        0.047897372394800186,
        -0.09352769702672958,
        0.006551267113536596,
        -0.00896398164331913,
        0.04065819829702377,
        0.018413081765174866,
        -0.0069438093341887,
        0.00621482590213418,
        -0.03981839492917061,
        0.028579900041222572,
        -0.08347825706005096,
        0.019587524235248566,
        0.08025950938463211,
        0.03344736620783806,
        -0.08351564407348633,
        -0.06202045455574989,
        0.028653567656874657,
        0.02662433683872223,
        -2.723891141897914e-33,
        -0.02590787038207054,
        -0.00015447221812792122,
        0.04708338528871536,
        0.10852868854999542,
        0.08673742413520813,
        -0.1115570217370987,
        0.037614673376083374,
        0.08194811642169952,
        -0.00675584003329277,
        -0.08244951069355011,
        0.07339711487293243,
        0.008905079215765,
        0.030138598755002022,
        -0.04770585522055626,
        0.05311667174100876,
        0.08558711409568787,
        0.0120322210714221,
        -0.0862988755106926,
        0.024848412722349167,
        0.05689791962504387,
        0.007971507497131824,
        0.018817896023392677,
        -0.045719824731349945,
        0.10934144258499146,
        -0.036679163575172424,
        0.02320345863699913,
        0.07371454685926437,
        -0.03459595888853073,
        0.026753604412078857,
        0.000895563920494169,
        -0.06351117044687271,
        -0.03461729735136032,
        0.04309489205479622,
        0.08164732158184052,
        0.0002895674842875451,
        0.014005143195390701,
        -0.014138641767203808,
        0.018574964255094528,
        -0.005323989316821098,
        -0.036348141729831696,
        0.003122116904705763,
        0.014357080683112144,
        -0.05755583569407463,
        0.018285004422068596,
        0.009273362345993519,
        -0.11252929270267487,
        -0.05212574079632759,
        -0.010154581628739834,
        0.0006761307013221085,
        -0.017949728295207024,
        0.0918445959687233,
        0.022678377106785774,
        -0.018570102751255035,
        -0.001998265041038394,
        -0.07489342242479324,
        -0.032089367508888245,
        0.07444769889116287,
        -0.08830626308917999,
        0.061455778777599335,
        0.010720626451075077,
        0.08336940407752991,
        -0.01622648723423481,
        -0.019304560497403145,
        -0.022150928154587746,
        -0.09058098495006561,
        -0.004553377628326416,
        0.10090767592191696,
        -0.03962593153119087,
        -0.07428286224603653,
        -0.015144411474466324,
        -0.06745919585227966,
        0.011400727555155754,
        -0.03459659218788147,
        -0.12074296176433563,
        0.06031915545463562,
        0.06141476705670357,
        -0.11248611658811569,
        0.03107655607163906,
        -0.05566170811653137,
        -0.012544247321784496,
        -0.00850891973823309,
        0.044903695583343506,
        0.022250352427363396,
        0.04403595253825188,
        0.0019978005439043045,
        0.03951199725270271,
        -0.003101412672549486,
        0.029871055856347084,
        -0.06820866465568542,
        0.01361117884516716,
        0.02633107826113701,
        0.029188720509409904,
        -0.04307892546057701,
        0.09285131841897964,
        0.032257210463285446,
        -5.167580852116771e-08,
        0.08563671261072159,
        0.005993404891341925,
        0.032787024974823,
        -0.045610420405864716,
        0.045698706060647964,
        -0.048023223876953125,
        -0.028694838285446167,
        0.0019010882824659348,
        0.07189328223466873,
        0.061219457536935806,
        -0.03945713862776756,
        -0.02568761818110943,
        -0.01894029602408409,
        0.06961356848478317,
        0.1099090427160263,
        0.12110400199890137,
        -0.0038075209595263004,
        -0.024752089753746986,
        -0.014321999624371529,
        0.08036273717880249,
        -0.019920112565159798,
        0.036921799182891846,
        0.05431097373366356,
        0.011479058302938938,
        0.058037448674440384,
        0.05404157191514969,
        -0.054380305111408234,
        -0.022351710125803947,
        0.09951543807983398,
        -0.015619073994457722,
        0.04148067533969879,
        0.015476387925446033,
        -0.029798295348882675,
        -0.07658771425485611,
        -0.0038076804485172033,
        0.023403482511639595,
        0.012606551870703697,
        -0.07245898991823196,
        0.04612753167748451,
        0.02749648131430149,
        0.07667896896600723,
        -0.07080427557229996,
        0.013038134202361107,
        0.05696811154484749,
        -0.060654137283563614,
        -0.05925358459353447,
        -0.05556919053196907,
        -0.12336180359125137,
        -0.02148379012942314,
        0.017972426488995552,
        -0.03549632057547569,
        -0.017689768224954605,
        -0.07835127413272858,
        -0.022726811468601227,
        0.06408654898405075,
        -0.06344005465507507,
        0.001745559391565621,
        -0.056014057248830795,
        -0.05089256539940834,
        0.005759271327406168,
        0.04425423592329025,
        -0.011134066618978977,
        0.006903039291501045,
        0.07332798838615417
    ]
}