{
    "id": "NIR1Yfvy2vQ",
    "title": "Roblox doesn’t want to be just a kids game | Decoder",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-06-27T14:00:24Z",
    "video_url": "https://www.youtube.com/watch?v=NIR1Yfvy2vQ",
    "category": "Science & Technology",
    "tags": [
        "roblox",
        "david baszucki",
        "david baszucki roblox",
        "roblox ceo",
        "roblox gameplay",
        "roblox david baszucki",
        "business",
        "david baszucki playing roblox",
        "david baszucki interview",
        "roblox server",
        "roblox discussion",
        "roblox news",
        "roblox commentary",
        "roblox games",
        "new roblox update",
        "roblox storytime",
        "roblox brookhaven",
        "podcast",
        "decoder",
        "the verge",
        "tech",
        "tech news"
    ],
    "views": 27164,
    "likes": 601,
    "comments_count": 145,
    "description": "With over 66 million daily users, the virtual world platform is now allowing experiences exclusively for people 17 and up. Whats driving Robloxs push to age up? We sat down with CEO David Baszucki to learn more. Listen to the full interview with all the classic Decoder questions wherever you get your podcasts. #business #roblox #interview   Read more:   00:00 Why Roblox is adding 17+ experiences 04:08 3D Simulation 13:30 How Robloxs CEO wants to keep the platform safe for kids 23:00 Generative AI and Westworld 27:50 Vision Pro, Quest and VR headsets  29:10 Infinite Robux?  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://trib.al/MAYdtKZ",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Let's turn to the news you guys recently announced, which is that for the first time, you're going to have 17 and up specific experiences on \"Roblox.\" - Yeah. - It's a big deal. Big picture, why do this now? - Actually, even five years ago, why do it? And probably five or six years ago when we weren't as big as we are today, we developed this theory all ages around the world not just playing, but ultimately learning, or going to work, or going to concerts or all of this stuff. so we developed this theory, there's so many ways to grow, and one is all ages. And we said, as we typically do, what would be the hardest way to do this? The easy way might be to split the platform, have an older \"Roblox\" or a younger one. The hardest would be to be so good at safety and civility across the platform that we could start supporting those older, more mature experiences. But I'm super optimistic that it supports that vision, that these types of, really, these types of platforms that \"Roblox\" are are future communication and connection platforms, and they're not just for six year olds. They're not just for 14 year olds. They're for 60 year olds. They're for 35 year olds. They're really for everyone. - You guys have been pointing out for the last year or so that your user base is shifting increasingly older. - It's almost natural. And the amount of usage we have, for example, in USA 9 through 12 is pretty staggering. There's still a lot of room for growth in USA 9 through 12, but historically, the opportunity we have in 17 and up, it's massive really. What has happened is what we've expected and hoped would happen is that as the quality of the product goes up, as search and discovery gets better, as developers make more interesting experiences, just like we grew organically with 9 through 12, we would see that with 17 and up and we've seen it. 17 through 24 USA, 35% year on year. It's really exciting. I met someone, 21 year old member of our family last week and he's like, \"Oh, 'Roblox.'\" He said, \"All my 21 year old friends are playing 'Roblox.'\" - Really? - I'm like, what is up with that? Like that is exactly- - What were they playing? - They were playing I think \"DOORS.\" They were playing \"Murder Mystery.\" He knew the names of these experiences, and it was an early touch point for me of that type of behavior we wanna see. - So are your users aging up? 'Cause I mean, \"Roblox\" as a company is a young adult now, right? - Yeah, yeah, yeah. - 'Cause \"Roblox\" has been around for a long time. So how much of it is that, is users aging up, which happens naturally on these social platforms, versus older, new ages coming? - I think we see both, right? We see the people who've been on \"Roblox\" for 12 years now, and a lot of our creators have been on the platform for 15 years, which is really, really cool. In this case though, this was like word of mouth. 21 year old friends like, \"Oh, go try this out.\" So I think they are both coming together. And as we get into 30 and up, less of those people have been on the platform before. - I was gonna say, I feel like I'm personally, I'm one of your like target users to come on the platform, 30, don't have kids yet. And as a gaming platform, I could see you eventually getting experiences that are compelling enough in their own right as like a first person type experience for someone my age. But how do you get all my friends on there? That's like, that seems like a tricky problem and a unique problem for you all as a company. How are you thinking about that social graph component of aging up? - Arguably just the gaming market is huge, and so there's arguably a company strategy where we're just gonna be the best at gaming. We have all these developers, they're starting to go from 1 to 5 to 10 to 100 person studio. - You've got studios merging now, which is- - Well, like VC-backed studio, like we have all of that. I think when we take a step back and we look at the history of technology, we believe it's much bigger than gaming. And we believe there's been a historical evolution of just how do people communicate and connect. We believe the next wave of this is 3D simulation communication, and there's inherent benefits of 3D simulation that I think all the young people on \"Roblox\" figured out 15 years ago. And that in 3D simulation, we can play hide and seek. We can go get a high school diploma and walk down the aisle. We can have a birthday party. We can pretend we're in the office together. Say we want to have a \"Roblox\" company meeting with 2,700 people, it's one thing to have everyone on Zoom or any video thing, it's very different to have 2,700 people feel like we're all in the same place. Me whisper to someone next to me, \"Hey, what do you think of Dave?\" kind of thing. Walk around, have all of that social stuff. So as far as body language cues, being in the same place, audio, I think there's just a lot of inherent benefits, and so I think it's bigger than gaming. It's how people ultimately communicate at work, how we go to school, how we go to concerts, a wide range of stuff. - There's already been, I don't know if you've seen this, some interesting reactions to this in the \"Roblox\" community, I think especially among your younger developers who have also noticed that at your gaming conference this year, for example, it's the first year that it's only 18 and up allowed. You're not allowing, you know, minors accompanied by adults this year. And so I think there's already some tension where people are going, does this aging up that's happening mean that \"Roblox\" is gonna leave behind the young developers who helped get the platform to where it is today? - I'm super optimistic that this isn't gonna be an issue, and I'm so optimistic because so much \"Roblox\" is starting to be used for computer science education. It's starting to work its way into not just coding education, but first robotics, for example. Like, not everyone has the ability to have the physical hardware to compete in robotics, doing that in a simulated way. Learning about traveling to Mars, mission to Mars. So I think there's just gonna be such continued educational groundswell. It's much bigger even than our developer community. I think for RDC, you're right, it's gonna be 18 and up. There's just a lot of, you know, it's becoming a grown up professional type event. But I think our roots are so much in the community, and you know, those younger people. There'll continue to be amazing 13 year old creators who, you know, start to make a living on \"Roblox\". I don't think there's any risk of that. - People spend, I think roughly, what, 3 billion a year or so on \"Roblox\". You've got your currency Robux. What are they buying? What are people, I think parents were sometimes wondering this too, like, what is my kid buying? - I mean, I think one of our innovations was to trust the creativity of our developers, and to trust, rather than being very regimented around what you might buy in an experience. Say if we provide the core platform and the infra, we'll be really surprised by it, and we continue to be really surprised by it. You know, in the early days we were like, \"Oh my gosh, someone's selling flashlights. That's really cool.\" Like, that's really interesting. You know, whatever our creators have sold, vehicles, clothing, you know, VIP passes, all of that, they continued to astound us with their creativity. And I think our creators are always very wisely balancing new users, fun, retention, without people spending, with those fun things that some people can buy on top of it. So one of my favorites was \"Bird Simulator.\" A long time ago in \"Bird Simulator,\" you could have all kinds of things. You pretend you're a bird, catch, you know, animals. What's it like to be a bird? And if you wanted to be an eagle sooner than later, you could pay a little to do that. So it's really astonished us at the- - I think it's astonished me too. I mean, you see just things that you're like, wow, it costs that much to have this virtual item in \"Roblox.\" - Well then, I think then we get out of the experience into virtual items, and I would say I have a personal thesis about virtual items, and I think it is astonishing that luxury goods can be so expensive, right? My son was telling me about a certain brand of watches that music stars wear that cost $250,000. I'm going like, whoa, I didn't even- - There are several of those. - Yeah, I didn't even know that. But what it highlights is that these behaviors in the digital world, once again, may start to mirror what happens in the physical world. And I think if you and I, for example, long-term spend one or two hours in the digital world and 16 hours in the physical world, it's arguably possible that our clothing, what we wear, we would prorate a value of that. And if I'm spending 5% of my time in the digital world, I might spend 5% as much digitally on what I'm wearing in the brand as what I spend in the physical world, and I think that supports some of the behavior we've seen. - On the developer side of making experiences, I've seen some analysis that the platform is trending towards fewer devs making more of the money. I'm wondering if that's something you're seeing in the data and if- - That is, that's a fun, I would say, misconception. - Okay. - And I've actually recently looked at the aggregated growth rate of top 10 devs, top 100 devs, top 1000 devs. And over the last three to four years, the growth rate in the spending of dev number 1000 is faster than dev number 10, and dev number 100's in the middle. Dev number 10 right now growing faster than our bookings year on year, which is super exciting. We want those devs to be growing their earnings. Dev number 1000 I think went from very small numbers three or four years ago to I think, you know, easily making a living now, and growth rates in the 2, 3, 4X over the last few years. So, that's a really sign of a healthy devs ecosystem. - Yeah, so that long tail is still important to the platform. - It's almost like you can imagine that long tail is, everything's accelerating. That long tail is accelerating even more rapidly. - Huh, okay. - Which bodes well for interesting content, bodes well for new experiences popping up. And so yeah, I guess if we ran the number, our ecosystem, which is gonna distribute over $800 million this year, supports a lot of developers. Like there are a lot of people making a living on \"Roblox\" right now. - How do you balance developers being able to advertise their experiences on the platform and ensure that that doesn't game discovery, that that doesn't become a pay to play? - I think it's so interesting. We do, I think we have an amazing discovery team that is focused on organic discovery and doing it as 100% objectively and, you know, fairly as possible. Like, we don't wanna be putting our finger on the scale here. I think we have some big innovations on discovery, on organic versus paid that we've been talking about. But I do think our long-term vision is 100% fair, 100% objective, and an appropriate balance of organic and paid discovery. - So it sounds like there's potentially big changes coming to how discovery works on \"Roblox\". - I would say long-term, it's just gonna get more and more fair. It's already very fair, but I think we're thinking at a scale of 10X when there's both brands buying for discovery, as well as young developers who just launch their own. Like how do we really balance a big brand wanting to spend a lot of discovery, and some up and coming dev in a really interesting way that gives us all of what we want? And I think we all want the same thing. We want that classic story of a young developer, just made their place, there's 200 people there. We want our organic discovery to bubble that up, whether, you know, it's sometimes called a one arm bandit or whatever, like get more and more people to see that. And we also want a brand to be able to advertise. So I think we're gonna be very thoughtful in making both of those possible. - I want to turn a little bit to regulation and moderation, two fun topics, and they kind of intersect. There's this huge push right now to really keep kids off the internet I would say in Congress here, especially in the US I'm talking about. There's like a COPPA 2.0 bill. There's all these talks that we should ban social media for kids. \"Roblox\" is right in the center of this debate with such a young audience. What are your conversations like with lawmakers on this? Is this something you guys talk about with them? How do you think about this? - I think we're in an exceptional position both from a company culture point of view, as well as from strategically what we're building as a platform. I mean, our civility people are out speaking in various forums, trying to take a leadership role in what's the vision for kids on the internet. And if you scan some of the places we're participating, you'll see us actually trying to drive the discussion here. There's an interesting thing around my belief of what we mean when we say social media, and social media means a lot of things. It can mean you and I sharing photos about our life, and everyone else looking at them and comparing them. It can mean you and I consuming short form video a lot, but it can also mean you and I hanging out and communicating in a virtual environment, and doing some of the things we do in the real world. What we saw over COVID, how do you stay connected with your friends or your grandparents? How do you have authentic communication? I think legislators are getting more and more savvy that social media isn't just one big thing. That it's a variety of things, some which are, once again, sharing imagery, some which are video, but some that are almost more akin to the phone system. How do we communicate? How do we stay connected? And so I'm optimistic about the direction we're going. I think I'm optimistic about a direction around civility, around safe communication, around learning with your friends. I think a lot of the things that people are starting to build on \"Roblox,\" I think are very positive things for the world, you know. - And it seems like you all are leaning heavily into age verification as a way to keep the platform safe, because you do have- - I think it's- - The potential for strangers to interact. - Yeah, I think it's safe to say that in many areas we lead with company values and vision ahead of legal restraint, you know. And I think we self correct well before legislation in many ways. So our voice rollout, we're being very, very thoughtful on that. Our 17 and up, as you noticed, full on photo ID verification, which is beyond probably most apps out there. But we believe, I think typically by doing this hard stuff that we start, you know, we do create this opportunity for this billion user platform that we're optimistic- - Let's be honest, the verification is also, it's a business growth barrier in the near term. Like if you were being purely capitalistic about it, you wouldn't try to do that, right? - We have this saying, optimize five year enterprise value. So, you know, like if we could say how do we optimize \"Roblox\" as enterprise value in 2028? It's probably what we're doing is gonna optimize that because we are eventually gonna get to larger and larger numbers of 17 through 24. We generate more than enough growth in cash to like say, (groans) we gotta let every 17 year old on right now. And so I do think it's a little bit of a long term optimization rather than short term. - I, like I said, don't have kids. I did talk to some friends who have kids on \"Roblox\" ahead of this to kind of hear about their experience as parents with kids on the platform. I heard a kind of reoccurring thing. They were like, \"You should ask David about this.\" What do you say to parents who have already witnessed their kids experiencing things on \"Roblox\" that are not age appropriate, that are not up to your standards as a company? Obviously you're not gonna catch everything. But who are now worried going, oh, and now they're going to, they're trying to age up the platform and get more mature experiences on. That was a thing I heard from several parents. - I would say since day one, we have zero tolerance for that kind of stuff. There's sometimes bad actors on our platform trying to get some content out. I'd say it's continuously getting better on our platform. We're not 100% perfect, but we're getting very, very, very good at that. I think 17 and up is gonna be very rigorous as far as who can access it. Any 17 and up content, once again, is gonna be gated by photo ID, so they're not gonna see that. But I would say we have zero tolerance and I think it's kind of our top priority. Our safety group and team is probably the largest group in the company right now, if not, and so it's a big focus for us. - Do you think like the more mature things like nudity will ever be allowed on \"Roblox\" in any way? - I think what I would say is we would lead first and foremost with safety and civility, and then second with mirroring what happens in the physical world, and so I would never rule it out. I would say getting to that kind of stuff probably isn't in the short term future for us. - Got it. With \"Roblox\" being such a UGC heavy platform in all ways and people creating items, creating literal virtual objects to the actual just interactions that human beings have as their avatars, what are some of the moderation challenges there? I imagine they're very unique to a platform like \"Roblox\" and you've built a lot of this in-house over the years. What have you observed and kind of how, when you first kind of started to really do moderation to where you've gotten now, like, was there a moment where you're like, we have to approach it this way? Like this is the only way we're gonna fix it. Like what was kind of, walk me through that journey of like how moderation started. - Yeah, the journey is pretty interesting. So imagine four of us in a small office in Menlo Park being live for about a month, and peak times maybe 50 people on the platform, and the temptation, okay, more engineering, more engineering. There's so much more stuff we can build. And then my partner Eric saying, \"We have to build a moderation system.\" And so it was actually a real values moment for us to say, okay, yeah, this is what we're gonna work on a month in, as we're growing. All the way to the point, probably for two to three months, the four of us, we were the moderators, and so we rotated being moderators every day as part of it, as we gained experience there. So it really started very early. I think it's always been a top focus for us. The challenges just get more and more complex all the time and we get better and better and better all the time, but the core value has always been there. - I don't think we've said the word metaverse yet, which is frankly amazing this far into the conversation. I think if we were having this conversation a couple years ago, we would've said it in the first like 60 seconds. So there's that, and then there's this whole generative AI thing, which is kind of the new metaverse in a way, in terms of it's a buzzword. I think there's a little more to it than that. Do you still, is \"Roblox\" a metaverse company and is generative, like how do those two ideas intersect and relate? - I like the notion that irrespective of the news cycle or what's been going on, our product development trajectory has been relatively consistent and smooth and straightforward. So I like the notion that what we were doing five years ago blends into what we're doing today in a smooth fashion driven by our own vision, rather than the news cycle. That said, on the metaverse angle, we do believe this new emerging category runs on all devices, which is really cool. It runs on, you know, phone, tablet, computer, console, VR, AR devices, all of that. So I think we've been very consistent there. Same on the AI thing in that our trust and safety team's been running all kinds of AI models for the last three or four years, both on quality and on cost. And we've gotten to the point where I think over 98% of the 3D models, for example, that are submitted go through AI scans that are more accurate than human scans right now. So this is both a quality and a cost benefit. We started rolling out more creation type AI, so both the material generation and code generation, but there's so much opportunity here. - Yeah. - And, I mean, we can imagine what it could be someday. There's that \"Westworld\" episode where someone sits down and says, \"Do this and do this.\" - [Alex] The narrative storyteller role. - [David] That's all gonna happen. - [Alex] You think so? - Absolutely, and it's gonna happen not just in Roblox Studio, it's gonna happen in all of the experiences made by \"Roblox\" creators as well. - It's so funny you brought up that because I've been thinking about that scene and that concept in \"Westworld\" myself with where the tech is going. You really do think we're gonna get to that point where people are speaking things into existence? - Absolutely, and I think what's unique about \"Roblox\" is those will not just be, you know, static things. Those will be functional scenarios. Those will be NPCs backed by AI. Those will possibly have logic in them, so. - How many years out do you think we are from a creator being able to type or speak a world into existence on \"Roblox?\" - I think we're very close, like, we're not five years out. - Wow. Wow. - It's less than that. - On competition, I'm really curious, I don't think I've heard you talk about this yet. Epic Games has their Unreal Editor for \"Fortnite\" and are doing some interesting things on the economic side too, in terms of how they're sharing revenue with creators, which is I think a net positive for the industry. - Yes, yes, yes. - Creators getting more money. They're approaching it differently than you all are, and they have kind of different use cases. What do you make of what they're doing with \"Fortnite\" and trying to turn it into more of an open world creator economy? - I would say we're so proud of kind of this leading platform we've arrived at with all of our developers and super proud about that. And we are also really proud of the notion that early on UGC for us was so important, and it has proven to be just such an innate thing ultimately that it's a big thing for everyone. So we're super proud of that. We continue to just be, once again, super proud of the economic opportunity on \"Roblox\" as well. We'll probably distribute over $800 million this year. We are starting to see these VC-backed studios. And I do think, you know, we invite all of the creators on \"Roblox,\" if I think about a creator and what are they thinking about, such a range of awesome creators out there. Okay, I'm 13, I want to try making something. Can I push it live and have it run in every language? And can I go viral? Maybe me and three or four people want to build something really interesting and go live. Or I run a 200 person studio and wanna both make my own stuff as well as brands, and can all of those work? Can all of those have a hope to not just being on a 60 million person platform, but a billion user platform? We're very thoughtful about all of them and I think like they're joining us in this really long term opportunity, so. - So you think you still have the most attractive revenue sharing arrangements and payouts in the market? - I think we have an amazingly attractive opportunity. - Well, the reason I just say that is 'cause I know it's different with the way they're doing it, but the percentages are different. And I'm wondering if with what they're doing, \"Horizon Worlds\" coming to mobile later this year, most likely. Do you see there being more competition in the rev share that you give creators? And is that something that \"Roblox\" will eventually change because of the competitive dynamics or do you think you don't need to? - I think what we wanna do as a public company is grow continuously bigger and bigger. I think we wanna offer those devs ultimately not a 65 million DAU platform, but a billion DAU platform. And I think we run the company in a way so the core expenses, cost of sales, you know, our employees, what we spend for infra are run so efficiently that the raw cash being generated, as much of that as possible can go to the devs. And so what I'm saying is I think it's bigger than just the percent distribution. I think it's what's the platform? And what's the total economic value going to those devs? I think it's, what's the size of the user base on the platform? I think it's the variety of what's the quality of the tooling? I think what's the opportunity for search and discovery? So it's so rich that I think rev share is a small part of it. - Got it. - And I think we're a little bit used to this. In the early days of \"Roblox\", when we continuously try to move as much money to the developer community, the only thing to compare to was the iOS App Store, which was 70/30, is very similar. You know, it's like, \"Well, why aren't you giving 70?\" Well, it's because we have infinitely sharding infra, and we have trust and safety, and we have moderation, and we have a lot of these other things that make it happen. So when I empathize with devs and imagine I'm devs, I feel very strongly about our opportunity. - Have you tried the Apple Vision Pro yet? - I have not. They're being very scarce with them. - They are, yeah. I was one of the lucky few. It blew me away visually. And I'm wanting to ask you about that because \"Roblox\" is technically available on VR headsets, but you really haven't embraced it I would say full throated as a company. Do you see an opportunity for \"Roblox\" in this category that is perhaps bigger than what you've done today? - I think the opportunity is really big to imagine a platform like this that runs on every device. And I think just like 2D HTML was early on, something that jumped from PCs to phone with the Apple iPhone, pinch and zoom and all of that. I think 3D immersive is that same way once again. Phone, tablet, computer console, living room, VR. So yeah, I'm bullish on VR in the sense that it offers super deep immersion. When I boot up a 8 to 10 year old \"Roblox\" experience that I might have made 10 years ago and go into it in VR, it's a whole new deal, like I'm here now kind of thing. So I would say we want to be on all platforms and we definitely want to be on VR and stay tuned. - Okay. Last question, this one is actually from my colleague's eight year old godson who- - Oh, the best question. - Wants to know, is there a way to get infinite Robux? - Yeah, so, (laughs) I'm looking at our team over there. So, like, this could be kind of like a really good educational opportunity, because imagine there's three, if I, as a parent, you could imagine, okay, there's a company, a company has shares of stock. There's the US and they have the money supply, and then there's \"Roblox,\" and in each one of those things- - What is \"Roblox\" in that analogy? - Well, there's interesting things in each one of those when you print infinite things. So if \"Roblox\" as a company printed another billion shares, there'd be a lot of dilution and- - That's right. - You know, our shares would be now worth two pennies. So, okay, the value of the company stays the same, more shares, less value. I won't get into the US money supply, but one could argue that if the US increased the money supply by 2X, the value of what you buy with a dollar might drop by 50%. - It might, we may be experiencing that. - Yeah, yeah, yeah, so we have to be careful. And so that's probably the reason why we can't give out infinite Robux is because if we did and one person had infinite Robux, the pricing of every item, everything our developers do would probably reduce by a factor of 100. - Kids, this is why it's important to learn about inflation. - That's right. - Yeah, all right, we're gonna leave it there. David, thanks so much for joining me. - Thank you. - Yeah, thanks. - So fun. - Thanks for having me. - Thank you.",
    "transcript_keywords": [
        "Roblox",
        "platform",
        "year",
        "people",
        "years",
        "things",
        "Yeah",
        "thing",
        "years ago",
        "company",
        "kind",
        "lot",
        "world",
        "devs",
        "experiences",
        "developers",
        "interesting",
        "discovery",
        "opportunity",
        "creators"
    ],
    "transcript_entity_values": [
        "zero",
        "RDC",
        "60 million",
        "over $800 million",
        "two to three months",
        "three",
        "Roblox",
        "USA",
        "the last few years",
        "2",
        "60 seconds",
        "Menlo Park",
        "13",
        "70/30",
        "60 year olds",
        "VC",
        "VR",
        "50%",
        "only 18",
        "50",
        "six year olds",
        "Murder Mystery",
        "70",
        "five or six years ago",
        "16 hours",
        "200",
        "the Apple Vision Pro",
        "number 1000",
        "30",
        "18",
        "35%",
        "65 million",
        "billion",
        "2,700",
        "12 years",
        "godson",
        "250,000",
        "3",
        "Robux",
        "12",
        "five year",
        "this year",
        "Fortnite",
        "1000",
        "first",
        "2X",
        "10 years ago",
        "UGC",
        "10",
        "the last three to four years",
        "30",
        "a month",
        "DAU",
        "AI",
        "a couple years ago",
        "VR",
        "the early days",
        "Epic Games",
        "US",
        "the Apple iPhone",
        "5%",
        "Eric",
        "eight year old",
        "100%",
        "Congress",
        "15 years",
        "two hours",
        "15 years ago",
        "last week",
        "the last year or so",
        "about a month",
        "second",
        "later this year",
        "Unreal",
        "21 year old",
        "17 year old",
        "4X",
        "Roblox Studio",
        "USA 9",
        "14 year olds",
        "8 to 10 year old",
        "3D",
        "one",
        "five years",
        "1 to 5 to",
        "four",
        "Westworld",
        "2028",
        "13 year old",
        "today",
        "two pennies",
        "Mars",
        "five years ago",
        "10 to 100",
        "year",
        "the years",
        "17",
        "the last three or four years",
        "day one",
        "two",
        "Dave",
        "Horizon Worlds",
        "35 year olds",
        "24",
        "David",
        "over 98%",
        "9",
        "the first year",
        "three or four years ago",
        "100",
        "3 billion"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "CARDINAL",
        "TIME",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "FAC",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "PERCENT",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "FAC",
        "EVENT",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "LOC",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY"
    ],
    "vector": [
        0.010856108739972115,
        -0.08835700154304504,
        0.012840675190091133,
        -0.09444939345121384,
        0.08401236683130264,
        -0.011592687107622623,
        -0.011973702348768711,
        -0.012073054909706116,
        -0.0009008803754113615,
        0.042571403086185455,
        -0.0714837908744812,
        0.0228115227073431,
        0.03189932554960251,
        -0.006741161923855543,
        0.04893031343817711,
        -0.0008377949125133455,
        0.12072928994894028,
        -0.062070172280073166,
        0.017169727012515068,
        0.0033658493775874376,
        0.019417164847254753,
        -0.06859275698661804,
        0.04088186100125313,
        0.016096841543912888,
        -0.018776724115014076,
        0.04424520209431648,
        -0.014065795578062534,
        -0.09421851485967636,
        -0.027971679344773293,
        -0.03863676264882088,
        0.021393585950136185,
        0.08739914000034332,
        0.08673486113548279,
        -0.07755480706691742,
        0.007875458337366581,
        -0.04459204897284508,
        0.019034355878829956,
        0.002046323614194989,
        -0.16746138036251068,
        -0.06931126862764359,
        -0.023087548092007637,
        -0.027277693152427673,
        -0.06026143953204155,
        -0.06106148660182953,
        0.01329829916357994,
        -0.078655906021595,
        0.02846430614590645,
        -0.09696085751056671,
        0.09637345373630524,
        0.05055169016122818,
        -0.03987056016921997,
        -0.12133612483739853,
        0.09200899302959442,
        -0.02827037125825882,
        -0.08133156597614288,
        0.05949941277503967,
        -0.06548583507537842,
        0.05910539627075195,
        0.07828204333782196,
        -0.03314598649740219,
        0.018740084022283554,
        -0.08953378349542618,
        -0.06983190774917603,
        0.03725355491042137,
        -0.002198242349550128,
        0.01875549927353859,
        0.029857074841856956,
        0.019590049982070923,
        -0.03297918662428856,
        -0.021836183965206146,
        -0.05142576992511749,
        0.004152396228164434,
        -0.000579236657358706,
        -0.0053979167714715,
        0.017489245161414146,
        0.018919289112091064,
        0.03223807364702225,
        -0.09244110435247421,
        0.03635447844862938,
        -0.05733895301818848,
        0.040084246546030045,
        -0.03872311860322952,
        -0.0430489107966423,
        0.006336572580039501,
        -0.00860738754272461,
        0.04418085888028145,
        0.021050147712230682,
        0.005411957856267691,
        -0.01686014235019684,
        0.0016548142302781343,
        -0.08880273997783661,
        0.018063608556985855,
        0.0603628046810627,
        0.04268458113074303,
        0.07886985689401627,
        -0.057327497750520706,
        -0.061648063361644745,
        -0.07153071463108063,
        -0.024534352123737335,
        0.02330094762146473,
        0.004057921934872866,
        -0.012292025610804558,
        0.07787663489580154,
        -0.036445166915655136,
        -0.021717123687267303,
        -0.008093695156276226,
        0.020056573674082756,
        0.04916060343384743,
        -0.0028268948663026094,
        0.03198090195655823,
        -0.07605421543121338,
        0.06567356735467911,
        0.06037227809429169,
        -0.02561148628592491,
        0.021644238382577896,
        0.040837135165929794,
        0.04069142788648605,
        0.08504407107830048,
        0.049341894686222076,
        0.025165194645524025,
        0.08502501994371414,
        -0.01713503524661064,
        -0.006050618831068277,
        0.023779889568686485,
        0.09482117742300034,
        -0.04709123447537422,
        0.006727505009621382,
        8.110686207379189e-33,
        -0.06118224188685417,
        0.07345669716596603,
        0.027098987251520157,
        0.037405259907245636,
        0.033592402935028076,
        0.02605437859892845,
        0.040459778159856796,
        -0.02719302847981453,
        -0.09984123706817627,
        0.002073188778012991,
        -0.03203023597598076,
        0.022066649049520493,
        -0.021372446790337563,
        0.08964947611093521,
        0.03507249429821968,
        -0.047231074422597885,
        -0.04435618221759796,
        0.03762787953019142,
        -0.10020451247692108,
        0.06623747199773788,
        0.06694117933511734,
        0.006834233645349741,
        -0.03353210538625717,
        -0.011227434501051903,
        -0.015593777410686016,
        0.04217994585633278,
        0.007635669782757759,
        0.01598857343196869,
        0.13421517610549927,
        0.03321634232997894,
        -0.13309508562088013,
        0.004069103393703699,
        -0.05355890840291977,
        -0.017644861713051796,
        -0.0024824209976941347,
        0.061227764934301376,
        -0.031090762466192245,
        -0.08453063666820526,
        -0.0753568634390831,
        -0.06546017527580261,
        -0.04090803861618042,
        -0.03917950019240379,
        -0.11031651496887207,
        -0.06951810419559479,
        -0.02405393309891224,
        -0.02622457966208458,
        0.06244470551609993,
        -0.033087436109781265,
        -0.03463248163461685,
        0.05720992386341095,
        -0.02187051996588707,
        0.05073960870504379,
        -0.11560443043708801,
        -0.07865265756845474,
        -0.010482188314199448,
        -0.046613454818725586,
        0.05206805840134621,
        0.015905652195215225,
        0.012789618223905563,
        0.023393630981445312,
        0.1174771785736084,
        -0.004294106271117926,
        0.03491264954209328,
        0.019487597048282623,
        -0.059285275638103485,
        0.04516453295946121,
        0.11811848729848862,
        0.026428407058119774,
        -0.016746945679187775,
        0.024243883788585663,
        -0.045378562062978745,
        0.01649063639342785,
        0.010514311492443085,
        -0.01305287703871727,
        0.05134812369942665,
        -0.026509827002882957,
        -0.029448868706822395,
        -0.019968435168266296,
        0.01211510505527258,
        0.07539241760969162,
        -0.012533443048596382,
        -0.01672525331377983,
        -0.006623811554163694,
        -0.027120552957057953,
        0.04580888897180557,
        -0.015765052288770676,
        -0.018633440136909485,
        0.0013755783438682556,
        -0.05630042403936386,
        0.017735911533236504,
        -0.057658251374959946,
        -0.10011130571365356,
        -0.0029745877254754305,
        0.11250873655080795,
        -0.06164892390370369,
        -8.717991404736108e-33,
        -0.06464190036058426,
        -0.01935446448624134,
        -0.009584294632077217,
        0.031108500435948372,
        -0.005617084447294474,
        -0.04148104041814804,
        0.021920358762145042,
        0.029821470379829407,
        0.022578390315175056,
        -0.10495127737522125,
        -0.0271584615111351,
        0.009394288063049316,
        -0.013631226494908333,
        0.036431893706321716,
        0.04384176805615425,
        -0.0528835691511631,
        0.08975090086460114,
        -0.06145750731229782,
        -0.04296882078051567,
        -0.0566897876560688,
        0.021775895729660988,
        0.09418848156929016,
        -0.1194915622472763,
        0.04861348867416382,
        0.027592256665229797,
        0.028021104633808136,
        0.04715714603662491,
        0.0916271060705185,
        0.05481090769171715,
        0.04708030819892883,
        -0.06467407941818237,
        0.0366690419614315,
        -0.03323482722043991,
        0.012071654200553894,
        0.07496416568756104,
        0.04447972774505615,
        -0.036974482238292694,
        0.060032185167074203,
        -0.03309355303645134,
        -0.04965626448392868,
        -0.00342527125030756,
        -0.05706727132201195,
        -0.05391784757375717,
        -0.03255261480808258,
        -0.04141046479344368,
        -0.02214008755981922,
        -0.04784832149744034,
        -0.04684734344482422,
        0.007273579947650433,
        0.029531780630350113,
        0.01724080741405487,
        0.03969366103410721,
        0.03324951231479645,
        -0.04955647140741348,
        -0.043323542922735214,
        -0.0051757353357970715,
        -0.0947859138250351,
        0.04102957993745804,
        0.1370401531457901,
        0.012758873403072357,
        0.026806196197867393,
        -0.007992984727025032,
        -0.021150263026356697,
        0.009420027956366539,
        -0.018514933064579964,
        0.013202660717070103,
        0.015397151000797749,
        0.036055248230695724,
        -0.04650615528225899,
        0.0064552114345133305,
        -0.002511597704142332,
        0.05803350731730461,
        -0.0554380789399147,
        -0.01389878336340189,
        -0.018054915592074394,
        0.030594708397984505,
        -0.041089076548814774,
        -0.0030026687309145927,
        -0.06759827584028244,
        -0.009434443898499012,
        -0.018807368353009224,
        0.004652800504118204,
        0.06082369387149811,
        0.06811654567718506,
        0.02055554836988449,
        0.04916946217417717,
        -0.025665469467639923,
        -0.016282949596643448,
        -0.007483083289116621,
        0.00523401191458106,
        0.002006440656259656,
        -0.04331588000059128,
        -0.08907244354486465,
        0.09414096921682358,
        -0.07002603262662888,
        -6.551857012482287e-08,
        0.0008418690413236618,
        -0.01586063764989376,
        -0.006655504927039146,
        -0.011217741295695305,
        0.02587185613811016,
        0.007883462123572826,
        -0.02916514128446579,
        -0.006025445647537708,
        -0.007193015422672033,
        0.04326622560620308,
        0.08724909275770187,
        -0.08160517364740372,
        0.013782099820673466,
        0.025605663657188416,
        0.11977307498455048,
        0.10891155153512955,
        -0.020711131393909454,
        -0.006801560055464506,
        -0.004421274643391371,
        -0.022040825337171555,
        0.067251056432724,
        0.011176737025380135,
        0.056205395609140396,
        -0.035683438181877136,
        0.02335478737950325,
        -0.027003994211554527,
        -0.03538215905427933,
        0.056467995047569275,
        0.010075894184410572,
        0.0014880639500916004,
        0.03811345994472504,
        -0.004204351454973221,
        -0.04535284638404846,
        -0.0035251141525804996,
        -0.05599012225866318,
        -0.038040366023778915,
        -0.027827546000480652,
        0.080454520881176,
        0.026851709932088852,
        0.002065518870949745,
        0.006809440907090902,
        -0.04727496951818466,
        0.060378823429346085,
        -0.0013454199070110917,
        -0.0725335031747818,
        -0.012850950472056866,
        -0.08273240923881531,
        -0.08571716398000717,
        0.024889806285500526,
        -0.01804327964782715,
        -0.014387071132659912,
        -0.0207446850836277,
        0.005879159551113844,
        0.020004620775580406,
        0.17756158113479614,
        0.026122014969587326,
        0.027589989826083183,
        -0.05382195860147476,
        0.011879305355250835,
        0.0827825665473938,
        -0.009749366901814938,
        0.010162786580622196,
        -0.06458420306444168,
        0.031882788985967636
    ]
}