{
    "id": "NJjpUnJRlAI",
    "title": "The Laptop you'll actually buy - Dell Inspiron 15 7000",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-21T17:45:21Z",
    "video_url": "https://www.youtube.com/watch?v=NJjpUnJRlAI",
    "category": "People & Blogs",
    "tags": [
        "Laptop",
        "Unboxing",
        "Dell",
        "Apple",
        "XPS",
        "Inspiron",
        "Gaming",
        "Work",
        "Notebook",
        "Lightweight",
        "upgradeable",
        "PC",
        "Windows",
        "Microsoft"
    ],
    "views": 742972,
    "likes": 20303,
    "comments_count": 2129,
    "description": "What do you actually want in a laptop when you really dig down to it. Do you want something that'll be your ultimate gaming machine or something that you can reasonably rely on every time you boot it up?   Buy Dell Inspiron 7000 On Amazon (Paid Link):  On Walmart (Paid Link):  On NewEgg (Paid Link):   Buy Dell XPS 15 On Amazon (Paid Link):  On Walmart (Paid Link):  On NewEgg (Paid Link):   iFixit Pro Kit:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/jMPTI",
        "https://geni.us/tmoB4hF",
        "https://geni.us/UIBE",
        "https://geni.us/VkNs",
        "https://geni.us/e9qE9m",
        "https://geni.us/YHZz6",
        "https://www.ifixit.com/linus",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- So the other day I'm watching a video for the Audi RS6 Avant and thinking, \"That's a really nice car that I'm never going to buy,\" because it's literally five times more expensive than a Golf GTI, and you get, what? It's definitely faster, it's better. But realistically, day-to-day, how different is it going to be? Which brings us to the Inspiron 15 7000, you know? It's definitely no RS6 Avant. But at the same time, it probably does everything that you need a laptop to do, so let's get into it and see if it actually lives up to that. Looking in here we've got, well, not a whole lot. We've got some basic cardboard that looks like it was recycled. And I think the power brick's over here. (grunts) That's 130 watts, so powerful but not super-duper powerful. So here it is. The Inspiron 15 7000. This one right here has, I'd say, respectable ports but nothing amazing. So we have an SD card reader. Turn that around so you guys can see it. So we have an SD card reader, USB Type A, combo headphone/microphone port. Around the other side we have full-size HDMI, two USB Type As and... Ooh, a Thunderbolt port! You normally don't expect to see that on something that's at this price. This is just over $1,000. So have that context when we go into this. Does it feel like an XPS 15? Of course it doesn't, this thing is not made out of carbon fiber. But at the same time, it feels pretty damn good. I'm giving it a lot of flexing, twisting right now, and it's really not giving up. The actual screen isn't the stiffest. I'm pretty sure that's all that's, yeah. The screen isn't super-duper stiff, but also, who is doing this all day long? I'm not, and I don't believe it's touch, yeah. It's not a touch screen, so you don't really have to worry about that too, too much. It looks like there's a very small amount of the thing that a lot of laptops do these days, where it lifts up the base as you open the screen, although it kind of looks like it's more so just a thing that happens as opposed to a feature. There's rubber right here, but it has such a small amount of lift that I can't really imagine that it's doing anything for the thermals or the keyboard position or anything. So we're looking at a Core i7-9750H, which is a six-core processor and pretty damn fast, I would have to say. It's not gonna, you know... It's not an eight-core processor, it's not a 9980HK or whatever, but I imagine for the vast majority of people, if you want to, well, surfing the web, obviously, it's gonna be good enough, but probably, what would you say, Mark? This is probably good for light video editing? Actually, kind of intense video editing, really? What would not be fine is that only has eight gigabytes of RAM, and we can fix that later. We'll get there. For a disk we get a 512 gigabyte NVMe SSD, which is actually fairly nice to have at this price point. You'd normally expect to see like 256 and maybe a hard drive, something like that. We've got Intel Wireless, which probably means it's pretty good. I believe it's 2x2. I don't think we get Wi-Fi 6, but it's probably more than fast enough for basically everyone. And finally, the most disappointing part of the whole thing, the Nvidia GeForce GTX 1050. It's a 1050, come on guys. I would've been way happier if they had included a 1650. I think the 1650 is 40, 50% faster than a 1050? That's the kind of performance that can actually deliver a good gaming experience, whereas for this right here you're going to be like, well, I don't know, I have a \"Stardew Valley\" background on here, so you're going to be playing \"Stardew Valley\" or, I don't know, \"DotA,\" \"CS: GO\" or something like that, and not super-duper well. (sighs) The 1050. Nyeh, it's just kind of disappointing. But at the same time, this isn't a gaming laptop. You're not going to be using it to game all day, every day. Ooh, there's a calculator button. Right here, any time that you need to calculate something, you're just, boop! This is my new favorite feature. Oh yeah, clear, get right back in, plus, minus. Oh, that works nicely. I'm glad they thought of that, and I'm also really glad it has a number pad. I feel like way too many laptops these days just completely give up on it, even though they might have the space. I personally use it all the time. I dunno, my background is in engineering, so I think of using Excel and MATLAB all day as kind of like the main use case. Other people might not be doing that, but even so, even just the enter key here? I really like hitting it with my thumb. I'd say everything that I've felt so far just kind of works. Like this trackpad is not glass-topped and the click doesn't feel great, but at the same time it's pretty large, given, and I really can't complain about how it feels. It's just a trackpad. (laughs) As for the keyboard... Notepad. Just kind of feeling the keys. It feels like the stability is pretty good. If you really press down, there is definite movement, although when I'm actually typing I would say it is totally acceptable. Let's get back to the whole problem that I was talking about before, where this thing only has eight gigabytes of RAM. Brr-brew. Hopefully these are all the same type of screw. Ha ha, there we go. Yeah, definitely guitar pick required to get this one apart. So close, this thing's a jerk. Oh, don't turn on! This is really not a good time to turn on. Why do you keep on turning on? Oh! (laughs) All right, let's get you turned off. This is absolutely not the time for this, Dell. Shut down and stay shut down, holy crap. So I guess now, while we are in here, it's a 56 watt-hour battery, which is pretty good in this price range. Actually, that's exactly what you get in this price range, basically. We have eight gigs of 2066 memory in here. Right here I've got 16 gigs of DDR4 2066 memory from Timetec. They're just cheap RAM that you can get on Amazon, basically, that's kind of the whole selling point. One of these guys right here is $31, so the whole kit was $62. Hopefully we can just toss one of them in and it'll be happy. We might need to put in the whole kit because RAM just doesn't always play nice with other RAM. And then we also have another M.2 slot here, so you could actually have a lot of storage in this thing quite easily, between a hard drive, two M.2s, maybe put them in RAID 0. I'm actually pretty happy with this as far as a budget. Very upgradable little laptop. I'm gonna put this back on, although...(laughs) I just want to take it out, this SSD is hilarious. Just look at that! 512 gigabytes in this thing. If you showed me that a couple years ago I'd have been like, \"No way.\" How do they even do it? Is it DRAM-less, that's a great question, actually. It's probably the exact same one that was in the Dell system that we got from Best Buy, and it probably is DRAM-less but uses the memory on the computer, like it talks to it. Could you, yes, you can definitely upgrade this to full size. If you look here, you can just move the little mounting bracket back here, and the heat sink travels the whole length, so you won't have any issues if you want to put in a full-sized M.2 drive in here. Yep, there we go. Didn't touch the power button but it's already turning on. This thing just absolutely loves to... Warning, oh! Warning, the amount of system memory has changed. It most certainly has, that's a good warning right there. Let's just hit Enter. It looks like we're gonna get away with just putting in only one of these sticks of RAM. Which means that, really, six cores? Well, the 1050. But, you know, six cores. You're gonna be able to do quite a bit with this thing once you have enough RAM in there. For the same price, you can get a gaming laptop that's more powerful, if that's what you're going for. This is probably powerful enough for almost everyone, unless all that you plan on doing is gaming. I'd say that the main advantage of going with the Inspiron over, say, a G5 or something like that... Is that it just doesn't look stupid. You can take this thing right here into office hours with your prof, and they're going to be like, \"Oh, this person wants help,\" instead of, \"Oh, this person is probably struggling \"because they've been playing 'League of Legends' all day.\" It's not the best machine ever. It's not made out of frickin' carbon fiber. At the same time, it's gonna do basically everything that you need, as long as you don't need the most powerful gaming laptop around. For $1,000 I'd say it's pretty solid. I guess that about wraps it up here. Get subscribed, hit the like bell, whatever. Do we have an outro for this? - This is it. - This is it, all right. See ya later.",
    "transcript_keywords": [
        "Golf GTI",
        "thing",
        "RAM",
        "time",
        "good",
        "pretty",
        "kind",
        "pretty good",
        "GTI",
        "Audi",
        "Golf",
        "day",
        "USB Type",
        "laptop",
        "Inspiron",
        "price",
        "gaming laptop",
        "gaming",
        "Avant",
        "powerful"
    ],
    "transcript_entity_values": [
        "Wi-Fi 6",
        "G5",
        "Excel",
        "512 gigabytes",
        "XPS 15",
        "130",
        "Nvidia GeForce GTX 1050",
        "Intel Wireless",
        "Timetec",
        "all day",
        "One",
        "RAM",
        "Inspiron",
        "Thunderbolt",
        "one",
        "1050",
        "Mark",
        "56 watt-hour",
        "31",
        "Amazon",
        "40",
        "1650",
        "7000",
        "eight gigabytes",
        "just over $1,000",
        "9980HK",
        "15 7000",
        "2x2",
        "512 gigabyte",
        "1,000",
        "2066",
        "Audi RS6 Avant",
        "256",
        "Nyeh",
        "MATLAB",
        "these days",
        "HDMI",
        "16",
        "USB Type A",
        "two",
        "62",
        "no RS6 Avant",
        "a couple years ago",
        "hours",
        "50%",
        "only one",
        "SD",
        "six",
        "five",
        "eight",
        "Dell",
        "Best Buy",
        "SSD"
    ],
    "transcript_entity_types": [
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.07651004195213318,
        0.021059321239590645,
        -0.016666514798998833,
        0.0026496995706111193,
        0.09080809354782104,
        0.015614941716194153,
        0.004298969637602568,
        0.05027158185839653,
        0.05159981921315193,
        0.012162836268544197,
        0.002618643455207348,
        0.022252677008509636,
        0.02200591377913952,
        -0.013314063660800457,
        0.10007327049970627,
        -0.010523620061576366,
        0.07885663211345673,
        -0.08316180855035782,
        -0.0391131192445755,
        -0.0219228845089674,
        -0.03775953873991966,
        -0.07958796620368958,
        -0.022805191576480865,
        0.031355224549770355,
        -0.006053074728697538,
        -0.03940019756555557,
        0.022167187184095383,
        0.00022364409232977778,
        -0.06592297554016113,
        -0.0060514044016599655,
        -0.05216457322239876,
        0.033431410789489746,
        -0.023031722754240036,
        -0.01210679393261671,
        -0.030443182215094566,
        -0.08137374371290207,
        0.05812293663620949,
        -0.09120669215917587,
        -0.002868230687454343,
        -0.09247411042451859,
        -0.01592770777642727,
        -0.05378182232379913,
        -0.03585392236709595,
        0.024080578237771988,
        0.03227633610367775,
        -0.03004325181245804,
        0.019776571542024612,
        0.04767414927482605,
        -0.0009224905516020954,
        0.003979733679443598,
        -0.05340775102376938,
        -0.035788536071777344,
        -0.003199630416929722,
        -0.02274465747177601,
        -0.058948203921318054,
        0.07061294466257095,
        0.012407416477799416,
        -0.031964194029569626,
        -0.0077590360306203365,
        0.00629579508677125,
        0.003208363428711891,
        -0.18055513501167297,
        -0.017475591972470284,
        0.055223625153303146,
        -0.005477827042341232,
        -0.07624603062868118,
        0.03550738841295242,
        -0.03864918276667595,
        -0.07557546347379684,
        0.056262653321027756,
        0.005785616114735603,
        0.05397180840373039,
        -0.0007893131696619093,
        0.06567783653736115,
        -0.010634706355631351,
        -0.03135649487376213,
        0.1065046489238739,
        -0.020625770092010498,
        0.001094384235329926,
        0.05158703401684761,
        -0.0058967601507902145,
        0.03643316403031349,
        -0.001405342947691679,
        -0.04217775538563728,
        -0.020074626430869102,
        -0.002893649274483323,
        0.013068889267742634,
        0.021329551935195923,
        -0.02180609293282032,
        -0.07540778070688248,
        -0.025769658386707306,
        0.05309734493494034,
        -0.012245257385075092,
        0.00030996857094578445,
        -0.013924003578722477,
        0.09588466584682465,
        0.0032615920063108206,
        -0.055110011249780655,
        0.005041392054408789,
        0.011277254670858383,
        0.04726068675518036,
        0.008547767996788025,
        0.10863502323627472,
        -0.04648860916495323,
        -0.04933225363492966,
        -0.046372897922992706,
        -6.718649819958955e-05,
        0.08399703353643417,
        -0.00509140407666564,
        -0.004681816324591637,
        -0.050180815160274506,
        0.011011076159775257,
        0.03402180224657059,
        -0.004324082285165787,
        -0.06835200637578964,
        0.05431016534566879,
        -0.031528327614068985,
        0.02704235352575779,
        0.12434791028499603,
        0.07068723440170288,
        0.003175044432282448,
        -0.02872081659734249,
        0.052554234862327576,
        0.03559490665793419,
        -0.03570551052689552,
        0.013078076764941216,
        -0.051897164434194565,
        1.878496726950641e-33,
        -0.020637143403291702,
        0.06007302924990654,
        -0.026590663939714432,
        -0.046643298119306564,
        -0.05265604704618454,
        0.0203519556671381,
        0.0430314727127552,
        -0.006339795887470245,
        -0.019915830343961716,
        0.007423514500260353,
        -0.10145766288042068,
        0.012632772326469421,
        -0.1024092584848404,
        0.05223461985588074,
        0.10422881692647934,
        -0.006613980513066053,
        -0.1014053225517273,
        -0.007733158301562071,
        0.0003795634547714144,
        0.029461773112416267,
        0.04986904188990593,
        0.02295694127678871,
        0.03737742081284523,
        -0.045186061412096024,
        0.056209444999694824,
        -0.0382385179400444,
        0.01364559680223465,
        0.01506863348186016,
        -0.03398345783352852,
        -0.01867791824042797,
        -0.04081367328763008,
        0.010769784450531006,
        -0.007776674814522266,
        -0.05802775174379349,
        0.015528031624853611,
        -0.033729396760463715,
        -0.024856124073266983,
        -0.08569727092981339,
        0.011751757934689522,
        -0.04606594517827034,
        -0.046723175793886185,
        0.0869641825556755,
        -0.0632229745388031,
        -0.05873288959264755,
        0.032803189009428024,
        0.05625380203127861,
        -0.03380988910794258,
        0.010524636134505272,
        -0.0009774036007001996,
        0.0009952683467417955,
        -0.10419193655252457,
        0.09025558829307556,
        0.023393262177705765,
        -0.029319988563656807,
        -0.08601837605237961,
        -0.014615501277148724,
        0.08438005298376083,
        -0.05433483049273491,
        0.07054512947797775,
        0.052773505449295044,
        0.004675526171922684,
        -0.04508985951542854,
        0.05761668086051941,
        0.008815193548798561,
        -0.07003472000360489,
        0.09235341101884842,
        0.060277171432971954,
        0.04703304171562195,
        -0.08354487270116806,
        0.05200236290693283,
        0.002644321881234646,
        -0.049263738095760345,
        0.027699895203113556,
        -0.04332854226231575,
        0.06469650566577911,
        0.027797717601060867,
        -0.11786210536956787,
        -0.02579745464026928,
        -0.011066975072026253,
        -0.009973609820008278,
        -0.06756971031427383,
        0.037413809448480606,
        -0.03623717650771141,
        0.05116352438926697,
        0.0342506542801857,
        0.07784286141395569,
        -0.01587511971592903,
        -0.030216727405786514,
        0.041898444294929504,
        -0.06426464766263962,
        -0.0026824886444956064,
        0.009017746895551682,
        -0.016941053792834282,
        0.051247451454401016,
        0.0536016970872879,
        -4.4518696743166e-33,
        0.0018085152842104435,
        -0.06476175040006638,
        0.040367890149354935,
        0.10468997806310654,
        0.012978870421648026,
        0.021185776218771935,
        -0.04077715799212456,
        -0.054472796618938446,
        0.006740079261362553,
        0.04542919993400574,
        -0.04464840516448021,
        0.08450476825237274,
        -0.020364034920930862,
        0.049913544207811356,
        0.012732250615954399,
        -0.021792693063616753,
        -0.011667686514556408,
        -0.10280881077051163,
        0.06746652722358704,
        -0.03279741853475571,
        0.0507880337536335,
        0.019155357033014297,
        -0.051333118230104446,
        -0.0455097071826458,
        -0.003454824909567833,
        -0.06521987915039062,
        -0.04269072413444519,
        0.0037140927743166685,
        0.0024439769331365824,
        -0.038962673395872116,
        0.0030070350039750338,
        -0.05678638070821762,
        0.021373284980654716,
        0.035322196781635284,
        0.10425864160060883,
        -0.02810213901102543,
        0.059552524238824844,
        -0.01693764701485634,
        0.04990236461162567,
        0.025899630039930344,
        0.05641471967101097,
        -0.0021870513446629047,
        0.006346635986119509,
        -0.01582852378487587,
        0.08737734705209732,
        -0.04294443875551224,
        -0.04750428721308708,
        -0.13599619269371033,
        0.048916690051555634,
        0.031018998473882675,
        0.012653780169785023,
        0.004263641778379679,
        0.03735603764653206,
        0.015505866147577763,
        -0.10065561532974243,
        -0.10693760961294174,
        -0.08194224536418915,
        0.048760030418634415,
        0.022402804344892502,
        -0.014658471569418907,
        -0.01655009388923645,
        0.06198407709598541,
        -0.042685747146606445,
        0.055745307356119156,
        -0.04906576871871948,
        -0.0570228211581707,
        0.02931523695588112,
        -0.01259986124932766,
        -0.000914926000405103,
        -0.05289652198553085,
        -0.1278737634420395,
        -0.08544018864631653,
        -0.01695409044623375,
        -0.06419069319963455,
        -0.11842373758554459,
        0.042956676334142685,
        0.09265528619289398,
        -0.016822434961795807,
        -0.011752914637327194,
        -0.006150478962808847,
        -0.008030387572944164,
        -0.03650069609284401,
        0.036550190299749374,
        -0.005414035636931658,
        -0.02567923255264759,
        0.027649354189634323,
        0.009127556346356869,
        -0.013616863638162613,
        -0.01012918259948492,
        -0.009470446035265923,
        0.020285245031118393,
        0.05623134225606918,
        -0.06322323530912399,
        0.0015653016744181514,
        -0.07299327105283737,
        -5.49469980626327e-08,
        0.03942060098052025,
        -0.035259366035461426,
        0.006335024256259203,
        0.0871458500623703,
        0.02705756016075611,
        -0.0733792632818222,
        0.012862840667366982,
        -0.014470458962023258,
        0.06215273588895798,
        0.04425840824842453,
        0.0873933658003807,
        -0.10312829166650772,
        0.02443627640604973,
        -0.008843188174068928,
        0.0006761408876627684,
        0.07940656691789627,
        0.006987826433032751,
        0.034482814371585846,
        0.03406904265284538,
        0.049726299941539764,
        -0.006213374435901642,
        0.06231561303138733,
        0.10858770459890366,
        -0.004686834756284952,
        -0.027265848591923714,
        -0.030006257817149162,
        -0.05291159823536873,
        -0.01606777310371399,
        0.03123473934829235,
        0.02565133012831211,
        -0.05932734161615372,
        -0.0098654730245471,
        0.05178423225879669,
        0.0018958894070237875,
        0.03594300150871277,
        -0.07764571160078049,
        -0.022356124594807625,
        0.06540615856647491,
        0.10228926688432693,
        0.04371672868728638,
        0.01797780767083168,
        -0.059211697429418564,
        -0.0395137257874012,
        -0.03822065517306328,
        0.041985735297203064,
        -0.04885009303689003,
        -0.0809900164604187,
        -0.15074220299720764,
        -0.009280821308493614,
        0.11724203824996948,
        -0.005528551526367664,
        -0.02707512117922306,
        0.035309989005327225,
        0.011796681210398674,
        0.06926991045475006,
        0.0021720656659454107,
        -0.0503031425178051,
        0.07032273709774017,
        0.02355663850903511,
        0.07012709230184555,
        0.09100192785263062,
        -0.12875723838806152,
        0.024423550814390182,
        0.07283908128738403
    ]
}