{
    "id": "Nk9877d2rJw",
    "title": "Under Display Cameras are getting Scary... Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-08-16T13:45:02Z",
    "video_url": "https://www.youtube.com/watch?v=Nk9877d2rJw",
    "category": "Howto & Style",
    "tags": [
        "Under screen camera",
        "under display camera",
        "axon 30",
        "axon 30 ultra",
        "galaxy fold 3",
        "fold 3",
        "android",
        "mobile phone",
        "gaming",
        "best midrange phone",
        "durability test"
    ],
    "views": 904869,
    "likes": 43926,
    "comments_count": 3186,
    "description": "Under display cameras are crazy! Go to  click on the Microphone at the TOP of the homepage and type in JERRYRIG to start your four week trial Plus free postage and digital scale! Huge thanks to Stamps.com for sponsoring this video.  The new Axon 30 is the first phone to be rocking a 2nd gen under screen camera. Last years Axon 20 was pretty good at hiding the camera unit but this time around... its pretty invisible.   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://Stamps.com,",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we'll be getting a special first look at the ZTE Axon 30, with a Second Generation under display camera, where the front facing camera is actually looking up through the AMOLED pixels to get an image. Pretty futuristic stuff. Of course we'll see how it works and how durable it is, but first let's check out the quality. You may or may not have noticed but I've been filming with the ZTE Axon 30's under display camera this whole time. You might not have noticed, or maybe you were already trying to change YouTube's quality settings. But at the same time, keep in mind that this is pretty darn good. Especially when you remember that it's looking up through 7 layers of screen in order to get this image. While you keep analyzing the quality of this under display camera, huge thanks to Stamps.com for sponsoring this video. Stamps.com is giving away 5 pound electronic scales similar to this one, and a bunch of free postage along with their 4 week trial of Stamps.com. Stamps.com is able to bring the services of the United States Postal Service and UPS right to your computer. So if you regularly send letters or packages for your business or side hustle, it's pretty easy to join the over 1 million businesses that are using Stamps.com. It's really nice to not have to stand in line at the post office because everything can be printed right here at home from my own computer. Stamps.com has discounts of up to 40% for the United States Postal Service, and 66% for UPS. They also allow you to quickly compare different carriers for the best rates with their switch and save feature. To get those discounted shipping rates, your 5 pound digital scale, and free postage, just head over to Stamps.com. And up in the corner of the website enter the word jerryrig. There are no long term contracts or commitments. If you can't remember the website name, I'll put a link down in the video description. It's a win-win for everyone. Now it's time to get an up close and very personal look at the new under display camera inside of the ZTE Axon 30. Let's get started. [Intro] I'll show more images from the underscreen camera in just a second. Keep in mind though that the front camera maxes out at 1080p for video, with a 16 megapixel front-facing sensor. Inside the box we find the Axon 30 5G, and at first glance it looks like a solid black phone, but in the right light it does come alive with some holographic looking shades of gray, with some subtle green blended in. And yeah, the back might look cool and stuff, but we're all here for the front facing underscreen camera. No notch, no hole punch, just pure pixel peeping. The biggest difference between the camera this year and the First Generation camera last year in the Axon 20 is the screen quality above the camera unit. Last year's Axon 20 had about 200 pixels per inch screen resolution above that camera. And this year it's doubled to 400 pixels per inch, which means that the pixels hide the camera under the screen much better. It'll be less noticeable. The camera does still add some halos around my studio lights, which isn't as noticeable on my Note 10 Plus' normal front-facing camera. And if I switch to a white background, we can take a closer look at where that camera should be. And compared to last year, it is indeed far more invisible. Nice work, ZTE. With regular images, the camera quality is still a bit soft, which might be a deal breaker if you're a professional selfie taker. But for other people that softness might be a price worth paying to completely hide the front-facing camera. And obviously, this technology is pretty cool and fun to see it progress, but it's also a bit scary. In the wrong hands or inside the wrong devices, underscreen cameras can now pretty much be anywhere. Let me know down in the comments, do you think underscreen camera tech is kind of cool, slightly spooky, or nefariously naughty? Speaking of which, the scratch test. With normal lighting, notice how the underscreen camera is invisible. It's only when we lift the phone into the light to analyze the scratches, do we see a bit of square where the tiny second screen is covering that camera unit...along with the scratches at level 6, with deeper grooves at level 7. But with twice the resolution of last year's phone, it's still pretty much invisible in normal lighting. Even with a completely white display. And since it's also hidden underneath the glass, it's protected from scratching. There is a small earpiece slit up at the top about the same thickness as my razor blade. And then the sides...are made from plastic. The power button and volume rocker are both metal though. Up here at the top of the Axon 30 we do have more plastic, as well as plastic running down the left side. The bottom of the phone has no headphone jack, but we do find a USB-C port capable of charging at 55 watts. And a dual SIM and memory card slot, which does have a rubber ring around the opening. Making our way around to the back. It is a conservative black color, with some slightly holographic branding. And it also is made from plastic. Fine with me though, it just means we get more Art Class with Jerry. Seeing the color changing Noxiv logo, or Axon, depending on how you look at it, seeing it shift from red to green reminded me of the old American Folklore stories about Johnny Appleseed. Turns out he was actually a real guy who went around the Midwest in the early 1800's actually planting apple trees by seed since grafting was apparently against his religion at the time. Something about not wanting to hurt the trees. John Chapman was his real name and he seems like a pretty cool guy. We should all probably be planting a whole lot more trees. The Axon 30 has a super massive 64 megapixel camera up here in the top circle. And right below that we have a triple camera setup inside the other circle, with an 8 megapixel ultra wide, 5 megapixel macro camera, and 2 megapixel depth camera, all protected under the same slab of glass. The only metal we find back here is the part separating the back plastic from the glass camera lens. I mean, the earth is a pretty cool place. I like living here. As things warm up though, we do gotta factor in how long our screens can last in the heat. Especially since this crazy weather and fires are going to keep getting worse until about 2050, according to the UN climate report. The 6.9 inch 1080p 10-bit display does last for about 20 seconds under the heat from my lighter. And we can tell by the white spot that forms that it is indeed OLED, which just shows that we should probably be as equally nice to our tech as we are to where we live. Along with that under display camera, the Axon 30 also has an under display fingerprint reader, which when slathered with level 7 deeper grooves, does appear to keep on functioning. Thumbs up for that. We'll have to see what all these underscreen cameras look like from the inside during the teardown. Finally, the bend test. 2021 has been a rough year for smartphones. We've had more phones break this year than any other year. And during the first bend, it looks like this guy is toast. It's got more flex than a dandelion in the breeze. And when bent from the front, we hear a snap from something internally. But surprisingly, everything externally is still working fine. I don't know if we've ever had a phone with this much flex and still not break before. Creaks like an old wooden staircase, but still survives. Barely surviving is still indeed surviving. Nice work, ZTE. Not bad for a $500 phone. I'm looking forward to seeing what you come up with next. Don't forget to grab your free scale from Stamps.com with the link in the description. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "camera",
        "display camera",
        "ZTE Axon",
        "Axon",
        "Stamps.com",
        "underscreen camera",
        "United States Postal",
        "States Postal Service",
        "AMOLED pixels",
        "year",
        "display",
        "Pretty",
        "ZTE",
        "display camera inside",
        "AMOLED",
        "States Postal",
        "United States",
        "Postal Service",
        "phone",
        "underscreen"
    ],
    "transcript_entity_values": [
        "400",
        "8 megapixel",
        "64 megapixel",
        "Stamps.com",
        "1080p",
        "1 million",
        "Instagram",
        "jack",
        "Jerry",
        "6",
        "5 pound",
        "the United States Postal Service",
        "4 week",
        "about 20 seconds",
        "Johnny Appleseed",
        "ZTE",
        "up to 40%",
        "Axon",
        "Last year's",
        "Second Generation",
        "this year",
        "last year's",
        "Midwest",
        "5 megapixel",
        "66%",
        "UN",
        "Noxiv",
        "about 200",
        "55 watts",
        "first",
        "second",
        "last year",
        "John Chapman",
        "500",
        "2 megapixel",
        "Today",
        "30",
        "16 megapixel",
        "30 5",
        "YouTube",
        "about 2050",
        "USB",
        "the early 1800's",
        "2021",
        "American Folklore",
        "AMOLED",
        "7",
        "Twitter",
        "6.9 inch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "QUANTITY",
        "GPE",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "LOC",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY"
    ],
    "vector": [
        -0.1511290818452835,
        0.0756993293762207,
        -0.017277831211686134,
        -0.09667256474494934,
        0.06557341665029526,
        -0.05171789228916168,
        0.09668558835983276,
        0.04566854611039162,
        -0.012039643712341785,
        0.06069639325141907,
        0.11246351152658463,
        -0.017767932265996933,
        0.02238452434539795,
        0.07304774224758148,
        -0.008586730808019638,
        -0.03136252611875534,
        0.06432689726352692,
        -0.08139853924512863,
        -0.03527596592903137,
        0.11442874372005463,
        0.0165345910936594,
        -0.003757548751309514,
        0.0810491070151329,
        -0.03531745821237564,
        -4.044956949655898e-05,
        0.02221590280532837,
        -0.02422753907740116,
        0.02558835782110691,
        -0.07017362117767334,
        -0.05969126895070076,
        0.045244112610816956,
        0.06261793524026871,
        0.0008448995067737997,
        0.03639884665608406,
        0.08451859652996063,
        -0.038688890635967255,
        0.05513347312808037,
        0.007373002823442221,
        -0.06070282310247421,
        -0.009571884758770466,
        0.01904667541384697,
        -0.020909789949655533,
        0.03552396595478058,
        -0.05945958197116852,
        -0.0198220144957304,
        -0.031753964722156525,
        0.06870909035205841,
        -0.08579178154468536,
        0.03924644738435745,
        0.0010682281572371721,
        -0.0753089115023613,
        -0.034438103437423706,
        0.0614374577999115,
        -0.02016371488571167,
        -0.08367038518190384,
        -0.005569716449826956,
        -0.02484523504972458,
        -0.01982771046459675,
        0.02008928544819355,
        -0.03704269602894783,
        0.02872176468372345,
        0.027735842391848564,
        -0.053056299686431885,
        0.09540069103240967,
        -0.044790588319301605,
        0.03397884592413902,
        0.06035141274333,
        -0.09496967494487762,
        -0.055728666484355927,
        -0.004215600900352001,
        -0.05844271928071976,
        0.009998926892876625,
        0.023559436202049255,
        -0.05010530352592468,
        -0.03809982165694237,
        0.059189945459365845,
        0.050424542278051376,
        -0.04899363964796066,
        0.008737891912460327,
        -0.004678037483245134,
        0.08509553223848343,
        -0.05068225413560867,
        0.009041322395205498,
        -0.0017491786275058985,
        0.03462818264961243,
        0.06132212281227112,
        0.02774927206337452,
        0.0463283434510231,
        -0.035510506480932236,
        -0.0900309830904007,
        -0.08037436008453369,
        0.009378880262374878,
        -0.03890412300825119,
        -0.017954958602786064,
        -0.03414260223507881,
        -0.09689328074455261,
        -0.023402487859129906,
        -0.054028742015361786,
        -0.07115330547094345,
        0.07829760760068893,
        0.009258865378797054,
        -0.04905911162495613,
        0.06175031140446663,
        -0.028484512120485306,
        0.05026629567146301,
        -0.030724206939339638,
        -0.040975313633680344,
        0.005332106724381447,
        0.002670977031812072,
        0.03974178060889244,
        -0.010535663925111294,
        0.06887803971767426,
        -0.06731144338846207,
        -0.006869865581393242,
        0.05200279876589775,
        0.0669231191277504,
        -0.11062849313020706,
        0.02841215766966343,
        0.10257580131292343,
        -0.07445121556520462,
        0.05207233875989914,
        -0.028347233310341835,
        -0.052555713802576065,
        0.022923585027456284,
        0.07796423137187958,
        0.03403118997812271,
        -0.022477159276604652,
        3.682053852326438e-33,
        0.004336582031100988,
        0.118747279047966,
        -0.013752222992479801,
        -0.022916343063116074,
        -0.00038744963239878416,
        0.04301667958498001,
        0.04638290032744408,
        0.10051703453063965,
        -0.01740492321550846,
        0.04055238515138626,
        0.020619336515665054,
        0.009931467473506927,
        0.01708153448998928,
        0.007363103795796633,
        0.022135265171527863,
        0.011441593989729881,
        -0.04220253601670265,
        -0.062414318323135376,
        -0.033887963742017746,
        -0.016970006749033928,
        -0.018320130184292793,
        -0.030274545773863792,
        0.00859108753502369,
        0.04883226752281189,
        0.07858607172966003,
        0.020436380058526993,
        0.0017114693764597178,
        0.03526740521192551,
        0.0542304664850235,
        0.029929984360933304,
        -0.09374906867742538,
        0.05674509331583977,
        0.08071663975715637,
        -0.005971225909888744,
        -0.006517660338431597,
        0.04693062976002693,
        -0.01776450127363205,
        -0.09049166738986969,
        -0.039214275777339935,
        -0.02775856852531433,
        -0.02648647502064705,
        0.021267710253596306,
        -0.0803331583738327,
        -0.06009003520011902,
        0.02255665510892868,
        -0.024787340313196182,
        -0.017967142164707184,
        0.02111251838505268,
        -0.050170496106147766,
        0.024576688185334206,
        -0.05023462697863579,
        -0.04333832114934921,
        -0.0363553948700428,
        -0.03556261956691742,
        -0.13765227794647217,
        -0.025111248716711998,
        -0.05633481219410896,
        -0.03742887079715729,
        0.05015166476368904,
        -0.004229151643812656,
        0.07759954780340195,
        -0.02588110975921154,
        -0.016679883003234863,
        0.03320539742708206,
        -0.09252290427684784,
        -0.03239937499165535,
        0.047286711633205414,
        0.01727372780442238,
        -0.04349524900317192,
        0.057667456567287445,
        -0.019102124497294426,
        0.029267936944961548,
        0.03128823637962341,
        -0.08356655389070511,
        0.030324066057801247,
        0.059119317680597305,
        -0.07011591643095016,
        -0.020389743149280548,
        0.01858012191951275,
        -0.016845837235450745,
        -0.04113906994462013,
        -0.0016066894168034196,
        0.09171398729085922,
        0.023401852697134018,
        -0.026286717504262924,
        -0.0714629665017128,
        0.015987981110811234,
        -0.03994409367442131,
        -0.0357852540910244,
        0.016101635992527008,
        0.00739887822419405,
        -0.042229242622852325,
        -0.06072984263300896,
        -0.031835418194532394,
        -0.013001997023820877,
        -5.733070721978566e-33,
        -0.005237817298620939,
        0.050054531544446945,
        -0.042544517666101456,
        -0.05034949257969856,
        -0.004489252809435129,
        -0.049935609102249146,
        0.15689529478549957,
        0.10967625677585602,
        0.05530471354722977,
        -0.09621862322092056,
        -0.011214863508939743,
        0.04987344145774841,
        -0.04456606134772301,
        -0.05483434349298477,
        0.04504725709557533,
        -0.02681485190987587,
        -0.048522692173719406,
        -0.06641970574855804,
        0.04421062767505646,
        -0.00852595642209053,
        0.08356074243783951,
        0.07730243355035782,
        0.06121993064880371,
        0.049160584807395935,
        -0.0009379592956975102,
        0.01602528616786003,
        0.018335286527872086,
        -0.026782169938087463,
        0.0469028502702713,
        -0.03521197661757469,
        -0.007388798985630274,
        -0.0470048263669014,
        0.035894282162189484,
        0.033233579248189926,
        -0.015764297917485237,
        0.08691435307264328,
        0.03273436427116394,
        -0.03882523626089096,
        -0.027911294251680374,
        -0.06230517476797104,
        -0.018419871106743813,
        0.05480598285794258,
        -0.001993047771975398,
        0.02205023355782032,
        -0.035565733909606934,
        -0.0817352756857872,
        -0.026080889627337456,
        -0.007947969250380993,
        -0.012301175855100155,
        -0.02630935236811638,
        -0.05035685747861862,
        -0.010226929560303688,
        0.022088319063186646,
        0.0008473186171613634,
        -0.08037054538726807,
        0.035477180033922195,
        0.04467301815748215,
        -0.047578491270542145,
        -0.038221944123506546,
        0.01261342503130436,
        0.0781347006559372,
        0.03392702713608742,
        -0.08379434049129486,
        -0.07107768952846527,
        0.00012515304842963815,
        -0.010268623940646648,
        0.04010503739118576,
        0.019778305664658546,
        0.018700966611504555,
        0.07800135761499405,
        0.012003657408058643,
        0.03496091067790985,
        -0.001737123471684754,
        -0.07080868631601334,
        0.024314798414707184,
        0.0013044978259131312,
        -0.07645628601312637,
        -0.02375170588493347,
        -0.00564213190227747,
        -0.036532606929540634,
        0.06326531618833542,
        -0.0675341784954071,
        0.02432429976761341,
        0.07745540142059326,
        0.04371649771928787,
        0.005140161141753197,
        0.06033821403980255,
        -0.0080917002633214,
        -0.07207868993282318,
        -0.018090954050421715,
        -0.05571211501955986,
        -0.022104471921920776,
        -0.059306710958480835,
        0.14112751185894012,
        -0.003993852995336056,
        -5.9248723260907354e-08,
        0.02034102939069271,
        0.05124136433005333,
        -0.018146103248000145,
        -0.05002480372786522,
        0.044378362596035004,
        -0.07251642644405365,
        0.032082170248031616,
        -0.009691496379673481,
        0.06161745637655258,
        -0.04827262461185455,
        0.008549405261874199,
        -0.06509455293416977,
        0.008123262785375118,
        0.09240102022886276,
        -7.221364649012685e-05,
        0.04831559211015701,
        -0.06865524500608444,
        0.03293755650520325,
        -0.04115326330065727,
        -0.016809547320008278,
        -0.10223516076803207,
        0.01575668528676033,
        0.007812908850610256,
        -0.0649389699101448,
        -0.0020986113231629133,
        0.018211165443062782,
        -0.10382293909788132,
        0.029225941747426987,
        0.08528714627027512,
        0.04370371252298355,
        -0.09952269494533539,
        -0.006547253578901291,
        0.03317289054393768,
        0.020949790254235268,
        -0.018383238464593887,
        -0.05639350414276123,
        -0.06504659354686737,
        -0.02010268159210682,
        0.08441422134637833,
        0.011381484568119049,
        0.006101091392338276,
        -0.06928520649671555,
        0.016896741464734077,
        0.0498422272503376,
        -0.007258549798280001,
        -0.013170641846954823,
        0.04181307554244995,
        -0.16387611627578735,
        -0.025216734036803246,
        0.008882145397365093,
        -0.05811721831560135,
        0.023250838741660118,
        -0.06701269745826721,
        0.025746608152985573,
        0.007081195712089539,
        -0.0012716880301013589,
        0.07317880541086197,
        -0.031447120010852814,
        -0.032198213040828705,
        0.03556451573967934,
        0.04948575422167778,
        -0.0408194474875927,
        -0.024957621470093727,
        0.08307577669620514
    ]
}