{
    "id": "nm-_EhCSS5s",
    "title": "Which $150 smartphone? - Poco M3 & Nuu Mobile G5",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-02-24T21:57:07Z",
    "video_url": "https://www.youtube.com/watch?v=nm-_EhCSS5s",
    "category": "Science & Technology",
    "tags": [
        "Google",
        "Android",
        "Smartphone",
        "Cheap",
        "Inexpensive",
        "Phone",
        "Device",
        "Mobile",
        "720p",
        "$150",
        "$200",
        "Poco",
        "Nuu",
        "Linus",
        "Unboxing"
    ],
    "views": 639091,
    "likes": 31137,
    "comments_count": 2628,
    "description": "Govee Aura Table Lamp, 20 Light Modes + DIY Creation:   Get 15% Off with Code: 15X9TY6Z  Android phones' prices can range in price from $2000+ and all the way down to $200. Let's see what Poco and Nuu Mobile can offer at the lower price range.  Buy POCO M3 Smartphone On Amazon (Paid Link):  On Walmart (Paid Link):  On Newegg (Paid Link):   Buy Nuu Mobile G5 Smartphone On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://bit.ly/Aura6052",
        "https://geni.us/bVEIh3",
        "https://geni.us/lGOfJq",
        "https://geni.us/HevM1n",
        "https://geni.us/huBQeX4",
        "https://geni.us/xAEexCA",
        "https://geni.us/6mTfxUj",
        "https://geni.us/JFyIlS",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I can't get this box open. What the hell is going on here? Oh, look at the shape of the sleeve. We're off to a bad start here Nuu Mobile. Now it's easy to say, why would you spend a thousand dollars on an iPhone when you can get an Android phone that does everything you needed to do for less than $200. But most of the time when people say that, they're not actually citing specific models of Android phones that will legitimately give you a good user experience for less than $200. So today we went and got our hands on to hopeful candidates for your sub $200, the Nuu Mobile what is this thing called? G5 and the Poco M3. This one right here is $200, but on promo for 160, and this one from Poco is just 130 US dollars. That is absolutely flipping incredible. Especially when you consider that it comes with a charger and a live strong bracelet and a other more different bracelet, three whole bracelets. How the hell are they doing this for $130? You know, we originally set out to make a video about this Nuu Mobile G5, but then we were like, oh okay yeah, on its own, that might not justify a full video. So why don't we compare it to the Poco M3 and then now I don't even want to talk about the Nuu Mobile G5. For $130 this thing is fricking nuts. Do they even think to charge these before we started? Oh wait, hey, wow. Just has a super long delay. This flipping nuts. Poco even includes like a cheap, crappy case with it. Screen protector, look at that. Like everything you need. They say nothing you don't, but I actually did not need these bracelets. So I'm gonna have to call out that lie in their marketing. This video is brought to you by Govee. They are a table lamp provides beautiful lighting at any time of day. It offers 20 different lighting effects such as ocean and Aurora for the perfect ambiance with a wake-up timer that increases in brightness the closer it gets to your alarm. It's got built-in support for Google Assistant and Amazon Alexa and allows you to create the perfect lighting scene for any room using the Govee home app. Click the link below to check out the Ra table lamp today. Accessories for the Nuu Mobile G5 you got also a cheap crappy case. Oh yeah, we got this dark plastic cover to put over. Oh, that's yeah, that's awful. All right. Headphones though, along with not a particularly fast charging adapter, just a five volt, two amp and screen protector. All right, well, sorry, Nuu Mobile, but you're falling behind the Poco phone here and that is just the start of what's to come. Now these are AirPods plumes, look at that, shameless. One thing some people will be happy about though is those are three and a half millimeter headphone. So yes, the Nuu Mobile G5 has a headphone jack. It also uses type C charging. Got your speaker down here, got a fingerprint sensor on the back, got a four camera system. This is on $160 phone. So those are a 16 megapixel, eight megapixel and then dual two megapixel cameras. You got your volume rocker over here. I'm going to take this case off. This is, this is horrendous. You got your lock button right there and over on the other side you got your SIM tray, actually kind of curious, does it have my crusty expansion? Yes. SIM card tray and micro SD right there and then on the top whole lot of nothing. The screens nice and vibrant actually surprisingly bright like I'm gonna have to turn that down in order to capture it on camera. Okay. Is that okay, Brian? Yeah, there you go, that looks pretty good but don't expect it to be particularly sharp. This is a 1600 by 720P display. And I've talked a lot about how the difference between 1080 and 1440 on a mobile device is really not earth shattering but 720 is low enough pixel density that even with my aging eyes, I can easily tell the difference between that and a 1080P class display. Also the rest of the specs are just kind of like a step down. It's got four gigs of Ram, 64 gigs of storage. It uses a MediaTek Helio A25 Octa core processor and it's got a 5,000 milliamp Hour battery. It's actually pretty respectable, especially with that relatively power sipping chipset. I would expect this thing to last for quite a long time on a charge and fire up the camera, and I remember when like 250 $300 phones could barely take a picture better than a potato. This is like completely usable, like just reasonable, you know. Obviously we're not trying to evaluate it for like, you know, top tier low-light performance or anything like that. But if you're trying to capture a memory, it'll certainly do it. And that speaker's so horrible. Yeah, 720P. Oh. That may actually change with LG's new 48 inch CX OLED. Yeah, if you turn it up any higher than like sort of minimal listening volume in a quiet room, it really doesn't sound that great. Overall it's reasonably responsive. It's not a high refresh rate display obviously but feels pretty smooth to use or at least that's what I would have said if the M3 wasn't also part of this video today. Okay, just like the other one, let's lose this ugly case. I'm sorry, you just, I can't blah. This thing looks and feels absolutely unbelievable for $130. I mean, yeah, the back is unapologetically plastic or whatever but they've done a really good job of putting a finish on it that feels more like, like the, like it's, it's a texture. It's got character, as opposed to just being just a a flat glossy piece of plastic. It's got a 48 megapixel main shooter. It also has a headphone jack and check this is that IR meter? I think it is. Man I love that so with the right app, you could actually use this thing as a universal remote control. Let's see if it has expandable storage. I love going into these things totally cold because it's just so exciting to explore them. Freaking awesome. This thing was one ups the poor G5, in every possible way. Not only does it have micro SD on it's SIM tray, it's got dual SIM. Over on the right, we've got our lock button with oh, interesting. Does it not have a fingerprint sensor? Oh, nice, it's built into the lock button. I actually really liked that. Here we go. Unlock time, oh, hold on a second. Is it that fast? Oh, not bad. That's really good oh. Not only that, but it features a Snapdragon 662 processor, four gigs of LPDDR4x memory, a 1080P class display and a 6,000 milliamp Hour battery instead of a 5,000 milliamp Hour battery. Oh yeah and it's got an FM Radio because like, why not, I guess? Remember radio. What is Mi Music. Okay, I have a confession. That's how I always think of like, Xiaomi's Mi branding in my head. Mi Mix, Mi Ultra (laughs) I know they're like not, not Italian at all, I get it. Now you'd think $130 phone is probably heavily subsidized by ads. So having a look at what's pre-installed on it. We've got Facebook, LinkedIn, Amazon. Although in fairness that's probably stuff that most people will install in it anyway. Google Assistant, a couple Mi weather notes. Nothing kind of crazy there. Oh, they're hey, there's the FM radio app. No headphones detected. Oh, that makes sense 'cause it probably uses the headphones as, as the antenna. Okay, well, oh God, it's still playing one second. Stop. Is that the pause button? Stop oh, oh God. How do I, are you kidding me? Oh, there's a power button in the top left. Well that's, that's intuitive. Sure, thank you for that. It's got out of the box access to the Play Store and other Google services. That's something you can't take for granted with these cheap phones and it's actually got the more stylish teardrop style hole punch up here. Whereas this one used the like hole punch, hole punch, bullet wound one. Wisely, they just disabled the haptic motor right out of the box so when you're typing, it just doesn't feel awful 'cause I'm willing to bet it feels terrible. That's one of the things that is always gross on cheap phones. Actually this is a lot better than the other one. It's not great to be clear. It's not, not amazing. Let's see if it's got stereo speakers. It does. - [Brandon] Those are a lot better. - Oh, noticeably better like immediately noticeably better. Your watching the very first Linus tech tips video in high dynamic range. Save your money graphic artists, buy a TV influencer gamers. So no HDR display, no wireless charging, but guys let's be somewhat reasonable. This is a freaking ton of phone for your money. It's actually just take a couple quick snaps with the camera. 16 megapixel front facing camera as well. Hey John, how you doing? You know what? I think the G5 might have something it's legitimately better at. Definitely a lot of noise in the Poco M3 photo compared to the G5. Very interesting. Part of that appears to be a processing choice though. They both have very, very similar dynamic range. You can tell from these bright filming lights and sort of what gets lost in the details back here versus getting lost in the highlights here, but they've gone for a more boosted look. Obviously this isn't a full camera analysis and you're not buying $150 a class phone for its, you know, outstanding camera, but I will say that if you want a less grainy image, just, just, you know, point and click then the G5 might actually be the better performer here. So that's interesting, if you don't take a ton of pictures though that's not your highest priority this looks like it's not stabilized at all. So that would be, that would be my guess as far as video recording goes. I can't say that it's any different on the other one. If you mostly consume content as opposed to creating it though, man, M3 $130 US that is extremely compelling. Yeah. This one seems to at least have some electronic stabilization or something like that. You can, you can see it there. It's a little, little floaty, whereas this one, if I try to just freehand it here it's like all over the place and if I do my best. One last thing for the M3 is you get Corning Gorilla Glass three on the front for a little bit of extra shatter and scratch resistance compared to just regular generic tempered glass and that's pretty much it. So if you were wondering, you know, what is the response when someone says, well what Android phone can you get for an eighth of the price of a top tier iPhone that kind of does everything you need. The answer is one of these two and probably this one. Dang, that's compelling. If you like either of these we're going to have links down below. If you liked Short Circuit, make sure you subscribe. I will see you all later. You know, I could get used to this bracelet look, what do you think, Brandon, should I start wearing like lots of bracelets? Just have that be part of my shtick. Do like an LTT store bracelet. - [Brandon] Like you live in the 2000's. - Yeah.",
    "transcript_keywords": [
        "Nuu Mobile",
        "Mobile",
        "Nuu",
        "yeah",
        "Poco",
        "thing",
        "Android phone",
        "phone",
        "camera",
        "video",
        "Android",
        "SIM",
        "phones",
        "lot",
        "milliamp Hour",
        "Hour battery",
        "display",
        "megapixel",
        "button",
        "milliamp Hour battery"
    ],
    "transcript_entity_values": [
        "G5",
        "Alexa",
        "FM Radio",
        "48 inch",
        "five volt",
        "Ram",
        "M3 $130",
        "US",
        "Google",
        "160",
        "Amazon",
        "John",
        "6,000",
        "LinkedIn",
        "M3",
        "Helio A25 Octa",
        "Mi Music",
        "MediaTek",
        "Brian",
        "Short Circuit",
        "Linus",
        "eight megapixel",
        "today",
        "the Play Store",
        "Poco M3",
        "Dang",
        "a ton",
        "LPDDR4x",
        "micro SD",
        "one second",
        "LTT",
        "Xiaomi",
        "first",
        "two",
        "200",
        "1080P",
        "three and a half millimeter",
        "48 megapixel",
        "1600",
        "Aurora",
        "one",
        "iPhone",
        "Corning Gorilla Glass",
        "the Nuu Mobile",
        "the Poco M3",
        "130",
        "second",
        "Govee",
        "LG",
        "160",
        "Brandon",
        "Italian",
        "Android",
        "Snapdragon 662",
        "sub $200",
        "720P.",
        "Mi",
        "5,000 milliamp Hour",
        "jack",
        "G5",
        "2000",
        "AirPods",
        "two megapixel",
        "three",
        "One",
        "250 $300",
        "720",
        "64",
        "Poco",
        "less than $200",
        "just 130 US dollars",
        "Facebook",
        "150",
        "four",
        "Mi Mix",
        "a freaking ton",
        "a thousand dollars",
        "Nuu Mobile G5",
        "Nuu Mobile",
        "20",
        "16 megapixel"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "QUANTITY",
        "FAC",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.07935965061187744,
        0.010178993456065655,
        0.03126946836709976,
        -0.056259918957948685,
        0.049503833055496216,
        -0.002837178763002157,
        -0.008565275929868221,
        0.05218562111258507,
        0.01926874928176403,
        0.07070185989141464,
        0.056235093623399734,
        -0.027171483263373375,
        0.0580345019698143,
        -0.01983294077217579,
        0.06645295023918152,
        -0.0050095971673727036,
        0.06286979466676712,
        -0.1153012365102768,
        0.00018699781503528357,
        0.009055663831532001,
        0.02944622002542019,
        -0.03985193371772766,
        -0.010858124122023582,
        -0.05693402141332626,
        0.07418719679117203,
        -0.09116682410240173,
        -0.011338716372847557,
        -0.019218353554606438,
        0.023465432226657867,
        -0.05485982447862625,
        -0.02474803291261196,
        0.09426168352365494,
        0.016577184200286865,
        -0.007539600133895874,
        0.024228472262620926,
        -0.10355675220489502,
        -0.031988389790058136,
        -0.09974079579114914,
        -0.09319530427455902,
        -0.05033877119421959,
        0.0007089263526722789,
        -0.03111536242067814,
        -0.05031300708651543,
        0.0071023753844201565,
        -0.003683636197820306,
        -0.025692136958241463,
        0.07576776295900345,
        0.05135910212993622,
        -0.00357483746483922,
        0.02931973896920681,
        0.012520236894488335,
        -0.020062074065208435,
        -0.002186410827562213,
        -0.011217782273888588,
        -0.09163090586662292,
        0.008639277890324593,
        -0.08910127729177475,
        -0.002036960097029805,
        0.11561686545610428,
        -0.01330945361405611,
        0.034118104726076126,
        -0.057650208473205566,
        -0.0817975252866745,
        0.04938673600554466,
        -0.018238643184304237,
        -0.004402399994432926,
        -0.0217596422880888,
        -0.045094188302755356,
        -0.06413330137729645,
        -0.030327074229717255,
        0.04605421796441078,
        -0.04326491430401802,
        0.09007717669010162,
        -0.0037875338457524776,
        -0.06649089604616165,
        0.061260562390089035,
        0.12439241260290146,
        -0.011574347503483295,
        -0.007227080874145031,
        0.050843287259340286,
        0.02131921797990799,
        0.003912557382136583,
        -0.07929268479347229,
        -0.015559487976133823,
        0.06003253161907196,
        -0.0698738545179367,
        0.05470188707113266,
        0.0805232971906662,
        -0.039082713425159454,
        -0.09120731800794601,
        0.0230379868298769,
        0.09489104896783829,
        -0.02384399250149727,
        0.048422787338495255,
        -0.022942738607525826,
        -0.0038992338813841343,
        -0.0317818820476532,
        -0.027889857068657875,
        -0.01387723907828331,
        0.016640277579426765,
        0.10552820563316345,
        0.06466111540794373,
        0.09984587877988815,
        0.006699479650706053,
        -0.07590655237436295,
        -0.054343629628419876,
        -0.014880768954753876,
        0.09635750949382782,
        0.033944204449653625,
        0.055276427417993546,
        -0.06775100529193878,
        0.018207842484116554,
        -0.05530261993408203,
        -0.05350593850016594,
        -0.09707604348659515,
        0.0300285704433918,
        -0.024245278909802437,
        -0.011676236987113953,
        0.10394832491874695,
        -0.017991838976740837,
        0.004767468199133873,
        -0.05667950212955475,
        -0.04831473529338837,
        0.018907733261585236,
        -0.021531514823436737,
        0.001979045569896698,
        -0.06095277890563011,
        4.26110420625142e-33,
        -0.012590311467647552,
        0.06667694449424744,
        -0.056705351918935776,
        -0.13611812889575958,
        -0.04544585198163986,
        0.05204019322991371,
        0.01588723249733448,
        0.02409582957625389,
        -0.010829390026628971,
        -0.003953400533646345,
        -0.05897556245326996,
        0.06741167604923248,
        -0.04638013243675232,
        0.04667657986283302,
        0.0046887812204658985,
        -0.06027383357286453,
        0.023271311074495316,
        -0.014830805361270905,
        0.03953181579709053,
        0.04765629023313522,
        -0.07328051328659058,
        0.0018204626394435763,
        -0.005231169518083334,
        -0.007574091199785471,
        0.0008982514846138656,
        0.1413964182138443,
        0.02637115679681301,
        -0.04435349255800247,
        0.08315903693437576,
        0.030500909313559532,
        -0.002169318962842226,
        -0.0258795153349638,
        0.07583232969045639,
        -0.006987204309552908,
        -0.05759899318218231,
        0.018142299726605415,
        -0.048293426632881165,
        -0.061315443366765976,
        0.011476901359856129,
        -0.04910055920481682,
        -0.0969926044344902,
        0.09322656691074371,
        -0.08800383657217026,
        -0.01974741742014885,
        -0.01072425115853548,
        0.006288229022175074,
        -0.02956489473581314,
        -0.014034902676939964,
        0.02930109202861786,
        0.04606126248836517,
        -0.11190454661846161,
        -0.020549563691020012,
        -0.14544181525707245,
        -0.04741834104061127,
        0.0016102723311632872,
        -0.02584136836230755,
        -0.0065756309777498245,
        0.006988725159317255,
        0.02458437718451023,
        -0.01784227415919304,
        0.03598577529191971,
        0.004867863841354847,
        0.025420984253287315,
        0.011852819472551346,
        -0.0747288390994072,
        0.027784764766693115,
        -0.029285268858075142,
        -0.029354486614465714,
        -0.05433764308691025,
        0.07850643992424011,
        -0.008430230431258678,
        0.020404454320669174,
        0.1452334225177765,
        0.03686371445655823,
        0.04297586902976036,
        0.020126787945628166,
        -0.03401247039437294,
        0.001625442411750555,
        0.03484948351979256,
        0.009602198377251625,
        -0.05506531149148941,
        0.01163963507860899,
        0.07690326124429703,
        0.06355039030313492,
        -0.010941936634480953,
        0.03821340948343277,
        -0.011757446452975273,
        0.041376981884241104,
        -0.04657665640115738,
        0.06659553200006485,
        -0.025166762992739677,
        -0.010643553920090199,
        -0.017752578482031822,
        -0.02131081186234951,
        -0.040031712502241135,
        -5.5687843661916124e-33,
        -0.03637402504682541,
        0.022930102422833443,
        -0.031013067811727524,
        0.011168621480464935,
        0.04247819259762764,
        -0.016660038381814957,
        0.025641631335020065,
        0.013536999002099037,
        -0.011520537547767162,
        -0.006557898595929146,
        0.0100898751989007,
        0.02897372655570507,
        -0.038156941533088684,
        0.01651010848581791,
        -0.009581595659255981,
        -0.0804223045706749,
        0.04840780049562454,
        -0.08427447080612183,
        0.023582931607961655,
        -0.01726653054356575,
        0.020453982055187225,
        0.0011765132658183575,
        0.025319140404462814,
        0.08557910472154617,
        0.010737365111708641,
        0.01471071969717741,
        0.03290058672428131,
        -0.011460132896900177,
        -0.015587680973112583,
        0.019285352900624275,
        -0.07586681842803955,
        -0.011454897932708263,
        -0.023770885542035103,
        0.049109406769275665,
        0.0253936517983675,
        0.018871406093239784,
        0.014513506554067135,
        0.11300390958786011,
        0.05838273838162422,
        0.022840822115540504,
        0.03858858346939087,
        -0.021546339616179466,
        0.07356761395931244,
        -0.056026529520750046,
        0.028367280960083008,
        -0.10721487551927567,
        -0.010791132226586342,
        -0.06628283858299255,
        0.012574202381074429,
        -0.0050024124793708324,
        0.06152396649122238,
        0.023743150755763054,
        0.05463292449712753,
        -0.01376271340996027,
        -0.1008276641368866,
        0.022081084549427032,
        -0.0031674064230173826,
        -0.044017493724823,
        -0.04231910780072212,
        -0.07163283228874207,
        0.05840758979320526,
        0.014156471006572247,
        -0.06258524954319,
        0.03848673403263092,
        -0.054603904485702515,
        0.022577252238988876,
        0.06106805056333542,
        0.0009971653344109654,
        -0.031724851578474045,
        0.019592538475990295,
        -0.08262861520051956,
        -0.029823830351233482,
        0.03488265350461006,
        -0.10936905443668365,
        -0.038829389959573746,
        0.07420279830694199,
        -0.06330902874469757,
        0.03323208540678024,
        0.07672708481550217,
        -0.08018109202384949,
        0.021456902846693993,
        0.07932944595813751,
        0.047637611627578735,
        -0.01877703331410885,
        0.038859039545059204,
        -0.01475728489458561,
        -0.002091784728690982,
        -0.010856349021196365,
        0.0034015069250017405,
        0.02689974755048752,
        -0.15257875621318817,
        0.03763909265398979,
        -0.043247729539871216,
        0.009062228724360466,
        -0.026347484439611435,
        -5.17364426855238e-08,
        0.043259527534246445,
        0.008549222722649574,
        -0.020392563194036484,
        0.03505630046129227,
        0.030287280678749084,
        -0.042326729744672775,
        -0.037779297679662704,
        0.016494711861014366,
        0.09112568944692612,
        0.057810667902231216,
        0.0909895971417427,
        -0.0666416585445404,
        -0.07525860518217087,
        0.04230532795190811,
        -0.055675994604825974,
        0.05142964422702789,
        0.006304704584181309,
        0.005703123286366463,
        0.035732340067625046,
        -0.009407476522028446,
        -0.053307972848415375,
        0.0998482033610344,
        -0.013080837205052376,
        -0.004578412976115942,
        0.05784418061375618,
        0.06684397906064987,
        -0.0184957142919302,
        0.06645795702934265,
        0.06945445388555527,
        -0.007644448429346085,
        -0.02858896739780903,
        0.016403574496507645,
        -0.04618821293115616,
        -0.04111242666840553,
        0.012227681465446949,
        -0.08539841324090958,
        -0.03211626783013344,
        -0.0030304943211376667,
        0.025111306458711624,
        0.03732292354106903,
        0.02330280840396881,
        -0.019518544897437096,
        -0.0311173927038908,
        -0.01690603420138359,
        0.07186023145914078,
        -0.04349840059876442,
        -0.07335301488637924,
        -0.11142443865537643,
        0.02180531620979309,
        0.08043155074119568,
        -0.022993704304099083,
        -0.03179457038640976,
        -0.07966868579387665,
        -0.03682137653231621,
        0.024012651294469833,
        -0.04537173733115196,
        0.05368385091423988,
        -0.011735913343727589,
        -0.03269244730472565,
        0.0653611570596695,
        0.03625411167740822,
        -0.12661990523338318,
        -0.029902536422014236,
        0.05598783865571022
    ]
}