{
    "id": "NmLU1aiqOL4",
    "title": "Moto Z Review: Four Phones In One",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-07-21T13:00:46Z",
    "video_url": "https://www.youtube.com/watch?v=NmLU1aiqOL4",
    "category": "People & Blogs",
    "tags": [
        "moto z review",
        "moto z droid edition review",
        "moto z droid",
        "droid review 2016",
        "moto droid",
        "moto z force",
        "moto z",
        "lenovo",
        "motorola",
        "review",
        "mrmobile",
        "michael fisher",
        "captain2phones",
        "pocketnow",
        "oneplus 3",
        "tesla model 3",
        "android authority",
        "mr mobile",
        "mister mobile",
        "verizon wireless",
        "moto x 2016",
        "moto x review",
        "new moto x"
    ],
    "views": 513015,
    "likes": 9083,
    "comments_count": 1139,
    "description": "The Moto Z is unlike any other smartphone you can buy today, with a frame barely 5mm thick and slap-on \"mods\" that give it crazy capabilities. It also carries a fascinating legacy. In 2013, Motorola introduced a small, modest mobile that tried to redefine what a smartphone should be, and it called it the Moto X. The next few years would see the company gradually abandon most of the principles it laid down with that first phone, making the X bigger and more powerful to better battle the Galaxy-class competition from Samsung. For 2016 Motorola (having been sold by Google to Lenovo and renamed \"Moto\") has taken its flagship smartphone so far afield of its origins that it isnt even an \"X\" anymore  a move equal parts promotion and demotion. Im Michael Fisher, and this is MrMobile's Moto Z Droid Edition Review.   [SUBSCRIBE]     [ABOUT THIS REVIEW]  MrMobile's Moto Z Review was based on six days' trial of a Moto Z Droid Edition review device on loan from Motorola/Verizon Wireless. The Moto Z Droid Edition was not paired to a wearable for this review. Test areas included the North Fork of Long Island, New York; Amtrak's Northeast Corridor; and Greater Boston, Massachusetts.     [SOCIALIZE]         [MUSIC]  \"The Ballad of MrMobile\" (Mobile Nations, 2016)  \"Fashionista\" by Olive Musique, available at Premium Beat:   \"Smart Ideas\" by Julian Bell, available at Premium Beat:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "http://www.premiumbeat.com/royalty_free_music/songs/smart-ideas"
    ],
    "transcript": "- [Narrator] Back in 2013, Motorola tried to redefine what a smartphone should be with the small modest mobile called the Moto X. The next few years would see the company gradually abandon most of the principles it laid down with that first phone, making the X bigger and more powerful to better battle the Galaxy class competition. For 2016, Motorola, now a Lenovo subsidiary with two fewer syllables, has taken its flagship smartphone so far afield of its origins that it isn't even an X anymore. I'm Michael Fisher, and this is the Mr. Mobile review of the Lenovo Moto Z. First thing's first, this is the Moto Z Droid Edition, a Verizon Wireless global exclusive probably until September. I've used it on Big Red for the past week or so and frankly, I've been underwhelmed by Verizon. For a carrier that's built it's entire brand on how great its network is, the amount of time I spend on 3G or even 1X during several days on Long Island was staggering, especially considering the great reception Verizon's coverage map says I should have had. What's worse, the T-Mobile phone in my other hand usually had full LTE in the same spots and even in greater Boston, where Verizon does better, other carriers easily keep pace. Your experience will vary, of course, but it's a helpful reminder that you could choose your carrier based on your own testing, not based on the hype. While I'm being contrarian, let me stand apart from a lot of commenters when I say I really like the look and feel of the Moto Z, which sort of splits the difference between a flattened Moto X and a friendlier Droid Razr. With the exception of the lower-than-usual battery capacity, which means this is definitely a phone you charge every night, the specs are all top shelf. Those components are crammed into a surprisingly smudge-prone aluminum chassis that's more mean and muscly than pillowy and plump. In fact, the Moto Z is one of the thinnest smartphones you can buy at 5.2 millimeters, which has caused some to ask, why wouldn't you just make a thicker phone and use the added volume for a bigger battery? Well, the short answer is that Motorola tried to deliver the best of both worlds. An ultra sleek smartphone that could trade slimness on demand for added capabilities. It does this with Moto Mods. A big battery pack, a boom-y speaker set, and a fricking portable projector. These are three of the magnetic Moto Mods launching with the Z, and the execution here is damn near perfect. There's no restarting the phone or downloading apps to make these things work. You just stick them to the metal backside and bam, powering up or pumping Pinback or pico-projecting Poppy on your wall. The battery packs come in different styles, some with wireless charging. The projector has a kickstand, its own cooling fan and its own power supply, and ditto on the power supply for the JBL Sound Boost Speaker Set, which is so loud I usually need to turn it down a couple notches. If all you want is to give your phone a different look or feel, the style shells come in finishes ranging from fabric to wood to leather. There's even a developer kit coming, so folks can build their own Moto Mods. This is a case, though, where execution maybe isn't as important as concept. I mean I could do almost all of this already with any phone. I usually carry an external power pack. It charges phones faster than the Moto Mods charge the Z and I can split that charge across other devices too. The same goes the wireless speakers you see everywhere which anyone who has a Bluetooth device can connect to. Not so for the JBL. And there are brighter and better mobile projectors out there which, again, don't rely on interfacing with a single phone. So buying into the Moto Mod ecosystem means getting a bunch of accessories that will only work with one smartphone. Lenovo promises that future Moto Zs will support these Mods as well, but given Moto's track record for after sale support since Lenovo bought it, let's just say I'll believe when I see it. On the sunnier side, the Moto Z's software is terrific. I wish it launched with Android Nougat, but with all the flavor Moto's added to Marshmallow, I almost don't miss it. Moto Display shows you a notification glance when you wave your hand over the faceplate, and you can preview alerts individually without unlocking the phone. In that vein, the fingerprint sensor is quick and accurate, but sadly it's no Home button. It only turns the screen on or off. The phone will detect when you're driving and it'll read your text messages aloud to you and also let you dictate replies. Moto Voice, one of my favorite features, has also been refined. It's easier to use a custom launch phrase to summon the phone. Hello, Moto Novo. (phone beeps) What's the weather like this weekend? And it's now much faster to respond. - [Phone] This weekend's forecast for summer fall is 87 degrees and mostly sunny. - [Michael] And the Z is better than any of its predecessors at recognizing gestures. There's swipe up to small screen, chop chop to flashlight, and the one I miss whenever I use a non-Moto phone, wrist twist to camera. How about that camera? Well, in exchange for the pronounced camera crater, which will look familiar to any Moto 360 owner, you get optical stabilization, big old aperture, and a dual tone LED flash. Also the viewfinder is cleaner and easier to use than ever, with a broader set of manual controls if you want them, and it still packs that cool trick of automatically reading bar codes. So it's a fun camera to shoot with, but the end results didn't exactly blow me away. It's not that photos were miserable. I got some pretty nice ones given the right lighting, patience and a steady hand, but you need all of those working together to get a nice picture. For one thing, laser auto-focus doesn't always mean reliable auto-focus, and for another, I somehow got a lot of crappy burst photos in my camera roll even when I wasn't shooting in burst mode. This is probably a side effect of the feature called Best Shot. Often, I got better pics from the five megapixel front facing camera, which has a wide-angle lens and a selfie flash. So if you're using this phone mainly for self appreciation, well, that's something to think about. Video, which I shot mainly in full HD, is more of the same. Let me shut up for a few so you can see for yourself. I'm videoing this awesome throw, yeah, there you go. (soft guitar music) Fortunately, no matter what you shoot, odds are it's gonna look pretty dang great on the Moto Z's display, which makes a return to AMOLED from last year's LCD and comes down to a more manageable five and a half inches as well. My only real complaint is that it doesn't get quite as bright in the sunlight as, say, the Galaxy S7, and it doesn't get dim enough in dark room either. You'll need to get a third party app to darken it to avoid disturbing a bed mate. Let's round it out with the day-to-day details. I like having a home screen that lets me work in either portrait or landscape, which really comes in handy if you have a Moto Mod attached. Quick charging is here and does a good job of topping up fast, though it's no OnePlus Three. There's great side tone in the earpiece when you're making calls on the Moto Z, and it's nice to see a front-mounted speaker phone. But there's a weird software delay when switching to that speaker phone on a call, and the speaker itself is pretty tinny. - [Speaker] If you want to hear a sad tone written by a kindred spirit, press two. - [Michael] Finally, while we're talking audio, it's true, there's no earphone jack in site. Of course, there's always bluetooth or the USB-C adapter in the box. Something else to remember to take with you when leaving the house. Really, that's the Moto Z Droid Edition in a nutshell. A pretty good phone that becomes a great phone as long as you carry its dopp kit alongside it. While it does come in cheaper than the top tier competition on Verizon, it does so by just a hair. And that's not taking into account the added cost of Moto Mods. That won't stop me from buying the unlocked version of the Moto Z though. Despite its shortcomings, I really like it, from its aggressive design to its smart software. But I'm a weird due who can live with the idea of carrying around a special toolbox for his special smartphone. If you're not like me, you might wanna look into something more conventional from the competition or consider the souped up version of the Moto Z with the bigger battery and beefed up camera, the Moto Z Force, Droid Edition, also a Verizon exclusive. Mr. Mobile has one of those review devices too, folks, so if you want follow up coverage on the Force, let me know about it in the comments, right after you subscribe, so you don't miss future videos just like this one. Until next time, thanks for watching. Keep your Moto modded and stay mobile, my friends.",
    "transcript_keywords": [
        "Moto",
        "Moto Mods",
        "Moto Mod",
        "company gradually abandon",
        "phone",
        "Moto Mods charge",
        "Lenovo Moto",
        "Verizon",
        "magnetic Moto Mods",
        "Moto Mods launching",
        "Moto Mod ecosystem",
        "Moto Mod attached",
        "Mods",
        "Motorola",
        "Lenovo",
        "Droid Edition",
        "company gradually",
        "gradually abandon",
        "principles it laid",
        "speaker phone"
    ],
    "transcript_entity_values": [
        "The next few years",
        "Lenovo",
        "third",
        "Moto X",
        "Marshmallow",
        "the Moto X.",
        "Moto Voice",
        "last year's",
        "the JBL Sound Boost Speaker Set",
        "Verizon",
        "LTE",
        "5.2 millimeters",
        "2013",
        "the Moto Z Force",
        "Moto Zs",
        "2016",
        "Best Shot",
        "weekend",
        "Pinback",
        "Long Island",
        "five and a",
        "three",
        "JBL",
        "Moto Z's",
        "Verizon Wireless",
        "Moto",
        "Moto Display",
        "five megapixel",
        "Mobile",
        "Motorola",
        "3",
        "Boston",
        "non-Moto",
        "first",
        "the T-Mobile",
        "the past week",
        "LCD",
        "Moto Mod",
        "Michael",
        "two",
        "Moto Mods",
        "Galaxy",
        "September",
        "Moto Novo",
        "this weekend",
        "several days",
        "87 degrees",
        "the Galaxy S7",
        "Moto 360",
        "summer fall",
        "Michael Fisher",
        "one",
        "Force"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.11279069632291794,
        0.07275030016899109,
        0.03686703369021416,
        -0.0204455703496933,
        0.026382720097899437,
        -0.09873636066913605,
        0.042144160717725754,
        0.05598634481430054,
        -0.03322705253958702,
        -0.023715348914265633,
        0.03444768488407135,
        0.10977040976285934,
        0.08281891793012619,
        0.0571151003241539,
        0.02692912332713604,
        0.02341335453093052,
        0.08557786047458649,
        -0.06608657538890839,
        -0.01941652223467827,
        0.09573053568601608,
        0.019980983808636665,
        -0.015091193839907646,
        0.08170126378536224,
        -0.020379912108182907,
        0.0001370914396829903,
        -0.03568192943930626,
        -0.06195604056119919,
        -0.002608319278806448,
        -0.005376454908400774,
        -0.06100708618760109,
        -0.016541926190257072,
        0.18489274382591248,
        0.06107966974377632,
        0.020833460614085197,
        -0.04321411997079849,
        -0.11239989101886749,
        0.06466981768608093,
        0.011539716273546219,
        -0.05336273834109306,
        -0.06407344341278076,
        -0.024866251274943352,
        -0.020326383411884308,
        0.04906102642416954,
        0.01901596039533615,
        0.05440583452582359,
        0.0019046980887651443,
        0.03848636895418167,
        -0.032283470034599304,
        -0.0016774320974946022,
        -0.002095493720844388,
        0.012088829651474953,
        -0.08400343358516693,
        0.009651903063058853,
        0.004081306979060173,
        -0.06154985353350639,
        0.0571453720331192,
        -0.0610269159078598,
        0.014167631976306438,
        0.0010417215526103973,
        0.007498473394662142,
        -0.00347686605527997,
        0.021035948768258095,
        -0.025160616263747215,
        0.06717927753925323,
        0.01221535261720419,
        -0.009113220497965813,
        -0.06499991565942764,
        -0.14475500583648682,
        -0.05094962567090988,
        -0.00284121697768569,
        -0.006226946134120226,
        -0.014694422483444214,
        0.10580375790596008,
        0.015631500631570816,
        -0.10249442607164383,
        0.07233287394046783,
        0.08734682947397232,
        0.008187795989215374,
        -0.03182884678244591,
        -0.0002882759436033666,
        0.030115826055407524,
        0.014878557063639164,
        -0.0305714700371027,
        -0.029098618775606155,
        0.05466596037149429,
        0.027063969522714615,
        0.008157866075634956,
        -0.004597782623022795,
        -0.07803048193454742,
        -0.013381649740040302,
        0.002548778196796775,
        0.125944122672081,
        -0.013643286190927029,
        0.014480877667665482,
        -0.07386291772127151,
        -0.03956142067909241,
        0.020787587389349937,
        -0.02713511325418949,
        0.007086866069585085,
        0.062098946422338486,
        0.0646713450551033,
        0.01828216016292572,
        0.08672897517681122,
        0.00010057180043077096,
        0.05042649805545807,
        -0.04073396697640419,
        0.004268822725862265,
        -0.011689335107803345,
        -0.047284260392189026,
        0.04629930108785629,
        -0.10547417402267456,
        -0.007651009596884251,
        -0.035972725600004196,
        -0.002024030778557062,
        -0.05968134105205536,
        -0.057471033185720444,
        -0.03747113421559334,
        0.11005926877260208,
        0.09593238681554794,
        0.0447244793176651,
        -0.04459267109632492,
        -0.015350932255387306,
        -0.0528993159532547,
        -0.1788400113582611,
        0.03592822700738907,
        0.03513346612453461,
        -0.018178585916757584,
        2.1385304036899317e-33,
        -0.041499458253383636,
        0.09725763648748398,
        -0.03602113947272301,
        -0.008505968376994133,
        -0.041018176823854446,
        0.05508597940206528,
        0.029998591169714928,
        0.037870511412620544,
        -0.05234900861978531,
        0.0015746294520795345,
        -0.03866412118077278,
        -0.0005616252892650664,
        -0.0008731299894861877,
        -0.00612286850810051,
        0.028720032423734665,
        -0.10141771286725998,
        -0.064366914331913,
        -0.025097552686929703,
        -0.00010530371946515515,
        -0.0004945445107296109,
        0.029655080288648605,
        -0.03500484675168991,
        -0.03240397572517395,
        -0.042601048946380615,
        -0.031140223145484924,
        0.04954823851585388,
        0.04094995558261871,
        -0.0610637329518795,
        -0.015034356154501438,
        0.02888408489525318,
        -0.124286949634552,
        0.0008150115609169006,
        0.010174986906349659,
        0.003976480569690466,
        -0.01606184057891369,
        0.03200691193342209,
        -0.013392734341323376,
        -0.10979586839675903,
        0.031611811369657516,
        -0.09756439924240112,
        -0.11300147324800491,
        -0.047783590853214264,
        -0.12896640598773956,
        -0.013166094198822975,
        0.007008677814155817,
        0.028698742389678955,
        -0.010239643976092339,
        -0.007938443683087826,
        0.008358280174434185,
        -0.07426007091999054,
        -0.023652350530028343,
        -0.050378747284412384,
        -0.036816954612731934,
        0.021028568968176842,
        -0.06393925845623016,
        -0.02114587090909481,
        0.0013976885238662362,
        -0.0043649934232234955,
        0.02000998519361019,
        0.02625158615410328,
        -0.04076487943530083,
        0.02348737046122551,
        -0.07506025582551956,
        0.04944266751408577,
        -0.020240958780050278,
        0.04769765958189964,
        -0.004328793380409479,
        -0.07721588760614395,
        -0.003239176468923688,
        0.05471884831786156,
        0.06050580367445946,
        -0.0811806246638298,
        0.045750170946121216,
        -0.018085500225424767,
        0.07091587036848068,
        -0.028864944353699684,
        0.04125858470797539,
        0.020799601450562477,
        0.037152137607336044,
        0.05002442002296448,
        0.009506193920969963,
        -0.0005321278586052358,
        0.04505911469459534,
        -0.007821665145456791,
        0.005935348570346832,
        -0.012869699858129025,
        -0.03872155025601387,
        -0.04251854494214058,
        0.024757418781518936,
        0.06149591505527496,
        -0.0351814329624176,
        -0.05169941857457161,
        -0.017555464059114456,
        -0.0019580014050006866,
        0.09685242176055908,
        -2.4221751701624342e-33,
        -0.05287875980138779,
        0.035100057721138,
        0.06802325695753098,
        0.007532276678830385,
        0.020273681730031967,
        -0.10090320557355881,
        -0.056502629071474075,
        0.0362636037170887,
        -0.029187237843871117,
        -0.07917067408561707,
        -0.012311707250773907,
        -0.041757576167583466,
        0.03145425766706467,
        -0.009396777488291264,
        -0.018529780209064484,
        0.028673864901065826,
        -0.0424681082367897,
        -0.15425601601600647,
        0.08124338835477829,
        0.02553020417690277,
        0.07503952831029892,
        0.046277087181806564,
        -0.012798989191651344,
        0.04907350614666939,
        0.0016232503112405539,
        -0.023188630118966103,
        0.012968962080776691,
        0.012132074683904648,
        0.0848155990242958,
        -0.01917347125709057,
        -0.040471192449331284,
        -0.052360162138938904,
        0.017950773239135742,
        0.006763202138245106,
        0.1276802122592926,
        -0.013761133886873722,
        -0.0421072281897068,
        0.014116725884377956,
        0.03852346912026405,
        -0.01814347691833973,
        -0.024507662281394005,
        8.393284952035174e-05,
        0.062407806515693665,
        -0.02087228372693062,
        0.09164811670780182,
        -0.02546963281929493,
        -0.017296086996793747,
        -0.04224637895822525,
        0.07817775756120682,
        0.030342349782586098,
        0.016016760841012,
        0.055835265666246414,
        -0.044472262263298035,
        -0.006200212985277176,
        -0.0663902536034584,
        -0.014023877680301666,
        0.011245544999837875,
        -0.07291580736637115,
        0.015001964755356312,
        0.02704169787466526,
        0.10090728849172592,
        -0.01224706694483757,
        -0.017489740625023842,
        0.015224180184304714,
        -0.06901339441537857,
        0.019810697063803673,
        0.11993442475795746,
        0.01785307750105858,
        -0.020115571096539497,
        0.014688340947031975,
        -0.08362696319818497,
        -0.029640518128871918,
        0.003241868456825614,
        -0.0778932049870491,
        -0.013843472115695477,
        0.059678126126527786,
        -0.07000402361154556,
        -0.029758382588624954,
        -0.03439639136195183,
        -0.03151540830731392,
        0.08452890813350677,
        0.01957608014345169,
        0.05929598584771156,
        0.030024411156773567,
        0.016171572729945183,
        0.002318630926311016,
        0.0010060649365186691,
        -0.0051483167335391045,
        -0.06112177297472954,
        0.041483014822006226,
        -0.030466657131910324,
        0.027078187093138695,
        -0.0494997538626194,
        0.06937970966100693,
        -0.024918023496866226,
        -4.76655230841061e-08,
        0.05248396098613739,
        -0.040204018354415894,
        0.0739753320813179,
        0.0038205385208129883,
        0.07402310520410538,
        -0.0050934250466525555,
        -0.05212288722395897,
        -0.04690876975655556,
        0.13721466064453125,
        0.021235913038253784,
        -0.019289681687951088,
        -0.020461497828364372,
        -0.06254672259092331,
        0.04826192557811737,
        0.01306967530399561,
        0.06577048450708389,
        0.00885708723217249,
        0.007582440506666899,
        0.030306462198495865,
        0.06975629925727844,
        0.014711275696754456,
        0.00622533680871129,
        0.011372579261660576,
        0.003050260478630662,
        0.06385187059640884,
        0.027379678562283516,
        -0.05015784502029419,
        0.025880327448248863,
        0.04978892207145691,
        0.001118568005040288,
        -0.012439445592463017,
        0.055454399436712265,
        0.0450807586312294,
        0.013305873610079288,
        -0.03881533071398735,
        -0.04154790937900543,
        0.00687911594286561,
        -0.03099772334098816,
        0.0382058322429657,
        -0.03265029564499855,
        0.06454785913228989,
        -0.04451489821076393,
        0.05709518492221832,
        0.04692867025732994,
        -0.03282323479652405,
        -0.04032205417752266,
        -0.06044672429561615,
        -0.12992194294929504,
        -0.007129082456231117,
        -0.011301890946924686,
        0.003711150260642171,
        -0.031939394772052765,
        -0.016481105238199234,
        -0.022678317502141,
        0.08861241489648819,
        0.03786657378077507,
        0.04588790610432625,
        -0.02633734606206417,
        -0.014343049377202988,
        0.034024178981781006,
        -0.013460841961205006,
        -0.05855019390583038,
        0.07258047163486481,
        0.06868396699428558
    ]
}