{
    "id": "nMqRmXO2x3s",
    "title": "Get a cert, get a hacking job? #CEH #OSCP",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-02-04T15:13:01Z",
    "video_url": "https://www.youtube.com/watch?v=nMqRmXO2x3s",
    "category": "Science & Technology",
    "tags": [
        "hacker",
        "hacking",
        "ethical hacking",
        "cyber security",
        "certified ethical hacker",
        "ceh",
        "oscp",
        "ine",
        "ethical hacking course",
        "ethical hacker",
        "learn hacking",
        "hacking course",
        "hackers",
        "certified ethical hacking",
        "ceh v10",
        "ceh certification",
        "oscp certification",
        "ceh exam",
        "ethical hacking tools",
        "how to be a hacker",
        "hack",
        "nsa",
        "hacking tutorial",
        "kali linux",
        "elearnsecurity",
        "ctf",
        "ethical hacking full course",
        "how to become a hacker",
        "ethical hacking career",
        "how to hack",
        "cyber security course",
        "cybersecurity"
    ],
    "views": 99541,
    "likes": 3406,
    "comments_count": 342,
    "description": "Get cert, get job? Want to be a hacker?  Do you need to get the CEH or OSCP certifications?  Want a job? Just DM Neal (joking)!  Menu:  Which hacking certifications are worth it? 0:00  Is the CEH is worth it for jobs? 0:26 A massive issue with certs: 5:24 What about Security+ Dod 8570: 6:48 Gatekeeper certs: 9:12 What is the top one cert to get today: 12:40 Which certs if you have time and money: 13:37 How networking can change your life: 14:04 Social media has changed everything: 16:50 DM Neal if you want a job: 17:07 Intern strategy: 18:03 How to start: 19:29 How to open doors: 19:46 Real world example: 20:17 It's who they know: 21:20 It's not get cert, get job: 21:46  ================ Previous Video: ================ Start here:   ================ Links: ================ INE Free training:  eLearn Security:  OSCP:  SANS:  Hack the box:  Try Hack Me:  CTF Time:  CEH:  Cyber Blue:  Cyber Defenders:   ================ Connect with Neal: ================ LinkedIn:  Twitter:  Twitch:   ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    ================ Support me: ================ DavidBombal.com: CCNA ($10):   Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   hack hacker hacking nsa nsa hacker nsa hacking ethical hacking ceh oscp ine try hack me hack the box hacking ethical hacker oscp certification ctf for beginners  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #ceh #oscp #hacking",
    "description_links": [
        "https://youtu.be/SFbV7sTSAlA",
        "https://bit.ly/freeinetraining",
        "https://elearnsecurity.com/product/ejpt-certification/",
        "https://www.offensive-security.com/courses-and-certifications/",
        "https://www.sans.org/",
        "https://www.hackthebox.eu/",
        "https://tryhackme.com/",
        "https://ctftime.org/ctf-wtf/",
        "https://www.eccouncil.org/programs/certified-ethical-hacker-ceh/",
        "https://securityblue.team/",
        "https://cyberdefenders.org/",
        "https://www.linkedin.com/in/nealbridges/",
        "https://twitter.com/ITJunkie",
        "https://www.twitch.tv/cyber_insecurity",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10"
    ],
    "transcript": "- I appreciate your hot seats. And I can definitely feel the flames underneath. I gotta readjust jury adjusts for the flames. - I think it's good. I mean, it's, I'm sorry to put you in the hot seat. It's just, these are- - Oh, you're good. - I think it's questions that a lot of people would have about trying to make the most of their time make the most of their money. - I wouldn't get into the kitchen with you if I couldn't take the heat. (laughs) (bright upbeat music) - Hi, everyone it's David Bombal back with Neal, had some fantastic feedback on previous videos but I wanna put Neal in the hot seat in this video, but Neal, before I do that welcome. - Thank you, David, I appreciate you having my back again. - So on jumped, straight into it on one of our previous videos, you kind of said that you don't like CEH or you're not, I think your words were you're not a fan of CEH and then someone commented, well a few people commented and said, you know, Neal you say that I don't need to worry about CEH or I don't need to worry about degrees but when I go and look at job applications one of the first things I see is CEH or I see you need a degree. So Neal can you just explain a bit more about that? And then also, like, how does someone do this? I think you kind of mentioned and I don't wanna take it away. You kind of mentioned like you need certs for knowledge and certs to get past the gatekeepers. So if you can, I'll open it up to you. If you can kind of talk around that and I'll quiz you some more. - Yeah, absolutely and in the essence of transparency I will go ahead and admit that when people put CEH on job applications it's oftentimes because, you know, and again EC-Council has done a fantastic job back in I think the early two thousands when they created, you know, a Certified Ethical Hacker course, I mean, that has been the single biggest marketing win that I think the cyber security industry has had in its entire existence. I mean, that course is I mean, you see it and you hear it and you instantly know, you know, what it is that you're credentialed to do allegedly from from that name. And I think that that's why they show up as a gatekeeping type of cert on a lot of a lot of HR organizations is because when they search ethical hacking certifications in Google, the first one that comes up is Certified Ethical Hacker, right? And that's just great, brilliant marketing and SEO. And so I'm not taking away from using CEH as a gate-keeping cert, but, what I don't want the audience to walk away with is that CEH will give you a knowledge set that makes you an awesome ethical hacker even makes you a qualified ethical hacker. And I think that that's where my not a fan of them comes into play is, you know it gets back to, you know, acknowledge, put your search into buckets where the search that I actually learned something out of and I actually got some benefit from and where are the certs that I knew that I needed to get? Because they got me past a gatekeeper. And this came up on my stream on Monday when we talked about this, or maybe it was Saturday when we had the stream on Saturday why should we focus on assert, like, you know, you know EDPT cert versus something like CEH or stands or something like that. And you have to take a step into the wayback machine and think about CEH, think about SANS and think about offsets OCP. When the cybersecurity industry was very young those were the only search that were out there. And so the pen testers that exist in organizations right now are the folks who are helping hiring managers, right? Job recs, you know, they have CEH's they have SANS courses, they have OSCPs. They've probably graduated past where they're probably not taking certs anymore. And so maybe they're just not as familiar with cert industry. And so a HR person just simply goes to the hiring manager and says. Hey I need a job description for a pen tester. Can you write on there what's needed. And they go, well, I've got a SANS sir, and I've got OCP. So at a minimum, I'd want them to have the same as me. So there's really no science to that. It's not like a law degree or a CPA, you know, a certified public accountant, or, you know, anything where you know, you know, it's pretty industry wide known that you have to have a degree in X or you have to have a certain X to be successful. We don't have that level of structure inside of cybersecurity. And so I think a lot of the what, you know, what cert gets me a job versus what certs teach me how to be a penetration tester. I think that gets lost in the mix. And so me not being a fan has nothing to do whether they're a gate-keeping cert to get in there. But if you want to be good if you want to learn, if you want to not get, you know, not get ridiculed for wearing a badge, the CEH badge isn't one that I would wear. I mean, I have three from my days, but I've never won. I mean, this video right here this will be the first time that I think anybody actually ever knows that I have CEH unless they go look at my LinkedIn and see that I have it there. I don't think I ever tell anybody that. - Someone said that, it said like you said you don't like CEH but you've got CEH. So that was one of the comments. - Yeah, I'll never tell that I have CEH other than just putting it on my LinkedIn and I feel very confident saying that, and here's I'll kind of piggyback a second kind of, you know, high horse about that. There's a website out there or it used to be, hopefully it's still around. It's called examcollection.com. And it is the single biggest repository of brain dumps of of certifications that are out there. And for years, you didn't have to take a single CCNA course. You didn't have to take a single MCSC or MCSA course you'd have to take a single CEH course. You could just simply go to this examcollection.com, download all the questions, memorize all the answers, to all the questions, walk right into a testing facility and ace an exam. - Yep, it's a big problem. - It's a big problem and for the longest time EC-Council and I don't even think to this day, I haven't looked lately. I don't think EC-Council does anything about that. And so how can you take a cert seriously from a true knowledge gain perspective? How can you take a company like EC-Council seriously when they don't address that blatant level of cheating and de-credentializing their cert in the industry? - I think it's a problem for all sorts. I mean, it affects Cisco certs as well. It's always been a, it's been a bane on the industry or on certifications, not just ethical hacking but other industries as well. I mean, on that previous video, you also mentioned network plus. And so I'm gonna push, yeah. This is like you in the hot seat, guys, someone made a comment like, but how can you say you shouldn't get network plus because isn't that a requirement for some of the, I can't remember off the top of my head now there's this U.S military. - DoD 8570. - Yeah, so yeah. Shouldn't you just get network plus so that you get that. - So there's a hard, you know, I appreciate your your hot seats and I can definitely feel the flames underneath I gotta readjust jury adjust for the flames. Glad I brought my bottle of water for all the flames here - You're in the hot seat man, - I'm in the hot seat, so let's do this. Here's what I say, right? Again, you know, look at certs in what gets me past the gatekeepers versus what's gonna make me smarter, right? And you also have to look at those. When you look at those together, everybody has a limited amount of time and money to achieve the objectives that they need to achieve. Do you need network plus CEH is still listed on DoD 8570 Lord knows that was our biggest, kind of, oh shit moment if you will. When we were building the first functional training unit in the Air Force was that the bar to entry that had been written in 8570 to do offensive hacking in the air force in the NSA was CEH and so when we looked at that, we were like, yeah, that's just not gonna fly as we build out this program. And so that's why we at the time partnered with SANS and did a .mil course in SANS to better train our folks, you know, who were going into the various types of cyber pipelines, you know in inside of the military. And so, you know, if you're in that pipeline and you're applying right, for you know a certain set of jobs, you know and I hope to see the 8570 get changed to where it's not limited to just DC council. If it hasn't updated yet you do have to take those things into consideration. You do have to look at the requirements of the job versus the nice to haves, right? And that's the difference between say something like DoD 8570, which is you explicitly have to have this and our job description for Target or Apple or something like that, that says, would like to have this, right? Make sure you're not parsing the words and make sure you're being real with yourself versus what do you have to have, versus what is what you would like to have and make those decisions based on that. - I think that's good. I mean, it's, I'm sorry to put you in the hot seat. It's just, these are- - Oh, you're good. - I think it's questions that a lot of people would have about trying to make the most of their time, make the most of their money and- - I wouldn't get in the kitchen with you. If I couldn't take the heat, (laughs). - A good one, so gatekeeper search. I mean, I did I actually, after I, well I think yesterday I went on to indeed and had a look at the some of the U.S jobs and I just searched for CEH and I did a search for like computer security plus that type of thing and what I found interesting is they will say has one of these, and then it lists CEH and security plus and a few other sites. So it looks like the, a lot of the recruiting agents are just filling in, like you said like a whole bunch of search to try and get people through the door, get people to like at least apply. So what do you think about that? I mean, is there a certain gatekeeper search that you would recommend or you saying kind of like what you said before look at the kind of role that you're going for and then get the sites according to the role that you're looking for. I think a little bit of that last part but I think what, you're, what you just described is exactly the problem that we have in the cybersecurity industry. And this is why you don't really hear me talk about search very often is because I think recruiters don't know enough about this industry that they and I think we mentioned this when we were doing, you know the last videos, there's three and a half million open cyber security roles, you know, across the globe. And so while somebody may say that we'd like for you to have one of these, it doesn't hurt you to apply, without one of those, because, you know if you've got a resume that meets some of the criteria that we talked about before let's say you're a college student, just coming out of college, you know and you've got a four-year degree in computer science, just because that's what you went to school for when you thought that that's what you needed to go to school for but you've got a resume that's filled up with, you know, tons of try hack made tons of Hack The Box, tons of capture the flags, tons of, you know, industry, you know volunteer experience either with your school or with somebody in the community. CCDC, I forgot what the other one cyber league or whatever it is that that's offered in the U.S, if you've got experience like that, recruiters will look at that and they'll be like, well he doesn't have any of the certs, but God he's got a lot of this other cyber experience. We should put this through and see if the hiring manager will look at it. And so there, there are recruiters that'll do that you know, because they realize that, you know they don't know all the certs that are out there. And to your point to the research that you did they're just slamming certs onto a job description hoping that they get somebody. And that should tell you the level of desperation that folks are at when it comes to hiring cybersecurity talent, that they don't even they don't care and don't know enough to know which search to put on a job description. Now, if you did have the time, the money, the wherewithal and you wanted to just get the gatekeeping certs knocked out, then, you know, I think, I think sec plus, I think A plus I think CEH, I think you know you know, PTS from INE I think those all represent perfectly fine gatekeeper certs but if you had to prioritize time or money, right? And a limited amount of choices I would just make the responsible choice in terms of what you pick. - So partied again, cause I like to push you. - (laughs) Let's do it. - If I think we mentioned this on a previous call if I had to choose just one cert it would be OSCP I think is what we said. So that's like the main get past the gatekeepers cert, is that right? - It's definitely, traditionally been the main gatekeeping cert, my hesitation is only that I hope we see the industry shift especially in the next five years, as we see more and more folks realize that OCP hasn't kept up with the times, they only have a handful of courses. They haven't innovated their course very much over the years. And I hope that we see more market entry players into that to help challenge them. But I think currently as of today probably as of when this video goes out, yeah. They're probably the premier gatekeeping surfer for ethical hacking roles. - And I mean, it's not a trying to trip you up, Neal. It's just to try and help guys. So that's why I'm putting you in the hot seat. - Absolutely. - How do we best help people get the job that they want. So, based on what you kind of said to summarize you, if you've got the time and you can afford it it makes sense to get a CEH or a security plus or something like that, just to get that on your resume so that you can get past the gatekeepers. But I think I just wanna emphasize loss on the last video depending on how we cut the interviews up. You mentioned a guy in Africa who contacted you via DM saying that he was struggling to get somewhere. And what you did is you gave the details. If I remember correctly to someone very high up in that organization and the point I wanna try and make through that is it's who, you know in life often makes the biggest difference. - Which is why, you know, and I'm glad you brought that up because, you know, I think that that gets lost in the cert conversation. This is why I think in our last video, we talked about like one of my big three things that I mentioned in the last video was networking. And, I know that I'm gonna get a ton more DMs after this because I have so many and that's okay, bring the DMs on. I promise, I'm getting, I promise, I go through every single DM. It may just take a while, but I promise you, if you got a response from me, that means that I went through and went through my DMS. I have another round of them that I have to go through and I promise you, I'll get to my, all my DMs, I won't let those go. - We donno how long that's gonna go - I know. - One day when you, get like a hundred thousand followers, we'll see it. - I know you warned me on that, but I was like, I'm gonna prove David wrong. I'm gonna go through all of my DMs, but no, I mean, and, and it is true. I mean, it's like, I, and I think I mentioned this on this video, if not I'll reemphasize, is, you know I think I got the first job when I came out of the air force strictly off of my resume. But every other job that I got after that I got through networking, right? I got through people who just looked at my LinkedIn and was like, I think this is a guy that would make a great, you know intro to our organization. I got them because somebody I had done work for them as a consulting company. And they were like, we'd love for you to come work for us, right? And yes, to David's point depending on how we cut this there was a guy who reached out to me on my DMs who worked for a big four that I happen to have a lot of really good contacts with, who is trying to get out of his, you know, situation, you know where he couldn't move past where he was at. And I was able to put him in touch with folks who did the ethical hacking at a pretty high level and a couple of the key partners in that big four organization to try to help pull him out of that position, where he was at into something that got him to do what it is that he wants to do. And again, through that networking. And that's why I tell people is like, yeah, you know, go to your gatekeeper search. If you've got the time and the money too, go get your OSCP if you've got the time and the money too, but, you know, that might be how you land your first ethical hacking job. But I would almost be willing to bet that you actually might land your first ethical hacking job. If you put in the time and the effort to do the networking to talk to people in the industry and to develop yourself and credentialize your name in the industry, you might actually get your first ethical hacking shop through networking. - You know, the world's changed. I mean, social media has changed everything. I mean, the fact that someone can reach out to you across the ocean or whatever and you can immediately put them in contact with someone just shows you how the world has changed. So I'm pretty sure your DMs are gonna be on fire. Anyone wants to jump, just talk to Neal. - That's right, that's what I just told. Literally all your subscribers was all cool. I can DM Neal and get a job. - There you go, so lets see how long you last, Neal you challenge me, so he challenged all of you. DM Neal like crazy. I feel sorry for you now. Seriously, I mean, it's who, you know there's someone and I won't mention it because he's asked me not to mention it now but it's someone I'm gonna talk to you about at some point, he's also got a lot of knowledge. He's been helping me. I've mentioned this in other videos as well. You know, if you help me on my discord as an example and then you see that you're helping out and you're doing things and you're not asking for something you're just helping out. And then at some point I find out that you're looking for a job and you're struggling to break in. Who do you think I'm gonna help? You know, I'm gonna help that chap. And you're gonna be one of the first people I'm gonna introduce him to because it's who you know, and who they know. I'm sorry go on. - NO and I was gonna piggyback on that because we love talking about Gary V on your show. This is gonna be the only it cyber show that we have the most references to Gary V on, you know Gary V mentions his interning strategy. Right? And I think people I think people when they think interns and I've gotten a lot of the mentorship requests that have come from from my DMs as well since our last couple of interviews, right? And I think people, when they think about interns they forget that like the Gary V mentality on interns is like find somebody that you want to learn from. And then you offer to intern for them for free. Now, now we use intern but that could be volunteered on your discord, volunteering on my discord, volunteering on, you know, on your YouTube channel, volunteering on my Twitch stream. It could be volunteering, you know, interning in some way where we have an interaction that happens on a day to day, week to week basis where you're innately gonna work, will learn from me. But Gary's V strategy is find that person, offer to work for them for free, three months, six months, a year, whatever it is that you can afford don't rush out of the house, you know, still stay live at home with your parents or whatever the case is, but intern with them for a year and just soak up as much knowledge. That's the best interning that you can do. And, and you're absolutely right, David that person is at the top of my list. Like the first time I hear about a job I'm gonna be like, I've got a dude or woman that I would love to put you in contact with because they've proven their value. I just wanted to say that you don't have to give up your full-time job because the way the world goes now, or is now on discord you could just help out when you've got time, you know help out in your spare time. And that might be enough. And there's certain group of people in my discord that I will always help because they're helping me. And I think networking like that can open up many more doors than just having a site. I mean, if someone came, sent me a random resume and they had a whole bunch of certs on their resume I would just probably throw that in the trash compared to someone who's got less certs, but has proven to me in their personal capacity, their knowledge, I vouch, I've vouched for people all the time, based on my network, over a resume. I've got, I've got a guy who, he volunteers for me a lot. He's in a couple of videos. I mentioned the guy who spent 10 years building his own marketing firm. He's trying to break into cyber. He had one job with an MSP. Unfortunately they ended up letting him go because they downsized as part of COVID. But he hustles on my stream and helps me do the marketing and things like that on my stream. And I have done. - Let's do it right now. Give me his name because this is what we're gonna do. We're gonna help him so tell me his name. - His name is Sam Radwan. And I'll send you his LinkedIn. So you've got his LinkedIn. He is trying to get into, you know, a cybersecurity job and he's got cybersecurity experience. And he hustles for me all the time. And I, every single time I get a wind of something that I can get him into, I call him up I text him and be like, hey, I've got something. Would you be interested in this? - So, I mean, I think what we've just done there is showing the principal that, you know Neal and I met a week ago. It's not just who, you know it's who they know and who they know. And it's exponential. I'm very much a believer it's, you know, make contacts and contribute because if you contribute to the community people in the community will help you. - Yeah absolutely a hundred percent. And so it's a circle all this background because this is a huge giant soapbox that I know that we can get in on this is why we can talk certs all day long but the answer isn't get cert, get job. Like, and I think that that's the big thing that I would send across to people is, you know, and I think coming out of my DMs, the question was, well, is this cert a good idea? Or is this sort of good idea? Or I'm going down this path is this okay? We can talk about gatekeeping search. We can talk about search where you get hands on skill. We talk about going to ranges like RangeForce, try Hackney, and Hack The Box. You know, all these places where you get hands-on. I think all of those are paths to gain knowledge and to get past gatekeepers. But, you know, when we talk about the three things and one of those three things is networking that's because that is going to carry so much more weight than all of these other things that you happen to need to do to work the system. And I think it was just preface. They were saying it doesn't help to network. If you don't put the work in to get the knowledge, you know if I recommend you for a position and you screw up it's gonna put a real damp on helping you again, you know, you've got to come to the table and contribute. You've got to put in the work to get the knowledge as well. So network, but on the, at the same time, you know, go and do Hack The Box and do other things to make sure that you have the prerequisite knowledge and you can do the job because you don't wanna make a fool of us. If we recommend you for a job and you mess it up but you also make a fool of yourself, you know, that'll get round just as quickly. So, you know, be careful. - Absolutely. - You know we're out of time. I really wanna thank you again for you know, sharing your knowledge and getting on the soap boxes, I love it. Thanks very much. - Always David, glad to be part of this. Thank you to you and to your community. I truly do appreciate it. And everybody is happy to have literally whatever knowledge is in here. - And make sure you DM Neal. (laughs) - Cheers. - Cheers. (bright upbeat music)",
    "transcript_keywords": [
        "CEH",
        "job",
        "time",
        "certs",
        "cert",
        "Neal",
        "people",
        "make",
        "people put CEH",
        "put",
        "search",
        "industry",
        "Ethical",
        "ethical hacking",
        "knowledge",
        "lot",
        "hot seat",
        "kind",
        "mentioned",
        "ethical hacking job"
    ],
    "transcript_entity_values": [
        "first",
        "DM Neal",
        "CEH",
        "three",
        "Neal",
        "OSCP",
        "Sam Radwan",
        "four-year",
        "Target or Apple",
        "the years",
        "DMS",
        "Cisco",
        "8570",
        "Saturday",
        "Hack The Box",
        "three months",
        "Gary",
        "three and a half million",
        "four",
        "sec",
        "CCDC",
        "years",
        "10 years",
        "DoD 8570 Lord",
        "second",
        "six months",
        "DC",
        "Africa",
        "YouTube",
        "Google",
        "David",
        "U.S",
        "today",
        "a week ago",
        "Hackney",
        "wayback",
        "NSA",
        "Hack The Box",
        "a hundred thousand",
        "EC-Council",
        "one",
        "a hundred percent",
        "MSP",
        "SANS",
        "RangeForce",
        "a year",
        "LinkedIn",
        "Monday",
        "EDPT",
        "CCNA",
        "DoD 8570",
        "a day to day",
        "MCSC",
        "David Bombal",
        "yesterday",
        "OCP",
        "this day",
        "the Air Force",
        "the next five years"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "GPE",
        "LOC",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.0309299249202013,
        -0.015144950710237026,
        -0.020507557317614555,
        -0.022195441648364067,
        0.026610935106873512,
        0.004980156663805246,
        0.014149433933198452,
        -0.008272072300314903,
        -0.004809407517313957,
        -0.026969220489263535,
        -0.0035774237476289272,
        -0.05952254682779312,
        0.048379309475421906,
        -0.009653997607529163,
        -0.038117121905088425,
        -0.04491197317838669,
        -0.027781270444393158,
        -0.021332139149308205,
        0.033146679401397705,
        -0.12684085965156555,
        -0.017165537923574448,
        -0.040471840649843216,
        -0.01650170050561428,
        -0.07946382462978363,
        -0.06371862441301346,
        0.039537183940410614,
        0.006336824502795935,
        0.024420466274023056,
        -0.07844144105911255,
        -0.043755579739809036,
        0.029720935970544815,
        0.04639601334929466,
        0.005091493483632803,
        0.004775158129632473,
        0.0031372990924865007,
        -0.04284000024199486,
        0.10588239878416061,
        0.04289652407169342,
        0.04437227547168732,
        -0.021720172837376595,
        0.004345109686255455,
        -0.1377389132976532,
        0.01743767037987709,
        -0.0022653029300272465,
        -0.042925748974084854,
        -0.02221432700753212,
        -0.04932926595211029,
        -0.048724956810474396,
        0.024909555912017822,
        -0.017907829955220222,
        -0.052137941122055054,
        -0.06940969824790955,
        0.04420070722699165,
        0.060933344066143036,
        -0.0002982937730848789,
        0.000277622981229797,
        -0.01922808773815632,
        0.05101873353123665,
        0.0559370256960392,
        -0.014277475886046886,
        0.017505278810858727,
        0.020420460030436516,
        -0.04147493839263916,
        0.03626066818833351,
        0.0426362082362175,
        -0.013156643137335777,
        -0.03406400606036186,
        0.04117221012711525,
        0.017906948924064636,
        0.013516095466911793,
        -0.0614413358271122,
        -0.05620943382382393,
        -0.021522674709558487,
        0.04686839133501053,
        0.05609995499253273,
        -0.032207053154706955,
        0.004876801744103432,
        -0.07566316425800323,
        0.0709269791841507,
        -0.060929324477910995,
        0.0681760311126709,
        0.011862234212458134,
        -0.10813786834478378,
        0.03819829225540161,
        -0.018393293023109436,
        0.03402462974190712,
        0.002954326570034027,
        0.04372598975896835,
        0.08595310896635056,
        0.0312152411788702,
        0.03276821970939636,
        -0.023866422474384308,
        -0.06685236841440201,
        -0.016830051317811012,
        0.0777646154165268,
        -0.013480773195624352,
        0.018988747149705887,
        -0.016938796266913414,
        -0.011575108394026756,
        -0.002187232254073024,
        -0.043972309678792953,
        -0.03559314087033272,
        -0.019300803542137146,
        -0.06733283400535583,
        0.07164371013641357,
        0.10437854379415512,
        0.04182698205113411,
        0.056763384491205215,
        -0.014231700450181961,
        0.02324914187192917,
        0.025567663833498955,
        0.05466722697019577,
        -0.061541423201560974,
        -0.08453948050737381,
        0.047602009028196335,
        0.10686308890581131,
        -0.050114959478378296,
        0.08525161445140839,
        0.011059588752686977,
        0.029874101281166077,
        0.017190339043736458,
        0.05991291627287865,
        -0.017483465373516083,
        0.022983696311712265,
        -0.05718180537223816,
        -0.03988511115312576,
        0.03963156417012215,
        9.203717425439385e-33,
        0.050094056874513626,
        0.06634709239006042,
        -0.05984970182180405,
        0.02145654894411564,
        0.0984354093670845,
        -0.017662594094872475,
        0.03374643623828888,
        0.12193059921264648,
        -0.06864352524280548,
        0.06277003884315491,
        0.019292350858449936,
        0.002327859401702881,
        -0.0643928200006485,
        -0.05817020684480667,
        0.044560883194208145,
        0.0016949687851592898,
        7.612652552779764e-05,
        -0.055854570120573044,
        -0.054513197392225266,
        -0.007016591727733612,
        0.04245896264910698,
        -0.10925279557704926,
        -0.009573633782565594,
        0.007044974248856306,
        0.11193151772022247,
        -0.03556664660573006,
        -0.015669314190745354,
        -0.011635261587798595,
        0.07523123174905777,
        0.006994325201958418,
        -0.061007123440504074,
        0.01372870709747076,
        -0.031414538621902466,
        -0.01651949994266033,
        0.06992935389280319,
        0.06907308846712112,
        0.004529251717031002,
        -0.08861923962831497,
        -0.020194081589579582,
        -0.06486015021800995,
        -0.12607789039611816,
        0.04077080637216568,
        0.07709617167711258,
        -0.01853361912071705,
        0.02105984278023243,
        0.022209415212273598,
        0.030172433704137802,
        -0.08540207892656326,
        0.055565960705280304,
        0.05853485316038132,
        -0.029288142919540405,
        0.004394277930259705,
        -0.01916763186454773,
        -0.11035019904375076,
        -0.0918138399720192,
        -0.02621326595544815,
        0.023138657212257385,
        0.016446975991129875,
        -0.06791826337575912,
        0.048058442771434784,
        -0.015472696162760258,
        -0.015658827498555183,
        -0.051472485065460205,
        -0.012432143092155457,
        -0.012907931581139565,
        -0.014887177385389805,
        0.03825950250029564,
        0.04610098525881767,
        0.010866503231227398,
        0.025277262553572655,
        -0.07740706205368042,
        0.00787093210965395,
        0.037236884236335754,
        -0.011147317476570606,
        -0.01370583288371563,
        0.0705556571483612,
        0.0349787212908268,
        0.043432656675577164,
        -0.009127466939389706,
        0.01949392817914486,
        0.07042606174945831,
        -0.002183847827836871,
        0.003677929053083062,
        -0.009960908442735672,
        0.09748318791389465,
        0.1224001869559288,
        0.07353277504444122,
        0.019262462854385376,
        0.020558705553412437,
        0.055050719529390335,
        -0.07809502631425858,
        -0.00829794630408287,
        0.07254008948802948,
        0.05750167369842529,
        -0.10478466004133224,
        -1.0432406569056228e-32,
        -0.03603155538439751,
        -0.005120827816426754,
        0.004912492353469133,
        0.04239280894398689,
        0.08072927594184875,
        0.008709236979484558,
        -0.011516929604113102,
        0.03202930837869644,
        0.026240257546305656,
        0.030368346720933914,
        -0.0014917878434062004,
        -0.018117818981409073,
        0.05816677212715149,
        -0.09078215062618256,
        0.007635481655597687,
        -0.11748243868350983,
        -0.10749156773090363,
        0.02691514976322651,
        -0.11463490128517151,
        0.009704004041850567,
        0.033271100372076035,
        0.09648139774799347,
        -0.060084253549575806,
        0.008863584138453007,
        0.06634897738695145,
        0.029801102355122566,
        -0.001336271408945322,
        0.06098222732543945,
        -0.011457794345915318,
        0.09319750219583511,
        -0.0017274427227675915,
        0.0310163963586092,
        -0.0014963928842917085,
        0.08149860799312592,
        -0.061799634248018265,
        -0.039933014661073685,
        0.05260009691119194,
        0.012020937167108059,
        -0.008180782198905945,
        0.0601663812994957,
        0.03717928007245064,
        -0.01976735144853592,
        -0.07793556153774261,
        -0.05265113338828087,
        -0.05097661167383194,
        0.02781798131763935,
        0.03465528413653374,
        0.061889320611953735,
        -0.014713112264871597,
        -0.0031965221278369427,
        0.05250150337815285,
        0.030413514003157616,
        -0.06312435865402222,
        0.012393198907375336,
        -0.010800788179039955,
        0.03205395117402077,
        -0.06711792945861816,
        0.026170451194047928,
        0.06139868497848511,
        0.023082910105586052,
        0.03682837262749672,
        0.03397368639707565,
        -0.039268191903829575,
        0.02932271547615528,
        0.00946146808564663,
        -0.08077269047498703,
        -0.07538529485464096,
        0.05472997575998306,
        -0.10230401903390884,
        -0.015998607501387596,
        0.014929059892892838,
        -0.05504867807030678,
        0.017827274277806282,
        -0.08541619032621384,
        -0.04616846144199371,
        -0.08880579471588135,
        0.023218516260385513,
        -0.012997214682400227,
        -0.09349508583545685,
        0.06389213353395462,
        0.05794290453195572,
        -0.016450373455882072,
        -0.046495433896780014,
        0.03563116863369942,
        0.05014437437057495,
        0.09749747812747955,
        0.06778737902641296,
        -0.05431947857141495,
        0.01831992343068123,
        -0.035063084214925766,
        -0.1083594411611557,
        -0.015516585670411587,
        -0.037214700132608414,
        -0.0012074384139850736,
        0.016219664365053177,
        -5.5240509055920484e-08,
        0.02478327415883541,
        0.0038492826279252768,
        -0.05332084000110626,
        0.02276366949081421,
        0.03070986643433571,
        0.0005693819257430732,
        -0.05735420435667038,
        -0.10022816807031631,
        0.03304176405072212,
        -0.022965561598539352,
        0.012881198897957802,
        -0.07915642112493515,
        -0.040466852486133575,
        -0.06592976301908493,
        0.0036427569575607777,
        0.01693863980472088,
        -0.049657028168439865,
        -0.050132397562265396,
        -0.0015901329461485147,
        0.02786910906434059,
        0.07811776548624039,
        -0.035863034427165985,
        -0.006180195137858391,
        0.06856522709131241,
        -0.09377261996269226,
        0.05584891140460968,
        0.018621644005179405,
        0.07100828737020493,
        -0.03835877776145935,
        0.07665806263685226,
        -0.06536043435335159,
        -0.062376610934734344,
        0.0003907125792466104,
        -0.0072401887737214565,
        0.02366774156689644,
        0.007982411421835423,
        -0.07305984944105148,
        -0.08797366917133331,
        -0.011539802886545658,
        0.0835893377661705,
        -0.06090639531612396,
        -0.05362282320857048,
        0.016228914260864258,
        0.040139090269804,
        -0.11301723122596741,
        -0.0021809926256537437,
        -0.06435293704271317,
        -0.012053253129124641,
        -0.0006636983598582447,
        0.0199156291782856,
        0.019468754529953003,
        -0.10768933594226837,
        0.024912968277931213,
        -0.052856020629405975,
        0.012325702235102654,
        0.038625627756118774,
        0.0751449465751648,
        -0.04430074244737625,
        -0.06691890209913254,
        0.023028355091810226,
        0.05810409411787987,
        -0.1131661906838417,
        -0.0033212725538760424,
        0.0022837542928755283
    ]
}