{
    "id": "NnsHhqAdOiM",
    "title": "Even DELL is going AMD - Alienware Aurora Ryzen Edition R10 GAMING PC",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-05-28T21:44:13Z",
    "video_url": "https://www.youtube.com/watch?v=NnsHhqAdOiM",
    "category": "Science & Technology",
    "tags": [
        "AMD",
        "Ryzen",
        "Aurora",
        "PC",
        "Gaming",
        "NVIDIA",
        "Pre-Built",
        "Assembled",
        "Upgradeable",
        "Keyboard",
        "Mouse",
        "Heat",
        "Temperature",
        "2080 Ti",
        "3950X",
        "Dell",
        "Alienware",
        "DIY",
        "Space",
        "Liquid Cooling",
        "Performance",
        "Desktop",
        "Doom"
    ],
    "views": 1398219,
    "likes": 41458,
    "comments_count": 2614,
    "description": "Sign up for Private Internet Access VPN at   We've always seen Alienware PC using Intel processors, but their recent Aurora R10 they went AMD! You might consider this if you want a pre-built.   Check out the Alienware R10 Aurora Ryzen Edition Gaming Desktop at   Buy Alienware Aurora Gaming Desktop On Amazon (Paid Link):  On NewEgg (Paid Link):   Buy Alienware Gaming Keyboard On Amazon (Paid Link):  On NewEgg (Paid Link):   Buy Alienware Gaming Mouse On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy AMD Ryzen 3950X CPU Processors On Amazon (Paid Link):  On Best Buy (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Doom Eternal Game On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy Aorus Gaming Monitors On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/piashortcircuit",
        "https://lmg.gg/3uSBK",
        "https://geni.us/D9ync56",
        "https://geni.us/103WK",
        "https://geni.us/52xbh",
        "https://geni.us/KhNdA3",
        "https://geni.us/IJUP",
        "https://shop-links.co/1725431961662274563",
        "https://geni.us/mB36NB",
        "https://geni.us/R4hcjxe",
        "https://shop-links.co/1725431961113769831",
        "https://geni.us/cZEVS",
        "https://geni.us/UtvWZ0K",
        "https://geni.us/t4Bikk",
        "https://shop-links.co/1725431962755370153",
        "https://geni.us/HPAYY",
        "https://geni.us/e6xPX",
        "https://geni.us/wjzK7",
        "https://geni.us/vW0kMg",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You never know, with a dell desktop, what you're gonna get. Sometimes, they're just incredible. You can upgrade them as much as you want and as they become cheaper, they're the sort of thing that you look for on the side of the road or at an office auction or something like that. So you can just huck a GPU in it and awesome you're off to the races. Other times, you can do almost nothing and you pay a premium. I don't know where this is going to land, but hopefully it's in the former. So this is the Alienware Aurora R10 and lets get into it! I wonder if we got a mouse and keyboard. I was looking at the configurator, and they are a zero dollar option to add on. Looks like it, excellent! Up top here we have a mouse, which looks like it was supposed to stay in there but did not. Power cord and we have a keyboard. Low profile RGB mechanical gaming keyboard. Cherry red oh wow! That's pretty sick for a zero dollar option. I actually like those a fair bit if I'm honest. They feel kind of like a just really long travel laptop keyboard. Huh. Well, I don't think that a lot of people that get this will be mad about this keyboard at all. I don't know how I feel about the design if I'm honest. It's like a Dyson fan. Or like a ramjet or kind of Portal-ie - Hey Hey Hey! - It's not going to offend anyone. Even if it might not be quite your cup of tea. Also, these peels are fantastic! You can see here that they have a bunch of cutouts. If someone doesn't take it off, they don't just choke their PC out. (crinkling) Is that how you do it? I totally don't get ASMR, so I have no clue what sets people off. I don't know if you pay a premium over getting a normal desktop for the Alienware one, but I would certainly pay a bit of a premium just for all of these peels here. Wow. All right so I guess now we can start it up. After our sponsor PIA With PIA you can browse the internet anonymously and avoid getting exposed. It encrypts all your internet traffic and uses a safe protected IP. You can connect up to five devices on Windows, Mac OS, Android, IOS, and Linux. You can try it risk free with their thirty day money back guarantee at the link below in the description. Oh! Its kind of loud. Nice bit of air coming out of here. This is much more kitted than what we asked for. So here we actually have an AMD Ryzen 9 3950x. So that's sixteen cores. Pretty much the best processor that you can get that's y'know, for consumers and not for workstations. We also have sixty-four gigabytes of RAM. It is a 2666 so it would be nice to have a slightly higher speed instead of that much capacity. Like if you're looking for gaming, you might want to go for like thirty-two gigabytes at a higher speed than sixty-four but- Oh! Whatever, it's sixty-four gigabytes of RAM. That's pretty sick. You also have a two terabyte Samsung NVMe SSD, and to top it all off we have a Geforce RTX 2080 Ti so she's powerful! She's a real powerful one! If the cooling system can handle this computer, you know that any other spec she's gonna be fine. Let's take a little look at the IO here. So on the front we have USB type C along with three USBs and headphone-microphone so that's pretty sick actually. On the back we have optical audio and what I think is a subwoofer out so that's pretty cool. We also have ten USB type A ports and another type C back here. Along with an ethernet port and three display ports, HDMI, and the VR out USB type C thing. Oh yeah, there's also audio out for the like five point stereo thing. Does anyone actually use those? Anyways, we are getting amazing network speeds. Even for, that's a gigabit. A hundred and thirteen megabytes per second down. That's pretty sick. Hilariously enough here, our internet is good enough that its CPU bound on how fast your downloads go. So having the, y'know, good ol' 3950x, which is actually at like twenty-five percent utilization or like forty, just downloading Doom. It's pretty sick that we can actually take advantage of that. All right so let's see how it does for the CPU tab. Running the good ol' 7Zip benchmark here. We're only seeing up to seventy. That's pretty good. This thing is liquid-cooled although liquid coolers aren't always your best friend. This one seems to be though. Maximum of seventy-six degrees and it looks like its leveling off closer to seventy. I'm impressed I have to say. I was kind of expecting this to be a bit of a hot boy. All right that's enough of that. Onto Doom! As an absolute shocker to no one, an RTX 2080Ti plays games good. Where the heck do I go? Why do I need to start on platforming? This is just the absolute worst. So yeah this is pretty frickin' sick. We're looking at a pretty solid hundred-eighty FPS on ultra nightmare 1440p. Really no complaints whatsoever. I don't think we're learning anything super valuable from finding out that this gaming system that is basically the absolute best that you can get is really good. GPU got up to a maximum of eighty-one degrees. Okay so it's not going to be super happy. Although I guess what can you really do? It looks like its taking in air from right here. I think it's a very standard cooler that we have on there so its kind of about what you get on a 2080Ti. This looks like a desktop that has pretty good cooling, but I guess we'll find out soon enough. The real test, though, comes when we get inside of it. Are you actually going to be able to upgrade this thing like a normal PC or are you kind of just stuck with what Dell gave you? So you just take out one screw here, pull on that, and it looks like it gives you access to- okay what is that? (laughter) This is a very less-than-conventional layout. I guess it doesn't really matter for the thermals because air is coming in here and shooting out there. Anything for the GPU would be coming in the vent that was right here and out. As for the CPU, it looks like it would probably drawing in here and a bit up here and then there's a radiator around this area So you just push these two little tabs up and all of this moves away. Cage for a hard drive here, cage for a hard drive there or I guess SSDs if you so please. We also have a hard drive bay up here at the front. We also have only one eight-pin CPU connector. So you're not gonna be able to overclock this chip like you could with like a five hundred dollar motherboard. As for the cooling, we have just pretty standard looking AIO with an Alienware logo on it here. And it goes up to a one twenty millimeter radiator in the top. It looks like it has kind of like a delta server fan of sorts. Then in here we have another PCIe only an 8x slot and two fours. Probably want a couple 16x-ers but at the same time SLI is dead what else are you going to need all that power for? You can still put like a ten gig card or whatever in here if you want. My impression of the inside overall are quite good though. As someone who has upgraded Dells in the past that were really poorly designed for upgrading, this looks like you'll have a much easier time going about it. It still isn't quite the same as if you built your own computer but at the same time if you only want a pre-built now at least you have the option to upgrade it in the future instead of just finding out you're screwed. Does it say what the wattage is of the power supply anywhere? I'm pretty sure that we got the thousand watt model. It was manufactured on November sixth of 2019, I can tell you that but I can't tell you much else based off of what's on it. This guy right here as spec'd comes in at just over four thousand dollars. Which honestly seems pretty reasonable given how OP it is Although now we get to find out if that actually makes sense compared to buying your own desktop or like building your own desktop. We did at the PC part picker here and it looks like the total is 3579 dollars. You're definitely paying a premium for this guy, but its not all that bad really. Especially when you consider that you're also getting like a pretty good keyboard and a mouse. So that closes the gap to only what like two or three hundred dollars? And for that you get a warranty, its assembled, it just shows up at your door. Me personally? I would build the PC because I like doing that. For you its kind of up to you this is like quite a compelling machine there's no real complaints here. Good job Alienware! Just that. Hope you guys have a good day! See ya later! Get subscribed, like it. Anthony wants to do a video. Goodbye.",
    "transcript_keywords": [
        "pretty",
        "pretty sick",
        "good",
        "pretty good",
        "Hey Hey Hey",
        "kind",
        "Hey Hey",
        "keyboard",
        "Portalie Hey Hey",
        "sick",
        "pretty good keyboard",
        "USB type",
        "Alienware",
        "CPU",
        "bit",
        "desktop",
        "thing",
        "guess",
        "Hey",
        "USB"
    ],
    "transcript_entity_values": [
        "sixteen",
        "sixty-four gigabytes",
        "A hundred and thirteen megabytes",
        "just over four thousand dollars",
        "three",
        "seventy-six degrees",
        "zero dollar",
        "IOS",
        "Dyson",
        "RAM",
        "the Alienware Aurora R10",
        "one",
        "ten",
        "USB",
        "delta",
        "8x",
        "sixty-four",
        "twenty-five percent",
        "Geforce",
        "thousand watt",
        "thirty day",
        "2080Ti",
        "second",
        "16x",
        "SLI",
        "PIA",
        "AIO",
        "SSD",
        "Samsung",
        "Linux",
        "ASMR",
        "Windows, Mac OS",
        "one twenty millimeter",
        "Dells",
        "Alienware",
        "IO",
        "Anthony",
        "HDMI",
        "two",
        "hundred-eighty",
        "up to five",
        "eighty-one degrees",
        "Android",
        "sixty-four gigabytes",
        "GPU",
        "November sixth of 2019",
        "seventy",
        "RGB",
        "only one",
        "VR",
        "CPU",
        "3579 dollars",
        "five",
        "three hundred dollars",
        "five hundred dollar",
        "eight",
        "Dell",
        "2666"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "LOC",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.04982916638255119,
        0.004431463312357664,
        0.035240933299064636,
        -0.030482260510325432,
        0.015393835492432117,
        0.006203932221978903,
        0.011993960477411747,
        0.014655809849500656,
        0.0035531630273908377,
        0.06192871555685997,
        -0.007823298685252666,
        0.044192034751176834,
        -0.01276936661452055,
        0.0074063558131456375,
        0.03130222111940384,
        0.049081332981586456,
        0.09522958844900131,
        -0.046338025480508804,
        0.08168234676122665,
        -0.047136638313531876,
        -0.06120920926332474,
        -0.07041138410568237,
        0.021305060014128685,
        -0.03919327259063721,
        0.06249496340751648,
        0.011098726652562618,
        0.07037295401096344,
        0.019576070830225945,
        -0.014190368354320526,
        -0.011858676560223103,
        -0.0036010064650326967,
        -0.005537552293390036,
        -0.020751312375068665,
        0.02321961335837841,
        -0.04931735247373581,
        -0.04237813130021095,
        0.07580932229757309,
        -0.09348393976688385,
        -0.05228152126073837,
        -0.06132204830646515,
        -0.05550719425082207,
        -0.006187329534441233,
        -0.00025872120750136673,
        0.05245918780565262,
        0.043629635125398636,
        -0.00563284195959568,
        -0.0010162896942347288,
        -0.05916644632816315,
        -0.0010130025912076235,
        -0.0004509559948928654,
        -0.023272519931197166,
        -0.061094980686903,
        0.031900204718112946,
        -0.029915811493992805,
        -0.04221562296152115,
        0.023405972868204117,
        -0.006427939049899578,
        -0.03884052485227585,
        0.002471403917297721,
        -0.00037965417141094804,
        0.04770287126302719,
        -0.12977546453475952,
        -0.02338082157075405,
        0.05898451432585716,
        -0.08728667348623276,
        0.022234568372368813,
        0.022071652114391327,
        0.002887626411393285,
        -0.004036405589431524,
        -0.04387301579117775,
        0.003773526754230261,
        -0.001038657152093947,
        0.006753687746822834,
        -0.04676960036158562,
        -0.041147150099277496,
        0.04647370055317879,
        0.11776086688041687,
        -0.07140222936868668,
        0.007595092058181763,
        -0.02331368811428547,
        -0.062341079115867615,
        0.007091899402439594,
        -0.016513576731085777,
        -0.09840097278356552,
        0.047618161886930466,
        0.04851166158914566,
        0.005892354529350996,
        0.06108376756310463,
        0.02950446307659149,
        -0.07436124980449677,
        -0.020159512758255005,
        0.05861438065767288,
        0.02215559594333172,
        0.012482264079153538,
        0.052242960780858994,
        -0.022216621786355972,
        0.0600765235722065,
        -0.049196045845746994,
        -0.014891641214489937,
        0.01685325615108013,
        0.006297319196164608,
        0.035414379090070724,
        0.07150730490684509,
        0.0375240333378315,
        -0.06192765012383461,
        0.009448850527405739,
        -0.00710755679756403,
        0.043619442731142044,
        -0.0004692359652835876,
        -0.001523623475804925,
        -0.05566694959998131,
        -0.006082560401409864,
        -0.042181823402643204,
        -0.026082513853907585,
        -0.006367301102727652,
        0.0405220128595829,
        -0.06782019883394241,
        0.06335508078336716,
        0.13284480571746826,
        0.04976210370659828,
        -0.03987050801515579,
        -0.03285763040184975,
        -0.04387110099196434,
        0.03596123307943344,
        0.01845683716237545,
        0.061237484216690063,
        -0.12024660408496857,
        7.739487866592558e-33,
        -0.016306575387716293,
        0.0860057920217514,
        -0.09568407386541367,
        -0.08512517809867859,
        -0.007757889572530985,
        0.03848620504140854,
        0.06742625683546066,
        0.02015063539147377,
        -0.07717350125312805,
        0.011642026714980602,
        -0.08554476499557495,
        -0.007374532520771027,
        -0.050245776772499084,
        0.08998183161020279,
        0.04942340403795242,
        -0.11523760110139847,
        0.0024832917843014,
        0.005680805072188377,
        -0.006340045016258955,
        -0.009011667221784592,
        0.005771190393716097,
        0.004127477761358023,
        0.03476044535636902,
        0.024401094764471054,
        0.013256440870463848,
        -0.033474892377853394,
        -0.08733011037111282,
        0.03144050016999245,
        0.031685661524534225,
        -0.0008797215414233506,
        -0.030204033479094505,
        -0.06192271038889885,
        -0.03690272197127342,
        -0.003921304363757372,
        -0.031305138021707535,
        -0.01837301254272461,
        -0.06150069460272789,
        -0.04978474974632263,
        0.005838530603796244,
        -0.025031600147485733,
        -0.040363822132349014,
        0.09617969393730164,
        -0.0988246500492096,
        -0.08732893317937851,
        -0.0025668356101959944,
        -0.028912058100104332,
        -0.08327966928482056,
        -0.01907065324485302,
        0.0435103140771389,
        -0.018097054213285446,
        -0.16166220605373383,
        0.046028994023799896,
        0.016897965222597122,
        -0.06282822787761688,
        -0.009754771366715431,
        -0.10994002223014832,
        0.010552340187132359,
        0.05522827431559563,
        0.11319742351770401,
        0.1101197898387909,
        -0.029098624363541603,
        -0.012327325530350208,
        -0.03508400171995163,
        -0.0010618814267218113,
        -0.06024955213069916,
        0.059081483632326126,
        0.12437960505485535,
        0.034214120358228683,
        -0.06852571666240692,
        0.05685543641448021,
        0.016414061188697815,
        -0.01862087845802307,
        0.06640128046274185,
        0.0006300000823102891,
        0.07130739837884903,
        0.03948498144745827,
        -0.08866933733224869,
        -0.07660681009292603,
        -0.03343069925904274,
        -0.026451196521520615,
        -0.04541565477848053,
        0.04750198870897293,
        -0.0167266633361578,
        0.07865089923143387,
        0.01650078035891056,
        0.0030377532821148634,
        -0.044876959174871445,
        0.025076957419514656,
        0.05540669336915016,
        -0.025591295212507248,
        -0.017628636211156845,
        -0.06062430888414383,
        0.03801121562719345,
        0.01810595951974392,
        -0.020348362624645233,
        -6.963527147883473e-33,
        -0.05661928653717041,
        -0.016538942232728004,
        -0.07810421288013458,
        0.0488925538957119,
        -0.006046575028449297,
        0.03473852947354317,
        0.06636577099561691,
        -0.0010034437291324139,
        -0.005276752170175314,
        -0.10281550884246826,
        0.003310073632746935,
        0.048079174011945724,
        0.02618667669594288,
        0.04196200147271156,
        -0.014242501929402351,
        -0.03718983754515648,
        -0.0157951507717371,
        -0.06951561570167542,
        0.12411902099847794,
        0.027016527950763702,
        0.012628676369786263,
        0.024310778826475143,
        -0.026856208220124245,
        0.0064235772006213665,
        0.03398256376385689,
        0.009852397255599499,
        0.037072040140628815,
        -0.03957292065024376,
        -0.0258055217564106,
        -0.0015608249232172966,
        -0.02682838961482048,
        0.013879077509045601,
        0.02049163356423378,
        0.08890681713819504,
        0.07003163546323776,
        0.0453338623046875,
        0.08232483267784119,
        -0.015081561170518398,
        -0.02708376757800579,
        0.013369224965572357,
        0.052666906267404556,
        0.034138571470975876,
        -0.0035706558264791965,
        0.06824414432048798,
        0.033627185970544815,
        0.05105871334671974,
        -0.07248402386903763,
        -0.03497863560914993,
        -0.004743363708257675,
        -0.007040680386126041,
        -0.08779020607471466,
        -0.021168718114495277,
        0.04454005882143974,
        -0.04062247276306152,
        -0.072104312479496,
        -0.12177304178476334,
        -0.042327091097831726,
        0.0746428593993187,
        0.02464962564408779,
        -0.008842097595334053,
        0.02717866748571396,
        -0.020110422745347023,
        0.008223735727369785,
        -0.02468377910554409,
        -0.002590545918792486,
        0.011968892067670822,
        0.060398444533348083,
        0.09581258893013,
        -0.018430467694997787,
        -0.04124138504266739,
        -0.07771480828523636,
        -0.016411038115620613,
        -0.03722195327281952,
        -0.04866031929850578,
        -0.04835860803723335,
        0.048198480159044266,
        0.055688608437776566,
        0.008383138105273247,
        0.017430046573281288,
        -0.025497296825051308,
        0.018046138808131218,
        0.007010427303612232,
        0.05310686305165291,
        0.014940951019525528,
        0.01971041038632393,
        0.017909135669469833,
        -0.00040353037184104323,
        -0.024445515125989914,
        -0.05956665799021721,
        -0.026686163619160652,
        0.004133732058107853,
        0.04173510894179344,
        0.0018636120948940516,
        0.024705110117793083,
        0.005946545861661434,
        -4.4475136462551745e-08,
        0.10341683030128479,
        -0.03499125689268112,
        0.07070419937372208,
        0.028876619413495064,
        0.08565344661474228,
        -0.05516962707042694,
        0.09627363085746765,
        -0.004574378952383995,
        0.01896757073700428,
        0.042915161699056625,
        -0.0012833165237680078,
        -0.09997770935297012,
        0.012542465701699257,
        -0.0561494342982769,
        0.030633725225925446,
        0.042124345898628235,
        -0.004455983638763428,
        0.1240985244512558,
        0.006011138670146465,
        -0.024810925126075745,
        -0.026872679591178894,
        0.09733600914478302,
        0.04499213024973869,
        -0.07654891908168793,
        0.02547880820930004,
        -0.023157358169555664,
        0.00043853576062247157,
        -0.05896081402897835,
        0.06943085789680481,
        -0.006786172278225422,
        0.007556802127510309,
        -0.0056320722214877605,
        0.125461146235466,
        -0.09634195268154144,
        0.03763889521360397,
        -0.07908280193805695,
        0.0542566291987896,
        0.0860753133893013,
        0.09585567563772202,
        -0.025686370208859444,
        -0.05479508638381958,
        -0.0855744481086731,
        -0.03920789062976837,
        -0.05912938341498375,
        0.005841374397277832,
        -0.016443634405732155,
        -0.11789253354072571,
        -0.1607535481452942,
        0.00327345565892756,
        0.04273315891623497,
        0.02588532865047455,
        -0.013721203431487083,
        0.028804760426282883,
        -0.029362361878156662,
        0.04783434420824051,
        0.009369644336402416,
        -0.03371802344918251,
        0.019068917259573936,
        0.06788895279169083,
        0.05707661807537079,
        0.053112149238586426,
        -0.0881824716925621,
        0.00920473039150238,
        0.014880739152431488
    ]
}