{
    "id": "nr8Um2aJr2c",
    "title": "Is the Google Pixel 5 Really made of Metal? - Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-12-02T14:15:03Z",
    "video_url": "https://www.youtube.com/watch?v=nr8Um2aJr2c",
    "category": "Howto & Style",
    "tags": [],
    "views": 2155528,
    "likes": 78537,
    "comments_count": 5284,
    "description": "Its time to durability test the Google Pixel 5! Get your first audiobook and full access to the Plus Catalog for free when you try Audible for 30 days visit  or text \"jerryrig\" to 500 500! Thanks to Audible for sponsoring this video! Weve heard that Google has a new 'metal' Pixel 5 smartphone with wireless charging in the back. But how is that possible?! We know that Wireless charging cant work through metal. Turns out... with a few swift swipes from a razor blade, the 'metal' appears to be a layer of plastic! Very interesting. What are your thoughts? Should Google be able to call the Pixel 5's body metal? Let me know what you think down in the comments.   Watch the Teardown HERE:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.audible.com/jerryrig",
        "https://youtu.be/3KMdkC536vs",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "On the Google Pixel 5's website, this phone is advertised as having a 100% recycled aluminum enclosure, a 100% aluminum encasing, and as having a water-resistant metal body...which logically leads most tech websites and tech YouTubers to parrot that same information, since, you know, we trust the manufacturers. We know though that the Pixel 5 has wireless charging and wireless charging doesn't work through metal. So the Pixel 5 on paper is breaking the laws of physics. Today it's time to see what the Pixel 5 is really made of and how that wireless charging action actually works. This video is sponsored by Audible. Let's get started. [Intro] For a flagship, this Google Pixel 5 is actually surprisingly inexpensive at just $649. It's half the price of other top phones like Apple and Samsung. And I do take that into consideration during my review. You get what you pay for and if it costs half as much, you can expect half as much. Plus, Google has never really tried to compete in the hardware specs because they are mostly about the software experience. That being said though, clear advertising is important across the board...whether a phone costs $6 or $600. The 6 inch screen is made from Gorilla Glass 6, so we start seeing scratches at a level 6, with deeper grooves at a level 7. The front screen also contains that 8 megapixel front facing hole punch camera, as well as no speaker grill. The Google Pixel 5 seems to have an underscreen speaker, which we have seen in some other phones. And it'll be pretty interesting to see what it looks like from the inside when we get to the teardown. Now, nowhere on Google's website does it say that the Pixel 5's exterior is a layer of plastic. Remember, they call it \"metal\" three different times. But we can see by the ease at which my razorblade slices through the phone that there is indeed copious amounts of plastic on the backside. We have to go pretty darn deep before we find any shiny metal. Google has told other websites that the phone is covered in a bio-resin, which is a plant based polymer, or a more eco-friendly plastic. They just don't mention that anywhere on their own web page which I think is a missed opportunity since bio-resin actually sounds pretty cool and would make for a good selling point on the Pixel 5. The volume rocker is plastic, but the power button is metal. We can see how thick the plastic is by cutting a v-shaped groove into the top of the phone through that bio-resin layer. And we see that basically the whole curve of the phone is plastic all the way down to the screen. And it's the same thing on every single side. The SIM card tray has no expandable memory, but the phone is IP68 and has USB-C charging. There is no headphone jack. The \"G\" on the back panel is inlayed into the plastic itself. Kind of like we saw on the back of the plastic Nexus 5 back in 2013. The letters on that phone had a history of falling out over time. Let's hope Google is using some stronger glue this time around. There are 2 cameras on the back: a 12.2 megapixel normal camera, and a 16 megapixel ultrawide. Google cameras have been accepted as some of the best smartphones across the board for quite a while now, even if they don't have that telephoto option. Before we dive in and see how the wireless charging works, let's test the fingerprint scanner. It's on the backside of the phone so it's more of a fingerprint than a thumbprint, and has a much faster setup time than the underscreen fingerprint scanners have. And once it's been damaged considerably, it still recognizes and unlocks the phone with my fingerprint every single time. Thumbs up for that. Now, for the wireless charging. If my estimates are correct, the wireless charger should be in this general area. And don't get me wrong, I have nothing against plastic. The bio-resin on this Pixel 5 does seem durable. It won't be scratching or chipping on its own. It's much harder than the LG G5's coating we saw a few years ago. I definitely don't take issue with plastic. The only thing I take issue with is Google calling it metal three times on their website with no mention of plastic or bio-resin anywhere. They had no problem calling the Pixel 4a plastic, and clearly this Pixel 5 has just as much plastic on it as that 4a does. It just keeps going. It really does just keep going. Finally, we get a glimpse of some copper underneath the bio-resin layer. These are the 12 watt wireless charging copper coils that can reverse wireless charge other devices at 5 watts...all sitting here underneath that thick plastic layer. And if we watch really closely we can learn by accident that the battery is right below that wireless charging coil. Batteries and sharp objects don't go well together. And now the phone is dead. Let's watch it one more time in slow motion just for fun since that was really expensive. Now, if the phone really was made from metal like Google was advertising, that would not have happened. I'm sure there is more metal in other parts of the phone though. It might just not be in this specific location. So let's pull out some science and see if we can dissolve some of this plastic. I always keep some acetone around. It's a clear, colorless, flammable solvent. I use it to clean metal before welding. But it's also good at dissolving some plastics, rubber, and adhesive, as well as paint. We'll just let the phone marinate in this acetone for about an hour and see what happens. While you're watching the time lapse, let me tell you about an audio book that helped me understand the world of social media before I ever got into it. Huge thanks to Audible for sponsoring this video. Ready Player Two is pretty good by the way. Not as good as Ready Player One, but I still like it. But yeah, the audiobook that helped me understand social media when I started my YouTube channel 8 years ago is called Platform. So if you're trying to start your own business or grow an audience online during the craziness of 2020, this might be a good place to start your learning. You can get your first audio book for free by going to Audible.com/jerryrig. Or texting \"jerryrig\" to 500-500. And you can be listening to your audio book within a matter of minutes. I find that listening is a great way to multitask while doing other activities. Audible has rolled out its newest membership plan Audible Plus. And with the holidays upon us, Audible is offering this new plan for just $4.95 a month for the first 6 months. And after that it's just $7.95. Audible.com/jerryrig or text \"jerryrig\" to 500-500. I'll leave a link down in the video description. Now that time lapse really was about 50 minutes long. And honestly I thought it would do something more to the phone, but it turns out that acetone mostly only affects PVC and polystyrene, which are more common forms of plastic. But acetone does not affect bio-resins. And that bio-resin is just as strong now as it was when I first put it into the solvent. But no fear, we still have other options. I'll grab a plate from the kitchen, don't tell my wife, and if I use a heat gun, which can get up to about 1,000 degrees fahrenheit, we can heat up that plastic. The glass plate is here so my desk doesn't start on fire. Once that bio-resin is warmed up, it's much easier to peel off the phone, which reveals a metal subframe below the plastic. This subframe must be that 100% recycled aluminum that Google mentions on their website. It also has some additional cutouts near the bottom for what I assume is the antennas. Personally, I think that Google Pixel was metal in the same way my body is bone. Metal provides a structure, but it's definitely not what's on the outside. Just for kicks and giggles, we can peek underneath the wireless charging coil and get a glimpse straight into the center of the phone. The motherboard and battery, which we successfully stabbed earlier in the video, are both clearly visible. There is no metal backplate behind the wireless charging coil, which also goes against this image of the Pixel 5 that's been floating around. This image is not an actual representation of how the phone is built since it's missing the gigantic hole in the center. A few clarifying words on Google's website about the phone's composition would go a long way. It's not even continuous metal underneath all the plastic. With the phone not working anymore after that battery puncture, we really can't do the screen burn test, which I'm sure will cause much disappointment to all. But we still have one question we can answer. Since this phone has such a large cutout in the center for that wireless charging, does the hole make the phone weaker structurally? Even though we're missing large chunks of the phone's plastic exterior, the Pixel 5 holds up very well. Flipping it over to bend from the back shows that the screen does start to pop out from the frame, ruining that seal for the water-resistance. But there is no catastrophic damage to the screen or the frame. Well, I mean, no additional catastrophic damage. To summarize, is the Pixel 5 really made of metal? The answer is yes, but also no. Google seems to have done a good job with just about everything except for explaining accurately what the Pixel 5 is made of, which is kind of the whole phone. Let me know what you think down in the comments. Should this Pixel 5 be branded as plastic or metal? I'm curious. Come hang out with me on Instagram and Twitter. Grab your free audiobook from Audible with the link in the description. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Google Pixel",
        "Pixel",
        "phone",
        "plastic",
        "Google",
        "wireless charging",
        "metal",
        "wireless",
        "charging",
        "wireless charging coil",
        "tech YouTubers",
        "time",
        "Google website",
        "bioresin",
        "Audible",
        "phone plastic",
        "tech",
        "trust the manufacturers",
        "logically leads",
        "YouTubers to parrot"
    ],
    "transcript_entity_values": [
        "Google Pixel",
        "Google",
        "about 50 minutes",
        "12.2 megapixel",
        "8 megapixel",
        "2020",
        "just $7.95",
        "Pixel 4a",
        "12 watt",
        "G5",
        "6",
        "Instagram",
        "100%",
        "5 watts",
        "three",
        "6",
        "Two",
        "8 years ago",
        "6 inch",
        "half",
        "YouTubers",
        "about 1,000 degrees fahrenheit",
        "the first 6 months",
        "SIM",
        "the Pixel 5",
        "about an hour",
        "600",
        "5",
        "Apple",
        "a few years ago",
        "4a",
        "first",
        "500-500",
        "just $4.95",
        "Samsung",
        "a matter of minutes",
        "the Pixel 5",
        "Today",
        "2013",
        "16 megapixel",
        "YouTube",
        "USB",
        "LG",
        "Audible",
        "one",
        "just $649",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "EVENT",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.17777438461780548,
        0.04353546351194382,
        0.1009092926979065,
        0.02110075205564499,
        0.022129055112600327,
        -0.11373917013406754,
        0.15266451239585876,
        -0.03302491456270218,
        -0.13232414424419403,
        -0.012747641652822495,
        0.026421092450618744,
        -0.018747126683592796,
        0.000897930352948606,
        0.029472405090928078,
        -0.013823751360177994,
        -0.05556835979223251,
        0.09492684155702591,
        -0.049540601670742035,
        -0.057988982647657394,
        0.10263960063457489,
        0.046030234545469284,
        -0.006225320044904947,
        0.07136636227369308,
        -0.06007504463195801,
        0.03571105748414993,
        0.1037866398692131,
        0.033212777227163315,
        -0.0452435202896595,
        -0.050457727164030075,
        -0.04732537642121315,
        0.025858445093035698,
        0.08562066406011581,
        -0.08478735387325287,
        0.020384235307574272,
        0.006041271612048149,
        0.009598749689757824,
        0.008242406882345676,
        0.05042392760515213,
        -0.05807804688811302,
        -0.032811518758535385,
        -0.044263746589422226,
        -0.06368827819824219,
        0.028918564319610596,
        -0.051414113491773605,
        0.04246791824698448,
        -0.02555815875530243,
        0.08658767491579056,
        -0.07765191048383713,
        0.010873081162571907,
        -0.006238045636564493,
        -0.0302758626639843,
        -0.07200001180171967,
        0.09437867254018784,
        -0.01504337228834629,
        -0.0548880361020565,
        -0.028517618775367737,
        0.03293941915035248,
        -0.03949713706970215,
        0.06008783355355263,
        -0.0276272464543581,
        0.01472529862076044,
        -0.020815204828977585,
        0.0015107460785657167,
        0.08282414078712463,
        0.037766922265291214,
        0.02952316775918007,
        0.02664659172296524,
        -0.10888976603746414,
        -0.027069218456745148,
        -0.028176192194223404,
        0.049671050161123276,
        0.03728126361966133,
        -0.03927233815193176,
        -0.03261930122971535,
        -0.0035341582261025906,
        0.07011902332305908,
        0.08432992547750473,
        -0.04964541643857956,
        -0.015530865639448166,
        0.064266137778759,
        0.02073376625776291,
        0.04093973711133003,
        0.019812723621726036,
        -0.008127502165734768,
        0.01861979439854622,
        0.07656988501548767,
        0.022000547498464584,
        0.07738307118415833,
        -0.11780663579702377,
        -0.057285550981760025,
        0.024053119122982025,
        0.1356801688671112,
        -0.09425859153270721,
        0.011375567875802517,
        -0.0460624173283577,
        0.006447510793805122,
        -0.08534662425518036,
        -0.02423679642379284,
        -0.012973204255104065,
        0.018061736598610878,
        0.029316378757357597,
        0.011833875440061092,
        -0.01182036753743887,
        -0.008639573119580746,
        -0.007629114668816328,
        -0.0909082368016243,
        -0.06544952839612961,
        0.04706549644470215,
        -0.023285800591111183,
        0.0173050444573164,
        -0.013527832925319672,
        0.004032104276120663,
        -0.08489084988832474,
        0.016178758814930916,
        0.005116240121424198,
        -0.03913368657231331,
        -0.07261379063129425,
        0.06941698491573334,
        0.10383633524179459,
        0.0037742790300399065,
        0.02539185993373394,
        0.05614927411079407,
        -0.0951962098479271,
        -0.06738074868917465,
        0.03914305567741394,
        -0.024472007527947426,
        -0.02668813429772854,
        1.550995345316039e-35,
        0.053507789969444275,
        0.0668085440993309,
        0.059098195284605026,
        -0.08344470709562302,
        -0.049868833273649216,
        -0.0030437842942774296,
        0.03455725684762001,
        0.11209829896688461,
        -0.0020206503104418516,
        0.009387832134962082,
        -0.02855501137673855,
        0.037043191492557526,
        -0.023143237456679344,
        -0.05225313454866409,
        0.04798726364970207,
        -0.0011718603782355785,
        -0.058805469423532486,
        -0.08175740391016006,
        0.036020759493112564,
        -0.00951839517802,
        -0.014042015187442303,
        0.02133769355714321,
        0.02261904999613762,
        0.00048105852329172194,
        0.02532789669930935,
        0.051245447248220444,
        -0.0031137033365666866,
        -0.018675267696380615,
        0.023922240361571312,
        0.03918490558862686,
        -0.09734220057725906,
        0.03092852234840393,
        0.05641784518957138,
        0.05875411257147789,
        -0.019271444529294968,
        0.06971579790115356,
        -0.02837425097823143,
        -0.02117130160331726,
        0.0003757911908905953,
        -0.006359071005135775,
        -0.05242826044559479,
        -0.0272104162722826,
        -0.005679422058165073,
        0.035898514091968536,
        -0.00033625439391471446,
        -0.015961505472660065,
        -0.06842359900474548,
        -0.056435197591781616,
        -0.07753851264715195,
        0.015116040594875813,
        0.02738938480615616,
        -0.02837049961090088,
        0.021091187372803688,
        0.008065362460911274,
        -0.02838837169110775,
        0.026633478701114655,
        0.006634033750742674,
        -0.00829141866415739,
        0.025473443791270256,
        0.01934828609228134,
        0.050526004284620285,
        0.05855576694011688,
        -0.008462874218821526,
        0.07445529103279114,
        -0.03193823620676994,
        0.02236492745578289,
        0.04789191484451294,
        0.0851743072271347,
        -0.06538720428943634,
        0.03640834987163544,
        -0.03527418151497841,
        0.008249623700976372,
        0.027888836339116096,
        -0.011599469929933548,
        -0.0019647066947072744,
        0.004272662568837404,
        -0.02158435992896557,
        -0.03655506670475006,
        0.0721493810415268,
        0.0070342919789254665,
        -0.04485340416431427,
        -0.03286387026309967,
        0.06044376641511917,
        -0.038677867501974106,
        -0.038128241896629333,
        0.007115304935723543,
        0.019409311935305595,
        -0.08884309232234955,
        0.02944427728652954,
        -0.028191329911351204,
        -0.009662576019763947,
        -0.10432735085487366,
        -0.083589568734169,
        -0.0611310712993145,
        -0.01607092283666134,
        -3.310520862991807e-33,
        0.027081724256277084,
        -0.026524074375629425,
        0.05882113426923752,
        0.020504193380475044,
        -0.04652955383062363,
        -0.0750802531838417,
        -0.00497328070923686,
        0.09097792953252792,
        0.007571633439511061,
        0.031565964221954346,
        0.04924697428941727,
        0.07928981631994247,
        0.03227497264742851,
        -0.02112409472465515,
        -0.0057356106117367744,
        -0.06260419636964798,
        -0.06405322998762131,
        -0.06772030889987946,
        0.016401728615164757,
        -0.02516121417284012,
        0.06607703864574432,
        0.052503738552331924,
        0.0079953009262681,
        0.022044656798243523,
        0.00730412732809782,
        0.0027859772089868784,
        -0.0021683447994291782,
        -0.07981815189123154,
        0.06817585974931717,
        0.0031552619766443968,
        -0.02000543661415577,
        -0.036894746124744415,
        0.0789838507771492,
        -0.015229403972625732,
        0.0803389698266983,
        -0.005192757584154606,
        0.05508914589881897,
        -0.012795311398804188,
        0.0754626989364624,
        -0.0858645960688591,
        -0.04826023429632187,
        0.03969692811369896,
        0.017223568633198738,
        0.014260007068514824,
        -0.014816520735621452,
        -0.05923987179994583,
        -0.02259361930191517,
        0.0212375670671463,
        0.007837674580514431,
        0.03784433752298355,
        0.03441943600773811,
        0.006464507896453142,
        -0.059923965483903885,
        -0.021040456369519234,
        -0.026037996634840965,
        0.0012377448147162795,
        0.025045868009328842,
        -0.08790639787912369,
        -0.03726609796285629,
        0.02002561464905739,
        0.05641665309667587,
        0.010431978851556778,
        0.030779490247368813,
        -0.0023988427128642797,
        -0.010988573543727398,
        -0.005304202903062105,
        0.0660947933793068,
        0.015801144763827324,
        0.01315511204302311,
        0.02956215664744377,
        0.024469098076224327,
        -0.007430643774569035,
        0.013704551383852959,
        -0.05504527688026428,
        0.01234963908791542,
        -0.01585291139781475,
        -0.008422805927693844,
        0.009048135951161385,
        -0.03545282781124115,
        0.02055472508072853,
        0.10437663644552231,
        0.03075454942882061,
        0.039461035281419754,
        0.025663098320364952,
        0.06561397761106491,
        -0.02389298379421234,
        0.013341437093913555,
        0.0746542364358902,
        -0.06584519892930984,
        0.01245647482573986,
        -0.05257384106516838,
        -0.0021952337119728327,
        -0.04534466192126274,
        0.106393001973629,
        -0.04709906503558159,
        -4.698352285004148e-08,
        -0.007711767219007015,
        0.08487167954444885,
        -0.011094090528786182,
        -0.08631806820631027,
        0.016239197924733162,
        -0.00030363822588697076,
        0.012716630473732948,
        -0.11894670128822327,
        0.08399758487939835,
        -0.04710235446691513,
        -0.00797668844461441,
        -0.06618433445692062,
        -0.049623362720012665,
        0.05017957091331482,
        -0.05510197579860687,
        0.06540524959564209,
        -0.06556932628154755,
        -0.03904014080762863,
        0.014039341360330582,
        -0.00876528862863779,
        -0.06757950782775879,
        -0.023356454446911812,
        0.042683135718107224,
        -0.06780755519866943,
        -0.01908906176686287,
        0.04156477749347687,
        -0.06698048114776611,
        0.01350506953895092,
        0.00657095480710268,
        0.026411712169647217,
        -0.12848341464996338,
        -0.029818857088685036,
        -0.047088731080293655,
        0.08528701961040497,
        -0.03825826197862625,
        -0.047255463898181915,
        -0.0386834442615509,
        -0.06975635141134262,
        0.009764941409230232,
        -0.01568033918738365,
        -0.00498573062941432,
        -0.09899775683879852,
        0.0008766541141085327,
        0.013326947577297688,
        -0.015167232602834702,
        -0.070528045296669,
        0.017080014571547508,
        -0.0756019800901413,
        -0.002750133629888296,
        0.04490353539586067,
        -0.07635577768087387,
        -0.012758158147335052,
        -0.042308732867240906,
        -0.018589071929454803,
        0.028723524883389473,
        0.09893767535686493,
        0.042601730674505234,
        -0.07217912375926971,
        -0.05478399246931076,
        -0.012292356230318546,
        0.014214525930583477,
        -0.09568893164396286,
        0.06477797776460648,
        0.14194421470165253
    ]
}