{
    "id": "NRFuQ4uZIO8",
    "title": "Onyx Boox Nova3 Color Review: Android On E Ink!",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-03-19T16:18:15Z",
    "video_url": "https://www.youtube.com/watch?v=NRFuQ4uZIO8",
    "category": "Science & Technology",
    "tags": [
        "onyx boox nova3 color review",
        "pocketbook color review",
        "color e ink",
        "color kindle",
        "color e paper",
        "android e paper",
        "android e ink",
        "best ereader 2021",
        "best kindle 2021"
    ],
    "views": 410996,
    "likes": 13218,
    "comments_count": 666,
    "description": "A few months ago I reviewed my first color e-reader, the PocketBook Color. And while it was novel to use a tablet that blended all the benefits of e-paper with the universal appeal of color  it was also quite limiting to be locked into a platform that only let me run a handful of preloaded apps (and forced me to sideload most of my books because it didnt support Amazon Kindle.)  Fortunately for me, you folks are a vocal audience. Littering the comments of that PocketBook video were repeated suggestions to test out a BOOX-branded e-reader from a company called Onyx International. As Sacha Segan of PCMag puts it, Onyx makes E Ink tablets that bridge the gap between Kindles and iPads, and it does so in this case by blending the newest color E Ink screen on the market  with my very own operating system of choice. This is the Android-powered, E Ink Kaleido Plus-enabled Onyx Boox Nova3 Color: join me for the MrMobile review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES ONYX BOOX NOVA3 COLOR REVIEW]  MrMobile's Onyx Boox Nova3 Color Review was produced following 17 days with an Onyx Boox Nova3 Color review sample provided by Onyx International. The device was a preproduction sample initially running pre-release software, updated to production (retail) software during the review process.  MrMobile does not accept compensation from the manufacturers of the products he reviews; no payment was provided and no manufacturer or carrier was afforded a preview or copy approval rights concerning this content.    [PRODUCTS IN THIS VIDEO]  Onyx Boox Nova3 Color [Onyx International]:    [LINKS]  The Boox Nova 3 Color Proves Color E Ink Screens Aren't Ready for Tablets Yet [Gizmodo]:    Onyx Boox Nova3 Color Review  Color E Ink! [Mobile Tech Review]:    NXTPAPER [TCL]:   E Ink Color Technologies [E Ink]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #onyxbooxnova3color #onyxboox #nova3color #onyx #boox #nova3 #eink #ereader #epaper #tablet #android #tech #kindle #pocketbook",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.boox.com/nova3color",
        "https://gizmodo.com/the-boox-nova-3-color-proves-color-e-ink-screens-arent-1846356179",
        "https://www.youtube.com/watch?v=aSUcnkQCa-s",
        "https://www.tcl.com/global/en/tablets/tclnxtpaper-mid/landing.html",
        "https://www.eink.com/color-technology.html",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- [Narrator] A few months ago, I reviewed my first color eReader called the PocketBook Color. And while i was novel to use a tablet that blended all the benefits of E-paper with the universal appeal of color, it was also quite limiting to be locked into a platform that only let me run a handful of preloaded apps and forced me to sideload most of my books, because it didn't support Amazon Kindle. Unfortunately for me, you folks are a vocal audience. Littering the comments of that video were repeated suggestions to test out a book's branded eReader from a company called Onyx International. As Sasha Segan of PCMag puts it, Onyx makes E Ink tablets that bridged the gap between Kindles and iPads and it does so in this case, by blending the newest color E Ink screen on the market with Android. (upbeat music) Can I just say this is one of the biggest reasons I love Android and over the years I've been privileged to review some of the weirdest mobile tech in existence from the Lenovo Yoga Book 2-in-1 to the wearable front row camera, to the wrist wrap-around Nubia watch. All of it made possible by the fact that you can kind of put Android on anything. So it should come as no surprise that it's perfectly content to run an E-paper screen as well. Obligatory shout out to the old YotaPhone, rip. That E-Paper screen has a name, Kaleido Plus. It's the latest generation of E ink from the company of the same name. And if you wanna know how the underlying technology works I'll point you back to my pocketbook video. The key takeaway here is that while you get the same 4,096 colors, they're a bit brighter and more saturated on Kaleido Plus, although still duller than LCD or OLED screens on your more traditional tablets. As with all E Ink screens, the more light you pour on it the better you can see it, which is why Kindles and kobos are still the best E-Books for the beach. Seeing it after sunset depends on an integrated front light that gets the job done but you know, big let down for nighttime readers, such as myself, it is not temperature controllable as it is on some monochrome models. Annex makes those too and while we're talking disappointments, I have to say I wish the Nova 3 Color had the physical appeal of some of its cousins. Watching Lisa from Mobile Tech review cover the company's Note Air made me envy that model's thin metallic construction and stylish orange piping. Instead Nova 3 Color packs a basic black plastic casing with wide radius corners and sort of retro home button anchoring the display, there's nothing remarkable about it. On the software, Annex has built its own launcher for the Nova 3 Color a high contrast affair that rides a top Android 10. Now you can replace it with a launcher of your choice like Nova or Niagara. But honestly, after just a few hours with both I scurried right on back to the Onyx homescreen. Remember Kaleido Plus or not, this is still E-paper, so most launchers that rely on all the swiping and scrolling that modern day Android demands just won't be as easy to use. Now that said this display does offer much faster refresh rates than any E Ink screen I've used before. In fact, you can tell it how fast you need it to be by putting it into one of three separate modes. At its slowest it's your typically E reader you don't want to do anything more taxing than flip a page every minute or so, but, crank it all the way up to A2 and suddenly the screen is a hot rod. It's almost fast enough to watch a quick video. It's bizarrely satisfying to be able to run the same apps and visit the same websites I do on my phone but on this high contrast, highly power efficient display. Speaking of my review device from Onyx here hasn't been plugged in and about 10 days, it's been through three software updates in that time and it was still sitting at about 75% charge before I started filming this review. So why not just leave the display on the fastest setting all the time? Well, as always there's a trade-off, the faster the screen is set to refresh, the bigger the image persistence problem. That's where shadows of images you were just looking at, stay on the screen even after you scroll away. This is called ghosting and it's a much bigger issue on a color panel like this. Even when you're set to normal mode you get more ghosting than you do on a monochrome screen. Onyx is working on the issue part of the reason for all the software updates. But let's be real, right? You don't buy an eReader so you can watch videos on it, you buy it for long stints of reading and writing. And here the Nova 3 Color delivers. Because it's Android you don't have to settle for the onboard bookstore, you just install kobo or Kendall or whatever app you keep your books in and run it. Resolution is 300 DPI for black and white content, 100 DPI for color, and the digitizer supports just over 4,000 levels of pressure sensitivity when used with the stylist that comes in the box. There's good palm rejection and very little input lag when writing on the Nova 3 Color, the stock note taking app is actually pretty fully featured. And the software overall is responsive and very customizable. You can navigate using Samsung style swipe gestures or stick with Android's old nav keys which have been stuffed into the notification shade. Me, I like the navigation ball which sticks all those controls and more into a floating button you can just put it wherever you want. And it's cool to be able to control speaker volume and display brightness by sliding my thumbs across the bezels here. There's no headphone jack, but in addition to USB OTG the type C port on the bottom does support audio out or you can just use Bluetooth. Just keep in mind the device puts everything to sleep when you lock the screen even if you tell it to keep apps in memory. So if you're listening to an audio book you have to keep the screen on while you're doing it. In other oversights, there's no accelerometer onboard. To rotate the screen you have to use this needlessly complex ribbon of hieroglyphics. Also the software tries to optimize contrast within apps by default, but, really all that does is put big ugly outlines around text. So fortunately you can disable that on a per-app basis and even run different apps at different DPI settings if you need to. And just keep in mind to run those third-party apps, you need to manually certify the device when you first set it up. It's not difficult or dangerous, but it is still just another speed bump. It all adds up to a device that's impressive but for me falls a little short of justifying its price. If it had just one fewer failing, if the front light could be set to warmer tones. - [Robotic Voice] Or if the microphone wasn't so squeaky. - [Narrator] Or if it ran something more modern than Android 10, the $419 price tag would be easier to justify. Don't get me wrong I think Android brings enough flexibility that I would personally still choose this one over the new Ink pad color from Pocketbook, even though that device has the same display for $329. But you know that's not the only competition. If you can settle for an LCD and iOS, the IPad mini starts at 399, or if Android is a must but a backlight is optional, wait for TCL's new NxtPaper powered tablet to hit the market at 349 Euro, assuming that display tech is all it's cracked up to be. I'm glad the Nova 3 Color is on the market and it definitely fills a niche. I just hope the next version is a little more refined, or, priced a little more palatably. (upbeat music) If you wanna see some other takes on the Nova 3 Color I'll link to some others I've found across the web including good ones at Gizmodo and Mobile Tech review. This review was produced following 17 days with the Nova 3 Color review sample provided by Onyx International, but I don't produce paid reviews. The company didn't provide compensation for, or receive any editorial input into this video, they're seeing it for the first time right alongside you. Please subscribe to the MrMobile on YouTube if that's the kind of video you'd like to see more of. Until next time, thanks for watching and if you can't stay home and remember to stay safe and mask up when you're around others, as you stay mobile, my friends.",
    "transcript_keywords": [
        "color",
        "Android",
        "Nova",
        "screen",
        "Ink screen",
        "support Amazon Kindle",
        "Ink",
        "color eReader called",
        "Epaper screen",
        "Onyx",
        "Mobile Tech review",
        "Amazon Kindle",
        "months ago",
        "Lenovo Yoga Book",
        "review",
        "Ink pad color",
        "display",
        "called Onyx International",
        "Onyx International",
        "mobile tech"
    ],
    "transcript_entity_values": [
        "eReader",
        "third",
        "Kendall",
        "399",
        "Sasha Segan",
        "A2",
        "Nubia",
        "the Nova 3 Color",
        "about 10 days",
        "Samsung",
        "100",
        "Amazon Kindle",
        "Gizmodo and Mobile Tech",
        "Annex",
        "kobo",
        "Mobile Tech",
        "the years",
        "Kaleido Plus",
        "Nova",
        "the PocketBook Color",
        "300",
        "three",
        "every minute",
        "USB",
        "Bluetooth",
        "Ink",
        "Kindles",
        "Onyx International",
        "iPads",
        "just a few hours",
        "first",
        "4,096",
        "just over 4,000",
        "TCL",
        "jack",
        "329",
        "YouTube",
        "419",
        "Niagara",
        "NxtPaper",
        "Onyx",
        "Robotic Voice",
        "Nova 3 Color",
        "MrMobile",
        "A few months ago",
        "Android 10",
        "iOS",
        "the Lenovo Yoga Book 2-in-1",
        "about 75%",
        "IPad",
        "PCMag",
        "LCD",
        "YotaPhone",
        "one",
        "Android",
        "17 days"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "MONEY",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.08224319666624069,
        -0.01064903475344181,
        0.0013682016870006919,
        -0.06153293326497078,
        0.05385260656476021,
        -0.012381767854094505,
        0.06255602091550827,
        -0.03440931811928749,
        0.04461931437253952,
        -0.005378086119890213,
        0.016094066202640533,
        0.07654593139886856,
        0.04216628149151802,
        0.015486042946577072,
        0.016036944463849068,
        -0.008112293668091297,
        0.03423574939370155,
        -0.031543195247650146,
        -0.006453572306782007,
        0.04864911735057831,
        0.02134730853140354,
        -0.07128241658210754,
        0.05715825781226158,
        -0.03473513573408127,
        -0.06181996315717697,
        0.0185533594340086,
        0.03921769931912422,
        -0.05492912232875824,
        -0.0931963324546814,
        -0.0860433503985405,
        -0.00994961243122816,
        0.03687535598874092,
        0.03008577600121498,
        -0.0032642330043017864,
        -0.044711366295814514,
        -0.09565205872058868,
        0.00882217101752758,
        0.0032414812594652176,
        -0.11207331717014313,
        -0.07816173136234283,
        -0.05250432342290878,
        -0.05478397011756897,
        -0.024452973157167435,
        -0.0036428978201001883,
        0.014296844601631165,
        -0.07471909373998642,
        -0.019922228530049324,
        0.007657633628696203,
        0.02112220600247383,
        0.02564697153866291,
        0.03669240325689316,
        -0.09982144087553024,
        -0.005251152906566858,
        -0.05094374343752861,
        -0.02996516227722168,
        0.03145834431052208,
        -0.046915218234062195,
        0.014289394952356815,
        0.03279193118214607,
        -0.019607726484537125,
        0.00571801932528615,
        -0.05909658223390579,
        -0.028045285493135452,
        0.11421173810958862,
        -0.011282030493021011,
        0.10921350866556168,
        0.005880637560039759,
        -0.07960913330316544,
        -0.025111882016062737,
        -0.05690496042370796,
        -0.0050881835632026196,
        -0.03924882411956787,
        0.10174866765737534,
        0.02542681246995926,
        0.0746704638004303,
        0.08285826444625854,
        0.13639013469219208,
        0.0026463421527296305,
        -0.019578134641051292,
        -0.0019164927070960402,
        -0.02490326017141342,
        0.006474071182310581,
        -0.011009539477527142,
        0.09160272777080536,
        0.07059376686811447,
        0.0317111499607563,
        -0.010111333802342415,
        0.019432198256254196,
        -0.04635724797844887,
        -0.012153689749538898,
        0.08541778475046158,
        0.136602520942688,
        0.0008045806316658854,
        0.02826596051454544,
        0.015613711439073086,
        -0.024225685745477676,
        0.06522815674543381,
        -0.010013634338974953,
        0.013928239233791828,
        -0.017090540379285812,
        0.038263097405433655,
        0.08012514561414719,
        0.03604789078235626,
        -0.029340902343392372,
        0.0170506052672863,
        -0.1456807404756546,
        0.02098555862903595,
        -0.08065950125455856,
        -0.023826992139220238,
        -0.01858651079237461,
        0.0297118928283453,
        -0.09225638955831528,
        -0.021346688270568848,
        -0.07987575978040695,
        -0.07402991503477097,
        0.01478666067123413,
        -0.010453355498611927,
        0.07334206998348236,
        0.1413838118314743,
        0.02956249937415123,
        -0.014282767660915852,
        0.037337470799684525,
        -0.13606002926826477,
        -0.05130650848150253,
        0.03929644823074341,
        0.024525901302695274,
        -0.07278814166784286,
        3.435363505836919e-33,
        -0.05085063725709915,
        0.08762630075216293,
        -0.015991512686014175,
        0.0029587061144411564,
        -0.008859289810061455,
        0.0037024368066340685,
        -0.024777142331004143,
        0.0024089536163955927,
        -0.07624899595975876,
        -0.03361852094531059,
        -0.010343887843191624,
        0.10950154066085815,
        -0.11288930475711823,
        0.09730914980173111,
        0.059996478259563446,
        -0.042102616280317307,
        -0.06268002092838287,
        -0.05507972836494446,
        -0.035481665283441544,
        0.03889456391334534,
        0.001620885799638927,
        -0.05412775278091431,
        -0.003963240422308445,
        -0.024443376809358597,
        -0.015025848522782326,
        0.053066685795784,
        0.017260072752833366,
        0.06217120215296745,
        0.07571469247341156,
        0.0033675492741167545,
        -0.052593573927879333,
        -0.08114896714687347,
        0.02321445569396019,
        -0.041854098439216614,
        -0.13042360544204712,
        -0.016531433910131454,
        -0.1089780330657959,
        -0.05970082804560661,
        0.04791934788227081,
        0.05062374100089073,
        -0.11574631184339523,
        0.052825625985860825,
        0.0009377002716064453,
        -0.03711872175335884,
        -0.011144470423460007,
        0.009136836975812912,
        0.037938084453344345,
        -0.00630075391381979,
        0.07014287263154984,
        -0.027654608711600304,
        -0.048326242715120316,
        -0.06318315118551254,
        0.01724405586719513,
        -0.03399728238582611,
        -0.07052060216665268,
        -0.06257062405347824,
        0.008478313684463501,
        0.006622774992138147,
        0.05793479457497597,
        -0.015109004452824593,
        -0.008882495574653149,
        0.0433468222618103,
        0.06410529464483261,
        0.02097628265619278,
        -0.01850815676152706,
        0.04398307949304581,
        0.050325870513916016,
        -0.04458723962306976,
        -0.07246606051921844,
        -0.07004712522029877,
        0.019680744037032127,
        0.01712205819785595,
        0.08662690222263336,
        -0.11880645155906677,
        0.011062166653573513,
        0.009325343184173107,
        -0.023785151541233063,
        -0.017650751397013664,
        -0.009076731279492378,
        -0.04865366965532303,
        -0.07873202115297318,
        -0.07476343214511871,
        -0.005667189601808786,
        0.004045973531901836,
        -0.0700538232922554,
        -0.018950436264276505,
        -0.039039671421051025,
        0.02425859309732914,
        0.007706886623054743,
        -0.014458287507295609,
        0.021605653688311577,
        0.0008754554437473416,
        0.0001675989624345675,
        -0.03348546847701073,
        0.002439457457512617,
        -3.686824890022838e-33,
        -0.021426601335406303,
        -0.06716630607843399,
        -0.0016346813645213842,
        0.050179146230220795,
        0.026909053325653076,
        -0.015080971643328667,
        0.06559466570615768,
        0.08075379580259323,
        0.049919530749320984,
        -0.03986459597945213,
        0.03558778762817383,
        0.07423392683267593,
        0.033577047288417816,
        -0.005673824809491634,
        -0.022375645115971565,
        0.02043108269572258,
        0.010186164639890194,
        0.04482974112033844,
        0.0249074287712574,
        -0.07092062383890152,
        -0.021045690402388573,
        0.028519567102193832,
        0.0534089095890522,
        0.04033432900905609,
        0.06805335730314255,
        0.05097886547446251,
        0.039031073451042175,
        -0.022923288866877556,
        -0.017796354368329048,
        0.02348923124372959,
        0.005561837926506996,
        -0.02483951300382614,
        0.03826677054166794,
        0.11462359130382538,
        0.08530149608850479,
        -0.015101711265742779,
        0.05533196032047272,
        -0.045813269913196564,
        -0.018633730709552765,
        0.013867459259927273,
        0.037177085876464844,
        0.027431726455688477,
        -0.03512633964419365,
        -0.034863971173763275,
        0.05127212032675743,
        0.017449088394641876,
        -0.00451243668794632,
        0.04571503773331642,
        0.05329630896449089,
        -0.022336365655064583,
        0.01592201553285122,
        0.05892762169241905,
        -0.01568305492401123,
        -0.007562329526990652,
        -0.03224869817495346,
        0.022695358842611313,
        0.03231819346547127,
        0.011290614493191242,
        -0.02245890162885189,
        0.025742124766111374,
        -0.014628980308771133,
        0.007046787068247795,
        -0.0033081842120736837,
        -0.04484075680375099,
        -0.03490247577428818,
        -0.008505118079483509,
        0.06000891327857971,
        0.028128044679760933,
        0.010232332162559032,
        0.002307269722223282,
        -0.05220436304807663,
        -0.02226736582815647,
        -0.0032131485641002655,
        -0.06860198080539703,
        0.07815444469451904,
        0.05884392932057381,
        0.04184413701295853,
        -0.024749603122472763,
        -0.06064124032855034,
        -0.015282517299056053,
        -0.0349874310195446,
        0.015818525105714798,
        0.029777323827147484,
        0.09882541745901108,
        0.08479081839323044,
        0.0016547481063753366,
        -0.01220611110329628,
        -0.06034562364220619,
        -0.03588945046067238,
        -0.020204953849315643,
        -0.006126449443399906,
        0.06431141495704651,
        0.02201196551322937,
        0.07886196672916412,
        0.002588885836303234,
        -4.275713294532579e-08,
        0.08162893354892731,
        -0.008402343839406967,
        0.028547236695885658,
        -0.02599099464714527,
        0.0353681705892086,
        -0.09146154671907425,
        0.0986228734254837,
        -0.04506688192486763,
        0.043342288583517075,
        0.03348957747220993,
        -0.016278138384222984,
        -0.08660752326250076,
        -0.036085546016693115,
        0.007128685247153044,
        0.05832237750291824,
        0.05205436795949936,
        0.03992202877998352,
        0.0007479646010324359,
        -0.01940532959997654,
        -0.06468498706817627,
        0.021173208951950073,
        0.02949013188481331,
        -0.0015646294923499227,
        -0.03413606062531471,
        0.015510211698710918,
        0.05625199154019356,
        -0.045443251729011536,
        -0.031756531447172165,
        0.07759638875722885,
        -0.05429357290267944,
        -0.07510672509670258,
        0.006451508030295372,
        0.04963172972202301,
        0.014329229481518269,
        -0.0328592024743557,
        -0.05838146060705185,
        0.007694525178521872,
        0.0841309204697609,
        0.05060005187988281,
        0.0854635164141655,
        -0.04125891625881195,
        -0.10959821194410324,
        -0.0420185849070549,
        -0.0334833562374115,
        -0.04453626275062561,
        -0.11141008883714676,
        0.004329653922468424,
        -0.04193536937236786,
        -0.02946036495268345,
        0.08812742680311203,
        -0.03127231076359749,
        -0.037149153649806976,
        0.04419717937707901,
        0.005193863529711962,
        0.004610384348779917,
        -0.0944582149386406,
        0.013412230648100376,
        0.07588348537683487,
        0.06026608869433403,
        0.05881757661700249,
        0.09157077223062515,
        -0.09809281677007675,
        0.0353219248354435,
        0.05686096101999283
    ]
}