{
    "id": "NUaowcXQtOo",
    "title": "Philo Farnsworth and the Invention of Electronic Television",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2017-10-28T22:18:19Z",
    "video_url": "https://www.youtube.com/watch?v=NUaowcXQtOo",
    "category": "Science & Technology",
    "tags": [
        "philo farnsworth",
        "television",
        "how does tv work",
        "invention",
        "who invented tv",
        "when was tv invented",
        "invention of television",
        "vladimir zworykin",
        "iconoscope",
        "image dissector",
        "vidicon",
        "image orthicon",
        "nipkow",
        "mechanical television",
        "john logie baird",
        "baird"
    ],
    "views": 342759,
    "likes": 10686,
    "comments_count": 610,
    "description": "Philo Farnsworth's Image Dissector was the heart of the first television cameras.  This video tells the story of the early days of television, and shows how these early video tubes worked.  How analog television works:   You can support this channel on Patreon!  Your voluntary contribution helps to keep these videos coming.  Visit me here:   Those thirsty for more info brought to you in text form may be interested in spending some time here:   Thank you to all of my current patrons! Tommi Hares Sean Spark Lucas Hartbarger Taylor Cuzela Twiglet David Lastres Granger Meador Jeremy Kitchen Dane Peterson Jason Wellband Shane Belaire Paul Emmerich Max Burns Sam Hodge Matthew Rossi Paul Craigie Kieran Cox Hunter Schwisow wsh  Logan Kriete Rafa Wiosna Adam D. Ruppe Audin Malmin Eric Hansen Noah McCann Jason R Scheuren Rufo Sanchez Aaron Herbst Bjrn Vegar Torseth Yaniv Matt Falcon Stewart Harvath Kevin Landrigan Evan Papp Jason Weathered Stephen Bell Steven First Howard Longden Gianluca D'Orazio Martin Granestrand Jacob Papenfuss Lorenzo Novara Lee Lemoine John Trevick Elliot King Paul Anderson Gustaf Lindblad Carl Yazbek Nicholas  Matthew  Gary Generous Daniel Mann Harald E. Westlie Daniel Newton urbanhusky  Henri Hyyrylinen James Holmes Dave Anderson Neil Hopwood Duncan Middleton Aric Vogel Conor Killeen Tyler Knott Slone Fallion KrzysFR  seagull  Robert Stadtmller Athanasios Kountouras Gorka Alda Jason Brammer Sarah Symon Francis Fisher Tab Patterson Philipp Thomasberger Tjousk  Gustavo Carballeira SkydiveWeee  Alex Smith Nolan Johnson Samuel Kadolph Robert Toth Matthew Giraitis Ellis M. Eisen Tyler  Michael Shick Kasper Guldmann Joe Bond Eidorian  Cubase Academy Nikolaj Srensen Jesper Hansen John Kesson Stephen Youndt cpb Anonymous49856739245764  Jason Ganiatsas  Images featured in this video come from the Wikimedia Commons, and are copyright free.",
    "description_links": [
        "https://www.youtube.com/watch?v=l4UgZBs7ZGo",
        "https://patreon.com/technologyconnections",
        "https://en.wikipedia.org/wiki/History_of_television"
    ],
    "transcript": "Philo Farnsworth is nearly universally given credit as the inventor of electronic television. His first transmission of an image via his television system occurred in 1927, and it was an incredibly big deal. But his invention had less to do with the television in your house, and more to do with the camera in the studio. Today, well be exploring how Philo Farnsworth brought television out of the realm of mechanical contraptions and into the landscape of pure electronics. You see, the cathode ray tube, the device which effectively is the screen of an old-style television, was invented in the 19th century, decades before Farnsworth made his contribution. The trouble was no one had yet figured out how to turn a CRT into a television. When Baird invented his mechanical television, the holes in the spinning disc served both as a scanning device, creating a signal from an image focused onto it as the holes traveled past, AND as a display device, reconstructing the image as a light source duplicated the intensity and location of each part of the scanning device, with the holes moving the lights apparent location to recreate the image line by line. With the CRT being pretty thoroughly researched, it wouldnt take too much imagination to create an image with a moving electron beam. But what was unknown was how to use a similar device to create a signal to actually run a CRT display. As I worked out in my last video, to use a mechanical scanning method like in the Baird system to achieve equivalent image quality of a US CRT television, the scanning disc would have to be impractically large, and it would have to spin impossibly fast. Even if the lens focused on just a 3 centimeter wide target, a 525 line scanning disc would be 5 meters tall, and the edges would still be breaking the sound barrier for 30 complete frames per second. There were other ways to use a mechanical scanning device, though. One of these was the so-called Flying Spot system. With these systems, a mechanical disc in front of an extremely bright arc lamp would project a scanning pattern on a performers face, and a simple light sensor pointed at the performer would measure the light reflected off of him or her for generating the signal, with only one spot hitting the performer at one time. The projection meant the mechanical disc could produce a much larger image than its physical size. The trouble with this approach, however, was that the performer would have to be in absolute darkness, and you still had to work around the poor resolution of mechanical systems on the receiving end. Plus, I imagine the strobing effect as the light shone across your eyes was fairly unpleasant for television talent of the day. Before Baird had even demonstrated his mechanical television, Farnsworth theorized a way to electronically convert an image into a transmittable electrical signal in 1921. This is part of why he is often regarded as televisions inventor. He was what you might call a prodigy, as in 1921 he was only 15. He grew up on a Utah farm, and the story goes that he came up with his idea after observing the lines drawn in the fields from a plow, realizing that by altering a line as its drawn over a distance, you could make an image from a field of lines. Perhaps this is why to this day, each half of an interlaced frame of video is called a field. Farnsworth submitted a patent application in January of 1927. However, Farnsworth wasnt the only person trying to build an image dissector. In fact, the invention of television is very complicated and to say that one person invented it is rather simplistic. For example, before Farnsworth had his image dissector worked out, German professor Max Dieckmann and his student Rudolf Hell applied for a patent for. This, in 1925. In fact, Dieckmann was among the first to demonstrate the display capability of the cathode ray tube back in 1906. And in the following year, a Russian scientist named Boris Rosing used a CRT with experimental video signals to create geometric shapes. See, there was a lot of experimentation going on all over the world. The wikipedia entry on the history of television, which is linked in the description, goes over this in much greater detail. Hell and Dieckmanns patent was granted to them in October of 1927, but they were never able to produce a working model. Meanwhile, Farnsworth transmitted the first image with his image dissector at his laboratory in San Francisco on September the 7th, 1927. Farnsworths invention was very crude at this point, as it only really transmitted a line, and not a whole screen of an image. However, it was a revolutionary proof of concept. On September 3rd, 1928, Farnsworth called a press conference, where he declared Good news, everyone! Ive invented television. His demonstration of actually functional electronic television is generally accepted as the first, and it is for this reason that hes often given credit as the inventor of television. Farnsworths image dissector was a vacuum tube much like a CRT, but instead of emitting light, the image dissector was meant to detect it. Inside the tube was a coating of caesium oxide, a photosensitive material. Caesium oxide has an interesting characteristic where when photons hit it, it emits electrons. This meant that an image focused with a lens onto the face of an image dissector would create a pattern of electron emissions in the shape and intensity of the image itself. Then, this electron image would be scanned. An electron beam very much like that which would be used to draw an image on the face of a CRT television receiver, would methodically scan the face of the image dissector. Now, as we all know, opposite attract, and likes repel--electrons really dont like to hang out together. What happens when the electron beam encounters an area of the image dissector where bright light is hitting the surface? Well, the caesium oxide coating is itself producing electrons, so the electron beam would bounce back at areas where light was present. Ordinarily, most of the beam would just be absorbed by the oxide coating or even the tubes glass. But any electrons sent by the gun that ran into a spot already filled with electrons emitted from the caesium oxide would be reflected back into the tube. The image dissector contained a detector of sorts that would collect these reflected electrons. By amplifying the output of the detector, a signal could be produced which corresponded to the exact image brightness of wherever the beam happened to be pointing on the surface of the image dissector. Deflect the beam in a raster pattern using electromagnetic fields from a deflection yoke, and you can scan the whole face of the dissector and generate a signal from the entire image. Heres a more practical demonstration of whats going on. This poster board represents the target of the scanning electron beam. The image were looking to capture is a simple white circle. A lens is focusing that circle onto the face of the image dissector. The circle of light, which moves us all, by the way, will cause the caesium oxide coating to emit electrons inside the tube wherever the light touches. Well represent electrons in red. Therefore, the circle will be filled with red electrons. It should be noted here that the resemblance to the Japanese flag was entirely accidental. It took me filling in over 90% of this to realize, Oh, thats the flag of Japan. Anyway, the electron gun sits behind the caesium oxide (Pop sound) and it emits a string of yarn, I mean an electron beam (NES Zapper sound effect). Deflector magnets bend the electron beam, and will start scanning the image. For the first few lines, nothing extraordinary occurs as the electrons are just absorbed by the target. But, once the beam reaches the circle, it gets deflected back because electrons are already there. In other words, where the light touches, well the electrons must never go there. These deflected electrons get picked up by a collector electrode inside the tube, and by monitoring the output from this electrode, you get a signal which varies in intensity in proportion to the brightness of the spot the beam is currently scanning. So, reverse the process. Heres a television receiver. Its electron beam is following along the same path as the one in the image dissector, so if the scanning beam is aimed at one spot, the electron beam in the television set will be pointed at the same spot. Whenever the dissector detects light from the circle, the signal it produces will cause the television receiver to spit electrons out from its own electron gun. This will make the phosphors inside the tube glow in the same places that the dissector detected light, and at the same relative intensity. After the scanning is complete, the television will have drawn that circle. Do that really really fast and over and over again, and youve got yourself some mighty fine television. If youre confused, and I wouldnt blame you if you are, it might be helpful to check out my previous video on how analog television works. That video discusses the raster pattern, how the television synchronizes the image coherently via triggers built into the signal, and more in greater detail. Hopefully youll be able to see that the television camera tube is essentially the same thing as the cathode ray tube in a television set, but with the electron beam used as a way to detect the presence of light, rather than to reproduce it. You can find a link to the video down below, or hang around until the endscreen. Farnsworths image dissector was a big deal, but it kinda sucked. Because the beam has to move across the face of the dissector so quickly in order to produce an image, it has only the tiniest fraction of a second to actually encounter an electron on the surface and be deflected back. The caesium oxide coating wasnt super great at producing electrons from light, so television cameras that used Farnsworths image dissector needed an insane amount of light in order to work. This meant studio lighting was absurdly bright--and hot--, and it generally presented unfortunate limitations. A much more practical device for producing television signals was the iconoscope. Here comes another person into the fold. Vladimir Zworykin filed patents for a television system in 1923 and 1925. If youve been paying attention, youll have noticed that these years predate Farnsworths patent application. I told you this was complicated. In 1923, Zworykin presented his idea to H P Davis, the general manager of Westinghouse, where he worked, and in 1925 he demonstrated the first prototype. However, it barely worked, and Davis wasnt impressed. So unphased was Davis that he told Zworykin to work on something useful. Wwll. Zworykin would later work for RCA. The iconoscope functioned essentially the same as the image dissector, but there was one key difference. And Zworykin wasnt the one who discovered the principle that would solve the problem. That was Hungarian engineer Klmn Tihanyi. Too many people here. Anyway, the big deal with the iconoscope was that it didnt rely solely on electrons emitted from the Caesium Oxide. Rather, it used a sheet of mica which had tiny silver particles coated with our friend Caesium Oxide on one side, and a thin film of plain old silver on the other. The separation of these two sheets provided by the mica essentially turned the thing into a giant capacitor, capable of storing electrons. When operating, the iconoscope would first send a steady sweep of electrons across the whole target. This would provide a uniform charge throughout the mica sheet. Light reflected from subjects in the studio and subsequently focused through a lens onto the target would cause the caesium oxide to emit electrons again in the spots hit with light, creating an electron copy of the image, and this would cause the charge stored between the layers to decay more rapidly than it would if no light were hitting it. The next time the target is scanned, areas that werent hit with light will still have electrons in them, which will resist the beams efforts to try and add more. This extra beam energy is reflected back and picked up by the detector ring. Areas that were hit with light would quickly lose their electrons, and the beams energy would instead be used to replenish these lost electrons. The iconoscope produced an inverted signal, as dark areas reflected the beam strongly, and bright areas didnt reflect it much at all, but it was much, much, MUCH more sensitive than Farnsworths image dissector because it could store electrons in the mica sheet, and thus greatly increase the likelihood that the electron beam would actually be deflected back to the detector. One tricky bit about the iconoscope was that the light it was detecting and the electron beam had to hit the mica sheet from the same side. This is why the tube is such a weird shape. The electron gun cant be in the line of sight of the target, so its tucked below the target screen at an angle. In a working camera, its actually in the front, resting below the lens. Electronics in the camera would adjust its scanning sweeps as it went to compensate for the keystone shape it would naturally produce if the beam was projected as a simple square at an upwards angle. A side effect of the way the iconoscope works is an image that can never truly be black. Electrons will decay from the mica screen without any light hitting it at all--light simply accelerates this decay. The detector ring would pick these rogue electrons up, and it would transmit as an entirely grey screen. There needed to be bright areas of the picture to pull down the average emission of the mica screen and make the other areas appear black--in other words, high contrast scenery was required. Lighting conditions would have to be accounted for to keep the averaging effect of the iconoscope from producing odd images. Because this episode is a circus of who-did-what, lets drop one more name. The iconoscope design was immensely improved by accident in 1931 when Sanford Essig left one of the mica plates in the oven too long. This broke up the silver layer into tiny globules, which was responsible for increasing the resolution the iconoscope could detect immensely, Therefore, a sharper image was produced. So, dont forget about him. Although the iconoscope was a great improvement over Farnsworths image dissector, it still wasnt that great. The images were noisy, of poor resolution, and it still required a lot of light, though far less than the original disector did. RCA would develop the Image Orthicon tube in the 1940s, and this much more sensitive device would be used into the 1960s. The Image Orthicon tube combined principles from the iconoscope, image dissector, and the original Orthicon tube. The Orthicon tube (along with the Eurpoean CPS Emitron tube) contained deflector plates that when calibrated correctly would reduce the velocity of scanning electrons coming from the electron gun to near zero as they approached the target. This was immensely helpful, because without these deflectors, electrons could still bounce back into the detector ring without photoelectrons being present. This created for a noisy picture. Slowing the electrons down before they hit the target meant almost no rogue electrons would have enough gusto to make it back to the detector. Only those scanning electrons that actually encountered another electron at the target would make their way back, as the extra repelling force imparted by its photo-electric neighbor would help to push it backwards. This greatly reduced the grainy image noise associated with ordinary tubes. In addition to the electron slow-downy thing, the Image Orthicon tube used a neat physics trick to amplify the effect of the photoelectrons and make the whole thing more sensitive. In an image orthicon tube, the surface the light falls on to make the image, called the photocathode, and the surface the electron beam scans to make a signal, called the target, are separated by a fairly great distance. The photocathode is negatively charged, meaning electrons near it will want to fly away from it, and in front of the scanning target is a wire mesh with a slight positive charge used to attract the photoelectrons. This causes the photoelectrons emitted from the photocathode to be accelerated towards the scanning target. The separation of photocathode and target causes a dramatic increase in speed of the photoelectrons, which results in a multiplication of the electrons generated from the image. This happens because when an individual electron slams into the target at high speed, it causes a splash, forcing many electrons out of the target. This is called secondary emission, and a wire mesh behind the target with a slight positive potential traps these extra electrons. This phenomenon is used to greatly increase the tubes sensitivity. You see, the extra electrons produced when the first photoelectron hit the target came from within the target itself. Essentially, the high-speed of the photoelectron knocks out a whole bunch of electrons when it hits the target. This causes a net loss of electrons in the area of impact, giving that area of the scanning target a slight positive charge. When the scanning beam from the electron gun runs over this area, the electrons it emits are first used to refill those lost from the secondary emission event. The result is that bright areas of the picture use the beams energy to recharge the target, and no electrons are reflected back and detected. Dark areas of the image dont displace electrons in the target, so the beam is reflected back as electrons are already present, and a strong signal is produced via the dynodes and electron multiplier at the base of the tube. The image orthicon tube was a big deal for many reasons, not the least of which was that cameras could be much smaller and less awkward as the scanning portion of the tube was no longer in front of the imaging target. But it was also sensitive enough to capture scenes lit by candlelight, and its logarithmic light sensitivity matches that of the human eye, which made images produced from these tubes appear more natural. A fun little fact immortalized by Wikipedia regarding the image orthicon tube is that its directly responsible for the name of the award given by the Academy of Television Arts and Sciences. Image Orthicon tubes were often referred to informally as Immys. The presidents of the Academy at the time, Harry Lubcke, wanted to name the award after the Immy. But since the statuette is female, the more feminine Emmy was chosen. The inverted signals of the image orthicon and iconoscope--meaning bright areas produce little to no signal and dark areas produce a strong signal--wasnt a problem as this is how television broadcasts were transmitted, anyway. It was up to your TV set to flip those values around. Phew. That was complicated. And I didnt even mention Kenjiro Takayanagis 1926 demonstration in Japan of a CRT-based television system. Sadly he doesnt get much credit because his camera was still mechanical using a Nipkow disc. There I said it. Nip-koff. OR, should it be nip-ko as some have suggested? I dont know, maybe you should argue about it in the comments. There are so many dots to connect here that Im not going to claim I got it all correct. For one thing, Its hard to pin down how developments in Europe affected those in the US and vice versa, particularly due to the patent dispute between Farnsworth and Zworykin which made new developments dance around their respective technological claims. This is a large part of why I didnt go into much detail on European tubes and systems. And all the names given to all the tubes is very confusing for creating a research timeline in me head. Im welcome to all comments that may set records straight, so leave em below. This video is long enough, so Ill be ending it here. Stay tuned, as in the next video, well be looking at the next big thing in TV--Color. Thanks for watching, I hope you enjoyed the video. I am delighted at the growth this channel is seeing and Im glad youre a part of it. If youre new to this channel, why not hit that subscribe button? Im doing my best to keep videos like this headed your way, and Ill see you next time! And a special thanks to supporters on Patreon. You can support this channel through a totally voluntary contribution by visiting my page through the link in the description or the logo on our screen. With your support, youre helping my to make my passion of sharing technological stories with you into a life-sustaining job, and for that I am ever so grateful. Thank you! (Oh no!) (Well...) (Might as well change the yarn again)",
    "transcript_keywords": [
        "Farnsworths image dissector",
        "image",
        "image dissector",
        "Image Orthicon tube",
        "electron beam",
        "electrons",
        "Farnsworths image",
        "electron",
        "Image Orthicon",
        "television",
        "beam",
        "light",
        "target",
        "Orthicon tube",
        "tube",
        "dissector",
        "scanning",
        "caesium oxide",
        "Farnsworth",
        "scanning electron beam"
    ],
    "transcript_entity_values": [
        "Russian",
        "October of 1927",
        "Davis",
        "two",
        "European",
        "H P Davis",
        "1931",
        "1906",
        "Klmn Tihanyi",
        "Philo Farnsworth",
        "Academy",
        "Farnsworth",
        "Dieckmanns",
        "over 90%",
        "Zworykin",
        "Boris Rosing",
        "one",
        "Orthicon",
        "San Francisco",
        "1926",
        "September the 7th, 1927",
        "Emmy",
        "years",
        "the Academy of Television Arts and Sciences",
        "Vladimir Zworykin",
        "Hungarian",
        "Image Orthicon",
        "1921",
        "RCA",
        "Japan",
        "Harry Lubcke",
        "first",
        "nip-ko",
        "CRT",
        "only 15",
        "Sanford Essig",
        "Kenjiro Takayanagis",
        "zero",
        "Dieckmann",
        "Utah",
        "only one",
        "525",
        "Flying Spot",
        "decades",
        "5 meters",
        "Patreon",
        "1927",
        "3 centimeter",
        "the 19th century",
        "Today",
        "Farnsworths",
        "Wikipedia",
        "January of 1927",
        "German",
        "Westinghouse",
        "the 1940s",
        "September 3rd, 1928",
        "the Caesium Oxide",
        "the following year",
        "half",
        "30",
        "1925",
        "Rudolf",
        "1923",
        "Europe",
        "Japanese",
        "the 1960s",
        "US",
        "this day",
        "Caesium Oxide",
        "Farnsworth",
        "NES Zapper",
        "One",
        "Immys",
        "Baird",
        "the Eurpoean CPS Emitron",
        "second",
        "Nipkow",
        "Max Dieckmann",
        "the day"
    ],
    "transcript_entity_types": [
        "NORP",
        "DATE",
        "PERSON",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "NORP",
        "PERCENT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "NORP",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "LOC",
        "NORP",
        "DATE",
        "GPE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE"
    ],
    "vector": [
        0.0006895670667290688,
        -0.07208816707134247,
        -0.011075782589614391,
        -0.10832580178976059,
        0.033567365258932114,
        0.03729211911559105,
        0.024151822552084923,
        0.039836760610342026,
        -0.008665717206895351,
        -0.008421940729022026,
        -0.027182506397366524,
        0.008172132074832916,
        0.01142194215208292,
        -0.035449542105197906,
        -0.09981465339660645,
        -0.10064837336540222,
        0.041761357337236404,
        -0.08236711472272873,
        0.005365131888538599,
        0.0016643318813294172,
        0.02733849547803402,
        -0.07573134452104568,
        -0.007672841660678387,
        0.01649262197315693,
        0.045281775295734406,
        0.03663772717118263,
        -0.01344853825867176,
        -0.006944306194782257,
        0.012191844172775745,
        -0.09324295073747635,
        -0.006622821558266878,
        0.033360980451107025,
        0.10980509221553802,
        0.020143160596489906,
        -0.04692399874329567,
        -0.030556512996554375,
        0.06546881049871445,
        0.05024708807468414,
        -0.08919763565063477,
        0.03742701932787895,
        0.008928697556257248,
        -0.11494435369968414,
        0.0007992795435711741,
        -0.03573003038764,
        0.013301344588398933,
        -0.07400672137737274,
        0.0781000629067421,
        -0.02130706235766411,
        -0.0029408708214759827,
        -0.013513642363250256,
        -0.07573524862527847,
        -0.008774027228355408,
        0.08042807132005692,
        0.037769924849271774,
        -0.012636407278478146,
        -0.011599993333220482,
        -0.027167681604623795,
        0.052488263696432114,
        -0.010956495068967342,
        0.015197060070931911,
        0.0016421675682067871,
        -0.05338308587670326,
        -0.027478985488414764,
        0.07445487380027771,
        -0.008814195170998573,
        0.06438141316175461,
        0.012611535377800465,
        -0.03949994966387749,
        0.042685192078351974,
        -0.0650642141699791,
        -0.13257499039173126,
        0.019342349842190742,
        0.014710202813148499,
        -0.022251231595873833,
        0.019788332283496857,
        -0.056559186428785324,
        0.027274291962385178,
        -0.021318119019269943,
        0.040097612887620926,
        -0.06217986345291138,
        0.09959039837121964,
        -0.09113555401563644,
        -0.07052053511142731,
        0.05386847257614136,
        -0.04803432524204254,
        0.053740307688713074,
        -0.07537324726581573,
        -0.051231369376182556,
        -0.0056881895288825035,
        -0.08127857744693756,
        -0.1046215370297432,
        0.00305920303799212,
        0.043896157294511795,
        -0.040901124477386475,
        0.02863469161093235,
        -0.07109680771827698,
        -0.03874092921614647,
        -0.04481861740350723,
        0.01504132803529501,
        0.08691631257534027,
        0.03855795040726662,
        -0.044736262410879135,
        0.05639629811048508,
        0.03198753669857979,
        -0.012146811001002789,
        -0.07521846890449524,
        -0.022095153108239174,
        0.04290428012609482,
        0.0038533040788024664,
        -0.003540322184562683,
        -0.04213275760412216,
        0.09630175679922104,
        -0.024837801232933998,
        -0.03055511601269245,
        0.04926351085305214,
        -0.09264019876718521,
        -0.03497001528739929,
        0.05682418495416641,
        0.007665871176868677,
        -0.05326753854751587,
        0.016214627772569656,
        -0.018495336174964905,
        -0.09811073541641235,
        0.018594026565551758,
        0.0466129444539547,
        -0.00864205788820982,
        0.0040793945081532,
        2.0678855809284123e-32,
        -0.02696090191602707,
        0.08863874524831772,
        0.0110011612996459,
        0.017888285219669342,
        0.03340998291969299,
        0.055092327296733856,
        -0.00036090280627831817,
        0.042492661625146866,
        -0.007597164250910282,
        0.00821725931018591,
        0.1028251051902771,
        0.010253308340907097,
        -0.03263809159398079,
        0.007676077540963888,
        0.01146320067346096,
        -0.009739059954881668,
        -0.0943409651517868,
        -0.06528995931148529,
        -0.024101778864860535,
        -0.061311986297369,
        -0.040737394243478775,
        0.022963250055909157,
        0.02214188128709793,
        -0.031265076249837875,
        0.003668390214443207,
        -0.026255551725625992,
        -0.0345536433160305,
        -0.018654875457286835,
        0.08913897722959518,
        -0.0007588685839436948,
        0.03848659247159958,
        0.037357356399297714,
        -0.0005105920718051493,
        -0.02619735710322857,
        -6.585777009604499e-05,
        -0.028952788561582565,
        0.015688730403780937,
        -0.15751098096370697,
        0.020453305914998055,
        0.040505729615688324,
        0.03774656727910042,
        0.07021725177764893,
        -0.03196262940764427,
        -0.03522905334830284,
        -0.03972611203789711,
        0.03970462456345558,
        0.054484326392412186,
        0.103819839656353,
        -0.0007013052818365395,
        0.06243584305047989,
        0.011045988649129868,
        -0.0020610142964869738,
        -0.0584854818880558,
        -0.07219637930393219,
        0.04797321930527687,
        0.0627133697271347,
        -0.07582110166549683,
        -0.0767289400100708,
        0.027986548840999603,
        0.015550894662737846,
        -0.04703548550605774,
        0.08860975503921509,
        0.03038054332137108,
        0.015101063996553421,
        -0.1141970306634903,
        -0.02031974494457245,
        0.10856130719184875,
        -0.03814932703971863,
        0.010766441933810711,
        0.019638655707240105,
        -0.06350764632225037,
        0.03284137323498726,
        -0.08029402792453766,
        -0.11635031551122665,
        0.041659675538539886,
        0.06584835797548294,
        -0.0778338834643364,
        0.011301219463348389,
        0.010147757828235626,
        -0.005937577690929174,
        0.0012161314953118563,
        -0.0152552779763937,
        0.038645822554826736,
        0.014896228909492493,
        0.012334507890045643,
        0.05410107970237732,
        0.008208813145756721,
        -0.0190450269728899,
        -0.013368786312639713,
        0.015194863080978394,
        -0.010011689737439156,
        -0.05452270060777664,
        0.04243296757340431,
        0.01566963456571102,
        0.0010185916908085346,
        -1.908063605749088e-32,
        -0.015365232713520527,
        0.063590869307518,
        -0.028396598994731903,
        -0.020105259492993355,
        0.05296963453292847,
        -0.09711300581693649,
        -0.0018470846116542816,
        -0.02065744437277317,
        0.09698530286550522,
        -0.0419335775077343,
        0.05846067890524864,
        -0.03489967808127403,
        -0.061813272535800934,
        -0.03143727779388428,
        -0.07759597152471542,
        -0.06908206641674042,
        0.029934698715806007,
        -0.06358666718006134,
        -0.002516448264941573,
        -0.0637919083237648,
        0.08967799693346024,
        0.015632525086402893,
        -0.13814671337604523,
        -0.003869952168315649,
        -0.0017218317370861769,
        0.026554396376013756,
        0.05306948721408844,
        0.10239377617835999,
        -0.02343246527016163,
        0.06629183143377304,
        -0.03620466589927673,
        -0.0592191107571125,
        0.038832005113363266,
        0.013031366281211376,
        -0.00676460238173604,
        0.11947757005691528,
        0.09775913506746292,
        0.045828212052583694,
        -0.06409211456775665,
        -0.11812198907136917,
        0.008469287306070328,
        0.04367313161492348,
        -0.030347052961587906,
        -0.061544083058834076,
        -0.04222896695137024,
        -0.0020130393095314503,
        -0.08538569509983063,
        0.00255590514279902,
        -0.0839059054851532,
        -0.022917473688721657,
        0.021553052589297295,
        0.032893288880586624,
        -0.01354038342833519,
        -0.02114151045680046,
        0.013967313803732395,
        0.044781338423490524,
        0.053885892033576965,
        0.07251642644405365,
        0.046199169009923935,
        0.0018877062248066068,
        -0.042704712599515915,
        -0.05745343118906021,
        -0.05961690470576286,
        -0.029018215835094452,
        0.028256766498088837,
        -0.04075298458337784,
        0.044461026787757874,
        -0.0021746393758803606,
        -0.02966289408504963,
        -0.07053031027317047,
        0.020753080025315285,
        0.011971065774559975,
        0.04633824899792671,
        -0.0516064316034317,
        0.02861969731748104,
        0.008731842041015625,
        -0.07806242257356644,
        0.008357699029147625,
        -0.03493593633174896,
        0.06279733031988144,
        -0.05898965522646904,
        -0.06438534706830978,
        0.011253371834754944,
        0.057378653436899185,
        0.07216143608093262,
        0.07811757177114487,
        0.08134491741657257,
        -0.0794830471277237,
        0.012662245891988277,
        0.052811071276664734,
        0.04236650466918945,
        0.030568042770028114,
        -0.01928112842142582,
        0.008935037069022655,
        0.031511999666690826,
        -7.309765948093627e-08,
        -0.0071271262131631374,
        -0.04756927862763405,
        -0.058233074843883514,
        -0.027682669460773468,
        0.03802454099059105,
        -0.01822979934513569,
        0.09885949641466141,
        0.0061326404102146626,
        -0.012381886132061481,
        -0.05489715561270714,
        -0.00462587084621191,
        0.08040665835142136,
        0.046572186052799225,
        -0.007989730685949326,
        0.12177864462137222,
        0.016413243487477303,
        -0.06568185240030289,
        0.0013611195608973503,
        -0.0470125712454319,
        0.048389408737421036,
        0.07824357599020004,
        -0.026560135185718536,
        0.07120447605848312,
        -0.003956989385187626,
        0.08908858895301819,
        0.017180243507027626,
        0.012139628641307354,
        -0.07548251003026962,
        0.006709752604365349,
        0.0313839353621006,
        -0.07793185114860535,
        0.014008976519107819,
        -0.04148782417178154,
        -0.07741615176200867,
        0.06268303096294403,
        -0.043770819902420044,
        -0.05423114821314812,
        -0.010874984785914421,
        0.04817061498761177,
        0.0246976837515831,
        -0.04616687074303627,
        -0.031826455146074295,
        0.032080359756946564,
        0.04519212245941162,
        -0.0011561758583411574,
        0.03174545243382454,
        -0.013959185220301151,
        -0.004636984318494797,
        0.029134472832083702,
        -0.09198688715696335,
        0.04001222178339958,
        0.03488820791244507,
        0.01819472387433052,
        -0.004758754745125771,
        -0.0010253018699586391,
        -0.08562028408050537,
        0.09112964570522308,
        0.013407873921096325,
        -0.05683669447898865,
        0.0485248826444149,
        0.044847387820482254,
        0.06986604630947113,
        -0.01827392913401127,
        4.4706135327032825e-07
    ]
}