{
    "id": "Nv3xJr6kBSc",
    "title": "I bought SHADY Laptops from Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-10-18T15:03:39Z",
    "video_url": "https://www.youtube.com/watch?v=Nv3xJr6kBSc",
    "category": "Science & Technology",
    "tags": [
        "amazon",
        "laptop",
        "laptops",
        "cheap",
        "budget",
        "knockoff",
        "fake",
        "aocwei",
        "ecohero",
        "bitecool",
        "gateway",
        "tech",
        "review",
        "unboxing",
        "windows",
        "austin",
        "austin evans"
    ],
    "views": 902444,
    "likes": 22676,
    "comments_count": 603,
    "description": "Ecohero Delta on Amazon:  Aocwei Laptop A2 on Amazon:  Bitecool HaloBook Laptop on Amazon:  Gateway 11.6\" Laptop on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 Should You Trust Amazon Laptops? 0:35 Ecohero Delta 2:52 AMD Inside...Right? 3:44 \"Warranty\" 5:13 Aocwei Laptop A2 6:59 How Bad Is It? 8:12 Bitecool HaloBook 10:13 Gateway Convertible Laptop 12:45 Inside the Gateway 13:58 Inside the Bitecool 15:06 Inside the Aocwei 15:38 Inside the Ecohero 16:57 Was It Worth It?",
    "description_links": [
        "https://austin.tech/ecohero",
        "https://austin.tech/aocwei",
        "https://austin.tech/bitecool",
        "https://austin.tech/gateway",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- Is it a good idea to buy a random laptop from Amazon? Now this actually got started a few weeks ago when I took a look at this, the Robo and Kala. Now this is a laptop slash tablet, very much like a surface that is way, way better than I expected. This is less than half the price of the equivalent Surface and it's got a lot going for it. Now that's a keyboard. It's got a beautiful OLED display. Like, this thing is really, really nice. So the question is should you trust a no name brand laptop from Amazon? I mean, I always trust Amazon and that's never gotten me anywhere bad or made me regret my life decisions. First up, we have the Ecohero Delta. Now looking at this box I'm immediately struck by one thing. Can I direct your attention to the specs? It has a Ryzen 7 3700U custom edition. You know what makes it a custom edition? It's got Intel inside. (Austin laughing) They put an Intel sticker on their AMD laptop. There are some other things that are kind of interesting. So it's got a 15.6 inth IPS display, 1080p, eight gigs of RAM, 256 gig NVMe SSD. It does support one SATA drive. Those specs are, I would say very, very solid for $300. All right, Ecohero, what you got for me? Well that's actually a cool C pattern. I got myself a VIP card. Activate your warranty one year. Hold on a minute. You try to tell me I don't have a warranty unless I go to honorbonus.com. A lot of times what you'll find when you purchase items from Amazon is it like to activate the special offer you go to the website and then they make you like leave a good review which is oftentimes how you see a lot of bizarrely high review products on Amazon. Let's take a look at our Ecohero. Oh, oh, that actually, that looks not like super cheap plastic. It feels bad though, do you hear this? Inside we have a, okay, that's fine. I will say very decent sized track pad. It is unfortunate plastic. I'm gonna say that every part of this laptop is plastic. The keyboard actually looks kind of decent. Let's do a little flex test here. That's fine. It definitely, the keyword deck flexes but it's not as bad as some of those super cheap ones. And we do have the little camera cover. So it's just a physical slider over the webcam which is always nice to see. This has Windows 11 Pro installed. So when I was going through the setup, it didn't make me get online to do a Microsoft account and everything which is especially strange for a $300 laptop. This trackpad I will say is actually fine. Let's talk display. This is most certainly like B-stock so a lot of times they'll have defects or issues. This one's actually pretty decent. The fact that it's matte is strange but nice. It does not look super uniform. I can tell it's a little darker right here on the corner. First of all, what's inside this thing? It says it's a Ryzen 7 3700U but it says it's a dual core processor and that's just just not true. Like this is not a, wait, wait, what? And also it says it's got six gigs of RAM. So the way that these AMD processors will go oftentimes is they will actually like split your RAM. So it'll like have like like one gig or something dedicated. With only eight gigs of RAM on board, I'm surprised that they carve out two permanently for your graphics. I'm on the AMD website and it says that my Ryzen 7 3700U has four cores and eight threads. I open up task manager, two cores, four threads. I open up CPU Z, two cores, four threads. CPU Z just shows that as a Ryzen 7. Is the custom edition maybe like a salvaged chip like with maybe a couple of cores disabled or did they take like a Ryzen 3 and just rebrand it and just flash it as a Ryzen 7. Next I wanna try the actual warranty. Oh good lord, that's (hugs) in Comic Sans. I'm not gonna trust you if you ask for all my information and using Comic Sans. Congratulations, your warranty is activated but then right beside it, it says, what you can get, amazon.com, $30 real money. The four steps to simply get it, generally less then five minutes. I wonder what happens with my four simple steps. You wanna take a guess at what my four simple steps are gonna be? Leave a review. I knew it. I knew it, I knew it. This is not okay. All right, just straight up, this is bribery. What happens if I give a one star review? Okay, one star review. Next step, confirm my email address. Finished, congratulations, you've completed the steps. Amazon gift card will be emailed to you in two to five working days. So I guess in two to five working days I will let you know if I've gotten my gift card for telling them that they scammed me by giving me not the right processor in any way whatsoever. What do you know? A few days after asking for my free $30 gift card, I've received an email back. If you like our laptop and are willing to give a positive review, once we find that your great review has been displayed or you send me a review screenshot, we will send you the $30 gift card as a thank you. I left a one star review saying that, hey, you scammed me because the processor that's in my laptop is not what you advertised. And I just got this form email saying, \"Hey, we're glad that you enjoyed the VIP one year warranty. Could we have like a $30 gift card to give you?\" Next up we have the Aocwei. This is the Laptop A2 and it looks generic. CPU cores, dual core. What kind of dual core? Don't worry about it. 1080p screen resolution, that's actually nice. 14 inch, Windows 10 instead of 11. Six gigs of RAM and 64 gigs of ROM which I assume is gonna be eMMC. With the Aocwei, this is squarely in the kind of price that you expect for like an HP Stream or something. What the? Comprehensively protects your keyboard. They give you a keyboard cover in the box. Is that because the keyboard feels so atrocious or because they threw this in for 10 cents? Register your lifetime warranty with 10, 10 days. Now hold on, hold on, hold on, lifetime. I don't trust any of these things man. No, I'm like, I'm on alert. (alarm blaring) I'm looking for scams, everywhere. The, the mouse? What the, what the, oh, this means the track pad's bad. This means the trackpad's bad. I'm onto you Aocwei. You just gimme a mouse for no reason. (Austin laughing) Alright, let's take a look at the laptop which I will say actually looks like it's fairly well padded. That's plastic. So what's interesting about the Aocwei is that when I was purchasing it, it actually gave me a little promo code discount so I could order myself a 256 gig M.2 SSD and I would get it for free. That actually did happen. The downside is that while this showed up in a couple days because I have Prime shipping, the SSD said it'll be here in two to four months. Austin from two weeks in the future here. And we just got a package which has our 256 gig SSD. So, turns out they weren't scamming us. It actually was included for free, cool. (tone beeping) Okay, wow, that's quite the texture. Well we've got a track pad which is fine I guess and lots of plastic actually. You know, I will say the bezels are quite small. That actually is not a terrible looking laptop even though it's a 14 inch, it is somewhat compact. It's not the worst I've ever seen but there is a lot of flex. If you're typing, like you're definitely, like you feel that whole thing sinking down. I actually will say when I saw the mouse, I immediately expected that this track pad was gonna be terrible. It's actually fine. Intel Celeron N4020C. Oh, ooh, that sounds like protection. So the problem with a lot of these keyboards is they're super plasticky and they kind of sound echoy. The rubber actually kind of damps it. Just notice the difference, right? So, (keys clicking) versus, (keys clicking softly) it legitimately sounds better. The screen is not bad. Let's actually listen to some music here. (upbeat music) You know what? Again, very quiet, actually not horrible. (upbeat music) Alright, so this is our Bitecool. Now I will give them props. This time around, there's an Intel sticker on an Intel processor. Yay, you did it. (Austin clapping) It's very clearly the same company from Ecohero. So this is using a 12th gen Intel N5095 and it's paired with 12 gigs of fast RAM and it's already got a 256 gig SSD installed. Although, it does say you can expand it up to two terabytes. I will say, oh, oh, ha, ha, ha. We got another VIP card baby. Oh, that don't, that don't sound good. Oh, well I see vents here. This actually might have active cooling. I don't love the gray on gray. It would be nice if the bezels were black. It does have the same little like webcam cover though which that's nice. Let's try the keyboard deck. Oh, that's actually, that feels, that's the best one of them all. So just like the Ecohero, this is running Windows 11 Pro. It's showing eight gigs of RAM, what? 12 gigs of Ram reported by Windows, available RAM, 7.8 On the AMD side, I understand that it had less showing up because some of the RAM was partitioned for the graphics, right? Like, it was in its own little zone, not available for like regular use. This is not like that, right? Wait, no, it is, what? What are you doing? Oh my god. They partitioned off four gigs of RAM for the graphics. What are you thinking? The fact that we gotta do the whole active the warranty is annoying. Ah, it's the Comic Sans. It's the exact same website. It's a different URL, it's the exact same website. Look at this. I fill it out and immediately says, congrats, you've completed the step, the Amazon gift card and it tells me, it links to service at Ecohero. Now, it's definitely the same company. It's not letting me do this twice. I'll say I like this one the most of the three. So next up is a brand that is decidedly not a random weirdo from Amazon. This is Gateway and the fun fact is, this was our cheapest laptop at only $143. Now the reason I was really drawn to this, well, first of all, I saw it was an Amazon's Choice which I thought was just funny. If you saw a recent video on Amazon's Choice, you'll know all about my thoughts on that. It's got the really terrible Celeron, the older version, the N4020. Does come with Windows 11 in S mode, 64 gigs of storage, 4 gigs of RAM. And it does come with Microsoft 365. Let's see what we got. 24, 24 watt? Wow, that's really skimpy. That's all you get. And then we have the laptop, that is literally all that's in the box. Joanna, do you wanna read this one? - [Joanna] Wait, what? (Joanna gasping) Thank Mooo! Oh, I get it. It's like thank you, but it's a cow. (song in foreign language) - The difference with this compared to the other ones is that this is just telling me to leave a review and let everyone know how much you like it or whatever. Boy, it is just so small. It is such a little dude, wow. So inside, oh that's blue. Now, that's blue. I love the one finger open. That is a firm hinge. Oh, that's totally a touchscreen. Wow, look at the size of that bezel. Is this Windows 8 over here? Oh no, no, no, look at the keyboard. Why is it so small? No, why would you do that? Oh, it's not a full size keyboard. Something's really weird with this laptop. So I went to go and like fire it up and you know, it starts to do like the Windows setup screen. It goes black, I have to like restart it and now it's bouncing in and outta the desktop and it's frozen. Also, this is the world's most reflective screen. Like can you see how reflective this is? I can just talk to you through the screen. Oh, now it's going in. Oh, my God. After all that time, then I get the Windows 11 set up. But it's like the color space is off 'cause I'm seeing this insane banding. Maybe you can see a little bit better on camera here. I can't change the brightness right now, but if you take a look at it, do you see all like the banding? So there's like all these lines here, and here, and here. Oh, my god, we got cow. - [Joanna] Cow. - He's just staring at me, like, why did you buy this really, really poor excuse for a laptop? I think I've learned everything I need to know about these laptops for the initial impressions. Why don't we open them all up and see what's lurking inside some of these? 'Cause I'm assuming that there are some surprises. Some might be promising. A lot of them I think are gonna be deeply, deeply mediocre. Alright, so let's start out with the Gateway. Now, I'm assuming that there's nothing user upgradable in here, but even if it's nothing more than just taking a look at what the cooling solution looks like, I'm curious. Oh, well that's not good. I feel like I see glue in here, what? Hey, all right, I think we're free now. It is clear they don't really want you to open this and I'm assuming it's because there's nothing upgradable. Wow, that's empty. So we've got a 42 watt-hour battery. Actually, you know what? I will give them a little bit of props. That's the same size battery as some of the much more powerful laptops. So the battery, that actually might not be terrible especially considering the 11.6 inch display. So this is our motherboard right here. So it does actually have a fairly decent sized copper plate on the top. So this is passively cooled, like a couple of these other laptops. You see on the opposite side there's a little bit of copper and a couple of shims here. So that's all the cooling that you've got which is actually kind of okay. This is super standard for these kind of laptops. This all right here is all just empty, right? So that's empty. They have a little daughter board, which just has like our USB ports and whatnot, and that's it. Two speakers, battery. There is nothing to this. Soft thumbs up, but man, this Gateway's not good. Next up, let's take a look at the Bitecool. So this feels like it's the cheapest one but there are a couple of interesting things here. First and foremost, we have this little easy access door for what I'm assuming has gotta be our M.2 slot. Oh, my God. (Austin laughing) Wow, alright, well, so we do have access to our SSD here. Oh, sneaky, sneaky. There's a hidden screw here. You got a little warranty void sticker on one additional screw. All right, well, you know, fair enough, huh? Okay, so this is significantly more complex. So it has an active cooler, which I mean, to be fair, a basic fan. So, we have one heat pipe over the CPU, we have a single fan. Look at all of this empty space. There is nothing in here. I'm actually kind of surprised about that because this seems like it would be plenty of space if you wanted to install like a 2.5 inch SSD, not that you're really gonna wanna take advantage of that. And you also do see the Intel Wifi card there which does look like it started down but I mean at least it's, you know, a proper Wifi solution. I'm gonna give this also a soft thumbs up. So with the Aocwei, we also have a M.2 slot exposed, and importantly, this is the laptop that did come with the free SSD. So theoretically, it is quite easy to upgrade the SSD yourself. This one's gonna be a pain to open, I can already tell. Boy, it's so much flexing. That doesn't feel good. Ah, it's empty. This is the motherboard. This is our M.2 slot. This is our very small battery and this is all empty. Lord, I'm losing brain cells today. So I will say the Ecohero much like the Bitecool, is far easier to open. The difference though is that there's no external M.2 slot, so you have to open this up, unlike the other ones, if you want to load up like a fresh SSD in there. What's bad is that the speakers just are dangling in here. I guess there's nothing holding the speakers down but there are actual reasons to open this one up. So we have access to our SSD. Unlike the other one, which had just a huge empty chasm this also has a huge empty chasm but importantly it's got a SATA port. So if I wanna install an SSD, I plug that right in and I can instantly upgrade my storage. (Austin clapping) And it gets better. Look at this, behind all this giant amount of stickers is not one, but two DIMMs. (cartoon speaking gibberish) I can upgrade the RAM too. I feel, so you feel better about this, although I will say that the battery is still very small. Is it branded as a Ryzen 7 or not? Okay, the reveal is, it just says AMD, wait. Are you telling me it just says AMD Ryzen on it? Wait, hold on, hold on, wait, let me, it's just a bunch of random numbers. No, it doesn't say anything. Wait, there's a little QR code. So I just, I guess, I don't know. I don't know what that chip is. It's not a full Ryzen 7, I know that for a fact. I don't think I've been impressed by any of these laptops. I don't think that there are, at least from what I found, any hidden gens lurking in the bestselling or the ads of Amazon. There are a couple of interesting takeaways. Most notably, I will say the Bitecool is actually the closest to something I could recommend. Certainly not perfect, but it's got decent specs, a decent screen, a pretty solid price. My big sort of reservation there is how they sort of force you to sign up for the warranty and give you a gift card. So, next time you see yourself a suspicious looking Amazon listing for a laptop brand you've never heard of, it's probably a good idea to look the other way and buy Lenovo or an HP or a Dell or an ASUS or an Acer or a Surface. - [Joanna] Or a Gateway, with cows. - No, don't, the Gateway was the worst one. (Austin laughing) (sad music)",
    "transcript_keywords": [
        "RAM",
        "laptop",
        "Amazon",
        "gigs of RAM",
        "SSD",
        "Ryzen",
        "gigs",
        "Windows",
        "gift card",
        "Amazon gift card",
        "review",
        "card",
        "Ecohero",
        "gig SSD",
        "Intel",
        "Robo and Kala",
        "give",
        "warranty",
        "kind",
        "AMD"
    ],
    "transcript_entity_values": [
        "CPU Z",
        "256",
        "first",
        "Celeron",
        "a couple days",
        "Gateway",
        "Two",
        "a few weeks ago",
        "two",
        "AMD",
        "four",
        "Surface",
        "one",
        "Dell",
        "the Ecohero Delta",
        "24 watt",
        "a minute",
        "15.6",
        "Aocwei",
        "six",
        "Ryzen",
        "USB",
        "10 cents",
        "SATA",
        "Austin",
        "only eight",
        "Acer",
        "7.8",
        "Gateway",
        "Kala",
        "2.5 inch",
        "Joanna",
        "SSD",
        "1080p",
        "Comic Sans",
        "12th",
        "today",
        "two weeks",
        "two to four months",
        "14 inch",
        "AMD",
        "Amazon",
        "the Laptop A2",
        "Robo",
        "eight",
        "Windows 11 Pro",
        "Bitecool",
        "ASUS",
        "300",
        "Windows 10",
        "42 watt-hour",
        "1080p",
        "HP",
        "11",
        "10, 10 days",
        "Lenovo",
        "Microsoft",
        "a Ryzen 7",
        "CPU",
        "Ryzen",
        "11.6 inch",
        "First",
        "Six",
        "3700U",
        "only $143",
        "three",
        "amazon.com",
        "HP Stream",
        "RAM",
        "Ecohero",
        "30",
        "64",
        "Windows 11",
        "Windows",
        "12",
        "A few days",
        "Celeron",
        "Ram",
        "4",
        "one year",
        "Bitecool",
        "two to five working days",
        "Intel",
        "less than half",
        "five minutes",
        "24",
        "Comic Sans"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "NORP",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LOC",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART"
    ],
    "vector": [
        -0.07323659956455231,
        0.0054039363749325275,
        -0.019001426175236702,
        -0.06995323300361633,
        0.04808923229575157,
        -0.018990550190210342,
        0.007958224974572659,
        0.018009692430496216,
        0.07019883394241333,
        0.010958935134112835,
        0.056761786341667175,
        0.0582706443965435,
        0.04814797267317772,
        -0.06643138825893402,
        0.05176769569516182,
        -0.028661217540502548,
        0.1286831647157669,
        -0.13085885345935822,
        -0.0854869857430458,
        -0.03450748696923256,
        -0.06244054436683655,
        -0.04010855033993721,
        0.0060015274211764336,
        -0.029957816004753113,
        -0.023595036938786507,
        -0.006758402101695538,
        0.060869600623846054,
        -0.0008073844364844263,
        -0.07942099869251251,
        -0.06607229262590408,
        -0.0067648873664438725,
        0.08958984911441803,
        -0.05632038041949272,
        0.0021958511788398027,
        0.030357569456100464,
        -0.09671106189489365,
        -0.022367997094988823,
        -0.04241907224059105,
        0.0365721695125103,
        -0.09621331840753555,
        -0.014417831785976887,
        -0.08092072606086731,
        -0.004974943120032549,
        -0.028528083115816116,
        -0.0028021365869790316,
        -0.03135300800204277,
        0.0020733221899718046,
        -0.0003134668804705143,
        0.08265925198793411,
        -0.02918495424091816,
        0.022891484200954437,
        -0.008509264327585697,
        0.015648899599909782,
        -0.05293770134449005,
        -0.09083054959774017,
        0.023571224883198738,
        -0.020310470834374428,
        -0.03309053182601929,
        0.036854155361652374,
        -0.014045363292098045,
        0.1272982656955719,
        -0.08330608904361725,
        0.022012118250131607,
        0.0687161386013031,
        -0.011214875616133213,
        -0.052463699132204056,
        0.01577146351337433,
        -0.06485061347484589,
        -0.0005437215440906584,
        0.005561835132539272,
        0.0371096096932888,
        -0.025113601237535477,
        0.0567396879196167,
        0.03256251662969589,
        0.012953822501003742,
        -0.021251071244478226,
        0.04686092585325241,
        -0.06483058631420135,
        0.0015786516014486551,
        0.003409761004149914,
        -0.04746570438146591,
        0.043477777391672134,
        0.007766657508909702,
        -0.022651195526123047,
        -0.0022553016897290945,
        -0.03742023929953575,
        0.059916187077760696,
        0.003901229240000248,
        -0.012327656149864197,
        -0.02883002534508705,
        0.09652568399906158,
        0.0006483331089839339,
        0.042691901326179504,
        0.008347301743924618,
        -0.017971079796552658,
        -0.02955092117190361,
        0.026870569214224815,
        -0.015064811334013939,
        -0.02376304566860199,
        0.02496434561908245,
        0.012916105799376965,
        0.05480577051639557,
        0.014617024920880795,
        -0.03709317371249199,
        -0.02077903226017952,
        -0.07163535058498383,
        0.008559676818549633,
        0.050246190279722214,
        0.04800207540392876,
        -0.05082236975431442,
        -0.0586850605905056,
        -0.048168133944272995,
        -0.026265224441885948,
        0.054784905165433884,
        -0.041153669357299805,
        0.014409634284675121,
        -0.040636155754327774,
        -0.027882860973477364,
        0.07444225996732712,
        0.04148491844534874,
        0.028545230627059937,
        0.02471318654716015,
        0.01989719830453396,
        0.009937306866049767,
        -0.030720960348844528,
        -0.020817773416638374,
        -0.03545420244336128,
        6.84722961428487e-33,
        0.04434973746538162,
        0.04172835499048233,
        -0.048983972519636154,
        -0.12513433396816254,
        0.024628618732094765,
        0.02244383841753006,
        0.013753091916441917,
        0.023870669305324554,
        -0.0012236055918037891,
        0.0006757896626368165,
        -0.1161118820309639,
        0.010721943341195583,
        -0.05289106443524361,
        0.0072395033203065395,
        0.025123225525021553,
        0.030593309551477432,
        -0.06766816228628159,
        -0.021735696122050285,
        -0.05335036292672157,
        0.04645281285047531,
        0.08800771832466125,
        -0.04423314705491066,
        0.020377267152071,
        -0.04967369884252548,
        -0.007009763736277819,
        0.03063894808292389,
        -0.048349350690841675,
        0.03725920617580414,
        0.0635775700211525,
        0.091729536652565,
        -0.06316854804754257,
        -0.0506628155708313,
        -0.04722907021641731,
        -0.07761693745851517,
        -0.07429703325033188,
        0.025684908032417297,
        -0.047012172639369965,
        -0.06109634041786194,
        0.022814836353063583,
        -0.08532511442899704,
        -0.04254915565252304,
        0.09114935994148254,
        -0.09646255522966385,
        0.00020402639347594231,
        0.0016404612688347697,
        0.02415970340371132,
        -0.00902339443564415,
        0.0018151832045987248,
        0.015808790922164917,
        0.025086311623454094,
        -0.15276576578617096,
        -0.025623869150877,
        0.11487085372209549,
        -0.030867410823702812,
        -0.0515531525015831,
        -0.00978791993111372,
        0.013308057561516762,
        0.011376416310667992,
        0.0887291431427002,
        0.09311607480049133,
        0.04849160090088844,
        0.0071537066251039505,
        -0.03838406130671501,
        0.0022800196893513203,
        -0.10656644403934479,
        0.06143394112586975,
        0.11372807621955872,
        0.04741990193724632,
        -0.07575888931751251,
        -0.05978267639875412,
        0.0018089812947437167,
        -0.02038288302719593,
        0.038768041878938675,
        -0.015464943833649158,
        0.0514657162129879,
        -0.057332172989845276,
        0.00010323800961486995,
        0.01630949042737484,
        0.01677442528307438,
        -0.06439913064241409,
        0.028586529195308685,
        0.00781281478703022,
        0.08320330083370209,
        -0.022452354431152344,
        -0.10419017821550369,
        0.0691305473446846,
        0.044011931866407394,
        -0.03836793452501297,
        -0.005927247926592827,
        0.067622110247612,
        -0.023794276639819145,
        0.03157615289092064,
        -0.062449462711811066,
        0.015217512845993042,
        0.021952321752905846,
        -8.668164403256659e-33,
        -0.01811881735920906,
        -0.025000616908073425,
        -0.03751326724886894,
        0.017483456060290337,
        -0.06981175392866135,
        0.0331723690032959,
        0.004143822938203812,
        0.04751632362604141,
        -0.013205836527049541,
        -0.03029441274702549,
        -0.05174710229039192,
        0.13249078392982483,
        0.013511395081877708,
        -0.08747418969869614,
        0.08809810131788254,
        -0.07071598619222641,
        0.029278269037604332,
        -0.07141882181167603,
        0.0452500581741333,
        -0.02433951199054718,
        0.008357059210538864,
        -0.004178657662123442,
        -0.04129515960812569,
        -0.05538623034954071,
        -0.021127402782440186,
        0.021787043660879135,
        -0.08758550137281418,
        -0.022769667208194733,
        -0.03308890014886856,
        0.06506819278001785,
        0.020509378984570503,
        0.029324639588594437,
        0.030655793845653534,
        0.09239731729030609,
        0.02230854518711567,
        -0.06272013485431671,
        0.018197467550635338,
        -0.011905942112207413,
        0.019377510994672775,
        -0.04689859226346016,
        0.07928646355867386,
        0.026913339272141457,
        -0.029181277379393578,
        -0.06412150710821152,
        0.04760389402508736,
        -0.027082720771431923,
        -0.014717782847583294,
        -0.04256603866815567,
        0.04075455293059349,
        -0.025438429787755013,
        -0.04410809278488159,
        0.025361213833093643,
        0.0010159955127164721,
        0.03272244706749916,
        -0.026884248480200768,
        -0.01942865364253521,
        -0.03357923403382301,
        0.05572603642940521,
        0.030924629420042038,
        -0.029686372727155685,
        -0.06719876080751419,
        0.04300706833600998,
        0.015703117474913597,
        0.00818211492151022,
        -0.001072735176421702,
        0.04574768245220184,
        0.10487562417984009,
        0.02746729366481304,
        0.06697878241539001,
        -0.04833763837814331,
        -0.03241421654820442,
        -0.08681897819042206,
        -0.06383972615003586,
        -0.05841919034719467,
        0.010118601843714714,
        0.04729824140667915,
        0.039252884685993195,
        -0.050642017275094986,
        -0.08871924877166748,
        -0.019213246181607246,
        -0.021486792713403702,
        -0.03670480102300644,
        0.030042290687561035,
        -0.029856009408831596,
        0.029883315786719322,
        -0.018491819500923157,
        0.011971083469688892,
        -0.030409760773181915,
        -0.05107136070728302,
        0.05259426310658455,
        0.002951704664155841,
        -0.03524021804332733,
        -0.08603540807962418,
        0.021601863205432892,
        0.05520154535770416,
        -5.444168849066955e-08,
        0.02556498534977436,
        0.0038693356327712536,
        0.10180792957544327,
        0.1352659910917282,
        0.01082864124327898,
        -0.05641461908817291,
        0.040572475641965866,
        0.03784167766571045,
        0.07410828769207001,
        0.062141068279743195,
        0.05958947911858559,
        -0.14050398766994476,
        -0.045067984610795975,
        0.03703401982784271,
        -0.04089098796248436,
        0.12259148061275482,
        0.029034201055765152,
        0.08083302527666092,
        -0.005456691607832909,
        0.028425725176930428,
        -0.0454292856156826,
        0.03785160183906555,
        0.12409929186105728,
        -0.09925307333469391,
        0.02397523634135723,
        0.06339512765407562,
        -0.06548429280519485,
        -0.00800362229347229,
        0.018855789676308632,
        -0.051038023084402084,
        -0.10362391918897629,
        0.003380643902346492,
        0.030406441539525986,
        0.01710403710603714,
        -0.01588970609009266,
        -0.07887487858533859,
        -0.045469980686903,
        0.010804815217852592,
        0.02979949302971363,
        0.0651417076587677,
        0.023753492161631584,
        -0.0508037805557251,
        -0.05644858628511429,
        -0.009651838801801205,
        0.0922885611653328,
        0.0032895172480493784,
        -0.05447116494178772,
        -0.058199428021907806,
        -0.009638604708015919,
        0.059889670461416245,
        0.022011395543813705,
        -0.029432201758027077,
        0.029986649751663208,
        0.04190113767981529,
        -0.012228170409798622,
        -0.012714683078229427,
        -0.008270020596683025,
        -0.004696504678577185,
        -0.0034980166237801313,
        0.05626457557082176,
        0.08771011233329773,
        -0.0892292782664299,
        -0.06419789046049118,
        0.03789995238184929
    ]
}