{
    "id": "NX4BEkNKxUc",
    "title": "YouTube Made Me Review This Budget GPU - GT 1030",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-04-17T17:00:33Z",
    "video_url": "https://www.youtube.com/watch?v=NX4BEkNKxUc",
    "category": "Science & Technology",
    "tags": [
        "GT 1030",
        "Content Gap",
        "NVIDIA",
        "Budget GPU",
        "Graphics Card",
        "RX 580",
        "GTX 1650",
        "GTX 1050 Ti",
        "Modern Games"
    ],
    "views": 2837955,
    "likes": 102675,
    "comments_count": 6796,
    "description": "Join us in War Thunder for FREE at  Get an exclusive bonus using our link - thanks for supporting the channel!  YouTube continues to tell us that we have a content gap when it comes to NVIDIA's GT 1030, so we wanted to answer an age-old question: just how much performance do you get for a hundred dollars on a brand new card these days?  Discuss on the forum:   Buy a Gigabyte GeForce GT 1030 DDR5 OC GPU:  Shop GeForce GT 1030 DDR5 GPUs on eBay:  Buy a GeForce GTX 1050 Ti:  Shop GeForce GTX 1050Ti GPUs on eBay:  Buy a Gigabyte GeForce GTX 1650 GPU:  Shop GeForce GTX 1650 GPUs on eBay:  Buy a 51Risc AMD Radeon RX 580 GPU:  Buy an XFX Speedster SWFT105 AMD Radeon RX 6400 GPU:  Buy a Fractal Design Meshify 2 Black ATX Computer Case:  Buy a CableMod Classic MobFlex 8-Pin PCI-e Extension:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:07 GT 1030 vs Onboard 2:50 GT 1030 vs Alternatives 3:53 Gaming on the GT 1030 7:15 Overclocking 9:04 Conclusion 11:28 Outro",
    "description_links": [
        "https://playwt.link/joinltt",
        "https://linustechtips.com/topic/1501406-youtube-made-me-review-this-budget-gpu/",
        "https://geni.us/rtBDe",
        "https://ebay.us/TGy96k",
        "https://geni.us/OfrVye",
        "https://ebay.us/15vxVn",
        "https://geni.us/eiURo",
        "https://ebay.us/awcgnw",
        "https://geni.us/AoTHc",
        "https://geni.us/6MbBK",
        "https://geni.us/ipP5",
        "https://geni.us/VuIbs",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(moderate music) - Why are we reviewing this? - YouTube says we have a content gap. - [Linus] It's the GT 1030. - Yeah, people keep searching for reviews, and keep asking for it. - You guys actually want us to talk about the GT 1030? You know it came out over five years ago, right? Well, you asked for it. I never wanted to talk about this card, because we recommend against entry level GPUs to the point where we call them manufactured E-waste. But. All right, maybe I was prejudiced this time. The truth is I've never gained on one, or even really looked up performance benchmarks. But you can get these bad boys for about 50 bucks on eBay, or about a hundred dollars brand new. And with the prices of graphics cards these days, along with how great the economy is doing right now, that's a slash S to be clear, it makes sense that you don't have to go too far down the Steam hardware survey to find the star of today's show. But is it any good? Is it even as good as this segue to our sponsor? - War Thunder. Immerse yourself in War Thunder, the free to play online vehicle combat game. Take command of over 2,000 uniquely-modeled vehicles, all fully customizable to your heart's content. Check it out at the link below for a free bonus pack. - I understand how it happens. You need an entry level GPU for the hand-me-down Optiplex your kids picked up and a quick Google search later, you find yourself staring at our friend here, Mr. GT 1030 with two gigs of VRAM, a nearly 1,500 megahertz boost clock and a DVI connector for that old monitor that you refuse to throw away. Hey, no, it still works. Which I guess is kind of the theme today. Probably the most important point on the GT 1030 spec sheet is this. With a 30 watt maximum TDP, it'll get by on less than half of the potential 75 watts that's supplied through a PCI-e slot, meaning no external six or eight pin connectors to plug in. And it's tiny, taking up a single slot, or even a half height single slot. That is great for compatibility. And compared to your core i3's onboard graphics, it absolutely spanks, handily beating poor Intel HD over the head with a stick in every scenario. Our Blender Render goes from over 12 minutes to just under nine. CS GO gets literally over double the frames per second, going from playable to downright decent. Rocket League, same story. And Genshin Impact comes up against it's 60 FPS cap. The really important part though, is these 1% lows. They skyrocket in every title, thanks to the card's dedicated VRAM, and additional processing power, which means a huge difference in perceived animation smoothness. Pretty compelling. That is. (box whistles) (glass breaks) Until you look at basically anything else. For reference, we dug up some comparably-priced used cards. A GTX 1050Ti, and a GTX 1650, both of which are still available new for as low as 180 and $170 respectively. And they give nearly the same thrashing to the 1030 that it does to onboard graphics. But this time for a smaller upcharge. Both of them broke the 300 FPS barrier in CS GO. Rocket League hit the high 200s, and Genshin, well, unsurprisingly, still runs fine. That's what a mobile game will get you. Now, we're gonna try a few more cinematic games for you in a second to see just how bad the GT 1030 is. But I also wanted to mention that the RX 580, a card with eight gigs of VRAM, and a chip that would demolish every card from Team Green that we've tested today is available brand new for as low as 90 bucks. Can I get a shout out for the crypto crash? (people cheering) I mean, seriously, in a world where a 580 costs $90, why is YouTube asking me to make this (beep) video? I just can't even. (scene beeps) Nah, you know what? Let's see how Halo Infinite runs. Seriously? That's it? Okay. Last Of Us Remake. (grunts) Not enough VRAM. While we mentioned the lack of video memory earlier, you might not have registered just how important that is for modern games. Now, four or five years ago when Nvidia released this thing, you could get away with just two gigs, but that's not gonna cut the mustard anymore for more demanding titles. For example, Jedi Survivor launches this month, and lists a GTX 1070, an eight gig card. You know what isn't an eight gig card? Our new couples matching underwear @lttstore.com. And you know what else isn't? The GT 1030. Let's see how many of the most popular games on Steam it can play though. Ooh, wow. This is, this is not a lot of FPSs. - [David] The Top, the flying is the hardest part. - [Crew Member] Yeah, 'cause it's doing the whole map. - Yeah, okay. I mean, in fairness, this is running. 720P, mostly low, but I can see the game and while my FPS is low, okay, around 30, 33 FPS, my 1% lows are also 30 FPS. So at least it's a consistent 30 FPS. Which I would take over a choppy 15 to 40. You know what I mean? This is an eSports title, but it's also one that looks pretty good when you run it on high-end hardware. Oh, I don't have a gun yet and this person probably does. So how do I delay? - [Crew Member] Too late, next game. (laughs) - I'm surprised Resident Evil 4 even launched. The game requirements call for a GPU with four gigs of VRAM and we've got only two. Oh boy. Okay, well, you left motion blur on, ya pleb. - [David] You need it at that little frame rate. - [Crew Member] You really do. - No. You're better off not, no, I will fight you. At this graphical fidelity, the atmosphere of the game is definitely impacted, but hey, if you wanna play through for the story, it is absolutely running. - [Crew Member] At 720. - Yeah, at 720. 720 is a resolution. That's HD. That is high definition. - [Crew Member] Cool, you wanna try another game? - Hm, not bad. And this is at 1080P. I mean, I shouldn't be too surprised. Sifu calls for only a GT 640, but so did Apex Legends, and I needed to go all the way down to 720P for that. I think there's even some film grain effects and everything. Really, seriously? Wow, this is like cranked. Really, you can't turn motion blur off in this game? Oh my god. What is this, Batman Arkham Asylum? - [Crew Member] Kind of. - Okay, what do you want? Destiny? - [Crew Member] Yes, please. - Vampire Survivors. - [Crew Member] I mean, this is gonna work. (laughs) (David laughs) - Let's go. I forget how this works. - [Crew Member] You just run around, you kill stuff and collect the gems, and then as you collect the gems, you unlock new powers and then you become stronger. You gotta point the other way. - Yeah, I know, I was going this way so I could. How am I supposed to get the stuff? - [Crew Member] Oh yeah, this was a great- - [Linus] How am I supposed to get it? - [Crew Member] There you go. - Okay. Man, there's so many games you can play without a high-end GPU. Buying a top tier gaming PC just kind of seems unnecessary. Despite tutorial, that's some 10 years ago game design for sure. Okay, well, either way, this is clearly running more than fine. If you wanna play League Of Legends, Dota, Smite, eSports titles like that, you're not gonna have any issues. But you're not gonna have any issues with really anything else in those titles either. So why are you spending even a hundred dollars? So then it sucks and we were right to ignore it. You should buy a used card, or you should save up for something better. But if it's too late for that, we decided to see what happens if we use the magic of overclocking to squeeze every last penny's worth of value from our bad buy. I wanted to do this test in Halo, but that's not happening. So we're going back to our fan favorite, the one, the only, Shadow Of The Tomb Raider. With our base settings, out of the box, we managed to reach a solid 27 FPS average with 1% lows of 11 FPS. Let's see what we can do with that. Woo-hoo. Hear that fan go? Here we go, boys. Core voltage percent? Ooh, you can do a hundred percent more voltage. Why don't we do a more modest 20? You had luck with- - [Crew Member] Yeah, 200 on the core, and six or 700 on the memory. You can do 600 to be safe. I did get a run with 700, it worked. - [Linus] All right, I'm going 248 and 700. - [Crew Member] Okay, fine. - That's it, here we go. Here we go, Shadow Of The Tomb Raider. What was our result again? - [Crew Member] 27 FPS. - 27. Oh, we're gonna beat that. - [Crew Member] With 1% low of 11. - [Linus] This looks decent. - This is the easiest part of the map. - I know it is. (chuckles) Oh no. - [Crew Member] Why'd you go to 248? - Why did you tell me to do that? If it doesn't make it through this time, I'll just- - [Crew Member] Do 200, okay, sounds good. - [Linus] Oh, wait for it. Here we go. Average FPS, 31. - [Crew Member] That's not bad. - It's a pretty sizable improvement. - [Crew Member] Yeah, it's over 10%. - Let's go. Seriously though, while there are benefits to this card, like the ones we mentioned at the start of the video, low profile, low power consumption, low cost, not to mention it's quiet. For gaming, there are simply too many other options out there that absolutely trounce it. Sometimes even at the same size. Like the RX 6400 for about $50 more. It also barely uses more power with a TDP of about 50 watts, and it's probably just as quiet. So if you have the case space, and a spare eight pin PCI-e connector, please consider literally anything else, 'cause the worst part of this, is we've got the good one, the GDDR5 version. There's a DDR4 variant of this card floating around out there that performs even worse, but trying to get ahold of one and benchmarking it was beyond the scope of this video. So if you wanna look into that, Hardware Unboxed has got you covered with this great video from a few years ago. We're gonna have our variant though, and all of the other cards, the ones you should actually buy, listed in the video description below. So there you go, YouTube, there's your GT 1030 video. Okay? Yes, it has a few limited use cases. Video encoding. Yes, it's better than onboard, but no, it is not enough better than onboard, especially when compared to other options. There are gonna be drawbacks to some of the other cheapest chips alternatives, that RX 580 for a hundred bucks, for example. That RX 580 for a hundred bucks will outperform it, but it will draw much more power while doing so. Realistically, the 1030's ability to launch them at seven FPS is not a lot better. How are you gonna see enemies coming? How will you see this sponsor coming? - War Thunder. Take to the skies, dominate the ground and rule the seas. War Thunder is a PVP vehicle combat game that puts you in control of over 2,000 tanks, planes, helicopters, and ships in fast-paced and immersive battles. Each vehicle is painstakingly modeled after, or inspired by real life counterparts. And you can take that basic model, and use their in-depth customization system to make it unique to your personality. Don't get too attached to your creation though. War Thunder's vehicle damage modeling is so dynamic and detailed, you'll feel the beating you dish out or receive. Each vehicle has it's own mask points. Exploit them and crush the competition. Play for free now with cross play between PC, PlayStation and Xbox. Click the link blow and receive a bonus pack, including premium vehicles and more. - If you guys enjoyed this video, maybe watch our Recycling Your Electronics video because. (techno music)",
    "transcript_keywords": [
        "FPS",
        "game",
        "card",
        "War Thunder",
        "video",
        "low",
        "Yeah",
        "VRAM",
        "play",
        "Thunder",
        "games",
        "War",
        "vehicle",
        "gig card",
        "hundred",
        "good",
        "bad",
        "gigs",
        "cards",
        "years ago"
    ],
    "transcript_entity_values": [
        "Halo Infinite",
        "DVI",
        "one",
        "Sifu",
        "seven FPS",
        "eBay",
        "eight",
        "Hardware Unboxed",
        "over 12 minutes",
        "a few years ago",
        "248",
        "10%",
        "a hundred dollars",
        "GPU",
        "11",
        "1030",
        "15 to",
        "300",
        "War Thunder's",
        "GDDR5",
        "FPS",
        "Xbox",
        "Linus",
        "YouTube",
        "1030",
        "Linus",
        "Apex Legends",
        "half",
        "about 50 bucks",
        "700",
        "GT",
        "TDP",
        "75 watts",
        "Vampire Survivors",
        "4",
        "YouTube",
        "RX",
        "180 and $170",
        "six",
        "eSports",
        "over 2,000",
        "30 watt",
        "Rocket League",
        "as low as 90 bucks",
        "GTX 1070",
        "Intel",
        "CS GO",
        "1030",
        "Optiplex",
        "GT 640",
        "four",
        "Google",
        "four or five years ago",
        "this month",
        "less than half",
        "Genshin Impact",
        "Jedi Survivor",
        "Team Green",
        "five years ago",
        "David",
        "27",
        "720",
        "Batman Arkham Asylum",
        "30",
        "30 FPS",
        "a hundred percent",
        "Genshin",
        "33",
        "about a hundred dollars",
        "Halo",
        "Recycling Your Electronics",
        "1,500 megahertz",
        "60 FPS",
        "some 10 years ago",
        "two",
        "these days",
        "second",
        "600",
        "31",
        "90",
        "today",
        "a hundred bucks",
        "1%",
        "Shadow Of The Tomb Raider",
        "about $50",
        "War Thunder",
        "PCI",
        "about 50 watts",
        "only two",
        "GT 1030",
        "200",
        "GTX",
        "VRAM",
        "Nvidia",
        "PlayStation",
        "6400",
        "580"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "PERCENT",
        "PRODUCT",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL"
    ],
    "vector": [
        -0.08020132780075073,
        -0.04621412605047226,
        -0.01126827485859394,
        -0.057596612721681595,
        0.04850441589951515,
        -0.04961598664522171,
        -0.026916883885860443,
        -0.02234361320734024,
        -0.11837471276521683,
        -0.05847528576850891,
        -0.08989489823579788,
        0.023731887340545654,
        -0.009677725844085217,
        -0.03139293193817139,
        0.030756745487451553,
        0.05185803771018982,
        0.1413794755935669,
        -0.06382869184017181,
        -0.02182515151798725,
        -0.01821035146713257,
        0.028621995821595192,
        -0.07301069051027298,
        -0.009803942404687405,
        -0.032099027186632156,
        0.0033577170688658953,
        0.047453511506319046,
        0.03648023679852486,
        -0.046075671911239624,
        0.009969319216907024,
        -0.034810636192560196,
        0.006061595864593983,
        0.07464710623025894,
        0.012304936535656452,
        0.005787688307464123,
        -0.04213972017168999,
        -0.08710493892431259,
        0.09398241341114044,
        -0.043555863201618195,
        -0.03876487910747528,
        0.005452276673167944,
        -0.0452481247484684,
        -0.017414389178156853,
        -0.030257821083068848,
        0.07712899893522263,
        0.05271875858306885,
        -0.07018804550170898,
        0.008194987662136555,
        -0.025292227044701576,
        0.058654673397541046,
        -0.016414737328886986,
        0.0022196215577423573,
        -0.05125885456800461,
        0.008723479695618153,
        -0.0241045244038105,
        -0.12313432991504669,
        0.03568592667579651,
        -0.03342920541763306,
        -0.11383615434169769,
        0.055343735963106155,
        -0.03941695764660835,
        0.0520060695707798,
        -0.1181860864162445,
        0.035997044295072556,
        0.07619305700063705,
        -0.011854671873152256,
        -0.06258279830217361,
        -0.01599382795393467,
        -0.08194141089916229,
        -0.004806772340089083,
        0.019687969237565994,
        -0.011699664406478405,
        0.06002319976687431,
        -0.04029021039605141,
        -0.016856346279382706,
        -0.017489511519670486,
        -0.016843022778630257,
        0.045784708112478256,
        -0.004254723899066448,
        0.010969032533466816,
        0.049432724714279175,
        0.010283701121807098,
        -0.04256599023938179,
        0.08899109810590744,
        -0.08299825340509415,
        0.05408133566379547,
        -0.036457862704992294,
        0.0571424663066864,
        0.01310576032847166,
        0.01244975533336401,
        -0.11136224865913391,
        -0.0019691248890012503,
        0.07561986148357391,
        0.10531572997570038,
        0.0569671131670475,
        0.042984217405319214,
        0.008809090591967106,
        -0.04017873480916023,
        -0.050127752125263214,
        -0.029486794024705887,
        0.006157926749438047,
        0.006093812175095081,
        0.03759612515568733,
        0.04618547484278679,
        0.010259559378027916,
        -0.07413148880004883,
        0.03713154420256615,
        -0.05718699470162392,
        0.10260425508022308,
        -0.029295701533555984,
        0.046240679919719696,
        -0.047371942549943924,
        0.06820712238550186,
        -0.013760805130004883,
        0.024651076644659042,
        -0.0676090344786644,
        -0.045678962022066116,
        -0.06100673973560333,
        -0.03895847871899605,
        0.07598546147346497,
        0.030489368364214897,
        0.0034502027556300163,
        -0.07551229745149612,
        -0.01847192272543907,
        0.023144356906414032,
        -0.01362551562488079,
        -0.03450598195195198,
        -0.0791613906621933,
        1.169282597862161e-32,
        0.00463729165494442,
        0.05769118294119835,
        -0.07652293890714645,
        -0.04133722931146622,
        -0.005496987607330084,
        0.0842989906668663,
        0.013006376102566719,
        0.019655391573905945,
        0.02753378078341484,
        0.04321041703224182,
        -0.05114775896072388,
        0.046140920370817184,
        -0.042383600026369095,
        0.0799960047006607,
        -0.020658200606703758,
        -0.03399822488427162,
        0.005838379729539156,
        0.011712411418557167,
        -0.049880169332027435,
        0.021284624934196472,
        0.05127974599599838,
        0.09486681967973709,
        0.03266952186822891,
        0.001340271788649261,
        0.004373122937977314,
        0.07910004258155823,
        -0.03659834340214729,
        -0.05209581181406975,
        0.060619402676820755,
        0.021898558363318443,
        -0.024542519822716713,
        -0.19256503880023956,
        0.03257663547992706,
        0.017732584848999977,
        -0.03578461706638336,
        0.06852662563323975,
        0.036736223846673965,
        -0.06012771278619766,
        0.006213275250047445,
        0.016014743596315384,
        -0.07805802673101425,
        0.0934615507721901,
        -0.04986508935689926,
        -0.11757080256938934,
        -0.040235862135887146,
        0.0435510128736496,
        0.03879355266690254,
        -0.006282125134021044,
        -0.0484098345041275,
        0.03870846703648567,
        -0.08517235517501831,
        0.06421775370836258,
        -0.0759158581495285,
        0.03634676709771156,
        -0.006041269283741713,
        -0.05389249324798584,
        0.029628001153469086,
        0.02284475602209568,
        0.05269188433885574,
        0.06546841561794281,
        -0.04356297478079796,
        -0.03565149009227753,
        -0.028477808460593224,
        -0.013166612014174461,
        -0.09844686090946198,
        0.06336565315723419,
        0.02414948120713234,
        -0.008419051766395569,
        -0.07879088073968887,
        0.0998828262090683,
        -0.015510624274611473,
        -0.008959324099123478,
        0.016242312267422676,
        0.0023858416825532913,
        0.09700236469507217,
        -0.02832902781665325,
        -0.03326680138707161,
        -0.0182897187769413,
        -0.015835195779800415,
        -0.045972779393196106,
        -0.06623096019029617,
        0.026812439784407616,
        0.011620738543570042,
        0.08056794106960297,
        -0.021737366914749146,
        0.04040645435452461,
        0.016281813383102417,
        0.08958384394645691,
        -0.010582863353192806,
        0.002122881356626749,
        -0.036718353629112244,
        -0.0014539428520947695,
        0.11881697177886963,
        0.011151967570185661,
        0.048423878848552704,
        -9.686128552073344e-33,
        0.012279788963496685,
        -0.027168450877070427,
        0.0067838020622730255,
        0.11186248064041138,
        0.03839533030986786,
        0.010988454334437847,
        0.015672432258725166,
        0.010597113519906998,
        0.07959581911563873,
        -0.09859351813793182,
        0.007099521812051535,
        0.06498538702726364,
        -0.014825351536273956,
        0.09572690725326538,
        -0.05851706117391586,
        -0.04391670972108841,
        0.0074089691042900085,
        -0.06759337335824966,
        -0.008341479115188122,
        -0.06665568053722382,
        0.07390496879816055,
        0.04694833979010582,
        -0.0018662093207240105,
        -0.04348425194621086,
        -0.0074855568818748,
        0.019406305626034737,
        0.034312766045331955,
        -0.06284058839082718,
        0.04699435457587242,
        -0.008404581807553768,
        -0.05672144889831543,
        0.001133943791501224,
        0.008131706155836582,
        0.024692820385098457,
        0.08417465537786484,
        0.015279187820851803,
        0.08160542696714401,
        0.07115983217954636,
        -0.011040112003684044,
        0.03601471707224846,
        0.029864290729165077,
        0.05577797815203667,
        0.011117459274828434,
        -0.025838863104581833,
        0.03349561244249344,
        0.04523923248052597,
        -0.052233848720788956,
        -0.06980421394109726,
        0.042874276638031006,
        0.0473722368478775,
        -0.02359916642308235,
        -0.018685469403862953,
        0.04379279538989067,
        0.04131266847252846,
        -0.06718790531158447,
        -0.06540980190038681,
        -0.0262900460511446,
        0.04746352508664131,
        -0.013291959650814533,
        -0.04950648918747902,
        0.05211477354168892,
        0.0871848538517952,
        -0.06890244036912918,
        0.001129917218349874,
        0.05273216590285301,
        -0.0037609022110700607,
        -0.014408912509679794,
        0.013610674068331718,
        0.0036079043056815863,
        0.0159761980175972,
        -0.15292559564113617,
        -0.021823512390255928,
        -0.020147649571299553,
        0.005701709073036909,
        -0.04538319259881973,
        0.0770745649933815,
        0.04687047377228737,
        -0.04030625522136688,
        0.08864939957857132,
        -0.002469985280185938,
        -0.06370262056589127,
        -0.038852788507938385,
        0.013242646120488644,
        -0.02737235091626644,
        0.03906518965959549,
        -0.0030802933033555746,
        0.023198038339614868,
        0.0008819288923405111,
        0.07749442756175995,
        -0.07359522581100464,
        0.017258450388908386,
        0.015593981370329857,
        -0.058491986244916916,
        0.015994170680642128,
        0.018004825338721275,
        -5.261604840711698e-08,
        0.008252741768956184,
        0.009564490988850594,
        -0.015746155753731728,
        0.06928329169750214,
        0.034925468266010284,
        -0.013831880874931812,
        0.020404888316988945,
        0.00030134516418911517,
        -0.018475526943802834,
        -0.016657857224345207,
        0.14901946485042572,
        -0.024968428537249565,
        0.0032881360966712236,
        -0.02953394129872322,
        0.02888406813144684,
        -0.018908539786934853,
        0.008404841646552086,
        0.020631855353713036,
        0.052317485213279724,
        -0.011687522754073143,
        -0.014608755707740784,
        0.06490259617567062,
        0.07869123667478561,
        -0.02155008539557457,
        -0.07403841614723206,
        0.017572294920682907,
        0.021811213344335556,
        -0.04586105793714523,
        0.02551587112247944,
        -0.03012518398463726,
        -0.07008561491966248,
        0.03301490470767021,
        0.022559762001037598,
        -0.054034993052482605,
        0.026921357959508896,
        -0.08434657752513885,
        0.0064935083501040936,
        0.11581763625144958,
        0.10352595150470734,
        -0.018412703648209572,
        0.03939856216311455,
        -0.091753751039505,
        -0.019387176260352135,
        -0.03643405809998512,
        0.029011191800236702,
        -0.048243746161460876,
        -0.019615309312939644,
        -0.08288712054491043,
        0.023769253864884377,
        0.0008750890265218914,
        -0.05789332091808319,
        0.02746858447790146,
        -0.05170790106058121,
        0.005513900425285101,
        0.03150467947125435,
        -0.012950543314218521,
        -0.053409796208143234,
        0.05293829366564751,
        -0.016638489440083504,
        0.01588224433362484,
        0.010971459560096264,
        -0.0728878453373909,
        -0.05590891093015671,
        0.005532447714358568
    ]
}