{
    "id": "O042d3FPRZY",
    "title": "REACTING TO NREAL AR GLASSES!! Wow!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-10-17T19:50:31Z",
    "video_url": "https://www.youtube.com/watch?v=O042d3FPRZY",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Nreal AI"
    ],
    "views": 140733,
    "likes": 4840,
    "comments_count": 347,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we are checking out the Nreal Air Glasses. A huge thank you to Nreal for sponsoring this video. Let's unbox them and check 'em out. So I already opened up the little gift box that they gave me and it came with this awesome t-shirt. Like, look at this. This is super cool. I also like, this has a little QR code here. I have a feeling that when I put these glasses on, this might do something cool, but for now we're gonna have to unbox before we test this out. All right, so here's the box. We also have a couple accessories. This is just a lightning to digital AV, so we're gonna be using that for the iPhone. And this is the Nreal adapter, but we're gonna open up the glasses first. (electronic pop music) Oh, they come in a nice little carrying case and everything. Look at that. These are so small, too. (electronic pop music) Whoa, look at these. Like these just look like some basic sunglasses. Like, oh, are you going to the beach? Are you hanging out? No, I'm in the Metaverse. Okay, I can't wait to actually test this out because these already feel like a super high quality. Like they look like normal glasses and just even putting these on, like this is comfortable. There's like a little nose bridge so it doesn't feel like heavy on my head. I feel like every time I'm in sort of a, I guess a virtual environment, any type of headset, it's always so heavy, it's uncomfortable. These just feel like I'm wearing a pair of sunglasses. So here's the glasses. You can see we have the little displays kind of built in right there. You can also adjust these if need be. This is, oh, and I really like this traveling case too. I'm about hop on a flight after this. I'm not gonna lie, these are coming with me. All right, what have we got? Get ready to see Nreal Air. We've got, actually the glasses scan the QR code and download the Nebula app. So they did provide me a phone that already has some of these things installed. And this is the Nebula app. So this is basically our eyes into the Nebula Air. So I'm gonna get this all set up and we're gonna test it out. I'm so excited because this looks like so much fun. Here's the Nreal adapter. Let's open this up. (electronic pop music) There's some more things in the box. So inside the glasses case, we actually have our charging cable, which is USBC, and then inside the box we also have some glasses cover. We also have a few little nose bridge pieces and another little adapter for your glasses here if you have prescriptions. Here we have the adjustable temple so we're able to adjust this depending upon the size of your head. And we also have the microphone, our on and off switch, the brightness button and the spatial sound speaker. And this is actually a light shield, so this blocks all of the light from coming in. So you do need to be careful when you put this on because you're not gonna actually be able to see anything except what is happening inside of your glasses. So here is a USBC cable. This actually isn't a charging cable, so this isn't designed to charge because you don't actually need to charge these glasses. And this is a very specific cable to the Nreal Air glasses so if you do need a replacement, you do have to contact them because you have to use the specific one that was provided with the glasses. Nreal Air has a 46 degree field of view and 49 pixels per degree, which is pretty close to retina level display. This is roughly double the resolution of regular VR glasses. Now this device offers a three DOF head tracking system with high quality imaging with high color performance. It has two 1080p, full HD Sony Micro OLED displays which is equivalent to 201 inch virtual screens. So basically you'll have an IMAX in your pocket and on your face. The audio is also pretty impressive. It has super linear speakers, a base enhancement algorithm, as well as a dual microphone array, omnidirectional men's microphone and noise cancellation capabilities to create a cinema-like audio visual experience. Nreal Air glasses help users make their first step forward into the Metaverse with Nebula. This is Nreal's 3D Operating Environment and there are multi mega size virtual screens in a 3D spatial environment with AR native content, like the AR cycling app for Smart Fitness. This allows users to enjoy stationary cycling in an immersive scenic setting. There'll be lots of new and ongoing surprises with upgrades and expansions as Nreal is continuously unveiling more AR oriented content and AR experiences to build out their entire AR ecosystem. Now, also as an iPhone user, Nreal for Apple users will allow you to use the mirror mode with the Nreal iPhone dongle. So you can view your iPhone apps on 130 inch HG Mobile display at 60 frames per second. Nreal is really great for gamers, movie lovers and AI enthusiasts. Now in mirror mode, you'll be able to game on a 130 inch gaming screen, which is pretty impressive. It also supports cloud gaming, not just on the iPhone but also on Android, Steam Deck, Switch, Xbox, and even PlayStation. In AR mode, you'll have a 200 inch gaming screen and this will work on most mid to high end Android phones. This is perfect for Xbox Cloud gaming. Now for movies, you can watch your favorite content from YouTube, Netflix, Hulu, Disney Plus and even more on a 200 full HD IMAX viewing experience. You can also view YouTube AR. There's spatial browsing so you can take your web browsing to a whole different experience level. You can also teleport into virtual models of real world and places and connect with people all around the world. You can watch existing content and you can even cycle around the world. So fun. Time to try this out. Okay, so the USBC that you wanna plug in is right here in the little earpiece. Oh man, this is surprisingly comfortable. These actually look really good. Okay, I've plugged in my glasses. It's saying allow Nebula to access. Yes, let's do it. Keep the glasses. The unit's being updated. It's being updated. This is so exciting. Oh, like I see right now what my phone is seeing. Oh my god, I'm taking these on my flight tonight. Yeah, I can see you, I see everything. This right here is what the future is. Like this setup, something small. Oh my god. Whoa, what the heck? You don't see this, you don't see this. Oh my god, the whole, every, so my camera is normally there, my phone is my controller. I get to point this around. I wish you guys could see what I'm seeing. This is unfair, this is unfair. This is like somebody who is experiencing virtual reality for the first time, that I've been in it before, but this is a whole different experience. Okay, aim at an object with a laser and I click the touch. It's no secret that I was not the best student in high school. So if I would've had this, I would've been listening to my jams and I would've been cheating up a storm. I don't condone that, but. (laughs) How do I show you guys what I'm seeing? I don't even like, I can't even tell you how cool this is. Like this is so, so sad for you. I'm popping balloons right now. Dude, this is, I'm gonna look like such a loser on the plane. (chill jazzy music) So there's the light blockers because right now I can see everything. Like I can still see through these glasses but if I put these on, this is like a whole new experience 'cause I don't see anything else. Like I don't see through. Okay, so now I wanna try out the mirroring from the iPhone. This is the Nreal adapter. So this little part allows you to use HDMI in. But this, of course, is something I think that we've all seen if we're Apple users. So this is just gonna slide right in like that and then we're gonna attach this to our phone. Now we're gonna plug this into here. (gasps) My iPhone has appeared before my eyes. My iPhone is floating in front of my face. They talked about gaming and why I think this is gonna be awesome is because I always wanna lay down and game. So I can connect this to my Xbox and I'll be able to lay down and play video games 'cause I'll be able to see it right there in front of my face, because like wherever I am, it appears. Oh shoot. The one thing that I am very impressed with is how light this is. I feel like I could wear this for a pretty long amount of time without it feeling uncomfortable. I like these little nose pads. They feel very comfortable as well. The display quality is, it's impressive. Like it seems like if you were to go up to a big screen TV and put your face super close to it, yet be able to focus on the whole screen, like that's what it looks like. It's crystal clear. I just don't even know what to say, like I was so impressed by it. Like this is a surprise to me because I thought it was gonna be cool, but like my expectation was like, yeah, cool, this looks awesome, but my expectation is so far beyond what I thought I was gonna be experiencing because I can still see around me. And then if I wanna kind of close off the world, I can put on the light blockers and you're having a whole new experience. So this is actually really cool. I can't wait to try this out more. So you can also hook up Bluetooth headphones if you do have a pair of headphones that you prefer to wear, you could also use those because obviously this isn't going inside of your ears. It is kind of an outside kind of sound, so other people may be able to slightly hear it. But for the most part, I was pretty impressed how loud it actually was. And Jake over here wasn't even able to really hear it at all. Like you could hear it a little bit, right? Like just slightly? - [Jake] Like 5% of what I imagine you're hearing. - Yeah, so he said it was probably about 5% of what I was actually hearing. So if you are on a plane or something like that and you want to have it complete silence for your seat neighbors, I honestly don't think that they would even be able to hear it to be completely honest with you. The other thing that is kind of cool about this is how low profile it is. Like if you've ever put on any other VR headsets, like they're really big, like that's not something that you're gonna take on a plane. And the fact that you don't actually have to charge the glasses themselves, that they are just operating through whatever device you're using, is kind of cool. So that's an extra thing, that you don't have to worry about charging. It just works. I just wanna be in here for always. Well my friends, that was just a first look at the Nreal Air and I feel really bad that you guys aren't able to experience what I'm experiencing. Like I don't even know how to show you what I'm seeing because it's just so impressive how clear the video quality is when I'm looking. Well, thank you guys so much for watching. I'll put a link in the description if you wanna get more information or to purchase the Nreal Air. This was such a cool experience and I look forward to checking this out more, playing some games and of course watching a ton of content. If you guys haven't already, please subscribe and hit the bell to be notified when I post new videos and I'll see you guys in the comments below. Bye. (electronic pop music)",
    "transcript_keywords": [
        "Nreal Air Glasses",
        "Nreal Air",
        "Nreal",
        "Glasses",
        "Justine and today",
        "Air Glasses",
        "Air",
        "Nreal adapter",
        "cool",
        "experience",
        "iPhone",
        "Nebula",
        "feel",
        "Justine",
        "put",
        "guys",
        "Nebula Air",
        "kind",
        "Nreal iPhone",
        "gaming"
    ],
    "transcript_entity_values": [
        "Xbox Cloud",
        "130 inch",
        "Nreal Air",
        "second",
        "HG Mobile",
        "the Nreal Air Glasses",
        "one",
        "Jake",
        "the Nreal Air",
        "200 inch",
        "DOF",
        "the Nebula Air",
        "about 5%",
        "Apple",
        "Justine",
        "tonight",
        "Disney Plus",
        "IMAX",
        "5%",
        "Android, Steam Deck",
        "AV",
        "iPhone",
        "USBC",
        "three",
        "PlayStation",
        "49",
        "Nreal",
        "3D Operating Environment",
        "a ton",
        "46 degree",
        "YouTube",
        "Xbox",
        "Smart Fitness",
        "IMAX",
        "Netflix",
        "200",
        "today",
        "YouTube AR",
        "Nreal Air",
        "60",
        "Android",
        "Hulu",
        "first",
        "two 1080p",
        "Nreal iPhone",
        "201 inch",
        "VR",
        "Nebula",
        "the Nreal Air"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "FAC",
        "QUANTITY",
        "ORG",
        "FAC",
        "PERCENT",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "FAC",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.03481324389576912,
        -0.07536541670560837,
        -0.06374683976173401,
        -0.10067716240882874,
        0.016025863587856293,
        -0.007112598046660423,
        0.08768206089735031,
        -0.015962671488523483,
        -0.02017497643828392,
        0.07994862645864487,
        -0.04409940168261528,
        0.028492087498307228,
        -0.012206586077809334,
        0.042362280189991,
        -0.020586106926202774,
        0.023553170263767242,
        -0.0010841997573152184,
        -0.04578150063753128,
        0.006753129884600639,
        0.05655631050467491,
        -0.008847967721521854,
        -0.04047823324799538,
        0.002776569686830044,
        -0.02012663707137108,
        0.00767936697229743,
        0.08206880837678909,
        0.023844176903367043,
        0.017283862456679344,
        -0.0892103984951973,
        -0.08923203498125076,
        -0.013872685842216015,
        0.008826802484691143,
        0.08886715024709702,
        -0.03161080554127693,
        -0.0054426840506494045,
        -0.06587910652160645,
        0.006143784616142511,
        0.015029685571789742,
        -0.042796406894922256,
        0.0013929045526310802,
        0.0006882628076709807,
        -0.03773098066449165,
        -0.029186075553297997,
        -0.054828889667987823,
        -0.047371041029691696,
        -0.0628635436296463,
        0.02126295678317547,
        -0.028541751205921173,
        0.028251973912119865,
        0.05014180392026901,
        -0.11688898503780365,
        -0.03354524075984955,
        0.0203341506421566,
        -0.030554791912436485,
        -0.015302501618862152,
        0.0004188870661891997,
        -0.11748289316892624,
        -0.006550343707203865,
        0.044857826083898544,
        -0.08551652729511261,
        0.04590150713920593,
        -0.06162070110440254,
        -0.017634538933634758,
        0.05213629826903343,
        -0.0855523869395256,
        -0.023072073236107826,
        0.0515064038336277,
        0.017276199534535408,
        0.03128451108932495,
        0.011777283623814583,
        -0.09717464447021484,
        0.07285210490226746,
        -0.0035184070002287626,
        0.0031267600134015083,
        0.0061935256235301495,
        0.05695608630776405,
        0.06242974102497101,
        -0.10777459293603897,
        0.022654009982943535,
        0.07864061743021011,
        0.05069410800933838,
        -0.030087623745203018,
        -0.05541881546378136,
        -0.020751243457198143,
        0.007093532010912895,
        0.04709145426750183,
        0.01316773146390915,
        -0.016214042901992798,
        -0.030722735449671745,
        -0.08856305480003357,
        -0.059607215225696564,
        -0.005097686313092709,
        -0.017234517261385918,
        -0.021202070638537407,
        0.016959358006715775,
        -0.052926138043403625,
        -0.03431187942624092,
        -0.07068390399217606,
        -0.03247518464922905,
        0.06471621990203857,
        0.08229381591081619,
        -0.0568019300699234,
        0.0028577367775142193,
        -0.03022286482155323,
        -0.04312413930892944,
        -0.07741013914346695,
        -0.017393775284290314,
        0.026683872565627098,
        -0.003713803831487894,
        0.037209704518318176,
        -0.03686409071087837,
        0.06169662997126579,
        -0.05186179652810097,
        -0.051035959273576736,
        -0.02454705722630024,
        0.11535894125699997,
        -0.016317889094352722,
        0.061653390526771545,
        0.04575200006365776,
        -0.004730170592665672,
        -0.029979808256030083,
        -0.05748845636844635,
        0.027249004691839218,
        0.07851356267929077,
        0.045482054352760315,
        0.040171559900045395,
        -0.048593275249004364,
        1.284593010079661e-32,
        -0.029335234314203262,
        0.09950590133666992,
        -0.018237046897411346,
        0.035883162170648575,
        0.007091996259987354,
        -0.033626995980739594,
        -0.03775085508823395,
        0.07636731117963791,
        0.02288614585995674,
        0.007886935956776142,
        -0.013602028600871563,
        0.0669482946395874,
        -0.027158591896295547,
        0.011316082440316677,
        0.03690111264586449,
        -0.042292412370443344,
        -0.016228804364800453,
        0.01627105101943016,
        -0.10848171263933182,
        0.023181410506367683,
        -0.026653466746211052,
        -0.03217471390962601,
        -0.004451993852853775,
        0.12211673706769943,
        0.07162605226039886,
        0.09416776895523071,
        0.06466413289308548,
        0.0009502756292931736,
        0.05335257947444916,
        0.007016704883426428,
        0.005762025248259306,
        0.00962830986827612,
        -0.016895657405257225,
        -0.06355655193328857,
        -0.021052051335573196,
        -0.003924358170479536,
        -0.0621582455933094,
        0.03902861103415489,
        -0.022094430401921272,
        -0.04371059685945511,
        -0.03900708258152008,
        0.0695575624704361,
        -0.0365004763007164,
        -0.021257558837532997,
        0.0627562552690506,
        0.0268907081335783,
        0.006182100158184767,
        0.12425023317337036,
        -0.0700378268957138,
        0.04148748517036438,
        -0.03818947821855545,
        -0.02113846316933632,
        -0.04649705812335014,
        0.033960022032260895,
        -0.014308818615972996,
        -0.055824507027864456,
        -0.05163492262363434,
        0.05029241740703583,
        0.07107029110193253,
        -0.028948526829481125,
        0.012425122782588005,
        -0.05360689386725426,
        -0.003223482519388199,
        -0.02213866077363491,
        -0.05038861930370331,
        0.06589288264513016,
        0.05908380448818207,
        -0.02126367948949337,
        0.021710006520152092,
        0.0450836606323719,
        0.03715232014656067,
        0.012364315800368786,
        0.025996506214141846,
        0.0015544160269200802,
        0.03413558378815651,
        0.04881933704018593,
        -0.07487547397613525,
        -0.021319806575775146,
        0.04689925163984299,
        -0.027137447148561478,
        -0.1140657365322113,
        0.07641205936670303,
        0.007372939959168434,
        0.046128831803798676,
        -0.024683063849806786,
        -0.08986923098564148,
        0.02598007582128048,
        -0.06417686492204666,
        -0.03703051805496216,
        -0.010032196529209614,
        0.01386156678199768,
        0.03972429782152176,
        -0.10035134851932526,
        -0.0624421201646328,
        -0.04513346403837204,
        -1.196168871996153e-32,
        0.07580894976854324,
        -0.0015256142942234874,
        0.0025665999855846167,
        -0.03133324533700943,
        0.007905447855591774,
        -0.05083267763257027,
        0.07743420451879501,
        0.11817581206560135,
        0.08513027429580688,
        -0.11382093280553818,
        0.08643850684165955,
        -0.02888837270438671,
        -0.12116824835538864,
        0.013966197147965431,
        -0.01680862531065941,
        -0.07539407163858414,
        0.022958746179938316,
        -0.029760297387838364,
        0.05956597253680229,
        0.0016133493045344949,
        0.0886458083987236,
        0.07457565516233444,
        0.06683453172445297,
        0.01643056981265545,
        0.01615387760102749,
        0.03204488381743431,
        0.023969726637005806,
        -0.004794467240571976,
        0.008137958124279976,
        0.028089743107557297,
        0.026829542592167854,
        -0.017531415447592735,
        -0.03857766091823578,
        0.029249858111143112,
        0.04358694702386856,
        0.0684923306107521,
        0.017707768827676773,
        0.042413268238306046,
        -0.04557880386710167,
        -0.10426919162273407,
        0.05190331116318703,
        0.04765388369560242,
        -0.0053048040717840195,
        -0.018008114770054817,
        0.012672076001763344,
        -0.12315699458122253,
        -0.0277466531842947,
        0.018069854006171227,
        -0.022098977118730545,
        -0.05529986694455147,
        -0.05939106270670891,
        -0.06445174664258957,
        0.015261821448802948,
        -0.045634809881448746,
        -0.033435553312301636,
        -0.02272246778011322,
        -0.03666085749864578,
        0.005660808179527521,
        0.026779262349009514,
        0.025336192920804024,
        0.03863658010959625,
        -0.01605839654803276,
        -0.07620023936033249,
        -0.08969151973724365,
        -0.014893599785864353,
        -0.03009943477809429,
        0.0853717178106308,
        0.03521368280053139,
        0.02976776845753193,
        0.022491388022899628,
        0.04047280177474022,
        0.022488579154014587,
        0.03735734149813652,
        0.0266229510307312,
        0.051962710916996,
        -0.01237588468939066,
        -0.036603894084692,
        0.029138755053281784,
        0.07531470060348511,
        -0.04675033688545227,
        -0.036676716059446335,
        -0.009100313298404217,
        0.01529858261346817,
        0.12561315298080444,
        0.04070314019918442,
        0.097184918820858,
        0.09496674686670303,
        -0.06566093116998672,
        -0.024017058312892914,
        0.07496672123670578,
        -0.013876494951546192,
        0.06435464322566986,
        0.04637973755598068,
        0.10856848955154419,
        -0.0671398937702179,
        -6.142839481526607e-08,
        0.0434003584086895,
        0.05814553424715996,
        -0.02921738661825657,
        0.023618105798959732,
        0.000544611073564738,
        -0.06375773251056671,
        -0.059829939156770706,
        0.022505229339003563,
        0.010413343086838722,
        -0.10093653202056885,
        0.07538001239299774,
        0.018557287752628326,
        0.02751881442964077,
        0.08659442514181137,
        0.043920207768678665,
        -0.00017090575420297682,
        -0.0726306140422821,
        0.06068926677107811,
        -0.05810459330677986,
        -0.055177241563797,
        -0.04221859946846962,
        0.0590708963572979,
        0.0416710339486599,
        0.013107974082231522,
        0.04163429141044617,
        0.0683104544878006,
        -0.0074239447712898254,
        -0.03603209927678108,
        0.060292959213256836,
        0.021518098190426826,
        -0.037849873304367065,
        -0.0008037558291107416,
        0.008860056288540363,
        0.0315149761736393,
        -0.07408497482538223,
        -0.0349227711558342,
        -0.05243953317403793,
        0.021051248535513878,
        0.036188699305057526,
        -0.01996336504817009,
        -0.06195751205086708,
        -0.16227267682552338,
        -0.0241499375551939,
        0.0038844856899231672,
        -0.013837994076311588,
        -0.07411908358335495,
        0.03157613426446915,
        -0.09031569212675095,
        -0.03483409434556961,
        -0.03863856568932533,
        -0.038352951407432556,
        0.05719667673110962,
        0.021632831543684006,
        -0.028914792463183403,
        0.006167096551507711,
        -0.05811430513858795,
        0.07588460296392441,
        0.029599379748106003,
        -0.006870785728096962,
        -0.02062942646443844,
        0.03960246592760086,
        -0.00352497142739594,
        -0.10150929540395737,
        0.0692291259765625
    ]
}