{
    "id": "O1jpck31Ask",
    "title": "iPhone and Android WiFi Man-in-the-middle attack // PYTHON Scapy scripts for attacking networks",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-11-12T15:01:04Z",
    "video_url": "https://www.youtube.com/watch?v=O1jpck31Ask",
    "category": "Science & Technology",
    "tags": [
        "python",
        "scapy",
        "arp",
        "arp mitm",
        "arp mitm attack",
        "iphone",
        "apple",
        "android",
        "samsung",
        "android phone",
        "ios",
        "apple ios",
        "apple iphone",
        "kali linux",
        "ceh",
        "oscp",
        "wifi hacking",
        "ethical hacking",
        "scapy python",
        "scapy python3",
        "public wifi",
        "python scapy",
        "kali linux python",
        "scapy sniffing",
        "arp spoofing",
        "arp poisoning",
        "man in the middle",
        "scapy python pcap",
        "wireshark",
        "scapy in python",
        "scapy python script",
        "scapy python sniff",
        "man in the middle attack",
        "arp spoofing attack",
        "arp spoofing linux",
        "cisco",
        "ccna"
    ],
    "views": 342206,
    "likes": 15382,
    "comments_count": 370,
    "description": "Simple Python script to run a man in the middle attack on a WiFi network   You need to learn to code! Learn Python. Learn Networking. You are going to be very powerful and very scary if you combine knowledge of networking with Python scripting! But, do good.  Learn to code. Learn Linux. Learn Networking.  // MENU // 0:00    Introduction 1:01    Man in the middle attack 1:37    Network setup 2:02    iPhone Private MAC Addresses 2:44    ARP Posioning 3:11    Script overview 3:26    Linux IPv4 forwarding 4:22    Warning! 5:21    Kali WiFi Setup 5:44    Kali Script and command format 7:02    Run ARP MITM script 8:15    Issues with MITM attacks 9:15    Capture username and password 10:34  Follow TCP stream 11:10  Prove that MAC addresses have changed 13:15  What about Internet Traffic 13:55  VPN company advertisement warnings   // SCRIPTS // Python ARP MITM:   Playlist:   // SCAPY RESOURCES // Website:  Documentation:   // SCAPY INSTALLATION // sudo apt update sudo apt install python3-pip sudo pip3 install scapy  // SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  python iphone android samsung arp wifi  wifi arp arp mitm mitm wifi wifi mitm python mitm python arp scapy python scapy ccna cisco routers ccna 200-301 python scripts kali linux linux kali kali linux 2021.3 kali linux 2021 oscp ceh security+ pentest+  Disclaimer: This video is for educational purposes only. I own all equipment used for this demonstration. No actual attack took place on any websites.  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #wifi #hacking #mitm",
    "description_links": [
        "https://davidbombal.wiki/arpmitn",
        "https://davidbombal.wiki/scapy",
        "https://scapy.net/",
        "https://scapy.readthedocs.io/en/latest/",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- Before we get started, this video is not sponsored by a VPN provider. In this video, I'm going to show you how to use a Python script to intercept traffic sent from a phone to its default gateway on a Wi-Fi network. In other words, if you went to a coffee shop and you're using their Wi-Fi network as an example, all your traffic sent to the internet would be captured by my Kali virtual machine or Kali PC, depending on if you're using bare metal or not with a Python script. Now there are applications out there that do this, but I want to show you that if you understand Python, if you understand how to write scripts using Python and Scapy, you can do a whole bunch of things. In this series of videos, I've shown you how to attack many protocols. I've shown you how to attack EIGRP, BGP, spanning tree, a whole bunch of protocols. And this is just another example of that, where I'm attacking ARP. ARP is used on ethernet networks. ARP is used on Wi-Fi networks. This allows you to run a man-in-the-middle-attack where you can see all traffic send from one device to another on the local segment or the Wi-Fi network. Now this script has taken a lot of time and a lot of effort to put together. If you enjoy these types of ethical hacking videos, if you enjoy these type of ethical hacking content, please consider subscribing to my YouTube channel, please like this video and click on the bell to get notifications so that you know when I upload a new video, that really does help me with a YouTube robots. Okay, without further ado, let me show you how you can intercept traffic using the script. (upbeat music) In this example, I'm running Kali within a virtual machine on a Windows computer. This Windows laptop is connected to the Wi-Fi network. This iPhone is connected to the same Wi-Fi network. By default, when sending traffic to the internet, as an example, or to another device on the network, the phone is going to send the traffic to either the device directly in the network or to its default gateway. So in this example, if I have a look at my Wi-Fi settings, you can see that I'm using a private MAC address. One of the updates that apple made to better secure iPhones, as an example, is to use random or private MAC addresses, which change all the time. Can see the IP address of this device is 192. 168.1.132, default gateway or router 192.168.1.249. So if this iPhone was sending traffic to a website such as, Facebook or Google or another website, it would send it to that IP address. And to do that, it will send a opera request onto the network requesting the MAC address of this device and then it will send traffic to that MAC address directly. So for this laptop to see the traffic sent from the iPhone to its default gateway, we going to run ARP poisoning and poisoned the ARP cache of both the phone and its default gateway, in other words, the router, so that traffic is sent via the laptop to the default gateway. So rather than traffic going directly to its default gateway, the phone will send traffic to the route of via this Kali virtual machine. Now, the script that we using is fairly complicated, but we've put a lot of comments in the script to make it easier to understand. So hopefully by reading the comments in the script, it will make a lot of sense to you. Most of the script is simply comments explaining what each line of code does. One of the things we need to do as an example is set up a Linux to forward traffic. So when traffic hits the Linux virtual machine or computer if you're using a physical device, we need to forward that on to the default gateway. So traffic needs to be bridged or forwarded through this virtual machine. And hence we've got the command ipv4.ip_forward=1 We want to forward traffic through the virtual machine. There's a whole bunch of other code here. It's a fairly complicated script, but hopefully the comments in the script will make it a lot easier to understand. Now, there are examples online showing you how to run a man-in-the-middle-attack using Python and Scapy. But a lot of them don't seem to work properly with devices such as iPhones. So this works with an iPhone and various other devices. We were able to intercept all traffic for all devices that we tested. Let me know if it works for you. Now, as always, a warning. What I'm sharing here is for educational purposes only, please do not use the script in Starbucks or some other Wi-Fi network and get into trouble. You should only use scripts such as these or other ethical hacking tools ethically. So only test this on Wi-Fi networks that you own, only test this on Wi-Fi networks that you have permission to attack. In this example, I'm using my own Wi-Fi network. So all the devices that I'm using here are devices that I own, my iPhone, my laptop, my Wi-Fi network. I need to say this, unfortunately, just to be on the safe side. So disclaimer, this is for educational purposes only. Do not go out there and get into trouble. Don't do something that you shouldn't do. Make sure that you only test this on networks that you own or have permission to attack. Okay, so once again, I've put a lot of comments in the code here. I'm not going to explain every single line of code because that'll take a long time. So what I'll do is copy the script. In Kali, this is running within a virtual machine. I'll go to manage virtual machine settings. And what you'll see is I've breached the network adapter to the Wi-Fi network within this laptop. This laptop is only connected to the Wi-Fi network. It's connected to no other networks. Okay, so in Kali, I'll open up a terminal and I'll create a script called arphack1.py. And I'll paste that script in, Ctrl + X, and I'll save that script. Now notice the format of the command that you need to use. If you don't do that, you'll be prompted to use the right command. So as an example, I just type python3 arphack1.py, the script's going to tell us that we need to use sudo when running this command. So we've tried to add a lot of help information to make it easier to run the script. And notice we told that we need a valid IP range. So the correct format for my local network is going to be this command, sudo python3, the script name, whatever you decide to call that, -ip_range and the range that you're going to use. So I'll paste that in. This is my local subnet. You can see that once again on the iPhone 192.168.1.132 is the IP address. You can see the Subnet Mask, 255.255.255.0 is a slash 24 mask. Router is 192.168.1.249. So I'll press enter. Scrolling up. There's the command that we used. We can see that the sub-net that's going to be checked is 192.168.1.0/24. That's a valid range. Linux forwarding of traffic has been enabled. We've got a little banner here and then it shows us various MAC addresses and IP addresses that have been discovered in the network. Okay, so the IP address of this device is 192.168.1.132. That's this device. And the MAC address has been correctly discovered. MAC address here is BE:87:55:CE:46:DF. So that's the private MAC address that's been discovered. So I'm going to use the command 25 because that's the device that I want to intercept. So traffic for 25. And we've told that information has been written to pcap file. What I'll do now is run wire shock and see what traffic we capture. So I'll get wire shock to (indistinct). You can see a whole bunch of traffic is being intercepted, but for this test, I'll use Telnet. Now, one of the problems with man-in-the-middle-attacks is a lot of traffic today is actually encrypted. But just to prove the point I'm going to use Telnet, which has clear text, and I'm going to connect to the router. As you can see now, traffic is already being captured. And if we look at the wire shock capture, we can see the actual Telnet information. So hopefully what we'll see is a prompt. And there you go. Username verification, that's what we see on the phone. And we asked to enter our username. I'll enter the username here, which is Peter. And I'll enter a password of Cisco, this a Cisco router. Obviously you don't want to use a password like that. Show version, that will show us the version of operating system that this router is using. That has all been captured by wire shock running within Kali, within a virtual machine on this Windows laptop. Traffic is being sent to via that laptop. Now, can we see the username? We can see here that we are prompted for username and we can see P-E-T-E-R as a username. And then we can see the password prompt, and then we can see the password of Cisco displayed there. Now that's not so easy to read, so I'll right-click and then say, follow TCPStream. And what we can see now is the whole TCPStream. Now, what you'll notice is the username is repeated and that's because we are capturing traffic from the phone to the router, and then from the router back to the phone. So we see both the packet that was sent P and the echo. So what you may notice is there's different colors here. We've got blue and red. So P being sent to the router and then red is the echo back. So we've got the username Peter. Password wasn't echoed back by the router so we see the password just once, Cisco, and then we see the output of the router. Now this is my real home router. So I won't type every command that's possible and show you the passwords, et cetera, of my real accounts. This is just a quick fake account. But show IP interface brief, shows me the interfaces on this router. And once again, if I typed follow TCPStream, I should see all the information about the version of operating system that the routers is using. Plus here we go, show IP interface brief, and the interfaces on the router. I have successfully been able to capture traffic from this phone to the router on the local segment. So this is an ARP attack, traffic from the phone to the router is going through the Kali virtual machine. And let's just prove that all connect to the router, directly. And I'll log in with my proper username, David. Show ARP will show us the ARP cache on the router. And if we look for 192.168.1.132, which is the phone, what you'll notice is the MAC address of the phone is different to the MAC address that the router is seeing. So the ARP cache of the router is saying that this IP address uses this MAC address, but that's actually not the MAC address of the phone. So to prove this let's stop our script. So I'll press Ctrl + C to break the script. And then on the router, show ARP, and I'll just include 132. That MAC address should change to this MAC address. So what I'll do is open up a browser and go to a website such as kali.org. Now it may take a while for the ARP cache to timeout. Notice it's still using the old MAC address. If I type clear ARP and let's just press Enter there. Show ARP pipe include 132. Notice the MAC address is updated. Now it's showing the correct MAC address of BE ending in DF. ARP caches can take a while to be flushed and to be updated. But in that example, notice the MAC address has successfully updated, but let's run the script again. And we want to do 132. So in this case, it's 24 on the router. Notice MAC address has changed. So the router is no longer sending traffic to the MAC address of the phone, it's sending it to the MAC address of the Kali virtual machine. Okay, so there you go. I've now shown you how to poison the ARP caches of devices in your network to run a man-in-the-middle-attack so that a Kali virtual machine can capture all the traffic sent from a phone to its default gateway. Now this will apply to traffic sent to the internet. The problem that you're going to encounter is that a lot of traffic sent from a device to the internet is encrypted. We typically use HTTPS or SSL these days or other encrypted protocols. So even if you capture the traffic using a man-in-the-middle-attack, doesn't mean that you're going to be able to read all the traffic sent to the internet because the traffic is encrypted. And this is why you have to be careful with some of the advertising of VPNs that you see on the internet. Some people will say, you should use a VPN because you need to be protected when you're in a cafe and you using the Wi-Fi hotspot. There's some truth in that because I am capturing the traffic, but the traffic is encrypted. So VPN doesn't always help you because generally traffic today is encrypted. Very few websites today are using HTTP. Most are using HTTPS. You don't want to connect to websites that are using HTTP or use protocols, such as Telnet, which are clear texts. You want to use SSH or HTTPS or encrypted protocols. Now VPN can give you an added level of protection, if you like, because you now sending SSL down a VPN connection. It's all about trust. Do you trust the Wi-Fi network? Do you trust that they won't be people like me hanging around trying to intercept your traffic? Or do you trust the VPN provider? I think for a lot of us, we would prefer to trust a VPN provider, some of the big ones and send out traffic to a VPN provider rather than just using the Wi-Fi network with no added protection. But be aware that traffic is encrypted. So these man-in-the-middle- attacks aren't as potent or as powerful as they used to be. (upbeat music)",
    "transcript_keywords": [
        "MAC address",
        "traffic",
        "MAC",
        "WiFi network",
        "address",
        "ARP",
        "router",
        "script",
        "network",
        "Kali virtual machine",
        "WiFi",
        "virtual machine",
        "Kali",
        "Kali virtual",
        "phone",
        "Python",
        "Python script",
        "default gateway",
        "private MAC address",
        "virtual"
    ],
    "transcript_entity_values": [
        "python3",
        "Starbucks",
        "these days",
        "Linux",
        "Facebook",
        "SSH",
        "25",
        "192.168.1.249",
        "192.168.1.132",
        "Cisco",
        "Wi-Fi",
        "ARP",
        "VPN",
        "Router",
        "One",
        "SSL",
        "iPhones",
        "BGP",
        "192",
        "YouTube",
        "iPhone",
        "Google",
        "today",
        "David",
        "IP",
        "Notice MAC",
        "Kali",
        "Python",
        "EIGRP",
        "one",
        "Linux",
        "HTTPS",
        "MAC",
        "192.168.1.249",
        "132",
        "TCPStream",
        "ARP",
        "Cisco",
        "Peter",
        "DF",
        "24",
        "192.168.1.0/24",
        "VPN",
        "the Wi-Fi",
        "TCPStream",
        "Windows",
        "Wi-Fi"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "LOC",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.06026216596364975,
        -0.002175408648326993,
        0.01652638614177704,
        -0.05415528640151024,
        -0.0070501347072422504,
        -0.0262497179210186,
        0.015925807878375053,
        -0.05311205983161926,
        -0.045414749532938004,
        0.03063826635479927,
        0.04450587183237076,
        0.002014326862990856,
        0.06633961200714111,
        -0.0017563437577337027,
        0.025705114006996155,
        0.008614698424935341,
        -0.05765659362077713,
        -0.03333131968975067,
        0.06437099725008011,
        -0.06838587671518326,
        -0.014152925461530685,
        0.08710966259241104,
        0.018502026796340942,
        -0.036956679075956345,
        0.020067133009433746,
        -0.015737343579530716,
        0.0745251476764679,
        0.0029940898530185223,
        -0.08746209740638733,
        0.039329513907432556,
        0.022899897769093513,
        0.03767125681042671,
        -0.03625041991472244,
        0.021421140059828758,
        -0.0291121955960989,
        -0.04562288522720337,
        -0.02820407971739769,
        0.08779264241456985,
        -0.0006811938364990056,
        -0.03354514017701149,
        -0.027132827788591385,
        -0.014332523569464684,
        0.0017763659125193954,
        0.05587613582611084,
        -0.049354348331689835,
        0.06250877678394318,
        -0.05922362953424454,
        0.01598540134727955,
        0.010570353828370571,
        -0.07857382297515869,
        0.017375366762280464,
        -0.00046950014075264335,
        0.014302395284175873,
        0.0003792541683651507,
        0.01606820523738861,
        -0.042824577540159225,
        -0.08996501564979553,
        0.004893478471785784,
        0.1182207465171814,
        -0.043960653245449066,
        -0.03429069742560387,
        0.011964088305830956,
        -0.008455452509224415,
        0.055295199155807495,
        0.0206092968583107,
        -0.0478065051138401,
        -0.016101542860269547,
        0.0820084884762764,
        0.06062964349985123,
        0.11628790199756622,
        0.017718572169542313,
        -0.0015550805255770683,
        0.0016017996240407228,
        0.024274058640003204,
        0.030863402411341667,
        -0.029775334522128105,
        0.001213818322867155,
        -0.03552320599555969,
        -0.09504799544811249,
        -0.00823769997805357,
        0.05065012350678444,
        -0.013486810028553009,
        -0.03397684171795845,
        0.06752672791481018,
        -0.00688491715118289,
        0.021160481497645378,
        -0.035950399935245514,
        0.051199398934841156,
        0.019943853840231895,
        0.07030210644006729,
        0.023215148597955704,
        0.01739497110247612,
        -0.006608486175537109,
        0.0019873452838510275,
        0.07808948308229446,
        0.053363826125860214,
        -0.050721053034067154,
        -0.04590384662151337,
        -0.1280062198638916,
        0.06755395233631134,
        0.021175600588321686,
        -0.046700216829776764,
        -0.006607016082853079,
        -0.06818079948425293,
        0.1317140758037567,
        0.007614174857735634,
        0.04911951348185539,
        -0.044856395572423935,
        0.02155488170683384,
        0.13337697088718414,
        -0.006503809709101915,
        -0.07981199771165848,
        -0.037529636174440384,
        -0.10312899202108383,
        0.044774968177080154,
        0.08870948106050491,
        0.07726754993200302,
        0.10075316578149796,
        -0.0009739179513417184,
        0.05442878603935242,
        0.037547845393419266,
        -0.020023029297590256,
        -0.05078412592411041,
        -0.002417868236079812,
        0.0072171068750321865,
        0.014733027666807175,
        0.03709573671221733,
        7.524325380618046e-33,
        0.029996156692504883,
        -0.012136314064264297,
        -0.05247746407985687,
        0.010411967523396015,
        0.036434825509786606,
        -0.07461090385913849,
        0.07537233829498291,
        0.0399385429918766,
        -0.034614432603120804,
        -0.020448563620448112,
        -0.06298117339611053,
        -0.019307835027575493,
        0.008266895078122616,
        -0.024678459390997887,
        -0.004024491645395756,
        0.014517905190587044,
        -0.020763736218214035,
        -0.030262570828199387,
        0.04220575466752052,
        0.08248750865459442,
        -0.0354933924973011,
        -0.09189960360527039,
        -0.002546687377616763,
        -0.047338467091321945,
        0.007878311909735203,
        -0.0015218880726024508,
        -0.03067670576274395,
        -0.03126806393265724,
        0.034711096435785294,
        0.004876574035733938,
        -0.04936186969280243,
        -0.003261640900745988,
        -0.08629830926656723,
        -0.02442830801010132,
        -0.03497685119509697,
        -0.030652325600385666,
        -0.04674094170331955,
        -0.07839207351207733,
        -0.005426627118140459,
        -0.010504279285669327,
        -0.08588443696498871,
        -0.006905209738761187,
        -0.06281580775976181,
        -0.011500394903123379,
        0.042141228914260864,
        -0.016997024416923523,
        -0.09711337089538574,
        0.04876049607992172,
        -0.04212215170264244,
        0.0576004758477211,
        -0.03281695395708084,
        0.0029213200323283672,
        0.04324366897344589,
        -0.07323914766311646,
        -0.028124749660491943,
        0.06181978061795235,
        0.06731215119361877,
        0.005142519250512123,
        -0.037879232317209244,
        0.036378126591444016,
        -2.508538273104932e-05,
        0.021428458392620087,
        0.004493256099522114,
        0.027844509109854698,
        -0.0020635295659303665,
        -0.033375971019268036,
        -0.057468265295028687,
        -0.010525605641305447,
        -0.012842853553593159,
        0.03884824365377426,
        -0.05313345417380333,
        0.008226465433835983,
        0.03230050206184387,
        0.07410214096307755,
        -0.004779396578669548,
        0.04397132992744446,
        0.03373625501990318,
        0.04416021704673767,
        -0.01720614917576313,
        0.007873731665313244,
        0.062344327569007874,
        0.031928714364767075,
        0.062107134610414505,
        0.0015116367721930146,
        0.006105496548116207,
        -0.04587448388338089,
        0.005528506822884083,
        -0.09424422681331635,
        -0.049415796995162964,
        0.15749257802963257,
        -0.03400454297661781,
        0.00653210049495101,
        -0.0010264875600114465,
        0.04186992347240448,
        -0.09157055616378784,
        -8.727502623402199e-33,
        -0.052204329520463943,
        0.04197029396891594,
        -0.03731241449713707,
        -0.0039028627797961235,
        -0.05103469267487526,
        -0.034959644079208374,
        0.009427756071090698,
        0.030755406245589256,
        -0.0015287213027477264,
        0.009137040935456753,
        -0.030656935647130013,
        -0.002938999095931649,
        0.0996834933757782,
        -0.009125519543886185,
        0.06940491497516632,
        -0.030584538355469704,
        0.01413039118051529,
        -0.03280477970838547,
        -0.014111262746155262,
        0.006916719023138285,
        -0.060962796211242676,
        0.12943609058856964,
        0.02144813910126686,
        -0.067020945250988,
        -0.041435759514570236,
        -0.022987360134720802,
        0.03396693989634514,
        0.08389390259981155,
        -0.04376139119267464,
        0.012043879367411137,
        -0.015621273778378963,
        -0.05674465373158455,
        -0.028676452115178108,
        0.021524082869291306,
        0.028347261250019073,
        0.03069174475967884,
        0.020805303007364273,
        0.10626885294914246,
        0.04246754199266434,
        -0.022833460941910744,
        0.14478829503059387,
        0.06302263587713242,
        -0.04041874408721924,
        -0.021079683676362038,
        0.02951267547905445,
        -0.05225219205021858,
        -0.00716792419552803,
        0.0814744234085083,
        -0.12076760828495026,
        -0.11569418758153915,
        0.06476490199565887,
        0.036416128277778625,
        -0.03684231638908386,
        -0.020018409937620163,
        -0.008640600368380547,
        0.08072584867477417,
        0.04898802191019058,
        -0.05265941843390465,
        0.013154109939932823,
        -0.010094030760228634,
        -0.0037846325431019068,
        -0.07863510400056839,
        -0.020032009109854698,
        0.060892485082149506,
        0.031106868758797646,
        -0.05931819602847099,
        -0.09314388036727905,
        -0.030699104070663452,
        -0.044700395315885544,
        -0.04723162576556206,
        -0.012129935435950756,
        -0.12927557528018951,
        -0.02036534808576107,
        0.047239966690540314,
        0.03238677605986595,
        0.009146900847554207,
        0.01398756355047226,
        0.04669900983572006,
        -0.0728677362203598,
        0.025354962795972824,
        0.03652697056531906,
        0.0874716117978096,
        -0.04023772105574608,
        0.02678598277270794,
        -0.0006608192925341427,
        0.06024729460477829,
        0.0365770161151886,
        0.01803390495479107,
        0.06620229035615921,
        0.020941073074936867,
        -0.07257163524627686,
        0.07891767472028732,
        -0.024321090430021286,
        0.05034937337040901,
        -0.03114069066941738,
        -4.8407823527440996e-08,
        0.00838142167776823,
        0.03255913406610489,
        0.05678272992372513,
        0.018575092777609825,
        -0.042471032589673996,
        0.03624656796455383,
        0.00508106779307127,
        -0.12172704190015793,
        0.09360189735889435,
        -0.025707634165883064,
        -0.03491530939936638,
        0.024199005216360092,
        -0.055056970566511154,
        0.05681025981903076,
        -0.025066250935196877,
        0.07179414480924606,
        -0.06968306750059128,
        -0.0755365788936615,
        -0.055323392152786255,
        -0.019651561975479126,
        0.0014937885571271181,
        0.005131451413035393,
        -0.05047227442264557,
        0.050679247826337814,
        -0.05859360098838806,
        0.0872311145067215,
        0.014020552858710289,
        -0.0008169374195858836,
        -0.03841227665543556,
        0.0004122833488509059,
        -0.04995427653193474,
        -0.10254819691181183,
        -0.013263815082609653,
        -0.020208220928907394,
        -0.0343911275267601,
        0.0814446359872818,
        -0.03850826993584633,
        -0.11693291366100311,
        0.02274227701127529,
        0.058927636593580246,
        -0.15602323412895203,
        -0.07837098091840744,
        0.03952106833457947,
        -0.005493509583175182,
        -0.03352656215429306,
        0.0026819000486284494,
        -0.0626094713807106,
        0.038418032228946686,
        0.05090536177158356,
        0.0036299771163612604,
        0.0181624386459589,
        -0.0601811483502388,
        0.003775624558329582,
        -0.07016035169363022,
        0.08849752694368362,
        -0.04583044350147247,
        0.04056916758418083,
        -0.1438978761434555,
        -0.023226890712976456,
        -0.007335543166846037,
        0.020260097458958626,
        0.047400880604982376,
        -0.05476340651512146,
        0.04872801527380943
    ]
}