{
    "id": "O4bc0HsFYKo",
    "title": "Everything else is obsolete - Retro Fighter Brawler64 Controller",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-23T19:00:20Z",
    "video_url": "https://www.youtube.com/watch?v=O4bc0HsFYKo",
    "category": "Science & Technology",
    "tags": [
        "Retro Gaming",
        "Nintendo",
        "N64 Console",
        "Controllers",
        "controller",
        "brawler",
        "brawler64",
        "gaming",
        "retro",
        "old",
        "past",
        "64 bit",
        "new controller",
        "wireless",
        "games",
        "goldeneye"
    ],
    "views": 734589,
    "likes": 35145,
    "comments_count": 2214,
    "description": "Get a new virtual desktop with Shells at   Retro Fighter's Brawler64 controller wants to bring new life into your retro gaming adventures with something I wish Nintendo could've released for the N64 console.   Buy Retro Fighter controllers  On Amazon (PAID LINK):  On NewEgg (PAID LINK):   Buy Nintendo N64 controller USB Adapter On Amazon (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  Chapters:  0:00 - It's Retro Time! 0:22 - Brawler 64 Controller introduction 2:21 - Unboxing 3:26 - Controller ergonomics 4:36 - Expansions slot explanation  5:56 - Shells! 6:20 - Controller impressions with Goldeneye 8:45 - Controller impressions with Diddy Kong Racing 12:11 - Testing out the controller to a PC 12:44 - Final thoughts  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/ShellsSC1",
        "https://geni.us/A7MnB",
        "https://geni.us/6Skss",
        "https://geni.us/P2wxMqs",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It's retro time! I don't know how many of you are nineties kids, but when I first saw this whole thing, it was kind of mind blowing. Like, why are there three? Why is it this? Why can't I use this? I mean, it's a classic but it doesn't mean that it can't be improved upon Enter, the Retro Fighters Brawler 64 Wireless Edition. Now this is wireless, like it says and it is a complete redesign of the original Nintendo 64 controller. In fact, it looks more like a switch pro controller than anything else. - [Jono] I thought third-party controllers suck. - Yeah. Third party controllers usually do suck. This is a, my super pad, 64 from back in the day. Oh, that's so rough. Oh, all the buttons feel terrible. This is the controller that I would've used for my sister or somebody. It's not good. For Christmas one year. I think my dad got it for me. Sorry, dad. This is a third-party controller. Yes, but it's a third-party controller developed by fans of the console and of retro gaming. Obviously we also have the Retro Fighters StrikerDC over here, which I think was their first controller? Didn't bring my Dreamcast today. Cause I didn't think we'd have them on set but there you go. The back of the box here, it's the next generation N64 controller. And I think that they are not lying. 2.4 gigahertz wireless technology. Well, I mean, that's pretty standard for wireless but hopefully that means it's zero lag. Wireless range over 30 feet. That's great. Ergonomic and comfortable design. We shall see. Compatible with memory packs. That is huge because like when was the last time this socket whatever connector has been made, like, I mean that's a Nintendo proprietary thing, I am sure. Responsible and responsible. (laughter) Responsive analog stick. Which if you compare to this third party thing, like Oh, you can hear that it's creaking. I don't know how much that comes through, but it's it's a bad experience. Let's take a look at this. All right. So obviously we've got the red plastic one. I'm just going to take it out of the tray here and lay it to the side. We've got this. Ooh, a little key chain. It's like a little, a little pixelated figure. I think that's one of the mascots. Oh, approximately the 2.5 hours of fully charged. Oh to fully charged the battery. Approximately 10 plus hours before you need to recharge. Oh, this is really cool. Instead of having a, like N64 memory pack adapters slot in the back here, it's got it on the connector. So it just goes straight in like that. And it like stands up. Like it plugs in vertically and I actually have my old memory card but that you have just go straight in like that. No clip or anything. Cause you don't really need it. You're not like banging it around. Like you might with an N64 controller because this is connected directly into the console and oh, oh the feel, the feel is much nicer. Like the plastic feels like it's got a kind of a cheapish texture but it's actually more like a satin finish. You can tell that-- I'm trying to like flex it and it's not it's not flexing like at all, basically. It is, it is solid plastic. Compare that to my original N64 controller. Yeah. It's waving to you. Triggers feel-- little less snap to them than the in 64 controller. Face buttons, they're a bit snappier. Yeah. Yeah. The original N64 face buttons were a little bit mushier than this. So that'll be interesting to see how that plays out in gameplay. It'll probably break in over time but I remember this being always kind of mushy 164 grams. That is 0.361 pounds or 5.7 ounces. 0.182 grams or 0.401 pounds or 6.4 ounces. So that's significant. And if I add the cable, that's like what is it like twenty-five percent more? - [Jono] They both don't have rumble. That's true. They both don't have rumble. The main thing about the Rumble Pack, was that it was actually an add-on so you'd have to plug it into this slot here. Even if this had rumble built into it the game would need to support it. And you wouldn't be able to use a memory card at the same time the memory card slot or the expansion slot I guess, controller expansion pack, only slotted in one device at a time there was no hub or split or anything like that that was available. Games that support both a memory card and a rumble pack, you had to remove your memory card and insert Rumble Pack for game play. Then when it came time to save or move your Rumble Pack and insert your memory card to save. Well, let's just we had to put up with back then. - [Jono] Not on PS1! Yeah, because Sony had to like one-up Nintendo and actually make a standard for controller design that lasted. I'm like, ah, well that, which nobody wants to touch. (laughter) There's the charging cable and it's along with everything else, this is type C like holy crap. And it obviously comes in a multiple different colors. This here is the classic one that actually looks pretty classy. Yeah. I'm, I'm really excited to get this going. And I'm really excited to talk to you about our sponsor Shells. Shells.com offers secure personal cloud computers that can be accessed from anywhere on almost any device. It runs in your web browser. So it works on your phone, computer, or even on your TV. You can open a brand new high-speed computer in under five minutes. They've got options for both Windows and various Linux systems with no hidden fees with pricing starting at just $495 a month. Give your computer a break and try a virtual desktop at the link below. What should I play? - [David] GoldenEye. - Yeah. GoldenEye. This has to be a very old monitor, super thick. This is why we need a Retro Tank 5X Pro. You know what? GoldenEye has a sixteen by nine mode. - [David] What? (laughter) - Did you know that? - [David] No. - It does. - [David] That's awesome. - Check this out. Oh God. The frame rate's so bad. Did I change the control scheme back? What control scheme did I like? Was it kissy? Okay. I'm just going to change this to the default control scheme. I don't remember how to play this anymore. With that control scheme. This is not the most precise controller. Okay. I think that's enough of that. Let's try sniping with the other one. There we go. Here we go. All right. Just pick right up. Yeah. The C buttons are a little rough, but this stick is way nicer. It is super easy to move that cursor around. I can't see the thing is like smudged. The game is so blurry except I know this is how it's supposed to look because there are people who actually go out of their way to make it look, not like this. However, I will say the stick feels amazing. The C buttons will take a little bit of getting used to. They're a little bit snappier than I would prefer. I kind of prefer them a little bit mushy like the N64 controller, but that could just be like force of habit, but yeah, GoldenEye in sixteen by nine. How about that? Okay. So, okay. Let, let me, let me just quickly try the bad controller. Oh no. Is it as bad as I think it is? Or am I just hamming it up? Like if I try to aim like, each one of these little steps that I'm doing is the controller, like the stick, like moving a little bit because it's like stuck. Little, little motions I'm trying to make. I cannot do because This thing is so bad. Like I'm not, I'm not even kidding. The ergonomics of this controller is so bad that it actually hurts. God. This stick is super tall too. It's stupid. Oh, that feels so much better. It's almost like putting on an ice pack. Okay. Let's try something less shootery and more drivery that should that should maybe give the performance pat, a bit of a-- I dunno. Oh, my saves are, wait. Yeah, they are still here. There's my sister and there's me. I need a game. Like I need a game shark, like right now to copy all the off of this onto a new memory card, because this thing is going to die any day. Seriously, these, are bad battery backs. Like this is a CR 2032 from back in the day. I need to get these saves off of here Anyway. Okay. So just flying around, this feels pretty normal but I mean, I'm using a normal N64 controller. Let's let's swap out to the Retro Fighters and see how that feels. - [Jono] It said not to swap it out during gameplay. - My saves! Oh. (laughter) Okay. I think I grabbed it by the power pack and that made it like it jostled a little bit. Let me make sure that the saves are We can test the functionality - [Jono] I'm gonna feel so sad if it's all gone. - [David] Come on, game! - [All] Yeah! - I need to, I need to get a game shark like, now. I'm not-- I don't remember how to play this game but like, I can actually like make subtle movements with it. Like I don't have to be like banking completely all the time. Like I can just of sort of smoothly do it which is not something I can do with the N64 controller that I had. Yeah. Don't grab it by the power. That's a, that's a bad idea. Yeah. Actually this is, this is pretty easy to play. I like it. I don't know why I didn't like it as much as Mario Kart, maybe because of the frame rate. So they try again with the Retro Fighters. Oh, oh no, it did do that. Oh, interesting. So the amount of power that required caused my old N64 to blip out for a second there. Probably because of old capacitors in this thing but that is something that you'd have to bear in mind. Is that a, it does require power more power than a normal controller would. - [Jono] Dude, look at that drift! How does it feel? - It feels good. It's it's a little bit weird. Cause I'm still not used to the position of the Z button. The fact that I can get to every button on the controller is really nice. I don't know why Nintendo didn't let you do that before but like, yeah, I can take that turn and I don't have to be like constantly like back and forth like that. I can be like, yeah. Well, I came in first this time and I came in second last time. So I guess that's a win for the Retro Fighters. I'm not going to try this. I know that was a meme. I'm not going to try this. I don't know. What's the price of these things? I feel if they're 50 bucks - [David] In my head, it's 50 bucks. It's $39.99. - Oh wow! Okay. Well at 40 bucks, this thing is a steal. Let me tell you that right now, if you get 10 hours of battery on this for charge and you can plug it into a computer and you can, can you, can you can you give me your laptop real quick? I want to see if I can, like, this thing is cheap but it's cheaply made like it's solid. See if it shows up, maybe I need to-- On this? It may purely be for charging. In which case, I mean, it's not a huge deal. If you have an N64 to USB adapter, this will work. - [David] Wait, we have one don't we? - Do we? - [David] Let's see. All right. We're setting up for play port one. Hmm. Foreplay. Game controller settings, properties. It's not that one. Oh man. I may need the power supply for this. - [David] It's not worth it. - Yeah. It might be that this requires too much power. Just like when I plug it into the N64, it does this whole thing. Oh, it didn't do it this time. This thing is amazing. Like there's so much more precise control you can get for the N64. This feels so much more freeing. It's difficult to really describe how much better it is. And at $39, if you've got an N64, you really probably should look at it. And it's wireless. Like you get a wireless controller and the color of your choice, that is solid. And if you've got an old N64 that you're trying to run and you've got like a creaky old controller that, you know may or may not still be useful, it seems like a no-brainer because like buying one of these in reasonable condition is going to be roughly the same price, probably. Can't speak to the quality of the Hyperkins but I can speak to the quality of this. This is amazing. And I would recommend it. And that's it for this one. I don't know if we want to do one on this. I dunno. Let me know if you want to do more retro stuff like this. I mean, it doesn't seem to do that great. But if you want it, we'll do it. Thanks for watching and subscribe. Mm, foreplay.",
    "transcript_keywords": [
        "controller",
        "Yeah",
        "Retro Fighters",
        "thing",
        "retro",
        "Rumble Pack",
        "time",
        "memory card",
        "pack",
        "memory",
        "bit",
        "game",
        "rumble",
        "feel",
        "feels",
        "Retro Fighters Brawler",
        "Wireless",
        "bad",
        "back",
        "Fighters"
    ],
    "transcript_entity_values": [
        "sixteen",
        "2.4 gigahertz",
        "5.7 ounces",
        "the Retro Fighters",
        "the day",
        "Dreamcast",
        "three",
        "0.182 grams",
        "40 bucks",
        "39.99",
        "one",
        "USB",
        "Hyperkins",
        "twenty-five percent",
        "over 30 feet",
        "64",
        "nine",
        "second",
        "0.401 pounds",
        "6.4 ounces",
        "Nintendo",
        "Z",
        "Rumble Pack",
        "Windows",
        "Linux",
        "64",
        "Shells.com",
        "David] Wait",
        "third",
        "first",
        "Approximately 10 plus hours",
        "0.361 pounds",
        "Sony",
        "N64",
        "just $495",
        "David] GoldenEye",
        "Retro Tank",
        "GoldenEye",
        "the 2.5 hours",
        "N64",
        "Third",
        "39",
        "10 hours",
        "Christmas one year",
        "the Rumble Pack",
        "David] Come",
        "Mm",
        "under five minutes",
        "50 bucks",
        "Mario Kart",
        "today",
        "zero",
        "164 grams"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "TIME",
        "DATE",
        "FAC",
        "PERSON",
        "PERSON",
        "TIME",
        "MONEY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.004683285020291805,
        0.010932830162346363,
        -0.04208162799477577,
        -0.04739879444241524,
        -0.011238211765885353,
        0.12718603014945984,
        -0.0817921832203865,
        0.0399819016456604,
        -0.024901175871491432,
        0.06630521267652512,
        0.05043206736445427,
        0.025450419634580612,
        0.006377961486577988,
        -0.04653393477201462,
        0.048247069120407104,
        0.050524502992630005,
        0.062474146485328674,
        -0.04744238778948784,
        0.05041591450572014,
        0.04129384830594063,
        -0.023011889308691025,
        0.007870050147175789,
        -0.019322548061609268,
        0.02533421479165554,
        -0.035945627838373184,
        0.010537344962358475,
        -0.05870048701763153,
        -0.01471507828682661,
        -0.03622133284807205,
        -0.10350257158279419,
        0.002806692384183407,
        0.05566774681210518,
        0.02913270704448223,
        -0.02729145810008049,
        -0.04862848296761513,
        -0.13492080569267273,
        0.08406475931406021,
        -0.03822142258286476,
        -0.09493658691644669,
        -0.07794714719057083,
        -0.07767404615879059,
        -0.012098525650799274,
        -0.0061777448281645775,
        0.02931942790746689,
        0.052287615835666656,
        -0.037029631435871124,
        0.0075994860380887985,
        -0.09210450202226639,
        0.019602714106440544,
        0.013777707703411579,
        0.08562665432691574,
        -0.07681483775377274,
        0.1366594135761261,
        -0.034045517444610596,
        0.07276031374931335,
        -0.02244514785706997,
        -0.0292351171374321,
        -0.021351296454668045,
        0.05522337555885315,
        0.004151508212089539,
        0.003126780968159437,
        -0.03697068616747856,
        -0.000769302190747112,
        -0.012043260969221592,
        -0.04508933797478676,
        -0.0921611338853836,
        0.043075188994407654,
        0.014035697095096111,
        0.05271701514720917,
        -0.030263066291809082,
        -0.08980929106473923,
        0.005569880828261375,
        0.047931790351867676,
        0.01679426245391369,
        -0.021846357733011246,
        -0.008584077470004559,
        0.01043776236474514,
        0.003114697989076376,
        0.06284364312887192,
        0.010559981688857079,
        0.008177423849701881,
        -0.04516441002488136,
        -0.09865971654653549,
        -0.01352730579674244,
        0.04419571906328201,
        0.05987723544239998,
        -0.004489612299948931,
        0.0113833611831069,
        -0.0011364846723154187,
        -0.09181151539087296,
        -0.017470108345150948,
        -0.009762770496308804,
        0.0591573640704155,
        0.01665453240275383,
        -0.026726102456450462,
        -0.0744408518075943,
        0.04688673093914986,
        -0.052425503730773926,
        -0.016836019232869148,
        0.043023135513067245,
        -0.008334264159202576,
        0.05721655488014221,
        0.06850716471672058,
        -0.01386238168925047,
        0.0030477314721792936,
        0.024207869544625282,
        -0.027830051258206367,
        0.06643594056367874,
        -0.047370295971632004,
        -0.03362301364541054,
        -0.05602734535932541,
        -0.015661317855119705,
        -0.07580860704183578,
        0.04410608112812042,
        0.02305532433092594,
        0.017284635454416275,
        -0.08692974597215652,
        -0.013725086115300655,
        0.019157592207193375,
        0.01911667361855507,
        -0.0039369831793010235,
        0.0011573826195672154,
        0.009433976374566555,
        0.07955493777990341,
        0.027722885832190514,
        -0.016055503860116005,
        0.002641197293996811,
        7.063973874845207e-33,
        0.00885804183781147,
        0.05696830525994301,
        -0.04658040776848793,
        0.03651237115263939,
        0.022907564416527748,
        0.000778045563492924,
        0.05828569084405899,
        0.006356480531394482,
        0.011118117719888687,
        0.045318249613046646,
        -0.01612701639533043,
        0.03915739059448242,
        -0.07128304243087769,
        0.0580027736723423,
        0.10252523422241211,
        -0.051339197903871536,
        -0.06952075660228729,
        -0.006922814063727856,
        0.018216073513031006,
        -0.016407668590545654,
        -0.025476161390542984,
        0.04209436848759651,
        -0.05212797597050667,
        -0.10800470411777496,
        0.061390116810798645,
        0.10634733736515045,
        -0.031589653342962265,
        0.03333571180701256,
        0.028713492676615715,
        0.012250186875462532,
        0.0006403389852494001,
        -0.020837023854255676,
        -0.06564626097679138,
        0.005859907250851393,
        0.05713621899485588,
        -0.08179574459791183,
        0.011563356965780258,
        -0.07313857972621918,
        -0.07962416857481003,
        0.05441410094499588,
        -0.027549251914024353,
        0.009789402596652508,
        -0.16471733152866364,
        -0.06742499023675919,
        0.028408128768205643,
        -0.039427824318408966,
        0.07372447103261948,
        -0.02755223959684372,
        0.05359647050499916,
        0.04925873503088951,
        -0.06252773851156235,
        0.038282811641693115,
        -0.010885970667004585,
        -0.038764044642448425,
        -0.005340638104826212,
        -0.17462214827537537,
        -0.015938926488161087,
        0.005593506619334221,
        0.01905844360589981,
        0.05224935710430145,
        0.03613819181919098,
        -0.05333839729428291,
        0.023762399330735207,
        -0.02914404682815075,
        -0.03684617206454277,
        0.1242377832531929,
        -0.006292116828262806,
        -0.0370543897151947,
        -0.09361837804317474,
        0.08173468708992004,
        0.006471209693700075,
        -0.042873725295066833,
        0.06733223795890808,
        -0.014550646767020226,
        0.05159369483590126,
        -0.01084779854863882,
        -0.09635698795318604,
        0.028281139209866524,
        -0.0034498018212616444,
        -0.049453023821115494,
        0.017842218279838562,
        -0.013051263056695461,
        -0.06743571907281876,
        0.088784359395504,
        0.09752362221479416,
        -0.04199836403131485,
        0.026400843635201454,
        -0.037044405937194824,
        -0.010880136862397194,
        -0.015046579763293266,
        -0.06577161699533463,
        -0.06540753692388535,
        0.003605684032663703,
        0.036659494042396545,
        0.061564184725284576,
        -7.955475402664553e-33,
        -0.0031099598854780197,
        -0.005804813466966152,
        0.008443820290267467,
        0.03656959906220436,
        0.05491350218653679,
        0.015348685905337334,
        -0.01036091335117817,
        0.059240203350782394,
        0.015510710887610912,
        -0.1261577010154724,
        -0.0388275682926178,
        0.05663091316819191,
        -0.0036742158699780703,
        0.03490818664431572,
        0.06186360493302345,
        -0.016854746267199516,
        -0.0403323695063591,
        -0.03778495267033577,
        0.03690425306558609,
        -0.0747549757361412,
        0.11463312804698944,
        -0.029830528423190117,
        0.008164041675627232,
        -0.003736078506335616,
        0.08377136290073395,
        0.023635147139430046,
        0.09260028600692749,
        -0.003038447117432952,
        0.04704438894987106,
        0.05230794474482536,
        -0.023966776207089424,
        0.0184811819344759,
        0.0849192664027214,
        0.07242609560489655,
        0.04504505917429924,
        0.0024183366913348436,
        0.06850423663854599,
        0.0909157544374466,
        -0.0437876358628273,
        -0.1231205090880394,
        -0.02321099489927292,
        -0.07819013297557831,
        -0.0039586471393704414,
        0.06180804967880249,
        0.05019335821270943,
        -0.048165213316679,
        -0.02159195765852928,
        -0.047515109181404114,
        0.09916192293167114,
        0.025612499564886093,
        -0.019401758909225464,
        -0.09271068125963211,
        0.06851339340209961,
        -0.06757106631994247,
        -0.08997336030006409,
        -0.05834803357720375,
        -0.00087144342251122,
        -0.022055692970752716,
        0.035775866359472275,
        0.026740487664937973,
        0.037063952535390854,
        0.027997775003314018,
        -0.059853240847587585,
        -0.03942573443055153,
        0.023905565962195396,
        0.000660950317978859,
        0.04507864639163017,
        0.03388315066695213,
        -0.015298033133149147,
        -0.0025212811306118965,
        -0.02281246893107891,
        -0.06010674312710762,
        0.014601590111851692,
        -0.00947817973792553,
        0.03141375258564949,
        0.007452590391039848,
        0.01898697018623352,
        0.022961927577853203,
        0.05260986089706421,
        0.014248996041715145,
        -0.09381124377250671,
        -0.02048381045460701,
        0.09235379099845886,
        0.004787935875356197,
        0.01195153035223484,
        0.01653478294610977,
        -0.018742946907877922,
        0.00467976788058877,
        0.021753616631031036,
        -0.04949299618601799,
        0.06143460050225258,
        0.06411506235599518,
        -7.175061182351783e-05,
        0.10144713521003723,
        0.002823203569278121,
        -6.102083460746144e-08,
        0.06670486927032471,
        0.022893164306879044,
        -0.03530691936612129,
        -0.005653221160173416,
        0.013707212172448635,
        0.05668207257986069,
        -0.029988201335072517,
        -0.06121012195944786,
        -0.037896472960710526,
        0.045523662120103836,
        0.05088265612721443,
        0.047012247145175934,
        -0.02765382081270218,
        -0.0009069798979908228,
        0.01798224076628685,
        -0.020523903891444206,
        -0.05875273048877716,
        -0.010213630273938179,
        -0.05878089368343353,
        0.018548300489783287,
        -0.025269031524658203,
        -0.003125642891973257,
        0.08570870757102966,
        -0.11657021939754486,
        -0.033601824194192886,
        -0.020714135840535164,
        -0.0869237631559372,
        0.07269702851772308,
        0.03573349490761757,
        -0.020201122388243675,
        0.011153694242238998,
        0.02015583962202072,
        -0.041315123438835144,
        -0.0034162038937211037,
        0.035953372716903687,
        -0.05066198483109474,
        0.010626764968037605,
        0.019739318639039993,
        0.02994450554251671,
        -0.011183909140527248,
        -0.02226891927421093,
        -0.09911589324474335,
        -0.08019151538610458,
        -0.008335483260452747,
        0.05258987098932266,
        0.0021651466377079487,
        -0.06324460357427597,
        -0.06456716358661652,
        -0.0820889100432396,
        -0.026390867307782173,
        0.01896665431559086,
        -0.002875646809116006,
        -0.06047576293349266,
        -0.013812277466058731,
        -0.041611503809690475,
        0.10538006573915482,
        -0.02190609835088253,
        -0.01168790739029646,
        0.04851362481713295,
        -0.017191104590892792,
        0.057437412440776825,
        -0.10360334813594818,
        -8.685783541295677e-05,
        0.06815087795257568
    ]
}