{
    "id": "o4ouOGH46jc",
    "title": "Why Can't I Buy This??? - OnePlus Nord",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-27T08:01:19Z",
    "video_url": "https://www.youtube.com/watch?v=o4ouOGH46jc",
    "category": "Science & Technology",
    "tags": [
        "OnePlus",
        "Nord",
        "Smart Phone",
        "Smartphone",
        "Snapdraon",
        "USB-C",
        "Fast Charging",
        "Bluetooth"
    ],
    "views": 1349914,
    "likes": 38432,
    "comments_count": 3872,
    "description": "OnePlus returns to their roots with their newest model the Nord, but how does it shape up to today's standards?  Buy OnePlus Smartphones On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Buy Bluetooth Earbuds On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/GbdPnjM",
        "https://geni.us/4ujmjPO",
        "https://geni.us/wpdRnB",
        "https://geni.us/lzR2",
        "https://geni.us/iZyZXs",
        "https://geni.us/2WJ3h1v",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- What is it about the OnePlus Nord that makes me undeserving of it? Yes, my friends, this phone right here will not be released in the US or Canada. It is only for the European and Indian regions. But here is some consolation. The OnePlus Buds will at least be available in Canada and the US, and you can check out our full Short Circuit video that James hosted right over here, but my focus today is, of course, the Nord. Finally, OnePlus is supposedly returning to their roots and delivering a budget oriented smartphone coming in at around 400 euros. What kind of compromises does it make? Well, on the surface, we already know that it's gonna be using a Snapdragon 765G processor so that puts it in the performance tier of, ooh, around a Snapdragon 845 in single threaded tasks, even lower in multi-threaded tasks. And when it comes to gaming, probably around half the performance of a modern flagship running a Snapdragon 865. But much like what LG is doing with the Velvet, OnePlus is trying to deliver a very flagship-like experience with the rest of the aspects of the device, even if the processor, at its heart, is more mid-tier or budget-oriented. So in terms of the physicality of it, it feels really good. Honestly, if you told me, even two, three years ago that we were gonna get budget-oriented phones that would look and feel like this, I told you you know you're probably crazy because the tooling and the machine time to build something like this, you got a glass back, you got really nice blue aluminum frame. They do a fantastic job of their color choices and a lot of the time, you see this especially in things like cars. The manufacturers will intentionally have kind of crappy body styling and crappy colors on their more budget-oriented products, I think this looks outstanding. I would have told you you were crazy if you said we were gonna see something like this. We've got a Type C charger, SIM card slot on the bottom, no expandable storage, unfortunately, so it's available in 64 gig in India only, 128 gig in India and the EU, and then 256 gig in India and the EU, and then you get six gigs, eight gigs, and 12 gigs of RAM if memory serves accordingly. You've got a single bottom-firing speaker. We're gonna check it out in a minute to see if the earpiece one is amplified if we get a stereo effect. On the right, you've got your lock button as well as OnePlus's characteristic do not disturb slider. I actually love this it's got three positions, so one for everything, one for vibration only, and one for do not disturb, freaking awesome. We got a microphone port on the top, volume rocker over on the left side. I really like the offset here. So lock is here so you can press it without accidentally mashing your volume. I did actually mash the volume button there but it's 'cause I'm holding it a kind of an unnatural angle towards the camera. it should be easy to adjust either of them without accidentally mashing the other. We can see already, it's got an in screen fingerprint sensor. Just from the detection boops, seems like it's gonna be pretty fast, that's kind of OnePlus's shtick, nice fast facial unlock, nice fast fingerprint sensor, that kind of stuff. What we can also see about the display is that OnePlus has gone with, as I call it, the exit wound style of front facing camera. Now that's interesting. They have decided to not just on their wallpaper, you can see they've kind of got a little sort of black cutout right there, not just on the wallpaper, but actually it seems like system theme wide, make it less intrusive and I, wow, I actually, I like that. It's kind of disconcerting when you drag something down and it's like there and then kind of drags past it, but hiding it like that is pretty sensible to me, 'cause you would normally have your top bar full of all your your WiFi or your SIM card connectivity like all this, got your downloads, all that kind of crap anyway. So yeah, why not just black the whole thing out? It doesn't make the phone look bad and actually, the fact that it's got such a narrow chin bar is something that I didn't really expect, makes it feel pretty modern. Okay, nevermind. Once we actually get into Google here, you can see that we're still left staring into the dual front facing cameras. But to its credit, at least, it has dual front facing cameras. That's one of the areas that OnePlus has gone pretty far beyond what I would expect on a budget phone. So they've got their main 48 megapixel shooter, they've got an eight megapixel secondary shooter, a two megapixel macro, and then a depth sensor on the back. And then, let's go ahead and fire up this selfie camera. Oh yeah, there you go, so that's pretty straightforward. You got a wide angle and then a regular selfie camera. Wow, that's pretty cool. That is a lot of camera for 400 euro. I think, I mean, I don't know the Euro is. It's not available on the US or Canada. That's not to say it has absolutely everything that you might expect from either a budget or a flagship phone though. Notably missing, even though it does have a nice big 4,000 plus milliamp hour battery is wireless charging. Not gonna get any wireless charging and compared to other budget devices, surprisingly, well, hey, we went through all the sides of the device already, it does not have a headphone jack. Now, where did I put it? I think part of OnePlus's justification for that is their affordably priced OnePlus Buds, and they're kind of going, \"Well, at this point, why don't you just join the Bluetooth revolution?\" And I would love to say that angers me, but the reality of it is is there's just, there's just no escaping it at this point. I was pretty hardcore into the wired earphones camp, and now I just I give up, I give up, I think, I think the ship has sailed. The killer app from here though has to be the high refresh rate display. It's not particularly high res, it's 2400x1080, so it's like full HD plus or whatever the terminology is for that these days. But to me, at this screen size, it's 6.44 inches, that is plenty, and compared to something like an iPhone SE, this screen is gonna look absolutely fantastic, nice narrow chin bar, actually narrow bezels all around. Yes, there's an offensive notch in it, but quite frankly, there's an offensive notch in basically everything these days, and that 90 hertz refresh rate, really adds a level of fluidity, that is impossible to replicate, having a faster processor or a faster GPU, like yeah it makes the phone do things faster, but it doesn't necessarily feel faster. What else do you guys wanna know about this thing? - [Man] Does it have fast charging? - Yeah, it's got fast charging, just not wirelessly. Actually, we should probably have a look at what kind of charger they include in the box. I mean, Apple is allegedly making the move to not including chargers at all with their phones, so that's a great way to stand out as a budget phone, including a nice, well, this thing looks chunky anyway, a nice high speed charger, so input 100 to 240 volt, blah, blah, blah output, five volts, two amps, 10 watts, maximum of 30 watts for Warp Charge 30. Yep, fast charging is included. In terms of what else is included in the box, not a whole heck of a lot. I love that OnePlus does include a screen protector on the front of their phone, and they're also including a nice little cover. I don't know what this flappy doodle here is. Oh, okay I guess it's just to keep gunk out of your type C port. That's pretty nice touch just 'cause you're really gonna need it 'cause you don't have wireless charging, got a sim removal tool, some stickers so you can advertise for the brand that you bought a phone from. Why be subtle about it, right? I do like their USB cables though. The red and white color scheme, it does it for me. Oh yeah, 5G, one of the benefits of going with the Snapdragon 765G is that even though it's like a mid-tier processor in terms of CPU performance and quite last, last, last gen in terms of GPU performance is that it's got its 5G modem built-in. So you're gonna have to double check OnePlus's specs in terms of whether the 5G bands in your area are supported. My understanding is that it does not have support for millimeter wave, but that probably comes down to the complexity of the antennas for 5G. So supporting one type of 5G versus another type of 5G means more bulk and more antennas internally in the device. Quite frankly, I think most people are going to benefit the most from the mid band 5G anyway as opposed to millimeter wave. For my experience with it, the reception is so limited, even in areas that supposedly support it. I honestly just don't see it as that big of a deal from a consumer standpoint. So the upside then of 5G support is that if your carrier has it, you might get slightly better speeds and there's really no downside because having the 5G modem built into the SOC gives it a slight power efficiency advantage compared to having it built in separately like you'd see with a Snapdragon 865 flagship chipset. Oh it's bottom firing only, no amplified earpiece, ah, ah. Looks great though, so as long as you're using your OnePlus Buds, then you should be fine there, bud, get it, bud? Yeah, I know, sorry. Overall, I think OnePlus has a really compelling package here. I mean they've nailed the things that most people care about, decent camera, good display, and yeah it's a little slower, 765G or whatever but I think I've made it pretty clear, given that I'm still daily driving a Note 9 that I, and a lot of people, don't care about the absolute fastest benchmarks as long as the experience of using the device is good and they've done a good job with that, whether you're launching an article, it's like, yeah okay, it takes a second or two to load up but that's fine, it's pretty fluid. First impressions? Pretty strong. This is a good looking little package. That's what she said. Subscribe to Short Circuit. She sent that too. You just weren't listening.",
    "transcript_keywords": [
        "OnePlus",
        "kind",
        "pretty",
        "OnePlus Buds",
        "nice",
        "phone",
        "yeah",
        "Snapdragon",
        "camera",
        "OnePlus Nord",
        "Canada",
        "European and Indian",
        "charging",
        "fast",
        "gig in India",
        "budget",
        "terms",
        "fast charging",
        "India",
        "good"
    ],
    "transcript_entity_values": [
        "Snapdragon 865",
        "Velvet",
        "OnePlus",
        "eight megapixel",
        "the OnePlus Nord",
        "three",
        "millimeter",
        "RAM",
        "OnePlus",
        "US",
        "2400x1080",
        "845",
        "400 euros",
        "Euro",
        "90",
        "EU",
        "10 watts",
        "USB",
        "one",
        "Google",
        "100",
        "400 euro",
        "64",
        "Nord",
        "Apple",
        "4,000 plus milliamp hour",
        "SOC",
        "second",
        "765",
        "three years ago",
        "128",
        "two,",
        "5",
        "European",
        "LG",
        "OnePlus",
        "Indian",
        "256",
        "daily",
        "these days",
        "two",
        "Canada",
        "30 watts",
        "five volts",
        "GPU",
        "30",
        "around half",
        "The OnePlus Buds",
        "Snapdragon",
        "India",
        "Short Circuit",
        "12",
        "hertz",
        "Warp Charge",
        "OnePlus Buds",
        "six",
        "6.44 inches",
        "jack",
        "James",
        "CPU",
        "First",
        "eight",
        "48 megapixel",
        "a minute",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "NORP",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "DATE"
    ],
    "vector": [
        -0.0972130224108696,
        -0.0252457857131958,
        0.05429880693554878,
        -0.027294790372252464,
        0.1072269007563591,
        0.020112773403525352,
        -0.04878437519073486,
        0.06490994244813919,
        0.000960583973210305,
        0.01599591225385666,
        0.034020669758319855,
        0.007163920905441046,
        0.018969804048538208,
        -0.050712406635284424,
        0.05582815781235695,
        -0.029211904853582382,
        0.05963949114084244,
        -0.13489466905593872,
        -0.014557315967977047,
        0.0030817065853625536,
        -0.00730861397460103,
        -0.06634218245744705,
        -0.00830753706395626,
        -0.006602240260690451,
        0.029441673308610916,
        -0.09960223734378815,
        -0.05689450725913048,
        -0.02052190899848938,
        0.030865974724292755,
        -0.05113513767719269,
        0.01302835252135992,
        0.06807907670736313,
        0.030354317277669907,
        -0.011266252025961876,
        -0.027017470449209213,
        -0.05219173803925514,
        0.04307953640818596,
        -0.080613873898983,
        -0.15819019079208374,
        -0.0029081569518893957,
        0.008306884206831455,
        -0.03170553967356682,
        -0.03635169193148613,
        0.045208897441625595,
        -0.007194839417934418,
        -0.006162312813103199,
        0.014720401726663113,
        0.044056106358766556,
        0.024571117013692856,
        0.004695150535553694,
        0.04427795857191086,
        -0.024189116433262825,
        0.035374801605939865,
        -0.02680349349975586,
        -0.053175948560237885,
        0.006304797250777483,
        -0.06052711233496666,
        -0.001283097779378295,
        0.0652972012758255,
        -0.022520413622260094,
        0.06746368110179901,
        -0.10561100393533707,
        -0.05689297243952751,
        0.05998547747731209,
        -0.006090857554227114,
        -0.012358915992081165,
        -0.038266874849796295,
        0.04308401420712471,
        -0.12978960573673248,
        -0.05761117860674858,
        0.016576677560806274,
        -0.06496155261993408,
        0.029225707054138184,
        0.09824293106794357,
        0.02208281308412552,
        0.05307300388813019,
        0.12218581885099411,
        -0.010924238711595535,
        0.0394623763859272,
        0.005903721321374178,
        -0.037566397339105606,
        -0.02099205181002617,
        -0.026385683566331863,
        -0.03424952179193497,
        0.032689377665519714,
        0.03912205621600151,
        0.02760215848684311,
        0.017620397731661797,
        -0.004607172217220068,
        -0.08947958797216415,
        0.019677218049764633,
        0.06006840616464615,
        0.0367099866271019,
        0.03320423141121864,
        0.00807456485927105,
        -0.01070533599704504,
        0.008338338695466518,
        0.011520887725055218,
        -0.03992501273751259,
        0.02707044407725334,
        0.01238136924803257,
        0.048040784895420074,
        0.07242096215486526,
        -0.017291542142629623,
        -0.055765241384506226,
        -0.06265568733215332,
        -0.040853988379240036,
        0.0800100788474083,
        0.142217755317688,
        0.056341931223869324,
        -0.061696287244558334,
        -0.04464288428425789,
        -0.04720504209399223,
        -0.018919330090284348,
        -0.04564433544874191,
        0.027656355872750282,
        -0.11893454939126968,
        -0.001076269312761724,
        0.1481771320104599,
        -0.09526488929986954,
        0.018653439357876778,
        0.0069555677473545074,
        -0.030785519629716873,
        -0.005881846882402897,
        0.009339130483567715,
        0.02500707469880581,
        -0.06659894436597824,
        2.7105593829206583e-33,
        -0.028605902567505836,
        0.09036488831043243,
        -0.061062611639499664,
        -0.07226798683404922,
        -0.017992915585637093,
        0.0012460752623155713,
        0.00020961118570994586,
        0.02533717080950737,
        -0.07161381840705872,
        0.022822706028819084,
        -0.08778603374958038,
        0.07169270515441895,
        -0.05334509536623955,
        0.08764059096574783,
        -0.0015434632077813148,
        -0.010314512066543102,
        0.02161332033574581,
        0.008246954530477524,
        0.03899277001619339,
        0.07706253230571747,
        0.013158079236745834,
        -0.006585713941603899,
        0.05143323168158531,
        0.007005936000496149,
        0.044688619673252106,
        0.015580783598124981,
        0.02326275408267975,
        0.03009965643286705,
        0.10411415994167328,
        0.01614978536963463,
        -0.02343876287341118,
        -0.007020303979516029,
        0.03589477390050888,
        -0.03668255731463432,
        0.0057164342142641544,
        0.013414207845926285,
        -0.01834007166326046,
        -0.07089508324861526,
        -0.0354667566716671,
        -0.05449802055954933,
        -0.06102966517210007,
        0.037523698061704636,
        -0.11672357469797134,
        -0.07736697047948837,
        0.010340789332985878,
        0.012529228813946247,
        0.012391931377351284,
        -0.01913062110543251,
        0.02475268393754959,
        0.021765805780887604,
        -0.09872139990329742,
        0.0635267049074173,
        -0.0853787362575531,
        -0.03617071732878685,
        0.02693556249141693,
        -0.048450637608766556,
        0.013485384173691273,
        0.011394809931516647,
        0.04379244148731232,
        -0.010066275484859943,
        0.02001611702144146,
        0.029109612107276917,
        0.002845735289156437,
        -0.007018238306045532,
        -0.0933900699019432,
        0.05953589454293251,
        0.04857383295893669,
        -0.022262901067733765,
        -0.07319635897874832,
        -0.016502417623996735,
        -0.019430048763751984,
        0.022103091701865196,
        0.0462113693356514,
        0.03191197291016579,
        0.02219465747475624,
        -0.0031724937725812197,
        -0.07310246676206589,
        0.02924092672765255,
        0.08334040641784668,
        -0.024325231090188026,
        -0.09870391339063644,
        0.026045219972729683,
        0.04847231134772301,
        0.09783776849508286,
        0.027027929201722145,
        -0.010861437767744064,
        0.029771991074085236,
        0.022532546892762184,
        -0.01909026876091957,
        0.012021957896649837,
        -0.01433998066931963,
        -0.03019099310040474,
        -0.03688288480043411,
        -0.0037541647907346487,
        -0.0034605523105710745,
        -4.98391531523006e-33,
        -0.1087750568985939,
        -0.018339240923523903,
        -0.11170095205307007,
        0.014386510476469994,
        0.03165450319647789,
        0.040430039167404175,
        0.059264641255140305,
        -0.012466227635741234,
        0.042466674000024796,
        -0.026492062956094742,
        0.060671791434288025,
        0.03575379401445389,
        -0.056321319192647934,
        -0.02997097745537758,
        0.05604138970375061,
        -0.08694691956043243,
        0.04796426743268967,
        -0.05586915463209152,
        -0.00529323099181056,
        -0.018353024497628212,
        0.033392298966646194,
        0.017473801970481873,
        -0.028071796521544456,
        0.055442340672016144,
        -0.011525111272931099,
        0.010752835310995579,
        0.013780610635876656,
        -0.013774815946817398,
        -0.005340478383004665,
        0.00257354648783803,
        -0.05310629680752754,
        0.04191678762435913,
        -0.061679210513830185,
        0.025334106758236885,
        0.06584236770868301,
        0.05019325762987137,
        -0.054955482482910156,
        0.07394739985466003,
        0.05447971820831299,
        -0.0428641177713871,
        0.00837978906929493,
        -0.04756786301732063,
        0.04006258025765419,
        -0.01446630246937275,
        0.054851602762937546,
        -0.06566940993070602,
        -0.04450095072388649,
        -0.051240358501672745,
        0.007136304397135973,
        0.03680768236517906,
        0.03482319414615631,
        -0.016912125051021576,
        0.12489595264196396,
        -0.03153669089078903,
        -0.06791720539331436,
        -0.026235148310661316,
        0.010879418812692165,
        0.030463675037026405,
        -0.036777809262275696,
        0.008349469862878323,
        0.06093290448188782,
        0.0038701388984918594,
        -0.04353776574134827,
        0.06279844045639038,
        -0.03680567443370819,
        -0.021139536052942276,
        0.01658114418387413,
        -0.025092873722314835,
        -0.013159718364477158,
        0.02295307256281376,
        -0.02120395191013813,
        -0.027559274807572365,
        -0.011203594505786896,
        -0.1159600093960762,
        -0.07466309517621994,
        0.05901775136590004,
        -0.042713988572359085,
        0.0032762084156274796,
        -0.0004647856403607875,
        -0.0561290942132473,
        -0.03266790136694908,
        0.1074201762676239,
        0.1156829223036766,
        0.017487764358520508,
        0.11808762699365616,
        -0.010300105437636375,
        0.04748086631298065,
        -0.02856874279677868,
        0.00533707533031702,
        -0.02639332041144371,
        -0.06437869369983673,
        0.0057128192856907845,
        -0.10521575063467026,
        0.11220156401395798,
        -0.011950820684432983,
        -5.7195673974774763e-08,
        0.015540648251771927,
        -0.0006238044588826597,
        0.010880828835070133,
        -0.017041530460119247,
        0.04501574486494064,
        -0.04762911796569824,
        -0.010907224379479885,
        -0.04654080420732498,
        0.026146264746785164,
        0.059314578771591187,
        -0.003954201936721802,
        -0.0748889371752739,
        -0.10412310063838959,
        0.019105946645140648,
        0.017213551327586174,
        0.0047724065370857716,
        -0.04888354241847992,
        0.06128009781241417,
        -0.02816617861390114,
        -0.0308985598385334,
        -0.07294977456331253,
        0.026989566162228584,
        0.006338124629110098,
        -0.09654414653778076,
        0.04185168072581291,
        0.01721956953406334,
        0.015257596969604492,
        0.030057966709136963,
        0.13069579005241394,
        -0.023370862007141113,
        -0.03813531622290611,
        0.02876495011150837,
        -0.028479257598519325,
        -0.016345521435141563,
        -0.009057702496647835,
        -0.06529658287763596,
        -0.05568677559494972,
        0.1195812076330185,
        0.06262059509754181,
        0.021602880209684372,
        -0.044877681881189346,
        -0.014798936434090137,
        0.028557192534208298,
        -0.008931782096624374,
        0.03071603924036026,
        0.03280230239033699,
        -0.050890032202005386,
        -0.040376245975494385,
        0.003289609681814909,
        0.08380668610334396,
        -0.05121050402522087,
        -0.0619116947054863,
        -0.016109583899378777,
        -0.03941606357693672,
        0.024119246751070023,
        -0.01820170134305954,
        0.005731882993131876,
        -0.0083860969170928,
        0.021375074982643127,
        0.057987917214632034,
        -0.004458450246602297,
        -0.1615351438522339,
        0.023827489465475082,
        0.12157662212848663
    ]
}