{
    "id": "O5MvVNz_YWo",
    "title": "What I learned from 60 flights with DJI’s new drone",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-06-09T14:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=O5MvVNz_YWo",
    "category": "Science & Technology",
    "tags": [
        "dji mini 3 pro review",
        "dji mini 3 pro camera",
        "dji mini 3 pro unboxing",
        "dji mini 3 pro",
        "dji mini 3",
        "drones",
        "best drones",
        "best drones 2022",
        "best drones for beginners",
        "dji mini 2",
        "drone footage",
        "drone footage 4k",
        "dji mini 2 review",
        "dji mini 2 footage",
        "dji mini tutorial",
        "dji mini 3 tutorial",
        "dji mini 3 pro range test",
        "dji mini 3 pro vs air 2s",
        "tech",
        "review",
        "the verge"
    ],
    "views": 295074,
    "likes": 5560,
    "comments_count": 309,
    "description": "DJIs newest ultra-light and portable drone comes with a few flaws but one major improvement. The newly announced DJI Mini 3 Pro drastically improves image quality, but at a starting price of $759 (with the remote controller), it is no longer easy to recommend for everyone.  Read more:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22924203",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(whimsical music) - Here's the thing, I'm a bit torn. DJI's Mini 2 has been one of my favorite drones. They have the perfect balance between good enough image quality, fantastic portability, and decent price. And every single time when somebody, especially a new drone pilot ask me which drone they should buy, the answer is pretty much always the DJI's Mini 2. So DJI recently announced the Mini 3 Pro and made a very strong case that this drone should be your next best hobbyist drone. It has a bigger camera sensor, 4K60, HDR video, larger aperture, 48 megapixel photos, obstacle avoidance sensor. It is jam packed with new features, but it's also a lot more expensive than the Mini 2, so why am I torn? Well, my review process was really a mixed bag. (energetic upbeat music) Okay, quick disclaimer, I didn't have any ND filters for this drone, they're not part of the Fly More Pro Bundle. So some clips do look a bit choppy. And since this aperture goes down all the way to f/1.7, my shutter speeds were highly wild, wildly high. Don't let that cloud your judgment when you're looking at video quality here. Got it? All right. Let's get into it. Starting with the hardware. Compared to the Mini 2, the Mini 3 Pro is just ever so slightly larger. It's a bit longer, a bit taller and a bit wider when folded, but you will notice it when it's unfolded. The wingspan is much larger, which means this drone is not quite as nimble as the Mini 2. And you can definitely feel the difference in greater inertia when you're flying this drone. It is a completely new design and it still achieves that 249 grams of weight when used with the standard 37-minute battery. Although it does go over 250 grams of weight when you're using the brand new, bigger $95 battery, that gives you amazing 47 minutes of flight time, but, but I've been having a lot of issues with all those batteries. So whenever I would switch to Sport Mode and just fly for fun, or I'm trying to get to the point of interest quickly, I would get a battery load error. Especially during windy conditions, and when the drone needs to work extra hard to keep itself balanced. It either just comes to a full stop or it starts losing altitude like in this clip that you're watching right now. It doesn't look as bad since the footage it stabilizes, but it's very anxiety inducing, just looking at your drone with naked eye, just sort of doing its own thing. So, okay. I just heard back from DJI and they say that what I've been doing is flying under extreme wind conditions, which I do admit, there were days when it was extremely windy, but there were also days when it wasn't as windy. And just by flying drones for like 7 to 10 years now, you sort of developed this like sixth sense when you kind of know if it's too windy or not. And more often than not, I was getting the battery load error in the flights that it didn't seem like it was going to be too windy. So to summarize, yes, the Mini 3 Pro can handle high winds, but the battery in the Mini 3 Pro might not be able to. (lively upbeat music) One new hardware thing are the obstacle sensors. Mini 2 never had any, but the Mini 3 Pro has a pair of front and at the bottom. They create a tri-directional obstacle avoidance forward, backwards, and below, and open up options for autonomous flying. Things like Hyperlapse, MasterShots, ActiveTrack paired with APAS 4.0, which means the drone can follow you around and avoid trees and buildings and such. But the thing you need to know about ActiveTrack and APAS is that it does not work above 4K30. And it also does not work in Portrait Mode, which is a real bummer. I personally rarely fly with sensors on, but it is a good extra layer of protection, most people really care for it. It did successfully follow me around walking into woods, backwards and forward, but once I have switched to that profile Follow, so it can follow me from the side. It literally hit a tree like seconds later. And this actually isn't my only crash with the Mini 3 Pro. While filming this ski lift right here. I tilted my camera upwards and that's when the drone just started to descent slowly straight into the ground. I wasn't able to stop it or change directions or anything. I truly have no idea what happened here. I shared the flight logs with DJI and I will pin the comment as soon as I hear back. Lastly, while I was sharing my flight logs with DJI, I noticed yet another suspicious behavior with the Mini 3 Pro. While the drone was connected to my PC, and it was extracting flight logs with the DJI assistant app. It started to overheat, just by having it running idle and not in flight for longer periods of time. It would start to overheat, and it would eventually turn itself off. So I talked to DJI about it. And what they said is that in order to achieve the 249 grams of weight, they had to remove the internal fan from the Mini 3, which does cost the chip to overheat when idle. In flight, cooling is achieved with the help from rear propellers to feed the air into the set of holes right here. DJI says, \"There's nothing to worry about. The internal thermometer will power off the drone in order to avoid any further damage.\" And it should have enough time for firmware updates, wirelessly transfer photos using QuickTransfers, but I still find this whole thing a bit awkward. Okay. I think it's time to move on and talk about the good stuff. And that is image quality. (dramatic upbeat music) So compared to the previous Mini 2, the leap in image quality is immediately evident and is achieved through a number of things. First, there's the larger sensor and the larger f/1.7 aperture. Larger sensor just helps with overall image clarity, and larger aperture lets more light hit that sensor. So your night images are looking a whole lot better. Here, I'm flying the Mini 2 with it's 2.8 aperture, and I have to keep my ISO at 3,200. With the Mini 3, that number is closer to ISO 800. That's a big difference between the two. Mini 3 Pro also has dual native ISO, so your night videos really do look great. I mean, it's still a small sensor, so you know, it looks good. Also the Mini 2 never actually had Cinelike profiles. So the Mini 3 just has a lot more detail to work within post production, too. Few other things that improve this drone is that it can now film 4K60, and it can film HDR video. Just know that HDR video only works up to 4K30. There is a slight improvement in video quality while filming in HDR, but it doesn't necessarily make me wanna choose 24 or 30 frames per second instead of 60. I mostly shot in 60 because, again, I didn't have ND filters. And also lately I just been shooting in 4K60 for my personal drone work. And I didn't feel like I was missing out by not having HDR on, and I just kept filming in Cinelike profile. Mini 2 never reached 4K60, so I'm really pleased to see it here. (energetic upbeat music) And the last thing that really makes this drone stand out is the ability to film vertical videos and photos natively just by rotating its gimbal. I love this feature so much. I love being able to film a 9:16 ratio instead of cropping regular 16:9 video. Even when it comes to photos, I love being able to take vertical photos natively. Before the rotating nimble, you would have to take three separate images that DJI app would more or less be able to stitch together correctly. Plus it's just way easier and more fun to frame up and compose your photos that way instead of doing the three image stitching. It's a different mindset and I missed it. Also this way, you get that native wide-angle distortion, just as Lance Scott intended. Okay. I really like this feature. Lastly, there's also Digital Zoom on this drone except it also does not work in 4K60. I don't love Digital Zoom, but it does mean you could do fun things like valley zoom clips or help you locate other drones flying near you. Hey there, drone buddy. (lively upbeat music) And when it comes to photos, I think they look really good. Despite the large f/1.7 aperture. There's really not a massive drop off in sharpness even in the corner of the images. It looks really nice. JPEGs you get from the drone are sharp, rich, and vibrant. You can take either 12 megapixel photos or turn on the 48 megapixels photos. And 12 megapixels photos look really good. And honestly, I don't see a lot of improvements when turning on the 48 megapixel ones. It's actually quite the opposite. So let's pixel peak. So as you can see this example here, the night photos actually show a little bit more noise in the shadow here. This next side by side photo reveals a couple of things I wanna focus on. First, I don't necessarily see a lot more detail between the two. Zooming in on the plants here on the side of the building, these two photos look very similar to me. Next, the two photos display colors differently. The 12 megapixel ones lean more towards the green hue, and the 48 megapixel one leads more towards purple. You can see it in the buildings in the back, but you can definitely see it on this road sidewalk down here. I pick a cleaner photo over more pixels any day of the week and Sunday. I'm not using that. Also just really enjoy editing raw photos from the DJI drones, including this one. Here's a challenging shot of the lifeguard chair during a sunset. But there's so much information to play with for a nice clean edit. And just to prove that point further, I'm dragging the exposure slider back and forth. Look how much you can get out of a single raw. It is awesome. (energetic upbeat music) Okay, so this leaves us with one less thing to talk about and that is the new DJI RC. It's a remote controller with a built-in screen, so you no longer have to use your phone. It is a smaller version of DJI's RC Pro, which itself is great, but it's also super expensive and fairly heavy to lug around for long time. The screen isn't as bright. And you will notice that if your use of the RC Pro. The battery's fantastic I would charge it every now and then, but it was never a point of worry. I probably got around 30 or more flights when I first charge him back to 100%. But the only thing I think I was missing is the physical back button. The software itself was a bit slower. So there's always a split second of doubt, when you're wondering if you're actually press the back button on the screen. And what annoying thing is that DJI is making the controller work only with the Mini 3 Pro at launch. And to make things even worse, you won't be able to buy it as a standalone product. I really hope that changes soon. (energetic upbeat music) And if you do decide to buy the bundle with the DJI RC included, it'll cost you $909. The bundle with the standard remote will cost you $759. And DJI's doing something new this time around. You can buy just a drone without any remotes, if you happen to already have one. That option would cost you $669. And you can also add the $189 Fly More Kit, which includes two extra batteries, carrying case, more propellers, charging hub, or you can get the $249 Fly More Pro Kit, which gives you all the things above except swaps the standard batteries with the extended ones. So basically, you're looking at 30% increase in price over the Mini 2 Fly More Combo, which still is $600. And that seems to be the current trend with DJI drones. Each one of them is becoming more and more expensive. And I get it, you're getting a lot more than you ever did with the Mini 2. So you can sort of justify that price, but it's no longer an entry-level drone. But hey, this is the Mini 3 Pro. Perhaps, we'll get a non-pro version next summer. (energetic upbeat music) Mini 2 was and still is an incredible drone with great battery, portability, connectivity, good enough image quality, and price. And the Mini 3 Pro drastically improves of one of those things, which is the image quality. And it's probably the thing that I care about most. So I am torn because I also need to trust my drone that it's not gonna fall out this sky, and a lot of the time during this review, I didn't. I felt like something could go wrong. Hopefully this issues could be addressed before the drones started shipping to consumers this summer. One time that I was flying, it was so windy that I couldn't could not land the drone. So what I did, I just crashed it into the building on purpose. (chuckles) And that was the only way I could land the drone. But it's totally fine. Which means that this drone is pretty robust. Thanks for watching.",
    "transcript_keywords": [
        "Mini",
        "DJI",
        "drone",
        "Pro",
        "DJI Mini",
        "DJI drones",
        "photos",
        "thing",
        "Things",
        "drones",
        "time",
        "Fly",
        "bit",
        "image quality",
        "lot",
        "image",
        "larger",
        "HDR",
        "battery",
        "HDR video"
    ],
    "transcript_entity_values": [
        "MasterShots",
        "37-minute",
        "Mini 2",
        "one",
        "909",
        "249 grams",
        "30",
        "189",
        "Digital Zoom",
        "the Mini 3",
        "249",
        "three",
        "95",
        "ISO 800",
        "the Mini 2",
        "ISO",
        "DJI RC",
        "48",
        "30%",
        "Portrait Mode",
        "next summer",
        "60",
        "12 megapixels",
        "Lance Scott",
        "DJI",
        "100%",
        "QuickTransfers",
        "9:16",
        "ND",
        "two",
        "over 250 grams",
        "sixth",
        "600",
        "Sport Mode",
        "One",
        "24",
        "3,200",
        "Sunday",
        "47 minutes",
        "12 megapixel",
        "like 7 to 10 years",
        "APAS",
        "the Fly More Pro Bundle",
        "second",
        "4K60",
        "the Mini 2 Fly More Combo",
        "RC Pro",
        "759",
        "Cinelike",
        "the RC Pro",
        "first",
        "the Mini 2",
        "this summer",
        "48 megapixels",
        "Hyperlapse",
        "Mini 2",
        "48 megapixel",
        "2.8",
        "ND",
        "ActiveTrack",
        "First",
        "669"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "FAC",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "EVENT",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY"
    ],
    "vector": [
        0.0017653685063123703,
        -0.005728946533054113,
        -0.027656152844429016,
        -0.10233940929174423,
        0.055369406938552856,
        -0.011538575403392315,
        -0.019499044865369797,
        0.01613125577569008,
        0.025002041831612587,
        0.08137880265712738,
        -0.00259197736158967,
        0.020630132406949997,
        0.01898897998034954,
        -0.006127866916358471,
        0.051733195781707764,
        0.023089099675416946,
        0.11438900977373123,
        -0.016602113842964172,
        0.02074356935918331,
        0.028926054015755653,
        -0.060998208820819855,
        -0.020131787285208702,
        0.03660489618778229,
        -0.023679174482822418,
        -0.05969439819455147,
        0.02288864366710186,
        -0.018114132806658745,
        0.03197070211172104,
        -0.030679339542984962,
        -0.033923711627721786,
        0.06120942160487175,
        0.1571095585823059,
        -0.021509939804673195,
        -0.06740517169237137,
        0.05061013996601105,
        -0.01335445698350668,
        0.008734896779060364,
        -0.08435443788766861,
        0.002382005099207163,
        -0.03907167539000511,
        0.022404801100492477,
        -0.03042905405163765,
        0.021496759727597237,
        -0.06284656375646591,
        -0.06169147044420242,
        -0.05828559026122093,
        0.03685734048485756,
        -0.06837944686412811,
        0.09565480798482895,
        -0.07992319017648697,
        -0.07082407921552658,
        -0.11526652425527573,
        0.055454403162002563,
        -0.04453964903950691,
        0.029414013028144836,
        -0.018246905878186226,
        -0.010500705800950527,
        0.008989065885543823,
        -0.005077543202787638,
        -0.09491728991270065,
        0.026220116764307022,
        -0.038617540150880814,
        0.022860685363411903,
        -0.030410468578338623,
        0.027573237195611,
        -0.09273140877485275,
        -0.008424313738942146,
        -0.040137507021427155,
        0.030872955918312073,
        0.024431001394987106,
        -0.0735010877251625,
        0.01717573218047619,
        0.001117968698963523,
        0.026736387982964516,
        0.034887395799160004,
        0.015066547319293022,
        0.1364448219537735,
        -0.006625575944781303,
        -0.01900363899767399,
        -0.04683956131339073,
        0.016631118953227997,
        -0.04691905155777931,
        -0.11502910405397415,
        -0.02463172934949398,
        -0.019733114168047905,
        -0.05692790448665619,
        0.023287149146199226,
        0.062412481755018234,
        -0.0021834373474121094,
        -0.060048945248126984,
        0.005346940830349922,
        0.008716974407434464,
        -0.026525750756263733,
        -0.019850416108965874,
        0.04927685856819153,
        -0.015478625893592834,
        -0.030189059674739838,
        -0.12183438986539841,
        0.022442607209086418,
        0.0328298918902874,
        0.06373543292284012,
        -0.041137486696243286,
        0.02028008922934532,
        -0.06477867811918259,
        -0.007404092233628035,
        -0.06426885724067688,
        0.06860991567373276,
        0.04794253408908844,
        0.06936736404895782,
        -0.0011436367640271783,
        -0.06390508264303207,
        0.02737395465373993,
        -0.06517860293388367,
        0.03122410550713539,
        -0.040762223303318024,
        0.10582046210765839,
        0.05003756284713745,
        0.08878423273563385,
        0.043184272944927216,
        -0.012166501954197884,
        -0.018838055431842804,
        -0.07948975265026093,
        0.05329279229044914,
        0.007916392758488655,
        0.060400571674108505,
        -0.004093663766980171,
        -0.10814712196588516,
        3.75385121056474e-33,
        -0.04568848758935928,
        0.12004060298204422,
        -0.04949848726391792,
        -0.009652476757764816,
        0.04910966381430626,
        -0.006550385616719723,
        -0.04351921007037163,
        -0.00462788250297308,
        -0.008029281161725521,
        -0.009599248878657818,
        -0.06125467270612717,
        0.0008378871716558933,
        -0.04307938739657402,
        0.08648619800806046,
        0.06804046034812927,
        -0.09271793067455292,
        -0.08251719921827316,
        -0.01634657382965088,
        -0.03987487033009529,
        -0.03157227486371994,
        0.010647050105035305,
        -0.025827819481492043,
        0.03284614160656929,
        -0.003169477451592684,
        0.12690423429012299,
        -0.022101610898971558,
        0.08833348751068115,
        -0.0260957982391119,
        0.08914507180452347,
        0.011923938058316708,
        -0.03618597611784935,
        -0.021744340658187866,
        -0.029128482565283775,
        -0.04482441395521164,
        -0.00985728669911623,
        0.05964389070868492,
        -0.07209114730358124,
        -0.05773380398750305,
        -0.07988878339529037,
        -0.03345929831266403,
        -0.030722996219992638,
        0.07082241028547287,
        -0.0526350699365139,
        -0.033196426928043365,
        0.004833607468754053,
        -0.010850447230041027,
        0.020947447046637535,
        -0.001748785376548767,
        0.021981138736009598,
        -0.03379508852958679,
        -0.004186434205621481,
        0.007302687969058752,
        -0.040175363421440125,
        -0.03278180956840515,
        -0.05643712356686592,
        -0.07263816148042679,
        0.07970346510410309,
        -0.02724389173090458,
        0.035830702632665634,
        -0.01151470560580492,
        0.00561896525323391,
        -0.03893527016043663,
        -0.06493191421031952,
        0.013077138923108578,
        -0.019052207469940186,
        0.12262021750211716,
        0.0895790308713913,
        0.03330554813146591,
        -0.012870512902736664,
        0.06338164955377579,
        -0.03196154534816742,
        0.041468266397714615,
        0.05295717716217041,
        -0.0923847183585167,
        0.07378655672073364,
        0.023669429123401642,
        -0.07524216920137405,
        -0.04597786068916321,
        0.06095900386571884,
        0.03337565064430237,
        -0.08449185639619827,
        0.11939340829849243,
        -0.02251490391790867,
        0.049367524683475494,
        -0.053398314863443375,
        -0.012020738795399666,
        0.00578985596075654,
        0.015011527575552464,
        -0.044460758566856384,
        0.0009564715437591076,
        -0.01564422808587551,
        0.03373101353645325,
        -0.02564271353185177,
        0.028559600934386253,
        -0.018845751881599426,
        -4.965626092499204e-33,
        -0.0837424024939537,
        0.0033958484418690205,
        0.038326188921928406,
        0.043912746012210846,
        0.00023975751537363976,
        -0.08035708963871002,
        0.01959456317126751,
        0.04559263214468956,
        0.03817146643996239,
        -0.031729310750961304,
        0.010815509594976902,
        -0.008642223663628101,
        -0.054396454244852066,
        0.01290670596063137,
        -0.0037230534944683313,
        -0.023523254320025444,
        -0.0662662610411644,
        -0.12732723355293274,
        0.13056042790412903,
        -0.0027520358562469482,
        0.12826742231845856,
        0.10344356298446655,
        0.002806707052513957,
        -0.01383254211395979,
        -0.025960763916373253,
        0.04202071949839592,
        0.01852268911898136,
        0.058311138302087784,
        -0.01912294328212738,
        -0.05996162071824074,
        -0.015065373852849007,
        -0.07899857312440872,
        -0.011830729432404041,
        0.012791345827281475,
        0.0644209235906601,
        0.06835825741291046,
        -0.04637039452791214,
        0.008141211234033108,
        -0.0668560117483139,
        0.031966570764780045,
        0.02319534868001938,
        0.0486825667321682,
        0.010533513501286507,
        -0.022312693297863007,
        -0.02735779620707035,
        -0.1187002956867218,
        -0.004694072529673576,
        0.02466978318989277,
        -0.008078416809439659,
        0.02786831557750702,
        -0.027906611561775208,
        -0.023371895775198936,
        0.035454392433166504,
        -0.02632134221494198,
        0.0158365610986948,
        -0.0179397352039814,
        -0.030628254637122154,
        0.0855742022395134,
        0.0589509941637516,
        0.0554974302649498,
        0.000211051432415843,
        0.0030137579888105392,
        -0.07574549317359924,
        0.00725560262799263,
        -0.07608061283826828,
        0.0759902149438858,
        0.09769540280103683,
        0.051983751356601715,
        0.02250559814274311,
        0.02003239467740059,
        0.0325407050549984,
        0.005884143989533186,
        0.010239558294415474,
        -0.006806750316172838,
        -0.05765348672866821,
        0.04235357418656349,
        -0.03812938183546066,
        0.04619251936674118,
        0.08620753884315491,
        -0.044800084084272385,
        0.01591983623802662,
        -0.01030738465487957,
        -0.006347048096358776,
        0.023307975381612778,
        0.08837759494781494,
        0.07208152860403061,
        -0.02372973971068859,
        -0.017693975940346718,
        -0.04221202805638313,
        0.02028679847717285,
        0.017599813640117645,
        0.0008845385164022446,
        0.05169793218374252,
        0.06296410411596298,
        -0.06912660598754883,
        -5.1081588736678896e-08,
        -0.006173647474497557,
        -0.004947721492499113,
        0.01942514255642891,
        0.003380386857315898,
        0.006117329467087984,
        -0.05232103168964386,
        1.7480922906543128e-05,
        0.002516144886612892,
        0.026885582134127617,
        0.035707760602235794,
        0.057569485157728195,
        -0.112675242125988,
        -0.037584710866212845,
        0.02394072152674198,
        0.026456190273165703,
        0.09629087150096893,
        -0.059353433549404144,
        -0.016491200774908066,
        -0.008467028848826885,
        -0.015803800895810127,
        -0.09091485291719437,
        0.06039274111390114,
        0.01595672219991684,
        -0.06841589510440826,
        -0.026951802894473076,
        0.08359171450138092,
        -0.0653102844953537,
        -0.030891073867678642,
        0.003517035860568285,
        -0.0340193547308445,
        -0.024715611711144447,
        0.06660390645265579,
        -0.012959230691194534,
        0.04084103927016258,
        -0.057948026806116104,
        -0.07275968790054321,
        -0.043494340032339096,
        -0.016083918511867523,
        0.054112955927848816,
        0.06129058077931404,
        0.03283974528312683,
        -0.048120394349098206,
        -0.07151485234498978,
        -0.029832135885953903,
        0.02687656506896019,
        -0.027171220630407333,
        -0.009957736358046532,
        -0.1318100392818451,
        -0.07621002197265625,
        0.003995229490101337,
        0.05187418684363365,
        -0.024503393098711967,
        0.016505571082234383,
        0.06823001801967621,
        0.028074249625205994,
        0.03548479825258255,
        -0.05879119783639908,
        0.0027467715553939342,
        -0.02228393591940403,
        0.051033131778240204,
        0.07409825921058655,
        -0.0255549605935812,
        -0.02731156349182129,
        0.09166581928730011
    ]
}