{
    "id": "O7ixEvnm2ok",
    "title": "A Phone Camera To Flip For: ASUS Zenfone 8 / 8 Flip Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-05-12T17:33:17Z",
    "video_url": "https://www.youtube.com/watch?v=O7ixEvnm2ok",
    "category": "Science & Technology",
    "tags": [
        "zenfone 8 review",
        "zenfone 8 flip review",
        "zenphone 8 review",
        "asus zenfone",
        "flip camera phone",
        "flip phone",
        "flip phone 2021",
        "asus phone",
        "best cameraphone 2021",
        "best vlogger phone",
        "vlogging phone"
    ],
    "views": 277770,
    "likes": 13327,
    "comments_count": 706,
    "description": "If youre looking for something a little different when it comes to your laptops and smartphones, ASUS has gotta be one of your go-tos. Using the companys dual-screen laptops over the past couple years has changed what I expect from a mobile computer  and the latest ROG Phone is so well-equipped, it tempted even a non-gamer like myself.   Compared to those envelope-pushers, ASUSs two new Zenfones are far tamer offerings. Thats because theyre trying to appeal to a more mainstream audience, while still offering features other manufacturers have mostly written off. The question is whether either one goes far enough.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S ZENFONE 8 REVIEW/ZENFONE 8 FLIP REVIEW]  This review was produced following seven days with a Zenfone 8 review sample and a Zenfone 8 Flip review sample, each provided by ASUS and tested on AT&T in Brooklyn and Eastern Long Island, NY. The devices were running the latest software available at the time of review: version 30.10.46.64 for the Zenfone 8, and version 30.10.39.62 for the Zenfone 8 Flip.   MrMobile does not accept compensation from the manufacturers of the products he reviews in exchange for producing content. No payment was provided and no manufacturer or carrier was afforded a preview or copy approval rights concerning this review.    [LINKS]  ASUS Zenfone 7 UNWRAPPING [Joshua Vergara]:   Xiaomi Mi 11 Ultra Review [Android Central]:       [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #zenfone8 #zenfone8flip #asus #zenfone #flipphone #flipcamera #smartphone #tech",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.youtube.com/watch?v=z4UUkFC6z7Q",
        "https://www.androidcentral.com/xiaomi-mi-11-ultra-review",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- If you're looking for something a little different when it comes to your laptops and smartphones, Asus has got to be one of your go tos. Using the company's dual screen laptops over the past couple of years has changed what I expect from a mobile computer. And the latest ROG phone is so well equipped, it tempted even a non gamer like myself. Now, compared to those envelope pushers, Asus has two new Zenfones are tamer offerings and that's because they're trying to appeal to a more mainstream audience while still offering features other manufacturers have mostly written off. The question is whether either one goes far enough. (upbeat music) Fair warning. To appreciate the first phone I'm going to talk about today, you need to care about phone cameras. And even if you don't, you've gotta admit this is cool. See, almost every contemporary smartphone makes you sacrifice photo quality if you take a selfie, because those front-facing cameras are almost always cheaper components. The problem has gotten worse in recent years because those selfie shooters are also placed within the display, which necessitates a notch or a hole punch cutout and also limits the field of view. But the Zenfone 8 Flip solves both problems, with the mechanism that gives the phone its name. All three of its main cameras are mounted on a motorized module that rotates out from a recess on the back. That means when it comes time for a selfie, you don't have to sacrifice any quality. Because remember, you're still shooting with those main cameras, they're just turned around to face you. While this is the first time I've used Zenfone Flip, Asus has been doing this for several years. And that experience shines through in features custom tailored for vloggers. You can set the camera to any angle you want using the volume keys. Which is useful if you want to go hands-free without a tripod. Just watch out for that camera timeout. If you do have a tripod, things get better. You can use object tracking to follow a subject even if it leaves the frame by physically steering the camera. And for you product reviewers out there, that same mode will keep focus on a subject you select instead of defaulting to your face. You can also steer the audio input from the three microphones on the device, or compensate for wind noise. The optics module is made from metal specially designed to resist deformation if you drop it. But it shouldn't ever come to that, because the phone's accelerometer detects falls and retracts the camera automatically before it hits the floor. Now, astute Asus fans may find this phone familiar. The design, size, even the cameras are the same as last year right down to the sensors, which wouldn't be a problem if their performance was a bit better. But to have a competitive camera in 2021, you need one with excellent dynamic range, because hey, sometimes the only way to get a group shot is when you're backlit. And sometimes the only way to get that contemplative cafe capture is to combat a lot of contrast. The cameras aren't bad. And I should also say that this is non-final software, but remember, it is last year's hardware and the lack of optical stabilization stings as well. So yeah, the whole thing just feels rather iterative, which to be fair, makes sense. Because Asus went out of its way to say that this is not considered a sequel to the Zenfone 7 Pro. I don't know, maybe that means we can hold out hope for a Zenfone 8 Flip Pro at some point in the future, hopefully with a better name. Now, despite being the smaller sibling, this phone is Asus' actual flagship for 2021. This is the Zenfone 8, no flip, no mini, just 8. And it's small stature belies the potent powerhouse beneath. It settles for two cameras and a 4,000 milliamp hour battery instead of the Flip's 5,000. But just like its bigger brother, it's powered by a top of the line Snapdragon 888 and it takes the specs up a skosh pretty much everywhere else. The main camera is optically stabilized, the dual speakers are backed up by the headphone jack that's missing on the Flip, and the same goes for IP 65 and IP 68 dust and water resistance. There's also double the ram, which you probably won't notice, and a higher 120 hertz refresh rate on the screen, which you might. That's a lot of capability for a compact smartphone. And I'm very happy to see a manufacturer other than Sony stepping up and the small phone space. Just like on the Flip, the Android 11 software is lightweight. And what changes Asus has made are mostly for the better. My favorite being a programmable shortcut key, so you choose what happens both when you long press and when your double click. But am I going to be rushing out to replace my Pixel 5 or iPhone 12 Mini with this phone? Just like with the Flip, the answer is probably not. That's because of a few, mostly minor, but still significant misses. While the speakers are wonderful, phone call quality through the earpiece is mediocre on both. There's no wireless charging on either phone, which I always consider a waste of a good glass back plate. The under display fingerprint sensors behaved during filming, of course. But in actual use, I found them less consistent than other modern devices. And while looks are subjective, to me these just aren't very attractive phones. Despite the Flip camera on the big one and the whole punch on the small one, there's a substantial chin beneath the display on each and neither pushes the envelope aesthetically in any way. Even the colors are limited to boring black, white or some kind of antimony in between. But the only thing about them is their bottom mounted notification LEDs, which took me back to my Star-Tack days. If you can live with the compromises, you can pick up the Zenfone 8 for a starting price of 599 euro for the small one and 799 for the Flip. Those are pretty competitive prices for a phone that brings solid specs to the compact category and a phone that carries a one of a kind camera array. Oh, and props to Asus for packing in not just a charger but a case with each, complete with a selfie inhibiting switch for the Flip. But I still think the iterative nature of the Flip and the aesthetic timidity of the 8 will lead to fewer sales than might otherwise have been the case. With foldables, colossal cameras and gaming phones, some from Asus itself, finally injecting some fun back into smartphones after years I just can't help wishing the company had decided to make a stronger statement with its latest Zenfones. The review was produced following seven days with Zenfone 8 and 8 Flip review samples provided by Asus. But as always, the company had no editorial input into this content. It received note early preview of same and it provided no compensation for its creation. Please, subscribe to the MrMobile on YouTube if you'd like to see more videos like this. Until next time, thanks for watching. And if it's available where you live, please do what I did and get that vaccine so we can all, once again, stay mobile, my friends.",
    "transcript_keywords": [
        "Flip",
        "phone",
        "Asus",
        "Zenfone",
        "cameras",
        "camera",
        "Zenfone Flip",
        "Flip camera",
        "main cameras",
        "latest ROG phone",
        "phone cameras",
        "Flip Pro",
        "ROG phone",
        "years",
        "Zenfones",
        "selfie",
        "laptops",
        "small",
        "back",
        "phones"
    ],
    "transcript_entity_values": [
        "2021",
        "5,000",
        "seven days",
        "4,000 milliamp hour",
        "12",
        "65",
        "last year's",
        "the Zenfone 7 Pro",
        "hertz",
        "Snapdragon 888",
        "recent years",
        "Fair",
        "Pixel 5",
        "the past couple of years",
        "the same as last year",
        "today",
        "first",
        "799",
        "YouTube",
        "jack",
        "Asus",
        "599 euro",
        "two",
        "Flip",
        "ROG",
        "Asus",
        "several years",
        "MrMobile",
        "68",
        "11",
        "120",
        "Sony",
        "three",
        "Android",
        "8"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.13949266076087952,
        -0.011074503883719444,
        0.001734439516440034,
        -0.034089796245098114,
        0.0211435966193676,
        -0.03036518581211567,
        -0.013622579164803028,
        0.11738428473472595,
        -0.025233523920178413,
        -0.023248901590704918,
        0.01236058957874775,
        0.060718853026628494,
        -0.029317092150449753,
        0.027141278609633446,
        0.00491640018299222,
        0.002717874478548765,
        0.08788826316595078,
        -0.09877696633338928,
        0.0034187769051641226,
        0.06040550023317337,
        0.013684903271496296,
        -0.10363102704286575,
        0.09659552574157715,
        -0.037241190671920776,
        0.04493705928325653,
        -0.04474224895238876,
        -0.029797770082950592,
        -0.03695166856050491,
        -0.021206822246313095,
        -0.03071087785065174,
        0.026971878483891487,
        0.10946524888277054,
        0.004510599188506603,
        0.030458906665444374,
        -0.08560314774513245,
        -0.09517040848731995,
        0.029541650786995888,
        -0.021676765754818916,
        -0.04284144565463066,
        -0.021839462220668793,
        -0.059950944036245346,
        -0.005023644305765629,
        -0.04352704808115959,
        0.006829674355685711,
        0.026417719200253487,
        -0.07464553415775299,
        0.047242261469364166,
        -0.04838362708687782,
        0.024790996685624123,
        -0.021387452259659767,
        0.010171767324209213,
        -0.010842529125511646,
        -0.014122848398983479,
        0.013519708067178726,
        -0.1441962718963623,
        0.12693001329898834,
        -0.056325532495975494,
        0.00889192707836628,
        0.01808806136250496,
        0.030086079612374306,
        0.046780191361904144,
        -0.014385691843926907,
        -0.05776917189359665,
        0.08252612501382828,
        0.00955803133547306,
        0.0024126777425408363,
        -0.011331492103636265,
        -0.08613570034503937,
        0.012816806323826313,
        0.0006950463284738362,
        -0.07861485332250595,
        0.04536597058176994,
        0.05030926316976547,
        0.03330099955201149,
        -0.034436002373695374,
        0.029905682429671288,
        0.02577820234000683,
        0.003088089171797037,
        -0.02927420660853386,
        -0.05404825881123543,
        0.08557090163230896,
        -0.02704833447933197,
        0.017867501825094223,
        -0.042240310460329056,
        0.11765898764133453,
        0.016892485320568085,
        -0.0059399791061878204,
        0.10506641864776611,
        -0.013159587047994137,
        -0.03877085819840431,
        -0.042793940752744675,
        0.11266294866800308,
        0.026706885546445847,
        -0.02704145759344101,
        -0.027651477605104446,
        -0.045585379004478455,
        0.06523261219263077,
        -0.07018634676933289,
        -0.02133176103234291,
        0.07552764564752579,
        0.07781171798706055,
        0.01818283461034298,
        0.05478079244494438,
        0.0012675266480073333,
        0.03940967097878456,
        -0.047510989010334015,
        -0.017170360311865807,
        -0.051345616579055786,
        -0.03634355589747429,
        0.02579524926841259,
        0.00231154658831656,
        0.01989760249853134,
        0.023660166189074516,
        -0.08776775747537613,
        -0.001126218237914145,
        -0.008167180232703686,
        -0.006346871145069599,
        0.07654931396245956,
        0.04663719981908798,
        0.00789001863449812,
        -0.04066462069749832,
        -0.07049425691366196,
        -0.09524393826723099,
        -0.07741528749465942,
        0.059226177632808685,
        0.06443241238594055,
        -0.09207574278116226,
        7.394176115462941e-33,
        -0.022791067138314247,
        0.12119138240814209,
        -0.011894138529896736,
        -0.040381185710430145,
        -0.06739822775125504,
        0.018419241532683372,
        0.015558728948235512,
        0.002640641061589122,
        -0.003923920914530754,
        -0.0014397110790014267,
        0.003185371169820428,
        -0.006168123800307512,
        -0.039628125727176666,
        0.026178399100899696,
        0.04788850620388985,
        -0.03039384074509144,
        -0.027880605310201645,
        -0.015255478210747242,
        -0.026212776079773903,
        -0.057557106018066406,
        0.010485021397471428,
        -0.021872147917747498,
        -0.015107814222574234,
        -0.01660534180700779,
        0.04850681498646736,
        -0.022672215476632118,
        0.03821059688925743,
        -0.013386202976107597,
        -0.0033471151255071163,
        -0.0075857313349843025,
        -0.052544280886650085,
        -0.037218570709228516,
        -0.06106193736195564,
        -0.08020436018705368,
        0.0011747233802452683,
        0.013973602093756199,
        -0.09707431495189667,
        -0.14444418251514435,
        0.0176377035677433,
        -0.08754165470600128,
        -0.04570848494768143,
        0.03871411085128784,
        -0.09648388624191284,
        0.01856696419417858,
        0.02110586129128933,
        -0.007303025107830763,
        -0.03659915551543236,
        -0.0036318679340183735,
        0.009069608524441719,
        -0.009997722692787647,
        -0.0757770761847496,
        -0.02468862757086754,
        -0.06571982800960541,
        -0.0021139502059668303,
        -0.06158461421728134,
        -0.012846452184021473,
        0.07419393211603165,
        0.01772126741707325,
        0.06829071789979935,
        0.060742445290088654,
        0.059512607753276825,
        -0.026614312082529068,
        -0.07831721007823944,
        -0.04452298954129219,
        -0.11463949829339981,
        0.07534168660640717,
        0.024726536124944687,
        -0.0048889052122831345,
        -0.08678209781646729,
        0.06559668481349945,
        0.03342076390981674,
        -0.006853193044662476,
        0.013279731385409832,
        -0.037780772894620895,
        0.05163896083831787,
        0.04613511636853218,
        -0.03553361818194389,
        -0.0009109172387979925,
        -0.024706609547138214,
        -0.022514181211590767,
        -0.028357455506920815,
        0.058401647955179214,
        0.013312255032360554,
        0.04472275823354721,
        0.018639689311385155,
        -0.04147488623857498,
        0.03273949399590492,
        -0.04635533690452576,
        -0.052499640733003616,
        0.11407450586557388,
        0.003505012020468712,
        0.007918999530375004,
        0.012491793371737003,
        0.017847908660769463,
        -0.025118453428149223,
        -5.529918849533581e-33,
        -0.13015486299991608,
        0.01281307265162468,
        -0.08378808945417404,
        0.00032474813633598387,
        -0.01057899184525013,
        -0.03914352133870125,
        0.08016367256641388,
        0.0610065758228302,
        -0.010178059339523315,
        -0.11924193799495697,
        0.018746711313724518,
        0.024062244221568108,
        0.04702484980225563,
        0.042797692120075226,
        0.0286425668746233,
        -0.025478165596723557,
        0.016909275203943253,
        -0.11565805226564407,
        0.07853762805461884,
        0.029638901352882385,
        0.0473138727247715,
        0.0631401464343071,
        0.029713984578847885,
        0.11999420821666718,
        -0.00011870671733049676,
        -0.015698786824941635,
        0.03949548304080963,
        -0.0034293190110474825,
        0.03710681572556496,
        -0.014914457686245441,
        0.08205849677324295,
        -0.06719204038381577,
        0.028201309964060783,
        0.07036434859037399,
        0.07971922308206558,
        0.03342520073056221,
        0.04008207097649574,
        -0.0010649396572262049,
        -0.060913972556591034,
        -0.002770624589174986,
        0.04549797251820564,
        -0.014542261138558388,
        0.07058216631412506,
        0.0018677451880648732,
        0.007826734334230423,
        -0.05463322997093201,
        -0.037807878106832504,
        0.005863785743713379,
        -0.05155426636338234,
        -0.023218264803290367,
        -0.004413915332406759,
        0.02276921272277832,
        -0.07859113067388535,
        -0.001773568568751216,
        -0.009153892286121845,
        0.005290788132697344,
        0.03167910501360893,
        -0.06695565581321716,
        0.002421022392809391,
        0.013212407007813454,
        0.07444903254508972,
        0.0396667942404747,
        -0.015492590144276619,
        -0.06556659191846848,
        0.009923888370394707,
        0.05323945730924606,
        0.09210234135389328,
        0.03971882537007332,
        -0.03557440638542175,
        0.026684990152716637,
        -0.04764263704419136,
        0.005744514055550098,
        0.05506838485598564,
        -0.030252797529101372,
        0.041294246912002563,
        0.045399636030197144,
        0.0017267911462113261,
        0.03955766186118126,
        -0.018729588016867638,
        -0.02102576568722725,
        -0.02375483512878418,
        -0.048401448875665665,
        0.06174466758966446,
        0.05678677558898926,
        -0.004423896782100201,
        -0.002245102310553193,
        0.003221316495910287,
        -0.096458300948143,
        -0.008514245972037315,
        0.02247648872435093,
        0.03886424005031586,
        0.015383227728307247,
        -0.04843206703662872,
        0.05609813332557678,
        0.02914162538945675,
        -4.861717783910535e-08,
        0.048826560378074646,
        -0.018503041937947273,
        0.09461014717817307,
        -0.016458559781312943,
        -0.00669268611818552,
        -0.11138205230236053,
        0.07176229357719421,
        -0.06167195364832878,
        -0.0029881398659199476,
        -0.029131686314940453,
        0.005505274049937725,
        -0.06872241199016571,
        0.02501467987895012,
        0.09298567473888397,
        0.02502668835222721,
        0.07074412703514099,
        -0.0024098437279462814,
        0.11594587564468384,
        -0.002342641120776534,
        0.055715326219797134,
        0.03518934175372124,
        0.031551752239465714,
        0.043935924768447876,
        -0.03845434635877609,
        0.10741735994815826,
        0.036717627197504044,
        -0.07016849517822266,
        0.01597505435347557,
        0.06983918696641922,
        -0.05982433259487152,
        -0.012120882049202919,
        0.00535995839163661,
        0.07084400206804276,
        0.02605316787958145,
        -0.006813863757997751,
        -0.0801103338599205,
        -0.022746682167053223,
        -0.0016753528034314513,
        0.06563464552164078,
        0.04368099570274353,
        0.04990177974104881,
        -0.057966019958257675,
        0.00015732666361145675,
        0.05966421216726303,
        -0.018978815525770187,
        -0.04070069640874863,
        0.04190988838672638,
        -0.12068279832601547,
        0.04733503982424736,
        0.01936870813369751,
        -0.011172721162438393,
        -0.05019315704703331,
        0.049366410821676254,
        -0.024826684966683388,
        0.08074676245450974,
        -0.053458813577890396,
        0.044582586735486984,
        -0.01549310889095068,
        -0.02733279950916767,
        0.06688191741704941,
        0.006342415232211351,
        -0.057279717177152634,
        0.030190497636795044,
        0.09043717384338379
    ]
}