{
    "id": "o_BP1O9z3ME",
    "title": "24 Hour Gaming PC Build Challenge!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-10-15T15:15:40Z",
    "video_url": "https://www.youtube.com/watch?v=o_BP1O9z3ME",
    "category": "Science & Technology",
    "tags": [
        "pc",
        "gaming pc",
        "pc build",
        "computer build",
        "gaming pc build",
        "back 4 blood",
        "back4blood",
        "xbox",
        "game pass",
        "game pass pc",
        "xbox game pass",
        "game pass for pc",
        "computer",
        "build",
        "tech",
        "uravgconsumer",
        "judner",
        "judner aura",
        "nvidia",
        "amd",
        "gaming",
        "austin",
        "austin evans"
    ],
    "views": 536402,
    "likes": 13328,
    "comments_count": 392,
    "description": "Did you know that Game Pass has PC games?  Shoutout to @UrAvgConsumer for holding it down with me on this one!   My new podcast  @TheBackmarkers!  I have a TikTok!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://aka.ms/AustinPC",
        "https://aka.ms/AAe2i14",
        "https://www.relay.fm/testdrivers",
        "https://www.tiktok.com/@austintechtips",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- [Austin] Today, we're building 4 gaming PCs in 24 hours. So our friends over at Xbox wanted to sponsor a video to promote Xbox Game Pass for PC, and the latest title hitting the service, which is, Back 4 Blood. With 4 PCs to build, I cannot do it on my own. So I've pulled in my good buddy Jud, from UrAvgConsumer. And this is only the first of several gaming PC builds we'll be doing. The first stop is to pick up Jud from the airport. He's going to be in California for literally 24 hours. We need to design, build, test, and get these things ready to go, to celebrate the launch of Back 4 Blood. I'm gonna level with you here, um, Ken is usually head of the arts and crafts department for videos. (laughing) - Listen, that's, that's what I'm here for - (laughing) painting expert. - [Jud] There you go. (laughing) - [Austin] Each of the builds is designed after one of the cleaners in the game. So, not only do we have Holly, who's all about keeping the team together. We have Hoffman, who's the one who's always prepared, Doc, who is surprise, surprise the doctor. And then we got Walker who is the hardened soldier. With our items procured, the next step is to go to the office and actually start building our 4 PCs in 24 hours. Okay, so it's time to begin the build. Oh, look, is that our friendly neighborhood, Jared, who has acquired all of our PC components? - [Jared] Yeah, well, while you guys were dilly dallying - [Austin] With all of this nonsense, - [Jared] scavenged around in true Back 4 Blood fashion and get 4 PCs - [Austin] Wooooo - [Jared] worth of components here. - [Austin] Good job. - [Jud] It's a lot of gear you guys. - [Austin] So, because we have such limited time, the first thing we're going to do is do the first aesthetic pass on these systems. So we're going to start out with Walker, which this is a system which looks very generic, but I think we can make it look really sort of like practical and utilitarian. One of the things I really liked, we found this sort of old, like, what is it like a, it's like a repair kit or something. We can do something like this that can replace the side panel. Right? And then when he's ready to open up the system, he just pulls it open and he sees his components. That kind of feels Walker to me. We also have a scarf, which is pretty similar to the one that he has in the game. So, what we can do is once we do all this stuff, I feel like we should just beat the case up a little bit. Right? Like this thing has been through battle. - Yeah. I mean, he's a warrior. - [Austin] So does that mean that we get to attack the case? I mean, (clears throat) modify the case. - Yeah, yeah. - [Austin] Do the honors. - No, we'll both do it. - [Austin] Well, I've got the camera, so... - What you can, - [Austin] I'm not gonna want to, you... - (laughing) - I'm going to share for the camera screen. - [Jud] Okay. All right. Ohh. - Let this be a better - I like this. - [Austin] Teal is a bad color, Jud. Teal is - [Jud] Cut it out Austin! - [Austin] It's inferior! - [Jud} Ooh. Oh, It's getting a little too crazy over here (laughing) - [Austin] Sorry, sorry, teal is a decent color, teals a decent color. - [Jud] (laughing) decent (banging medal) - Back 4 Blood - Back 4 Blood - Oh yeah. - Game Pass. - Got those PC games. - Wait, we should stick to our day jobs. (laughing) - [Jud] Yeah. I mean, here you go. - [Austin] Yeah. Yeah. Actually, you know what? That looks kind of weathered. Yeah. Yeah. Yeah. Look at that. You're a real artist after all. - Listen doing artists things over here. - [Austin] We'll have our aesthetics on point, that mostly involved, nearing pain and attacking things with blunt objects. - Listen, that thing looks good to me. - I just think it does look pretty cool. - It looks like a Back 4 Blood PC. - All right, let's finish up Walker's system tomorrow. - Tomorrow. All right. - Let's make some progress on the other systems because those are going to be, I think, a little bit more involved, now in this X, but really on the actual building side of things. - [Austin] So Holly is the next build we're going to work on. And this is the one that, I mean, if we're building like a regular PC, this is the one that looks the coolest, right? - [Jud] mmhmm - [Austin] It's the O-11 dynamic in yellow. We've got a lot of yellow accessories. We also have one of my favorite coolers right now. This is the Kraken Z73, which has the screen on the actual AIO itself. We also have a 3070 AORUS Master edition, which also has a display. We're having fun right now. There's not a lot of stress, you know, we're just chilling, but you get to three o'clock tomorrow, - Oh, I'm saying, no way - [Austin] a couple hours before your flight, we're gonna be bussin, friend, bussin. - Yeah, yeah it's gonna be pretty rough. (banging on table) - [Austin] We'll be bussin it! - Yes - [Austin] Is that the right? Is that the right way you to use that phrase? - You know, I didn't quite know (laughing) what you were saying. It's like bussin, what's he? - [Austin] Bussin you know you gotta be bussin. (slow piano melody playing) - Just, just say it's lit. - [Austin] Lit, the kids love to say lit. I love to say it, lit. - Austin, we're aging ourselves. - [Austin] I know, we're so old! (laughing) - Jud, why, when did we get so old, we used to be so cool! - I don't know, man. We had kids, we messed up. (laughing) - This case is actually something kind of cool. So this is a Corsair Vengeance C70. They've not made this case for a number of years, as you can see from the dust. But, what's cool about this is that it really has that aesthetic. You know, it's actually got like the real latches. - This is serious hardware. - Yeah, Yeah, yeah. - I love that there's these latches here. It's like, all right, Hoffman's going to have to bring out the big guns here. - Time to reset your PC. (laughing) - Boom, reset. (laughing) (piano music playing) - [Austin] It has been a very, very long day and a very long night. - You know what sucks about Austin's studio? So guys, (laughing) this is not even a real window. It's just lights. (laughing) - [Austin] We're going to step out of here and it's pitch black outside. (laughing) Let's take a moment, I know there's piles of PC parts and paint and stuff everywhere. But for one day, considering that you were in New Jersey this morning, tomorrow's gonna suck. We're going to have to really hustle. But, I think we might just have a shot at this or we're gonna cry and not finish. - Well, we don't want to do that now, do we? - Good morning, with a prodigious amount of caffeine, I think we're ready to begin day two. So um, I don't know how you got some sleep last night, I got like two hours and I'm feeling great until the caffeine wears off. - Yeah, no, I got a little bit, but I definitely need a Red Bull to, to get us through this. - [Austin] Jared has been thankfully hard at work, getting Holly's system, which is really the most complicated one. So thanks for doing all the hard work and heavy lifting. - I never left. (laughing) - [Austin] Ahh, ahh... - [Jared] my employer told me I can't leave till it's done. (laughing) - [Austin] Hoffman's system is also I think looking good. I am so happy with that stupid handprint. - [Jud] You know, it looks really good. I feel like this will give us the best Back 4 Blood vibe. - [Austin] We should actually though, I think tackle Doc's build because we've actually got some progress done on Doc's build. What we just really need to do on this since uh, (clears throat) we may have cheated and uh, (clears throat) got a headstart. (clears throat) What we really need to do with docs build, is get the CPU, the GPU, and the Ram installed. And we actually can get this thing fired up relatively quickly. X marks the spot. - [Jud] Oh! - [Austin] X marks the spot! X...box Game Pass has PC games marks the spot! (laughing) no pressure or anything, but I don't want to have to redo that beautiful thermal paste application. So, - [Jud] Yeah, I know. - [Austin] if you just get this perfect first try that would be awesome. - [Jud] Whew. The pressure. Yeah. - [Austin] We good? - Yeah. Feel this. Make sure it's solid. - This is the moment of truth. I hit this button, either this things gonna come to life and we're gonna be fine, or we're gonna spend at least an hour fixing it. - [Jud] Listen, I've got all the fingers crossed. No... - I may not have plugged the power button in, that actually, that's probably our problem right now. I'm just going to check the power buttons. All right, please. Something happen. - Yay! Wait, wait, wait, wait. We gotta, we gotta post that. We gotta post and let's not get too excited yet. Let's not get too excited yet. Look see it's coming on. And boom, it's look at that. That's, uh, (ooh) - Ahhh (laughing) - So this has happened many times to us in the past where we get a little overeager with our PC build, we just assume it's going to work. And most of the time it does, but sometimes if your BIOS is slightly too old for your Ryzen 5000 series processor, uh, it just doesn't do anything. (heavy sigh of relief) I mean, that's just RIP, I don't... - [Jud] That's pretty rough. - [Austin] Jared, this doesn't have a stupid BIOS flash? Oooh, It has a BIOS USB. Ooh, can we use that? - [Jared] We might actually be able to, - [Austin] We might actually be able to use that, right? So I'd never used this before, but it should be able to, without a CPU pull that BIOS, right? - [Jared] Yeah, we just need, we'll need the USB drive, and then it should just be literally press the button as far as, at least that's how they market it. - This is a big moment. - Either the BIOS flashback feature works or we're not gonna finish the builds. - [Jud] It'll work. - [Austin] I love your confidence. Everyone ready? Nothing's happening. - The issue when it comes to a PC build like this, is that if your BIOS is out of date, for the processor that you're trying to use, and you may or may not have already assembled said PC, there's only one way to fix it. You need to remove your CPU cooler, take out your Ryzen 5000 processor, insert an older Ryzen processor, put your cooler back on, boot the system, take a USB flash drive with the correct BIOS. (high speed talking) Obviously BIOS, then take the cooler back off, take your old processor out, then take your original processor, put it back in put the cooler in, for the last and final time, boot it up and hope that it works. (normal speed talking) - So you know, very simple, easy process to do when you've got all the time in the world to troubleshoot your PCs and build them and ship them before it's time to go to the airport. Are you gonna hold it while we just go? - I didn't put the screws in so... - K, well it's updating at rapid speed. - Oh - Now, it's not. Yeah, you're gonna have to hold it. (laughing) - [Jud] That's gonna, that's gonna take a second. - Why don't we work on Hoffman's build for a few minutes. - [Jud] Listen, all right, that's the one I'm excited about. - This ones, this one's gonna be so simple. - So we kind of got started on all of the builds, but considering how much time we've got left and just the big ideas that we had initially, we're probably going to have to cut some corners. Game P ass trusted us to get these builds together. There's a lot of intricacies that go into getting these to where we want them to be. And right now I just don't know. Okay. - That CPU's gonna get toasty immediately, cause we did not install a cooler. Please tell me this shows up. - We're just risking it all. - [Austin] Come to life, come to life. That's just thinking about it for a second. Oh, up, up, up. Yeahhh!!! You go boys!! Wooo! I almost peed myself. (laughing) - Holly is looking excellent over here. - The lights all work. We just got to get cam installed and then we can, we can get the rest of it done. - This looks awesome. - So we've got our inspiration right here. Okay. Definitely want to make some of these. Some of her outfit kind of match what we've got going on over here, we've already got the yellow, - And then really, what's left is gonna be working on Walker's system, which looks terrible right now. I know. I know, I know. But, this is (knocking on wood) the simplest build to put together, the light at the end of the tunnel is coming. - It's still, incredibly tight. If we can actually get these things done. But, when you look at the systems that we've been able to build, you look at some of the customization we've done, it certainly isn't perfect. There's still a lot more I wish we could do, but, I think we actually just might, just might be able to pull this thing off. Let's uh, fire this thing up and hopefully it works! Hopefully it works! - [Jud] Is our power button broken? - The power button is actually a little stuck. Okay. (jazzy upbeat music playing) Well, that's unfortunate. I may have been a little too aggressive when I was decorating the paint, and I had noticed the paint got in between the button. - [Jud] Oh no. - [Austin] It's just kind of stuck now. This is what victory and confidence looks like. - Oh God - Every minute that we waste on this is another minute that we can not do RGB or more aesthetic tunings. All right. That button is actually just wedged. So like it's basically it's constantly pushing it in. You want to give that a try? It's a very sharp blade. Oh yeah. You got it. You got it. Yes. - [Jud] There we go. Okay. Ready and (gasp) It works. - [Jared] Oh my God - [Austin] It works! (laughing) Wait, wait, wait for it to post. Wait for it to post, - [Jud] Let's go. (laughing) Woooooo - Let's, let's not celebrate. Let's not celebrate. There's no Windows on this thing. That's not been decorated. We've got to go. We got to go, no time for a victory lap right now. Oh my God. Dude, I'm in the middle of installing Windows and I've lost my display. - [Jud] No way. - I just, I just restarted the monitor. I wish you could just say that we're just faking this to make this video more dramatic. We're not. (laughing) Here, while I try to do this. - Oh, the HDMI was like half out. - [Austin] Oh, you smart. - Austin, I need you to start plugging things all the way in. - [Austin] I get it. I get it. Fine. All right, all right, all right. So, this is gonna have to go in some way right here, tape, tape, it's electrical tape. So, we just gotta like double it over or whatever. - Oh, it'll, it'll, it'll do. We'll, go ahead, Austin. You're, you're relax. Go, go, go breath somewhere. I got the rest of this man. I got this. (laughing) - [Austin] Oh my God. Jud, you're a genius. You're a genius. You are an actual genius. - [Jud] Boom, there you go. - [Austin] Look at that. - All right. So we're down to glue this, right? - How long do we need to hold the Gorilla Glue before it actually sets? - We'll just put something heavy on it. We don't need to hold it. - [Austin] There we go. Look at that. (laughing) - I mean, Xbox Game Pass. - It's on brand. - Literally on PC. (laughing) - So I hold it like this. I would be liberal with it. (laughing) God, I hope this works. So let's start rolling and then press down. Yep, yep, yep, yep, yep. Yep. That's it. - Holy - All right. Awesome. We've got something, man. - Okay. Okay. Okay. Uh, does this system look like hot garbage? No, it looks kind of cool right? - No, it's definitely cool. Well, we're good. - [Austin] Guys, are we, did we do it? - [Jud] I think we did it, Austin. - [Austin] We did it! (slap hands) - Ugh! - Yes! - [Jared] Hell yeah - [Austin] Oh man. - Now, I'm I'm proud of us, guys. We collectively, we did that. - Okay, Cool. Thanks. (laughing) - I'm over here looking at Jared. (laughing) - Man, four PCs, in 24 hours is a tall order. - [Jud] So, the builds are all done. I think as a team, we crushed it. They all look really good. Some have a little bit more character than others, but they all work and can easily run Back 4 Blood, which is the most important thing. - Thank you very much for watching. Ah, ah, oh, make sure to subscribe to Xbox Game Pass for PC, which has PC games. If somehow you're not familiar with Game Pass for PC, not only do you get brand new PC games on day one, but there are over 100 high quality PC games. And if you're interested, you can get your first month for only $1. Now, if you'll excuse us, it's time to go to sleep. Or actually, it's time to take you to the airport. - Yes - It's time to go to the airport, let's go! - I'm like, uh, I got to go home buddy. (laughing)",
    "transcript_keywords": [
        "Yeah",
        "Game Pass",
        "Xbox Game Pass",
        "Back",
        "build",
        "Blood",
        "Game",
        "time",
        "BIOS",
        "Pass",
        "Xbox Game",
        "things",
        "thing",
        "work",
        "Wait",
        "good",
        "system",
        "works",
        "games",
        "builds"
    ],
    "transcript_entity_values": [
        "last night",
        "AORUS",
        "at least an hour",
        "the Gorilla Glue",
        "AIO",
        "another minute",
        "only $1",
        "Jared",
        "half",
        "over 100",
        "Doc",
        "one day",
        "Ryzen 5000",
        "first",
        "a couple hours",
        "Holly",
        "Ken",
        "USB",
        "Austin",
        "New Jersey",
        "the Kraken Z73",
        "RGB",
        "two",
        "a very long night",
        "Austin] Bussin",
        "Windows",
        "Xbox",
        "four",
        "California",
        "3070",
        "this morning",
        "Austin] Jared",
        "Today",
        "4",
        "Austin",
        "one",
        "Ram",
        "Doc's",
        "second",
        "day one",
        "Hoffman",
        "a few minutes",
        "Tomorrow",
        "Back 4 Blood",
        "two hours",
        "24 hours",
        "Xbox Game Pass",
        "tomorrow",
        "CPU",
        "Jud",
        "Yeahhh",
        "Ryzen 5000",
        "Ryzen",
        "only one",
        "Walker",
        "One",
        "Back 4 Blood",
        "GPU",
        "a number of years",
        "first month"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "ORDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "FAC",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE"
    ],
    "vector": [
        0.0006130417459644377,
        0.034378185868263245,
        0.04935886710882187,
        -0.1380784809589386,
        -0.02884313091635704,
        -0.0021929547656327486,
        0.023648621514439583,
        -0.024503106251358986,
        -0.0259756688028574,
        0.03838253393769264,
        -0.11343459784984589,
        -0.08182664215564728,
        -0.058826517313718796,
        -0.0032239656429737806,
        0.017042243853211403,
        0.023582665249705315,
        0.05547895282506943,
        -0.012471566908061504,
        -0.09763561934232712,
        -0.007807357236742973,
        -0.024599852040410042,
        -0.11843191087245941,
        0.01622317172586918,
        -0.04332767054438591,
        0.005175320897251368,
        0.01671718619763851,
        0.04446974769234657,
        0.027289612218737602,
        -0.0013089111307635903,
        -0.04767439141869545,
        0.042967695742845535,
        -0.04835677891969681,
        -0.03523998707532883,
        0.026319636031985283,
        0.04223131388425827,
        0.047141458839178085,
        -0.007895488291978836,
        -0.0329517126083374,
        -0.13354402780532837,
        0.0021001333370804787,
        0.017207372933626175,
        -0.0038756150752305984,
        -0.014837049879133701,
        0.09968268871307373,
        0.029503507539629936,
        0.06760270893573761,
        -0.02446032129228115,
        -0.0874214619398117,
        0.06295359134674072,
        -0.009473561309278011,
        -0.00949089601635933,
        -0.029432058334350586,
        0.0212089940905571,
        -0.05363629013299942,
        -0.05182948708534241,
        0.03291190788149834,
        0.01643727533519268,
        0.009162009693682194,
        0.07229051738977432,
        -0.04431164637207985,
        -0.008903339505195618,
        -0.05844893679022789,
        -0.007048992905765772,
        0.001209048554301262,
        -0.0331798754632473,
        -0.03646468371152878,
        0.005243675783276558,
        0.09655480831861496,
        0.0325455404818058,
        -0.031321387737989426,
        0.0020660257432609797,
        0.057736944407224655,
        -0.023564815521240234,
        0.015555176883935928,
        0.004945792257785797,
        0.09084892272949219,
        0.030202418565750122,
        -0.07735806703567505,
        0.02067384496331215,
        -0.02697865664958954,
        0.0590919554233551,
        0.009142166003584862,
        -0.057278361171483994,
        -0.003605604637414217,
        -0.048572249710559845,
        0.06361396610736847,
        -0.01624559983611107,
        0.07286552339792252,
        0.008231068029999733,
        -0.01018539909273386,
        0.02894410490989685,
        0.04327521100640297,
        0.08612075448036194,
        0.01670948602259159,
        0.05253194272518158,
        0.05871773883700371,
        0.03808995708823204,
        -0.08443062752485275,
        -0.04971097782254219,
        0.04151581600308418,
        -0.027651846408843994,
        0.033843331038951874,
        0.0707685798406601,
        -0.014276698231697083,
        0.04958821088075638,
        -0.03824186697602272,
        -0.10243114084005356,
        0.07698074728250504,
        -0.017365850508213043,
        -0.03807072713971138,
        -0.0387134812772274,
        0.013418493792414665,
        -0.016988582909107208,
        0.03455590084195137,
        0.07550279051065445,
        0.13452015817165375,
        -0.08406008034944534,
        0.04506732150912285,
        0.017977457493543625,
        0.005049307364970446,
        0.08434542268514633,
        0.0014310817932710052,
        0.024806614965200424,
        -0.008742776699364185,
        0.10552660375833511,
        0.020647326484322548,
        0.021873263642191887,
        1.5079474794508545e-33,
        0.06683921068906784,
        0.020275002345442772,
        0.029196681454777718,
        0.10003610700368881,
        0.05594196543097496,
        -0.055200181901454926,
        0.059634048491716385,
        0.035741809755563736,
        -0.03828531503677368,
        0.05257517471909523,
        -0.04215804859995842,
        -0.04176948219537735,
        -0.021068241447210312,
        0.07151928544044495,
        0.03513263538479805,
        -0.09998658299446106,
        0.00163412990514189,
        -0.05896702781319618,
        -0.007400061469525099,
        -0.009449908509850502,
        0.0003265751583967358,
        -0.07359814643859863,
        0.01299278624355793,
        -0.0245710089802742,
        -0.04510337486863136,
        -0.025176340714097023,
        -0.04062718525528908,
        -0.020093949511647224,
        0.08102317154407501,
        0.025621281936764717,
        -0.14915573596954346,
        -0.01822003722190857,
        -0.04889485612511635,
        -0.018236488103866577,
        -0.024957364425063133,
        -0.02784247137606144,
        -0.03057839721441269,
        -0.05921614542603493,
        -0.028446529060602188,
        0.07257091253995895,
        -0.04445818066596985,
        0.022264162078499794,
        -0.06009377911686897,
        -0.08048520982265472,
        0.007512323558330536,
        -0.05665888637304306,
        0.029303984716534615,
        -0.06583121418952942,
        -0.023810239508748055,
        0.05768159404397011,
        -0.02493922784924507,
        0.06303399056196213,
        0.06708056479692459,
        -0.08237384259700775,
        -0.004032279830425978,
        -0.07081466913223267,
        0.0058142077177762985,
        -0.0682106539607048,
        0.01418223325163126,
        0.08139686286449432,
        0.1203075647354126,
        0.0284444447606802,
        -0.05608629435300827,
        0.11284442245960236,
        -0.07913509756326675,
        -0.04489552602171898,
        0.043048664927482605,
        -0.029045596718788147,
        0.04065028205513954,
        -0.06693430244922638,
        0.027473215013742447,
        -0.010265112854540348,
        0.03317783772945404,
        -0.1443604677915573,
        0.07120616734027863,
        0.025682982057332993,
        -0.08728034049272537,
        0.026283057406544685,
        -0.04044699668884277,
        -0.049626030027866364,
        -0.04562177509069443,
        0.07278168201446533,
        -0.10231093317270279,
        0.006034810096025467,
        0.08004532009363174,
        0.01140337623655796,
        -0.00977766327559948,
        -0.09586046636104584,
        -0.05536262318491936,
        -0.02254418469965458,
        -0.11766015738248825,
        -0.02397157810628414,
        0.007047510705888271,
        0.010239817202091217,
        0.026748737320303917,
        -2.4394582431973835e-33,
        0.01590360514819622,
        -0.01639062538743019,
        -0.004855644423514605,
        0.007425184361636639,
        0.13984258472919464,
        -0.037853483110666275,
        0.04017467424273491,
        0.007492227479815483,
        0.04642311483621597,
        0.037884172052145004,
        -0.011975926347076893,
        0.0348157174885273,
        0.0007642669952474535,
        -0.030969718471169472,
        -0.005279235541820526,
        -0.044305652379989624,
        0.018150007352232933,
        -0.004227371420711279,
        0.0044076209887862206,
        0.015368266962468624,
        -0.007052531000226736,
        0.06041831895709038,
        -0.017658939585089684,
        -0.049907226115465164,
        0.029405659064650536,
        0.046899788081645966,
        0.041492994874715805,
        -0.0526295080780983,
        0.09450336545705795,
        0.0258859321475029,
        -0.017165202647447586,
        0.015167022123932838,
        -0.004040081519633532,
        0.05110802501440048,
        6.238879723241553e-05,
        0.020222891122102737,
        0.11689005047082901,
        0.0020505604334175587,
        -0.0205474141985178,
        -0.030232029035687447,
        0.05955875664949417,
        -0.007784144952893257,
        -0.07452555000782013,
        0.031132884323596954,
        -0.025150442495942116,
        0.07656408846378326,
        -0.018155716359615326,
        0.022719930857419968,
        -0.011487474665045738,
        0.038190148770809174,
        0.030285650864243507,
        -0.01694243960082531,
        -0.021024849265813828,
        -0.00694216787815094,
        -0.011354837566614151,
        -0.03755447641015053,
        0.0012145917862653732,
        -0.0021246715914458036,
        -0.03081722930073738,
        0.049308549612760544,
        -0.0011065080761909485,
        -0.0563901886343956,
        0.010383288376033306,
        0.00860095489770174,
        0.0337698869407177,
        0.041781436651945114,
        0.058740679174661636,
        0.08207109570503235,
        -0.07407485693693161,
        -0.02224070206284523,
        -0.07974354922771454,
        0.03313764929771423,
        -0.06090608239173889,
        -0.05436425283551216,
        0.010277271270751953,
        -0.03660525754094124,
        -0.013357553631067276,
        -0.012357649393379688,
        0.05447717756032944,
        -0.03080943040549755,
        -0.05526537448167801,
        -0.036556143313646317,
        -0.009643101133406162,
        0.036801502108573914,
        0.08292791992425919,
        -0.02011655829846859,
        0.05052533000707626,
        0.06472103297710419,
        -0.041007570922374725,
        -0.004267659969627857,
        0.020044367760419846,
        0.060629237443208694,
        0.04407009109854698,
        0.12293973565101624,
        0.06431714445352554,
        -5.4558352502454e-08,
        0.04325924441218376,
        -0.006924847606569529,
        -0.0967487245798111,
        -0.018100470304489136,
        -0.01308364700525999,
        -0.010704834014177322,
        -0.04781949892640114,
        -0.010465605184435844,
        0.005703362170606852,
        0.03506920859217644,
        0.07286476343870163,
        -0.010405275970697403,
        0.012452468276023865,
        0.047252025455236435,
        0.023773616179823875,
        0.019409017637372017,
        -0.06056979298591614,
        0.044536516070365906,
        -0.07005399465560913,
        -0.062160052359104156,
        -0.014841643162071705,
        0.05340512469410896,
        0.01172814704477787,
        -0.03052702359855175,
        -0.03831668943166733,
        0.013665657490491867,
        -0.005458303261548281,
        0.01013635378330946,
        0.039146095514297485,
        0.003615229157730937,
        0.03072771243751049,
        0.0027446632739156485,
        -0.02900536172091961,
        -0.027659067884087563,
        -0.016913995146751404,
        -0.09374887496232986,
        0.01864970661699772,
        0.013204816728830338,
        0.07641292363405228,
        0.07768582552671432,
        -0.08324196189641953,
        -0.10761730372905731,
        -0.037912726402282715,
        -0.013907751999795437,
        0.0028091310523450375,
        -0.037204403430223465,
        -0.1352168172597885,
        -0.04419106990098953,
        -0.08570332080125809,
        -0.059014759957790375,
        -0.05742747709155083,
        -0.03199312090873718,
        0.02859783172607422,
        0.020568091422319412,
        0.16409479081630707,
        0.03642556071281433,
        -0.03381618857383728,
        0.03724214807152748,
        0.027903012931346893,
        0.012188763357698917,
        0.044309359043836594,
        0.03917641565203667,
        -0.08973802626132965,
        0.003686952404677868
    ]
}