{
    "id": "O_wRN6-N1qc",
    "title": "Apple Watch Series 6 First Impressions (Braided Solo Loop) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-09-24T19:59:39Z",
    "video_url": "https://www.youtube.com/watch?v=O_wRN6-N1qc",
    "category": "Science & Technology",
    "tags": [
        "Apple Watch Series 6 First Impressions (Braided Solo Loop) - Krazy Ken's Tech Misadventures",
        "Apple Watch",
        "Apple Watch Series 6",
        "iPhone",
        "iOS 14",
        "watchOS 7",
        "Blood O2",
        "Blood O2 Levels",
        "Braided Solo Loop",
        "Solo Loop",
        "Apple",
        "Smartwatch",
        "Wearable",
        "First Impressions",
        "Unboxing",
        "Tech",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Computer Clan"
    ],
    "views": 100082,
    "likes": 1664,
    "comments_count": 228,
    "description": "The Apple Watch Series 6 offers a brighter display, watchOS 7, faster performance, blood O monitoring, and more. Today, Krazy Ken unboxes it, along with the new Braided Solo Loopwhich has been known to not \"fit\" right. Let's see if it all works  Join our channel and get cool stuff!   Get more Tech Misadventures episodes   Subscribe for more tech videos!    Like us on Facebook   Follow us on Twitter    Krazy Ken's Tech Misadventures - Apple Watch Series 6 First Impressions (Braided Solo Loop)   Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!   Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan2JGWYhz",
        "https://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "https://bit.ly/clan2Dr3M3e",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Ken] Some of them are not sized right. Based on people's usage of the Apple, like sizing tool on the website. So, Oh gosh, I hope it fits. (beep) (bright upbeat music) Hey guys, how are you all doing? Really? That's just great. You know, I'm doing pretty great today too, because the new Apple Watch Series 6 arrived five days early. So yes, I'm shuffling around the episode schedule a little bit just because I wanna get this one out pretty quick. This will just be my first impressions, but definitely stay tuned because I'm still doing that mystery episode and I'm gonna do a full review on this soon as well. So make sure you're subscribed and stay tuned for that. Okay. So I'm a pretty interested by this one because I am still, I'm rocking a Series 0, that's right I am using an Apple Watch that is so old that doesn't even have a series number, but the other thing I'm really curious about is if this will even fit because I ordered the new, not just the new blue aluminum case, but the new blue, or actually the charcoal braided solo loop. And I'm hearing some reports that some of them are not sized right. Based on people's usage of the Apple like sizing tool on the website. So, Oh gosh, I hope it fits. And it's upside down, but that's okay because this is tech misadventures. We're allowed to have some fun and boom, there it is. Apple Watch. It has been so long since I've purchased an Apple Watch. So yeah, here we go. We have the Series 6 blue aluminum case. The blue aluminum is a new color particular to Series 6. And I believe also the new SE as well. Let's go ahead and pop the cherry on here. Oh, there we go. Not sure what these little, Oh, okay. I don't remember that being on the last one, but then again, it's been a long time and I measured my wrist twice. I came up as a size seven on the tool. So hopefully that actually works. Oh, there's like something decorative on the other side. Oh, fancy. Okay. (laughs) Look at that. Look at all those colorful bands and stuff. All right. It's like unwrapping a little present. Look at that. Wow. That's really fricking colorful. I love how they put the design on there too. I do not remember the first Apple Watch unboxing experience being quite like that. I guess we'll set that aside for now as colorful as it is. And then here we go. We have the charcoal band right here and the watch here. So let's go ahead and take a look and set my iPhone out of the way. I mean, we will need this in a bit, so I'll just have him kinda chill in the corner. Okay. And bon appetite. Here it is. It's even wrapped in blue. (laughs) Slide it out here. I'm normally like all space gray and silver. I'm not a huge fan of colors on my, you know, products and hardware and computers and phones and such, but you know, it's a new color. So I wanted to give it a try. Oh, here we go. And it's already turning on. It looks like I probably bumped the button, but yeah, whew look at that. Just wanna give you a closer look there, there's the sensors along with the new red lights that are used for the blood oxygen, it says Apple watch right there. And there's the nice blue aluminum case. Nice. Looks like we have the paperwork, basic instructions and such. And we have, get back in there, and we have the charging cable, which is really nice 'cause now I can have two of these. 'Cause I still have the one that came with my original. So now it's nice to have two. Now they don't ship the USB block anymore. Like the power brick, you can order that, but they don't include that by default 'cause you know, you probably have a ton of USB power bricks lying around. So they're doing that as like an environmental effort. And part of me wants to go, yeah, Apple's saving the environment and stuff. And I know they are legitimately doing efforts for that, but then it's also like, you know, right to repair and all that stuff. And Ooh, some of that stuff is ending up in landfills. Ah, yeah, that's a rabbit hole. We're not gonna go down there, but it seems, it seems weird. But anyway, we're not here for that, but yes. And now the moment we've all been dreading for, the loop. Yes. Not the one in Chicago. We're gonna see if this actually fits, 'cause again I've heard of some stories of where people measured and the size was still wrong and even worse if the size is wrong, you have to return the whole watch. Not just the band. So yeah, that would suck. Here we go. So far so good. Got some little instructions here and there it is, the charcoal. Oh, kinda like just peels out of there. Okay. Ooh. It feels nice. That feels really nice. So it's kinda stretchy. It has like silicone like threads in there somewhere I believe. And it's got like this like recycled yarn or some kind of yarn on here. It has a really soft look, soft feel. It's not like super soft, has a little bit of like rougher texture and it's stretchy, but it still does have kinda like a soft spongy sort of feel. And you know, you don't need a buckle or a clasp. It just kinda slips over your wrist. So now let's just see if it actually fits, this is going to be, (laughs) Oh, this is gonna be great. I am scared. I'm really scared. Now I will say when I bought this, I used to have to use the third hole, but for the past year or so, I've been using the first hole, but I have lost a lot of weight since I bought that thing. So hopefully my measurements are correct and I didn't read the instructions, but I'm guessing it's reversible. You can just slide it in either way, right? I hope so. I think that's correct. I'm gonna double check the instructions. Yeah. with the metal tab facing out, which we did, and slide it in until it clicks. All right, here we go. Moment of truth. Huh? That feels just fine actually. Well, I'll be. Yeah I can fit my finger under there. You know there's probably like that much of a buffer before it starts getting like too tight, but yeah, it just, what the, well that works beautifully Ooh I can feel those haptics from the scrolling already. Okay. I think that looks cool. I think the charcoal with that new dark blue aluminum sort of look is pretty slick. Okay. Dang son that looks great. Sorry. I'm just kinda like overly happy that it actually worked and I didn't suffer that issue that other people had, so. Okay. Well let's go ahead and set it up and pair it with the iPhone. I hope you enjoy staring at my arm. All right we're gonna do United States, open the Apple Watch app on your iPhone and tap to start pairing So I'm gonna do that here. All right so we got the spinny thing going here to pair. I'm gonna go to add watch, set up for myself, do the little scan and there would go, your Apple Watch is paired and we'll restore from backup, which let's see the latest one. Oh, it can actually restore right from the other watch or from this backup, which is in the future. It says 6:37 PM there in 5:45 PM there, so. I don't know how that's possible because it's not 6:37 yet, that time hasn't happened yet. So I don't know how this backup is in the future, but okay. I'll do that I guess. Continue. And I'll read all the boring stuff so you don't have to. Don't use Siri. Don't share. Boom. Okay. That looks good, text and I will set up a passcode. Don't look at this. Okay here is one of the new features, the blood oxygen, will enable that. continue with the software updates and I'll set up Apple pay later. Continue. Clock faces. Oh man there's a ton of faces I have not been able to use yet 'cause the Series 0, stopped getting software updates like years ago and we're syncing. Okay. So that's going and I'm already enjoying the edge to edge display on here because on this older one, you definitely don't get that. The display is just a square. This one actually has a display that goes into the corners. The nice rounded corners there. I mean, we can't see a whole ton right now because well, we're mostly on a black screen, but yeah, we can go through here. Let's see gestures and such. I'm pretty sure I know all those. Okay. Well it's still syncing. So I will get back to you when it's done. And there we go. Your Apple Watch is ready. Press the digital crown to start. Oh, that's an old Apple ID that I don't even use anymore. So we're gonna cancel that. I'm gonna take a look at some of these new ones, 'cause I haven't been able to use any of them. Oh wow. There's a lot of fricking options now. Holy cow. I've been missing out. Oh, solar dial. That sounds pretty cool. Oh crap. That looks freaking awesome. Oh dude. You can feel the haptics. You can hear the click. It's a very subtle click. It's like an iPod click wheel on your wrist. And it tells you the different like stages of like sunlight. That is really cool. That is pretty bitching. Yeah I can already feel a huge speed improvement over my last watch. I mean that thing was, you know, first generation, especially with the newer software, it was pretty darn slow, but I can already feel like significant speed boosts. I mean, let's just get it like a comparison. Yeah. Even simple things like moving the icons around, you probably can't see this 'cause you're viewing this at 24 FPS, but I can tell this is way slower than this. And this thing has that nice edge to edge display, which this one doesn't have. But it also has that always on display with the low power. I think they introduced that in Series 5 and this can't do that. After a while the screens is gonna turn off, but on here you can see it was already in that mode. That's kinda like the screen saver. If I let it sit for a while, it will go into that low power always on mode. Here we go. So you see the second hand went away now because that helps save the power. So instead of refreshing the display every 60th of a second it now it just does it every second or I think it's sumn like that. So now this can stay on, but use hypothetically dramatically less battery power. And then when I wake it up, it continues at its normal refresh rate and brightness. Let's take a look at editing it. Ooh. Yeah. Dark mode. We'll do white for now though. Complications. Okay. Let's see what else we can do here. Alarms, blood oxygen is right there. All right. Calculator. Huh? Pretty sweet. Compass. Bob. I think there's like that loud, yeah noise levels. So like I could put that there. Is that, is my whisper really 50 decibels? 'Cause that just, that doesn't sound right, but okay. Oh, okay. At least it says long term exposure to the sound won't be bad. But what if I talk a little louder? What if I talk like this? Is that really 80 decibels? I don't feel like I'm talking at 80 decibels, but what do I know about like sound? I mean, I don't know that shizz. Huh? Okay. Oh this is too loud. So if you listened to me elevating my voice like this for too long, it could hurt your ears. What about now? (claps) well here we go. I guess it's pretty responsive. So if you're on a gun range, you know, use that and there's that low power display again, it kinda just blurs out the background. So it all uses less power. It dims the light and reduces the refresh rate. So, okay, that's pretty sweet. All right let's try out that blood oxygen feature. Here's some tips that can help you take a good measurement. All right. Make sure your watch is not too low on your wrist as Oh, okay. So kinda just do a little, little shuffle there. Here we go. You comfy there? Okay. Make sure it's not too low. Your watch band should be snug, but comfortable. Keep your watch facing up and try not to move. Resting your wrist on a table can help. Well, way ahead of you there. Okay. Well we're snug. Nice animation. We're snug, we are on a table, ready. I'm probably a little stressed out right now. So whew my blood may not be as healthy, but anyway, let's do it 98%. All right. That's the first 98% I got on anything. Yeah. Suck it sixth grade health teacher gave me a C minus look at this. That's an A right there. All right. Well, our blood looks pretty good. So I still plan to do the full review. Let me know of other things you want me to take a look at so I can make sure to include that stuff in the review and let me know what you think about the new Apple Watch Series 6. Even if you don't have one I just wanna know, but particularly if you've got one, I'd love to see that. And don't worry, that mystery item I teased earlier, I'm still doing an episode on that. I was actually in the middle of taping it when this arrived. So I just needed to take a break and cover this quick. So make sure you're subscribed and stay tuned for that. And if you wanna support the channel, plus get some awesome perks, feel free to click that join button below the little video player you're watching me on and you can get some of that stuff. And if that doesn't work, there's also a link in the description. Thank you for your support. If you liked this episode, you know what to do. Thanks for sticking with me. Catch the crazy and pass it on. (bright upbeat music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Series",
        "Apple",
        "Watch",
        "yeah",
        "Watch Series",
        "Series",
        "pretty",
        "kind",
        "nice",
        "feel",
        "Apple Watch unboxing",
        "blue aluminum",
        "Apple Watch app",
        "power",
        "blue",
        "stuff",
        "display",
        "blue aluminum case",
        "set"
    ],
    "transcript_entity_values": [
        "USB",
        "Siri",
        "24 FPS",
        "third",
        "United States",
        "a whole ton",
        "98%",
        "Series 5",
        "Compass",
        "50 decibels",
        "Chicago",
        "two",
        "Apple",
        "the past year",
        "SE",
        "iPod",
        "6",
        "today",
        "60th",
        "five days early",
        "seven",
        "Bob",
        "first",
        "5:45 PM",
        "the Apple Watch",
        "Clock",
        "Apple Watch",
        "iPhone",
        "80 decibels",
        "a ton",
        "second",
        "sixth",
        "years ago",
        "Your Apple Watch",
        "6:37 PM"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "GPE",
        "QUANTITY",
        "PERCENT",
        "EVENT",
        "PRODUCT",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.14535683393478394,
        -0.07517847418785095,
        -0.012951359152793884,
        -0.09013707935810089,
        -0.012719488702714443,
        0.04998505115509033,
        0.06073198840022087,
        -0.005492395255714655,
        0.016869274899363518,
        -0.06878955662250519,
        0.021316589787602425,
        0.00778646394610405,
        -0.07075371593236923,
        -0.06246434152126312,
        -0.05915369838476181,
        0.033618051558732986,
        0.06949908286333084,
        0.0015699607320129871,
        -0.02362755872309208,
        -0.019701413810253143,
        -0.016459356993436813,
        -0.13037952780723572,
        0.06913938373327255,
        0.01800801046192646,
        0.029693754389882088,
        0.04879619553685188,
        -0.012998633086681366,
        0.00469478452578187,
        0.005631898529827595,
        -0.038721825927495956,
        -0.005830824840813875,
        0.0062510478310287,
        0.014020455069839954,
        0.023395584896206856,
        0.02206066995859146,
        -0.06957969814538956,
        0.024687103927135468,
        0.03575533628463745,
        -0.138255774974823,
        0.04055437445640564,
        0.02458869479596615,
        0.003095814026892185,
        -0.010384108871221542,
        -0.05171961709856987,
        0.011370545253157616,
        -0.03419607877731323,
        -0.014455905184149742,
        -0.04908376559615135,
        0.03200708329677582,
        0.04893844202160835,
        -0.031707245856523514,
        -0.06804946810007095,
        0.024248238652944565,
        -0.029782110825181007,
        0.04547721892595291,
        -0.014435497112572193,
        -0.013129659928381443,
        0.0010782800382003188,
        0.07606975734233856,
        -0.051974497735500336,
        0.08985663950443268,
        -0.050066027790308,
        -0.03835992142558098,
        0.05295412987470627,
        0.02363261952996254,
        -0.013790396973490715,
        0.012136994861066341,
        0.12800002098083496,
        0.07530651986598969,
        -0.06745988130569458,
        -0.09102655947208405,
        -0.004699663259088993,
        9.343465353595093e-05,
        0.05106506124138832,
        0.012619532644748688,
        0.05071742460131645,
        0.05984927713871002,
        -0.1362667977809906,
        0.014885548502206802,
        -0.06581664085388184,
        -0.036065325140953064,
        -0.02085367776453495,
        -0.0222448892891407,
        0.010486534796655178,
        0.048240963369607925,
        0.02052389085292816,
        0.013441275805234909,
        -0.012454764917492867,
        -0.05296339467167854,
        -0.03703470155596733,
        -0.0010870089754462242,
        0.08127374202013016,
        0.010994945652782917,
        -0.0840655192732811,
        0.023438481613993645,
        0.07864910364151001,
        -0.004739819560199976,
        0.016726266592741013,
        -0.03950341045856476,
        0.028720980510115623,
        0.07512077689170837,
        0.006837836466729641,
        0.026357274502515793,
        -0.006967741530388594,
        -0.009748280048370361,
        -0.1361103355884552,
        0.04845920950174332,
        0.07083793729543686,
        0.0572882778942585,
        0.01854703389108181,
        0.012943982146680355,
        0.0002995033282786608,
        -0.0023130725603550673,
        -0.02172026038169861,
        0.036747850477695465,
        0.06369248777627945,
        -0.07959482073783875,
        0.06950554251670837,
        0.11582517623901367,
        0.07504812628030777,
        0.056480955332517624,
        0.009334568865597248,
        0.010620995424687862,
        0.0058691538870334625,
        0.09727883338928223,
        0.02512458525598049,
        0.00306894164532423,
        5.643927842567927e-33,
        0.04392624646425247,
        0.05930705741047859,
        0.013794894330203533,
        -0.06225501000881195,
        0.01151351910084486,
        -0.027267182245850563,
        -0.10512930899858475,
        0.01816577836871147,
        -0.03918992355465889,
        0.10030307620763779,
        -0.03595178574323654,
        -0.02195032872259617,
        -0.05025472491979599,
        -0.015807565301656723,
        -0.018289711326360703,
        -0.04417699575424194,
        -0.005577689036726952,
        -0.046146243810653687,
        -0.03457212448120117,
        0.07281966507434845,
        0.016875792294740677,
        0.006957361940294504,
        0.016170000657439232,
        -0.022609010338783264,
        -0.06723271310329437,
        0.007069216575473547,
        -0.04208182543516159,
        0.05552951991558075,
        0.04195277765393257,
        0.0462564118206501,
        -0.05858614295721054,
        -0.026079192757606506,
        0.008711975999176502,
        -0.004128210246562958,
        -0.0646027997136116,
        -0.09950017929077148,
        -0.012050650082528591,
        -0.02790733426809311,
        0.00849246047437191,
        0.08278834074735641,
        -0.0313621424138546,
        0.014661089517176151,
        -0.03772241994738579,
        -0.0769815519452095,
        -0.024373700842261314,
        -0.012650587595999241,
        0.07394224405288696,
        0.0671529769897461,
        -0.011449060402810574,
        0.06375768035650253,
        -0.01407335139811039,
        -0.021683726459741592,
        0.05159824714064598,
        -0.04652301222085953,
        0.01612776331603527,
        0.009575627744197845,
        0.029894553124904633,
        -0.054574958980083466,
        0.023831693455576897,
        0.07434763759374619,
        0.0030619550962001085,
        0.10439511388540268,
        0.007577764801681042,
        0.046172577887773514,
        -0.10311798006296158,
        0.024135522544384003,
        0.06512821465730667,
        0.04827309399843216,
        -0.05864384397864342,
        0.011456829495728016,
        -0.11703891307115555,
        0.027943383902311325,
        0.024987177923321724,
        -0.04538798704743385,
        0.06731554120779037,
        -0.0431525856256485,
        -0.0523298941552639,
        0.019636930897831917,
        -0.06388594955205917,
        -0.011030382476747036,
        -0.0026446094270795584,
        0.021121256053447723,
        0.03567778691649437,
        0.043440334498882294,
        -0.021986378356814384,
        0.029037022963166237,
        -0.03819550573825836,
        -0.04974395036697388,
        -0.03989390283823013,
        0.004156185779720545,
        0.03436940908432007,
        -0.020756980404257774,
        -0.0132843516767025,
        -0.014050690457224846,
        -0.03298204019665718,
        -7.045159353076327e-33,
        0.07578186690807343,
        -0.03179275617003441,
        0.05849120020866394,
        -0.07073742151260376,
        0.11601008474826813,
        0.030231380835175514,
        0.08105115592479706,
        -0.006402688100934029,
        0.03542352467775345,
        -0.05510036647319794,
        0.06880391389131546,
        -0.03170974925160408,
        -0.12480110675096512,
        0.045050181448459625,
        0.050705838948488235,
        -0.022297123447060585,
        -0.08267076313495636,
        -0.008538114838302135,
        0.061256907880306244,
        -0.032528750598430634,
        0.11806496977806091,
        -0.06846928596496582,
        0.013056780211627483,
        0.010279931128025055,
        0.005079495720565319,
        -0.003937218338251114,
        0.04450852423906326,
        0.050535619258880615,
        0.06555463373661041,
        0.016610706225037575,
        0.010879337787628174,
        -0.004063994623720646,
        -0.047119203954935074,
        0.05819706618785858,
        -0.04449376463890076,
        0.04677766561508179,
        0.022855639457702637,
        0.0007175783393904567,
        -0.02016988955438137,
        -0.023023180663585663,
        0.04214724153280258,
        0.024086272343993187,
        -0.025533322244882584,
        -0.008478296920657158,
        -0.016544410958886147,
        -0.004982406739145517,
        -0.0736897811293602,
        0.09194628894329071,
        -0.10106875747442245,
        -0.04727662727236748,
        -0.07131047546863556,
        0.0006499112350866199,
        -0.027257975190877914,
        0.01332217175513506,
        -0.11979523301124573,
        0.06439465284347534,
        0.016977697610855103,
        0.058769140392541885,
        -0.04942409321665764,
        0.05852749943733215,
        -0.054262425750494,
        -0.08629322052001953,
        -0.057707227766513824,
        -0.045583534985780716,
        0.04591415077447891,
        0.05404186621308327,
        0.07975779473781586,
        -0.0038293180987238884,
        0.009868994355201721,
        -0.01990870200097561,
        -0.03619050234556198,
        -0.018887007609009743,
        -0.03943512961268425,
        -0.11890040338039398,
        0.014227667823433876,
        0.026133032515645027,
        -0.006411922629922628,
        -0.04492047801613808,
        0.020451875403523445,
        -0.043165598064661026,
        -0.05229642242193222,
        0.008285063318908215,
        0.045231692492961884,
        0.018893146887421608,
        0.07863694429397583,
        0.12066864967346191,
        -0.0044837105087935925,
        0.058542367070913315,
        0.00226771691814065,
        0.052649881690740585,
        0.029810119420289993,
        -0.028789078816771507,
        -0.01538501400500536,
        0.10836036503314972,
        -0.03413739055395126,
        -6.461365131826824e-08,
        -0.03320038691163063,
        0.03973662108182907,
        0.017831237986683846,
        -0.042343929409980774,
        0.09083337336778641,
        -0.05602048709988594,
        -0.05611776188015938,
        -0.024889007210731506,
        0.003943545278161764,
        -0.0012200191849842668,
        0.10646037012338638,
        -0.05948812887072563,
        -0.07029569894075394,
        0.06804469227790833,
        0.05863804370164871,
        -0.02826695889234543,
        -0.06339312344789505,
        0.07674547284841537,
        -0.049165278673172,
        -0.02934846840798855,
        -0.00947786308825016,
        -0.03960747271776199,
        0.019610023126006126,
        -0.03712191805243492,
        -0.044660862535238266,
        0.03012113645672798,
        -0.03528551384806633,
        0.06032333895564079,
        0.050159018486738205,
        -0.04393826425075531,
        -0.008899019099771976,
        0.010155346244573593,
        -0.06808988004922867,
        -0.021055087447166443,
        -0.000993621302768588,
        -0.09143254160881042,
        -0.0939636155962944,
        0.00797219481319189,
        0.029988480731844902,
        0.07241164147853851,
        0.02691446989774704,
        -0.09125019609928131,
        0.004194381646811962,
        0.004606383386999369,
        -0.004237323999404907,
        -0.03578311949968338,
        0.043539125472307205,
        -0.11081425845623016,
        0.006629667244851589,
        -0.03468473628163338,
        -0.006221297197043896,
        -0.057511910796165466,
        0.0021343661937862635,
        0.0037272244226187468,
        0.07750232517719269,
        0.01252246554940939,
        0.06294213235378265,
        -0.019055353477597237,
        -0.03223934769630432,
        0.05568898841738701,
        0.029638852924108505,
        -0.08236583322286606,
        -0.04945080354809761,
        -0.02411455661058426
    ]
}