{
    "id": "oBP25Rvy_OI",
    "title": "I'm NEVER Switching Again - Samsung Z Flip 6",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-07-24T15:02:11Z",
    "video_url": "https://www.youtube.com/watch?v=oBP25Rvy_OI",
    "category": "Science & Technology",
    "tags": [
        "Samsung Galaxy Z Flip 6",
        "folding phone",
        "smartphone review",
        "Galaxy Unpacked",
        "foldable technology",
        "mobile photography",
        "Snapdragon 8 Gen 3",
        "Galaxy AI",
        "cover display",
        "durability test",
        "tech comparison",
        "Android",
        "flagship phones",
        "Samsung ecosystem",
        "Flip 6",
        "Samsung",
        "Z Flip",
        "Samsung Flip 6",
        "Austin",
        "Evans",
        "Austin Evans"
    ],
    "views": 389633,
    "likes": 9651,
    "comments_count": 886,
    "description": "Check out the Samsung Galaxy Z Flip 6:  (affiliate link)  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   I've been using the new Samsung Galaxy Z Flip 6 for over a week, and it's easily the best folding phone they've ever made. With major upgrades to the camera, processor, and battery life, it finally feels like a no-compromise device. But at $1100, is it actually worth the premium price tag? Let's dive in and find out.  Chapter Titles: 0:00 Is the Flip Worth It? 1:27 First Impressions 2:59 Camera 3:43 Battery 4:23 Performance 5:37 Design 7:00 Galaxy AI 8:58 Software 9:50 Durability 11:26 Areas of Improvement 12:16 Conclusion",
    "description_links": [
        "https://howl.me/cmJGQZZB2AW",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- The Samsung Galaxy Z Flip6 is easily the best folding phone that they've ever made. But at a new, more expensive price, is it actually worth it? So I'm out here in Paris for Samsung's Unpacked event. Now, I probably don't need to tell you that I'm a massive, massive fan of the Z Flip. I've been rocking a Z Flip in one iteration or another since the very beginning. But the downside has always been that the Z Flip feels like you're compromising when you're using it. You know, compare it to something like an S24, an S24 Ultra, you've always had downsides. But a lot of those have been rectified with the Z Flip6. We're talking about a significantly better main sensor, so it's now like 50 megapixel main camera, which is the same as the Galaxy S24 and should deliver theoretically, we'll see, but similar sort of performance. You also have the same Snapdragon 8 Gen 3 for Galaxy with a full vapor chamber. But I will say that there's one concern I have, which is price. So the Z Flip, for the last several generations, starting with the Z Flip3, has cost $1,000. A good price, especially considering that the first generation was like 14, 1500 bucks. But it's finally caught up with us. This is now an $1,100 phone. Now that's not just $100 increase for nothing. It now comes with 12 gigs of RAM instead of eight gigabytes of RAM, and 256 gigs of storage standard. So you know, certainly an improvement. But that's a substantial price increase. And so my real question, as I spend the next week or two with this phone and hopefully, the next year, is the Galaxy Z Flip6 actually worth it? But let's see what other people at Unpacked have to say. Do you think it's worth the extra $100? - Maybe some of the new features are worth it, but I have to try it out. - Is it worth, on your first impression, the extra $100? - No. - I feel like it's a hard thing to justify just yet 'cause we haven't tested it out, but it actually seems, for the first time ever, that it's an actual flagship device, which I'm really excited about. - Is it worth it? I don't know. - No, I'm not sure what the extra $100 went to, to be honest with you. - Worth the extra $100, I'm not sure about, but I think out of the two phones, the Flip is definitely the one to get this year. - I mean, I would probably pay it. For the average consumer, that's gonna be up to you, but I mean, I still really like it. - So at this point, it's been a little over a week using the Z Flip as my daily driver and I have a lot of thoughts. Now it should be no surprise to you as the guy who has been daily driving Z Flips since 2020 that I like the phone. You know, there's a lot that's good here. And when you look at the evolution of the Z Flips over time, it shouldn't really be a huge surprise. You know, that first Z Flip was incredibly under baked, but by the time the Z Flip 3 came out, and especially now that we've gotten with the Z Flip5 and the Z Flip6, these are really quite refined devices. And one of the big things that Samsung really tried to push with this model is parity. Now in the past Z Flips, while they've been terrific devices, really felt like they had quite a few limitations. So specifically when it came to the form factor, you always felt like you were losing something. So for me, it was always in a few key areas and specifically with the Z Flip6, they tried to address a lot of that. So we'll start out with the camera. The Z Flip6 now has the same 50 megapixel camera from the Galaxy S24, as well as, I think, the Z Fold 6. And this is a far cry from the 12 megapixel camera that was on pretty much every earlier version of the Z Flip. And I'll be honest, it was always kind of bad. The problem was that the Z Flip always was using a several year old lens and sensor, which meant that it was always just behind. Now we actually have parity on the camera side. Now I say that, there's no telephoto on the Z Flip6, but because you have a 50 megapixel camera, it actually does mean that you can get a little bit more of that digital zoom using some of their space zoom processing. It actually is quite decent. I was able to get some pretty nice looking images at 1X and 2X, and even a little bit farther if you don't mind pushing it if you have good light. Something else that we now have parity with is battery life. So the original Z Flip had pretty terrible battery. However, this time around the Z Flip6 has the exact same size 4000mAh battery from the Galaxy S24. What that means is surprise, surprise, battery life is totally solid. Now sure, you're probably not going to get two full days of use like you could on something like a an S24 Ultra if you try. However, I will say that the Z Flip is significantly better than last generation, even though it's only about a 10% larger battery cell. That combined with the Snapdragon 8 Gen 3 has meant that I'm actually getting like significantly better battery life, somewhere in the neighborhood of like about an hour or so of extra screen on time per day, which is really quite nice. Speaking of that Snapdragon processor, the Z Flips have always had cutting edge specs, right? So it's got the highest end Snapdragon 8 Gen 3. However, the problem has been, in the past at least, that the cooling solutions couldn't keep up. You know, if you look at the Z Flip, it actually has a lot less surface area for cooling than a traditional phone because the motherboards all in sort of like this sort of spot, which means that as it gets warm playing games, you're recording video outside, you're running GPS, in earlier iterations, the Z Flip just didn't really hold up that well. However, with the Z Flip6, it now has a pretty substantial vapor chamber. And I'll be honest with you, it does make a real difference. Just earlier today, I was recording like 20 plus minutes of 4K video using both the inner and the cover displays, in the sun, it's quite warm, no problems at all, not overheating, not even incredibly warm to the touch. So they've definitely done a much better job of getting the thermals under control. And you know, if I left it there, then Samsung I'm sure would be really happy. You know, this is what they were trying to pitch the Z Flip6 as, is the flip that finally has no compromise compared to buying a Galaxy S24 or a traditional bar phone. However, it's not quite that straightforward. So there are other changes here. So the design itself has been updated in a couple of major ways. So first of all, the actual aesthetic has been changed a little bit. So now the camera lenses have the same body matching colors as the rest of the phone, which I think looks nice. The finish has also been changed. They have a lot of colors. My review unit is the blue, although I'll be honest, I've actually pre-ordered a white Z Flip for myself. I actually think the white looks really good this year. It's kind of that panda look. But on top of that there's also a lot of other customization and that shouldn't be a big surprise, right. The Z Flip has always been about customization. So not only of course can you change your wallpaper on the outer display, but a lot of cool Samsung cases they sell like their Flipsuits, which this year, actually have LEDs in them. So it actually pulls power from the phone and you can have it like do these little like animations almost a little bit like what Nothing do. It's actually very cool. But on top of that, they made some subtle tweaks that I actually am a really big fan of. First of all, the sound that this phone makes when it closes is terrific. I'm gonna try to do this with one hand and I'm gonna try not to also drop my review unit. Listen to this. (phone smacks) Oh, it's so much better. They've actually removed the little rubber bumpers they used to always have on the Z Flip in favor of something that just claps much, much sort of harder. (crickets chirping) Hmm, could used a different phrase there. Now, other than that, I think, for the most part, people are gonna look at this and go, oh yeah, it's just another Z Flip. And that's mostly true, right. Now, there are other improvements like Galaxy AI, which is here. And to give Samsung a little bit of credit, we now have 12 gigs of RAM instead of eight gigs on the Z Flip6. Largely because they do want that extra RAM to run a bunch of the AI models on device. There are a lot of Galaxy AI features and most of them are kind of half-baked, if I'm honest with you. One that's kind of cool is the translation feature where you can have, you know, people talking on both sides of the phone using the cover display. That's kind of neat. I actually have found some use for the voice memo feature where it will not only listen to different speakers, but it'll also like tag them and stuff, that's cool. But I actually found a really weird bug. So I'm working currently on a video on the ROG Ally X, which may or may not be live by the time you watch this. And I figured it'd be fun to just sort of talk out loud some notes to the Z Flip, let it record the voice memo feature. Kinda use that just to kind of summarize some of my thoughts. Now the transcription feature worked absolutely no problem, a couple typos here and there, but actually was really, really good. But then there's an AI powered summarization and when I clicked on that, I was very surprised to see that it was kind of hallucinating stuff based on my notes. It was bringing up a comparison to the AYA Neo that I didn't make. At one point, it decided that my ROG Ally was in fact an ROG Zephyrus G14, which is not like a small sort of mistake. Legitimately, don't know how they're doing that. And like, look, sure, all AI can have problems from time to time, but like the Galaxy AI stuff, like I'm just being super honest with you, meh. It's not a reason to buy a Z Flip6. It's nice that it's there and because you have the 12 gigs of RAM and that very powerful Snapdragon 8 Gen 3, we will probably see more Galaxy AI features being added to the Flip over the next, you know, year or two, which is great. I mean, more features are always nice. And you can doodle and create images, or generate your own wallpapers, like these are fine, but I would say they're a little bit more like party tricks than like stuff that you're gonna use every day, at least for the most part. Hardware-wise, both the cover display and inner are essentially the same. Now they do actually get a little bit brighter this year. But the main difference is actually with the actual software on the cover display. So you still can't run apps by default on it, which is just ridiculous to me. But thankfully, it's a super easy workaround. You just download Samsung Good Lock and enable the feature, and then fricking load up all the apps you want on the cover display. And that actually is a really big selling point for the Z Flip because for me, I really value the fact that if I'm out and about and I want to check a notification or something, I can use the cover display, scroll through, you know, respond to a message, whatever, and then close it without getting sucked into an hour of Instagram Reels or TikTok or something. I think that's a really valuable part of, you know, you can actually get stuff done with the Z Flip when it's closed. Now I would like it if the screen was a little bit bigger and maybe a little bit higher resolution. The Moto Razr has, by far, the best looking cover display, but it's still really quite usable on the Z Flip. Durability is something to talk about. Now as someone who's used a lot of Z Flips, I've had my fair share of screen protectors peeling, dead screens, yada yada yada. But I'll say it has been getting better. I've been having fewer and fewer issues the last couple of years. To the point where my Z Flip5, I've had zero problems with it for the last year and it's actually taken some pretty serious falls. And with the Z Flip6, they've made a couple of improvements including, you know, beefing up the hinge, which they do every year to kind of tweak and tune it, but it also has a thicker glass in the display as well as a new coating, which theoretically will help it be a little bit more durable. Obviously, time will tell. But the Z Flip6 feels like the most refined version. It feels really, really solid. Like I have, at this point, I use a Z Flip just the same way I would use any other phone, right. Drop it, get it wet, whatever. I mean it just, it's a phone, right. It's a tool, it's something that you use on your daily basis and I don't have to baby the Z Flips at all anymore. Besides maybe not like taking something super sharp to the inner display, but well, just fold it. This is a little bit random, but I've actually noticed that the Z Flip is no longer symmetrical. And what I mean by that is that if you look at the bottom versus the top of the phone when it's folded, the bottom sticks out ever so slightly more than the top. And for me, that means it's actually significantly easier to open it up. Now I'll admit it's such a small difference, it's gotta be like a 10th of a millimeter or something, it could just be my hinge is ever so slightly misaligned. But honestly, I hope that it's a real thing because it actually makes it easier for me to open this phone. And it's something that I probably used the phone for like three days before I actually noticed. Now, areas that I would still like to see the Z Flip improve. I mean, performance is there. I think the camera is still an A, it's not as good as something like the iPhone, if I'm being entirely honest with you. And as a content creator, I always want to use the best possible device that I can get my hands on. If I'm gonna be really honest with you, I shot this entire video on the Z Flip earlier today and then realized it was out of focus and it couldn't focus on my face, which is right in front of the lens. So camera tuning could use maybe a little bit more optimization. But I will say though, by and large, it actually is quite good. And I have found myself using the Z Flip6 a lot more than I used earlier Z Flips just because the camera's actually good, unlike before in which it was just like good if I was still in 2021. It to me is really down to, if you really want a Z Flip, the Z Flip6 is by far the best one they've ever made. The compromises are so much less than they were in the past. It's a terrific phone. I have very, very little to criticize, but $1,100 is a lot of money. And when you look at the resale value of earlier Z Flips, and when you look at the likely future resale value of the Z Flip6, it's probably gonna be worth a few hundred dollars in a few years. And that might not sit too well with you. Although, if you go down that rabbit hole, everything not called an iPhone also drops a lot in value too. Bottom line is this, the Z Flip6 is the best folding phone you can buy, period. Is it perfect? Of course not. But it is the most refined, the best to use, and the best overall package that Samsung have ever put together. And I'm happily going to continue using the Z Flip for the next year. But surprise, surprise, right, the Z Flip guy likes the new Z Flip. (Austin chuckles)",
    "transcript_keywords": [
        "Flip",
        "Flips",
        "Galaxy",
        "phone",
        "lot",
        "bit",
        "Samsung",
        "camera",
        "year",
        "good",
        "display",
        "time",
        "kind",
        "cover display",
        "worth",
        "honest",
        "Samsung Galaxy",
        "Flip earlier",
        "Snapdragon",
        "RAM"
    ],
    "transcript_entity_values": [
        "Samsung Good Lock",
        "daily",
        "Instagram Reels",
        "this year",
        "12 megapixel",
        "half",
        "2021",
        "iPhone",
        "the Galaxy S24",
        "First",
        "TikTok",
        "just $100",
        "the Z Flip",
        "the next week",
        "256",
        "the Z Flip6",
        "first",
        "RAM",
        "several year old",
        "the next year",
        "the Z Flip6",
        "eight",
        "ROG Ally",
        "Samsung",
        "the Z Flip3",
        "two full days",
        "10th",
        "Austin",
        "a few hundred dollars",
        "two",
        "2020",
        "a few years",
        "the ROG Ally X",
        "a little over a week",
        "Snapdragon",
        "50 megapixel",
        "12",
        "4",
        "the AYA Neo",
        "eight gigabytes",
        "one",
        "1,100",
        "2X",
        "Galaxy Z Flip6",
        "Snapdragon 8 Gen 3",
        "Paris",
        "20 plus minutes",
        "AI",
        "three days",
        "the Z Flip6",
        "year",
        "Galaxy",
        "about an hour",
        "The Z Flip6",
        "an hour",
        "the last couple of years",
        "Flip",
        "zero",
        "The Moto Razr",
        "the Z Fold 6",
        "Z Flips",
        "10%",
        "the Z Flip earlier today",
        "Galaxy AI",
        "the last year",
        "1,000",
        "S24",
        "14",
        "100",
        "1500 bucks",
        "3"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "FAC",
        "ORDINAL",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "LAW",
        "GPE",
        "TIME",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.15165604650974274,
        0.03497716411948204,
        0.05005054920911789,
        -0.02186247892677784,
        0.027336029335856438,
        -0.0342041477560997,
        0.019889380782842636,
        0.1735733300447464,
        -0.01653508096933365,
        0.04800117388367653,
        -0.04147275909781456,
        0.05769122764468193,
        0.007540551014244556,
        -0.023765884339809418,
        0.04815906286239624,
        -0.011821139603853226,
        0.03235207498073578,
        -0.06366079300642014,
        -0.0714617669582367,
        0.04801773652434349,
        -0.025597942993044853,
        -0.028176559135317802,
        0.05369790643453598,
        -0.03114202618598938,
        0.09468372911214828,
        0.021906618028879166,
        -0.04116605222225189,
        -0.012192681431770325,
        -0.0044219172559678555,
        0.03583552688360214,
        -0.008097587153315544,
        0.15792341530323029,
        0.008364337496459484,
        0.010461295954883099,
        0.02556016854941845,
        -0.06653884053230286,
        0.04541666805744171,
        -0.017680227756500244,
        -0.03370694816112518,
        0.04326871782541275,
        -0.07144339382648468,
        0.0069168503396213055,
        -0.011171702295541763,
        -0.03192161023616791,
        0.02851605787873268,
        -0.011494808830320835,
        0.013139293529093266,
        0.0014784827362746,
        0.011163461022078991,
        0.01682291366159916,
        0.06494967639446259,
        -0.0004551335296127945,
        -0.005203807260841131,
        -0.029735736548900604,
        -0.02487783506512642,
        0.10570305585861206,
        -0.02321389503777027,
        -0.08121415972709656,
        0.037398483604192734,
        0.015112534165382385,
        0.03659205511212349,
        -0.03383747488260269,
        -0.030127039179205894,
        0.08495455235242844,
        0.04337988793849945,
        -0.014550077728927135,
        -0.01235353946685791,
        -0.1168997660279274,
        -0.004512472078204155,
        0.03272964805364609,
        -0.05633963644504547,
        0.05731147527694702,
        0.05065925046801567,
        0.033431243151426315,
        0.0043981424532830715,
        -0.01181068830192089,
        0.08413969725370407,
        -0.08799319714307785,
        -0.06126883625984192,
        0.02145867608487606,
        0.06882661581039429,
        -0.10895809531211853,
        -0.08106370270252228,
        0.006449115928262472,
        0.06427235901355743,
        -0.05649451166391373,
        0.05188712105154991,
        0.05301915854215622,
        -0.010270572267472744,
        -0.0405648797750473,
        0.03860722854733467,
        0.10081407427787781,
        0.00519587192684412,
        -0.049727246165275574,
        -0.05410156771540642,
        0.04166754335165024,
        -0.07655539363622665,
        -0.006542346905916929,
        -0.041790224611759186,
        0.012160112150013447,
        0.06303713470697403,
        -0.005589477252215147,
        0.0749364122748375,
        -0.017289746552705765,
        0.06908346712589264,
        -0.07748854160308838,
        0.018818514421582222,
        0.059322208166122437,
        -0.05508257448673248,
        0.023607928305864334,
        0.004347159992903471,
        0.006028425879776478,
        0.05173318088054657,
        -0.004896238446235657,
        -0.06835029274225235,
        0.02391543798148632,
        -0.060863152146339417,
        -0.002760603791102767,
        0.07495775818824768,
        0.06050635129213333,
        -0.015700746327638626,
        -0.01706342026591301,
        -0.016028812155127525,
        -0.0741443857550621,
        -0.07910263538360596,
        -0.027675552293658257,
        -0.015318530611693859,
        3.4206808467111794e-33,
        -0.06229666993021965,
        0.13855259120464325,
        -0.06167557090520859,
        -0.08568970113992691,
        -0.05368912220001221,
        0.0364837646484375,
        0.0138577651232481,
        0.021861806511878967,
        -0.07602453231811523,
        0.05719785392284393,
        -0.045065488666296005,
        0.04189467802643776,
        -0.01541693601757288,
        0.019678819924592972,
        0.05706494301557541,
        -0.004532471764832735,
        -0.0028438998851925135,
        -0.05533720925450325,
        -0.043659184128046036,
        -0.03424229100346565,
        0.03520067036151886,
        -0.02142755687236786,
        0.03946009650826454,
        -0.008788574486970901,
        0.004536242224276066,
        -0.008215856738388538,
        0.06018267571926117,
        -0.06290989369153976,
        0.005729534663259983,
        -0.010279225185513496,
        -0.08629794418811798,
        -0.009480996988713741,
        0.036702901124954224,
        -0.06166696548461914,
        0.03569825366139412,
        0.047451239079236984,
        0.0352407805621624,
        -0.09640833735466003,
        0.04685326665639877,
        -0.05174649506807327,
        -0.07419879734516144,
        0.06378680467605591,
        -0.1275824010372162,
        0.026726020500063896,
        0.030195526778697968,
        0.015398286283016205,
        0.011600693687796593,
        -0.019747251644730568,
        -0.06572016328573227,
        -0.049970343708992004,
        -0.03010319359600544,
        -0.04409829154610634,
        -0.024557599797844887,
        0.01252833753824234,
        -0.0629568099975586,
        -0.04201960191130638,
        0.033315569162368774,
        -0.012840300798416138,
        0.0491926446557045,
        0.07939135283231735,
        -0.017026182264089584,
        0.004461550619453192,
        -0.07778973132371902,
        0.045220814645290375,
        -0.08215463906526566,
        0.09517234563827515,
        0.057004164904356,
        0.002253088401630521,
        -0.10084831714630127,
        0.04003392904996872,
        0.01609029993414879,
        -0.05400091037154198,
        -0.03618758171796799,
        -0.02217881940305233,
        0.08416350930929184,
        0.058888427913188934,
        0.016176017001271248,
        -0.0426051989197731,
        0.00544551620259881,
        -0.008458289317786694,
        -0.028015566989779472,
        0.009861255995929241,
        0.04669918864965439,
        0.0410548597574234,
        0.012897826731204987,
        -0.019638046622276306,
        -0.006739398930221796,
        -0.07100408524274826,
        -0.007584106642752886,
        0.052180297672748566,
        0.01846476085484028,
        -0.018228717148303986,
        -0.01686643250286579,
        -0.025067618116736412,
        0.01769070327281952,
        -3.4024930103680815e-33,
        -0.025691809132695198,
        0.006347145419567823,
        -5.4546816841138934e-08,
        0.03172460198402405,
        -0.012759079225361347,
        -0.043772950768470764,
        0.02866622991859913,
        0.01504797488451004,
        -0.06217304244637489,
        -0.08253149688243866,
        -0.04616222903132439,
        0.07411636412143707,
        0.009745591320097446,
        -6.978453166084364e-05,
        0.03193081542849541,
        -0.07091592997312546,
        -0.019629565998911858,
        -0.1045985147356987,
        0.08421670645475388,
        0.0012998331803828478,
        0.03883086144924164,
        0.07337678968906403,
        -0.026784200221300125,
        0.035184137523174286,
        -0.04352239891886711,
        0.046065762639045715,
        -0.0021650693379342556,
        0.01721571944653988,
        0.10184694081544876,
        -0.023128654807806015,
        0.02417711168527603,
        -0.08013730496168137,
        0.05279558524489403,
        0.016206812113523483,
        0.037032969295978546,
        0.07019282877445221,
        0.04546298831701279,
        -0.011431640945374966,
        0.0410052090883255,
        0.019067654386162758,
        -0.02987486496567726,
        0.0009232009761035442,
        0.008202655240893364,
        -0.045394279062747955,
        0.08016156405210495,
        -0.06339041888713837,
        -0.014501691795885563,
        0.02856328897178173,
        0.004801130387932062,
        -9.103499905904755e-05,
        0.006119134835898876,
        0.02985081449151039,
        0.0017024790868163109,
        0.02309384010732174,
        -0.045760247856378555,
        -0.00018686236580833793,
        -0.008852936327457428,
        -0.06968219578266144,
        0.02777983620762825,
        -0.03875916823744774,
        0.08890010416507721,
        0.05768757686018944,
        -0.03612789511680603,
        -0.04167019948363304,
        -0.025792768225073814,
        0.021086417138576508,
        0.11689411848783493,
        -0.03332642465829849,
        -0.020990783348679543,
        -0.07074484974145889,
        -0.10254206508398056,
        -0.028570104390382767,
        -0.04213067516684532,
        -0.13871383666992188,
        -0.017696062102913857,
        0.1474960446357727,
        -0.036579977720975876,
        0.05373353883624077,
        0.03660472854971886,
        -0.019101081416010857,
        -0.033728424459695816,
        -0.021064525470137596,
        0.020861735567450523,
        0.0058842129074037075,
        0.016178671270608902,
        0.01393266674131155,
        -0.014552854001522064,
        -0.03798922896385193,
        -0.02317330613732338,
        0.04320488125085831,
        -0.05773235112428665,
        -0.03969564661383629,
        -0.05424685776233673,
        0.06011722981929779,
        0.02469664253294468,
        -5.195641250566041e-08,
        0.054853472858667374,
        0.011270314455032349,
        0.09318549185991287,
        -0.0050775897689163685,
        0.010521261021494865,
        -0.05205569043755531,
        0.031649306416511536,
        -0.029960092157125473,
        0.03232266381382942,
        0.03014077991247177,
        0.03525043651461601,
        -0.07251773774623871,
        -0.03968779370188713,
        0.026767302304506302,
        -0.044052768498659134,
        0.08576050400733948,
        0.021279925480484962,
        0.05117008462548256,
        0.007539714220911264,
        0.0894271731376648,
        0.060986440628767014,
        0.013897594064474106,
        0.010778658092021942,
        -0.030293848365545273,
        0.010098187252879143,
        0.00653776666149497,
        -0.07525121420621872,
        0.012671423144638538,
        0.06824833154678345,
        -0.06553598493337631,
        -0.0358320027589798,
        -0.04409266635775566,
        0.03948993980884552,
        0.04156811535358429,
        -0.0010818190639838576,
        -0.07910216599702835,
        -0.0482870414853096,
        -0.06554275751113892,
        0.0823102742433548,
        0.028763510286808014,
        0.0986618623137474,
        -0.03179844841361046,
        -0.04085274785757065,
        0.05246850103139877,
        -0.039451055228710175,
        -0.08544166386127472,
        0.0371350422501564,
        -0.0734810009598732,
        0.009649359621107578,
        0.05120348930358887,
        -0.04937992990016937,
        -0.04538080096244812,
        -0.06447797268629074,
        0.00014386928523890674,
        0.05433233827352524,
        0.02861982397735119,
        0.051387712359428406,
        0.02564603090286255,
        -0.05731578171253204,
        0.08655431121587753,
        0.03738005831837654,
        -0.14614221453666687,
        -0.06355283409357071,
        0.03462681546807289
    ]
}