{
    "id": "ocSqi5boO_4",
    "title": "iPadOS & iOS 14 public beta: all the overdue features",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-07-09T17:08:17Z",
    "video_url": "https://www.youtube.com/watch?v=ocSqi5boO_4",
    "category": "Science & Technology",
    "tags": [
        "ipados 14",
        "iOS 14",
        "iOS",
        "ipados",
        "ipad os",
        "ipad os 14",
        "new ipad os",
        "new ios",
        "ios",
        "apple ios",
        "ios apple",
        "apple software",
        "iPhone",
        "iphone 11",
        "ipad",
        "ipad Pro",
        "ipad air",
        "iOS 14 public beta",
        "iPad os public beta",
        "public beta",
        "developer beta",
        "hands on",
        "preview",
        "new software",
        "home screen",
        "widgets",
        "scribble",
        "dieter bohn",
        "new features",
        "processor",
        "apple",
        "need to know",
        "what to expect",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to download",
        "google",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 599668,
    "likes": 11444,
    "comments_count": 793,
    "description": "Your iPhone and iPad are getting new software this fall, but the public beta for iOS 14 and iPadOS 14 are available right now. From a new home screen to widgets to Scribble, Dieter Bohn breaks down the most important and best new features you can expect.   Learn more:   0:00 Intro 0:18 Should you install? 1:00 Homescreen & widgets on iOS 14 1:39 Apple Pencil on iPadOS 14 2:04 Scribble 3:04 Notes app 4:10 Translate app 5:35 Compact UI 6:19 Sidebar 6:35 Additional features 7:11 Apple Maps 8:21 A thousand other features 8:48 Screen recognition 10:27 Photo captions 10:51 Outro  For all the new homescreen features on iOS 14, check out our video here:   Subscribe:  Subscribe to Verge Science:   Read More:  Community guidelines:  Wallpapers from The Verge:  More about our podcasts:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:",
    "description_links": [
        "https://bit.ly/2Zc1PzG",
        "https://youtu.be/d6ai8ZGoYjY",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://www.theverge.com/podcasts",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX"
    ],
    "transcript": "(upbeat music) - The public betas for IOS 14 on the iPhone and iPadOS 14 on the iPad are available to download today. Now, I have been using the developer betas up to now, so I wanted to go over some of the big features that you can expect and also some of the little things that you might have missed, but first, should you install it? I would wait. I would wait to see what people are saying about its stability. Some years, those betas, they feel basically done and other years they're kind of a mess. Based on the developer beta so far, this seems like a good year, but honestly, you should never put a beta on your main phone if you can help it. So, each platform, IOS and iPadOS, are gonna get a flagship feature and then there's all those little tweaks and changes that I mentioned. Regardless of whether you're being responsible and waiting for the official release or if you're being irresponsible and you're installing it today, here's what you can expect. (mellow music) Now, on the iPhone, the big flagship feature on IOS 14 is the new home screen. You are now able to take widgets and put them on your home screen on any screen that you want interspersed with your other icons. Apple has also made a new section called the App Library that has all of your apps, it's just like an app drawer on Android and Apple categorizes them for you, that means you don't have to have like a junk folder anymore which is really great. Last but not least, you can also hide entire app pages, which means you can have a page that's there for the weekends if you wanna and then it's gone when you're just going to work everyday. Now, I've already made a full video about all of the features on the new home screen in IOS 14, so I'll have a link down there in the show notes, tell you everything I think about it, but I wanna focus right now on the flagship feature on iPadOS, and weirdly, it's not the home screen, because then iPhone gets it and the iPad has to stay with the old home screen for a dumb reason. I don't know, whatever. The main new flagship feature on iPadOS 14 is this Apple Pencil, and specifically it's that you're gonna have to put this thing down a lot less often. Now, the first major new feature for the Apple Pencil on iPadOS is called Scribble. This let's you write text with your handwriting in any arbitrary text field, so you just go to a text field and start writing in that text field. And the nice thing about this is you can sort of let your handwriting roam all over the entire iPad and it'll still work, as long as you start inside that text field. Now, you'll also notice here that it didn't get my handwriting exactly right, which is a little bit annoying, but you can do a couple of other things with that. You can circle some text and that will select it. You can also just scratch some text out and it will delete it. That all seems great, but this isn't really a full-featured, write however you want sort of system, because it does take that second for it to resolve into some sort of text that you can actually work with and you won't see right away whether or not it was accurate. So Scribble is great for short notes, but it is not great for taking a lot of notes long form if you're sitting in a class or something, but there is something that is very good for taking a lot of notes if you're sitting in class or something and that is Apple's Notes app. So I've got Apple Notes here open and you've been able to do handwriting in Apple Notes for quite a while now, but what's new is you can actually long-press that word and then you get these little selector bars here and then you can copy as text. You could also paste it then as text, so you can get the plain text out of your handwritten notes, which makes Apple Notes a much more convenient way to do note taking, because you can actually search for stuff and then copy it out and paste it into, you know, something that you can actually share around. The other thing you can do in Apple Notes is if you draw a shape and hold the pencil down at the end, you get a mice clean version of that shape, which is really nice. Basically, the combination of Scribble plus the ability to get plain text out of your handwriting in Apple Notes means that you can leave this pencil in your hand instead of constantly setting it down to like pull up the keyboard or use the, you know, the Apple keyboard or whatever, you could just use this. Now, it's not perfect. Like I said, I think that Scribble has a little bit too much of a delay, so it's too slow, but on the whole, the new features on iPadOS 14 make me feel like I actually wanna use the Apple Pencil instead of feeling bad that I bought it and never use it, 'cause I'm not an artist. Actually, I wanna sneak in one more flagship feature and that is the Translate app that Apple has made. Unfortunately it's not available on the iPad, I don't know why, but I wanna compare it real quick to Google Translate, because I think Apple's done a pretty good job for a first effort. They both do the same thing by tapping the microphone button here. I'm speaking in English, please translate this into Spanish. They both are successfully able to do that, but they're supposed to be able to understand when someone speaks back to you in Spanish and then translate it into English in auto mode. We're gonna give that a shot. (speaking in foreign language) So you can see they both successfully translated from Spanish into English. So those are the main flagship features, but there's a bunch of little stuff, actually, some of it's not that little. That's really hard to categorize. There are just 1,000 tiny changes, way too many for me to get through all of them. I sort of feel like Apple told its engineers, \"Hey, you know all those half finished projects \"that you love but we made you put in the back burner? \"Yeah, it's time to ship all of that.\" Like default apps, you know that some engineer built the ability like five years ago for you to set Gmail or Chrome or whatever as your main email app or browser, but now it's finally here. Only it only works for email and browsers, it doesn't work for maps. I don't know, there's always next year. So the first big group of small changes is it seems like Apple finally figured out that you can show stuff on top of other stuff without switching the whole damn screen over to the stuff that you wanna show and it lets you keep your contacts, that's just a little bit more elegant. Apple calls this Compact UI and there's a few examples of it. First, when someone calls you it doesn't take up the whole screen. When you invoke Siri, it's just this cute little bubble now that you can see pulsing with the sound of your voice. You can get picture in picture with a few different apps on the iPhone or of course on the iPad. You get much nicer search on the iPad. It pops up over what you're doing by just hitting Command + Space, it's less intrusive and it let's you get to Siri Shortcuts so you can get way faster access to your Siri Shortcuts from anywhere. There's just a few other little design tweaks I wanna talk about. They've changed up the way sidebars look in iPadOS and I thinks it's because they know that there's gonna be a lot more iPad apps coming to the Mac and so they wanted the sidebars to be a little bit more consistent between the iPad and the Mac. There's also a new time picker so you no longer have those weird little dials, but you gotta be careful though, 'cause sometimes the little number paddle gets stuck just on the hour or just on the minute. So that's the big system wide stuff, but there are a lot, and I mean a lot of changes inside all of Apple's core apps. So for example, in Messages you can pin conversations, you can have inline reply threads and you can have mentions, I'm not gonna show any of this to you, 'cause I don't wanna show you my messages, whatever. In the Home app there is now suggestions and there's also new buttons inside the control center from the Home app. The Weather app will show you next hour precipitation, RIP Dark Sky for Android. Apple Maps actually got the biggest changes, because I think Apple had the most work that it had to do there. So I've got Apple Maps open here and you can see I've got some directions set up, but I have them set up via bike, which is the new feature inside Apple Maps and one of the nice things you can see here is that in addition to showing you how long it's gonna take, there's also what the elevation's gonna look like, 'cause riding up to Sutro Tower is a lot of work. It gives you a little bit of information about what the path is gonna look like, where you're gonna be on main roads or are you gonna have your own bike lane? This is all pretty nice, but it's a little bit of a catch up to Google Maps. I actually prefer the way Google Maps handles bike routes, because you can see here that it actually just has a straight up map overlay on top of your map, showing you where all the bike lanes are which is a lot nicer, a lot easier to plan your stuff out before you get out on the road. If you go in search here, there's now this area called Guides, which they've got some editorial content from a bunch of other websites, showing you, you know, trails from AllTrail or what not. There's also enhanced maps coming to the UK, Canada, Ireland, and there's also electrical vehicle routing so you can find where to charge your car and they also support congestion zones so you know whether or not you're gonna have to pay a toll to go into a city. There's just a thousand other features that we can get into and I just don't have time. There's privacy enhancements. Apps have to ask your permission for tracking. There's on-device dictation, there's app clips, there's enhancement emoji, there's Car Keys, there's wallpapers and CarPlay now, there's spacial audio for AirPods. The camera app is able to shoot faster between photos. You can get exposure lock. There's a bedtime feature. There's a redesigned image picker and way, way more. One that I wanna actually take a closer look at is VoiceOver recognition. There's a new feature called Screen Recognition. So we go into Settings, Accessibility, VoiceOver, there's a setting here called VoiceOver Recognition, so it can read image descriptions to you, but it also has screen recognition. So just like on Android, the iPhone will try and identify elements on the screen so you can say them out loud. So instead of saying 47 to hit that spot on the grid, you can just say Tweet and it will read the Tweet button and hit the Tweet button for you. Now, usually with these big operating system previews, I try to give you the theme, the overarching idea that ties it all together, and that's actually not that easy to do this time. I mean, I can try, so for the iPhone the overarching theme is that they're finally letting it get complicated. The home screen starts simple, but it can be complex if you want it to and Apple's also finally putting different elements on top of other elements, so you can see Siri on top of your current screen instead of it taking over the whole screen. For the iPad, I guess it's that it's getting just a little bit more Mac-like, like on those sidebars, because we know that these apps are gonna be on the Mac eventually, but it's not getting fully Mac-like, because you can't do multi-user on the iPad, because... But the truth is that most of these updates are a thousand little improvements in a thousand places and that's great, but I sort of think it's time for Apple to stop bundling all of these improvements into a yearly thing. For big system level stuff, like the home screen and the Compact UI, that does belong in an OS update, but for all of Apple's app features, why not just release them when they're ready throughout the year? That's how Android does it and Windows, like basically that's how everybody else does it. Just release the updates via the App Store. It'll be okay, Apple, I promise. Like for example, one feature in IOS 14 that's awesome is you can add captions to photos now so they're easier to search for later. If Apple had released that two moths ago as an app update, you might actually know about it and use it. Instead, it's just feature 637 on IOS 14. I mean look, if my biggest complain about IOS 14 is that there's too many new good things in it, that's really not a huge complaint, but it is just a little bit overwhelming. Hey, thanks so much for watching. Like I said earlier, we have a full deep dive on the home screen on the iPhone on IOS 14, so click on the box to watch that. And if I'm pointing in the wrong direction, just pretend I'm not.",
    "transcript_keywords": [
        "Apple",
        "Apple Notes",
        "Apple Notes app",
        "Apple app features",
        "Apple Maps",
        "home screen",
        "Apple Pencil",
        "screen",
        "App",
        "notes",
        "feature",
        "text",
        "flagship feature",
        "IOS",
        "home",
        "makes Apple Notes",
        "feature inside Apple",
        "iPad",
        "inside Apple Maps",
        "apps"
    ],
    "transcript_entity_values": [
        "next year",
        "Some years",
        "Android",
        "one",
        "Mac",
        "Apple",
        "the minute",
        "Apple Notes",
        "a thousand",
        "Windows",
        "14",
        "today",
        "637",
        "five years ago",
        "Screen Recognition",
        "the App Store",
        "two moths ago",
        "next hour",
        "the Compact UI",
        "UK",
        "47",
        "iPad",
        "Gmail",
        "Sutro Tower",
        "the Apple Pencil",
        "Ireland",
        "half",
        "a good year",
        "the hour",
        "Settings, Accessibility",
        "Siri",
        "thousand",
        "English",
        "iPad",
        "IOS",
        "Chrome",
        "Home",
        "Apple Maps",
        "AirPods",
        "just 1,000",
        "AllTrail",
        "Notes",
        "Google Maps",
        "CarPlay",
        "second",
        "Canada",
        "first",
        "iPhone",
        "Mac",
        "the year",
        "the App Library",
        "First",
        "Spanish"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "FAC",
        "DATE",
        "TIME",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "LANGUAGE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "ORDINAL",
        "GPE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "LANGUAGE"
    ],
    "vector": [
        -0.06020035222172737,
        -0.08283013850450516,
        0.027014533057808876,
        -0.08131495118141174,
        0.05224677920341492,
        0.020689604803919792,
        -0.02964661456644535,
        0.024251850321888924,
        -0.021771861240267754,
        -0.00469961017370224,
        0.056896235793828964,
        0.03152158111333847,
        -0.09374973922967911,
        0.06188711151480675,
        0.05265837162733078,
        -0.021980013698339462,
        0.09481478482484818,
        -0.03734530508518219,
        0.03127725422382355,
        -0.059999532997608185,
        -0.07030332088470459,
        0.0035109659656882286,
        0.030271954834461212,
        0.04522910714149475,
        0.03671923652291298,
        0.03048131614923477,
        -0.05361717939376831,
        -0.09097971767187119,
        -0.02792348340153694,
        -0.019613903015851974,
        0.018690770491957664,
        0.04449988529086113,
        0.07094316929578781,
        0.0289546437561512,
        -0.04883945733308792,
        -0.10556984692811966,
        0.056204039603471756,
        -0.03949681296944618,
        -0.012337425723671913,
        -0.06179317831993103,
        -0.05590660125017166,
        -0.023813894018530846,
        -0.0303299892693758,
        0.08048973232507706,
        0.034094300121068954,
        -0.039045628160238266,
        -0.008453892543911934,
        -0.037464890629053116,
        0.04420141875743866,
        0.02129802480340004,
        -0.009159696288406849,
        -0.0851614698767662,
        0.011324875056743622,
        0.04755571112036705,
        0.027347300201654434,
        0.02997392974793911,
        -0.03423846885561943,
        0.05946345627307892,
        0.11461528390645981,
        0.05240483209490776,
        0.026933792978525162,
        -0.08067046105861664,
        0.012983755208551884,
        0.07086078077554703,
        -0.01122513972222805,
        -0.03304089605808258,
        -0.010998097248375416,
        0.023652121424674988,
        0.02993469312787056,
        -0.05061111971735954,
        0.0018942406168207526,
        0.03585553541779518,
        0.10761790722608566,
        -0.0356455035507679,
        0.036362871527671814,
        -0.012299672700464725,
        0.033982835710048676,
        -0.0046461522579193115,
        -0.04358570650219917,
        -0.09912654012441635,
        0.035544030368328094,
        -0.018856266513466835,
        0.04303855076432228,
        -0.017576174810528755,
        -0.02299218624830246,
        -0.00966659002006054,
        -0.06558113545179367,
        0.006343587767332792,
        -0.026739472523331642,
        0.018676653504371643,
        -0.01077797170728445,
        0.06747939437627792,
        0.0018279880750924349,
        -0.02393234893679619,
        0.012849287129938602,
        -0.01619165763258934,
        0.016823431476950645,
        -0.10591554641723633,
        -0.10031702369451523,
        0.05539415031671524,
        0.011706315912306309,
        0.05089348927140236,
        0.07383990287780762,
        -0.008358818478882313,
        -0.023373177275061607,
        -0.00940321758389473,
        0.052417658269405365,
        -0.08040612190961838,
        0.03174299746751785,
        0.09413609653711319,
        0.03504660353064537,
        0.0286200400441885,
        0.014593240804970264,
        -0.09937266260385513,
        0.04961121454834938,
        -0.040966734290122986,
        0.008748217485845089,
        0.05623448267579079,
        0.14362654089927673,
        0.06548228859901428,
        0.005562346428632736,
        0.06358467042446136,
        -0.045331984758377075,
        -0.08602398633956909,
        -0.042967699468135834,
        0.04775173217058182,
        -0.058014992624521255,
        7.295721116741882e-33,
        0.017706207931041718,
        0.09054028242826462,
        -0.060099292546510696,
        -0.05095630884170532,
        0.061973538249731064,
        -0.13327807188034058,
        -0.0058954874984920025,
        0.04648487642407417,
        -0.03331860899925232,
        -0.04693207889795303,
        -0.011803501285612583,
        -0.046271633356809616,
        -0.0983959287405014,
        0.036221910268068314,
        0.05816880241036415,
        -0.07377393543720245,
        -0.01902756094932556,
        -0.0031232191249728203,
        0.010666191577911377,
        -0.0003013287205249071,
        -0.025679804384708405,
        -0.1250961720943451,
        -0.044842906296253204,
        -0.007837768644094467,
        0.04224180430173874,
        0.018638046458363533,
        0.04418758302927017,
        -0.007198938634246588,
        0.01741875149309635,
        0.029734041541814804,
        -0.06387452036142349,
        0.05774698406457901,
        -0.0016943332739174366,
        -0.05932076647877693,
        -0.05237744003534317,
        -0.09659740328788757,
        -0.023200487717986107,
        -0.12136510759592056,
        0.07049822807312012,
        -0.06061860918998718,
        -0.0029505393467843533,
        -0.013275790959596634,
        -0.06467057764530182,
        0.008292124606668949,
        0.0534028559923172,
        0.05948599427938461,
        0.04837191104888916,
        0.031605906784534454,
        0.05618765950202942,
        0.030511444434523582,
        -0.03462568670511246,
        -0.028430864214897156,
        -0.08555728197097778,
        -0.043949954211711884,
        -0.07037422806024551,
        -0.0346699096262455,
        -0.0050616757944226265,
        -0.0887635201215744,
        0.014840641990303993,
        -0.027077816426753998,
        -0.010046645998954773,
        0.028663696721196175,
        -0.037347462028265,
        -0.07200366258621216,
        -0.0844285860657692,
        0.07228891551494598,
        0.010981465689837933,
        0.0004466006066650152,
        -0.03402264788746834,
        -0.0025758896954357624,
        -0.08397681266069412,
        0.06533695757389069,
        -0.00048516938113607466,
        -0.014488358981907368,
        -0.05486691743135452,
        0.02649586834013462,
        -0.006749649997800589,
        -0.08674503862857819,
        -0.00119585741776973,
        -0.0014872484607622027,
        -0.06118576228618622,
        0.022317947819828987,
        0.006403599865734577,
        0.025170547887682915,
        0.055452946573495865,
        -0.06109001487493515,
        0.03581172600388527,
        -0.03828880563378334,
        -0.016261987388134003,
        0.04747890681028366,
        -0.07718737423419952,
        0.004223914351314306,
        0.0024884764570742846,
        0.05098002403974533,
        -0.06337834149599075,
        -7.579672062758575e-33,
        -0.04745776951313019,
        -0.00421147421002388,
        -0.07544343918561935,
        -0.01653624139726162,
        -0.03233909606933594,
        -0.034842222929000854,
        0.05182221904397011,
        0.05765744671225548,
        0.06524447351694107,
        -0.025569718331098557,
        -0.03854791074991226,
        0.025487691164016724,
        0.018581140786409378,
        -0.023131944239139557,
        -0.04124177247285843,
        0.0008469113963656127,
        -0.08795563876628876,
        -0.03474745526909828,
        0.03133999556303024,
        -0.03793474659323692,
        0.00856825802475214,
        0.036585573107004166,
        -0.030721696093678474,
        0.02846924401819706,
        0.058215901255607605,
        -0.01894496940076351,
        0.018035050481557846,
        0.05080790817737579,
        0.06461253762245178,
        0.04541829600930214,
        0.09171994030475616,
        -0.13595737516880035,
        -0.004355195909738541,
        -0.0002752357395365834,
        0.03385428711771965,
        0.050060443580150604,
        0.04286474734544754,
        -0.03134557977318764,
        -0.0810873955488205,
        -0.039755020290613174,
        0.08818402886390686,
        0.011396694928407669,
        0.012261506170034409,
        -0.036991942673921585,
        -0.051878590136766434,
        0.08845289051532745,
        0.002948339330032468,
        0.09549550712108612,
        -0.057226698845624924,
        -0.04931514337658882,
        0.0451827198266983,
        0.058723367750644684,
        -0.01627824641764164,
        -0.03064064309000969,
        -0.07979381829500198,
        0.006275037303566933,
        -0.003917932976037264,
        0.03498458117246628,
        -0.00019852678815368563,
        -0.03137996792793274,
        0.0008735805749893188,
        -0.034384239464998245,
        -0.0581914484500885,
        -0.021994829177856445,
        0.04874739423394203,
        -0.025134054943919182,
        -0.05322769656777382,
        0.035569313913583755,
        -0.013227072544395924,
        0.042330626398324966,
        -0.0637870654463768,
        -0.05175110697746277,
        -0.008069165982306004,
        -0.030289512127637863,
        -0.03214988857507706,
        0.06625866889953613,
        0.05796390399336815,
        -0.06198130548000336,
        -0.03894001618027687,
        -0.039489518851041794,
        -0.008108623325824738,
        0.08853763341903687,
        0.036626946181058884,
        0.011916720308363438,
        0.10181707888841629,
        0.05897817388176918,
        0.01413428969681263,
        -0.009536456316709518,
        0.0196967925876379,
        0.08764878660440445,
        0.0006762529956176877,
        0.05160658806562424,
        -0.0500275194644928,
        0.10664184391498566,
        0.0100021967664361,
        -4.793296781713252e-08,
        -0.043225325644016266,
        0.008374691940844059,
        0.04785982891917229,
        -0.05541067197918892,
        0.030047046020627022,
        -0.04913648962974548,
        0.09581227600574493,
        -0.009164749644696712,
        0.07290083914995193,
        -0.025142764672636986,
        -0.056114546954631805,
        -0.05256173759698868,
        -0.0966929942369461,
        0.07161381095647812,
        0.05702640116214752,
        0.006705889478325844,
        0.00698716938495636,
        0.006921852473169565,
        -0.012620726600289345,
        -0.11340388655662537,
        0.054871685802936554,
        0.006490457337349653,
        0.013578499667346478,
        -0.07455722242593765,
        -0.03424549475312233,
        0.0024173029232770205,
        -0.040446024388074875,
        0.020708953961730003,
        -0.00746234692633152,
        -0.004848999436944723,
        0.04342914745211601,
        0.00860245805233717,
        0.07868630439043045,
        -0.09473440051078796,
        0.023815035820007324,
        -0.016792720183730125,
        -0.05880959704518318,
        -0.0009262702078558505,
        0.057885341346263885,
        0.038749076426029205,
        -0.007965472526848316,
        -0.0918530523777008,
        0.044379156082868576,
        0.011251992546021938,
        -0.06051800772547722,
        -0.01649259403347969,
        0.055874310433864594,
        -0.05987875908613205,
        0.04539916664361954,
        -0.00892510823905468,
        0.012928904965519905,
        -0.06790393590927124,
        0.06084182485938072,
        0.015538512729108334,
        0.12499716877937317,
        0.02012530528008938,
        0.019075054675340652,
        0.019148487597703934,
        0.029745003208518028,
        0.04474873095750809,
        0.1195245087146759,
        -0.02748996578156948,
        -0.022878115996718407,
        0.08453312516212463
    ]
}