{
    "id": "oD2paW2dLAs",
    "title": "BACKYARD BUNKER PART 7 - WHAT DID IT COST?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-12-28T18:11:17Z",
    "video_url": "https://www.youtube.com/watch?v=oD2paW2dLAs",
    "category": "Howto & Style",
    "tags": [
        "backyard bunker",
        "back yard bunker",
        "waterproofing a bunker",
        "waterproof bunker",
        "culvert bunker",
        "pipe bunker",
        "underground bunker",
        "secret bunker",
        "secret tunnel",
        "tractors",
        "sher-tar",
        "GroundX Bunker",
        "bury a bunker",
        "how to bury a bunker",
        "prepping",
        "off grid"
    ],
    "views": 2633742,
    "likes": 81012,
    "comments_count": 4117,
    "description": "My Backyard bunker is structurally COMPLETE! Now we can start furnishing the inside... Grab an Eight Sleep Pod 3 Cover for your own bed and use my code JERRYRIG for $200 off HERE:   Watch all the bunker videos in order HERE:   Grab a JerryRigEverything Knife or GroundX Bunker Project T-Shirt HERE:",
    "description_links": [
        "https://www.eightsleep.com/jerryrigeverything",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOE6Of8qi5dtIFgdSt1hlOZm",
        "https://www.youtube.com/@JerryRigEverything/store"
    ],
    "transcript": "I would show you the bunker that's in my backyard, but it is in fact invisible, buried, and not above the ground anymore. Super exciting to look out my window this morning and not see the giant 12 foot tubes we had delivered, or the incredibly deep 20 foot hole we had dug in my backyard to hide the tubes. Now as you can tell, it is a nice sod filled backyard with just two caps on top to hide the entry and exit shaft. The yard is put back together, there's still a whole lot we have to do inside, like adding the floor to both the entry shaft and the bunker itself, and we have to talk about how much all of this cost me here in 2023. Let's dive right in. [Intro] That is so deep down there. We're going to start by adding a floor to this shaft. We are 18 and a half feet down here, and then once the floor is built here, we can start adding the floor through the rest of the tube, which is under the earth, all the way to the exit shaft on the far side. The way we actually get into the bunker currently is with a ladder. At some point, of course, we'll install an elevator, but we got to get everything built out first. And we have a lot of work ahead of us. Lucky for us, we planned in advance for this floor building moment, both in the elevator shaft and the tube itself. We stuck some of our longer 2x4 eighth inch walls, steel rectangular tubes into the pipe before we buried them. Previous Jerry, making present day Jerry's job a whole lot easier, thumbs up for that. Previous Jerry also welded long mounting strips of metal flat plate to the wall so we can secure the floor to the sides of my backyard bunker. The reason we didn't pre-install the floor before lowering the tube below ground is because we knew we would have to rotate the tubes or clock them a bit to get them to connect after setting them in the hole, which would make any pre-installed floor or cabinets squampous and unusable. But now after everything's been bolted, secured and buried under a quarter million pounds of dirt, the bunker's never going to move again and we can use a brilliantly designed magnetic laser level to very accurately lay out the floor in a way that's perfectly flat. Having a level floor is extremely important, almost as important as airflow. While we're welding down to the bottom of the bunker, we have to be very conscious of the airflow since oxygen is rather important to the survivability of people in the bunker. We have two fans above the exit shaft that are pulling air through the bunker to remove any of the welding smoke or fumes. And when we're finally living down in the bunker, we'll have a whole different airflow system that keeps the oxygen in sufficient supply. The fans are pulling enough air in through the entrance and spitting it out through the exit to replace the oxygen in the bunker about every minute or so. The only downside, however, is that underground it's going to maintain a temperature of about 50 or 60 degrees year round. But since we're pulling in the freezing air from outside, it lowers the temperature considerably. So we'll have to find a way to heat up the bunker that doesn't use a whole lot of electricity from our batteries, which I'll talk about a bit later. However, when it comes to sleeping arrangements, we figured those out already. Huge thanks to 8Sleep for sponsoring this video. The liquid-cooled and heated 8Sleep mattress cover only uses about 200 watts to warm my bed up to 110 degrees Fahrenheit or cool it down to 55 degrees. My wife and I have been using this mattress cover on our own bed for the past few months. One half can be hot while the other half is cold. I got a new one just for this bunker. The 8Sleep pod cover turns any mattress into the smartest bed on the planet with a subscription-powered autopilot feature that can use the heating and cooling of the bed alongside the heart rate and VRM metrics to help you fall asleep faster and give the most restful sleep possible intelligently and scientifically. The 8Sleep pod is clinically validated for deeper sleep and has a built-in thermal and vibratory alarm clock. Even after the subscription is over though, the heating and cooling functions of the mattress cover remain functional, which means perfect sleeping temperatures for us during the apocalypse. And as we all know, the best apocalypse is a cozy apocalypse. Get a substantial discount off of your own 8Sleep pod cover with the link down in the description, and I'll show you where this mattress ends up after we finish installing the floor. If you remember this magnet from one of the previous videos, we're using it as a platform to hold the joist for the floor. Not how it was originally intended, but it's doing a good job. We're adding the floor structure about 3 feet up from the bottom of the tube, giving us about 9 feet of headroom in the center and a whole lot of usable storage space underneath the entire 40 foot length of the bunker. I plan on using the storage for food and water, since during an emergency situation, each person down here will need about 1 gallon of water per day to survive. So 6 people for one month would need a minimum of 200 gallons. Even more than that if we want to shower or fight off those aliens from signs. So I'm hoping to fit maybe like 500 to 1,000 gallons in here somehow, but that's a problem for future Jerry. We should have enough space under the floor to also run ventilation and the electrical. Electricity is important because an Xbox and a 90 inch TV sure ain't going to power themselves. And it's also for other less important things like lights or cooking. And this is how I'm going to get them down into the bunker. That wasn't so bad. [music] Nice. I'm going to record this just in case I completely mess it up. Welcome back. Now that we have the metal frame installed, the floor is surprisingly easy. Looks like there's just one more left. Before we put up the walls, let me give you a tour. We have the exit shaft right here, master bedroom here in the corner, bunk bedroom here in the middle, huge 90 inch TV along the center beam, couches, sinks, bathroom here in the corner, working our way over to the exit shaft where we're going to install an elevator right here. And then we have a full set up of EcoFlow RV batteries. I've already made a full video with these batteries taking an RV off grid, but they're going to be perfect for the bunker. And this is what it looks like under the floor. From the very first day we started welding flanges on the bunker to today with the floor fully installed is about two and a half months. Not bad at all when you consider that we've installed a full bunker underneath my backyard. But the big question is how much did it all cost? So keep in mind that I tried to make this bunker as inexpensively as possible while not cutting any corners. Not that there are any corners in here. The bunker tubes themselves cost $31,959. All the steel for the entry, exit shaft, and the floor that we built today is $24,698.37. The laser cut, Osh-cut flanges that we used to bolt the two tubes together were $3,720. The telehandler was $4498. The crane was $1,864. And there was a few smaller things like the sacrificial anode at $416. And the high mill shirt tar epoxy waterproofing that was $514. And the wood for the flooring that we installed today was $346.92. But the best money we spent on this entire project was for the excavation. Worth every penny, it was $30,249 and that includes all the machines and the brilliant guys working those machines. Worth their weight in gold, they're what made this project possible. So the final answer on how much this whole project has cost up till now is $98,265.35. Less than a maxed out Cybertruck or a Ford F-150 Raptor, but still pretty expensive. I was hoping to keep the whole project about $75,000 or $80,000. But I think staying below $100,000 is still pretty solid. However, there are a few things I'm leaving out. I'm not factoring in consumables like saw blades, grinding wheels, or the 5 miles worth of welding wire it took to put this thing together. That welding wire alone would be about $800. We also used a ton of tools, but you know, tools are an investment. At least that's what I tell my wife. I'm also not going to count the $15,000 worth of asphalt driveway damage since that would ruin my sub $100,000 price point. I'm also not factoring in the 1,200 man hours that myself and my team put into this over the last two and a half months. Since technically one man can indeed build a bunker, like Colin Furze overseas, it would just take quite a bit more time and our goal was to finish it before winter, which we accomplished. If those 1,200 man hours were billed at $25 an hour, which is like an average contractor rate here in Utah, it would have added about $30,000 to the price of the bunker. Overall, I think it's a pretty massive accomplishment to get the whole thing finished and underground in less than 10 weeks. Keep in mind that I'm in a pretty unique place with this project where the views, the sponsorships, the jars of dirt, and the shirts we sell basically paid for the whole thing and helped fund my wheelchair manufacturing project, which is the ultimate goal. While it is cool to have a bunker, creating cool content so I can fund the wheelchair project is what this is really all about, and so far I think we've accomplished that. We have many more cool things to add like the elevator, 90 inch flat screen TV, and toilet, all equally important things. So hit that subscribe button if you haven't already. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "bunker",
        "floor",
        "exit shaft",
        "shaft",
        "tubes",
        "backyard",
        "exit",
        "backyard bunker",
        "fact invisible",
        "adding the floor",
        "project",
        "bunker tubes",
        "Jerry",
        "tube",
        "important",
        "lot",
        "things",
        "Previous Jerry",
        "cover",
        "mattress"
    ],
    "transcript_entity_values": [
        "Xbox",
        "200 gallons",
        "8Sleep",
        "514",
        "55 degrees",
        "6",
        "about two and a half months",
        "30,249",
        "2023",
        "two",
        "90 inch",
        "25",
        "Jerry",
        "about 50",
        "EcoFlow RV",
        "5 miles",
        "about 9 feet",
        "98,265.35",
        "1,864",
        "about $30,000",
        "24,698.37",
        "VRM",
        "half",
        "Previous Jerry",
        "18 and a half feet",
        "1,200",
        "a ton",
        "this morning",
        "about 1 gallon",
        "3,720",
        "about 200 watts",
        "31,959",
        "Cybertruck",
        "416",
        "80,000",
        "Colin Furze",
        "60 degrees",
        "110 degrees Fahrenheit",
        "the past few months",
        "first",
        "the entire 40 foot",
        "the very first day",
        "about every minute",
        "Ford",
        "less than 10 weeks",
        "2x4 eighth inch",
        "below $100,000",
        "under a",
        "RV",
        "today",
        "one month",
        "One half",
        "500 to 1,000 gallons",
        "sub $100,000",
        "12 foot",
        "winter",
        "F-150 Raptor",
        "about 3 feet",
        "the last two and a half months",
        "4498",
        "346.92",
        "about $800",
        "one",
        "15,000",
        "about $75,000",
        "Utah",
        "1,200 man hours",
        "20 foot"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "GPE",
        "TIME",
        "QUANTITY"
    ],
    "vector": [
        0.0203016996383667,
        0.03964924439787865,
        0.04532647877931595,
        -0.0038806216325610876,
        0.04854237288236618,
        -0.03140254691243172,
        -0.006546180695295334,
        0.0871344730257988,
        0.009926141239702702,
        0.04175206273794174,
        -0.08442291617393494,
        -0.022693702951073647,
        0.037513770163059235,
        -0.0021934588439762592,
        0.0007023855578154325,
        0.02215316891670227,
        0.03255645930767059,
        -0.02238585613667965,
        -0.09012726694345474,
        -0.026927663013339043,
        -0.0017276047728955746,
        -0.007884622551500797,
        0.07186959683895111,
        -0.009083263576030731,
        -0.001941376831382513,
        0.031050316989421844,
        -0.06896459311246872,
        0.07785997539758682,
        -0.04547799006104469,
        -0.02207428589463234,
        0.007832244969904423,
        0.019059771671891212,
        -0.008235016837716103,
        -0.014000319875776768,
        0.10852561891078949,
        0.031929392367601395,
        0.03143744543194771,
        0.024669446051120758,
        -0.00924923736602068,
        0.0683758333325386,
        -0.0684957206249237,
        -0.02504560351371765,
        0.01986885815858841,
        0.047096218913793564,
        -0.01375485584139824,
        0.03397810459136963,
        -0.06233518570661545,
        -0.041490089148283005,
        0.07291166484355927,
        -0.07293854653835297,
        -0.007330790162086487,
        -0.02428399957716465,
        -0.017102304846048355,
        -0.02045493572950363,
        -0.009724760428071022,
        -0.01854504644870758,
        0.02166741155087948,
        -0.057721517980098724,
        0.014127911999821663,
        0.05259987711906433,
        0.07144832611083984,
        -0.04609593003988266,
        -0.02947572059929371,
        -0.030045561492443085,
        0.06636081635951996,
        -0.06889411807060242,
        -0.013311811722815037,
        -0.03414331004023552,
        0.013414912857115269,
        0.04359383508563042,
        -0.00036115627153776586,
        0.08664552122354507,
        -0.0409332700073719,
        -0.07269375771284103,
        -0.020842965692281723,
        0.02077677473425865,
        0.06938491016626358,
        0.07408235222101212,
        0.028302941471338272,
        -0.0033061360009014606,
        0.06857184320688248,
        -0.006574448198080063,
        0.041834019124507904,
        -0.08058138191699982,
        -0.08895371109247208,
        0.040760718286037445,
        0.017649583518505096,
        0.09901347756385803,
        0.03891628235578537,
        0.008003996685147285,
        -0.03908265382051468,
        -0.11980995535850525,
        0.0039438591338694096,
        0.059661008417606354,
        0.05605423077940941,
        0.027668803930282593,
        -0.027965987101197243,
        -0.047545503824949265,
        -0.04312734678387642,
        0.02221589721739292,
        0.06263277679681778,
        -0.036258310079574585,
        -0.010003357194364071,
        -0.14006905257701874,
        0.031062187626957893,
        0.01742742955684662,
        -0.05634467303752899,
        0.07916481792926788,
        0.004941549617797136,
        -0.00862590316683054,
        0.03502124920487404,
        -0.059489574283361435,
        0.03421244025230408,
        0.05137115344405174,
        -0.037248384207487106,
        0.0025367827620357275,
        0.050456784665584564,
        -0.03156944736838341,
        0.0501992292702198,
        0.03572508692741394,
        0.06390539556741714,
        -0.0020989184267818928,
        0.017102882266044617,
        0.047211408615112305,
        -0.011021816171705723,
        -0.09542898833751678,
        -0.05224347487092018,
        1.7289380296825445e-33,
        0.003580824239179492,
        0.06963654607534409,
        -0.05692625045776367,
        0.022512318566441536,
        0.021344846114516258,
        -0.02935772016644478,
        0.02135460451245308,
        0.06503017246723175,
        -0.02734392322599888,
        0.12635304033756256,
        -0.04562969133257866,
        -0.009766635484993458,
        -0.07197614759206772,
        0.052072107791900635,
        -0.014700083993375301,
        -0.09795065224170685,
        -0.06720561534166336,
        -0.02022370882332325,
        -0.03688634932041168,
        -0.020321490243077278,
        -0.016590729355812073,
        -0.03723546862602234,
        0.016003375872969627,
        -0.03305989131331444,
        0.07440748810768127,
        -0.015393314883112907,
        0.008545436896383762,
        -0.04234764724969864,
        -0.044468559324741364,
        -0.002461550757288933,
        -0.06954552233219147,
        -0.02244105190038681,
        0.005901970900595188,
        0.0457417257130146,
        0.00875193439424038,
        -0.047983318567276,
        0.06651230901479721,
        -0.03129597008228302,
        -0.09695403277873993,
        -0.018981069326400757,
        -0.016646090894937515,
        -0.0054336367174983025,
        -0.0433206707239151,
        -0.017825733870267868,
        0.028562646359205246,
        -0.04092584177851677,
        0.057230740785598755,
        0.01883567124605179,
        -0.039274442940950394,
        -0.07426239550113678,
        -0.002549937926232815,
        0.09854921698570251,
        -0.0213632769882679,
        -0.02546556666493416,
        -0.05687515065073967,
        -0.08536311984062195,
        0.07318753004074097,
        -0.02095269225537777,
        0.05425344035029411,
        0.0836724266409874,
        0.03191247209906578,
        0.05579179525375366,
        -0.014053928665816784,
        0.03323965147137642,
        -0.12051018327474594,
        -0.006350406911224127,
        -0.018293006345629692,
        0.07255963981151581,
        -0.030231626704335213,
        0.03401866927742958,
        -0.034857820719480515,
        0.03332924470305443,
        0.07788191735744476,
        -0.033901751041412354,
        -0.028966600075364113,
        -0.0016697460087016225,
        0.013346921652555466,
        0.017924664542078972,
        0.07310601323843002,
        -0.02398982085287571,
        0.05176618695259094,
        0.021787995472550392,
        -0.021007435396313667,
        -0.016880732029676437,
        0.032656386494636536,
        -0.02600841596722603,
        0.03450865298509598,
        -0.003560213139280677,
        -0.04017997533082962,
        -0.030988266691565514,
        -0.09770338237285614,
        -0.07148363441228867,
        -0.014193243347108364,
        -0.04579567536711693,
        0.07369503378868103,
        -4.167332450492434e-33,
        0.0012537901056930423,
        0.03918854892253876,
        0.0016863617347553372,
        -0.05331045016646385,
        0.04726759344339371,
        0.037934310734272,
        -0.018942667171359062,
        -0.07692407071590424,
        -0.000572117161937058,
        -0.01795518398284912,
        -0.13786587119102478,
        0.11790857464075089,
        0.06653831899166107,
        0.0005048038437962532,
        -0.044002335518598557,
        -0.07265967130661011,
        -0.052181996405124664,
        -0.13113391399383545,
        -0.012917429208755493,
        -0.01653974875807762,
        -0.06230350211262703,
        0.051518045365810394,
        -0.04353051632642746,
        0.016425900161266327,
        -0.049780841916799545,
        0.08181443065404892,
        0.01788720302283764,
        0.03852355480194092,
        0.05402879789471626,
        0.07207381725311279,
        -0.054417598992586136,
        -0.11116201430559158,
        -0.012742144986987114,
        0.014124756678938866,
        -0.055604238063097,
        0.017593687400221825,
        0.07090817391872406,
        -0.004708515014499426,
        -0.012436541728675365,
        -0.09389699250459671,
        0.026620259508490562,
        0.04173365607857704,
        -0.03966794162988663,
        -0.010704689659178257,
        -0.02010713517665863,
        -0.043866969645023346,
        -0.00309097021818161,
        -0.07940877974033356,
        0.004432393703609705,
        0.02931847609579563,
        0.0002249335084343329,
        0.017162499949336052,
        -0.08455154299736023,
        0.0004423776990734041,
        -0.08077629655599594,
        0.01527384016662836,
        -0.041355617344379425,
        0.034223973751068115,
        -0.019317081198096275,
        0.05573425069451332,
        0.0021912308875471354,
        0.053769443184137344,
        -0.015967583283782005,
        0.03968334197998047,
        0.04691777378320694,
        -0.003517577890306711,
        -0.037848200649023056,
        -0.04211444780230522,
        -0.12191443145275116,
        0.03809807077050209,
        -0.07076204568147659,
        0.004458063747733831,
        -0.023564400151371956,
        -0.02861187793314457,
        0.11894185096025467,
        0.028089122846722603,
        0.036680497229099274,
        0.029761821031570435,
        0.04710657522082329,
        0.08670555800199509,
        -0.0032235246617347,
        -0.0565527006983757,
        -0.03332695737481117,
        0.02750452421605587,
        0.16053783893585205,
        -0.016146957874298096,
        0.018496915698051453,
        0.12084396183490753,
        -0.029509710147976875,
        0.020352305844426155,
        0.0015701280208304524,
        0.01325837429612875,
        0.0033817824441939592,
        -0.0038322831969708204,
        0.013927881605923176,
        -5.7406200681953123e-08,
        0.05020761117339134,
        0.09361572563648224,
        -0.07415261119604111,
        -0.035097636282444,
        0.024229800328612328,
        -0.082609161734581,
        0.059874169528484344,
        0.04140659421682358,
        -0.01163062360137701,
        -0.018041523173451424,
        -0.0008006446878425777,
        0.023289812728762627,
        -0.053677748888731,
        0.09289593249559402,
        -0.11661908030509949,
        0.004144454840570688,
        -0.10698498785495758,
        -0.012106143869459629,
        -0.02005457878112793,
        -0.056524693965911865,
        -0.0049864985048770905,
        0.009258804842829704,
        9.66865845839493e-05,
        -0.0016312472289428115,
        -0.0429631769657135,
        0.03470175340771675,
        -0.057486921548843384,
        0.040921084582805634,
        0.03551051393151283,
        0.09184079617261887,
        -0.025772303342819214,
        0.009155871346592903,
        -0.057153694331645966,
        0.006530162878334522,
        -0.029640985652804375,
        -0.007440716959536076,
        0.047975022345781326,
        0.04950310289859772,
        0.03884035348892212,
        0.052828099578619,
        -0.0613936111330986,
        -0.12910717725753784,
        -0.0021810007747262716,
        0.011259626597166061,
        0.010085348971188068,
        0.059743307530879974,
        -0.11404737085103989,
        -0.01887776516377926,
        -0.028121693059802055,
        -0.013268472626805305,
        0.07074630260467529,
        -0.048471640795469284,
        -0.029256612062454224,
        0.10659318417310715,
        0.13817307353019714,
        0.039879728108644485,
        -0.04122144356369972,
        -0.019580524414777756,
        0.03682249039411545,
        0.07940143346786499,
        -0.05715714767575264,
        -0.04745202511548996,
        -0.04555677995085716,
        -0.008184235543012619
    ]
}