{
    "id": "OHKKcd3sx2c",
    "title": "Microsoft is Forcing me to Buy MacBooks - Windows Modern Standby",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-03T18:33:14Z",
    "video_url": "https://www.youtube.com/watch?v=OHKKcd3sx2c",
    "category": "Science & Technology",
    "tags": [
        "Windows Modern Standby",
        "S0 Sleep",
        "S3 Sleep",
        "Battery Drain",
        "MacOS",
        "Battery Life"
    ],
    "views": 4139798,
    "likes": 148168,
    "comments_count": 14297,
    "description": "Vessi is giving away a pair of socks of your choice to the first 100 shoes sold using code SocksLinusTechTips at   Create your build at   For the last THREE years Windows laptops have been plagued by terrible battery drain while the user ISN'T EVEN DOING ANYTHING. It's gotten to the point where we can't recommend using a Windows laptop because of Windows Modern Standby.  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - The biggest problem with Windows Laptops 1:10 - Build Redux! 1:25 - The Problem with Modern Standby 3:30 - Project Athena & Instant Wake 4:57 - Why Alex switched to MacOS 6:04 - Potential Fixes 8:35 - But... Why? 10:25 - Vessi! 10:55 - Outro",
    "description_links": [
        "http://Vessi.com/LinusTechTips",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1471711-microsoft-is-forcing-me-to-buy-macbooks-windows-modern-standby/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Look at what you have done to 'em Microsoft. This lifelong Windows user has been forced to switch to a MacBook. (whimpering) Why? Well, because he is got real work to do and he needs something he can actually rely on and it's your fault. This is no exaggeration. This is real you guys. It's happening and all because you can't fix a feature that most people probably couldn't even name. Modern standby. That's right guys. After complaining about it in every single laptop video for the last year, we're finally doing a deeper dive into what we consider to be the biggest problem with Windows laptops. In fact, it's something that I'm sure that you have first-hand experience with. You know that thing where you fully charge your laptop then you take it out of your bag the next day to find it dead and as a bonus probably hot enough to burn you? Well, it took some time and there were definitely challenges including discovering that Max can actually suffer from the exact same problem. But we think we've cracked it. We've figured out what Microsoft hasn't been able to in the last three years, and we might even have the solution. Just like we have the solution to perfectly segue to our sponsor. - Build Redux takes the challenge and hassle outta building your own PC. With configuration options, support guides to aid you and competitive pricing versus building a PC yourself. Why not kick up your feet and let Build Redux handle it for you? So head to buildredux.com/linus and start your new build today. - For a long time I gaslit myself into thinking it must be just me, and then I moved on to thinking, ah, it must be just this laptop, like, ah this piece of junk never has battery when I need it. But then we started to notice this pattern that no matter the brand, Dell, HP, Lenovo, Microsoft, LGs, or Acers, you get the point. It's bound to show up once in a while on pretty much every mobile Windows machine. And no, it isn't just us. We asked on Twitter if anyone had experienced the same problem and we received thousands of replies full of tales of hot dead laptops that should have been asleep and fully charged. What makes this problem challenging to diagnose though is that there's no obvious pattern to it. One day it's fine, the next day it's not and even when the battery is draining it can take hours for the loss to be noticeable which makes testing take forever. We don't know exactly what causes this rapid battery drain but we did observe that the problem is more pronounced on powerful machines. Which seems to suggest that whatever the background task is we think it could be related to Windows update. It relies fairly heavily on your CPU so bigger CPU, bigger drain. But wait, this laptop is asleep. Why is it finding Windows updates? Well, here's the thing. In the past laptops came with S three sleep, aka suspend to RAM. When your computer is using S three sleep the processor is essentially off, but power gets maintained to the memory so that when you open the lid there's no need to pull data off of your system drive and you can resume working basically immediately. But on newer machines, S three sleep has been mostly replaced by Windows Modern Standby or S zero sleep. S zero sleep could also be referred to as Connected Sleep and it's actually existed since way back in Windows eight but for a long time it was not the default and even if you were using it, it was very easy to disable. So why is it suddenly an existential problem for Windows machines? Intel. In 2020, Intel introduced Project Athena with the general goal of making laptops feel more like a smartphone. And there were a couple of really good ideas that Intel pushed in Project Athena like instant wake, better overall responsiveness, and all day battery life. To help achieve instant wake, manufacturers were pushed to use S zero sleep. A sleep state where the CPU remains on and connected to the network. This allows laptops to perform small housekeeping items while they're asleep and it can actually be pretty great. For instance, apps can continue to receive messages. Bluetooth audio can continue playing. Windows can update while you're away from the computer. Like have any of you noticed that for the most part your Windows install just stays up to date without thinking about it? Well, that's the beauty of S zero sleep. The problem however, is that this is in fact a laptop, not a smartphone, and I don't necessarily expect it to work exactly like a smartphone. Also, X86 is very different to the ARM processors that are used in phones and Apple silicon MacBooks. With my phone, I expect to be notified of a text message or a phone call, even if the screen happens to be off. And I also expect to plug it in at the end of every day. With a laptop, I expect to close it, stuff it in my bag at the end of a Friday, and then on Monday morning when I come back to work I expect to take it out and have roughly the same amount of battery left. - The final straw that made me go Mac was before the Intel Arc livestream. It was an incredibly hectic morning running around and there was a problem that needed solving now. So I take my laptop outta my backpack, which I made sure was charged the night before knowing I'd be very busy in the morning. Not only was this thing warmer than our retro polar fleece, ltstore.com, but it was completely dead. This meant that while I was troubleshooting problems I could not get a charger's length away from the wall making me mad enough to stop using Windows altogether. And judging by the comments on Short Circuit and Twitter I am far from the only one. But after an excellent couple of weeks with the Mac it happened again. I took this MacBook Pro 14 inch outta my bag and it was dead. Turns out Apple has a very similar always on feature to modern standby, but would you look at this. By going to the battery settings, there is a toggle for wake for network access. I changed that to, only on power adapter and have not had the problem since. This Mac has been able to run and update and such while it's sleeping, so long as it's connected to power just as it should be. - If only there was a fix that easy on Windows. That's the worst part of this. There used to be. When connected standby was originally introduced, it could be toggled in the power menu. Then they got rid of that so you'd have to use the command, platform AOAC override, to revert your laptop back to the old S three sleep mode. Then Microsoft nuked that work around in an update but it was still possible to go back to S three sleep through a registry edit until they killed that in an update as well. Why is Microsoft actively making it so difficult to remove this clearly broken feature? Well, because the BIOS engineers at Dell, HP, Lenovo, and so on are lazy and didn't bother to support both S zero and S three sleep in their firmware. So if you apply any of the above hacks it could actually cause your laptop to crash out right when it tries to sleep. This is particularly frustrating because both Intel's 12 Gen mobile processors and AMDs Ryzen 7000 mobile processors still totally support S three sleep. It's just that the laptops have crappy firmware that doesn't. To check if your system supports S three sleep then, if you don't want it crashing all the time, go to the command line and type power config slash A which will show you what sleep states are available to your device. Look down here where it says standby S three and then you just have to hope that it doesn't say the system firmware does not support this standby state. Since if you see that you're probably screwed. We tested this on a wide array of laptops in our office and only Framework and ASUS appear to have bothered to implement S three sleep on their latest processors. But don't give up yet. Head to the bios of your laptop by spamming F1 F2 and delete while restarting. And with any luck, you might find a toggle for S three sleep or something called Sleep State with options for Windows or Linux. Don't be put off the naming. Even Windows users can just swap it over to Linux and should be good to go. Once that's enabled, you can still use the old registry edit from before to restore good old S three sleep. You can also set it so that closing the lid of your machine causes it to hibernate rather than sleep. This resolves the battery drain issue most of the time but because hibernate writes the contents of system memory to non-volatile storage it's a lot slower to pull it back into RAM which kind of defeats the purpose of creating modern standby in the first place. The strangest thing about all of this is that this battery drain problem should never have been a problem in the first place. When checking the available sleep states with a laptop on battery, it states standby network disconnected meaning that when your laptop goes to sleep it shouldn't try to pull any updates, receive any messages and so on and and so forth. However, if you plug the laptop in and check the power states again, it says standby network connected to allow updates and such. That's when our light bulb moment happened. What we're almost certain is happening is that if you are charging your laptop and you close the lid, it'll go to sleep in network connected mode. Then if you unplug it and say chuck it in your bag and go to work, the device is not recognizing that it has since been unplugged and remains in network connected mode. If there happens to be a Windows update or something then while it's in your bag, congratulations your laptop is now drained. So the incredibly stupid temporary fix if you don't want to do anything else that we said is to always unplug your laptop before closing the lid. Maybe. It's difficult to verify this 100% because we're basically trying to force a strange error that can take hours to unfold but it's the best guess we have for now which frankly speaking is as far as we should have to go. Farther than we should have had to go because Microsoft, you're a multi-billion dollar company, just fix it. Windows modern standby has been a crippling issue for the last three years and I'm gonna just lay down the line here. I'm not gonna be recommending a Windows laptop over a MacBook until you've either fixed it or re-enabled S three sleep. What I can recommend though is this segue to our sponsor - Vessi. Do you ever struggle figuring out what to wear in unpredictable weather? Well Vessi says their shoes are a hundred percent waterproof. Keeping your feet dry in the wettest of weather. Their lightweight and easy to pack sneakers offer you reassurance when the snow and rain start coming down. Putting them on and taking them off is super easy. And their shoes are made from cruelty free products right down to the glue. Whether it's a rainy city or a rocky trail the herringbone tread design is there to help stop you from slipping around. So treat your feet with Vessi footwear and save $25 with our offer code Linus Tech Tips at vessi.com/linustechtips. (upbeat music) - If you guys enjoyed this video you might enjoy another video about things that are broken. So why don't you check out part one of the Intel Arc 30 Day Challenge.",
    "transcript_keywords": [
        "sleep",
        "Windows",
        "laptop",
        "Windows Modern Standby",
        "problem",
        "standby",
        "laptops",
        "Windows update",
        "Modern standby",
        "battery",
        "Microsoft",
        "Windows Modern",
        "Intel",
        "Windows laptops",
        "Connected",
        "sleep state",
        "update",
        "day",
        "network",
        "power"
    ],
    "transcript_entity_values": [
        "the end of every day",
        "Twitter",
        "ASUS",
        "one",
        "Windows",
        "MacBooks",
        "Apple",
        "Sleep State",
        "first",
        "the last three years",
        "Friday",
        "Vessi",
        "25",
        "MacBook",
        "HP",
        "zero",
        "Max",
        "Vessi",
        "the last year",
        "chuck",
        "Connected Sleep",
        "S three",
        "all day",
        "the Intel Arc",
        "today",
        "F1 F2",
        "Dell",
        "Mac",
        "Acers",
        "Framework",
        "RAM",
        "Mac",
        "Monday morning",
        "2020",
        "One day",
        "thousands",
        "Short Circuit",
        "the end of a",
        "Linus Tech Tips",
        "LGs",
        "Lenovo",
        "Build Redux",
        "hours",
        "CPU",
        "three",
        "AOAC",
        "S zero",
        "this 100%",
        "Windows",
        "12",
        "the next day",
        "Linux",
        "Windows eight",
        "this MacBook Pro 14",
        "Windows Modern Standby",
        "Ryzen 7000",
        "Microsoft",
        "Intel",
        "Project Athena",
        "30 Day Challenge",
        "Windows"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "FAC",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "GPE",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.11059441417455673,
        0.02569962479174137,
        0.006233090069144964,
        -0.04350508376955986,
        0.09481038898229599,
        0.08827118575572968,
        -0.035738810896873474,
        0.023426398634910583,
        -0.061440128833055496,
        0.02505694329738617,
        0.026230361312627792,
        0.06119750067591667,
        -0.04507117718458176,
        -0.022719556465744972,
        0.038092564791440964,
        0.0745951309800148,
        -0.0127982497215271,
        -0.08368169516324997,
        -0.021551990881562233,
        0.04385523498058319,
        -0.033036358654499054,
        -0.07203321158885956,
        -0.03860011696815491,
        0.03903666138648987,
        0.02408965677022934,
        -0.03892596438527107,
        0.0031015751883387566,
        0.029015228152275085,
        -0.00945261400192976,
        0.0775119811296463,
        -0.0674995630979538,
        0.03818483650684357,
        -0.01092701405286789,
        0.04104093089699745,
        0.005752004217356443,
        -0.08993455767631531,
        0.03782863914966583,
        -0.052803851664066315,
        -0.12380119413137436,
        -0.07221124321222305,
        -0.0310092493891716,
        -0.040804289281368256,
        0.023063531145453453,
        0.029930856078863144,
        0.0515221543610096,
        -0.03406304866075516,
        0.05448172986507416,
        -0.0039445492438972,
        0.022824350744485855,
        0.07517320662736893,
        -0.057264816015958786,
        -0.08035329729318619,
        0.031223973259329796,
        -0.05321328714489937,
        -0.002925528446212411,
        -0.025410141795873642,
        0.03295868635177612,
        -0.04737834632396698,
        0.0469646118581295,
        -0.04524032399058342,
        0.0952242985367775,
        -0.09054195135831833,
        -0.05697588995099068,
        0.01898571476340294,
        -0.009081307798624039,
        0.009523331187665462,
        -0.06897987425327301,
        0.051181357353925705,
        0.0008541062707081437,
        -0.001730944262817502,
        -0.05315898358821869,
        -0.04789058119058609,
        0.046787701547145844,
        0.10027290880680084,
        -0.051291532814502716,
        -0.03855595737695694,
        0.04712962359189987,
        -0.045243777334690094,
        0.028365295380353928,
        0.016267908737063408,
        -0.09666679054498672,
        -0.010269592516124249,
        0.02090282365679741,
        -0.012118153274059296,
        0.03318145498633385,
        -0.02223602682352066,
        0.017138825729489326,
        -0.041247155517339706,
        -0.050653908401727676,
        -0.019357336685061455,
        -0.06478065252304077,
        0.032287634909152985,
        0.06523081660270691,
        0.006507399491965771,
        0.02543051168322563,
        0.0037487144581973553,
        0.030379528179764748,
        -0.024298274889588356,
        -0.0429040752351284,
        0.026210004463791847,
        -0.0011027001310139894,
        0.08105585724115372,
        0.04906425625085831,
        -0.02853505313396454,
        0.014495906420052052,
        -0.09060661494731903,
        0.05230361968278885,
        0.0897444561123848,
        0.06146581470966339,
        0.01850597932934761,
        -0.0029124694410711527,
        -0.011476515792310238,
        -0.07149221003055573,
        -0.052363116294145584,
        -0.001390772289596498,
        0.024546943604946136,
        -0.029388904571533203,
        0.07438469678163528,
        0.11338527500629425,
        0.006338864099234343,
        0.012261394411325455,
        0.07180456072092056,
        0.023780034855008125,
        -0.09371964633464813,
        0.04454858601093292,
        -0.007409870158880949,
        -0.018396345898509026,
        4.852341497858552e-34,
        -0.003835383802652359,
        -0.04874623194336891,
        0.008412221446633339,
        -0.03437428921461105,
        0.06572282314300537,
        -0.0657196044921875,
        0.0033366673160344362,
        -0.00594143895432353,
        -0.010154022835195065,
        0.017599252983927727,
        -0.011539735831320286,
        0.05711067095398903,
        -0.040314000099897385,
        -0.030822493135929108,
        0.019974714145064354,
        -0.05380556732416153,
        0.04865480586886406,
        -0.033774979412555695,
        -0.027687525376677513,
        -0.0336795449256897,
        0.043172113597393036,
        -0.058580175042152405,
        0.02531834878027439,
        -0.08495820313692093,
        0.013240233063697815,
        0.011010890826582909,
        0.06369874626398087,
        0.03592221066355705,
        0.07981033623218536,
        0.06482236087322235,
        -0.03262553736567497,
        -0.029398946091532707,
        -0.05504282936453819,
        -0.1827153116464615,
        -0.0771678164601326,
        -0.017010048031806946,
        -0.08257108926773071,
        -0.05452871322631836,
        0.0846046656370163,
        -0.026161279529333115,
        -0.07885823398828506,
        -0.02398417517542839,
        -0.007992487400770187,
        -0.10440200567245483,
        0.02486218512058258,
        0.0008212827960960567,
        0.0749000832438469,
        0.03108919970691204,
        -0.007318144664168358,
        0.025032086297869682,
        -0.07470840960741043,
        0.016843747347593307,
        -0.041183456778526306,
        0.054189469665288925,
        -0.0921051949262619,
        -0.06773832440376282,
        0.003830911824479699,
        -0.023941293358802795,
        0.03666386380791664,
        0.07187327742576599,
        0.0030835005454719067,
        0.0142057528719306,
        0.02877139300107956,
        -0.03867381438612938,
        -0.04109768569469452,
        -0.02084910310804844,
        0.09410712867975235,
        -0.016961460933089256,
        -0.19777201116085052,
        0.05872470885515213,
        0.02448718063533306,
        -0.09016046673059464,
        0.013260999694466591,
        -0.04020114243030548,
        -0.05609998106956482,
        0.011913090944290161,
        -0.016185414046049118,
        0.01042149867862463,
        -0.07841355353593826,
        -0.030976761132478714,
        -0.041098762303590775,
        -0.029227545484900475,
        0.08129332959651947,
        0.017956901341676712,
        -0.021052103489637375,
        0.06104378029704094,
        0.029054181650280952,
        -0.06755582243204117,
        -0.03360174596309662,
        0.03698595613241196,
        -0.09323185682296753,
        0.01987321674823761,
        -0.024427451193332672,
        -0.011482431553304195,
        -0.0674402192234993,
        -3.823176724588454e-33,
        -0.00731669133529067,
        0.0007069714483805001,
        -0.03286257013678551,
        0.010794533416628838,
        -0.008859782479703426,
        0.053544461727142334,
        -0.03502381220459938,
        -0.07014156132936478,
        -0.06167508289217949,
        -0.04437825456261635,
        -0.006001099478453398,
        0.016423635184764862,
        -0.11098577082157135,
        0.008405698463320732,
        0.02845415286719799,
        0.002948242472484708,
        0.0039715515449643135,
        -0.011514944024384022,
        0.03940359503030777,
        -0.011510155163705349,
        0.05510173365473747,
        0.05289872735738754,
        -0.010541905649006367,
        0.0237392820417881,
        0.00031444517662748694,
        -0.031038358807563782,
        0.00013024777581449598,
        0.08537866920232773,
        -0.03740508109331131,
        -0.014115978963673115,
        0.024470964446663857,
        -0.023159019649028778,
        -0.06901725381612778,
        -0.046080026775598526,
        0.08450651168823242,
        -0.020632632076740265,
        -0.04026390612125397,
        0.014963086694478989,
        0.027792539447546005,
        0.05028349161148071,
        0.12262815237045288,
        -0.07045053690671921,
        -0.0561123825609684,
        -0.00404871953651309,
        0.06989122927188873,
        -0.019275857135653496,
        -0.0885624885559082,
        -0.0564904622733593,
        -0.0003680498048197478,
        -0.004335376899689436,
        0.021376343443989754,
        -0.01991851255297661,
        0.019001571461558342,
        0.016441332176327705,
        -0.0951775312423706,
        -0.007407999597489834,
        -0.03819414600729942,
        0.08046374469995499,
        -0.030571946874260902,
        -0.009177539497613907,
        0.006303342059254646,
        -0.04351639375090599,
        0.008215094916522503,
        -0.09092018753290176,
        0.047072235494852066,
        0.033966198563575745,
        0.10593773424625397,
        0.07105017453432083,
        0.0007814716664142907,
        -0.02693735435605049,
        -0.0022179707884788513,
        -0.010240685194730759,
        0.008730186149477959,
        -0.03158986195921898,
        -0.07760033011436462,
        0.09419786930084229,
        0.08945030719041824,
        -0.012797316536307335,
        -0.021910835057497025,
        -0.045512374490499496,
        0.024430962279438972,
        -0.0010786306811496615,
        0.058970849961042404,
        -0.009192099794745445,
        0.048444781452417374,
        0.03401512652635574,
        0.042754508554935455,
        -0.025519169867038727,
        -0.062038883566856384,
        0.024466371163725853,
        -0.03841546177864075,
        0.02342619001865387,
        -0.054340023547410965,
        0.05889218673110008,
        -0.019676348194479942,
        -5.671562419706788e-08,
        -0.02653268352150917,
        0.017550429329276085,
        0.02615724317729473,
        0.0745202824473381,
        -0.05440118536353111,
        -0.007935259491205215,
        0.00552904000505805,
        0.012620748020708561,
        -0.006079403683543205,
        0.039503809064626694,
        0.03639741241931915,
        -0.14335490763187408,
        0.0004582711262628436,
        0.04960538446903229,
        0.008423196151852608,
        0.10540179163217545,
        -0.06366007030010223,
        0.08966049551963806,
        -0.04473479837179184,
        -0.015390737913548946,
        -0.016505781561136246,
        0.048018209636211395,
        0.07468275725841522,
        0.052280329167842865,
        -0.020700234919786453,
        0.021959107369184494,
        0.08088252693414688,
        0.023943379521369934,
        0.06065193563699722,
        0.023221099749207497,
        -0.07341093569993973,
        0.02205340564250946,
        -0.0022527624387294054,
        0.04578112065792084,
        -0.022596534341573715,
        -0.050082381814718246,
        -0.03214920684695244,
        0.07202150672674179,
        0.03745236247777939,
        0.02107943594455719,
        -0.028756756335496902,
        -0.04080813005566597,
        -0.03739986941218376,
        0.017067493870854378,
        0.00892857275903225,
        0.002226810669526458,
        -0.04983820393681526,
        0.020925424993038177,
        -0.03116714395582676,
        0.06567415595054626,
        0.004500855226069689,
        0.002228980418294668,
        0.08915260434150696,
        0.08061236888170242,
        0.0040762824937701225,
        0.03971705958247185,
        -0.030713459476828575,
        0.037746839225292206,
        -0.008976143784821033,
        0.06659922748804092,
        0.07694853097200394,
        -0.1529712677001953,
        -0.046401750296354294,
        0.09149208664894104
    ]
}