{
    "id": "oHOwfAcNG2c",
    "title": "AirPods Pro 2: Why is everybody praising these",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-09-28T14:00:22Z",
    "video_url": "https://www.youtube.com/watch?v=oHOwfAcNG2c",
    "category": "Science & Technology",
    "tags": [
        "airpods pro 2",
        "airpods pro",
        "airpods pro 2 review",
        "airpods pro 2022",
        "airpods",
        "airpods pro 2nd generation",
        "new airpods pro",
        "airpods pro 2 unboxing",
        "apple airpods pro 2",
        "apple airpods pro",
        "airpods pro 2nd gen",
        "airpods pro 2 vs airpods pro",
        "airpods pro 2 vs airpods 3",
        "new airpods",
        "airpods pro review",
        "apple",
        "airpods pro 2 hands on",
        "airpods pro 2 vs",
        "iphone 14",
        "airpods pro unboxing",
        "apple airpods",
        "airpods pro vs airpods pro 2",
        "apple event",
        "airpods pro 2nd"
    ],
    "views": 459186,
    "likes": 14912,
    "comments_count": 747,
    "description": "Apples second-generation AirPod Pros arent the stemless, earth-shattering buds I was hoping they would be. Instead, Apple took an already great product and added some simple upgrades to battery life, some minor case improvements, and added a new H2 chip for better audio quality and active noise cancellation. But the $249 earbuds are contending with fiercer competition than ever before. Over the last few months alone, weve seen excellent earbuds released by Samsung, Google, and Sony that all give the second-generation AirPods a run for their money. If you arent tied to the Apple ecosystem it is now safe to say there are better options available.  Listen to Becca's playlist here -  YouTube:  Spotify:    0:00 - Intro 0:28 - Active Noise Cancellation Test 2:10 - Active Transparency Mode 2:38 - Case and Earbud Changes 3:23 - Mic Test 4:31 - Audio Quality 5:52 - Battery Life 6:19 - Conclusion  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:    You can get the AirPods Pro (2nd Generation) here:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3xYAkL2",
        "https://spoti.fi/3DVRrks",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3BMeDPo",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Three years later and we finally have the second generation of Apple's AirPods Pro. They're $249, they have a better case, improved battery life and an all new H2 chip that Apple claims-- - Delivers advanced computational audio previously unable to run on a device of this size. - And that coupled with new vent placements reportedly adds up to twice the amount of active noise cancellation over the previous AirPods Pro. Thing about reviewing earbuds on video is that features such as ANC are incredibly hard to demonstrate. So, I wanted to try something new. This is Owen. He set up a sort of blind active noise cancellation test that's going to simulate common noises that most folks who are wearing ANC buds wanna cancel out. Every earbud fits every ear differently and that is incredibly important to ANC performance but I'm hoping that this test will give us a general idea of how each of these earbuds perform. I'm gonna be listening to the same song on four pairs of wireless earbuds that we, here at The Verge, think have the best active noise cancellation in this price range. If/when I hear a noise, I'll raise this sign and then we'll move onto the next sound. Okay, go. (bell rings) (machine clattering) Yeah, is that a jackhammer? (waves crashing) Is that like white noise? Yeah, that's like a low. Oh God. Whoa, is that like a helicopter? It's deep, it's deep. I can like feel it but I can't hear it. All set? - [Owen] Yeah. - Wow. Okay, so jackhammers. - [Owen] Yeah. - Okay. No other pair of earbuds came close to canceling as much noise as the Bose QuietComfort II's did. It was almost scary how much I couldn't hear. That being said, the AirPod Pros second gen did cancel out a pretty good amount of noise and definitely more than the previous version. Now, they also have a feature called active transparency mode, which is when you're in transparency mode meaning that you can hear the things around you. If there's annoying sounds, it's supposed to take those sounds down so you have a more pleasant listening experience. Now, I have had an incredibly hard time getting those to trigger it. In fact, I haven't been able to get it to trigger. Even here in the studio, we played some jackhammer sounds and I couldn't get it to take them down. So, we'll have to use these headphones more and see if we can get that feature to work at all. (light music) For folks coming from the original AirPods Pro, the biggest changes you'll notice are actually in the case. There's a lanyard loop on the side and now the case can be charged via MagSafe or on any Apple watch charger. But more importantly, the case now makes sound. (dinging) (beeping) The only visual difference to the buds themselves is the vent is now located on the top of the bud and there's an added extra small size ear tip option. On the stem, there's also now the ability to swipe up and down to adjust the earbuds volume. I have thought that all earbuds should have swiping volume controls. So it's absolutely excellent to see that coming to these earbuds. Apple also claims that they have improved the inward facing mics on these buds. So we put them through the ultimate stress test. (rumbling) Okay, I've wanted to do this mic test for a very long time. These are $249 2nd gen AirPod Pros and we're on a boat. The boat test is not just about wind. It's also about background noise. It's also about just wanting to talk on the phone when you want to talk on the phone. And these are the original AirPods Pro. You can get them for like $179. Ah man, speaking on waves, baby. Definitely has some really nice windshield technology on their earbuds, but this is a lot of wind and a lot of background noise. Okay, okay, but here's what they sound like in a more controlled environment. There's like a noisy fridge behind me but, otherwise, we're in a quiet office. I continue to be impressed with the mic on the Sony LinkBuds. I continue to be disappointed by the mic on the Samsung Buds 2 Pro. But to me, the 1st gen AirPods Pro don't really sound all that different from the 2nd generation of the AirPods Pro. And well, nothing will ever come close to the wired Apple headphones that of course have incredible mic placement and a solid wired connection. But, how do the AirPod Pros sound? (upbeat music) The new AirPods Pro have a personalized spacial audio feature that is created via the true depth camera on the iPhone. It always feels fun to go through a personalization setup but rarely does it affect real life performance and sadly, that is true here as well. I did not notice any real change in spacial audio performance post-personalization. But that didn't make me any less in love with head tracking which many folks would label as a gimmick and I don't know, it just hasn't gotten old for me yet and I especially love making people use it who have never tested it before. It's really cool. It's a great bar trick. Bt more importantly, the 2nd generation AirPod Pros have an improved H2 chip and new amps and drivers. The company claims that this creates deeper bass and crisper highs and yeah, it does. These buds sound great and incredibly full with a balanced amount of bass. But if you're coming from the previous AirPod Pros, I'm not sure there's like that much of a difference. Those earbuds have great sound and these do too. I made a playlist that I'll link down below full of all the songs I've been listening to while testing these buds. They happen to be all these like full, really punchy songs that have lots of highs and lows and good bass. I mean, these headphones, they really shine when they can kinda separate all those sounds for you. Now, something that previous owners of AirPod Pros and new owners will notice is battery life. The new buds have six hours of battery life with ANC turned on and four and a half hours of continuous talk time from a single charge. All of that means that during a work day, I started at nine-thirty AM. I was able to get around three PM before the buds died. It's definitely better and will feel amazing if your 1st gen AirPod Pros batteries have begun to fade. So, the 2nd generation AirPods Pro, they're not the stemless, earth-shattering earbuds I was kind of hoping they would be. But they're a solid upgrade to the previous version. Apple took an already great product and added some simple upgrades to battery life, some minor case improvements, a bump in audio quality, and a much bigger bump in ANC, and added a few gimmicks like personalized spacial audio. All of these things will make these AirPods Pro feel new and special to owners of the previous AirPods Pro, but I don't think there's enough there for folks who aren't due for an upgrade to jump at. But I'm just not so sure why I'm seeing so many reviews like absolutely raving about these earbuds. They're good, yes, but they're not nearly as groundbreaking as the 1st generation was and of course, if you are an iOS user, you're gonna love the tight integration with the ecosystem and you're probably absolutely gonna buy these so long as they fit your ears. But for everybody else, there's a whole huge sea of wireless earbuds that have better ANC like the Bose QC IIs or I don't know, better audio quality like Sony's WF, WF 1000 XM4s, I think that it, it's a bad name but I think that's it. Or I don't know, anything from Anker that's gonna be a much cheaper price. But if you love your AirPod Pros or you're set on having a pair of AirPod Pros, then these, these are the absolutely best ones yet. - I couldn't get this sound to play when we were doing the case sound test because the headphones weren't dead, but they're dying now. So, this is the sound that it makes when you put your headphones in the case and the headphones are dying. It is the most useful sound they have 'cause it reminds you to charge it. Anyway. (light beeping) That's sweet, right? (imitating beeping) (laughs) Bye bye.",
    "transcript_keywords": [
        "AirPods Pro",
        "AirPod Pros",
        "Pro",
        "Pros",
        "previous AirPods Pro",
        "gen AirPod Pros",
        "Apple AirPods Pro",
        "AirPod Pros sound",
        "AirPods",
        "original AirPods Pro",
        "earbuds",
        "AirPod",
        "sound",
        "previous AirPod Pros",
        "noise",
        "generation AirPod Pros",
        "gen AirPods Pro",
        "AirPods Pro feel",
        "ANC",
        "buds"
    ],
    "transcript_entity_values": [
        "Three years later",
        "Apple claims-- - Delivers",
        "ANC",
        "WF",
        "Apple",
        "four",
        "249",
        "the AirPods Pro",
        "Owen",
        "generation AirPods Pro",
        "four and a half hours",
        "nine-thirty AM",
        "six hours",
        "a work day",
        "gen AirPods Pro",
        "Samsung",
        "the Bose QC",
        "AirPods Pro",
        "MagSafe",
        "2nd",
        "Pros",
        "second",
        "Sony",
        "Anker",
        "iPhone",
        "179",
        "1st",
        "H2",
        "around three PM"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "EVENT",
        "TIME",
        "TIME",
        "TIME",
        "DATE",
        "EVENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.040043268352746964,
        -0.06218922138214111,
        0.039102952927351,
        0.007453632541000843,
        0.0732160434126854,
        -0.03003261238336563,
        0.03818482160568237,
        0.05050189420580864,
        -0.026687923818826675,
        0.06668494641780853,
        0.0339709110558033,
        0.021960493177175522,
        -0.03800090774893761,
        -0.0665641501545906,
        0.09780289977788925,
        0.026407161727547646,
        0.1371435821056366,
        -0.023840375244617462,
        0.012459630146622658,
        -0.019924312829971313,
        -0.055118560791015625,
        0.012010971084237099,
        0.10240112245082855,
        0.05061907693743706,
        -0.004916868172585964,
        -0.017241541296243668,
        -0.04832949861884117,
        -0.06997985392808914,
        -0.052408747375011444,
        -0.025356587022542953,
        0.025557933375239372,
        0.024494916200637817,
        0.08786081522703171,
        -0.052515022456645966,
        0.006331284064799547,
        -0.12763580679893494,
        0.09783218055963516,
        -0.002927488647401333,
        -0.02774331532418728,
        -0.021171610802412033,
        -0.013428454287350178,
        0.013861572369933128,
        -0.06749501079320908,
        -0.0343952402472496,
        -0.03385111317038536,
        -0.07180590182542801,
        0.023958228528499603,
        -0.059425126761198044,
        0.012658461928367615,
        0.10707313567399979,
        0.020512355491518974,
        -0.11628185212612152,
        0.08980463445186615,
        -0.014894266612827778,
        0.020430393517017365,
        -0.0026728592347353697,
        -0.04788173362612724,
        0.05717048794031143,
        -0.008053144440054893,
        -0.006533278618007898,
        0.05346212163567543,
        -0.06220973655581474,
        0.021515989676117897,
        -0.0961158499121666,
        -0.024102885276079178,
        -0.008231353014707565,
        0.020513858646154404,
        0.03885176405310631,
        0.07215577363967896,
        0.03348294273018837,
        -0.08829466998577118,
        0.05524391308426857,
        0.03613646700978279,
        -0.017772385850548744,
        0.018824324011802673,
        0.050647854804992676,
        0.04717523232102394,
        -0.06041973456740379,
        -0.0011667984072118998,
        0.06770463287830353,
        0.01873713918030262,
        -0.07026360929012299,
        -0.02390199527144432,
        -0.0906745195388794,
        -0.015755321830511093,
        -0.04242094233632088,
        0.014734241180121899,
        -0.025599054992198944,
        -0.09946303814649582,
        -0.017795350402593613,
        -0.06530135869979858,
        0.08996357768774033,
        0.031594693660736084,
        -0.05996322259306908,
        0.036753810942173004,
        -0.017840074375271797,
        4.461137723410502e-05,
        0.0283293928951025,
        0.056913699954748154,
        0.0014063265407457948,
        0.041894882917404175,
        0.015229107812047005,
        0.005005566403269768,
        -0.10947243869304657,
        0.05797530710697174,
        -0.08020959049463272,
        -0.10190649330615997,
        -0.042656656354665756,
        0.05687946081161499,
        0.12770822644233704,
        0.02567351795732975,
        -0.07123063504695892,
        -0.009597753174602985,
        -0.015202589333057404,
        -0.008416197262704372,
        0.12110034376382828,
        -0.04790022224187851,
        0.023704808205366135,
        0.12031704932451248,
        -0.035396382212638855,
        0.03388671949505806,
        0.004664908163249493,
        0.05332165211439133,
        -0.014892633073031902,
        -0.05375070869922638,
        0.002775542438030243,
        -0.1341915875673294,
        6.272360714170953e-33,
        -0.03509571775794029,
        0.01916845329105854,
        -0.036390166729688644,
        -0.030675547197461128,
        -0.014581398107111454,
        -0.039242446422576904,
        -0.029568323865532875,
        -0.012274378910660744,
        0.012988317757844925,
        0.0201664250344038,
        -0.13632409274578094,
        -0.04453885555267334,
        -0.017028149217367172,
        -0.008201821707189083,
        0.08720558881759644,
        -0.108798086643219,
        -0.10181965678930283,
        0.03363104537129402,
        -0.037845320999622345,
        0.0428687185049057,
        0.004624418914318085,
        -0.026504959911108017,
        -0.02257339470088482,
        0.09065864235162735,
        0.09415795654058456,
        -0.06415948271751404,
        0.06666886061429977,
        -0.03647996112704277,
        0.033813972026109695,
        0.004101216793060303,
        -0.052181657403707504,
        0.006542843300849199,
        0.05559181421995163,
        0.015826324000954628,
        0.001347132259979844,
        -0.01483653113245964,
        -0.04996883124113083,
        -0.0019448611419647932,
        -0.001500272424891591,
        -0.09403259307146072,
        -0.006950641982257366,
        0.05209695175290108,
        0.03486043959856033,
        -0.023273222148418427,
        0.11605837941169739,
        0.025059999898076057,
        -0.02622426114976406,
        0.010059269145131111,
        0.02779798023402691,
        -0.036131374537944794,
        -0.039070747792720795,
        0.03912131488323212,
        -0.037273939698934555,
        0.05506889149546623,
        0.02514958567917347,
        -0.0722024142742157,
        -0.015331435948610306,
        0.042757634073495865,
        0.04359300062060356,
        0.010818217881023884,
        -0.010591144673526287,
        0.049720991402864456,
        7.478714542230591e-05,
        -0.04234598949551582,
        -0.10840470343828201,
        0.09716659784317017,
        0.031953077763319016,
        0.02945348434150219,
        -0.07260982692241669,
        0.008178463205695152,
        0.07204193621873856,
        0.07041380554437637,
        0.009949433617293835,
        -0.02678004652261734,
        -0.027706604450941086,
        -0.03220907226204872,
        -0.0008517660317011178,
        -0.0028204454574733973,
        0.025602826848626137,
        -0.018729113042354584,
        -0.024276213720440865,
        0.06255437433719635,
        -0.03284180536866188,
        0.05195818096399307,
        0.032747071236371994,
        -0.04846857488155365,
        -0.01566324196755886,
        0.022648699581623077,
        -0.021749485284090042,
        0.009023300372064114,
        -0.0129958251491189,
        0.05448656901717186,
        -0.027652587741613388,
        0.015585457906126976,
        -0.014325004070997238,
        -5.245048813871339e-33,
        0.054814644157886505,
        -0.02751573547720909,
        0.0385323129594326,
        0.05576473847031593,
        -0.007122962735593319,
        0.05887217819690704,
        0.06506796181201935,
        -0.022898275405168533,
        0.008034054189920425,
        -0.033408138900995255,
        -0.01510145515203476,
        0.05067526176571846,
        0.024957144632935524,
        0.07326995581388474,
        -0.006330051925033331,
        -0.08090992271900177,
        -0.08095797896385193,
        -0.1068694069981575,
        0.07020056992769241,
        0.006172584369778633,
        0.07180730998516083,
        0.010275840759277344,
        0.047909803688526154,
        -0.008887073025107384,
        -0.06209640949964523,
        -0.0418250635266304,
        -0.03141042962670326,
        0.022513048723340034,
        0.02759361080825329,
        -0.044026151299476624,
        -0.01718457043170929,
        0.04286724701523781,
        -0.0385015606880188,
        0.030192464590072632,
        0.07549788057804108,
        -0.03340065851807594,
        -0.009578059427440166,
        -0.012529385276138783,
        -0.023078329861164093,
        -0.01882915571331978,
        -0.05038527026772499,
        0.015467558987438679,
        0.02921895869076252,
        -0.07631755620241165,
        0.011333009228110313,
        0.028376365080475807,
        -0.060864973813295364,
        0.052296899259090424,
        -0.03277561068534851,
        -0.07169751822948456,
        0.015845483168959618,
        0.044196292757987976,
        -0.02508147992193699,
        0.0006375228986144066,
        -0.07899089902639389,
        -0.045644089579582214,
        -0.04169813543558121,
        0.020579855889081955,
        -0.013404227793216705,
        0.035163626074790955,
        0.025578394532203674,
        0.0158016886562109,
        0.03024294413626194,
        -0.007797659374773502,
        -0.09246168285608292,
        0.09526356309652328,
        0.005774158053100109,
        0.09397080540657043,
        -0.038000162690877914,
        0.04822500795125961,
        0.01303345151245594,
        -0.012206193059682846,
        0.0055207759141922,
        0.007227027788758278,
        -0.0010775340488180518,
        0.0657309740781784,
        -0.008286751806735992,
        0.02956867218017578,
        0.05514007806777954,
        -0.009171554818749428,
        -0.05212194845080376,
        0.06740091741085052,
        0.05844491347670555,
        0.024000847712159157,
        0.05497848615050316,
        0.039346955716609955,
        -0.04048962891101837,
        -0.014161846600472927,
        -0.062076032161712646,
        0.0867275819182396,
        -0.01801712065935135,
        -0.04238510876893997,
        -0.06761426478624344,
        0.07303154468536377,
        0.02005346678197384,
        -5.194137031594437e-08,
        0.05138825252652168,
        0.008414237760007381,
        0.09223104268312454,
        -0.03513049706816673,
        -1.1065342732763384e-05,
        -0.04626862332224846,
        -0.048452816903591156,
        0.05177677795290947,
        0.08360844105482101,
        0.0008184442995116115,
        -0.013243460096418858,
        -0.03288741409778595,
        -0.03935888409614563,
        0.011293640360236168,
        0.045972052961587906,
        0.04863826930522919,
        -0.05100575461983681,
        0.0515938401222229,
        -0.0154161611571908,
        -0.05744210630655289,
        -0.05851798504590988,
        0.06579992920160294,
        -0.03157418221235275,
        -0.03681032732129097,
        -0.018478907644748688,
        0.015457467176020145,
        0.009548600763082504,
        -0.027247177436947823,
        0.0017049041343852878,
        -0.009814354591071606,
        -0.06023578345775604,
        -0.0027274538297206163,
        -0.05476123467087746,
        -0.03231537714600563,
        -0.0038099554367363453,
        -0.07840467989444733,
        -0.04430898651480675,
        0.025560937821865082,
        -0.07129546999931335,
        0.039101775735616684,
        -0.011634199880063534,
        -0.08443494141101837,
        -0.04958340525627136,
        -0.009570086374878883,
        0.009903349913656712,
        -0.09914584457874298,
        0.07755816727876663,
        -0.042761556804180145,
        -0.061642490327358246,
        0.07382111251354218,
        -0.03173743933439255,
        0.036922797560691833,
        0.03371284902095795,
        0.005570355337113142,
        0.02451908029615879,
        0.07862814515829086,
        -0.028040405362844467,
        -0.00903724692761898,
        -0.1087430864572525,
        0.10555098950862885,
        0.033356815576553345,
        -0.07923541963100433,
        0.0501989908516407,
        0.13903005421161652
    ]
}