{
    "id": "OhQH-NRqtJk",
    "title": "This monitor comes at a HIGH COST! - ViewSonic XG271QG",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-11T21:06:58Z",
    "video_url": "https://www.youtube.com/watch?v=OhQH-NRqtJk",
    "category": "Science & Technology",
    "tags": [],
    "views": 278169,
    "likes": 11476,
    "comments_count": 766,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   Viewsonic is a legacy brand that has been around for a while, and its ELITE series is their gaming line. It's great, but it also has a heavy price tag.   Buy ViewSonic XG271QG Monitor On Amazon:  On Best Buy:  On Newegg:   Buy Corsair Gaming Keyboard On Amazon:  On Best Buy:  On Newegg:   Buy Logitech Gaming Mouse On Amazon:  On Best Buy:  On Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - New Year's RESOLUTION! 1:07 - Unboxing 2:57 - I/O options 3:35 - Monitor exterior impressions 3:54 - Stand assembly and movement range 5:48 - Sponsor - Secret Labs! 6:22 - RGB Impressions 7:00 - Desk stand placement impressions 7:25 - 240hz impressions 7:42 - HDR impressions 8:28 - Refresh rate thoughts 9:00 - RGB continued impressions 10:00 - Gaming impressions 11:00 - Pricing and final thoughts",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://geni.us/fcSc4",
        "https://geni.us/Uyd4v8",
        "https://geni.us/vtgjI0",
        "https://geni.us/kqL2Ac",
        "https://geni.us/ffepYG",
        "https://geni.us/G48uoG",
        "https://geni.us/Gpnuz0l",
        "https://geni.us/1GYBd",
        "https://geni.us/AJ1lrh",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- [Cameraman] Are you Mario Karting? ( man laughing) - So it's 2022, you've got to buy a new monitor. Do you go 4K or do you stick with 1440 P, or are you upgrading from 1080 P and you don't know what to get? Well, ViewSonic has a new monitor for us and it's 1440 P, 240 Hertz, which is pretty impressive, honestly. Big box. ( man grunting) It's got all the stuff that you kind of expect from monitor manufacturers these days. But pretty much everyone's got G-sync, low-latency, input lag. Actually, this was not that bad for telling me all the random extra stuff it has on it. I don't know what RGB alliances but yeah, it's got 240 Hertz refresh rate. It's got a one millisecond response time and elite RGB. I hate this name, the XG271QG. Guys, please just, I don't understand monitor names. It's confusing. Why can't you just do it Samsung does and go with like the Odyssey Neo G9. Like I don't know. Sure that has a skew name as well, I'm pretty sure, but at least it's really easy. ViewSonic Elite? I think it's too broad. - [Jono] Have you ever used a ViewSonic monitor? - I've never actually had the pleasure of using one. First of all, I've usually been pretty broke. So, I'm usually finding whatever, like the cheapest option is. Oh. Okay, that was cool. That's actually neat. My big problem with a lot of monitor boxes is getting it back in the box. If you've ever got to sell it or return it or do whatever, it's kind of a pain in the ass. Whereas this is great. Cause I can just now grab this whole box, however I want and move it out. We've got some display port cables, USB B to A for the monitor to the PC. Power cable, Mickey Mouse plug. Oh, it's got a big brick. Ah, this thing is huge. - [Jono] That just means the monitor's gunna be small. - That's what I'm hoping for. Yeah, because if all of the power stuff is in here and not in the back of the panel. I'm really hoping it's kind of thin. This is nice. Ooh and it is light. Like I'm holding this with one hand and I'm not even worried. See how there are a couple side controls, but Jono pointed this up before I even realized it. They've got the navigation nipple on the bottom and that's like basically all they've got. Which is great cause that's all you need. Someone out there is gonna complain and say, \"No, I need all my extra buttons\", but I don't think so. Oh, these are a little nifty cable management things. I think their cable management. I don't know what else they'd be. You can like rotate them and stuff to get different angles for things. That's pretty neat. Unfortunately, you're probably going to want to use display port. It doesn't have HDMI 2.1. It's not ideal, but the HDMI standardization committee is working on it. Not really. That's a whole thing that people are getting upset about. I'm upset about it. Thank you for purchasing a ViewSonic Elite gaming monitor. Your new monitor features RGB integration that can be controlled by either using the elite display controller or by downloading key partners software. Oh, that's cool. So this whole thing on the back here is an RGB badge. It kind of looks like the cooler master logo. Like the shape, at least. Cool. I'm gonna peel this off. Luckily, most graphics cards have display port at this point. HDMI 2, HDMI 2, display port, headphone port, USB B to A, which is for your PC and then USB, USB. I actually don't know what the green stands for for USB A. Is green USB A 2.0? I haven't seen a green port in forever. It says 3.2? - [Jono] Yeah. - Okay, so the specs say a USB 3.2. I just haven't seen anyone use green for a USB port in a long time, but it's - Except Razer. Razer's whole thing is being green. On the back, I mean, you've got like a Kensington lock, which is great for schools, I guess. Although I don't know what school needs a 240 Hertz monitor. - [Jono] The best school. - The best schools, yeah, the elite. Panel itself looks okay. The bezels are super minor. Like they're nice and thin. The bottom is what it is, but we're seeing a lot of this like big bottom and then - The chins. yeah, the chins. I love that term. I think it's pretty apt. Won't really know, at least not from this angle or not until it's turned on, how big of a bezel is on the inside. All right, let's turn it on. - [Jono] No, no, no. You can't turn it on. You've got to assemble it. Oh, you're right. (beeping) I didn't even. (both laughing) I didn't even put the stand on. I really do think for the most of, for the most people that like 27 inches is basically the optimal gaming monitor size. Like even at home 27 inch was great for a really long time until my desk got bigger. And then once I had a bigger desk and I was sitting in additional, like, I don't know, six inches away from my monitor. That's when I wanted something bigger. - [Andy] Are you Mario Kart-ing? (everyone laughing) - I never even thought of it that. This totally does look like a racing wheel or something. It's so cool. It just slides in there and then you screw it down. Like most of them have this, probably a bolt, I guess, not a screw. But with this little handle here that you can flip up and down to twist it. Yeah, it's toolless. Yeah, it's invasive mountable a hundred by a hundred, like most monitors that aren't obnoxiously large. Nice. Yeah. And then you can just attach it with this little lever here. Ooh I like it. So light. Cooler master hexagon, cooler master hexagon. All I'm thinking when I'm looking at this thing is cooler master. I don't know why they were so obsessed with this hexagon design. - [Andy] It's cooler! - It's cooler, eh, (man laughing) I work with PC parts all the time. So that's probably why the branding is so in my face I guess. I like the little elite badge on the back. Not that anyone will ever really see it, but that's kinda nice. The actual stand is, it's pretty robust. It's got a good amount of like up and down this swivel. It's actually good amount of swivel and then tilt. Yeah. It's not bad. Oh baby. It goes sideways. My favorite feature. Probably more RGB strips. That's really cool. I'm really curious to see how it all looks when it's lit up and powered on and everything. But first, thanks to Secretlab for sponsoring today's video. Secretlab chairs are engineered to keep you incredibly comfortable for long hours at work and play. Their new Titan Evo 2022 chair keeps you feeling comfortable for longer. It's got four way lumbar support with an ultra comfortable line of different seat material and more. All chairs come with up to five-year extended warranty and a 49 day return policy. That's plenty of time to figure out if you like sitting in that chair or not. Head to the link in the description and checkout Secretlab today. Man moving, moving monitors, hard work. lttstore dot com. I'm a little disappointed in this bottom light strip. I'm sure that when it's pointed at your desk, it looks fine at emits a nice glow on the bottom of the surface. But looking at this strip, I was really excited thinking this whole strip was either going to be its own missive. Kind of like this guy here, or it was at least going to be like a lot more LEDs. The back looks good. See that's what that's what kind of kills me is they crushed it with the back. It looks exactly like I was hoping for. - [Andy] Ooh wow. - Where it's. Yeah. It's like a nice solid blue all the way around. Hey. - [Andy] Yeah. - Yeah, it looks awesome. And then this bottom strip is just so disappointing. Like why, you were so close, ViewSonic. Oh, I didn't cable manage. Aw, this is going to kill me. Okay. Sorry. One sec. I liked the stand at first. I'm not nearly as sold on it. Now that it's on the desk, I would really strongly prefer if it was out back here. I guess, you know what, actually, this would look great if I cable managed my mouse and keyboard up through there as well. And then all my cables will be running along this like black channel and then up out the back. So, okay. I guess in the right setting, it can look pretty good. 60 Hertz. No, no, no, no, no. 239.970 baby. Oh man. That's smooth. It looks great. There's like hardly any smearing or anything. Like you can, yeah. You can see the halo around the mouse when you do that. But like, oh my God, 240 Hertz. So it's HDR 400, which is okay. These days you really want more like 600 or 800 or 1,000. 400 is not as impressive as it could be. Let me just make sure HDR is on and windows use HDR. Yeah, I like it all looks good. I just, I wish it was a touch brighter. It's not bad HDR. It just could be a little better I guess. It's the biggest problem about working here, is I always work with and see the latest and greatest, like especially with CES coming up, all I'm seeing are all these cool press briefings for all this new stuff coming out. And I just spent like eight, 900 dollars on a monitor, - [Andy] Either you see the thing and you don't spend money, or you really like a thing and you spend tons of money. - And you spend way too much. This one doesn't boast color accuracy all that much. It's really about the 240 Hertz refresh rate, at 1440 P, which is pretty good. There's not a ton of 240 14, 40 P monitors out right now. And this thing does look good. Like as soon as you go back to like 60 FPS or a 60 Hertz display or a 30 FPS game, you just, (man scoffs) I don't know. It just looks bad instantly to you, and you can't like put a finger on why until you're like, oh, it's 60 Hertz or like, oh, it's like running it really low frame rate. I don't know. So I'm looking down at the bottom. At the base here. And I can see that it's like four or five LEDs. Can you see that on the camera? - [Andy] Yeah I can see that. - I was really hoping that it would be diffused enough off of everything that I wouldn't be able to pick that up, but I can still see that it's like four or five little LEDs. Come on you guys. Like you did perfectly on the back. It looks awesome. If the stand wasn't there, like directly underneath it, it might actually just bleed out nicely onto, onto like a mat or something. But because it's almost a mirror finish on the bottom of the stand, I can clearly see that that's just like five LEDs instead of this actual bar lighting up. Which is just, (man scoffs) it's kind of this. Yeah. See, like when it's not something reflective, you can, like it diffuses nicely. That's a little disappointing. We mentioned the bezel earlier. The outside bezel is super thin. The inside bezel is pretty average. I would, I wish it was a little thinner, but honestly it's not that bad. This is pretty standard. It's kind of what you're going to see. This is part of why this chin is so big. See how there's almost nothing on the bottom. It's covering a bunch of that. This looks awesome. There's no tearing, like at all. See, I'm looking around. Like I know you can't really see this through the screen recording and even the camera, isn't going to pick it up perfectly, but man, it's, there's no tearing. Like, you know, probably if we freeze framed, we could see a little bit, but it just looks smooth, like 240 Hertz. My God, please don't tell me. Wow, that was bad. Do I want 240 Hertz? Yes. Do I need it? I mean, not really, but man, does it ever look nice? And it just smooths out your game experience. And the refresh, like the response time moving at a higher refresh rate, with a fast monitor, like what are we getting? We're probably getting like, yeah, like 300, 250 frames per second. So we're really utilizing this thing. Okay. Let's talk price. That's probably the big elephant in the room here. 27 inch monitor, 1440 P 240 Hertz refresh rate. And it might be color accurate, but it does not boasting about it anywhere. So it's probably okay. It's 940 dollars. I just paid like 900 Canadian for a 32 inch 1440 P 165 Hertz. Very color, accurate monitor. Jono just bought a 4k 1 44 Hertz display for like 1000 Canadian dollars. 940 man. I can't, I just, even for that extra, like what, 80 Hertz. I don't know if I can justify paying that much more for this display while also shrinking and screen size. Now the point is I think that if you ever find this thing on sale, like even just 150 bucks off, it becomes a lot more worth it. But at full price? I don't know. I just don't think I can justify it. It's beautiful. I like that they've got the power outside so that this is a little like slimmer and lighter. The design is great. I'm still iffy on the stand. Sometimes I like it, sometimes I don't. It really depends on I think your cable management would make a huge difference. But I think if you're looking for the best bang for your buck, maybe it's not quite the ViewSonic Elite time yet. Thanks for watching. If you liked this short circuit, make sure to check out the other one we did. We just unboxed and aSus monitor that I really liked as well. I think it was 4k 120 Hertz. Pretty nice. But you need HDMI 2.1. If you want to play with your consoles on it. At the full frame rate.",
    "transcript_keywords": [
        "Hertz",
        "monitor",
        "yeah",
        "USB",
        "pretty",
        "back",
        "thing",
        "Hertz refresh rate",
        "Hertz refresh",
        "kind",
        "bottom",
        "elite",
        "Hertz display",
        "display",
        "nice",
        "RGB",
        "HDMI",
        "port",
        "great",
        "good"
    ],
    "transcript_entity_values": [
        "CES",
        "aSus",
        "Mickey Mouse",
        "FPS",
        "4k 120",
        "3.2",
        "49 day",
        "six inches",
        "940 dollars",
        "USB A.",
        "Hertz",
        "Razer",
        "Mario Karting",
        "One",
        "Kensington",
        "long hours",
        "4",
        "60",
        "14",
        "USB",
        "40",
        "4k",
        "239.970",
        "1,000",
        "ViewSonic",
        "1000 Canadian dollars",
        "240",
        "sec",
        "940",
        "27 inches",
        "165",
        "Andy",
        "second",
        "32 inch",
        "1440",
        "Evo 2022",
        "600",
        "150 bucks",
        "80",
        "Hertz",
        "Samsung",
        "Jono",
        "300",
        "1440",
        "first",
        "five-year",
        "these days",
        "1 44",
        "Razer",
        "2022",
        "ViewSonic Elite",
        "1080",
        "a hundred by a hundred",
        "Canadian",
        "ViewSonic Elite",
        "four",
        "400",
        "60 FPS",
        "30",
        "HDMI 2",
        "27 inch",
        "RGB",
        "250",
        "Cooler",
        "First",
        "2.1",
        "Secretlab",
        "Mario Kart",
        "today",
        "900 dollars",
        "800"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.0677361786365509,
        -0.056571878492832184,
        -0.021593721583485603,
        -0.0730612576007843,
        0.04890315979719162,
        0.036155104637145996,
        0.05073485150933266,
        0.04312615841627121,
        0.06991330534219742,
        0.09102713316679001,
        0.006262253504246473,
        0.011457148939371109,
        0.04976906254887581,
        -0.02469743601977825,
        0.009363410994410515,
        -0.05267447978258133,
        0.07259143143892288,
        -0.09727094322443008,
        -0.0383758619427681,
        -0.018573300912976265,
        -0.01650179736316204,
        -0.08153844624757767,
        0.027103111147880554,
        -0.007556975353509188,
        0.03139085695147514,
        -0.03335566446185112,
        -0.008648388087749481,
        -0.014489599503576756,
        0.0115492669865489,
        -0.07027800381183624,
        -0.04872479289770126,
        -0.015257587656378746,
        0.036859773099422455,
        0.050191402435302734,
        -0.037949591875076294,
        -0.040248021483421326,
        0.09040920436382294,
        -0.10899878293275833,
        -0.05657212436199188,
        -0.08788962662220001,
        -0.012839102186262608,
        0.009083155542612076,
        0.0026136692613363266,
        -0.015905553475022316,
        0.00869180727750063,
        -0.039998020976781845,
        0.006427866406738758,
        -0.037336260080337524,
        -0.03248682618141174,
        0.11024443060159683,
        -0.020468711853027344,
        -0.08291511982679367,
        0.08421673625707626,
        -0.03129514679312706,
        -0.0008951842901296914,
        0.049903981387615204,
        -0.04341404512524605,
        -0.03899821266531944,
        0.07647679001092911,
        0.004682677797973156,
        0.05376598984003067,
        -0.10941198468208313,
        -0.05313087999820709,
        0.035414207726716995,
        -0.0675382912158966,
        -0.026877742260694504,
        0.03742322325706482,
        -0.008182516321539879,
        -0.032922275364398956,
        -0.03788869082927704,
        -0.046085599809885025,
        -0.014392145909368992,
        0.05612007528543472,
        -0.000768677273299545,
        -0.032523833215236664,
        0.033361196517944336,
        0.11198768764734268,
        -0.11542480438947678,
        0.11085139214992523,
        0.00030854009673930705,
        0.006266394630074501,
        -0.0008722089696675539,
        -0.05648175999522209,
        -0.014371498487889767,
        0.09629059582948685,
        -0.0630018413066864,
        0.040235042572021484,
        0.05502321198582649,
        0.04524511098861694,
        -0.10787594318389893,
        -0.009627135470509529,
        0.06274909526109695,
        0.022184239700436592,
        0.006907016038894653,
        -0.026571068912744522,
        -0.0032253649551421404,
        0.04303056746721268,
        -0.005738263484090567,
        -0.03105042688548565,
        0.0532783567905426,
        0.04268813133239746,
        0.0528399832546711,
        0.12336163222789764,
        -0.02676246128976345,
        -0.04941296949982643,
        -0.07639244198799133,
        0.009895425289869308,
        0.0794229805469513,
        -0.02997014857828617,
        0.0036020264960825443,
        -0.07706863433122635,
        0.02049465849995613,
        -0.08444267511367798,
        0.012346181087195873,
        0.035868413746356964,
        0.1072043627500534,
        -0.02536938153207302,
        -0.0009261162485927343,
        0.13624003529548645,
        -0.01971791312098503,
        -0.0047563291154801846,
        -0.04220282658934593,
        -0.04075975716114044,
        0.03550068661570549,
        0.0017483029514551163,
        0.04076774790883064,
        -0.07617954909801483,
        2.9712829279070878e-33,
        -0.04283064603805542,
        0.10912954062223434,
        -0.07633163779973984,
        -0.09396917372941971,
        -0.019837962463498116,
        0.10159625113010406,
        0.0817595049738884,
        0.07855397462844849,
        -0.03261376917362213,
        0.04977341368794441,
        -0.056212425231933594,
        0.06057053431868553,
        -0.06721772253513336,
        0.059027474373579025,
        0.014988448470830917,
        -0.04505002871155739,
        -0.03266334906220436,
        0.01784919761121273,
        0.007565709296613932,
        0.025029515847563744,
        0.022542953491210938,
        -0.02691405452787876,
        0.03075457736849785,
        -0.020571209490299225,
        0.05588962137699127,
        -0.030852990224957466,
        0.012238900177180767,
        0.003292978508397937,
        0.06398209929466248,
        0.010676441714167595,
        -0.021048590540885925,
        -0.06313290446996689,
        0.017124012112617493,
        -0.017948240041732788,
        -0.03390015661716461,
        -0.04849750176072121,
        -0.06475161761045456,
        -0.055080484598875046,
        0.049503933638334274,
        0.0008600425790064037,
        -0.033497780561447144,
        0.07238761335611343,
        -0.118718720972538,
        -0.12542079389095306,
        -0.020146142691373825,
        0.037366777658462524,
        -0.01128710713237524,
        -0.01761971041560173,
        0.04112036153674126,
        -0.03588288277387619,
        -0.08477412909269333,
        0.0078025078400969505,
        -0.09238319844007492,
        -0.05999438837170601,
        -0.029897840693593025,
        -0.05168154090642929,
        0.027790958061814308,
        0.00783524103462696,
        0.014871365390717983,
        0.004454659763723612,
        -0.004569157026708126,
        0.0021203209180384874,
        0.039322756230831146,
        0.022019019350409508,
        -0.024578016251325607,
        0.04324711114168167,
        0.08022844791412354,
        0.06822647899389267,
        -0.13691529631614685,
        -0.004302981309592724,
        -0.031363345682621,
        -0.024672631174325943,
        0.06221508979797363,
        -0.07832781970500946,
        0.0063397749327123165,
        0.0024421464186161757,
        -0.11447809636592865,
        0.0007857333403080702,
        -0.0003485691559035331,
        0.008715713396668434,
        -0.029886944219470024,
        0.03644359111785889,
        0.031359001994132996,
        0.08431918174028397,
        -0.055466942489147186,
        -0.012216037139296532,
        -0.026347624137997627,
        -0.0019076603930443525,
        -0.02250734530389309,
        -0.03414101153612137,
        -0.019395330920815468,
        -0.033764321357011795,
        -0.037252724170684814,
        -0.024113504216074944,
        -0.04686730355024338,
        -4.893474249245732e-33,
        -0.056091032922267914,
        0.03110968880355358,
        -0.009794319048523903,
        0.018589330837130547,
        0.030598223209381104,
        -0.032464053481817245,
        0.06473568081855774,
        -0.0064401947893202305,
        0.026635415852069855,
        -0.09200889617204666,
        0.02401793748140335,
        0.04896968603134155,
        -0.02923666499555111,
        0.04965454712510109,
        0.03503633290529251,
        -0.048596855252981186,
        0.014354664832353592,
        -0.0522562712430954,
        0.05795183777809143,
        -0.08904991298913956,
        0.09161462634801865,
        -0.0010779191507026553,
        -0.01758921518921852,
        0.06461738049983978,
        0.034823037683963776,
        6.1670238210354e-05,
        0.04256538301706314,
        0.008852698840200901,
        0.016656409949064255,
        0.08873718231916428,
        -0.0458151251077652,
        0.014561159536242485,
        0.06664487719535828,
        0.02314911037683487,
        0.0397958904504776,
        0.0030205834191292524,
        0.0576128289103508,
        0.03606238216161728,
        -0.020913168787956238,
        -0.003017628565430641,
        0.006814500782638788,
        0.04185561090707779,
        0.08139757812023163,
        0.0312504842877388,
        0.06022867560386658,
        0.0017281622858718038,
        -0.0002719851036090404,
        -0.09367173910140991,
        -0.04286302253603935,
        0.016848638653755188,
        -0.06778133660554886,
        -0.036241695284843445,
        0.037452321499586105,
        -0.04410165548324585,
        -0.1280437856912613,
        -0.010121844708919525,
        -0.08273298293352127,
        0.08417220413684845,
        -0.010263598524034023,
        -0.016397539526224136,
        0.04011985659599304,
        0.014735142700374126,
        -0.09148944914340973,
        0.03172224014997482,
        -0.00028444058261811733,
        0.007952002808451653,
        0.028523942455649376,
        0.006449574138969183,
        0.013724887743592262,
        -0.011131643317639828,
        -0.00991699006408453,
        -0.03054218180477619,
        -0.0499604158103466,
        -0.06761446595191956,
        -0.04298795759677887,
        0.11069857329130173,
        0.024330802261829376,
        0.018302513286471367,
        0.0265800841152668,
        -0.02607426978647709,
        0.03445176035165787,
        0.007186452858150005,
        0.1151217520236969,
        -0.040356673300266266,
        0.07185158133506775,
        0.015560111962258816,
        0.028821762651205063,
        -0.011209895834326744,
        -0.05641103535890579,
        -0.012549322098493576,
        -0.06835687160491943,
        -0.02150673419237137,
        -0.056673314422369,
        0.014942816458642483,
        0.042195193469524384,
        -5.776539424573457e-08,
        -0.030525702983140945,
        0.005845988634973764,
        0.013941261917352676,
        0.005843342747539282,
        0.012827547267079353,
        -0.08012430369853973,
        0.020723940804600716,
        -0.036428701132535934,
        0.0762735903263092,
        0.0023491557221859694,
        0.015102743171155453,
        -0.10774772614240646,
        -0.009887393563985825,
        0.021280696615576744,
        0.00249111489392817,
        -0.0019656727090477943,
        -0.026840677484869957,
        0.03227854147553444,
        -0.02542240358889103,
        -0.008294313214719296,
        -0.011293187737464905,
        0.0049620503559708595,
        0.0830802395939827,
        -0.04556776210665703,
        0.010731106624007225,
        0.020508859306573868,
        -0.06545763462781906,
        0.03181476145982742,
        0.09225472807884216,
        -0.03379085287451744,
        0.0037510523106902838,
        0.005542880855500698,
        0.08416718989610672,
        -0.06321420520544052,
        0.0843411237001419,
        -0.02209608629345894,
        -0.047982484102249146,
        0.02739110216498375,
        0.10882015526294708,
        0.06758366525173187,
        -0.011170150712132454,
        -0.07242722809314728,
        -0.04113912954926491,
        -0.017687559127807617,
        0.02323448285460472,
        0.015511313453316689,
        -0.06265097111463547,
        -0.1083042174577713,
        0.026047728955745697,
        0.037747886031866074,
        -0.005680353846400976,
        0.006830534897744656,
        -0.022659040987491608,
        -0.07449057698249817,
        -0.006619562860578299,
        0.021670658141374588,
        0.028580479323863983,
        0.04567679390311241,
        0.027702704071998596,
        0.06197758764028549,
        0.05075569823384285,
        -0.11996891349554062,
        -0.05820455402135849,
        0.07442515343427658
    ]
}