{
    "id": "oj-1UfhUiaA",
    "title": "I regret buying this MYSTERY Tech...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-03-07T18:41:43Z",
    "video_url": "https://www.youtube.com/watch?v=oj-1UfhUiaA",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "how to waste",
        "amazon",
        "wish",
        "ebay",
        "tech",
        "gadgets",
        "technology",
        "stompai",
        "yeston",
        "amd",
        "radeon",
        "rx 5700 xt",
        "snowblind",
        "nzxt snowblind",
        "gaming pc",
        "simba",
        "nerf",
        "this is",
        "austin evans"
    ],
    "views": 1874088,
    "likes": 54585,
    "comments_count": 2100,
    "description": "What an excellent podcast that I definitely don't host   This video is WHY so much money was wasted this episode   Last Mystery Tech was...explosive    I regret buying this MYSTERY Tech...  Our second channel @thisis!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.relay.fm/testdrivers",
        "https://youtu.be/fElUqZHWpUw",
        "https://youtu.be/JexHkrPlk40",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "(flute sound) (laughing) (flute sound) - Hello and welcome to Mystery Tech. (laughing) - [Matt] It's so bad. (laughing) That's the worst. - Wait, I need to be able to see here, hold on, hold on. (laughing) Alright, what is even happening right now? - I'm a villain for you to fight. (upbeat music) (mumbling) (game sound) This like, some exercise band? It's like your phone attaches here and you wrap it around your arm, this attaches to your feet? - [Matt] Yeah. - Stompai can transform your phone to live drummer, who is always with you, you only need two things to use it, a smartphone and a mount, install a application on your phone, put the mount on your foot, and you're ready to rock. (upbeat music) Wait, this actually could be okay, right? - [Matt] Okay, you should not use-- (mumbling) (laughing) the (bleep) Z Flip. (laughing) - Yeah, of course I can use the Z Flip. (laughing) - [Ken] You picked the worst possible device. - What's wrong with the Z Flip? - [Matt] That thing is going to explode - It'll be fine. - the second you put it in that clip. - So fine. Okay, so, we're just gonna do this, I'm sure it will be fine, I just hit the bixby button, okay, so that will be my toe, and then my heel will be a snare. - [Matt] No, your heel should be the bass drum, the toe should be the snare. - Okay, okay, okay. - [Matt] That's how music works. (drum sounds) Toto museum, is this a follow up from last episode where you bought a very expensive Toto Washlet? - [Ken] It is, I actually went to the Toto Museum, as a part of Mystery Tech. - [Matt] I can't help but notice, in last Mystery Tech he threw an IPhone X, but this he gingerly put down. - Look, Ken cares about his (Roblox oof) okay? - [Ken] I do, I do. - Alright, so we have the Toto flats, uh, toilet model, what is this? Why is this so heavy? Oh, it's a little toilet. Aw, that's pretty cool, okay, all right, it's even porcelain, alright. Now, what is this? Toilet chocolate, is this just a chocolate toilet? - [Ken] No, it's many chocolate toilets. - That's a very strange museum, so if you guys are not familiar, Toto is probably the toilet bidet maker of Japan, it is certainly one of the more popular ones, you'll see them around, if you look for the brand of your toilet. Individually wrapped little toilets, how much was all of this? - [Ken] I probably spent about $30 on all of that together. - Perfectly reasonable. You know what? Can I just give you some rare acclaim here? We're three items into a Mystery Tech, and you've only wasted like 70 bucks, 80 bucks? Wait, no no no no no, don't you dare try to grab something expensive right now, and try to make me feel bad, I'm trying to give you a compliment, this is a solid job of not wasting too much money on Amazon. (groans) You know what? This can wait, I'm gonna enjoy myself a toilet. - [Matt] Don't like that. - Glad your report does not taste like (bleep) (slam) Why does this thing look so stupid? I'm going to take a guess and say this was not cheap, Ken, did you or did you not spend over $120 on this? - [Ken] It was $100, so a relative bargain by your standards. - No, no, because this is a Lion King toy, and I am a grown ass man. Okay. - [Ken] We got veterinarian extraordinaire Dr. Austin Evans in the house. (laughing) Just mauling Simba. - Excellent. - [Matt] Can confirm, that's how they neuter animals, they just rip it. - Jesus Matt. - [Matt] You're the one who's doing it. - That one goes down, down, and then I'm assuming up, up, yeah. - [Ken] This is like the most (beep) biology class ever. - Look man, everyone needs some energy in life, Simbas got his, I don't actually know how to turn it on though, I put batteries in it. Oh, there's an on. - [Ken] Oh, let me guess. (laughing) (mumbling) - Look, this is his power button, right here, okay? That's his power button. - [Simba] Roar, roar, let me hear your roar. - [All] Roar. - [Simba] Whoa, not bad. - This thing's actually kind of smart. - [Ken] He gives you more compliments than we do. - [Simba] I know, huh? - What? (laughing) - [Ken] Oh no. Oh no. Oh no. (laughing) - [Simba] Hakuna Matata. (laughing) - Nerf Blaster Scooter? Are we 12 again, cause this is awesome, wait, wait, I just realized what I just said, the Blaster Scooter, aw, hell yeah. (upbeat music) (flute sound) Ah! Ah! Sometimes you just gotta shoot your shot, if you can actually, Ah! You got me in my neck Matt, he keeps trying to pull the dart out, and it doesn't do a good job, like it keeps getting stuck. (laughing) OW! Not helpful. (scooter sounds) Whoa! Yes, it works. (laughing) (scooter sounds) - [Matt] That's not how scooters work. (laughing) (breathing heavily) (laughing) - [Matt] So, what have we learned today? - Well, we've learned that Nerf is fun, and that this is still not going to be any tech in Mystery Tech this week. (mumbles) What the-- (laughing) Don't come at me like that man, what are we doing with our lives? Right now, Oh God, it's so much worse, so much worse. - [Matt] Alright, so remember how you said there was no tech on this episode? - Yeah, It's just been toys and stupid things. - [Ken] It's only tech from here. - All tech, all the time? - [Ken] Yes. Would you say it's tech (beep). Redo that, redo that, redo that. - [Ken] Dude. (beeps) - More stuff from Japan I see. - [Ken] My favorite headphone shop, E-earphone. - Oh, headphones, okay. Momo the T-W-S O-2-R, so these are fully wireless headphones? - [Ken] Yes. - [Austin] I can't read that, but it says fingerprint, It's probably unique. - [Ken] The cool thing is actually, this part right here, which you probably can't read anyway. - 2000 milliamp hours, Oh, It's like the actual charger itself, like you put the headphones in the little carrying case that has a battery bank inside? - [Ken] Yes, and yeah you can actually charge your phone with it too. - Okay, that seems pretty clever. So, (clears throat) - [Matt] That is the third episode that you've Linused something. - So, these look to be fairly okay looking, look at this awesome podcast I found, it's called \"The Test Drivers\", if you haven't heard of it, it's hosted by this really cool guy named Austin, he talks about technology, link's in the description, Just go listen to it, make sure the headphones sound great, of course. (The Test Drivers theme song) What a great theme song this podcast that I have no affiliation to whatsoever has. (upbeat music) (murmurs) - [Austin] If you're interested in a pair of fully wireless earbuds, while they don't sound incredible, it does have a nice punchy sound, and I feel like, for the money, you could do a lot worse, now, is it as nice as something like, you know, a pair of AirPods or Galaxy Buds? No, I would say its a punchier sound, but it's not quite as neutral as a sound, we're also considering that this is less than half the price, and you get the added benefit of a battery bank built in, plus it's nice and magnetized, That's pretty cool. (upbeat music) Did you just buy everything from Mystery Tech from Japan? - [Ken] No, that's Chinese. - [Matt] Wow. - [Ken] Racist Austin Evans. - Look, I'm gonna open this thing. 20th anniversary Yeston Graphics Card. (box drops) You did not just buy a graphics card. - [Ken] That's the graphics card. - What is this then? - [Ken] It came with a gift box. - [Austin] Yeston 20th anniversary Radeon RX 5700 XT, Is this like some weird Chinese 5700 XT, except it's got some anime chick on it? - [Ken] Yes, that is the brand mascot for Yeston. - This is the brand mascot? - [Ken] Yes, apparently. - Wait, I've never seen this before, Ken, where did you get this? - [Ken] One of my friends imported it from China. - How much was a 5700 XT imported from China? - [Ken] $600. Remember when you lost that other round of vintage tech? - [Austin] Of course it is, Of course, ah, what? What? What are you doing? What is this? It looks like a Barbie graphics card, look at the back, do you see this? It's literally just clear plastic. Aw, aw, what are you doing? It's probably going to be like some stand for it or whatever, isn't there? Okay, well that's just a lot of things, that's a lot of things. So we have the mascot stickers? - [Ken] You can put those on your computer. - I'm not gonna do that. We also have a key chain. - [Ken] You can put that by your computer. - Uh, we have a-- let me guess, mousepad? - [Ken] You can use that with your computer. (Ken laughing) Oh, oh, (laughing) - [Matt] Put it on. (laughing) (soft music) - [Matt] You look great, you look great. - [Ken] Yeah, that's the word I was looking for. So now there's the next step of, We have to put that in a PC, right? - Sure, lets build a PC, why not? - [Ken] I have one already, I already built one. - You built a PC, specifically for... - (laughing) - [Matt] Um, did I say you could take that off? - Am I better now? Did I get it all? - [Matt] You disappoint me. - Be right back. (soft music) - [Matt] It's like helping an old man down the, across the road, Come on, Come on. - [Austin] I don't know why I need the blindfold. (mumbling) Why? - [Matt] That's just fun for me. - [Austin] Okay, all right, so, can I look now? (upbeat music) What? Is that a screen built into the side of this PC? - [Ken] It is, it's transparent. - How much money did you spend on all of this? What is inside here? You've got the G-Skill with the RGB ram? - [Ken] Yeah. You've got an RGB cooler? - [Ken] Yes. - [Austin] What are you doing? Also, this is really cool, what is this case? - [Ken] It is the iBUYPOWER Snowblind case that they did with NZXT. - [Austin] So, I'm impressed when the screen goes black, I can't see inside, like it's fully opaque, how much is this case, with the screen inside? - [Ken] So the case is $300, - (exhales) Okay, so the case is $300. I'm just going to take a wild guess and say that this entire setup is about to go home with you. - [Ken] Um, the case and the graphics card, everything else can stay. - Cause you already have better components you've stolen from the office? - [Ken] You gave them to me. - [Austin] Ok I did give you some things... This is very cool. (upbeat music) It's so bright, it's so bright in here. So since you can't see the screen from this side, as soon as you close it you can see it. - [Ken] Yes - That is really cool. - [Ken] It's clever. - [Austin] This is very cool, I don't think its particularly practical, it's still a very expensive case, but if you want something different, this is way, way better than I thought it would be, good job, Ken. - [Ken] Thank you. Thank you very much for watching, if you would like to help support us when we inevitably do get canceled from YouTube, definitely be sure to go check out the Test Drivers podcast, available at the link in the description, Until next time, I need to wipe the lipstick off my mouth, don't I? I didn't get all that off, I just saw that in the monitor. (soft music)",
    "transcript_keywords": [
        "Mystery Tech",
        "Tech",
        "put",
        "Mystery",
        "toilet",
        "cool",
        "Yeah",
        "Wait",
        "Toto",
        "case",
        "things",
        "thing",
        "Graphics Card",
        "Toto museum",
        "Ken",
        "Flip",
        "sound",
        "phone",
        "Austin Evans",
        "Alright"
    ],
    "transcript_entity_values": [
        "Toto Washlet",
        "over $120",
        "Radeon RX 5700 XT",
        "Yeston",
        "600",
        "the Blaster Scooter",
        "NZXT",
        "70 bucks",
        "third",
        "three",
        "Austin Evans",
        "AirPods or Galaxy Buds",
        "Chinese",
        "Simbas",
        "Amazon",
        "China",
        "Simba",
        "bixby",
        "Ken",
        "Austin",
        "The Test Drivers",
        "Nerf",
        "20th",
        "RGB",
        "two",
        "300",
        "Matt",
        "XT",
        "this week",
        "Snowblind",
        "12",
        "Japan",
        "about $30",
        "second",
        "YouTube",
        "Momo",
        "Lion King",
        "Test Drivers",
        "5700",
        "less than half",
        "Yeston Graphics Card",
        "Toto",
        "Barbie",
        "Linused",
        "Mystery Tech",
        "80 bucks",
        "100",
        "Roblox oof",
        "Toto",
        "today",
        "the Toto Museum"
    ],
    "transcript_entity_types": [
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "NORP",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "MONEY",
        "ORDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.05564313009381294,
        -0.026795901358127594,
        0.062022242695093155,
        -0.07347874343395233,
        -0.02522362768650055,
        0.01294651534408331,
        0.13108861446380615,
        0.011890089139342308,
        0.0140012726187706,
        -0.07888314872980118,
        -0.01467315573245287,
        -0.06510750949382782,
        0.010478585958480835,
        -0.04545764625072479,
        -0.02431076020002365,
        -0.038650065660476685,
        0.058864351361989975,
        -0.029480677098035812,
        -0.016060439869761467,
        -0.00021083901810925454,
        -0.011038322933018208,
        0.07345662266016006,
        0.0036888993345201015,
        -0.034910283982753754,
        0.03702368959784508,
        0.07614640891551971,
        -0.07133007794618607,
        -0.029665987938642502,
        -0.008337537758052349,
        -0.08860679715871811,
        -0.02286347933113575,
        0.06281330436468124,
        -0.005582352634519339,
        -0.05618380755186081,
        -0.03734641149640083,
        -0.019183700904250145,
        -0.03998468816280365,
        -0.012571440078318119,
        -0.058038074523210526,
        0.00500709842890501,
        -0.011878659948706627,
        0.008475510403513908,
        0.054781727492809296,
        -0.03632807359099388,
        -0.08719484508037567,
        -0.025621037930250168,
        -0.008752260357141495,
        -0.08887462317943573,
        -0.022511351853609085,
        -0.005695610772818327,
        -0.06647967547178268,
        -0.07861160486936569,
        0.032399941235780716,
        0.04202082008123398,
        -0.04331918805837631,
        -0.020854488015174866,
        0.08982229232788086,
        0.08870729804039001,
        0.06714777648448944,
        0.018429504707455635,
        0.04739353805780411,
        -0.019208312034606934,
        0.028416240587830544,
        0.06441359221935272,
        0.05199901759624481,
        0.012101645581424236,
        0.019508549943566322,
        0.03516221046447754,
        0.0372990183532238,
        0.0014455992495641112,
        -0.054702211171388626,
        0.00962516013532877,
        0.037115346640348434,
        0.04127896949648857,
        0.07318241894245148,
        0.10826792567968369,
        0.037099771201610565,
        -0.023081554099917412,
        -0.04317080229520798,
        0.04678148403763771,
        0.039684541523456573,
        -0.044674720615148544,
        -0.06065753102302551,
        -0.07910206913948059,
        0.041229985654354095,
        0.05711071938276291,
        -0.0032745518255978823,
        0.0013989520957693458,
        -0.010336415842175484,
        -0.0387551449239254,
        -0.06296484172344208,
        0.042575404047966,
        0.04799013212323189,
        0.043498918414115906,
        0.06543787568807602,
        0.02535286173224449,
        -0.059767886996269226,
        -0.040831852704286575,
        -0.10316336899995804,
        0.08087660372257233,
        0.006056190934032202,
        -0.004872445482760668,
        0.017538893967866898,
        0.027811609208583832,
        -0.02417377568781376,
        -0.07805167138576508,
        -0.0918046310544014,
        -0.02595733292400837,
        0.08452232927083969,
        -0.02860894799232483,
        0.011385656893253326,
        -0.04439928010106087,
        0.026408175006508827,
        -0.04019448533654213,
        0.07910718023777008,
        0.07005318254232407,
        -0.060602765530347824,
        0.07374174147844315,
        0.0009977787267416716,
        0.028050720691680908,
        0.0723174437880516,
        -0.0058549134992063046,
        -0.07200127840042114,
        -0.025893697515130043,
        0.10289274901151657,
        -0.012645741924643517,
        -0.09336993098258972,
        -2.9428337605652807e-33,
        0.07984155416488647,
        0.05407124385237694,
        0.035003893077373505,
        0.04183182492852211,
        0.11186355352401733,
        -0.13304956257343292,
        -0.08108700811862946,
        0.017716286703944206,
        -0.02257148176431656,
        0.07721532881259918,
        -0.037283752113580704,
        0.06809847056865692,
        -0.024060692638158798,
        0.016619868576526642,
        0.014196132309734821,
        -0.03365028649568558,
        -0.0664900690317154,
        -0.028756670653820038,
        0.03990273177623749,
        -0.05744870379567146,
        0.030040385201573372,
        -0.023479904979467392,
        -0.06055406108498573,
        -0.0016244043363258243,
        0.05374384671449661,
        0.01715652458369732,
        0.023074578493833542,
        -0.01619369350373745,
        0.056213606148958206,
        0.006617940030992031,
        -0.1877497285604477,
        0.0013112302403897047,
        -0.009438611567020416,
        -0.023903371766209602,
        0.022453591227531433,
        -0.02148512564599514,
        -0.028903141617774963,
        -0.05541645362973213,
        -0.021202754229307175,
        -0.041421808302402496,
        -0.025110021233558655,
        0.007618002127856016,
        -0.10389801859855652,
        0.006541152484714985,
        0.04136249050498009,
        -0.05178839713335037,
        0.01815754733979702,
        -0.00837952084839344,
        0.025559399276971817,
        -0.0463569201529026,
        -0.0027662189677357674,
        -0.004865937400609255,
        0.057118069380521774,
        0.013139952905476093,
        0.03877563402056694,
        -0.022742148488759995,
        0.031156620010733604,
        -0.02788533829152584,
        0.022711485624313354,
        0.06023434177041054,
        0.06685031950473785,
        0.046695925295352936,
        0.025036685168743134,
        0.02366899698972702,
        -0.06366069614887238,
        0.024718577042222023,
        0.024484677240252495,
        -0.05198955535888672,
        0.056153472512960434,
        -0.015543107874691486,
        -0.06340543180704117,
        0.0001251325011253357,
        0.015847913920879364,
        -0.0492357462644577,
        -0.014656511135399342,
        0.024896830320358276,
        -0.06167077645659447,
        -0.03912881389260292,
        -0.034405287355184555,
        -0.039874523878097534,
        0.00035881693474948406,
        -0.022128377109766006,
        -0.05678277462720871,
        0.0156495850533247,
        -0.026934456080198288,
        -0.040466077625751495,
        0.027086496353149414,
        -0.1458689421415329,
        -0.013175470754504204,
        0.03809506818652153,
        -0.09810078144073486,
        -0.00580134242773056,
        0.033937007188797,
        0.06819454580545425,
        -0.019127467647194862,
        4.541382375270267e-34,
        -0.03245200961828232,
        -0.011791182681918144,
        -0.019516680389642715,
        0.021230585873126984,
        0.055236391723155975,
        -0.02511797659099102,
        0.05899408087134361,
        0.056518323719501495,
        0.020489826798439026,
        8.547162906324957e-06,
        -0.003430740674957633,
        0.02924197167158127,
        -0.02271910384297371,
        -0.0502847358584404,
        -0.005882684141397476,
        -0.06466644257307053,
        -0.02946912869811058,
        0.00035834204754792154,
        0.025103241205215454,
        0.03713149577379227,
        0.005398821085691452,
        0.02460448630154133,
        -0.018779555335640907,
        0.02889799326658249,
        -0.014094792306423187,
        0.040533870458602905,
        0.0589078888297081,
        0.05651288852095604,
        -0.00913847517222166,
        0.03589654713869095,
        0.029720716178417206,
        -0.06545564532279968,
        -0.0653982013463974,
        -0.06895675510168076,
        -0.001997303916141391,
        0.07639794051647186,
        0.04972764104604721,
        -0.05508444458246231,
        0.02280827797949314,
        -0.15400928258895874,
        -0.02028241567313671,
        0.03948808088898659,
        0.06198197603225708,
        0.05963902920484543,
        0.020374910905957222,
        -0.020412912592291832,
        -0.0007546014385297894,
        0.07227158546447754,
        -0.07393792271614075,
        -0.016186418011784554,
        0.13140961527824402,
        -0.02146913670003414,
        0.02911342680454254,
        -0.06125236302614212,
        -0.047402914613485336,
        0.04455441236495972,
        0.009914166294038296,
        -0.07242428511381149,
        -0.024203365668654442,
        0.039695534855127335,
        0.029241438955068588,
        0.0061929295770823956,
        -0.06289561837911606,
        -0.00400265958160162,
        -0.03857974335551262,
        0.039987869560718536,
        0.05438704788684845,
        0.06135791540145874,
        0.02982647716999054,
        0.038346804678440094,
        -0.007879202254116535,
        0.05639597773551941,
        -0.02843375876545906,
        -0.015964964404702187,
        0.02709418535232544,
        0.025663716718554497,
        -0.028003090992569923,
        -0.04477664455771446,
        -0.02104942500591278,
        -0.03573305532336235,
        -0.0034743230789899826,
        0.020378177985548973,
        0.045724719762802124,
        -0.03528853878378868,
        0.053437575697898865,
        0.06291712820529938,
        0.03160771355032921,
        0.09130072593688965,
        -0.018159104511141777,
        0.055749502032995224,
        0.032413050532341,
        0.02164512127637863,
        0.014034030959010124,
        0.016586527228355408,
        0.06621246039867401,
        -6.510656191949238e-08,
        0.03423551470041275,
        0.05986206233501434,
        -0.015193629078567028,
        -0.07978028804063797,
        0.0052115898579359055,
        -0.025736374780535698,
        0.03113562986254692,
        -0.07191219180822372,
        0.02751091867685318,
        -0.03043517842888832,
        0.027905942872166634,
        -0.10039136558771133,
        -0.009601663798093796,
        0.09011422097682953,
        0.035543590784072876,
        0.07948217540979385,
        -0.0910043865442276,
        0.07191824167966843,
        -0.09190607815980911,
        -0.11473074555397034,
        0.004670725204050541,
        0.01893755979835987,
        0.032740216702222824,
        -0.0781758576631546,
        0.029564011842012405,
        -0.043671660125255585,
        0.03990692272782326,
        -0.012509939260780811,
        -0.014287933707237244,
        0.07890252023935318,
        -0.09171900153160095,
        -0.005967027507722378,
        -0.05881950631737709,
        -0.029018795117735863,
        -0.04141872376203537,
        -0.026173731312155724,
        0.05127174034714699,
        -0.07641911506652832,
        0.00588987534865737,
        0.01486683264374733,
        -0.04648452252149582,
        -0.02760292962193489,
        0.05730356648564339,
        0.020736493170261383,
        -0.1479533314704895,
        -0.10219938308000565,
        0.03925153613090515,
        -0.11423376202583313,
        0.02782455086708069,
        0.03259088471531868,
        0.0325603261590004,
        -0.03729379549622536,
        -0.027592865750193596,
        0.025292236357927322,
        0.12620098888874054,
        0.04832504689693451,
        -0.053569354116916656,
        0.07014667987823486,
        -0.11062511801719666,
        0.05685572698712349,
        0.0426679402589798,
        0.05489026755094528,
        0.01572425849735737,
        -0.0018865824677050114
    ]
}