{
    "id": "OjaE2g4VOXI",
    "title": "Nvidia was clearly wrong - AMD RX 7900 XT and XTX",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-12-08T14:01:20Z",
    "video_url": "https://www.youtube.com/watch?v=OjaE2g4VOXI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "AMD",
        "RX 7900",
        "XT",
        "XTX",
        "GPU",
        "Graphics card",
        "NVIDIA",
        "4080",
        "2060",
        "upgrade",
        "graphics",
        "PC",
        "gaming",
        "gamer",
        "games",
        "video",
        "steam"
    ],
    "views": 2732188,
    "likes": 80918,
    "comments_count": 4491,
    "description": "Check out Vessi's Holiday Sale at  or use code ShortCircuit at checkout if you just missed it for 15% off plus free shipping to CA, US, AU,JP, TW, KR, SGP via their store online.  AMD's finally here to strike back against NVIDIA's new big and bold (pricey) 4080 with the new RX 7900 XT and XTX. Linus is here to give you a first look at this new GPU that could be the upgrade you've been waiting for.  Check out AMD RX 7900 XTs on Amazon:  Check out AMD RX 7900 XTXs on Amazon:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Lmao 0:59 Unboxing and size comparisons 2:38 Display outputs and power connector 3:58 XT and XTX size comparison 4:22 Sponsor - Vessi Footwear 5:10 How they got BIG performance improvements 7:21 AI enhancement and encoding 8:54 Potential performance difference (kinda) 9:21 Full release date 9:56 Outro",
    "description_links": [
        "http://vessi.com/ShortCIrcuit",
        "https://geni.us/HAJ1",
        "https://geni.us/0W0J3CT",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Nvidia laid down some hard truths on the industry. \"Moore's law is dead,\" they said. \"GPUs just can't get faster and cheaper, the way they used to,\" they said. And then AMD was like, \"Ha ha ha ha, aagh-ha ha ha. Oh, that's stupid. Here's faster GPUs, for cheaper than the last generation. (beep) Got 'em.\" Introducing the Radeon RX 7900 XT and XTX. I wanna make this very clear. These are not exactly value GPUs. They're still coming in at 900 and a thousand US dollars for the XT and the XTX respectively, but they are significantly less expensive FPS per dollar, if AMD is to be believed, than Team Green. And they are a hundred dollars less expensive each than the last generation top and almost top cards from the 6000 series. So let's go ahead and take a closer look at these bad boys. It gets even better as we go. Not only are these cards delivering up to, in the range of 70% better performance than last time around, but look at this. They come in downright, if you can get them outta damn box. They come in downright reasonable form factors. Wait, is this, no, this is only the XT. This is only the XT. Maybe the XTX is an absolute changus monster, but this is totally fine. Here, hold on a second. Hold on a second. I'm gonna tell you more about it in a minute, but first, let's pull out an RTX 4080 for comparison. What the heck? I think it's fair to say that the 7900 XT has more in common physically with an RTX 2060 card than the 4080. Look at that, is that wild or what? How did they do that? Well, for one thing, it's rumored that the RTX 4080 and 4090 were supposed to be even power hungrier than they ended up being, which might be why the coolers for them are so overbuilt for their final TDPs. The other reason is that, as I just alluded to, AMD's power consumption for these cards is, to be clear, very high at 300 and 355 watts for the XT and the XTX respectively, but that's still within the range of what you can do in a dual slot. Ooh, not quite dual slot. Almost dual slot, but only full height card design. That's one of the really big ones. How much taller cards have gotten over the last little while, especially if you wanna build a small form factor machine or something like that, you've really run out of high performance options. Another thing, aside from performance, that we can talk about here is the display outputs. We've got HDMI, DisplayPort, other more different DisplayPort, and USB Type-C, on the AMD reference cards. But the coolest thing about this is that these DisplayPort ports are the new UHBR 10, DisplayPort 2.1 standard. In practice, that may not end up meaning that much because, while AMD does advertise these cards as capable of high refresh rate 4K, and even 8K gaming, even AMD's most optimistic advertised numbers here are nowhere near what UHBR 10 can do. We're talking 4K at 480 Hertz and 8K at 165 Hertz. Ugh, I mean, it's worth a try, but I don't think that's gonna happen. While we're going over the physical attributes of the cards, power, look at that. No controversial 12-pin power connector, dual 8-pin PCIe power connector. So you won't need an adapter or to change out the cables on your modular power supply. AMD, like Nvidia, has opted for a PCI Express Gen 4 x16 connector. So if you were hoping to take advantage of your PCIe Gen 5 motherboard in some way, it will be through storage, not through your GPU. Oh, and I admit that having not actually paid that close attention to the presentations, because other people were working on the coverage. I do not know if the XTX is physically different or not. Is it a little taller? - It's a little bit, I think. - It's a little taller. It's a taller boy. If you wanted to know what 55 watts looks like, like that, not that much more. This unboxing is brought to you guys by Vessi Footwear. That's right. When you get your Vessi Footwear, it'll be a lot newer and cleaner than this. Ah, these are old, but that's good. That's good. That means they last, the Christmas season is upon us, which means that it's a great time to stay warm and dry. Vessi boasts that their sneakers are lightweight, easy to pack, and feature waterproof materials that offer you reassurance when the weather can't. Their Dyma-Tex layer will keep you warm in the winter and cool in the summer. They're comfy, breathable. And did I mention already that they're lightweight? Making Vessi the perfect gift for yourself or for someone else. Check out their holiday sale at vessi.com/shortcircuit, or use code shortcircuit at checkout if you just missed it, for 15% off, plus free shipping to select countries. Aside from their performance claims though, one of AMD's biggest marketing points for the 7000 series is the improvements to performance per watt that they've made with RDNA 3. And they've done this in a number of kind of cool ways. So first of all, they're using a combination of TSMC'S 5-nanometer and 6-nanometer processes to build the first ever chiplet GPU. There are some functions that they can't move off of the main dye like compute hardware, graphics hardware, and display and media engines. That main dye is built on TSMC'S 5-nanometer process so they can pack as much as possible in, and they really did. I mean, this thing's got literally twice as many stream processors as AMD's previous flagship card. But they were able to move their GDDR6 controllers and other IO functions onto these either five for the XT or six MCDs or memory cache dies. And the reasons for this are twofold. One is to save cost, and two is to, well, mostly save cost, because apparently these functions don't really shrink that well. So it just wasn't worth it from a cost perspective. So that's the main reason, I guess. Either way, the bandwidth between the GCDs, that's the main one, and the MCDs is a whopping, what is this? 5.3 terabytes a second. So that's 900 gigs a second per MCD. Absolutely flippin' wild. One of the other big innovations that AMD has introduced to improve performance per watt is decoupled clock speeds. So they are apparently running the shaders and the front end on these GPUs at different speeds. So the shaders are advertised at a game clock of 2.3 gigahertz while the front end is expected to hit in the neighborhood of 2.5. Is that for both cards or are those clocks different between the two? Ah, yes, that's for the XTX. So the XT is in the 2 to 2.4 gigahertz range. The reason for doing this is apparently that by backing off even just part of the card, a little bit off of that voltage per frequency curve, you can save a ton of power without giving up too much in terms of performance. AMD has also added dedicated AI accelerators to these cards. So we're looking at two AI accelerators per compute unit, but what exactly they're going to be using these for is not clear at this time. To date, AMD does not have an AI accelerated DLSS competitor, but I would imagine that something like that wouldn't be too far behind if they're putting the hardware out for them. AMD does have a pretty okay reputation for, well, hmm. There's sort of two ways to look at this, not having fully developed drivers at launch or, or, or glass-half-full way of looking at it, really squeezing extra out of their cards over their lifespan. So it's quite possible that we will see big improvements to these cards through AI accelerated rendering tricks over the next few years. One thing they're using AI for right out of the gate is apparently to help their encoding and decoding performance. This is something that's been a bit of a thorn in the side of AMD lovers for the last, well, I mean, yeah, many years actually. That NVIDIA's NVENC encoding engine is just a lot better for things like game streaming or even just screen capping, so that you can share a quick tutorial with your friends. I'm really hoping that AMD's H.264 and H.265 are going to be much better performance than before. And more than that, I'm hoping that I don't have to worry about H.264 and H.265 for much longer, because AV1 will just take over and be the industry standard. And AMD's AV1 encoder will be great, and that's what I'm really rooting for here. The XT has 20 gigabytes of GDDR6, while the XTX has 24 gigabytes of GDDR6. And we're expecting a performance delta between the two of them of somewhere in the neighborhood of, wait, is AMD even talking about that yet? Damn it, AMD. The XT's gonna be slower though. I mean, look at it, it's smaller. If the volume is anything to go by, mm, probably be about say 20% slower, not how that works by the way. I think the last big thing you guys need to know is that these cards are coming December 13th. And we are expecting to have a full performance review with power consumption, clock speeds, FPS, all that good stuff, up at that time. So that you guys will know, has AMD dethroned Nvidia or not? Well, we all know the answer to that. Even AMD is not comparing these cards to the 4090, but come on, that's a $1,600 card. Who cares? If you could have for like 4080 performance for 900 or $1,000 instead of $1,200? Whew, I think you'd be, maybe not happy, but you'll take it. Just like you'll take the end of this video. Subscribe to Short Circuit.",
    "transcript_keywords": [
        "AMD",
        "cards",
        "performance",
        "XTX",
        "power",
        "card",
        "hard truths",
        "AMD reference cards",
        "thing",
        "AMD power",
        "GPUs",
        "AMD power consumption",
        "Vessi",
        "Vessi Footwear",
        "Nvidia",
        "Moore law",
        "RTX",
        "Nvidia laid",
        "AMD dethroned Nvidia",
        "dual"
    ],
    "transcript_entity_values": [
        "Moore",
        "4",
        "8",
        "20%",
        "NVIDIA",
        "December 13th",
        "900 and a thousand US dollars",
        "2.4 gigahertz",
        "10",
        "DisplayPort",
        "AMD",
        "MCD",
        "Nvidia",
        "XTX",
        "4080",
        "2.5",
        "Team Green",
        "6-nanometer",
        "DLSS",
        "Short Circuit",
        "355 watts",
        "2",
        "480",
        "a minute",
        "GDDR6",
        "70%",
        "FPS",
        "5-nanometer",
        "Hertz",
        "a ton",
        "the 7900 XT",
        "6000",
        "NVENC",
        "Hertz",
        "the Christmas season",
        "first",
        "AMD",
        "two",
        "mm",
        "20 gigabytes",
        "GPU",
        "2.3 gigahertz",
        "USB Type-C",
        "2.1",
        "7900 XT",
        "one",
        "the summer",
        "Vessi Footwear",
        "165",
        "1,200",
        "second",
        "5-nanometer",
        "2060",
        "300",
        "5.3 terabytes",
        "XT",
        "Radeon",
        "55 watts",
        "12",
        "six",
        "1,600",
        "five",
        "4090",
        "3",
        "One",
        "UHBR",
        "TSMC",
        "7000",
        "AI",
        "900 or $1,000",
        "a hundred dollars",
        "IO",
        "XT",
        "the next few years",
        "15%",
        "PCI Express Gen 4",
        "Vessi",
        "24 gigabytes"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "GPE",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "ORG",
        "PERSON",
        "QUANTITY"
    ],
    "vector": [
        0.04672032594680786,
        -0.026047419756650925,
        0.052665263414382935,
        0.024717163294553757,
        0.11063239723443985,
        -0.011036451905965805,
        -0.06119237840175629,
        0.030348187312483788,
        -0.022868430241942406,
        -0.004529289435595274,
        -0.037653565406799316,
        -0.012377818115055561,
        -0.004107290878891945,
        0.015533607453107834,
        0.05698674917221069,
        0.0018872893415391445,
        0.0322430320084095,
        -0.0962786003947258,
        -0.06029568612575531,
        0.038423262536525726,
        -0.012061617337167263,
        -0.012754589319229126,
        -0.029149532318115234,
        -0.00022320084099192172,
        0.06575024127960205,
        0.06882727891206741,
        0.06566929817199707,
        -0.13862344622612,
        -0.0001485438842792064,
        -0.007103770971298218,
        0.007533330470323563,
        0.05143829807639122,
        0.03071628510951996,
        -0.008983497507870197,
        -0.025766685605049133,
        -0.003206767840310931,
        0.04050017520785332,
        -0.09006147086620331,
        -0.025179242715239525,
        0.01281646452844143,
        -0.015726564452052116,
        0.004510304890573025,
        -0.020449884235858917,
        0.03423810377717018,
        -0.041769277304410934,
        -0.06702440977096558,
        0.07663897424936295,
        -0.050986941903829575,
        -0.0040731849148869514,
        -0.0009671173756942153,
        0.030422912910580635,
        -0.006778534967452288,
        -0.029289938509464264,
        -0.038219284266233444,
        -0.08792177587747574,
        0.04127136245369911,
        -0.04309948533773422,
        -0.09707003086805344,
        0.032677214592695236,
        -0.05057830363512039,
        0.04000524431467056,
        -0.07979012280702591,
        0.10242302715778351,
        0.004560693632811308,
        -0.0026801691856235266,
        -0.03890107944607735,
        -0.06357831507921219,
        -0.0474587045609951,
        -0.017711985856294632,
        -0.028047922998666763,
        0.012350349687039852,
        0.08908893913030624,
        -0.029712963849306107,
        -0.008658967912197113,
        0.026016544550657272,
        0.037491921335458755,
        0.08970608562231064,
        -0.0435153990983963,
        0.047548484057188034,
        0.028081493452191353,
        0.008043183013796806,
        -0.07238662987947464,
        -0.0006651259609498084,
        -0.04221416264772415,
        0.05955500900745392,
        0.003238286357372999,
        0.08323188126087189,
        -0.006491697393357754,
        -0.0005193988909013569,
        -0.0797492191195488,
        -0.011440878733992577,
        -0.01453390996903181,
        0.07677716761827469,
        0.02798679657280445,
        0.026627272367477417,
        -0.056910064071416855,
        -0.04851020500063896,
        -0.03334581479430199,
        -0.043380964547395706,
        0.041632119566202164,
        0.034910134971141815,
        0.021136276423931122,
        0.03851770609617233,
        0.06843139976263046,
        -0.05212756618857384,
        -0.0038809028919786215,
        -0.038876526057720184,
        0.04925168678164482,
        -0.0855584442615509,
        -0.03333061933517456,
        -0.026559341698884964,
        0.06518450379371643,
        -0.028139522299170494,
        0.011701217852532864,
        -0.06533556431531906,
        0.012872502207756042,
        -0.059982042759656906,
        -0.09318923950195312,
        0.0007286948384717107,
        0.025428935885429382,
        -0.027648618444800377,
        -0.076054148375988,
        -0.023006923496723175,
        0.002705270890146494,
        0.038958217948675156,
        0.056436847895383835,
        -0.03131065517663956,
        1.1573436894880344e-32,
        -0.0528901144862175,
        0.07785972952842712,
        -0.043244533240795135,
        -0.07353029400110245,
        0.012286228127777576,
        0.056647442281246185,
        0.01908397302031517,
        0.024773603305220604,
        0.017836665734648705,
        0.017603851854801178,
        -0.06105289235711098,
        0.022735023871064186,
        -0.044115547090768814,
        0.04635448008775711,
        -0.0416812002658844,
        -0.09468943625688553,
        0.004765703808516264,
        0.03029044345021248,
        0.006315210368484259,
        0.09131615608930588,
        0.04826309159398079,
        0.08518319576978683,
        0.02922961674630642,
        -0.024809643626213074,
        -0.023424364626407623,
        -0.04423470050096512,
        -0.023992417380213737,
        0.014268901199102402,
        -0.013873222284018993,
        -0.027405191212892532,
        0.02734948694705963,
        -0.06094084307551384,
        0.05014607310295105,
        -0.0029437425546348095,
        -0.055272914469242096,
        0.007936429232358932,
        0.0055413683876395226,
        -0.0841473862528801,
        0.005337654612958431,
        0.006060223560780287,
        -0.040623221546411514,
        0.06256256997585297,
        -0.014811225235462189,
        -0.12104775756597519,
        0.02054698020219803,
        0.09771735966205597,
        -0.05579656362533569,
        -0.015564373694360256,
        -0.01576887257397175,
        0.009560010395944118,
        -0.018339475616812706,
        0.09648942947387695,
        -0.07667990028858185,
        0.0172350462526083,
        -0.029286818578839302,
        -0.08815973252058029,
        0.023278968408703804,
        0.06613161414861679,
        0.0641179010272026,
        0.09636324644088745,
        0.013731356710195541,
        -0.05550285428762436,
        -0.043653398752212524,
        -0.06974320858716965,
        -0.07655834406614304,
        0.02370273321866989,
        0.05593664571642876,
        0.005341637413948774,
        -0.07441054284572601,
        0.01450749859213829,
        0.0031709340400993824,
        0.006949536502361298,
        0.05436837673187256,
        -0.007726660463958979,
        0.1299925148487091,
        -0.003603119170293212,
        -0.07499148696660995,
        0.00017060367099475116,
        0.08329635858535767,
        -0.03942624479532242,
        0.04353293776512146,
        0.05391155928373337,
        0.047078102827072144,
        0.008205194026231766,
        0.0074639772064983845,
        -0.032744262367486954,
        -0.05778110772371292,
        0.056680332869291306,
        -0.03749171644449234,
        0.030369827523827553,
        -0.03561042249202728,
        -0.02313464879989624,
        -0.026343680918216705,
        0.052259430289268494,
        0.053325675427913666,
        -1.0093099390007405e-32,
        -0.004944392945617437,
        -0.050318408757448196,
        -0.018121596425771713,
        0.04884542524814606,
        0.033396873623132706,
        -0.01234598271548748,
        0.009638567455112934,
        0.03646448999643326,
        -0.00508955167606473,
        -0.13959050178527832,
        0.06364553421735764,
        0.030397143214941025,
        -0.0002775102620944381,
        0.02494952827692032,
        -0.01667574979364872,
        -0.07564859837293625,
        0.02374277263879776,
        -0.04740437865257263,
        0.011606594547629356,
        -0.031415797770023346,
        0.04847186803817749,
        0.06851540505886078,
        -0.03736508637666702,
        -0.012835117056965828,
        -0.0040611461736261845,
        -0.00770086795091629,
        0.04425113648176193,
        0.02203189767897129,
        0.03025333397090435,
        -0.017642231658101082,
        -0.06068771705031395,
        0.04673381522297859,
        0.027879612520337105,
        0.055854689329862595,
        0.03045053780078888,
        0.008345149457454681,
        0.07597561180591583,
        0.06554654985666275,
        -0.01545690931379795,
        0.010910797864198685,
        0.0372159481048584,
        0.0029304618947207928,
        0.09196208417415619,
        0.016441989690065384,
        0.02476341836154461,
        0.04104440659284592,
        -0.1107567697763443,
        -0.0532958060503006,
        0.09981554001569748,
        0.04435255005955696,
        -0.059886384755373,
        -0.05463789775967598,
        0.09123500436544418,
        0.003711918368935585,
        -0.017566286027431488,
        -0.07082759588956833,
        -0.06404935568571091,
        0.0440559946000576,
        -0.00905486848205328,
        -0.03963522985577583,
        -0.023401658982038498,
        0.09260371327400208,
        -0.013437986373901367,
        -0.03626527637243271,
        0.03855588659644127,
        -0.0677454024553299,
        -0.0018793689087033272,
        0.018334176391363144,
        0.04529948532581329,
        0.031676001846790314,
        -0.10921922326087952,
        -0.02213727869093418,
        -0.05382772535085678,
        -0.0419948510825634,
        0.009642450138926506,
        0.013090956024825573,
        -0.007423628121614456,
        -0.0016310455976054072,
        0.1086120679974556,
        -0.04413159191608429,
        0.020361440256237984,
        -0.0724717378616333,
        0.048206817358732224,
        0.017744405195116997,
        0.10262744128704071,
        0.039833396673202515,
        0.090001679956913,
        -0.08238536864519119,
        0.039317939430475235,
        -0.04195491597056389,
        -0.07808689028024673,
        0.008246068842709064,
        -0.042784612625837326,
        0.016736134886741638,
        0.03063996136188507,
        -6.021184617566178e-08,
        -0.016082635149359703,
        -0.06364872306585312,
        -0.028899291530251503,
        0.08769761025905609,
        0.09599323570728302,
        -0.07130507379770279,
        -0.037931736558675766,
        -0.02140725590288639,
        0.031771108508110046,
        -0.018470242619514465,
        0.004972896538674831,
        -0.05205492675304413,
        0.026169046759605408,
        -0.051439009606838226,
        -0.010998735204339027,
        -0.08123495429754257,
        -0.07606440782546997,
        0.02662932500243187,
        0.05355348438024521,
        -0.07964325696229935,
        -0.09962252527475357,
        0.049907173961400986,
        0.12278664857149124,
        -0.005711643025279045,
        0.0025819793809205294,
        0.0020707270596176386,
        0.05963505432009697,
        -0.009856180287897587,
        0.11925345659255981,
        -0.04943716153502464,
        -0.05960491672158241,
        -0.030006926506757736,
        0.0032464966643601656,
        -0.022366313263773918,
        0.047657329589128494,
        -0.06698215007781982,
        0.006649380549788475,
        0.10386288911104202,
        0.1459369957447052,
        0.012340079993009567,
        0.014646639116108418,
        -0.0020657505374401808,
        -0.004502133000642061,
        -0.021400442346930504,
        0.04591864347457886,
        0.031497374176979065,
        -0.011838294565677643,
        -0.043063826858997345,
        -0.010970255360007286,
        -0.04776129126548767,
        0.025173012167215347,
        0.02665318176150322,
        -0.09739484637975693,
        -0.016365770250558853,
        -0.02321692369878292,
        -0.04594257473945618,
        -0.11261623352766037,
        0.10443654656410217,
        -0.004579960834234953,
        0.0676918625831604,
        -0.009131933562457561,
        -0.11890999227762222,
        -0.08435171097517014,
        0.03880182281136513
    ]
}