{
    "id": "OjYOAxCuuyc",
    "title": "Mac Pro Review! IT'S SO FAST!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-12-29T16:28:37Z",
    "video_url": "https://www.youtube.com/watch?v=OjYOAxCuuyc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Mac Pro review",
        "Mac Pro",
        "Pro Display XDR"
    ],
    "views": 493666,
    "likes": 15316,
    "comments_count": 1556,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and we are back with another Mac Pro video. I've been using it for a few weeks now, editing a ton of projects and now I think it's finally time to show you guys some of things that I've been working on. (gentle music) Just a recap, this is the 2.5 gigahertz, the 28 core Mac Pro. Four terabyte solid state drive, 384 gigs of RAM. We also have Dual AMD-Radeon Pro IIs. Obviously, this is a machine that is built for professionals. I'm a professional, but this is like taking it to a whole other level. We're talking people who are editing Star Wars, doing crazy motion capture, doing things that are far beyond making YouTube videos, but I will say, if I were to be doing videos like I had for the unboxing, shooting three 8k Reds, editing a multi-cam timeline, then maybe this would be a machine that I would need on a daily basis. So let me show you guys some of the things that I've been doing to try to push this thing to the limit. The first thing I wanna show you is over here. This is far beyond anything that I would ever be doing with this computer. This is called photogrammetry. Thank you to Alex Lindsay for sending me this project and all of these photos. He took these a few years ago in India and he sent me an email and said, \"Justine, do you really wanna push this Mac Pro to the limit?\" And of course, I was like \"yeah.\" And if anybody is gonna do that, it's definitely gonna be Alex. So we're taking 190 raw images and turning it into a lifelike 3D model and this app that we're using is called Metashape. Now, I dragged all of these in this morning and before I started the project, I had no idea how long this normally takes. Alex said it usually takes about two to three days. I was like, \"What! I thought this was gonna take a few hours and I'd be done by the time I started filming this video.\" But so far, we're making really great progress. So you can see over here, I have everything being monitored. We have all of our cores available. We're also monitoring our CPU, GPU and our memory. And don't forget, I also have Final Cut open over here with a 8k multi-cam edit happening. So there's a lot of stuff that I've been doing all day while this has been running. So the first step in this whole process was to align the photos. Now I thought that I would use the Browse because it would take a lot longer. He also sent JPEGs, but I was like, \"No. If we're gonna do this, we're gonna freaking do it.\" So it finds points of interest on the photos. Sometimes there will be up to 100,000 points per image. That's insane. So it looks for the same details on other images and when it finds them, it correlates those images with those points. And it builds a network between all the images of these pairs and then it uses those points to reverse engineer where the cameras needed to be to shoot these images. This will produce a Point Cloud, which will represent this entire image in 3D. This is a pretty intense process. Next step, we're building the Mesh. So with this, we're gonna be taking those Point Clouds and that's gonna be building actual surfaces so that that could be rendered out in 3D or in AR App. Next, we have Building Textures and I know there was one other step that we also wanted to try out, but I left it out of this one because it was incredibly processor-intensive. So that will be maybe a test that we do down the line, but I just wanted to get this process started. So far, we're halfway done. So I'm gonna let this run and do it's thing, but I'm gonna show you some of the things that I've been working on here that I'm more familiar with that I do on a daily basis. The first thing I wanna show you guys is a little HDR project that I put together. I've still be mostly doing SDR because I've never really had a monitor that was able to show me what true HDR looks like. So now that I have this, I was really excited to test this out. So here's my HDR test clip here. So what I did to do this, if you've never worked with HDR before, there's a ton of really great tutorials that Ripple Training has done, which is what I watched to get these settings. So thank you guys. So I went in and I created a Wide Gamut HDR. I chose Rec. 2020 PQ. You also wanna make sure that the library that you're working with is also set to HDR. You can check that by clicking on modify in your Library Settings. So you'll see, you have two options: Standard and Wide Gamut HDR. So if it's not already set to HDR, you can change it here. There's a few different calibrations that you can set your monitors to. So right now, I have this one set to the 1600 nits and I'm gonna set my second one sort of as my reference monitor. We're gonna set that to the HDR Display Setting. Here's some of the Custom Display Settings that you have right now. Both of these monitors are set to 1600 nits. I'm gonna scroll down here to the HDR Video, so that's gonna be setting this monitor over here to an HDR setting. You'll notice instantly that this screen is much darker. So if you do wanna go in and have a monitor that obviously doesn't show HDR, you can click Show HDR is Tone Mapped. What I'm gonna do is, since this monitor is now calibrated, we're gonna send this over there so you guys can see the difference. It looks amazing, but it's really hard to show you guys if you're not on an HDR monitor. Here in real life, it's a huge difference. It's really wild. We go into Color and Effects, this will show you guys. We can go all the way up to 10k Luminance. Normally, you don't wanna go past 100. So right now, we're kinda pushing it at 400. We can boost this up even more though. Let's bring it back down to where (gentle music) - It can look good. In case you guys forgot, we still do have that photogrammetry project that's still rendering in the background. So this is kinda my first time working with HDR, so if you guys do have any suggestions or any tutorials that you've watched to help you get a better HDR workflow, please leave those in the comments or send me a tweet because this is definitely something that I do wanna get more into. YouTube does support HDR, but sometimes, if you do export the video in HDR, I'm a little unsure how it's gonna process. So for the most part, I've just been sticking with SDR, but I do wanna try to experiment more with this because obviously there are gonna be more HDR televisions out there. So I wanna get prepared. That's on my to-do list for 2020. But next up, I wanna show you another fun little demo that I put together. This now is a test with some 8k Pro-Res 444 footage. I haven't yet added a lot, it's all raw. Apple was claiming that the Mac Pro can do six streams in 8k per res raw. So I thought, \"Let's try it out.\" Here we go, and don't forget, we've got this entire massive project running over here on this side. Here's one stream, two, three, four, five, and that's six. Now none of this is graded yet, so let's just maybe do this while this is all running. Cool, oh that's weird. One, two, three, four, five, six, seven, eight, we have nine. Nine streams running almost perfectly, simultaneously. Do you guys wanna see it again? I do. Let's make it bigger. (upbeat music) I feel like, what is that song that's like, she's beautiful Is that James Blunt? - [Camera Man] I can't remember. - I don't remember either, but that's what should be playing right now if I wouldn't get a copyright strike. But one, two, three, four, five, six streams, running beautifully. And here they are, all lined up to the best of my ability and I thought, let's just add three more and see what happens. This is a test that I was most excited to do because I mostly shoot in 4k. Apple says that you can get 23 streams of 4k Pro-Res Raw and 16 streams of Pro-Res 422. So right now, we have some Pro-Res 422 footage running quite nicely and don't forget, we also have another project that's running in the background. I'm just gonna pop a LUT on this while it's running, see what we can get it. Oh, wow, it magically worked just like that. Now if you think this is exciting, this is something that took me way too long to do. I, by hand, put all of these in. Here's 25 running, almost perfectly. You may notice there's a frame drop here and there, but when I did this initially, I didn't have anything else running in the background. Don't forget, I'm gonna keep reminding you, we have a massive 3D render happening at the same time as all of this. Next, I wanna show you another project that I'm currently working on. It is an unboxing of a 1984 Mac. I bought this thing on eBay, oh my gosh, probably like two years ago at this point. So since we rendered the three AK Reds to do the unboxing of the Mac Pro, which if you haven't seen it, I'll put a link in the description, but this was so fun. So I thought it'd be really great to shoot and edit on the new Mac Pro. So for this project, \"Hey guys, it's Justine and today we're unboxing something in this trash bag that came from eBay over a year ago.\" I didn't transcode any of these files, I just took them basically directly from the Red to my hard drive and put them right into this project, which I definitely don't recommend because working with a transcoded Pro-Res footage is so much easier, but I really wanted to just test this out and see what it could do. I put this all into a multi-cam timeline, all three AK Reds. I just realized that I had this set to Better Quality, which is kind of crazy because I usually edit in Better Performance. How do I break this? I'm trying to break the computer, Tyler! I love editing in the multi-cam timeline. This was something that I learned this year when I was working on my Final Cut tutorial. It has been so life-changing. It is so easy to edit multi-cam clips, which is usually what I'm filming with. We usually have at least two cameras. So here's the project, hopefully I'll have this finished soon. Now I'm gonna turn on my server so I can show you guys some of the stuff that I had been working on. The unboxing that we shot with this Mac Pro, the footage was such high quality that I ran out of storage space on every single thing that I had and the only way that I was able to finish this project was using the Jellyfish server, which it's a little loud. I never thought it was loud until I got the Mac Pro and realized how quiet that thing is. This thing is 75 terabytes and I'm about halfway full. So let's boot this up and I'll show you guys my unboxing project. (computer running) - Do you hear, do you guys hear the difference? It's crazy! Little update here, we have aligned the photos, built the Dense Cloud, and now we're on the third step. We're building the Mesh. So I'm gonna keep letting this run, and then I'm gonna show you guys the unboxing video that I worked on that you've already seen posted here on YouTube. This was quite a process. First of all, I didn't transcode any of the footage into Pro-Res like I should of, but I managed to get it done and honestly, I don't even think some of my other computers would have even been able to handle this at all. This entire Mac Pro project, I was curious to see how big it was: 19.47 terabytes. At this rate, I'm gonna need several Jellyfish servers. I mean this thing, I can store 75 terabytes. This is like three projects. This Mac Pro actually really isn't realistic either, but I am gonna embrace it. (upbeat music) - I'll be doing some follow-up videos here on the Mac Pro, but for now, this is basically what I've been spending most of my time doing, shooting videos about the Mac Pro and then editing them on the Mac Pro. So this was kind of a look at what's been going on the past couple of weeks with it. I'm really excited to see that outcome of this project. I'm not sure if this 3D render is going to be completed by the time I'm done shooting this video, so if it's not, I'm gonna do a little follow-up and I will be posting that outcome right after this. (upbeat music) - [Justine] I did have to fly out for the holidays, so I hadn't been back to my Mac Pro, but I did wanna give you guys a look at this final 3D render because it's pretty incredible. You can see, as we click through here, here's the different steps that we did. We went through the Tie Points, the Depth Maps, the Dense Cloud, and then here is the final 3D Model. This turned out pretty awesome and to think that this would normally take two to three days, whereas my Mac Pro about 20 or so hours and I feel like that's not the most accurate number because I was editing a bunch of 8k projects in Final Cut while this was rendering in the background. So if there's anything else you'd like to see me test out on this Mac Pro, please leave me a comment, send me a tweet, let me know and I will try to test it out on my next video. I have a bunch more videos planned with this thing, but for now, I'm gonna go enjoy the holidays. And when we get back, there will be more Mac Pro goodness. So I'll see you later. (upbeat music)",
    "transcript_keywords": [
        "Mac Pro",
        "HDR",
        "Mac",
        "Pro",
        "Mac Pro project",
        "Mac Pro video",
        "guys",
        "show",
        "show you guys",
        "project",
        "Wide Gamut HDR",
        "show HDR",
        "core Mac Pro",
        "entire Mac Pro",
        "thing",
        "Mac Pro goodness",
        "Gamut HDR",
        "HDR Display Setting",
        "running",
        "video"
    ],
    "transcript_entity_values": [
        "4k",
        "all day",
        "one",
        "Point Clouds",
        "This Mac Pro",
        "YouTube",
        "a few hours",
        "the Dense Cloud",
        "CPU",
        "Tone Mapped",
        "eBay",
        "16",
        "a ton",
        "Nine",
        "Alex",
        "the Tie Points",
        "75 terabytes",
        "five",
        "about two to three days",
        "Color and Effects",
        "six",
        "seven",
        "YouTube",
        "Standard and Wide Gamut",
        "Tyler",
        "first",
        "Ripple Training",
        "Pro-Res",
        "a Point Cloud",
        "nine",
        "the Custom Display Settings",
        "this Mac Pro",
        "19.47 terabytes",
        "2.5 gigahertz",
        "25",
        "Model",
        "Mac",
        "Metashape",
        "SDR",
        "YouTube",
        "James Blunt",
        "the Mac Pro",
        "23",
        "five",
        "RAM",
        "AR App",
        "the HDR Video",
        "eight",
        "India",
        "a few weeks",
        "today",
        "third",
        "the Mac Pro",
        "First",
        "1600",
        "Building Textures",
        "second",
        "two years ago",
        "Justine",
        "this morning",
        "Mac Pro",
        "the Dense Cloud",
        "three",
        "2020",
        "75 terabytes",
        "Four terabyte",
        "LUT",
        "a year ago",
        "Final Cut",
        "the Depth Maps",
        "this year",
        "Better Quality",
        "1984",
        "8k",
        "190",
        "the Mac Pro",
        "400",
        "Jellyfish",
        "Alex Lindsay",
        "GPU",
        "at least two",
        "AK Reds",
        "Apple",
        "Mesh",
        "Reds",
        "two to three days",
        "up to 100,000",
        "Better Performance",
        "Pro-Res Raw",
        "these a few years ago",
        "four",
        "the holidays",
        "daily",
        "28",
        "20 or so hours",
        "two",
        "the past couple of weeks",
        "384",
        "Final Cut",
        "Pro-Res 422",
        "One"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "LAW",
        "GPE",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "EVENT",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "ORDINAL",
        "WORK_OF_ART",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "FAC",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        0.0022085325326770544,
        -0.11211717873811722,
        -0.025583645328879356,
        -0.09297212958335876,
        0.05312849208712578,
        -0.004135181196033955,
        0.025546247139573097,
        0.013455663807690144,
        -0.02994154766201973,
        0.08162163943052292,
        0.05583880841732025,
        -0.006063923239707947,
        -0.039089787751436234,
        -0.016773873940110207,
        0.0010221775155514479,
        0.04234451428055763,
        0.04743058234453201,
        -0.04260046035051346,
        0.004005849827080965,
        0.04635527729988098,
        -0.019232021644711494,
        -0.09575721621513367,
        0.046565476804971695,
        0.009638954885303974,
        -0.002626945497468114,
        0.09425361454486847,
        0.04057827964425087,
        0.02828921005129814,
        -0.0891183391213417,
        -0.05548712983727455,
        -0.05191529542207718,
        -0.007571156602352858,
        0.10424089431762695,
        0.005899220239371061,
        0.0370141975581646,
        -0.06210627034306526,
        0.08589527010917664,
        -0.013670344837009907,
        -0.07202903181314468,
        -0.058749835938215256,
        -0.032307129353284836,
        -0.017973532900214195,
        0.0552731491625309,
        0.019234968349337578,
        -0.026255885139107704,
        -0.09245538711547852,
        0.03430218994617462,
        -0.051680367439985275,
        0.0922967866063118,
        0.06729048490524292,
        -0.06100701913237572,
        -0.04213027283549309,
        0.009898335672914982,
        0.029582662507891655,
        -0.02673361264169216,
        0.056403160095214844,
        -0.08392532914876938,
        -0.039021026343107224,
        0.06366487592458725,
        -0.0419657938182354,
        0.007149787619709969,
        -0.067401222884655,
        0.013080937787890434,
        0.036884989589452744,
        -0.053266849368810654,
        -0.05308854207396507,
        0.0465669147670269,
        0.00825643539428711,
        0.0071863639168441296,
        0.010943015106022358,
        -0.09136740118265152,
        0.06404485553503036,
        0.006574781145900488,
        0.06937561184167862,
        -0.024323679506778717,
        0.01564655266702175,
        0.052470773458480835,
        -0.08822517096996307,
        -0.030886799097061157,
        0.01314481534063816,
        0.016309581696987152,
        -0.02799612656235695,
        -0.0674271509051323,
        -0.01964603178203106,
        0.02091050148010254,
        -0.016524681821465492,
        0.013466065749526024,
        0.008144770748913288,
        -0.04540310800075531,
        -0.015016822144389153,
        -0.059373848140239716,
        0.02171374298632145,
        -0.00916014239192009,
        -0.0366034135222435,
        -0.021133968606591225,
        -0.04736807942390442,
        -0.007243484258651733,
        -0.038312170654535294,
        -0.05081295967102051,
        0.06132808327674866,
        0.009520558640360832,
        -0.041994765400886536,
        0.011737429536879063,
        -0.06607286632061005,
        -0.019808633252978325,
        -0.10877451300621033,
        -0.027214426547288895,
        0.0669858306646347,
        0.007725928444415331,
        0.06589347869157791,
        -0.011834139004349709,
        0.031162669882178307,
        -0.06687741726636887,
        -0.010434846393764019,
        0.012772730551660061,
        0.13819658756256104,
        -0.04778740927577019,
        0.03448650613427162,
        0.038220033049583435,
        0.033767905086278915,
        -0.004544825758785009,
        -0.05270285904407501,
        -0.0049505289644002914,
        0.03595658391714096,
        0.024507274851202965,
        0.03980237990617752,
        -0.018970271572470665,
        1.1926772129638292e-32,
        -0.04089798778295517,
        0.00788560975342989,
        0.01659918762743473,
        0.040978074073791504,
        -0.028469014912843704,
        -0.0889836773276329,
        0.012082879431545734,
        0.08554817736148834,
        -0.04211684688925743,
        0.02485656924545765,
        -0.0368213951587677,
        0.004290686454623938,
        -0.07494762539863586,
        0.061400819569826126,
        0.037022583186626434,
        -0.06855805218219757,
        0.013989461585879326,
        -0.028861287981271744,
        -0.06167996674776077,
        0.04355866089463234,
        0.049941286444664,
        -0.039624109864234924,
        0.021282915025949478,
        0.03243788331747055,
        0.08470023423433304,
        0.08839795738458633,
        0.055299416184425354,
        0.0007754452526569366,
        0.1080893948674202,
        0.019261550158262253,
        -0.1004788801074028,
        -0.07251337170600891,
        -0.014004378579556942,
        -0.09717391431331635,
        0.017468774691224098,
        -0.011921417899429798,
        -0.03553340211510658,
        -0.0008843247778713703,
        0.00625954195857048,
        -0.006269462872296572,
        -0.08234965056180954,
        -0.009514887817203999,
        -0.07189033180475235,
        -0.09021306037902832,
        0.06824572384357452,
        0.0034849634394049644,
        -0.011432613246142864,
        0.09338448941707611,
        -0.0441255047917366,
        0.060539569705724716,
        0.004559552762657404,
        -0.0013554840115830302,
        -0.010992061346769333,
        0.05832114815711975,
        -0.04695553705096245,
        -0.04072728753089905,
        0.02369239181280136,
        0.054546114057302475,
        0.0396445132791996,
        0.1072806864976883,
        0.02464052475988865,
        -0.0018933152314275503,
        -0.020197151228785515,
        -0.020205458626151085,
        -0.042685892432928085,
        0.08641567826271057,
        0.057054538279771805,
        -0.015335170552134514,
        0.001722673769108951,
        0.051974572241306305,
        -0.023530378937721252,
        0.004984414204955101,
        0.03867664933204651,
        -0.054260995239019394,
        0.054177917540073395,
        0.038455311208963394,
        -0.11140632629394531,
        -0.0061693331226706505,
        -0.051055751740932465,
        0.01714690588414669,
        -0.10112655162811279,
        0.07974930852651596,
        -0.03684597462415695,
        0.08754614740610123,
        -0.009037881158292294,
        0.01939031295478344,
        0.04573000222444534,
        -0.013781753368675709,
        -0.05109697952866554,
        0.022174056619405746,
        -0.020902220159769058,
        0.09881138801574707,
        -0.0491955429315567,
        -0.061486974358558655,
        -0.06873298436403275,
        -1.0796911204198895e-32,
        0.05992421507835388,
        -0.03189518675208092,
        0.030028903856873512,
        0.022373221814632416,
        -0.0028626355342566967,
        -0.021072814241051674,
        -0.0006647190894000232,
        0.10552956163883209,
        0.018465107306838036,
        -0.11682386696338654,
        0.03613343462347984,
        -0.08354361355304718,
        -0.11120275408029556,
        -0.040781836956739426,
        -0.017017116770148277,
        -0.025088751688599586,
        -0.06348623335361481,
        -0.04075581580400467,
        0.055920347571372986,
        -0.04391487315297127,
        0.10233067721128464,
        0.1152612715959549,
        0.11650948226451874,
        0.00849614106118679,
        -0.023635292425751686,
        -0.0111769437789917,
        0.05206906050443649,
        0.07526243478059769,
        0.03832853212952614,
        0.022735292091965675,
        -0.04105488583445549,
        0.0005397290806286037,
        -0.024465445429086685,
        -0.04036841168999672,
        0.06627728044986725,
        0.06944574415683746,
        -0.005574192851781845,
        0.0706532821059227,
        0.02123715728521347,
        -0.015374185517430305,
        0.0560593418776989,
        0.0077626388520002365,
        -0.04124060273170471,
        -0.04060827195644379,
        -0.0057650599628686905,
        -0.048873577266931534,
        -0.06913434714078903,
        0.044787757098674774,
        0.03494582697749138,
        0.008061990141868591,
        -0.05624711886048317,
        -0.06933650374412537,
        -0.021205266937613487,
        -0.03448186069726944,
        0.012613454833626747,
        -0.0433715283870697,
        -0.10272492468357086,
        -0.03287734463810921,
        0.06280585378408432,
        0.004251871723681688,
        -0.004921596497297287,
        -0.03545793518424034,
        -0.05070466548204422,
        -0.09520331025123596,
        0.05209602788090706,
        -0.04382854327559471,
        0.05302301421761513,
        -0.0349915474653244,
        0.0162641704082489,
        0.07023776322603226,
        -0.008853468112647533,
        0.03798896074295044,
        0.010750677436590195,
        0.00976293720304966,
        0.038005802780389786,
        -0.0011104150908067822,
        -0.03632599487900734,
        0.007815273478627205,
        0.06616324931383133,
        -0.003053989727050066,
        -0.024287182837724686,
        0.03877146914601326,
        0.05013996362686157,
        0.07136713713407516,
        0.021287312731146812,
        0.10242016613483429,
        0.09922359138727188,
        -0.02404163032770157,
        0.021842267364263535,
        0.05388139933347702,
        0.003902947064489126,
        0.04246816039085388,
        0.06358106434345245,
        0.07628899067640305,
        -0.15808413922786713,
        -5.844346517847043e-08,
        -0.0066979010589420795,
        0.04154152050614357,
        -0.01858679950237274,
        0.017962342128157616,
        0.03373037651181221,
        -0.04279949516057968,
        -0.027702825143933296,
        0.028532272204756737,
        0.0951632633805275,
        -0.03879360109567642,
        0.1202571839094162,
        -0.004754154477268457,
        -0.02922465093433857,
        0.06103005260229111,
        -0.00839263666421175,
        0.0045789130963385105,
        -0.060972969979047775,
        0.09442928433418274,
        -0.030356045812368393,
        -0.09084739536046982,
        -0.03151508420705795,
        0.07557093352079391,
        0.01155607495456934,
        -0.02291148714721203,
        0.0254511795938015,
        -0.011333979666233063,
        0.0022047781385481358,
        -0.002214010339230299,
        0.020732073113322258,
        -0.0007617951487191021,
        -0.11205863952636719,
        -0.0074132876470685005,
        -0.055460721254348755,
        0.02411816082894802,
        -0.01527352910488844,
        -0.04948676750063896,
        -0.06900787353515625,
        0.045267123728990555,
        0.024417918175458908,
        -0.0007467926479876041,
        -0.026011435315012932,
        -0.11789248883724213,
        -0.05839507281780243,
        -0.04793887957930565,
        -0.027309034019708633,
        -0.062163252383470535,
        -0.0114827249199152,
        -0.029486803337931633,
        -0.05050169304013252,
        -0.013699608854949474,
        0.005895410664379597,
        0.03768196702003479,
        0.03681458905339241,
        -0.019246194511651993,
        0.014045174233615398,
        0.03128611296415329,
        0.07032467424869537,
        -0.03433527797460556,
        -0.056089840829372406,
        0.013574588112533092,
        0.043007414788007736,
        -0.021901875734329224,
        -0.04696832224726677,
        0.05972375348210335
    ]
}