{
    "id": "OkpdQDAi-aE",
    "title": "Holo iPhone X Case!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-01-08T15:25:12Z",
    "video_url": "https://www.youtube.com/watch?v=OkpdQDAi-aE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone x",
        "holo",
        "holographic",
        "new iphone case",
        "favorite iphone cases"
    ],
    "views": 385276,
    "likes": 13681,
    "comments_count": 3170,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? Happy 2018, this is my first unboxing video of the year and I'm just gonna be completely honest with you, it's not gonna be that exciting of an unboxing. It's basically making a video about a single iPhone case. Not sponsored, here's the case. It says it's holographic, but I Tweeted it and everyone says, \"that's not holo, that is just iridescent\". I don't know, I mean what exactly is the difference between holographic and iridescent? Because this is fine line, it is a very fine line to cross. So far my favorite cases for my iPhone X have been the basic Apple cases, I love the silicone cases so much. The two main colors that I've been a huge fan of is this, oh my gosh, what's it even called, it's like the pink sandstone or pink stone, pink sand, pink something, something with sand and something with pink. Also the silicone case in white. I've also been a big fan of Tech21 cases. I did a bunch of videos with them earlier last year, talking about how adorable the cases are and I'm probably, honestly, gonna have to end up putting this back on. Because I have found myself dropping my iPhone a lot lately and I'm not sure why. Like I will just be holding it and it basically jumps out of my hand. I know a lot of people are concerned about the battery issues that the older iPhones have and Apple's slowing down their phones. What I'm concerned about is I think that the iPhone is now getting a mind of it's own cause I think that it has been leaping from my hands to it's death on the ground and I have zero control over it. Maybe it's a me problem, but I think that the iPhone X, I think it has a mind of it's own. The next case that I have been using is this case right here. It is sort of a love/hate relationship that I have with this. One of you guys Tweeted me this and said, \"Justine, if anyone can pull this off, it's you\". And so I was like you're right. To be honest with you, I don't know if it was that wise of a choice. It's a cool color but I feel like for every day, it just did not really match my personality. I know I'm so bright and sunny and cheery. You'd think this would be a beautiful pick but no. It's just okay. So from there I switched back to this. And then I was shopping tonight because I'm going to CES tomorrow or today depending upon when you're watching this. I am probably driving up as we speak. As I speak, as you watch. I saw this case and I said, \"oh, this looks super basic, I have to get it\". I also wanted to take the opportunity, of course I'm going to CES, so why not open something so super technologically advanced, like an iPhone case. I mean make an entire video about an iPhone case. What's worse that could be posted on YouTube? I don't know, posting a dead body? Oh, is it too soon? Maybe it is. There's two pieces to it? Do I have to use this? I hope I pushed record, it's been awhile since I've filmed any videos because I had so many videos prepped for the holidays. It's a little uncomfortable just coming back to this desk and this office. I pushed record! We are set and now there's a car backing up, I shoot my videos in the middle of the night for a reason. I'm getting used to making videos again. Okay, obviously I clearly need to put this on. So we're going to put this on first. This does not look protective at all so I have a really good feeling that my phone is probably going to shatter at CES. So I'm going to bring my iPhone 8 as a back up. Because this does not feel protected at all. I feel like if I drop this this case is gonna shatter. It's just not a very high quality case but I'll tell ya what, it looks really good. Do we like this? Or is it so super basic and stupid that it's not a good look. I'm confused, now I'm having conflicting feelings. I don't wanna tell you guys to go out and buy this. But I also don't wanna tell you to not buy, I'm not, how much was this? $40! I'm a little indifferent to be honest with you. It kinda looks cheap. I was so excited about this case when I bought it. Maybe I'll return it, I'm not sure. We'll see, what am I even saying? It's almost like I forgot how to make YouTube videos. Maybe I did. Anyway, look at my new phone case. What do we think? I'll tell you one thing, it's better than the yellow. It's pretty flashy, it feels heavy. I think I might go back to my Tech21 case. Let me know what you guys think in the comments below and if I remember I will put a poll here. Do you like this iPhone case? Do you not like this iPhone case? So this year I'm going to CES. I skipped last year because I felt like, I don't really know, I don't remember what my reason was. I know I definitely had one. I tried to cut back on traveling since I got a dog which was about two and a half years ago at this point. So I really now only travel if I actually have to or if it's something super fun or if I can bring him along with me. So I figured CES this year I was definitely not going to miss it. So I look forward to meeting some of you guys. If you're going to CES let me know, I will be a bunch of random places so I'll be Tweeting out throughout the week where I'll be. Usually I don't prep videos in advance so I usually don't ever have many videos to post. But for the holidays it got really crazy all of a sudden. I ended up shooting a movie which I don't think I even told you guys about. That'll be out, I believe, sometime this year at this point. We filmed it in Pittsburgh and it was so much fun, I had the best time. Especially because I was back in my hometown, filming a movie and the movie is awesome, it's so cool. So I can't wait to tell you guys more about that. I had so many cooking videos that I posted for you guys because I had shot those in advance. Edited those so I could really focus on shooting the movie because doing things that are sort of outside of my comfort zone, I don't wanna have to worry about YouTube and YouTube is a huge stress for me because I do still edit all of my YouTube videos by myself which is so crazy I know. Everyone keeps telling me to get an editor. I have had so many requests of people telling me, \"Justine, I can edit for you.\" It is a very difficult thing to let go of for me. It's very, very difficult and I don't think that I would ever 100% let go of editing all of my videos. I feel like these types of things, where I'm sitting here talking to you, where it's a more intimate conversation, these things I'll always edit. Cooking videos, I feel like I can let go a little bit with those because it's pretty straight forward. I'm just making something, I'm usually screwing it up and then you have the end result. So there's a clear formula for that. But when I'm doing vlogs I don't feel like there's a formula. I feel super attached to the content because it's something that I've shot and then I get to tell the story how I wanna tell it. It's crazy, I don't know, I'm not sure. I've just been trying to figure out this whole YouTube space and what I wanna do in 2018. I would love to hear from you guys. What are your favorite type of videos that I make? Let me know in the comments what your favorite videos are. If you wanna Tweet me what your favorite videos are as well, feel free to do that because I'm pretty much always on Twitter nonstop. At this point I'm just rambling because I'm excited to talk to you guys and I'm excited for this year and excited to make really fun things. And I've got a bunch of fun projects coming out. And I don't know, I'm just excited. I feel like this year started off a little bit, a rough patch here on YouTube and it really brought my YouTube spirits very, very low. It took my motivation right out from under me. It took my inspiration, just I don't know. I really just sat around for three days and watched Arrow. I don't even know if that was a wise choice of my time. I'll tell you what, the show's really good. I finished Flash over the holidays. I have just been getting in all of The CW shows. And also, this is completely, completely sidetracked. Because I've been watching so many super hero shows I have decided that I wanna be a super hero. I mean, I've always wanted to be one but I feel like that's not realistic because there's not really actually super heroes in real life. I mean, maybe there are, I don't know. I've never met one. This shirts falling off, oh god, I'm a mess. But god this shirt is great, Target. Going back to super heroes. I don't read comics, I've never really read comics but I love the Marvel Universe. I love the movies, I love the Netflix shows and now that I'm getting more into the DC shows. Like Arrow and Flash. One of the things that I was most impressed about with Guardians of the Galaxy for example, was to me, I knew nothing about that franchise. I knew nothing about those characters and not a lot of people did. But they basically took these unknown characters and this unknown comic and brought it to life. So what I am interested to see is what is the next thing that most of us normal people who don't read comics. What's the next thing that we should be looking out for? And is there a character that I could potentially play? Because that's what I'm hoping for. I need an unknown, random super hero character that is somewhere hidden under comics, gotta dust it off a little bit ane be like Justine, this is you. Or do I just create my own? That's interesting. Maybe I could just do that instead. But what I love about an already existing character is there's an entire universe already built and that universe could potentially tie into, whether it's Marvel or DC, it could already potentially be tied into their world. Oh my gosh, I don't know. I just wanna be a super hero, is that too much to ask? Maybe it is too much to ask. I'm not sure, maybe I had too much caffeine. Maybe it's time for me to end this video. It's been a rough beginning of the year guys. But we're back, we're at CES now. Did anybody make it to the end of this video? Cause I'm not even sure if I'm gonna be able to make it to the end of this, editing it. And my dog is sick. Oh god, it's been, he pooped on my couch. Like I'm disgusted, I don't even wanna show it to you. Ugh, I'm gonna go. I'm gonna edit this, love you guys. I'll see you later. Did I even make a bit of sense in this video. I don't think I did. (upbeat music)",
    "transcript_keywords": [
        "case",
        "iPhone case",
        "videos",
        "guys",
        "iPhone",
        "super",
        "feel",
        "CES",
        "year",
        "video",
        "back",
        "cases",
        "YouTube",
        "love",
        "make",
        "YouTube videos",
        "single iPhone case",
        "super hero",
        "things",
        "pink"
    ],
    "transcript_entity_values": [
        "zero",
        "every day",
        "one",
        "Apple",
        "Justine",
        "tonight",
        "YouTube",
        "CES",
        "iPhone",
        "100%",
        "iPhone 8",
        "Arrow",
        "earlier last year",
        "YouTube",
        "last year",
        "the week",
        "Twitter",
        "CW",
        "three days",
        "the year",
        "iPhones",
        "Netflix",
        "about two and a half years ago",
        "the holidays",
        "Pittsburgh",
        "iPhone X",
        "Target",
        "today",
        "this year",
        "two",
        "40",
        "YouTube",
        "2018",
        "first",
        "tomorrow",
        "DC",
        "One"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "GPE",
        "ORG",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "GPE",
        "CARDINAL"
    ],
    "vector": [
        -0.026097286492586136,
        -0.02081298641860485,
        -0.0417076013982296,
        -0.12818941473960876,
        0.02963583916425705,
        -0.004400824196636677,
        0.0780944973230362,
        0.05129452422261238,
        -0.021901462227106094,
        0.04395269230008125,
        0.06090278550982475,
        -0.0005106104072183371,
        0.0031184423714876175,
        0.027305765077471733,
        0.016162704676389694,
        0.050274644047021866,
        -0.00016940393834374845,
        -0.019257374107837677,
        -0.004391087219119072,
        0.06144682690501213,
        -0.015232034027576447,
        -0.04621230438351631,
        0.020373962819576263,
        0.01536580827087164,
        -0.05166400596499443,
        0.0930221751332283,
        0.019087616354227066,
        0.02619367092847824,
        -0.08353665471076965,
        -0.0691356211900711,
        -0.026340419426560402,
        0.03599454462528229,
        0.10695452243089676,
        -0.009439256973564625,
        0.0001454504526918754,
        -0.05269322544336319,
        0.04233628883957863,
        -0.011838470585644245,
        -0.03698209300637245,
        -0.04237145930528641,
        0.014033080078661442,
        -0.037147149443626404,
        0.029847435653209686,
        0.025338824838399887,
        -0.06129930540919304,
        -0.07922644913196564,
        0.0148152532055974,
        -0.03845714405179024,
        0.041064437478780746,
        0.05867771431803703,
        -0.08972953259944916,
        -0.038925353437662125,
        0.025653621181845665,
        0.06785203516483307,
        -0.0790753960609436,
        0.010820328257977962,
        -0.0922975167632103,
        0.008010009303689003,
        0.06230134516954422,
        -0.06340562552213669,
        0.021779382601380348,
        -0.008754042908549309,
        0.0038489194121211767,
        0.06514465808868408,
        -0.03079872950911522,
        -0.05601153150200844,
        -0.002585665788501501,
        -0.010938648134469986,
        -0.01510775275528431,
        0.04441462457180023,
        -0.06595978885889053,
        0.04515799880027771,
        -0.021413249894976616,
        0.01745586469769478,
        -0.02383263036608696,
        0.07129043340682983,
        0.03896303474903107,
        -0.03297131136059761,
        -0.03277313709259033,
        0.04012790322303772,
        0.05013298615813255,
        -0.008752290159463882,
        -0.06447458267211914,
        -0.00870717503130436,
        0.016364686191082,
        0.03659776970744133,
        0.007148003205657005,
        0.013667614199221134,
        -0.04869377613067627,
        -0.08857245743274689,
        -0.0760381743311882,
        0.0020957980304956436,
        -0.013511911034584045,
        -0.05025196820497513,
        -0.019578902050852776,
        -0.07081802189350128,
        0.02493140660226345,
        -0.03750116378068924,
        -0.04223102331161499,
        0.06658278405666351,
        0.06627167761325836,
        -0.078902967274189,
        0.01534043438732624,
        -0.01765587367117405,
        -0.006102408282458782,
        -0.11348272860050201,
        -0.0640096589922905,
        0.019911866635084152,
        -0.025040773674845695,
        0.04776410013437271,
        -0.05738583952188492,
        0.0277226734906435,
        -0.04889502748847008,
        -0.06603992730379105,
        0.020778674632310867,
        0.09258611500263214,
        -0.0009658618364483118,
        0.10483027994632721,
        0.05029718577861786,
        -0.019625483080744743,
        -0.0015634243609383702,
        -0.06658262014389038,
        -0.027551770210266113,
        0.038903895765542984,
        0.01754925772547722,
        0.00023694438277743757,
        -0.08706700801849365,
        1.3094093121302519e-32,
        -0.012518014758825302,
        0.050774529576301575,
        -0.0029569438192993402,
        0.06890275329351425,
        -0.017293909564614296,
        -0.05996425077319145,
        0.018737129867076874,
        0.10717058926820755,
        -0.013637465424835682,
        0.04609650745987892,
        0.005123734474182129,
        0.05261532589793205,
        -0.030165281146764755,
        0.03587597981095314,
        0.017804384231567383,
        -0.0264606773853302,
        -0.05172670632600784,
        -0.03547614812850952,
        -0.05680713802576065,
        -0.007739944849163294,
        -0.011040128767490387,
        -0.05627809092402458,
        -0.013305652886629105,
        0.0957011803984642,
        0.051781125366687775,
        0.08585042506456375,
        0.08257228136062622,
        -0.034098632633686066,
        0.07352767139673233,
        0.0034403461031615734,
        -0.025367246940732002,
        -0.050739120692014694,
        0.015267683193087578,
        -0.08109065890312195,
        -0.041772447526454926,
        0.036742210388183594,
        -0.049415431916713715,
        -0.006248146295547485,
        0.01583641953766346,
        -0.03746916726231575,
        -0.035761669278144836,
        0.0055754403583705425,
        -0.03598388284444809,
        -0.058941952884197235,
        0.08969250321388245,
        0.0757048949599266,
        0.00870492123067379,
        0.03265785053372383,
        -0.04894896224141121,
        0.010536257177591324,
        -0.01629617065191269,
        -0.06359689682722092,
        -0.06988126039505005,
        0.007842944003641605,
        -0.031946390867233276,
        -0.08391299098730087,
        -0.04345118626952171,
        0.06409970670938492,
        0.03932119905948639,
        0.06057371199131012,
        -0.010189575143158436,
        -0.011814936995506287,
        -0.03567752614617348,
        -0.0015350498724728823,
        -0.10105273127555847,
        0.08364956825971603,
        0.06954196840524673,
        -0.09207779169082642,
        0.0002437525545246899,
        0.08612697571516037,
        -0.02409307472407818,
        -0.0002985750325024128,
        0.05422085151076317,
        0.029030816629529,
        0.016170093789696693,
        0.04687580093741417,
        -0.08147064596414566,
        -0.07693414390087128,
        0.015572131611406803,
        -0.016963953152298927,
        -0.1108318418264389,
        0.048205092549324036,
        -0.0014987298054620624,
        0.12030673772096634,
        0.006813550367951393,
        -0.08687378466129303,
        0.013353430666029453,
        -0.02810618467628956,
        -0.06205315142869949,
        0.025699520483613014,
        -0.02988879568874836,
        0.06748711317777634,
        -0.08003947883844376,
        -0.0324241928756237,
        -0.02863561362028122,
        -1.2178604896570674e-32,
        0.014263730496168137,
        -0.017519565299153328,
        0.005476876627653837,
        -0.025929542258381844,
        0.04413798451423645,
        -0.03340248763561249,
        0.024885166436433792,
        0.1167764961719513,
        0.06754784286022186,
        -0.09236010909080505,
        0.05095367506146431,
        -0.056563399732112885,
        -0.08079240471124649,
        0.0504421629011631,
        -0.037678901106119156,
        -0.028995338827371597,
        -0.07298820465803146,
        -0.0716787651181221,
        0.055315934121608734,
        0.012257336638867855,
        0.05328388884663582,
        0.11123033612966537,
        0.07478735595941544,
        0.020369989797472954,
        0.01828332617878914,
        0.010017127729952335,
        0.06878463923931122,
        0.03719371557235718,
        0.07465630769729614,
        0.026594115421175957,
        -0.05128876864910126,
        -0.10469254106283188,
        -0.034957438707351685,
        0.01835821196436882,
        0.020064592361450195,
        0.03811674565076828,
        0.01966036669909954,
        0.04652484878897667,
        0.021098928526043892,
        -0.07188811898231506,
        -0.01605575531721115,
        -0.010148432105779648,
        0.02097182348370552,
        -0.0013095492031425238,
        0.01594407856464386,
        -0.07406438887119293,
        -0.017992272973060608,
        0.0349108949303627,
        0.030621657148003578,
        0.027264151722192764,
        -0.04233304783701897,
        -0.030479175969958305,
        -0.02155277505517006,
        0.007996050640940666,
        -0.0716005265712738,
        0.004210777580738068,
        -0.041127029806375504,
        -0.05769221857190132,
        0.025044897571206093,
        0.0038488763384521008,
        0.06740723550319672,
        0.005333275068551302,
        -0.04648619145154953,
        -0.06867851316928864,
        -0.02779928594827652,
        -0.06718384474515915,
        0.06476666778326035,
        0.021768730133771896,
        -0.052315808832645416,
        0.03133256360888481,
        -0.03125392645597458,
        0.01277313381433487,
        0.02763662114739418,
        -0.015714896842837334,
        0.04871775209903717,
        0.01711929589509964,
        -0.10990949720144272,
        0.01856635883450508,
        0.07279109954833984,
        -0.03176127374172211,
        -0.03668778017163277,
        0.03421467915177345,
        0.02868308499455452,
        0.09337378293275833,
        0.10665354132652283,
        0.15078988671302795,
        0.10280611366033554,
        0.008145616389811039,
        -0.01957976259291172,
        0.0442487858235836,
        0.02012757770717144,
        0.07403210550546646,
        0.0593034066259861,
        0.11814630031585693,
        -0.08173701912164688,
        -6.152423992489275e-08,
        0.02447633631527424,
        -0.004160976968705654,
        -0.0335848294198513,
        -0.018187612295150757,
        -0.0031016571447253227,
        -0.04809919744729996,
        -0.04898039251565933,
        0.004205498844385147,
        0.10104189068078995,
        -0.05226728320121765,
        0.05721035972237587,
        0.007127706427127123,
        -0.047303494065999985,
        0.12528406083583832,
        0.0007600121316500008,
        0.007914971560239792,
        -0.08927097171545029,
        0.06686926633119583,
        -0.03991977497935295,
        -0.07382679730653763,
        -0.05657411739230156,
        0.05588575825095177,
        0.04519375413656235,
        -0.011888653971254826,
        0.04922027140855789,
        0.008026037365198135,
        0.0017448844155296683,
        -0.03785959631204605,
        0.03927827253937721,
        -0.0036352791357785463,
        -0.07995454221963882,
        0.0066658672876656055,
        -0.0018066440243273973,
        0.006533501669764519,
        -0.038212306797504425,
        -0.03728964552283287,
        -0.05688706785440445,
        -0.03853915259242058,
        0.033417023718357086,
        -0.014931892976164818,
        0.025372451171278954,
        -0.14023597538471222,
        -0.03723451867699623,
        -0.00177580036688596,
        0.04186200723052025,
        -0.06655154377222061,
        0.07541746646165848,
        -0.10242828726768494,
        -0.031296681612730026,
        -0.03494672104716301,
        -0.047995902597904205,
        0.0007319843280129135,
        0.02656068280339241,
        -0.05833810940384865,
        0.0707646831870079,
        0.018823932856321335,
        0.05877891182899475,
        0.04819367825984955,
        -0.004299147520214319,
        -0.0002447545703034848,
        0.03285417705774307,
        0.013518904335796833,
        -0.024778839200735092,
        0.050566524267196655
    ]
}