{
    "id": "oKpv7hRmlRM",
    "title": "What's the Best Value CPU/Graphics Card Combo?",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2017-07-15T14:30:37Z",
    "video_url": "https://www.youtube.com/watch?v=oKpv7hRmlRM",
    "category": "Education",
    "tags": [
        "Salazar",
        "Science",
        "Studio",
        "Tech",
        "Channel",
        "Greg",
        "Best",
        "CPU",
        "Graphics",
        "Combo",
        "AMD",
        "Ryzen",
        "Intel",
        "Kaby",
        "Lake",
        "1600",
        "R5",
        "1600X",
        "1500X",
        "Cores",
        "OC",
        "RAM",
        "DDR4",
        "PC",
        "Computer",
        "Gaming",
        "Rendering",
        "Editing",
        "Adobe",
        "Premiere",
        "Pro",
        "Render",
        "Time",
        "Test",
        "Benchmarks",
        "FPS",
        "Frames",
        "Second",
        "Resolution",
        "1080p",
        "1440p",
        "4K",
        "Value",
        "GPU",
        "Nvidia",
        "Radeon",
        "GTX",
        "RX",
        "1070",
        "1080",
        "Ti",
        "480",
        "580",
        "Power",
        "Performance",
        "best cpu and gpu combo",
        "best cpu gpu combo 2017",
        "best cpu and gpu combo 2017",
        "best budget cpu and gpu combo",
        "best budget cpu",
        "best budget gpu",
        "best budget cpu 2017"
    ],
    "views": 211763,
    "likes": 8972,
    "comments_count": 1442,
    "description": "- This is a question many of you have recently asked in light of the several CPU launches over the past 12 months or so. I hope this clears things up to an extent. Of course, let me know what you think in the comment section below!  AMD RYZEN CPUs:  AMD RADEON GRAPHICS CARDS:  INTEL KABY LAKE CPUs:  NVIDIA GRAPHICS CARDS:   PATREON:  TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:   Subscribe to the channel!  MUSIC: 'Break Away' by Foria  DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our CJ account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "http://amzn.to/2ul3mVv",
        "http://amzn.to/2ul7hlf",
        "http://amzn.to/2ukVaEI",
        "http://amzn.to/2upJqR5"
    ],
    "transcript": "Wow, there's as much caffeine in this as there isn't a cup of coffee. It's 4:00 a.m.. So perfect So today on Twitter I set up a Qa I wanted to know what all of you wants to know either about myself or the channel or the tech industry in General and a Few of you asked the exact same question that if that was very intriguing it's a subjective question I get asked this a lot But I've never actually thought about the perfect combo the perfect graphics card cPU combo you could possibly conjure up in This current market now I'll admit the cPU part for me wasn't all that complicated when it comes to Bang for the buck how much you get how much performance you can squeeze out of any given cPU for the price? I think that ryzen of this current state is the way to go I think that intel I5 lineup is pretty much dead at this point I think the I7 still have a competitive advantage in some cases a 7700 K is still the best gaming cPU on the market but it does cost around 300 bucks so it's difficult to justify that cPU for a marginal FPS increase in most games over a CpU that on amd side has more cores more threads not the highest frequency which is its achilles heel at this point But is much cheaper as well which is what most people consider when they're buying a CpU how much money do I have to spend to get the performance that I'm looking for so let's do that let's talk about the cPU choice first the one that I think is the best bang for the buck and then we'll throw in the graphics card I'll talk about why it shows that when it's kind of an all-around contender just in terms of resolution and refresh rate it will do Okay 4k gaming light 4k gaming 1080p No problem again refresh rates up to 144 Hertz and most of those resolutions as well But for the cPU I think the best value chip you can currently buy is the amd R5 1600 now I say that for a variety of reasons Not only is it a decent gaming chip obviously. It's got six cores 12 threads an okay overclock It's not going to get anywhere near Kaiba lake but until been refreshing the exact same crap for the past three generations, so yeah They should be at 50 hertz by now, but the 1606 cores in 12 threads will do it justice You won't find a thread bottleneck for the most part I think Battlefield one off the top of my head is one of the only games it will probably get somewhere close to Max utilization on the six core cPU that's an exception I don't expect that to become the norm anytime soon, so yeah Don't worry about that not only that though the risin 5 1600 is proven to be an excellent content creation CpU as well Which is pleasantly surprising my daily driver the I7? 6700 K. Which is a $300 cPU mind you renders of five-minute 1080P 60FPs file in around 4 minutes? It's usually around a minute per minute of footage to render in that resolution and frame rate now the R5 1600 Did a really good job keeping up here? I was very impressed with a 200 ollars cPU Almost outperforming 300 of our cPU in a task that it's pretty intensive for all cpus in general I expect that the R5 s of render time was more dependent on the cPus frequency than it was the core count nonetheless I can Say with 100% confidence that if I had 300 bucks right now on the table And I had to choose between an i7 6700 K and an R5 1600 I would choose the R5 1600 any day of the week at pocket at extra hundred bucks or spend it elsewhere Maybe like a better graphics card and that leads us very smoothly into graphics card choice now Please it's a pet peeve of mine if you're going to say which GpU should I buy that that's incorrect you don't say which GpU should you buy because that implies that you're only going to buy the graphics processor itself and not the whole Pcb like the whole car, but the cooler on it, too. That's called a graphics card folks that's not a gpu but I think the best bang for the buck graphics card right now is actually from the green team is a GTX 1070 now I know the graphics cards in general right now are extremely hard to find especially at semi Decent prices because of Miners everywhere thank you, but if you can get your hands even on I used GTX 1074 around 300 bucks That is gold my friend that is an excellent graphics card Let me tell you I used a 1070 for like 6 months straight because I was also could afford and that card Was a workhorse it did so much for me at Grin and I paid 400 bucks for it back then But it was still worth it at $400 keep in mind. I'm stating this without taking into consideration Resolution and refresh rate those are the two things I think it should look at always first and foremost before deciding on a graphics card to Buy but in a general sense, I think that the best thing for the buck card right now if you can find one is a GTX 1070 NVIdia really did this was solid here even upon initial they gave us a $400 card that was on par with a 90 DTI which mind you months earlier was a $600 card the pascal architecture gave us an excellent performance per dollar Ratio We weren't paying as much money to get the same performance as we were out of maxwell and on top of that we weren't Putting as much power into our cards to get the frame rate that we wanted so efficiency went up That's always a good thing again This is entirely circumstantial This assumes that you don't have a fixed budget that you're just looking for the best bang for the buck out there That's what a lot of people ask me about they don't assume that they only have 400 bucks to spend they just say well How much do I need to save up to get the most for my money? That's a very powerful question and I think I hope at least that this video kind of answers that for you I think that an R5 1600 is a solid middle ground Cp. It's actually above average I would say in the current market the GTX 1070 is also an excellent graphics card that you could probably find used for around 300 Bucks even if you can't find it used buy one for 350 new it's still an excellent graphics card I would do it all over again that way well by Dr5 1600 in the GTX 1070 and be Completely fined with almost any resolution in gaming solid refresh rates up to 144 Hertz and most importantly I won't feel the Buyer's remorse like I didn't get what I? Expected for the money that I spent so if you've got let's say a $400 fixed budget you Can't go over that you've been saving it for two or three months And this is what you have to spend You obviously can't go with this combo here these two units alone would send you over that budget But I do think you should consider the R5 1600 kind of like a goal for a cPU choice like this is I hate using the term future-proof But it is it's a future-proof cpU for 200 bucks And that's insane like five years ago that didn't exist amd is giving us What intel's been giving us at a significantly higher price? And that is powerful intel can do one of two things at this point ignore Everything happening on the Red Team which I think would be unwise Or they can lower the price of their six core cpus in which case competition and you know capitalism at work. So that's it That's where I stand on this issue I think people are still going to probably say oh, he was paid off by Amd, or well He has no choice now because everyone's pretty much ditching until at this point X2 nine nine What the heck was going on there? I just point to value where I see value And I recognize that a lot of you originally subscribed to the channel for that budget orient In process right you want to know what the best bang for the buck configuration is Look money is just as important as the products on which you spend the money with that if you liked this video be sure to Give it a thumbs up thumbs down for the opposite click to subscribe button if you haven't already now We'll catch you in the next video. This is science studio. Thanks for budgeting with us",
    "transcript_keywords": [
        "graphics card",
        "excellent graphics card",
        "cPU",
        "graphics card cPU",
        "card",
        "buck graphics card",
        "graphics",
        "bucks",
        "perfect graphics card",
        "card cPU combo",
        "buck",
        "graphics card choice",
        "excellent graphics",
        "GTX",
        "card cPU",
        "buy",
        "cPU choice",
        "buck card",
        "cup of coffee",
        "Bang"
    ],
    "transcript_entity_values": [
        "first",
        "around 300 bucks",
        "six",
        "months earlier",
        "three",
        "FPS",
        "Pcb",
        "DTI",
        "4:00 a.m",
        "maxwell",
        "CpU",
        "200",
        "GTX 1070",
        "300",
        "GTX",
        "around 4 minutes",
        "1074",
        "400 bucks",
        "400",
        "cPus",
        "GTX 1070 NVIdia",
        "12",
        "intel",
        "GpU",
        "two",
        "1606",
        "this point X2 nine nine",
        "I7",
        "Hertz",
        "1080P 60FPs",
        "around 300 Bucks",
        "daily",
        "today",
        "100%",
        "600",
        "two or three months",
        "50 hertz",
        "200 bucks",
        "six cores 12",
        "the Red Team",
        "300 bucks",
        "one",
        "144",
        "Max",
        "around a minute per minute",
        "five-minute",
        "1600",
        "Buyer",
        "five years ago",
        "Amd",
        "orient",
        "90",
        "Twitter",
        "I7",
        "300",
        "Bang",
        "4k",
        "Kaiba lake",
        "350"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "PERCENT",
        "MONEY",
        "DATE",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "LOC",
        "CARDINAL",
        "ORG",
        "FAC",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "LOC",
        "CARDINAL"
    ],
    "vector": [
        -0.09089697152376175,
        -0.0026578267570585012,
        -0.005926867946982384,
        0.026905473321676254,
        0.04734104871749878,
        0.01628493331372738,
        0.06968589127063751,
        0.046635840088129044,
        0.014994552358984947,
        -0.04759416729211807,
        -0.07575581222772598,
        -0.034172214567661285,
        -0.013394594192504883,
        -0.025944789871573448,
        0.001978093758225441,
        0.014857056550681591,
        0.16517983376979828,
        -0.11663774400949478,
        -0.07044591754674911,
        -0.031909119337797165,
        -0.02216765098273754,
        -0.08070211857557297,
        0.021359747275710106,
        0.035555340349674225,
        0.089113250374794,
        0.07461915910243988,
        0.0390135832130909,
        -0.0251030120998621,
        -0.005476728547364473,
        0.015941979363560677,
        -0.017840558663010597,
        -0.0005012872279621661,
        0.06483426690101624,
        -0.05211510881781578,
        0.049114156514406204,
        0.001627173158340156,
        -0.009547464549541473,
        -0.06363005936145782,
        -0.014133150689303875,
        0.004106480162590742,
        -0.005074549466371536,
        -0.05449450761079788,
        -0.020859571173787117,
        0.054478805512189865,
        0.02549906075000763,
        -0.02251766249537468,
        0.050090424716472626,
        0.02495509199798107,
        -0.04417560249567032,
        0.03565744683146477,
        -0.03510165214538574,
        -0.08478298783302307,
        0.04070010408759117,
        -0.043409816920757294,
        -0.08186369389295578,
        0.04244199022650719,
        -0.03889453038573265,
        -0.07107136398553848,
        0.043491948395967484,
        0.034310899674892426,
        0.04225765913724899,
        -0.089180588722229,
        -0.02063015289604664,
        0.09886924922466278,
        0.015614161267876625,
        -0.04827658459544182,
        -0.07820265740156174,
        0.02065722830593586,
        -0.015275607816874981,
        -0.05533578619360924,
        0.0289261806756258,
        -0.030096385627985,
        0.01378123089671135,
        -0.023580238223075867,
        0.011050594039261341,
        0.03684448078274727,
        0.053257983177900314,
        -0.033443208783864975,
        0.07934573292732239,
        -0.03929223120212555,
        0.04739513620734215,
        -0.0544000007212162,
        0.006728865206241608,
        -0.05970359593629837,
        0.08897464722394943,
        -0.02818245068192482,
        0.0769573524594307,
        0.025240978226065636,
        0.04129719361662865,
        -0.016558244824409485,
        -0.016465788707137108,
        0.09064095467329025,
        0.14106860756874084,
        -0.03065057471394539,
        0.052336953580379486,
        0.04104357212781906,
        -0.02269265055656433,
        -0.0477120541036129,
        -0.01440491620451212,
        0.03880210593342781,
        0.0024629239924252033,
        0.0774359330534935,
        0.03493959456682205,
        0.03172454610466957,
        0.009178612381219864,
        0.002074504503980279,
        -0.08650030195713043,
        0.15104059875011444,
        0.0736822560429573,
        0.007974833250045776,
        -0.020524125546216965,
        0.08823937177658081,
        -0.05388219282031059,
        -0.0006364865694195032,
        0.03358571603894234,
        0.02917918562889099,
        -0.028522521257400513,
        0.012609811499714851,
        0.14232073724269867,
        0.060939546674489975,
        -0.022970285266637802,
        0.016545657068490982,
        0.014566279947757721,
        -0.037596672773361206,
        0.005450306925922632,
        -0.010068139992654324,
        -0.12410418689250946,
        5.951375083947635e-33,
        -0.00544262770563364,
        0.09845870733261108,
        -0.006475699134171009,
        -0.04770421236753464,
        0.00709184305742383,
        0.053737226873636246,
        -0.04687419906258583,
        0.00015795024228282273,
        0.006181439850479364,
        0.06471186131238937,
        -0.03739975020289421,
        0.04458877071738243,
        0.020729297772049904,
        0.12471616268157959,
        0.03599828481674194,
        -0.08247935771942139,
        -0.025486765429377556,
        -0.015518791042268276,
        0.015204343944787979,
        -0.0046412148512899876,
        0.05587305128574371,
        0.022383658215403557,
        0.015959350392222404,
        0.08032113313674927,
        -0.0024641165509819984,
        -0.008668935857713223,
        -0.037095535546541214,
        0.008022038266062737,
        -0.0006991051486693323,
        0.03442865610122681,
        -0.03709779307246208,
        -0.07102669775485992,
        -0.014997185207903385,
        -0.048943936824798584,
        -0.06122271716594696,
        -0.01830456592142582,
        -0.03246251866221428,
        -0.10264210402965546,
        0.01443670317530632,
        0.05522359162569046,
        -0.057971566915512085,
        0.10519969463348389,
        -0.028982242569327354,
        -0.115355484187603,
        -0.07852625101804733,
        0.07427521049976349,
        0.009298145771026611,
        -0.02412896417081356,
        -0.019763149321079254,
        0.04555058106780052,
        -0.07290659099817276,
        -0.000777800683863461,
        0.06397966295480728,
        0.019143369048833847,
        -0.017000846564769745,
        -0.09462971985340118,
        -0.006076333578675985,
        0.019732296466827393,
        0.08968912065029144,
        0.008563093841075897,
        -0.05219041183590889,
        0.005379253998398781,
        -0.026641152799129486,
        0.020414527505636215,
        -0.1326594054698944,
        0.07841195166110992,
        0.04922403767704964,
        0.03370734676718712,
        -0.08188176900148392,
        0.022427590563893318,
        0.026438262313604355,
        0.035745877772569656,
        -0.00034567181137390435,
        -0.05994339659810066,
        0.00599774019792676,
        0.00828680582344532,
        -0.02475142292678356,
        -0.03904475271701813,
        -0.0830325111746788,
        0.019376663491129875,
        -0.001903180149383843,
        0.02778451330959797,
        0.019505392760038376,
        -0.020900780335068703,
        -0.002637610537931323,
        0.033201154321432114,
        -0.01239980198442936,
        0.0036801150999963284,
        0.038635700941085815,
        0.04626641422510147,
        -0.0676761195063591,
        0.03309822082519531,
        0.046342916786670685,
        0.06313052028417587,
        -0.03685513883829117,
        -5.3833890705997676e-33,
        -0.003714242484420538,
        -0.05490519106388092,
        0.07973601669073105,
        0.0651731789112091,
        0.0010363815817981958,
        -0.012695606797933578,
        0.08758626133203506,
        -0.04987796023488045,
        0.05175071209669113,
        -0.06992033123970032,
        -0.006508991587907076,
        0.06532951444387436,
        -0.06334389001131058,
        0.004375835880637169,
        -0.059303246438503265,
        -0.03245972841978073,
        -0.02984396182000637,
        -0.09849771112203598,
        0.046369608491659164,
        -0.06843855232000351,
        0.017448950558900833,
        0.03109900839626789,
        -0.0369940847158432,
        -0.012008704245090485,
        0.05855746939778328,
        0.06223314255475998,
        -0.028545105829834938,
        -0.02864479459822178,
        0.018829235807061195,
        -0.005225624423474073,
        -0.02330433763563633,
        -0.031237086281180382,
        -0.011528502218425274,
        0.033155642449855804,
        0.016492562368512154,
        0.07627594470977783,
        0.04499990865588188,
        0.013907919637858868,
        -0.001241263933479786,
        0.04714050143957138,
        0.07750725001096725,
        0.007407973520457745,
        -0.01132281869649887,
        0.07817167788743973,
        0.009007720276713371,
        -0.028040776029229164,
        -0.03752851486206055,
        -0.08325034379959106,
        0.01934189535677433,
        0.013003448024392128,
        -0.03361012041568756,
        -0.09949830919504166,
        0.006802354473620653,
        0.03616352379322052,
        -0.08577843010425568,
        -0.030028248205780983,
        0.016049040481448174,
        0.06362709403038025,
        -0.050278440117836,
        -0.061823129653930664,
        0.022378167137503624,
        0.015194539912045002,
        -0.027691541239619255,
        0.007314336486160755,
        0.027276204898953438,
        -0.040639109909534454,
        0.04173817113041878,
        0.0637044757604599,
        0.0050049154087901115,
        -0.09511078894138336,
        0.037591274827718735,
        -0.03540989011526108,
        -0.052070487290620804,
        -0.07663458585739136,
        -0.0950494334101677,
        0.0933060422539711,
        0.08312251418828964,
        -0.03553704172372818,
        -0.004538836423307657,
        -0.03948965296149254,
        -0.03628643974661827,
        -0.010249159298837185,
        0.024617468938231468,
        -0.054126959294080734,
        0.0603831484913826,
        -0.026077454909682274,
        0.04786236211657524,
        -0.0876474604010582,
        -0.01935505121946335,
        -0.019079269841313362,
        -0.041949205100536346,
        0.0066422512754797935,
        -0.015113094821572304,
        0.06975384056568146,
        0.023639602586627007,
        -6.251860895645223e-08,
        0.05144738405942917,
        -0.05139467120170593,
        -0.013389232568442822,
        0.08183155953884125,
        0.09627658873796463,
        -0.047551751136779785,
        -0.02927524782717228,
        -0.055871542543172836,
        0.020069202408194542,
        0.0175553597509861,
        0.11010470241308212,
        -0.028471339493989944,
        -0.07161945849657059,
        -0.013949096202850342,
        0.004381299950182438,
        -0.009405538439750671,
        -0.06548567861318588,
        0.03752308711409569,
        0.012623431161046028,
        -0.021638020873069763,
        -0.027329498901963234,
        0.060819003731012344,
        0.031037895008921623,
        -0.07994550466537476,
        -0.07843565940856934,
        -0.018286235630512238,
        0.042351484298706055,
        0.028247930109500885,
        0.06748811900615692,
        -0.011830754578113556,
        -0.07834313809871674,
        0.0204345490783453,
        0.011215312406420708,
        -0.03710338473320007,
        0.049686890095472336,
        -0.08127913624048233,
        -0.025193074718117714,
        -0.00067045574542135,
        0.03064769320189953,
        0.016383523121476173,
        -0.039478592574596405,
        -0.07826057076454163,
        -0.015548989176750183,
        -0.019233446568250656,
        -0.03195606917142868,
        -0.009905613027513027,
        -0.10853297263383865,
        -0.0700942650437355,
        0.05743332579731941,
        -0.005752317141741514,
        -0.014783691614866257,
        -0.02520928904414177,
        0.04026823863387108,
        0.06755461543798447,
        0.029924364760518074,
        -0.040288686752319336,
        -0.04192157834768295,
        0.045336976647377014,
        -0.02727162279188633,
        -0.06651176512241364,
        0.07160749286413193,
        -0.1308041512966156,
        -0.01178139727562666,
        -0.012656450271606445
    ]
}