{
    "id": "OkW_GEFFSzg",
    "title": "I bought the WORST new Laptop 🤮",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-07-17T18:06:22Z",
    "video_url": "https://www.youtube.com/watch?v=OkW_GEFFSzg",
    "category": "Science & Technology",
    "tags": [
        "laptop",
        "cheap laptop",
        "budget laptop",
        "notebook",
        "computer",
        "hp",
        "hp stream",
        "chrome",
        "chromebook",
        "chrome os",
        "chromeos",
        "samsung",
        "samsung chromebook",
        "chromebook samsung",
        "gateway",
        "walmart",
        "ryzen",
        "amd",
        "budget",
        "cheap",
        "pc",
        "tech",
        "unboxing",
        "review",
        "austin",
        "austin evans",
        "the test drivers",
        "test drivers"
    ],
    "views": 1778446,
    "likes": 54127,
    "comments_count": 3717,
    "description": "Go to  click the microphone at the TOP of the homepage and type in AUSTINEVANS to start your 4-week trial PLUS free postage and a digital scale.   HP Stream laptop on Amazon:  15\" Samsung Chromebook 4 on Amazon:  Gateway 15.6\" Walmart exclusive laptop:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  My new podcast @TheBackmarkers!  I have a TikTok!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://stamps.com,",
        "https://austin.tech/stream",
        "https://austin.tech/chromebook15",
        "https://www.walmart.com/ip/Gateway-15-6-FHD-Ultra-Slim-Notebook-AMD-Ryzen-5-3450U-8GB-RAM-256GB-SSD-Tuned-THX-Audio-Fingerprint-Scanner-1MP-Webcam-HDMI-Cortana-Windows-10-Home-/105156164",
        "https://www.relay.fm/testdrivers",
        "https://www.tiktok.com/@austintechtips",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today, I am buying the cheapest laptops I can to answer one simple question: should you go out and buy something that's super-cheap, or does it make sense to spend just a little bit more money and get a much better experience? Spoiler alert: yes. (air whooshing) So this is the HP Stream. (bubble popping) This laptop cost me $220, but I've done videos on previous versions of the Stream that cost as little as 180 bucks. My biggest question, taking a look at this laptop, is a really simple one: why does such a terrible laptop that is so old still sell so well? This is one of the most popular laptops in the world, and yet, is it really that different than that laptop I took a look at seven years ago? I don't think so. I forgot how long it takes to set these things up. (laughs) It's okay. Look, when you're spending $200 on a laptop, patience is something that you definitely require. Do you see this? Like, can you get really close here? There's a group of dead pixels right here. You see that? - Yeah. - Well, that's a great first sign. (relaxed music) (adhesive hissing) You know, one of the interesting things is the battery is actually fairly large, but it's super, super-narrow. I mean, like, that's a pancake battery, and then underneath here would be our CPU, which does have a little copper heatsink on it. That's it. There's nothing going on here. There's literally no reason I can think of whatsoever to ever take apart your HP Stream, but science. (tool clattering) To better understand where devices like the HP Stream come from, I think it's important to take a look back at where these all got their start, the dark days of netbooks. (person screaming) This is an ASUS Eee PC, and if you were around in the late 2000s, you knew that these netbooks were absolutely everywhere. They offered a couple of things that no one else could really touch at the time. First of all, they were incredibly affordable. This was one of the later models back from 2012, but even the earlier models were only around $300, which was far and away cheaper than any other full Windows laptop you could buy. The other benefit they really had going for them was the size. With a 10-inch display, they were absolutely tiny and really quite portable. Now, there were other ultra-portable laptops back in the day, but the problem was was that if you wanted something that was around the same size as an Eee PC, you're spending a lot more. Instead of a few hundred dollars, you're spending $1,000, $2,000. Think about like that early MacBook Air, some of the VAIOs. They were very expensive systems, so there was certainly a contingent of people who really just wanted something that was ultra-portable that could fit in a bag, but I would say, the vast majority of people who were buying netbooks were doing it purely because of the price. They weren't really good at anything besides being a very cheap computer, and when you look at this beside the HP Stream of today, there are a lot of parallels. So what exactly can you do with the cheapest new laptop you can buy? Well, you have to put it to the test, of course. The thing with HP Stream, well, we're looking at a 1,366 by 768 display, which means it's essentially just barely above 720p. Let's see if the HP Stream can stream 4K. (key clicking) Hello, and welcome to Wishtery Tech. Let's buy some dumb stuff on Wish. The item I see are both- I'm actually pretty impressed! We're playing back 4K YouTube no problem! (bell dinging) (hands swishing) Let's get some Minecraft action. Just trying to, like, look around slowly. Minecraft for phones runs much better than this. Oh, God, no, we, no, no. (buzzer blaring) I actually don't even know if this will run. We may have just installed Valorant for zero reason. I'm getting a few seconds per frame right now. (laughs) I think the game just crashed. (chuckles) (hand thudding) (alarm buzzing) We are now recording using OBS on the HP Stream. I'm gonna just take a guess and say that the quality that you're looking at right now is terrible because I look at the screen, and it looks terrible, and we're also using the microphone built into the HP Stream, which I'm gonna guess is also subpar. At this point, it is pretty clear: the HP Stream can handle some very basic tasks, but ask it to do anything remotely demanding, and it falls apart quickly. I think the real benefit to buying something like an HP Stream is less so from the consumer standpoint and more from the Intel, the Microsoft, the HP standpoint because when you look at some of the decisions they've made with the HP Stream, I really think that this is a laptop which is designed to be just barely good enough to fight off something like a Chromebook, but not too good to the point where it eats into some of the higher-end laptops where they actually make money, and this is not a laptop that is designed for 2021. This is a laptop that is less powerful than a smartphone from 2015, right? I mean, that is not acceptable for a full Windows laptop. I don't care what the price is here in the year 2021. This video is sponsored by stamps.com. As life starts to get back to normal, there's lots to look forward to, but one thing that can remain a thing of the past is standing in line at the post office and paying full price for postage. With stamps.com, you get the services of the US Postal Service and UPS right to your computer. Whether you're a small office sending invoices or an Etsy or eBay shop sending out orders, stamps.com has you covered. You get discounts of up to 40% post office and up to 66% off UPS shipping rates, and with their Switch and Save feature, you can quickly compare carriers to find the best rates every time. Print official US postage 24/7 for any letter, any package, any class of mail, and anywhere you want to send it. Once your mail is ready, just schedule a pickup or drop it off, so what are you waiting for? Stop wasting time going to the post office, and go to stamps.com instead. You can use my promo code AUSTINEVANS to get a special offer that includes a four-week trial plus free postage and a digital scale. Best of all, no long-term commitments or contracts needed. Again, go to stamps.com, click on the microphone at the top of the homepage, and type in AUSTINEVANS. Huge thank-you to stamps.com for sponsoring this video. To get a good sense for what kind of systems you can buy at this budget, my next task was simple: how does a similarly priced Chromebook stack up? So when it comes to a Chromebook, we actually do have more options. They have actually some fairly expensive Chromebooks. This one's 629 bucks, but I think I found it. Look, it's a MacBook Pro 15-inch. - [Ken] Samsung's finest right here. - It's 249 bucks! And mind you, it has, like, no ports, and it also is very, very lightweight. Literally nothing inside, but if you want a larger display. I mean, it's certainly not fast, I can tell you that. So Celeron processor, which is fine. Four gigs of RAM, not great, fine, but you get an HD display. I really wanna open this up. I feel like it's gonna be almost entirely empty on the inside. So what have we gotten with our Chrome OS money, our Chromebucks, some might say? A certainly larger device than what we get with the HP Stream. I mean, a 15-inch display, while I'm personally a fan of smaller laptops, that is an advantage for a lotta people. (bell dinging) Whoo! (laughs) This weighs nothing! (packaging rustling) This weighs actually nothing, wow! - [Ken] It's 'cause it's all in the cloud. - (laughs) So we have a USB-A, a USB-C port, and a second USB-C port as well as microSD. I actually really like the idea of being able to plug in on either side. It's like what you get on, like, some MacBooks and some higher-end laptops. No matter which side of, like, the power plug you're on, you could just plug it in. It's super-easy. The screen goes actually pretty far back, not flat, but, like, pretty far back. All right, so with our Chromebook up-to-date and charging, a few notes. The screen is fine. So it is 1080p; however, it is clearly a fairly low-quality TN panel, pretty much what you would expect for this kinda price. It's usable, but it's only usable if you're dead-on. - [Reporter] A tense French Grand Prix was ultimately decided by a penultimate- - Sounds a little crunchy. - [Reporter] But the defining moment of the race really happened - Turn it down a little bit though. - many, many laps earlier. - That's totally fine. - [Reporter] And a moment that surprised us- - Looks good, sounds decent. (key clicking) Okay, so so far so good. (bell dinging) There's an OEM folder, including Lightroom. Do you wanna try Lightroom? - [Ken] Sure. - All yours. - [Ken] So this is actually a photo that I took of my new Supra. - Flex! - Flex. I took this with portrait mode on my iPhone, and Creative Cloud actually sunk this over the cloud into Lightroom over here, which is kinda cool. My only hesitation here, though, is that this monitor, the TN panel, is not particularly color accurate at all. So I can do my photo tweaks on this and get somewhat close to something that I would call decent, but I would want to check this on my phone to see if it actually looks good 'cause the screen on my phone is definitely way better calibrated than this one. Also, the graphics are definitely glitching on me right now. - [Austin] Are they really? - The UI is, it's having problems, and you kinda see, like, you see a little bit back there? - It's really hard for me to see on camera what the screen- - [Ken] Well, I mean, look at all that flicker. - [Austin] Oh, yeah! - [Ken] That's not hard to see at all. - So the pre-installed Lightroom app, not looking super-hot. One thing I will give Samsung: this is very easy to open up. So if you'd have a little just, like, knife or something just to pop these feet up, what you'll see that there are only four screws holding the back panel on. I'll just say there's almost definitely zero reason to ever do this. There's no way there's anything upgradable inside a Chromebook. Inside, the grand reveal is- (laughs) So this is our logic board. This is just an extension for the two ports here. We have two little speakers, and what is a 39-watt-hour battery, so a very small battery. This is 100% meant to be a smaller device that's, like, that wide, and they just, (snickers) they just designed it to fit. Well, the more you know! Now, we weren't originally planning on talking about this in the video, however, if you can stretch your budget just a little bit by about $100 or so, you could potentially get this. So this is a little bit of an unusual laptop. It is a Gateway laptop that, as far as we're aware, is exclusive to Walmart online. However, at $350, take a look at these specs. It is night and day difference compared to something like the Chromebook or the HP Stream. We've got a full Ryzen 5 processor. (bell dinging) We've got 256 gigs of storage, (bell dinging) eight gigs of RAM, (bell dinging) 1080p, USB-C. (bell dinging) I mean, there's a lot going for something which, yes, is certainly more expensive, but considering the trade-offs you have with those cheaper systems, is it worth spending another $100 to get what could potentially be a far, far better system? (lips smacking) I think we all know the answer to that. All right, I haven't seen this yet. It's green! (plastic rustling) You know what, I'm a fan of the green, although the logo looks kinda weird because it's like, it's like white on silver, so based on how you're looking at it. - [Ken] Oh, I like that, though. - It actually looks kinda like Aston Martin Green, except it's just plastic. (knuckles tapping) Oh, geez, that keyboard looks terrible! Wow, hang on, let me try this. (keys clicking) It's not quite as bad as it looks, but that is definitely bottom-tier of laptop keyboards I've ever used. So to put this in context there is a very popular Acer Aspire 5 that for a very long time has been one of if not the best-selling laptops on Amazon, and that has a worse processor and is typically 50 to $100 more expensive than this. So we can forgive some of the flaws, whoo! (screwdriver whirring) All right, first question: what is under this? I am assuming it's a empty M2 drive. It's probably full, actually, realistically. Oh, it's empty! Is it gonna be that easy to upgrade this with a second SSD? 'Cause if so, I am super-impressed. All right, let's pop open the rest of these screws. Oh-ho, boy, that's empty. (laughs) Oh, wow, wait a minute! Yo, yo, yo, some good stuff in here! So obviously, they coulda fit a bigger battery, but not only do we have our empty M2 slot, we also have one extra SO-DIMM. You can easily bump this from eight gigs to 16 and probably even 24 gigs of RAM if you want, and you have the one SSD here, which is already installed, but you've got the easy access to the second slot here. As simple and as basic as this is, for 350 bucks, I'm very impressed with the upgradability. Now, one concern I have is cooling. So a Ryzen 5 processor is not super-demanding, but that is one very small heat pipe and very minimal-looking fan. I would not be surprised if we run into some issues. Yeah, let me see if I get really close, I can hear it. (relaxed rock music) Where is the speaker? This is max volume So this is what the webcam looks like on the Gateway laptop, and I think the less said, the better. This is (oof) terrible. I'll say immediately, plug in a mouse, this feels so much better. This trackpad is just not good. Like, it's just not good. Let's see what we can do with some hardcore Minecraft gaming. (laughs) Look, man, Minecraft is still fun. Well, if you've seen our \"Building the Perfect Minecraft\" video, it can still be pretty demanding, right? I mean, we were flexing a 3080 Ti with Minecraft. Well, that's not a fast generation of a world right there. Whoo-hoo! That's a- I mean, that's okay, it's going. Whoa, all right, well, we're in, and that looks bad. That looks really bad. Okay, so we've got 10 FPS right now! Okay, yikes. All right, we're gonna just turn some settings down here (laughing) real quick. Now, we're (groans) 27 FPS. (groans) It's not great. Though to be fair, we are playing at 1080p, so if I just shrink things down a little bit, it will be better, but I guarantee you if we had more RAM, which is easy to install, right? If you install more RAM, you are gonna get a significant jump to performance. In the several months it's taken us to make this video, what have we learned? Well, first of all, the HP Stream is not good. You should not buy this. This thing just doesn't make any sense (laughing) for basically anyone to get. Okay, sure, now, when it comes to the Chromebook, thank you very much, this, I think, does make more sense. It is not a perfect system, but if you want a very cheap system, you should realize that there are limitations for it, and you should just live with that, right? I think the Chromebook does make more sense, and it belongs on the table, which means that the Gateway really is my best choice. For a little bit more money, you're getting a far better laptop with some compromises, but the compromises you make are actually really pretty reasonable, so don't cheap out, get a laptop which is actually decent, and make sure to subscribe to the channel, and ring-a-ling the ding-a-ling bell, and you'll be notified the next time Ken tries to fit a laptop in his pocket, and it just doesn't fit, and then it's an awkward gag for the end of the video.",
    "transcript_keywords": [
        "Stream",
        "laptop",
        "Chromebook",
        "laptops",
        "good",
        "full Windows laptop",
        "back",
        "Gateway laptop",
        "Windows laptop",
        "make",
        "bit",
        "pretty",
        "RAM",
        "Minecraft",
        "buy",
        "thing",
        "video",
        "stamps.com",
        "kind",
        "Lightroom"
    ],
    "transcript_entity_values": [
        "15-inch",
        "10-inch",
        "39-watt-hour",
        "220",
        "iPhone",
        "M2",
        "Building the Perfect Minecraft",
        "256",
        "first",
        "seven years ago",
        "2015",
        "AUSTINEVANS",
        "two",
        "Creative Cloud",
        "one",
        "Chromebucks",
        "Chromebook",
        "four-week",
        "249 bucks",
        "stamps.com",
        "up to 40%",
        "the several months",
        "OBS",
        "Aston Martin Green",
        "French Grand Prix",
        "2021",
        "the HP Stream",
        "Valorant",
        "Walmart",
        "K YouTube",
        "the day",
        "Ken",
        "Austin",
        "768",
        "Gateway",
        "Wishtery Tech",
        "Supra",
        "16",
        "zero",
        "Yo",
        "Switch and Save",
        "1,000",
        "FPS",
        "US",
        "100",
        "today",
        "24/7",
        "up to 66%",
        "an HP Stream",
        "Chrome",
        "Minecraft",
        "1,366",
        "10",
        "about $100",
        "Minecraft",
        "Amazon",
        "eight",
        "ASUS",
        "a few hundred dollars",
        "a few seconds",
        "the US Postal Service",
        "100%",
        "3080",
        "microSD",
        "UI",
        "Etsy",
        "HP",
        "the year 2021",
        "200",
        "Lightroom",
        "Microsoft",
        "Ryzen 5",
        "TN",
        "CPU",
        "eBay",
        "350",
        "max",
        "One",
        "27",
        "First",
        "Stream",
        "MacBooks",
        "USB-C.",
        "MacBook Air",
        "only four",
        "50 to $100",
        "Ryzen 5",
        "OEM",
        "350 bucks",
        "USB-C",
        "2,000",
        "HP Stream",
        "RAM",
        "as little as 180 bucks",
        "Samsung",
        "Windows",
        "the late 2000s",
        "Celeron",
        "4",
        "629 bucks",
        "second",
        "2012",
        "only around $300",
        "Chromebook",
        "Whoo-hoo",
        "Intel",
        "Four",
        "almost definitely zero",
        "24",
        "Acer Aspire 5"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "EVENT",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "PERSON",
        "EVENT",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "LOC",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "MONEY",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "LAW",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "MONEY",
        "NORP",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "DATE",
        "MONEY",
        "FAC",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.05572018772363663,
        -0.0010484163649380207,
        0.050939951092004776,
        -0.0007707143668085337,
        0.0624254047870636,
        -0.003976613748818636,
        -0.026681795716285706,
        0.05646223574876785,
        0.028616998344659805,
        -0.03111359290778637,
        0.016229135915637016,
        0.007113612722605467,
        0.01796058751642704,
        -0.03223072364926338,
        0.04434734955430031,
        -0.03990815952420235,
        0.11425002664327621,
        -0.14853720366954803,
        -0.03291359171271324,
        -0.07738559693098068,
        -0.058654095977544785,
        -0.07328386604785919,
        0.005800353828817606,
        -0.001556928502395749,
        0.1093657836318016,
        0.03159060329198837,
        0.01659003645181656,
        -0.03142818808555603,
        -0.0543350875377655,
        0.011628317646682262,
        -0.019000543281435966,
        0.02976103685796261,
        -0.06581108272075653,
        -0.009606520645320415,
        0.002606965135782957,
        -0.07564929127693176,
        0.049506139010190964,
        -0.004091151058673859,
        -0.010305376723408699,
        -0.04741750657558441,
        0.011262520216405392,
        -0.050346262753009796,
        0.00852532871067524,
        -0.029671577736735344,
        0.010710279457271099,
        -0.02681216038763523,
        0.011196215637028217,
        0.002043791813775897,
        0.05572148412466049,
        0.03168480470776558,
        -0.055165845900774,
        -0.08350678533315659,
        0.014127920381724834,
        -0.05690569430589676,
        -0.04591656103730202,
        0.0315001979470253,
        0.01915554329752922,
        -0.014061459340155125,
        0.021086618304252625,
        -0.023638350889086723,
        0.06028059124946594,
        -0.14548082649707794,
        -0.011716024950146675,
        0.020142516121268272,
        -0.042177464812994,
        -0.10157468169927597,
        0.017844483256340027,
        -0.027968211099505424,
        0.037624191492795944,
        0.0827566608786583,
        -0.006427671294659376,
        0.07782033085823059,
        0.09215421974658966,
        0.04935218766331673,
        -0.01685514487326145,
        -0.050133462995290756,
        0.07790490984916687,
        -0.06577420979738235,
        0.04751148074865341,
        0.11165180057287216,
        0.03480476140975952,
        -0.03786689415574074,
        -0.03578566014766693,
        -0.039030976593494415,
        -0.006241818889975548,
        -0.03209719434380531,
        0.048804353922605515,
        -0.08512755483388901,
        -0.016769614070653915,
        -0.053559668362140656,
        0.02531905472278595,
        0.037872813642024994,
        -0.029744144529104233,
        0.006048740353435278,
        -0.021150339394807816,
        0.05014711990952492,
        0.0428108312189579,
        -0.009685258381068707,
        -0.017520567402243614,
        0.028210030868649483,
        0.027038156986236572,
        0.031195487827062607,
        0.09849454462528229,
        -0.08395691961050034,
        -0.009523632936179638,
        -0.10508912801742554,
        -0.005063552875071764,
        0.0679464340209961,
        0.05649412423372269,
        -0.013825720176100731,
        -0.04691329225897789,
        -0.007204100023955107,
        -0.027608342468738556,
        0.0075407251715660095,
        0.0120606180280447,
        0.05788125842809677,
        -0.0636037290096283,
        -0.07535915076732635,
        0.021119989454746246,
        0.07107748836278915,
        0.0010038412874564528,
        -0.0001392028498230502,
        0.0024429690092802048,
        0.03315375745296478,
        0.004336293786764145,
        -0.022297317162156105,
        -0.09911744296550751,
        2.8949648755349124e-33,
        0.03143293410539627,
        0.04943304881453514,
        -0.06058935075998306,
        -0.10029137879610062,
        -0.01747741550207138,
        0.007033359259366989,
        -0.016486311331391335,
        0.010496151633560658,
        -0.01763717457652092,
        0.04737535119056702,
        -0.02589668706059456,
        0.008828251622617245,
        -0.09699220955371857,
        -0.0034753598738461733,
        0.08385731279850006,
        -0.003056913847103715,
        -0.11005865782499313,
        -0.01599196530878544,
        -0.04208305850625038,
        -0.02302577719092369,
        0.04068928584456444,
        -0.025940658524632454,
        -0.012991570867598057,
        -0.041615601629018784,
        -0.02001260593533516,
        -0.039175163954496384,
        -0.003807332133874297,
        -0.05214656516909599,
        0.031047401949763298,
        0.033271536231040955,
        -0.07098599523305893,
        -0.07526674121618271,
        -0.01674695312976837,
        -0.11619052290916443,
        -0.039952971041202545,
        -0.04176560044288635,
        -0.041006945073604584,
        -0.09256726503372192,
        0.050825174897909164,
        -0.054980289191007614,
        -0.11028353869915009,
        0.1134302020072937,
        -0.06656759232282639,
        -0.030233094468712807,
        0.034943241626024246,
        0.017717674374580383,
        0.015498744323849678,
        0.029898256063461304,
        -0.03782783821225166,
        -0.008074188604950905,
        -0.08807564526796341,
        -0.0015387660823762417,
        0.07596844434738159,
        0.030078385025262833,
        -0.06436390429735184,
        -0.011635348200798035,
        0.10581113398075104,
        -0.01413606759160757,
        0.08923127502202988,
        0.02857324667274952,
        0.035326242446899414,
        -0.024257326498627663,
        0.010436015203595161,
        0.010843957774341106,
        -0.025451667606830597,
        0.03973810374736786,
        0.106122225522995,
        0.08994318544864655,
        -0.07320065796375275,
        0.012109612114727497,
        -0.0017492070328444242,
        -0.04954596236348152,
        -0.0006270812009461224,
        -0.08979232609272003,
        0.07631497830152512,
        0.035742420703172684,
        -0.016017142683267593,
        -0.02082948572933674,
        0.02298433519899845,
        -0.00035390935954637825,
        0.013622013852000237,
        0.02030622586607933,
        0.035801347345113754,
        0.03685750439763069,
        -0.004511840641498566,
        0.07376017421483994,
        0.02882586605846882,
        -0.08002664893865585,
        0.022930612787604332,
        0.03397982940077782,
        0.009062669239938259,
        0.052135903388261795,
        -0.0519515722990036,
        0.005273841321468353,
        0.06237543001770973,
        -3.906160380942769e-33,
        -0.014797331765294075,
        0.03308379650115967,
        0.02201974019408226,
        0.05235930159687996,
        -0.014132551848888397,
        0.023962385952472687,
        0.00671655498445034,
        0.02488516829907894,
        0.026929475367069244,
        0.02621888555586338,
        -0.03952348604798317,
        0.0652226060628891,
        -0.033220600336790085,
        0.0334896594285965,
        0.07942308485507965,
        -0.05772916600108147,
        -0.035467471927404404,
        -0.07738720625638962,
        0.0651400089263916,
        -0.04766149818897247,
        0.0008962965803220868,
        0.026260675862431526,
        -0.024667048826813698,
        -0.01801852509379387,
        -0.023873576894402504,
        -0.030774366110563278,
        -0.10878138244152069,
        0.02875802293419838,
        -0.018583189696073532,
        -0.019797727465629578,
        -0.00540128443390131,
        0.008583754301071167,
        0.06347984820604324,
        0.05112435668706894,
        0.07985661923885345,
        0.033573251217603683,
        0.08853434026241302,
        -0.0030932000372558832,
        0.07771845161914825,
        0.008514541201293468,
        0.0840965285897255,
        0.05469817295670509,
        0.030772581696510315,
        -0.05920621380209923,
        0.07656093686819077,
        -0.02504725195467472,
        -0.03747323155403137,
        -0.0798133835196495,
        0.03413458913564682,
        -0.016989311203360558,
        -0.0040342798456549644,
        -0.012774846516549587,
        0.03769214451313019,
        -0.006385594606399536,
        -0.05852063372731209,
        -0.035239893943071365,
        -0.027898676693439484,
        0.06886500120162964,
        0.08407635986804962,
        -0.013835841789841652,
        -0.05322542041540146,
        0.01342407800257206,
        -0.0524626299738884,
        0.015427136793732643,
        -0.0180151779204607,
        0.020717600360512733,
        0.10269735753536224,
        0.04889539256691933,
        0.021254846826195717,
        -0.0567592978477478,
        -0.07193323224782944,
        -0.054386671632528305,
        -0.02891545183956623,
        -0.08148891478776932,
        -0.047590918838977814,
        0.07707440108060837,
        0.02644757181406021,
        -0.009850467555224895,
        -0.04539432376623154,
        0.008445858024060726,
        0.043974149972200394,
        0.009207627736032009,
        -0.0018626480596140027,
        -0.07174655050039291,
        0.01957021653652191,
        0.009665708988904953,
        0.01761949621140957,
        -0.05136426165699959,
        -0.09564352035522461,
        0.03889171779155731,
        -0.0031035589054226875,
        0.006713148206472397,
        -0.07806529104709625,
        0.010814297012984753,
        0.04050988703966141,
        -5.166426575442529e-08,
        -0.04185999929904938,
        -0.0017862544627860188,
        0.0662282183766365,
        0.06917909532785416,
        0.02064448967576027,
        -0.03767471760511398,
        0.016705771908164024,
        0.08817564696073532,
        0.10986712574958801,
        0.039992932230234146,
        0.06785043329000473,
        -0.12933607399463654,
        -0.008340398781001568,
        0.04294278472661972,
        -0.008562641218304634,
        0.06507962197065353,
        -0.045681267976760864,
        0.02957869879901409,
        -0.013620384968817234,
        0.019889401271939278,
        0.009346540085971355,
        0.04192199185490608,
        0.11622800678014755,
        -0.030876552686095238,
        -0.007655318360775709,
        0.023828662931919098,
        0.018436312675476074,
        0.028894195333123207,
        0.018940823152661324,
        -0.07217367738485336,
        -0.11987213045358658,
        0.036650400608778,
        -0.009266676381230354,
        0.04459819570183754,
        0.002220866968855262,
        -0.12167973816394806,
        -0.08671104162931442,
        0.018902620300650597,
        0.025690078735351562,
        0.0791296437382698,
        -0.015822086483240128,
        -0.045886214822530746,
        -0.08195923268795013,
        -0.025242554023861885,
        0.04054434224963188,
        0.013673308305442333,
        -0.025498537346720695,
        -0.11682850867509842,
        -0.01323192659765482,
        0.09210777282714844,
        -0.015976525843143463,
        -0.03417316824197769,
        0.10563459992408752,
        -0.014507239684462547,
        0.025515837594866753,
        0.0004274834063835442,
        0.004476500675082207,
        0.08289554715156555,
        -0.05848842114210129,
        0.04344440624117851,
        0.07144321501255035,
        -0.06883499771356583,
        -0.020058972761034966,
        0.05045520141720772
    ]
}