{
    "id": "Oncz48zbFSg",
    "title": "Diving with the Apple Watch Ultra!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-06-29T19:01:49Z",
    "video_url": "https://www.youtube.com/watch?v=Oncz48zbFSg",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 217943,
    "likes": 6337,
    "comments_count": 356,
    "description": "I had so much fun testing out the Apple Watch Ultra as a dive computer! Thanks to Oceanic for gifting the gear. Download the Oceanic+ App here:    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://apps.apple.com/app/id1610517133",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, it's Justine, and today, we are in Catalina, and we are testing out the Apple Watch Ultra as a dive computer. Now, originally I planned on coming to Catalina and getting my open water certification, but I went to the Maldives a month ago and ended up just doing it early. Now, this is an entirely different experience because this is diving in cold water, and in the Maldives the water was 87 degrees. It was so warm, you didn't actually have to wear a wetsuit. But here, it's a little bit different, and there's so much more gear involved. So I've got this seven millimeter super thick wetsuit. When I first got my ocean band, it was so large on my arm that I didn't actually understand the concept because I'd never dove or really ever worn a wetsuit before. It needs to be large enough to be able to go over top of a thick wetsuit, or even a thin wetsuit. And this wetsuit is actually so thick that I needed an extender. So the app that we're using is the Oceanic Plus App. Now, there's an Apple Watch app, and then there's a companion app that goes to your phone. So both of those will sync and work together. And there's also an Oceanic Apple Watch face, which is kind of cool because on here, it'll give you all of the things that you need. You've got your dive planner, okay-to-fly time, which is something that I didn't know that you have to actually wait time between your dive before you can fly. It's got a bunch of other really cool features. But now, my friends, it's time to go hop in the water, so let's go. (\"Airstream\" by Phello) Okay, so we're gonna do a little once over here of the gear. Since I've only basically dove once in my life, I need a little refresher course. I am open water certified but I wanna know as much as I can at all times. So all right, we've got all our gear. This is also all brand new. - Yeah, no worries. We'll get you all dialed in. - I don't remember all this part. It's kind of important. I feel like a sausage, 'cause a sausage is inside of a sausage casing. That's what I feel like right now. I gotta... I gotta breathe. (\"Exits\" by Felix Johansson Crane) All right, I think everything's good. Let's hop in. (\"Cloudy Dreams\" by Rambutan) It's so cold! Oh man, we just got back from the first dive in cold water, for me, and it was... Well, it was freezing. But it took me a while to kinda get used to it and once I got down there though, everything was okay. My buoyancy, haven't quite figured that out yet, but yeah, I'm excited for the next dive. (\"Slo - Mo\" by Aiyo) All right, dive briefing time. So I've got the Oceanic App up and we have our location planner. So since we're diving in Catalina... - Yep. We got our temperature tied. Maybe on this dive, we'll plan to go to about 50 feet. Aim for the swim platform, it's one of the reef wrecks in the park. - So no DecoPlanner, we just did a dive, so what does this determine? - It's gonna tell us how long we can stay at our current depth for our next dive, takes into account what we just did. And so we'll say... We'll enter the info of how long we're gonna stay on the surface until the next dive, and we'll add in the depth that we want to go to, and it'll tell us exactly how much we can do. - All right, it looks like we're ready to go out - Yeah, it looks like I got a plan, let's go get wet. - Let's do it. (\"Slow Royale\" by Luwaks) So I just finished my second dive of the day, and my favorite part now of diving is getting out and seeing all of my stats, seeing how far I've dove, seeing the depth, seeing the water temperature. And with the Oceanic Apple Watch app, it just automatically syncs to the iPhone app, so I can go in and see all of this information. And here are my two dives today. So our first one, we went a max depth at 44 feet. Our next one, we went 53 feet. And it's cool because this shows you your depth. I was struggling on this first one, trying to get my buoyancy. We dove for 34 minutes. Water temperature, 58 degrees. Oh, so cold. That's where we are. So I can go in and add some things about the dive, like the visibility, the surface condition. There was a little bit of current. Visibility was not as good on this last dive as it was on the first one. And there we go. We are all logged for our dives today. (\"Sweet Escape\" by Aiyo) Oh my goodness, I had absolutely the best time here in Catalina, diving. Now, to catch some of you up who may not know, I was terrified of the water about a month and a half ago. I didn't even wanna put my head underwater whenever I did the original Apple Watch review. And in that review, I said that the Apple Watch Ultra might be the thing to get me to be scuba certified. So now, here we are on Catalina, and the two days of diving that we did here was quite an experience. Coming from 87 degree, incredibly warm tropical weather, where I was wearing a very small wetsuit, a little shorty, like basically nothing at all, to here, where I would be wearing the equivalent of a snowsuit, definitely a whole new experience. I had an incredible instructor, \"Raneliketheweather\" is his Instagram and he was so awesome. We did a little refresher course the first day and the first dive. A huge thank you to Oceanic for hooking it up with all of the gear. And Oceanic is actually the company that makes the Apple Watch app on the Apple Watch Ultra. So a huge thank you to them again for making this all happen, and also giving me the confidence to be able to go out and do this in the first place. So to get to Catalina, we took the 6:00 AM ferry, so I got up at like 3:30. So that first day of diving, we were all absolutely exhausted. At 3:30 AM, this morning, I did not feel having breakfast, so I got this on the ferry over. We met up with Nick, who works at Oceanic, and Rane, he walked me through all of the things that I needed to know. I did learn everything that I needed to know to pass my certification, but getting this little refresher course on day one of all of my gear, all of the hand signals, everything that I needed to know to be safe in the water, was definitely great to have the refresher, especially because I got all this new gear from Oceanic. So now, being able to get familiar with gear that is my very own is such a huge difference. If it wasn't for the Apple Watch Ultra, I don't think that I would be diving. And I think that's the really cool thing, is I feel like this is such an accessible device for a lot of people. Now, obviously, you should always have a second dive computer. No matter what device you're using, you should always have a backup because anything can happen. I mean, a shark could come up and just take this off of you, and say, \"Hey, that looks nice. \"I think I wanna wear that now.\" So the first day of diving was a little sketchy, getting into the water. It was freaking freezing, beyond anything that I could have prepared my body for. And I did have a seven mil wetsuit, so it was very thick. We saw lots of fish. I also thought that the Garibaldi was a goldfish, but then I remembered that goldfish are fresh water fish and this is not fresh water, and that in fact is the California state fish. So that is probably something that I should know. I think my next investment is gonna be a little fish book so I can check off all the creatures that I've seen in the water. The really cool thing about diving in Catalina are these kelp forests. I mean, this kelp is just so remarkable. I mean, it's coming all the way from the bed of the sea to the top, and it's just floating through there. It was such a cool feeling. The other cool thing is we saw this massive sea bass. We actually saw a bunch of them. But this shot right here, I got so startled 'cause I did not even see him next to me, and I turned around, I was like, \"What are you doing there, buddy?\" We also saw a shark. I did not actually see the shark in person because I was so freezing, and this was our last dive of the day, and I was like, \"Guys, I gotta go. \"I'm actually shivering \"and I gotta peace out.\" But Devon, who's an incredible videographer, he does so many amazing underwater shots that I'm so grateful that he was able to come on this shoot with me. We got a really cool underwater housing for the Sony a7S III, and he went and got some really cool shots of the shark. Now, the Oceanic App is great for snorkeling as well so if you're not a diver, you can actually use this to snorkel. You can track your entry points, your depth, and how far you swam. And that's actually just free with the Oceanic App but if you do want to dive, and get access to your dive planning and tissue loading, there is a subscription, which is kind of great because for a lot of people who may not be frequent divers, the Apple Watch is great and you don't have to buy a full dedicated dive computer. You've already got one right here on your wrist. Now, my second day of diving was so much more fun. I was so much more comfortable because the first day, that first dive, I was still getting used to the gear, figuring out my buoyancy. I thought I would be a lot more terrified than I was. It actually wasn't bad at all. I really thought that the cold water was gonna affect me more. I did get some cramping in my legs. My feet were just like feeling a little weird. My whole body just kind of felt different. And once I got used to that, it made the second date that much better. But we had so much fun and we saw so many cool things. And I think my favorite thing was this little Garibaldi who was building this little nest, and anytime anything would get in its little area, it would go and pick it up and move it out immediately. It was actually really, really cute. Did a little exploring. I got to use Rane's flashlight and really see what I could see. My favorite thing that I saw though was this huge freaking lobster. I mean, look at this thing. It's massive! It's got a little tentacle out, like ready to come and get you. One of the things that I really like about this though is it gives you an alert when you need to make your safety stop. So it gives you a countdown of how long you need to stay at that depth before you completely ascend to the top. So if you find yourself at the surface and you need to go grab some weights or, I don't know, you forgot something, or you have to go to the bathroom, it will give you a countdown that will let you go back down to the surface and continue that dive, so you won't have to count it as a second dive. So right now, we've got 27 seconds to hop back in. We're not gonna be doing that just yet 'cause I'm really chilly. I had so much fun on Catalina and I look forward to getting my sister dive certified so we can do some really fun diving trips. If you guys have any suggestions of some gear that I should get, some tech that I should check out, places that I should dive, animals that I need to be on the lookout for, any tips and tricks, please leave them in the comments below because I am right now, I'm like a sponge. I am taking in all of the information, I am learning, and I want to know it all. So thank you guys again for all of the tips that you did give me in my first video where I talked about this, and I look forward to many, many more. With that, I'll see you guys in the next video. If you guys like this, please give it a thumbs up for me conquering my fears. I think that I deserve it. Don't forget to comment below and subscribe if you haven't already. Also, be sure to hit the bell for notifications when I post new videos. And if you wanna see any other ones, I'll put them here on the end screen. I'll see you guys in the next one, bye.",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Ultra",
        "Apple Watch app",
        "Oceanic Apple Watch",
        "dive",
        "Apple",
        "Watch",
        "Watch Ultra",
        "water",
        "Oceanic",
        "Watch app",
        "Oceanic App",
        "Oceanic Apple",
        "app",
        "Catalina",
        "diving",
        "cool",
        "wetsuit",
        "gear",
        "day"
    ],
    "transcript_entity_values": [
        "DecoPlanner",
        "the Apple Watch Ultra",
        "second",
        "Catalina",
        "One",
        "seven mil",
        "58 degrees",
        "seven millimeter",
        "Exits",
        "the next one",
        "about 50 feet",
        "Justine",
        "this morning",
        "Sony",
        "Rane",
        "iPhone",
        "about a month and a half ago",
        "next one",
        "Instagram",
        "the Oceanic App",
        "the day",
        "3:30 AM",
        "Airstream",
        "the two days",
        "Oceanic",
        "Oceanic Apple Watch",
        "the Oceanic Apple Watch",
        "3:30",
        "Devon",
        "34 minutes",
        "Cloudy Dreams",
        "Luwaks",
        "53 feet",
        "Sweet Escape",
        "Raneliketheweather",
        "87 degrees",
        "today",
        "6:00 AM",
        "day one",
        "two",
        "Garibaldi",
        "California",
        "Nick",
        "Catalina",
        "Oceanic",
        "87 degree",
        "27 seconds",
        "Maldives",
        "first",
        "the Oceanic Plus App",
        "Aiyo",
        "Apple Watch",
        "44 feet",
        "Felix Johansson Crane",
        "a month ago",
        "the first day",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "QUANTITY",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "DATE",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PERSON",
        "LOC",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "GPE",
        "ORDINAL",
        "LAW",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.022744188085198402,
        -0.08968143165111542,
        -0.006019324529916048,
        -0.09362946450710297,
        0.03526030108332634,
        0.024861635640263557,
        0.010167873464524746,
        0.018739109858870506,
        -0.023435628041625023,
        0.036149002611637115,
        0.029490310698747635,
        -0.017606979236006737,
        -0.04572637379169464,
        0.026626592501997948,
        -0.00849930103868246,
        0.023256005719304085,
        0.035006083548069,
        -0.027222925797104836,
        0.0003873255045618862,
        0.04656495526432991,
        0.012769335880875587,
        -0.0584610179066658,
        0.04116511717438698,
        0.01192083302885294,
        -0.02933800034224987,
        0.10945671051740646,
        0.001723490422591567,
        0.025936882942914963,
        -0.05673741549253464,
        -0.06349948048591614,
        -0.055802613496780396,
        -0.009991531260311604,
        0.07426787167787552,
        0.010052929632365704,
        0.007319456432014704,
        -0.044210661202669144,
        0.04276203736662865,
        -0.03147294744849205,
        -0.08517561107873917,
        -0.040949929505586624,
        -0.017781324684619904,
        -0.012396201491355896,
        0.04266338050365448,
        0.02584441564977169,
        -0.013362943194806576,
        -0.03929482400417328,
        -0.004582073539495468,
        -0.0216926671564579,
        0.07277120649814606,
        0.08624167740345001,
        -0.10084116458892822,
        -0.04921998456120491,
        0.052906062453985214,
        0.030668489634990692,
        -0.053663138300180435,
        0.010778284631669521,
        -0.08507002890110016,
        -0.026330633088946342,
        0.09614374488592148,
        -0.08969391137361526,
        0.09765627980232239,
        -0.04808429256081581,
        -0.008159168995916843,
        0.048668716102838516,
        -0.08117783069610596,
        -0.039163585752248764,
        -0.021911170333623886,
        0.018234530463814735,
        0.009801635518670082,
        0.014837349765002728,
        -0.10041526705026627,
        0.056512147188186646,
        -0.008253579959273338,
        0.004309832118451595,
        -0.018725484609603882,
        0.013098890893161297,
        0.020680833607912064,
        -0.12243030965328217,
        -0.040827300399541855,
        0.03515927493572235,
        0.028218213468790054,
        -0.09741233289241791,
        -0.0937642827630043,
        0.01708906888961792,
        0.03497099131345749,
        0.06139352545142174,
        0.009216608479619026,
        -0.01874980516731739,
        -0.036490000784397125,
        -0.0661536157131195,
        -0.0864485502243042,
        -0.03820495679974556,
        -0.02138715237379074,
        -0.012904757633805275,
        -0.014077462255954742,
        -0.05019194632768631,
        -0.0327761285007,
        -0.004885620903223753,
        -0.047047197818756104,
        0.05271567776799202,
        0.057977061718702316,
        -0.041642360389232635,
        -0.010194406844675541,
        -0.005049309227615595,
        0.019251635298132896,
        -0.12253271043300629,
        -0.010474298149347305,
        0.021834813058376312,
        0.04751728102564812,
        0.06207031011581421,
        -0.03853583708405495,
        0.05803362652659416,
        -0.033537399023771286,
        -0.004088274668902159,
        -0.010554960928857327,
        0.1401234120130539,
        -0.0738547220826149,
        0.07133786380290985,
        0.003952095750719309,
        0.03749629482626915,
        0.020450903102755547,
        -0.01999608241021633,
        0.012836291454732418,
        0.053714681416749954,
        0.04647671431303024,
        0.035857461392879486,
        -0.03766421973705292,
        1.0617457297866488e-32,
        0.004429391585290432,
        0.028727862983942032,
        -0.010975277982652187,
        0.024380942806601524,
        -0.026311688125133514,
        -0.06876776367425919,
        0.02106761373579502,
        0.08313889801502228,
        -0.011764940805733204,
        0.07732400298118591,
        -0.045801982283592224,
        0.06840295344591141,
        -0.03462418168783188,
        0.04947373643517494,
        0.04835052043199539,
        -0.07894924283027649,
        -0.0018812631024047732,
        -0.07334139198064804,
        -0.06976007670164108,
        -0.02933652140200138,
        0.03548404574394226,
        -0.014233257621526718,
        0.0034910335671156645,
        0.010722051374614239,
        0.058755144476890564,
        0.07391847670078278,
        0.03452528640627861,
        0.02319675125181675,
        0.10803033411502838,
        0.03884604200720787,
        -0.08930467814207077,
        -0.07342695444822311,
        -0.03838474676012993,
        -0.07178658246994019,
        0.019802002236247063,
        -0.003983370494097471,
        -0.03496628254652023,
        0.00886513851583004,
        0.0007613521302118897,
        0.02523697353899479,
        -0.05339159443974495,
        -0.014899526722729206,
        -0.06565659493207932,
        -0.10837560892105103,
        0.052960675209760666,
        -0.0034405533224344254,
        0.07459735125303268,
        0.1105116754770279,
        -0.011007694527506828,
        0.026821644976735115,
        -0.024401668459177017,
        -0.010203881189227104,
        -0.06538967788219452,
        -0.05132545158267021,
        -0.03320249915122986,
        -0.02874106727540493,
        0.0010356182465329766,
        0.05754590407013893,
        -0.0035939787048846483,
        0.08464449644088745,
        -0.021607914939522743,
        0.013930642046034336,
        -0.00013853675045538694,
        0.0045753587037324905,
        -0.08160955458879471,
        0.12405470758676529,
        0.061667345464229584,
        -0.030969901010394096,
        0.028466377407312393,
        0.028127964586019516,
        -0.02369445376098156,
        -0.00046547444071620703,
        0.07226816564798355,
        -0.002307100687175989,
        0.009933858178555965,
        0.021495560184121132,
        -0.08730348199605942,
        -0.03358970582485199,
        0.03123432584106922,
        -0.01081662718206644,
        -0.0949283018708229,
        0.06421732157468796,
        0.024896997958421707,
        0.1436082124710083,
        -0.04293914884328842,
        -0.014491078443825245,
        0.0028853185940533876,
        -0.043508514761924744,
        -0.02562727965414524,
        -0.01257262658327818,
        -0.016103168949484825,
        0.05060932785272598,
        -0.019186874851584435,
        -0.13181160390377045,
        -0.04399027302861214,
        -1.1351666661286273e-32,
        0.04033834487199783,
        -0.014265996403992176,
        0.00913548469543457,
        -0.040412258356809616,
        0.06658042967319489,
        -0.015106840059161186,
        0.023456687107682228,
        0.09166663885116577,
        0.021132348105311394,
        -0.0669785812497139,
        0.029132787138223648,
        -0.042866308242082596,
        -0.06445492058992386,
        -0.018717434257268906,
        -0.024643678218126297,
        -0.016059815883636475,
        -0.02169870212674141,
        -0.03703467175364494,
        0.04649213328957558,
        -0.019245285540819168,
        0.10094881802797318,
        0.10480358451604843,
        0.11514650285243988,
        0.007152714300900698,
        0.03321278840303421,
        0.0026906777638942003,
        0.06751453131437302,
        0.045462027192115784,
        0.0635996013879776,
        9.85493534244597e-05,
        -0.015279906801879406,
        -0.0031754672527313232,
        -0.02842409722507,
        0.01313230860978365,
        0.023033015429973602,
        0.05710924416780472,
        -0.007166489493101835,
        0.026845494285225868,
        -0.03141361474990845,
        -0.09894125163555145,
        0.03429553657770157,
        0.025571191683411598,
        0.020043380558490753,
        -0.012376522645354271,
        0.05273091048002243,
        -0.01655426435172558,
        -0.06632397323846817,
        0.04774704948067665,
        -0.03465291112661362,
        -0.031515032052993774,
        -0.08054610341787338,
        -0.08550991863012314,
        -0.03244980797171593,
        -0.02357172779738903,
        -0.036658577620983124,
        0.005239330697804689,
        -0.056770794093608856,
        -0.02623652294278145,
        0.030636895447969437,
        0.0030858837999403477,
        0.06405919045209885,
        -0.046631913632154465,
        -0.08216346055269241,
        -0.046464454382658005,
        0.01646912470459938,
        -0.025940049439668655,
        0.03008282743394375,
        0.026187611743807793,
        -0.042343270033597946,
        0.036433957517147064,
        0.004662742838263512,
        -0.008497458882629871,
        0.03194447234272957,
        -0.015643266960978508,
        0.04324568808078766,
        -0.015728022903203964,
        -0.06743180751800537,
        0.04123703017830849,
        0.03331802412867546,
        -0.05281267315149307,
        -0.02609802410006523,
        0.06297548115253448,
        0.05700650438666344,
        0.10018017888069153,
        0.11367323249578476,
        0.14441397786140442,
        0.04654298350214958,
        -0.01800582930445671,
        -0.012050993740558624,
        0.0675579309463501,
        -0.03998134657740593,
        0.0412294827401638,
        0.061524517834186554,
        0.08953632414340973,
        -0.060514748096466064,
        -5.584526618918062e-08,
        0.03198424354195595,
        0.043694574385881424,
        -0.01062239333987236,
        -0.01681908220052719,
        -0.007549996953457594,
        -0.07041358202695847,
        -0.056375935673713684,
        0.0005362185183912516,
        0.044824060052633286,
        -0.06515774875879288,
        0.0428609736263752,
        -0.047309376299381256,
        -0.0007332126260735095,
        0.12686127424240112,
        0.008345173671841621,
        -0.00994730181992054,
        -0.06234756112098694,
        0.0972912609577179,
        -0.039891235530376434,
        -0.044979844242334366,
        -0.05623313784599304,
        0.04307388514280319,
        0.04302601143717766,
        0.0036245037335902452,
        0.06844154000282288,
        0.03811272233724594,
        -0.06029709056019783,
        -0.03836853802204132,
        0.0520782545208931,
        0.011056720279157162,
        -0.05988050997257233,
        -0.0038459354545921087,
        -0.03867269679903984,
        -0.0019931558053940535,
        -0.09276048839092255,
        -0.051837753504514694,
        -0.06436211615800858,
        0.018192162737250328,
        -0.014983145520091057,
        0.01644868403673172,
        -0.02970312349498272,
        -0.09551343321800232,
        -0.06223372742533684,
        0.02386951446533203,
        -0.0011810464784502983,
        -0.07070697098970413,
        0.057199738919734955,
        -0.09846776723861694,
        -0.002171302679926157,
        -0.033893831074237823,
        -0.040986984968185425,
        -0.010000619105994701,
        0.032395072281360626,
        -0.03470412269234657,
        0.08832155168056488,
        0.06461810320615768,
        0.01858608052134514,
        -0.018563220277428627,
        -0.07689710706472397,
        0.007041827775537968,
        0.059588540345430374,
        -0.0010580926900729537,
        -0.10064476728439331,
        0.03941187635064125
    ]
}