{
    "id": "OnP3wnCOc70",
    "title": "iPadOS review: sounds like a computer to me",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-07T14:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=OnP3wnCOc70",
    "category": "Science & Technology",
    "tags": [
        "ipados",
        "ipad os",
        "iPados review",
        "review",
        "iPad os review",
        "ipad software",
        "ios",
        "os",
        "apple software",
        "catalina",
        "macOS",
        "ipad pro",
        "ipad",
        "new iPad",
        "computer",
        "macbook",
        "Mac",
        "iPad Air",
        "MacBook Air",
        "features",
        "specs",
        "Iphone 11",
        "iPhone 11 pro",
        "iPhone xs",
        "dieter bohn",
        "processor",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 389545,
    "likes": 13764,
    "comments_count": 725,
    "description": "iPadOS is finally here, which means it's finally time to see if Apple has turned the iPad into a real computer  maybe. In this episode of Processor, Dieter Bohn looks at the top things you should do to get the most out of iPadOS.  Read more from the review:  Check out The Verge's newsletter here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2olAOdx",
        "http://bit.ly/2LTk9Hj",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- All right. It's here. iPad OS. Well, okay, iPad OS 13.1.2 and maybe by the time you watch this, it's gonna be iPad OS 13.2. whatever. There've been a lot of bugs is what I'm saying and there's been a lot of updates to fix those bugs but look, here. It's here! iPad OS. And, after a year or two of me talking on this channel about the future of computers and what's a computer, it's go time. Apple finally shipped a thing with multiple windows, and the ability to use USBC drives, and all the rest. So here's a question, did Apple do it? Can this be your main computer? I mean, look, with computer interfaces, it's more about the journey than it is about the destination. Have you ever heard of Zeno's Paradox? Where to go from zero to 100, first you gotta get halfway and then you gotta get halfway again. And you always have to get those halfway marks and then you never actually get there. Yeah that's kinda how I feel about iPad OS. So for this review, I want to do something just a little bit different. Look, I mean, you've already installed this, right? You've got an iPad. I'm sure you're already using iPad OS. So want I want to do is talk about the things that I think you should definitely check out to make iPad OS and the iPad in general, more useful to you. Whether you're a pro or you just wanna use the dang thing on your couch. Also, have you noticed that the video quality is like, (mumbles) here? I'm doing this myself. The actual professionals are out there, busy editing more professional videos, so sorry about that. I'm gonna do my best and you can tell I'm screwing this up and I'm doing it on my own because I forgot the intro graphic. Intro graphic! All right, the first thing that you should check out on iPad OS is Apple Arcade. It is this thing in the iOS store that lets you pay five bucks a month for complete, full access to a whole bunch of iPad, iPhone, and even eventually Mac games that you just play for free. There's no in app purchases, there's no garbage or whatever. And five bucks a month seems cheap but technically, that's 60 bucks a year and I am sure that you have never spent 60 bucks a year on mobile games. So it seems like it's a weird thing for me to recommend you do here. But these games are great. They're just, they're beautiful, they're really good, they're really fun, they're really high quality. And, if nothing else, more people subscribing to Apple Arcade could mean that we get more games like this. It's totally worth it. You will feel way differently about your iPad than you did before. Plus, if you have a controller sitting around, like for an Xbox or PS4, it'll work with your iPad and it makes those games even more fun. The second thing is kind of a bonus thing. It's Sidecar. Which is technically a feature of Mac OS Catalina, which is coming out pretty soon. What it does is it turns your iPad into a second monitor for your Mac. You can either do it wirelessly, but I prefer to do it over USB. Also, if you have a lightning iPad, you should definitely just go spend, you know, ten bucks, on USBC to lightning cable. This one's from Anchor. Makes it way more convenient. Anyway, the Sidecar thing, you can, like, have the touch bar right on it if you want. You can get little option things. It doesn't make the touchscreen work for interacting with your Mac but you can use the Pencil on certain things if you want to do that. Oh that's fine. The bottom line is, having a second monitor for your Mac is really convenient. And to be able to do that when you're like, on the go is great. You should definitely check it out. Next, I want you to try the new floating keyboard. Now, a lot of people have been making fun of this thing and saying it's dumb, but I don't get it because I think it's great. When you have the onscreen keyboard, you can pinch on it and then the keyboard turns into a little iPhone sized keyboard that you can then move around anywhere on the screen. And then on that iPhone sized keyboard, you can use swipe typing to type really fast. I love this thing because if you're using the iPad in your hands, it's way easier than trying to reach your thumbs across to type. You can just use your right thumb or left thumb over on the side of the screen. I also love it because it doesn't take up the whole damn screen. It's just a little box that floats over what you're actually doing, so you have a much easier time doing stuff when you need to enter just a little bit of text on your iPad. The next thing I'm going to recommend is that you play around with the new Files app. The new Files app is pretty great. I think it works better with Cloud services. It supports USB drives now, which is awesome. And you can also just set up local folders wherever you want on the iPad instead of only depending on iCloud, which means you can just download stuff from Safari, which, it's all great! I love it! But it's not exactly like Finder on the Mac or Explorer on Windows. It still is a little bit iPad-y. And that's not necessarily bad, but it is different. And so if you are planning on having a workflow that really matters to you, you should play around with it at home or at the office or whatever until you know exactly how it's going to work and make sure that it works for you. In a previous video, I talked about not going into battle with an unproven rifle. And that's true. With the Files app, you need to make sure you understand how it works before you work with it. So just poke at it. Little poke. My last piece of advice for getting the most out of iPad OS is a little bit counterintuitive and that's, don't think about it too much. And I'm talking specifically about the windowing system because it is literally counterintuitive. iPad OS can do a bunch of new stuff with windows. A single app can have multiple windows. A single app can have multiple windows in Split Screen. You can have two different apps in Split Screen. You can have a bunch of apps sitting in Slide Over. You can take icons and turn them into windows. You can take links and drag them and turn them into windows. You can do all sorts of stuff to make all sorts of windows and they, like, come out of nowhere and they fly around, and you forget where they are, and it's just, it's a little bit confusing. And I've been thinking about this ever since I made that video where I talked about the grammar of user interfaces and I figured it out. The iPad mixes metaphors now. So on your phone, you use a time metaphor. You've got your current app and then your most recent app, and then when you go to Multitasking, it just kind of (mumbles) goes back in time. On your desktop, you use a spatial metaphor. So one window is here, one window is here, one window is here and you move them around in space. The iPad literally has both so the Multitasking view goes back in time with all your most recent apps in split screens but then there's also the spacial metaphor of, you know, the Slide Over apps over here, and the Split Screens are set up this way and understanding how time and space are relative to each other and relate is great for Einstein but for us regular slugs, you can get a little bit lost. I can't tell you the number of times I've tapped an icon and expected it to show up in a certain way and shows up in a completely different way. And, what I've learned, and what I'm telling you to do is not try and figure it out because the iPad is so good at apps keeping their state and opening them up quickly that if your set up isn't exactly what you want it to be, you can just make it what you want right then. Don't assume that your set up is going to stick around. Think of it like a Buddhist sand mandala where it's a beautiful thing but it's going to go away. Everything is ephemeral, everything disappears. Nothing is permanent, but it's still beautiful. So you can tell that this is a processor video I made by myself because by the end, we got to the impermanence of all things and Buddhism as a metaphor for user interfaces, so you're welcome internet. If you're looking for a classic review that goes over every single feature of iPad OS, don't worry. We've got your covered. It's over at theverge.com, link to it down in the show notes. But here for this review, what do I think of iPad OS? Well, you can read between the lines. I think it's really good, it's really powerful but that it has a steep learning curve if you wanna use it for professional things as your main computer. I'm weirdly proud of Apple for that. It was so worried that people would get confused and put off by complication that it use to treat this thing like a big iPhone, but now it's not afraid to make it a little bit complicated and just trust that people who need it will figure it out, and you know what? That sure sounds like a computer to me. Hey everybody, thank you so much for watching. I know this was a little bit different kind of a video, but it let me get my thoughts out there, so I appreciate doing that. And I'm gonna plug something else that lets me get my thoughts out there. It's our newsletter. It's at theverge.com/newsletter and I write one every day and it often has a big, long essay about what I think of the tech news of the day. So you know, please go subscribe to that.",
    "transcript_keywords": [
        "iPad",
        "thing",
        "windows",
        "Mac",
        "app",
        "bit",
        "Files app",
        "make",
        "Apple",
        "things",
        "time",
        "screen",
        "apps",
        "Apple Arcade",
        "great",
        "computer",
        "Split Screen",
        "Split",
        "bucks",
        "video"
    ],
    "transcript_entity_values": [
        "zero",
        "iCloud",
        "Einstein",
        "Split Screen",
        "USBC",
        "Mac OS Catalina",
        "iPad OS 13.1.2",
        "Finder on the Mac or",
        "one",
        "Apple",
        "PS4",
        "Slide",
        "USB",
        "the day",
        "Apple Arcade",
        "Explorer",
        "iPad-y.",
        "Pencil",
        "iPad",
        "five bucks",
        "13.2",
        "a year",
        "60 bucks",
        "Safari",
        "two",
        "Zeno",
        "the Split Screens",
        "Split Screen",
        "iOS",
        "Anchor",
        "Xbox",
        "second",
        "Cloud",
        "ten bucks",
        "first",
        "iPhone",
        "100",
        "Mac",
        "Buddhist",
        "Slide"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "NORP",
        "ORG"
    ],
    "vector": [
        -0.05894934758543968,
        -0.06478340923786163,
        0.0320747084915638,
        -0.07250889390707016,
        0.11643925309181213,
        -0.10196837782859802,
        -0.019293254241347313,
        -0.030575690791010857,
        0.029871182516217232,
        -0.00680411234498024,
        0.05843644589185715,
        0.037097346037626266,
        -0.13384303450584412,
        -0.013096547685563564,
        0.04726025462150574,
        -0.0052480753511190414,
        0.04502001032233238,
        -0.07255179435014725,
        -0.0642431378364563,
        -0.006714536342769861,
        -0.06211302801966667,
        0.053991105407476425,
        0.012326451949775219,
        0.03744508698582649,
        -0.04399040341377258,
        -0.0050108954310417175,
        0.018075168132781982,
        -0.03896261379122734,
        -0.06957022100687027,
        0.006934552453458309,
        -0.039474938064813614,
        0.07076199352741241,
        -0.02366943098604679,
        0.048596516251564026,
        -0.052432261407375336,
        -0.05211658775806427,
        0.05684865638613701,
        -0.03834157437086105,
        0.005713107995688915,
        -0.10853972285985947,
        -0.028852639719843864,
        -0.012282151728868484,
        0.011775858700275421,
        0.05683070421218872,
        0.023350711911916733,
        -0.02155337855219841,
        -0.007655775640159845,
        -0.06756360828876495,
        0.06649216264486313,
        -0.02707955427467823,
        -0.04591033235192299,
        -0.0724579319357872,
        0.03634601831436157,
        -0.0401235856115818,
        0.011457155458629131,
        0.02921435981988907,
        0.05727000907063484,
        0.05352618545293808,
        0.08494576811790466,
        0.07709860801696777,
        0.056985192000865936,
        -0.0810328796505928,
        0.018770240247249603,
        0.07231694459915161,
        0.03582436591386795,
        0.022918883711099625,
        0.030994677916169167,
        0.002289174124598503,
        0.010525829158723354,
        -0.03228647634387016,
        -0.015620572492480278,
        0.034978240728378296,
        0.0627078264951706,
        0.016612324863672256,
        0.020009566098451614,
        0.04007299989461899,
        0.01657928340137005,
        -0.0022176741622388363,
        0.054983872920274734,
        -0.0663091242313385,
        0.040544357150793076,
        -0.014662519097328186,
        -0.0017371708527207375,
        -0.011544760316610336,
        0.039348773658275604,
        -0.02341572195291519,
        -0.032783929258584976,
        -0.027250682935118675,
        -0.017741670832037926,
        0.02589784935116768,
        -0.008089943788945675,
        0.030219433829188347,
        0.09176866710186005,
        0.01129034161567688,
        0.08570795506238937,
        0.03129816800355911,
        0.03819293528795242,
        -0.09556227177381516,
        -0.06986816972494125,
        0.05802842974662781,
        -0.021814126521348953,
        0.07321719080209732,
        0.12226860225200653,
        -0.025155149400234222,
        -0.054335299879312515,
        -0.0049423035234212875,
        -0.006250795442610979,
        -0.004007662646472454,
        0.020976435393095016,
        0.03240186721086502,
        0.005071351770311594,
        0.017941907048225403,
        -0.027375193312764168,
        -0.019506053999066353,
        0.07858958840370178,
        -0.06698876619338989,
        0.02710846997797489,
        0.08172541111707687,
        0.05535591393709183,
        0.04301305115222931,
        -0.0010920894565060735,
        0.10089439898729324,
        -0.07601451873779297,
        -0.09038727730512619,
        0.015989987179636955,
        -0.0003230944275856018,
        -0.014589130878448486,
        6.3000560039248e-34,
        -0.01807205006480217,
        0.08161012828350067,
        -0.037139635533094406,
        -0.00995560735464096,
        0.04730161651968956,
        -0.10180272907018661,
        -0.027786796912550926,
        0.08226576447486877,
        -0.02174113504588604,
        0.0022146874107420444,
        0.04317225515842438,
        -0.06220722571015358,
        -0.06543170660734177,
        -0.00368440430611372,
        0.06330617517232895,
        -0.08998307585716248,
        -0.005128409247845411,
        -0.006523301359266043,
        -0.025094343349337578,
        2.977733856823761e-05,
        0.05017603188753128,
        -0.10979032516479492,
        -0.03416294977068901,
        -0.09516097605228424,
        0.03214269503951073,
        0.022524049505591393,
        0.013284065760672092,
        -0.04418477043509483,
        0.015833664685487747,
        0.020948044955730438,
        -0.10150911659002304,
        0.07973425090312958,
        -0.03705800324678421,
        -0.09749345481395721,
        -0.06739938259124756,
        -0.04673025384545326,
        0.016754887998104095,
        -0.08138010650873184,
        0.06071988865733147,
        -0.04577578604221344,
        -0.10120487213134766,
        -0.0017484226264059544,
        -0.07907675206661224,
        -0.010946620255708694,
        0.08015304803848267,
        0.03064482845366001,
        0.04997130110859871,
        0.03879568353295326,
        0.02869190275669098,
        -0.0034570954740047455,
        -0.09445782750844955,
        -0.017889203503727913,
        0.04597483202815056,
        -0.012295195832848549,
        -0.02263128012418747,
        -0.04742726311087608,
        0.03740096092224121,
        -0.07003594934940338,
        0.07039875537157059,
        0.04636641964316368,
        0.04050630331039429,
        -0.004602665547281504,
        -0.04766006022691727,
        -0.03391500189900398,
        -0.09020435065031052,
        0.046398717910051346,
        0.04191693291068077,
        0.04383888095617294,
        -0.04298325255513191,
        0.012948766350746155,
        -0.051467809826135635,
        0.019156236201524734,
        -0.034109923988580704,
        0.00101608841214329,
        -0.07026860117912292,
        0.02303457446396351,
        -0.060788702219724655,
        -0.012321400456130505,
        -0.07196229696273804,
        -0.003970799036324024,
        0.014433818869292736,
        -2.9937911676825024e-05,
        0.023254433646798134,
        -0.020019397139549255,
        -0.033285725861787796,
        0.0007142848917283118,
        -0.011548474431037903,
        -0.0020523671992123127,
        -0.006198630668222904,
        0.03842361271381378,
        0.023379327729344368,
        0.04512837529182434,
        0.028437228873372078,
        0.0815737172961235,
        -0.006237759720534086,
        -2.405125910300703e-33,
        -0.0715426355600357,
        -0.006188251543790102,
        -0.0709323137998581,
        -0.04779692366719246,
        -0.055163465440273285,
        -0.058628879487514496,
        -0.005223424173891544,
        0.011516466736793518,
        -0.001019987859763205,
        -0.08888109773397446,
        -0.05090036243200302,
        0.002202898496761918,
        -0.010462086647748947,
        -0.06898718327283859,
        -0.022185465320944786,
        0.04935175180435181,
        -0.05042605102062225,
        -0.0742250457406044,
        0.01828308030962944,
        0.014695008285343647,
        0.03174659237265587,
        0.03745357692241669,
        0.014360088855028152,
        -0.05477055162191391,
        0.055463481694459915,
        0.010485478676855564,
        0.044926825910806656,
        0.07822781801223755,
        0.04577014595270157,
        0.035291366279125214,
        0.07180529087781906,
        -0.06993068009614944,
        -0.03815177083015442,
        0.013688752427697182,
        0.12836039066314697,
        0.05872713774442673,
        0.059811223298311234,
        -0.09097310155630112,
        -0.05984809622168541,
        -0.021754875779151917,
        0.10615605115890503,
        0.04677830636501312,
        -0.07276742905378342,
        -0.032064441591501236,
        -0.0023164981976151466,
        0.06759580224752426,
        -0.006781670730561018,
        0.04645371437072754,
        -0.053065601736307144,
        -0.07992052286863327,
        0.05029362440109253,
        0.03657151013612747,
        -0.030755551531910896,
        -0.03773743659257889,
        -0.05765778571367264,
        -0.01665843464434147,
        -0.016383012756705284,
        0.029030321165919304,
        -0.0188513845205307,
        -0.03850133717060089,
        -0.040131017565727234,
        -0.03294607251882553,
        -0.010095781646668911,
        -0.0938657596707344,
        -0.0008617239654995501,
        -0.025130456313490868,
        0.027839265763759613,
        0.042883146554231644,
        0.02641693875193596,
        0.004697381518781185,
        0.032549574971199036,
        -0.020880762487649918,
        -0.05771375447511673,
        -0.08153722435235977,
        0.021473640576004982,
        0.09401639550924301,
        0.09266983717679977,
        -0.11236963421106339,
        -0.0695473700761795,
        -0.0025323720183223486,
        0.02418694831430912,
        0.08912060409784317,
        0.019655650481581688,
        0.030611762776970863,
        0.06568370759487152,
        0.0038476886693388224,
        -0.010010750032961369,
        0.02348022162914276,
        -0.06576409190893173,
        0.03704337775707245,
        -0.054657116532325745,
        0.001188657945021987,
        -0.05766034871339798,
        0.09643472731113434,
        0.03569614514708519,
        -4.998993574645283e-08,
        0.0015028234338387847,
        -0.006522810086607933,
        0.06081295385956764,
        0.0027629779651761055,
        0.07723890244960785,
        -0.04224304109811783,
        0.07417936623096466,
        0.043430395424366,
        0.014819500036537647,
        -0.01076024491339922,
        -0.05930861830711365,
        -0.04586043953895569,
        -0.04076568782329559,
        0.06939136981964111,
        0.0773238018155098,
        0.03671300411224365,
        -0.10006925463676453,
        0.059906166046857834,
        -0.026455983519554138,
        -0.1165638193488121,
        0.03130309656262398,
        -0.009286352433264256,
        0.023900050669908524,
        -0.045358527451753616,
        -0.030424101278185844,
        -0.011833974160254002,
        0.013397159054875374,
        0.032962121069431305,
        -0.0025717229582369328,
        0.05592796206474304,
        -0.05113375931978226,
        -0.0355759933590889,
        0.04817582294344902,
        -0.045764513313770294,
        -0.018316136673092842,
        -0.040731217712163925,
        0.03030480071902275,
        0.019974511116743088,
        0.08695299923419952,
        0.001920849084854126,
        -0.047666892409324646,
        -0.09779828041791916,
        0.028174497187137604,
        0.037000786513090134,
        -0.019333481788635254,
        -0.011642958037555218,
        -0.058525264263153076,
        0.01674492098391056,
        0.07330489158630371,
        0.04078932851552963,
        0.06553427875041962,
        -0.0407363586127758,
        0.09219387173652649,
        0.06854649633169174,
        0.06697490066289902,
        -0.04667912423610687,
        -0.024098331108689308,
        -0.023176169022917747,
        -0.016201158985495567,
        0.07567498087882996,
        0.11111342161893845,
        -0.05320931226015091,
        0.014141951687633991,
        0.08276061713695526
    ]
}