{
    "id": "OO23RTRIVGU",
    "title": "EASIEST Off Grid Solar Power... just like a little Lego",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-07-06T16:38:00Z",
    "video_url": "https://www.youtube.com/watch?v=OO23RTRIVGU",
    "category": "Howto & Style",
    "tags": [
        "Solar power",
        "solar",
        "off grid solar",
        "battery backup",
        "emergency solar",
        "solar generator",
        "folding solar panels",
        "solar panels",
        "ecoflow",
        "eco flow",
        "how to install solar",
        "what is solar",
        "how does solar work",
        "diy solar",
        "van life",
        "RV",
        "Portable solar",
        "off grid",
        "off grid solar power system",
        "Cabin solar"
    ],
    "views": 974610,
    "likes": 33785,
    "comments_count": 1413,
    "description": "Make the sun work for YOU. Get 5% off your #EcoFlow Solar System with code 'JerryRigEverything'  No more fumes and no more being tied to the grid. (Unless you want to of course.)  These EcoFlow solar panels and battery back up are perfecto for cabins, RV's, camping vans, or tiny homes.   Check out the Jurgy's Channel for the follow up video:  Or come stay at their RV park and see it for yourself:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.ecoflow.com/us/ecoflow-power-kits/?utm_source=KOL",
        "https://www.youtube.com/c/TheJurgys",
        "https://www.instagram.com/stayatthepark/",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "-[Nellie] So basically when the world ends we're going to be okay. -[Zack] Yep! -[Nellie] Wild! And Awesome! [Music playing] -[Zack] The sun's only going to be around for the next few billion years so we might as well use its juice while we can. Behind me is a giant fifth wheel RV. And today we'll be installing a complete off-grid solar package, and it's going to be a lot easier than you might think. This video is sponsored by EcoFlow. They probably have the most user-friendly battery backup and solar kit ever invented. It's all plug and play just like a little Lego. Let's see how long this takes us to install. The clock starts right about now. Let's get started. [Intro] With how windy it is today though, we might be better off installing a wind turbine, but maybe we'll do a video on that later. Let me introduce you to my buddy, Bryce. -What's up. -He owns an RV park in Swan Valley, Idaho, so he knows way more about RVs than I do. You might remember Bryce from the viral puppy video that was sweeping the internet a few years ago. Nice shirt by the way. -Thank you. -Want to give us a little tour of your crib? -Yeah. So this was a master bedroom. So this is a fifth wheel toy hauler, 44 foot...48 feet counting the whole front part. But this was our master bedroom. We converted it to the girls' bedroom. So we took out our...there was a king bed in here and we built bunk beds in here. Dressers and stuff for the girls. The bathroom's in here. This is basically the living room area. Fireplace, entertainment center, with our kitchen. Pretty sweet. -Oh, these LEDs on the counter top! -Right?! That's funny how you recognized that. You're like oh is that a strip before? And then this was a garage to put in a toy hauler, it's actually our bedroom. We converted it into our master bedroom so our bed comes down, and then during the day we took a trip to come here, so we just kind of put stuff here that we knew would be secure as we drove. -So what do you guys do now for electricity? -So actually we have a generator. Or we plug into power when we get to an RV park. -So I've heard it called shore power. Why is it called shore? No idea? -Cuz it's sure. -Different spelling. Anyway, today though we are going to install 8 solar panels on the roof with a 10 kilowatt hour battery backup system that will allow these guys to go completely off grid. -Yeah. I'm stoked for that. -What makes this solar setup so easy is that it comes in just 4 parts. Obviously we have the solar panels here. We have an inverter. This is where the solar panels plug in. There's no crazy wire snipping or splicing. The inverter is what connects the solar panels to the batteries to provide electricity for the RV, which is where this comes in. Also connected to the main hub. This is what's going to control the lights, refrigerator and AC units. It'll make a lot more sense when you see it all installed. The panels we're using on this project are 100 watt panels. A little bit smaller than the ones we used on my house. To be honest we could use the ones on my house here on the RV. The inverter would handle them just fine, it's just a little harder to situate them. And the 100 watts are a little more secure. So we're going to estimate where the hole goes. So about 32, about 6...hopefully it pops up right here. Measure twice, cut once. [Sawing sounds] There is a huge bundle of wires right where I'm cutting. Note to self, next time I do this we didn't check the panel above for wires. Turns out there are actually like 20 wires up there and now Bryce does not have TV anymore. So our hole was here and we came up right there. That's actually not too bad. Now it's time for some solar panels. [Music playing] So right above the bathroom sink, going into the wall, and then out the ceiling. We are wiring them all in series, plugging the positive and negative all the way around until we get to the inverter. The inverter can handle 150 volts worth as long as we stay under 30 amps. These panels here should be enough to charge up the 10 kilowatt hours of battery every day as long as the sun is shining. There are some portable solar panels that I'll show you in a second that we can use to supplement on cloudier days because as of right now we're only using one of the solar inputs on the inverter and there are three. So we have a whole lot more room to grow and expand later on. So in the kit that came with the solar panels, initially they gave us screws that were supposed to be self tapping into metal. The roof of the RV we're working on now though is just a half inch sheet of plywood. So we had to grab different lags with a more coarse thread that actually gripped the plywood, screwed everything down into place, and then poured RV roof sealant over the top. Just like how they've done with all the other vents, AC units, and skylights on this same roof. That keeps the water from getting down inside of the holes we just made. The panels are in place, generating electricity as we speak. Now we have to mount the rest of the hardware. If you're curious about this panel, it ties directly into the 12 volt system used to start their generator. So we're leaving this one in place, but they are two completely separate systems. Our system is going to be used to run the whole RV. This one is mostly just for that generator. Which now that I think about it, they don't even need anymore, but it's still good to have. You never know when you might need a backup. Solar's up top, the home for all the rest of the equipment is going to be in this cubby right here. We are charging up one of the batteries as you can see on this display. And this is the inverter. I'll explain more about it after we get it mounted on the wall. [Drilling sounds] Once I get the inverter mounted inside, it goes deep in this cubby hole. It'll be kind of hard to see. So I'll explain what's going on right now. Here we have an input for the alternator, but since this is towed by a truck we do not have an alternator so it can be used as a third solar bank. This one is where we're going to plug in the portable solar panels which I have not shown you yet, we'll get to those in a second. And this is where we're going to plug in the solar panels that are currently on top of the RV. This is where we plug in battery one, battery two, this gets us the 10 kilowatts. We have a battery 3, which we could plug into to get 15 kilowatts or a smart battery generator. This is where we plug in the AC in, which is coming from the control panel underneath the sink. So if we do park at an RV park or something and plug in, this will charge up the two batteries. This is just an extra plug so if Bryce wants to charge anything inside of this little tunnel he can do that here. Here we have the AC out which is going to the panel we just installed, and the DC out which is also going to the panel underneath the sink. And we have two can network ethernet ports, one coming from the display, and the other one coming from the panel underneath the sink. The system should almost be ready to go, we just have to get it crammed in this tiny hole. [Drilling sounds] Told you it was cozy back there. -[Bryce] I don't know if Zack has told you guys this yet, but if you buy this shirt, you'll have good luck for 7 years. Try me on it. Get it. Tweet me in 7 years. Tell me I was right. -[Zack] Woo! Yes. Got it. So the hardest part of this whole project was probably this. Right here we have the original control panel of the RV and we had to pick which circuits to bring over to the new smart panel. We have 30 amps of AC to work with, and 60 amps of DC. While the EcoFlow system is very plug and play, the most time consuming part of this project was just getting the wires run through the walls and the floor without causing any aesthetic damage to the RV. These wires are what transport the power from the inverter to the smart panel, which then keeps all the electronics and plugs working in the RV itself. Probably not my favorite wiring job, but we just took wires from here and plugged them directly into here. This is also the part of the project where you really want an electrician or someone who knows what they're doing, since with one wrong move here you could either fry your toaster or become a toaster. Right here we have the AC in from the inverter, and the DC in from that same inverter. The AC out, right here is coming from when we plug the RV into the shore power. We actually did find out what shore power means. It's actually taken from when ships come into port and plug in on the shore. So technically this RV is like a giant ship. What's nice though is that the first 6 circuits are all remote controlled. So those 6 circuits can be remotely turned on via the Mobile app. If my calculations are correct, I think Bryce is just about to finish cleaning up but his battery died. I'll explain this more in a second. Shall we see if you can plug in your battery? -Yes. Only thing is I think the charger is back at our RV park. -There goes the whole shot! The nice thing about having so much extra capacity and slots on the inverter is that if they ever are boon-docking or out somewhere without electricity, Bryce can roll out the folding solar panels and double the capacity of what we have on the roof. These as well are made by EcoFlow. Doing a couple tests on the system. Right now we are bringing in 1,000 watts with the solar on the roof, as well as the solar fold out panels. We're powering one mini fridge, still charging the batteries. Let's see what Bruce...you're turning on that fridge? -Yeah. It turned on! -Output just jumped way up. 700 watts. Wow, that's a beefy fridge. -Yeah, keep going electric. That's the best thing. Free energy. -Yep. What's cool though is you're pulling almost 1,000 watts from the sun and you're only using 700 watts on the fridge. So it's still charging the batteries even though the fridge is on. The other big drains on this system are going to be the microwave as well as the AC unit. Go ahead and nuke something. -Okay. -Output 2,400 watts, with 70% on our battery. You could run the fridge and the microwave simultaneously for about 5 hours. -Oh wow! -That's a lot of cooking in the microwave. So we just barely turned on the AC. So the blower just went on. 1,000 watts. So now we're almost using...we're 1.6 kilowatts with the AC and the fridge running and we can do that for about 9 hours. -I'm so pumped about that! Everyone else I talk to that has solar they're like, oh you could run it max like one hour, maybe two. -All day on a sunny day, and then on a cloudy day...I mean you could probably last...you don't even need air conditioning on a cloudy day. So we are officially done. I'm going to see if Bryce can give the tour. -Yeah, I know all things solar now. -Teach me, husband. -So our cubby that was just an empty cubby with no purpose now gives us life. We have two batteries from EcoFlow here. These are 3500 girderaters powerful. What are they? -[Zack] 10 kilowatt hours. -Okay, these will last... -Years. -Years, and years. -Each of the batteries...when he says that each of the batteries have 3,000 cycles because they are lithium iron phosphate. -So they're going to last us forever. So right here we have the inverter and it's locked and secure in there. We have 8 panels on top. -Basically when the world ends we're going to be okay. -Yup. -So everything's on solar right now? -Without being hooked up when we're in the middle of the mountains. -I don't know why I still thought we were plugged in, like we're not. -We're not plugged in. This is awesome. This is all solar. -So the sun is compensating for about half of the fireplace. And you can run the fireplace for about 7 hours. -Show me more magic man. -Okay. Remember how we always have to turn the generator on to nuke something to make oatmeal or whatever? -No, it doesn't work... -Just in the middle of nowhere it works. -And the water pump is also connected. -Okay, that's a big deal. -The fridge is not running on propane anymore because it's on AC. -It really is? So the propane...the only propane we use now is just basically a stove. -Yeah. -That's nice! -I had no idea before yesterday that this fridge runs on propane. And I'm not going to pretend to understand how, but it's very interesting that the fridge runs on propane. -Yeah. -Or electric. -Or electric. So we plug in the shore power, then it will switch over to electric. But when you're not immediate it goes to propane. But it hasn't switched. It's only on... -Wait, so how do you know? -So that's what it shows when we're plugged in for power but we're not in shore power, it's just running off of the solar panel. -That's wild. I'm excited to watch this video because I'm like how did you do all of this? How did you connect it to everything? -And all of the outlets, all of the outlets work. -All of them? Does that one work? -Yes. -Did you test it? -No. -I'll test it out. -Also, we had to keep the generator on to run the AC, but then we had to close the windows because the fumes are so bad from the generator. But now...well this is the control system but this...so year, this is just powering everything. So it's cool because it shows you charging time. So in 5 hours the batteries will be totally charged. -So are they charging as we're using it? -Yeah, see right now? Input 1.2 kilowatts. It's using half of that. -Okay. -It's a gauge because this rig is the biggest rig we've ever had, and literally when we drive somewhere the batteries are dead by the time with a long destination. Now they're going to be like more charge -We couldn't boondock, it was like not possible. And then if we want more juice we just put them on the ground and it'll charge even more? -Right. -Wild! And awesome! This is pretty cool! -Isn't this sick? We're in the middle of the mountains, we're good. -Zack, this is pretty cool. -Thank you very much. So these guys have been to all 50 states in their RV and now own an RV park in Idaho. -Yep. -So they...I've kept them here a couple days longer. I told them this project would take about 5 hours, and here we are three days later. But the wiring...running wires through the walls was one of the biggest issues. -That's because our rig's big right? On other rigs it'll be easier? -Yeah. -But also because we did that, you can't tell. It doesn't look any different. Except this right here. -No it doesn't. That's the only difference. -So it's all right here. All the fuses for solar. So everything that was here... -I don't even know... -That's okay. It's just styled. -I trust Zack. I trust everything's okay. -Speaking of which, they are going to, I mean obviously now we're super super excited about it, but we actually haven't used it for any amount of time. So in like a month from now they are going to post a video on their channel detailing in a 6 hour long, extravagant video of how the solar system is working. -We can. Zack said. -Maybe 6 minutes. -I already have a boondocking place in mind. I've got it. -Actually that's true, she found a place the other day and was like this is perfect, but we don't like having fumes and now we don't have to. -So where can they find you guys? On your channel and physically in real life. Where's your park? -Yeah, so it's in Swan Valley, Idaho. So it's just outside of the Tetons, and Jackson Hole. We're close to Yellowstone National Park as well. -What's it called, Bryce? -It's called The Park at Swan Valley. -Nice. -It's pretty awesome. And then we're The Jurgys. -Their links are right here and here. If you have any questions leave them down in the comments. Anything electrical I can probably handle. Thanks a ton for watching and I'll see you around. [Music playing]",
    "transcript_keywords": [
        "solar panels",
        "solar",
        "panels",
        "plug",
        "panel",
        "inverter",
        "solar panels plug",
        "Bryce",
        "Yeah",
        "portable solar panels",
        "fridge",
        "battery",
        "batteries",
        "park",
        "system",
        "power",
        "hours",
        "day",
        "wires",
        "shore power"
    ],
    "transcript_entity_values": [
        "the next few billion years",
        "Swan Valley",
        "3500",
        "Tetons",
        "like a month from",
        "Jurgys",
        "Solar",
        "150 volts",
        "6 hour",
        "Bryce",
        "48 feet",
        "6",
        "about 9 hours",
        "8",
        "-Maybe",
        "Lego",
        "the other day",
        "10 kilowatt hours",
        "Bruce",
        "two",
        "about 32",
        "20",
        "the 10 kilowatt hours",
        "15 kilowatts",
        "10 kilowatt hour",
        "three",
        "about half",
        "Jackson Hole",
        "-Teach",
        "about 7 hours",
        "a sunny day",
        "one",
        "a couple days",
        "AC",
        "6 minutes",
        "DC",
        "almost 1,000 watts",
        "half",
        "about 5 hours",
        "yesterday",
        "4",
        "2,400",
        "Swan Valley",
        "Mobile",
        "1.6 kilowatts",
        "100 watt",
        "12 volt",
        "fifth",
        "10 kilowatts",
        "a few years ago",
        "60",
        "-He",
        "first",
        "second",
        "three days later",
        "cloudier days",
        "3,000",
        "5 hours",
        "today",
        "RV",
        "Idaho",
        "70%",
        "third",
        "44 foot",
        "30",
        "3",
        "Zack",
        "about 6",
        "1.2 kilowatts",
        "700 watts",
        "50",
        "the day",
        "Yellowstone National Park",
        "RV",
        "1,000 watts",
        "7 years"
    ],
    "transcript_entity_types": [
        "DATE",
        "GPE",
        "CARDINAL",
        "LOC",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "TIME",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "DATE",
        "GPE",
        "GPE",
        "PERCENT",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "FAC",
        "ORG",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        -0.07507167011499405,
        0.12969554960727692,
        -0.04625103995203972,
        -0.021616503596305847,
        0.07088404148817062,
        -0.026041729375720024,
        0.08622480183839798,
        0.020748835057020187,
        -0.022641589865088463,
        0.06789204478263855,
        0.02383892424404621,
        -0.02761627919971943,
        -0.004327022470533848,
        -0.0039302692748606205,
        0.05951725319027901,
        0.017876215279102325,
        0.048114947974681854,
        0.012762678787112236,
        -0.025883622467517853,
        0.023739485070109367,
        0.005574294365942478,
        -0.046307045966386795,
        0.014834964647889137,
        -0.0836557149887085,
        -0.0005183312459848821,
        0.0652364194393158,
        -0.05521010234951973,
        0.05925348028540611,
        -0.1021002009510994,
        -0.030633091926574707,
        0.005611691623926163,
        0.0693293958902359,
        -0.09420919418334961,
        -0.00022589658328797668,
        0.08690883964300156,
        0.07499793916940689,
        0.03137694671750069,
        0.021450083702802658,
        -0.028594929724931717,
        0.021932587027549744,
        -0.006581970490515232,
        -0.10243333131074905,
        0.007570640649646521,
        -0.08963543176651001,
        -0.09480820596218109,
        -0.0018995979335159063,
        0.04506804049015045,
        -0.024674946442246437,
        0.05640644580125809,
        -0.04804302379488945,
        0.0028781811706721783,
        -0.014896801672875881,
        0.03834766894578934,
        -0.01733221858739853,
        -0.02068191207945347,
        -0.01930958218872547,
        -0.015127232298254967,
        -0.025594385340809822,
        0.0072229341603815556,
        -0.09238062053918839,
        0.03634325787425041,
        -0.04007842391729355,
        -0.10841292142868042,
        0.053825877606868744,
        -0.04811995103955269,
        -0.0532868430018425,
        0.023333780467510223,
        0.03237490355968475,
        -0.05820736289024353,
        -0.09357199817895889,
        -0.08152595907449722,
        0.006892428733408451,
        -0.05752888321876526,
        -0.027332354336977005,
        -0.05890080705285072,
        0.0059861065819859505,
        0.09312760829925537,
        -0.015822958201169968,
        0.052399709820747375,
        0.0024906196631491184,
        0.038580991327762604,
        0.070982925593853,
        -0.0338824987411499,
        0.03667014092206955,
        0.0020974366925656796,
        0.07872987538576126,
        0.012478000484406948,
        0.1375216841697693,
        0.011739776469767094,
        -0.03423014655709267,
        -0.06408268958330154,
        0.034831974655389786,
        0.0016996170161291957,
        -0.006841832306236029,
        -0.0026820513885468245,
        0.002019577194005251,
        -0.019163737073540688,
        -0.11941661685705185,
        -0.04030768200755119,
        0.06333252787590027,
        0.04327641800045967,
        -0.002493030857294798,
        0.05896991863846779,
        -0.05181455612182617,
        0.03677598014473915,
        -0.0021642348729074,
        -0.035225026309490204,
        0.08767732977867126,
        0.09320303052663803,
        -0.04295273497700691,
        -0.07292632013559341,
        0.023407643660902977,
        -0.028697744011878967,
        -0.004412009380757809,
        0.03291574865579605,
        0.032551489770412445,
        -0.024360716342926025,
        0.04738407954573631,
        0.05733488127589226,
        -0.021000897511839867,
        0.10464576631784439,
        -0.011538892984390259,
        0.0070682368241250515,
        0.07908661663532257,
        0.0814332440495491,
        0.09510380029678345,
        0.0675688087940216,
        4.8889342696576654e-33,
        -0.00044318035361357033,
        0.18893103301525116,
        0.023670395836234093,
        0.030754530802369118,
        0.03381384164094925,
        0.11745898425579071,
        0.014981797896325588,
        0.04694097489118576,
        0.006160188000649214,
        0.02094636671245098,
        0.008320962078869343,
        0.05583640933036804,
        0.03395318239927292,
        0.08590999245643616,
        0.009670382365584373,
        -0.13941554725170135,
        -0.022848891094326973,
        -0.07460378855466843,
        0.01849370449781418,
        -0.047113239765167236,
        -0.03786751255393028,
        0.011009445413947105,
        0.08854261040687561,
        0.022364109754562378,
        0.11867612600326538,
        -0.04790021479129791,
        0.055520884692668915,
        -0.021075313910841942,
        0.04401595517992973,
        0.035464152693748474,
        0.0099320774897933,
        0.0070898933336138725,
        0.055922459810972214,
        0.04219626635313034,
        -0.06292364001274109,
        -0.012771514244377613,
        -0.08469219505786896,
        -0.07294076681137085,
        -0.05324481800198555,
        -0.0772925391793251,
        -0.0013427668018266559,
        0.06874523311853409,
        -0.06331424415111542,
        -0.010256791487336159,
        -0.029861288145184517,
        -0.028482800349593163,
        0.040052056312561035,
        0.025513021275401115,
        0.001617665751837194,
        0.008500106632709503,
        0.00681752385571599,
        0.015199012123048306,
        -0.050496574491262436,
        -0.08216071873903275,
        -0.08633100241422653,
        -0.012861501425504684,
        0.016796240583062172,
        -0.019553931429982185,
        0.02411651611328125,
        0.007829442620277405,
        0.01440277136862278,
        -0.018212633207440376,
        -0.027256861329078674,
        0.004481836222112179,
        -0.016525693237781525,
        -0.03388643637299538,
        0.018198542296886444,
        0.04619252681732178,
        -0.09479686617851257,
        -0.014123406261205673,
        -0.017818108201026917,
        -0.036562949419021606,
        0.048555102199316025,
        -0.027796907350420952,
        0.08076096326112747,
        0.0405401736497879,
        -0.019176632165908813,
        0.0052566807717084885,
        -0.07670453935861588,
        0.011669481173157692,
        -0.10141882300376892,
        -0.019980184733867645,
        0.05570868402719498,
        -0.01914902776479721,
        0.024018125608563423,
        -0.1024310365319252,
        -0.031296372413635254,
        0.03447370603680611,
        -0.024501468986272812,
        -0.08261577039957047,
        0.05100308358669281,
        -0.03496548905968666,
        0.025579163804650307,
        -0.04817325621843338,
        0.008188154548406601,
        -6.723974623497337e-33,
        -0.033150479197502136,
        0.03435998782515526,
        -0.026490144431591034,
        -0.05267936363816261,
        0.11249001324176788,
        -0.026715019717812538,
        0.0619218647480011,
        -0.012140168808400631,
        9.925831545842811e-05,
        -0.07527679204940796,
        -0.09430597722530365,
        0.04289267212152481,
        -0.01638009399175644,
        -0.045711588114500046,
        0.052847132086753845,
        -0.0017070077592507005,
        -0.026953473687171936,
        -0.005594571121037006,
        -0.034438204020261765,
        0.026251330971717834,
        0.007363815326243639,
        0.06742517650127411,
        0.061827581375837326,
        0.04346919059753418,
        0.00440983846783638,
        0.02424771338701248,
        0.013158502988517284,
        -0.02699773758649826,
        0.03929835557937622,
        0.02425110898911953,
        -0.04222828522324562,
        -0.04907930642366409,
        0.011608689092099667,
        0.025125933811068535,
        -0.02142513357102871,
        0.0392281673848629,
        -0.01713947020471096,
        -0.012369551695883274,
        -0.059396713972091675,
        -0.02380053699016571,
        0.039297688752412796,
        -0.05930978059768677,
        -0.03272954747080803,
        -0.03656868636608124,
        -0.0849362164735794,
        -0.0507679283618927,
        -0.0755128487944603,
        0.03829539194703102,
        -0.06564949452877045,
        0.052719783037900925,
        -0.10043562203645706,
        -0.004846697673201561,
        -0.06959369778633118,
        0.0287898238748312,
        -0.012893383391201496,
        -0.03790996968746185,
        0.10724801570177078,
        0.06223051995038986,
        -0.05073857679963112,
        -0.009097074158489704,
        0.011319264769554138,
        -0.04242905229330063,
        0.07187855988740921,
        0.08199948072433472,
        -0.0175315048545599,
        -0.03822281211614609,
        0.07097972184419632,
        0.005605603102594614,
        0.004317115060985088,
        0.02350979670882225,
        0.0036374463234096766,
        0.03487703204154968,
        -0.026657266542315483,
        -0.08533267676830292,
        0.012058740481734276,
        -0.01624361425638199,
        -0.009623976424336433,
        -0.0060841599479317665,
        -0.0326576754450798,
        -0.04786457121372223,
        0.02758258767426014,
        -0.03997698798775673,
        0.00998064037412405,
        -0.024714557453989983,
        0.03895426169037819,
        -0.055713918060064316,
        0.03128322213888168,
        -0.05461728200316429,
        -0.021775778383016586,
        0.030189737677574158,
        -0.021344715729355812,
        -0.0136356670409441,
        0.02350136637687683,
        0.1516144871711731,
        -0.022551463916897774,
        -5.8601589358886486e-08,
        0.002311130752786994,
        0.038333211094141006,
        0.03375234454870224,
        -0.07910680025815964,
        0.009891988709568977,
        -0.0268393661826849,
        0.07441820204257965,
        0.040234725922346115,
        0.008787166327238083,
        -0.04021882265806198,
        0.048646606504917145,
        -0.032745104283094406,
        0.11089117079973221,
        0.030402744188904762,
        -0.02152860350906849,
        0.020205501466989517,
        0.021079253405332565,
        0.045472245663404465,
        -0.031956542283296585,
        0.006214698776602745,
        -0.10458209365606308,
        -0.06010100990533829,
        -0.025516865774989128,
        0.028042912483215332,
        0.050930656492710114,
        0.038890156894922256,
        -0.04463433101773262,
        -0.0067115346901118755,
        0.14372384548187256,
        -0.018496347591280937,
        -0.016381148248910904,
        0.001688252785243094,
        0.01311376690864563,
        -0.007265114225447178,
        -0.08070727437734604,
        0.004751342814415693,
        -0.10203305631875992,
        -0.03840664029121399,
        0.02208232879638672,
        0.046699509024620056,
        0.0021296110935509205,
        -0.004012072924524546,
        0.0076759085059165955,
        -0.016062533482909203,
        -0.05270795524120331,
        -0.006835359148681164,
        -0.06503179669380188,
        -0.1275755763053894,
        -0.016514919698238373,
        0.04840441793203354,
        -0.01296683494001627,
        -0.020037144422531128,
        -0.05788307264447212,
        -0.01650278829038143,
        -0.02009381540119648,
        0.04126819968223572,
        -0.10367298126220703,
        -0.022603580728173256,
        0.051072441041469574,
        -0.0053672487847507,
        -0.004301115870475769,
        0.035437680780887604,
        -0.057873111218214035,
        -0.009214790537953377
    ]
}