{
    "id": "OpvV1fl95V8",
    "title": "Ultimate PS5 Upgrade MYSTERY TECH!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-08-13T15:04:29Z",
    "video_url": "https://www.youtube.com/watch?v=OpvV1fl95V8",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "unboxing",
        "amazon",
        "ps5",
        "playstation",
        "gstory",
        "screen",
        "sony",
        "headphones",
        "austin",
        "austin evans",
        "denki",
        "ken",
        "this is",
        "matt"
    ],
    "views": 707731,
    "likes": 26260,
    "comments_count": 754,
    "description": "Watch @thisis on the Pixel 6a!   AND Ken's @Denki video on it:   Hardwear:  Not going to link Noggin Boss  G-STORY PS5 Portable Monitor on Amazon:  Shake Weight on Amazon:  Google Pixel 6a on Amazon:  Sony WH-1000XM5 headphones on Amazon:  Sony LinkBuds S headphones on Amazon:  Deity VO-7U microphone on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter titles: 0:00 Hardwear 0:54 Noggin Boss 2:00 Ultimate PS5 Monitor 5:54 Shake Weight 7:11 Google Pixel 6a 9:33 Sony WH-1000XM5 11:17 Sony LinkBuds S 13:25 Deity Podcast Mic",
    "description_links": [
        "https://youtu.be/ispKYlu6Xq0",
        "https://youtu.be/f2FQn1frNp8",
        "https://gear.xbox.com/pages/hardwear",
        "https://austin.tech/gstoryps5",
        "https://austin.tech/shakeweight",
        "https://austin.tech/pixel6a",
        "https://austin.tech/XM5",
        "https://austin.tech/linkbudss",
        "https://austin.tech/vo7u",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hardwear. Introducing Hardwear, designed by Gavin from Microsoft. Oh, a bunch of stickers. Save as. There's no Clippy sticker, though. (Clippy dings) Not saying it's a miss. I'm just saying, Clippy's there- - [Ken] The original VTuber. - Did you say, \"Clippy is the original VTuber\"? - [Matt] Don't like that. - Woo. All right. All right. All right. Okay. - Hold the back. - Paint. - Never not creating. Also, I'm just gonna say, you see this, right? This is a small. This is about twice as big as my small- - [Ken] Wow. That's like small when I'm in it. - Here, I'm just gonna... Be right back. - [Matt] Oh, he's gonna squanch. The noises that usually accompany this are... Oh God. - Jesus Christ. Did you have to do it with that much vigor? - Ah, oh, he's popping. - Why does it take you like five minutes to put on a shirt? - How dare you. (upbeat music) Yo. - [Matt] I didn't know some assembly was required. (Ken laughs) - Oh, the NOGGIN Boss! Oh! Okay. I actually know what this is. \"Shark Tank,\" right? - [Matt] This is a \"Shark Tank\" product. - It's just a big hat. - [Matt] It is a jumbo hat. - Oh, it's got the This Is logo on it. Oh. So if I try to put the hat on normally, it looks like my son wearing one of my hats. All right. Now lemme put it on. (upbeat music continues) - [Ken] Oh, that's funny. (Austin laughs) It looks weirdly normal. - [Matt] It's literally just a scaled-up baseball hat. That looks weirdly okay backwards. - [Ken] No, it does. - [Matt] How much do you think we spent on this? - With the context that it took six months to show up, and that it is custom embroidered, ah, 69.99. (upbeat music continues) - It's close to $200. - Let's go. I was right. - It was like $180 (Matt laughs). - You know what? I need to keep creating, otherwise This Is is gonna run this entire company outta business. Hello, my friends, and welcome to this next exciting item on mysterious technological inventions. I'm so glad that Jared's the one throwing and not Ken, 'cause Ken would've absolutely hit me directly in the neck. Integrated LED monitor for PS5. - What are the specs on this? It's probably on the back of the box. What are the specs on this? - 15.6 inch, it's HDR, FreeSync. Wait. - [Ken] I mean, everything that G-STORY has made is usually kinda er, but like it's fine. - [Matt] I got this Prime shipping on Amazon. - How much was it? - Like 300 something bucks. - Ow. - I think it was like 365. I balled out on this one. - [Ken] That looks so ugly though. - [Matt] It does. - [Ken] It looks terrible. - I haven't even opened it yet. Can we please let me do the mystery teching, and you do the mystery talking? - No, no. - It's our show. - [Matt] When you find an item, you can do the mystery talking. - Okay. So we've looked at several of these style of products in the past. Things like the Xbox Series S has a really neat little screen that we did a video on not too long ago. This is big. Wow. - [Matt] The PS5 is big. - Yeah. Okay. So it definitely on the backside fits on like a normal PS5 side plate. I have to obviously see what looks like on the PS5, but I mean, this looks PS5-ish. So for context, this is the size of a standard disc PS5. Now the G-STORY, once I attach it, should theoretically pop on something like this. That is not the same color. You see the match. I'm not sure how well that comes across on camera. That's not the same color. - [Ken] They should almost give you another shell at that point, to make it even. - How much is this again? - [Matt] So this was 380. - How much is the PS5 digital edition again? Was that $400? - [Matt] 400 bucks. (Ken laughs) - Okay. Just double checking. Just double checking. There we go. And all right, there we go. The height of style, my friends. The PS5 Pro, now available at your local YouTube clickbait emporium. So all you need to do is plug in the HDMI here, and then hop it over to the 4K60 on this side, and then you need to plug in the power adapter, which is annoying, so this is always gonna need its own external power. - One thing that this is doing way better already than the Xbox one, is you can just leave this on. You don't have to take this off. - Good point. - [Matt] Whereas the Xbox one, you had to open it up, because it was covering the fans. - Yeah, there's no cooling impact really at all here. - Which is like infinitely better than the Xbox one. - All right my friends. It's time to fire up this magnificent beast. So I'm gonna open it up. (PS5 beeps) No signal. Enter power saving. (upbeat music continues) I think something's supposed to happen right about now. Oh, there you go. - Yeah, Jared, that's why. - Jared, did you unplug the PS5 without properly shutting it down? - [Jared] I would never do such a thing. - Do you see how bright that is? That's a lotta nits, friends. So many nits that my eyes are blinded by my desperate pleas to subscribe to the channel and ringling the dingling button, so that we can keep this entertaining, engaging, and insightful content flowing to your YouTube subscription boxes. Thank you. - [Matt] We are at like a terrible angle over here, and that looks perfect. - [Ken] Is that the loudest it can go? - Good question. (buttons clicking) No. That's the max volume. I mean, these are two tiny little speakers, so it's not gonna give you that much, but- - [Matt] It sounds good. - It sounds fine. The screen looks good. For something portable, I couldn't ask for much more. - [Ken] Like I think this screen quality is the redeeming factor in this, for sure. - No, don't do it. He ran me outta road. You saw how good I was. I gave him plenty of space. - [Matt] I think you ran yourself off the road there. - Honestly, this contraption is huge, heavy. You almost need like a dedicated backpack to move something like this around. But if you were looking for a screen for your PS5, this is a solid screen, but I don't think I would actually buy it, 'cause I don't wanna take my PS5 around with me, 'cause laptops exist. My head is getting so big now I've caught so many items. Yes! Oh my God. The word sus didn't exist yet, but this is a little sus. Has anyone in this room ever used a Shake Weight unironically? - [Matt] Oh yeah. Yeah. - [Austin] I like how it doesn't say, \"As seen on TV.\" It just says, \"TV.\" - [Ken] Oh my God. - It's this big? Why does it need to be this big? - [Matt] For maximum Shake-Weightage. (Austin laughs) - It comes with an instructional DVD. (Austin laughs) How do I activate? Is there anything I need to do? I think it's just turn the button on, right? - [Matt] You just go. - No, you turn it on. Wait, you really just do this. - Yeah. It's not electronic, dude. (Shake Weight rattles) (Austin inhales) - [Jared] Don't sniff it. - It smells kinda weird. This is really it? This is how you Shake Weight? - [Matt] No, you give it a really good heft- - All right. All right. (indistinct) (upbeat music continues) (Austin roars) - [Matt] Lateral. Lateral. Lateral. - Shaking it! I'm shaking it. Really shaking it. Woo. - [Matt] Do I need to show you how to use the Shake Weight? - Matt, Shake Weight master. Help me rapidly sculpt my body. (Shake Weight rattling) (crew laughs) - Okay. That's actually pretty good. - You get a little. - [Ken] No, no, no, no, no, no. Definitely not. - I am not sure that's... I'm gonna watch the DVD and make sure that's allowed. Hello, Kinsey. - Hello. - What you got there? Is that? (package thuds) (Ken laughs) That was an incredible throw. That was an incredible throw. Inside we have? A we have- - Yes, 6a. - It's a Google Pixel 6a. - [Matt] Hashtag team Pixel. - Hashtag sorry for the Shake Weight. - [Matt] No one should ever apologize for the Shake Weight. - So I've taken a look at the Pixel 6, as well as the Pixel 6 XL before, and my problem with both those phones was something that's a little more unique to me, because, well, let's just say I'm a Flippy boy. I like small, tiny phones, and the 6a is the smallest of the current Pixels. Automatically makes it number one in my book. Ooh. That is a good color. That's a good color. - [Ken] Oh, that's really nice. - Ooh, wait, no. Oh, that's pleasant. - [Matt] Is it scratch and sniff? (Austin inhales) - No, it just smells. Smells like pine. I'm a huge fan of this color though. I think it looks terrific. And I like the way that Google does the little camera bar. If you're gonna have a camera bump, at least give me one that's not gonna rock all over the table. Like it's well-balanced. Now it does have an in-display fingerprint sensor, but the problem is, I've been using the S22 lately, and that's honestly better than this. Now I'm curious how the price to performance is gonna line up, because this is powered by a Google Tensor chip, and it does have two cameras, an ultrawide and the standard wide angle. The problem, and it's not a huge problem, but it's the older camera that's from the Pixel 5, 4, 3, and 2, I think. Less than ideal. - [Ken] Google's play has always been more software. So I think you're still gonna get most of the benefits, just optically, it's not gonna be as good. - That's the thing, as we kind of talked about with these phones, is they were so good. How do you get that much better? - So here, let's just get Matt and Ken. Ready, and (shutter clicks) okay. Of Kinsey looking cool. Now, if you wanna know more about the Pixel 6a, more than Austin's quick first hands-on, Shake Weight reaction... Hello friends. I'd like to bestow upon you the Pixel 6a. Would you please make a illuminating, high-quality, and impressive video on This Is and Denki, to explain to everyone the pros and cons of the Pixel 6a. Can you just make- - High quality? Meh, but yeah, we'll make a video. - Okay. Thank you. Oh! How long have you been holding on to these? These came out a while ago. - [Ken] What are they? - The 1000XM5s. - [Ken] Oh, probably a month. - These sat here for a month? I wanted to try these. I almost bought a pair. Okay. So the 1000XM5, specifically, the WH-XM5, not to be confused with my earbuds of choice. - [Matt] The WF. - The WF-1000XM4s, these are, I would say by a lot of tokens, the gold standard for over-ear, active noise canceling headphones. Did I see a Denki short on these or something? - [Ken] Wow. You watched my channel? Sony also sent me some. I unboxed mine on time- - Are you stealing my Sony friends? Nice packaging, cardboard. Although it looks premium. It's very eco. I could probably eat this if I tried hard enough. (box bangs) - [Matt] Why would you want to? - So I, oh, wow. That is, oh, oh. And it stays squished. You squish it and it slowly fills back up. - [Matt] It's called memory foam. - It's memories of my childhood. - [Ken] What? - Ah, let's go with some Vinyl Days. (upbeat music continues) I very rarely EQ headphones right out of the box, but that, it's a little trebly. It's a little trebly. - [Ken] I had to EQ mine as well. - [Matt] Would you say it's giving you some treble? - So yeah. I mean, sound quality is good. A quick EQ definitely helps a lot. I'll say I'm not the target demo on these, because while the active noise cancellation I can immediately tell is terrific, it's one of those things where for me, I don't typically use over-ear headphones when traveling. I know that this is like the best active noise cancellation, blah, blah, blah. This is too big. I would much rather take my headphones, my earbuds, and leave them in my pocket. I always prefer a good pair of wireless earbuds. (package clatters) (Austin laughs) These are the LinkBuds S. Okay, I'm excited for these. So while I think most people are probably gonna prefer a fully wireless set of like 1000XM5s, to me, much more interested in something like this. So these are significantly cheaper, because these are like 350 bucks. - [Ken] They're 400. - 400 United States freedom units? - [Ken] Yes- That's like 1100 Canadian rupees. - [Ken] They're still selling the M4s, so the M5s just slot above that. - So the LinkBuds S come in at $200. So it's almost kinda like these are a little bit more expensive than AirPods Pro, and these are a little bit less expensive, but both have active noise cancellation. I think these just lack wireless charging, right? Whereas these have it. So the problem with these is that they're big and chunky, right? These are the 1000XM4s, these are my favorite headphones, but when you put them in, not only are they a little bulbous, but also, I don't find them to be super comfortable, which has always been my issue. Now, that being said, they're so good that I'm okay with them being a little uncomfortable, but these, I can tell just in my hand are lighter, and certainly a lot smaller. Wow. That's it? It feels like I have nothing in my ear right now. That is actually, I'm immediately impressed, just by the comfortability and the light weight of this. Let me play with the EQ on these a little bit as well. (upbeat music continues) Ooh. And it does pause when you take 'em out. Okay. First impressions are good. I'd say they don't quite sound as good as the bigger brothers, but yeah, it's not maybe as quite as a rich and full of a sound. I'd say it's still 85, 90% as good, which especially considering the price difference, I don't think is a big downside. These might just be excellent when they go on sale, and typically all kind of Bluetooth headphones go on sale at some point, but I'm legitimately impressed. - [Ken] Are you gonna move though? Are you gonna switch? Isn't that the question? - I will spend some time with the LinkBuds. They're really nice. Like very nice. So it's been a few weeks since I've recorded this segment, and the LinkBuds S have absolutely replaced my old headphones, to the point where I don't think I've touched the 1000XM4s since I shot that, so thumbs-up. - [Matt] What's the next item? - What's the next item is a great question. It's the thing I just caught, the VO-7U. - [Matt] So this is a cool streamer microphone that solves all the problems you didn't know you had. - [Austin] I see it's got RGB. - Your streaming setup, if it doesn't have RGB, are you even really a gamer? - Okay. So inside we've got the manual, and actually, a lot of accessories. Wow. That's a dense microphone- - Hefty, right? - Can you see how fast it drops? 'Cause that's how physics work, right? Can I ask how much is this? - [Matt] So that one there is 180 bucks. - Okay. Not bad for a supposedly high-end microphone. I'm hearing a lotta handling noise. - [Ken] Pickups on the side, like the Yeti, right? - Side, side, side. Top. No, it's top, top- Ah, okay- - Oh, good. The way it's supposed to be. - I'm gonna get uncomfortably close to the microphone, 'cause that's how everything sounds good. I'm gonna be using just the regular voice recorder app for the test. It's not gonna give me the best quality in the world, but it should be fine. All right, I'm gonna start recording now. Hello and welcome to \"Austin's Mystery Corner,\" where today we have a very special guest, tech. I've got the volume all the way cranked up on the microphone right now, so you can really hear every little bit of the detail in my voice, including that little bit of a (tongue clicks) tongue pop. - [Ken] You have to do the... (fingers scrape) - Thank you for watching this episode of \"Mystery Tech.\" Subscribe and ringaling that dingaling button, so you're always kept up to date on the latest and greatest of technological inventions.",
    "transcript_keywords": [
        "Shake Weight",
        "Good",
        "Pixel",
        "Weight",
        "big",
        "Shake",
        "Gavin from Microsoft",
        "Yeah",
        "headphones",
        "Wow",
        "friends",
        "Hardwear",
        "side",
        "Clippy",
        "mystery",
        "Introducing Hardwear",
        "Xbox",
        "sounds good",
        "good color",
        "noise"
    ],
    "transcript_entity_values": [
        "85",
        "2",
        "Jared",
        "Hardwear",
        "M5s",
        "Austin's Mystery Corner",
        "350 bucks",
        "First",
        "Gavin",
        "the LinkBuds S.",
        "1000XM5",
        "EQ",
        "Clippy",
        "Google",
        "WF",
        "first",
        "4",
        "close to $200",
        "Amazon",
        "Ken",
        "69.99",
        "Austin",
        "a few weeks",
        "400",
        "RGB",
        "FreeSync",
        "400 bucks",
        "two",
        "the Shake Weight",
        "M4s",
        "Matt",
        "VO-7U.",
        "Shark Tank",
        "380",
        "HDMI",
        "Xbox",
        "1100 Canadian rupees",
        "180 bucks",
        "The PS5 Pro",
        "Google Tensor",
        "400",
        "90%",
        "Sony",
        "six months",
        "one",
        "YouTube",
        "ringling",
        "6a",
        "the Xbox Series S",
        "a month",
        "200",
        "Microsoft",
        "United States",
        "the Pixel 6",
        "180",
        "a Shake Weight",
        "Flippy",
        "Pixels",
        "Yo",
        "3",
        "Clippy",
        "Ken] Google's",
        "max",
        "the Shake Weight",
        "One",
        "Denki",
        "Mystery Tech",
        "Matt] Lateral.",
        "Kinsey",
        "Yeti",
        "PS5",
        "today",
        "Ken] Pickups"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "LAW",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "GPE",
        "FAC",
        "MONEY",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.12949281930923462,
        -0.07741215825080872,
        0.026888517662882805,
        -0.051947854459285736,
        0.10502555221319199,
        -0.00579395005479455,
        0.07933766394853592,
        -0.03765885531902313,
        0.002837918233126402,
        -0.00022363357129506767,
        0.02197565883398056,
        0.009999447502195835,
        -0.03820488974452019,
        -0.041104506701231,
        -0.0036134456750005484,
        -0.013570216484367847,
        0.026690544560551643,
        -0.045656636357307434,
        -0.02879563719034195,
        0.012722612358629704,
        0.0032063021790236235,
        -0.05341662839055061,
        -0.01191560085862875,
        0.06732100993394852,
        -0.001694418489933014,
        0.06431736797094345,
        -0.08290348947048187,
        0.04121674597263336,
        0.0036109760403633118,
        -0.0346425399184227,
        -0.04690807685256004,
        0.009086868725717068,
        0.0508209764957428,
        0.013333761133253574,
        -0.008532211184501648,
        0.002546369330957532,
        0.08394865691661835,
        0.04408955201506615,
        -0.08056279271841049,
        -0.0545492097735405,
        -0.010265637189149857,
        -0.04287496954202652,
        -0.07455645501613617,
        -0.0070723905228078365,
        -0.04384681209921837,
        -0.04794974625110626,
        -0.08210308849811554,
        -0.07135914266109467,
        -0.01166181918233633,
        0.023107292130589485,
        -0.052023135125637054,
        -0.09289506077766418,
        0.08653136342763901,
        -0.029764940962195396,
        -0.0443585142493248,
        -0.00929203163832426,
        0.049059681594371796,
        0.02463139221072197,
        0.07981061935424805,
        0.0057101077400147915,
        -0.007960090413689613,
        -0.12333303689956665,
        -0.018451182171702385,
        0.035386763513088226,
        0.04265378415584564,
        0.032904330641031265,
        -0.0057314676232635975,
        -0.025724848732352257,
        -0.05775846913456917,
        0.05149117112159729,
        -0.08163600414991379,
        0.007851406931877136,
        -0.012217430397868156,
        0.07696225494146347,
        -0.020753910765051842,
        0.019273824989795685,
        -0.0016650285106152296,
        -0.08373190462589264,
        -0.01297419797629118,
        0.011670966632664204,
        -0.034555673599243164,
        -0.049769334495067596,
        -0.0629986971616745,
        0.025058286264538765,
        0.03632624074816704,
        0.05796756595373154,
        0.012760772369801998,
        0.009294628165662289,
        -0.05562342330813408,
        -0.08138378709554672,
        -0.05738886445760727,
        0.037432391196489334,
        0.05236632749438286,
        0.02105928212404251,
        -0.038745950907468796,
        -0.052074916660785675,
        -0.04547399654984474,
        -0.007813886739313602,
        0.03340303525328636,
        0.06303229928016663,
        0.01891290210187435,
        -0.009822149761021137,
        0.07379285246133804,
        0.0054682777263224125,
        -0.012130578979849815,
        -0.10658664256334305,
        -0.0796026736497879,
        0.011104671284556389,
        0.010962977074086666,
        0.030371271073818207,
        -0.08001965284347534,
        0.04274878278374672,
        -0.0555945448577404,
        -0.03699779137969017,
        0.03452847898006439,
        0.003661635797470808,
        -0.08144086599349976,
        0.003690337296575308,
        0.06101306900382042,
        -0.08180709928274155,
        0.021369274705648422,
        0.00762327341362834,
        -0.10645238310098648,
        -0.009724587202072144,
        0.010499794036149979,
        0.00972863007336855,
        -0.013370262458920479,
        9.093942416119907e-33,
        0.02896593138575554,
        0.05336400866508484,
        0.019458631053566933,
        -0.06255791336297989,
        -0.0066660428419709206,
        -0.022653646767139435,
        0.007570334244519472,
        0.07061842083930969,
        -0.01491481065750122,
        0.04847797006368637,
        -0.011266018263995647,
        0.02790634147822857,
        -0.025211233645677567,
        0.011136193759739399,
        0.03741646930575371,
        -0.022443313151597977,
        0.003563042962923646,
        0.041661012917757034,
        -0.0485602542757988,
        0.014610834419727325,
        0.020753372460603714,
        0.02021644450724125,
        -0.010541153140366077,
        0.027959607541561127,
        0.02811255119740963,
        0.0701495110988617,
        -0.019928161054849625,
        0.02047780342400074,
        0.12130972743034363,
        0.03864093869924545,
        -0.1407506912946701,
        -0.03125467896461487,
        0.08781097084283829,
        -0.05508119612932205,
        -0.03753526881337166,
        -0.004145326558500528,
        -0.003840711200609803,
        -0.03289242833852768,
        -0.0047096614725887775,
        -0.003549656830728054,
        0.07022713124752045,
        -0.03433765098452568,
        -0.10534792393445969,
        -0.030551018193364143,
        -0.01308113057166338,
        0.00971270352602005,
        0.013094608671963215,
        0.03153861686587334,
        0.0005402065580710769,
        0.05310212820768356,
        -0.04180660843849182,
        -0.032188039273023605,
        0.01015159860253334,
        -0.037171781063079834,
        -0.030610941350460052,
        -0.13981734216213226,
        0.017296377569437027,
        0.011347782798111439,
        0.04692480340600014,
        0.02726086415350437,
        0.10005274415016174,
        0.037597332149744034,
        0.06283141672611237,
        -0.021958615630865097,
        -0.02642105333507061,
        0.0328960195183754,
        0.0828590989112854,
        0.07730957120656967,
        -0.0056069581769406796,
        -0.02308240346610546,
        -0.06200195103883743,
        0.11081144213676453,
        0.02556477300822735,
        0.017600202932953835,
        0.03181270509958267,
        -0.03668012470006943,
        -0.10020723938941956,
        0.009618645533919334,
        0.002985612489283085,
        0.010973792523145676,
        -0.05695812404155731,
        0.03806626796722412,
        0.012814498506486416,
        0.016611335799098015,
        -0.02339058741927147,
        -0.0013777107233181596,
        0.06394410133361816,
        -0.06554033607244492,
        -0.09368931502103806,
        -0.056434862315654755,
        0.013371700420975685,
        -0.023738032206892967,
        -0.045807845890522,
        0.04213517904281616,
        -0.09049452841281891,
        -1.0854561120583066e-32,
        0.029435331001877785,
        -0.0396864227950573,
        0.0551203116774559,
        0.0627249926328659,
        -0.014827302657067776,
        0.030186476185917854,
        0.055473826825618744,
        0.05979317054152489,
        -0.009292853064835072,
        -0.08843636512756348,
        0.0634264126420021,
        -0.03486593812704086,
        -0.026969844475388527,
        0.0131137166172266,
        0.019568156450986862,
        -0.009984121657907963,
        -0.08978161960840225,
        -0.017461111769080162,
        0.03419465944170952,
        -0.009179607033729553,
        0.14555057883262634,
        -0.044476959854364395,
        0.0573006235063076,
        0.07598666846752167,
        -0.03996317461133003,
        -0.013488056138157845,
        0.05420300364494324,
        -0.062401656061410904,
        0.06083417683839798,
        0.013413059525191784,
        0.0019671551417559385,
        0.02705477736890316,
        -0.08365625143051147,
        0.013364453800022602,
        0.08889399468898773,
        -0.02400805801153183,
        0.01852760650217533,
        0.06633599102497101,
        0.008765142410993576,
        -0.07383062690496445,
        -0.044642124325037,
        0.058366987854242325,
        0.024293025955557823,
        0.006299600005149841,
        -0.008055106736719608,
        -0.09254328906536102,
        0.0009169455734081566,
        0.032488830387592316,
        0.004135844763368368,
        0.01630263216793537,
        0.0360306054353714,
        -0.015149620361626148,
        -0.018139395862817764,
        -0.007560873404145241,
        -0.1329057663679123,
        0.032775335013866425,
        -0.11135655641555786,
        0.016912704333662987,
        0.010834439657628536,
        -0.0007083354867063463,
        -0.00031274626962840557,
        -0.0464426651597023,
        -0.11763013154268265,
        -0.04114677384495735,
        0.015383477322757244,
        0.08206015825271606,
        0.10840179771184921,
        0.026357652619481087,
        0.010655547492206097,
        -0.03090820275247097,
        -0.03735709562897682,
        -0.007871839217841625,
        0.07989832013845444,
        -0.05138590559363365,
        0.04238859936594963,
        0.0650971308350563,
        -0.03829685226082802,
        -0.016919344663619995,
        0.0012760597746819258,
        0.026429709047079086,
        -0.02928111143410206,
        -0.0012401074636727571,
        0.04041443392634392,
        0.03686200827360153,
        0.019513007253408432,
        0.025783758610486984,
        -0.016433387994766235,
        0.01958068087697029,
        -0.012937030754983425,
        0.031275633722543716,
        -0.029920989647507668,
        0.029359715059399605,
        -0.01664508506655693,
        0.1280953288078308,
        0.004390398971736431,
        -6.588292222886594e-08,
        0.07247572392225266,
        0.022770022973418236,
        0.020958738401532173,
        -0.053706586360931396,
        0.06830242276191711,
        -0.07507448643445969,
        -0.027444111183285713,
        -0.07828857004642487,
        0.04773937165737152,
        0.02283756621181965,
        0.09227310866117477,
        -0.07158645242452621,
        -0.04473065957427025,
        0.05797172337770462,
        -0.02345120906829834,
        -0.02393416129052639,
        -0.06663891673088074,
        0.09991743415594101,
        -0.015993861481547356,
        -0.03691724315285683,
        -0.08501507341861725,
        -0.014908800832927227,
        0.11261314153671265,
        -0.0925503745675087,
        0.038541778922080994,
        -0.049364928156137466,
        -0.09315716475248337,
        0.05017981678247452,
        0.05639832466840744,
        -0.044702984392642975,
        -0.022486593574285507,
        0.024378938600420952,
        -0.011496526189148426,
        -0.06709352135658264,
        0.07231271266937256,
        -0.005819751415401697,
        -0.061083726584911346,
        0.030315613374114037,
        0.03934667631983757,
        0.04067741706967354,
        0.01762549951672554,
        -0.19276967644691467,
        -0.026878686621785164,
        0.030635051429271698,
        0.007874718867242336,
        -0.05993925407528877,
        -0.026360277086496353,
        -0.10334170609712601,
        -0.041734401136636734,
        -0.0121199581772089,
        -0.010301110334694386,
        -0.026678545400500298,
        -0.005151009187102318,
        -0.006167041137814522,
        0.013561743311583996,
        -0.006190948188304901,
        0.047903452068567276,
        0.004670097026973963,
        -0.02007916569709778,
        0.02781912125647068,
        0.030910378322005272,
        -0.03487202152609825,
        0.058248214423656464,
        0.11188291758298874
    ]
}