{
    "id": "oqysv9Ft2LM",
    "title": "iMessage on Android",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-03-27T15:54:00Z",
    "video_url": "https://www.youtube.com/watch?v=oqysv9Ft2LM",
    "category": "Science & Technology",
    "tags": [
        "imessage",
        "android",
        "android imessage",
        "imessage for android",
        "imessage hacks",
        "apple",
        "airmessage",
        "airmessage imessage",
        "airmessage review",
        "messaging",
        "messaging apps",
        "mac",
        "mac mini",
        "google",
        "air message",
        "imessage on android",
        "how to get imessage on android",
        "how to",
        "tech",
        "iphone",
        "this is",
        "austin evans"
    ],
    "views": 1515270,
    "likes": 41328,
    "comments_count": 7505,
    "description": "iMessage for Android is here, it's legit and it's not (that) hard to setup. AirMessage:  The full install guide:   Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://airmessage.org/",
        "https://airmessage.org/guide/",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. From time to time, you might want to message someone and have them actually respond. Hi Wes. - Hi. - You've had this issue before I hear. - Oh, I have this issue all the time. So, like many people out there, I am on Android. - Yes. - But to the rest of the population, I'm not seen as, Wes or as a nice guy, or just someone with a phone of their choice. - You're a green bubble boy. - I am a green bubble boy. (dramatic music) I'll set the scene for you a little bit. So imagine there you are, you're on whatever dating app you want. Maybe it's Tinder or Bumble or Jdate, FarmersOnly, Mutual for our Mormon friends. And then everything's going really well-- - I like to think you've tried every single one of those. - I have actually. (laughs) Then you get to the point where you got to exchange phone numbers. Now usually, this is usually a great point in the conversation, but this is where I start to become worried because they're about to find out my dark truth-- - Green bubble boy. - I'm a green bubble boy. It's a very real thing. It's ridiculous. But I knew that I needed to find a solution, so-- - I mean, there is the solution you can go to apple.com/iphone. - Yeah, but I wanted to find a solution for the cool people like me. We are in a very strange time, obviously, where SMS, despite being the standard for text messaging, really is fading. - I mean, you have most of the world that's on WeChat or LINE. - Facebook Messenger. - Yep and iMessage. - And people want more features, they want a cooler messaging experience. It completely makes sense. - But there's still, especially here in the U.S., there's not one thing to rule them all, right? Typically speaking, a phone number not only allows you to call, but also to text. If you have iMessage, it's a completely seamless process. So what do you need to get iMessage up on Android? Obviously there's a Mac mini involved somehow. - There is. So there have been a few attempts at this throughout the years. A lot of the solutions have been focused on how do we jerry-rig iMessage onto an Android phone which doesn't really work well. Apple tends to knock those down pretty quick. But what someone realized kind of recently is hey, if we just get a Mac computer as the central device to essentially ping the messages through, we might be able to make an app on the phone side that interfaces with that. I don't own any Apple or Mac products. I'm here with my Chromebook and my Android and my Android wear device, yeah. So I wasn't about to go drop a ton of money on a Mac. So in order for this to work, you need a Mac that can run Yosemite, so 10.10 or higher. - That's not bad at all. - In fact, this 2010 with a Core 2 Duo is running High Sierra. - Oh, okay. - Which is amazing. - That's not bad. - To be perfectly honest. - All it really needs to do is, not only run iMessage, it also needs to run, what's the program called? - It's called Air Message, so, yeah. - Air Message. - And it's only two pieces of software. You have an app on your phone, which is a messaging client that honestly looks pretty identical to Android's messages app already. And then it's a tiny little piece of server-side software, that sits on the Mac, and if you want you can honestly buy a Mac Mini on eBay for under 50 bucks that will do this. - And the other advantage here is not only if you were to do something like this, you have a Mac Mini which is perfectly capable to be run as like a Plex server, or anything like that or alternatively, if you have a Mac, or someone else has like an old Mac, or even if you have a brand new one, all you do is just load up this piece of software, and your Android phone is ready to go with iMessage. iMessage on Android: Blue bubble messaging for your favorite phone! - And it's amazing, they don't even disguise it. They know this is a problem. It is straight front and center, blue bubble messaging - Oh, it's from the internet, do you wanna really open something from the internet? - I've heard of the internet. - It's not good. - That was quick! Alright, so it's already up, cool, love it, great. - So it just runs as a small program on the top of your bar? - Just a little program on the top of the bar. It'll show you how many clients are connected, which is a nice little security thing, And just gives you preferences on a few different ways to connect. And this actually is a really big deal for this project, because with every other attempt it's always been very insecure, you've had to go through someone else's server. - Yeah, I don't want to deal with that. - Yeah, that's mad sketchy. You just want to connect straight to your device, and go. - [Austin] Oh, so you're going to actually have to do some DNS settings to make sure that port forwarding is set up? - We are, but the great news is that it's dead simple, and it works incredibly well. - So, I'm guessing you need to just use an email, right? Unless you had a phone number attached to your Apple ID? - Yeah, so the phone number part is a little sketchy, but when you message someone, it will popup normally as their email, and not a phone number - Right. - Which, you know, you can just make some excuse. Which is actually exactly what I did. I just said, oh haha. I don't know why that happened. - I really actually think a fair few people probably use iMessage with emails anyway, right? - I don't know, I'm new to this. - And, you can also check how often it scans for new messages, which is kinda neat. So about how often would you typically set it to? - I normally keep it at one second, just to make sure that nothing jams up. And, welcome to Air Message, yay! So now what we have to do is set up our port forwarding. So this-- - So this is going to be very much dependent on what your router is and everything, but you basically just need to log into the router, and clear whichever port the Air Message wants to be set up to go out to your phone. Because the other advantage here, is that you obviously don't need to have your phone on Wi-Fi, right? So I think the phone we're going to be using here is this S10e, which is specifically not on wifi, just to show that no matter where you are, connected to LTE or whatever, iMessage is going to work exactly the way that you would expect it, if you were using an iPhone. - So by using a DDNS service, which there are tons of free amazing ones that are very easy to use, you can basically make a fake website, that just points at your IP as it changes and then you put that website into the app that'll live on your phone. So instead of having to change your IP all the time, which was a problem with one of the older projects, that I tried, and changing your IP address every 30 minutes. - It's not okay - It's not okay. So yeah and with this, all you have to do is just pick what you want your host URL to be-- - I'd say blue bubble boy is the only option. - Blue bubble boy is the only way to go, and then they have all sorts of-- - Different domains that you can take advantage of. So it's legitimately like a five-minute setup process on your Mac. - Yeah, it is incredibly quick, incredibly easy, and honestly just their guide that they have on their website. - Which we'll of course, we'll link in the description. - Yeah, it's dead simple to use. - Cool. So the next step is we need to download it on the phone. - Yeah, and here's what's really cool, the Air Message app doesn't have to be side loaded it's in the Play Store. This has never been done before, you've always had to side load it. - 'Cause you're not really technically breaking any rules, right? I mean, iMessage is landing on the Mac exactly the way it's intended to be, and there's just an application which just so happens to take that message and forward it on to something else. - Exactly. - Apple messaging on your Android phone, Mac computer required. Man, I'm actually like really surprised to see that in Play Store. - I think just the amount that it feels like a non-sketchy thing, - Yeah. - It just goes so far. - Hey! - There you go. - So when you type the password in correctly, it works! Alright, so I'm going to message you, at blue bubble boy and see if it works. - Yeah, go for it. - So, it pops up as MMS. Oh, there we go, we're blue, alright! Hi bubble. - There it is. - Hey! - Boom. - Hi bubble boy Dude! - And it even has-- - It's seamless! - Yeah, it's that seamless, and even right there, notifications, you have mark as read or reply just like you would have-- - Again, we are not on wifi here so the Mac mini and my phone is on wifi, but the S10 is specifically on LTE just to show that once you have this part set up, everything is completely seamless. - Yeah, you could be out anywhere. It's amazing, this has legitimately changed my life. People have, they talk to me. - This is pretty rad. This is properly cool. So, if you guys want to get iMessage on your own Androids and ascend to the blue bubble boy... Realm? - I just like calling it being treated like a normal human being. You too can find love, if you install this app and people will respect you, your parents will talk to you, your friends will talk to you, even if you have an LG V40 or a Galaxy. - These sound like personal problems man, these are definitely personal problems. - No, it's all because of the blue bubbles, it's not personal. Alright, it's kinda personal.",
    "transcript_keywords": [
        "Mac",
        "phone",
        "bubble boy",
        "Mac mini",
        "Android",
        "Air Message",
        "Yeah",
        "Android phone",
        "green bubble boy",
        "bubble",
        "blue bubble boy",
        "Blue bubble",
        "message",
        "iMessage",
        "green bubble",
        "boy",
        "Blue",
        "Android messages app",
        "phone number",
        "Austin"
    ],
    "transcript_entity_values": [
        "S10e",
        "DDNS",
        "Play Store",
        "iPhone",
        "50 bucks",
        "MMS",
        "Bumble",
        "a Mac Mini",
        "iMessage",
        "five-minute",
        "Mac Mini",
        "one second",
        "Austin",
        "Androids",
        "Apple",
        "only two",
        "this 2010",
        "SMS",
        "10.10",
        "LG",
        "Yosemite",
        "the years",
        "Austin",
        "one",
        "U.S.",
        "Core 2 Duo",
        "every 30 minutes",
        "IP",
        "Wi-Fi",
        "S10",
        "Galaxy",
        "a ton",
        "WeChat",
        "Mac",
        "Chromebook",
        "High Sierra",
        "DNS",
        "eBay",
        "Facebook Messenger",
        "Mac",
        "Air Message",
        "the Play Store",
        "Mormon",
        "Plex",
        "Jdate",
        "Wes",
        "LTE",
        "the Air Message",
        "V40",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "GPE",
        "CARDINAL",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "LOC",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.07172171026468277,
        -0.04373344033956528,
        0.16834202408790588,
        -0.07620032876729965,
        -0.04159888997673988,
        -0.11586141586303711,
        0.07277818024158478,
        -0.005340769421309233,
        0.05090797692537308,
        -0.04878203570842743,
        0.005662228912115097,
        -0.05620935931801796,
        0.03756469115614891,
        0.025034544989466667,
        0.09587980061769485,
        0.048053592443466187,
        0.0484020933508873,
        -0.1079934760928154,
        -0.11538877338171005,
        0.035203222185373306,
        -0.029756026342511177,
        0.02806568518280983,
        0.05695081129670143,
        -0.04992799460887909,
        0.009785905480384827,
        -0.0424492284655571,
        -0.02169741690158844,
        0.028740685433149338,
        -0.052613791078329086,
        0.03111773356795311,
        0.039383869618177414,
        0.0774911567568779,
        0.06481502205133438,
        -0.03127236291766167,
        -0.060004692524671555,
        0.027013573795557022,
        -0.08842527121305466,
        0.010649340227246284,
        -0.056056465953588486,
        0.012843680568039417,
        -0.09643019735813141,
        0.010456538759171963,
        0.04282078519463539,
        0.05498469993472099,
        -0.04550867900252342,
        -0.03285893797874451,
        0.03941108286380768,
        0.04573650658130646,
        -0.030339322984218597,
        0.010291676968336105,
        0.011924968101084232,
        0.030693357810378075,
        0.06383556127548218,
        0.09586861729621887,
        -0.07931361347436905,
        0.04630770534276962,
        -0.09692145138978958,
        0.09491807222366333,
        0.07468665391206741,
        0.0755922719836235,
        -0.00579871516674757,
        -0.038600534200668335,
        0.014012889936566353,
        0.03331013768911362,
        -0.07468844205141068,
        0.04498206079006195,
        0.0020921113900840282,
        0.009031704626977444,
        0.019697103649377823,
        0.0003684659895952791,
        0.040105190128088,
        0.018411586061120033,
        -0.04971656948328018,
        0.1079399585723877,
        -0.0009902777383103967,
        0.059335872530937195,
        0.08496822416782379,
        -0.041877541691064835,
        -0.042100775986909866,
        0.06838763505220413,
        -0.005529641639441252,
        -0.10261797159910202,
        0.01700235716998577,
        -0.016775043681263924,
        -0.012111570686101913,
        -0.07297179847955704,
        0.018342752009630203,
        -0.00021915393881499767,
        -0.045510102063417435,
        0.08990797400474548,
        -0.07426236569881439,
        0.035789139568805695,
        0.006055009551346302,
        0.00733744353055954,
        0.06745213270187378,
        0.03764725476503372,
        -0.08247779309749603,
        0.027089664712548256,
        -0.1367804855108261,
        0.09668523818254471,
        0.013733937405049801,
        0.021217625588178635,
        -0.04075171798467636,
        0.00438804691657424,
        0.013778080232441425,
        -0.012880024500191212,
        -0.02618393301963806,
        -0.01884559355676174,
        0.017244616523385048,
        -0.0016389813972637057,
        -0.001623337040655315,
        -0.11911623924970627,
        0.010250245220959187,
        0.05377386137843132,
        0.04659442976117134,
        -0.02830822765827179,
        0.07293110340833664,
        0.041976891458034515,
        0.07329226285219193,
        0.010810346342623234,
        0.008131100796163082,
        -0.07638487219810486,
        -0.0651106983423233,
        -0.00526046147570014,
        0.006302834488451481,
        0.06509160250425339,
        -0.02443111687898636,
        4.426404334080462e-34,
        0.004897519014775753,
        0.1225290298461914,
        0.038637999445199966,
        0.0640609934926033,
        -0.0825473740696907,
        0.006473477464169264,
        -0.06733117997646332,
        0.016994211822748184,
        -0.023556513711810112,
        -0.09257090836763382,
        0.00021301121159922332,
        -0.009723071940243244,
        -0.010201456025242805,
        -0.02495484985411167,
        0.07120286673307419,
        -0.05983515456318855,
        -0.023408418521285057,
        -0.04401792585849762,
        0.03423134982585907,
        0.022355645895004272,
        -0.06232406571507454,
        -0.03495432808995247,
        -0.01419874932616949,
        -0.04006515443325043,
        -0.032491911202669144,
        0.05606250837445259,
        0.1022098958492279,
        -0.012755908071994781,
        0.057267796248197556,
        -0.03344602510333061,
        -0.060429759323596954,
        -0.003301398828625679,
        0.044445961713790894,
        0.04634883627295494,
        0.09425891190767288,
        -0.01986388862133026,
        -0.023198645561933517,
        -0.016010034829378128,
        -0.013220904394984245,
        0.010634464211761951,
        -0.14566653966903687,
        0.037307195365428925,
        -0.06508463621139526,
        0.0036667007952928543,
        -0.039943475276231766,
        0.06790194660425186,
        -0.07437431067228317,
        0.025764962658286095,
        -0.024669723585247993,
        -0.031921450048685074,
        -0.07343053072690964,
        0.04996730014681816,
        0.03692393749952316,
        0.024433482438325882,
        -0.05127996578812599,
        -0.06373137980699539,
        -0.02417455054819584,
        -0.01855606399476528,
        -0.0667448341846466,
        -0.041717372834682465,
        0.07828965038061142,
        0.009913978166878223,
        0.01981990598142147,
        -0.02776787057518959,
        0.01720968633890152,
        -0.008757405914366245,
        -0.03859732300043106,
        -0.012188442051410675,
        0.00663823401555419,
        0.027233842760324478,
        0.0106762470677495,
        0.04358161985874176,
        0.007358720526099205,
        0.022526303306221962,
        0.008507275022566319,
        0.04167903587222099,
        0.053072404116392136,
        0.0330798514187336,
        0.025693126022815704,
        -0.005789516493678093,
        0.021373547613620758,
        0.0009678629576228559,
        -0.04533235356211662,
        -0.04939790070056915,
        -0.041478317230939865,
        -0.04925628378987312,
        -0.006937882862985134,
        -0.05994471535086632,
        0.04964541271328926,
        0.1191946491599083,
        -0.06413289159536362,
        0.07019928842782974,
        0.013652656227350235,
        0.09144575148820877,
        -0.03540162742137909,
        1.0418422502549762e-34,
        -0.05367918312549591,
        0.030405772849917412,
        -0.022777212783694267,
        -0.02272266522049904,
        0.06160890683531761,
        -0.007953868247568607,
        0.07266178727149963,
        0.06363686174154282,
        0.04007494077086449,
        -0.058604951947927475,
        -0.050839636474847794,
        0.018192347139120102,
        0.02960561029613018,
        -0.05672004446387291,
        0.018184754997491837,
        -0.00742013193666935,
        0.11130433529615402,
        -0.04765928536653519,
        -0.03334292024374008,
        -0.01565757393836975,
        -0.02883092872798443,
        0.01173228956758976,
        -0.06591109931468964,
        0.009230924770236015,
        0.008683593943715096,
        0.01611245609819889,
        -0.0036595717538148165,
        0.03383823111653328,
        -0.006944161374121904,
        -0.05932167172431946,
        -0.01613105833530426,
        0.04202531650662422,
        -0.010871258564293385,
        -0.015198102220892906,
        0.06562329828739166,
        0.05230948328971863,
        -0.006763722747564316,
        -0.007149902638047934,
        0.022546906024217606,
        -0.05666143819689751,
        0.06404438614845276,
        0.005062506068497896,
        -0.03924914076924324,
        -0.021145302802324295,
        -0.01130580808967352,
        0.02580575831234455,
        -0.004390844143927097,
        0.0026229233480989933,
        -0.08300609886646271,
        -0.004069427493959665,
        0.07021953910589218,
        -0.016797149553894997,
        0.006871312856674194,
        -0.009907658211886883,
        -0.03547929227352142,
        -0.013262624852359295,
        0.031496454030275345,
        0.022036056965589523,
        -0.015827717259526253,
        0.009268737398087978,
        0.00573547650128603,
        -0.1275402009487152,
        0.04523678496479988,
        -0.04277069866657257,
        -0.03526385873556137,
        -0.021940361708402634,
        0.0853162556886673,
        -0.0071418373845517635,
        0.027390314266085625,
        0.04656408354640007,
        -0.023737389594316483,
        -0.12214545905590057,
        -0.004978551995009184,
        -0.0497867614030838,
        0.09249957650899887,
        0.022382084280252457,
        -0.03356536477804184,
        -0.12263569235801697,
        -0.12454531341791153,
        -0.08283013850450516,
        0.0023165519814938307,
        0.11115346103906631,
        0.02400369755923748,
        0.016191115602850914,
        0.0916098803281784,
        0.059657588601112366,
        0.0024683387018740177,
        0.030032824724912643,
        -0.026654865592718124,
        0.023494811728596687,
        -0.02277527004480362,
        0.051839932799339294,
        0.003294555703178048,
        0.05528251454234123,
        -0.03515699878334999,
        -5.618784015837264e-08,
        0.05503259599208832,
        -0.12418893724679947,
        -0.01382805872708559,
        0.023061983287334442,
        0.04547441005706787,
        0.039148859679698944,
        -0.03135853260755539,
        -0.05430212989449501,
        0.07066929340362549,
        -0.028909387066960335,
        -0.09371794015169144,
        0.023016825318336487,
        -0.012919032946228981,
        0.011014684103429317,
        0.03478194400668144,
        -0.026749173179268837,
        -0.045343294739723206,
        -0.03714653477072716,
        -0.0421929769217968,
        0.009709899313747883,
        -0.00018144887872040272,
        0.0196873489767313,
        -0.08128591626882553,
        0.0354214645922184,
        -0.02955404296517372,
        0.013689164072275162,
        0.04442468658089638,
        -0.009159962646663189,
        0.025374718010425568,
        -0.035644274204969406,
        -0.013586076907813549,
        -0.011064233258366585,
        -0.0005012890906073153,
        -0.07278024405241013,
        -0.04822397604584694,
        0.02251303382217884,
        0.0040999483317136765,
        -0.055043525993824005,
        0.02553356997668743,
        -0.005218254402279854,
        0.03546794876456261,
        0.011359893716871738,
        0.030193723738193512,
        0.03747046738862991,
        0.05875596031546593,
        -0.003801981918513775,
        0.03678039088845253,
        -0.0520223043859005,
        0.03426433354616165,
        0.10385715216398239,
        -0.03656110540032387,
        -0.03845883160829544,
        0.0017050572205334902,
        -0.026642488315701485,
        0.07534928619861603,
        -0.1335151344537735,
        0.04145678132772446,
        0.041819848120212555,
        0.056158922612667084,
        0.04090264067053795,
        0.07075630873441696,
        0.009216226637363434,
        -0.04119009152054787,
        -0.031145693734288216
    ]
}