{
    "id": "os-jXiYRihI",
    "title": "AMD says these are the same... We DISAGREE. - Testing 12 of the same CPUs for Variance",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-01-25T23:12:33Z",
    "video_url": "https://www.youtube.com/watch?v=os-jXiYRihI",
    "category": "Science & Technology",
    "tags": [
        "7800x3d",
        "ryzen 7800x3d",
        "ryzen 7 7800x3d",
        "ryzen 5 7800x3d",
        "ryzne 9 7800x3d",
        "intel vs ryzen",
        "lmg labs",
        "ltt labs",
        "labs testing",
        "marckbench",
        "markbench"
    ],
    "views": 1497570,
    "likes": 64518,
    "comments_count": 3514,
    "description": "Remove your personal information from the web at   and use code LTT for 20% off.  NexiGo is hosting product giveaways every month! Enter for your chance to win here:  (Contest is open to anyone 13+ in the United States)  Do you really know if your CPU is performing the same as the ones we review? We dont know. But we know that if we want to increase our testing capacity, we need to PARALLELIZE. But that means we need nearly identical test benches. And trying to make that happen sent us down a far deeper rabbit hole than we could have anticipated.  Testing Process Doc and Forum Post:   Buy an AMD Ryzen 7 7800X3D CPU:  (Canada:  ) (Micro Center:  ) Buy a NVIDIA GeForce RTX 4090 FE Graphics Card:  Buy a GIGABYTE X670E AORUS XTREME Motherboard:  Buy G.Skill Trident Z5 NEO 6000MT/s CL30 2x16GB DDR5 RAM:  Buy a Samsung 980 Pro 2TB NVMe M.2 SSD:  Buy a Noctua NH-D15 CPU Cooler:  Buy a MSI MEG Ai1300P PSU:  Purchases made through some store links may provide some compensation to Linus Media Group.  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 2:25 Why Same Model ISN'T Same Performance 5:32 Sources of Variance 8:21 Gaming Results 10:43 CS:GO is Wonky 11:41 Gaming Results Cont. 12:39 Productivity Results 13:59 Our Selections 15:15 Testing Mobos and RAM 17:16 Final Discussion 21:26 Outro",
    "description_links": [
        "http://joindeleteme.com/LinusTechTips",
        "https://viralnation.link/LTTxNexiGoGiveaway",
        "https://linustechtips.com/topic/1554658-we-have-the-same-cpu-we-are-not-the-same-testing-12-of-the-same-cpu/",
        "https://lmg.gg/s8Y1K",
        "https://lmg.gg/yZnVo",
        "https://lmg.gg/EkzYG",
        "https://geni.us/Won6A",
        "https://geni.us/FADHuEG",
        "https://geni.us/TYRaJf",
        "https://lmg.gg/aL0BL",
        "https://geni.us/lK6GI9O",
        "https://geni.us/NRCy",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "If you went to the grocery store, gave them your money, and left with 10% less Vegemite than you paid for, you'd probably be pretty ticked off. But what if I told you that happens every day, except with $350 CPUs? Well, it's true. These 12 chips were obtained over a span of a month from 8 different sources spread across 3 separate countries. And the real-world difference between the best and the worst of them is 8% in Factorio and as much as 12% in CSGO. This has caused a lot of problems for us over the last 6 months. You see, in April, I gave the labs team the goal of increasing our testing throughput so that we could give you guys more juicy benchmarks in our reviews. Unfortunately, the math was not in our favor. You see, the typical turnaround to troubleshoot, benchmark, write, film, edit, and QC our coverage of a new product is 5 to 8 business days. At about 5 minutes per test, times 3 runs for consistency checks, times however many products we want to compare, times however many games or applications you guys want to see, it is easy to run out of time. Now, we could shorten each test, but we've found that longer tests are more consistent from run to run and end up being more reflective of the real-world experience of using the product. So, that's out. And I guess we could work through the nights like a bunch of Adderalled out master students, but come on guys, we're not that young anymore. Automation with Markbench does help a lot, but if our system hangs in the middle of the night, which it happens sometimes, we're right back where we started, which leaves us with one real option, building up more of our test benches and running our tests in parallel, except as I already told you, 8% difference in Factorio, 12% in CSGO. Now, when I signed the procurement authorization for 11 CPUs, I knew that we were likely to find an outlier or two, but then it turned out that this rabbit hole went way deeper than I could possibly have known. Like this deep segway to our sponsor, Nexigo. Whether you're in need of webcams or VR accessories, Nexigo has products that'll make you Nexigo. Wow, those are cool. Learn more about them at the link below. Now, before you start sharpening your pitchforks and demanding that AMD's executives be turned into thermal paste or something, it's worth noting that most of our chips were within a few percentage points of each other, even in CSGO at 1440p, which was the test that saw the greatest overall spread. Also, when we expand our comparison to include our full suite of games, that maximum difference falls to around 2.5%. Far less outrageous, so you don't really have to worry about Buddy in front of you in line getting a way better gaming experience for the same price, but still too big for us to buy any two random 7800X 3Ds, use them to test two different GPUs in parallel, and then say, well, these results should be comparable. Now, the obvious conclusion at this point then is, guys, there's something wrong with your CSGO test. I think it's time to get good, but the thing is, there aren't a lot of variables here, and that's by design. We used the same motherboard, same memory, same Windows drive and install. We even tested using phase change thermal pads to ensure that our paste application wasn't an issue, and we chucked our bench in the thermal chamber just for good measure. We are very confident that our numbers are valid, and we're gonna have the process doc linked in the video description if you wanna have a look, which is all fine and good, but doesn't answer the much bigger question of why do these CPUs vary so much in the first place? AMD gave them the same model number and specifications, AMD charges the same price, so they should have the same performance, right? Well, back in the day that was true, CPUs would run at their rated speed, and if they didn't, it meant they were either broken or they were about to be, but thanks to a relatively recent innovation called dynamic frequency scaling, that's no longer the case. You see, no two pieces of silicon are the same, and whether it's through rolling improvements to manufacturing or just sheer blind luck, you can end up with a processor that is capable of better than the advertised clock speed. Now, in the old days, you could unlock this extra performance manually through overclocking, but nowadays processors just adjust their own speeds, and they do it on the fly based on a whole host of factors, including user configurable power profiles and thermal limits. AMD's approach is to allow the CPU to clock as high as it's able until the CPU die average reaches about 90 degrees Celsius, at which point the clocks will be dialed back until it reaches equilibrium. Sounds good, right? I mean, why be bound by some artificial performance limiter when I got a golden chip that can go higher? And I actually agree, but for the folks who end up with a lesser chip, can feel a little bit like missing out, even if AMD is careful to only guarantee clock speeds that 100% of the chips can hit. And as I mentioned before, it's also very inconvenient for our parallel testing endeavors. So what do we do? Testing. Lots of it. After throwing Cinebench at our very first CPU, we ran into our very first roadblock. The numbers from run to run can be vastly different. I am talking 300 point spreads on a single CPU run back to back. What the heck, right? How on earth are we supposed to narrow down which two CPUs are within 1% of each other if one CPU isn't within 1% of itself? As it turns out, software was the culprit and software is notoriously hard to account for. Have you ever opened up task manager right when you boot up your system? There's no programs running, nothing should be happening except wrong. What was that? Here's the thing. Even when you're doing nothing, your operating system is busy managing all the behind the scenes work that keeps your system running, like updating the weather widget, synchronizing the clock with a trusted time server, prepping the next thing it thinks you might need, installing updates and so much more. And we don't really get to decide when that stuff happens, which means that no one result can ever be taken as gospel truth. We do have custom Windows images that are intentionally debloated to remove some startup processes to help with this, but it only partially mitigates the issue and it introduces new ones, like making our results slightly less representative of the typical user. We feel this trade-off is worthwhile because it helps us to better isolate our variables in testing, but it's not even enough. To further mitigate the amount of work that Windows is doing in the background, we can also increase a process's priority. In Cinebench, we went from seeing points varying in the hundreds down to the tens on the same CPU. That's a big improvement and enough to use Cinebench for our binning process, but we're not out of the woods yet. You see, with some tests, it's not enough to use the same hardware at the same process priority because the benchmarks themselves have built-in inconsistencies. Red Dead Redemption 2, for example, simulates physics and AI behavior during a bench run. That's a really good thing because if that stuff was canned, our results would not be comparable to actually playing the game. But the bad news is it means that sometimes Arthur loses his hat, sometimes he doesn't, sometimes the horse gets shot, sometimes it doesn't, which can impact our run-to-run consistency. Can we ever fully account for this? Unfortunately not, but by running each test multiple times and then taking an average, we can get a pretty good picture and we can bake that expectation of noise into our data analysis, which finally happens now. Sorry for all the preamble. First up, gaming. For the sake of legibility, we named each of our samples after a Pokemon. Why Pokemon? I don't know, because it seemed better than deadly diseases. Anywho, looking at the geometric mean of our gaming results, we found a 2.07% spread in average frames per second between the best performing and the worst performing CPUs and a 2.46% spread in our 1% lows. This puts all but one of our CPU samples within three frames per second of each other, which gives us confidence that we'll be able to find some close enough CPUs, but given that 2.46% isn't 1%, it also tells us that we can't just pull any three chips at random, nor can we simply look at the average. Returnal, for instance, is a benchmarker's dream because A, it's actually a good game that people might want to play, and B, it is a stunningly consistent benchmark, which is great for producing results that we can trust when we're comparing GPUs. But the real world is a lot messier than Returnal, and while most of our other games, both at 1440p and 1080p, showed a similar small level of variance in CPU performance, in a couple of games, notably Total War, Warhammer III, and Cyberpunk, we found larger variance in the 1% lows. This indicates that, as run, these games are more CPU bottlenecked, which better reveals the deficiencies of our worst chips, but as you're about to see, not all CPU-bound games are bound in the same ways. We went into this process thinking, ah, CSGO, what a classic CPU gaming benchmark. It's a shame that it's been replaced by CS2, and we came out of it thinking, ah, CS good riddance. I mean, on the one hand, it does certainly separate the CPUs from each other and our slowest chip, Corsola, was the slowest-est in CSGO. But on the other hand, the overall variance is so high and so different from the entire rest of our test suite that it becomes almost an outlier data point, having an outsized impact on our results. And this could be for a number of reasons. First, CSGO uses a game engine that is older than YouTube, which has been useful over the years since it was originally built just for single-core CPUs, and it can make use of just about all the single-threaded performance that you can give it. But it also means that its performance requirements just aren't very similar to more modern games that are gonna wanna see a number of fast cores rather than just one or two. Second, CSGO itself is also old, old enough that any modern gaming CPU can run it so fast that no professional esports gamer even could tell the difference anyway, and so fast that limitations in the software itself can start to rear their ugly heads, which adds potential variables. Basically, CSGO is having its Quake III arena moment. After a long run, it's time to drop it. And when we reviewed the overall variance numbers without CSGO, it shows just how much of an outsized influence that it had on our results. The new results show far less variance, closing the spread to just 0.46% and 1.43% for the average and 1% lows respectively, which is somewhat reassuring for you, the consumer, but still doesn't change that our runaway loser, Corsola, is still a dud. Corsola consistently underperformed the rest of the chips by so much that when we remove it from our results, our overall spread and performance goes from 1.43% in our lows to 0.86%. That is a massive decrease. So what the heck is wrong with this thing? We don't know for sure, but one guess is that the 3D vCache on this chip could be struggling some way because it fumbles pretty hard in our Factorio test where most of the benchmark can actually fit on that 3D vCache. Another possibility is that it could be the PCIe controller, the part of the CPU that communicates with our PCIe lanes and consequently our GPU. This idea comes from the fact that when it comes to productivity performance, sure, it still ain't top of the class, but it isn't flunking like it used to. Speaking of, we actually found greater variance between our chips in our productivity tests, which kind of makes sense since we no longer have the GPU getting in the way of raw CPU performance. 7-Zip brought us a spread of around 3-4% for compression and decompression and Blender hovers in the same realm along with our video and audio encoding suites. The biggest contributor to the size of the spread of our sample though is Lugia, who takes up the bottom spot in pretty much every productivity benchmark. Since it wasn't so bad in gaming, this leads us to believe that perhaps there's a problem with the integrated heat spreader, but AMD has made that much more difficult to evaluate now that all of their CPUs just kind of run at the same temperature and then adjust their clock speeds to reach their thermal limit. So across our small sample, variance and performance is present, but not egregious. Of course, we aren't trying to quantify variance. What we're trying to find is equivalence. So how do we do that? It turned out to be a bit tricky. We ended up using Euclidean distance to determine which CPUs were the most similar, unconventional, but also kind of cool. Here's how it works. First, we scaled our data so that our five digit Cinebench scores don't overshadow those low flacking code numbers. Then we took those scaled numbers and treated each as a coordinate for a point in multidimensional space. Think about it kind of like this. If we took a plane and chose two points, those would each have an X and a Y coordinate. Well, the Euclidean distance is the distance between those two points. The closer together the points are, the more similar they are. And this can be applied for points that exist in any dimension. In our case, a 12 dimensional space for productivity and the 19th dimension for gaming. Since we're weighing all of our tests as equal, we can then do a bunch of comparisons to determine which CPUs are the most similar to one another. From that, four emerge as extremely comparable. EV, Mewtwo, Raiku, and Zapdos, with Zapdos being the least equivalent. So, sorry bro, just the other three. They are outside of our tolerance in CSGO. But the issue is that the CPUs that did perform identically in that one game were not the tightest across the rest of the suite, meaning that they can't really be trusted on games that, you know, you might actually be able to play. In conclusion, productivity saw these CPUs perform within roughly 0.24% of one another. And in gaming, we see a spread of 0.86% in the 1% lows and just 0.1% in average frame rates. Now that's tight. Tight enough, we figure that it will allow us to directly compare GPU results across our test benches. Wait, benches? Oh yeah, you see where I'm going with this. We found near identical CPUs, but what about the other components? Do they vary? Time for another round of testing. The main secondary performance contributors in your GPU test bench are going to be your motherboard and your RAM. But since those still run at fixed clock speeds, we're not expecting nearly as much variance. With RAM, for example, you set the speeds in your BIOS and then it's either capable or it's not, and your system is unstable and probably crashes. All of our testing is done at the recommended RAM speed from AMD, 6,000 megatransfers per second. And if you want to learn even more about how we test our hardware, we've got a recent exclusive over on floatplane.com where we have a feature length deep dive looking at the improvements we've made to our testing processes. Anyway, to validate our hypothesis, we took one of our future test CPUs, EV, and threw it into both of our new parallel benches. In gaming, we landed on 0.45% variance in the 1% lows and less than a 10th of a percent in average FPS. That is more than acceptable. And in productivity, we ended up in the 0.13% neighborhood. That means in our upcoming GPU reviews performed on these three parallel benches, we're gonna consider our results to be accurate within plus or minus about 0.25%. Of course, that doesn't mean that our results will be identical to your CPU or to other media. And this is one of the big reasons that we have always encouraged our viewers to look at reviews from multiple outlets whenever making a purchase decision. Oh, before you ask, by the way, there does not appear to be any foul play from AMD with respect to review sample selection. So you don't have to pick a reviewer, for example, that buys their own CPUs versus one that gets seeded. At least we don't think so. We'd have to buy hundreds of CPUs to know for sure, but it appears that the unit that was sent to us for review, which is Raiku, falls somewhere in the good but not exceptional range. So I think we can put that conspiracy theory to rest. Another before you ask is, yes, driver updates, operating system updates, and new software that we add to our test suite could change our CPU performance spread in the future. And we're gonna do our best to maintain our data integrity by performing periodic, what we're gonna call equivalence checks, because you guys have asked for reliable, trustworthy information, and you deserve it, which brings us to a big issue. Why is this task falling to random YouTubers? I mean, the automotive industry, for instance, has government bodies that are dedicated to verifying the performance of vehicles and ensuring that companies aren't cheating on their testing. Then they dole out big fines when they inevitably do cheat on their testing. With computer hardware, there's no such oversight. We and our peers are this thin, open-mouthed thumbnail line between you and getting ripped off. And that's a big problem. I mean, for one thing, we don't have access to the types of testing that large tech companies have, and we don't operate at the kind of scale where we can say for sure if an observation is a fluke or if it's the result of conniving suits that are trying to save a quick buck. Even buying 11 chips for this investigation, that was a huge investment from our side and not the sort of thing that we can do with every single review. Unfortunately, all I'm doing is ranting right now. I don't have a solution to this other than, well, we're gonna keep trying, gosh darn it. But it just struck us as we worked on this project that the fact that these companies don't have to report things like estimated performance in a regulated and standardized fashion is kind of crazy, especially if you consider the kind of money that they're asking for their most expensive CPUs. So what's next? Well, first is gonna be going through the exact same rigmarole with however many 4090s it takes to parallelize our CPU test platforms and then slowly, but surely we're gonna be improving our automations and increasing our test volume, especially once we get the lab's website up and running. But good things take time and we aren't going to rush a good thing. Especially, I'm not going to rush this segue to our sponsor. Delete.me, your personal information sounds like it should stay personal, right? I mean, it's right there in the name. Well, data brokers and other sketchy companies disagree. So they're sharing your data online like it's a family style dinner. Eat, eat your skin and bones is what they're saying to each other. Thankfully, Delete.me is here to crash the party. They'll find out who's spilling your info and get it removed so that scammers can't use it to batter you with robocalls and spam emails. Nevermind that it can also lead to fraud or identity theft because Delete.me can mind that for you. Now, wiping out data held by hundreds of sites by yourself sounds borderline impossible, which is why this whole time I've been trying to tell you that Delete.me can do it. You don't have to. Their nifty software and expert squad can sweep it away in minutes, not hours. Delete.me averages over 2000 pieces of personal data gone for a customer in their first two years. Yeah, go on Delete.me, get them. And you should get on over to the link below and use code LTT for a sweet 20% off. If you guys enjoyed this video, why not check out our motherboard turbo nerd edition video where we went into what exactly are all those little things that look like cities and towns on the PCB?",
    "transcript_keywords": [
        "CPUs",
        "CPU",
        "test",
        "CSGO",
        "CPU performance",
        "performance",
        "run",
        "results",
        "AMD",
        "CPU performance spread",
        "good",
        "spread",
        "CPU run back",
        "variance",
        "testing",
        "chips",
        "games",
        "gaming",
        "test CPUs",
        "CPU test"
    ],
    "transcript_entity_values": [
        "the years",
        "one",
        "0.45%",
        "3-4%",
        "EV",
        "CS",
        "10%",
        "less than a 10th",
        "Factorio",
        "GPU",
        "Delete.me",
        "Pokemon",
        "11",
        "1440p and 1080p",
        "YouTubers",
        "300",
        "over 2000",
        "AI",
        "vCache",
        "Cinebench",
        "Red Dead Redemption 2",
        "AMD",
        "LTT",
        "6,000",
        "three",
        "YouTube",
        "the day",
        "Nexigo",
        "just 0.46%",
        "4090s",
        "Euclidean",
        "Returnal",
        "first",
        "First",
        "Adderalled",
        "the old days",
        "CSGO",
        "Blender",
        "April",
        "Markbench",
        "CPU",
        "Lugia",
        "Zapdos",
        "Nexigo",
        "Euclidean",
        "hundreds",
        "0.86%",
        "just 0.1%",
        "Windows",
        "four",
        "minutes",
        "3Ds",
        "Factorio",
        "Pokemon",
        "100%",
        "3",
        "minus about 0.25%",
        "20%",
        "0.13%",
        "2.07%",
        "Corsola",
        "12",
        "8%",
        "the last 6 months",
        "their first two years",
        "PCIe",
        "two",
        "QC",
        "tens",
        "PCB",
        "19th",
        "five digit",
        "Raiku",
        "about 5 minutes",
        "second",
        "Second",
        "2.46%",
        "1%",
        "350",
        "about 90 degrees Celsius",
        "Quake III",
        "RAM",
        "8",
        "5",
        "12%",
        "a span of a month",
        "AMD",
        "as much as 12%",
        "Mewtwo",
        "Arthur",
        "1.43%",
        "8 business days",
        "roughly 0.24%",
        "Raiku",
        "around 2.5%"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "PERCENT",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "PERCENT",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "PERCENT",
        "PERCENT",
        "MONEY",
        "QUANTITY",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERCENT",
        "DATE",
        "PERCENT",
        "PERSON",
        "PERCENT"
    ],
    "vector": [
        -0.06108316034078598,
        -0.0060761794447898865,
        0.04002067819237709,
        0.029716933146119118,
        0.036512602120637894,
        -0.07673375308513641,
        -0.06289403140544891,
        0.022742534056305885,
        -0.023779435083270073,
        -8.912194607546553e-05,
        -0.03967290744185448,
        0.011945884674787521,
        -0.0262448713183403,
        0.008478287607431412,
        -0.008562823757529259,
        -0.06108078360557556,
        0.09953635931015015,
        -0.07783066481351852,
        -0.013324325904250145,
        0.059480220079422,
        0.019085580483078957,
        -0.05387723818421364,
        -0.01619257777929306,
        0.021784644573926926,
        0.08777343481779099,
        -0.001478426274843514,
        -0.01725340448319912,
        -0.01351544726639986,
        0.058019667863845825,
        0.004994346294552088,
        0.09582196176052094,
        -0.0070640710182487965,
        -0.05069733038544655,
        0.007971934042870998,
        0.027953380718827248,
        -0.055032093077898026,
        0.04804357886314392,
        -0.07164007425308228,
        -0.01688055880367756,
        0.0021871053613722324,
        -0.04087085276842117,
        -0.044956374913454056,
        -0.024716902524232864,
        0.04148755595088005,
        0.04442882910370827,
        -0.027972431853413582,
        0.020167063921689987,
        -0.08269309997558594,
        -0.035009440034627914,
        -0.011441203765571117,
        -0.034896641969680786,
        -0.05388820543885231,
        -0.0201751459389925,
        -0.04406534135341644,
        -0.0720251128077507,
        0.07213990390300751,
        0.037344835698604584,
        -0.1245175302028656,
        -0.008406988345086575,
        0.06219438835978508,
        0.01578476093709469,
        -0.1018872857093811,
        0.05895765498280525,
        0.08196788281202316,
        0.06414209306240082,
        0.012571483850479126,
        0.0015245216200128198,
        -0.03521425649523735,
        0.030688421800732613,
        -0.054240111261606216,
        0.031832821667194366,
        0.05069383978843689,
        0.04976435750722885,
        -0.009064937941730022,
        0.040015000849962234,
        0.047306738793849945,
        -0.008329829201102257,
        -0.037229493260383606,
        0.040395937860012054,
        -0.025107767432928085,
        -0.011487474665045738,
        -0.035611070692539215,
        0.0322464294731617,
        -0.0944744348526001,
        0.03873249888420105,
        -0.010729655623435974,
        0.10110317915678024,
        0.028761252760887146,
        -0.015065626241266727,
        -0.10481038689613342,
        0.10028670728206635,
        0.0528329461812973,
        0.03226830065250397,
        0.05968032032251358,
        0.01354715134948492,
        0.02290927805006504,
        0.01112300157546997,
        0.0012850372586399317,
        0.02014433965086937,
        0.015766393393278122,
        0.04567275941371918,
        0.03317663073539734,
        0.051458291709423065,
        0.029292944818735123,
        -0.04580109566450119,
        0.059069324284791946,
        -0.031346049159765244,
        -0.00281877932138741,
        -0.05350673198699951,
        -0.07949096709489822,
        -0.019818400964140892,
        0.06311226636171341,
        0.026702456176280975,
        0.10793899744749069,
        -0.02647414617240429,
        0.009664858691394329,
        -0.04023214057087898,
        0.0018807128071784973,
        0.05185171216726303,
        0.08608867228031158,
        -0.02774040773510933,
        -0.021628964692354202,
        -0.036693789064884186,
        0.030727997422218323,
        0.05791827291250229,
        0.0316496267914772,
        -0.05687647685408592,
        9.704806422623941e-33,
        0.002109730150550604,
        0.013449390418827534,
        -0.019046513363718987,
        -0.02863978035748005,
        -0.007983437739312649,
        0.05563489347696304,
        -0.02675849385559559,
        0.028659632429480553,
        -0.016498753800988197,
        0.01023375615477562,
        -0.05359065160155296,
        -0.0546673908829689,
        0.006514349952340126,
        0.047716230154037476,
        -0.022714879363775253,
        -0.018564563244581223,
        -0.035393282771110535,
        -0.002589485142379999,
        -0.007071551866829395,
        0.02333003468811512,
        0.06801731139421463,
        0.0015424082521349192,
        -0.038296379148960114,
        -0.03513734042644501,
        0.01245475746691227,
        -0.03511904552578926,
        -0.026252910494804382,
        0.05349298194050789,
        -0.07411620765924454,
        -0.011880933307111263,
        -0.027737179771065712,
        -0.07268939167261124,
        -0.0617327056825161,
        0.11413618177175522,
        -0.013024978339672089,
        0.005756384693086147,
        0.08157743513584137,
        -0.04118253290653229,
        -0.027507629245519638,
        -0.05615769326686859,
        -0.028551504015922546,
        0.11660069972276688,
        -0.04110723361372948,
        -0.07483257353305817,
        -0.017910923808813095,
        0.021765749901533127,
        -0.05344070866703987,
        -0.04663325473666191,
        -0.0018307429272681475,
        -0.003233009483665228,
        -0.0578315332531929,
        0.09976360201835632,
        0.004449942614883184,
        0.022474689409136772,
        0.07711385190486908,
        0.004378283862024546,
        0.04863075166940689,
        0.0099008958786726,
        0.1540372222661972,
        0.1931099146604538,
        -0.06416101008653641,
        -0.07386261224746704,
        -0.11300785839557648,
        0.007735553663223982,
        -0.02657564915716648,
        0.07805877178907394,
        0.07435399293899536,
        -0.00732413399964571,
        -0.02146149054169655,
        0.05768897756934166,
        0.006315579172223806,
        0.014429012313485146,
        0.05006129667162895,
        -0.0018706705886870623,
        0.06860741972923279,
        -0.02091624028980732,
        -0.026453707367181778,
        0.015528748743236065,
        -0.06969915330410004,
        -0.10622662305831909,
        -0.0256658922880888,
        0.0976765975356102,
        -0.019237089902162552,
        -0.026002436876296997,
        -0.031857240945100784,
        -0.05263212323188782,
        -0.014592749997973442,
        0.012616691179573536,
        0.016234854236245155,
        -0.012463955208659172,
        -0.005287354812026024,
        0.029947787523269653,
        0.048816945403814316,
        0.01633349061012268,
        -0.02114664390683174,
        -7.203515339863382e-33,
        -0.08380857110023499,
        0.00973093044012785,
        -0.04108612611889839,
        0.13420917093753815,
        0.016688335686922073,
        -0.021723631769418716,
        0.09754863381385803,
        -0.09038715064525604,
        -0.04378199577331543,
        -0.10373413562774658,
        -0.006452950648963451,
        0.0030135372653603554,
        -0.00022852711845189333,
        0.05503523349761963,
        -0.07193493843078613,
        -0.022883940488100052,
        0.03475818783044815,
        -0.05762307718396187,
        0.09097512811422348,
        -0.06661071628332138,
        0.00013888670946471393,
        0.06288135796785355,
        -0.035904474556446075,
        -0.02551797777414322,
        0.00966807920485735,
        0.034925296902656555,
        -0.04111962392926216,
        -0.030183950439095497,
        0.005540056619793177,
        0.0043577756732702255,
        0.015508927404880524,
        0.03650985285639763,
        -0.01860336773097515,
        0.06671308726072311,
        0.0750298947095871,
        0.006813853979110718,
        0.0472644679248333,
        0.02599680796265602,
        0.0370062030851841,
        0.03201625123620033,
        0.01897369883954525,
        0.06448163837194443,
        -0.0227424968034029,
        -0.06342257559299469,
        0.007974877953529358,
        0.12199193984270096,
        0.004652887582778931,
        -0.09500613808631897,
        0.04902435094118118,
        -0.026491446420550346,
        -0.05140388011932373,
        -0.042379092425107956,
        0.014568350277841091,
        0.011335980147123337,
        -7.191779150161892e-05,
        -0.06966682523488998,
        -0.023631572723388672,
        -0.026087913662195206,
        -0.01920507289469242,
        -0.016350403428077698,
        0.07829801738262177,
        0.030125223100185394,
        -0.043674103915691376,
        -0.04361695051193237,
        0.01447377074509859,
        -0.025019695982336998,
        0.052019551396369934,
        0.02636393904685974,
        0.009497715160250664,
        -0.020279794931411743,
        -0.1183994710445404,
        -0.024098623543977737,
        -0.03043152391910553,
        -0.045299284160137177,
        0.01665099710226059,
        0.006013686303049326,
        0.05720716714859009,
        -0.02490937151014805,
        -0.012979559600353241,
        -0.06033143028616905,
        -0.04348268732428551,
        -0.05156158283352852,
        -0.013584107160568237,
        0.0008171916706487536,
        -0.007503231056034565,
        0.10796400904655457,
        0.02871464006602764,
        -0.031358033418655396,
        0.004170903004705906,
        -0.05750088021159172,
        -0.024262841790914536,
        0.06190187484025955,
        -0.06448348611593246,
        -0.022986359894275665,
        0.06995385140180588,
        -5.784390566532238e-08,
        0.07713848352432251,
        -0.08283181488513947,
        0.03208883851766586,
        0.04289774224162102,
        0.020135104656219482,
        -0.0489950105547905,
        -0.030678829178214073,
        -0.04598299413919449,
        0.013092746026813984,
        0.050917789340019226,
        0.06709877401590347,
        -0.05839197337627411,
        -0.012862553820014,
        0.01426250021904707,
        -0.03023950383067131,
        0.04356793686747551,
        -0.059942975640296936,
        0.030575161799788475,
        0.014425940811634064,
        -0.012662691064178944,
        -0.025522002950310707,
        0.06789632141590118,
        0.06802666187286377,
        -0.013279363512992859,
        -0.0383056104183197,
        0.05095799267292023,
        0.0306214801967144,
        0.04800446704030037,
        0.07185230404138565,
        -0.030408240854740143,
        -0.031862806528806686,
        -0.0006666952394880354,
        0.04722241312265396,
        -0.0782671868801117,
        0.050127893686294556,
        -0.07723215967416763,
        0.02106073871254921,
        0.14144958555698395,
        0.14130395650863647,
        0.005587628576904535,
        -0.05556187778711319,
        -0.07545942813158035,
        0.05067736282944679,
        -0.007660287898033857,
        0.0511462576687336,
        -0.06558968871831894,
        -0.07411038875579834,
        -0.09265372157096863,
        0.02489498443901539,
        -0.06252951174974442,
        0.016598470509052277,
        -0.022618986666202545,
        0.005342297255992889,
        0.04681561514735222,
        0.0447174496948719,
        -0.01997653767466545,
        -0.062872514128685,
        0.0384582094848156,
        -0.004242155235260725,
        0.005747298710048199,
        0.08452113717794418,
        -0.14171621203422546,
        -0.04447286203503609,
        -0.03248663619160652
    ]
}