{
    "id": "OskeOonpJZI",
    "title": "Dell DIDN’T Screw Me Over - $1500 PC Secret Shopper 3 Part 1",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-10-01T17:37:23Z",
    "video_url": "https://www.youtube.com/watch?v=OskeOonpJZI",
    "category": "Science & Technology",
    "tags": [
        "PC Shop",
        "Computer Shop",
        "Apple",
        "Dell",
        "Lenovo",
        "RAM",
        "CPU",
        "Laptops",
        "Desktops",
        "Windows",
        "HP",
        "Starforge",
        "Origin PC",
        "gaming",
        "cyberpower",
        "ibuypower",
        "maingear",
        "NZXT"
    ],
    "views": 2382395,
    "likes": 99217,
    "comments_count": 5500,
    "description": "Thanks again to UGREEN for sponsoring this series! Check out UGREEN Nexode RG 30 & 65W Chargers using the links below:  UGREEN Official Store (US) :  20% OFF Amazon RG 65W US :  ( 20% OFF Coupon+Code: 05Ugreenkol 9.28-10.08 ) Amazon RG 65W Charger (CA):  20% OFF Coupon  Check out UGREEN's 1st Nexode 300W GaN Charger using the link below: Amazon US:   Were secret shopping some gaming computers again! Time to find out whos the best or worst system integrator in 2023.  Discuss on the forum:   Check out where we shopped!  Dell:  CyberPowerPC:  HP:  iBUYPOWER:  MAINGEAR:  NZXT:  OriginPC:  Starforge Systems:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:38 Dell 8:18 Cyberpower 11:55 HP 18:39 Thanks UGREEN! 19:27 iBUYPOWER 23:06 MAINGEAR 26:34 NZXT 31:12 Origin PC 33:16 Starforge 35:56 Outro",
    "description_links": [
        "https://bit.ly/3r0iBTh",
        "https://bit.ly/3PrnRsq",
        "https://bit.ly/44Em5bH",
        "https://bit.ly/3R3x4Z1",
        "https://linustechtips.com/topic/1533886-dell-didn%E2%80%99t-screw-me-over-1500-pc-secret-shopper-3-part-1/",
        "https://lmg.gg/biUia",
        "https://lmg.gg/vbaVv",
        "https://lmg.gg/yaMa5",
        "https://lmg.gg/9bTM8",
        "https://lmg.gg/BnQRA",
        "https://lmg.gg/ZgAhD",
        "https://lmg.gg/cwz5d",
        "https://lmg.gg/1HwMI",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "There's a shopper out there He's shopping for all the deals So if you see a sale price Do exactly what they say I wish I was joking But every integrator be choking Secret shopping with Linus and Plouffe Yeah, that's good Another faulty pre-built Any ideas, Sebastian? Aluminum case, mid-tower footprint That could be anyone The laptop over there has footage on it That's the secret shopper You've cracked the case! Not yet But to review it, I'd like to go somewhere A little cleaner That's right It's secret shopper time again And this year we're sponsored by Ugreen They have tons of great charging solutions That we use here at the office all the time From their super cute Nexode RG 30 watt chargers With smart charging display To the big boy 300 watt 5 port power delivery GAN fast charger With thermal guard protection And a flame retardant protective shell No matter what you need to charge Ugreen has you covered Just like we've got you covered When it comes to buying a pre-built We sent secret agent Notalie On a mission to procure $1500 computers From some of the most common system integrators on the market All the same guys as last year Now with Starforge Have things improved? Let's find out You know, they were the worst last time Maybe they've gotten better? The perfect Dell is the one you build yourself So why am I shopping with Dell? Download the latest music Still the ultimate Download the latest music Okay, this was from 10 years ago Download the latest music Thank you for calling Dell sales My name is **** How can I help you today? Hello, I'm looking to get the best gaming desktop PC for my budget Which is about $15,000 sorry $1,500 tax in US I could hear the salivation Through the phone line 15 grand Sales commission May I know if you're looking to purchase in US or Canada? This is something we should address While some of these brands will ship from their US site to Canada allowing us to have an exactly apples to apples budget for some of them you do need to use the Canadian site so we used a converted budget About 2000 Canadian dollars So that I can make a recommendation May I know what would be the day-to-day usage on the system? Yeah, so I'm looking to play some games on it Use it just for personal use I stream sometimes So that would be nice if it could do that This is good though Yeah What will you use the computer for? Yeah, gaming Solid A little bit of streaming Some normal desktop use Any particular specification or a specific graphic card you're looking for Or you're fine with anything with your usage? I actually really like this question These days there's at least two legitimate choices in pretty much every single category And if somebody has a preference, why am I trying to push something on them that, in the end, if they're not happy with, is now my fault? Yeah, especially if they've got stock Like I've got a few personal brands that I try to just avoid for my own reasons Yeah, I game and then I stream sometimes So whatever you would recommend based off of what I'd like to do Sure May I know which games you would mostly be playing? Wow That's a good question Their script has improved a lot Yep And you want it to stay within 2,500 Oh, well, that's not what she said Uh, just 2,000 Canadian 47 seconds The best desktop would be the Alienware gaming desktop We have different options in that Okay, things are falling apart a little bit The best Alienware gaming desktop is the Alienware gaming desktop I'm not convinced that you have a great understanding of the product line here, but let's see Let's see where we go from here It would be slightly on the higher price range And the games which you've mentioned We already told you the price range They are basic games which would be great on, but it will not require that much of an intensive program She's right, because she mentioned She is, but why did she just tell me it's higher priced if what I'm playing is not intensive? But if you're planning to add more games later on, then we can consider going with the Alienware It comes with the right hardware and cooling system So for a basic option in the Alienware, we have the R15 gaming desktop You don't really need the i7 with the 3060 She doesn't know what's going on, no This is priced at $2,299.99 before taxes I unfortunately need to stay pretty near my budget of $2,000 That is $300 more than our budget Wow, yeah, that's too much Alienware starts at $2,300 Canadian? No, because we bought something, so there must be a cheaper option Why would she present that to us? Unless they're instructed to go for 10-15% over a stated budget So XPS is also a good I don't know what XPS is In the XPS, we have an option on deal right now It comes with the 12th generation i7 processor Nvidia RTX 3060 Ti graphic card This is on a clearance and It's priced at $1,899.99 before taxes It's basically right under budget It's 100 bucks under And she got a 3060 Ti this time Allow me a minute here Two minutes later, we got a quote Yeah It's not bad Good They've sped up a lot So the totals after taxes It would be $1,781.14 Yeah, that sounds right within my budget I'm sorry, I think I gave you the wrong one Okay, so earlier I mentioned the option for $1,899.99, right? I don't 100% remember, maybe? Okay, because we have two options One is with the RTX 3060 graphic card That is priced at $1,599.99 That is also on a sale That is the RTX 3060 And the one for $1,899.99 It's the RTX 3060 Ti Whoa, so that's like an extra $200 to get the Ti? I was going to say something completely different I'm more upset that this is $400 less than the Alienware that they quoted and has the same GPU as that Yeah, what are they getting? What are you paying $400 for? Oh, you get a fancy case It looks like an Alien I'll email you that as well so that you can compare them side by side Okay Okay, thank you You know what, that is a really good way of handling accidentally giving the wrong quote Yeah, send them both Hey, yeah, whoops, sorry about that Here's both and you just let me know so that you're not putting pressure on the customer Yeah It also includes an optical drive And it comes with a McAfee LiveSafe 12 month subscription as a part of the promotion included in the price I would personally recommend you to consider the premium support warranty It includes support for both hardware and software related issues If she asks once It's okay That's okay That's a script And it does include software coverage so she knows what to expect Yes Thank you but no, I'm okay Okay It says order complete, thanks for your order Sounds great, thank you very much In around 20 minutes total, we've waited on hold, explained our situation, been coached through some of the different options and we've managed to place our order That is not bad Yeah, super reasonable And only one offer of extended warranty and no offers of financing Which is not actually what I was asking for last time You can offer it Just not three times Yeah Now just a second If I recall correctly, CyberPower has gone full failure to launch in the past Outright refusing to provide any recommendations So the good news is they can only go up from here We'll see how they do CyberPower how can help you Hi, I am looking to purchase a gaming PC and I was hoping you could help me figure out what I can get with my budget Sure, what you're looking for maybe like let's start with that Totally What kind of system first, like what kind of system like maybe the specs wise or the price wise? So my budget is about $1500 His microphone needs to be replaced yesterday In all fairness, I actually really like how you can't hear like the call center background All I can hear is him he needs a better mic Maybe what kind of game like game wise like shooter game I play like Minecraft, Overwatch, Stardew Valley, stuff like that Really good question though Shooter game Yeah, good question Could have asked it a little better but yes it's a good question Alright, in the front page there is a system called Daily Deal 4060 That one is very good It has an i7 already and a 4060 graphic card at 16 gigabyte and 2 terabyte M.2 hard drive This is absolutely going to stomp the machine that Dell recommended 4060 versus 3060 Ti Well, okay, hold on That's not that big of a difference unfortunately That's been a whole thing It will significantly outperform a 30 series card with DLSS or with ray tracing Yeah, frame generation And it looks like that's a 13th gen processor as well I also want to give massive kudos to the sales rep for going straight to what was on a deal Yeah, for real Don't try to sell me some higher priced you know, crap that you guys are trying to get rid of when the best deal is the one that's right on the front of the website Great, and this will fit under my budget because it's on the deal, right? You can even go higher Like in customization page, let's say you want to change the case to something you like different color or He's clearly identified the kind of customer that he's dealing with and he's offered options that will be meaningful to that customer That's either good training or good sales instincts right there Seems to know what he's talking about Cosmetically you want something different We have options like that, too He just needs a better mic It's not awful, but it's not good It's pretty awful Great, yeah, it's mostly just the credit card stuff from here Great, thank you so much for your help Oh no problem, call back anytime Okay, have a great rest of your day Look at that, that was like five minutes Wow, now I will say this and this is not a bad customer experience but if I was going to give some advice to Cyberpower's management, he should close that sale Don't let someone get off the phone when you can take their money But is that just how they operate, though? Because so many people, like I said, they've got the website They shouldn't operate like that That's a business They should close the sale I don't disagree, but that's a business decision Close the sale, Cyberpower Alright, HP Is this our phone? What the heck? It fixed itself. Hi, thank you for calling HP Canada sales welcome to our back to school sales My name is **** How may I help you with your purchase today? Hi **** I'm looking to get a gaming PC and I was just wondering if you could help me out Sure, I'd love to May I know, do you have a specific model in mind? I don't Well, it's totally fine I'll be helping you out and don't worry, I'll be asking you a few questions She's cheery, she's bubbly, she's a little bubbly Do you have a specific specs in mind or specifications for the RAM, processor? I don't have any specific specs in mind I know a game a little bit She's so excited to offer a recommendation though You mentioned that you were into Minecraft and also video streaming I just want to confirm, are you into more on saving a lot of data outside of that? Doing what data? Saving a lot of data Oh, do you need a lot of storage? I think she's asking about recording video She's the first one to ask that Yeah, and it's a pretty good question That's a great question Do you consider some graphics, memory and graphics in mind, for example, 4GB for the graphics to ensure the display of the system? That is a great question and I would love your advice on it I'd love to share it with you, thank you so much for trusting me well, we have, ideally for gaming, me too, I have a brother who's gaming on Minecraft as well He has 4GB and at least for him, he's doing well with that laptop though that is not in HP Full points for honesty She is genuinely digging into her personal experience to provide the best advice she can Is it the best advice? Not necessarily The frame buffer on your GPU is not the most important thing No, especially these days Well, not in the way that she thinks it is Sure And how about for the memory? Is she asking about memory again? Yeah, she's mentioned it quite a bit I gotta give her full points for trying, but this feels a little bit like the blind leading the blind right now I would have liked to see HP have a better support structure for this They clearly have a phone rep here that is hyper enthusiastic and genuinely wants to help the customer But they need internal resources where she can go Hey, let me put you on hold for a second Look it up Go look it up or go ask somebody and come back with a more informed suggestion Yeah, I don't mind being on hold as long as it's not for more than like 5 or 10 minutes And how about for the processor, do you have an idea with processors for your tower or She is desperate for Shea to have a preference for this computer Yep, I have here Omen by HP I should hope it's by HP Yep, this is the Omen by HP, 25 litres, GT12-1309 The litre doesn't, you know, we don't care about case size, but she does get to the actual Really? That's the first thing you're going to tell me is the internal volume I'm sorry, am I buying milk? Okay, I'm on your website and I'm on the desktops Omen, I believe 25 litres In fairness to the rep, whoever the product manager is for HP who works on their site Why is the case volume? Case size is the first thing in the product description She's just reading it That is terrible That is a multi-level breakdown here I really appreciate her saving us a bunch of money We are way under budget here, is that Canadian dollars? 1300 bucks, yeah, wow It's a 3060, so it's going to be a little behind the TI And a 5600X But at 1300 bucks, that's a way better deal Canadian, yeah, that's really good Haven't checked storage or anything yet No hard drive, no optical drive That's fine It sounds like a really good deal, but if I spend closer to the max of my budget, which is the 2000 dollars, could I get better specs? Sure, I'll let me go ahead and have a look at that Sure, let me go find a random computer that costs that much And I'd love to know, how is your day going Shea? It's going lovely so far, thank you so much for asking I've got a wonderful tea here, how's your day going? Oh, really great, actually, you're one of the nicest customers that I speak with today and I'm really grateful for this call Aww That's the reason why I wanted to know your day and thank you so much I believe her Yeah She seems pretty sincere I believe her She's going to end up with a crappy computer I think Well But she's going to have a great time Look at the look on her face She is a happy customer, yes, She's a happy customer The reason why, I recommend to you this one It has a better motherboard or processor This will be the best performing gaming PC we've seen 3070 Ti, 5800X, I think that's it Yeah Above all, the reason why we choose this is because it has a better support system for the overall performance of the PC The cold hard truth is that this sales rep doesn't know anything about computers, unfortunately Yeah, probably not She needs internal support She needs a bit of training She does a great job of making sure the customer has a fantastic experience but she needs some help We do also have a care pack or like an extended warranty which is the HP 2-year on-site hardware support service for this desktop for only $474.99 Did she just offer me a $500 warranty on this computer? Canadian Sorry excuse me, a $350 US dollar warranty? Right now, Shea are you ready for the good news? I am ready for the good news Perfect, so yep I have here, as you see here we have a 37% off for this specific omen So I can provide to you an up to, hold on, yep additional $200 off Yo How is that? Free money, I'll take $200 off That's amazing, oh my gosh thank you Yeah, the sale is already made 'kay, that's a big deal Offering someone a discount up front before you've taken their payment information? Okay sure Offering someone a deal after you've taken their payment information? That is sigma tier customer service Above and beyond Let's talk about this video's sponsor for a second, Ugreen Ugreen's Nexode RG is a 65 watt GAN charger with a friendly little face that lets you know when your device is charging It can charge all your devices like phones, tablets, laptops and more And at 65 watts it's able to charge up your iPhone 15 to 60% in just 30 minutes And when charging is complete, the friendly face will change to let you know that you can unplug The unique design of the robot GAN is also a protective shell for added durability And of course, the RG employs all the Ugreen tech that you expect Like thermal guard protection, which checks temperatures 238 times per second And GAN fast tech for fast energy efficient, cool and compact devices You can pick up one of these new RG chargers from Ugreen today By using the link and the code in the description below I have a feeling this won't be quite the same Thank you for calling that by power, how can I help you? Hi there, I'm looking to buy a desktop PC And I was hoping that you could help me figure out what would be best within my budget Of course, and okay so to start, what is your budget? Oh, he's got the one I hate when you can hear it, it's bad Oh man, going from **** to hi, how are you, you want a computer? And what will you be doing on the computer, gaming, coding, work? Good question, good start It's for personal use, but for gaming definitely things like Minecraft and Overwatch and Stardew and stuff Quality is good otherwise, I think it's just like right by his mouth. So there's two ways that we could go about it There are RDY systems that we offer These ones are already packaged up, built, tested, ready to go They ship out the next business day and they have two days shipping You cannot alter these in any way, they are just sold as is But it would be the fastest way to get a system if you need one now But it's also going to be a little bit cheaper than a custom computer As a custom computer might cost a little bit more even for the same specs Because we do build those made to order That's a really, really good explanation of my options Yeah Gotcha, I think the first then, if that's the easiest route Alright, are you on our website right now? I think so, yes Okay, so what I have done is I went to RDY pre-built computers on the top of the page And then the two that I am looking at, they're right next to each other One of them is the Gaming RDY EMRRG213 ERMERGER 213, oh I do not like their naming for this No Okay, so those are going to be the two systems that we're going to be looking at 4060 TI though And I like that he's given us two options here Both like under budget and then one a little cheaper if I want to save a bit of money That's not bad Yep And the CPU that's in the SLMBG221 is an Intel i7 Which is a step above the previous or the other CPU in the other system Which would give you the benefit if you definitely are going to be streaming He addresses her use case He explains why the parts he's chosen are valid for her That's a really clear explanation of why more cores is more good Yeah Yeah, the better one that you were talking about looks like it would fit under my budget Yeah, that would be the better one And it's mainly just that CPU like I said They're essentially the same I believe the case is different So if the case is going to be a deal breaker then go with the other one That sounds great And then of course all of these computers they can be upgraded in the future down the road if you ever need to make upgrades Especially because he said originally that these come like pre-built as a unit I'm glad you clarified that Oh okay, cool Great, that's good to know Yeah, did you have any other questions? Um, I don't think so I can just buy it through the site Yeah Buy it through the site This guy's great He just needs a new microphone If you have any other questions even before you purchase it Just go ahead reach out to us We are here to help you out Once again, doesn't close the deal Close the damn deal bro Thanks for calling Maingear, this is **** speaking. Hi my name is Shea and I'm looking to get a desktop PC and I was hoping you could help me out with that. Sure, absolutely, so were you looking at something specific, you probably had something in mind that I can help you with? Or I can just give you general suggestions as well. That's good. Really low pressure, I like that I have a budget and that is all I have at the moment Gotcha Yeah, I mean that 100% works So yeah for that we could definitely take a look at one of our MG-1's Like the pre-configs The only thing that I would that I wonder right is the fees right Because once you're importing to Canada there's shipping Wow I am detecting a genuine concern for the value that I'm going to be getting out of this transaction I feel extremely cared about right now No one else mentioned that Um, but there's also import taxes, right? Which typically come about like 10-15% He just walked me through all the additional fees that could surprise me Yeah And set a budget that's going to keep me within my total target So that said uh the gold it's right around that price range is $1,299 US So like just taxes themselves uh themselves would actually bring um you know the system up to like $1,500 bucks US in shipping But it's it I'll say it's still around that you know price range you're looking for Um is that the system you're interested in? Uh yeah I think if if that works um the shipping and the stuff uh it still feels pretty close to my budget so I think that sounds good I think Yeah you know absolutely and I mean you know it's just an option I know that you know shopping international could be you know challenging you because you do have those extra uh um uh fees right there so He is doing the most humanly possible to talk us out of getting a bad deal here without just explicitly saying do not buy from me go away run Yeah The MG-1 and then it's going to be um the gold 4060 TI It's not even that crappy No But we definitely skimped on the CPU so 13400 KF too doesn't even have onboard graphics If you're you know you're running to memory uh like high memory usage then it'll probably be worth like upgrading that RAM later on This is too jargony it's an A- now Yeah she's already getting bored She's tuning out yeah Great thank you for the recommendation so I I have it open here and I will just press add to cart and great I guess I just go through the the steps of checking out And if you have you know any questions whatsoever um any help setting up anything of that nature we're always here to to help all right Absolutely thank you so much for your help I appreciate it I am not surprised that CyberPower and iBuyPower didn't close the deal I'm very surprised that MainGear didn't close the deal Really why MainGear? Because from our experiences with them in the past they're pretty well trained very professional Yeah he knew what he was talking about And it's been start to finish Mmm They don't have a shopping line for NZXT No sales line Yeah so we had to call a support line and we weren't even sure if they'd be able to help us or not Interesting I mean I'm not even upset I'm a lot more upset if you don't have a support line and you do have a sales line but like I know it's 2023 but a lot of people still like to call in and get advice Yeah Hi thank you for calling NZXT this is **** how may I help you Hi my name is Shea and I have been looking on your website for a gaming PC and I would kind of like some help here Of course yeah I can definitely help you out with that Is this your first time buying a PC? Yeah it's my first time buying my own PC yes Also a great question first time buying or not That's a really good question That'll really tell you a lot of like whether they need hand holding or not Awesome and then what kind of PC are you looking for? Is there anything like you're trying to achieve with this new system? I want to use it for gaming Would you know what resolution you'd be playing at? That's a good question Good question 1440p And have you had a PC before? Are you like impartial to certain brands or like CPUs or anything like that? Oh what a great way of asking that Yeah this guy's gonna get poached So in my opinion I would most likely want to go for a pre-built system That way you can just get the most from your money without having to pay for any service fees Immediately goes straight for the best value Having identified that this is not a particularly picky customer So I would probably recommend one of the the player the player one prime That's a pretty good system and then you could also like change some components in it Perfect yeah so I would either recommend the player two system Not the prime because that would just be a little bit outside your budget They're going to crush the performance if they can convince Shay to spend another hundred bucks or if they can offer her a deal I mean we just use regular components that you could get purchase yourself So you're more than welcome to upgrade these systems in the future if you like Brings up upgrading well Yeah I just see the player two it's uh one thousand five hundred and ninety nine dollars So it's a bit outside of the $1,500 U.S budget Like okay well no it's $2,000 Canadian but that's like about I think if I'm doing my conversions correctly it's about fifteen hundred U.S Yeah roughly that's what I've seen at least online with online conversions About $2,000 Canadian is just a little under fifteen So if I click the player one um and then I which of the There seems to be a bunch of different collections uh or different choices In regards to that if I were to make any changes to your system I would probably just upgrade the CPU It just allows it's just at a higher clock frequency And also I believe it has more cores if I'm not mistaken And it would just perform a little bit better especially with games like Minecraft I would say I'd probably recommend that too Okay he's already got the 4060 Ti and that's the highest end they offer on the system Yeah get the 12600k which is a significant upgrade over the 12400F Honestly I'd take the 12400F and a 4070 for 14 she told him 1440p She did you're right it's not 1080p Just do note so there is an international shipping fee I believe it's a hundred dollars from To ship from the U.S to Canada through our website and then since we don't charge you Any taxes you may incur a customs fee when the system is being delivered to you or attempted to be delivered to you Okay for someone who supposedly works in product support knows about computers Well not just that but he warned us about import duties and stuff Yeah that's yeah that's a good point Outstanding like who is this guy? Might as well be a sales rep Yeah Okay great Was there anything else I can help you out with at all or any other questions or concerns? I don't think I don't think so I'll go through the proceed to check out stuff And thank you so much for your time I appreciate it Maingear stood out so far head and shoulders above the rest in the past So far head and shoulders above the rest in the past Not as much as time it's not the case anymore There's been like no hold times too nothing longer than like two minutes tops Thank you for calling origin pc how can I help you Hi my name is Shea and I am looking to purchase a gaming desktop PC My budget is $1,500 US So for desktops I don't believe we have any that would go that low just because we're a high end Did Shea just get called too poor? Yeah well in a nice way in a nice way we don't have anything that fits in your budget So all of the parts that we have are parts that came out last year or this year How does that make any that doesn't mean anything if anything last year's parts should be cheaper Lower end for us would be a thousand seven hundred with the two hundred dollar discount So we wouldn't be able to make you a build that low or at the fifteen hundred USD The rep sounds really uncomfortable yeah she does She doesn't want to tell someone hey I'm sorry you can't afford our premium products But it would be either under our gaming desktops it would be either under the Neuron gaming desktops So I would say just play around and see if you can find something that would work for you there But otherwise it wouldn't be able to be lower than that for desktops Okay uh thank you very much I'll take a look and I'll call you y'all back if I need To Origin's credit they have performed extremely poorly at our budget in previous secret shoppers And maybe there's a degree of honor in just kind of bowing out and hey look if this price point Doesn't work for your margin model just kind of going okay then we're not doing forget it if we're Not competitive we're not going to sell something that sucks but look at the look on Shea's face So we ended up emailing Starforge because we couldn't find a number to call them with just Asking if there is a number to call because we want to purchase a computer and they got back to us So they said thank you for reaching out we appreciate your interest in us here at Starforge Sincerely I'd be happy to help make a recommendation for one of our systems based on a few factors They asked what our budget is what's the use case for our system if we're gaming creating content Streaming or using it as a workstation for creative processes like 3D art and then the last Question is what are our space constraints with the system no one else has asked about space Constraints well HP made a point of uh 25 calling out how many litres their computer was so we were Replying to them letting them know our budget is fifteen hundred dollars us personal uses for Internet surfing as well as gaming with games like Minecraft, Overwatch and Stardew Valley So StarForge responded oh yeah this is like right away half an hour, ten minute response times So like okay we couldn't call but that's really fast email support yeah uh they said hey Shea Sure thing based on your wants and needs for a new system I would highly recommend our Horizon 2 Prime this system will perform fantastically in all of those use cases especially in the Gaming titles that you mentioned for such if you have the interest of pursuing more of your Streaming endeavors to a greater depth I would make the suggestion what is this email for the Horizon 2 Ultra instead this would allow for your stream to look flawless because of the additional VRAM okay they've made good recommendations but what's their pricing cool okay so it looks like We have Horizon 2 Prime which is $1,349.99 U.S And the more expensive version that he suggested was the Horizon 2 Ultra but No Oh ouch $2,099.99 U.S Hey couldn't help noticing that uh you don't have enough money for this system but I'm gonna send it to you anyway we're going with the Horizon 2 Prime because that fits within our $1,500 budget it's like you know I hear your budget's $1,500 but we also offer this $3,000 when you compare that to the reps that were concerned about shipping and Taxes and duties affecting our our budgetary requirements but you know what this is like Sheer zero F's given yeah I don't know here you go one's in budget I am very excited to see how these stack up in terms of performance unlike previous years there's some trade-offs here that I'm looking at going yeah depending on what we play this could be a pretty close race especially now that both DDR5 and DDR4 are both still on the market and being used in all of our systems I'm also really interested to see how Starforge's build quality has improved since last time sure I found errors that I had to fix the last time I bought a computer from them and they said we're taking this very seriously well let's find out just how serious they take it that's it for now then they're ordered we're gonna see what shows up in a week or two but first we got to talk a little bit more about today's sponsor Ugreen. Ugreen presents the world's first 300 watt five port GAN charger with a dedicated 140 watt output this allows you to fast charge multiple laptops at once streamlining your charging setup you can charge a 16 inch MacBook Pro to 56 percent in just 30 minutes and power up to five devices simultaneously their thermal guard system ensures protection against overheating overcharging and excessive current with a robust flame resistant shell and their GAN technology is super efficient which reduces wasted electricity it also comes with a premium design with a sleek space gray matte finish and a convenient two meter power cord for flexible placement you can check it out at the link down below if you guys enjoyed this video maybe go check out some previous secret shoppers there aren't any more parts of this one to watch yet but they will be coming hopefully over the next three to four weeks so watch out system integrators we've got our eye on you",
    "transcript_keywords": [
        "Yeah",
        "good Yeah Yeah",
        "Linus and Plouffe",
        "good",
        "Plouffe Yeah",
        "budget",
        "good question",
        "Alienware gaming desktop",
        "system",
        "great",
        "Yeah Yeah",
        "gaming",
        "gaming desktop",
        "good question Good",
        "sales line Yeah",
        "deal",
        "Alienware gaming",
        "question",
        "sales rep Yeah",
        "good Yeah"
    ],
    "transcript_entity_values": [
        "one",
        "two days",
        "five minutes",
        "MainGear",
        "300",
        "One",
        "Yeah Buy",
        "These days",
        "4070",
        "zero",
        "last year",
        "a hundred dollars",
        "3060",
        "about like",
        "GPU",
        "sigma",
        "Yeah The MG-1",
        "Dell",
        "Plouffe Yeah",
        "1,500",
        "400",
        "HP Yep",
        "25 litres",
        "1,781.14",
        "4060 Ti",
        "Cyberpower",
        "16 inch",
        "2,299.99",
        "three",
        "Canada",
        "2,500",
        "Sebastian",
        "Overwatch, Stardew Valley",
        "more than like 5",
        "about $1500",
        "RG",
        "About 2000 Canadian dollars",
        "Canadian",
        "Linus",
        "$1,299 US",
        "100 bucks",
        "Two minutes later",
        "only one",
        "yesterday",
        "Starforge",
        "140 watt",
        "U.S",
        "5600X",
        "the next three to four weeks",
        "the 2000 dollars",
        "McAfee LiveSafe",
        "another hundred bucks",
        "first",
        "GB",
        "Maingear",
        "1500",
        "last year's",
        "a week",
        "R15",
        "Brings",
        "Great",
        "Shea",
        "14",
        "Origin",
        "two hundred dollar",
        "fifteen hundred dollars",
        "ERMERGER",
        "2023",
        "About $2,000",
        "25",
        "2,000",
        "300 watt 5",
        "Nexode RG",
        "12400F",
        "4",
        "Taxes",
        "MacBook Pro",
        "at least two",
        "CPU",
        "around 20 minutes",
        "13th",
        "4060",
        "Minecraft",
        "only $474.99",
        "13400",
        "one thousand five hundred and ninety nine dollars",
        "iBuyPower",
        "StarForge",
        "30 watt",
        "Overwatch and Stardew",
        "Intel",
        "Shay",
        "ten minute",
        "Minecraft",
        "10 minutes",
        "Shooter",
        "4060",
        "iPhone 15 to 60%",
        "Yeah Gotcha",
        "HP Full",
        "2,000",
        "HP",
        "Shea",
        "Streaming",
        "1,899.99",
        "$1,500 US",
        "just 30 minutes",
        "47 seconds",
        "Ugreen",
        "five",
        "4GB",
        "$2,300",
        "Ugreen Ugreen's",
        "2-year",
        "DLSS",
        "a thousand seven hundred",
        "16 gigabyte",
        "30",
        "100%",
        "CyberPower",
        "15",
        "GAN",
        "half an hour",
        "about $15,000",
        "2 terabyte",
        "Cyberpower Alright",
        "5800X",
        "Notalie",
        "12 month",
        "two",
        "Yo",
        "Download",
        "300 watt five",
        "3060",
        "HP Canada",
        "NZXT",
        "second",
        "1,599.99",
        "$2,000",
        "previous years",
        "65 watts",
        "MG-1",
        "XPS",
        "Great",
        "about fifteen hundred",
        "Neuron",
        "Streaming",
        "200",
        "3,000",
        "today",
        "Horizon 2",
        "Ugreen",
        "238",
        "$1,349.99 U.S",
        "CyberPower",
        "the 12400F",
        "RAM",
        "1300 bucks",
        "2,099.99",
        "10-15%",
        "US",
        "37%",
        "$350 US dollar",
        "the next business day",
        "Minecraft",
        "two meter",
        "500",
        "Nvidia",
        "1309",
        "56 percent",
        "Alienware",
        "Horizon 2 Ultra",
        "65 watt GAN",
        "Aluminum",
        "a minute",
        "10 years ago",
        "DDR5",
        "this year"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "NORP",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "NORP",
        "PERSON",
        "MONEY",
        "MONEY",
        "TIME",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "ORDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "TIME",
        "PRODUCT",
        "TIME",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "TIME",
        "TIME",
        "GPE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "MONEY",
        "MONEY",
        "DATE",
        "LAW",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "PERCENT",
        "GPE",
        "PERCENT",
        "MONEY",
        "DATE",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "LAW",
        "QUANTITY",
        "PERSON",
        "TIME",
        "DATE",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.15815351903438568,
        0.03398153930902481,
        -0.04820293188095093,
        -0.018219931051135063,
        0.11162671446800232,
        -0.01551592256873846,
        0.02103920467197895,
        -0.009466181509196758,
        0.01158853992819786,
        0.007637680973857641,
        0.04122709855437279,
        -0.02306683361530304,
        0.03824838250875473,
        0.03137009218335152,
        -0.00022166655980981886,
        -0.01407498400658369,
        0.0371355265378952,
        -0.06550206989049911,
        -0.016027042642235756,
        -0.03388439118862152,
        0.0008874186896719038,
        -0.030429929494857788,
        0.00677094142884016,
        -0.03727792948484421,
        0.024471260607242584,
        -0.05294730141758919,
        0.052108604460954666,
        -0.08922021836042404,
        -0.056643057614564896,
        -0.09597163647413254,
        -0.006817163433879614,
        0.01723354496061802,
        -0.0025082994252443314,
        -0.0035845651291310787,
        0.02832304686307907,
        -0.04001227021217346,
        0.029468053951859474,
        -0.09508992731571198,
        -0.04466238245368004,
        -0.051599882543087006,
        0.0165029875934124,
        -0.01179742906242609,
        -0.01740722544491291,
        0.024076754227280617,
        0.02881128154695034,
        -0.012535342015326023,
        -0.03475770354270935,
        0.01152903400361538,
        -0.02400311641395092,
        0.0011095183435827494,
        0.044071126729249954,
        -0.04597947746515274,
        0.018575821071863174,
        0.013858890160918236,
        -0.05336514860391617,
        0.015083163045346737,
        0.0027640920598059893,
        -0.08390583097934723,
        0.04106775298714638,
        -0.06117571145296097,
        -0.012668253853917122,
        -0.11074870079755783,
        -0.043851327151060104,
        0.026100125163793564,
        -0.025526512414216995,
        0.002501578303053975,
        0.04294156655669212,
        0.03842298686504364,
        -0.07384143024682999,
        -0.010262937285006046,
        -0.0037522127386182547,
        -0.0268348790705204,
        -0.026728074997663498,
        0.01732591725885868,
        -0.0012104364577680826,
        0.05307578295469284,
        0.07440736144781113,
        -0.03762049600481987,
        0.02435997501015663,
        -0.02430548146367073,
        0.06763381510972977,
        -0.01231155451387167,
        -0.03231450915336609,
        -0.00539139611646533,
        0.06026972830295563,
        -0.0210590623319149,
        -0.04692978039383888,
        0.009765509516000748,
        0.008242717944085598,
        -0.09347827732563019,
        -0.0010521928779780865,
        0.08384647220373154,
        0.013290300965309143,
        0.001372768310829997,
        -0.0003300174430478364,
        0.006683995947241783,
        0.006663494277745485,
        -0.040954411029815674,
        -0.04021184518933296,
        0.03138148784637451,
        0.05287344381213188,
        0.061383459717035294,
        0.04881750047206879,
        -0.09329160302877426,
        -0.019740168005228043,
        -0.062302008271217346,
        -0.026393253356218338,
        0.09493470937013626,
        0.028939634561538696,
        0.024692632257938385,
        -0.06978684663772583,
        0.04839858040213585,
        -0.05115038901567459,
        -0.05563914030790329,
        0.05714946612715721,
        0.04931291937828064,
        -0.050067588686943054,
        0.04573330655694008,
        0.07252837717533112,
        -0.027623316273093224,
        -0.0030131980311125517,
        0.07693395763635635,
        -0.036835137754678726,
        -0.006987446453422308,
        -0.008419186808168888,
        0.02878340147435665,
        -0.08382239937782288,
        9.74580986963253e-33,
        -0.03259597346186638,
        0.0645786002278328,
        -0.08248873054981232,
        -0.06391297280788422,
        -0.017537906765937805,
        0.10013938695192337,
        0.0587247870862484,
        0.047603532671928406,
        -0.014179999008774757,
        0.039947375655174255,
        -0.05293670669198036,
        -0.003756409278139472,
        -0.09542547911405563,
        0.020256584510207176,
        0.03371807187795639,
        -0.02236126735806465,
        -0.030533110722899437,
        -0.0013999124057590961,
        0.01860382780432701,
        0.00569056486710906,
        0.04362700134515762,
        0.029153592884540558,
        0.05664306506514549,
        -0.0363406278192997,
        0.050255388021469116,
        -0.06524192541837692,
        -0.03147033229470253,
        0.0032322476617991924,
        0.0903690829873085,
        0.0039958227425813675,
        0.020081277936697006,
        -0.006688188761472702,
        0.09396620094776154,
        -0.01091704610735178,
        -0.0362490676343441,
        0.01852741464972496,
        -0.03514353930950165,
        -0.11277759075164795,
        0.04245829954743385,
        -0.01289432868361473,
        -0.05048121139407158,
        0.11235513538122177,
        -0.026420801877975464,
        -0.12671765685081482,
        -0.026356419548392296,
        -0.022691061720252037,
        0.028383959084749222,
        -0.025157269090414047,
        0.040756482630968094,
        0.04991323873400688,
        -0.10107900947332382,
        0.04331338778138161,
        -0.05070535093545914,
        -0.0009017247939482331,
        -0.021410221233963966,
        0.006809832062572241,
        0.03276987373828888,
        -0.03265129029750824,
        0.08453010022640228,
        0.0731985792517662,
        0.02394784241914749,
        -0.0037990666460245848,
        0.0014949317555874586,
        -0.0996251180768013,
        -0.1015741378068924,
        -5.316510396369267e-06,
        0.06239114701747894,
        0.0375126451253891,
        -0.13512620329856873,
        0.05887473374605179,
        -0.03527897596359253,
        -0.006060378160327673,
        -0.005853841546922922,
        -0.05572865903377533,
        0.048767007887363434,
        0.045479822903871536,
        -0.06366284191608429,
        0.0032840492203831673,
        -0.0069425348192453384,
        -0.09121678024530411,
        -0.10212438553571701,
        0.01157795637845993,
        0.043040111660957336,
        0.0745178759098053,
        0.0073908488266170025,
        0.004629918374121189,
        0.005753064528107643,
        0.03394034504890442,
        0.005345396231859922,
        -0.03674197196960449,
        0.05986756086349487,
        -0.004806573502719402,
        0.006974824238568544,
        0.0171781238168478,
        0.021038854494690895,
        -1.0446464012124124e-32,
        -0.004843622446060181,
        0.009207591414451599,
        -0.009771546348929405,
        0.02562836743891239,
        -0.009474523365497589,
        -0.02229607291519642,
        -0.025734545662999153,
        -0.0072855595499277115,
        0.07841218262910843,
        -0.05683685094118118,
        0.007785197347402573,
        0.13768687844276428,
        0.008606432005763054,
        -0.014677369967103004,
        0.11902087926864624,
        -0.03834114596247673,
        0.01700369454920292,
        -0.047197580337524414,
        0.044237665832042694,
        -0.051624033600091934,
        0.06804775446653366,
        0.02588135190308094,
        -0.045883726328611374,
        -0.012970183975994587,
        -0.0074749477207660675,
        0.02600976638495922,
        0.005693289451301098,
        -0.029083047062158585,
        0.0725216493010521,
        0.03062129020690918,
        -0.0379641130566597,
        -0.03259104862809181,
        0.004781630821526051,
        0.0766044333577156,
        0.06627272069454193,
        -0.05209678038954735,
        0.06862594932317734,
        0.0834934189915657,
        0.020863939076662064,
        -0.038506992161273956,
        0.028102202340960503,
        0.05832497775554657,
        -0.031058242544531822,
        0.012272194027900696,
        -0.0010742261074483395,
        -0.039153553545475006,
        -0.030738625675439835,
        -0.09532517194747925,
        0.05437730997800827,
        0.03878818824887276,
        -0.11266802996397018,
        -0.06462754309177399,
        0.029823191463947296,
        0.05186135694384575,
        -0.06873402744531631,
        -0.04697418212890625,
        0.013904737308621407,
        0.07574567943811417,
        0.04015156999230385,
        -0.08103684335947037,
        0.015556735917925835,
        0.08771805465221405,
        -0.06302288174629211,
        -0.013935604132711887,
        -0.03157703951001167,
        0.02196105569601059,
        0.018160274252295494,
        0.05361974984407425,
        0.040105611085891724,
        -0.029957059770822525,
        -0.03907875716686249,
        -0.003401014721021056,
        -0.0018347306177020073,
        -0.10859150439500809,
        -0.14474856853485107,
        -0.010694635100662708,
        -0.008726808242499828,
        -0.01783294416964054,
        0.017548518255352974,
        -0.06103706732392311,
        0.004573799204081297,
        0.016922466456890106,
        0.02113979682326317,
        -0.04803416132926941,
        -0.010961427353322506,
        -0.02645990066230297,
        0.09599389880895615,
        -0.006318273022770882,
        -0.0005403156974352896,
        -0.05317866429686546,
        -0.08497563749551773,
        -0.013660292141139507,
        -0.030215954408049583,
        0.054178014397621155,
        -0.019262688234448433,
        -6.549394981902878e-08,
        -0.02215554565191269,
        0.04277858883142471,
        -0.025775577872991562,
        0.06325459480285645,
        0.06938868016004562,
        -0.09390845149755478,
        0.010193158872425556,
        0.04797607660293579,
        0.025841018185019493,
        0.0684085413813591,
        0.12498608976602554,
        -0.09781412780284882,
        0.010049068368971348,
        -0.10308584570884705,
        0.0299201849848032,
        0.031231867149472237,
        -0.04099128022789955,
        0.09065854549407959,
        0.0061400048434734344,
        -0.03522530570626259,
        -0.030021021142601967,
        0.09986364841461182,
        0.01987394504249096,
        -0.05100453272461891,
        0.006853918544948101,
        0.04205020144581795,
        -0.004184247460216284,
        0.033809054642915726,
        0.0792999193072319,
        -0.028895022347569466,
        -0.09064983576536179,
        -0.020742682740092278,
        0.020537516102194786,
        -0.037396326661109924,
        0.06640496104955673,
        -0.02287406101822853,
        -0.042715784162282944,
        -0.016608890146017075,
        0.15908460319042206,
        0.04959607124328613,
        -0.027140634134411812,
        -0.10042046010494232,
        -0.029082484543323517,
        -0.007538123521953821,
        0.023165825754404068,
        -0.046743717044591904,
        -0.009223704226315022,
        -0.10032906383275986,
        0.012506144121289253,
        0.048868343234062195,
        -0.035826876759529114,
        -0.015497834421694279,
        -0.00047602676204405725,
        0.02305922470986843,
        0.04909618943929672,
        -0.0004130603338126093,
        -0.05895663797855377,
        0.03940213471651077,
        -0.017968675121665,
        0.06797048449516296,
        0.059765297919511795,
        -0.13711194694042206,
        -0.0237259641289711,
        0.08913253247737885
    ]
}