{
    "id": "osom0UfvuY8",
    "title": "It's so FAST!!! - ASUS ROG GT-AX6000 WiFi 6 Router",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-03T20:54:24Z",
    "video_url": "https://www.youtube.com/watch?v=osom0UfvuY8",
    "category": "Science & Technology",
    "tags": [
        "Internet",
        "ASUS",
        "ROG",
        "Republic of Gamers",
        "Router",
        "GT-AX6000",
        "Your Home Internet Is About To Get An UPGRADE!",
        "Routers are important",
        "Gaming",
        "Performance",
        "Dedicated",
        "2.5G internet",
        "WiFi",
        "Speed",
        "Gigabit"
    ],
    "views": 1983247,
    "likes": 49739,
    "comments_count": 1623,
    "description": "Thanks to ASUS ROG for sponsoring today's video! Check out the GT-AX6000 WiFi 6 router on Amazon at   Routers are basically a necessary item for your home since you're not going to connect just one item to the internet, and you want a good one to make sure everything that needs internet in your house gets a fast solid connection too. ASUS's GT-AX6000 router is something you might want to consider!  Buy ASUS ROG GT-AX6000 WIFI 6 On Amazon:  On Newegg:   Buy ASUS Zephyrus Gaming Laptop On Amazon:  On Best Buy:  On Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/o6oB",
        "https://geni.us/o6oB",
        "https://geni.us/nNg8M",
        "https://geni.us/Zq6ZuCg",
        "https://geni.us/6gM0n1",
        "https://geni.us/neTVFLJ",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Today's sponsored unboxing of the Rapture GT-A6000 Wireless Router is gonna be a little more interesting than usual because I've equipped myself with a regular old residential internet connection to test some of the features that ASUS says makes this thing great for gamers. With one being super easy port forwarding, especially, for game consoles. Honestly, it's something that doesn't come up that often today, since a lot of it can be done automatically. But when you do have to do it manually, it can be enough of a pain in the butt to really turn off, especially, novice users. So, this is one of those videos, where you might watch going, \"Hmm, I'm interested in this for myself,\" or you might watch it going, \"Hmm, I'm interested in this for a friend \"or family member who I don't want \"to help every time they can't connect \"to the multi (indistinct) \"or whatever their case may be.\" - [Andy] Linus, my internet! - No, your internet is fine. Your port is just blocked. Wow, they have really gotten the next level with their crab-shaped designs. They've also gone next level with the hardware. It's a quad core processor in here. It supports WiFi 6 up to a maximum of six gigabit per second over the airwaves. Now, obviously that is not just to one client, and that is under absolutely ideal lab conditions, but I still would expect it to be extremely fast. And for nerds like me, perhaps more importantly, it's also got support for 2 and 1/2 gig LAN and not just one port. Now, ASUS has some detail about this in their documentation, but I'd actually like to poke around on the firmware and see exactly how it works, but basically your WAN port. You know how normally on a router, you've got one that's labeled WAN, so that's the one that's gonna connect to your ISP provided cable box, or ADSL Modem, or whatever the case may be. We can go ahead and connect that. Now, they've got a second 2 and 1/2 gig port, presumably, for a preferred client. Say, for example, if you had your gaming PC and you were to upgrade the router, well, why does everyone else who rooms with you get to have 2 and 1/2 gig internet or whatever? But then again, most people don't even have 2 and 1/2 gig internet speeds available. So, what I wanna know is if I can configure one of the 1 gigabit LAN ports to be the WAN port, so that I could use these 2 and 1/2 gig ports as maybe for my preferred client, maybe I have like a video editing workstation, and I have a high-speed NAS. I don't wanna store all my video footage just on my boot drive on my computer. I'd love to see if it could be used for a use case like that. Some other cool gaming oriented features are packet prioritization to particular devices, packet prioritization according to the application. So, you could say, \"Okay, look, \"I want my gaming PC to be preferred, \"and I want these particular games to be preferred.\" ASUS also provides what they're calling a gaming VPN that supposedly reduces ping times to game servers. This is something that can be done. I'm not sure how good their implementation of it is. But I have actually noticed that when I VPN, for example, to our office, I actually get lower latencies to many game servers than I do just using my residential connection at home. And the reason for this is kind of complicated. iTel explained it to me once. That's our ISP here at the office. But in a nutshell, when you're on an enterprise connection or like commercial grade connection, sometimes you will get better prioritization so that you're taking fewer hops to get to whatever your main local hub is. And a lot of your game servers or even local content servers are going to be at those hubs. So in our case, the nearest big hub is VANIX, the Vancouver Internet Exchange. So, our office, even though it is actually farther from VANIX, actually, has lower latency to VANIX than my residential connection at home. Do you know that Jonah? - [Jonah] No. - Interesting, right? Another cool feature of the AX6000 is that it supports WAN aggregation. So, if you have two internet connections, usually for redundancy or low balancing, you can't just have two internet connections and expect your internet speed on a single device to double. So, it would be for multiple devices running or in case one goes down. So, if you've got two internet connections that can actually balance between them. This used to be the kind of thing that you had to load up third-party OpenWrt, or Tomato Firmware, or whatever else in order to have. But nowadays you can just have it with the Stock Firmware. Speaking of Stock Firmware, this particular one is not on OpenWrt supported list yet, but I wouldn't be surprised if it shows up, because ASUS routers are pretty darn well supported by the project. - [Andy] Can you flip the router upside down? - Can I flip it upside down? You just want me to show it and it's like scuttle crab-- - [Andy] Crab rave! - Half-life mode. (indistinct) (Andy and Jonah laughing) I guess I should show some of the physical aspects of it. So, you got ventilation holes on the bottom. You got some more ventilation holes at the front, along with your indicator LEDs and your WPS button. No, that's not it, that's the WPS button. This is to turn the LEDs on and off, if you do not prefer to have your LEDs on. At the back, we've got our power in power button, 2 and 1/2 gigs/1 gig, a reset switch, you've got four, 1 gig ports, and then you've got a USB 3 and a USB 2 port for configuring like a USB hard drive as just chip or NAS running off of your router, if you're into that sort of thing. It really is a nice way to save a buck. But from my personal experience, I've found that if that's really what you're after, you're probably better off just getting a less expensive router and like getting a NAS versus the more expensive routers to support the feature. Then again, there are some cheap ones that support it, but they're often really slow at it. So, your mileage may vary. Wait a minute, was this that simple? This is super cool, guys. So, my browser just, (snaps fingers) automatically, kind of like when you're on hotel WiFi or whatever, just grabbed this local portal and was like, \"Hey, do you wanna create a new network?\" I'm like, \"Heck yeah!\" Okay, RoG24. ROG... You know what, let's pick something simple. I like pickles. They do not like that password. It says, \"Danger.\" (Andy laughs) - [Andy] I like pickles. - I do like pickles though. I'll always remember that. I prefer to have a separate 2.4 and five gigahertz network. They do support QoS. So, if you have like a bunch of security cameras, or smart doorbells, or whatever else, like IoT devices, theoretically, those should be lower priority. But because those devices can grab onto the five gigahertz network, I mean, and there's no reason they should be there whatsoever, I like just manually putting them all on 2.4, where they'll have better range and they don't need the additional throughput anyway. So, do you wanna be an ax/WiFi 6 mode? Heck, yeah! Login name, admin. Password. (Linus laughs) We suggest you try a mix of letters, numbers, and symbols. Do you wanna continue? I mean, it's good they have these prompts though. That's what we're looking at right now, this is nice. So, they've got this little dashboard, where you can see your aggregate download and upload speeds, monitor your network ping and ping deviation. I'm not sure exactly what they're pinging. Maybe that's just between your router and your device. Actually, it seems a little high. Is it just telling you how long it's taken to reach just generally the services that you're using? That's kind of neat. I hear my fans working real hard. We might just be CPU limited. Oh, okay. (Linus chuckles) Between OBS and Steam, it's struggling a little bit. Well, you saw it here first, folks. My laptop is bottle-necking my wireless router. (Linus chuckles) Okay, this is quickly becoming a mess of wires, but there we go. Wait a second, that's pretty impressive. Hold on a second. I'm not screening recording on this. So, Andy, you're gonna have to grab it. Let me just turn up my brightness a little bit here so you can see this better. I'm on WiFi pulling down the entire rest of my gigabit internet connection here. Oh, hold on, yeah, yeah, yeah, sorry, sorry, sorry. (Andy chuckles) Yeah, let's make it. Let me be very clear that this is not on a wired connection. Freaking nuts! I think that's the highest I've seen to a single client, so far. I mean, I'm obviously right next to it, but sometimes that's not even an advantage. Like there's... You wanna be a little bit farther away. So, I'm just gonna... I'm gonna go over here, and this 81. 76, okay we dropped. 74, 75. I'm gonna maybe go hide around a corner or something. This is crazy, still half a gigabit. Two walls! 60. 66. 68. - [Andy] One more. - [Linus] Nope, it's not gonna make it. 68 only. - [Andy] Oh. - [Linus] 69! - [All] Yeah! - It's kinda cool. I remember chatting with Joel Crane. I forget where he works now, but he used to be at this place that makes WiFi tester dongles. And he was telling me that one of the really cool things about WiFi is the way that it can kind of bounce signals around on things. And then it'll kind of figure out, \"Okay, what's the timing?\" And it'll sort of optimize it so that everything sort of arrives in approximately the right order. And when you're moving, it can't do that. So what's neat is that even when I'm closer, like getting closer to the access point, you'll see these dips, because it can't use those optimizations. Whereas when you're holding still, that's when you're gonna be at your best, 86, 90, 93. Are you freaking serious right now? Are we gonna hit? Oh, I plugged in, I plugged in. (Andy laughs) I was like, \"What?\" And it's just super cool. We've done a dedicated video about this, but basically what it is is instead of buying like a mesh WiFi system in a box, you just upgrade your old ASUS router to the newest ASUS router, and then you put your old one in mesh mode. And you just kinda keep going like that and your coverage can never get any worse. You just put your highest performance access point in your most high traffic areas, and then you just kinda scatter your other ones around. Super cool. AiProtection is a Trend Micro collaboration that attempts to do things like blocking malicious sites, parental controls. Man, I'm so glad these weren't this good when I was a kid. So you can block websites, block apps. I mean, here we can try it. Okay, so do I like try to view adult content at work? - [Andy] Sure. - I mean, I guess so, right? We're tryna test this thing. Whoa, okay. - [Andy] Whoa! (Andy and Jonah laughing) - Well, ASUS, I think you got some work to do on the whole adult content thing. No, it's definitely not working, Jonah. I don't think we need to try anymore than we already have. I mean, you can if you want, but I haven't set it up on your device though, so. - [Jonah] Oh. - Yeah, won't do anything, and I'd have to set it up again. So, there's all your QoS. Hassle-free way to create port forwarding rules for online games, optimizes routing packets (indistinct). So, lots of different games here. That's fantastic, you just add them and (fingers snaps) it automatically opens up the necessary ports. Wow, that's really awesome. Oh, that's cool. You can do a site survey to basically see what else is around you and help optimize your WiFi settings. That can be really important if you've got a lot of neighbors. VPN Fusion is a feature that allows you to configure some clients to use a VPN and other clients to not, if you don't want the performance hit. I'm not gonna dig into that now though. Oh, this is cool. Being able to switch modes so quickly and easily like this, that is freaking awesome. So, just AP mode, if you just wanna use it as an access point. Repeater, media bridge. So, a media bridge would use the WiFi as like a back haul, and then you'd take like everything nearby and you'd plug it in over a wire. Obviously, there's a performance disadvantage, but it means that any of those devices could talk to each other over a wire, and then everything gets consolidated wirelessly. AiMesh node, that's really cool. All right, well, it doesn't excuse the adult content filter not working, but it appears as though the reason I can't get any ports open on this laptop is that I have our corporate anti-malware security solution installed on it, so. Well, I've tried everything I can think of. I've disabled UPnP, I tried to full cone NAT. I saw some people suggest that maybe the ISP is actually not providing you a true public IP. I have no way of validating that right now. But one thing I did check is whether you can set one of the gigabit ports to WAN. Unfortunately, I didn't see an obvious way to do that, But either way, when it comes to performance, this thing put up numbers that I've never seen before. So, you guys can check it out at the link in the video description. Thanks for ASUS for sponsoring this video. Thanks to you for watching it and get subscribed.",
    "transcript_keywords": [
        "internet",
        "Today sponsored unboxing",
        "ASUS",
        "Router",
        "port",
        "cool",
        "internet connections",
        "kind",
        "WAN port",
        "gig",
        "ASUS router",
        "ports",
        "WiFi",
        "connection",
        "yeah",
        "WAN",
        "gig internet",
        "gig ports",
        "thing",
        "great for gamers"
    ],
    "transcript_entity_values": [
        "68",
        "ROG",
        "half",
        "74",
        "Half",
        "ISP",
        "AiMesh",
        "ISP",
        "WPS",
        "One",
        "IoT",
        "Trend Micro",
        "60",
        "one",
        "USB",
        "Andy] Crab",
        "ADSL Modem",
        "AP",
        "NAS",
        "a second",
        "WAN",
        "Andy",
        "five gigahertz",
        "Today",
        "90",
        "second",
        "Joel Crane",
        "Repeater",
        "Andy] Linus",
        "2.4",
        "OpenWrt",
        "OBS and Steam",
        "LAN",
        "six gigabit per",
        "VPN Fusion",
        "UPnP",
        "third",
        "93",
        "first",
        "Wireless Router",
        "1",
        "two",
        "WAN",
        "75",
        "Jonah",
        "four",
        "iTel",
        "76",
        "the Vancouver Internet Exchange",
        "NAT",
        "66",
        "Two",
        "VANIX",
        "1/2",
        "Linus",
        "Tomato Firmware",
        "AiProtection",
        "CPU",
        "VPN",
        "2",
        "81",
        "ASUS",
        "86",
        "a minute",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "FAC",
        "PERSON",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE"
    ],
    "vector": [
        -0.009329823777079582,
        -0.013789944350719452,
        -0.027162550017237663,
        0.056886762380599976,
        0.017749963328242302,
        0.061300359666347504,
        -0.05491217225790024,
        0.017686180770397186,
        -0.04500078037381172,
        0.03575729578733444,
        0.020897233858704567,
        0.09532076865434647,
        -0.07018738240003586,
        -0.08357942849397659,
        0.05652707442641258,
        0.019822431728243828,
        0.061502233147621155,
        -0.12945447862148285,
        -0.08707132190465927,
        -0.025776291266083717,
        -0.0022274961229413748,
        -0.06560732424259186,
        0.0408129021525383,
        -0.07147331535816193,
        0.13592204451560974,
        -0.06029519438743591,
        0.06631170213222504,
        -0.016699330881237984,
        0.014220235869288445,
        -0.02276773750782013,
        0.02749420516192913,
        0.002922550542280078,
        -0.02484089881181717,
        0.04705601930618286,
        -0.04869198799133301,
        -0.09014976769685745,
        0.01892525516450405,
        -0.03297966718673706,
        0.050372254103422165,
        -0.058529581874608994,
        -0.013818259350955486,
        0.0008675182471051812,
        0.005337286740541458,
        -0.001969030825421214,
        -0.007991270162165165,
        -0.03060712106525898,
        0.003722157794982195,
        0.06480436027050018,
        0.10106353461742401,
        -0.024684520438313484,
        0.047350943088531494,
        -0.01054459623992443,
        -0.05937204137444496,
        0.0007408285746350884,
        -0.13472427427768707,
        0.04092304781079292,
        -0.07611770182847977,
        -0.0887642651796341,
        0.04146857187151909,
        -0.015326617285609245,
        0.05154822766780853,
        -0.11655905842781067,
        0.04775892198085785,
        0.055067941546440125,
        -0.02639584243297577,
        -0.04658949002623558,
        0.04620906338095665,
        0.030565161257982254,
        -0.0359196737408638,
        0.024614866822957993,
        -0.06255938857793808,
        0.054282259196043015,
        0.06777273863554001,
        0.0938936248421669,
        -0.03227158263325691,
        0.008004509843885899,
        0.10925909131765366,
        -0.04151235520839691,
        0.07199256867170334,
        0.026597589254379272,
        0.02988659031689167,
        -0.00035920110531151295,
        0.01653793826699257,
        -0.01800036057829857,
        0.049284398555755615,
        -0.060714006423950195,
        0.032901227474212646,
        0.05327703058719635,
        -0.029839206486940384,
        -0.12576384842395782,
        0.013420656323432922,
        0.07784535735845566,
        0.04852485656738281,
        -0.016777819022536278,
        -0.048308778554201126,
        0.021102985367178917,
        0.04069302976131439,
        -0.07260794192552567,
        -0.06405774503946304,
        0.04796250909566879,
        -0.02463366836309433,
        0.05196523666381836,
        0.108278289437294,
        -0.0011670469539240003,
        -0.011240399442613125,
        -0.030967453494668007,
        -0.030907394364476204,
        0.10143819451332092,
        -0.04272943735122681,
        0.012124300934374332,
        -0.08437597751617432,
        -0.004112681373953819,
        -0.04000060632824898,
        0.03791048750281334,
        -0.0439874567091465,
        0.026666566729545593,
        -0.03382765129208565,
        -0.02889064885675907,
        0.05483541265130043,
        0.003984625916928053,
        -0.026664480566978455,
        -0.008390193805098534,
        -0.009098085574805737,
        0.046587519347667694,
        0.06418119370937347,
        0.08012180775403976,
        0.02095138467848301,
        5.483581229566151e-33,
        -0.06285833567380905,
        0.13147474825382233,
        -0.07395419478416443,
        -0.10985659062862396,
        -0.01941310055553913,
        -0.018826521933078766,
        0.07233326882123947,
        -0.019944211468100548,
        -0.05342170596122742,
        0.0625503659248352,
        -0.10201318562030792,
        -0.058882832527160645,
        -0.09595490247011185,
        0.04879491776227951,
        0.05715407058596611,
        -0.02992650307714939,
        -0.0248529314994812,
        -0.03890685364603996,
        0.009184184484183788,
        0.07151834666728973,
        0.028316540643572807,
        -0.054711468517780304,
        0.016019005328416824,
        -0.03477579355239868,
        0.07053238898515701,
        -0.060295458883047104,
        0.012430623173713684,
        0.011498483829200268,
        -0.010431163012981415,
        -0.022894224151968956,
        0.028576303273439407,
        -0.03802032396197319,
        -0.02750793658196926,
        -0.029581887647509575,
        0.0024584231432527304,
        -0.037961989641189575,
        -0.14706763625144958,
        -0.0752110704779625,
        0.005871900822967291,
        -0.004926368594169617,
        0.004352501127868891,
        0.06458935141563416,
        -0.14327168464660645,
        -0.008514417335391045,
        -0.009959922172129154,
        -0.020913735032081604,
        -0.027917683124542236,
        0.05752447620034218,
        0.026634113863110542,
        0.027117550373077393,
        -0.0848173126578331,
        0.06100127473473549,
        -0.07068835198879242,
        0.04572860524058342,
        0.03530724719166756,
        0.01471986435353756,
        0.019970117136836052,
        0.022350501269102097,
        0.09273794293403625,
        0.040858812630176544,
        0.03087562695145607,
        -0.09366505593061447,
        -0.027083400636911392,
        0.051773812621831894,
        -0.048440031707286835,
        -0.052869703620672226,
        0.036960095167160034,
        0.0573062002658844,
        -0.09511460363864899,
        0.010119241662323475,
        -7.638606621185318e-05,
        -0.029323356226086617,
        0.011121227405965328,
        -0.0243143942207098,
        0.046501241624355316,
        0.010507116094231606,
        -0.06645415723323822,
        -0.042643461376428604,
        -0.06495476514101028,
        -0.04275473952293396,
        -0.010034262202680111,
        0.04803384467959404,
        0.017539994791150093,
        0.08453033864498138,
        0.022830046713352203,
        0.03938710317015648,
        -0.008083328604698181,
        -0.06609784811735153,
        -0.03272233530879021,
        0.03895636647939682,
        0.027780858799815178,
        0.011558299884200096,
        -0.055331163108348846,
        0.03166346251964569,
        0.026355283334851265,
        -4.9577642393441105e-33,
        -0.018181484192609787,
        -0.009376203641295433,
        -0.0005600479780696332,
        0.06683710962533951,
        0.035245656967163086,
        -0.015612299554049969,
        0.088838130235672,
        0.027704628184437752,
        -0.02740173600614071,
        -0.10062655806541443,
        0.027689233422279358,
        0.09377066791057587,
        0.04758695885539055,
        -0.013687259517610073,
        0.028173120692372322,
        -0.08229722082614899,
        0.07993929088115692,
        -0.07326029986143112,
        0.12539106607437134,
        -0.026977846398949623,
        0.05422912538051605,
        -0.00023267049982678145,
        -0.008000480011105537,
        -0.052762895822525024,
        0.003304932964965701,
        -0.035177454352378845,
        0.04686782509088516,
        0.0020798915065824986,
        -0.09174349159002304,
        0.04752179607748985,
        -0.01241310965269804,
        0.038742102682590485,
        0.10489344596862793,
        -0.028969455510377884,
        0.1216035857796669,
        0.033245109021663666,
        0.06590857356786728,
        0.009845753200352192,
        -0.02213095873594284,
        -0.01761654205620289,
        0.08826737105846405,
        0.051595043390989304,
        -0.004607643466442823,
        -0.018190350383520126,
        0.06616491824388504,
        -0.08115070313215256,
        -0.04032706096768379,
        -0.07487610727548599,
        -0.0989677757024765,
        0.028865132480859756,
        0.03657481446862221,
        -0.05906638130545616,
        0.004777349531650543,
        0.01768270879983902,
        0.07547181844711304,
        -0.05680079013109207,
        -0.04139600321650505,
        -0.0797586664557457,
        -0.047517526894807816,
        0.03849134221673012,
        0.009902975521981716,
        0.03253401443362236,
        -0.012719663791358471,
        0.030397484079003334,
        0.031399622559547424,
        -0.0690731480717659,
        0.03971078246831894,
        0.011409290134906769,
        -0.0009751096367835999,
        0.07414823770523071,
        -0.10164979100227356,
        -0.025401895865797997,
        -0.035472311079502106,
        -6.577953899977729e-05,
        -0.0030430618207901716,
        -0.015978502109646797,
        0.05223721265792847,
        0.08252439647912979,
        -0.004030759446322918,
        -0.010179584845900536,
        -0.04576815292239189,
        0.06172088906168938,
        -0.01665382646024227,
        0.019225716590881348,
        0.0053652264177799225,
        -0.03425060212612152,
        0.03496944531798363,
        -0.042227063328027725,
        0.0005500713014043868,
        0.01663530059158802,
        0.00583887193351984,
        -0.0457439199090004,
        -0.05136289447546005,
        0.0064831990748643875,
        -0.010883389040827751,
        -4.5663867354051035e-08,
        0.011375372298061848,
        0.0035305735655128956,
        0.024700729176402092,
        -0.006297660525888205,
        0.07731395214796066,
        -0.015382321551442146,
        0.024321330711245537,
        -0.07723115384578705,
        0.008808739483356476,
        -0.03919849544763565,
        0.036925919353961945,
        -0.025477668270468712,
        -0.03518069162964821,
        -0.026356816291809082,
        -0.04877069965004921,
        -0.025908570736646652,
        -0.021424099802970886,
        0.036946773529052734,
        -0.015925675630569458,
        -0.016666948795318604,
        -0.0036901417188346386,
        0.025478113442659378,
        0.057511188089847565,
        -0.011122070252895355,
        0.11295323818922043,
        0.025098469108343124,
        -0.0069692437537014484,
        0.013412382453680038,
        0.0601554736495018,
        -0.015016293153166771,
        -0.11387394368648529,
        -0.02154434472322464,
        0.020608998835086823,
        -0.01342787779867649,
        0.0340290404856205,
        -0.01622217893600464,
        0.0117671312764287,
        0.040122032165527344,
        0.05124053731560707,
        0.04259602352976799,
        0.05137287452816963,
        -0.03872152790427208,
        0.033431123942136765,
        -0.07655100524425507,
        -0.0009877461707219481,
        0.00681726960465312,
        -0.05240359902381897,
        -0.06133304163813591,
        0.04600686579942703,
        0.08676373958587646,
        -0.0017809944692999125,
        -0.010262255556881428,
        -0.02293701469898224,
        -0.04193061590194702,
        0.012496783398091793,
        0.009446591138839722,
        0.042640283703804016,
        -0.029185356572270393,
        0.004301539622247219,
        0.05016305670142174,
        -0.0055764890275895596,
        -0.05565785989165306,
        -0.04937320575118065,
        0.051367297768592834
    ]
}