{
    "id": "ot1JsRyjLcg",
    "title": "Space Heater Scams (Alpha Heater and More) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-01-13T17:00:37Z",
    "video_url": "https://www.youtube.com/watch?v=ot1JsRyjLcg",
    "category": "Science & Technology",
    "tags": [
        "Space Heater Scams (Alpha Heater and More) - Krazy Ken's Tech Talk",
        "Space Heater",
        "Space Heater Fire",
        "Space Heater Safety",
        "Alpha Heater",
        "Blaux Heater",
        "Blaux HeatCore",
        "Beaux Portable AC",
        "Elite Heat",
        "False Advertising",
        "Ad Scam",
        "Advertising",
        "Internet",
        "Website",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Computer Clan",
        "Heat",
        "Energy",
        "Electricity",
        "HVAC"
    ],
    "views": 1209935,
    "likes": 25272,
    "comments_count": 2466,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below It's winter, so that means loads of space heater products are coming out of the woodwork. But do products like the Alpha Heater and Blaux HeatCore live up to the claims? One of them might surprise you.  Watch more tech scam-busting episodes   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Hey, guys. Well, it's winter, so it's fricking freezing, but thankfully my good friends at Blaux have made a new heater. Isn't that great? Oh yeah, and there's this thing called the Alpha Heater too. Wow, I hit the gold mine! But do these things live up to the claims? Sponsored by Linode. Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and lately I've received tons of requests to look into some portable space heater products, so I thought I would dive into these two products more closely. And one of them might surprise you. Originally, I didn't think there'd be much of a scam to bust because at face value, a tiny heater seems way more realistic than a tiny AC due to the physics of such a product. But as I received more requests, I eventually caved and bought two of these products to test out. If you haven't seen my Blaux Portable AC saga, I highly recommend you check that out after this episode because those were just filled with BS. However when it comes to tiny heaters, the idea isn't too far fetched from a technical standpoint. So here's how space heaters work. There's many different types of compact/space heaters, but we'll focus on a specific type today, convective ceramic heaters. We get the name from the heating element being made of ceramic and aluminum, and a fan being used to distribute the warm air. First, electricity flows through the ceramic stones, and these stones are semiconductive, meaning the electricity experiences resistance. This resistance produces heat, and this heat energy transfers through the aluminum heatsink, and the element is now very hot, heating the air around it. Then a fan draws cold air through the space heater's intake and blows the heated air out into the room. Simultaneously, the fan is cooling the element, so it does not overheat. But there is another technology which prevents the overheating, which you'll see mentioned on several of these heater websites, PTC thermistors, or positive temperature coefficient thermistors. These ceramic stones are in fact PTC thermistors, which are thermally sensitive semiconductor resistors, which means as the temperature increases, the resistance also increases, which in turn reduces current and generates less heat energy. So the device cannot overproduce heat. It's self-regulating. Neat, huh? Science is pretty amazing. Now, when you compare that process to air conditioning, you'll see that ceramic heaters are way less complicated when you break it all down, which makes these tiny devices much more feasible from a technical standpoint and less scammy compared to those portable AC units I debunked earlier. So with that in mind, let's dive into the products themselves, starting with the Blaux HeatCore. The Blaux website actually seems fine. The web design is a lot less sketchy than other stuff I've seen, and the claims are reasonable. So I went ahead and bought one. Of course, they pulled the same old scarcity tactic with a bogus 35% discount to make it look like you're getting a deal when in reality that discount will likely never expire. And they valued the product at $138, which I think is a bit outrageous considering you can get comparable products for under $100, but I don't care at this moment. We're gonna buy it anyway. And big surprise, a post-transaction upsell pop-up. Oh, and another and another. Wait, am I reading this thing right? They're valuing this little air filter at $27.25? (duck quacks) And as you can see, the order arrived, and it actually got here pretty darn fast. And we'll test it out in a bit. Now let's switch to the Alpha Heater/Elite Heat. Oh, this one's a disaster. I've seen this device pop up in many fake looking news sites and articles, probably because anyone can buy these unbranded for $6.45 a piece on Alibaba and sell it at a huge markup, which also explains why I've seen this device show up under many brand names like Alpha Heater or Elite Heat. According to the Alibaba listing, the company behind this product is Sharewin, but they're not the people I'm concerned with. I'm more concerned with the companies or brands that are buying these things up at a low price and making these fake news articles and websites and selling them at a huge markup with BS claims. That's the real problem. For example, this Heat Review Guide article claims Elite Heat can heat up any room in 30 seconds, which for something this small and between the 350 to 500 watt range is highly improbable. Then they claim it can actually crank up to 1200 watts, but the OEM listing says 350, so I'm not sure which it is, but I'm guessing it's more than the 350 side 'cause it looks pretty small and cheap, but we'll test it soon. And then this next part, probably my favorite part on this website. Near the bottom it says, \"Due to the Elite Heat's success, \"many companies are making dangerous copies of the product.\" Yeah, that's the reason. Also this Heat Review Guide website has nothing else on it. No other reviews. Even the navbar links don't do anything. And the date for the published article, it just automatically changes to whatever the current date is. It's all fake. Yeah, I bet you're even fake too, Mr. Sammy Holland, if that's your real name. Another bogus website also popped up, Top Gadget Trending. And again, the publish date of the article just keeps changing. I bet Douglas Jones is in cahoots with Sammy Holland. I see what you guys are up to. This website calls the device Alpha Heater, and it goes on to make the bold claim that a tech startup is turning a $5 billion industry on its head. Really, only $5 billion? You guys gotta aim higher. According to Grand View Research, the US HVAC systems market was worth $15.16 billion in 2020. You guys are plebs! Then the website shows us how the product works. So it turns a blue room into an orange room. Okay, got it. And then it claims it can heat a 500 square foot space in 60 seconds. Again, I call BS, but we'll test it soon in a much smaller 144 square foot room, and we'll see how good it is. And it also claims to have an anti-microbial air filter, which I don't see in any of the photos, but we'll open the device up and check. And the worst claim in my opinion is that this device is similar to less efficient $1,500 heaters. Yeah, okay. The list just goes on and on. You get the idea. We could spend all day looking at the website filled with crappy claims and fake stories and all that. But hey, at least at the bottom, there's a disclaimer that says this is an advertisement. It's not actual news. Well, thank goodness. I'm glad you made the distinction that this is not a news article, despite you guys dressing up the website to make it look like a news article. The official Alpha Heater website is not as claim heavy as the BS news articles, so that's a plus. But this picture of a woman sleeping caught my attention. They show her sleeping next to the heater, but the safety instructions in the manual say, \"Do not leave the appliance unattended,\" and \"Do not use the appliance while sleeping.\" So I went ahead and bought one, at least initially I tried to. I used all my willpower to ignore this outrageous $100 value claim on this thing. And I click the buy button. Unfortunately I could not get my transaction to go through. Later, I realized the transaction probably didn't go through because I was typing in the wrong security codes, so that's my problem with my credit card. But anyway, I moved on to Amazon and the transaction went through, but it took a long time to arrive, much longer than the Blaux, and I ordered them on the same day. And when it finally did arrive, the box looked like this. Beautiful. That Amazon listing has been deleted by the way. So now let's test these heaters in a real life situation and see how well they work. We interrupt this transmission for a special PSA. Hi, my name is Krazy Ken, and before we move on to this test, I just want to remind everyone about space heater safety. Please do not leave these devices operating while unattended and please unplug them when you are not using them. You don't want your outlets to look like this or worse. Yes, there are built in features such as automatic shutoff switches, fuses, thermostats, and self-regulating heating, but the best safety feature of all is your brain box. So please protect yourself from fires and other heater related disasters. Remember don't cheat. Unplug your heat. Er. Paid for by the Krazy Ken ad council. All right, let's get back to the test. We'll start with the Blaux HeatCore. I placed the heater 76 inches away from a thermometer at a 45 degree angle. The thermometer was 38 inches above the floor and the room was 144 square feet. Then I turned on the Blaux HeatCore and let it run on the highest setting, 1200 Watts for 30 minutes. The ambient temperature was 63 degrees Fahrenheit when I started the test. As expected within a minute, the air closest to the heater warmed up very fast and the air flow could be felt up to 32 inches away at max fan speed. After 30 minutes, the room temperature raised five degrees to 68. Numbers aside, the room actually felt warmer and pretty comfortable. So I think this thing worked out okay. But now let's switch to the Alpha Heater. I redid the same test with the Alpha Heater. I ran it at the maximum setting, which according to the box is 500 watts, but I've seen other listings say it's 350, but we'll stick with the box's claim. The air flow could be felt up to 19.5 inches away. And although it did warm up the nearby air really quick, you'd have to stand close to it to really feel the effect. And another issue is no power cord. So if it has a lower powered fan, you would need to have it closer to you to feel the warmth better. But since it's plugged right into the wall, you don't have that kind of flexibility, making this thing not the best product, but let's continue. After 30 minutes, the temperature rose three degrees to 66. But most of the room still felt colder, likely due to the lower wattage on the heater and a less powerful fan. Now some of you may be saying, \"No kidding, Ken. \"Of course it doesn't work that well. \"It's got a lower wattage heater and a less powerful fan.\" Well, yes, I understand that. But I'm just trying to reiterate on how bogus those claims are in the advertisements. And it also smelled weird? The Blaux actually smelled kind of good. I don't know if it's because of the filter or whatever, but this thing kind of just smelled like hot metal. I'm not really sure how to describe it, but it was unpleasant. So in this comparison, the Blaux HeatCore is the winner. Wait a minute. That's weird! What? Up is down, black is white. Blaux actually made something that's good and that works? Yeah, I think that's fair to say in this context. The $90 price point might be a bit high and the $138.45 value might be a little bit high, but that stuff aside, it actually worked okay. And it doesn't look half bad either. the Alpha Heater/Elite Heater on the other hand, not so good. It definitely did not live up to those fake claims on the website, and it certainly isn't comparable to a $1,500 system, especially considering a $90 product beat the pants off it. And the $100 value and the $49 price tag on this thing just make it an overpriced piece of junk. Do not buy it. And by the way, I did open it up and there was no air filter built in. Another fake claim. And before we continue, I want to talk about a company that does not make BS claims. And they're my awesome friends at Linode, and they helped make this episode possible. If you've ever wanted to build an app or a website or host a game server, Linode is your solution. You can simplify your infrastructure and cut your cloud bills in half with Linode's Linux virtual machines. Whether you're developing a personal project, building a website, or managing larger workloads, you deserve simple, affordable, and accessible cloud computing solutions. And that's exactly what Linode is for. Heck you can even deploy Minecraft in CS Go servers. And as a thank you for watching my show, I'll give you a 60 day $100 credit when you sign up today. You also receive 24/7 365 human support, regardless of your plan size. You can choose shared and dedicated compute instances, or you can use your $100 in credit on S3 compatible object storage, managed Kubernetes, and more. To put it simply if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click the create free account button to get started. And when you do that, you'll get that $100 in free credit. And you'll also be supporting the Computer Clan. So thank you very much. So as we move into the chilly season, make sure to get the right space heater that works for you and be wary of those false claims online. But I also recommend not using these for the whole season. They're really made to be used temporarily. If you have a bunch of them lying throughout your house and they're constantly running, not only could that be a potential hazard, but you could be using more electricity and drive your energy bill up compared to your normal furnace or your heating system built into your house. And you don't want to do that because then some scam company is gonna come along and try to sell you a magical device to save your energy bill just by simply plugging it into the wall. No, wait. That wouldn't happen, right? Oh crap. (upbeat music plays)",
    "transcript_keywords": [
        "Alpha Heater",
        "heater",
        "heat",
        "Alpha Heater website",
        "Elite Heat",
        "space heater",
        "Blaux",
        "device Alpha Heater",
        "heaters",
        "claims",
        "website",
        "air",
        "Alpha",
        "claims Elite Heat",
        "space heater products",
        "Heat Review Guide",
        "Blaux HeatCore",
        "claim",
        "test",
        "room"
    ],
    "transcript_entity_values": [
        "Blaux Portable AC",
        "32 inches",
        "the Blaux HeatCore",
        "US HVAC",
        "a minute",
        "60 day",
        "two",
        "38 inches",
        "68",
        "Kubernetes",
        "500 square foot",
        "30 minutes",
        "6.45",
        "one",
        "60 seconds",
        "27.25",
        "up to",
        "Minecraft",
        "$15.16 billion",
        "the Alpha Heater/Elite Heater",
        "2020",
        "Grand View Research",
        "350",
        "max",
        "all day",
        "100",
        "three degrees to",
        "Top Gadget Trending",
        "Elite Heat",
        "AC",
        "63 degrees Fahrenheit",
        "S3",
        "66",
        "138.45",
        "PSA",
        "Linux",
        "Linode",
        "the whole season",
        "350 to 500 watt",
        "the Alpha Heater",
        "1200",
        "144 square foot",
        "Ken",
        "CS Go",
        "Douglas Jones",
        "OEM",
        "Alibaba",
        "90",
        "the Alpha Heater/Elite Heat",
        "under $100",
        "today",
        "the Elite Heat's",
        "Krazy Ken",
        "this Heat Review Guide",
        "the chilly season",
        "144 square feet",
        "the Blaux HeatCore",
        "138",
        "up to 19.5 inches",
        "1,500",
        "Alpha Heater",
        "the Computer Clan",
        "Sammy Holland",
        "the same day",
        "$5 billion",
        "45 degree",
        "Sharewin",
        "half",
        "five degrees to",
        "35%",
        "30 seconds",
        "76 inches",
        "winter",
        "500 watts",
        "Blaux",
        "only $5 billion",
        "24/7 365",
        "Amazon",
        "1200 watts",
        "49",
        "First",
        "Linode"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "MONEY",
        "CARDINAL",
        "TIME",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "FAC",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "TIME",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.14504583179950714,
        -0.09383302927017212,
        0.007678872440010309,
        -0.04385140910744667,
        0.08181987702846527,
        0.03075477108359337,
        0.05997266247868538,
        -0.059795983135700226,
        -0.023052996024489403,
        -0.014040092006325722,
        0.013078650459647179,
        0.031918931752443314,
        0.01772899366915226,
        -0.07581094652414322,
        0.029017386958003044,
        -0.004861854482442141,
        0.04262354224920273,
        -0.057948999106884,
        -0.07244649529457092,
        -0.04698767513036728,
        -0.04528036713600159,
        -0.1294526755809784,
        -0.03868185728788376,
        0.029878322035074234,
        0.07217445969581604,
        0.004033013712614775,
        -0.02269880473613739,
        0.0446067713201046,
        -0.03931010141968727,
        -0.009900849312543869,
        0.04340634122490883,
        -0.04684744402766228,
        0.04000109061598778,
        0.007068042643368244,
        0.06756017357110977,
        -0.002716964576393366,
        -0.07408756017684937,
        -0.03847980499267578,
        -0.1466394066810608,
        0.061768073588609695,
        0.023109765723347664,
        -0.095169797539711,
        -0.06177215278148651,
        0.041477542370557785,
        -0.04499918967485428,
        0.0017457959474995732,
        -0.005613813642412424,
        -0.04549413174390793,
        0.03295624628663063,
        0.04918486997485161,
        -0.01390912476927042,
        -0.06595943868160248,
        0.04166387766599655,
        0.014890464954078197,
        -0.08053863048553467,
        0.00862837489694357,
        0.01728731021285057,
        -0.009655209258198738,
        0.0650857612490654,
        -0.0013594581978395581,
        0.05009990930557251,
        -0.09501712024211884,
        -0.038545530289411545,
        0.02563999779522419,
        -0.003522418672218919,
        -0.012392893433570862,
        -0.007412625476717949,
        0.10678940266370773,
        -0.004140771459788084,
        -0.09800592809915543,
        0.012282010167837143,
        0.023984290659427643,
        -0.009141172282397747,
        0.05975179374217987,
        0.03296481445431709,
        0.055127643048763275,
        0.014157505705952644,
        -0.054514478892087936,
        0.054741378873586655,
        -0.09062933921813965,
        0.06743242591619492,
        -0.050440363585948944,
        -0.059098657220602036,
        -0.04656500741839409,
        -0.020323138684034348,
        0.0039828019216656685,
        -0.005222879815846682,
        -0.023254776373505592,
        0.019602203741669655,
        -0.01903204247355461,
        0.014766729436814785,
        0.09123870730400085,
        0.07471751421689987,
        -0.011829684488475323,
        -0.0028209586162120104,
        -0.007161177694797516,
        -0.006951083894819021,
        -0.02247593179345131,
        -0.02651658095419407,
        0.013447652570903301,
        -0.06152838468551636,
        -0.008333512581884861,
        -0.02711014822125435,
        -0.06746784597635269,
        -0.02266794443130493,
        -0.08606962114572525,
        0.005714367143809795,
        0.09175226092338562,
        0.07396672666072845,
        0.0030946265906095505,
        -0.03887604922056198,
        0.048780109733343124,
        0.004942380357533693,
        -0.006387310568243265,
        0.06744486093521118,
        0.03924883157014847,
        -0.02875840663909912,
        0.04260721430182457,
        0.08091778308153152,
        -0.07174020260572433,
        0.06693650782108307,
        0.04015718027949333,
        0.05375504866242409,
        0.00801500491797924,
        0.008983368054032326,
        -0.011111757718026638,
        -0.010593277402222157,
        5.454059423629219e-33,
        -0.0084484638646245,
        0.13435448706150055,
        -0.0567222461104393,
        0.012237085960805416,
        0.012530910782516003,
        -0.0074616726487874985,
        -0.032147228717803955,
        0.06044952943921089,
        -0.09138641506433487,
        0.012431918643414974,
        0.008835452608764172,
        0.07327966392040253,
        -0.03183276578783989,
        0.027026481926441193,
        0.027744878083467484,
        -0.061980411410331726,
        0.0016841369215399027,
        0.0046675861813127995,
        -0.00793319009244442,
        0.010076064616441727,
        0.015369543805718422,
        0.018383195623755455,
        0.035287197679281235,
        0.042514730244874954,
        -0.012315141968429089,
        -0.045458272099494934,
        -0.029387015849351883,
        -0.02393103577196598,
        0.05258616805076599,
        0.011005310341715813,
        -0.07781080901622772,
        0.01811201125383377,
        0.026222839951515198,
        0.0128836864605546,
        -0.024155190214514732,
        0.03940274938941002,
        -0.07772756367921829,
        -0.09020902216434479,
        -0.03065076656639576,
        -0.02546657621860504,
        -0.06694355607032776,
        -0.0021838443353772163,
        -0.045531388372182846,
        0.02960173599421978,
        -0.02139071188867092,
        0.015145544894039631,
        0.00712721049785614,
        -0.015477422624826431,
        0.06502880901098251,
        0.01871703565120697,
        -0.015983840450644493,
        0.07094665616750717,
        -0.061788409948349,
        0.041183795779943466,
        0.03765653073787689,
        0.006209988612681627,
        0.0181879922747612,
        -0.03224215656518936,
        0.09736994653940201,
        -0.010909708216786385,
        0.07673584669828415,
        0.06426199525594711,
        0.05199776217341423,
        -0.05916689708828926,
        -0.11978892982006073,
        0.0018959083827212453,
        0.08109897375106812,
        0.010492130182683468,
        -0.02805529534816742,
        0.04510815814137459,
        -0.00913389865309,
        0.01016016211360693,
        0.04649218171834946,
        -0.0325329527258873,
        0.014273651875555515,
        -0.03978002071380615,
        -0.08507191389799118,
        -0.002019657753407955,
        -0.10052884370088577,
        0.003642197698354721,
        -0.015929514542222023,
        -0.06822130084037781,
        0.10066727548837662,
        0.05322511866688728,
        0.024992970749735832,
        -0.015896713361144066,
        0.04793597012758255,
        0.022559059783816338,
        -0.019030818715691566,
        -0.040117088705301285,
        -0.030044976621866226,
        -0.06792137026786804,
        0.035226915031671524,
        0.11244817823171616,
        -0.03355921804904938,
        -4.246505668440161e-33,
        -0.0224711112678051,
        -0.06184821203351021,
        0.021432261914014816,
        0.014830619096755981,
        0.012655586935579777,
        0.03160156309604645,
        -0.027627622708678246,
        0.009145287796854973,
        0.02597522735595703,
        0.07298971712589264,
        0.02584073133766651,
        0.011604432947933674,
        -0.05797864496707916,
        -0.11276238411664963,
        0.055270176380872726,
        -0.07051254063844681,
        0.04956572502851486,
        0.014031585305929184,
        -0.01984986662864685,
        -0.03180289641022682,
        0.04676104709506035,
        0.00547361932694912,
        -0.06509116291999817,
        0.03542593494057655,
        -0.06962665170431137,
        0.02440464124083519,
        0.07501540333032608,
        0.07897689938545227,
        0.03891078755259514,
        0.03523322939872742,
        0.05558094382286072,
        0.057015009224414825,
        -0.09069141745567322,
        -0.07610021531581879,
        0.039387911558151245,
        0.006481292191892862,
        0.10979705303907394,
        0.034063920378685,
        -0.0636742115020752,
        -0.06495185941457748,
        0.06154382601380348,
        -0.020080095157027245,
        -0.06660442054271698,
        0.018458478152751923,
        -0.056117620319128036,
        -0.04050518199801445,
        -0.009286901913583279,
        -0.037445489317178726,
        -0.04280630871653557,
        0.07155356556177139,
        0.03552968427538872,
        -0.10190417617559433,
        0.04293921962380409,
        0.008400551974773407,
        -0.07692059129476547,
        -0.031594038009643555,
        0.0039008385501801968,
        0.09354449808597565,
        0.009550548158586025,
        -0.015733962878584862,
        0.04591221362352371,
        0.0007306280313059688,
        -0.00345821725204587,
        0.009855495765805244,
        0.006066732108592987,
        -0.024731149896979332,
        0.09900055080652237,
        0.036841750144958496,
        0.01819397136569023,
        0.029352985322475433,
        0.03199943155050278,
        0.020144810900092125,
        -0.06609249114990234,
        -0.013246222399175167,
        -0.015491035766899586,
        0.07699528336524963,
        0.053946711122989655,
        -0.030541153624653816,
        0.011415598914027214,
        -0.009492511861026287,
        -0.03847654163837433,
        0.07372161746025085,
        0.07860635221004486,
        0.028743524104356766,
        0.13881400227546692,
        -0.012914728373289108,
        0.03575214371085167,
        -0.0023468665312975645,
        -0.04424893483519554,
        0.03264589607715607,
        0.03148937597870827,
        -0.041380029171705246,
        0.054526232182979584,
        0.08237341791391373,
        0.052806418389081955,
        -5.558207050171404e-08,
        -0.0069273062981665134,
        0.06392353028059006,
        0.009557923302054405,
        0.004404631908982992,
        0.060664258897304535,
        -0.09792924672365189,
        -0.004565194249153137,
        -0.0008579561254009604,
        -0.015188254415988922,
        -0.011537027545273304,
        0.05865996703505516,
        -0.04279555380344391,
        -0.0006306641735136509,
        -0.003944202326238155,
        0.008446447551250458,
        -0.029388483613729477,
        -0.002328012138605118,
        0.04648692533373833,
        -0.039549436420202255,
        -0.03315327689051628,
        0.008230629377067089,
        0.021174801513552666,
        0.09209247678518295,
        -0.06443861126899719,
        -0.018814893439412117,
        0.019261697307229042,
        0.0639941617846489,
        0.11041049659252167,
        0.0894070565700531,
        0.00534312566742301,
        -0.07874414324760437,
        -0.06861768662929535,
        0.03436323255300522,
        -0.06033460423350334,
        0.06368735432624817,
        0.013159642927348614,
        -0.01933232881128788,
        0.0005871627363376319,
        -0.014555539935827255,
        0.036600518971681595,
        -0.022298874333500862,
        -0.08997007459402084,
        0.05739698186516762,
        0.010693185031414032,
        -0.03441523015499115,
        -0.008350240997970104,
        -0.15475240349769592,
        -0.0953495129942894,
        0.08540701866149902,
        0.049078572541475296,
        0.01236207690089941,
        -0.061157673597335815,
        -0.040105246007442474,
        0.02693580649793148,
        -0.008143802173435688,
        -0.08449770510196686,
        -0.024274438619613647,
        0.0341985747218132,
        0.09235644340515137,
        0.05200780928134918,
        0.012365221045911312,
        -0.08621467649936676,
        -0.09932290762662888,
        0.04623207449913025
    ]
}