{
    "id": "oW79-m7OwYU",
    "title": "They're FINALLY here!!!! - lttstore.com desk pads",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-12-13T20:02:15Z",
    "video_url": "https://www.youtube.com/watch?v=oW79-m7OwYU",
    "category": "Science & Technology",
    "tags": [
        "Mousepad",
        "Desk Pad",
        "Mouse Pad",
        "LTTStore.com",
        "Linus",
        "Unboxing"
    ],
    "views": 605700,
    "likes": 32787,
    "comments_count": 3455,
    "description": "The LTTStore.com desk pads are finally here, so you can order one at  and don't forget to get an SC long sleeve shirt while you're at it too at   You've seen them around for months, and now they're finally out. It took a while, but hey, we got there! They come in a wide variety of sizes, and well, you might want to order one now, or you might have to wait a bit until they come back in stock!  The LTT video on testing the mousepad isn't up yet; keep your eyes peeled when it does drop.   Buy Razer Huntsman Mini Keyboard On Amazon (PAID LINK):   On Newegg (PAID LINK):  On BestBuy (PAID LINK):   Buy Corsair K100 RGB Gaming Keyboard On Amazon (PAID LINK):  On Newegg (PAID LINK):  On BestBuy (PAID LINK):   Buy ASUS ROG Swift PG259QN 360hz Gaming Monitor On Newegg (PAID LINK):  On B&H (PAID LINK):    On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/ZJOlp",
        "https://lmg.gg/51WwT",
        "https://geni.us/SZLZC",
        "https://geni.us/Jt5dU",
        "https://geni.us/nKKBG",
        "https://geni.us/lu8o9",
        "https://geni.us/YRhCU",
        "https://geni.us/eGDZ",
        "https://geni.us/DBjexh",
        "https://geni.us/kZzXjLQ",
        "https://geni.us/mAhVvV",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Step one for today's video is get all this stuff out of the way because I've got a big package for you. Oh! The LTTstore.com desk pads have finally arrived and look at this. There's even more. Every single one of these boxes is a different size of desk pad. And I am going to unbox all of them today starting with the smallest ones and working my way up to the big chungess ones because we figured, you know what nobody else does is make literally every size of desk pad so you can get it exactly the size you want it for your setup, exactly. I'm gonna sort them by width. There it is. 14 sizes of desk pads. Let's start with this one. I tell ya, the differences between some of these are pretty small. In front of me I have all the ones that are 300 millimeters. So, these are 30 centimeters in depth and then they're either 900 millimeters, 1,000 millimeters, so that's one meter, or 1,200 millimeters in width. They've all got the same northern lights pattern. Really vibrant printing on these things. I'm actually extremely pleased with how that turned out and they've all got the same three and a half millimeter thickness. This was a custom thickness that we created for its balance of comfort. So, it does have a little bit of a spongy feel to it, but also precision because the spongier it is the more you can see you're gonna have that slight shift as you apply pressure to it and move it around. There we go. Oh man, this desk is like, oh! (boxes thudding) I'm expecting these ones to be really popular with you know, the Riley crowd, the minimalists out there. So, let's have a look at our 900 mill with a nice compact, 10-keyless keyboard. Oh, do one, it's two minutes to lunch? That's fine 'cause I can tell you more about the mouse pad. So, they all have like a soft touch, smooth micro-texture cloth. It's optimized for speed, but from our internal testing you can see there's a full LTT video about this. We found it is extremely accurate. They all have the same natural rubber base. It is extremely grippy. Once you apply pressure to it there's really not much risk of it moving around on the table on its own. Of course, I can move it if I really try to, but it does a great job of sticking in place. What if I had a bigger keyboard though? I'm gonna need a bigger keyboard. Here's all the 30 centimeter desk pads. Now we'll move on to 40 centimeters and I think Lloyd did such a good job not just of the initial design, but adapting it to all the different sizes. So, you guys will see as we go on he has made bespoke versions of it for every single size of mouse pad. It's crazy. He's a crazy, mad lad. There you go. So, that's the difference? 40 centimeters is more like what I would expect kind of your typical gamer to use. That gives you a little bit more vertical space for mousing. You'll notice actually that every single one of the designs has a more blank area over on the right. We didn't find that the high contrast lines like between the snowflakes and the dark background caused any cursor skipping on any of our test mice, but it is something that we are aware of, particularly for older mice. So, we wanted to make sure that the primary mousing area over here is free from those kinds of high contrast transitions. Ah, thanks Johno. This 40 centimeter by one meter pad is the one that I'm kind of expecting most people with a 104 key keyboard and like a medium sensitivity gaming preference to go for. It's not gonna interfere too badly with your monitor feet, though if you are worried about that, there's obviously the 30 centimeter version and there's a pretty solid chance that it's going to fit on your desk. Of course, if you want all the mouse space we do have a 1.2 meter version of this one as well. So, if you have a multi-monitor setup or an ultra wide or even a couple of ultra wides, this right here is probably gonna be the way to go. 40 centimeters by 1.2 meters. Oh yeah. So, this is how much mouse space you're gonna have on this guy. Oh, I didn't even mention, of course we've got a nice woven edge. This has two effects. So, number one is it keeps the mouse pad from fraying. And number two, it's just a little more comfortable to drag your wrist over when you've got your wrist hanging over the edge of the pad. Like if you like the edge of your most pad right at the edge of your desk for aesthetics. It's kind of a more sheeny type thread that we use that makes it a little bit smoother on your wrist compared to some of the more like rougher threads that you can use here. One thing to watch out for guys, there's nothing we can really do about this is if you get the hook side of a hook and loop fastener, AKA Velcro, on this you're gonna have a bad time because that's part of what makes it so soft is it's pretty easy for that to grab onto. So, watch out. Let's move on to our next size. (boxes thudding) Ow! Oh, I pinched my arm. All right. You might say she's a thick boy. With our 50 centimeter deep mouse pads these are more for the folks that are like, oh yeah, I like my keyboard and mouse down here at the bottom of my pad and I also like to kind of put other things nicely on my desk and I don't wanna scratch my desk or whatever. This is more of like a desk pad, but I sit at sort of like a narrower writing desk. Still plenty of room for mousing, especially if you've got a 10-keyless keyboard which is only gonna be up to about here, but definitely, definitely on the deeper side. And, of course, we've got this as large as 1.2 meters in width. There we go. And did I mention the best part yet guys? No matter what size you decide you want, the price is identical. They are all 29.99 U.S. because just like with the water bottles, we're looking at the pricing of other mouse pads and we're going, really? Like most of the cost is in the logistics and the machine time of actually getting the thing made. A little bit of extra cloth, a little bit of extra rubber, not actually that big of a deal, especially at the prices that most mouse pads are sold. So, you should choose based on the size of your desk, not based on what you can afford. So, whether you want the smallest one or whether you want the largest one, 29.99 U.S.. Of course, shipping will probably cost a little bit more with the bigger ones because they are heavier. And if you like to, you know, again have a little bit of space over on the left, over on the top of your mouse pad, this isn't one of those ones where I would align the keyboard with the left side. Like, you'd be extremely uncomfortable typing like this, but you just go kind of centered up here, got all your space over here, got all the mouse room you could possibly need over here. Of course, they get even bigger. How big will they go? Did we make them too big, Brandon? - [Brandon] No. I haven't seen the one I'd use yet. - You haven't seen the one you would use? Truthfully we haven't made it to my size yet either. These are the 60 centimeter deep desk pads. And you can see they're already wider than even a very large mousepad and that's the depth. Now, we gettin' into cray cray town. I can't even capture it's mammothness. Here we're getting into you have a pretty decent sized desk and you want this thing covering pretty much the whole darn thing. There you have it. Those are the 60 millimeter thick ones. If you got a wireless mouse and a wireless keyboard for that matter, you've got like a ton of storage space around your desk. In fact, you could even pull it up a little bit like that. You could totally put your entire monitor on this. monitor is on the desk pad now. Yup. That works. But I think we can go deeper. All right, we're going 70 centimeters, 70 centimeters. This is as deep as plenty of desk pads are wide. I mean that is a desk pad. This is the 1.2 meter. So, this is the gigantor. You know what the craziest thing is? I wouldn't even be surprised to see people be like, yeah, you know what? I love that one, but I want one that's maybe even wider. Lots of people use a table as a desk though. So, we wanted to make sure that we accounted for that. Let's try to capture this in the overhead camera here. So, there you go. There's a top corner. All right. Now I'm going to just drag a bit up. There you go. That's the bottom corner of the 1.2 meter and that's it? 29.99. LTTstore.com. Don't miss the video over on the Linus Tech Tips channel where we go through everything that we went through to finally deliver this thing. I think you guys are going to absolutely love them though and I hope you'll agree that they were worth the weight. Get it? The weight 'cause they're heavy. Here we go. Let's see if I can lift the whole thing. Let no one claim that LTTstore.com desk pads don't come in all sizes. Oh! Oh, it's so much static, ah!",
    "transcript_keywords": [
        "desk",
        "desk pads",
        "desk pad",
        "pad",
        "mouse",
        "pads",
        "mouse pad",
        "bit",
        "mouse pads",
        "size",
        "LTTstore.com desk pads",
        "centimeter desk pads",
        "keyboard",
        "thing",
        "centimeters",
        "space",
        "meter",
        "kind",
        "pretty",
        "deep desk pads"
    ],
    "transcript_entity_values": [
        "50 centimeter",
        "900 millimeters",
        "1.2 meter",
        "60 centimeter",
        "One",
        "Riley",
        "one",
        "14",
        "U.S.",
        "U.S",
        "1.2 meters",
        "1,200 millimeters",
        "This 40 centimeter",
        "300 millimeters",
        "LTT",
        "one meter",
        "the Linus Tech Tips",
        "70 centimeters",
        "number two",
        "two minutes",
        "the 1.2 meter",
        "sheeny",
        "10",
        "Brandon",
        "30 centimeter",
        "two",
        "29.99",
        "40 centimeters",
        "30 centimeters",
        "Velcro",
        "Johno",
        "1,000 millimeters",
        "three and a half millimeter",
        "the 60 millimeter",
        "today",
        "104"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.022453496232628822,
        -0.06937763839960098,
        0.007240610662847757,
        -0.07250307500362396,
        0.05899906903505325,
        0.027239026501774788,
        0.0031730711925774813,
        0.03640458732843399,
        -0.04829093813896179,
        0.07586564123630524,
        0.08168678730726242,
        0.06110140681266785,
        -8.203246397897601e-05,
        0.019362593069672585,
        0.033247869461774826,
        -0.004250513389706612,
        0.045220185071229935,
        0.011889968067407608,
        0.0163049828261137,
        -0.05530785024166107,
        -0.10795789957046509,
        -0.05484704673290253,
        -0.03946393355727196,
        -0.007614712696522474,
        -0.049567099660634995,
        0.0635916069149971,
        0.008100593462586403,
        -0.05562205612659454,
        -0.043525200337171555,
        0.03936253488063812,
        -0.08160325139760971,
        0.00199361564591527,
        -0.04222172871232033,
        0.07900530099868774,
        -0.002467081882059574,
        -0.08062919229269028,
        0.040784988552331924,
        -0.07971353083848953,
        0.0034625206608325243,
        -0.052395742386579514,
        -0.0875786691904068,
        -0.05396299436688423,
        0.06620588153600693,
        0.0799468532204628,
        0.07039867341518402,
        -0.024972399696707726,
        0.0672852024435997,
        -0.045104023069143295,
        -0.017237206920981407,
        0.007879246026277542,
        0.053500499576330185,
        -0.0373566634953022,
        0.052443474531173706,
        0.019549725577235222,
        -0.06424421817064285,
        0.019242651760578156,
        -0.056350816041231155,
        -0.07096516340970993,
        0.04920503497123718,
        0.022096630185842514,
        0.02857819013297558,
        -0.0803804025053978,
        -0.04491732269525528,
        -0.0014899332309141755,
        -0.035917531698942184,
        -0.00449436204507947,
        0.01978309266269207,
        -0.022686898708343506,
        0.07646283507347107,
        0.01616029441356659,
        0.021910278126597404,
        0.004798456560820341,
        -0.030366629362106323,
        0.03171742334961891,
        -0.04638127610087395,
        -0.02673298306763172,
        0.09424275904893875,
        0.027820276096463203,
        0.1011948361992836,
        0.013156503438949585,
        -0.07373678684234619,
        -0.034138988703489304,
        0.06975458562374115,
        -0.04550499841570854,
        0.05416072532534599,
        -0.004734832793474197,
        0.03260648995637894,
        0.08198802173137665,
        0.02888321690261364,
        -0.09780681133270264,
        0.04145282134413719,
        0.09043490886688232,
        -0.03711730241775513,
        -0.03145408630371094,
        -0.08253374695777893,
        -0.09264586865901947,
        0.0802265927195549,
        -0.04052822291851044,
        -0.09213515371084213,
        0.022424958646297455,
        0.006232660263776779,
        0.04433747008442879,
        0.09442935138940811,
        -0.05780249461531639,
        0.01778971403837204,
        -0.033366523683071136,
        -0.006738672964274883,
        -0.03840159624814987,
        -0.042976006865501404,
        0.008375022560358047,
        -0.08447534590959549,
        -0.009721141308546066,
        -0.06957952678203583,
        0.052305322140455246,
        0.008409847505390644,
        0.032581884413957596,
        0.001042137504555285,
        0.040087249130010605,
        0.13129259645938873,
        0.01721169427037239,
        -0.027431057766079903,
        -0.0028077303431928158,
        -0.05262487754225731,
        -0.055575892329216,
        0.02068670652806759,
        0.05163247138261795,
        -0.048541903495788574,
        6.0774365674977554e-33,
        -0.031776364892721176,
        0.09252583980560303,
        -0.0675572007894516,
        -0.062166787683963776,
        -0.011392457410693169,
        0.023321105167269707,
        0.10380817949771881,
        0.06548711657524109,
        0.024036351591348648,
        0.03236410394310951,
        -0.07055144011974335,
        -0.02176872082054615,
        -0.09900472313165665,
        0.013932501897215843,
        0.028716593980789185,
        -0.06679248064756393,
        -0.0014878310030326247,
        -0.005897367373108864,
        -0.06461787223815918,
        0.023345641791820526,
        -0.008494305424392223,
        0.05935768410563469,
        0.01268818974494934,
        0.04784461483359337,
        -0.0038337900768965483,
        0.0037178117781877518,
        -0.047028034925460815,
        -0.010244160890579224,
        0.020851531997323036,
        0.03160795941948891,
        -0.08232688158750534,
        0.01909470744431019,
        -0.030519461259245872,
        0.017843959853053093,
        -0.09896594285964966,
        -0.05452466383576393,
        -0.0526474229991436,
        -0.06958989799022675,
        0.06500780582427979,
        -0.03554296866059303,
        -0.014667391777038574,
        0.04038964584469795,
        -0.042026687413454056,
        -0.06690444052219391,
        0.05481775477528572,
        0.0384504534304142,
        0.02781176008284092,
        0.04343704506754875,
        0.12628863751888275,
        -0.09834550321102142,
        -0.09140025079250336,
        0.01746157929301262,
        0.0028784333262592554,
        -0.03876878693699837,
        -0.024706589058041573,
        -0.05394764244556427,
        0.010703585110604763,
        0.029277928173542023,
        0.036416005343198776,
        0.0528695322573185,
        0.02134949527680874,
        -0.025229712948203087,
        0.027907326817512512,
        0.02110437862575054,
        0.004506181459873915,
        0.019448600709438324,
        0.015329320915043354,
        -0.035730428993701935,
        -0.030346473678946495,
        0.017631828784942627,
        0.05795390158891678,
        -0.04526945576071739,
        0.05302483215928078,
        -0.05215620622038841,
        0.055622123181819916,
        0.006975763011723757,
        0.0007649226463399827,
        -0.013146627694368362,
        -0.06109688803553581,
        -0.041729580610990524,
        -0.0014736003940925002,
        0.06963308900594711,
        0.03273763135075569,
        0.08043517172336578,
        0.06826267391443253,
        -0.027115343138575554,
        -0.025479303672909737,
        -0.03620070591568947,
        0.02138582430779934,
        -0.0627218633890152,
        -0.060918886214494705,
        -0.05397183448076248,
        -0.04231254383921623,
        -0.02234666980803013,
        0.010441143997013569,
        -4.850106221882067e-33,
        -0.012494444847106934,
        -0.005587139632552862,
        -0.08974356949329376,
        0.06084616854786873,
        -0.04676761105656624,
        0.0037331513594835997,
        -0.01581961289048195,
        0.04319871962070465,
        0.04606182128190994,
        -0.058608829975128174,
        0.00904738251119852,
        0.05584370717406273,
        -0.04133818298578262,
        0.004966843873262405,
        -0.0018730846932157874,
        0.03395943343639374,
        0.007820729166269302,
        0.004206495359539986,
        0.0973469614982605,
        -0.09825124591588974,
        0.11189538985490799,
        -0.007523247040808201,
        0.044011205434799194,
        0.04141028970479965,
        0.006043104454874992,
        -0.054917652159929276,
        0.12844467163085938,
        -0.017997195944190025,
        -0.025669485330581665,
        -0.012587481178343296,
        -0.06418266147375107,
        0.013956568203866482,
        0.06395360082387924,
        0.08479657769203186,
        0.11981101334095001,
        -0.056263700127601624,
        0.03223743289709091,
        0.004312077071517706,
        -0.006156151182949543,
        0.029742397367954254,
        0.07180913537740707,
        0.047624874860048294,
        0.07077492028474808,
        0.02439759112894535,
        0.025769876316189766,
        -0.06166743114590645,
        -0.02033236064016819,
        -0.025272609665989876,
        0.03419109806418419,
        0.014896104112267494,
        -0.03977031633257866,
        -0.09348562359809875,
        -0.04547778517007828,
        -0.07177235186100006,
        -0.10530605912208557,
        -0.023764081299304962,
        -0.03399287536740303,
        0.010122023522853851,
        -0.01435980573296547,
        0.009995459578931332,
        -0.0599430650472641,
        0.05943030118942261,
        -0.05690775066614151,
        0.024430397897958755,
        0.038506992161273956,
        -0.002434708410874009,
        0.060064274817705154,
        0.035068292170763016,
        0.012508433312177658,
        0.038335371762514114,
        -0.056983575224876404,
        0.021680360659956932,
        0.034966979175806046,
        -0.04743582010269165,
        0.031166251748800278,
        0.02561764605343342,
        0.03811923786997795,
        0.0027312510646879673,
        0.08646893501281738,
        -0.0644359141588211,
        0.04093940183520317,
        -0.0008845499833114445,
        0.08465152978897095,
        0.02369498647749424,
        0.06927727162837982,
        0.06799183785915375,
        0.0012411638163030148,
        0.06848978251218796,
        -0.036507561802864075,
        0.00809863768517971,
        0.02427731081843376,
        -0.000182274729013443,
        -0.01156924944370985,
        0.0653875544667244,
        0.02757411077618599,
        -4.9975316329664565e-08,
        0.09947238117456436,
        0.10492126643657684,
        0.03538898378610611,
        0.011857488192617893,
        0.05706761032342911,
        -0.022040439769625664,
        0.023729126900434494,
        -0.02682023122906685,
        0.0027373635675758123,
        0.03929239138960838,
        -0.07779943943023682,
        -0.047394536435604095,
        0.01960427314043045,
        0.036476511508226395,
        0.0018731282325461507,
        0.11091038584709167,
        -0.04155771806836128,
        0.021730126813054085,
        -0.01909302920103073,
        -0.05364318937063217,
        0.023424411192536354,
        -0.008221043273806572,
        0.13529370725154877,
        -0.030219869688153267,
        0.026858745142817497,
        -0.006509239785373211,
        -0.08910590410232544,
        0.06666527688503265,
        0.03999942168593407,
        -0.021861417219042778,
        0.03983423113822937,
        -0.01593412272632122,
        0.12088482826948166,
        -0.03816176578402519,
        0.03977587819099426,
        -0.10428349673748016,
        0.004756974522024393,
        0.046343639492988586,
        0.04871677979826927,
        -0.021659167483448982,
        -0.05329972878098488,
        -0.1437719315290451,
        -0.04163680225610733,
        -0.03874228894710541,
        -0.04273562133312225,
        -0.009442090056836605,
        -0.03708905354142189,
        -0.037691693753004074,
        -0.03035690076649189,
        0.03921687602996826,
        -0.02793266996741295,
        -0.04830297455191612,
        0.00010283704614266753,
        -0.009279231540858746,
        0.00461614690721035,
        -0.009546888992190361,
        -0.02162761799991131,
        0.02568160928785801,
        0.050353679805994034,
        0.0049675037153065205,
        0.013807511888444424,
        -0.057055339217185974,
        -0.07017840445041656,
        0.10392410308122635
    ]
}