{
    "id": "OXPQQIREOzk",
    "title": "Samsung Galaxy Z Fold 2: Hands-On With The $2000 Folding Phone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-09-02T02:56:19Z",
    "video_url": "https://www.youtube.com/watch?v=OXPQQIREOzk",
    "category": "Science & Technology",
    "tags": [
        "best smartphone 2020",
        "best folding phone",
        "fold 2 review",
        "galaxy fold 2 review",
        "galaxy z fold 2 review",
        "galaxy fold vs surface duo"
    ],
    "views": 424768,
    "likes": 19800,
    "comments_count": 1220,
    "description": "A portion of this video is sponsored by MediaTek, the worlds #1 connectivity provider. Learn more:    [SAMSUNG GALAXY Z FOLD 2 FIRST IMPRESSIONS / GALAXY Z FOLD 2 HANDS-ON]  Ive carried the Samsung Galaxy Fold for eight months  and, as of today, Ive carried the Samsung Galaxy Z Fold 2 for about eight hours. Thats not enough time for me to fully review this two-thousand dollar smartphone (or even take a shower, as it turns out)  but its plenty of time for me to answer some of the most popular questions youve been tossing to me on Twitter. From does it still have a crease to how does it compare to the Surface Duo, those questions take center stage in my first video featuring the foldable phone to end all foldables: the Samsung Galaxy Z Fold 2! Join me for the answers in MrMobiles Galaxy Z Fold 2 First Impressions video.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES SAMSUNG GALAXY Z FOLD 2 FIRST IMPRESSIONS / GALAXY Z FOLD 2 HANDS-ON]  This is the first in a series of videos reviewing the Galaxy Z Fold 2 from Samsung. Device tested on Verizon in Brooklyn, NY.  Preproduction device running prerelease software. MrMobile does not produce paid or sponsored reviews; Samsung provided no compensation and was afforded no preview or copy approval rights concerning this content. The lone sponsor of this video is MediaTek.    [PRODUCTS IN THIS VIDEO]  Samsung Galaxy Z Fold 2 [Samsung]:     [LINKS]  Into The Fold Episode 1: The Different Foldable Phones, Explained:   Into The Fold Episode 2: Revisiting the Motorola Razr  Now With Android 10:   Into The Fold Episode 3: Samsung Galaxy Fold Review 2020:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #galaxyzfold2 #galaxyfold2 #galaxyfold #foldingphone #foldingscreen #foldable #samsungfold",
    "description_links": [
        "https://www.poweredbymediatek.com/",
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1SP",
        "https://www.youtube.com/watch?v=5t8RSwbbeCs",
        "https://youtu.be/iyWn-Lb_w_E",
        "https://youtu.be/W-Gt4GpEgyU",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- [Mr. Mobile] A portion of this video is sponsored by Media Tek. I've carried this Samsung Galaxy Fold for eight months, and I've been using the Galaxy Z Fold 2 for about eight hours. That's not enough time for me to properly review this $2,000 smartphone. It's barely enough time for me to take a shower. In fact, I didn't. But it is enough time to answer some of the most popular questions you've been lobbying my way on Twitter. I'm Mr. Mobile, and this is the Galaxy Z Fold 2 hands on featuring your Q and A. (upbeat music) It might be a reviewer cliche but the question, how does it feel in the hand? is actually incredibly important, especially when you're talking about the sequel to a device that earned a reputation for fragility, unfairly or not. Well, the best way I can say it is, the Galaxy Z Fold 2 feels improbably impressive, just like its cousin the Note20 Ultra, this thing feels like Samsung poured liquid metal into a mold. Like there's no air or empty space inside it. With the Note20 I get that. 'cause it's just a slab, but this feels that way too and it has moving parts. I've described the first Galaxy Fold as feeling like a bar of gold when it dunks into your pocket, and that's even more true on the Fold 2, thanks to the slight uptick in mass. (whooshing) When you open it up though, you still get the subtle sound of the display flexing. This might be so-called ultra thin glass, but there's still a protective layer on top of it, and then a factory installed screen protector on top of that. And just like on the Galaxy Z Flip 5G I recently reviewed that factory protector takes no time at all to become a Jackson Pollock for your prints. Mine even came with a little scuff right out of the box. I'm eager to peel it off, but Samsung recommends you let them do that. Yeah, I think it's just them being ultra cautious because I eventually did remove my Z Flips and it had no problems. Let me know on Twitter what you think I should do, play it safe or take a risk. Meanwhile, keep in mind that there's still no proper IP rating for either dust or water resistance. - [Salesperson] I've got your IP rating right here. (laughs) - As I've demonstrated in many videos, foldables aren't as fragile as you've probably heard, but neither are they phones compatible with beach life or sudden downpours. Keep that in mind. (upbeat music) For this next segment I'm sorry, but I'm going to have to flex a little. What Samsung calls flex mode is something I specifically asked for when covering the first Fold. An articulable hinge that would enable a mini laptop mode. Well, Samsung started offering flex mode on the Z Flip back in February. And it's finally on the Fold now, too. It's not great for my own weirdo use case. You can tell Samsung didn't build it to be a mini laptop. You need to keep the angle pretty close to 90 degrees in order to avoid a wobble. And the keyboard is still kind of crapped down there. That's not a big deal because the Fold has always been a very comfortable phone for two thumb typing. And flex mode is really meant for apps like Duo, YouTube, and gallery, which are already optimized for it. Oh yeah the camera too. I forgot about that. Now sadly Samsung has only given two more apps flex mode compatibility since February: calendar and clock. I guess that's sort of useful but it's kind of a bummer. But there's a consolation prize in what I call the retroflex mode, which lets you watch videos on the cover display too. Speaking of which, (whooshing) (upbeat music) You know that vertical horizon song that goes, I am everything you want? I am everything you need? Yeah (laughs) That's this cover display. Those of us who loved the trailblazing spirit of the Fold 1 could forgive it's outer screen, but it was always the number one complaint. This one not only expands the display area, to almost the entire face of the phone, but also avoids the trap of becoming so big that you can't still use it one handed. It's a very tall, but very narrow canvas. Reminiscent of modern Sony phones, which means it's serviceable for scrolling on social and perfect for one handed quick messages. For everything else you pop it open. Man that hinge feels good and use the also upgraded inner display. You can see for yourself the difference removing that camera cutout and reducing the bezels makes. The phone is still as easy to hold as the first one was, but it's much nicer looking now. This is a first impressions video, so my first impression? Great job on the hardware here really. But don't get carried away with those expectations. A lot of you asked about the crease and yeah, it is still here and probably always will be until material science makes a breakthrough. Here's the thing though, as an eight month Galaxy Fold owner, let me tell you that while it looks kind of junky right now, it's not something that bothers you once the first day goes by. When you're using the phone, looking at it straight on you don't see the crease. Someone on Twitter said it kind of disappears like the notch does on other phones. And I think that's right. As for the rest of this display, again it's only my first day. I need to use it in different lighting conditions and so on, but so far I haven't seen the jelly scrolling or the tearing slash bleeding issues I noticed Fold 1 after a while. And the combination of a high refresh rate with the folding screen, just as impressive as you'd expect. If there's a number one disappointment I had to put my finger on for the first day, it's what's not included in the box. Fold 1 came with a bundled case and wireless galaxy buds as part of the package, which took some sting out of a tie price. Well, Fold 2 comes with nothing but a bunch of warnings and a 25 watt fast charger. I mean you still do get perks like a founder's card membership, Michelin star meal delivery, round of golf at somewhere fancy. Oh wait, I have a meme for this. Rich guys. Look, I get that the silicone is more expensive in this thing. And that there was even more R and D involved in approving an already bleeding edge design. Someone's got to pay for all that, but I wish Samsung hadn't cut those inbox perks this early into a new generation of smartphone. I feel like we're still supposed to be in the honeymoon phase with foldables and bundled Galaxy beans or even a Galaxy watch would have gone a long way toward making that 1999 sticker price a little more palatable. The biggest question to hit my inbox, right after a quick word from the sponsor, who's keeping the Mr. Mobile family connected. That sponsor is Media Tek. You might know them from their smartphone ship sets, but what you might not know is that Media Tek also powers smart home devices in one out of five homes. Why am I telling you this from the driver's seat of a car? Well, because the Mr. Mobile apartment already features smart devices in literally every room of the house. The type of tech at my dad's house is decidedly different. So I set my dad up with this Lenovo smart display that Media Tek sent me. With this he can keep track of the weather, see favorite photos, listen to music, even watch his own YouTube videos, all just by talking to it. It's all possible thanks to Media Tek, the world's number one connectivity provider. To learn more, visit this link and thanks to Media Tek for sponsoring this video. Far and away the biggest talk on my Twitter today is how the Z Fold 2 compares to that other multi-screen smartphone from Microsoft the Surface Duo. Now I'm still not allowed to show you the software on the Duo which is why you haven't seen a video from me yet, but I can tell you that while it's natural to want to compare these devices, they're really built for very different customers. The Duo is made for people who want a mini surface that lets them run two apps side by side and run single apps in split panel format. And the Fold 2 can of course do that through software, but it's a much more straight forward product in many ways. It's a smartphone that can become a tablet on demand and it comes packing not only the specs, but now the refinement necessary to achieve that. I'm not breaking any rules by telling you what we already know about the intentions behind these products. Given the massive advantage in smartphone experience that Samsung enjoys over Microsoft where things like cameras and software are concerned, I think it goes without saying that the Fold 2 will probably be the more familiar, more capable smartphone on the whole. I'll get into that once I can share my full thoughts with you. Let me know in the comments, if you'd like to see a Fold 2 versus Surface Duo video, when I am allowed to show you more. (upbeat music) Camera performance, battery life, those are the kinds of details you can always expect from my full reviews. And I'll be giving them to you as soon as I get that data. But what I'm most eager to find out is how the Fold 2 builds upon the new smartphone paradigm first ushered in by its predecessor. And of course seeing how well it holds up over the 30 days I get to borrow it. Will it finally live up to the hype enough to let me uncork this very special bottle of Samsung wine I've been teasing for a month? Well, tell him Maverick. - I don't know. I'll tell you tomorrow but it's looking good so far. (laughs) - The Galaxy Z Fold 2 is available for pre-orders starting September 2nd. This video was produced following eight hours with the Samsung Galaxy Z Fold 2 review sample provided by Samsung. Mr. Mobile works for you though. Not the manufacturers. The Samsung provided no compensation for this coverage, nor was it offered copy approval or an early preview. That means they're seeing it for the first time, right alongside you. Please subscribe. If that's the kind of video you'd like to see more of on YouTube and check out my series Into the Fold, where I explore every facet of foldable screen technology in our modern times. Until next time, thanks for watching and remember to stay safe and mask up while you stay mobile my friends. (upbeat music)",
    "transcript_keywords": [
        "Samsung Galaxy Fold",
        "Fold",
        "Galaxy Fold",
        "Samsung",
        "Media Tek",
        "Galaxy",
        "Samsung Galaxy",
        "month Galaxy Fold",
        "Galaxy Z Fold",
        "Galaxy Fold owner",
        "Media",
        "Tek",
        "smartphone",
        "video",
        "display",
        "time",
        "Duo",
        "flex mode",
        "Mobile",
        "mode"
    ],
    "transcript_entity_values": [
        "Lenovo",
        "eight months",
        "1999",
        "Surface Duo",
        "Media Tek",
        "Galaxy Fold",
        "Twitter",
        "inbox",
        "Samsung",
        "the Samsung Galaxy Z Fold 2",
        "eight hours",
        "the first day",
        "Microsoft",
        "September 2nd",
        "1",
        "Fold 2",
        "IP",
        "Samsung Galaxy Fold",
        "Michelin",
        "a month",
        "tomorrow",
        "Ultra",
        "YouTube",
        "25 watt",
        "90 degrees",
        "Fold 1",
        "Mobile",
        "Jackson Pollock",
        "today",
        "the Galaxy Z Fold 2",
        "first",
        "Fold",
        "Sony",
        "the Z Flip",
        "five",
        "two",
        "Galaxy",
        "eight month",
        "Galaxy Z Fold 2",
        "2,000",
        "about eight hours",
        "Into the Fold",
        "the Surface Duo",
        "Galaxy Z Flip 5",
        "the 30 days",
        "Twitter",
        "February",
        "Duo",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "LAW",
        "PERSON",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "MONEY",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.15354646742343903,
        0.012994280084967613,
        0.07081151753664017,
        0.011385569348931313,
        0.023043008521199226,
        -0.02699519321322441,
        0.01314773689955473,
        0.16837601363658905,
        -0.043857671320438385,
        0.03161092847585678,
        0.008386868052184582,
        0.05824998766183853,
        0.016679055988788605,
        0.04826993867754936,
        0.022303802892565727,
        0.011331958696246147,
        -0.02454257383942604,
        -0.08633799105882645,
        -0.05162061005830765,
        0.07774842530488968,
        0.08793161064386368,
        -0.034103166311979294,
        0.07269259542226791,
        -0.06401656568050385,
        0.021120093762874603,
        -0.010629227384924889,
        -0.02991328574717045,
        0.00674009183421731,
        0.0442863404750824,
        -0.010529695078730583,
        -0.00907809566706419,
        0.1357121467590332,
        0.022199705243110657,
        0.01049014087766409,
        0.006640410516411066,
        -0.08975853025913239,
        0.03438093885779381,
        0.013158130459487438,
        -0.029038548469543457,
        -0.051705848425626755,
        -0.026531409472227097,
        0.004631608724594116,
        0.0010706831235438585,
        -0.02078082412481308,
        0.06579853594303131,
        -0.04335762932896614,
        0.056027255952358246,
        -0.008323358371853828,
        -0.04206611588597298,
        -0.002879556268453598,
        0.005544320214539766,
        -0.07620043307542801,
        0.018567517399787903,
        0.039999768137931824,
        -0.050075430423021317,
        0.06725466996431351,
        -0.07716912031173706,
        0.027967214584350586,
        0.02949347160756588,
        0.03767712041735649,
        0.05463507026433945,
        -0.06069629639387131,
        -0.048768311738967896,
        0.06002238765358925,
        0.03938973695039749,
        0.011740541085600853,
        0.012710128910839558,
        -0.08605428040027618,
        -0.04521893337368965,
        -0.011618978343904018,
        -0.08788028359413147,
        0.034117814153432846,
        0.00044394415454007685,
        -0.010398807004094124,
        0.018085792660713196,
        0.005443342961370945,
        0.05356931686401367,
        -0.06749808043241501,
        -0.07810653746128082,
        0.007876154035329819,
        0.03803984448313713,
        -0.05374246835708618,
        -0.036293964833021164,
        0.023808281868696213,
        -0.017691154032945633,
        -0.010576248168945312,
        0.014045488089323044,
        0.03913356736302376,
        -0.09675737470388412,
        -0.0338105782866478,
        0.032919108867645264,
        0.10209328681230545,
        -0.026583107188344002,
        0.019838200882077217,
        -0.07578223198652267,
        0.021878961473703384,
        -0.032309163361787796,
        0.018521388992667198,
        -0.001934685162268579,
        0.02089402824640274,
        0.03594798222184181,
        0.0747167095541954,
        0.10582923144102097,
        -0.016466083005070686,
        0.043378185480833054,
        -0.027013517916202545,
        0.030487356707453728,
        -0.032598111778497696,
        -0.06033971160650253,
        0.018284304067492485,
        -0.009437640197575092,
        -0.004164897371083498,
        -0.03132953867316246,
        -0.019604742527008057,
        -0.06742026656866074,
        0.004898012150079012,
        0.013152510859072208,
        0.09597065299749374,
        0.0982859879732132,
        0.036013878881931305,
        -0.04928060621023178,
        0.029243426397442818,
        -0.045407913625240326,
        -0.15678144991397858,
        0.020225385203957558,
        0.027425052598118782,
        -0.08222579956054688,
        7.785426185822693e-33,
        -0.06281956285238266,
        0.13228309154510498,
        -0.05025271698832512,
        0.06258906424045563,
        0.007996347732841969,
        0.01167318969964981,
        -0.10293280333280563,
        0.040110960602760315,
        -0.023052124306559563,
        0.07383588701486588,
        -0.013239355757832527,
        0.022587910294532776,
        -0.00115770916454494,
        -0.02478593960404396,
        0.02073461376130581,
        -0.10174541920423508,
        -0.01912163384258747,
        -0.03846094012260437,
        -0.1032927855849266,
        0.018620377406477928,
        0.038791391998529434,
        0.012665653601288795,
        0.08088511973619461,
        -0.0045806062407791615,
        0.06702987849712372,
        -0.019136881455779076,
        0.051403164863586426,
        -0.05116450786590576,
        0.07215910404920578,
        0.004201372619718313,
        -0.08680053800344467,
        -0.0361834317445755,
        -0.03804025799036026,
        -0.05348340794444084,
        -0.003617979818955064,
        0.01924053393304348,
        0.017360880970954895,
        -0.06492718309164047,
        0.0033969643991440535,
        -0.01987207680940628,
        -0.08971059322357178,
        0.03023906797170639,
        -0.05843154713511467,
        0.0501108393073082,
        0.011646938510239124,
        -0.04461841657757759,
        0.05223310738801956,
        0.028867388144135475,
        0.003448244882747531,
        -0.06555298715829849,
        0.01914212480187416,
        0.009332376532256603,
        -0.06685280054807663,
        -0.013715694658458233,
        -0.06015859916806221,
        0.003647373989224434,
        0.04844861477613449,
        -0.08554252237081528,
        0.02233879081904888,
        0.06263016909360886,
        0.01430464442819357,
        0.03543855622410774,
        -0.07310212403535843,
        0.019441956654191017,
        -0.03330492600798607,
        0.060317263007164,
        0.016113869845867157,
        -0.02778247557580471,
        -0.02133895643055439,
        0.04728882759809494,
        0.005913025699555874,
        -0.0387037917971611,
        -0.0169077105820179,
        0.0007380361203104258,
        0.05982306972146034,
        -0.013898627832531929,
        0.03928776830434799,
        -0.024716582149267197,
        0.04760679975152016,
        -0.03556213527917862,
        -0.020436009392142296,
        -0.013061984442174435,
        0.11631538718938828,
        -0.03451910614967346,
        -0.012817935086786747,
        -0.10095996409654617,
        -0.013876881450414658,
        -0.07983861118555069,
        0.0353584960103035,
        0.006398234516382217,
        -0.08210582286119461,
        -0.026089390739798546,
        0.0586266815662384,
        -0.06453792750835419,
        -0.008225001394748688,
        -7.13666277208021e-33,
        -0.05814715474843979,
        -0.005731980316340923,
        0.006704420316964388,
        -0.00953624676913023,
        0.006854145787656307,
        -0.01453236024826765,
        0.03934941813349724,
        0.02824968285858631,
        -0.05711439251899719,
        -0.06689669191837311,
        0.017751630395650864,
        0.06890437752008438,
        0.053430989384651184,
        0.006231140810996294,
        -0.0015933080576360226,
        -0.016487428918480873,
        0.04997656121850014,
        -0.05275639519095421,
        0.008481928147375584,
        0.030719248577952385,
        0.07181263715028763,
        0.028976717963814735,
        0.009812402538955212,
        0.05096754804253578,
        -0.04185163602232933,
        0.049499209970235825,
        0.005043161567300558,
        -0.022741498425602913,
        0.08643040806055069,
        0.035482268780469894,
        -0.026236167177557945,
        -0.1259128451347351,
        0.019193826243281364,
        0.013520046137273312,
        0.0027125461492687464,
        0.032234787940979004,
        -0.05727172642946243,
        -0.06299732625484467,
        0.05278967320919037,
        -0.030659658834338188,
        0.02897346019744873,
        0.012533376924693584,
        -0.027275599539279938,
        -0.026703789830207825,
        0.037578172981739044,
        -0.06899738311767578,
        -0.0662948489189148,
        0.03310272470116615,
        -0.0685637965798378,
        -0.04290849715471268,
        -0.03443625196814537,
        0.04446954280138016,
        -0.042977117002010345,
        -0.0370265431702137,
        -0.0001834238792071119,
        0.05528094992041588,
        0.0028706828597933054,
        -0.0686083436012268,
        0.03612286597490311,
        0.019503656774759293,
        0.07939131557941437,
        0.03135564550757408,
        -0.042754169553518295,
        -0.06296878308057785,
        0.018339602276682854,
        -0.020914481952786446,
        0.10402780771255493,
        -0.03026622347533703,
        0.003940950147807598,
        -0.014886097982525826,
        -0.07159429043531418,
        -0.008088151924312115,
        -0.0348508246243,
        -0.12919075787067413,
        0.00736992945894599,
        0.1765574812889099,
        -0.04089315980672836,
        -0.007568699307739735,
        0.004174299072474241,
        -0.07803353667259216,
        0.06717266142368317,
        -0.006205091252923012,
        0.028576863929629326,
        0.0479937382042408,
        0.02141650766134262,
        0.0024746665731072426,
        -0.004408917389810085,
        -0.010120922699570656,
        0.013076205737888813,
        0.05597308278083801,
        -0.02083069086074829,
        -0.012665817514061928,
        -0.029121821746230125,
        0.1287691444158554,
        0.01859612949192524,
        -5.2252435267519104e-08,
        0.04007192701101303,
        0.045484453439712524,
        0.10456454753875732,
        -0.01066993921995163,
        0.012304465286433697,
        -0.043948493897914886,
        0.0026905201375484467,
        -0.04954967275261879,
        0.0364992693066597,
        0.0016620343085378408,
        -0.07138866186141968,
        -0.06347375363111496,
        -0.07783746719360352,
        0.08104517310857773,
        0.03142610937356949,
        0.11927461624145508,
        -0.04078180715441704,
        0.07890089601278305,
        -0.03252922743558884,
        0.024414390325546265,
        0.0188869871199131,
        0.0038070869632065296,
        0.01610329933464527,
        -0.020775796845555305,
        0.03972996771335602,
        0.015668993815779686,
        -0.125247985124588,
        0.049362391233444214,
        0.00264047016389668,
        -0.06440283358097076,
        -0.0001456327736377716,
        -0.003849733155220747,
        -0.007027185522019863,
        -0.005943334195762873,
        -0.023960161954164505,
        -0.07887525111436844,
        0.0001643189025344327,
        -0.03653857111930847,
        0.03694116324186325,
        0.030507659539580345,
        0.10421722382307053,
        -0.005217286292463541,
        0.003943112678825855,
        0.09713700413703918,
        -0.010908669792115688,
        -0.07044869661331177,
        0.036681100726127625,
        -0.06202901527285576,
        -0.023930277675390244,
        0.04948880523443222,
        -0.03514815866947174,
        -0.0872410461306572,
        -0.06437225639820099,
        -0.001773119205608964,
        0.04244314134120941,
        0.05869169160723686,
        0.01459789089858532,
        0.06749242544174194,
        -0.024941831827163696,
        0.018386708572506905,
        -0.0040339259430766106,
        -0.0673164501786232,
        -0.07071290910243988,
        0.08080844581127167
    ]
}