{
    "id": "oxZa1oSGUps",
    "title": "What you need to study in 2020",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-05-17T16:05:44Z",
    "video_url": "https://www.youtube.com/watch?v=oxZa1oSGUps",
    "category": "Science & Technology",
    "tags": [
        "ccna",
        "ccnp",
        "aws",
        "azure",
        "redhat",
        "cisco",
        "devnet",
        "cisco devnet",
        "VMware",
        "VCP",
        "VCA",
        "CISSP",
        "OSCP",
        "CompTIA Linux+",
        "LPIC1",
        "LPIC2",
        "CompTIA Security+",
        "Red Hat System Administration",
        "CCONP",
        "AWS Certified Solutions Architect Associate",
        "AWS Certified Solutions Architect Professional",
        "Google Certified Professional Cloud Architect",
        "Microsoft Certified: Azure Administrator Associate",
        "Cisco Certified DevNet Associate",
        "Cisco Certified DevNet Professional",
        "Offensive Security Certified Professional",
        "cisco ccna"
    ],
    "views": 81866,
    "likes": 5542,
    "comments_count": 861,
    "description": "Are you serious about your future? What are you going to study in 2020? In this video I discuss what I think are important topics to study and certifications to get in 2020 and 2021.   Before you even start studying, you have to have the right mindset. Do you believe in yourself? Or do you doubt yourself? You must use the circle of control to focus your attention on what you can change. Ignore the haters. Ignore the doubters. Focus on your studies. Focus on your circle of control. Use your time wisely.  Do you agree? What are you studying?  Menu: Overview: 0:00 Circle of control 0:24 Atomic Habits: 2:34 It is not an or situation: 2:45 The golden ticket: 3:01 Ride waves: 3:52 You must believe in yourself: 4:39 Change your future: 6:25 Certifications 1: 9:48 Certifications 2: 13:44 Certifications 3: 15:43 Certifications 4: 16:26 Certifications 5: 18:17 Certifications 6: 19:08  Videos mentioned: My career crashed:  Free CCNP:   Books: Atomic Habits:  Atomic Habits Audio:  7 habits of highly effective people:   CCNA CCNP DevNet AWS Azure Redhat CompTIA Linux+ LPI (Linux Professional Institute)  LPIC1 & LPIC2 Red Hat System Administration (RH124) Cumulus Certified Open Networking Professional (CCONP) AWS Certified Solutions Architect Associate AWS Certified Solutions Architect Professional Google Certified Professional Cloud Architect  Microsoft Certified: Azure Administrator Associate Cisco Certified DevNet Associate Cisco Certified DevNet Professional  Red Hat Certified Specialist in Advanced Automation: Ansible Best Practices exam Offensive Security Certified Professional (OSCP) Certified Information Systems Security Professional (CISSP) CompTIA Security+  Cisco Certified CyberOps Associate VMware Certified Associate (VCA) VMware Certified Professional (VCP)  #ccna #python #linux",
    "description_links": [
        "https://youtu.be/DQR5EqM1doQ",
        "https://youtu.be/Ypk77FytrWw",
        "https://amzn.to/366KZ7f",
        "https://amzn.to/36943BR",
        "https://amzn.to/3cRt7jv"
    ],
    "transcript": "- This is not a technical video. In this video we're going to talk about life and the future. I'm going to give you some tips with regards to where I think the future is. So if you're not interested in learning about which certifications are important in 2020, if you're not interested in learning about what I would advise you to do to get ahead in life, especially in your career, then skip this video. I strongly believe in this principle of circle of control. Change, what you can and don't focus on what you can't change. We're going through terrible times at the moment, the world is in lockdown. I'm stuck in South Africa, I can't get a flight back to the UK, but I'm not going to let that stop me. I can't control that stuff. I can't control what President Trump does, or what the British Prime Minister does, or what whoever does in the political sphere. I can't control that, so I don't focus my time too much on that. I make sure that I'm aware of the things that are going on, but I don't spend all my time getting wrapped up in political things because I can't change that. But what I can do is I can change my situation by learning something new every day. Now I want to encourage you: take control of your life. Don't wait for some external event to make your life better. Make your life better by doing something every day to improve your life. The world has changed. We have so much information available on the internet, free information or low cost information on platforms such as Udemy. You can change your life by studying. You can change your life by being proactive. Don't be reactive. Don't wait for something. Don't react to the events in the world, take control of what you can and do something with your life. If you wait for some external event to make your life better, you may wait your entire life and it may never happen. People who succeed in life do something about their situation, they don't just wait for something to happen. Go and do something today in your life to improve your life. Rather than watching television, spend time studying, spend time developing yourself. If you want to change your life, take control of what you can and go and do something with your time. Time is something that you mustn't waste. Make the most of your time every day. If you just do something small every day, it accumulates and makes a big change in your life. Go and read this book \"Atomic Habits,\" where the author talks about making a 1% change in your life every day, and you'll see over time that changes everything. Something I always get asked, and this is a point I want to make is it's not an or situation. It's not CCNP or DevNet, or DevNet or something else. There's nothing stopping you starting with one certification, getting it, and then going and doing the next certification. A big mistake a lot of people make is they think I need to get the golden ticket to life. If I get this golden ticket my problems will be solved. I don't think that's true for most of us. For most of us, it's a process of grinding, it's a process of just doing the same thing over and over and over. In other words, learning something new every day, and then doors will open for you. Now the certification that I'm talking about in this video are what I think is important. You may not agree, and that's fine. Put in the comments below what you think are the most important certifications in 2020 and 2021. You may not agree, but this is my personal opinion about what I think is important and what I think you should be studying. These trends, these certifications can really help you in the next few years. I really believe in riding waves, or new technologies, I did that with Voice over IP many years ago. I saw that Voice over IP and Cisco IP telephony was really important, and I jumped on that wave, and that carried me for many years. In the more recent past, I saw that OpenFlow SDN type stuff was really important, and I got involved with that. Saw that network automation was really important and got involved with that. Things are changing now, network automation has become more mainstream. So let's talk about what you should study in 2020, and where you should go in your career if you want to get ahead, and basically, make your life better. (energetic house music) Now this is really important, you have to believe in yourself. You must ignore the haters, ignore the doubters. That could be your parents, that could be your siblings, that could be your friends, so called friends, that could be other people that doubt that you can do it, ignore those people. Ignore the doubt, ignore the hate. You must do what you want to do because it's your life. It's your life. Don't live the life of someone else. Live your life, Make your decisions. You're responsible for your life. It frustrates me immensely when people blame others for the problems that they've got. Oh it's the government. Oh, it's this, that, or the other. You get two types of people in the world, those that blame others, and those that change their lives, and make a decision to do something with their lives. Don't let your life go past. Don't become old one day and regret not doing what you wanted to do. You'll regret not doing something more, I think, than regretting doing something. There are certain cases obviously where that's not true. Don't go and do something really stupid. But a lot of old people regret the things that they didn't do. Don't listen to the people that tell you that you can't do it. There are so many examples of people that have done something with their lives, come from really difficult situations. Adversity often makes you stronger. Comfort can make you very weak. Don't get too comfortable. Don't make excuses. Do something. You can't change the past, but you can change the future. If you've made a lot of dumb decisions, or bad decisions in the past, that's in the past. There's not much you can do about that, but you can change your future by doing something today, by doing something every day. Many of us have done this, and many of us have changed our lives. I spoke about some of my journey in this video. Now, I don't think my journey was particularly difficult compared to some others, and some of you. Many people have overcome huge adversity to get where they are today, be one of those people. Don't be one of those people that make excuses. You need to take control of your life. Don't let other people put you in a box. Don't let other people tell you what you can't do. Do something that you want to do. So ignore the haters and the doubters. I get hate every single day on YouTube and other platforms. No matter what I do someone's gonna hate it. No matter what I do, and what I say, someone's gonna say, \"David, you're an idiot,\" or David you, beep, beep, beep, stupid, or David, this is rubbish, or David this, that, or the other. You've gotta ignore those haters. They will always be people who have a problem, and want to take it out on you. Ignore those people and spend time with people that build you up. Spend time with a community of people that help you. Don't spend time with people that break you down. Make good friends. Don't spend time with people that are going to drag you down, or take you away from your goals, or who tell you that you're dumb, or that you can't do it, ignore those people. Don't be friends with those people, Find good people and be friends with people that help you. There are a lot of great people in the networking community that will help you. So perhaps there's no one in the city that you're in that can help you in your networking career, but you've got access to the internet. If you're watching this video, you can change your life. There's so much free information out there, and there's so many opportunities that didn't exist years and years ago. Devices like this have changed the world. You have got access to a huge amount of information through your phone or through your laptop. If you've got electricity, if you've got a laptop, if you've got a phone. And if you've got some time, you have no excuse. A lot of people say there's not enough time. I've created videos in the past about time. Don't tell me you don't have time to change your life if you spend four hours a day watching Netflix, or television, or whatever, you will spend time on what's important to you. I know what's important to someone just by looking at where they spend their time. Where they spend their time shows you what's actually important. Not what they say, but what they do. Spend your time on what's important. You have the whole world at your fingertips with a phone like this. You can create content, you can share, you can learn. Don't make excuses. Don't blame others, change what you can. Now you might say, \"Well, David, I don't have the skills. \"David I don't have the opportunity. \"David I don't have this, that, or the other.\" Excuses, excuses, excuses will get you nowhere. If you think you've got it bad, then look around you. There is always someone who has it worse than you. I'm sorry, but unless you live in the most abject poverty in the worst places in the world, there's always someone that has it worse than you. Don't give me your excuses. Tell me what you're going to do. So put in the comments below what you're going to do. Get started. As Nike say, \"Just do it.\" Just get started. Every day do something to take you where you want to go. So here's some of the certifications that I think are important in 2020, 2021, and subsequent years. This may change. In a few weeks, Cisco Live is happening. So, that may change events, but based on the information that I currently have, this is what I think is really important to do. If you want to be in networking, you need to understand networking, and there's no better way to get started than the Cisco CCNA certification. I'd highly recommend the CCNA certification if you just want to learn the basics of networking. So as an example, you want to be a network engineer, or you want to be an ethical hacker. Fantastic certification to learn the basics of networking. I see this as a foundational certification to build upon. So if you're new to networking, you're new to this industry, CCNA is a fantastic certification to get. But don't stop there. As an example, go and get to your CCNP Enterprise. Just remember, there's not one path that suits everyone. These are great certifications to get, but you may prefer to go into data center, or you may prefer to go into security, and then you may want to do a CCNP data center, or CCNP security certification. Now again, don't restrict yourself just to say CCNP Enterprise. Go and look at other certifications such as CCNP security if you have an interest in security. If you want to go for CCIE, that's also brilliant. CCIE gives you a lot of credibility. I found that a CCIE is fantastic not just because of the technical knowledge that you gain, but you also gain a way of thinking, you'll learn to methodically go through problems. There's a bunch of soft skills and other skills that you gain with becoming CCIE. Tenacity is one of them. Troubleshooting. There's a lot of other skills that you get with becoming a CCIE. Is it necessary in the future? I think that depends on where you want to go. If you want to be a network person, and become an ultimate network person, CCIE can help you, but if you want to go down the development route, maybe CCIE isn't for you. CCNP might be good enough and then do code. Questions about certifications. The first thing is, there's no CCNA prerequisite for CCNP. There's nothing stopping you just getting your CCNP, just like in the old days there was no prerequisite for CCIE. You could have no certifications and go straight to CCIE. There's nothing stopping you doing that. My recommendation is that if you're new to networking, go and do your CCNA. If you're new to this stuff, so it sounds very confusing, you're not quite sure what an IP address is of what a subnet mask is, or you're not sure about the basics of spanning tree, or OSPF, go and do your CCNA. But if you've got experience in the industry, if you've done the previous CCNA, I wouldn't bother redoing that, I would go straight to CCNP if I were you. This is my advice: if you're thinking of doing your CCNP, so let's say you're following this ENCOR course, or you're studying through books and you're finding it really tough, there's nothing stopping you going back to doing CCNA. Why start at CCNA if you can go straight to CCNP? Study the stuff and if it's too much, then go and do your CCNA. But don't redo your CCNA, don't go back and redo a cert if you can go to the next level. So go and do your CCNP ENCOR. Get your CCNP certification first. I wouldn't go back to studying CCNA. Okay what's better CCNA, DevNet, ENCOR? It really depends on you. What do you enjoy? Do you enjoy programming, or do you enjoy networking? If you enjoy networking, then I would go and get my ENCOR or CCNP certification, and then study DevNet on the side. If you enjoy programming with a bit of networking, then go and get your DevNet certifications, and then come back to CCNP and other certifications. Now I think Linux is something that all of us need to learn. You need to learn Linux. It's used almost everywhere these days. It's used in the data center, Cisco devices use it, there are other networking devices that use Linux. It's used on servers. It's used in IoT devices, or Internet of Things devices, the internet uses Linux tremendously. Fantastic skill to get, so make sure that you learn Linux. Now I've listed certifications here because certifications give you a nice path to follow to learn a skill. But don't just get the certification, make sure you get to the skill and the knowledge. So as an example, you may want to do the CompTIA Linux+ certification, or as an example, you may want to do the Linux Professional Institute certifications. In the past, to the CompTIA Linux certification gave you credits for LPIC1, but that's no longer true. So you may want to take either of those. Red Hat has been in the industry for a long time. Red Hat now owns Ansible. So if you take a Red Hat certifications, you may want to go down an Ansible path, and I'll show you that in a moment. So look at the Red Hat certifications including the Red Hat System Administration RH124 certification. Now this is an interesting one. Cumulus has been recently purchased by Nvidia. So you may be interested in learning about Cumulus open networking. That gives you a version of Linux on networking devices. So if you're in the networking sphere, or you're a networking person, that's a great way to learn Linux in a networking context. So you may not be interested in learning about Linux on servers, or learning about Linux on IoT devices, but this gives you the opportunity to learn Linux in a networking context. I've created a Cumulus Linux course in the past, it's a great way to learn Linux, once again, in a networking context. So if you aren't interested in servers, that may be a great certification to pursue. Now, the cloud is taking over everything. I'm not saying you need to get all of these certifications, but look at AWS Certified Solutions Architect associate and professional. I think all of us need to get a cloud based certification. So AWS, or Google certification, or Microsoft Azure certification. I would personally do the AWS certifications, but you may prefer doing Google, or Microsoft. The moral of the story is get a cloud certification. You can take the knowledge from one of these certifications and apply it to the other certifications, but start studying the cloud if you haven't already. Now there's this big trend for DevOps. I'm sorry, but being a pure networking person is no longer good enough. You need to learn skills such as Python, Ansible, Git, and other developer topics. Now in the past, I created a Python course, I created a Linux course for network engineers, there was no sort of formalization of this information. But Cisco have created the Cisco certified DevNet associate and DevNet professional certifications. So that's a great way to learn these skills while getting a certification. Again, certifications are a great way to formalize and distill information, and help you learn specific topics. So rather than you just grabbing books and random stuff out there, then follow a certification track, and you'll pick up these skills. Again don't just go after the cert, don't use brain dumps and just pass the exam. Make sure you understand the information in those certifications. Now, I mentioned Red Hat before. Red Hat have this whole track now with Linux and Ansible because they own Ansible. So we have the Red Hat Ansible for network automation course, as well as advanced automation, Ansible best practices. And you can take this Red Hat certified specialist in advanced automation Ansible best practices exam. So the moral of the story is if you did that cert you'd be learning Linux, they have a whole track that you can follow where you start with Linux fundamentals and then you build on that and you become more proficient in network automation, specifically using Ansible. Ansible and Python are skills that are really important in network automation and network programmability. You can start with the Cisco certifications as an example. And then learn additional information about Ansible from Red Hat, as an example. Now security is a topic that will always be in demand. If you enjoy security, if you enjoy ethical hacking. So you enjoy topics such as Kali Linux or Parrot OS, you enjoy doing penetration testing and finding vulnerabilities in networks, then have a look at the Offensive Security Certified Professional, or OSCP certification in the CISSP. I would say that for ethical hacking, OSCP is the best certification to get. So if you're really interested in ethical hacking, that's a great certification to get. But let's say you're not sure, you're new to the industry, then have a look at the CompTIA security plus certification, or the Cisco certified cyber ops associate certification. I'm not saying that you must get all of these certifications. I'm trying to show you certs that I think are worth looking at, and perhaps pursuing. Now virtualization has been important for a long time, no better place to learn about virtualization than from VMware, been around for years. So have a look at the VMware Certified Associate, and VMware Certified Professional. VMware ESXi is used in enterprises around the world. VMware workstation pro, very popular type two hypervisor. Now again, certifications are a great way to learn new technologies and get validation of your skills. Don't just get the cert, get the knowledge. But do you agree with what I've said here? Are there any other trends or certifications that you think I've missed? There's nothing stopping you starting with one certification, getting it, and then going and doing the next certification. So as an example, you could do CCNA, then DevNet associate, and then CCNP. It's not one or the other. You have options, it just takes a bit longer. But hopefully you're going to be in your career for many years. I mean, if you've only been in your career for one year, remember, you've got many, many years ahead of you. I've been in this game for 20 years, that gives you a lot of time to do a lot of certifications and make adjustments. It's not like if you do this you stuck on that path for the rest of your life. You can always adjust, you can always pivot to something else. Keep your eye on the trends. So the trends are network automation, I think is extremely important, you need to learn network automation. It's been bubbling up in the industry, as I've said, for many years. It's been finalized now with Cisco certifications. You need to do, automation as part of your repertoire, if you like, or part of your skill set. If you're a network engineer today, it will really make you stand out. There's still a very small number of people that are very strong on networking and very strong on network automation. There are not that many people. Become that person. Become the person who's good at networking, and good at network automation and scripting, and programming, that will set you apart and give you a huge advantage in the job market. Now, I see the trends going this way: I see the cloud just taking over. I think the cloud is extremely important. So I would strongly suggest getting an AWS certification, or getting an Azure certification, or both if you can. The cloud is where things are going in a major way. Cloud automation programming. I actually see the world of networking and programming getting closer, and closer, and closer in the next five to 10 years. I could be totally wrong, but that's sort of where I see it going. I have some more surprises coming. So, make sure that you've subscribed to my YouTube channel, make sure that you click on the bell to get notifications because you need to be quick for some of the giveaways and surprises coming up. Lot of surprises coming up in the next few weeks. (energetic house music)",
    "transcript_keywords": [
        "certification",
        "Linux",
        "life",
        "Red Hat",
        "People",
        "CCNP",
        "make",
        "time",
        "CCNA",
        "Red Hat certifications",
        "networking",
        "learn Linux",
        "Change",
        "important",
        "Cisco CCNA certification",
        "learn",
        "Ansible",
        "Hat",
        "CCNP certification",
        "network"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "YouTube",
        "these days",
        "Linux",
        "the Linux Professional Institute",
        "Cisco Live",
        "many years",
        "20 years",
        "four hours",
        "Cisco",
        "two",
        "Red Hat",
        "DevNet",
        "one day",
        "the Offensive Security Certified Professional",
        "YouTube",
        "Google",
        "AWS Certified Solutions Architect",
        "Python",
        "1%",
        "CCNP Enterprise",
        "Linux",
        "CCNA, DevNet",
        "Every day",
        "CompTIA",
        "CompTIA Linux",
        "one year",
        "OSCP",
        "CCNP",
        "Voice",
        "Trump",
        "Nike",
        "CISSP",
        "today",
        "the Red Hat System Administration RH124",
        "one",
        "Parrot OS",
        "Red Hat",
        "Microsoft Azure",
        "Kali Linux",
        "DevOps",
        "first",
        "UK",
        "Ansible",
        "IoT",
        "OpenFlow SDN",
        "the next few weeks",
        "AWS",
        "years",
        "South Africa",
        "2020",
        "David",
        "Git",
        "2021",
        "IP",
        "Linux",
        "the old days",
        "ENCOR",
        "VMware",
        "Cumulus Linux",
        "a few weeks",
        "CCNA",
        "Ansible",
        "CCIE",
        "Atomic Habits",
        "Nvidia",
        "many years ago",
        "the next five to 10 years",
        "Cisco IP",
        "the next few years",
        "Netflix",
        "every single day",
        "Ansible",
        "years ago",
        "OSPF",
        "Cisco",
        "CCNA",
        "British",
        "CCNP ENCOR",
        "Azure",
        "LPIC1"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PERSON"
    ],
    "vector": [
        0.020656846463680267,
        0.014980271458625793,
        -0.005603956524282694,
        0.04082467034459114,
        0.003233751282095909,
        0.0065689003095030785,
        0.04232512786984444,
        0.044670768082141876,
        -0.0027430597692728043,
        -0.017195992171764374,
        0.021744530647993088,
        -0.023308804258704185,
        0.04398706555366516,
        0.015358228236436844,
        -0.04889190196990967,
        0.005679242312908173,
        -0.045984674245119095,
        -0.031104210764169693,
        -0.011064104735851288,
        -0.04377058893442154,
        -0.03996999189257622,
        0.036554403603076935,
        -0.015986992046236992,
        0.007814040407538414,
        -0.17233514785766602,
        0.07177402824163437,
        -0.0172195453196764,
        -0.023736827075481415,
        -0.06429337710142136,
        -0.016077715903520584,
        0.04796522110700607,
        0.05463018640875816,
        -0.07085778564214706,
        -0.0457756333053112,
        0.0013052865397185087,
        -0.050063252449035645,
        0.027972780168056488,
        0.029885735362768173,
        0.06770423799753189,
        -0.07277697324752808,
        0.0033782327082008123,
        -0.08262864500284195,
        0.022251982241868973,
        0.033975932747125626,
        -0.00313335913233459,
        -0.01896919310092926,
        -0.03793255612254143,
        -0.05852563679218292,
        0.013590284623205662,
        -0.028783531859517097,
        -0.11639382690191269,
        -0.05643824115395546,
        0.037762515246868134,
        -0.12047476321458817,
        -0.029497690498828888,
        0.06771153211593628,
        0.0026757940649986267,
        0.0642700046300888,
        0.021632561460137367,
        -0.038776885718107224,
        -0.011827245354652405,
        -0.06242489814758301,
        -0.020753486081957817,
        0.012188555672764778,
        0.03930201381444931,
        0.10844937711954117,
        -0.0031314846128225327,
        0.06597324460744858,
        0.026111707091331482,
        0.0320846252143383,
        -0.02704872190952301,
        -0.021577877923846245,
        -0.0011095412774011493,
        0.006615596357733011,
        0.03954770416021347,
        -0.013956872746348381,
        0.024670014157891273,
        -0.0033275175374001265,
        0.04957088455557823,
        -0.033657506108284,
        0.06955644488334656,
        0.001445853733457625,
        -0.012686144560575485,
        -0.07897195965051651,
        -0.038068223744630814,
        -0.014339223504066467,
        0.03578687831759453,
        0.018491558730602264,
        0.029104571789503098,
        0.032494548708200455,
        0.03916393592953682,
        -0.060040075331926346,
        0.0025997445918619633,
        0.05735545977950096,
        0.0043795243836939335,
        0.07881837338209152,
        -0.053871236741542816,
        -0.015743764117360115,
        0.0313318632543087,
        0.03184469789266586,
        0.04587308689951897,
        -0.0031055822037160397,
        -0.0696001797914505,
        0.017627881839871407,
        -0.05826738476753235,
        -0.017769642174243927,
        0.08103851228952408,
        -0.040582623332738876,
        0.016610516235232353,
        -0.0026448057033121586,
        0.029285844415426254,
        0.05059980973601341,
        -0.06730233877897263,
        -0.018965713679790497,
        0.10691425949335098,
        0.12254972010850906,
        -0.03143012523651123,
        0.11134736239910126,
        0.07887051999568939,
        0.032359518110752106,
        -0.058991845697164536,
        0.042468227446079254,
        -0.008154243230819702,
        -0.012459320947527885,
        -0.009189189411699772,
        -0.09825734794139862,
        -0.02509571984410286,
        3.1992915467551714e-33,
        -0.04102747142314911,
        0.05417822301387787,
        -0.042442888021469116,
        0.0686892494559288,
        -0.035644400864839554,
        -0.01853199489414692,
        -0.012260283343493938,
        0.03251910209655762,
        -0.022678840905427933,
        0.04607127979397774,
        0.10817962139844894,
        -0.061380237340927124,
        -0.09057483822107315,
        -0.02185451053082943,
        0.006494287401437759,
        -0.044449664652347565,
        -0.051618464291095734,
        -0.04483283311128616,
        -0.02737695910036564,
        0.021975236013531685,
        0.0010415390133857727,
        -0.08347850292921066,
        -0.027727412059903145,
        -0.03296038135886192,
        0.044900886714458466,
        0.026518482714891434,
        0.05378459021449089,
        -0.026233961805701256,
        -0.007522827945649624,
        0.029436998069286346,
        -0.047381892800331116,
        0.07188812643289566,
        -0.0998212993144989,
        -0.0014958820538595319,
        0.028724629431962967,
        0.04159241542220116,
        -0.04339974746108055,
        -0.0346488282084465,
        -0.021045593544840813,
        -0.08955737203359604,
        -0.024471022188663483,
        0.06235642731189728,
        -0.028570590540766716,
        0.027168845757842064,
        0.0036166037898510695,
        -0.0034163950476795435,
        0.091854028403759,
        -0.007444086484611034,
        0.025958333164453506,
        0.04166781157255173,
        -0.10459575802087784,
        -0.023931963369250298,
        -0.02512199431657791,
        -0.12043341249227524,
        -0.05774605646729469,
        -0.08835923671722412,
        0.01247431430965662,
        -0.046324506402015686,
        -0.05435718968510628,
        -0.010240083560347557,
        0.0172501839697361,
        -0.019077809527516365,
        -0.10585977882146835,
        -0.014839086681604385,
        -0.04308570921421051,
        0.10720415413379669,
        -0.10799851268529892,
        -0.05937786027789116,
        0.052979689091444016,
        0.022539937868714333,
        -0.05879338085651398,
        -0.03742056339979172,
        0.01941792108118534,
        -0.001116504892706871,
        0.051921993494033813,
        0.04460672289133072,
        0.012864639982581139,
        -0.010240430943667889,
        -0.04491085186600685,
        0.03848807513713837,
        0.06993027776479721,
        0.06589844822883606,
        0.02324976772069931,
        -0.06567005813121796,
        0.0727599486708641,
        -0.04530148580670357,
        0.08108024299144745,
        0.037850409746170044,
        0.09788256883621216,
        -0.016367284581065178,
        0.07021667063236237,
        -0.04857853800058365,
        0.11880671232938766,
        0.09445211291313171,
        -0.12269813567399979,
        -4.7138116926660534e-33,
        0.033572129905223846,
        0.04247945174574852,
        0.04837917536497116,
        0.0187756959348917,
        0.08190153539180756,
        -0.04496612027287483,
        -0.038931723684072495,
        0.043353430926799774,
        0.03725181519985199,
        -0.02045680396258831,
        0.04147539660334587,
        0.010997394099831581,
        0.01533159613609314,
        0.02915171906352043,
        -0.03753465786576271,
        -0.1359381079673767,
        -0.043204985558986664,
        -0.0015658721094951034,
        -0.07229683548212051,
        -0.04082609713077545,
        0.01358781848102808,
        0.04670131206512451,
        -0.06585270911455154,
        0.0017735818400979042,
        -0.054607514292001724,
        0.05775345116853714,
        0.05031151324510574,
        0.04380195215344429,
        0.05293742194771767,
        -0.02204093709588051,
        -0.05265236273407936,
        0.03798270225524902,
        0.0463181734085083,
        0.01393308024853468,
        -0.003779336344450712,
        -0.045288100838661194,
        0.0850096270442009,
        -0.05717116594314575,
        -0.0431300587952137,
        -0.029994012787938118,
        -0.03282603248953819,
        0.028678977862000465,
        -0.08418136090040207,
        -0.043285734951496124,
        -0.007785537280142307,
        -0.005081214942038059,
        0.09290549159049988,
        0.056183602660894394,
        -0.01062396913766861,
        0.012949972413480282,
        0.008722004480659962,
        0.048917531967163086,
        -0.01721126399934292,
        -0.04242249205708504,
        0.08404073864221573,
        0.06317531317472458,
        0.031056730076670647,
        0.012891251593828201,
        -0.01224513165652752,
        0.025191335007548332,
        -0.0034428294748067856,
        0.03720194101333618,
        0.04002135246992111,
        0.023624196648597717,
        0.040574830025434494,
        -0.10530777275562286,
        -0.012003063224256039,
        0.042933832854032516,
        -0.010170753113925457,
        0.03395213931798935,
        -0.04210131615400314,
        0.03811268508434296,
        -0.07742972671985626,
        -0.12370358407497406,
        -0.0073250411078333855,
        -0.06916841864585876,
        0.019449856132268906,
        -0.03572759032249451,
        -0.057904090732336044,
        -0.002443820470944047,
        -0.03008771687746048,
        0.021275270730257034,
        -0.04694770276546478,
        0.03583427891135216,
        0.03717150166630745,
        0.10234574228525162,
        -0.01569158397614956,
        -0.04673740640282631,
        -0.014181643724441528,
        -0.01689520850777626,
        -0.0673423781991005,
        -0.01528758555650711,
        -0.03110981360077858,
        0.03178159520030022,
        -0.021168898791074753,
        -5.697389937608932e-08,
        -0.005525713786482811,
        0.001998595893383026,
        -0.06285921484231949,
        0.026924921199679375,
        0.025171825662255287,
        -0.004013902973383665,
        -0.04513492062687874,
        -0.06989377737045288,
        -0.02316514402627945,
        0.038857441395521164,
        0.010813823901116848,
        -0.02832021564245224,
        -0.016451193019747734,
        0.0180917177349329,
        0.025499721989035606,
        0.018314041197299957,
        0.01988162472844124,
        0.063803531229496,
        -0.016786959022283554,
        -0.009114527143537998,
        0.08887772262096405,
        -0.07457830756902695,
        0.03155447915196419,
        0.04543089494109154,
        -0.030592136085033417,
        0.027253929525613785,
        0.05398146063089371,
        0.10020387917757034,
        -0.014506570063531399,
        0.011474880389869213,
        -0.043324775993824005,
        -0.06986858695745468,
        0.008803540840744972,
        -0.04300488904118538,
        -0.03936595842242241,
        -0.01948845013976097,
        -0.0006948427180759609,
        -0.0020855446346104145,
        0.06081313639879227,
        0.07293739169836044,
        -0.036200251430273056,
        0.0025979136116802692,
        0.027581777423620224,
        0.14738358557224274,
        -0.06620999425649643,
        -0.07142417132854462,
        -0.029040232300758362,
        -0.009421502240002155,
        -0.009034441784024239,
        -0.02078787237405777,
        0.0023378327023237944,
        -0.013210193254053593,
        0.012693151831626892,
        -0.046028461307287216,
        0.04010065272450447,
        0.15365496277809143,
        0.027329426258802414,
        0.030320607125759125,
        -0.1433641016483307,
        0.04274323955178261,
        0.11205218732357025,
        -0.06971617788076401,
        -0.07277415692806244,
        -0.01254198607057333
    ]
}