{
    "id": "oZnR6CjXrUU",
    "title": "Is this your gateway drug? - NZXT Function Keyboard",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-04-06T18:34:36Z",
    "video_url": "https://www.youtube.com/watch?v=oZnR6CjXrUU",
    "category": "Science & Technology",
    "tags": [
        "NZXT",
        "Keyboard",
        "Keys",
        "Keyswitches",
        "Mechanical",
        "Configurable",
        "Custom",
        "Switch",
        "Here comes a new challenger",
        "Mechanical Keyboards are easy now",
        "Addiction to new keyboards"
    ],
    "views": 294629,
    "likes": 10828,
    "comments_count": 714,
    "description": "Thanks to NZXT for sponsoring today's video! Get your NZXT Function Keyboard and Lift Mouse today at:   NZXT has entered the configurable mechanical keyboard market with the FUNCTION keyboard, also they threw in their corded mouse LIFT! They're not here to take over or \"ruin\" the market, but another option for you to start your keebs journey.   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS ---------------------------------------------------  0:00 - They sent us too much STUFF 0:10 - Function keyboard unboxing 0:37 - Function keyboard weight and exterior impressions 1:00 - Function keyboard overview 1:43 - Customize your own Function keyboard  2:15 - In-depth look at the Function keyboard 2:40 - Media controls 2:51 - RGB impressions 2:58 - Typing impressions 3:10 - Keyswitches 4:00 - Other Function keyboard forms 4:54 - Pricing impressions 5:06 - NZXT Lift Mouse impressions 5:58 - MORE boxes! 6:05 - USB cord colors 6:24 - NZXT CAM software impressions 6:55 - Other media control buttons 7:41 - More RGB options 8:22 - Macro function 8:45 - Configuring NZXT Lift Mouse 9:41 - Outro",
    "description_links": [
        "https://nzxt.co/FunctionLiftSC",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- NZXT sponsored this video to cover, I don't even know what, look at all this stuff. Good God. Okay. Let's start with the function keyboard. Okay. We got a black one. Oh, wait, we got a white one. There's multiple colors, guys. This is kind of sweet. It's not cushy, but it's super rubberized and it's got this cool circular pattern on it. Wow. Sure got enough rubberized feet on the bottom. That ain't going no place. A branded purple keycap puller. Okay. This is a removable USB type C to A braided cable. And finally the piece de resistance. It's 926 grams and it's low profile. It's got an aluminum face plate. It has this much deck flex. Mmm. But look at this. You got some feet on the back. They have rubberized feet on them as well. And then a second level of feet. This clips onto here, it's magnetic. - [Jono] It's magic. - Do not recommend holding it up. (keyboard keys clicking) Now they come with Gateron keycaps. So the whole thing with this, I guess what they're trying to do is say, \"Look the customizability you get \"with the mechanical keyboard space, \"as an enthusiast, is amazing, \"but what can we do to bring new people into that space? \"And how can we be a player in that space \"without limiting customizability?\" That's what I gathered from reading their thing, anyway. This keyboard has fully removable keycaps. Fully removable key switches. And from their site you can buy various key switches, all Gateron types. So they have like two different configurators. There's like the normal kind of cart page where you're like, \"Hey, look, two colors. Here it is.\" And then there's the keyboard builder page, where there's different colors, different keycaps and more different key switches. And you'll even be able to get this as just a chassis with no keycaps, no key switches, just empty, which is sweet, because if it turns out that it is the best chassis for X customer, like if there's a subset of the community who just really like the chassis, they may become known as like a staple or like that's a great chassis use for this use case. So then in that way, they're in the community without kind of ruining it. You know what I mean? Now, this particular one, the base spec is the Gateron red switch, which is a linear switch, 'cause gaming. And you get this key switches that are ABS the RGBs gonna shine through. I haven't even plugged this in but, there's lighting, I'll tell ya. I'll tell ya, there's lighting. But if you order it in the configurator, you can get ABS keycaps and you can get, again, different colors of keycaps. I read in their materials that they were talking about this volume knob over here. That they said was like a gamer's volume knob, because gamers love adjusting their volume. But actually this is a sweet little knob. Okay, here we go. This is like kinda an icy blue. Oh, it's NZXT colors. I see what they did there. This is what it sounds like y'all. (keyboard keys clicking) Why don't we pull out a switch. This is not really a switch puller, but we'll try it. Do you have a key switch puller somewhere? Oh no, Jono, you went all that way, I just looked in the box. - [Jono] Oh you son of a (beeping) (both laughing) - I just looked in the box and there it was. Oh, it's actually kind of sweet. I've never seen one like this before. It's like a giant pair of tweezers. Oh, think I can get my unibrow with this thing? Oh, I've got it. Oh yeah. (upbeat music) - Oops. You see the RGB light there. These are per key, addressable RGB lights. You can also assign macros to all the different keys. All that happens in the CAM software, which we're gonna check out in a bit. It's a completely standard key switch. Cross pattern in the middle. It's a five post switch. And another thing they did to make this compatible with most of the keycaps out there you're gonna get is that they made the bottom row, all standard, all standard widths and everything. That even is true on their compact keyboards which we haven't out, like this one. Yeah. This is their MiniTKL. So it has all the keys of a Ten keyless, which I have here. Except it takes out all the unnecessary space and just compacts the crap out of it. And look how tiny that puppy is. That is cool. You still have a full size enter key. You still have all your arrow keys. You have, everything is normal in the bottom row. I love this top row where the F keys are just completely ortholinear with the number keys below them. It looks sweet. Oh, this is a different switch in here too. Yeah, these are linear. All right, I will tell you what these Gateron on silent blacks sound like. (keyboard keys clicking) You know what the longest word you can type with just your left hand is? In the English language. Stewardess. Why do I know that? I think I know that from a fact book I read in grade eight. This is a cool little keyboard. All right, let's talk pricing. For the retail models. The different sizes are 130, 110, $100. But then if you buy them as the bare bones kits, 90, 80, and $70. But I don't just have keyboards today. I also have mouses. Oh my, oh my God. Excuse me. (groaning) So they come in black and white. NZXT actually calls these ambidextrous. Although these buttons kind of have something to say for that, unless you're really good with the ring finger. But strictly speaking they're, it's not like it's bent one way or another. They got omicron switches. Ooh. Yeah. Very tactile and pretty light force to click those down. They have these low friction paracord cables. They got five buttons. Ratcheted mouse wheel. You can, of course, click the mouse wheel. (mouse clicking) I like the sound of the click. Oh yeah. They slip around pretty good. The mouse is 50 bucks, but you can also customize these on the website and get different accent colors. I have another stack of boxes. These are are different accent cables for the keyboards. Okay. I like what you've done here. Purple, blue, more blue. That's a good match for that keycap right there. Now what if I had the white one? Gotta go purple. Especially with that lighting scheme that they had default. That'd be cool. Ooh. All right why don't we take a look at the CAM software? Wow. This is very minimalist and postmodern software you have here. Oh, there's different tabs base being the blue color that I have now. And let's say, I'll switch that to red. And then reactive is after I hit a key and the color does whatever pattern based on that input. What is that color gonna be? Let's make that white. Interesting. There's actually some buttons. I didn't show you, guys before, those are on the side really cool and tactile. This one is the brightness button. That's off. 1, 2, 3, 4. 4 steps. This one over here in game mode so the Windows key doesn't do anything. And this third button here is the mute button. But look how, it's only red when I hold it down. Is it not a toggle? I wanna check it out. No it toggles. I like to check out the sensitivity of volume knobs. You gotta do a fair few flicks to get this up and down. It's pretty insensitive. I actually prefer, there's something about like when a good song is on, you wanna just be able to crank a knob like that. And it hits just the perfect loudness but this doesn't really do it. Kind of gotta give it a couple flicks. (upbeat music) What else can you do in this CAM software? You can change the pattern. You got ripple. We got line. What is line? Oh, weird. I don't think I've actually seen that on a keyboard before, just like a solid line horizontally. And off, so now I only have my base layer. How to make a bit of small ripple, a little tiny. Whoa, this is like super powerful, actually 'cause you can make the base a gradient, and then you still have the pattern. Now that's kind of cool. And it looks like you have a limited set of default gradients, but then you can also customize them. And you can change the direction: top, bottom, left, right, radial. I mean, I shouldn't be surprised. They're kind of an aesthetics focused company. They have designers there who I would say have some pretty good taste. So kind of a hip, I would say. And then, okay, now we got some macros. Create a new macro group. The name is James. Create a new macro, add, activation key? D. Start recording new macro. James, whoa, D, a James, a James. (laughing) My wife! And then on the mouse side of things, what have we got? These are the mouse profiles. There's DPI settings up to 16,000 DPI. So when you switch to the DPI levels you can see it flashes the color you've set to it. Just to tell you what you're doing. You can change the polling rate from 500 to a 1000. Lift off height from two millimeters to three millimeters. You can do macros for the mouse. Mouse button remapping. Mouse forward, mouse back, middle click and the DPI button you can all remap. So it looks like you can assign different media functions like volume and mute, play and pause. You can do print screen on your mouse, if you really want to. Actually, I kinda do have that on my mouse at my desk. I use the snipping tool, tied to one of the clicks. Base and reactive again, same kind of deal. I like this underglow. So wait, the ripples like if I click? Yeah, it is. Huh? So that's the Lift mouse and the function keyboard. Super cool, what they're doing. I really hope it brings more people into the custom peripheral space. For more information, obviously go to NZXT's website and play around with the configurator. Pretty cool, all the different options they give you. And consider getting a custom cable. Check all the stuff out at the link below guys. Thanks for watching sort shirt, (sputtering) okay, Sort Shircuit. It's a machine that sorts shirts.",
    "transcript_keywords": [
        "key",
        "kind",
        "mouse",
        "switch",
        "key switches",
        "keycaps",
        "cool",
        "keyboard",
        "keys",
        "colors",
        "video to cover",
        "sponsored this video",
        "yeah",
        "switches",
        "Gateron",
        "Good",
        "NZXT",
        "key switch",
        "DPI",
        "button"
    ],
    "transcript_entity_values": [
        "130",
        "2",
        "3",
        "4",
        "one",
        "USB",
        "90",
        "926 grams",
        "110",
        "500 to a 1000",
        "Sort Shircuit",
        "CAM",
        "omicron",
        "second",
        "D.",
        "Ten",
        "70",
        "Jono",
        "Lift",
        "100",
        "third",
        "80",
        "1",
        "Mouse",
        "two millimeters to three millimeters",
        "two",
        "16,000",
        "F",
        "Gateron",
        "RGB",
        "five",
        "50 bucks",
        "NZXT",
        "James",
        "eight",
        "today",
        "English"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "LANGUAGE"
    ],
    "vector": [
        -0.09020247310400009,
        -0.08119602501392365,
        0.04187876731157303,
        -0.0767192468047142,
        -0.013625219464302063,
        0.006640937179327011,
        0.04697085916996002,
        0.02114918828010559,
        0.011477077379822731,
        0.06863083690404892,
        0.0379234217107296,
        -0.008564157411456108,
        0.01202479936182499,
        0.0002199394948547706,
        0.02296958491206169,
        -0.029903734102845192,
        -0.046021703630685806,
        -0.07741494476795197,
        -0.06296703219413757,
        -0.0007023307261988521,
        -0.025355108082294464,
        -0.01314283162355423,
        0.03127684444189072,
        -0.039582330733537674,
        -0.04964349418878555,
        -0.038841888308525085,
        0.04066072031855583,
        -0.08172255009412766,
        0.029277419671416283,
        -0.12912343442440033,
        -0.019044039770960808,
        0.034943073987960815,
        -0.04560067504644394,
        -0.05660410225391388,
        -0.02159854583442211,
        0.024632547050714493,
        -0.048340778797864914,
        -0.0901198759675026,
        -0.08748476952314377,
        -0.07737894356250763,
        0.0024167438969016075,
        -0.06716763973236084,
        -0.021302172914147377,
        0.0033278819173574448,
        -0.003944242373108864,
        0.03694824501872063,
        0.044492434710264206,
        -0.07304584234952927,
        0.000394511065678671,
        0.07685120403766632,
        -0.022529207170009613,
        -0.13363835215568542,
        0.10276392102241516,
        -0.01275790948420763,
        -0.00029888475546613336,
        0.053584229201078415,
        -0.05093400552868843,
        -0.008459311909973621,
        0.12262798845767975,
        -0.02340109460055828,
        0.02977125346660614,
        -0.0082680219784379,
        -0.015574959106743336,
        0.050059955567121506,
        0.021513093262910843,
        0.06820821762084961,
        -0.009912887588143349,
        -0.012761909514665604,
        -0.05617690086364746,
        -0.03461356461048126,
        0.02623721957206726,
        -0.06282488256692886,
        0.008144939318299294,
        0.07256802916526794,
        0.007861917838454247,
        -0.034566257148981094,
        0.037563540041446686,
        0.008660578168928623,
        0.06573288887739182,
        0.006443566642701626,
        0.03921178728342056,
        -0.02304825559258461,
        0.04395722597837448,
        0.037857089191675186,
        0.09814378619194031,
        0.040040284395217896,
        0.009646273218095303,
        -0.05070950835943222,
        -0.011119154281914234,
        -0.03318193182349205,
        -0.003387002507224679,
        0.019044382497668266,
        0.053412966430187225,
        0.010631457902491093,
        -0.08874249458312988,
        -0.04924777150154114,
        0.003823458682745695,
        0.01785810850560665,
        -0.06668106466531754,
        0.08080758899450302,
        0.018056605011224747,
        0.09210887551307678,
        0.014560858719050884,
        -0.005452587269246578,
        -0.05367042124271393,
        -0.07067237794399261,
        0.04056376963853836,
        -0.004775910638272762,
        0.010498293675482273,
        0.04639863222837448,
        -0.07675602287054062,
        0.0038670068606734276,
        -0.01406619232147932,
        -0.015687983483076096,
        -0.0016822600737214088,
        0.004313179757446051,
        0.01019493117928505,
        0.03887880966067314,
        0.09937252849340439,
        0.02960498072206974,
        -0.017766689881682396,
        0.03069453500211239,
        -0.04810461401939392,
        -0.003756139660254121,
        -0.07000415772199631,
        0.047805339097976685,
        -0.04954707995057106,
        -2.147183924739655e-35,
        -0.0448913648724556,
        -0.0005380276124924421,
        -0.0374043732881546,
        -0.05375327542424202,
        0.10585737973451614,
        -0.058851808309555054,
        -0.00877106748521328,
        -0.051509350538253784,
        -0.07380659133195877,
        -0.07567580044269562,
        -0.1142660528421402,
        0.033419303596019745,
        -0.05742355436086655,
        0.06341075897216797,
        -0.013317261822521687,
        -0.03347589820623398,
        -0.005321332719177008,
        0.015490890480577946,
        -0.017072774469852448,
        -0.02295473776757717,
        0.05457654595375061,
        -0.06316525489091873,
        0.025051210075616837,
        0.022327329963445663,
        0.037319935858249664,
        0.01707497239112854,
        0.018042538315057755,
        0.010138912126421928,
        0.051673661917448044,
        0.027949757874011993,
        -0.07689430564641953,
        -0.023491771891713142,
        -0.0757942646741867,
        -0.11026835441589355,
        -0.08466694504022598,
        -0.011110409162938595,
        0.04025636240839958,
        -0.07535302639007568,
        -0.012437647208571434,
        0.030576884746551514,
        -0.022211909294128418,
        -0.04549147188663483,
        -0.09660517424345016,
        -0.09684225916862488,
        -0.018635153770446777,
        0.03390376269817352,
        0.03143175318837166,
        0.05442003160715103,
        0.07086139172315598,
        -0.05047716200351715,
        -0.06843724101781845,
        -0.021235361695289612,
        -0.06713692098855972,
        -0.09222517162561417,
        0.019251545891165733,
        -0.04324514791369438,
        -0.037892669439315796,
        0.023049725219607353,
        0.05833283066749573,
        0.05019347369670868,
        0.024427946656942368,
        0.06149612367153168,
        0.08669625222682953,
        0.0154883386567235,
        0.0025281370617449284,
        0.014863898977637291,
        -0.03915834799408913,
        -0.0164928138256073,
        -0.046073414385318756,
        -0.0800396054983139,
        -0.03848997876048088,
        0.020664244890213013,
        0.05004556104540825,
        -0.017095422372221947,
        0.00676506944000721,
        -0.01989673636853695,
        -0.07543344050645828,
        -0.11093319952487946,
        -0.0294913612306118,
        0.03603256493806839,
        0.03014950454235077,
        -0.03408447280526161,
        0.016750885173678398,
        0.028116678819060326,
        0.08409053832292557,
        -0.08957964926958084,
        -0.034312572330236435,
        -0.07104259729385376,
        -0.04928966239094734,
        0.05249849706888199,
        -0.04882499948143959,
        -0.009738149121403694,
        -0.07731512933969498,
        -0.028576940298080444,
        -0.0803217813372612,
        -3.462059349886078e-33,
        -0.022814925760030746,
        0.1261032074689865,
        -0.025935573503375053,
        0.045350581407547,
        0.015343272127211094,
        0.09725986421108246,
        0.03968704491853714,
        -0.003041102085262537,
        0.0879456177353859,
        0.005260134115815163,
        0.018169481307268143,
        0.06647321581840515,
        -0.016923271119594574,
        -0.04519651085138321,
        0.010083585046231747,
        -0.0036694537848234177,
        -0.014417123980820179,
        0.016992174088954926,
        0.016832971945405006,
        -0.09449572116136551,
        0.060265105217695236,
        -0.005819608457386494,
        -0.08867891877889633,
        0.11484959721565247,
        -0.006370768882334232,
        0.04324468597769737,
        0.06370043754577637,
        0.1435108631849289,
        -0.04508300498127937,
        0.03125058859586716,
        -0.0030078194104135036,
        0.008195515722036362,
        -0.02934761717915535,
        0.023288916796445847,
        0.009450111538171768,
        0.004159798379987478,
        0.041146595031023026,
        0.018710561096668243,
        -0.05275930464267731,
        -0.05944113805890083,
        0.04249078780412674,
        -0.018617747351527214,
        0.022654971107840538,
        -0.01944372057914734,
        -0.033928219228982925,
        -0.07961546629667282,
        -0.047051720321178436,
        -0.1135886013507843,
        0.06260477751493454,
        -0.018395094200968742,
        0.035168927162885666,
        0.017785517498850822,
        0.0282015148550272,
        -0.01483958400785923,
        -0.07905610650777817,
        0.00531513849273324,
        -0.014727193862199783,
        0.023878313601017,
        -0.008312894962728024,
        -0.022566376253962517,
        -0.018054036423563957,
        0.0009294975898228586,
        0.0522286519408226,
        -0.030936643481254578,
        0.0736858919262886,
        -0.0597565658390522,
        0.10536918044090271,
        0.01954880729317665,
        0.000561389431823045,
        -0.03444152697920799,
        0.008471069857478142,
        0.06749636679887772,
        0.0939735695719719,
        -0.038226474076509476,
        -0.005607916042208672,
        0.08784983307123184,
        0.04115797579288483,
        -0.017557792365550995,
        0.016505930572748184,
        -0.09991937130689621,
        0.043112121522426605,
        -0.058690380305051804,
        0.0633794441819191,
        -0.019876761361956596,
        -0.0032998595852404833,
        0.05556419864296913,
        0.025089431554079056,
        0.06105324253439903,
        0.03831949457526207,
        0.000288808107143268,
        0.005590090062469244,
        -0.01042178738862276,
        -0.0434601865708828,
        0.06619562953710556,
        0.07251828908920288,
        -5.995135410330477e-08,
        0.02711399830877781,
        -0.003062443807721138,
        -0.03847122564911842,
        0.024446874856948853,
        0.018621841445565224,
        0.03692364692687988,
        0.021366355940699577,
        -0.06982267647981644,
        -0.03497539088129997,
        -0.06596416980028152,
        -0.0013329032808542252,
        0.047105781733989716,
        0.027441706508398056,
        0.0840570330619812,
        0.055703964084386826,
        0.07492741197347641,
        -0.037191007286310196,
        0.08290046453475952,
        -0.036458417773246765,
        -0.07266324758529663,
        -0.012372332625091076,
        0.010548733174800873,
        0.13810691237449646,
        -0.019581004977226257,
        0.010083691217005253,
        -0.03780590742826462,
        -0.027874376624822617,
        0.07965835928916931,
        0.06312719732522964,
        -0.10994196683168411,
        -0.07999453693628311,
        0.0216541588306427,
        0.018322614952921867,
        0.006338616367429495,
        -0.0656900629401207,
        -0.01530605647712946,
        -0.013041676953434944,
        0.0703904926776886,
        -0.040846552699804306,
        0.07132383435964584,
        -0.07546734064817429,
        -0.0200149267911911,
        -0.001845712773501873,
        0.01399209164083004,
        -0.08543515205383301,
        0.04564312472939491,
        -0.0026076864451169968,
        0.03572973981499672,
        -0.0022866756189614534,
        0.0017624467145651579,
        -0.03991325944662094,
        0.02157960645854473,
        0.020184848457574844,
        0.03354012966156006,
        -0.032148316502571106,
        0.07781687378883362,
        -0.10715191811323166,
        0.03112613968551159,
        -0.03785211965441704,
        0.010192165151238441,
        0.0037848688662052155,
        -0.09986180067062378,
        -0.022444628179073334,
        0.05281956121325493
    ]
}