{
    "id": "P-14-qlKyHA",
    "title": "Is Linux The ANSWER??? - JingPad A1 Tablet",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-11-26T21:18:30Z",
    "video_url": "https://www.youtube.com/watch?v=P-14-qlKyHA",
    "category": "Science & Technology",
    "tags": [
        "Linux",
        "JingPad",
        "Tablet",
        "Mobile Device",
        "Can Linux beat Apple with tablets?",
        "Who wants a Linux Tablet?",
        "Penguin",
        "Operating System",
        "OS",
        "Open Source",
        "Touch",
        "Sensitivity",
        "iOS"
    ],
    "views": 873506,
    "likes": 34488,
    "comments_count": 2574,
    "description": "Get a $100 60-day credit on your new account at:   Apple has basically dominated the market when it comes to tablet devices with the iPad. Samsung is still trying, Microsoft has made attempts, but it seems like no one can take the crown. JingPad wants to take a shot with the A1 and use their own version of Linux as the OS!  Check out the JingPad A1 Linux Tablet at   Buy iPad Air 2020 On Amazon (Paid Link):  On Best Buy (Paid Link):  On BHPhoto (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 1:06 - Unboxing 2:04 - Exterior first impressions 3:00 - Sponsor - Linode! 3:35 - Keyboard impressions 4:40 - Trying out JingPad 5:35 - Camera impressions 6:55 - Product overview and specs 10:11 - Install apps and impressions 12:32 - Audio speakers impressions 13:20 - Final thoughts",
    "description_links": [
        "http://linode.com/shortcircuit",
        "https://geni.us/InPZBo",
        "https://geni.us/wv1D2L",
        "https://geni.us/b4cfxrf",
        "https://geni.us/xgvl",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- The world's first consumer-level, ARM-based Linux tablet. I mean, maybe. When it comes to tablets, Apple has basically got the entire industry on lockdown. Yeah, you got Android tablets like the Galaxy Tab, but does anybody actually buy those? Maybe my dad at one point. Enter the JingPad A1. This is a Chinese company, actually, JingLing International. Basically just means whale and dace fish, which is on their logo right there. The whale, and the dace fish is in the negative space. - [Jono] Oh. - I looked it up. I did my research. They're an interesting company. They seem to actually be a company built around enthusiasts. Enthusiasts of what, you might ask? Enthusiasts of Linux and open source software. Yes, this is a Linux tablet. Now, if you've looked at Linus' Linux challenge videos, you'll probably notice that Linux, at least in terms of user-friendliness, can have some issues. So I am very excited to see what exactly this has in store for us. For now, Let's get into the box first. Oh, it comes with a, oh, oh, well, Jono charged it, but it comes with a nice, actually, is this actual leather? It feels like leather. Like not fake leather. And it's got a little stamp there for JingLing. This is actually a really nice case. Okay. Let's set that aside for now. What else do we got in here? Okay. North American charger. You would expect that because we're in North America. it's just a USB type A on here. What is in here? What? This box is empty. Well, with the exception of this tasty snack right here, which you should not eat. Oh yeah, there it is. This is a USB type A to C. Yes, this is type C charging. Sweet. A lot of air in this package. I think they actually bulked it up just so that it could be the same kind of shape as an Apple iPad case, which is, I'm using. Right. This comes with a stylus too. There's so much stuff this comes with. Like, you had to pay for that on Apple. Those are pretty slim bezels. Actually, they might be slimmer than the iPad. Not sure. That power button is recessed, but it's not like a bump like these side buttons are. Oh, and the back is glossy. You can already see there's fingerprints on it. - [Jono] Banana for scale. - Banana for scale. You know what? This is a banana for scale. Let's see how well it cleans. Actually, not bad. ltdstore.com. Get your banana today. It gives you a nice handy measuring tool, and it cleans your devices. May or may not actually scratch your devices. (Jono laughs) Disclaimer. Disclaimer. Okay. So there's a magnet here that keeps this on. Like so. Is there a magnet on the device itself anywhere? Well, I don't think that's where it goes, but it can go there. Those are where the accessory pins are. Oh, speaking of which, there's another accessory we have here. I'll tell you all about it after I talk to you about our sponsor, Linode. Linode is a powerful, Linux-based cloud computing service that's affordable and easy to use. They've got a large marketplace with fully configured one-click apps for things like \"Minecraft\" or \"Valheim\" servers, or for hosting your own website with easy WordPress and Drupal integrations. Their pricing is affordable with no hidden fees, and they have servers all over the world. Best of all, Linode has 100% human, 24/7, 365-day customer service that's reachable by phone, email, or social media. Set up your server today and get $100 60-day credit on your new account at linode.com/shortcircuit. Can you see the resemblance to another popular product? - [Jono] A Microsoft Surface! - Yeah, it's a Microsoft Surface keyboard. Oh, yeah. Okay. Oh, that's solid on the back. It's like plastic. Okay. And what's in here? I guess these are the instructions. Okay. Electrical specifications. That's actually kind of neat. So when you have this stand, which is actually kind of handy, it lets you raise this up a little bit if you need to. They're telling you like, don't put extra force down on it because it could break the hinge here, which is probably why Apple didn't do that. So this should just flop right, very similar to the Magic Keyboard. And it just powered down like that. And the keyboard just works. The keyboard itself is a little bit thicker than you might expect. Like the Magic Keyboard is, I mean, like half of this thickness. But it's also quite a bit more rigid, I think. Well, okay. Maybe not. Let's see if the stylus works. Oh, it sure does. How's the responsiveness? It feels a little floaty. Oh, that's a very Apple-like control center. So swiping down from at least up there gives me wireless, Bluetooth. Let's turn the brightness up. It's way down right now. That's a little better. The stylus has hover. I can hover over. Oh, that's something the Apple Pencil can't do, as far as I know. So again, this is a very Apple-like experience. Okay. So software update. We're up-to-date. Display and brightness. Oh, it's got a dark mode. You have to restart to get the dark mode. (laughs) (Jono laughs) Ah, no. Does this not auto rotate? Is that just turned off? Hang on. I don't see auto rotation. Is it only meant to be used in landscape? This is running on a KDE Plasma Mobile, by the way. Oh, it's got cameras. Right, cameras. Oh, that's actually not too bad. It's a little jelly, but, you know, it's not too bad. (camera clicks) Okay. Okay, it doesn't look true to life, but it's decently sharp. Contrast is pretty good. It looks to me, either this is the display or the camera itself, but it looks like we're a little bit oversaturated. Oh, the microphone is inaudible. This is max volume. It's like- - [Jono] Oh no. (laughs) - Yeah. (laughs) You're not wanna want to take any conference calls on this. - [Jono] Attach a USB-C microphone, I guess. - Yeah, you can do that. There's a USB-C port here, and it does support data, as far as I'm aware. From what I can tell, all of the gestures that you would be used to on iOS are there. So like swiping up will bring you to your multitasking and also for back to your home screen if you're into an app. Interacting with this is actually pretty painless. I am noticing that the frame rate is more like a 30, rather than a 60. That is a bit of a problem. And again, that's down, I think, to the SoC. Let's see if there's an about section here. It's the world's first consumer-level, ARM-based Linux tablet. I mean, maybe. I don't really know if that's true. It is the world's first Linux tablet with an 11-inch 2K+ display. Probably, I guess. It is the world's first Linux tablet that comes with a detachable trackpad keyboard. Maybe. I mean, you can install Linux on like a Surface. World's first Linux tablet that comes with a 4096 levels of pressure stylus, which is neat, I guess. I'm not sure how accurate it is yet. Oh, this, hang on. - [Jono] Yeah, logistics said they made a booboo on the tip. - Oh, okay. This is a logistics problem. Nevermind. (Jono laughs) Oh, so I can't really properly test this because like, I'm seeing metal. It is the first tablet powered by JingOS. I can believe that one. The first Linux tablet OS. Mm, sure. It is the first time you can use a Linux-based tablet as your daily driver. Hmm, we'll have to see about the tech specs. It is the JingPad A1, exclamation point. Okay, so this is an 11-inch AMOLED multi-touch display. Cool. 2368 by 1728, 266 pixels per inch, four-by-three aspect ratio, 350 nit. Mm. Okay. So here's the problem that I'm having with this. The SoC is a Unisoc Tiger T7510. That's an eight-core chipset with four Cortex-A75 cores clocked at 2.0 gigahertz and four Cortex-A55 cores clocked at 1.8. Comparable to I wanna say a MediaTek Helio G95 maybe, which is not a very powerful chipset. And that chipset's for phones. It's kind of letting the experience down, to be honest, because otherwise, (laughs) it's actually quite nice. As we saw before, it's got eight gigs of LPDDR4 RAM, 256 gigs of UFS storage, microSD card slot, 16-megapixel main camera, eight-megapixel front camera. You're never gonna use the front camera for anything because you can't hear anything with the mics. Did they just not drill out the holes in the chassis or something? Like it's real bad. Dual-band Wifi, two-by-two MIMO. Okay. Bluetooth 5.0, GPS, Glonass, Galileo, and Beidou. USB type C supports on-the-go and USB disks. Doesn't say that here, but you can get 5G in China with SIM card. China uses different bands than North America, I think. That's why it's only in China. So six-axis gyro, ambient light sensor. Yep. Fingerprint sensor. We've seen that. Battery. The battery is an 8,000 milliamp-hour. - [Jono] iPad Air is 8,827. - 8,827. Okay. So it's a little bit smaller than the iPad Air. I am noticing a very worrying amount of power draw. We started out at like 50%. We're down to 28%. The bezels on the iPad Air are actually thicker than the JingPad. But like, if it only works landscape, then you don't really need to hold it any other way. Yeah, 'cause like I can't figure out for the life of me how to rotate this, if it supports it at all. There's probably something. I think KDE Plasma Mobile must have that. Let's go to, oh, we to the terminal. Is this Konsole? It is Konsole. Cool, with a K. (laughs) Yeah, they got an Apple theme for the Thunderbird client. But what I was looking for specifically was Krita. Okay, they've got Kate. Get that. They've got GIMP. Why don't they have Krita? Oh, you know what I could do? (Jono laughs) Oh, right. Yeah, I need to sudo apt install krita. Forgot that apt doesn't automatically elevate. Pamac does. Now that the other installs are done, I can install with apt in the terminal. Probably the reason why this isn't a thing that you can do normally is they don't have a interface for Krita on mobile. So we'll see how this works out. But why didn't do an apt update? This could destroy everything. All right. So let's just launch Krita. Oh, it closed unexpectedly. Why? Oh, it might not be. No, it wouldn't have downloaded it if it didn't have the arch. I don't know why that died, but I guess we'll just have to live with it. Okay. So we got Firefox. Let's see if that's any smoother. lttstore.com. Okay. The inertial scroll on Firefox is a lot better than the inertial scroll on Chromium though. The user experience so far is actually okay. I'm staring right at a, not a number of megabytes right there. So to say that it's not a little jank would be to lie. (object squealing) What is? Yeah, it's kind of like that. But it works basically the way that I would expect the iPad Air over here to work. It's just nowhere near as smooth. Even though it's not quite the experience you'd be looking for, it's an experience that I don't think that I was expecting. Okay. There was no pressure sensitivity there, but I happen to know that GIMP supports it and sometimes you need to actually set it up. No. So either this stylus is just like dead, or there's a little bit more configuration that I forgot to do. Just dropping it should not have shattered it like this. That's some brittle plastic. The keyboard actually feels really nice. It feels basically the same as my Magic Keyboard. I'm more or less at home here. The stereo imaging is actually really good. They do have stereo speakers. (upbeat electronic music) Okay. Let's give the iPad Air a go. (upbeat electronic music) Yeah. It's better than I thought it would be initially, but it does not hold a candle to Apple, unfortunately. - [Jono] You're gonna compare it to that? - [Anthony] Well, it's clearly like designed to mimic this as closely as possible. It's basically an iPad Air. This looks brighter, even though it's 350 nits. - [Jono] Interesting. - That's probably partially due to the fact that it's OLED, whereas the iPad Air IPS. The trade-off, of course, is you can't rotate this one. (Jono laughs) - [Jono] Would you buy one? - How much are these. - [Jono] Starts at 700 bucks? The iPad Air is $50 more. It's 749. That's 699 - Oh. SoC is really what brings it down, but, at the same time, if you, well, okay, the other thing that might bring it down is the battery. It's down to 13%. So it comes with a stylus. That's a $200 value. - [Jono] Yeah. - Like you're actually, you're not doing too bad. Also, it comes with this case. I'm kind of struggling to figure out how exactly I would recommend this. Like, I don't hate it. I feel like this would be fun to play around with if you were into Linux. I feel like it would be like, not necessarily a good experience as a tablet, but as a mobile like, I don't know, workstation kind of thing, it seems like it could be worse. Could install a different operating system on this thing, I'm pretty sure. Comment below if you want me to make Linus use this for a week. (Jono laughs) Yeah, TLDR, buy it if you want to. I'm not sure if I would. But if I wanted something to tinker with, I could find worse things to spend my money on, like a Librem phone or something. So if you enjoyed this or you wanna see more unboxings of more different things, go ahead and subscribe. And if you know of anything that's like this but better, that'd be great. I wanna see more Linux tablets, more Linux devices. So let me know.",
    "transcript_keywords": [
        "Linux tablet",
        "Linux",
        "iPad Air",
        "Yeah",
        "tablet",
        "air",
        "ARMbased Linux tablet",
        "Apple",
        "keyboard",
        "iPad",
        "Magic Keyboard",
        "bit",
        "kind",
        "USB type",
        "Krita",
        "world",
        "ARMbased Linux",
        "USB",
        "stylus",
        "experience"
    ],
    "transcript_entity_values": [
        "Minecraft",
        "iPad Air IPS",
        "four-by-three",
        "TLDR",
        "The iPad Air",
        "USB",
        "749",
        "28%",
        "Librem",
        "350",
        "Drupal",
        "Cortex-A75",
        "2368",
        "8,827",
        "KDE Plasma Mobile",
        "Chinese",
        "MediaTek",
        "30",
        "WordPress",
        "24/7",
        "Microsoft Surface",
        "the iPad Air",
        "Linode",
        "Linus",
        "today",
        "11-inch",
        "266",
        "iPad",
        "4096",
        "eight-megapixel",
        "Linux",
        "JingPad",
        "Apple iPad",
        "Surface",
        "the JingPad A1",
        "Beidou",
        "LPDDR4 RAM",
        "max",
        "Linux",
        "Cortex-A55",
        "100",
        "256",
        "Glonass",
        "first",
        "the Apple Pencil",
        "the Magic Keyboard",
        "two",
        "Firefox",
        "200",
        "JingLing",
        "2.0 gigahertz",
        "SoC",
        "a week",
        "Linode",
        "Mm",
        "eight",
        "699",
        "one",
        "365-day",
        "North American",
        "1728",
        "Helio G95",
        "iPad Air",
        "MIMO",
        "China",
        "North America",
        "Linux",
        "Konsole",
        "700 bucks",
        "13%",
        "Unisoc Tiger",
        "six",
        "the Magic Keyboard",
        "Apple",
        "60-day",
        "1.8",
        "half",
        "UFS",
        "JingLing International",
        "Thunderbird",
        "the Galaxy Tab",
        "100%",
        "5.0",
        "60",
        "GIMP",
        "16-megapixel",
        "Kate",
        "Jono",
        "microSD",
        "Valheim",
        "daily",
        "Galileo",
        "four",
        "11-inch 2K+",
        "K.",
        "the iPad Air",
        "8,000 milliamp-hour",
        "Magic Keyboard",
        "like 50%",
        "50",
        "5"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "NORP",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "GPE",
        "LOC",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "FAC",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERCENT",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.11292703449726105,
        -0.06600376963615417,
        0.023252112790942192,
        -0.1166970282793045,
        0.06292060017585754,
        0.028379464522004128,
        -0.005138383712619543,
        0.03785594552755356,
        0.027912084013223648,
        0.033164165914058685,
        0.07075463980436325,
        0.023763801902532578,
        -0.012194533832371235,
        -0.01611349917948246,
        0.0756460502743721,
        -0.025031767785549164,
        0.007853042334318161,
        -0.0471670888364315,
        -0.035900067538022995,
        -0.02609299309551716,
        -0.010745060630142689,
        0.03409910947084427,
        0.050821542739868164,
        -0.07398229837417603,
        0.053330160677433014,
        -0.07552888244390488,
        -0.026966243982315063,
        -0.02477768249809742,
        0.010961271822452545,
        0.013256600126624107,
        -0.02420659549534321,
        0.05344339832663536,
        0.004166904371231794,
        0.0311256255954504,
        -0.08050184696912766,
        -0.0841703712940216,
        -0.004935492295771837,
        -0.0612136572599411,
        -0.025503000244498253,
        -0.0701875314116478,
        -0.02930479682981968,
        -0.026150058954954147,
        -0.032558880746364594,
        0.019271252676844597,
        0.01361776515841484,
        -0.011696137487888336,
        0.023195834830403328,
        0.032488539814949036,
        0.04895375669002533,
        0.0937962457537651,
        -0.033875152468681335,
        -0.012352350167930126,
        0.021109415218234062,
        -0.06031142175197601,
        -0.07009674608707428,
        -0.01132050808519125,
        0.004046096932142973,
        -0.012308916077017784,
        0.0895366445183754,
        0.0016934978775680065,
        0.006724019534885883,
        -0.09679645299911499,
        0.01286674477159977,
        0.07233822345733643,
        0.009592085145413876,
        0.006403807550668716,
        -0.004002201370894909,
        -0.017406225204467773,
        -0.024330107495188713,
        -0.05404484272003174,
        -0.03408876433968544,
        -0.032231058925390244,
        0.09676743298768997,
        0.05145062878727913,
        -0.0662587508559227,
        0.04700456187129021,
        0.07451364398002625,
        0.04264184087514877,
        0.04818060249090195,
        0.01902792602777481,
        0.006078524515032768,
        0.027742864564061165,
        0.00099688651971519,
        -0.007426855154335499,
        0.012344160117208958,
        -0.034365031868219376,
        -0.010296340100467205,
        0.06426987797021866,
        -0.025739405304193497,
        -0.023335937410593033,
        0.02525288425385952,
        0.09528379887342453,
        0.029897233471274376,
        0.013427636586129665,
        -0.01547068078070879,
        -0.025556722655892372,
        0.06735430657863617,
        0.003769363509491086,
        -0.11774513870477676,
        0.06416698545217514,
        -0.004320984706282616,
        0.10412676632404327,
        0.05708523094654083,
        -0.017180537804961205,
        -0.08095689862966537,
        -0.08165965974330902,
        0.034532200545072556,
        -0.039755336940288544,
        0.02165546454489231,
        0.013184843584895134,
        0.028886964544653893,
        -0.05946464091539383,
        -0.09367004781961441,
        -0.05456877499818802,
        0.0018838209798559546,
        0.01571502350270748,
        -0.06668825447559357,
        0.026396529749035835,
        0.08439399302005768,
        -0.008551269769668579,
        -0.04119075834751129,
        0.059318553656339645,
        -0.07255451381206512,
        -0.09339338541030884,
        -0.027484755963087082,
        0.09644213318824768,
        -0.06547947227954865,
        2.4919376374768676e-33,
        -0.03707261383533478,
        0.10801924765110016,
        -0.04304630309343338,
        -0.06560520827770233,
        0.003623387310653925,
        -0.027515001595020294,
        -0.0018914903048425913,
        0.05868849530816078,
        -0.0001183414351544343,
        0.009996370412409306,
        -0.03599720820784569,
        0.011128520593047142,
        -0.12479779869318008,
        -0.03461982309818268,
        0.002221692819148302,
        -0.04553815722465515,
        -0.04225074127316475,
        -0.04709169268608093,
        0.03129219636321068,
        0.04587513208389282,
        0.015665113925933838,
        -0.04272034391760826,
        0.02460751123726368,
        -0.030542097985744476,
        -0.006612536963075399,
        -0.038404811173677444,
        0.003438184969127178,
        -0.022036239504814148,
        0.05189340189099312,
        0.0316382460296154,
        -0.08414080739021301,
        -0.05456060171127319,
        -0.05023661255836487,
        -0.13695146143436432,
        -0.050574250519275665,
        -0.12106452137231827,
        -0.05751045420765877,
        -0.07982035726308823,
        0.1027107834815979,
        -0.0020095149520784616,
        -0.12141571193933487,
        -0.009995101019740105,
        -0.060100045055150986,
        -0.0056070308201014996,
        0.024058444425463676,
        -0.003999835811555386,
        0.024778785184025764,
        0.04891796037554741,
        0.08550222963094711,
        0.000398224510718137,
        -0.10210317373275757,
        -0.03394104540348053,
        -0.021884530782699585,
        -0.07342508435249329,
        -0.034020114690065384,
        -0.08029448986053467,
        -0.062256090342998505,
        -0.0033111339434981346,
        0.011928328312933445,
        0.02351578325033188,
        -0.0058974614366889,
        -0.01349398959428072,
        -0.014670561999082565,
        0.039537105709314346,
        -0.1345480978488922,
        0.01941465213894844,
        0.053641460835933685,
        -0.02316756546497345,
        -0.07042798399925232,
        -0.01632235199213028,
        0.03369658812880516,
        -0.003919312264770269,
        0.05618739128112793,
        -0.03841884434223175,
        -0.032268207520246506,
        -0.007753849495202303,
        0.009494095109403133,
        -0.02927056886255741,
        -0.01058655884116888,
        -0.03477046638727188,
        -0.046082835644483566,
        0.042789775878190994,
        0.03127514198422432,
        0.0758260115981102,
        -0.051716148853302,
        0.04409721493721008,
        0.022716211155056953,
        -0.030177099630236626,
        -0.02646741457283497,
        -0.0050632948987185955,
        -0.026957575231790543,
        0.03624499961733818,
        -0.024425849318504333,
        0.03448934108018875,
        0.04958655685186386,
        -3.682291522590495e-33,
        -0.049975670874118805,
        -0.014488721266388893,
        -0.09500648081302643,
        -0.04777088761329651,
        -0.024057211354374886,
        0.001187141053378582,
        0.0781523659825325,
        0.041089072823524475,
        0.004518304485827684,
        -0.05540039762854576,
        -0.036513976752758026,
        0.09245903789997101,
        0.02366853877902031,
        -0.07208248227834702,
        0.008068624883890152,
        -0.036749448627233505,
        0.0025558723136782646,
        -0.08374424278736115,
        0.0244024358689785,
        -0.07912037521600723,
        0.06378661096096039,
        0.023745421320199966,
        0.10245231539011002,
        0.05608810856938362,
        0.06256305426359177,
        -0.013122916221618652,
        0.023139121010899544,
        0.06367077678442001,
        0.004412055015563965,
        0.07717996835708618,
        0.08709147572517395,
        -0.021183500066399574,
        -0.0014357372419908643,
        0.07415560632944107,
        0.08741637319326401,
        -0.019219113513827324,
        0.04510277137160301,
        0.021833231672644615,
        -0.03571721166372299,
        -0.03537384048104286,
        0.0701194703578949,
        -0.03441856801509857,
        0.010287389159202576,
        -0.009146369993686676,
        0.07031930238008499,
        0.0010085450485348701,
        -0.02897484600543976,
        -0.005465385038405657,
        -0.01010817289352417,
        -0.02965720184147358,
        -0.011049390770494938,
        0.03597462177276611,
        -0.018344324082136154,
        -0.02771313115954399,
        -0.046737801283597946,
        0.00815539713948965,
        0.03375716507434845,
        0.007287928834557533,
        -0.06612180918455124,
        -0.0453946590423584,
        0.006009066477417946,
        0.014174779877066612,
        0.01536700688302517,
        0.013969861902296543,
        0.006430916488170624,
        -0.0062852646224200726,
        0.05970683693885803,
        0.09137201309204102,
        0.03703657537698746,
        0.0913146361708641,
        -0.002159268595278263,
        -0.021479841321706772,
        0.004686826840043068,
        -0.05417240783572197,
        0.0006601664354093373,
        0.1912761926651001,
        0.02317042462527752,
        -0.027370424941182137,
        -0.056051962077617645,
        -0.08116097003221512,
        -0.006951900664716959,
        0.10734647512435913,
        0.07063973695039749,
        -0.0008999919518828392,
        0.009483201429247856,
        0.0005717788590118289,
        0.06482497602701187,
        -0.04639192670583725,
        -0.02692384459078312,
        0.0577201321721077,
        -0.049860741943120956,
        -0.06676238775253296,
        -0.06735756248235703,
        0.05306999385356903,
        0.01030566543340683,
        -5.525418345087019e-08,
        0.00032660423312336206,
        0.07676326483488083,
        0.08004778623580933,
        0.006412087008357048,
        -0.024395905435085297,
        -0.07926646620035172,
        0.045296601951122284,
        -0.023899797350168228,
        0.15180470049381256,
        0.03023502044379711,
        -0.02943427674472332,
        -0.09900666773319244,
        0.0042628091759979725,
        0.08448881655931473,
        0.02080322802066803,
        0.07762318849563599,
        -0.006745326332747936,
        0.06704583019018173,
        -0.04098246246576309,
        -0.08092337846755981,
        -0.022484764456748962,
        0.014326001517474651,
        0.018940186128020287,
        -0.04806690290570259,
        0.0036651738919317722,
        0.009001686237752438,
        -0.037440042942762375,
        0.02679259330034256,
        0.05257394537329674,
        -0.014006389304995537,
        -0.09875195473432541,
        -0.06900185346603394,
        0.03146815299987793,
        -0.011113759130239487,
        0.028719503432512283,
        -0.0818478912115097,
        -0.020973321050405502,
        -0.0036936879623681307,
        9.626020619180053e-05,
        0.026171155273914337,
        -0.01141784992069006,
        -0.046009112149477005,
        0.0031800982542335987,
        -0.027205228805541992,
        0.03213757276535034,
        -0.02309298701584339,
        -0.03923500329256058,
        -0.018950795754790306,
        0.11185025423765182,
        0.11207766085863113,
        0.0386669784784317,
        -0.0027207285165786743,
        0.018920084461569786,
        0.01885097473859787,
        -0.005980051122605801,
        -0.022410301491618156,
        -0.042874716222286224,
        0.016670050099492073,
        0.007413396146148443,
        0.05996032804250717,
        0.07162340730428696,
        -0.061562784016132355,
        -0.01114752609282732,
        0.08119874447584152
    ]
}