{
    "id": "P0Qc1nl8VkE",
    "title": "Did Samsung Ruin the Galaxy S21?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-01-08T21:10:05Z",
    "video_url": "https://www.youtube.com/watch?v=P0Qc1nl8VkE",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers"
    ],
    "views": 55385,
    "likes": 2807,
    "comments_count": 463,
    "description": "If these Galaxy S21 rumors are true... Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is. Samsung are on the cusp of releasing their brand new Galaxy S21 line up of phones. The previous flagship, however, this year, well, okay. They're been a lot of leaks, a lot of rumors, as usual when it comes to new Samsung launches. And there are a few things that we need to talk about because I am, I don't wanna say disappointed because we haven't seen it yet. But there are some things that are very concerning about this phone to me. - I, yeah and I mean, we've seen leaks for months at this point. And the design looks cool. - Yes, absolutely. - Let's get the positives out of the way. - Yeah, let's get the positives before we clickbait you with our horrible news that's coming in seven minutes of your attention. So the design, I will agree it looks nice, the color scheme-- - I think it's the best it's looked in, might maybe ever, I, in me personally, as far as the S line. - The camera bump actually looks like it is designed and not just something that they slapped on. They now will apparently have flat fronts as opposed to curve, which I'm a big fan of. Now, one thing that I'm a little bit on the fence about is the materials. So supposedly at least the base model, Galaxy S21, will be plastic back instead of glass. Now I will say, I'm not totally against this. I mean, usually you think plastic and cheap. However, what they've done with stuff like the Note 20 and the Galaxy, the FE, was fine, it actually feels different and you're not gonna crack it. - [Matt] It feels different, yeah, like the, I think that that's the biggest thing is if you drop it, you're not gonna crack the back of it. I mean, - Oh yeah, it would be much harder to crack the plastic. - Right, the front of it's still glass and, you know, glass breaks, but. - Yeah, but I mean, I don't want a plastic screen, please don't do that. Okay, design fine. - And then with design, I think that's really the where are the positives end. - No, there's more than that. - What, what's, what is the problem? - So according to the rumors, we have three models of the S21, just like last year. - Okay. - So these standard S21, the S21 Plus and the S21 Ultra, all of which seemed to be roughly the same sort of like form factor and size. So unfortunately, we're not getting any kind of like S21 Mini, most likely, compared to something like the iPhone, which, look, if you remember, (mumbling) If you remember the S10e, the S10e was something that Samsung were kinda ahead of the game on. But evidently it must've not have sold very well because they stopped making it. And then instead they've replaced that, their sort of $700 flagship link range with the FE. So, a lot of things look very similar. Cameras are also supposedly similar. Now this is where there's a little bit more-- - Similar, but it is a step backwards. - [Jess] Sort of, so the camera modules on the S21 and the S21 Plus seemed to be very similar. There's a time of flight sensor that may be missing. - [Matt] Maybe. - [Jess] That was on the Plus. - [Matt] Yeah, again, this is all rumors. - Yeah. - We'll know more next week, when they talk about it. But, it's so reportedly the time of flight sensor that was on the S20 is no longer on the S21. And the main telephoto shooter is, - Slightly different, but not necessarily worse, just different as far as I know. - [Matt] No, it's just slightly smaller a sensor. - [Jess] Oh, is it? - So you are gonna lose. So, the selfie camera and the telephoto, I mean, the ultra-wide, those are - The same - Reportedly identity, supposedly identical. However, the telephoto one is a very slightly smaller sensor size, which means you're gonna lose some depth of field. You're gonna lose some low light performance. It's probably not gonna be, super noticeable. It's one thing to have like a slightly wider open aperture, or a slightly, you know, sharper lens. But, having the bigger sensor I think is - Always good. - It goes a long way. - It's had to say, and there are certainly some bigger changes in store for the S21 Ultra. That's a little bit of a different subject because the Ultra actually, doesn't actually have as many of the compromises as the base as S21 and the S21 Plus. So here's where things take a turn for the worst. A turn for the nefarious, some might say. So, in some ways the S21 is a downgrade. First and foremost, - Yep. - What everyone is upset about right now is the screen. Now Samsung have traditionally made excellent quality screens. They make screens for many iPhones. Obviously the OLEDs are top notch, right? However, this is poised to be the first Samsung S line flagship, since I think like 2015, - [Matt] Ish, yeah. - [Jess] That does not have a 1440p display. That is a very odd sentence. That this would be a downgrade in some ways, compared to a 2015 Galaxy like what, S6? - We watched Dave2D's video. - Yes, Dave did an excellent video on this. - Yeah, you should-- - Absolutely go check that out. - He thinks he's in, that Samsung is somewhat intentionally sidelining the S line to make room for the Note, oh, not the Note. - No, not the Note, the Z Flip. - The Z flip, the Z Fold. I have a different theory. - Yes, go ahead. - Which is, my theory is much more nefarious. - Okay, let's not out nefarious Dave here. - And I think, and this is, I, I'm fully aware that I'm gonna come off as super Apple fan boy right now. But. - Oh, this is a good start. I like where this is going. - Yeah, I'm ready for the comments on this. But I fully think that right now, Samsung, with the knowledge that if, if there's an Android user, they're not, they're probably not gonna go to Apple. - Sure, there's like a relatively safe assumption. - They're taking that knowledge and pushing the limits of what they can get away with. And they're becoming the new Apple. So, imagine if Apple did this, imagine that they said, \"Okay, we're gonna take the processor, and we're gonna give you a weaker processor. Or we're gonna give you a weaker camera.\" - Imagine that we go, the iPhone 14 has an iPhone 11 screen, right? Now, to be fair, there are some caveats to this thing. So, the rumor is currently stating that the standard S21 and the S21 Plus will have a 1080p 120 Hertz OLED. Now, to be fair, I guarantee you Samsung in their giant R and D department have all the data that most people probably run their phones at 1080p 60 and never even think about it, right? - So, for context, 'cause like you're saying, no one ever thinks about it. As much as they have those 1440p phones, they do not ship with 1440p high refresh rate enabled. - So one of the downsides of the S20, it incorporates 120 Hertz displays, but you can't run it at the full resolution. You have to pick either 1440p at 60, or 1080p at 120. Personally, I would always go 1080p 120. But that's like, that was a weird thing that they left out last year. And instead of fixing it and giving you 1440p at 120, something like OnePlus as have been able to do very easily, instead they go, \"Hey, guess what? No, this screen is now going to be lower resolution.\" So here's the thing. So right now we do not know what these will cost. If they are roughly in the same ballpark, of about $1,000 for the S21 and up from there, that would be, an obscene amount of money for a phone that is a 1080p 60. Now, yes, I know that the iPhones have 1080p or actually slightly like 1200p - Okay. - 60 Hertz displays. - So it does have 120, and 60 Hertz, but I guarantee you, it's going to be, - Oh, that's fine. - At 60. - But you can flip it on. Supposedly, it will be $1,000. Here's where I have a problem. - [Matt] 1050. 1050. - [Jess] We'll see, - So, if that leak is true, it's $50 more. - I'm gonna assume it's gonna be the same. The materials, up to you. I would say plastic to glass, not a huge downgrade. But potentially, a slightly less complete package on the camera side with the time of flight sensor. But most importantly, they're cutting back on the screen. Now look, did I use 1440p before? Not really, but I think that's almost besides the point. If you're charging the same, if not more, for a phone and you were removing features, like, I mean, obviously we've had this kind of conversation with like, okay, we lose the headphone jack because we need more space for battery or whatever. We lose, like the charger, because it's more environmentally friendly or more friendly to our profits. But to literally downgrade the resolution of your screen that you've had for years now, I get like, it's a principle thing for me. I will, I'm fine running at 1080p 120, like that's okay, right? My Z Flip has a 1080p screen. But I never had a 1440 and you removed it and you're charging me the same, if not more. That's where I get really upset with what they're doing. Of course, leaks, rumors, grain of salt alert, et cetera. - All of this won't matter when come out to next week and the say, \"It's actually a 4K,\" - 699. - A 4K, you know, 240 Hertz screen for $500. - Yeah. - You know? - And, to be fair, - (mumbles) awards then, but-- - A lot of this doesn't apply to the S21 Ultra, which supposedly does have 1440p and likely 120. Although it's not clear if you can do both of those at the same time. The Ultra does seem like it sort of steps away from this. I'm talking about the S21 and the S21 Plus. But I do think Dave has a point. You really should check out his video. He did a great job of sort of articulating this. I think Samsung are really focusing on their foldable market because think about it, right? Samsung are in a very crowded market, right? A lot of companies make excellent Android phones. And before, Samsung was kind of the default because they had the sort of best all around phones, I would still argue in a lot of cases, Samsung do may kind of some of the most well-rounded Android devices. But they don't have a clear lead. And when you look at what they have been able to do successfully, they've been able to push up the price of their very high end phones, not by giving you flagships and Ultras and everything, but by selling the Z Flip, by selling the Z Fold, by selling these foldable phones, which Samsung are legitimately years ahead of anyone else. And I guess my main thought here is that we are, again, very close to the launch. So we will know all the information we need about the S21 very shortly, right? What I'm seeing right now makes me not confident that this is gonna be a killer phone. Because, last year the was great, right? Typically the S line of phones are the some of the easiest to recommend. They have long lifespans. They have the brand new processors. Like, they have everything you really want. And usually they are just kind of pretty decently, right? But the S12, in a lot of ways, seems like it's a downgrade. And, I don't know about that, I just don't know. - I'll be honest, I'm fine if it was a downgrade, if they go ahead and downgrade the price. - You can't remove features and charge more and have no real justification for what you're doing. Like why did you not, at least give me a 1440p display when you shipped it on so many devices for so many years? Like just why do you got to remove that? If they lower the price? Now all of this is where the huge caveat. - Yeah. - If they lower the price, to be closer to be competitive with the iPhone 12. - If they come back and say this is 700 bucks, - That's fine. - every one of my arguments, I'm fine. - This is assuming it's 1,000. - We have rumored leaks, which we're, is what we're basing our anger on right now. That - The rest of the internet. - Yeah. So like, again, if they lower the price to be competitive with an iPhone, you know, seven, 800 bucks, great, then I'm fine. I honestly, I'm fine with it 'cause the trade-offs are minimal enough for me to, if it's 200, 300 bucks, for a slightly lower resolution screen, I'm all for that. - Yeah. - But, if you're gonna have the same price or even slightly higher, if the rumors are true, that's messed up. 'Cause we didn't even talk about his lower RAM. - Oh yeah, potentially. So it looks like it may have eight gigs of RAM. - Eight gigs of RAM versus 12. - Yeah. - Which, I don't think you need more than eight. - That's another weird thing for them to remove. - If it's there and then it's not there anymore, that's weird, like it's weird and why like it, again, why is the price not different? So I know that we're kind of ranting about stuff that we don't fully know, but with how detailed these leaks have been, - [Jess] Yeah. - We can take this with a, you know, a somewhat educated guess. - I'm very curious. What do you think about the Galaxy S21 this year? And what do you think about Matt's horrible slander of your impeccable technology, technological knowledge? Let us know in the comments below. Make sure to ring-a-ding, the ding-a-ling bell. Subscribe to This Is, for more angry rants and mildly coherent sentences. And until next time, hopefully we have an update when Samsung actually released this stuff. And it's awesome and great, right?",
    "transcript_keywords": [
        "Samsung",
        "yeah",
        "Slightly",
        "screen",
        "thing",
        "fine",
        "phones",
        "Galaxy",
        "Ultra",
        "Hertz",
        "lot",
        "downgrade",
        "kind",
        "price",
        "Flip",
        "sensor",
        "sort",
        "Note",
        "lower",
        "Apple"
    ],
    "transcript_entity_values": [
        "2015",
        "1080p 120",
        "last year",
        "the Galaxy S21",
        "about $1,000",
        "Android",
        "one",
        "S21",
        "Apple",
        "1050",
        "iPhones",
        "300 bucks",
        "three",
        "699",
        "1440",
        "S21",
        "seven minutes",
        "the S21 Ultra",
        "60",
        "120",
        "700 bucks",
        "eight",
        "more than eight",
        "60",
        "120",
        "Matt",
        "S6",
        "months",
        "years",
        "S21 Mini",
        "1080p 60",
        "20",
        "50",
        "Hertz",
        "Eight",
        "the S21 Plus",
        "1080p 60",
        "Samsung",
        "S12",
        "Galaxy S21",
        "Dave",
        "Galaxy",
        "jack",
        "Ultras",
        "12",
        "1,000",
        "800 bucks",
        "Jess",
        "4",
        "so many years",
        "1080p",
        "this year",
        "700",
        "next week",
        "the Z Fold",
        "S10e",
        "FE",
        "Matt] Ish",
        "240",
        "S20",
        "first",
        "iPhone",
        "1,000",
        "Ultra",
        "500",
        "RAM",
        "seven",
        "S10e",
        "1080p 120",
        "First",
        "200",
        "OnePlus"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.16607536375522614,
        0.05227569863200188,
        0.11881870031356812,
        -0.045037802308797836,
        0.02791007049381733,
        0.019891640171408653,
        0.03985309973359108,
        0.05587140470743179,
        0.017997385933995247,
        -0.017998473718762398,
        0.018241003155708313,
        0.06666161119937897,
        0.09481731057167053,
        -0.04233970120549202,
        -0.008903314359486103,
        -0.08577489852905273,
        0.011589239351451397,
        -0.12558327615261078,
        -0.06805826723575592,
        -0.007160009816288948,
        -0.025487905368208885,
        0.043329305946826935,
        -0.009269258938729763,
        0.0378253236413002,
        0.007662020158022642,
        0.014302216470241547,
        0.0022645657882094383,
        -0.07951498031616211,
        0.007268700283020735,
        -0.06650909036397934,
        0.08288656920194626,
        0.10661652684211731,
        0.042203400284051895,
        0.008063304238021374,
        -0.0006464033504016697,
        -0.14369617402553558,
        0.06030027195811272,
        -0.0033227838575839996,
        0.0044172462075948715,
        0.004053560551255941,
        -0.046092212200164795,
        -0.028679201379418373,
        -0.010807337239384651,
        0.040680695325136185,
        0.003909103572368622,
        -0.037574075162410736,
        0.09688425064086914,
        -0.05425358563661575,
        -0.05353766307234764,
        -0.031823720782995224,
        0.009093918837606907,
        -0.0657135620713234,
        0.07202599197626114,
        -0.04449246823787689,
        0.0007439603214152157,
        0.03449887037277222,
        -0.025063330307602882,
        -0.059286851435899734,
        0.08059941232204437,
        0.007895005866885185,
        0.11153831332921982,
        -0.09012878686189651,
        -0.005061191041022539,
        0.03933602198958397,
        0.013880996033549309,
        -0.041332341730594635,
        0.03115653246641159,
        -0.05826595053076744,
        0.05115150660276413,
        0.001356213935650885,
        0.04715752229094505,
        0.0010825321078300476,
        0.04495137929916382,
        0.03138442710042,
        -0.06331877410411835,
        0.09410515427589417,
        0.08632618188858032,
        0.013028587214648724,
        -0.030976254492998123,
        -0.03143982216715813,
        0.08877897262573242,
        -0.08820769935846329,
        -0.028453245759010315,
        0.007430972531437874,
        0.010100292041897774,
        -0.00813826359808445,
        0.003354884684085846,
        -0.02018596976995468,
        -0.034649547189474106,
        0.031674809753894806,
        -0.027112776413559914,
        0.06551988422870636,
        -0.03654790297150612,
        -0.0008244193741120398,
        -0.03296516835689545,
        0.019136305898427963,
        -0.07304521650075912,
        -0.04131485894322395,
        0.01718146540224552,
        0.03611539304256439,
        0.0400550402700901,
        0.09702527523040771,
        0.09947800636291504,
        -0.054565079510211945,
        0.011490989476442337,
        -0.05064736306667328,
        -0.01789971999824047,
        0.05280141159892082,
        0.031114010140299797,
        0.05626976490020752,
        0.02997984178364277,
        0.02988622896373272,
        -0.012827473692595959,
        0.028466152027249336,
        -0.029851751402020454,
        0.0020509755704551935,
        -0.060466621071100235,
        0.04531056061387062,
        0.006268449127674103,
        0.030328985303640366,
        0.0072318874299526215,
        -0.03132883459329605,
        -0.10472310334444046,
        -0.06501170992851257,
        -0.009126882068812847,
        -0.013523365370929241,
        -0.04268192872405052,
        -6.762068446481153e-34,
        0.0660896748304367,
        0.10903910547494888,
        -0.07252993434667587,
        0.041459523141384125,
        0.05098718777298927,
        0.027619894593954086,
        0.004119301214814186,
        -0.018837573006749153,
        -0.07984226197004318,
        0.0020043328404426575,
        -0.010975269600749016,
        0.004948714282363653,
        -0.11228034645318985,
        0.030026791617274284,
        -0.02302088402211666,
        -0.05648701265454292,
        -0.01813933253288269,
        -0.08228112757205963,
        -0.0555708110332489,
        -0.014883345924317837,
        0.05165731906890869,
        0.021319327875971794,
        0.001962849637493491,
        -0.09290168434381485,
        0.0539526641368866,
        -0.020952418446540833,
        0.07239363342523575,
        0.04939356446266174,
        0.0185254979878664,
        0.02140173874795437,
        -0.11759146302938461,
        0.052826184779405594,
        0.06437624245882034,
        0.02456817962229252,
        -0.04483210667967796,
        -0.048678893595933914,
        0.015424005687236786,
        -0.08456791937351227,
        0.08475521206855774,
        0.015364660881459713,
        -0.04978909716010094,
        0.07156926393508911,
        -0.10704006254673004,
        0.06414693593978882,
        0.007036031223833561,
        0.05965932086110115,
        0.026332225650548935,
        -0.01688535511493683,
        -0.0467597059905529,
        -0.021422218531370163,
        -0.023660270497202873,
        -0.03515694662928581,
        -0.017825722694396973,
        0.036879152059555054,
        -0.013710873201489449,
        0.03282969444990158,
        -0.03144345432519913,
        -0.0454544834792614,
        0.046605296432971954,
        0.0629240944981575,
        0.05448151379823685,
        0.053487543016672134,
        -0.04489187151193619,
        0.029724886640906334,
        -0.029441166669130325,
        0.046147704124450684,
        0.030159493908286095,
        0.013512597419321537,
        -0.06808365881443024,
        0.020264340564608574,
        -0.04588060453534126,
        -0.03828191012144089,
        -0.04136465862393379,
        0.0006783190183341503,
        0.008349183946847916,
        -0.0802883431315422,
        -0.0035437210462987423,
        -0.030035514384508133,
        0.07375927269458771,
        -0.023222239688038826,
        0.04587957635521889,
        -0.04086025059223175,
        0.05391582474112511,
        0.013676192611455917,
        -0.06227783113718033,
        -0.03296602889895439,
        0.025199424475431442,
        -0.07335075736045837,
        0.01000160165131092,
        0.02070716768503189,
        -0.028970977291464806,
        -0.04887579008936882,
        0.053945526480674744,
        0.010693483054637909,
        -0.04071073234081268,
        -2.4595213603720276e-33,
        -0.05625160411000252,
        0.02654082328081131,
        -0.04847647622227669,
        -0.037301383912563324,
        -0.025766458362340927,
        -0.02670506201684475,
        0.04535706341266632,
        0.1315220594406128,
        -0.03333146870136261,
        -0.014537996612489223,
        0.036113440990448,
        0.05082166567444801,
        -0.10089032351970673,
        -0.034602612257003784,
        -0.03715969994664192,
        -0.05621135234832764,
        0.11644792556762695,
        -0.06301983445882797,
        -0.05938488245010376,
        -0.042319826781749725,
        -0.01354058925062418,
        0.030838128179311752,
        -0.07117830961942673,
        0.0199456624686718,
        -0.013893692754209042,
        0.052114974707365036,
        0.018196387216448784,
        0.027869924902915955,
        -0.022749831900000572,
        0.008565805852413177,
        0.02072632871568203,
        -0.034207943826913834,
        0.033563412725925446,
        0.028583521023392677,
        0.014187600463628769,
        0.02018551155924797,
        0.05788029357790947,
        -0.03407116234302521,
        0.026134807616472244,
        -0.060926612466573715,
        0.05662994831800461,
        -0.027509048581123352,
        -0.008880247361958027,
        -0.02584041655063629,
        0.017232608050107956,
        -0.034866973757743835,
        0.019385356456041336,
        0.028634710237383842,
        -0.015989061444997787,
        -0.07343927025794983,
        0.02187066152691841,
        0.017152201384305954,
        0.0015549453673884273,
        0.052365440875291824,
        -0.023866208270192146,
        -0.06902467459440231,
        0.017308298498392105,
        -0.002634181408211589,
        0.04155450314283371,
        0.04658951610326767,
        0.08380954712629318,
        0.034417036920785904,
        -0.0995832309126854,
        -0.10576637089252472,
        -0.029930438846349716,
        -0.09011051058769226,
        0.026700161397457123,
        -0.046133533120155334,
        0.07962082326412201,
        0.020715270191431046,
        0.0111117884516716,
        -0.05706736072897911,
        -0.14356787502765656,
        -0.058056581765413284,
        0.05366349220275879,
        0.050187837332487106,
        -0.07120458781719208,
        -0.03996582329273224,
        -0.04000629484653473,
        -0.030767742544412613,
        0.045371703803539276,
        0.04271791875362396,
        0.02713197097182274,
        -0.03706105798482895,
        0.14461073279380798,
        0.02814299799501896,
        -0.028834538534283638,
        -0.048363689333200455,
        -0.044683340936899185,
        0.030150292441248894,
        -0.11124972254037857,
        -0.01846144162118435,
        -0.06788028031587601,
        0.08757223933935165,
        0.022503161802887917,
        -5.148678283717345e-08,
        0.0566122941672802,
        -0.008291298523545265,
        0.025374971330165863,
        -0.0029404989909380674,
        0.05041060969233513,
        -0.0585128590464592,
        0.0007859328179620206,
        0.041689176112413406,
        0.07305722683668137,
        -0.015595043078064919,
        -0.03676154837012291,
        -0.06617597490549088,
        -0.06446454674005508,
        -0.007851694710552692,
        -0.012863830663263798,
        0.08497358858585358,
        -0.0418856255710125,
        0.017423372715711594,
        -0.035584669560194016,
        0.01617470383644104,
        0.01607050746679306,
        0.07870127260684967,
        -0.015069042332470417,
        -0.028575075790286064,
        0.040587395429611206,
        -0.015605929307639599,
        -0.009357395581901073,
        0.04336594045162201,
        0.009772628545761108,
        0.010337317362427711,
        -0.030827628448605537,
        -0.11110468208789825,
        -0.009160535410046577,
        0.06437733769416809,
        -0.01524142175912857,
        -0.0355178564786911,
        0.06088021770119667,
        -0.0264604315161705,
        0.11946361511945724,
        -0.0005251370603218675,
        0.007737481500953436,
        -0.011480027809739113,
        0.0027245620731264353,
        0.038566719740629196,
        -0.004474208690226078,
        -0.05610284209251404,
        0.022391796112060547,
        -0.022179344668984413,
        -0.046365972608327866,
        0.059275295585393906,
        -0.05639020353555679,
        -0.050108686089515686,
        -0.07333629578351974,
        0.024803098291158676,
        0.02449842356145382,
        -0.059651073068380356,
        -0.008402470499277115,
        0.0488460436463356,
        -0.010500319302082062,
        0.041766609996557236,
        0.06229756772518158,
        -0.10195214301347733,
        -0.02738363854587078,
        0.052181538194417953
    ]
}