{
    "id": "P0r9wR-Z2dc",
    "title": "The Best $200 Laptop?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-03-11T15:18:11Z",
    "video_url": "https://www.youtube.com/watch?v=P0r9wR-Z2dc",
    "category": "Science & Technology",
    "tags": [
        "laptop",
        "notebook",
        "best laptop",
        "best cheap laptop",
        "budget laptop",
        "best budget laptop",
        "chromebook",
        "used laptop",
        "budget",
        "cheap",
        "unboxing",
        "review",
        "cheap laptops",
        "hp",
        "samsung",
        "best chromebook",
        "best laptop under 500",
        "austin evans"
    ],
    "views": 1709025,
    "likes": 32271,
    "comments_count": 3313,
    "description": "For $200 how does a new vs used Windows 10 laptop compared to a Chromebook? Used HP EliteBook on Amazon:  Samsung Chromebook 3 on Amazon:  HP Stream 14 on Amazon:  5 Reasons to Buy a $188 Laptop:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://austin.tech/elitebook",
        "http://austin.tech/chromebook3",
        "http://austin.tech/stream14",
        "https://www.youtube.com/watch?v=pi2Ri9-K3_E",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. This the $188 HP Stream. So when I did the video on this recently, I was impressed with just how much laptop you're able to get for that kind of price. However, lots of you guys commented some other options for around $200 on the laptop side. One of the main things people suggested was to pick up a Chromebook. And you can see that there's a lot of appeal here. What you're getting is a very cheap computer that while it's going to be lightweight, it's only running ChromeOS. That's actually not going to be a big problem. However, even more people suggested to pick up a used laptop so that is where I found this HP Elitebook. Which, you know, it's a couple of years old. Still comes in at around $200. Ever since Chromebooks were first announced, they've actually kind of been pretty much the same thing. So what you're getting here is a very very basic laptop. However, when you're just needing to run a web browser, that kind of actually works out okay. Especially considering just how cheap it is and especially how easy it is to set up. Stuff like schools and different like places that are kind of constantly going through hardware actually really do get a big advantage out of using a Chromebook. So this is a fairly small laptop. With an 11.6 inch display. So I will say it actually does feel reasonably well built, even though it is all going to be plastic. And if we open it up. We'll see lots and lots more plastic inside. The design is about as safe as it gets. So, to be fair, Chromebooks actually do have a lot of the basics figured out. So the keyboards are pretty much always fine, the track pads are pretty decent. The screens are going to be kind of mediocre. But you're going to be getting decent WiFi as well as just enough ports for, well, whatever you're gonna do on a Chromebook. What you're getting here is a stripped down operating system that is entirely built around Chrome. Now for a lot of people you can't do most things inside the browser. However. There are also some other options that happen to run full Windows. When you get into the world of used laptops, there are options absolutely everywhere. And they try to keep things at least somewhat even, I went on Amazon and tried to find something that was going to be refurbished. At least you get some kind of warranty and you know it's not going to be completely beat up or whatever. At least, I hope it won't be super beat up and terrible in the box. Oh, well, okay. That's quite the unboxing experience. We get the giant old school power cable. There's also a laptop and this giant cardboard thing. Whoa that's actually really heavy. As you can see, things have definitely evolved in the last few years. And you're $200 laptop is much, much thinner and lighter than it used to be. There are advantages to using something a little bit older, thought, including a ton of ports. So in addition to a full DVD drive, we also have an SD card reader. A pair of USB 3.0 ports, we got fire wire. Around back you're going to be getting VGA, a modem, Ethernet, and is you flip it over to the other side, we're getting a full sized display port, another USB port, as well as eSATA, and you're headphone and microphone jacks. So you know, don't complain about your single port MacBook anymore. This guy for 200 bucks has you covered. You also have the magical experience of being able to remove your batteries. When inevitably you're old laptop has a terrible 35 minute battery life. It's easy to just grab another one off eBay and throw it in. They're definitely advantages in going with a little bit of an older design. But what I'm curious about is one of the trade offs. Is this really going to be your best option for $200? When it comes to the Chromebook 3, use it for about 30 seconds and you will immediately appreciate just how small and lightweight it is. It's just over a kilogram, or about 2.5 pounds. It's so lightweight it kind of feel likes a toy. However, with the exception of the bezzles which are shiny and look a little bit cheap, it actually is reasonably well built. Take a look at the screen. And you'll see it's rocking and 11.6 inch 1266x769 panel. And while it's not incredibly sharp, it's going to be totally usable for something especially at this price point. I'm kind of impressed with how bright the screen gets. A lot of the time when it comes to a budget laptop, the screens are a little bit on the dim side. But it's actually pretty impressive here. Although it's not impressive at a viewing angles, but I mean, for less than 190 bucks, what do you expect? The biggest consideration when you're picking up a Chromebook though, is whether or not you're ready for ChromeOS. Now for a lot of people, it's going to be more than enough and completely fine. But for a lot of other people, they're gonna want the flexibility of something like Widows. It really does just depend on what you're using it for. The basic idea is that ChromeOS is a stripped down version of Linux that is focused around the Chrome browser. Now while that might sound crazy, especially if you live your life in a lot of web apps such as Google Docs and Office 365. It is usable. Some newer Chromebooks, though, including the Chromebook 3, do support Android apps. And while it's an option, it's not exactly a great one on this system. For starters, most apps expect a touch screen. Which is fine when you're using and Android phone, but not so great when you're using and 11 inch laptop. So when it comes to actually clicking to say jump in Super Mario Run, it's not the greatest experience. And on top of that, a lot of other games just won't run all that well even completely ignoring the controls. And performance really is an area where you notice the low price of the Chromebook. It's powered by a Celeron N-3050 processor which is about as low end as it gets in a laptop in 2018. To be fair, for basic web browsing, which is what most people are going to be doing with the Chromebook anyway, it's totally fine. Maybe not the fastest thing in the world, however, once you start loading up a few tabs it does noticeably slow down. And keep in mind that I'm using the upgraded model with four gigs of RAM. There is another model of the Chromebook 3 which only has two gigabites of RAM. If you know, you're really all about that single tab life. As a Chromebook, you don't exactly need a lot of storage. Which is good, because the Chromebook three only has 16 gigs of storage on board. Now while that might not be enough to get you a full copy of Windows 10 on board, it's actually fine for ChromeOS. It gives you about 9 gigs or so free to install other Android apps or whatever kind of stuff you wanna actually download. One thing that is decent is the battery life. So Samsung claims up to 11 hours on a charge. And while that might be a little bit ambitious, this is a laptop that I would feel totally comfortable going for a full day without taking the charger. I know I sound pretty negative, but don't get me wrong. There is definitely a market for Chromebooks. However, if it's my money, I'm gonna spend my $200 elsewhere. Like for example, with this giant used HP Elitebook. Look, this thing is absolutely enormous. And sure, you're getting a lot of extra ports and features that you're not getting on the other laptops, but you're also getting something that weighs over five pounds. It's like basically both of those combined. They're also some really weird quirks with the Elitebook. So beside the webcam, there's a little light button. Press it, and a tiny LED pops out to illuminate the keyboard. So, you know, if you're heavily working in the dark or you're need to sign some incredibly important legal documents on your keyboard, this tiny light has got you covered. A quirk that I'm not as big of a fan off is the track pad. Now sure, you're going to have a left and right click buttons on top and bottom, but even for 2012, this one's a little bit rough. Now it does support two finger gestures, but my big problem is just the tracking. Sure, once you crank up the sensitivity, it's not that bad. But especially compared to even low end stuff like on the stream in the Chromebook, it's just not in the same league. On the plus side though, in the middle of the keyboard, is a little track pad nipple. So, you know, who's ever gonna complain about having an extra nipple in their life? Performance wise, you're getting a core i5-3360 M. Now that is a third gen Ivy Bridge part. It is definitely a little bit on the older side but it actually holds up surprisingly well today. Run it through Geekbench and there's no contest. It absolutely destroys both the Chromebook and the Stream. It's not just for benchmarks, either. You really do notice the difference when you use all three of these laptops back to back. The Elitebook just feels much faster. And to be fair, I'm not going to want to do a lot of gaming on this, for example, but for normal use, it stays very snappy pretty much throughout. Which is definitely not something I can say about the Stream, especially when it starts doing something like an update in the background and everything grinds to halt. That core i5 is backed up by eight gigabits of RAM and a 320 gigabit hard drive. While four gigs of RAM is fine on the Chromebook and decent on the Stream, it is really nice to have that extra memory when you load more than just, say, two things up at a time. And something that I'm really surprised to say is, the 320 gigabit hard drive actually isn't terrible. Screen wise, we're looking at a 14 inch panel with a resolution of 1366x768. And that's actually pretty mediocre these days, to be totally honest, but when you compare it to these other two laptops, at the very least you're getting a nicer looking panel. It's low res, but it's not gonna, you know, make your eyes bleed or something. Something else is slightly behind the times is the 802.11 in WiFi. Now keep in mind this is actually a pretty solid implementation with 2x2 WiFi antennas and I was actually able to get around 200 megabites per second on the download. But, it doesn't quite match up to the latest AC solution. Still though, for under 200 bucks, I'm not complaining. And speaking of price, this laptop was originally over $1000 five years ago. Considering that it's now about 20% of that value, it's actually not too bad, and you do see a lot of the advantages of having something that was much more expensive when it first came out. However, everything comes crashing down when it comes to the battery life. So as you would expect from a five year old business laptop it's not exactly the strong suit. I'm meaning somewhere between two to three hours of fairly basic use on this guy. A big part of that is because it has a pretty small 55 watt hour battery, so even though it is swappable, in theory you could carry a couple around, I feel like, especially when you put this side by side with the newer laptops like the Chromebook and the Stream, which are getting well over double the battery life, it really is kind of hard to justify carrying this huge big of a laptop around. And of course, the other big wild card is the fact that you're buying a used laptop. So like I said earlier, I picked up a refurbished model from Amazon which does come with a warranty, and at least someone in theory went over it to make sure everything works. And thankfully, I lucked out. Everything actually does work pretty much flawlessly. Now there are a couple of very very minor blemishes on the outside of the laptop. But honestly, I'm surprised with just how clean this thing is. But of course, your mileage will definitely vary depending on where you find a laptop, whether it's been refurbished or not, whether someone took care of it or not. For me, it really comes down to two things. You can either go with the safe option and get a brand new laptop with good battery life it's gonna be small and portable, which you're going to be losing performance. Or do you wanna take a chance on an older laptop that might have a couple of problems, but is going to deliver a lot more performance and a lot more features. If it's my money, if you find the right used laptop, I think it's totally worth considering. Even something that's five years old is still going to be good enough for 99% of people. And the good thing is, a lot of the upgrades that you might wanna do, like more memory or an SSD are fairly cheap these days. But I'm curious. What do you guys think is the best option for a $200 laptop today? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Chromebook",
        "laptop",
        "lot",
        "kind",
        "pretty",
        "thing",
        "Stream",
        "life",
        "laptops",
        "things",
        "bit",
        "Austin",
        "people",
        "side",
        "big",
        "battery life",
        "fine",
        "battery",
        "RAM",
        "Elitebook"
    ],
    "transcript_entity_values": [
        "HP Elitebook",
        "1266x769",
        "MacBook",
        "less than 190 bucks",
        "first",
        "eSATA",
        "35 minute",
        "two",
        "four",
        "Elitebook",
        "eight gigabits",
        "one",
        "around $200",
        "AC",
        "Chromebooks",
        "a ton",
        "Chromebook",
        "Ethernet",
        "five year old",
        "about 2.5 pounds",
        "up to 11 hours",
        "a full day",
        "third",
        "N-3050",
        "2018",
        "320",
        "Linux",
        "Celeron",
        "11 inch",
        "USB",
        "Austin",
        "99%",
        "about 30 seconds",
        "these days",
        "1366x768",
        "16",
        "SSD",
        "Elitebook",
        "Chromebooks",
        "the last few years",
        "Geekbench",
        "today",
        "Android",
        "200 bucks",
        "14 inch",
        "Stream",
        "Chrome",
        "the Chromebook 3",
        "about 20%",
        "Amazon",
        "Super Mario Run",
        "Windows 10",
        "55 watt hour",
        "HP",
        "200",
        "SD",
        "eBay",
        "11.6 inch",
        "$188 HP Stream",
        "five pounds",
        "One",
        "over $1000",
        "Stream",
        "ChromeOS",
        "three",
        "2x2",
        "the Chromebook 3",
        "RAM",
        "Samsung",
        "Windows",
        "Google Docs",
        "about 9",
        "2012",
        "Chromebook",
        "VGA",
        "200",
        "five years old",
        "a couple of years old",
        "five years ago"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "FAC",
        "MONEY",
        "ORDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERCENT",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "LOC",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "LOC",
        "ORG",
        "FAC",
        "PERCENT",
        "ORG",
        "GPE",
        "PRODUCT",
        "TIME",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.08835709095001221,
        -0.009416661225259304,
        0.008168659172952175,
        0.02262091636657715,
        0.06396488100290298,
        0.04989025741815567,
        -0.059785787016153336,
        0.08723095059394836,
        -0.02176317200064659,
        -0.03695879876613617,
        0.043353743851184845,
        0.013329187408089638,
        0.04129990190267563,
        -0.0016324847238138318,
        0.03216332569718361,
        -0.014387315139174461,
        0.12187554687261581,
        -0.1074756607413292,
        -0.03946588188409805,
        -0.026396863162517548,
        -0.03901035338640213,
        -0.04233353212475777,
        -0.042600687593221664,
        -0.028823725879192352,
        0.05041108652949333,
        0.041634898632764816,
        0.02235390432178974,
        -0.0697864294052124,
        -0.04386100545525551,
        0.04453636705875397,
        0.005127479787915945,
        0.01120681967586279,
        -0.07721567898988724,
        0.040647510439157486,
        -0.05395444482564926,
        -0.08853165805339813,
        0.014049110002815723,
        -0.0018884140299633145,
        -0.007745984476059675,
        -0.09043025225400925,
        -0.03732648864388466,
        0.01573164202272892,
        -0.014830372296273708,
        -0.06375006586313248,
        0.04357575625181198,
        -0.060891956090927124,
        -0.017362285405397415,
        0.018125047907233238,
        0.058425333350896835,
        -0.04326239600777626,
        0.002202786970883608,
        -0.05623559281229973,
        -0.006703068967908621,
        -0.07700881361961365,
        -0.07136651128530502,
        0.012084699235856533,
        0.003076727269217372,
        -0.08908452838659286,
        0.027355507016181946,
        -0.06943566352128983,
        0.0350344218313694,
        -0.13730323314666748,
        0.021267808973789215,
        0.04306910187005997,
        -0.009857391938567162,
        -0.010734714567661285,
        0.0024110223166644573,
        -0.04406667873263359,
        -0.00516896229237318,
        0.05430036038160324,
        0.0006948472582735121,
        0.06340283900499344,
        0.04964848980307579,
        0.032042115926742554,
        -0.040141407400369644,
        -0.019661126658320427,
        0.10302039235830307,
        0.0030806150753051043,
        0.02520919218659401,
        0.06592683494091034,
        -0.024929650127887726,
        -0.05417826771736145,
        -0.01649175025522709,
        -0.011326282285153866,
        -0.0019571285229176283,
        -0.024105016142129898,
        0.0035710132215172052,
        -0.005782846361398697,
        -0.03999912738800049,
        -0.047798898071050644,
        0.0007362550823017955,
        0.004250073805451393,
        -0.03600902855396271,
        0.018979672342538834,
        -0.023080643266439438,
        0.010247726924717426,
        0.09802403301000595,
        -0.010663962922990322,
        -0.012658828869462013,
        -0.0032105273567140102,
        0.024265313521027565,
        0.08029636740684509,
        0.16121788322925568,
        -0.12474619597196579,
        -0.02731386199593544,
        -0.04958717152476311,
        0.023308342322707176,
        0.08123481273651123,
        0.054479196667671204,
        -0.0346541553735733,
        -0.03814280033111572,
        -0.05902263894677162,
        -0.06115328148007393,
        -0.020856861025094986,
        -0.021597845479846,
        0.022231072187423706,
        -0.03163918852806091,
        -0.03876021131873131,
        0.10856257379055023,
        0.12334082275629044,
        0.02531694993376732,
        0.019085759297013283,
        -0.026844952255487442,
        -0.012161146849393845,
        -0.004674516152590513,
        -0.001029329840093851,
        -0.05239671841263771,
        2.6594262970148504e-33,
        0.052522484213113785,
        0.0064497701823711395,
        -0.0642557293176651,
        -0.08900309354066849,
        0.036290109157562256,
        0.02934488281607628,
        0.031405724585056305,
        0.020268771797418594,
        -0.015389791689813137,
        0.02503727190196514,
        -0.015039927326142788,
        0.03694089129567146,
        -0.09686329960823059,
        0.04262486472725868,
        0.0705401822924614,
        0.016159063205122948,
        -0.06359810382127762,
        -0.025776896625757217,
        -0.04247104376554489,
        -8.274001447716728e-05,
        0.04053773358464241,
        -0.014134770259261131,
        -0.011660306714475155,
        -0.06945080310106277,
        -0.02775729075074196,
        -0.0064553432166576385,
        -0.048595648258924484,
        -0.034366026520729065,
        -0.01681310310959816,
        0.04219479486346245,
        -0.04134877398610115,
        -0.03904452547430992,
        -0.08273226767778397,
        -0.05047735199332237,
        -0.04346121847629547,
        -0.02551870234310627,
        0.00023450038861483335,
        -0.06098712235689163,
        0.09144271910190582,
        -0.056624624878168106,
        -0.04135117307305336,
        0.07636843621730804,
        -0.0533321350812912,
        0.005133002530783415,
        0.051234737038612366,
        -0.03195694833993912,
        0.032905157655477524,
        0.06495144963264465,
        -0.014478569850325584,
        -0.0024030685890465975,
        -0.10162383317947388,
        0.008399663493037224,
        0.047615837305784225,
        0.015338856726884842,
        -0.08399934321641922,
        -0.039271652698516846,
        0.1053849384188652,
        0.039291322231292725,
        0.05172630399465561,
        0.047479961067438126,
        0.03573647513985634,
        0.04254043102264404,
        -0.05261991173028946,
        0.07201306521892548,
        -0.06944718211889267,
        0.00012058227730449289,
        0.08131229132413864,
        0.10055870562791824,
        -0.10106989741325378,
        0.019631030037999153,
        0.00047615967923775315,
        -0.0663348063826561,
        0.0659267008304596,
        -0.0458853505551815,
        0.04507752135396004,
        -0.0049997358582913876,
        0.012353346683084965,
        -0.035155750811100006,
        -0.016876209527254105,
        -0.02694716863334179,
        -0.0036286180838942528,
        0.04745173454284668,
        0.03963394835591316,
        0.025572555139660835,
        -0.006000451743602753,
        0.07192407548427582,
        -0.01570454053580761,
        -0.026648951694369316,
        -0.03312346711754799,
        0.032217033207416534,
        0.003000536933541298,
        0.04601547494530678,
        -0.035693779587745667,
        0.036775000393390656,
        0.035627201199531555,
        -3.9266000236516605e-33,
        -0.0052844565361738205,
        0.020941685885190964,
        0.03755056485533714,
        0.046965815126895905,
        0.03008292429149151,
        0.031508564949035645,
        -0.011457690969109535,
        0.024823183193802834,
        -0.026345962658524513,
        -0.054528649896383286,
        -0.03856280446052551,
        0.021372245624661446,
        0.008481519296765327,
        0.04037274420261383,
        0.07874071598052979,
        -0.027510039508342743,
        -0.05157448351383209,
        -0.10459517687559128,
        0.05207069218158722,
        -0.09480717033147812,
        0.0003059601003769785,
        0.04848233982920647,
        -0.031560320407152176,
        0.00767992390319705,
        0.03258372098207474,
        -0.04582567140460014,
        -0.10954079777002335,
        0.008579131215810776,
        -0.012188045307993889,
        0.027781428769230843,
        -0.04849555715918541,
        -0.020385416224598885,
        0.08467350155115128,
        0.051434483379125595,
        0.06854867190122604,
        0.003955337218940258,
        0.07537224143743515,
        -0.02589000202715397,
        0.06744209676980972,
        0.060445886105298996,
        0.07140686362981796,
        0.00922988262027502,
        0.028304386883974075,
        0.013625356368720531,
        0.10935104638338089,
        0.08038915693759918,
        -0.043182432651519775,
        -0.10371416807174683,
        0.03413975611329079,
        0.00023966831213328987,
        0.037605106830596924,
        -0.032898224890232086,
        0.02129589021205902,
        0.04478636384010315,
        -0.03914491459727287,
        -0.06981173902750015,
        -0.08236557990312576,
        0.034030236303806305,
        0.01738765276968479,
        -0.0669953003525734,
        -0.06419306248426437,
        0.020839620381593704,
        -0.05665978416800499,
        0.057567596435546875,
        -0.026533974334597588,
        0.03398339822888374,
        0.04593344405293465,
        0.014883013442158699,
        -0.01510063000023365,
        -0.002255365252494812,
        -0.11335618793964386,
        -0.041258979588747025,
        -0.006726518273353577,
        -0.04156970977783203,
        -0.03250393643975258,
        0.0833391323685646,
        0.07583864033222198,
        -0.03124885819852352,
        -0.02406076155602932,
        -0.013688107021152973,
        0.06342257559299469,
        0.014493877999484539,
        0.0027117589488625526,
        -0.04878976196050644,
        0.041777051985263824,
        0.0199887715280056,
        -0.06094026938080788,
        -0.02786891721189022,
        -0.10537471622228622,
        0.020981231704354286,
        -0.03593761846423149,
        0.014095337130129337,
        -0.10758539289236069,
        -0.016653047874569893,
        0.02813791111111641,
        -4.274860287978299e-08,
        0.01948520541191101,
        0.04223751649260521,
        0.031752657145261765,
        0.11491189897060394,
        0.03944126516580582,
        -0.06969501078128815,
        0.06658148020505905,
        0.011195751838386059,
        0.1059865802526474,
        0.022845108062028885,
        0.01209879107773304,
        -0.11703434586524963,
        0.010879121720790863,
        0.00035553518682718277,
        -0.01942547783255577,
        0.04842650517821312,
        -0.06457033008337021,
        0.019395975396037102,
        0.02028496004641056,
        0.004773117136210203,
        0.007097444962710142,
        0.0313800685107708,
        0.11658316850662231,
        -0.026802150532603264,
        0.043265458196401596,
        0.035867854952812195,
        0.00010471465793671086,
        0.02238738350570202,
        0.010682053864002228,
        0.020363079383969307,
        -0.10703005641698837,
        -0.03530505299568176,
        -0.05838555470108986,
        -0.0011145685566589236,
        0.050853412598371506,
        -0.10660914331674576,
        -0.08223521709442139,
        0.009918108582496643,
        0.07655095309019089,
        0.050037678331136703,
        0.03820541501045227,
        -0.009510446339845657,
        -0.11383930593729019,
        -0.03239399939775467,
        0.08886963129043579,
        -0.0008608506177552044,
        -0.07834038138389587,
        -0.0737784281373024,
        0.013556334190070629,
        0.051494959741830826,
        -0.04984632879495621,
        -0.054663244634866714,
        0.07214923202991486,
        0.010976459830999374,
        0.0005836440832354128,
        0.03026636876165867,
        0.034406907856464386,
        0.04674110189080238,
        -0.034747056663036346,
        0.06169528514146805,
        0.07382483035326004,
        -0.029082510620355606,
        -0.011637413874268532,
        0.07687074691057205
    ]
}