{
    "id": "p0TGCZ-zN1k",
    "title": "Why is EVERYONE Buying This Gaming Case? - Corsair 4000D Airflow",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-30T17:29:11Z",
    "video_url": "https://www.youtube.com/watch?v=p0TGCZ-zN1k",
    "category": "Science & Technology",
    "tags": [
        "corsair",
        "corsair 4000x",
        "corsair 5000x",
        "corsair 5000d",
        "cheap case review",
        "why is everyone buying this corsair case",
        "why is everyone buying this case",
        "corsair 4000d airflow"
    ],
    "views": 2834431,
    "likes": 77481,
    "comments_count": 4411,
    "description": "Learn more about the MSI RTX 3070 Ti Ventus 3X 8G OC at   Play Enlisted for FREE on PC, Xbox Series X|S and PS5:  Follow the link to download the game and get your exclusive bonus now. See you in battle!  The airflow case market has come back *very* strong in recent years  and the Corsair 4000D Airflow is the clear best seller. What exactly makes it stand out among the crowd?  Discuss on the forum:   Buy a Corsair 4000D Airflow:  Buy a Corsair iCUE 4000X RGB:  Buy a Corsair 4000D:  Buy a Fractal Design Meshify C:  Buy a Phanteks Eclipse P360A:  Buy a Cooler Master MasterBox NR600:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:54 History of $100 cases & Corsair 3:03 What makes the 4000D great 4:29 Where there is room for improvement 4:54 COOOOOOLING  5:32 More things that are great! 6:05 More points of concern 7:50 The competition",
    "description_links": [
        "https://www.msi.com/Graphics-Card/GeForce-RTX-3070-Ti-VENTUS-3X-8G-OC",
        "https://enplay.link/ltt.",
        "https://linustechtips.com/topic/1440385-why-is-everyone-buying-this-gaming-case/",
        "https://geni.us/Q2B5Xyf",
        "https://geni.us/NSrpW77",
        "https://geni.us/pQFh144",
        "https://geni.us/MLPf",
        "https://geni.us/xXgG7e",
        "https://geni.us/7P8WAz",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Do you wanna waste your money? Go buy a fancy case for your computer. No, but seriously, think about it. Every single dollar that you throw away on a metal box to stuff under your desk, that's money you could have spent on faster hardware games or Doritos and Mountain Dew. That is why Sigma gamers bolt their PC components to a $2 sheet of wood, except that they mostly don't. There are actually benefits to enclosing your computer like safety, which is why the market is absolutely flooded with options that promise everything from better cooling to better compatibility or cable management, to extras like fan controllers and RGB lights. All of which raises an obvious question, with so many choices out there, why the ever loving- - [Narrator] Advertiser friendly content. - is everybody buying this one? And why is everybody checking out our sponsor? - Enlisted. Enlisted a World War II MMO squad based shooter that's free to play and a lot of fun. Try for free down below today and get some special bonus items for signing up. - Buying a case is a little like dating. While there are plenty of fish in the sea, most of them are clearly awful for one reason or another. So it's easy to at least narrow down our choices. But what is it about the CORSAIR 4000D that ticks so many boxes that both Newegg and Amazon agree that is the number one best selling case? Well, it starts with the price. Going all the way back to the early 2000s, $100 give or take has been the target for your mainstream gamer case. It's something that's got everything you need and nothing you don't. And somehow in spite of the rising costs of both materials and shipping, CORSAIR is still landing right on that target. But that's hardly enough to stand out from the crowd. And frankly, not even enough to justify buying a case at all. The thing is the ATX standard hasn't changed much in the last 20 years. Which means that if you're building a new rig today, your old case or even when you found on the side of the road is probably compatible with your new parts. The only downside to this approach is that it might take a bit of coaxing and this isn't the sort of thing that new builders tend to be comfortable with. That is where CORSAIR's biggest contribution to the case category comes in. Right on their first try with the 800D, CORSAIR made it clear that their cases were designed so anyone could build a PC in them. Every cable management hole had a purpose. Instead of simply plunking a couple holes in the back and calling it water, cooling, ready, they went out and bought aftermarket radiators, they built test systems and they refined the design to ensure that once it got out into the real world, it would be intuitive to build in while also meeting enthusiast expectations. And 12 years later, this DNA is all over CORSAIR's case designs. And it works without any incentive whatsoever. Nearly half of the last 10 of our Intel extreme tech upgrade recipients have chosen a 4,000 series case from CORSAIR. And why shouldn't they? There's a lot to like. The look of the airflow variant may be a little plain, but at least it's in offensive and CORSAIR makes it easy to upgrade to the RGB version later on. They also include thoughtful cable management features like this two piece cable tray and the fully removable panel here that covers all the connectors that need to make their way over to the motherboard. The hard drive mounts are fully toolless with all screws and accessories, nicely packaged in a little box that occupies one of the hard drive sleds. And as one of the top providers of AIO liquid coolers, naturally CORSAIR made radiator compatibility a top priority. Up in the roof, we find space for a dual 140 mil, and on the front a triple 120. Though with that particular size you may have to have your tubing up top. Aesthetics are never an afterthought for CORSAIR. And while you can stick with a standard GPU orientation and hide your 2 1/2 inch drives away behind the motherboard tray, they also support vertical GPU mounts with an aftermarket riser and putting your SSDs on display on top of the power supply basement if you're into that sort of thing. Making life easier for first time builders, the cutouts are all folded over to reduce the chances of nicks and cuts. There are cable management anchors absolutely everywhere. The center standoff has a little stud to hold the motherboard in place while you screw it in and those embossed arrows on the side panels that show you what direction to push when you wanna pop them off, are real nice to have. By the way, if you enjoy behind the scenes shenanigans, you may wanna pop off to floatplane where we've gotten exclusive with me accidentally setting our props on fire twice. There's still some room for improvement. CORSAIR falls behind in some nice to haves like the screw organizers that Fantech provides with their cases or the removable radiator mounts that make water cooling a fair bit easier. And in my opinion, CORSAIR has settled into a bit of a design rut in recent years with many of their cases looking kinda samey though in fairness to them, pretty much every other mainstream case maker is in the same rut. Where the 4000D airflow really sets itself apart though, is right in the name, airflow. While CORSAIR will gladly sell you a 4000X or a regular 4000D if you prefer solid panels, we will have those links down below, we've seen time and time again that with the latest power hungry CPUs and GPUs, you will end up leaving real world performance on the table if you don't take cooling seriously. 4000D airflow does just that. Nearly the entire front, top and back of the case is perforated. And even long GPUs will get plenty of fresh air through the filtered front panel. All of these positive aspects of the 4000D apply to both the black and to the white versions like the convenient captive side panel thumb screws and the well rounded front IO. But we wanted to take a moment to appreciate just how fine of a job CORSAIR did with the white in particular. Small touches like choosing to produce gray clips for the push pins and color matching the magnetic strips of the top fan filter go a long way to the cohesiveness of your overall build. Speaking of magnets, oh, actually those aren't available yet. But we finally have short circuit hoodies. Go and get 'em guys. There are a few more points of concern worth discussing here. CORSAIR's packing foam is what I would describe as single use only, and is not suitable for protecting the case with the additional weight of a fully built system inside it. And even if yours arrives in one piece, that easy to access mesh filter on the front intake can be a little bit saggy from the factory causing a brushing sound as it contacts the intake fans. You'll notice that the other filters like the one for the power supply use plastic support frames to prevent this. So it seems like they were emitted in the front to keep the front panel look clean especially on the 4000X, which uses that same filter behind a tempered glass front panel. The other issue is down below. Larger power supplies will have trouble fitting in the basement, especially if you wanna keep your hard drive cages in place. CORSAIR has accounted for this somewhat by allowing the cage to move toward the front of the case by 40 millimeters. But even then you can forget about plugging in an extra modular cable for GPU upgrades or when adding another drive. You'll have to pull your power supply all the way out. We also mentioned vertical GPU mounting as a nice to have feature, but you're limited to two slot GPUs in this particular chassis. And even those can end up being a little too close to the tempered glass panel, offsetting the advantage of choosing an airflow first case design. Finally, on that note, there are other cases in this price bracket that include more than just two basic black fans though you're probably giving up something else. Like for example, CORSAIR's excellent post-sale support. So your mileage may vary. Bottom line, if you're one of the sheeple who saw the 4000D airflow and went, hmm, popular, me likey, you actually made a really good choice, but it isn't the only one. If you wanna buck the trend and pick up a comparable offering at around the same price, Fractal Design has the Meshify C, Fantech offers the Eclipse P360A and Cooler Master has their NR600. Any of those will satisfy your airflow cravings also without breaking the bank. Now, these cases being mid towers as well, have some of the same constraints seen on the 4000 series with regards to fitting large radiators and large power supplies, and they aren't without issues of their own. The Meshify doesn't support longer graphics cards and has poor access to the front filter. The Fantech struggles to fit dual 140 millimeter radiators and Cooler Master uses an SSD mounting system that's not very well liked. With that said, you'd likely still be very happy with any of those alternate choices depending on your specific build, or, or okay, okay. You can just go with the popular one, that's fine. Like I said, it's a perfectly good choice. Just like our sponsor. - MSI, looking for a GPU for your next build? Check out the MSI RTX 3070 Ti Ventus 3X 8G OC. That's a lot of words but it's a good graphics card. Powered by Ampere, this graphics cart has eight gigabytes of GDPR6X with boost clocks reaching 1800 megahertz. It comes with three display port, 1.4 eight ports and HGMI 2.1 plus three torques 3.0 fans coupled to a beefy heat sink to keep your temperatures low. Zero frozen technology, which turns your fans off when your system is not under load and a custom brushed metal back plate providing a clean look. On top of that, it has a three year warranty. Learn more at the link down below. - If you enjoyed this video, you might also enjoy one of our extreme tech upgrades where we actually built in it. How about Ed's? His house is weird.",
    "transcript_keywords": [
        "CORSAIR",
        "case",
        "CORSAIR case designs",
        "front",
        "CORSAIR case",
        "cases",
        "front panel",
        "CORSAIR made",
        "GPU",
        "top",
        "airflow",
        "panel",
        "cable management",
        "cable",
        "power",
        "CORSAIR made radiator",
        "GPUs",
        "build",
        "Mountain Dew",
        "Doritos and Mountain"
    ],
    "transcript_entity_values": [
        "ATX",
        "3070",
        "Ed",
        "140 mil",
        "one",
        "Ampere",
        "4,000",
        "40 millimeters",
        "Sigma",
        "4000",
        "first",
        "800D",
        "12 years later",
        "Fractal Design",
        "SSD",
        "recent years",
        "Cooler Master",
        "RGB",
        "1800 megahertz",
        "Meshify",
        "2 1/2 inch",
        "GPU",
        "4000D",
        "today",
        "1.4 eight",
        "120",
        "Doritos",
        "Fantech",
        "World War II",
        "2",
        "Fantech",
        "Amazon",
        "Nearly half",
        "the early 2000s",
        "8",
        "140 millimeter",
        "Cooler",
        "Newegg",
        "three",
        "2.1",
        "eight gigabytes",
        "4000D",
        "100",
        "NR600",
        "more than just two",
        "three year",
        "the last 20 years",
        "AIO",
        "two",
        "Eclipse",
        "Intel",
        "IO",
        "Zero",
        "the Meshify C",
        "4000X",
        "MMO",
        "CORSAIR"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "EVENT",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "MONEY",
        "FAC",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        0.0001675890089245513,
        0.0016337066190317273,
        0.010073783807456493,
        -0.03505845367908478,
        0.08912873268127441,
        0.0013461487833410501,
        0.0014007355784997344,
        0.0650244653224945,
        0.013424712233245373,
        -0.014620231464505196,
        -0.08588486164808273,
        0.042212214320898056,
        0.020004335790872574,
        -0.05791755020618439,
        0.03830244764685631,
        0.017339643090963364,
        0.0501006543636322,
        -0.07374092191457748,
        -0.06848251074552536,
        -0.0557970255613327,
        -0.0662899762392044,
        -0.0666736289858818,
        -0.08359326422214508,
        -0.013006138615310192,
        -0.07166185230016708,
        0.04539785161614418,
        0.062251850962638855,
        -0.015771931037306786,
        0.012393844313919544,
        -0.023452581837773323,
        0.03398539870977402,
        0.07417736947536469,
        -0.0005500189727172256,
        0.016718653962016106,
        -0.015045367181301117,
        -0.08555562049150467,
        0.04072237387299538,
        -0.07107692956924438,
        -0.06777993589639664,
        -0.0305552426725626,
        -0.020433787256479263,
        -0.013140526600182056,
        0.02075156569480896,
        0.0635368749499321,
        0.020196009427309036,
        0.008990934118628502,
        0.018441587686538696,
        -0.033120982348918915,
        0.024906624108552933,
        -0.008187527768313885,
        -0.0012707511195912957,
        -0.09110046178102493,
        0.011900500394403934,
        0.013147959485650063,
        -0.06984081119298935,
        0.04215652123093605,
        -0.03187409043312073,
        -0.08805874735116959,
        0.026654468849301338,
        -0.0745636597275734,
        0.027385856956243515,
        -0.11492621153593063,
        0.017284827306866646,
        0.05289085581898689,
        0.027254842221736908,
        -0.0520067922770977,
        -0.03496939688920975,
        0.01896614581346512,
        0.014665157534182072,
        0.06249290332198143,
        0.0739254280924797,
        -0.0038666396867483854,
        0.013307974673807621,
        0.03813537582755089,
        -0.006466812454164028,
        -0.00444240216165781,
        0.06898471713066101,
        -0.09402985870838165,
        0.06153913587331772,
        0.11721847951412201,
        0.05127451941370964,
        0.007356471847742796,
        -0.015477119944989681,
        -0.11870831251144409,
        -0.0347590334713459,
        0.016449930146336555,
        0.04901183769106865,
        -0.03944040462374687,
        -0.009703939780592918,
        -0.08911828696727753,
        0.0017745685763657093,
        0.03769303485751152,
        0.05361000448465347,
        -0.026059821248054504,
        0.04441200569272041,
        0.06032619997859001,
        -0.01346554234623909,
        0.01959177665412426,
        0.0039199041202664375,
        0.019772149622440338,
        -0.01508206594735384,
        0.03084198199212551,
        0.024407681077718735,
        0.05118287727236748,
        -0.07083342969417572,
        -0.030562829226255417,
        -0.008146570064127445,
        0.0854940190911293,
        -0.012843243777751923,
        -0.018820839002728462,
        -0.1145855039358139,
        0.009356003254652023,
        -0.00831962376832962,
        -0.01638154871761799,
        0.005514232907444239,
        -0.03949684649705887,
        -0.023309269919991493,
        -0.002365518594160676,
        0.01598440483212471,
        0.045806266367435455,
        0.015663668513298035,
        -0.0001336218265350908,
        -0.042084015905857086,
        0.031818218529224396,
        0.063053660094738,
        -0.015923338010907173,
        -0.10760950297117233,
        5.010069329851887e-33,
        0.005688749253749847,
        0.09929638355970383,
        -0.027896234765648842,
        -0.010565339587628841,
        0.007369710132479668,
        -0.0010286775650456548,
        0.061599671840667725,
        -0.06455428898334503,
        0.05002635344862938,
        0.09243189543485641,
        -0.05391407012939453,
        0.05462154746055603,
        -0.07812785357236862,
        0.06888525933027267,
        0.01496339775621891,
        -0.09343752264976501,
        -0.06745454668998718,
        0.03964416682720184,
        -0.06091085076332092,
        0.02914106287062168,
        0.03352608531713486,
        0.000789934303611517,
        0.03264106810092926,
        0.09345301985740662,
        0.010095673613250256,
        0.001509718713350594,
        0.060206539928913116,
        0.0005327481194399297,
        0.13090631365776062,
        0.03872004896402359,
        0.02685445360839367,
        -0.058988459408283234,
        -0.039147812873125076,
        -0.01900775544345379,
        -0.044094134122133255,
        0.04080800712108612,
        -0.0906936377286911,
        -0.1013069748878479,
        0.005313161760568619,
        0.0070686121471226215,
        -0.05287338048219681,
        0.02895575761795044,
        -0.10617618262767792,
        -0.012086508795619011,
        -0.043760012835264206,
        0.002717581344768405,
        -0.04021685943007469,
        -0.02977648191154003,
        -0.0022503070067614317,
        -0.01483104843646288,
        -0.02496596798300743,
        0.08226405829191208,
        -0.025101086124777794,
        0.023335972800850868,
        0.04411788284778595,
        -0.14429503679275513,
        -0.014477139338850975,
        -0.0479922816157341,
        0.07094655930995941,
        0.07564621418714523,
        -0.05865125730633736,
        -0.04297247529029846,
        0.006221814081072807,
        0.029098570346832275,
        -0.05666917935013771,
        0.09118503332138062,
        0.1116681843996048,
        0.026714660227298737,
        -0.07634925842285156,
        -0.0018738957587629557,
        -0.0038984434213489294,
        -0.013066253624856472,
        -0.01511953305453062,
        -0.03468310087919235,
        0.06934898346662521,
        -0.015134907327592373,
        -0.012297934852540493,
        -0.02574733830988407,
        -0.02243887633085251,
        -0.07430236786603928,
        -0.09144817292690277,
        0.023930899798870087,
        -0.0008065059082582593,
        0.0722179040312767,
        0.010131800547242165,
        -0.03514751419425011,
        -0.03143639862537384,
        0.04859566316008568,
        -0.051816992461681366,
        -0.05477882921695709,
        -0.0030622028280049562,
        -0.00905617792159319,
        0.07995045930147171,
        0.0837775245308876,
        -0.018020587041974068,
        -4.51378222709044e-33,
        -0.055237967520952225,
        -0.02955879271030426,
        -0.05784008279442787,
        0.03824307397007942,
        -0.012884418480098248,
        0.011627825908362865,
        -0.006334499455988407,
        0.044602539390325546,
        0.07777766138315201,
        0.02268197573721409,
        0.031222108751535416,
        0.09967818111181259,
        0.019247420132160187,
        0.06762722134590149,
        0.012007487937808037,
        -0.05160770192742348,
        0.02456841617822647,
        -0.11617909371852875,
        0.03806167095899582,
        -0.05129953846335411,
        0.10791411250829697,
        0.04815520718693733,
        -0.0263313427567482,
        -0.040542326867580414,
        -0.0628528967499733,
        0.07014406472444534,
        -0.03503993898630142,
        -0.029009176418185234,
        0.0404820591211319,
        0.06879664212465286,
        -0.012270460836589336,
        0.027384115383028984,
        0.01625908724963665,
        0.0509062260389328,
        0.05728178098797798,
        -0.022830724716186523,
        0.07143215835094452,
        0.036570772528648376,
        0.013266999274492264,
        -0.03791750222444534,
        -0.03791174665093422,
        0.04381728544831276,
        0.006922521162778139,
        -0.019626999273896217,
        0.012986097484827042,
        0.009322802536189556,
        0.0862714946269989,
        -0.09105575084686279,
        0.16759473085403442,
        0.0225349273532629,
        -0.038499049842357635,
        -0.04048512503504753,
        0.08523780852556229,
        0.03631087392568588,
        -0.025067869573831558,
        -0.05383835360407829,
        -0.037285998463630676,
        0.016169356182217598,
        -0.024866202846169472,
        -0.034691110253334045,
        0.06291142851114273,
        0.09185522049665451,
        -0.0056625427678227425,
        -0.0011216705897822976,
        -0.0011342139914631844,
        0.009208627045154572,
        0.02840331941843033,
        0.015381435863673687,
        -0.021978532895445824,
        0.011813269928097725,
        -0.0904216542840004,
        -0.04118414223194122,
        -0.0547555536031723,
        -0.030210841447114944,
        -0.02026687189936638,
        0.09370879828929901,
        0.022555237635970116,
        -0.00463942950591445,
        0.022661732509732246,
        0.028165966272354126,
        -0.1641501635313034,
        0.03176071494817734,
        0.04271915555000305,
        -0.0361558236181736,
        0.07471220195293427,
        -0.04024280980229378,
        -0.007741068955510855,
        -0.07025656849145889,
        0.0032135266810655594,
        -0.018998097628355026,
        -0.03678559511899948,
        -0.024466581642627716,
        0.004005368333309889,
        0.03465532884001732,
        0.0074830204248428345,
        -4.8066358004916765e-08,
        -0.034754183143377304,
        0.022227870300412178,
        0.04074476659297943,
        0.012158514000475407,
        0.003842428093776107,
        -0.033137667924165726,
        0.007627303712069988,
        0.0291635449975729,
        0.025053998455405235,
        0.021201299503445625,
        0.06071647256612778,
        -0.07659395039081573,
        -0.03182703256607056,
        -0.042116209864616394,
        0.07725018262863159,
        0.015113141387701035,
        -0.1227167397737503,
        0.0448358915746212,
        -0.012676629237830639,
        -0.05400602146983147,
        -0.011328226886689663,
        0.02828373946249485,
        0.09793070703744888,
        -0.043598245829343796,
        -0.04730305075645447,
        0.08944831788539886,
        0.026187686249613762,
        -0.040824633091688156,
        0.028464721515774727,
        -0.00874610710889101,
        -0.08319886773824692,
        0.07548249512910843,
        0.0624624602496624,
        -0.02964947372674942,
        0.04019051045179367,
        -0.05496690422296524,
        0.021001890301704407,
        0.13986724615097046,
        0.022820021957159042,
        -0.009588677436113358,
        -0.010273157618939877,
        -0.08636052906513214,
        -0.036599770188331604,
        -0.0014683990739285946,
        0.026876959949731827,
        -0.017791887745261192,
        -0.05435805022716522,
        -0.0581335611641407,
        -0.038193948566913605,
        0.06444797664880753,
        -0.049597252160310745,
        -0.008875884115695953,
        -0.03359891474246979,
        0.0662454217672348,
        0.004395637661218643,
        -0.012547515332698822,
        -0.07843118160963058,
        0.016981715336441994,
        0.0162893645465374,
        -0.024080932140350342,
        -0.04011911153793335,
        -0.05517888814210892,
        -0.05628163367509842,
        0.06994879245758057
    ]
}