{
    "id": "P63tFSLIPAg",
    "title": "I bought the WEIRDEST Mystery Tech.",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-11-30T22:07:03Z",
    "video_url": "https://www.youtube.com/watch?v=P63tFSLIPAg",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "wishtery tech",
        "amazon",
        "ebay",
        "how to waste",
        "austin",
        "austin evans",
        "keyboard",
        "pc",
        "triangle pc",
        "pokemon",
        "leonhart",
        "pokemon cards",
        "game boy",
        "gb operator",
        "epilogue",
        "grid",
        "grid frame",
        "unboxing",
        "tech",
        "mystery"
    ],
    "views": 1049352,
    "likes": 37710,
    "comments_count": 876,
    "description": "Right now, for a limited time, save 60% on your first 3 months of Audible. Thats only $5.95 a month. Give yourself the gift of listening. For more - go to  or text austin to 500 500.  Help support NAMI and @Leonhart!  Don't visit  You're welcome for my $250 @randomfrankp Grid tech frames:  Epilogue GB Operator:  Acute Angle triangle PC on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  My podcast @TheBackmarkers!  Subscribe!  TikTok:  Instagram:  Twitter:",
    "description_links": [
        "https://audible.com/austin",
        "https://nami.org/pokemon",
        "https://www.lttstore.com",
        "https://austin.tech/grid",
        "https://austin.tech/gboperator",
        "https://austin.tech/trianglepc",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Did I miss the shoot at all? We miss anything today. What's up? You're giving me a weird look. - Are you okay? - Is it cause I'm late? - We have Linus at home. - You said you wanted me to be excited for the shoe? I figured, you know, I would just, aww. - Yo, this is a new low for Mystery Tech. - [Ken] I'm more impressed by the pillow. - lttstore.com. - Oh my God. This is my worst nightmare. You even got the earrings! - Yeah, I mean, I gotta, you gotta fit the part. - What's the point of this? How is this Mystery Tech? - You said dress for the job you want, I'm here to give you all the tips you need. - Please tell me you have an actual Mystery Tech item. Oh my God. Linus is now invaded most sacred, holy of my spaces, which is the studio. And.. - Let me just, since you want to make it such a big thing, let me look and see if there's any other good tech that we can find while we're at it. It seems like my computer is low on battery. Let me just get my phone here. - I'm not sure if this is a Linus cosplay or like some deeper (expletive) you need to work through right now. (dance music) This is my personal hell. - I'm paid by this man. You can hold this to make yourself feel better. There you go, buddy. (dance music) - It's time for more Mystery Tech. Have you subscribed to the channel yet? Oh no. Then why don't you ring the ding-a-ling? - [Ken] Don't subscribe to us. Subscribe to the person that send us this box. - The person that sent us this box. Is this the Frank box? - [Ken] It is the Frank box. - I decided to be lazy and just type the words Mystery Tech into eBay and lo and behold, what do I receive? But the very first item is a mystery box from none other than YouTube's very own randomfrankp. I kid you not. This comes directly from randomfrankp. In fact, he actually DM'd you. He saw the eBay listing. - [Ken] He did, he did. He's like, did Austin buy this? And I was like, unfortunately. - So this was purchased for randomfrankp for $250. So let's see if we can get ourselves $250 of value or whether or not we've been scammed by the YouTuber formerly known as randomfrankp, now known is randomscamp. - [Ken] Nooooo. - Ha ha, got 'em! Alright, first item is a cooler master S K 6 21 60% low-profile wireless keyboard. Here's some Razor universal grip tape. - [Ken] Oh, that's useful. - There is a minimalist felt desk pad in size wide. The way I like it. Oh! - [Ken] We know you love PlayStation. - Wait. Smells like Frank. Oh, is this a Google home? Oh, it's a little scratched though, Frank. You scratched my mystery box item. - [Ken] Frank, I think also gets the same stuff that we get in our PO Box cause we also.. (Austin and Ken laugh) To be fair. - Last but not least an Pwnage Ultra Custom Symmetrical. - [Ken] Yes, we also got five of those in our PO Box. - Just a little behind the scenes action. Inside our table, we keep a list of accessories for like Playstation controllers and whatnot. We have this exact mouse. - [Ken] Oh yeah, it is. Oh yeah, right, we already.. - The exact same one. - [Ken] You know, he's given us what, like, like over the value of the box, over like $250, maybe $300 worth of stuff. Go to youtube.com/randomfrankp. - Editing can you bleep that and instead use the robot text to speech voice to say, Austin Evans, thanks. - [Matt] Randomfrankp is better than Austin Evans. - I just said.. - It's true. - [Matt] Hashtag spread the truth. - It's true. - All of this is getting censored now. It's all just going to be Austin Evans is the best YouTuber for sure, real-zies. Watch more Mystery Tech, please. Is that another grid? - [Ken] See for yourself. - So not too long ago on the Mystery Tech or maybe it was a while ago actually at this point, we took like a grid, which is a very cool framed piece of tech. - [Ken] They're actually right over Jared. - But look, there is a ton of tech that gets thrown away all the time, right. And if you can take that tech and not only recycle it, but not just recycle it for the parts of whatever, but recycle it into what I would absolutely call an art piece. I mean, how could you possibly argue with that? All right, inside is more packaging. I forgot. There's more packaging. - [Ken] Yeah, there's literally two, I said you could stab it cause there's like two boxes. - Yeah, alright, last minute guesses. Do I want to try and guess what this is? - [Ken And Jared] Yes. - I think it's a PSP. I think they did a PSP and I would very much like to see the PSP. Are we ready for the grand reveal of the.. - [Jared] It's upside down. - I can't see it. - [Ken] No, one more, one more, one more. Oh, that is so cool. What! - What is it? - [Ken] Yo! - Is it a PSP? - [Ken And Jared] No. - Is it Nokia? - [Ken] No. - Is it a Game Boy Pocket, yo! So even though this is beige, this is a Game Boy Pocket. Now the Game Boy Pocket was essentially the slim version of the OG Game Boy. It launched way later. So this was seven years, I believe, after the first Game Boy came out. Wow, I just butchered that, that's okay. So there's not a lot going on here. So you can essentially see the main board, which has the CPU, has some RAM. It has the link port. There are a couple of wheels that you could use for contrast as well as volume. And then there's a separate power supply. You've got your speaker, you've got the casing and the screen, which actually interesting, so I guess the screen is on the underside of this because I will believe it was all on the same board. So that's one thing you can't see. - [Ken] So it is $179 on the site right now, but they have $229 as the MSRP. - [Austin] Gotcha, yeah. These are clearly pretty heavily discounted. $200 bucks a little bit much. But again, if you think about this as art, I would consider both of these to be more on the art side. This is a really cool display piece. So props to the grid guys, keep doing what you're doing. I will say that I look forward to the next seven episodes of Mystery Tech. We have more good stuff. This is super cool though. This is super cool. - [Ken] Wow. He cleared us to spend a $1,000 on the store. - [Jared] I'm already ordering. - [Ken] Let's go! - Mistakes have been made. This episode of Mystery Tech is sponsored by Audible. Recently, I became a new dad, which has left than me with a lot less time to keep up with things like reading. But with Audible, I've been able to immerse myself in all kinds of stories and information with their vast library of audio books, including Project Hail Mary by Andy Weir and Audible is of course not just limited to audio books. With their plus catalog, you can listen to content in other formats like podcasts and exclusive originals, which makes being an Audible member that much sweeter. Especially this holiday season, there is no better time to treat yourself. Right now, you can save 60% on your first three months of Audible, which is only $5.95 a month. If you want to give the gift of listening, head over to Audible.com/Austin, or you can text Austin to 500-500. Again, that is Audible.com/Austin and huge thank you to Audible for sponsoring this episode of Mystery Tech. - [Jared] What? - [Ken] I didn't even pay you yet. (everyone laughs) - I was just going to do a funny gag, now you got me all weird. Sometimes for Mystery Tech, I just got to get in the mood, right. I just gotta like warm up all this. - [Jared] Whatever mood you're in right now, get the ff out of it. (everyone laughs) - The copy of Sue's Unfortunate Events for Game Boy Advanced, Pokemon Pinball for Game Boy Advance, Pokemon Ruby Version for Game Boy Advance. I'm sensing a theme. Is it time for a game gear? Look at that. Look how smooth and responsive my.. - [Ken] That was really smooth, yo. - See that's what happens when I warm up. I just gotta like get loose some lumber. And I'm just like, I'm ready to just, this is the Game Boy operated by Epilogue. This is actually cool. I've seen this in the past. I've actually wanted to try it. The way I understand is that it is a way for you to play your actual legitimate Game Boy carts on a PC. Do you use this to dump your ROMs or how's actually, how does this work? - [Ken] Wait, you mean pirate? - No. No, this is actually a legitimate use of ROMs. You are backing up your own physical copies of games. That is like, exactly what ROMs are supposed to be used. - [Ken] For you to provide to the community at large? - No, we've got a little instruction manual, a USB A to C cable, and yeah, the epilogue itself. So I have plugged in the epilogue. Please insert a cartridge. Okay. We'll just plug it in Pinball. - [Ken] We're just going straight in. - There's no shenanigans here. 3, 2, 1, look at that. Okay, so it pops up as Pokemon Pinball, official cartridge, read only. I can launch it. - [Ken] Okay, I love that it gives you the metadata for it already. That's kind of cool. - [Austin] I can download my game or I can download by save, which actually is really cool. Especially like you have a old childhood copy of like a Pokemon game or something? You could save that if assuming your battery isn't dead. I'm actually gonna try this. How long does it take to dump my GBA ROM? Let's try it. - [Ken] I would hope two seconds. - [Austin] Oh, look at that. Look how fast it is. Can you see? - [Ken] Wow. - [Austin] Done. Flawless. And it immediately works with the Xbox controller as well. I will say the scale is very large for a Game Boy Advance game. (gaming music) The latency is completely fine on this too, which is not a surprise for Game Boy Advance game. - [Ken] I feel like they've perfected this at this point. - [Austin] Yeah. Playing these things on PC. Alright, hang on, we're going to pause this. So press escape. Oh, look at this! So when I want to quit, do you want to override the current save to your cartridge? So you can play on your device and you can keep the save straight over the cartridge. That's so cool. I'm going to just discard that for now. I'm not going to remove this. Yup. - [Ken] That's really well thought out. - This is an excellent product. I am incredibly impressed with just how seamless and smooth it is. And if you have a selection of Game Boy, Game Boy Color, or Game Boy Advance games. Man, it's hard to go wrong with something like this. Look, it's something from Mystery Tech that doesn't suck. Is acute angle. Is this something like weird like fan list, like, mini PC that is an acute angle in a wood case? - [Ken] The thing is, it's actually not an acute angle. That looks like.. - [Austin] A triangle. - [Ken] A equal lateral triangle, but.. - Wow! Mr. Big brain over here with your big fancy words. This is the Mopey Phoenix. - [Ken] Phoenix tears have healing properties. - Okay. Dumbledore. Nice box though. There's clearly a keyboard in here. Is it a high-end artisanal masterpiece or is it.. - [Ken] No. - Okay. - Garbage, got it. Bro! No, no, no, no, no, no, no, no. Look, this might be great at Instagram, but.. - [Ken] This is the level that I lose at in Fall Guys all the time. - You hear this noise? Wait, just listen to this keyboard. - [Ken] That actually sounds like a lube mechanical keyboard. - I don't hate this. - [Ken] It's better than I thought. - [Austin] How much was the keyboard? - [Jared] $30. - [Ken] That's a steal for $30. - [Austin] For literally for Instagram, that's worth $30. I'm going to put this off to the side for one moment, while we prepare our acute angle PC. - [Ken] That's fine, that was.. - You know I'm not really sure why I'm surprised it's a triangle. - [Jared] That's a lot bigger than I thought it was going to be. - This is strange. Wow. Look, the Compensator 9,000 is here. This is what appears to be real wood. - [Ken] Does it smell like real wood? - It does. So a lot of questions here, namely, what's actually inside of this? So I have a Celeron N3450. So it is a quad core? But this is, let's just say on the lower end of a modern PC. We do have eight gigs of RAM, which is nice. And it shows, so we do have two drives. You know what I haven't asked, how much is the computer, the acute angle? - [Ken] $185. - $185. This is, I mean, I'm not going to say good, $185 bucks. I mean, to be fair when I did log in, it did automatically pop up with it was logged in as admin. It had no setup at all, which is slightly sus. Let's try the actual PC. This should have enough performance to play back video, to do fairly basic tasks. For $180 bucks, the performance is not great. But to be fair, with a system like this, when you first turn it on, give it a couple hours realistically, to actually get up to date and everything because windows just is so slow on this low end hardware, if you have any kind of background updating or anything going on. If you want a very unique piece of hardware that is sure not high end and super powerful, but this is definitely the best looking $180 PC that you'll ever find. For this segment of Mystery Tech, I am bringing an item. And by I bringing an item, an item is being brought to me, courtesy of a very good friend. This as a set that I have not opened in legitimately 20 years. This is a pack of base set two from my very good friend, Leonhart. Now, if you're not familiar with Leonhart, not only did we earlier in the year build a game PC, the ultimate Pokemon game PC for him, but he's currently doing a fundraiser to support NAMI, the National Alliance for Mental Illness, where he's trying to raise a million dollars and to do that he has given away all kinds of stuff, including tickets to his pop-up shop, cards, you name it, and to help support he has sent out a brand new still sealed pack of base set two that I get to open for Mystery Tech. I mean the pitch was pretty easy. He's like, hey Austin and I said, yes. And then he explained what was going on. This is a quite expensive pack of cards. I think this was printed in 2000s, which is older than half the people in this room. So I did prepare and by I prepared, I mean, Jared was very much in the mood to print a bunch of Bobasaurs. So hopefully we'll pull a Bobasaur today. I'm gonna do this real poker YouTuber style. I've actually prepared my phone. I have soft and hard sleeves. I am legitimately nervous. Like the picture, I was just staring at me. Let me smell it. Aw, it smells like nostalgia. Okay, alright, alright. Here goes nothing. Look at that. Oh, look at that. Pretty clean. Got to move this this way. Look how clean that pack art is right now. Oh my goodness. - [Ken] I'm just looking at how much better Leonhart is at this than you. - [Austin] Yeah, it's his job. - [Ken] You couldn't open it in front of the camera like that. - [Austin] Okay. Alright, alright. So we've got our cards. If I recall correctly, it's been a little while. I think the card trick is two. So we're going to take two cards. Oh, the condition looks very good. So this right here is our best card but we're gonna flip it over, we're going go through. Is everyone ready? Don't look at the cards. - [Ken] You're literally holding them in front of me. - [Austin] Our next card is a Wartortle. Very nice, very nice. Gently, lift this up. I'm afraid because there could be a rare at any point. Okay. Super potion. Super potion. It's fine. It's fine. We do want to get starters or a Pikachu, those are all good. We've got a Kakuna. - [Ken] Feel like you should've gotten gloves for his. - No, you actually don't wear gloves when you're opening Pokemon cards, because you lose the dexterity in your fingers and you're much more likely to damage or bend a card. You just want to wash your hands before opening a pack of cards. Fun fact, the more, you know. - [Jared] Did you wash your hands? - [Austin] I did not. Uh-oh, uh-oh, a Vulpix, okay. I thought it was a Charmander. It's okay though. It's okay. Vulpix is good. Okay, we're still going. We got Sandshrew. We've got a Weedle. 'Kay, trainer card, a Poke Ball. Actually, that's not a terrible pull. Okay, I think we're actually at a rare. I think this might be our last card. Oh, it's okay, it's okay. One more trainer. We're okay, one more trainer. There's one more left. We're okay. We're okay. Oh, it's a, is it Raichu? Oh, it's a Magneton holo! We got a holo! It's not the greatest holo but we got a holo. Okay, let's take a look at condition. There's a lot of foil there. Oh, that's pretty clean though. - [Ken] Yo, I forgot how holo those were. - [Austin] It's super shiny, right? - [Ken] I just got blinded by that thing over here. - [Austin] So of course, we're going to do this correctly. We're going to put it in it's sleeve, gently in the sleeve. And then we're going to put a top loader. - [Ken] Austin treated that one card like my mom treated me when I tried to leave home. - If you would like a chance to not only win yourself some cards, but also to help support a very good charity, definitely should go check out the link in the description. This is a success. It's not Charizard but it's a success. Woo-hoo!",
    "transcript_keywords": [
        "Game Boy",
        "Mystery Tech",
        "Game Boy Advance",
        "Game Boy Pocket",
        "Boy Advance game",
        "Game",
        "Tech",
        "Mystery",
        "Boy",
        "Boy Advance",
        "Mystery Tech item",
        "Game Boy Color",
        "Boy Pocket",
        "actual Mystery Tech",
        "Pokemon game",
        "Austin",
        "Advance game",
        "mystery box",
        "legitimate Game Boy",
        "words Mystery Tech"
    ],
    "transcript_entity_values": [
        "179",
        "185",
        "Kakuna",
        "Game Boy Advance",
        "Ken] Wait",
        "first",
        "a couple hours",
        "Magneton",
        "two",
        "Bobasaur",
        "Matt",
        "two seconds",
        "NAMI",
        "one",
        "Kay",
        "Razor",
        "the National Alliance for Mental Illness",
        "$200 bucks",
        "a ton",
        "180",
        "20 years",
        "Raichu",
        "Linus",
        "Nokia",
        "Bobasaurs",
        "this holiday season",
        "1",
        "Austin Evans",
        "Charizard",
        "YouTuber",
        "250",
        "PlayStation",
        "Ken",
        "USB",
        "Sue's",
        "Weedle",
        "Austin",
        "Instagram",
        "your first three months of Audible",
        "MSRP",
        "Playstation",
        "PO Box",
        "one moment",
        "YouTube",
        "last minute",
        "the Mystery Tech",
        "a million dollars",
        "seven years",
        "1,000",
        "Game Boy Advanced",
        "229",
        "2",
        "seven",
        "today",
        "500-500",
        "this Mystery Tech",
        "Pokemon Ruby Version",
        "Big",
        "Google",
        "eight",
        "300",
        "PO Box",
        "Xbox",
        "Leonhart",
        "Pokemon",
        "$185 bucks",
        "$180 bucks",
        "Project Hail Mary",
        "Leonhart",
        "CPU",
        "eBay",
        "Linus",
        "Ken] Austin",
        "60%",
        "Mystery Tech",
        "One",
        "Audible",
        "S K 6",
        "Ken] Yo",
        "Jared",
        "Andy Weir",
        "Sandshrew",
        "RAM",
        "Pinball",
        "30",
        "Wartortle",
        "Fall Guys",
        "Frank",
        "Pikachu",
        "Celeron",
        "Pokemon",
        "Audible.com/Austin",
        "Pokemon Pinball",
        "five",
        "only $5.95",
        "2000s",
        "older than half",
        "a Poke Ball.",
        "over like $250",
        "Matt] Randomfrankp",
        "Ken] Frank",
        "Game Boy",
        "3"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "LOC",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "FAC",
        "TIME",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "MONEY",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "NORP",
        "PRODUCT",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL"
    ],
    "vector": [
        -0.1345851570367813,
        -0.020457295700907707,
        0.07164082676172256,
        -0.05097830668091774,
        0.06519473344087601,
        -0.0549095943570137,
        0.04236549511551857,
        0.009383191354572773,
        0.016548501327633858,
        -0.02106231451034546,
        0.008828847669064999,
        0.04297405108809471,
        0.04818815737962723,
        -0.045334551483392715,
        -0.011307312175631523,
        -0.034485697746276855,
        0.0467345155775547,
        -0.03002171590924263,
        -0.05306081101298332,
        0.035762663930654526,
        -0.016778666526079178,
        0.003422651905566454,
        0.032409004867076874,
        -0.01123158261179924,
        -0.016907570883631706,
        -0.02543913759291172,
        0.01965058036148548,
        -0.09193190932273865,
        -0.0655888020992279,
        -0.08121577650308609,
        -0.04678617790341377,
        0.08933165669441223,
        -0.008896363899111748,
        -0.07391984760761261,
        0.06565743684768677,
        -0.03840116783976555,
        -0.024337399750947952,
        -0.031038034707307816,
        -0.016959859058260918,
        -0.007561671081930399,
        -0.03508768603205681,
        -0.03315378352999687,
        -0.020574022084474564,
        0.07744360715150833,
        -0.05805280804634094,
        -0.050853144377470016,
        -0.012446198612451553,
        -0.07745486497879028,
        0.040430523455142975,
        0.02419443055987358,
        -0.08236312121152878,
        -0.0938277468085289,
        -0.014071688055992126,
        -0.05087178945541382,
        0.0156088350340724,
        0.03281283378601074,
        0.025044092908501625,
        -0.00580955296754837,
        0.05719544738531113,
        -0.08988211303949356,
        0.04986339807510376,
        -0.09476468712091446,
        -0.01116208080202341,
        0.08411870896816254,
        -0.02289745584130287,
        -0.0025891056284308434,
        -0.06557159125804901,
        0.01675053872168064,
        -0.001052516745403409,
        -0.04388856142759323,
        -0.030211444944143295,
        0.009152970276772976,
        0.002273217076435685,
        0.105760857462883,
        0.1055760383605957,
        0.07315483689308167,
        0.10036472976207733,
        -0.03454727306962013,
        0.05123249813914299,
        0.008717932738363743,
        -0.03040350414812565,
        -0.05352995917201042,
        -0.018199682235717773,
        -0.05842284858226776,
        -0.03591744229197502,
        -0.00848403014242649,
        0.04185466840863228,
        0.017237819731235504,
        0.018065694719552994,
        -0.03759606182575226,
        0.015913203358650208,
        0.012153245508670807,
        0.007393639534711838,
        -0.025496475398540497,
        -0.0010281768627464771,
        0.012196245603263378,
        -0.030409086495637894,
        0.004625676199793816,
        -0.11848930269479752,
        0.10415512323379517,
        0.06227438524365425,
        -0.006187193561345339,
        0.025876624509692192,
        -0.0018495569238439202,
        -0.03397797793149948,
        -0.06051240488886833,
        -0.04113730043172836,
        0.01727236621081829,
        0.06669562309980392,
        0.015731755644083023,
        -0.01834811083972454,
        -0.04210545867681503,
        -0.00024828402092680335,
        0.0022662230767309666,
        0.004568508826196194,
        0.01575983501970768,
        -0.07716500759124756,
        0.03420761227607727,
        0.0988742858171463,
        -0.02159685455262661,
        0.0696730837225914,
        0.07342401146888733,
        -0.0647088959813118,
        0.012425464577972889,
        -0.02259240113198757,
        0.0538116991519928,
        -0.0547836571931839,
        3.351368924340897e-33,
        0.03652705252170563,
        0.13582445681095123,
        -0.021735651418566704,
        0.01727532036602497,
        0.08510678261518478,
        -0.06377187371253967,
        -0.07829224318265915,
        0.0574524961411953,
        -0.06092718243598938,
        0.0710570216178894,
        -0.08744268119335175,
        0.07572788000106812,
        -0.031611036509275436,
        -0.00836104340851307,
        -0.04268307238817215,
        -0.006202166900038719,
        -0.05080088973045349,
        -0.014259008690714836,
        -0.0005081288982182741,
        0.005578330252319574,
        -0.0008357077022083104,
        0.022341212257742882,
        0.019520139321684837,
        -0.04756905511021614,
        0.006076091434806585,
        -0.011750295758247375,
        0.0112230209633708,
        -0.044828616082668304,
        0.06707387417554855,
        0.062141165137290955,
        -0.15894101560115814,
        -0.02574143372476101,
        0.07672686874866486,
        -0.021554896607995033,
        -0.07295823097229004,
        -0.02117159776389599,
        -0.01152126956731081,
        -0.1598927080631256,
        -0.018817270174622536,
        0.02090466022491455,
        -0.014328009448945522,
        0.03697523474693298,
        -0.036025162786245346,
        -0.011137687601149082,
        -0.04512396827340126,
        0.041190147399902344,
        0.0650264173746109,
        0.0724402368068695,
        0.01602344587445259,
        -0.0017109313048422337,
        -0.045762233436107635,
        -0.004304063506424427,
        0.009419828653335571,
        -0.02435593120753765,
        0.04245243966579437,
        -0.010013862513005733,
        0.005903832148760557,
        -0.08695591986179352,
        0.11385738104581833,
        0.04821980372071266,
        0.07441428303718567,
        0.042948782444000244,
        0.11347677558660507,
        -0.023623036220669746,
        -0.08897335082292557,
        -0.03915460780262947,
        0.008074095472693443,
        -0.0019421052420511842,
        0.01933184638619423,
        0.05562252178788185,
        -0.05612969025969505,
        -0.04272090271115303,
        0.0223432295024395,
        -0.05923338234424591,
        0.014594613574445248,
        0.03960894048213959,
        -0.05447223782539368,
        -0.027840938419103622,
        0.02130398154258728,
        -0.03207593411207199,
        -0.008904118090867996,
        -0.013328268192708492,
        -0.013652357272803783,
        0.013492317870259285,
        -0.017866311594843864,
        -0.05645532160997391,
        0.019099747762084007,
        -0.027675524353981018,
        -0.045259006321430206,
        0.018609503284096718,
        -0.045051682740449905,
        0.011301722377538681,
        -0.030632268637418747,
        0.040753159672021866,
        -0.028244158253073692,
        -5.116581240321879e-33,
        -0.020386163145303726,
        -0.03078557178378105,
        -0.05065428093075752,
        -0.004523337818682194,
        0.01336547639220953,
        -0.03943246975541115,
        0.028202500194311142,
        0.015838762745261192,
        0.0714750811457634,
        -0.02154148556292057,
        0.009023579768836498,
        0.02257072925567627,
        0.007121875416487455,
        -0.0913248211145401,
        0.040865108370780945,
        -0.05133085697889328,
        0.034243423491716385,
        -0.057719290256500244,
        -0.02816012129187584,
        0.01941613107919693,
        0.06134886294603348,
        -0.024020757526159286,
        -0.1039842963218689,
        -0.013237567618489265,
        0.05088193342089653,
        0.07795975357294083,
        0.0900319293141365,
        0.05972322076559067,
        -0.09911131113767624,
        0.026422057300806046,
        -0.05785210430622101,
        -0.03481130301952362,
        -0.017421819269657135,
        0.05086611956357956,
        0.013768433593213558,
        0.0823080912232399,
        0.04691901430487633,
        -0.05680796504020691,
        -0.02459140680730343,
        -0.09071355313062668,
        0.020253196358680725,
        0.04244093969464302,
        0.039879489690065384,
        0.03274563327431679,
        -0.03630568087100983,
        -0.04837408289313316,
        -0.028736086562275887,
        0.008035223931074142,
        0.003795287571847439,
        0.04135178402066231,
        -0.009062465280294418,
        -0.06354706734418869,
        0.061955470591783524,
        0.02324405126273632,
        -0.11981727927923203,
        0.037517037242650986,
        -0.0169360488653183,
        0.06786870956420898,
        0.01678670011460781,
        0.0544179230928421,
        -0.007850521244108677,
        0.017434319481253624,
        -0.026289356872439384,
        -0.01899072341620922,
        -0.024929238483309746,
        0.05389155074954033,
        0.10587956756353378,
        -0.049906887114048004,
        -0.06119926646351814,
        -0.0008314182632602751,
        0.003773381933569908,
        0.05148765817284584,
        -0.06268876791000366,
        -0.09039390087127686,
        0.016668837517499924,
        0.05540243163704872,
        0.05753573402762413,
        -0.07047664374113083,
        -0.03673184663057327,
        -0.042901672422885895,
        -0.01690821908414364,
        0.037586864084005356,
        0.05623279884457588,
        0.04846607521176338,
        0.030674438923597336,
        0.09516559541225433,
        -0.06816425174474716,
        0.12222379446029663,
        0.007531560026109219,
        0.02570725604891777,
        -0.06902071088552475,
        0.010823888704180717,
        -0.02080000750720501,
        0.0413188636302948,
        0.05713844671845436,
        -8.64309015469189e-08,
        -0.05480874702334404,
        0.06785804778337479,
        -0.028371920809149742,
        -0.0667552798986435,
        0.08036477863788605,
        -0.03436361625790596,
        -0.04600565880537033,
        0.03460553288459778,
        -0.054566796869039536,
        -0.0023101260885596275,
        0.05834461376070976,
        -0.029277240857481956,
        -0.04651997238397598,
        0.007757638115435839,
        0.10018099844455719,
        0.04106662794947624,
        -0.06569775938987732,
        0.0781184583902359,
        -0.07718277722597122,
        -0.13198091089725494,
        0.013785037212073803,
        0.0830654725432396,
        0.08802247047424316,
        -0.05996321886777878,
        -0.0010771244997158647,
        0.023007981479167938,
        -0.004371899180114269,
        0.04088690131902695,
        0.12240026146173477,
        -0.015967322513461113,
        -0.06066538766026497,
        -0.03962942585349083,
        -0.01836532913148403,
        -0.030026884749531746,
        -0.01848583109676838,
        -0.06896589696407318,
        -0.02002198062837124,
        0.03750590980052948,
        0.03606462478637695,
        0.02918645553290844,
        -0.016241800040006638,
        -0.08223990350961685,
        0.011694767512381077,
        -0.007700304035097361,
        -0.061014991253614426,
        -0.04124118387699127,
        0.04607502371072769,
        -0.0595967099070549,
        0.035359058529138565,
        0.024021247401833534,
        -0.007759882602840662,
        -0.06025451049208641,
        -0.0035977119114249945,
        0.07322754710912704,
        0.027364864945411682,
        -0.030550241470336914,
        -0.011606376618146896,
        0.020842954516410828,
        -0.07444366067647934,
        0.05426802113652229,
        0.07639729231595993,
        -0.05038822442293167,
        -0.034281715750694275,
        -0.002018882194533944
    ]
}