{
    "id": "pAqGpoWLLZc",
    "title": "LED bulbs that flicker, and CFLs that almost never did",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2017-09-13T05:58:28Z",
    "video_url": "https://www.youtube.com/watch?v=pAqGpoWLLZc",
    "category": "Science & Technology",
    "tags": [
        "CFL",
        "fluorescent light",
        "LED",
        "fluorescent eyestrain",
        "light bulb",
        "lighting",
        "compact fluorescent lamp",
        "how do light bulbs work",
        "fluorescence",
        "ballast",
        "high pressure sodium",
        "metal halide",
        "HID",
        "discharge lamp",
        "filament"
    ],
    "views": 731597,
    "likes": 24815,
    "comments_count": 2295,
    "description": "You can support this channel on Patreon!  Link below While the CFL is pretty much done being a thing these days, it was a really great invention for saving energy.  But some people claimed they caused them headaches.  In this video, I explore the reason that fluorescent light can indeed cause headaches or eyestrain in sensitive people, and I explain why that wasn't an issue with the CFL.  Then we explore the modern LED bulb and how it actually is bringing the cause of this flicker back.    Technology Connections is a YouTube channel devoted to exploring how stuff works, and how our technological ancestors managed to push technology to where it is today.  You can support this channel on Patreon, here:    Please consider subscribing if you haven't already!",
    "description_links": [
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "This is a stroboscope disc used to verify the speed of a record players turntable. You can easily find these online and print them out. Under fluorescent lighting, these alternating white-black bars will appear stationary even though the turntable is rotating. This happens because the A/C electricity powering the light is a 60 hz sine wave, and each time it crosses the zero line, the light briefly goes dark. Essentially, fluorescent lights actually flash 120 times per second, and the spacing of these bars is calibrated so that if the turntable is going the right speed, they will move the same distance as their width with each pulse of light, which makes a blurred pattern appear thats completely stationary. Slight variations in speed will cause the pattern to appear to move. You can see this as I switch the turntable between 33 and 45 rpm. You may have noticed a similar effect while driving at night under common street lighting, particularly the orange-gold glow of high pressure sodium lamps. These lights also pulse 120 times per second, in the US at least, which can make slow-moving patterns appear on the wheels of vehicles driving past you. Sometimes the patterns move backwards which is particularly trippy. This stroboscopic effect is the primary reason that some people are sensitive to fluorescent lighting. Though its not directly visible, it can give some people headaches and cause eyestrain. But its important to note the the fluorescent-ness of the light source is not whats causing it. What I mean by this is that its very very wrong to assume that all fluorescent lights produce a strobing effect like this. In fact, nearly all CFLs used in your home dont. Heres the same disc on the same turntable with a garden variety CFL providing illumination. This time, the discs lines just blur together. CFLs have worked like this for a looong time. In fact, heres an old IKEA fluorescent lamp. Its so old it starts like this. (forced coughing) And yet, the lines still blur together. You might notice a very slight pattern in there that looks stationary, but even an incandescent light will produce such a faint pattern. In reality, these CFLs are just as flicker-free as the old bulbs of yore. But in an odd twist, many newer LED bulbs are re-introducing this stroboscopic effect. Some are far worse than others, and first let me say that Im glad the CFL is being replaced. I am in no way trying to say that LED bulbs are bad, and CFLs are somehow better. Of course, a huge reason to be pro LED is the lack of mercury in the bulbs. And the list goes on--the slow warmup and poor operation in cold weather of CFLs was annoying, and LEDs dont suffer from these problems. Poor color rendering indexes were common with cheap CFLs which caused their perceived quality of light to be not-so-great, whereas LEDs almost always have better color rendering characteristics. Dimmability of CFLs was generally questionable at best, and new LEDs go so far as to mimic the warming effect that incandescent bulbs naturally produce as their filaments burn less intensely. Theres virtually no reason to hold onto the incandescent lamp anymore. Even clear LED bulbs which look like they have filaments are cheap and widely available. So to explain why CFLs dont flicker and LEDs sometimes do, its important to look at the electronics that drive each of these technologies. Fluorescent lights, along with all other discharge lamps such as sodium vapor lamps or metal halide bulbs, have a pesky electrical characteristic known as negative resistance. Provide a set voltage to the lamp, and it will consume more and more current until it, well basically explodes--or if it can manage it, exhausts its electrical supply and trips a breaker. A ballast is therefore required to both strike the arc and start the lamp, and most importantly to limit the current it can receive and keep things nice and safe. In older fluorescent fixtures, this ballast was nothing more than a specialized inductive transformer, so-called magnetic ballasts. These are what is responsible for the humming or buzzing sound in older fixtures. A magnetic ballast sends the same 60 hz electricity to the tube, but with a limit in place. This means the light will pulse on and off 120 times per second, which generally isnt directly perceptible, but can cause eye strain in sensitive individuals. Now, magnetic ballasts have two huge drawbacks. One, theyre generally bulky, and two, the fact that they send straight AC current to the tube means the tube doesnt run as bright as it could because it spends a not-insignificant period of time producing no light at all. The pauses in light production reduce its overall light output considerably. When the Compact Fluorescent Light came along, the compact nature of these compact bulbs meant less actual glass tube was available in such a compact space. To compact a 16 watt 2 foot linear tube into a space as compact as an ordinary light bulb required some creative compacting action in the form of glass bending acrobatics. Compact. First was the curly-q nature of the tube itself. Forming the glass in a repeating spiral pattern increases its surface area tremendously, while still confining it into a small volume. Then there was the problem of the ballast. Remember, magnetic ballasts are bulky and heavy. A better solution was needed both to overcome size constraints and to increase the light output of such a small lamp. Enter the electronic ballast. These guys work entirely differently from magnetic ballasts and were, uh whats the word, oh, compact and lightweight. Electronic ballasts work similarly to the switched-mode power supplies you find in virtually everything today. Their first goal is actually to convert the incoming 60 hz AC power to DC, where its filtered with a capacitor. The ballast then converts this DC into very high frequency AC power, around 20 thousand hertz. Its this high frequency power thats sent to the tube. The phosphors that line the inside of the glass dont react instantly to UV emissions from the mercury vapor. In fact, theres a delay between when they stop receiving energy from the excited mercury molecules and when the stop emitting visible light. You can actually see this--the green phosphor is the usually the slowest, and you might have caught a slight green flash of light when turning a off a light fixture with a CFL if youve ever moved your eyes right at the same time. You see this because the red and blue phosphors stop producing light in a tiny fraction of a second, but the green phosphor hangs around a little longer. Anyway, the high frequency AC entering the tube of a CFL is literally too fast for any of the phosphors, and the delayed action bridges the gap between pulses. The result is that the light provides nearly constant illumination, and the stroboscopic effect is essentially eliminated. Which can be proven by using one of these do-dads. Most newer linear fluorescent fixtures also use an electronic ballast. Even the old fashioned T12 tube will see a significant increase in light output and efficiency if high frequency A/C switching is applied. For this reason, ceiling light fixtures using linear tubes are nearly always equipped with an electronic ballast these days. Meanwhile, LED bulbs require a different kind of circuitry to make them work. LEDs only work with direct current, so for a bulb on an AC supply, this AC needs to first be rectified into DC using a bridge rectifier. Its not as simple as sending DC power through the chips, though. Without the proper voltage, the LEDs with either be instantly destroyed or they wont work at all. See LEDs have a very narrow range of operating voltage, bumping it up by as little as half a volt will dramatically increase current consumed. Drop it much below and it wont light up at all. Because of this, they also need a ballast of sorts. Usually these are referred to as drivers. The most important thing the driver has to do is limit the current that passes through the chips. Without a way to limit the current, any voltage above an LED chips forward voltage will cause an exponential increase in current flow, which will make the diode run extremely hot and severely shorten its life. In many conventional LED bulbs meant to replace a 60 watt incandescent, there will be 9 or 10 chips, each rated around a watt. These are usually arranged in a circle, and are attached to a heat sink. The heat sink absorbs the heat they produce, and spreads it out over a wide area. This bulb contains nine chips. Each of these chips actually contains three diodes in one package, so theres a total of 27 diodes arranged in series. Most of the blue diodes used in white LED chips--the yellow circle is a phosphor which converts some of the blue light into red and green, thus producing apparently white light--have a voltage drop of just over 3 volts. The driver therefore needs to produce at least 81 volts, and indeed it produces about 85. The driver must also limit the current going through this chain of diodes to ensure they dont overheat and waste energy. It also uses a large capacitor hidden in the base to store and release some energy between the pulses of AC power coming from the socket through bridge rectifier. This helps to eliminate the stroboscopic flicker. This capacitor is rather large and its one of the biggest component of the driver. But theres also a way to cheat a little bit. LEDs can be driven off a direct voltage supply if the voltage is equal to the voltage drop across the LED chip. Many so-called filament LED lamps are designed with a bunch of blue diodes in series along a glass rod covered in the yellow phosphor, and the voltage drop across them adds up to just about the same as the AC line voltage powering the lamp. If you dim one of these, you can see the individual diodes along the filaments structure. These tiny diodes will also have a voltage drop of about 3 volts, and since 120 volts is whats coming into the socket here in the US, that could be divided across 40 individual diodes. Each of these rods has 20 diodes or so in a line, and two rods are wired in series, with another series-pair being in parallel. In European countries running on 230 volts, all four of these rods will be wired in series. This cheat is what allows the driver to be so small that it can be crammed into just the space inside the socket. This creates a beautiful bulb that you might not even know its an LED unless someone told you. But theres one huge drawback. Theres so little space for the driver that it doesnt really do all that much. In reality, nearly all it does is use a bridge rectifier to convert the AC into pulsed DC. Thats just taking this waveform and flipping the bottom half back up. This means these bulbs will often exhibit stroboscopic flicker just as bad or worse as a fluorescent bulb running from a magnetic ballast. In fact, that footage from earlier? It was from this bulb, just with the color temperature messed up a bit. And now, a note from the editors desk. Oh, hello, Im the editor, and this is my desk. Id just like to clarify that Im sure the driver is doing more than just rectifying the AC into pulsed DC. Its actually a complicated little thing with a driver chip, an inductor of sorts, and other goodies. Whats more likely the cause of the flicker is simply that the drivers tiny little filter capacitor, a requirement with the driver concealed in the socket, cant store enough charge to provide completely steady DC voltage throughout the system as the incoming AC voltage crosses the zero line. The system voltage thus dips slightly between each incoming pulse. This is also probably the cause of the slight flicker produced by the CFL, but the immensely larger filter capacitor is able to provide much more stable DC voltage to the rest of the ballast. In regards to the number of diodes along the glass, Im sure thats geared towards line voltage as it is common for European bulbs to have all the rods wired in series, but the driver is probably still providing a different voltage for them. Im thinking it just makes the design of the driver a whole lot simpler and cheaper if its got to produce roughly the same voltage as it receives. If we have a qualified electrical engineer in the comments, please do tell us if Ive got this all wrong. Im not even going to get into how these bulbs work with dimmers because theres enough in there for a whole other video. So then, heres my point. If you are an individual with photosensitive epilepsy who has legitimately been affected by fluorescent lighting in the past, this type of LED bulb probably isnt for you. But if youve casually avoided compact fluorescent lights believing them to cause eye strain and youve been around these lights and havent noticed a problem, perhaps it wasnt the, as I said, fluorescent-ness of the light that caused your headaches. As Ive demonstrated, most CFLs produce light just as well--meaning consistently and without flicker--as an incandescent bulb. But some newer LED lamps actually produce really strong strobing light. If these dont affect you, thats great! But it also means that perhaps you shouldnt have been so averse to using the CFL. One easy way to tell if a bulb has high flicker is by bringing a smartphone camera right up to the bulb. With bright light the camera has to increase its shutter speed a lot, which when combined with the way it captures the light via a rolling shutter, will make alternating bright dark bands appear all over the image. If bands are barely visible, then the flicker is very minor. Me again. I discovered while shooting the B-roll for this video that the old IKEA bulb exhibits less flicker than an incandescent. You can even see that going back to the stroboscope disc footage. These pictures shot with my phone confirm it. While were looking at pictures, light bulb manufacturers have figured out how to produce flexible filaments, and this one on display in a retailer is shockingly bad! However, one cool thing about the flexible filament is that you can see the printed circuit in the dark portion provided by the absurd flicker of the bulb, and you can see here that the diodes are wired as two series chains, with each trace skipping every other diode. This means there are two parallel circuits in each piece of filament spaghetti. Now, Ive long maintained a personal theory that the folks most opposed to the compact fluorescent were really more averse to the blueish light of daylight color temperature bulbs. In fact, I hate those things. I have a whole drawer full of them because the previous owner of my place loved them, and I just cant stand the coldness of their light. I wont go so far as to say they give me a headache, but I dread being around them. Because a well-made warm-white balanced CFL is often indistinguishable from an incandescent, particularly if the bulb is hidden behind a shade, these people might have never noticed that they were under fluorescent lighting unless it was a cool white or daylight color temperature, where it couldnt possibly be an incandescent. But thats just conjecture. In reality, the CFL is on its way out, and Im happy to hear it. So many great designs of LED bulbs are on the market today, not even mentioning smart bulbs or color-changing bulbs that are only possible with LEDs inside. But the CFL was a great innovation that helped us start saving energy at home years before LEDs came down in cost. And if people just took the effort to recycle them, the mercury wouldnt have been much of a concern. But Ill admit, a 100% recycling rate is a pipedream. Best avoid the problem all together. Thanks for watching. I hope you learned something interesting today! Im closing this video out with a thank you and announcements. To my subscribers, wow, Im so thrilled this channel has passed 35 thousand! It still doesnt seem real. Having a successful YouTube channel has always been a dream of mine, and its slowly becoming reality. But as you know, making videos is really hard. Im doing my best to keep videos like this headed your way, but I work full time and its hard to do two things at once. Which is why starting at the end of November, Im gonna stop doing two things at once. Im gonna concentrate on videos. Hopefully Ill be making weekly videos by the start of next year, as Ill have 4 days a week to do this, and not just 2 if Im lucky. Theres a lot of stuff up in this noggin and eventually it will make its way out and to your eyeballs and ears. If all goes to plan, my next video will be on Philo Farnsworth and the invention of electronic television. Im overwhelmingly flattered that some people have asked if I have a patreon page. Well, I wanted wait and see if these types of videos could earn me a following. Apparently they have and now, I do have a patreon. In fact, its right over there. Im really new to this whole thing and dont really know what Im doing, but if youd like to become a patron you will immediately be rewarded with thanks and good vibes. My biggest struggle right now is finding time to do more management stuff, like make playlists and set up a Patreon. But if it works, Ill be spending all of my time making videos for you. Thanks for watching.",
    "transcript_keywords": [
        "light",
        "LED bulbs",
        "LED",
        "bulbs",
        "voltage",
        "LEDs",
        "bulb",
        "fluorescent lights",
        "CFLs",
        "CFL",
        "fluorescent",
        "CFLs produce light",
        "ballast",
        "light bulb",
        "diodes",
        "driver",
        "lights",
        "Compact",
        "Compact Fluorescent Light",
        "LED lamps"
    ],
    "transcript_entity_values": [
        "zero",
        "CFL",
        "27",
        "CFL",
        "4 days",
        "just over 3 volts",
        "about 3 volts",
        "T12",
        "120 volts",
        "9",
        "the Compact Fluorescent Light",
        "years",
        "two",
        "European",
        "20",
        "three",
        "2",
        "at least 81 volts",
        "about 85",
        "the start of next year",
        "Patreon",
        "today",
        "YouTube",
        "weekly",
        "16 watt 2 foot",
        "CFL",
        "Philo Farnsworth",
        "100%",
        "AC",
        "the end of November",
        "US",
        "40",
        "first",
        "one",
        "all four",
        "these days",
        "10",
        "One",
        "between 33 and 45",
        "DC",
        "35 thousand",
        "nine",
        "IKEA",
        "120",
        "230 volts",
        "First",
        "second",
        "60 watt",
        "night",
        "20 thousand",
        "60 hz",
        "60 hz",
        "as little as half a volt"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "LAW",
        "DATE",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "FAC",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL"
    ],
    "vector": [
        -0.010762060061097145,
        -0.018614070490002632,
        0.007479972671717405,
        0.07182233780622482,
        -0.015621031634509563,
        0.07016271352767944,
        0.06152088940143585,
        0.06592341512441635,
        0.026319723576307297,
        0.06865924596786499,
        -0.004739505238831043,
        0.003415472339838743,
        -0.013694828376173973,
        0.010323579423129559,
        -0.012105789966881275,
        -0.018613196909427643,
        -0.06560224294662476,
        -0.056702837347984314,
        -0.07493751496076584,
        -0.011153466068208218,
        0.0064326077699661255,
        -0.13547289371490479,
        -0.07743174582719803,
        0.04458700865507126,
        -0.0528993234038353,
        0.07328213006258011,
        -0.01250328216701746,
        -0.06580416113138199,
        -0.04928804561495781,
        -0.0005818739882670343,
        -0.0536317452788353,
        0.0874524638056755,
        -0.0668695941567421,
        0.020069938153028488,
        -0.06417054682970047,
        -0.04583583027124405,
        0.002692323410883546,
        0.013359946198761463,
        -0.0033579333685338497,
        0.0033941881265491247,
        -0.011773398146033287,
        -0.039112016558647156,
        0.03599289804697037,
        0.024548228830099106,
        0.015003856271505356,
        -0.019181955605745316,
        0.08994563668966293,
        -0.048319995403289795,
        -0.08522794395685196,
        -0.04139132797718048,
        0.007974361069500446,
        -0.0067076911218464375,
        0.06060350686311722,
        0.008823576383292675,
        0.03224026411771774,
        0.032650113105773926,
        -0.029739638790488243,
        0.08256520330905914,
        0.041419971734285355,
        0.006113190669566393,
        0.018601421266794205,
        -0.05633465573191643,
        0.018141623586416245,
        -0.02182471752166748,
        -0.0676058754324913,
        0.03809548541903496,
        -0.030920803546905518,
        -0.0283066239207983,
        0.08320486545562744,
        -0.03106054477393627,
        -0.04693738371133804,
        0.0011050475295633078,
        0.03483081981539726,
        -0.004759866278618574,
        0.03576349839568138,
        -0.019110072404146194,
        0.040136583149433136,
        0.03321564570069313,
        0.03948571905493736,
        -0.01833263784646988,
        0.07690034061670303,
        -0.032420556992292404,
        0.04649778828024864,
        0.04644354060292244,
        0.08650036156177521,
        -0.007576896343380213,
        0.11071110516786575,
        0.05856414884328842,
        -0.06883402168750763,
        0.05769472196698189,
        -0.09038564562797546,
        0.031398773193359375,
        0.03573929890990257,
        -0.00624477956444025,
        -0.018869811668992043,
        0.02178840897977352,
        0.05277125909924507,
        -0.043038684874773026,
        0.03150397166609764,
        0.05239076539874077,
        0.05276849493384361,
        -0.06519567966461182,
        0.056281402707099915,
        0.11234278231859207,
        -0.022369103506207466,
        -0.03333490714430809,
        0.019363943487405777,
        0.07971711456775665,
        -0.043466947972774506,
        -0.00286477361805737,
        0.0020935290958732367,
        0.06922188401222229,
        -0.12086493521928787,
        -0.035913240164518356,
        -0.06915362924337387,
        -0.03573749586939812,
        0.029035918414592743,
        -0.014202403835952282,
        0.025984300300478935,
        0.008394291624426842,
        0.04217734932899475,
        -0.012334750965237617,
        -0.043286439031362534,
        -0.02596273459494114,
        0.0809498280286789,
        -0.057255785912275314,
        -0.04649778828024864,
        3.961859711388544e-33,
        -0.053305771201848984,
        0.022935107350349426,
        0.000743120675906539,
        -0.062369491904973984,
        0.002190203173086047,
        -0.04267272725701332,
        -0.02398996241390705,
        0.12940344214439392,
        0.02452864684164524,
        -0.03212711960077286,
        0.09305299818515778,
        0.0517374649643898,
        0.031160490587353706,
        0.048338115215301514,
        0.002145378850400448,
        -0.08590584248304367,
        -0.04122534021735191,
        -0.02648485265672207,
        -0.015365362167358398,
        -0.054339904338121414,
        -0.01506260596215725,
        -0.03189026564359665,
        0.07372618466615677,
        -0.05046812444925308,
        -0.022934919223189354,
        -0.003509721951559186,
        -0.06582676619291306,
        -0.030490601435303688,
        0.047830864787101746,
        0.013680392876267433,
        0.034268852323293686,
        0.015992317348718643,
        0.00772507581859827,
        -0.050129491835832596,
        0.02711060643196106,
        -0.029347844421863556,
        -0.007445443421602249,
        -0.07716142386198044,
        0.03732098266482353,
        0.07266438752412796,
        -0.04039688780903816,
        0.06580158323049545,
        -0.07407782226800919,
        0.08738754689693451,
        0.01370159536600113,
        0.0969536304473877,
        -0.07272010296583176,
        0.06925587356090546,
        0.06509781628847122,
        0.019709432497620583,
        -0.042477164417505264,
        0.01958005502820015,
        -0.03008439764380455,
        0.027321141213178635,
        0.07380270212888718,
        0.06686018407344818,
        -0.062398362904787064,
        -0.07102228701114655,
        0.004531589336693287,
        -0.03043450228869915,
        0.036054227501153946,
        0.004519730806350708,
        -0.06184443086385727,
        -0.06002665311098099,
        -0.01300736516714096,
        -0.03487233445048332,
        0.020670846104621887,
        0.036530401557683945,
        -0.0745953768491745,
        -0.09799214452505112,
        0.008476104587316513,
        -0.009969300590455532,
        -0.03805995732545853,
        -0.029418889433145523,
        -0.03461863845586777,
        0.0482119657099247,
        -0.024244233965873718,
        0.11693696677684784,
        -0.0827132910490036,
        -0.06686138361692429,
        0.028801146894693375,
        -0.10215988010168076,
        -0.009821263141930103,
        -0.05248728767037392,
        0.022257141768932343,
        0.035051826387643814,
        -0.019523993134498596,
        -0.07385873794555664,
        -0.09316466748714447,
        -0.038103070110082626,
        0.11514142900705338,
        0.07161067426204681,
        0.04521045461297035,
        -0.0061352145858109,
        -0.04559222236275673,
        -3.766224390633099e-33,
        -0.019947530701756477,
        -0.0466763898730278,
        -0.05483958497643471,
        0.01883358135819435,
        0.10138744860887527,
        -0.0046710241585969925,
        0.023003993555903435,
        -0.02414378896355629,
        0.06056977063417435,
        -0.0010888651013374329,
        0.06470084190368652,
        -0.026542823761701584,
        -0.10582419484853745,
        0.0075246961787343025,
        -0.04833376035094261,
        -0.09128744900226593,
        0.00035559898242354393,
        0.06757708638906479,
        0.026220858097076416,
        0.01510636042803526,
        0.028990644961595535,
        0.019475121051073074,
        -0.07497996091842651,
        -0.07830823957920074,
        -0.01412439625710249,
        0.059591397643089294,
        0.006877475418150425,
        -0.004218069836497307,
        -0.05725669488310814,
        0.06904871761798859,
        -0.06558402627706528,
        0.10522059351205826,
        0.009466283954679966,
        0.014113863930106163,
        0.010648922063410282,
        0.0336960069835186,
        -0.03367665037512779,
        -0.0366012267768383,
        -0.04667813703417778,
        -0.017957573756575584,
        0.06879743933677673,
        0.10436850786209106,
        0.027418678626418114,
        -0.049373775720596313,
        -0.042643506079912186,
        0.07094177603721619,
        -0.10248535871505737,
        0.019992316141724586,
        -0.035150039941072464,
        0.061392586678266525,
        0.11220118403434753,
        -0.01067529059946537,
        -0.062006786465644836,
        -0.023851733654737473,
        -0.0558350533246994,
        -0.03248134255409241,
        0.019268808886408806,
        -0.01474427804350853,
        0.05936405435204506,
        0.02464796043932438,
        -0.01317913830280304,
        -0.0076249451376497746,
        -0.05494501069188118,
        -0.01882089674472809,
        0.04994853213429451,
        -0.018062297254800797,
        0.020970406010746956,
        -0.03916224092245102,
        0.06268390268087387,
        -0.04364040121436119,
        0.07253601402044296,
        -0.005774765741080046,
        -0.049544285982847214,
        -0.007082587573677301,
        -0.0100441575050354,
        0.06764648854732513,
        0.008733950555324554,
        -0.0037266311701387167,
        -0.08828163146972656,
        -0.006856878753751516,
        0.03663741797208786,
        0.04127511754631996,
        0.06671557575464249,
        -0.02056308463215828,
        -0.05540298670530319,
        -0.04521733894944191,
        0.023466579616069794,
        -0.049719732254743576,
        -0.07155151665210724,
        0.022056477144360542,
        0.04341896250844002,
        0.0636192187666893,
        -0.021088454872369766,
        0.06061761453747749,
        0.14736038446426392,
        -5.4586003273016104e-08,
        -0.09663103520870209,
        0.010357268154621124,
        -0.10233908146619797,
        0.023664863780140877,
        0.046717382967472076,
        -0.03381402790546417,
        0.10184548795223236,
        0.012110349722206593,
        -0.05751381441950798,
        -0.05704532563686371,
        0.035874854773283005,
        0.024836741387844086,
        0.08376701921224594,
        0.0003175920865032822,
        0.08275853842496872,
        0.01657777652144432,
        -0.05958198755979538,
        0.01631820574402809,
        -0.03171408921480179,
        0.0060906740836799145,
        -0.06511465460062027,
        0.012834056280553341,
        0.03627029061317444,
        -0.003055999521166086,
        0.01430568192154169,
        0.0229830052703619,
        0.07372364401817322,
        0.09273058921098709,
        -0.0013237686362117529,
        -0.06148917227983475,
        -0.008677826263010502,
        0.012744051404297352,
        0.023191656917333603,
        -0.06474923342466354,
        -0.03728318586945534,
        -0.0486234687268734,
        -0.02618430368602276,
        -0.0504414401948452,
        -0.01340558286756277,
        -0.009251800365746021,
        -0.05162353813648224,
        0.01612045429646969,
        -0.08018741011619568,
        0.031048830598592758,
        0.015721585601568222,
        -0.04875984042882919,
        0.027304457500576973,
        0.033976759761571884,
        -0.06717342883348465,
        0.04556572437286377,
        0.019951913505792618,
        0.039580050855875015,
        -0.017380109056830406,
        -0.056190069764852524,
        -0.05244063213467598,
        -0.04716005176305771,
        0.043282393366098404,
        0.08735927939414978,
        -0.12953507900238037,
        -0.04231895133852959,
        0.02368854731321335,
        0.023058122023940086,
        0.033730149269104004,
        0.0408591590821743
    ]
}