{
    "id": "PBFPJ3_6ZWs",
    "title": "LED Experiments: Making Holiday Lights Less Garish",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-11-26T14:38:30Z",
    "video_url": "https://www.youtube.com/watch?v=PBFPJ3_6ZWs",
    "category": "Science & Technology",
    "tags": [
        "LED",
        "light emitting diode",
        "christmas lights",
        "Xmas",
        "lights",
        "holiday lights",
        "fairy lights",
        "decorations",
        "ornaments",
        "holiday",
        "twinkling lights",
        "incandescent",
        "multi-colored",
        "led blue"
    ],
    "views": 223535,
    "likes": 10992,
    "comments_count": 1438,
    "description": "You can support this channel on Patreon! Link below      How could I forget about the hmm-hmm light experiments? And/or; holy hard drives its already Decemberween? My how the year has passed in a flash. Just like these lights! HA! Yeah, so heres the thing--I owed you this video. And honestly, the results were great! I have some more work to do (assuming no one listens to my plea toward the end) but now I know that what I want is at least vaguely possible.  Technology connections on Twitter (Im just as weird on the social Internet as I am here on YouTube):   The TC Subreddit (warning: Im not good at Reddit)   Technology Connections 2 (my second channel where I upload weird stuff from time to time)   Oh--and a music credit! The closing music was \"We Wish You a Merry Christmas (Instrumental Jazz)\" by E's Jammy Jams. You can get it for free--right now!--from the YouTube Audio Library. And here's a secret--my normal outtro song? It's from there, too. Just search \"Floaters\" and you'll find it. Don't tell anyone.  You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!   And thank you to the following Patrons: Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, The War Academy, Yaniv, neko, Daniel Ch, Lee Wallbank, Grayson Lang, Neil Bronner, Carl Yazbek, Jeffrey Grajkowski, Christopher Splinter, Eric Merrill, Stefan Berndtsson, Michael Sims, Seth Kneller, Clint Eisinger, Jesse G. Donat, Christopher Leidich, Mike Friedman, Svante, Andr Waage Srensen, Ed McCloskey, Jasper Thun, Camilo Rodrigues, Dusan Dzelebdzic, Sam Douglas, Sam Redfern, Sen, mark barratt, Tully, Violet Moon, Duncan Ward, Tobias Faller, Justin Smith, Corey A Hudson, EpicLPer, Luc Ritchie, Michael Dragone, Manfred Farris, Eric Romero, John Laur, Patric Bates, Sven Almgren, Lutz Broska, Jrgen Kieser, Nicholas, Ewen McNeill, thefanification, Nicolas, Albin Flyckt, Michael A Kalfas II, Michael Bernstein, Kevin Kostka, Shame Zamora, Brad Wilmot, John Bailey, Alex Ilyin, Miles H, Deovandski Skibinski Junior, Andrew \"FastLizard4\" Adams, Avi Drissman, Jens Bretschneider, Phil Taprogge, Sam, Rich Jeanes, Jonathan Skowronek, Tim Grov, Pieter van der Eems, Philip Kvist, Brian Condron, Peter Jerde, Torin Zaugg, James Watson, Vince Terranova, Jason Nevins, Andrew Montagne, David Scott, Mike Nichols, MrSonicOSG, Brandon Enright, James Fialho, Christian Torelli, Sunchild, Kim Rypstra, The Paul Allen, toasterking, Seth Robinson, Ralph, Pavel Soukharev, Forrest Miller, Patrick Quinn-Graham, Max Zelinski, Troy Kelly, Ulti, Jason Brandy, Norman Tatlock, Jesper Jansen, Andrew Johnson, Goolashe, Rmy GRANDIN, ce keen, Jake Shep83, Nick Pollard, Drew Holm, David Grossman, Ben Auch, Jeff Puglisi, Andy S, Robert, Johan Greefkes, Jacob Dixon, Matt Luebbert, Alex Corn, SonOfSofaman, Brent Higgins, Rob Kefford, Roger Baker, Alexander Schrder, Andreas Skagestad, Eric Butterfield, James Holmes, Tim Skloss, James-Ross Harrison, Sean OCallaghan, Lee Wallbank, Jonas, Colin Cogle, Kyle Matheis, Krzysztof Klimonda, Aaron Rennow, Gantradies, Ted Flores, Yota Ninja, Tee Jay, Jakob, Bee Jay (thats a fun coincidence, a Tee Jay and a Bee Jay), Francesco Lezi, Countzero, Ray Chang, Kodapan, L0j1k, Chris Connett, Guillaume Tremblay-Beaumont, Eduardo Kaftanski, Winfield Trail, Miles H, Eric Nelson   Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Its time for things to get a little more... festive around here. Ha ha, yes! Excellent. Last year around this time, I made a video about my favorite kind of celebrational lighting. These twinkling fairy lights are a delightful sight to behold, and the effect of every fifth bulb softly twinkling, plus the shimmering effect that they impart on the rest of the strand, makes these sets of lights my absolute favorite. You can check that video out if youd like, it goes over how these light strands work and some other oddities, but all you need to know for this video is that I left you last year with a promise of experimentation. See, Im all for LED festive lighting. Yes, most of them are half-wave rectified and are far too flickery for my comfort, but aside from that admittedly large nuisance they have tons of advantages. You can string a whole bunch end-to-end because they use so little energy. Theyre probably inherently safer because they use so little energy. Theyre cheaper to operate because they use so little energy. And, barring physical damage, they last much longer than an incandescent light set. Another huge advantage is that they use so little energy. But, theres one thing about them thats kept me from adopting LED light strands in any of my holiday displays. And, uh, its these guys right here. Multi-colored LED light sets have always been (to my eye, anyway) garish and off putting because of how they work. A light emitting diode will on its own produce monochromatic light. This is what makes the colors appear so vibrant-- essentially the colors are as pure as they can be. Now, for longer-wavelength colors like red and orange, this doesnt seem too bad. But green, and particularly blue, are just too intense for my comfort. Now I might not mind these so much if the blue were simply toned down a bit, but heres the thing. White LEDs used in Hanukkah lights are getting really good! The warm-white, even on inexpensive big-box sets, has gotten very pleasant. Yeah its nothing youd want to use for general lighting --the color rendering index on them is quite poor-- but for decorative light, its great. So that got me thinking. Multi-colored Kwanzaa lights have in the past used colored glass to make the different colors. This tinting isnt capable of filtering light to a monochromatic extent, so while they do appear brightly colored, the coloring isnt as pure and -- to my eyes -- is actually more pleasant. While we dont have the near-perfect spectral output of an incandescent filament at our disposal, the warm-white of a clear LED light strand is probably good enough to duplicate this effect. So, thats what I set out to do. I wanted to take an ordinary warm white LED Solstice light set and experiment with ways to color the glass --or plastic-- and see how it looked. Before we start, allow me to rehash a brief tangent from the last video. Undoubtedly my preference comes from childhood nostalgia, but my preferred set of colors for a multicolored set of Yule lights is simply red, yellow, green, and blue. These days this color combo is getting rare, as most combos usually shift yellow into an orange (though some may call it amber--Im not one of them) and add a purple or pink in addition to the red, and this gives them a pastel-like color palate that to me seems more appropriate for the holiday involving sentient rabbits. Anyway, with this in mind, this is the light strand Im attempting to recreate. Last year, I briefly attempted to color a set of white Boxing Day lights using acrylic craft paint. I ran into some issues which, not surprisingly, I ran into again. Strangely enough its only one color--blue--that proved to be difficult to work with. Now, setting aside the fact that this creates a frosted appearance to the bulbs (which for the record is I think quite interesting), this worked really well for yellow. Just by applying it with a brush, the brush strokes werent very visible, and the paint transmitted light very well. Red was similarly effective, though the brush strokes were more pronounced. Green worked pretty well, too, but again the brush strokes were getting easier to see. But blue--that didnt work at all. The blue paint is simply too opaque for the light to shine through. But, there were areas that seemed to work. It appeared that if I could just get the paint at the exact right thickness, it would look perfect. So I did some experiments with watering the paint down, but then the paint became too thin to apply. Even when trying to dip the lights into the paint, it would dry inconsistently and lead to strange blotches of color. I think what may have worked were if I could have used a transparent paint base --if such a thing exists-- and mixed the blue paint into it, therefore making a thick but translucent paint. But, thinking along those lines, I bought some spray paint. Just for a quick test, I shot the lights with yellow which looked great! Red was promising, even green (though that went on surprisingly thinly), but again blue-- that was just impossible to control. Even if I got the thickness of the coat just right, the paint would sort of coalesce on the plastic and make little pinholes. But eventually, I found success. Take a look at these. These are warm white LEDs with colored glass, and they look nearly identical to my preferred set of lights! Finally I had the answer. And the answer is Sharpies. Thats right, these are colored in with Sharpies and nothing more. I was quite surprised at how well this worked. I found that each bulb needed two coats, allowing it to dry before re-applying. Yellow didnt seem to need two, but I did it for good measure. Now of course, there are unknowns here. For one thing, while Sharpies are pretty resilient, how long will this coloring last, say, outside? Will the sun fade it and how quickly? Some of these concerns arent necessarily unique to these lights. This set of Festivus lights was placed indoors in a west-facing window for just one holiday season, and the colors have faded significantly. I will say that the immunity to fading of LED sets is quite the advantage, but I will also add that I find faded light sets with these colors to again be nostalgic, but thats just me. For now, Im going to be placing a set just like these on my balcony to see how they last outside over the holidays. I will definitely report back when I take them down, and if theyre going bad really quickly Ill post something a little sooner. But honestly, their longevity isnt my biggest concern. This was merely a proof of concept for me. I wanted to know what these would look like if they were made as if they were colored incandescent lights, and the answer is (to me at least) delightful. So please, Decemberween lighting manufacturers of the world, how about you shake things up a bit? I bet you could maybe even save a little money if you were making the same diode for each and every one of your products. And to address the fading issue, you have a great advantage! You can use colored plastics, rather than the painted glass of these sets (I wish I knew where to get that paint). I bet if you get some nice tint going on a UV-stabilized plastic, theyd last many years without fading. You could even market these as some sort of premium color! Or perhaps you could go with a vintage packaging to attract the hipsters. Just please--I want my multi-colored LEDs to look just like this! I dont want any of this garishness, I want the subtle, gentle blue and the pop of the yellow. Can we make that happen? Probably not. But hey, theres good news anyway! Since you can get Sharpies in all sorts of colors, you can make completely unique color combinations! Want green, purple, and yellow for Mardis Gras? Go for it! Want pink and white for Valentines? Go for it! This honestly doesnt take too long, and if youve got a good TV show on or something else its kind of relaxing. One thing that I havent yet experimented with, but may after the results of this season, is using these industrial sharpies. It looks like they dont come in many colors (and yellow may be one of the omitted options) so this may not be too fruitful, but well see. But let me reiterate. Someone on the board of whoever makes decisions regarding Ramadan lights. Please consider doing this. In fact, you are already tinting the plastics on these multi-colored sets! Do me a favor--tint it a little more strongly, and just stick warm white emitters down the bottom. Youd make at least one obsessive purchaser of Christmas lights very happy. Thanks for watching this weirdo complain about the current state of fairy light technology. Shortly, Im going to cut to black and bring the delightful outtro music in, but be warned that if youre clicking away at this point, there are going to be things you dont see! Like more facts! Maybe some bloopers! Or other things! I have lots of fine people to thank for making this channel possible, and they are often accompanied with bonus facts et cetera. Speaking of, This channel is made possible by the wonderful people who support it on Patreon. Thanks to the support of people like you, Technology Connections is free to make weird stuff like this without fear of repercussions from our algorithmic overlords. If youd like to pledge some support to the channel and get perks like early video access, exclusive content, and the inside scoop on the latest projects, please check out my Patreon page. Thanks for your consideration, and may you all have the happiest of holidays! Cue the music! disturbingly smooth jazz Wait, no, thats thats not right. a jazz rendition of We Wish You a Merry Christmas You may have noticed the multi-colored twinkling light sets behind me. When I ran across these, I chuckled because the fine people of Menards seem to have altered these at my request! Of course, I doubt it, but Im pretty sure that last year there was a fifth color in these sets--purple. Theyve removed that so the set is almost exactly what I want--sadly the orange is still orange. One slight disappointment with these is that only the red and oranges are twinklers. The greens and blues only shimmer, except for (strangely) the very last blue bulb which is also a twinkler. Not sure why, but two of two sets are like this. Oh right, Menards, so if you want to find these twinkling sets, the cheapest place Ive found to get them is at Menards. Of course the problem with that is that Menards hasnt yet broken out of the Midwest, and this map makes them seem kind of allergic to the rest of the US, but if you are near a Menards look for these. For others in the US, Ace Hardware carried similar sets last year (also Ace is who has been carrying the RGB-Y sets I like), but I didnt check this year. The Home Depot does not appear to carry them, and I havent checked Lowes. Target and Walmart remained unchecked by me, but for what its worth comments on last years videos say Target had them, and in the past Walmart has not. But, advice for all around the world, is to look for the term twinkling. This seems to be the universal descriptor for these kinds of sets. Of course, you can buy them online if you can find them, but if you have the option to purchase them in a brick-and-mortar store, Id suggest you go that route as you can save quite a bit of money. These sets are still going for $4.99 where you Save Big Money. And on that note, I was happy to see that twinkling LED sets are now a thing! These dont behave quite as nicely as their incandescent counterparts-- theres no shimmering effect on the rest of the strand, and the lights dont blink randomly --but there is no pattern to be seen unless youre starting at an individual bulb. They each blink at their own rate. So, good work! I look forward to 2019s new and improved electric lights on strings. music gets louder, then fades ..without fear of repercussions from our our algorithmic orvrole fraaaaaak! Ughhhhh, that was so close ...even on inexpensive big boxts. Big bots. Big bots. Essenshully, (sigh) We were doing pretty well, and then we screwed it up. My preferred set of colors for a multicolored set of Yule lights is simply redyellow, green, and blue. Redyellow. Why did I say redyellow? Theres a comma between red and yellow. This set of Festivus lights, wu. this joke may not be worth it. smooth jazz strikes again",
    "transcript_keywords": [
        "lights",
        "light",
        "sets",
        "set",
        "LED light",
        "LED light sets",
        "light sets",
        "colors",
        "paint",
        "LED",
        "color",
        "LED sets",
        "light set",
        "LED light strands",
        "LED Solstice light",
        "blue",
        "Multicolored LED light",
        "Solstice light set",
        "twinkling LED sets",
        "yellow"
    ],
    "transcript_entity_values": [
        "Boxing Day",
        "The Home Depot",
        "Kwanzaa",
        "the holidays",
        "half",
        "Ughhhhh",
        "wu",
        "Festivus",
        "only one",
        "4.99",
        "Hanukkah",
        "two",
        "last year",
        "Christmas",
        "Ace",
        "RGB",
        "Valentines",
        "Mardis Gras",
        "Patreon",
        "Last year",
        "this season",
        "2019s",
        "at least one",
        "US",
        "this year",
        "one",
        "last years",
        "Technology Connections",
        "Green",
        "Yule",
        "fifth",
        "One",
        "Lowes",
        "Target",
        "Decemberween",
        "Menards",
        "Target",
        "Ace Hardware",
        "Walmart",
        "Midwest"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "GPE",
        "PERSON",
        "GPE",
        "CARDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LOC"
    ],
    "vector": [
        -0.11402634531259537,
        -0.01119191013276577,
        0.021384576335549355,
        -0.03451944515109062,
        0.0705098807811737,
        0.023379072546958923,
        0.03692181780934334,
        -0.03610355406999588,
        0.03440382704138756,
        -0.08995485305786133,
        -0.011356452479958534,
        0.024692602455615997,
        0.03459998965263367,
        -0.024663327261805534,
        0.02635704167187214,
        0.010914613492786884,
        0.022382406517863274,
        0.032615069299936295,
        -0.0682704970240593,
        -0.04168816655874252,
        0.040247540920972824,
        -0.06638815253973007,
        -0.02495752088725567,
        -0.005314262583851814,
        -0.014851211570203304,
        0.04850061610341072,
        -0.03628993406891823,
        0.000977076357230544,
        -0.060958169400691986,
        -0.004460840951651335,
        -0.002189920749515295,
        0.07582895457744598,
        -0.021188287064433098,
        -0.06806141883134842,
        -0.06347203999757767,
        -0.03327886387705803,
        -0.06864042580127716,
        0.014315865933895111,
        -0.012189837172627449,
        0.010833743028342724,
        0.03440891578793526,
        -0.026992788538336754,
        0.04454997926950455,
        -0.05509331449866295,
        -0.04344559833407402,
        -0.009338490664958954,
        0.015564472414553165,
        -0.06908897310495377,
        -0.0463549941778183,
        -0.024942174553871155,
        -0.05533767491579056,
        0.0027602659538388252,
        0.03828716650605202,
        0.06669281423091888,
        -0.06012880802154541,
        0.002116546733304858,
        0.04120360687375069,
        0.04652394354343414,
        0.06442156434059143,
        -0.027249010279774666,
        0.006498132366687059,
        -0.07572135329246521,
        0.017610909417271614,
        -0.07407603412866592,
        0.025467071682214737,
        -0.01634213514626026,
        -0.014066954143345356,
        0.08854121714830399,
        -0.006798494607210159,
        -0.044678449630737305,
        -0.052962567657232285,
        0.04801122471690178,
        -0.03683214634656906,
        0.06599339097738266,
        0.028901539742946625,
        0.0031481441110372543,
        0.0006679947255179286,
        0.0023598396219313145,
        -0.08543006330728531,
        0.008969987742602825,
        0.1086840033531189,
        -0.0654129683971405,
        0.01654384657740593,
        -0.0970470979809761,
        0.013829209841787815,
        0.0032590345945209265,
        0.02014741487801075,
        0.05237741395831108,
        -0.03105868212878704,
        0.06976043432950974,
        -0.11687396466732025,
        0.008687238208949566,
        0.02239484339952469,
        0.022242741659283638,
        0.048808224499225616,
        -0.03661058470606804,
        -0.041321683675050735,
        -0.10265786945819855,
        0.0038431710563600063,
        0.06057262793183327,
        0.033013876527547836,
        0.037131816148757935,
        0.04548516497015953,
        -0.05190558359026909,
        -0.009366307407617569,
        0.0032302075996994972,
        -0.054681263864040375,
        0.14316774904727936,
        0.07236585021018982,
        -0.04800504818558693,
        0.027452262118458748,
        0.036189693957567215,
        -0.07579465210437775,
        -0.06700536608695984,
        -0.0022697628010064363,
        0.04946684092283249,
        -0.005798655562102795,
        0.062001220881938934,
        0.04308120906352997,
        0.04612599313259125,
        0.04476219788193703,
        -0.004442212637513876,
        -0.04275694862008095,
        0.05643293261528015,
        0.10124757140874863,
        0.015475866384804249,
        -0.039448466151952744,
        2.6878916274039814e-33,
        0.060757122933864594,
        0.04993002116680145,
        0.03610870987176895,
        0.009823084808886051,
        0.1295938789844513,
        -0.03803590312600136,
        -0.07868660986423492,
        0.08090908080339432,
        -0.10087224841117859,
        -0.002234505023807287,
        0.024511156603693962,
        0.05415879935026169,
        -0.022418765351176262,
        -0.05322970822453499,
        0.009733093902468681,
        -0.13915808498859406,
        -0.07509864866733551,
        -0.05608503147959709,
        0.056761614978313446,
        0.0018623857758939266,
        -0.05675780400633812,
        -0.016598716378211975,
        0.04316353797912598,
        -0.05559810250997543,
        0.06761731207370758,
        -0.04084043204784393,
        0.041423968970775604,
        0.00030207846430130303,
        0.106830894947052,
        0.012749443762004375,
        -0.03516712412238121,
        0.010515938512980938,
        0.05180477723479271,
        -0.045654043555259705,
        0.023917943239212036,
        -0.0006255144835449755,
        -0.03812520205974579,
        -0.062306709587574005,
        0.028348885476589203,
        -0.08961381018161774,
        -0.008216746151447296,
        0.026489339768886566,
        -0.03982946649193764,
        0.062141112983226776,
        -0.060488130897283554,
        0.0075663006864488125,
        0.02465822920203209,
        0.04367434233427048,
        0.06600171327590942,
        0.09214374423027039,
        -0.0014586002798750997,
        0.02834964171051979,
        -0.026320641860365868,
        -0.030989766120910645,
        0.006698791403323412,
        0.05558299645781517,
        -0.001107216696254909,
        0.08344665169715881,
        0.07672849297523499,
        -0.02538038231432438,
        0.06659781187772751,
        0.0004115742049179971,
        0.00743522634729743,
        -0.08353368937969208,
        -0.01604504883289337,
        0.06972844153642654,
        0.04815205559134483,
        0.018670659512281418,
        -0.03382626548409462,
        0.037690673023462296,
        -0.04024222493171692,
        -0.07702051848173141,
        0.010982862673699856,
        -0.03994365409016609,
        0.03192654997110367,
        0.07673607021570206,
        -0.003811060916632414,
        -0.006482462398707867,
        0.0473320372402668,
        -0.04112490266561508,
        -0.023040689527988434,
        -0.05115458741784096,
        -0.004811127670109272,
        0.038371000438928604,
        -0.0005592660745605826,
        0.012234274297952652,
        0.006108850706368685,
        -0.03286787122488022,
        -0.07056330889463425,
        -0.028018997982144356,
        -0.02886422909796238,
        0.08182795345783234,
        -0.009637890383601189,
        0.025396736338734627,
        0.004177742172032595,
        -2.646018498246776e-33,
        0.0388040654361248,
        0.012147973291575909,
        -0.0022099895868450403,
        0.03880950063467026,
        0.12595058977603912,
        -0.019279636442661285,
        -0.004000208340585232,
        -0.045444563031196594,
        0.08095187693834305,
        0.0672360509634018,
        0.0704164132475853,
        -0.032015714794397354,
        -0.0757993683218956,
        -0.052359674125909805,
        -0.05188581347465515,
        -0.05397501587867737,
        0.0332455076277256,
        0.09273825585842133,
        -0.032845135778188705,
        -0.020886043086647987,
        -0.03712429478764534,
        0.05561382323503494,
        -0.01067105121910572,
        -0.018145661801099777,
        -0.007730025332421064,
        0.046251583844423294,
        0.03154895827174187,
        0.10274624824523926,
        -0.015267456881701946,
        0.000908177113160491,
        -0.04247577115893364,
        0.0467122457921505,
        -0.052423082292079926,
        -0.08150466531515121,
        -0.025764266029000282,
        0.05470182001590729,
        0.005731403362005949,
        -0.026076823472976685,
        -0.03593284636735916,
        -0.07225747406482697,
        -0.010291144251823425,
        0.06936398893594742,
        -0.021047623828053474,
        -0.015554476529359818,
        -0.03639337047934532,
        0.00010350491356803104,
        -0.1467263549566269,
        0.10624970495700836,
        0.004198748618364334,
        0.08185595273971558,
        0.055506739765405655,
        0.0030068806372582912,
        -0.005774781107902527,
        -0.02255210094153881,
        -0.12020423263311386,
        -0.029442748054862022,
        -0.034216687083244324,
        0.044157736003398895,
        -0.0020742828492075205,
        0.02624306082725525,
        0.024650584906339645,
        0.009591061621904373,
        -0.03978441283106804,
        -0.08972730487585068,
        0.013707269914448261,
        -0.09089560806751251,
        0.1372726410627365,
        0.017732875421643257,
        0.0401030108332634,
        0.05791962519288063,
        0.08666934818029404,
        0.03550025448203087,
        -0.040276218205690384,
        -0.0324912965297699,
        0.030496252700686455,
        -0.015959694981575012,
        0.003164883702993393,
        -0.03178060054779053,
        -0.07743959128856659,
        -0.029114503413438797,
        0.029985861852765083,
        0.07589401304721832,
        0.019163476303219795,
        -0.009768584743142128,
        0.05147618055343628,
        0.05471929907798767,
        0.05483406409621239,
        0.046916019171476364,
        -0.07821575552225113,
        0.0547974593937397,
        0.023010296747088432,
        0.06400986760854721,
        -0.02175562083721161,
        0.07949245721101761,
        0.0580279715359211,
        -5.905510036541273e-08,
        0.051653824746608734,
        0.010829828679561615,
        -0.08394880592823029,
        -0.008924328722059727,
        0.06393234431743622,
        -0.01292228139936924,
        0.03553827479481697,
        -0.016728496178984642,
        -0.05296940356492996,
        -0.10689906775951385,
        -0.042418885976076126,
        -0.018130188807845116,
        0.05416257306933403,
        0.08187110722064972,
        -0.03221418708562851,
        0.014668858610093594,
        -0.10180031508207321,
        -0.0699835792183876,
        -0.045634351670742035,
        -0.05248245224356651,
        0.017146041616797447,
        0.0005424426635727286,
        0.10726572573184967,
        -0.020331816747784615,
        0.0148298479616642,
        0.04656181484460831,
        0.04495031759142876,
        0.038887906819581985,
        0.0073570855893194675,
        -0.06838124245405197,
        0.002304615918546915,
        -0.03955044597387314,
        -0.06507067382335663,
        -0.054511502385139465,
        -0.053279977291822433,
        -0.06439696252346039,
        -0.08619466423988342,
        -0.011607863008975983,
        -0.052195850759744644,
        0.0541720949113369,
        -0.02423946186900139,
        -0.03729330748319626,
        0.07815944403409958,
        0.02348635345697403,
        -0.060393258929252625,
        -0.0009414430824108422,
        -0.019874224439263344,
        -0.01538692694157362,
        -0.031268637627363205,
        0.04267027601599693,
        -0.02054721675813198,
        -0.03175031393766403,
        -0.1044556275010109,
        0.012545553036034107,
        0.038475386798381805,
        0.03693002834916115,
        0.004377248231321573,
        0.12365388125181198,
        -0.05738583952188492,
        0.0017844069516286254,
        0.05944453924894333,
        0.0034689216408878565,
        -0.0028220354579389095,
        -0.0034266968723386526
    ]
}