{
    "id": "Pc31L3zJiaU",
    "title": "Laptop Docks! They're pretty neat!",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-06-29T14:48:27Z",
    "video_url": "https://www.youtube.com/watch?v=Pc31L3zJiaU",
    "category": "Science & Technology",
    "tags": [],
    "views": 1442448,
    "likes": 61395,
    "comments_count": 11787,
    "description": "I know, my use of a laptop (and worse, that I like it!) makes me a truly terrible person.  Would you like some links? They're fresh on the rollers! Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contribution on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   And thank you to the following patrons! Will Hayworth, Benjamin Gott, Zach Le, Sean Fyles-Duggan, Fredrik strem, Anil Dash, Simon Safar, Michael Wileczka, William Matthews, Fred Leckie, Kenneth Morenz, Andy , Greg Stearns, Robert L LaBelle, Chris Satterfield (Compgeke), Jerrod Putman, Cameron Benton, Samuli Suomi, Keith McCready, Jeffrey Glover, Marcus Langendorff, Hsin-Kuei Chen, HenryD , David Anez, Josiah Keller, Todd Eichel, Conall  Maiti, Struan Clark, Keeb , Alexander Karlsson, Tarrien , Jason Viterna, DrMoebyus , Chris Larsen, JH , Michael Romero, Aram Hvrneanu, Jonathon Mah, Jonathan Polirer, Marc Versailles, Arthur Zalevsky, John Fruetel, Cupcake , Andrew Diamond, Cole Campbell, Christopher Beattie, Paul Bryan, Samuel Kirzner, Daniel Pritchard, Brandon Tomlinson, Eric Loewenthal, Jeremy Samuels, Malcolm Miles, Matthew Lloyd, David L Jones, Matthew Burket, Noah Corwin, Andrew Roland, Luke Whiting, Smith8154 , Lars Jacobsen, Michael Wehner, Kenneth Siewers Mller, jacob kamphaus, Slysdexia , HurleyPotter, Tommy McCarthy, Andrew Bobulsky, On Ice Perspectives, Brian Wright, TheGreatCO , Petteri Hjort, Daniel DeLage, Nathan Obuchowski, Shaun Puzon, Bret Holmes, Vlycop , Lucas Beckmann, Casey Blackburn, Devon Hodgson, Zimpan , Loc Esch, Filmmaker IQ, Jan Houben, Bren Ehnebuske, T.J. Zientek, Vernon , Ton Brands, Scott Wright, Kory Howard, rezonant , Thanasis Dimas, Marc Grondin, Hex , Craig Kollai, Daniel Barrera, Mark Stradling, Peter Sodke, joseph , Kristian Scheibe, BigMcLargehuge510, Andrew Liendo, Nick , The Masterpiece, Sterling , Seanvdv , Chris Cody, Jason Portwood, Chad Fertig, M Shrimptoast, Joseph Houghtaling, Ben Tucci, Dave Stares, Josh Braun, Joe Johnson, Daniel Dugger, Christopher Lowell, Oleg , Michael Sacchi, Ali Elam, Dan Allen, Zhenbang Xiao, Jason Watson, Markus Towara, Barky doggo, Ectra , Martin Embeh, Reid Fishler, Daniel Meagher, Joel , Clemens , Bill Bates, Centronias , Dennis Walsh, Alex Warren, Paul Robins, CanyonMID , Les , Ian Clanton-Thuon, Ryan Pratt, Paul Newton, Greg Golds, Theo Keeler, Tyler Alberico, Benjamin Ratner, Doug Davenport, Paul Sharp, Craig Brickey, Zidy , Brandon , Karl Kornel, Danila Fediashchin, Adam , Zach Rose, Patryk Majewski, Ryan Kamphuis, WB , AmbientCyan , Sam Calandra, Wolfgang Gschwendtner, Jzef Sokoowski, Will Preston, Stuart Stanfield, Hammerchuckery , Christopher Olson, Kor Nielsen, Stephen Amar, Bryce , Sypwn , Andy Holzhammer, David Jeroslow, Ian Hills, Charles MacDonald, Andrew , Tim Jones, Crisco762 , Phil E, AnsulFolf , Raymond Coutts, Ian Spence, John De Witt, Mike A, Alex Dodge, hipp1eguy , Justin Derleth, El Jefe, NEON725 , Emily Eisenberg, Mark Christian, Dylan Leblanc, Bard , Megan Lovett, LGR, Jeffrey Frasure, kn0tsin , Michael Gooden, David Wulff, Max , Fredrik Lindroth, Michael Riegel, Paul Kavanagh, finacious , Isaac Clarke, Sean Hearrell, Christopher Macdonald, Selectric , Xzandreth , Keithius , Snke Schlter, Julian Haldenby, Seb Bacanu, Mauricio , Hunter Thornsberry, Austin C Borger, Gabe Cook, Anapan, S0N0S , Michael Patron, Sonic Ether, mike quick, Adam , Lucas , microserf , Daniel Kraut, Andr Gil da Costa, Luka Sanzin, Peter Hillier, PeterH , William Holt, Ethan Hamel, Grant Campau, Else , Michael Dunn, Rin , Richard Hicks, Matthew Foulks, Levi Maaia, Mike Roach, Simon Janssen, Jorge Caballero, Kyle Messner, Matthew Schwartz, gs , ashka , Mr. Yan, Matthias Feist, RedR0ze , adan c, Thomas Fuchs, Alan Holland, Dan Boulden, Phiroze Dalal, Devin Rosenthal, Avalon Hamakei, Ray Hardman, G Cowell, Dan Coulson, Kevin Hamilton, Chase Tarson, Christopher D'Arpa, Marshall Kurtz, Matt Goldman, Hurf Durr, shaun morris, Miguel Gonzalez, Bryce Ontiveros, Kenneth A Cusson, Johnathan Reale, Charles Corbin, Simon Arrow, Brett Walton, Martin Schrder, lakewalk3r , Hayden McAfee, Dan Maku, Mark Injerd, Paul Demers, Daniel M. Hendricks, Vladi Ivanov, Michael Sandler, Jacob Harrington, Pete Iacono, Perl the Raven, Clay , Jason Letchworth, Benjamin Deming, Thorbjrn Meyer, Eben , M1GEO , Michael Kaegler, Chrno , Taylor Smith, Colin Macdonald, Shlomi Borovitz, Krispin Miller, Jan Borcherding, Matthew Castellana, Finn , Sean Anderson, David , Chaz Serir, Jason Downs",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "The comments on this one are gonna be a doozy Hello there! Did you know that some people work differently than you do? Weird, right? Well, today Id like to talk to you about one of the fundamental tools I use to do my work. This! A laptop You edit videos from a laptop Why are you doing that to yourself Oh it gets worse; I often write them on a Chromebook! But anyway, this is much more than just a laptop. Its also quite a capable desktop computer. I know, its confusing, but thats what were gonna be talking about today! But first! Hi! I just wa ooh, wrong shirt! Hi! I just want to set the record straight and let you all know right now that Ive also got a duper super pancy fants for-real desktop PC. You can tell its good 'cause it has blue lights in it! But you see, through some deep, deep soul-searching, Ive come to the conclusion that I dont really need this thing. Its... it's nice to have, but I dont really need it. You see, while I need a fair amount of computing horsepower to do what I do for you, I actually dont need all that much. especially because video editing is only but a small part of my overall video making process. Now first - let me be clear that, just as I said there are people that work differently from you, there are people that work differently from me! Some people do nothing but video editing all day long, and theyre certainly not gonna find my tools adequate. Or maybe you work with CAD or other modelling software and you need some big beefy GPU at your disposal - but specifically to you folks - hang tight. What Im about to show you in this video certainly isnt a one-size-fits-all solution or anything, but its an option that I think is really underappreciated and also just not very well known outside of specific corporate environments. And that option is a laptop and a dock. Watch this magic! Heres my laptop all neat and pretty. And heres a desk! Slightly less neat. Over here is a cute little box with a bunch of cables and junk plugged into it, and if I take this single cable and plug it into the Thunderbolt 3-capable USB-C port of my computer suddenly my laptop has transformed into a veritable desktop computer, part of a complete desktop breakfast. Ive got a real keyboard and mouse, a high resolution ultra-wide monitor (and I could even have a second one if I wanted, or just use the laptops own screen as a second display), Ive also got some real speakers, and thanks to the fact that the dock has ethernet, I could even have this wired into networking and printers and whatever other junk I might need! Oh, and its charging the laptop through that cable, too, so it really is 100% functionally equivalent to a desktop PC. And heres the kicker - when Im working on my videos in Adobe Premiere, I dont notice a difference at all between my laptop and my desktop when it comes to overall performance. Granted, they are running essentially the same processors (a 7700K in the desktop and a 7700HQ in here) but theres a pretty substantial difference in graphics hardware. A 1050 vs. a 1080. Despite that, theres only one thing that I know my laptop doesnt do as well, and thats export the video file. Some of that is down to the notoriously flawed thermal design of this Dell XPS 15 the voltage regulator modules overheat causing the most annoying throttling ever, not thermal but power throttling and it sucks (heres hoping the redesign has fixed that)- but thanks to the latest Adobe update which takes advantage of the GPU for actual rendering, that issue is much less pronounced. As it stands now, my laptop is about 20% slower than my desktop at rendering a video. So it takes like 20 minutes instead of 16. Tragic, I know. Now Im sure many of you already know about the wonderful world of docks. Some of you might have even heard some sort of tech tips about them. But for those who havent, well Im here today to extoll the virtues of this wonderful method of personal computing, and also tell you about some of its current challenges and future opportunities. Because, you see, I think there are many more of you out there that would benefit from this computing lifestyle than you realize. A modest laptop these days is more than powerful enough for the average person, and if you, like me, value having both mobile and desktop computing capabilities, you might find having one device fill both roles to be quite splendid. Oh and before I forget, this isnt exclusive to Windows machines. Macbooks can make use of docks too, but dont ask me for any advice there cause I dont have any. Those of you using Linux, youll just have to figure it out yourself like you do everything else about your computer. First, an acknowledgment of history. This isnt anything new, docking solutions have been around for a long time. Lots of them involved weird, giant proprietary connectors on bottoms of laptops that would give your old iPod pin envy. What is new-ish is the world of USB-C or/and Thunderbolt 3 docks. And, well, regrettably this world ain't perfect yet. Particularly on the Thunderbolt side. There seem to still be a few compatibility bugs floating around, and support for Thunderbolt 3 in general remains somewhat spotty and also just incredibly confusing. Look, I know were heading towards One Connector to Rule Them All which is pretty great, but having the same physical connector support so many wildly different technical standards is not easy to parse. Lets not get started on USB 4, either. And even where compatibility seems assured, there are sometimes other nuanced issues. Like, in the case of Thunderbolt, how many PCI express lanes does that particular connector on your particular laptop support. Or even weirder things. For example, this model of dock is specifically listed as compatible by Dell with this specific model of laptop. Which is cool, because it is, but the dock was available with two different power supplies. This laptop needs the larger one to work correctly, otherwise it might have been power limited by the smaller power supply, or potentially it wouldnt have been able to charge from it, or perhaps it wouldnt work at all. This appears to still be a factor with currently available models. Theres definitely work to be done to make this a more seamless and universal experience, like for example the fact that many docks arent even using Thunderbolt at all and are just operating over USB (and for the moment those seem to be more universally compatible). But for what its worth things are wonderful - no, blissful when you have a known-compatible setup. Take, well, take this exact PC. The laptops display is a downright gorgeous 4K panel, but since 4K on a 15 inch screen is a little ridiculous, I have Windows scaling everything to 175% so I can see things. Windows gets a lot of hate for how it handles scaling, and to be honest it deserves it (though it has gotten much better lately), but to its credit when I plug in the dock, it correctly remembers to turn off the scaling and everything recombobulates pretty well. After a few seconds of reconfigurationizing and handshakes and whatnot everything is good to go. Now I have a honest-to-goodness desktop! This particular dock is fairly basic (and also I think discontinued) but has connections for three monitors (though I'm pretty sure it's limited to using only two at a time, if memory serves) over HDMI, Mini DisplayPort, or VGA if you wanna go that route, gigabit Ethernet, 2 USB 2.0 ports, 3 (but he said 4) USB 3 ports two on the front two on the back, a rear audio jack, and a front headphone jack. You can add a hub onto one of the USB ports if you needed, but also keep in mind that all of the ports and the card reader on the laptop itself remain usable. If you have any, that is! But, sadly, even this officially compatible dock from the same manufacturer as the computer has misbehaved a few times. Occasionally when I first plug it in, it just doesnt notice that that happened and wont do anything until I cycle the power to it. I still havent figured out when exactly the little power button on it is going to actually wake up the laptop when its asleep or shut down - it seems to have about a 70% success rate. And as seamless as the overall experience is when its playing nicely, the way Windows handles its audio devices is a little strange, and a few fights have occurred between Premiere and Windows regarding which audio should be going where. Its fun! Now, you might be asking, why is he telling me all of these bad things if he wants me to like docks so much? Well, for one thing, I dont want to oversell the experience as being universally amazing. Because as it stands now, if you (or someone you know) is not computer savvy enough to be comfortable with A) finding a compatible laptop and dock combo and B) a bit of occasional troubleshooting this might be a bit frustrating. Now, a bit o googlin reveals that at least for general purpose docks things are much much better than they used to be (which is corroborated by my personal experience) however things just arent quite perfect yet. I wont sugarcoat it. But, assuming youre comfortable with a little turning it off and on again (and/or that things improve as Im sure they will) let me tell you why this might be the bees knees for thee. You see, if youre like me, you want to be able to do anything you might do with a computer on the go. I want a portable machine with a full-blown desktop operating system with all of my delightfully buggy Adobe software at the sometimes-ready. So, a few years ago I purchased this fairly high-end laptop ($1,600 for those curious) which can handle that competently. Now say you want to also have a desktop computer. There are plenty of reasons you might want one, such as the dramatically improved ergonomics of a real chair with a real monitor at a real height and a real keyboard and a real mouse. Maybe youve got a printer and scanner thingy set up there all nice and convenient like. And maybe youve got a bunch of external drives and other peripherals just dying for something to talk to. Well, you could buy another computer to make use of those things or you could just instead buy a dock. Then, the very same computer that you use on the go can access that monitor and that printer scanner thing and that keyboard and that mouse and even your external drives or whatever else all with just a single cable. And, because the dock will charge the laptop for you, if you do a lot of back-and-forth between mobile and stationary computing, well you can just leave your laptops power brick and other portable-mode accessories in your bag. Just take the laptop out, plug it in, and boom! Full-blown desktop. No need to get out the power brick or anything at all. And when you need to take your computer somewhere, all it takes is *bink* detaching from the dock and putting in your bag. The very same computer is now your laptop, fully charged and ready to go. I like this solution a lot. So much in fact that Im considering upgrading to the new Dell XPS 17, which seems to have addressed the annoying thermal issues of this design, and potentially retiring my desktop altogether. I know, blasphemy! But heres the thing; I have a somewhat minimalist philosophy when it comes to my computer stuff (and more generally my IT life). I dont like spending any time on perfecting my workflow or optimizing system performance or any of that junk. I just want something that allows me to do my work with basic competency. Oh, and speaking of competency, one of the more exciting things that Thunderbolt 3 specifically has allowed to happen is docks with external GPU enclosures. Thunderbolt 3 carries certified fresh PCI Express through it, meaning that real graphics cards can operate over Thunderbolt 3. For those of you that are into gaming or otherwise need a powerful GPU at your disposal, this is an exciting option. Slap an RTX 2080 in there or whatever is current and suddenly your laptop is able to take advantage of an actual desktop class GPU. Now, if you wanted to do this, you should know that the whole how many PCI express lanes does this port carry? becomes a significant factor, and compatibility becomes even more dicey so Im not saying this is perfect, but I do expect it to improve as time goes on. If it interests you Id suggest you do some research on the topic before you get too excited. Compatibility between devices seems to be not-at-all guaranteed at this point, especially when you factor in other operating systems. Now, there are some people who like to insist that Im somehow losing the game of life by using a laptop for video editing. Some people say Ive wasted money on a laptop. I could have saved like 400 whole dollars if I built my own desktop which is not portable but nevermind that. Or sometimes they insist that by not using the fastest available hardware, Im slowing myself down. This, in particular, leads to an assertion Ive had to make over and over again, particularly on Twitter (said with extra salt); Render time is not work time. At all. When I make a video, even a simple one, theres gonna be at least two days of script writing and revision (even with a script like this in which I dont really do any research at all), at least a full day of shooting video (or more depending on the projects complexity), and then usually two or three days at the very least of editing work. The time it takes my computer to turn all that work into a finished video file is an entirely insignificant factor, because its not work to me! Its about as much work as preheating your oven. All I need is a computer that can handle the editing part, thats the only part where I'm actually interacting with it without being frustrating. If I can scrub through the timeline and preview the video without issue, Im fine! And both this laptop and my desktop, which are both three years old now, are more than capable of that. Editing only taxes hardware in short bursts, so even my thermally challenged laptop doesnt have a problem with that very long and involved part of the creative process. Granted, I dont shoot video with a RED 8K camera or even a BlackMagic Pocket or whatever but I dont feel like I need to. For my work, my camera (which is a Lumix G7 by the way) is totally fine, and I dont feel held back by it, at least not yet. Im probably gonna keep using it till it either breaks, or I find it is holding me back. If I got a new camera and find that my computer cant handle its output then sure, I might need to invest in a more beastly machine. But right now that would just be a waste of money. And also time. Transition costs are a real thing, you know. Serious talk time; Im trying not to toot my own horn here, especially because there are upgrades to my equipment that I want to make, but I think that one of the most damaging things the tech community has done is create lust for shiny new things and worse, suggest the thought that without them your work is less valuable. Thats not true. And it never was. You are what makes your work unique, not the tools you use. If you have the resources to get the most whizbang stuff out there by all means have fun. But dont think that you cant get started with what you have. And while I know and understand that if your tools are faster or better you can get more done, you need to put thought into where those time savings will actually occur, and whether theyre actually helpful. For me, an independent content creator, my computer is not and has never been a limiting factor. And making regular upgrades to it would be more of a bother than it would be helpful. I deal with a lot of people telling me that I should be doing things this way or that way, and ya know thats fine. A lot of it is earnest offers of help. Or at least is perceived to be. But a lot of it also doesnt bother to understand my workflow, my desire for simplicity rather than complexity, or my philosophy that time spent chasing performance gains is usually time poorly spent. If its something you enjoy, or if its your hobby, by all means. But Ill tell you now that I am much more frustrated by those who try and tell me why Im being held back by the way I work than Ive ever been frustrated by this computer. To put it bluntly, I like to do work on my computer. Not work on my computer. And thats why I dont use Linux! Yeah. I went there. Anyway, that aside aside, lets talk about cases where this wouldnt be appropriate or desirable. First - gaming. Maybe. GPU enclosures make that a possibility, but theres a lot of nuance there that I wont go into. Secondly - people who dont need a full-blown desktop OS on the go. If youre someone who does a lot of work on an iPad then maybe you dont use a laptop at all in which case this solution is entirely meaningless to you. And third - real power-users who need or can otherwise take advantage of a threadripping desktop PC. For you, even if you also have a laptop, a dock is likely not of interest. But if youre someone who uses a desktop operating system on the go with any regularity (meaning, youre someone with a somewhat capable laptop) and you also like having a true desktop experience for long, agonizing sessions of staring at Premiere and hoping it doesnt crash when you import that jpeg, then perhaps theres no need to have two computers. I can honestly say at this point that I really dont. And I would have actually saved money had I bought this laptop before I bought my desktop. I know, that just blew some minds out there. I could have saved money by buying this first. Because, well, even with its thermal issues which do annoy me quite a lot it has yet to get in my way. Ive spent much more time trying to eliminate the thermal issues than I could ever have hoped to save by fixing them. And thats what I mean about chasing performance gains; it can often be a silly time waster. Now, to address the concerns of the laptop haters out there, youre right! Laptops tend to not last as long, theyre harder to repair, often impossible to upgrade, and the cost of a laptop with equivalent performance to any particular desktop is always higher. Plus, as my laptop is a wonderful example of, many have disastrously flawed thermal designs so long gaming sessions or... rendering video, can be a problem. But personally I think that shouldnt be something thrown at laptops as a category, particularly since better thermal designs do exist. Theyre just frustratingly uncommon. But more importantly, those concerns are more often than not irrelevant to the average person. If youre concerned about the thermal performance or upgradability of your machine, you are probably an enthusiast, power user, or gamer. There are a lot of you out there, yes, I'm not saying you don't exist, but there are also a lot of people who dont fall into those categories and couldnt care less. Honestly, I lean in that direction, though Im not shy to performing a few upgrades. And heres the thing - even I, a professional content creator (I think I get to say that now) am fine with this flawed, three year old machine. There is something to be said for the upgradability of a desktop PC. Thats for sure. And its true that my laptop might break long before my desktop would. But heres my truth; I want a laptop which can handle everything I do for this job. I want to be able to take it with me when I travel and be productive anywhere. That means Im always going to have a powerful portable computer. And given that, why would I also need a powerful stationary desktop? The fact is I dont. Thanks to a dock, I can have the best of both worlds with one machine. It doesnt matter if my laptop cost more than an equivalent desktop or if it breaks sooner or any of those other concerns because I will always have one. Its that subset of people where I think a dock can be really valuable. And actually save you money. And theres one other benefit that I think deserves attention; energy use. Laptops are always, at least to some extent, designed to optimize their energy efficiency. Because if youve got a battery onboard, you want to maximize the time you can use it. Duh. Desktop PCs have gotten a lot better in recent years, but in general efficiency isnt a huge concern of theirs. My desktop pulls more power from the wall at idle than this does does when rendering a video. And thats well that adds up. Which might be part of why docked laptops are increasingly gaining favor in the corporate environment. When youve got hundreds of computers running for 8 hours a day or more, you can save some serious dough on your energy bills if theyre all laptops. And boy are companies that made that switch happy given that theres a pandemic right now. If you can take your entire computer home with you when needed, thats a nice bonus. But Id like to see docks get a little more traction outside of the corporate world. As I said, Im honestly to the point where having an actual desktop PC is superfluous for my needs. Yes I want a desktop computer, but theres no reason it needs to be a 15 pound box on the floor. One thing that DESPERATELY needs to happen, and not just for the benefit of docks, is consistent branding and clear delineation between USB-C and Thunderbolt. Its a mess and there are docking solutions using both technical standards. Given that Thunderbolt 3 is more powerful overall with the potential for eGPUs and whatnot, I would expect it to eventually become the defacto standard but right now thats not the case (and the future is anything but clear) so if youre interested in this as an idea I cannot stress enough that you should make sure whatever dock youre looking at is compatible with your computer. And also, since this is the world of tech, unfortunately we cant be assured things are gonna be anything near stable. If these rumors that Macs are ditching x86 architecture are true, well I wonder how Thunderbolt will stay a thing in that ecosystem. Perhaps it will just be fine but I cant imagine things are gonna just be all hunky dory (particularly with external GPUs). The way we compute is constantly being upended, and in fact thats one of the primary reasons desktop PCs have largely fallen out of favor. I mean, loads of people hardly use traditional computers at all anymore, laptop or desktop. Im sure that annoys all you gamers out there but its true. And speaking of rumors of switching to ARM, heres perhaps the most embarrassing thing I own. This is a Microsoft Lumia 950XL the last flagship Windows phone. Yeah. I bought this! For the virtually all of you that are unfamiliar with this, it had one feature that I naively thought would change the smartphone game; Continuum. Microsoft developed a dock that worked with this phone (and certain others) to create a true Windows 10 desktop environment running from the phone itself. You could plug this phone into the dock and suddenly have full desktop-versions of the Microsoft Office suite and, hopefully down the road, other apps. I thought this was pretty neat! Imagine a world where your smartphone was the only computer you need. People envisioned laptop chassis which were basically just a display, keyboard, and extra battery for the phone, and it seemed like there was a lot of potential to make the phone the new PC. While I never once used it (I have the dock somewhere and might play around with it on the second channel at some point) I thought this could really be a game changer. Of course, it wasnt, not at all, but it was a really neat idea. And frankly, if these rumors about Apple are true one has to wonder if iOS, iPadOS, and macOS will eventually merge into one, and Apple will reinvent this concept and probably get credit for it, too. But anyway, thats neither here nor there. Also I should add that there are android phones out there today which can do this very thing with a USB-C dock, though obviously there are limitations there. I want to reiterate that this certainly isnt for everyone. If I didnt want the ability to edit videos in Premiere on the go, I probably would have a much cheaper laptop. I mean, I do, its my Chromebook, but that might be my only portable computer. And if spending more money on your desktop in favor of a cheaper or no laptop is your game, Im not gonna stop you. That makes a lot of sense! In my shoes, though, I want a powerful laptop. And given that, my desktop is largely redundant at this point. Im surely not going to get rid of it, not any time soon, and even if I do upgrade my laptop there is value in having a separate computer for other things. Compartmentalizing in that way can be quite helpful, and honestly Im doing that right now. Plus, it doesn't hurt to have a backup machine. But I hope this video has gotten you thinking a bit. If nothing else, I just want to spread awareness of this solution. Even if you had no interest at all in a desktop PC, well maybe youd like some way to seamlessly use a real monitor and stuff. With a dock, form factor is arbitrary. I bought my laptop before I was aware of the existence of Thunderbolt docks. It was actually an upgrade of my moms work computer that brought them to my attention. Seeing her new computer connect to two monitors and all the other junk with just a single USB-C cable made me realize hey my laptop has one of those ports. Is that could I do that? Serendipitously, a quick Google revealed that indeed, her new dock was compatible with my existing laptop, so I bought one of my own. And I really like it. Maybe you would, too. Thanks for watching! Again - super important thing here - I am not you and you are not me. My priorities are undoubtedly different from yours. And thats OK! I think that being aware of options is always good, and I get the sense that not enough people are aware of this one. I hope this video can serve as an example of whats possible with a little outside the desktop box thinking, and I also hope that at least some of you will take some inspiration from the fact that a three year old, thermally challenged laptop makes these videos for you. computationally smooth jazz *pbbbpbpbpb* noises What Im talking about ohhh, Im not talk well I am talking about it but thats not how the sentence goes. Or my philosophy that time spent chasing performance gains is (Windows notification sound loudly interrupts from benind) THANKS!! Of course... Though, Im gonna say for all the people out there who are still given windows crap for this; its so much better than it used to be. I guarantee you this will be less than a minute. Probably less than 30 seconds. A modest laptops these days is more than (voice went really high and he made lots of weird noises) ...those of you that shoot. This is like a minute-long line! What did I do this for? How many takes will this line take? My guess is seventy. There seem to still be a few compatibility blugs blugs? Bugs. Laptops display is a GORGEOUS 4k GORGEOUS I know, I know, I give Linux a hard time. But I'll tell you know, it ain't gonna stop so long as there's the \"BUT HAVE YOU CONSIDERED LINUX?\" crowd always relentlessly popping in whenever I make the vaguest complaint about my PC. You're almost as bad as the \"get a Mac\" crowd at this point.",
    "transcript_keywords": [
        "laptop",
        "desktop",
        "computer",
        "dock",
        "work",
        "Thunderbolt",
        "video",
        "time",
        "laptops",
        "things",
        "desktop computer",
        "thing",
        "lot",
        "docks",
        "people",
        "Windows",
        "real",
        "make",
        "power",
        "GPU"
    ],
    "transcript_entity_values": [
        "1,600",
        "three year old",
        "Premiere",
        "two",
        "3",
        "CAD",
        "a few seconds",
        "Adobe Premiere",
        "2",
        "400 whole dollars",
        "GPU",
        "less than a minute",
        "2080",
        "jack",
        "about 20%",
        "XPS",
        "one",
        "Windows",
        "Ethernet",
        "three years old",
        "macOS",
        "Twitter",
        "Apple",
        "Macbooks",
        "20 minutes",
        "Mac",
        "100%",
        "Google",
        "BlackMagic Pocket",
        "first",
        "4",
        "4k",
        "70%",
        "these days",
        "Microsoft",
        "Windows 10",
        "a few years ago",
        "16",
        "at least two days",
        "Linux",
        "Continuum",
        "three",
        "Macs",
        "USB",
        "recent years",
        "7700HQ",
        "Adobe",
        "USB 4",
        "Linux",
        "only one",
        "RED 8K",
        "15 inch",
        "Lumia 950XL",
        "Thunderbolt",
        "at least a full day",
        "1080",
        "iPod",
        "Mini DisplayPort",
        "only two",
        "iPad",
        "hundreds",
        "today",
        "Windows",
        "Chromebook",
        "15 pound",
        "1050",
        "two or three days",
        "third",
        "Thunderbolt",
        "175%",
        "8 hours",
        "PCI Express",
        "about one",
        "Secondly",
        "Lumix G7",
        "Premiere",
        "PCI",
        "less than 30 seconds",
        "Thunderbolt 3",
        "One",
        "Microsoft Office",
        "15",
        "USB-C",
        "VGA",
        "First",
        "second",
        "Dell",
        "HDMI"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "LAW",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.10108883678913116,
        -0.06646688282489777,
        0.056401338428258896,
        -0.07667630910873413,
        0.016104795038700104,
        -0.02029811032116413,
        0.02718774415552616,
        0.052265267819166183,
        -0.04224465787410736,
        -0.028945624828338623,
        -0.012178557924926281,
        0.049396298825740814,
        0.07614705711603165,
        0.00897090695798397,
        -0.0022046135272830725,
        -0.023900756612420082,
        0.023278575390577316,
        -0.15141898393630981,
        -0.00011206256749574095,
        -0.03785676136612892,
        -0.08043115586042404,
        -0.05312995985150337,
        -0.01048248540610075,
        -0.048710860311985016,
        0.04809262230992317,
        -0.03849375620484352,
        -0.0021667247638106346,
        -0.04336369410157204,
        -0.06486593186855316,
        -0.012831158936023712,
        -0.09721431136131287,
        0.12019483745098114,
        -0.07527908682823181,
        0.019677676260471344,
        0.026202144101262093,
        -0.050882235169410706,
        0.012002148665487766,
        -0.00846831128001213,
        -0.02557123638689518,
        -0.049651846289634705,
        -0.01065161544829607,
        -0.11932919174432755,
        0.013032821007072926,
        0.045655880123376846,
        0.06310804933309555,
        -0.06255235522985458,
        0.007165986113250256,
        -0.08120466768741608,
        0.011047880165278912,
        0.056874457746744156,
        -0.023617425933480263,
        -0.025473102927207947,
        0.11391444504261017,
        -0.006069623865187168,
        -0.05580120533704758,
        0.005625421646982431,
        0.05087711289525032,
        0.05684201791882515,
        0.01616201177239418,
        0.004655198659747839,
        0.10798010975122452,
        -0.0897212103009224,
        -0.10213395208120346,
        0.037814199924468994,
        0.012970788404345512,
        -0.00023497380607295781,
        -0.02259042300283909,
        0.11233294010162354,
        0.021841062232851982,
        -0.018648460507392883,
        -0.06061076372861862,
        0.0236918106675148,
        0.01679394207894802,
        0.012905329465866089,
        0.06747682392597198,
        -0.013471498154103756,
        0.04835077002644539,
        -0.019264623522758484,
        0.06690195202827454,
        0.0011147732147946954,
        -0.0070678130723536015,
        0.07050143927335739,
        -0.016193991526961327,
        -0.020637819543480873,
        -0.021368345245718956,
        0.02577623538672924,
        -0.02866179868578911,
        0.028719812631607056,
        -0.045573655515909195,
        -0.0706377848982811,
        -0.025032252073287964,
        0.05814576521515846,
        -0.015072538517415524,
        0.003029132727533579,
        -0.03899068385362625,
        -0.03389912098646164,
        0.02648499235510826,
        -0.048326026648283005,
        -0.08592045307159424,
        0.08361566811800003,
        -0.0007424156065098941,
        0.08333785831928253,
        0.056772373616695404,
        -0.04277528449892998,
        -0.09263945370912552,
        -0.024181261658668518,
        -0.018508924171328545,
        0.042278360575437546,
        0.0700778067111969,
        -0.02727866917848587,
        -0.06681874394416809,
        0.001982014859095216,
        -0.05113476142287254,
        -0.024358907714486122,
        -0.04013170301914215,
        0.023256931453943253,
        -0.028319764882326126,
        0.06442679464817047,
        0.12575145065784454,
        -0.016510313376784325,
        0.008181632496416569,
        0.02875230275094509,
        -0.0218854658305645,
        -0.06655681133270264,
        0.014661731198430061,
        0.004784990102052689,
        -0.09227853268384933,
        5.6071510324345134e-33,
        0.013726597651839256,
        0.05734813213348389,
        -0.005996627267450094,
        0.047733619809150696,
        0.09161531180143356,
        -0.0019793864339590073,
        -0.03506772965192795,
        -0.030792783945798874,
        -0.06494390219449997,
        -0.009356584399938583,
        -0.07302191853523254,
        0.08213723450899124,
        -0.04262856766581535,
        -0.00992643553763628,
        0.03851541504263878,
        -0.14322109520435333,
        -0.09153489768505096,
        -0.0178981963545084,
        -0.04032745584845543,
        -0.037254590541124344,
        -0.0023145757149904966,
        -0.0034432183019816875,
        0.03086032345890999,
        -0.05249178782105446,
        0.07628078013658524,
        -0.02964884787797928,
        -0.03965386003255844,
        0.030680689960718155,
        0.12414046376943588,
        0.0663461685180664,
        -0.031243912875652313,
        0.011948542669415474,
        -0.04557244852185249,
        -0.07970712333917618,
        -0.010988342575728893,
        -0.045634638518095016,
        -0.0895688608288765,
        -0.11349455267190933,
        0.07834551483392715,
        0.0006986404769122601,
        -0.052023470401763916,
        0.06000654399394989,
        -0.03850764036178589,
        -0.009976351633667946,
        -0.03263874724507332,
        -0.012924517504870892,
        0.09925428032875061,
        -0.001147943432442844,
        0.06911448389291763,
        -0.019067656248807907,
        -0.10424233227968216,
        -0.01227232813835144,
        -0.04385872557759285,
        -0.07156690955162048,
        -0.019174523651599884,
        -0.048138052225112915,
        0.004316421691328287,
        0.03491866961121559,
        0.08011210709810257,
        0.02490548975765705,
        0.02733488194644451,
        0.04404878243803978,
        -0.04620983824133873,
        -0.039129942655563354,
        -0.06414956599473953,
        0.05418890714645386,
        0.06197109445929527,
        0.04801730066537857,
        -0.020465165376663208,
        0.0075036631897091866,
        -0.03561662882566452,
        -0.0015571281546726823,
        -0.014257130213081837,
        -0.05338277295231819,
        -0.01577954739332199,
        0.05373220145702362,
        -0.09021976590156555,
        0.020168732851743698,
        -0.05323273688554764,
        -0.022871334105730057,
        -0.006138619035482407,
        -0.026856495067477226,
        0.01667623035609722,
        0.02469448931515217,
        0.034813620150089264,
        -0.03709093853831291,
        -0.006920939311385155,
        -0.07321913540363312,
        -0.016529522836208344,
        0.004413462709635496,
        -0.03234854340553284,
        0.01716896891593933,
        0.04998541995882988,
        0.050884149968624115,
        -0.04240444302558899,
        -5.701702655226873e-33,
        0.008573148399591446,
        -0.0036533402744680643,
        0.009183214977383614,
        -0.015642639249563217,
        0.05048805847764015,
        -0.018691450357437134,
        0.09598472714424133,
        -0.01393866166472435,
        0.035387516021728516,
        0.00830145739018917,
        0.048494722694158554,
        0.09605966508388519,
        -0.05308195948600769,
        -0.027021868154406548,
        -0.023650841787457466,
        -0.03728218004107475,
        -0.01938623934984207,
        -0.009596406482160091,
        0.004406655207276344,
        -0.05288559943437576,
        0.07120335847139359,
        -0.014962585642933846,
        -0.05203660950064659,
        0.04494144022464752,
        -0.009172032587230206,
        0.02300071157515049,
        -0.007002406287938356,
        -0.004068170208483934,
        0.005819928832352161,
        0.045456819236278534,
        -0.026904689148068428,
        -0.038388654589653015,
        -0.00502771744504571,
        0.05496374890208244,
        0.10193003714084625,
        0.039845071732997894,
        0.10635683685541153,
        0.019218269735574722,
        -0.043046463280916214,
        -0.055839989334344864,
        0.11253106594085693,
        -0.008719705045223236,
        0.00260218046605587,
        -0.013573323376476765,
        0.04871932044625282,
        -0.010440337471663952,
        -0.09772083908319473,
        -0.056404318660497665,
        -0.10886912047863007,
        -0.03136667609214783,
        0.021791554987430573,
        -0.038388870656490326,
        0.05965542420744896,
        -0.06520674377679825,
        0.016946354880928993,
        0.011835528537631035,
        0.07516120374202728,
        0.015411211177706718,
        0.027439801022410393,
        -0.03561399132013321,
        -0.020040931180119514,
        -0.024612989276647568,
        -0.01260712556540966,
        0.07847832143306732,
        0.0688214972615242,
        -0.05161872133612633,
        0.03190584108233452,
        0.0903828889131546,
        -0.061512578278779984,
        0.009886828251183033,
        -0.024142660200595856,
        -0.026406945660710335,
        -0.03446916863322258,
        -0.05953299254179001,
        -0.04638075828552246,
        -0.037359386682510376,
        0.04233052581548691,
        -0.03303483501076698,
        -0.062307436019182205,
        0.059487730264663696,
        0.023994039744138718,
        0.0888601765036583,
        0.04547100141644478,
        -0.042322807013988495,
        0.102114237844944,
        0.05177972465753555,
        0.07787494361400604,
        0.05865109711885452,
        -0.03393120318651199,
        0.013740714639425278,
        -0.03603828698396683,
        -0.001791059272363782,
        -0.014401406981050968,
        0.07129614800214767,
        0.04719144478440285,
        -6.43346282913626e-08,
        -0.004943678621202707,
        0.03946053981781006,
        0.013890709728002548,
        0.021330701187253,
        -0.0231221504509449,
        -0.08218439668416977,
        0.059687212109565735,
        0.04750993102788925,
        0.025154639035463333,
        0.025955142453312874,
        -0.025756435468792915,
        -0.05527648329734802,
        -0.05190841853618622,
        0.07311533391475677,
        0.10544655472040176,
        0.08638829737901688,
        -0.09679313004016876,
        0.02649606391787529,
        -0.04410412907600403,
        -0.06833525747060776,
        0.04413718357682228,
        0.03152697905898094,
        0.09395801275968552,
        0.05879903584718704,
        0.05777954310178757,
        0.04970027506351471,
        -0.015200317837297916,
        0.03600240498781204,
        0.043176162987947464,
        -0.03491431847214699,
        -0.12065039575099945,
        -0.0426478236913681,
        -0.03634761646389961,
        -0.053651634603738785,
        -0.026467369869351387,
        -0.025011714547872543,
        -0.03917315602302551,
        -0.017573630437254906,
        0.02818838320672512,
        0.10890120267868042,
        -0.01711214706301689,
        -0.054317571222782135,
        0.023327765986323357,
        0.04407009482383728,
        0.07670960575342178,
        0.041557542979717255,
        -0.02534840814769268,
        0.013553144410252571,
        -0.0020213976968079805,
        -0.016008121892809868,
        -7.960051880218089e-05,
        0.001490689581260085,
        0.06437469273805618,
        -0.003927426412701607,
        -0.006263519171625376,
        0.02666359208524227,
        -0.012071873992681503,
        0.07379473000764847,
        0.016032403334975243,
        0.03218686953186989,
        0.03157634660601616,
        0.04193373769521713,
        -0.0285782590508461,
        0.06047031655907631
    ]
}