{
    "id": "pfeaQdS00a4",
    "title": "PS5 isn't as powerful as Xbox Series X",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-03-18T22:09:32Z",
    "video_url": "https://www.youtube.com/watch?v=pfeaQdS00a4",
    "category": "Science & Technology",
    "tags": [
        "ps5",
        "playstation 5",
        "ps5 specs",
        "ps5 vs xbox series x",
        "ps5 vs series x",
        "playstation",
        "xbox",
        "xbox series x",
        "xbox series x vs ps5",
        "ps5 graphics",
        "game console",
        "sony",
        "microsoft",
        "console",
        "gaming",
        "tech",
        "2020",
        "this is",
        "austin evans"
    ],
    "views": 2597953,
    "likes": 73112,
    "comments_count": 27123,
    "description": "The PS5 is official and...can't QUITE hang with the Xbox Series X.  Our Xbox Series X hands on and teardown   Can the PS5 beat the Xbox Series X?    My new podcast The Test Drivers!  Our second channel @thisis!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/7Fjn4GRw8qE",
        "https://www.youtube.com/watch?v=p2V_oiW5mhQ",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today, Sony took the wraps off the PS5 so let's take a deep dive into exactly what's new and how it compares to the Xbox Series X. So, definitely a couple of key takeaways. First of all and it should be a surprise to exactly no one is that the PS5 is significantly faster than the PS4 Pro that it's replacing. What's also a bit of a surprise is how the PS5 stacks up with the Xbox Series X. It is certainty not a clean sweep that the Series X has a lot going for it, I'll get a little bit more into that in just a second. Something else that's really surprising here is what the backwards compatibility story looks like. Now obviously on the Xbox side of things we have pretty much full backwards compatibility all the way back to a lot of original Xbox games. Now with the PS5, thankfully, we do have some backwards compatibility but it pretty much only extends to PS4 games and even at that level it's only some PS4 games. They're aiming to have most of them available at launch but it's not going to be quite as smooth as on the Xbox front from what I'm seeing here. All right so for this one, Jimmy, can I have my nerd hat, please? Thank you very much! So with our nerds hats on, inside the PS5 we have a 8 core Ryzen base processor. So we have 8 Zen cores with hyper-threading and this is very similar to what we have on the Xbox as well as, of course, Ryzen on the PC front. So it's roughly equivalent to a Ryzen 7 3700X although it is running it at lower clock speeds in this case up to 3.5 Ghz. Now I'll go much more in depth on that one in a second, but this is a, huge, huge step up over what we have on the current generation of consoles. Now what the PS5 really does differ from the Xbox series X is with the graphic side of things. So it does have the same base RDNA 2.0 core so that means you have things like ray tracing that's just baked in, but the way they've configured it very different. So to put it in a nutshell the PS5 has a smaller GPU which is running at a higher clock speed. Now there are a lot of advantages and disadvantages to this. So one of the big advantages is that a smaller GPU is going to be theoretically easier to cool but more importantly for Sony cheaper to manufacture so that does lend some credence to the fact that the PS5 Will likely be a little bit cheaper than Series X but the way that they've accomplished this performance means that it is actually not as powerful as the Xbox Series X. Although to be fair if you look at the Xbox One vs PS4, the PS4 was much more powerful. This is a little bit of a closer fight but the way that they're accomplishing that performance is kind of unusual because they're actually pushing this thing super, super hard. Now part of the reason they're able to get such high clock speeds out of it is because it is a variable clock speed or boost speed so this is something we see a lot on the PC side of things but it's a little bit of disadvantage potentially on console so if you take a look at the Xbox Series X the CPU and GPU run at a fixed clock speed all the time, the end, right? So if you're a developer you're designing it to run at exactly like clock speed you have no worries where as with the PS5 it will go up to 3.5 GHz, honestly. It will go up to 2.23 GHz on the GPU which to be fair is like more powerful than pretty much anyone who is able to get at one of these RDNA 2.0 GPUs but the downside though is that's not a fixed level of performance. To me what I'm looking at here is a PS5 which on the main system components the CPU and GPU is not as powerful as the Xbox Series X and could potentially be a little bit lower if it does start to throttle. Now some of the rest of the specs actually get much more interesting on the PS5 side. So memory is quite similar between the Series X and PS5. They both have 16GB of GDDR6 although the PS5 actually has a slight disadvantage there but we'll get into that in a second. Where there's a serious advantage for the PS5, however, is in the SSD. So obviously SSDs this generation are going to be significantly faster like literally orders of magnitude faster than last generation but the way that this Sony approach is this time is different. So first of all the PS5 has an 825GB SSD. A very strange number although it's not a standard SSD so its actually built into the PS5 and essentially they've done everything they can to customize it to be as quick as possible. That means that worlds could be bigger, that means that there can be much more detailed textures which makes sense considering you have so much power on the rest of the console. And it also means that things can be ready to go pretty much instantly, right? So we've already seen this with the Xbox and obviously that's a slower SSD where load times have been cut from like 30 seconds to 10 seconds and with optimization especially with some of the stuff that Sony is doing we can expect incredibly quick load times in this generation. - Well I'll believe that when I see it, right? Because, yes, even if you're at like 8 GB a second you still have 16 of G6 memory to fill so I mean were still talking a couple seconds and that's like best case scenario so I still feel like we'll be looking at a few seconds of load times but it is gonna be so much better than last generation like the old consoles are gonna look slow. Although they already look slow when you load like Red Dead. - No! So that is raw. So what you're actually going to get out of the box on the PS5 is likely going to be significantly less than that. Which is unfortunate considering that's, well, obviously a downgrade from what you get on like a standard PS4 or PS4 Pro today now there is however expandable storage so they way Sony has approached this generation is actually not that different than what they've done in the past. So there is a standard NVMe slot built in to the PS5 so we don't actually know what the hardware will look like but I assume they'll be like some hatch or some panel to open it up but you can plug a standard PCIe 4.0 SSD in and instantly it increase your storage capacity by a lot. However, while it sells great in theory realistically the PS5 has a very high level of performance that it expects, right? All of these generation of consoles they all want super fast SSDs and they want very consistent performance so while technically you can just put in a PCIe 4.0 SSD off the shelf first of all you need something which is going to actually fit so most of these SSDs that available right now have like big beefy heat syncs or fans which will not fit and on top of that it actually needs to be quick enough just full stop. So running a program where they're going to be validating drives so theoretically you could just stick anything in but it very well either may load slow or may not work at all for games. So this is something which I think is going to be more of a future proof style thing I don't know if there are any SSD that will be on sale by the end of this year which you can just plug and play into the PS5. Which your point Jimmy you can still plug in USB hard drives. (Beep) - But if you wanna play your PS5 games you're pretty much limited to that 825 gig SSD for now until you can further expand it. Which if you compare to the Xbox Series X while you do have to buy those expansion modules those expansion modules will be available presumably day one and you could buy as many of them as you need. So it's gonna be an interesting generation this time because there are some legitimately huge differences in performance and capabilities between the Xbox Series X and the PS5. All right boys let's tighten our nerd hats because were gonna go one level deeper now and I'm gonna push my hat one level deeper. So there are a couple of additional things that they talked about so they have a Tempest audio engine now this is something which is mean to give you much, much more accurate I know they've used a phrase like Ray tracing for audio but essentially it is to be a little bit more positionally accurate and there's a lot of interesting things they've done by essentially repurposing like not quite GPU cores but something kind of similar to give you much much higher fidelity audio but we'll see how that works and well see which developers actually fully take advantage of that and of course we do still have a Blu-ray drive on board. My nerd hat is a little too low. We have a 100 TB, 100 GB! 100GB custom Blu-ray but it does now support 4K UHD Blu-rays as well. So after a very busy week of console announcements and news the real question here is how does the PS5 stack up with the Xbox Series X? So first of all with the CPU they're very similar they both take advantage of 8 core 16 threads Zen 2 designs so again very similar to high end Ryzen and the really only major difference is that the Xbox can clock a little bit higher so the PS5 is at 3.5 GHz with full 16 threads you have everything available, however, that is a variable clock speed so its up to 3.5 but could go lower. Whereas with the Xbox Series x with everything on your 3.6 GHz and if you would like to turn off that multi threading and just get pure clock speed you can go all the way up 3.8. so there's no doubt this is a win for the Xbox Next up for graphics what we have on the PS5 is again a RDNA 2.0 GPU so these are very comparable GPUs but the configurations are very different. So the PS5 has 36 CUs available at 2.23 GHz, however, again that is a boost frequency so it'll likely will come down sometimes. However, on the Xbox side we have 52 CUs at 1.8 GHz so when you put that all together the Xbox has a confirmed speed of 12 teraflops whereas the PS5 can go up to 10.2 teraflops and we will see that sort of vary based on the actual load of the games. Now this is another case where it seems like the Xbox has a clear win but the difference is, is that I believe the Xbox will likely need more power to hit that and obviously we've seen with the design of the Xbox Series X it's a bigger system it needs that huge vapor chamber. Whereas with the PS5 we don't know what it looks like but I would hazard a guess to say that it was going to be a little bit smaller than the Series X and it might be a little bit closer to what we have like a traditional console like the PS4 Pro. But putting that aside best case scenario PS5 is still almost 20% slower than the Xbox Series X and likely could fall even lower based on the game. Memory is pretty straightforward. Both have 16 GB of GDDR6 however there are some slight differences so the Xbox does have a wider memory buzz and because of that 10 of their 16 GB of ram run at 560 GB per second which is slighter faster than what you get on PS5 but realistically this is probably not going to be anywhere near the kind of delta that we saw say on last generation. Now for the SSD the PS5 has an advantage but its not a super clear one. So yes the PS5 does have a smaller 825 gig SSD compared to a 1 TB drive on the Xbox Series X and yes the PS5 does have significantly faster run. So we'll do 5.5 GB per second raw or 8 to 9 GB compressed whereas the Series X will be 2.4 GB raw and 6 GB compressed. So pretty major difference there but the downside is, is that the Xbox at least right now has a much easier expansion so once you fill up your PS5 drive you're gonna have to start shoveling things around until at least we get SSDs which are going to be fast enough whereas the Xbox you can buy those expansion modules and use them pretty much day one. They might be expensive but this is a little bit of a weird one and I'm really curious to see how well developers are able to take advantage of these speeds because while yes it sounds like a big difference in theory but the optimization here can make a huge difference especially considering that these are so, so much faster than last generation. So when you look at everything we know about the PS5 and the Series X they're roughly equivalent, right? They share a lot of the same sort of underpinnings, a lot if the same components but there's a very clear advantage for the Xbox Series X now does that mean that the Xbox Series X will be more expensive? I would expect so, right? So based on this it looks like Sony is trying to push a smaller cheaper design to higher clock speeds and sort of optimizing with like boost clocks and everything but at the end of the day I feel like we're in store for a really exciting generation. So I'm curious what do you guys think about the PS5 launch announcement? What do you want to know and how do you think it's going to stack up to the Series X? Are you actually gonna pull the trigger on one or are you gonna stay team Sony? Team Xbox or team PC masteries? A lot of people are gonna say that one. - [Ken] That one? - Yeah.",
    "transcript_keywords": [
        "Xbox Series",
        "Xbox",
        "Series",
        "SSD",
        "bit",
        "GPU",
        "Xbox side",
        "clock speed",
        "Sony",
        "generation",
        "clock",
        "lot",
        "things",
        "speed",
        "SSDs",
        "pretty",
        "Ghz",
        "Ryzen",
        "Xbox games",
        "advantage"
    ],
    "transcript_entity_values": [
        "almost 20%",
        "100",
        "G6",
        "PS4 Pro",
        "Ray",
        "Blu-ray",
        "the Xbox Next",
        "12 teraflops",
        "up to 3.5",
        "the Xbox Series",
        "16 GB",
        "first",
        "10",
        "Ryzen",
        "Team Xbox",
        "the Xbox Series X.",
        "6 GB",
        "the end of this year",
        "USB",
        "K UHD Blu",
        "GB",
        "a very busy week",
        "Xbox",
        "a few seconds",
        "1",
        "2.23 GHz",
        "PS4",
        "pretty much day one",
        "the Series X",
        "up to 3.5 GHz",
        "Xbox",
        "the end of the day",
        "1.8 GHz",
        "Jimmy",
        "3.5 GHz",
        "Red Dead",
        "4",
        "Sony",
        "8",
        "one",
        "TB",
        "second",
        "2.0",
        "the Xbox Series X",
        "825GB SSD",
        "a couple seconds",
        "GDDR6",
        "16GB",
        "the Series X",
        "the PS4 Pro",
        "Tempest",
        "Zen 2",
        "52",
        "3.6 GHz",
        "16",
        "10.2 teraflops",
        "560",
        "3.8",
        "36",
        "CPU",
        "GDDR6",
        "SSD",
        "PS4",
        "2.4 GB",
        "PS5",
        "Ryzen",
        "5.5",
        "825",
        "Jimmy",
        "GPU",
        "today",
        "First",
        "like 30 seconds to 10 seconds",
        "Ryzen",
        "9 GB",
        "Series"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "FAC",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "LOC",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "EVENT",
        "MONEY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "TIME",
        "GPE",
        "CARDINAL",
        "EVENT"
    ],
    "vector": [
        0.04966485872864723,
        -0.06274962425231934,
        0.09248718619346619,
        -0.006558284163475037,
        0.14330239593982697,
        -0.01812046207487583,
        -0.041057080030441284,
        -0.039053697139024734,
        -0.02705424837768078,
        0.03391622006893158,
        -0.08933650702238083,
        0.1328844279050827,
        -0.0016763136954978108,
        -0.035239432007074356,
        0.025831302627921104,
        0.009180446155369282,
        0.052943918853998184,
        -0.09548487514257431,
        -0.09765779227018356,
        0.06366672366857529,
        -0.027166254818439484,
        -0.12399843335151672,
        -0.02951345220208168,
        0.022746024653315544,
        0.007751889992505312,
        0.06991784274578094,
        -0.09899375587701797,
        -0.03822185844182968,
        -0.05108393356204033,
        -0.010198021307587624,
        -0.06057659536600113,
        0.07362370938062668,
        -0.02707524038851261,
        -0.07929439842700958,
        -0.05357424542307854,
        -0.011695892550051212,
        0.06459972262382507,
        0.027354771271348,
        -0.01546850148588419,
        -0.03201489895582199,
        -0.01564113423228264,
        -0.04125925526022911,
        -0.03223664313554764,
        0.04448820650577545,
        0.003940745256841183,
        3.322730117361061e-05,
        -0.05385540425777435,
        -0.0661671981215477,
        -0.037035685032606125,
        0.02446197345852852,
        -0.009275110438466072,
        -0.020676525309681892,
        0.03974480926990509,
        -0.07776950299739838,
        -0.07484278827905655,
        0.027017952874302864,
        0.022423030808568,
        0.01630958542227745,
        0.05809123441576958,
        0.0035036520566791296,
        -0.00737106055021286,
        -0.0904955193400383,
        -0.03237011656165123,
        -0.005655994638800621,
        0.006507787387818098,
        0.019021186977624893,
        0.04718146473169327,
        -0.009184016846120358,
        0.002234868472442031,
        0.056161895394325256,
        -0.08717761188745499,
        0.0537714883685112,
        0.056399837136268616,
        0.05500560253858566,
        -0.021595999598503113,
        0.02046765573322773,
        0.03238951414823532,
        -0.020600831136107445,
        0.0014057353837415576,
        0.009130917489528656,
        0.05608349293470383,
        0.02876206487417221,
        -0.11003503203392029,
        -0.03904346376657486,
        -0.02435523271560669,
        0.040560755878686905,
        -0.002732236636802554,
        -0.06931480765342712,
        -0.03360407054424286,
        -0.028546767309308052,
        -0.004227401223033667,
        0.02049187757074833,
        0.09979119151830673,
        -0.005709094926714897,
        0.004329376388341188,
        0.028995022177696228,
        -0.09570930153131485,
        -0.04900721460580826,
        0.030501173809170723,
        0.000647303240839392,
        0.013909499160945415,
        0.08359614759683609,
        0.02161378785967827,
        -0.060027219355106354,
        -0.003754738252609968,
        -0.05040939152240753,
        -0.07043088227510452,
        0.02265053242444992,
        -0.03682887926697731,
        -0.019805150106549263,
        -0.02748330682516098,
        -0.041860658675432205,
        -0.05397778004407883,
        0.038266174495220184,
        0.02334708534181118,
        0.03726521134376526,
        -0.01043589785695076,
        0.010074859485030174,
        -0.007293602917343378,
        -0.026158660650253296,
        0.04502303898334503,
        -0.003160570515319705,
        -0.07264707237482071,
        0.006567727774381638,
        0.06935012340545654,
        -0.03613891080021858,
        -0.03228425607085228,
        5.167016927469863e-33,
        -0.05715774744749069,
        0.09253188967704773,
        0.0954475849866867,
        0.04375385865569115,
        -0.022205431014299393,
        -0.020105257630348206,
        0.0271899551153183,
        0.057937122881412506,
        0.009756273590028286,
        0.09994775801897049,
        -0.006420700345188379,
        0.06724807620048523,
        -0.05284189432859421,
        -0.028574269264936447,
        0.058279480785131454,
        -0.009047305211424828,
        -0.004095680080354214,
        -0.011730675585567951,
        -0.014646628871560097,
        0.03996078297495842,
        0.03892087936401367,
        0.0487721785902977,
        -0.021663405001163483,
        -0.058051954954862595,
        0.0027802803087979555,
        0.08641231805086136,
        0.004918538499623537,
        -0.01454600878059864,
        0.007174056489020586,
        -0.023415403440594673,
        -0.13441823422908783,
        0.015932975336909294,
        0.020601211115717888,
        0.03373371809720993,
        0.023664476349949837,
        -0.0035709307994693518,
        0.07426118850708008,
        -0.0682760626077652,
        0.05430927127599716,
        0.08240886777639389,
        -0.04700250178575516,
        0.00015897229604888707,
        -0.07362738251686096,
        -0.0002747612597886473,
        0.03468787670135498,
        0.00409960700199008,
        -0.051085881888866425,
        -0.06901200860738754,
        -0.1123650074005127,
        -0.02077583223581314,
        0.016999291256070137,
        0.07330450415611267,
        0.007189475931227207,
        0.05081772059202194,
        0.05254823714494705,
        -0.07701195776462555,
        0.026861069723963737,
        0.010839667171239853,
        0.03162584826350212,
        0.10570009052753448,
        0.09988061338663101,
        -0.032445915043354034,
        -0.04125696420669556,
        -0.034191373735666275,
        -0.05079936236143112,
        0.060277655720710754,
        0.10055960714817047,
        -0.0035045749973505735,
        -0.03237167000770569,
        0.02118070423603058,
        -0.0175522118806839,
        0.021407345309853554,
        -0.05592968687415123,
        0.0003855265094898641,
        0.11553364247083664,
        0.028763409703969955,
        -0.042199376970529556,
        0.04731767997145653,
        0.03509736433625221,
        0.06473322212696075,
        -0.11536618322134018,
        0.03825605288147926,
        -0.01641453616321087,
        0.01899058185517788,
        -0.021141471341252327,
        0.0501696914434433,
        0.08952176570892334,
        -0.006703193299472332,
        -0.01806936226785183,
        -0.025093689560890198,
        0.026735888794064522,
        -0.09744645655155182,
        0.045984312891960144,
        0.07745148986577988,
        0.017173275351524353,
        -5.639268476834855e-33,
        0.025839272886514664,
        -0.11052229255437851,
        0.049929045140743256,
        0.04761776700615883,
        -0.026524148881435394,
        -0.006715789902955294,
        0.0016175891505554318,
        -0.053771164268255234,
        -0.06816453486680984,
        -0.007991073653101921,
        0.03507954999804497,
        0.011027898639440536,
        0.013115635141730309,
        0.10361278057098389,
        0.026575244963169098,
        -0.015077993273735046,
        0.029323343187570572,
        -0.06821689009666443,
        0.026714665815234184,
        -0.036418020725250244,
        0.08266281336545944,
        0.10754776000976562,
        0.044294338673353195,
        0.047064706683158875,
        0.022448500618338585,
        0.004615249112248421,
        0.06927608698606491,
        0.0006621847860515118,
        0.04716513305902481,
        -0.03657994419336319,
        -0.031202532351017,
        0.009328675456345081,
        0.08274921029806137,
        -0.013996723107993603,
        0.030330900102853775,
        0.027576426044106483,
        -0.045273393392562866,
        0.0166397113353014,
        0.01355115044862032,
        -0.0062764533795416355,
        -0.03536435589194298,
        0.005482937209308147,
        0.029323741793632507,
        -0.06390274316072464,
        0.0003592504363041371,
        0.011690034531056881,
        0.0028312208596616983,
        0.038698937743902206,
        0.173392191529274,
        0.07865815609693527,
        0.12848834693431854,
        0.015675799921154976,
        -0.1121918112039566,
        -0.0037964663933962584,
        -0.04931016266345978,
        -0.03864172846078873,
        -0.09403669089078903,
        -0.006724719889461994,
        -0.07590193301439285,
        0.0266081802546978,
        -0.008167865686118603,
        0.02316526509821415,
        0.058845486491918564,
        0.04173753038048744,
        0.0136263407766819,
        0.0271924939006567,
        0.09482213854789734,
        -0.0458831712603569,
        0.003746684407815337,
        -0.024281887337565422,
        -0.08802875131368637,
        -0.04343508183956146,
        -0.01541314460337162,
        -0.009376701898872852,
        0.051222044974565506,
        0.05757033824920654,
        0.002213261788710952,
        -0.005896785296499729,
        -0.0018616679590195417,
        -0.011007143184542656,
        -0.0862751230597496,
        0.009155946783721447,
        0.007753457874059677,
        -0.006437709089368582,
        -0.02418406493961811,
        0.048387881368398666,
        0.017643140628933907,
        0.0009560179896652699,
        0.009513191878795624,
        -0.029001353308558464,
        0.029884159564971924,
        -0.03693050518631935,
        -0.0914819985628128,
        0.006452284753322601,
        0.017302142456173897,
        -5.507270728344338e-08,
        0.059123653918504715,
        -0.01961604878306389,
        -0.011765677481889725,
        -0.027421513572335243,
        0.007523148786276579,
        0.025531427934765816,
        -0.08135545253753662,
        -0.023378964513540268,
        0.06757248938083649,
        0.05176522955298424,
        0.06461918354034424,
        -0.012441923841834068,
        0.03320949897170067,
        -0.002491218037903309,
        -0.03154769539833069,
        0.07440275698900223,
        -0.08648717403411865,
        -0.003872874891385436,
        0.012136409059166908,
        0.022180255502462387,
        -0.06516582518815994,
        0.009336608462035656,
        -0.014250856824219227,
        -0.07865872979164124,
        0.015470683574676514,
        -0.07757480442523956,
        -0.08371493220329285,
        -0.02554396726191044,
        0.05608557537198067,
        -0.04731499031186104,
        -0.023336276412010193,
        -0.07813525199890137,
        -0.025211431086063385,
        -0.023899566382169724,
        0.06079021096229553,
        0.019938645884394646,
        0.02665715292096138,
        0.032711490988731384,
        0.02727002091705799,
        -0.011792630888521671,
        -0.007831943221390247,
        -0.13158005475997925,
        -0.09670373052358627,
        0.029686635360121727,
        -0.022510888054966927,
        -0.05807006359100342,
        -0.03625363111495972,
        -0.07542697340250015,
        -0.056253984570503235,
        -0.014690867625176907,
        -0.04308672994375229,
        0.06587360054254532,
        0.009949433617293835,
        -0.06521712243556976,
        0.06741634756326675,
        0.03819863870739937,
        -0.024215256795287132,
        -0.022049976512789726,
        -0.04191263020038605,
        0.06797748804092407,
        0.0292675718665123,
        -0.07105723768472672,
        0.0707840621471405,
        0.08246174454689026
    ]
}