{
    "id": "pG8yt-4UQDs",
    "title": "My sister controls my internet for a day!!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-07-19T01:57:04Z",
    "video_url": "https://www.youtube.com/watch?v=pG8yt-4UQDs",
    "category": "Science & Technology",
    "tags": [],
    "views": 663696,
    "likes": 18341,
    "comments_count": 1809,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today we're unboxing something really interesting. This is called Circle. Now what Circle does is it basically allows families to be able to manage internet consumption. You're able to track and limit and sensor different types of content that is being distributed on your network. And what's great about this is you can allow different types of access for different age levels. It is one easy-to-manage solution. I'm sure most of you guys watching this may be younger, and you're like, no I wanna be able to visit any website that I want to. But obviously, I think in most households, there is some sort of limitations placed on the internet. So I'm sure if you guys aren't getting good grades or something like that, you may be grounded from the computer, or maybe that was just me. But there was no easy way to do that back then. Like my mom would just take the keyboard. So with this, what I love about it is it is opening a communication and the dialogue between families. It limits time spent, it sensors websites that you shouldn't be on. But it also has a really cool reward system, so say maybe you got an A on a test. Or in the case of this video, my sister is going to be restricting my internet access, maybe I did something nice for Jenna, so she rewards me an extra hour. So lets unbox and get ready for Jenna to restrict my internet access for a day. Thanks to Circle for sponsoring this video. It's going to be so fun. Meet your Circle. Here it is. Oh, it's not very big at all. Fun thing is my first thought was, okay, well, what if I decide to unplug Circle? It has a battery backup built in, so nice try. Ooh. Start here. So I'm also gonna have to set this up on Jenna's phone, because she's gonna be acting as my parent. (box squeaks) This is a nice little box. Oh, look at that. Plug that in there. So we're gonna set up my profile on Jenna's phone. Now what this means is she is acting as my parent, so she's gonna be setting up the child profile. And then she'll be able to link my child profile to my mobile device with the same app. So let's type in my name. Let's spell it properly. Let's choose an existing photo. Let's see, there's a nice selfie. Let's filter Justine as a kid. These are all the things that I would be allowed to have access to, Amazon, Cartoon Network, Club Penguin Island. So I'm gonna say I'm not allowed to have access to Amazon because I shop too much. Save. Let's see my time limits. I think that I should be allowed to have two hours of Internet a day? Could I do it? Could I even do this? Oh my goodness, okay, I'm gonna hit Done. Oh, a bed time? Okay, I wanna go to bed at 7:00 p.m. Oh, yeah, right, I wake up at like 5:00 a.m. So this is not gonna work out. I'd like my bed time to be 7:00 p.m. and I'll wake up at 5:00 a.m. Okay, that's great, done. Add a mobile device. Now I need to download the Circle app on my phone. Set up as a kid device. I'm going to add a mobile device here by scanning the QR code, done. My phone's called Pig Phone. So add a device. Justine has been added to the Circle, success. I really do like having this location feature because that's one of the things that actually my entire family uses. We all use Find Friends on each other, because it really is something that is comforting to know where people are at all times. Some of you may not like that, but I am a huge fan of it. This is so exciting! Okay, this is me. I'm a kid, I'm normal. Look at my time limits. I have two hours left. This is my countdown between to bed time? Wait, I only have three hours more to be awake? I'm gonna give myself a reward. I'm gonna give myself a late bedtime tonight. (laughs) Okay. I'll say 8:00 p.m. Oh my gosh, my reward is here! I just got a reward for my bad time at 8:00 p.m. tonight! Holy crap, I'm so excited! Wow, I'm surprisingly enjoying this. I'm enjoying this a lot. Now let me set up my Circle, so that this is connected to my router, so we can get this whole process started and ready for Jenna. But look at that, guess who got an extra hour before bed time? Yeah, me, I got a reward. So the setup is pretty easy. I've got it plugged in. There's a power button in the back that I've already pressed. And we're just gonna plug this into our router. There's a little setup here that says set up Circle Home Plus, so I'm clicking that. Here it is, connect your Wi-Fi router and set your Circle Home next to it. Done. It's looking for it. Updating my Circle Home Plus. Okay, this is cool! Everything's happening, everything's happening! Oh, man, my sister is gonna love being able to control my internet access. What's crazy about this is it will show everything that is connected, and I have a lot of connected devices in my house. This is saying it's gonna take several minutes, but it's probably gonna take three years. Here, things are happening! The (mumbles), oh my gosh, it's connected. Holy moly, look at all these things that are just poppin' up! We've got all of my lights that are connected. These are my home pods. Okay, so I'm gonna hit Done. This is great. Okay, well, let's go. - So Justine has already used three hours of her time, and that was all she was supposed to have for the entire day and the day just started. She's in trouble. - No, but okay, but, I know, I know, I know, I know. The problem is I didn't realize that the music that I was listening to this morning was on the internet. I was on Spotify and I used three hours while I was cleaning. I was cleaning up to prepare for the shoot today. - Where did you think the music was coming from, is the question. - I'm sorry. Okay, I made a mistake, I learned my lesson, so now going forward, can you please grant me some more time? Just like a little bit of time? - I know that you have a lot of work to do, so I feel like I can let this one slide. Your one mistake. - My one mistake. - One mistake. I will give you three more hours. - Oh my gosh, I was only gonna ask for like one. - I will give you one more hour. - Three! You said it, you said it, you said it. We have it on film, three hours. Okay, come on. - All right, I sent you a reward of three hours. - Oh my gosh, you did 'cause it just showed up in my phone. Hold on a second. Look, look, look, this is so exciting. Okay, I just got a reward. My total time limit has been extended by three hours today. - Well I hope you're enjoying that time, because that probably just took up a minute. - Oh my gosh, you're right, you're right, you're right. Okay, okay, okay. I'm done, I'm done, I'm done, I'm done. I'm gonna go do my work, okay. I'm frantic. - I'm watching you. - [Justine] Why you are! - This is fun. - [Justine] Ooh, I forgot Mario Maker is out. (sneaky music) - Haw! You said you were working on the video that you own, but you're playing Nintendo Switch! - Oh my gosh! Okay, so I swear. - No, no, no, no, no. No, no I'm pausing it. - No, this isn't even funny. Oh come on! - You just have one job. If you do your job, then you can use the rest of your hours. - I feel like I'm back home again. - [Jenna] Oh my gosh, it's unbelievable. - [Justine] Oh no, oh god. - Haw! You have, your said you spent three hours cleaning. You literally hid everything in the bathroom. (laughing) - Oh my gosh. - I'm taking away an hour. - No! But no, that's not fair! Ugh! Okay, well, this is paused so I can't do anything, so I guess I'm taking my laptop and I'm going to go edit. - Don't make me be helicopter mom. - [Justine] Okay, fine, I'll be over here. - All right, just remember I can see you. - But if I'm a good girl-- - [Jenna] No. (sighs) - I mean Jenna's right, this video is due today, and I'm already wasting my hours away. But if I just sit down, get this done, then maybe she'll reward me with a later bedtime. Maybe. (laughing) Oh, wowee. - What are you doing? You're watching a show! Well, I hope that you're almost done with your show because I have limited you to 15 more minutes of watching it, so have fun. (light playful music) - Well, I'm gonna take those 15 minutes. (light playful music) So at this point I have no choice but to get this video done because I've already expired my time limits. And what's cool is I can see my time limits, I can see what's expired. Spotify and Netflix both are expired. And right now I have two hours and 40 minutes left of my total time allotment. And I have a video to shoot later, so hopefully I won't go over my time limit 'cause I do have to post some social media stuff about it. I've done 55 minutes of email today. I think I've been super productive. - Okay, she finally sent me the video. I'm so proud of her. Maybe I'll reward her with a later bedtime and some Instagram access. I know she really likes Instagram before she falls asleep. The only problem is she's supposed to be filming right now, or setting up to film. Oh my god, where is she? So weird, I checked her location and it says she's here, but I can't find her. This happens when I lose the dog and the dog is usually outside. Are you outside? What are you doing? - [Justine] Huh? - Maddie, what is she doing? She's not working. - I have a vitamin D deficiency. - Yeah, but you have a shoot 10 minutes ago. - How'd you find me? (laughs) - I pinged your location. - Oh, I'm startled from my slumber. - [Jenna] Yeah, go get inside, do your work. - Oh my gosh, but I have a vitamin D deficiency. I needed the sun. - That's fine, but get your work done first. - Okay, oh my gosh. - The sun's not goin' anywhere. - Why are you always yelling at me? TV time, TV time, TV time, TV time. Jenna! Get over here, it is TV time. I have done all of my chores. - Okay, you did. And you shot your video, you got that done? - Yep. - All right, fine, what are we watching? Chirpa chirpa chirpa chirpa chirp Chirpa chirpa chirpa chirpa chirp - [Jenna] Okay, I'm gonna go. No wonder she doesn't get anything done. Mommy shark, do do do do do do do Mommy shark, do do do do do do do Mommy shark - Did you just shut my internet off again? I was a good girl, I did all my tasks, and this is what I get. What else do you want me to do? Want me to make you some Rice Krispie treats? - Oh! - Oh! What do I get if I make them for you? What do I get? - Up for negotiation. - I would like 20 minutes of Instagram time, please, my lady. - Only if you tag me. - Okay, deal. - Oh, this is great. - I want 30 minutes, 30 minutes for a tag. - 30 minutes for two tags. - Two tags, two stories. - Okay, I'm on it. - Done. This is great. - There ya go. - Wow, social currency is real. This was such a fun experiment, but it was really crazy because you don't really realize how much time you spend doing things. Like three hours on Spotify this morning? I had no idea and I looked at my phone, I was like, oh, I'm in trouble. - It's true, sometimes I'll just catch myself scrolling through Instagram and I'm like, haw, how did I just waste an hour of my life? - You never know what's going on. You can waste so much time. You should go outside and play. - You should go outside and play. One thing that I feel like I need to restrict myself from is using my phone before bed. I feel like that interferes with my sleeping. - You don't really sleep very well. - No, I don't sleep. - And like even when I just wake up in the middle of the night, I just wanna reach over and grab my phone, but that's the worst thing to do, because then you're just all amped up on Instagram and Twitter. - It's true, I'm guilty of that. How was your experience? - It was definitely interesting, and it really did make me more aware of how much time I was spending doing things. Like honestly, when I look at that phone, I was like, I listened to Spotify for three hours? - I think that it also keeps you on track, because you actually can't go on Instagram, you can't watch your show. So I think I need that for myself, because I'm easily distracted. - I also think it's kind of interesting, so if you guys have this in your house and the parental unit is controlling it, you can negotiate. I'll take out the trash for an extra 30 minutes. I will sweep the floor for an extra maybe 15 minutes of Instagram time. - Or, you don't have to negotiate, you can just do it, and maybe be rewarded. - Jenna's usually right, I'm usually wrong. - This is what we like to hear, people. - Anyway, this was a really fun experiment. So, Circle, thank you guys so much for partnering with me in this video, This was really fun. And Jenna, thank you for restricting my access. - Oh, of course, any time. - Guess what? - Honestly, it's the only way I can get you to do anything. - I know, it is very true. Well I still have about 20 more minutes of internet access, so I'm gonna go finish my Netflix show. Oh, wait, I can't watch. Can I have 20 minutes of Netflix so I can finish my show? - We can talk about it. - You look pretty today. - No, come on! (slow jazz music) - Nice tan. Did you go to Spain or something? - I did, look at my tan. You can have your 20 minutes. - Yes. - I'm easily bought. (laughs)",
    "transcript_keywords": [
        "time",
        "Circle",
        "hours",
        "minutes",
        "Jenna",
        "Circle Home",
        "time limits",
        "gosh",
        "phone",
        "Chirpa chirpa chirpa",
        "bed time",
        "internet",
        "Chirpa chirpa",
        "Instagram",
        "access",
        "Instagram time",
        "reward",
        "internet access",
        "video",
        "Chirpa"
    ],
    "transcript_entity_values": [
        "an extra 30 minutes",
        "two hours and 40 minutes",
        "Justine] Huh",
        "30 minutes",
        "second",
        "an extra hour",
        "one",
        "Amazon",
        "Club Penguin Island",
        "Spotify",
        "20 minutes",
        "an hour",
        "Circle",
        "Circle Home Plus",
        "Justine",
        "tonight",
        "Two",
        "this morning",
        "Find Friends",
        "Like three hours",
        "three hours",
        "Instagram",
        "Rice Krispie",
        "those 15 minutes",
        "about 20 more minutes",
        "Circle Home",
        "55 minutes",
        "Twitter",
        "the entire day",
        "Justine]",
        "one more hour",
        "Wi-Fi",
        "a day",
        "Maddie",
        "Netflix",
        "10 minutes ago",
        "15 minutes",
        "the middle of the",
        "Pig Phone",
        "Nintendo Switch",
        "30 minutes, 30 minutes",
        "two hours",
        "Chirpa",
        "today",
        "Mario Maker",
        "two",
        "5:00 a.m.",
        "8:00 p.m.",
        "Spain",
        "7:00 p.m.",
        "Cartoon Network",
        "several minutes",
        "first",
        "three more hours",
        "Circle",
        "15 more minutes",
        "Jenna",
        "three years",
        "One"
    ],
    "transcript_entity_types": [
        "TIME",
        "TIME",
        "PERSON",
        "TIME",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "TIME",
        "LOC",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "TIME",
        "GPE",
        "TIME",
        "ORG",
        "TIME",
        "ORDINAL",
        "TIME",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.0016317861154675484,
        -0.09064912796020508,
        -0.032846324145793915,
        -0.1318959891796112,
        0.020140845328569412,
        0.027198664844036102,
        0.05771761015057564,
        0.035219576209783554,
        -0.0033130887895822525,
        0.07562929391860962,
        0.01061964314430952,
        0.003916334360837936,
        -0.014399669133126736,
        -0.008412581868469715,
        -0.0190047025680542,
        0.047987502068281174,
        0.022249821573495865,
        -0.04562080278992653,
        -0.06140688806772232,
        0.011930103413760662,
        -0.039686169475317,
        -0.07855924963951111,
        0.0544528029859066,
        -0.015189876779913902,
        -0.019548214972019196,
        0.07555442303419113,
        -0.0178066473454237,
        0.04819662123918533,
        -0.088160440325737,
        -0.09346651285886765,
        -0.04980447515845299,
        -0.008046610280871391,
        0.10005969554185867,
        0.012510260567069054,
        0.014135408215224743,
        -0.015261657536029816,
        0.024279562756419182,
        0.013487813994288445,
        -0.020239342004060745,
        -0.029602812603116035,
        0.008059917949140072,
        -0.06958860158920288,
        0.022029874846339226,
        -0.04512566700577736,
        -0.07963314652442932,
        -0.05893940106034279,
        0.01837288774549961,
        -0.01871035248041153,
        0.05745764449238777,
        0.0274690929800272,
        -0.07288739830255508,
        -0.02811594493687153,
        0.01473306305706501,
        0.011196855455636978,
        -0.08036220818758011,
        0.015492085367441177,
        -0.08504398912191391,
        0.02950398251414299,
        0.07244113832712173,
        -0.03422361612319946,
        -0.009887355379760265,
        -0.016188718378543854,
        -0.023952512070536613,
        0.06137574836611748,
        -0.08773140609264374,
        -0.032386310398578644,
        0.05524182319641113,
        0.028880974277853966,
        -0.03295048326253891,
        0.0161206666380167,
        -0.13095392286777496,
        0.10976221412420273,
        -0.022263918071985245,
        0.06727777421474457,
        -0.014873974956572056,
        0.04708607867360115,
        0.06013091281056404,
        -0.05040040612220764,
        0.01506150234490633,
        0.07599306106567383,
        0.02723647840321064,
        -0.026927558705210686,
        -0.06255270540714264,
        -0.018497521057724953,
        0.003279818454757333,
        0.01886173151433468,
        -0.011138491332530975,
        -0.024686865508556366,
        0.008044776506721973,
        -0.1097421795129776,
        -0.10624342411756516,
        0.01355649996548891,
        0.03899497538805008,
        -0.010536884889006615,
        -0.021542442962527275,
        -0.04619947820901871,
        -0.013180485926568508,
        -0.09560958296060562,
        -0.062223248183727264,
        0.08443638682365417,
        0.02486024610698223,
        -0.036343395709991455,
        0.0088882464915514,
        -0.037047356367111206,
        -0.008006948046386242,
        -0.07053323835134506,
        -0.032438118010759354,
        0.06153687834739685,
        0.03406941518187523,
        0.002428934210911393,
        -0.057879552245140076,
        0.009191266261041164,
        -0.07921990007162094,
        -0.046499770134687424,
        0.029492419213056564,
        0.0998884066939354,
        -0.024522768333554268,
        0.0986378937959671,
        0.038669489324092865,
        -0.028179466724395752,
        -0.011296282522380352,
        -0.09219024330377579,
        0.0063366638496518135,
        0.016849102452397346,
        0.055482156574726105,
        -0.0016280257841572165,
        -0.04726170748472214,
        1.1484045692288094e-32,
        0.0015798789681866765,
        0.08312071859836578,
        -0.009446827694773674,
        0.07786232978105545,
        0.02948671393096447,
        0.01815040037035942,
        -0.016634833067655563,
        0.09598755836486816,
        -0.0923481434583664,
        0.01231110468506813,
        -0.008073878474533558,
        0.015388047322630882,
        -0.03899993747472763,
        0.04301919415593147,
        0.05569341778755188,
        -0.012067539617419243,
        0.0014707135269418359,
        -0.062463972717523575,
        -0.029543640092015266,
        0.0020564503502100706,
        0.01902652159333229,
        -0.05137956514954567,
        0.029559917747974396,
        0.0871850922703743,
        0.07013467699289322,
        0.05979955568909645,
        0.08233975619077682,
        0.019205011427402496,
        0.10118153691291809,
        0.0036167690996080637,
        -0.03314010426402092,
        -0.06993305683135986,
        -0.017731888219714165,
        -0.08080079406499863,
        -0.005516885779798031,
        0.006698096636682749,
        -0.07695276290178299,
        -0.0022174848709255457,
        -0.0036231453996151686,
        0.010593944229185581,
        -0.009491865523159504,
        -0.040875907987356186,
        -0.0910913348197937,
        -0.07196654379367828,
        0.0210090521723032,
        0.038989581167697906,
        0.09485466033220291,
        0.06343742460012436,
        -0.04580555111169815,
        0.030828697606921196,
        -0.04887741804122925,
        -0.003813182469457388,
        -0.043083563446998596,
        0.037329185754060745,
        -0.019348086789250374,
        -0.02963874489068985,
        -0.02209625020623207,
        0.0333910770714283,
        0.0775139182806015,
        0.026377832517027855,
        0.04069739580154419,
        -0.013951347209513187,
        -0.010414735414087772,
        -0.010214844718575478,
        -0.04724697396159172,
        0.08424223959445953,
        0.10568743199110031,
        -0.022579967975616455,
        0.051577650010585785,
        0.04785935953259468,
        -0.015367084182798862,
        0.001856767456047237,
        0.06284315139055252,
        0.0268967617303133,
        0.024573959410190582,
        0.08472535759210587,
        -0.13204249739646912,
        -0.047994464635849,
        0.028405990451574326,
        -0.007795489393174648,
        -0.055909983813762665,
        0.06444577127695084,
        0.009745207615196705,
        0.10026827454566956,
        -0.014415185898542404,
        -0.08877477794885635,
        -0.0023017842322587967,
        -0.03154384344816208,
        -0.0613468773663044,
        0.05861123651266098,
        -0.01677371934056282,
        0.10459952056407928,
        -0.07171773165464401,
        -0.030771831050515175,
        -0.025720199570059776,
        -1.1279273107006913e-32,
        0.0023018100764602423,
        0.03149259462952614,
        -0.024301838129758835,
        -0.01638212986290455,
        0.05544716492295265,
        -0.06798628717660904,
        0.04145099222660065,
        0.07551401853561401,
        0.10393401235342026,
        -0.04261893779039383,
        0.04980994760990143,
        -0.061762139201164246,
        -0.1171777993440628,
        -0.045050207525491714,
        -0.04141698405146599,
        -0.04737001657485962,
        -0.0136667899787426,
        -0.05838073045015335,
        0.04082228243350983,
        -0.08786959946155548,
        -0.01132006011903286,
        0.1267530471086502,
        0.06144450604915619,
        0.02479485794901848,
        0.0485752634704113,
        0.024714704602956772,
        0.025887006893754005,
        0.08501065522432327,
        0.0541229322552681,
        0.04113445058465004,
        -0.033137932419776917,
        -0.06344988942146301,
        -0.052146416157484055,
        -0.02950615994632244,
        0.06839513778686523,
        0.07182968407869339,
        0.0007220825646072626,
        0.05132991075515747,
        0.003650686237961054,
        -0.04962236434221268,
        0.05653294548392296,
        -0.010048841126263142,
        0.007645510137081146,
        -0.015408123843371868,
        0.00892565492540598,
        -0.11115705221891403,
        -0.07370813935995102,
        0.019303712993860245,
        -0.02570539526641369,
        0.009196661412715912,
        -0.03215955197811127,
        -0.05396465212106705,
        0.03126334771513939,
        -0.0391685925424099,
        0.014351719990372658,
        -0.014311601407825947,
        -0.027307916432619095,
        -0.017888903617858887,
        0.06702933460474014,
        0.029964374378323555,
        0.05981353670358658,
        -0.08651237934827805,
        -0.130954310297966,
        -0.01626218482851982,
        -0.005309858825057745,
        -0.04806266725063324,
        0.08535615354776382,
        0.018255360424518585,
        0.023525899276137352,
        0.051338471472263336,
        0.013038345612585545,
        0.039789050817489624,
        0.032810062170028687,
        -0.01885148510336876,
        0.054891183972358704,
        -0.02517913095653057,
        -0.045231714844703674,
        0.02018021233379841,
        0.04148954525589943,
        -0.024294085800647736,
        -0.02594411000609398,
        0.020337151363492012,
        0.026906780898571014,
        0.01673256792128086,
        0.055759645998477936,
        0.07506461441516876,
        0.10254670679569244,
        0.012647147290408611,
        -0.023454822599887848,
        0.02916770800948143,
        0.023181861266493797,
        0.048956647515296936,
        0.02079944871366024,
        0.0939229354262352,
        -0.09554418176412582,
        -5.8234032707105143e-08,
        0.042067255824804306,
        0.03814966604113579,
        -0.009720956906676292,
        0.0008919445099309087,
        0.016690857708454132,
        -0.036911435425281525,
        0.015014027245342731,
        -0.013230121694505215,
        0.04418560117483139,
        -0.07207249104976654,
        0.07697829604148865,
        -0.007565466687083244,
        0.006968943402171135,
        0.10164882987737656,
        0.019368652254343033,
        -0.009111921302974224,
        -0.07899948209524155,
        0.07706059515476227,
        -0.04159548506140709,
        -0.06195256486535072,
        -0.016511233523488045,
        0.014563671313226223,
        0.021759362891316414,
        -0.01809166930615902,
        0.06550684571266174,
        -0.03573138266801834,
        0.008447139523923397,
        -0.0024296739138662815,
        -0.003447039285674691,
        0.04113992676138878,
        -0.08347901701927185,
        0.0019571806769818068,
        -0.002953291404992342,
        -0.0010851373663172126,
        -0.08907977491617203,
        -0.04578972980380058,
        -0.07326148450374603,
        -0.04559316858649254,
        -0.013070991262793541,
        0.019048770889639854,
        0.011872856877744198,
        -0.08585754781961441,
        -0.02543545886874199,
        0.009287881664931774,
        -0.007386480923742056,
        -0.04841066151857376,
        0.0281689390540123,
        -0.09201973676681519,
        0.01276087574660778,
        -0.06647918373346329,
        -0.07442015409469604,
        0.06099303066730499,
        0.05620498210191727,
        -0.018953099846839905,
        0.0697210282087326,
        -0.04150872677564621,
        0.061197664588689804,
        0.026244109496474266,
        -0.038181476294994354,
        0.04962645098567009,
        0.011651872657239437,
        0.03257845714688301,
        -0.08239206671714783,
        0.015620238147675991
    ]
}