{
    "id": "Pi91mtbLgkY",
    "title": "OnePlus Watch Review: You Get What You Pay For",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-04-13T22:07:25Z",
    "video_url": "https://www.youtube.com/watch?v=Pi91mtbLgkY",
    "category": "Science & Technology",
    "tags": [
        "oneplus watch review",
        "oneplus smartwatch",
        "best smartwatch 2021",
        "best smartwatch",
        "cheapest smartwatch 2021",
        "smart watch review",
        "oneplus wearable"
    ],
    "views": 413880,
    "likes": 15276,
    "comments_count": 924,
    "description": "A few weeks ago, I reviewed the OnePlus 9 Pro and found a smartphone that delivers a lot, but asks too much in exchange. The OnePlus Watch is almost the inverse of that: its missing many features compared to the competition, but its also asking far less for the privilege. With a starting price of $159 it undercuts not just the Apple Watch, but also the Google-powered smartwatches I wear on a regular basis. The question is, does it sacrifice too much functionality in the process  or at least, thats what Id normally ask. After ten days with the OnePlus Watch, Ive found that the real question is: what will this smartwatch look like when its actually finished?   You can find out yourself when it goes on sale April 14th, but take my advice: watch MrMobiles OnePlus Watch Review first.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES ONEPLUS 9 PRO REVIEW]  MrMobile's OnePlus Watch Review was produced following ten days with a OnePlus Watch review sample (model W301GB) provided by OnePlus. Preproduction sample running launch-day software version W301GB_11_B.33. Tested with a Motorola Razr 5G.  MrMobile does not accept compensation from the manufacturers of the products he reviews; no payment was provided and no manufacturer or carrier was afforded a preview or copy approval rights concerning this content.    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #onepluswatch #oneplus #smartwatch #wearable #tech #watch #wristwatch #wearabletech",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- If you're tired of reviewers like me bringing up OnePlus' old catchphrase, Never Settle, every time we write a review, hey, I'm right there with you. But seven years after it first hit the scene, that defiant and slightly edgy tagline is still with us on OnePlus phones and now on its first smart watch as well. And what makes invoking it so irresistible is how often it illuminates just how much settling the OnePlus of today is prepared to do, even when it's entering a new category for the first time. (bright upbeat music) Right up front, this watch deserves credit for living up to OnePlus' old ideals, better than its newest flagship phone. While the OnePlus 9 Pro delivers a lot but asks too much in exchange, the watch is almost the inverse of that. It's missing many features compared to the competition, but it's also asking less for the privilege. At a starting price of $159, it undercuts not just the Apple watch, but also most of the smartwatches I wear on a regular basis. The sacrifices you make for that price cut aren't immediately apparent because out of the box, the OnePlus watch looks pretty good if you're into the whole minimalism thing. It's 46 millimeter case is made of polished stainless steel topped by a curved glass crystal protecting a 1.4 inch AMOLED touchscreen. The bezel between display and case bears the watch's only true ornamentation, unless you count the company logo on one of the two side buttons. A set of perimeter stripes, almost invisible, unless they catch the light just right. OnePlus calls this subtlety, Burdenless Design. And again, if you're into minimalism, then sure, this is probably your speed. But too often, I think the word minimalism is used as a cover for lack of imagination. And I'd have preferred a more aspirational or bold style for the first smart watch from such an historically outspoken brand. Fortunately, the casing is bracketed by universal 22 millimeter lags. So I dove into the old watch box and swapped out the comfortable but commonplace fluoroelastomer band for something with slightly more personality from Citizen. Oh, and if you want a flashier finish, you can splash more cash for the cobalt edition later this year. Let's talk about usage. After a few days with the OnePlus watch, I started referring to it as a fitness band disguised as a smartwatch not realizing that I had already used that tagline to refer to another wearable. That was 2019's Huawei Watch GT. And when I re-watched that review, I was struck by just how similar the software on this watch is. Like Huawei OnePlus ditched and established platform like Google's in favor of a custom real-time OS. And just like Huawei, it's main reason for doing so was battery life. Instead of the one to two days you'll get from an Apple or Google watch, the OnePlus watch will keep on ticking for at least a week between charges. In fact, seven days is exactly the figure I got. Almost down to the hour. And I did not go easy on it. In addition to the never-ending onslaught of messages vibrating my wrist, I took a few phone calls. I logged four multi mile walks with the built-in GPS. And during those walks, I streamed an hour long podcast directly to Bluetooth headphones. By the way, that Bluetooth connection, whether you're streaming audio or not is rock solid. The watch never lost connection with the phone for no reason as Wear OS still tends to do from time to time. And using the software during that walk and otherwise, was fairly simple since it seems to have taken a lot of inspiration from Wear OS. Notifications from below, settings up top, tiles off to the side and dismiss by swiping right. Trouble is all those similarities to Google's wearables, they reminded me just how much I missed using Wear OS, which alongside its many frustrations, also offers a mature feature set that OnePlus is totally lacking. On Wear OS or Samsung or even now Apple, I can choose from literally thousands of watch faces thanks to Facer. With this watch, you're confined to the 50 faces OnePlus offers out of the box. And I know that may sound like a lot, but trust me, they get old in a hurry. I asked OnePlus if it had a timetable for releasing new watch faces or if it would allow users to build their own. The answers were no to the first and maybe to the second. You can use a photo as a watch face though, which is pretty cool. But faces aside, there's no slickness to the software. And as of the date of this video, there's also an awful lot still missing. See, as good as it looks, thanks to this bright, brilliant display, the prime directive of this platform is preserving battery life. So there are no third-party apps. There's no assistant, no calendar, no payment support, no iPhone compatibility. The animations are limited. And there's no Always On watch face. Notifications are bare bones. You don't get anything more than the subject line of an email. You can't dictate replies. And they don't have custom icons for every app so you can't triage them as easily. There's also a really annoying bug where some alerts buzz your wrist over and over again for the same notification. I made many of these complaints two years ago on that Huawei Watch GT. And it's frustrating to see them resurface on a much higher profile product in 2021. One that also bears all the hallmarks of having been rushed to market. Even the fitness features are riddled with bugs. I went on a Seaport walkabout wearing the OnePlus watch alongside a Citizen's CZ Smart and Garmin MARQ Captain. And yeah, I looked about as cool as that sounds. The end of it, the Garmin and Citizen agreed. OnePlus under-counted my steps by around four to 5,000. Also, sleep tracking data wouldn't sync from the watch to the app pending amid April update that OnePlus says should fix that. Followed by amid may update that'll bring all the advertised 110 workout modes to the watch. And keep in mind, there is no Wi-Fi on board so if those updates are anything like the first one I had, they may take up to 40 minutes to make their way to the watch over Bluetooth. That 95 megabyte podcast I mentioned earlier took 18 minutes to transfer. Unfortunately, software updates won't be able to do much for my remaining complaints. Phone calls taken through the watch are finicky because of the placement of the speaker, which makes callers raspy if you bend your wrist wrong. And two of those callers said they weren't the biggest fans of the voice quality from my end either. Also, while the watch does charge quickly, it will only charge at all if you make sure to anchor the charger properly. It's magnets are too weak to ensure a perfect fit of pogo pins to contact. So while it may look and sound like it's firmly attached, it's not always. To wrap things up, I'll take us back to the start and remind you that this is OnePlus' first smartwatch. And conceptually, I think the company was right to put its focus where it did. It really does last, at least a week. It should eventually offer a boatload of fitness features if the bugs get shaken out. It works as a remote if you have a OnePlus TV. And it's priced competitively even if it only undercuts the bulk of the rivals by about 40 bucks. But you know, for a device that goes on sale tomorrow, it's still too raw to recommend today. I'll be really happy to go back to my Wear OS watches after this. And I think that says it all. (upbeat music) This review was produced following 10 days with a OnePlus watch review sample provided by OnePlus and tested with a Motorola Razr 5G. Yes, I did cross check my findings with other reviewers who paired the watch with a OnePlus phone to see if our finding is different. And they did not. Also, the OnePlus health app received one software update during the review process. The footage you are seeing in this video does reflect those changes. That is the version that is currently in the play store at press time. As always, OnePlus had no editorial input or early preview of this content, nor did it provide compensation in exchange for its creation. Please, subscribe if you wanna see more of this kind of video on YouTube and check out my OnePlus 9 Pro review if you haven't already. It's a fun twist on the typical phone review format and I think you'll enjoy it. Until next time, thanks for watching and remember to stay safe. Mask up when you're around others as you stay mobile, my friends.",
    "transcript_keywords": [
        "watch",
        "OnePlus",
        "OnePlus watch",
        "Huawei Watch",
        "OnePlus watch review",
        "wear",
        "smart watch",
        "watch faces",
        "Settle",
        "OnePlus watch alongside",
        "review",
        "phone",
        "Huawei",
        "time",
        "Apple watch",
        "Google watch",
        "Huawei OnePlus",
        "software",
        "Huawei OnePlus ditched",
        "faces"
    ],
    "transcript_entity_values": [
        "2021",
        "Huawei",
        "seven days",
        "OnePlus 9 Pro",
        "third",
        "Garmin",
        "22 millimeter",
        "OnePlus TV",
        "at least a week",
        "around four to 5,000",
        "up to 40 minutes",
        "10 days",
        "18 minutes",
        "Garmin MARQ Captain",
        "Samsung",
        "seven years",
        "Apple",
        "159",
        "tomorrow",
        "about 40 bucks",
        "a few days",
        "YouTube",
        "Burdenless Design",
        "50",
        "thousands",
        "110",
        "OnePlus",
        "Bluetooth",
        "Facer",
        "four multi mile",
        "Citizen's CZ Smart",
        "April",
        "Huawei OnePlus",
        "today",
        "OnePlus",
        "iPhone",
        "first",
        "One",
        "Google",
        "two",
        "46 millimeter",
        "Citizen",
        "Huawei Watch GT",
        "second",
        "later this year",
        "two years ago",
        "95 megabyte",
        "2019",
        "Wear OS",
        "1.4 inch",
        "hour",
        "the hour",
        "one",
        "Settle"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "NORP",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "TIME",
        "TIME",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.11608829349279404,
        0.03275206312537193,
        0.0612771138548851,
        -0.032033246010541916,
        0.027705591171979904,
        0.005876114126294851,
        0.009818493388593197,
        0.06513737887144089,
        -0.02206563763320446,
        0.0328630693256855,
        -0.0494309701025486,
        0.04020620882511139,
        -0.031301435083150864,
        -0.006815554574131966,
        -0.01847824454307556,
        -0.06705069541931152,
        0.19830314815044403,
        -0.16444306075572968,
        0.01738699898123741,
        0.012178722769021988,
        0.037337955087423325,
        -0.087240070104599,
        0.09414912760257721,
        0.020230770111083984,
        0.04404040426015854,
        -0.04269023612141609,
        -0.06887399405241013,
        -0.0291487667709589,
        -0.0302494578063488,
        0.010944582521915436,
        0.004648683592677116,
        0.013450589030981064,
        0.028586896136403084,
        0.022346163168549538,
        -0.0510643906891346,
        -0.09515825659036636,
        0.07805692404508591,
        -0.012593671679496765,
        -0.10916127264499664,
        -0.03426957130432129,
        -0.008101288229227066,
        -0.024701671674847603,
        -0.05217780917882919,
        0.05765446648001671,
        0.037216879427433014,
        -0.0015239394269883633,
        0.06038879603147507,
        -0.0031591642182320356,
        0.0004207897582091391,
        -0.005456562619656324,
        -0.004440425895154476,
        -0.06222875416278839,
        0.06344809383153915,
        -0.06911250203847885,
        -0.06338315457105637,
        -0.007723222952336073,
        -0.03233717381954193,
        0.006669390946626663,
        0.06379543244838715,
        -0.015376931987702847,
        0.030839305371046066,
        -0.06718119233846664,
        -0.050955694168806076,
        0.04651504009962082,
        0.018063915893435478,
        -0.011669183149933815,
        -0.04365437850356102,
        -0.09601455926895142,
        0.0464494451880455,
        -0.04614432528614998,
        -0.031814150512218475,
        0.00965816155076027,
        0.07582288235425949,
        -0.0013738855486735702,
        -0.03927585855126381,
        0.062350302934646606,
        0.07140064239501953,
        -0.07478389143943787,
        -0.00022855431598145515,
        -0.0032779243774712086,
        -0.019441958516836166,
        -0.0408131368458271,
        -0.028810298070311546,
        -0.01583021879196167,
        0.09815797209739685,
        -0.036406729370355606,
        0.021901359781622887,
        0.042410485446453094,
        0.0034780774731189013,
        -0.0689249336719513,
        0.04396722465753555,
        0.08725041896104813,
        -0.05060870200395584,
        -0.01109965518116951,
        -0.023190390318632126,
        0.09246490895748138,
        -0.06551908701658249,
        0.031901221722364426,
        -0.03412625193595886,
        -0.035044971853494644,
        0.07870229333639145,
        0.05333489552140236,
        0.051158737391233444,
        0.031760603189468384,
        -0.009503394365310669,
        -0.032744619995355606,
        -0.03404157981276512,
        0.0026764499489217997,
        0.058227818459272385,
        0.09181723743677139,
        0.00044105632696300745,
        0.05209866166114807,
        0.002188462531194091,
        0.02463435009121895,
        -0.044138353317976,
        0.08023755252361298,
        -0.07295197993516922,
        0.08673255145549774,
        0.13293904066085815,
        0.09309183806180954,
        0.0613485649228096,
        -0.0327780582010746,
        -0.008088374510407448,
        -0.05648195743560791,
        0.03443608433008194,
        0.011495728977024555,
        -0.016835838556289673,
        3.5965098223392386e-33,
        -0.05140804126858711,
        0.08568470925092697,
        -0.030693497508764267,
        -0.04171324521303177,
        -0.06216432899236679,
        -0.03658289089798927,
        0.033521004021167755,
        0.030617961660027504,
        0.05439768731594086,
        0.0844149962067604,
        -0.038739584386348724,
        -0.001460141153074801,
        -0.06110062450170517,
        0.08635429292917252,
        0.0053825038485229015,
        -0.058576006442308426,
        0.009404203854501247,
        -0.04187588021159172,
        -0.012400000356137753,
        -0.020231356844305992,
        -0.03305621072649956,
        -0.08882289379835129,
        -0.036581747233867645,
        -0.03114582784473896,
        0.04996838793158531,
        0.02888999506831169,
        0.042568523436784744,
        -0.016528164967894554,
        0.08359602093696594,
        0.03577825427055359,
        -0.07565321773290634,
        -0.04132469370961189,
        -0.03316406160593033,
        -0.03501897677779198,
        -0.014784889295697212,
        -0.03722194582223892,
        0.0185085516422987,
        -0.04771922901272774,
        0.055962491780519485,
        -0.06712891906499863,
        -0.09109295159578323,
        0.030027007684111595,
        -0.04980313032865524,
        -0.07907074689865112,
        0.011292013339698315,
        -0.04936980828642845,
        0.0686885267496109,
        0.01736612617969513,
        -0.017744876444339752,
        -0.023324791342020035,
        -0.015790589153766632,
        -0.03683725744485855,
        -0.026836218312382698,
        -0.059958647936582565,
        -0.07126323133707047,
        0.038810938596725464,
        0.10849825292825699,
        -0.04976209998130798,
        0.05666770786046982,
        0.029820574447512627,
        0.0057869888842105865,
        -0.009565119631588459,
        0.011517388746142387,
        0.0533321276307106,
        -0.08527104556560516,
        0.08478926122188568,
        0.04457582160830498,
        0.0017929046880453825,
        -0.08833344280719757,
        0.07831872254610062,
        -0.009635497815907001,
        -0.034771040081977844,
        0.0061411005444824696,
        -0.07045906782150269,
        0.005511728581041098,
        0.06537573784589767,
        0.07322977483272552,
        0.01086988765746355,
        0.018856732174754143,
        -0.025449493899941444,
        0.002594251884147525,
        0.01401371881365776,
        0.050891976803541183,
        0.035487428307533264,
        0.03776581585407257,
        0.018854206427931786,
        -0.04491214081645012,
        -0.05058755353093147,
        -0.009019329212605953,
        -0.00646939966827631,
        0.05642010644078255,
        -0.0007647931342944503,
        -0.029315443709492683,
        -0.007554165553301573,
        -0.017447808757424355,
        -5.080828579641619e-33,
        -0.0901382640004158,
        -0.058614905923604965,
        0.01680462621152401,
        -0.036931540817022324,
        0.009170537814497948,
        -0.06058458238840103,
        -0.020665833726525307,
        0.028272148221731186,
        0.04137684404850006,
        0.05416340008378029,
        -0.023378632962703705,
        -0.0690852552652359,
        -0.07177098095417023,
        0.01891801506280899,
        -0.010137164033949375,
        -0.000991030945442617,
        0.03883109986782074,
        -0.04551045224070549,
        0.03476488217711449,
        0.008180717937648296,
        0.041677508503198624,
        0.0567157119512558,
        0.03767704963684082,
        -0.0013554409379139543,
        0.02449268102645874,
        0.02605930157005787,
        -0.009252756834030151,
        -0.01145260501652956,
        0.009082812815904617,
        -0.050690170377492905,
        -0.06539363414049149,
        -0.0657147541642189,
        0.007885829545557499,
        0.032736312597990036,
        0.05053183436393738,
        0.026910744607448578,
        0.028981994837522507,
        -0.029292387887835503,
        0.046968013048172,
        0.02495388686656952,
        0.07469947636127472,
        0.039974600076675415,
        0.05945214629173279,
        -0.02502588741481304,
        0.055139634758234024,
        -0.03874017670750618,
        -0.07252051681280136,
        0.037535715848207474,
        -0.04186076670885086,
        0.03194084018468857,
        0.015976645052433014,
        0.06820335984230042,
        -0.010107508860528469,
        -0.04517350345849991,
        -0.0729343369603157,
        -0.01625211536884308,
        0.03391965106129646,
        -0.0413699634373188,
        -0.07508426904678345,
        -0.04009753838181496,
        0.04400459676980972,
        0.019384320825338364,
        -0.0423809289932251,
        0.013795034028589725,
        -0.01810486428439617,
        0.06364306062459946,
        0.11498314142227173,
        -0.057551391422748566,
        0.03147139772772789,
        -0.0031772716902196407,
        -0.00842694565653801,
        -0.048414524644613266,
        -0.08844266831874847,
        -0.12338406592607498,
        0.019085247069597244,
        0.11915569752454758,
        0.03337123617529869,
        -0.025983920320868492,
        -0.04528636112809181,
        -0.03048863634467125,
        8.192623499780893e-05,
        0.030480653047561646,
        0.05986758694052696,
        -0.05838103964924812,
        0.059669703245162964,
        -0.022631699219346046,
        -0.012904300354421139,
        0.03136735036969185,
        -0.002262655645608902,
        0.06498092412948608,
        -0.009627201594412327,
        0.05772174149751663,
        -0.039180636405944824,
        0.03303147479891777,
        0.016327833756804466,
        -4.659742813828416e-08,
        0.04741441085934639,
        0.04328116402029991,
        0.11284266412258148,
        -0.051257140934467316,
        -0.0070861452259123325,
        -0.08561746031045914,
        -0.019282540306448936,
        -0.03427845984697342,
        0.0361008457839489,
        0.01322978176176548,
        0.03456084430217743,
        -0.0710337683558464,
        -0.0906621664762497,
        0.020720669999718666,
        0.010913302190601826,
        -0.01597292721271515,
        -0.004419758450239897,
        0.04146794602274895,
        -0.036499351263046265,
        0.06902238726615906,
        0.05949294939637184,
        0.0327354371547699,
        -0.020393386483192444,
        -0.06653904914855957,
        0.05343405157327652,
        0.056102924048900604,
        -0.07268301397562027,
        0.04623336344957352,
        0.04803593084216118,
        0.009977388195693493,
        -0.011314685456454754,
        0.05228124558925629,
        -0.035438064485788345,
        -0.0295062568038702,
        -0.037924978882074356,
        -0.1440865844488144,
        -0.0062550632283091545,
        0.01762230694293976,
        0.05959967523813248,
        0.04230118170380592,
        -0.006978081073611975,
        -0.03216567635536194,
        -0.0010603733826428652,
        0.04801362752914429,
        -0.03353957459330559,
        -0.039648666977882385,
        -0.05602090433239937,
        -0.141834557056427,
        -0.01408317033201456,
        0.05609910562634468,
        -0.022428810596466064,
        -0.07957766205072403,
        -0.008012165315449238,
        -0.045444972813129425,
        -0.008187239058315754,
        -0.011512724682688713,
        0.057481374591588974,
        0.004166611935943365,
        -0.09200426936149597,
        -0.006164880003780127,
        0.08344738185405731,
        -0.1069929227232933,
        -0.041663240641355515,
        0.05572479963302612
    ]
}