{
    "id": "pKmLdJkW9LA",
    "title": "Most Versatile Device of 2021!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-06-23T19:52:37Z",
    "video_url": "https://www.youtube.com/watch?v=pKmLdJkW9LA",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "HP",
        "HP Elite",
        "HP Elite Folio",
        "HP Folio"
    ],
    "views": 139841,
    "likes": 5732,
    "comments_count": 324,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we're checking out the 13 and a half inch HP Elite Folio two in one laptop. inside this box is a super versatile device that is basically made for on the go productivity. It weighs just under three pounds, but it will still give you all the processing power you need with the Snapdragon eight CX gen two compute platform. Let's unbox. A huge thank you to HP for sponsoring this video. I was so excited to check this out. There's nothing I love more than checking out new devices, especially two in ones. Because I do plan on traveling, you know, a little more than we did in the past year, which these types of devices are perfect for that. And I am actually heading to the airport right after I unbox this to go visit my family. I've been traveling back and forth, visiting them as much as I can, so, super excited to take this with me on a flight. This is going to be a real life test of on the go productivity. (box tearing open) Oh, oh, oh. (box banging on the floor) (box banging on table) (scissors slashing) (plastic tearing) Ooh. What is this? Here it is. Whoa. I actually thought this was just a case. This is the whole dev- what? Oh, yes. I love these HP braided charging cables. I've reviewed a bunch of HP laptops in my YouTube career. So it's always very exciting to see the varying accessories that they have in them. And this is honestly like one of my favorite chargers and it's nice because it's not just an all black color. Like it's a nice little gray so it was a really nice contrast. What's this? Oh, oh. Oh, this looks like it's a little accessory for the HP pen. Very nice box presentation. I love that they show you the different ways that you can use the device. Mm. Instructions? I still can't believe that this is, this is the devi- this is it. (tumbler hitting the table) How long has this water bottle been sitting there? Justine, it's almost like you've never made a YouTube video before. (plastic tearing) Oh my gosh. It has like, what the heck? This is so freaking cool. Like this is. It's like a leather type finish at the top and the bottom. Premium experience. This is cool. Okay. So that kind of makes sense why they're calling it like a folio because it kind of feels like a little portfolio that you would be like carrying. This is, this is really cool. Like this, I feel like a business executive, a C- I just ripped my hair out. I can't even make that up. I was going to say I'm a CEO. I don't even think that I deserve the title, but I am one. (laughs) Which is crazy to take. I'm going to be huddling the crypto, doing my stock exchanges, transferring my crypto from various wallets. This is so nice. Like I'm honestly, so in shock, like wow, this is so nice. Like look at this. Whoa. I wasn't even ready. I was not ready for that. Look how freaking thin this is. This allows you to like switch this so easily into tablet mode. Did you see what I just did there? And the thing that I like about that is sometimes there's different two in ones that actually flip over to the keyboard on this side. But because it's like this really nice, like leathery material, it'll like, sit nicely on your lap. It won't slide. You won't be hitting keys. Ah, so cool. This also has built in and cellular, so, if you are on the go, you won't have to be hunting for a wifi network, which is something that I was always struggling with when I was working at different coffee shops. But if you do need wifi, this does utilize wifi six. You really can't seamlessly transform this from laptop mode to tablet mode. Name something more seamless. I don't think you can. So this display is 13 and a half inches with a three by two aspect ratio. It has 16 gigs of Ram. It's eight cores, have a stock speed up to 3.15 gigahertz. I always love when devices like this, that have built-in cameras have privacy in mind when it comes to these integrated cameras, it is kind of crazy to think that we have these things in our lives that have built in cameras. Well, this is cool because this has a little integrative switch that you could turn on or off. So, that allows your camera to be visible or not visible. This is actually a really well-designed switch because it's so small and subtle. And this is the rechargeable HP elite slim active pen, which is great for taking notes, editing photos, or just doodling. And it's cool because it does it quickly charge right here in the built-in storage space, right above the keyboard. I haven't even turned this thing on and I'm already super impressed with the design. Let's plug this in and get you all charged and set up and take you on the road. (classy music) Oh, so I've magically transported to a new location. I'm on the east coast. I plan on making a really cool montage and vlogging on the flight and how I use this. The only thing that I did on that overnight red eye flight was, uh, close my eyes and sleep. Traveling again was kind of interesting because if I had been wide awake and on this crazy long flight to get back to the east coast from the west coast, this would have been such a great device because honestly, it really is so light. It is so compact. And the one thing after using this for the past week, I love this cover so much. It's so different not having like a metallic cover on here. And it just being sort of this little folio, like I talked about, it's like my little portfolio, but I've been using this so much around the house. My sister, she has a little girl. Her name is Brynn. And she, well, she's very, very smart, which is great, but it could be problematic because she figures out everything. So she also figured out that when I hold this up, it unlocks. So she will pick it up and try to hold it in front of my face because I have the face and log on. So, it's so cute seeing her use this and use the HP pen. (playful music) (laughs) [Justine] That's not the right end though. Look. This way. (playful music) You could use your finger too. Look. Use this end. (tapping sounds) Ain't that fun? - Brynn, what do you got there? Can I see it? Hold it up. - [Justine] Show her. - Let me see. - [Justine] Why do you want to keep it? You didn't want to share and show? You know what else we can do? We check this out. We can go like this. This flips down like that. It's now a laptop. So you can type. We have to be gentle. Type soft. (typing sounds) Yes, type soft. Two hands. (typing sounds) Two for typing. This is an HP folio. What do you think of it? Do you like it? - [Brynn] Nice. - [Justine] We've been watching contents. I also taught her how to draw. I will say that over the course of the week, like her drawings have improved, slightly. I mean, I think I might still be a better artist, but I guess I kind of do have an age advantage. The other thing that I love is it is so light, but yet it is so powerful. So not only am I able to do just basic things like do email, but I have actually been gaming on this and that's been really fun as well. I know I showed you guys in the unboxing, how easy it is to switch from tablet mode to laptop mode. But as I've been using it more throughout this past week, it has this really unique pool forward design that lets you use various modes like tablet, media consumption, or a clamshell mode for productivity. The HP speakers with audio tuned by Bang and Olufsen also sound really great. And I love that it's a touch screen. Sometimes I forget what I'm using other devices that are laptop like, and they don't have a touch screen and I touch the screen and it doesn't work, and I get upset. It's also funny tying back to Brynn using these devices because she has basically grown up in a touch based environment. So anytime she touches a computer or a TV and it doesn't actually respond, she's kind of confused. So it's been kind of cool to see her realize that not only is this a laptop, but she can also touch the screen. This has been such a great device to consume content on. Obviously, I am a content creator, so I have been watching a lot of my content back before I post it to make it live. I've also been editing some of my social content on here. I've been doing photo editing for a bunch of my posts and it's been working really well for everything that I've needed. The battery life has also been incredible and being able to stay connected with Wi-Fi, LTE, 4G, and even 5G while traveling has helped out so much. This can also be hooked up to dual 4K external monitors. So when I head back home, I can have a full workstation. I like having this leather outer folio case on it because it actually stays on my lap when I'm sitting and doing work and if I'm on the couch it doesn't slide off. So not only does it look really nice, it actually serves a really great purpose. It does have the Bang and Olufsen speakers so you actually are getting a really good quality sound as well. It's great for watching children's shows or listening to my own music or movies. This also has LTE and the one thing that my parents have at their house is terrible internet. Thankfully, there is some cell reception there. So the LTE on this is actually way better than their internet connection. So I've been using the LTE over the wifi. Well, thank you guys so much for watching. This was a really fun look at the HP elite folio. This thing is honestly so awesome. And I look forward to using it so much more in my daily workflow. If you guys are new here be sure to subscribe and hit the bell so you'll be alerted when I post new videos. and I look forward to seeing you guys in my next video. Bye.",
    "transcript_keywords": [
        "nice",
        "cool",
        "thing",
        "love",
        "kind",
        "great",
        "Folio",
        "mode",
        "laptop",
        "devices",
        "LTE",
        "device",
        "touch",
        "guys",
        "wifi",
        "back",
        "great device",
        "tablet mode",
        "inch HP Elite",
        "laptop mode"
    ],
    "transcript_entity_values": [
        "13 and a half inches",
        "one",
        "the west coast",
        "HP Elite Folio",
        "the past week",
        "Justine] Show",
        "Justine",
        "Two",
        "HP",
        "LTE",
        "4",
        "Brynn",
        "three",
        "CX",
        "16",
        "Snapdragon",
        "YouTube",
        "the week",
        "5",
        "this past week",
        "3.15 gigahertz",
        "daily",
        "six",
        "eight",
        "today",
        "the past year",
        "two",
        "13 and a half inch",
        "Olufsen",
        "just under three pounds",
        "Wi-Fi",
        "Brynn] Nice",
        "Bang",
        "Ram",
        "the east coast"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "LOC"
    ],
    "vector": [
        -0.05192028358578682,
        -0.06288519501686096,
        -0.04816460981965065,
        -0.11996372789144516,
        0.028840322047472,
        0.03061758540570736,
        0.029042044654488564,
        0.04700186476111412,
        -0.03700966387987137,
        0.07960742712020874,
        0.020831530913710594,
        -0.0044894167222082615,
        0.011092901229858398,
        0.02458237111568451,
        0.022526133805513382,
        0.034338079392910004,
        0.034383926540613174,
        -0.008466746658086777,
        0.00906700361520052,
        0.008218926377594471,
        -0.02963724546134472,
        -0.02155298739671707,
        0.020589342340826988,
        0.005591951310634613,
        -0.05202186107635498,
        0.060397401452064514,
        -0.005043463781476021,
        0.007174923550337553,
        -0.07346842437982559,
        -0.04699462652206421,
        0.010025272145867348,
        0.03793851658701897,
        0.056452274322509766,
        -0.024141505360603333,
        -0.035717595368623734,
        -0.07547737658023834,
        0.04498136416077614,
        -0.011492865160107613,
        0.000502417387906462,
        -0.05072582885622978,
        -0.007016501389443874,
        -0.06595595926046371,
        -0.009988508187234402,
        -0.0005593477981165051,
        -0.0526014044880867,
        -0.10752159357070923,
        -0.022174417972564697,
        -0.05053281411528587,
        0.02285763807594776,
        0.05655239522457123,
        -0.0791572853922844,
        -0.04433145746588707,
        0.022020481526851654,
        0.004983506165444851,
        -0.08804373443126678,
        0.01105054933577776,
        -0.08816629648208618,
        0.010880009271204472,
        0.04595138877630234,
        -0.08342808485031128,
        0.02104661986231804,
        -0.06294116377830505,
        0.011588179506361485,
        0.040441565215587616,
        -0.07853555679321289,
        -0.058636374771595,
        0.06314770877361298,
        0.02630501426756382,
        0.03320387005805969,
        -0.011961088515818119,
        -0.12117675691843033,
        0.03941250964999199,
        -0.020644688978791237,
        0.0094688031822443,
        -0.01039610244333744,
        0.05561204254627228,
        0.08135451376438141,
        -0.054222799837589264,
        -0.004207359626889229,
        0.03768057003617287,
        0.04885181784629822,
        -0.03192412480711937,
        -0.07516464591026306,
        -0.04621637985110283,
        0.009517079219222069,
        0.030186744406819344,
        -0.005823747720569372,
        0.023334432393312454,
        -0.01835882104933262,
        -0.07524095475673676,
        -0.10863707959651947,
        0.005494626704603434,
        -0.0173005610704422,
        -0.03080424666404724,
        -0.04201212897896767,
        -0.035853009670972824,
        -0.03478825464844704,
        -0.05712573602795601,
        -0.023938938975334167,
        0.05943373590707779,
        0.030600784346461296,
        -0.03506143018603325,
        -0.012636933475732803,
        -0.057613033801317215,
        -0.037617240101099014,
        -0.10999905318021774,
        -0.022269712761044502,
        0.0037295499350875616,
        0.03071725368499756,
        0.011331937275826931,
        -0.042889393866062164,
        0.025371752679347992,
        -0.07747547328472137,
        -0.04076748341321945,
        0.05538225173950195,
        0.08012402802705765,
        -0.04077528789639473,
        0.09255131334066391,
        0.0776614248752594,
        0.0009670091094449162,
        -0.04128606244921684,
        -0.07456599920988083,
        -0.035116005688905716,
        0.04695623740553856,
        0.02025964856147766,
        0.0566253662109375,
        -0.06965041905641556,
        1.2300248725413611e-32,
        -0.042444221675395966,
        0.10016119480133057,
        -0.0004343579930718988,
        0.06931721419095993,
        -0.023893477395176888,
        0.007838594727218151,
        -0.005765081383287907,
        0.09708408266305923,
        -0.017865242436528206,
        -0.008245664648711681,
        -0.009199630469083786,
        0.06330352276563644,
        -0.06356000155210495,
        0.0529634915292263,
        0.06686384230852127,
        -0.05759750306606293,
        -0.045050762593746185,
        -0.020628051832318306,
        -0.04386749118566513,
        0.019467754289507866,
        0.014132988639175892,
        -0.01507194060832262,
        0.015100215561687946,
        0.10037077218294144,
        0.14151328802108765,
        0.029802341014146805,
        0.08011617511510849,
        -0.011718131601810455,
        0.08404451608657837,
        0.0024707880802452564,
        -0.032215140759944916,
        -0.0592280849814415,
        0.006005295552313328,
        -0.09113587439060211,
        -0.018832115456461906,
        -0.0027178055606782436,
        -0.11175604909658432,
        -0.007101001217961311,
        -0.047354813665151596,
        -0.04101231321692467,
        -0.009369268082082272,
        0.03868212178349495,
        -0.044036515057086945,
        -0.06086694076657295,
        0.05152449384331703,
        0.025985639542341232,
        0.05446191877126694,
        0.11160990595817566,
        -0.04286514222621918,
        0.014965261332690716,
        -0.03408188000321388,
        0.013671309687197208,
        -0.08037565648555756,
        -0.014367278665304184,
        0.006343689281493425,
        -0.09141431003808975,
        -0.0633937194943428,
        0.04044480249285698,
        0.05813883990049362,
        0.05974308401346207,
        -0.01345710176974535,
        -0.007860148325562477,
        -0.010062186047434807,
        -0.02936803735792637,
        -0.03894433751702309,
        0.08822266757488251,
        0.10272116959095001,
        -0.057505037635564804,
        0.01898474618792534,
        0.0929301306605339,
        0.008297279477119446,
        -0.009340174496173859,
        0.052531398832798004,
        0.015794269740581512,
        0.04806916043162346,
        0.05286960303783417,
        -0.05849819630384445,
        -0.0923723354935646,
        0.013184905052185059,
        -0.025406144559383392,
        -0.12856851518154144,
        0.07772856950759888,
        -0.003432539291679859,
        0.11953991651535034,
        -0.015565581619739532,
        -0.060212209820747375,
        0.012681900523602962,
        -0.052686456590890884,
        -0.032658595591783524,
        0.005907922051846981,
        -0.013120128773152828,
        0.06635402888059616,
        -0.04857062175869942,
        -0.010166016407310963,
        -0.036584801971912384,
        -1.203488087571548e-32,
        0.05048190429806709,
        0.0203825905919075,
        0.015743527561426163,
        -0.01370232179760933,
        0.06824564188718796,
        -0.0318693071603775,
        0.05492468178272247,
        0.07435867935419083,
        0.05636437237262726,
        -0.08949629962444305,
        0.043258246034383774,
        -0.05740145966410637,
        -0.060518018901348114,
        0.05377299338579178,
        -0.05198623612523079,
        -0.024099770933389664,
        -0.05460824444890022,
        -0.09553511440753937,
        0.06684812158346176,
        -0.03345521539449692,
        0.08796848356723785,
        0.1370660662651062,
        0.10291136801242828,
        0.02150500752031803,
        0.029816491529345512,
        0.025167832151055336,
        0.02063758112490177,
        0.03230326250195503,
        0.024642301723361015,
        0.020713893696665764,
        -0.02532545104622841,
        -0.06684472411870956,
        0.010705949738621712,
        -0.028019370511174202,
        0.05529871582984924,
        0.04161136597394943,
        0.03991664573550224,
        0.005689753219485283,
        0.00930296815931797,
        -0.04706164076924324,
        0.019958753138780594,
        0.035062916576862335,
        0.04765583574771881,
        0.016988780349493027,
        0.0003819054691120982,
        -0.0854267105460167,
        -0.05832600221037865,
        0.05072571709752083,
        0.019300488755106926,
        -0.001011504209600389,
        -0.05660171061754227,
        -0.030898666009306908,
        -0.044594284147024155,
        -0.011443458497524261,
        -0.016821259632706642,
        -0.005441592540591955,
        -0.05568438023328781,
        -0.022712120786309242,
        -0.0067527079954743385,
        0.02009078860282898,
        0.011565969325602055,
        -0.04263545572757721,
        -0.0328824520111084,
        -0.03907781466841698,
        0.01159590296447277,
        -0.0539807453751564,
        0.10039304196834564,
        0.030207928270101547,
        -0.03301349654793739,
        0.023484397679567337,
        0.05355051904916763,
        0.01886308752000332,
        0.016494058072566986,
        0.0051414333283901215,
        0.03301699459552765,
        0.013808244839310646,
        -0.0494522899389267,
        -0.009942987002432346,
        0.07608800381422043,
        -0.05387917160987854,
        -0.0663468986749649,
        0.0202817190438509,
        0.01647450216114521,
        0.06460540741682053,
        0.061789028346538544,
        0.08017916232347488,
        0.05748507380485535,
        -0.05280236527323723,
        -0.012169686146080494,
        0.05547800660133362,
        0.0066406079567968845,
        0.043870147317647934,
        0.03115667961537838,
        0.08083512634038925,
        -0.05521097779273987,
        -6.005981134649119e-08,
        0.048589278012514114,
        0.04649700969457626,
        -0.04350557550787926,
        -0.007083877455443144,
        0.018727989867329597,
        -0.08418146520853043,
        -0.03286638483405113,
        0.007822783663868904,
        0.11470702290534973,
        -0.020408855751156807,
        0.07485911250114441,
        -0.03911186009645462,
        0.015057304874062538,
        0.1312606781721115,
        0.037104833871126175,
        0.03575722873210907,
        -0.09719886630773544,
        0.07584118098020554,
        -0.043027158826589584,
        -0.04096883907914162,
        -0.03140838071703911,
        0.06498892605304718,
        0.013776566833257675,
        -0.01606808230280876,
        0.03690222278237343,
        -0.027962684631347656,
        -0.02334604598581791,
        -0.024088332429528236,
        0.051026538014411926,
        0.011719010770320892,
        -0.07538872212171555,
        -0.02209990657866001,
        0.0006295687053352594,
        0.005403759423643351,
        -0.02104218676686287,
        -0.027139829471707344,
        -0.07135318964719772,
        -0.010713979601860046,
        0.00776777183637023,
        0.04484101012349129,
        0.029131218791007996,
        -0.10785958170890808,
        -0.07458874583244324,
        0.009977585636079311,
        0.027127426117658615,
        -0.13555799424648285,
        0.028004445135593414,
        -0.09137236326932907,
        -0.07624741643667221,
        -0.029476208612322807,
        -0.09045054018497467,
        0.035026490688323975,
        0.04357629269361496,
        -0.043127384036779404,
        0.06813958287239075,
        0.04218845069408417,
        0.032422278076410294,
        0.016282735392451286,
        -0.004744045436382294,
        0.011888875626027584,
        0.046346962451934814,
        0.00473463861271739,
        -0.03974810987710953,
        0.05392538756132126
    ]
}