{
    "id": "PKZr3RQdci0",
    "title": "Poco F2 Pro Durability Test! - Is the Moving Camera Durable?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-06-03T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=PKZr3RQdci0",
    "category": "Howto & Style",
    "tags": [
        "Poco f2",
        "pocophone f2",
        "flagship killer",
        "F2 Pro",
        "Poco f2 pro",
        "budget smartphone",
        "pop up camera",
        "mechanical camera",
        "budget smartphone 2020",
        "xiaomi",
        "poco f2 pro review",
        "poco f2 pro unboxing",
        "poco f2 durability test",
        "poco f2 drop test",
        "poco f2 water test",
        "poco f2 bend test"
    ],
    "views": 1978640,
    "likes": 64641,
    "comments_count": 4300,
    "description": "The PocoPhone is back with the Poco F2 Pro. More expensive this year, but still better priced than most smartphones. Grab a Teardown Skin for your phone here:  And check out the Tesla Model Y Off roading through Snow HERE:   Is the budget PocoPhone F2 Pro be durable? Today we are going to find out with a durability test. We'll see what the F2 Pro is made from and how well the Pocophone F2 pro can handle every day life with a scratch and bend test.   Poco F2 Pro Teardown:   Do you think Poco should sacrifice the 5G and drop their price a bit? I kinda do. Lower price is more important than specs not everyone will use.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/teardown",
        "https://youtu.be/FWGKCV5rHRI",
        "https://youtu.be/ZZWMxwcFZOc",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The PocoPhone F2 Pro. You might remember 2 years ago that Poco came out swinging with the super powerful budget phone priced at just $300. Pretty incredible. This year, with the PocoPhone F2 Pro, Poco has turned down the incredibleness a bit by turning up the price sitting right around $500. So it's less of a budget phone this time around, but still worth taking a look at. The F2 Pro does include a case in the box. It's time to find out if this neon blue F2 is durable enough for you. Let's get started. [Intro] Right off the bat we see the back panel has the fancy warped light rays centering around the rather large camera cut out. This large circular hole cut out didn't end up working very well for the OnePlus 7T, so hopefully this F2 Pro holds up better. Now normally we start with the scratch test I can kind of tell whether or not the phone includes a plastic screen protector on top. But this time around, seeing scratches at a level 3 was surprising. Turns out it was indeed just a screen protector. Once that's out of the way we can see what the screen is really made from. Remember, plastic starts scratching at a level 2 or 3, while glass doesn't start scratching till a 5 or a 6. And sapphire, of course, would be a level 8 or 9. We haven't seen a sapphire smartphone in a really long time, so if you know of one that I should be testing, tell me down in the comments. This Poco F2 Pro scratches at a level 6 with deeper grooves at a level 7. No surprises there. What is surprising however is that this $500 has no notch or camera cutout to be found anywhere. It's a seamless wall-to-wall display and looks pretty fantastic. Even the plastic speaker grill slot is super thin and won't be falling out on it's own. But where's the camera? It's motorized. The little guy pops up right out of the top like a daisy. Poco has even synchronized a little light show with the top edge of the screen and lines it up with the LED bars on the side of the camera. The lens of the 20 megapixel sensor is made from glass and doesn't like being scratched very much. Nice move, Poco. It's rare when a phone fights back. The glowy side bits are made from a transparent plastic. The pop-up camera is very secure though. It doesn't jiggle around and I can't pull it up out of the top. The back side of the camera unit is made from plastic. Now, normally when we see smartphones with pop-up cameras like OnePlus or Vivo, they've been tested over 300,000 times. Stepper motors are very consistent and durable little machines. Poco hasn't said exactly how many times they've tested this one, but it does have the anti-drop protection where it'll retract like a turtle into it's shell if it feels the phone falling...which we've seen most other motorized cameras do as well. The sides of the phone are made from aluminum. Pretty much the standard for every smartphone these days. It's rare to see anything different. It's the most cost effective. There is a black plastic buffer layer between the glass screen and the frame of the phone though and you can make some fancy little curlicues with it. The other side is made from metal, along with the red metal accented power button and the metal volume rocker right above that. Very surprisingly though, as we've found to be the case with a lot of mid-range devices, the Poco F2 Pro still has a headphone jack and an IR blaster. Sometimes when you spend less money on a phone you actually end up getting more features. No complaints here. Down at the bottom we get the normal USB-C port that can charge at 30 watts, and a dual sided SIM card tray. There is no water resistance rating on this phone because of that pop-up camera. And we'll get back to testing that in just a second. The back of the phone is covered in glass. No wireless charging, but there are 4 cameras. The top left is a 2 megapixel depth sensor. Then a 13 megapixel ultra-wide angle on the other side. The bottom right is a 5 megapixel macro camera. And finally a 64 megapixel main camera on the bottom left. Now, one perk of the pop-up camera is that the 6.6 inch screen is totally unobstructed - no camera cut out or notch. It's an AMOLED display with a normal refresh rate of 60 hertz. So definitely not a phone built specifically for gaming, even though it supposedly has a heat pipe inside that does cover 28% of the body. We'll have to check that out during the teardown. The screen lasts about 30 seconds before the pixels go white, but they do eventually recover once the heat's removed. Let's check the durability of this motorized camera some more. In the past we've knocked it on tables and the camera still goes up and down just fine. The reason it has that auto retract feature though is that if the camera does accidentally hit something hard enough during a fall, it has the chance of dislodging from it's motorized mechanism and breaking. On the third pile drive, that's exactly what happened to this Poco F2 Pro. The camera is very much not moving anymore. Even with the calibration option, it seems to be physically damaged or misaligned. And it's stuck in the raised position. If this lasts longer than 4 hours we'll probably have to operate. After enough times recalibrating the motor though, it does finally relearn it's limits and seems to mostly be back functioning like normal. Now it's time for the bend test. We haven't had a phone break in a long time so it was surprising to hear a crack during the first bend. But after glancing over the front and back of the phone, the sound wasn't the front or back glass...so let's keep going. After a few more bends, there is still no structural damage, but this phone is definitely a fighter attacking once again by pinching my finger. I kind of like the Poco F2 Pro. It survives my durability test. There is a massive international giveaway coming up on my channel with an absurd amount of phones. Dbrand and I will be sponsoring this giveaway, which means it'll be simple and very much available worldwide, just because you guys are awesome. So get ready for that. I'll post a video here on my channel about it so you won't miss it. Also here's an inside tease of the Poco F2 Pro. My Teardown Skin is linked down in the video description and it's quite possibly one of my favorites so far. And finally, if for some reason you want to see an electric Tesla off-roading across an Alaskan snow field, I'll leave a link for that video as well down in the video description. Come hang out with me on Instagram and Twitter...before Trump deletes it...and thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "camera",
        "Pro",
        "Poco",
        "phone",
        "back",
        "screen",
        "popup camera",
        "time",
        "made",
        "plastic",
        "level",
        "side",
        "budget phone",
        "camera cut",
        "top",
        "cameras",
        "megapixel",
        "glass",
        "times",
        "popup"
    ],
    "transcript_entity_values": [
        "30 watts",
        "about 30 seconds",
        "OnePlus",
        "Dbrand",
        "9",
        "6",
        "Trump",
        "8",
        "Instagram",
        "IR",
        "longer than 4 hours",
        "6.6 inch",
        "jack",
        "Alaskan",
        "Stepper motors",
        "4",
        "This year",
        "this $500",
        "over 300,000",
        "PocoPhone F2 Pro, Poco",
        "5 megapixel",
        "Poco",
        "5",
        "My Teardown Skin",
        "this F2 Pro",
        "64",
        "60",
        "Tesla",
        "first",
        "OnePlus 7T",
        "around $500",
        "2 years ago",
        "just $300",
        "second",
        "2 megapixel",
        "28%",
        "13 megapixel",
        "these days",
        "third",
        "3",
        "20 megapixel",
        "USB",
        "the Poco F2 Pro",
        "F2",
        "one",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "DATE",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09008695930242538,
        0.02020765095949173,
        0.04670299217104912,
        -0.04265296459197998,
        0.025058627128601074,
        -0.1194649413228035,
        0.05956438183784485,
        0.09954231977462769,
        -0.03462272509932518,
        0.06374196708202362,
        0.042170025408267975,
        0.037124987691640854,
        -0.028453297913074493,
        0.04751456156373024,
        0.03683466836810112,
        -0.026775646954774857,
        0.07267340272665024,
        -0.06191476061940193,
        0.018874987959861755,
        0.10771365463733673,
        -0.029056524857878685,
        -0.07158836722373962,
        0.024176113307476044,
        -0.016207924112677574,
        -0.011993614956736565,
        0.02034221962094307,
        -0.0633431077003479,
        0.006461931858211756,
        -0.08747439086437225,
        -0.11912232637405396,
        -0.022765718400478363,
        0.06977824121713638,
        -0.027864748612046242,
        0.020801842212677002,
        0.016139736399054527,
        -0.024655241519212723,
        0.06645103543996811,
        -0.05233512073755264,
        -0.062024667859077454,
        -0.033858273178339005,
        -0.04867411404848099,
        -0.0501684844493866,
        -0.011966870166361332,
        -0.0496666394174099,
        0.03490779921412468,
        -0.02595517411828041,
        0.16326789557933807,
        -0.020062046125531197,
        -0.02505192533135414,
        0.009961229749023914,
        0.011405978351831436,
        -0.004954718053340912,
        0.05263860896229744,
        -0.02336374670267105,
        -0.015372568741440773,
        0.05102452635765076,
        -0.06687714159488678,
        -0.026114702224731445,
        0.04038189351558685,
        0.004538089036941528,
        0.054176948964595795,
        0.01009842474013567,
        -0.08921217918395996,
        0.06568481773138046,
        -0.0002367830165894702,
        -0.017246706411242485,
        0.07524183392524719,
        -0.11558781564235687,
        0.003561255522072315,
        0.07520781457424164,
        -0.061551451683044434,
        0.03602636978030205,
        0.038707435131073,
        -0.038138095289468765,
        0.007357296068221331,
        0.08892521262168884,
        0.0076665026135742664,
        -0.05399298295378685,
        -0.010233751498162746,
        0.03788413107395172,
        0.09524437040090561,
        -0.054490480571985245,
        -0.07568275928497314,
        -0.00451125530526042,
        -0.018116595223546028,
        -0.0034925946965813637,
        0.014947034418582916,
        0.023946622386574745,
        -0.07832922786474228,
        -0.11155011504888535,
        0.045661427080631256,
        0.09326521307229996,
        -0.06247052177786827,
        0.07773713022470474,
        -0.03525301814079285,
        0.02116909809410572,
        -0.09608685225248337,
        -0.05360059440135956,
        -0.013842808082699776,
        0.020607780665159225,
        0.019083712249994278,
        -0.0049670422449707985,
        0.06306526809930801,
        -0.019574668258428574,
        0.00480727618560195,
        -0.08122355490922928,
        -0.0637083426117897,
        -0.0017666544299572706,
        0.04587046429514885,
        0.07586369663476944,
        -0.040600016713142395,
        0.08597534149885178,
        -0.06724222749471664,
        0.01180700771510601,
        -0.014252403751015663,
        0.0006124321953393519,
        -0.0816662609577179,
        0.06437245011329651,
        0.1085471510887146,
        0.03247617557644844,
        0.028478724882006645,
        -0.04296817258000374,
        -0.06324610859155655,
        0.040732450783252716,
        0.027043962851166725,
        -0.04951692372560501,
        -0.0031266065780073404,
        4.9585297800400835e-33,
        -0.013599392957985401,
        0.0798649787902832,
        0.05031499266624451,
        0.008225477300584316,
        -0.031363293528556824,
        -0.02464090846478939,
        0.03221215680241585,
        -0.01332226675003767,
        0.001865354715846479,
        -0.01833678036928177,
        -0.027931636199355125,
        -0.020012086257338524,
        -0.07746013253927231,
        0.006272162310779095,
        0.0624161958694458,
        -0.038270313292741776,
        -0.04376984387636185,
        -0.056887704879045486,
        -0.01569041982293129,
        0.055072881281375885,
        0.033198267221450806,
        -0.025466756895184517,
        0.016509173437952995,
        0.030796095728874207,
        0.1256488710641861,
        0.07521149516105652,
        0.06342826038599014,
        -0.04411241412162781,
        0.04420429840683937,
        0.03514875844120979,
        -0.08697980642318726,
        -0.03542137145996094,
        0.05320315062999725,
        -0.008349884301424026,
        -0.011400628834962845,
        0.01904037594795227,
        -0.06426124274730682,
        -0.019563501700758934,
        -0.03483371064066887,
        -0.032127782702445984,
        -0.0572689026594162,
        0.042589616030454636,
        -0.04439600184559822,
        0.005473109427839518,
        0.08241312205791473,
        -0.047115080058574677,
        -0.023033469915390015,
        0.1078329086303711,
        -0.10166484862565994,
        0.054563477635383606,
        -0.00586680555716157,
        -0.07175960391759872,
        -0.09540248662233353,
        0.05033227428793907,
        -0.06894513219594955,
        -0.003587199840694666,
        0.03197510540485382,
        -0.043074559420347214,
        0.07527561485767365,
        0.06767537444829941,
        0.01295274868607521,
        0.026984617114067078,
        -0.03143114596605301,
        0.014702589251101017,
        -0.05984433740377426,
        0.010302077047526836,
        -0.030464328825473785,
        0.06064183637499809,
        -0.04588305577635765,
        0.10154606401920319,
        0.055689554661512375,
        -0.013004759326577187,
        -0.017440438270568848,
        -0.029796279966831207,
        0.07881505787372589,
        0.007357477210462093,
        -0.017219364643096924,
        -0.04150883108377457,
        0.08248566836118698,
        0.00476799113675952,
        -0.037738751620054245,
        0.023219505324959755,
        0.031673941761255264,
        0.02038448303937912,
        -0.013643956743180752,
        -0.01592721790075302,
        -0.00901692546904087,
        -0.08714727312326431,
        -0.0387573279440403,
        0.09156445413827896,
        0.019866205751895905,
        0.004573658108711243,
        -0.029636409133672714,
        -0.07878659665584564,
        0.018022445961833,
        -5.7576958592603545e-33,
        0.0397641696035862,
        0.0005473684868775308,
        0.07325298339128494,
        0.04429786279797554,
        -0.009460118599236012,
        -0.06823799759149551,
        0.023834196850657463,
        0.07427182793617249,
        0.02031034044921398,
        -0.015998315066099167,
        -0.051622286438941956,
        0.02986305207014084,
        -0.01574535481631756,
        0.020815463736653328,
        -0.02393127605319023,
        -0.05785193294286728,
        -0.0635078027844429,
        -0.12375735491514206,
        0.03830701485276222,
        0.00361570343375206,
        0.04010290279984474,
        0.04889081418514252,
        0.05110751837491989,
        0.0548451729118824,
        -0.06521068513393402,
        0.027020815759897232,
        -0.015133922919631004,
        -0.06415946036577225,
        0.022588388994336128,
        -0.05421769618988037,
        -0.02552798017859459,
        -0.06704452633857727,
        0.028038613498210907,
        0.03777988255023956,
        0.04622324928641319,
        0.05287985876202583,
        0.054360199719667435,
        0.0470375120639801,
        0.022255919873714447,
        -0.020903244614601135,
        0.040220506489276886,
        0.09933973848819733,
        0.01835985854268074,
        -0.09322063624858856,
        0.026804383844137192,
        -0.04382035881280899,
        0.02934250421822071,
        0.016885962337255478,
        0.0547371581196785,
        0.03251846134662628,
        0.053648822009563446,
        0.08326878398656845,
        -0.07143677771091461,
        -0.005952236242592335,
        -0.06567015498876572,
        -0.04051130264997482,
        0.005055958870798349,
        -0.09497717022895813,
        -0.07347436994314194,
        0.013033713214099407,
        -0.0006241744849830866,
        -0.0076801651157438755,
        -0.048652056604623795,
        0.04219029098749161,
        -0.007532821968197823,
        -0.04657626524567604,
        0.07275787740945816,
        0.05255259945988655,
        0.01603442244231701,
        0.05671675503253937,
        -0.048287518322467804,
        -0.02823289856314659,
        -0.03162515163421631,
        -0.08897746354341507,
        0.02546311356127262,
        0.03664382919669151,
        -0.03975864127278328,
        0.050785165280103683,
        0.08856522291898727,
        0.03270701691508293,
        0.019086891785264015,
        -0.008637004531919956,
        -0.029259832575917244,
        0.008150647394359112,
        0.04048905894160271,
        0.03420620411634445,
        -0.018417295068502426,
        0.0017085784347727895,
        -8.830326987663284e-05,
        0.09751532226800919,
        -0.02376304566860199,
        0.01869743876159191,
        -0.0538107194006443,
        -0.004336726851761341,
        -0.020861968398094177,
        -4.741362147342443e-08,
        0.017158739268779755,
        0.031111670657992363,
        -0.001956079388037324,
        0.03232821822166443,
        -0.0013753456296399236,
        -0.05692320689558983,
        -0.004032124765217304,
        -0.010273530147969723,
        0.10253756493330002,
        -0.03320184350013733,
        0.021983111277222633,
        -0.007521964609622955,
        -0.03964348882436752,
        0.0476813018321991,
        -0.08829555660486221,
        0.0688869059085846,
        0.044831205159425735,
        0.029816878959536552,
        -0.013498255982995033,
        0.05389709025621414,
        -0.07539606094360352,
        0.03157161548733711,
        0.0076136356219649315,
        0.04735982045531273,
        -0.01904802955687046,
        0.015893856063485146,
        -0.07114413380622864,
        -0.02872193232178688,
        0.031124338507652283,
        0.046975310891866684,
        -0.06016580015420914,
        -0.023791464045643806,
        -0.061119403690099716,
        -0.015261218883097172,
        -0.012103639543056488,
        -0.09028694778680801,
        -0.02318895235657692,
        -0.015472053550183773,
        -0.004743483383208513,
        0.07202009856700897,
        0.0030577515717595816,
        -0.018956175073981285,
        -0.018084678798913956,
        0.012802081182599068,
        0.006597334984689951,
        -0.0813266858458519,
        -0.008096558973193169,
        -0.12883111834526062,
        -0.08712442964315414,
        -0.00354522792622447,
        -0.07503652572631836,
        0.020286012440919876,
        -0.09015130996704102,
        -0.027904389426112175,
        -0.03298354148864746,
        0.057455435395240784,
        0.05106610804796219,
        0.017803454771637917,
        -0.0890001580119133,
        -0.0009787095477804542,
        0.005860425997525454,
        -0.0929609164595604,
        0.01979406550526619,
        0.10953588783740997
    ]
}