{
    "id": "plbB42EUIUU",
    "title": "Exploring the Technology Connections Set (1 million subscribers special)",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2021-01-22T19:45:37Z",
    "video_url": "https://www.youtube.com/watch?v=plbB42EUIUU",
    "category": "Science & Technology",
    "tags": [],
    "views": 535261,
    "likes": 56065,
    "comments_count": 4990,
    "description": "All I can really say is thanks a million!  Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contribution on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. It's how I can yell at Cascade with aplomb! If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Well, apparently I have a million subscribersnow. Thank you. I truly never thought that that would happen, but, well since it has I suppose its time for a celebration! Roughly an entire month later So what are we gonna do? Were gonna talk about this set which is real and exists. I oughta know, I built the thing and moved it! Now, a lot of you have wondered what exactly all the things are amongst the shelves, andnow you wont have to wonder anymore because Im going to tellyou! With words and visuals! First, what is the set? How is it built? Well, it hails from everyones favorite source of meatballs, IKEA. A 5 X 5 Kallax, kalLAX? Kaylax? unit makes up the main bit, and there are two 1 X 4 units on either side. These drawers and doors: they actually hold things! Look! I keep some of my camera gear behind my head, and up here... is some junk. I got some white board markers in here, some probes in there for my oscilloscope which sits on top of the set where you cantsee it and, uh, oooh! a TV remote! Curious. I also got some lighting from the meatball store, just the basic warm white puck things but Ive been pleasantly surprised by them - I did, though, spend quite a few hours with an industrial Sharpie making them black and not creamcolored. I used electrical tape to make the wiring less noticeable against the black shelves, andthe wires are run vertically along the edges behind it. Up at the very top theres some cheap LED tape light attached to a piece of quarter round trim, also blacked out with sharpie. And all the power cords andother junk ends up down here in this terrible rats nest of wires! But its on a switched outlet so all I need to do is flip a switch and it all comes on. Then of course there are the lava lamps in a couple of the shelves (and I really should consider moving them, or perhaps add more) and well get to the colored light elements in a bit. Oh, and the restof these cubbies down here are empty because I havent been bothered to figure out what to put in them yet. I am terrible at organization! But lets get to the more interesting bits: the contents of the shelves. Things have been rotated in and out a fair bit over time, and in fact Id like to do more of that as time goes on, but its been fairly consistent. A not insignificantportion of the stuff in this set was given to me by friends and family over the years, and my fascination with these various objects is pretty much the reason Im the particular weirdo I am. So lets discuss! Well start with these things. These are LED traffic light modules. I bought them for the first video that was made in front of the fullycompleted set, \"The LED traffic light and the danger of But Sometimes!\" I still kinda want to getone that has a green lens so its a little more obvious what these are, but it turns out the clearlens on green is a rather common safety feature! If the sun hits traffic lights in the right way, they can appear to be lit - a clear lens on the green light prevents it from appearing green unless it is actually lit. Neat! But lets move on to where theres more stuff. Up here is my now dead Sony PRS-505 which died with this excellent ghost image on the screen. It sits atop a fully-functional NES which is now a prop because I dont use it enough. A gamer I am not,really. If nobodys noticed this cartridge, this is for a Commodore 64, a copy of HesWare Turtle Graphics II - a sort of educational programming game slash software thing, if I remember right. I used to have a C64 and a bunch of random stuff for it, but I lost interest in it and, uh, well no longer have much of anything related to it. Yeah I regret that. Anyway, finishing it up we have a Mold-A-Rama bust of Abraham Lincoln, made at the Museum of Science and Industry in Chicago, the transparent paints from my latest Christmas light coloring nonsense (which was now over a year ago) and this old 12V battery from Radioshack. Next we have the Camera Corner! This is wherethe Canon F-1 and Canon T90 live. These were both permanently loaned to me by a family friend, and I learned photography on these. Truly I wouldnt have the proficiency to operate a camera that I do without these, especially since I use a mirrorless camera which behaves morelike a stills camera than a true cinema camera. Oh, and to those in the know, dont worry - I do take the T90 out and exercise its shutter periodically. The T90 sits atop a stack of VHS tapes and a couple of CDs to elevate it above this 120 box camera, which I have yet to actually use. That wasan antique store find. And back here is a rather phallic sandcastle I found at a thrift store, and behind it is a fake Swedish plant. Next we have a crystal radio! Yep, thats whatthis box is. I dont know if it actually works - it was a gift and Ive no idea howto use it properly. But up here is the actual crystal and cat whisker, as well as the tuningknobs. Im pretty sure this was a hand-made kit given the writing on here. Its filledwith some colorful audio cassettes up top, and some plain ones to its side. Sallythe Snail sits slimily in front of it. And heres a rather hodge podgey shelf! Centerand most important is a somewhat rare telephone model called the Galion, hailing fromthe 1940s and made by North Electric as a competitor to the Western Electric 302. Itsnotable for being oriented sideways compared to most other desk phones, being wider thanit is deep. It works, but unfortunately its ringer does not. I do however like thatits original phone number label is intact. In front of it is a can of Silvertone recording wire and a double light switch, and behind it is what I thought was a skein of red yarn, but is probably large enough that its really a hank. Yes, a hank of yarn. Learn something new everyday. You cant really see it head-on but its there, and thats what counts! Back when Imade the videos on analog television, I used this yarn to make the scanning animation. We also have a functional light socket holding a squirrel-cage Edison-style light bulb, anda modern LED version of this sits unused for reasons. Oh, and theresanother fake Swedish plant. Next is the soldering station. This is actuallywhere I keep my soldering iron and its associated junk, as well as my DC power supply. If youvebeen paying really close attention, youll see that this shelf has changed the most because Iactually need the things in it from time to time. And right now the soldering iron's missing! There's also a pin from Epcots Millenium celebration I found in one of my junk boxgoings through. Oh, and a fake Swedish plant, of course. Heres a trick I actually learned in school - the DC power supply is sitting on a plastic storage container thats been covered in black fabric to make a tasteful but cheap makeshift display stand. And now heres another hodge podgey cube. On another tupperware stand is my late grandfathers 8mm movie camera. It is sortof functional - you can get it to run if you force the winding key forward, I suspect itjust needs a good lubrication. Opposite to it is a movie reel that it shot. Theres also thebasic thermostat from the thermostat video, one of the many additions over the years, anda 5 inch CRT from a cheap portable black and white television, the same one I used inthe analog television videos years ago. And then we have yet another fake Swedish plant, and a lava lamp. Down here is the Betamovie and some Beta cassettes. [extended pause] Thats it. Next we have a Sony television set that many of you have asked about. This is a portable model, the TV-750, and It appears to have been introduced in 1972. It still works, but barely. The picture tube is quite dim and Im sure this could do with a complete electronics restoration. I would show you but I dont know where its power cord is at present so sorry. A monochrome Rubiks cube sits atop it because its insufferably clever. This next cube is an assortment of objects. This mug is covered in the original Future World pavilion logos from EPCOT Center, released inmug-form as part of EPCOTs 35th anniversary. Then theres a lava lamp behind it. This snake was justa thrift store find - I sort of suspect somebodys child painted this thing? I dunno, sorry Jimmy if your parents didnt keep it. And behind it is a very strange and slightly suggestive clown figure. Ive named it Disposo, naturally. Directly behind me which you cant ever see during talking heads is a very important-to-me radio. This is a Philco 42-PT7, a basic tabletop radio from 1942. Its a simple design, but very nice, and while its missing a knob its stillquite beautiful to me. Its important to me because it was really the first electronics project I ever embarked on - I recapped this radio many years ago, and it introduced me to the world of antique radio collecting. I found it at an antique store in Michigan. Behind it is a framed Laserdisc of 1776 that sits there simply tohide whats behind the set. Next is another rather simple assortment of things. Its mostly reel-to-reel tape stuff, with a reel at the back, Scotch boxes,and of course a Spaceship Earth mug which stays as part of the set because it's a ridiculous mug to drink from. Theres another functional light socket with a squirrel-cage filament bulb, though this one is a globe shape, and that pearis another random thrift store knick knack. Over here is a pair of lanterns, one an old railroad lantern which leaks and the other well I dont know theorigin of this exactly but its not an antique, just a bit of decor. And theres a whiteMold-A-Rama figure of the Space Shuttle. Lanterns will be coming as a subject in the not-too-distant future, by the way. Lets talk about this cubby. Nothing hasever really gone here. Ive been meaning to fix that for ages but havent. Almostthe entire time this set has been in use, there has been a DVD copy of The Terminal starring Tom Hanks sitting there. Dont ask me why as I truly do not know, and in the last couple of months this loudspeaker driver and crossover havebeen sitting here because Im lazy. On the bottom-right is the closed captioning decoder, and a dolphin figurine that I claimed when my parents moved sits on top becauseI like it. And yes, the Teletext video hasnt happened yet. I'm very aware of that. Im just well well get there eventually. I promise. Alright, and top row! This is the vastmajority of my Laserdisc collection. Ive got a few things that arent here but this is mostly it. Yep, Im not a huge collector of them - theyre just delightfully giant optical discs and fun to use. Definitely not, like,my favorite way to watch a movie, though. Then we see the wee little GE TV that me gotfor free (tee hee) at a garage sale years ago. A couple of VHS sleeves for Cosmos sit atop it, and the RGB electron gun of flashlights from the shadow mask video sit atop it aswell. Unfortunately something went wrong with the deflection yoke on this thing and nowthe screen is all trapezoidal and messed up. Not too much of a shame, though, as this thing is more useful as a prop than a TV, anyway. Next to it are my CEDs, theyve been up heresince before the CED series ever got made. Sitting in front of them is a Walkman which is aesthetically excellent but functionally a little off - its got a new belt but theres alot of flutter so I never really used this thing, even though its an auto-reverse Walkman with Dolby B and again is just excellent looking. Marty the Squirrel, another thrift store knick knack, sits in front of a pair of Sony Dynamicron VHS slipcovers, and an L-750 Beta sleeve is above it at a wonky angle. There are also two books given to me by a friend - includinga penny collectors collection collector. And lastly theres the top right cubby. This has another antique radio, an AM-FM tabletop unit from Silvertone, and I also restoredthis one. Last time I fired it up it worked great, and I really do love the design of this. In frontof it are spare knobs that I harvested from a different Silvertone radio long ago that happen to match it. On top ofit is the Olympus Pen EES-2 which actually got a mention not too long ago (and a Sears brand flashunit is attached to it), and another Rubiks cube, though this one with normal colors sits on top the radio. Oh,and behind it is some fake Swedish grass. Finally, theres an assortment of miscellanea up top. A pair of Inifinity RS-2000 speakers sit atop the smaller cases because theyreaesthetically pleasing (and actually quite nice, though they have fairly weak bassresponse). Then theres this 3D printed model I made basically at the very start ofthis channel to help visualize the difference between Edisons vertically-cut cylinderrecords and Berliners laterally cut discs. Thats right, I used to have a 3D printer, orrather I still do but its crap and broken. Then there's the deflection yoke for the little 5 inch CRT. It sits here because because it was a good place to put it I guess? And theres also a lonely drill bit up here because of course there is. And thats all the stuff you can see. But beforeI go, theres one other important thing goin on. The colors. Lately the set has looked like this more often than not, but if youve been paying attention youll have seen those colors change, and sometimes theyve not been colors at all, but instead imagery. And thats what this remote is for. See those colors? Those come from aTV. Two to be more precise. There are two very cheap 55 inch TVs literally hangingoff the back of this set facing me. This set isnt against the wall for this reason, and thats why the items at the top completely fill the cubbies. I didnt want the chainsthat the TVs are hanging from to be visible, or for you to have much of a clue what exactly was going on. This wasted cubby here with the drawers? That wasnt planned, I genuinely I had this idea after I had already built this and started making inserts. But truthfully Ithink it makes the illusion all the better. Because Im unforgivably lazy, the TVs are powered by Chromecasts which mirror the desktops of my PC and Chromebook. I just set them up before I go to film the talking head or B-roll, and thats that. I made templates forever ago which I can use to make more stuff, but Ive been using this standard color grid for a while because I like it. Though, I may finally do what I set out to do long ago and set up a video where these slowly change over time. Im just, as I said, unforgivably lazy. And thats also why this set looks so incredibly drab in some of my Connextras videos. If I dont power it up and set up the screens, it just looks kind of sad. Look, Ill gocycle it off and on which will kill the TVs. Sure, thats much better than completely off, but the stark black background is nowhere near as interesting. Im actuallyquite proud of this idea if you cant tell. But I still cant believe that Im here right now. Never in a million years did I think a million subscribers would happen. I thought I was justtoo weird, that this channel idea wouldnt have wide enough appeal. Im delighted to have beenwrong (though I am still just absurdly weird). Thank you for subscribing, forwatching my videos all these years, and leaving me with this bright spot at the end of an otherwise incredibly awful year. Yep, this actually happened in 2020. I wasactually kind of hoping that wouldnt happen, that the flip would occur in 2021, but something aboutdishwashers just really piqued your interest. Ive been very fortunate in an otherwise tumultuous year, and I try to remember that as often as I can. Of course, that wouldnt be possible without my amazing supporters on Patreon, and today Id like to thank each and every one of you. Thankyou for making Technology Connections possible, and for keeping me focused through this wild ride of a year. Heres to a brighter and better 2021! celebrationally smooth jazz",
    "transcript_keywords": [
        "set",
        "sits",
        "light",
        "fake Swedish plant",
        "fake Swedish",
        "top",
        "things",
        "thing",
        "LED traffic light",
        "camera",
        "Swedish plant",
        "time",
        "radio",
        "years",
        "sits atop",
        "sit atop",
        "Swedish",
        "store",
        "ago",
        "years ago"
    ],
    "transcript_entity_values": [
        "the last couple of months",
        "the Olympus Pen EES-2",
        "North Electric",
        "two",
        "Berliners",
        "CED",
        "Kallax",
        "Silvertone",
        "Jimmy",
        "the Western Electric 302",
        "one",
        "Walkman",
        "5",
        "T90",
        "Two",
        "IKEA",
        "GE TV",
        "a year",
        "Tom Hanks",
        "Inifinity RS-2000",
        "NES",
        "2020",
        "Silvertone",
        "Swedish",
        "Chromecasts",
        "Canon T90",
        "Sharpie",
        "12V",
        "many years ago",
        "Sony",
        "RGB",
        "the Space Shuttle",
        "Iactually",
        "35th",
        "EPCOT Center",
        "Terminal",
        "Teletext",
        "VHS",
        "quite a few hours",
        "first",
        "4",
        "Sears",
        "years ago",
        "a year ago",
        "1972",
        "Canon F-1",
        "Abraham Lincoln",
        "Roughly an entire month later",
        "Chicago",
        "1942",
        "HesWare Turtle Graphics II",
        "Future World",
        "Patreon",
        "1776",
        "Dolby",
        "2021",
        "Cosmos",
        "Philco",
        "Chromebook",
        "8mm",
        "DC",
        "5 inch",
        "Kaylax",
        "a million years",
        "55 inch",
        "Radioshack",
        "Epcots Millenium",
        "the Museum of Science and Industry",
        "Rubiks",
        "the years",
        "Next",
        "the Camera Corner",
        "C64",
        "Christmas",
        "Michigan",
        "Dynamicron",
        "Galion",
        "Edisons",
        "Spaceship Earth",
        "Centerand",
        "Technology Connections",
        "Connextras",
        "120",
        "First",
        "quarter",
        "Marty",
        "fromthe 1940s",
        "Disposo"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "NORP",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "ORDINAL",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "EVENT"
    ],
    "vector": [
        -0.08726255595684052,
        -0.07790371775627136,
        0.030866600573062897,
        -0.032436370849609375,
        -0.0036564574111253023,
        -0.06303319334983826,
        0.07433755695819855,
        -0.001304852426983416,
        0.013359825126826763,
        0.001312084379605949,
        -0.04736322537064552,
        -0.03791945427656174,
        0.04698242247104645,
        -0.012877336703240871,
        -0.046930331736803055,
        0.0042875539511442184,
        -0.003254383336752653,
        -0.13159920275211334,
        -0.09278014302253723,
        -0.02248687483370304,
        0.00644649239256978,
        -0.030935272574424744,
        -0.004580099135637283,
        0.016685232520103455,
        -0.005422217771410942,
        0.0596882700920105,
        -0.060683250427246094,
        -0.03782222047448158,
        -0.020307905972003937,
        -0.04898582771420479,
        -0.0038686615880578756,
        0.09503956139087677,
        -0.05216473340988159,
        0.0010044340742751956,
        -0.00487757520750165,
        0.0678475871682167,
        0.04218170791864395,
        -0.024480316787958145,
        0.0107271708548069,
        -0.0409972183406353,
        0.027051987126469612,
        -0.07586079090833664,
        0.020494632422924042,
        0.06611688435077667,
        0.015022136270999908,
        0.08289054036140442,
        0.017908457666635513,
        -0.050244323909282684,
        -0.005065079312771559,
        -0.04106413200497627,
        -0.07218153774738312,
        -0.047290556132793427,
        0.0310205090790987,
        -0.01748318411409855,
        -0.01720726490020752,
        0.06486617028713226,
        0.047814253717660904,
        -0.03246099874377251,
        0.03146999701857567,
        -0.031005464494228363,
        0.08140699565410614,
        -0.06444580852985382,
        -0.025802647694945335,
        0.04690207913517952,
        0.002454860834404826,
        -0.0017598193371668458,
        -0.019760863855481148,
        0.12479394674301147,
        0.03638989105820656,
        -0.03246429190039635,
        0.005173530429601669,
        0.08255129307508469,
        0.05764827877283096,
        0.04131143167614937,
        0.06769363582134247,
        0.017298011109232903,
        0.06542597711086273,
        -0.09089817106723785,
        0.04210584983229637,
        0.012286903336644173,
        0.06923772394657135,
        0.005314954090863466,
        -0.028042184188961983,
        -0.041487209498882294,
        -0.056894294917583466,
        0.018420035019516945,
        0.012830886989831924,
        0.03005734272301197,
        -0.03806285932660103,
        -0.014329553581774235,
        -0.08170345425605774,
        0.003759575542062521,
        0.03462257981300354,
        0.011365676298737526,
        -0.01050921343266964,
        0.0786677673459053,
        -0.037695664912462234,
        -0.04834803193807602,
        -0.02400466986000538,
        0.061022378504276276,
        0.03767623379826546,
        0.07673263549804688,
        0.0518423356115818,
        -0.03353157639503479,
        -0.14089004695415497,
        -0.04880727827548981,
        -0.1053270772099495,
        0.08219116926193237,
        0.0652816966176033,
        -0.0035297784488648176,
        -0.03596317023038864,
        0.00322272558696568,
        -0.024400068446993828,
        -0.03832222893834114,
        -0.026416724547743797,
        0.02196497656404972,
        0.007136245723813772,
        0.034774042665958405,
        0.024723147973418236,
        -0.00651047145947814,
        0.02485690824687481,
        0.020238379016518593,
        0.0013262532884255052,
        -0.01122391875833273,
        0.06276766210794449,
        -0.010831850580871105,
        -0.021480541676282883,
        2.6688276804275363e-33,
        0.049859680235385895,
        0.05872792750597,
        0.021708065643906593,
        0.10924820601940155,
        0.06953208148479462,
        0.017086507752537727,
        -0.05569886043667793,
        0.0354071743786335,
        -0.11142460256814957,
        0.009978299960494041,
        -0.00941889826208353,
        0.0540139339864254,
        -0.0692075788974762,
        0.09272436052560806,
        0.0367688350379467,
        -0.15251536667346954,
        -0.04152662679553032,
        -0.08007766306400299,
        0.005283285863697529,
        -0.056941647082567215,
        -0.023906568065285683,
        -0.012066460214555264,
        0.015992261469364166,
        -0.03747126832604408,
        0.10340487211942673,
        -0.036547139286994934,
        0.013697744347155094,
        0.029967233538627625,
        0.01626417599618435,
        0.020092947408556938,
        -0.05852406471967697,
        0.05673158913850784,
        -0.02960214950144291,
        -0.008290344849228859,
        0.004119161982089281,
        -0.0910666361451149,
        -0.04669899120926857,
        -0.13890446722507477,
        0.02473537065088749,
        -0.022164802998304367,
        0.015287986025214195,
        0.047839995473623276,
        -0.08196622878313065,
        0.045401278883218765,
        -0.06473556160926819,
        0.02805573306977749,
        0.08292226493358612,
        0.04857216402888298,
        0.00026330159744247794,
        -0.008965091779828072,
        -0.02338075451552868,
        0.04994341358542442,
        -0.021577978506684303,
        -0.049772873520851135,
        0.0474516786634922,
        -0.025626743212342262,
        -0.03254587575793266,
        -0.03893125057220459,
        0.10871987789869308,
        -0.014710442163050175,
        0.029019795358181,
        -0.002789517631754279,
        -0.013013871386647224,
        0.06495503336191177,
        -0.04517800360918045,
        0.06221246346831322,
        -0.008181221783161163,
        0.026805125176906586,
        0.05920654535293579,
        0.05677986890077591,
        -0.023192962631583214,
        -0.021715855225920677,
        -0.07878197729587555,
        -0.06087064743041992,
        -0.0046104188077151775,
        0.08444149792194366,
        -0.04365870729088783,
        0.006039781030267477,
        -0.009171420708298683,
        0.08367633819580078,
        0.017753083258867264,
        -0.025000838562846184,
        -0.01614818535745144,
        0.021124355494976044,
        0.04462023079395294,
        -0.02724611386656761,
        0.0802081748843193,
        -0.1123555600643158,
        0.0035312690306454897,
        -0.0016511857975274324,
        -0.041384581476449966,
        -0.013683448545634747,
        0.03688884526491165,
        -0.024775506928563118,
        -0.023292293772101402,
        -4.082733958773677e-33,
        0.010036819614470005,
        -0.030929695814847946,
        -0.04053989797830582,
        -0.02649052068591118,
        0.056377679109573364,
        -0.11680189520120621,
        -0.06312336027622223,
        -0.02802891843020916,
        0.008959461003541946,
        0.04222603887319565,
        0.03433670476078987,
        0.04840850085020065,
        -0.032922301441431046,
        -0.07445608824491501,
        -0.06771006435155869,
        -0.056613340973854065,
        0.09074904024600983,
        -0.03413665294647217,
        -0.013857550919055939,
        -0.022049633786082268,
        -0.007107713259756565,
        0.03392679989337921,
        -0.10600035637617111,
        -0.020110584795475006,
        -0.0287478007376194,
        0.05421711131930351,
        0.00230012577958405,
        -0.022329391911625862,
        0.01205087173730135,
        0.025980936363339424,
        -0.06800027191638947,
        -0.0751003846526146,
        -0.016226813197135925,
        0.01194633636623621,
        0.0019599003717303276,
        0.08254415541887283,
        0.11935737729072571,
        -0.07160111516714096,
        -0.0517030693590641,
        -0.1221107542514801,
        0.0492030568420887,
        0.04801155999302864,
        -0.09143136441707611,
        -0.0028189069125801325,
        -0.06238831207156181,
        -0.01803196594119072,
        -0.0522562637925148,
        0.022558309137821198,
        -0.06998622417449951,
        0.012453356757760048,
        0.047117672860622406,
        -0.0449504479765892,
        0.07841002196073532,
        -0.10754460096359253,
        0.038642603904008865,
        -0.002584414789453149,
        0.016980525106191635,
        0.029023583978414536,
        0.054622337222099304,
        0.01396894920617342,
        0.03353334218263626,
        -0.022718165069818497,
        -0.0033326465636491776,
        0.04399307444691658,
        0.05019206926226616,
        -0.05822671949863434,
        0.07528524100780487,
        0.03544687479734421,
        -0.08151526004076004,
        -0.009180933237075806,
        0.0027339011430740356,
        0.016037506982684135,
        -0.07830170542001724,
        -0.09674835950136185,
        0.023746561259031296,
        0.01745840348303318,
        0.014317449182271957,
        -0.003892503445968032,
        -0.0027614200953394175,
        0.07705337554216385,
        0.02037947066128254,
        0.0760100707411766,
        0.04597274214029312,
        -0.031556881964206696,
        0.12829254567623138,
        0.04189028963446617,
        0.007332767825573683,
        0.08444251120090485,
        -0.016477389261126518,
        -0.0017466311110183597,
        -0.025250328704714775,
        0.006596413906663656,
        -0.01776731200516224,
        0.07183367758989334,
        0.04636697098612785,
        -6.386926543200389e-08,
        -0.0011164386523887515,
        0.03135824203491211,
        -0.06187551096081734,
        -0.05267243832349777,
        0.016667308285832405,
        -0.08532575517892838,
        0.07123040407896042,
        0.04171589016914368,
        -0.016974816098809242,
        -0.016718914732336998,
        -0.032008811831474304,
        0.006660493090748787,
        -0.05101703107357025,
        0.1476391702890396,
        0.10936582088470459,
        0.0317981094121933,
        -0.07333189249038696,
        -0.01085435226559639,
        -0.07760181277990341,
        -0.05771292373538017,
        0.053468625992536545,
        0.03503166139125824,
        0.04052426666021347,
        0.023214148357510567,
        0.00859274435788393,
        0.016140054911375046,
        -0.014321030117571354,
        0.013865118846297264,
        -0.007118201814591885,
        0.008199195377528667,
        -0.06325303763151169,
        -0.06958412379026413,
        -0.09171004593372345,
        -0.003198768477886915,
        -0.00257468712516129,
        0.0015863842563703656,
        -0.08175919204950333,
        0.0087010208517313,
        0.01705833524465561,
        0.02841929718852043,
        -0.003584397491067648,
        -0.06261885166168213,
        0.06547631323337555,
        0.10960102081298828,
        0.030401162803173065,
        0.044525761157274246,
        -0.09472892433404922,
        0.003025069134309888,
        -0.017027180641889572,
        -0.018291136249899864,
        -0.05885644629597664,
        0.01400651317089796,
        0.037576135247945786,
        -0.013682648539543152,
        0.02236383594572544,
        -0.023596322163939476,
        0.0009958714945241809,
        0.05206189677119255,
        -0.002708971966058016,
        0.03848683461546898,
        0.05514134466648102,
        -0.04506804794073105,
        -0.04205508530139923,
        -0.01023014448583126
    ]
}