{
    "id": "pMX2cQdPubk",
    "title": "Talking Tech and AI with Tim Cook!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-06-12T15:56:11Z",
    "video_url": "https://www.youtube.com/watch?v=pMX2cQdPubk",
    "category": "Science & Technology",
    "tags": [
        "Tim Cook",
        "Tim Cook Interview",
        "Apple Intelligence",
        "mkbhd",
        "MKBHD",
        "Talking tech with Tim Cook",
        "talking tech",
        "Tim Cook AI",
        "Apple CEO"
    ],
    "views": 3131676,
    "likes": 127513,
    "comments_count": 9553,
    "description": "AI...Siri... magic mouse... we talk about it all  WWDC 2024 Recap:   MKBHD Merch:   Tech I'm using right now:   Intro Track: Logic  Playlist of MKBHD Intro music:   ~     0:00 AI vs Apple Intelligence 4:30 AI vs Privacy and ChatGPT 6:35 Standalone AI Devices 8:42 Legacy 10:06 Blind Ranking/Retrospective",
    "description_links": [
        "https://youtu.be/qkYoBNdcXBU",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://logic.lnk.to/DejaVu",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - All right, Tim. - Great to see you. - Thanks for spending the time. - Thank you for coming. So you had the WWDC keynote today. - Yeah. - Which was really fun to watch. It was a whole two hours. I wanna zoom all the way out, 'cause, obviously, a lot of talk about AI in general. - [Tim] Yeah. - And I'm kind of just left wondering how Apple defines AI in general, because I know, if you ask a regular person, you might hear about generative AI, chat bots, things like that. - Yeah. - And these are relatively new additions to Apple's AI portfolio. How do you look at AI as Apple? - Well, we've been executing with AI for a long time. - [Marques] Right. - It's at the, you're wearing a watch. It's at the root of the watch. I mean, you think about things like crash detection, fall detection, things like Afib, and all of this kind of stuff is machine learning at the end of the day, and so, but what has captured people's imagination is generative AI, and we see it as the opportunity for a whole new curve of technology and providing and doing more things for people, providing an assistant for people, things that really improve people's lives. So that's how we see it. Obviously, it's not without downside, and so we approach it very thoughtfully. - Sure. - And as you heard, we have always been focused on privacy, and so privacy is a very key tenet of our thrust into AI. - Right. It's been interesting to watch Apple's arc with AI. 'cause I made a whole piece, not more than about a year ago, about how Apple seems to never say AI, even though they have all these neural engines and machine learning and things like that. - Yeah. - And so now we have almost this pivot, where now we're just saying it. We're actually branding it Apple Intelligence now. I'm curious why that changed now. - Well, in the beginning, and throughout almost everything that we always do, we always talk about the benefit to the user, and so the benefit to the user is crash detection and fall detection, not the technology behind the feature. - Sure. - And so we still view it like that, but it became clear that people wanted to know our views on generative AI in particular. - [Marques] Yeah. - And so we decided to embrace it and called it Apple Intelligence. - Okay. I have a quote from the Dua Lipa interview that you did. - [Tim] Oh, okay. - [Marques] That was great. - [Tim] It was fun. She's fantastic. - I loved it. It was great. You had a quote that said, about AI, \"If it can be used for nefarious things, we won't go down that road.\" - Yeah. - And at the time, I assumed that that meant generative AI was off the table, 'cause of all the things that we've seen about what it was potentially capable of or things that it might do. Has that changed? Is that something that was off the table and you figured now you've got the right tools or the right restrictions to make sure that that all goes super well? How do you think about that? - Generative AI was never off the table. It was always about pursuing it in a thoughtful kind of way, and so that's what we've done, and we've implemented it in ways that are less likely to create issues. - How so? - How so? Well, things that, if you think about the kinds of things that we talked about, we talked about personal context and we talked about privacy, and so we are not waiting for a comprehensive privacy legislation regulation to come into effect. We already view privacy as a fundamental human right, and so that's the lens that we see it at, and given that we're doing those things, personal context and privacy, we wanted to integrate it at a deep level, so you're not having to think, \"Oh, well, now I want to do something that uses Intelligence.\" We put it into the apps that you're already using. - Right. - And integrate it in deeply. - Right. Yeah. I think also, now, there's a lot of talk about it now that there is generative AI. - [Tim] Yeah. - A lot of people have, I mean, Apple's notorious for never sending anything to the cloud. Everything's on device, because that is the most secure way to do it, and was applauded for it. Interestingly, this is a little bit different now. With a lot of these larger models, more complex requests, you actually do have to go off of the device, so you've developed, I wanna get the name right. Private Cloud Compute. - Private Cloud Compute. - Explain this to us, because I think the general chatter online is, well, they have to be sending data to OpenAI, for example, to get a request back from ChatGPT. - Well, there's Private Cloud Compute, and then there's the arrangement with OpenAI. These two things are different. - Okay. - And so if you look at Private Cloud Compute, we're utilizing the same silicon, or not the same silicon, but the same basic architecture as the silicon that's in- - [Marques] Right. - Well, that's in the iPhone. - 15. Yeah, right. - And we're using the same software, and so we believe that we've done it in such a way that it's as safe and secure and private in the Private Cloud Compute as the device, and so we really worked on this a lot and put a lot of wood behind that arrow to ensure that. If you're working on something that requires world knowledge, so you're out of the domain of personal context and so forth. - Yeah. - Then you may want to go and use one of the large language models that are on the market, and we selected what we feel is the best one with OpenAI and ChatGPT, but you'll make a conscious decision to do that - Every time. - Every time. - So you can guarantee that there will never be any data sent to OpenAI without your explicit user- - That's right. That's right. You decide. - Right. I also feel like there was this blip on the radar of stand-alone AI devices, which I found really interesting. They didn't land too well. I think smartphones are pretty great, but there was an interesting conversation around that, about using your phone less, maybe having AI help you out in ways that let you spend less time on the screen, and this is something you echoed also in the Dua Lipa interview. Like, if you're looking at your phone more than you're looking at someone else's eyes, something's off there. - Yeah. - Do you think there's a potential future where we're using our phones less because of how well the Intelligence works? - I think it's a possibility and a significant possibility. I mean, for us, we've never been motivated for people to spend their lives on their devices. Our model is not one that needs engagement to succeed. Our model is one where we want to empower you to be able to do things you couldn't do otherwise. We want to give you a tool so you can do incredible things that you couldn't do without the tool. That's what motivates us, and so, you know, we come out with things like Screen Time, et cetera, so it's a bit in your face as to how much you're using your device. - True. - We come out with, we count your notifications and so forth so that you can go in and say, \"Do I really want this many notifications?\" And we have focus kinds of states where you can silence the phone, et cetera, and so I do believe that, as things get smarter and smarter with Apple Intelligence, that you can even take things that were taking more time will take less time now. - Right. - And so I do think that opportunity exists. - Interesting. Yeah. It's a curious future. - It is. It is, and I think I'm really optimistic about it. - Yeah. I also feel like there was tons of chatter when you were first CEO of Apple, about this new shift, obviously, coming from Steve Jobs, and you've been CEO for what feels like a long time now, and we're entering this new age of AI, and I'm curious now. Now, there's new chatter about who the next CEO is gonna be. What do you feel like your legacy as CEO at Apple should be? - Yeah, Marques, I don't think about it. - Okay. - And so, to me, a legacy is something that is defined by other people looking at you, not something that you define yourself. - Very fair. - And so, and I typically am always focused on the forward, not the rear-view mirror, and that is a characteristic of Apple in general, is we're very focused on the forward. You won't find a museum here, and yet we would have lots of things that you might like to see and reminisce about, but we just don't. It's just not a part of our culture. - [Marques] Yeah. - And so I feel the same way personally. At some point, there will be another CEO, and my whole focus in life will be on making them successful. - Yeah. I like that answer. It's a very LeBron answer. I feel like he said something- - Oh, is that right? - Yeah. All right. I wanna end with a little game. I don't know if you've seen these, where it's a blind ranking. Have you seen what these are? - A blind ranking? - A blind ranking. So we're gonna do a top five Apple products of all time, but I'm gonna give you them one at a time, and you don't know what the rest of them are. So you have to rank the first one without knowing what two, three, four, and five are. - Oh. - Okay. - And this is your ranking? - This will be your unofficial ranking, just based on your gut reaction of how you feel about the products. - All right, this is a tough one because- - It is a tough one. - It's like asking you your favorite kids or nephews or nieces. - We'll see how it goes. - Yeah. Okay, number one. MacBook Air. Had that iconic moment of, like, taking it out the envelope on stage. It's the most popular laptop in the world, I think. - It's the most popular in the world, and that moment of taking it out of the folder established a characteristic about that device that lives today. The first one, it wasn't about how many people would buy it. - [Marques] Yeah. - It was about establishing the foundation. - Was that the first Air product? - Of any line? - Yeah. It might have been. - I believe so. Yes. - Okay. - I believe so, and so I'm gonna fail miserably at giving you a ranking, but it was a huge moment. - [Marques] Yeah. - A huge moment for the company. - The iPad. - Oh, wow. You know, tablets had been in the market for a long time. Our objective is never to be first. Our objective is to be best. - I remember all the rumors leading up to it. - And there were many rumors leading up to it, and people thought many things that weren't too nice about it in the beginning, including the name, and yet I couldn't live without my iPad today. - [Marques] Yeah. - And so another huge moment for the company. - My number three is the Magic Mouse. - The Magic Mouse. It was also an incredible moment. People don't think of that as much as they would the MacBook Air and the iPad and whatever else you're going to name probably, but getting the ergonomics well done was key. - With the Magic Mouse. - [Tim] Yeah. - Okay. Four out of five, the iPhone. - Oh my God. It changed the world. - It definitely changed the world. - It changed the world, and the simplicity of defining the three things. - [Marques] Yeah. - That were on the phone was brilliant to get people to think about it like that, and, of course, opening up, this isn't talked about as much, but, initially, you'll remember that there was not an App Store. - Right. - The App Store came a year later, and that changed everything in the developer community, because, now, I meet with students every WWDC, and they give me such great inspiration. There were no students in the developer community at that particular point in time. Now, the developer population is very diverse from an age point of view and everything else, and it just, fundamentally, it became an economic miracle for people, and got well outside of just doing it for a hobby. You look at all the businesses that came out of it. - Yeah, and now we have WWDC. - That's right. - Last but not least, Vision Pro. - Oh. I love Vision Pro. I was just using it last night to look at the screening. - Yeah. What do you use Vision Pro for? I ask everybody who has one what they use it for. - I use it for the entertainment value. I use it when I want to do multitasking, because I find the multiple windows really effective in doing this. Of course, I'm reviewing lots of app on it right now, and some of those are enterprise apps, some people's proprietary apps that they wanna share with us, and I'm seeing an extraordinary number and variety of things coming out of the enterprise area, far earlier than we would've predicted. - Interesting. - Because businesses generally move slow to adopt. - [Marques] Yeah. - And what we're seeing is that half of the Fortune 100 is now buying Vision Pro for some project or the other, or exploring it. - [Marques] Interesting. - And so I'm looking at several of those and, yeah, I find that it's still an emotional experience to look at your photos, and with visionOS 2, being able to take your old photos. - [Marques] Yeah. - [Tim] And make them 3D, I think is a big, big thing. - [Marques] Yeah. - And, you know, I lost both of my parents before Vision Pro came out, and being able to go back and look at those photos differently is something that, you know, it's an experience you can't replicate. - For sure. Well, we didn't get a blind ranking, but we got a pretty good retrospective. - Yeah. - Of some of these products. Thanks again for your time. - Thank you. - Thank you. - I'm looking forward to when the next feature drops in the next WW, but this was fun. Thank you. - Yeah, it was great fun. Thank you for coming. - Same. (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "Private Cloud Compute",
        "things",
        "Apple",
        "Apple Intelligence",
        "Cloud Compute",
        "time",
        "Private Cloud",
        "people",
        "Vision Pro",
        "cloud",
        "Private",
        "Intelligence",
        "Compute",
        "Tim",
        "feel",
        "CEO",
        "ranking",
        "Pro",
        "Vision"
    ],
    "transcript_entity_values": [
        "AI",
        "today",
        "Apple",
        "about a year ago",
        "three",
        "Steve Jobs",
        "one",
        "iPad",
        "a year later",
        "the Dua Lipa",
        "four",
        "the Private Cloud Compute",
        "the Magic Mouse",
        "MacBook Air",
        "15",
        "iPad",
        "five",
        "half",
        "first",
        "last night",
        "a whole two hours",
        "the Magic Mouse",
        "iPhone",
        "100",
        "Vision Pro",
        "Private Cloud Compute",
        "Four",
        "LeBron",
        "Apple Intelligence",
        "Tim",
        "the MacBook Air",
        "Private Cloud Compute",
        "two",
        "the end of the day",
        "The Magic Mouse",
        "Intelligence",
        "2",
        "WWDC"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "LAW",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "EVENT"
    ],
    "vector": [
        -0.041243281215429306,
        -0.089769646525383,
        0.06630921363830566,
        -0.03615948185324669,
        0.10030854493379593,
        0.020563311874866486,
        0.10924606770277023,
        0.005504765547811985,
        0.016880307346582413,
        0.03538365662097931,
        -0.06662027537822723,
        -0.04501497372984886,
        -0.05683934688568115,
        -0.08963200449943542,
        -0.01929657720029354,
        0.022878898307681084,
        0.06545236706733704,
        -0.08805577456951141,
        -0.09100403636693954,
        0.023860067129135132,
        0.07178845256567001,
        0.018637757748365402,
        0.042764775454998016,
        -0.004469394683837891,
        -0.010336985811591148,
        0.08796491473913193,
        0.008671795018017292,
        -0.07159718126058578,
        -0.03363686800003052,
        0.011821079067885876,
        -0.024863693863153458,
        0.05947337672114372,
        0.10318619012832642,
        0.009240716695785522,
        -0.05643688514828682,
        -0.0013786422787234187,
        -0.007578055374324322,
        0.02413373999297619,
        0.010325301438570023,
        -0.06434702128171921,
        -0.039625365287065506,
        -0.017297299578785896,
        0.03660554438829422,
        0.020564161241054535,
        0.05813831463456154,
        0.0049944547936320305,
        -0.03540588542819023,
        -0.0811091810464859,
        -0.03861420974135399,
        0.10288429260253906,
        -0.14546361565589905,
        -0.024660427123308182,
        -0.000960446079261601,
        0.047739457339048386,
        0.01304426696151495,
        0.1056457981467247,
        0.03510428965091705,
        0.016621021553874016,
        0.07517258822917938,
        0.0685267522931099,
        0.012768891640007496,
        -0.11363665759563446,
        0.07300160825252533,
        0.023495905101299286,
        0.04191611334681511,
        -0.04785357043147087,
        -0.042182426899671555,
        0.00656913872808218,
        0.030482834205031395,
        -0.054224032908678055,
        0.036624643951654434,
        -0.010797560214996338,
        0.03601064905524254,
        0.009863857179880142,
        0.05996197834610939,
        -0.009668226353824139,
        0.011397439055144787,
        -0.06347490102052689,
        0.022488975897431374,
        -0.05643044039607048,
        -0.008062342181801796,
        0.025777991861104965,
        0.07511098682880402,
        -0.00913496408611536,
        -0.03475915268063545,
        -0.01111866720020771,
        -0.019284605979919434,
        -0.023162096738815308,
        -0.048465028405189514,
        0.05144146457314491,
        -0.06450331211090088,
        -0.061424754559993744,
        -0.031039699912071228,
        -0.012755509465932846,
        0.1891845017671585,
        -0.0011540401028469205,
        -0.02744440920650959,
        -0.05057553946971893,
        0.009796890430152416,
        0.024471204727888107,
        -0.011468655429780483,
        0.019644709303975105,
        -0.030048208311200142,
        -0.046965278685092926,
        -0.03034188039600849,
        -0.0034568351693451405,
        0.0346287377178669,
        -0.03572110831737518,
        0.02333713322877884,
        0.025963593274354935,
        -0.002029018010944128,
        0.030853403732180595,
        -0.017193468287587166,
        -0.028787752613425255,
        0.049978770315647125,
        0.022379036992788315,
        -0.013196771964430809,
        0.094486303627491,
        0.12546278536319733,
        -0.006221339106559753,
        0.020106343552470207,
        0.04047772288322449,
        0.025911973789334297,
        0.03298691660165787,
        0.04297087341547012,
        0.03286200016736984,
        -0.005489570554345846,
        4.795733638849286e-34,
        0.015416375361382961,
        -0.012189505621790886,
        0.017513982951641083,
        0.08940693736076355,
        0.035913798958063126,
        -0.08415117114782333,
        -0.001985464710742235,
        0.016781285405158997,
        -0.006635467987507582,
        0.030415739864110947,
        0.0070882998406887054,
        0.013085092417895794,
        -0.05544726178050041,
        0.04295487329363823,
        0.007949074730277061,
        -0.07628053426742554,
        -0.06323954463005066,
        -0.008717827498912811,
        -0.029897751286625862,
        -0.02112625725567341,
        0.030818920582532883,
        -0.013665376231074333,
        -0.0042549800127744675,
        0.0030964743345975876,
        0.0422227717936039,
        0.04972144216299057,
        0.039668865501880646,
        -0.0859411358833313,
        0.09838718920946121,
        0.03051627241075039,
        -0.137259379029274,
        0.039901252835989,
        -0.055504798889160156,
        -0.06122094765305519,
        0.006405819673091173,
        0.018729528412222862,
        -0.04739007726311684,
        -0.06852973252534866,
        0.0017722916090860963,
        0.0014420435763895512,
        -0.08544864505529404,
        0.001374931656755507,
        -0.01983633078634739,
        -0.09636778384447098,
        -0.08959915488958359,
        -0.02298785373568535,
        -0.016560163348913193,
        -0.0020236242562532425,
        0.008355854079127312,
        0.016421617940068245,
        -0.07180290669202805,
        0.026319734752178192,
        0.08015303313732147,
        -0.0526830293238163,
        0.04205615073442459,
        -0.051609404385089874,
        0.020734714344143867,
        0.027659429237246513,
        0.008430661633610725,
        0.038947004824876785,
        0.0327322743833065,
        0.033195629715919495,
        -0.0208764486014843,
        0.02901465818285942,
        -0.015552319586277008,
        0.09849657863378525,
        -0.03234574571251869,
        0.04623536765575409,
        0.08480464667081833,
        0.06510445475578308,
        -0.0016857129521667957,
        -0.01797076314687729,
        -0.03144432231783867,
        -0.02255534566938877,
        -0.06748329102993011,
        0.05294479802250862,
        -0.03944777324795723,
        -0.05194864049553871,
        -0.04322422668337822,
        0.023150602355599403,
        -0.06197669357061386,
        0.049762871116399765,
        -0.09281963855028152,
        -0.02670263685286045,
        -0.04929827153682709,
        -0.07557421922683716,
        -0.0109358299523592,
        -0.04677818715572357,
        -0.023558637127280235,
        0.013173138722777367,
        -0.08129053562879562,
        0.04329489544034004,
        -0.06193908676505089,
        0.016571735963225365,
        -0.15515005588531494,
        -4.234470810339649e-33,
        -0.022475555539131165,
        0.02455689013004303,
        -0.045413631945848465,
        0.04270261526107788,
        -0.023380978032946587,
        -0.007140882778912783,
        0.018926097080111504,
        0.04300328344106674,
        0.027448121458292007,
        -0.015991846099495888,
        -0.009220895357429981,
        -0.0009618281037546694,
        -0.0696028620004654,
        -0.04088904336094856,
        -0.01441794354468584,
        0.011995957233011723,
        -0.08572946488857269,
        -0.04191771149635315,
        0.03748520091176033,
        0.04093760997056961,
        0.08323216438293457,
        0.01010923646390438,
        -0.07258626073598862,
        -0.03128458186984062,
        -0.004063193686306477,
        0.0056315818801522255,
        -0.0027834430802613497,
        0.10265489667654037,
        -0.0016621049726381898,
        -0.04253578186035156,
        0.05692429840564728,
        -0.059440430253744125,
        -0.08702675253152847,
        -0.0006721579120494425,
        0.04024231806397438,
        0.063209168612957,
        0.023847166448831558,
        -0.081341952085495,
        -0.06036623567342758,
        0.025861212983727455,
        0.06816665828227997,
        -0.022177323698997498,
        -0.0667482316493988,
        -0.028949452564120293,
        -0.005008380394428968,
        -0.0034033735282719135,
        -0.09339862316846848,
        0.08867984265089035,
        -0.018086183816194534,
        -0.026501018553972244,
        0.035255808383226395,
        -0.012288282625377178,
        -0.016180451959371567,
        -0.10108686238527298,
        -0.13107670843601227,
        -0.033550359308719635,
        0.030913863331079483,
        0.008777592331171036,
        0.008448117412626743,
        0.016824955120682716,
        -0.019919563084840775,
        -0.012078979052603245,
        0.021922964602708817,
        -0.05317229777574539,
        -0.0908721387386322,
        -0.0036746705882251263,
        0.042407289147377014,
        -6.583490903722122e-05,
        -0.01173416804522276,
        -0.021648338064551353,
        0.040660642087459564,
        -0.024196622893214226,
        -0.02879396080970764,
        -0.0012197052128612995,
        0.013296747580170631,
        0.038447894155979156,
        0.05760882794857025,
        -0.04756053909659386,
        0.0004723998426925391,
        -0.0674496740102768,
        0.051658086478710175,
        0.0103994095697999,
        0.09865294396877289,
        0.041005149483680725,
        0.07461386173963547,
        0.1563013643026352,
        0.005352213978767395,
        0.05429984629154205,
        -0.03909687325358391,
        0.104232057929039,
        -0.005583352874964476,
        0.011977988295257092,
        -0.054993730038404465,
        0.03396378830075264,
        -0.14392699301242828,
        -6.06249059842412e-08,
        -0.05534933879971504,
        -0.0020108302123844624,
        0.04361053183674812,
        -0.0008237531874328852,
        0.03420595824718475,
        -0.010912805795669556,
        -0.028234556317329407,
        0.006089054048061371,
        -0.028069637715816498,
        -0.006688008084893227,
        0.054558563977479935,
        -0.06227938085794449,
        -0.04742118716239929,
        0.04410357400774956,
        0.12029390037059784,
        0.03409556671977043,
        -0.0798264592885971,
        0.027412181720137596,
        -0.02150825411081314,
        -0.023891527205705643,
        0.08685525506734848,
        0.011096203699707985,
        -0.04851802438497543,
        0.017153026536107063,
        -0.009477213956415653,
        -0.0242465827614069,
        -0.024845944717526436,
        0.018256135284900665,
        -0.10572503507137299,
        0.058081261813640594,
        -0.03972822427749634,
        0.06857925653457642,
        -0.005078769288957119,
        -0.02040679194033146,
        0.05470917001366615,
        -0.011676223017275333,
        -0.0007322811870835721,
        -0.07582047581672668,
        0.00145583669655025,
        0.031204387545585632,
        -0.07768560945987701,
        -0.011725345626473427,
        -0.009222239255905151,
        -0.024148214608430862,
        0.041312478482723236,
        -0.027016781270503998,
        -0.05571931600570679,
        -0.07566428184509277,
        -0.03734464570879936,
        0.03495001420378685,
        -0.07703408598899841,
        -0.030549556016921997,
        0.031236637383699417,
        0.09191790223121643,
        0.08985760807991028,
        0.036833301186561584,
        -0.0008708809618838131,
        -0.026788679882884026,
        0.0033082265872508287,
        0.006416477728635073,
        0.05958995968103409,
        0.0706985592842102,
        -0.031324680894613266,
        -0.01338594127446413
    ]
}