{
    "id": "PpvRnmJQptk",
    "title": "Samsung Galaxy Unpacked 2022 in 9 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-08-10T14:23:31Z",
    "video_url": "https://www.youtube.com/watch?v=PpvRnmJQptk",
    "category": "Science & Technology",
    "tags": [
        "samsung unpacked",
        "samsung unpacked 2022",
        "galaxy unpacked",
        "z fold 4",
        "z flip 4",
        "galaxy watch 5 pro",
        "galaxy buds 2 pro",
        "buds 2 pro",
        "samsung",
        "unpacked",
        "samsung galaxy",
        "samsung event",
        "galaxy",
        "galaxy watch 5",
        "samsung galaxy unpacked",
        "samsung unpacked event",
        "galaxy unpacked 2022",
        "samsung watch 5",
        "galaxy z flip 4",
        "galaxy z flip 4 release date",
        "tech",
        "samsung supercut"
    ],
    "views": 300094,
    "likes": 5089,
    "comments_count": 382,
    "description": "Samsung held its Galaxy Unpacked event today, where it unveiled its new foldables, earbuds, and watches. We got a look at the new Galaxy Z Fold 4 and Z Flip 4, an all-new Galaxy Watch 5 Pro, and Buds 2 Pro. Here are the biggest things we saw today.  Read more:   0:00 Galaxy Z Flip 4 2:12 Galaxy Buds 2 Pro 3:59 Galaxy Watch 5 5:07 Galaxy Watch 5 Pro 6:38 Galaxy Z Fold 4  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3BW28CE",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Hello, thank you for joining us. - We wanted you to be able to imagine something different, an entirely new way to think about your smartphone. - With the Galaxy Z Flip4 it's like having a camera and a tripod all in one. The camera comes with brighter sensors and more powerful NPU than previous models. That combined with the pixel size increased from 1.4 to 1.8 microns, helps you capture more vivid and detailed photos. And with OIS and VDIS, it's easy to capture stable nighttime videos too. With the Galaxy Z Flip4 the powerful back camera becomes your selfie camera when you flip it closed. And you can see exactly how your shot will turn out right on your cover screen. You can discreetly check notifications on your Flips cover screen. I can check and reply to new messages, or if I forgot to turn my lights off at home I can do it remotely through SmartThings. (light clicking off) All without opening my phone. My cover screen even makes it easy to pay for a cup of coffee. (phone beeps) You can customize the cover screen with your favorite clock, GIFS, or even videos. It has more solid modeling, a smaller hinge, and bolder camera housing compared to previous models. And it has an aesthetic contrast between the matte back glass and the glossier metal frame. The all new Galaxy Z Flip4 comes in four matte finish shades, Graphite, Pink Gold, Blue, and our favorite, Bora Purple. The Galaxy Z Flip4 comes with an armor aluminum frame. The cover screen has our strongest glass, and the main display has an improved ultra thin glass. And of course, our phones are still the world's only water resistant foldables with an IPX8 rating. We made the hinge slimmer too, which made space for that improved battery, giving you a longer charge, which you'll need because we use our smartphones every day in so many ways. Galaxy Z Flip4 Bespoke Edition brings you more options, giving you greater opportunities to customize your smartphone to your liking. With five body colors and three frame colors, mix and match for a combination that captures your exact personality and iconic style. - The Galaxy Z Flip4 will be available for $999 starting on August 26th. (upbeat music) - Today, we're setting new standards for sound. (upbeat music) Our Hi-Fi 24-bit audio unfolds layers of details with a high dynamic range. When we're using wireless earbuds, we usually connect them through Bluetooth, which can deliver up to 16-bit sound. But for a truly revolutionary sound experience you need 24-bit audio. (upbeat music) It's an experience that is 256 times more precise and detailed. We developed the Samsung seamless codec to enable the sound to be transferred in its original full quality, wirelessly. And the new coaxial 2-way speaker makes those sounds clearer and richer than ever. The 360 audio algorithm processes sound signals with directional filters. So you can listen to sound that feels like it's coming through multi-channel speakers. (race car engine revving) Their expanded active noise cancellation is now more powerful than ever. And what's really convenient is that if I need to chat with someone, my Buds2 Pro recognize when I start talking and adjust their sound automatically. When I'm calling on my Galaxy Buds2 Pro my friends can hear me clearly, even over background noise, all through personalized beamforming. And later this year, we're bringing LE audio to the Galaxy Buds2 Pro. It will let you record more realistic 360 sound. And for game changing comfort the Galaxy Buds2 Pro have been redesigned with a new size and fit. And if you misplace your Buds2 Pro, SmartThings Find now makes locating your lost Buds easy, whether they're inside their case or not. Buds2 Pro can pair easily with your Galaxy devices. And if a friend calls, your Galaxy Buds2 Pro will easily switch over to your phone. - Buds2 Pro will be available for $229. (dramatic music) - The new Galaxy Watch5 comes in two sizes and four colors. And for the first time in our wearables, the Galaxy Watch5 series is equipped with sapphire crystal. Our Galaxy Watch5 also has an advanced workout algorithm that helps you track many different workouts. One of the best parts of our Galaxy watches is the sleep tracking technology. It helps me monitor different stages of sleep, detecting snoring and even tracking my blood oxygen levels and heart rate. The Galaxy Watch5 has an increased surface area, which makes more contact with your wrist helping it provide more accurate readings. It also comes with our Advanced BioActive Sensor, which combines three sensors into one. It's smaller design delivers enhanced performance. Powered by a single chip, it can track your heart rate, body composition, sleep, and more. And today, we're excited to introduce the addition of an all new temperature sensor to our Galaxy Watch5. - The Galaxy Watch5 comes with an all new infrared temperature sensor. And Galaxy Watch5 will be available from $279. - And today, we're excited to continue growing the wearable space with our most high tech Galaxy Watch yet. Introducing, the Galaxy Watch5 Pro. From what time the sun is gonna set so you're not hiking after dark, to a compass that keeps you hiking in the right direction. These watch faces can help you explore remote terrains. The Galaxy Watch5 Pro has an all new route workout experience, which provides turn-by-turn directions- (watch beeping) - [GPS woman] In 30 meters turn right. - through voice and vibrations, so you can stay focused on the scenery and not on your wrist. Best of all, friends or your workout groups can sync GPX format file routes from Samsung Health, and try the same trail, marathon, or cycling courses as you. The new track back function on Galaxy Watch5 Pro helps you get safely back to your starting point with more ease than ever. Your Galaxy Watch5 Pro has a large battery, so you can focus on adventuring while your wearable covers the rest. With its sapphire crystal display, two times harder than the display of Galaxy Watch4. It's strong titanium frame provides additional protection. Galaxy Watch5 Pro comes in two sophisticated colors, Black Titanium and Gray Titanium. And depending on the occasion, the new D-Buckle band can work with a stylish or a sporty look. The Galaxy Watch5 Pro will be available on August the 26th from $449. (dramatic music) With a slimmer hinge, it's design feels more balanced. Thinner bezels make room for a wider cover display without increasing overall width. When unfolded, that wider area and those slimmer bezels provide an incredibly immersive viewing experience on the main display. We improved the under display camera on our Galaxy Z Fold4 so you can more fully engage with it all. Our new UDC subpixel arrangement is scatter tight, that makes the pattern on your display even less visible so your favorite content is easier to see. Underneath this immersive display we're bringing you an improved under display camera with advanced image processing technology. We're bringing you the best of One UI 4 and Android 12L, which are most notable on our new Taskbar. - I have my most used apps pinned on the bottom of my home screen. These, as well as my most recently used apps, automatically sync with the Taskbar. Word and Excel have improved layouts within the Microsoft Office app, and work well side by side, which lets me do this. I can write, draw, or even sign things right in my email using the S Pen. This phone comes with a 10 megapixel tele lens with three times optical zoom and a 50 megapixel wide lens. Nightography is also next level with a larger sensor that lets in more light. We've also upgraded Space Zoom. So now you can see what you're shooting without losing track of what you're zooming in on. It has our most advanced chip set. A Qualcomm processor that delivers improvements in CPU, NPU, and GPU. - It's available from August the 26th in select countries starting at $1,799. Pre-orders start today. And if you pre-order, you'll receive a complimentary year of Samsung Care+. - Today, life opens up with a Galaxy. (upbeat music)",
    "transcript_keywords": [
        "Galaxy",
        "Pro",
        "cover screen",
        "display",
        "sound",
        "camera",
        "cover",
        "screen",
        "Galaxy Watch",
        "Today",
        "makes",
        "improved",
        "Sensor",
        "display camera",
        "advanced",
        "Galaxy devices",
        "August",
        "Galaxy watches",
        "Flips cover screen",
        "back"
    ],
    "transcript_entity_values": [
        "Buds2 Pro",
        "Today",
        "Galaxy Watch5 Pro",
        "The Galaxy Watch5 Pro",
        "Black Titanium",
        "four",
        "1,799",
        "999",
        "GPU",
        "Bora Purple",
        "three",
        "a complimentary year",
        "August 26th",
        "today",
        "Space Zoom",
        "The Galaxy Watch5",
        "Galaxy Z Fold4",
        "SmartThings",
        "2",
        "August the 26th",
        "Galaxy Buds2 Pro",
        "the Galaxy Buds2 Pro",
        "CPU",
        "Excel",
        "Qualcomm",
        "Buds",
        "GIFS",
        "1.4 to 1.8 microns",
        "Samsung",
        "NPU",
        "two",
        "Galaxy",
        "279",
        "UDC",
        "449",
        "256",
        "24",
        "One",
        "Galaxy Watch",
        "Advanced BioActive Sensor",
        "the Galaxy Watch5 Pro",
        "D-Buckle",
        "Samsung Health",
        "Bluetooth",
        "five",
        "later this year",
        "the Microsoft Office",
        "10 megapixel",
        "Galaxy Watch4",
        "Graphite, Pink Gold",
        "30 meters",
        "first",
        "UI 4",
        "the S Pen",
        "50 megapixel",
        "Galaxy",
        "Galaxy Z Flip4",
        "16",
        "229",
        "IPX8",
        "Galaxy Z Flip4 Bespoke Edition"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "LOC",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "LOC",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT"
    ],
    "vector": [
        -0.13186538219451904,
        0.010310814715921879,
        0.07296951115131378,
        -0.029965868219733238,
        0.06811615824699402,
        -0.038955122232437134,
        -0.01537434384226799,
        0.09173572063446045,
        0.01030433177947998,
        0.017997950315475464,
        0.02548249438405037,
        0.03397127985954285,
        -0.0042830538004636765,
        0.02460809238255024,
        0.012488218024373055,
        -0.02971998043358326,
        0.040190190076828,
        -0.08590256422758102,
        -0.06597821414470673,
        0.030406126752495766,
        0.028809692710638046,
        -0.04619869589805603,
        0.06713952124118805,
        -0.026743389666080475,
        0.01612413115799427,
        0.021470872685313225,
        -0.04393622651696205,
        -0.0428679920732975,
        0.02312648482620716,
        -0.008750112727284431,
        0.03996453434228897,
        0.17520418763160706,
        0.009129186160862446,
        0.002744972938671708,
        -0.04060916602611542,
        -0.10150423645973206,
        0.06775359064340591,
        -0.013957076705992222,
        -0.01922592893242836,
        -0.009031161665916443,
        0.01755235344171524,
        0.029376639053225517,
        0.016036195680499077,
        -0.012164548970758915,
        0.053888093680143356,
        -0.009008643217384815,
        0.02340015210211277,
        -0.03489056974649429,
        0.0018359781242907047,
        -0.013909934088587761,
        -0.031544774770736694,
        -0.023370247334241867,
        -0.03787491098046303,
        -0.011199302040040493,
        -0.03086072765290737,
        0.07537803053855896,
        -0.029477553442120552,
        -0.010583179071545601,
        0.03742080554366112,
        0.04541005939245224,
        0.09228995442390442,
        -0.06963818520307541,
        -0.03256317973136902,
        0.04525599628686905,
        -0.008048927411437035,
        0.05030709505081177,
        -0.010261546820402145,
        -0.05441889539361,
        0.019367456436157227,
        -0.022396793588995934,
        -0.09699379652738571,
        0.05466340854763985,
        0.04666845127940178,
        -0.023983526974916458,
        0.008876676671206951,
        -0.0033288621343672276,
        0.08560854941606522,
        -0.07019910961389542,
        -0.038349974900484085,
        -0.04374678432941437,
        -0.0029624467715620995,
        -0.07374422997236252,
        -0.0506608672440052,
        0.00861251913011074,
        0.029971040785312653,
        -0.03297152742743492,
        0.025199223309755325,
        0.030175505205988884,
        -0.05539686605334282,
        -0.046216290444135666,
        -0.008111408911645412,
        0.09170442074537277,
        -0.06614556908607483,
        -0.0019423094345256686,
        -0.03057331219315529,
        0.0075606401078403,
        -0.06995858997106552,
        -0.029010161757469177,
        0.05555329844355583,
        0.0385994054377079,
        0.09720385074615479,
        0.013157716020941734,
        0.09245806932449341,
        -0.001855093170888722,
        0.03501279279589653,
        -0.05490431934595108,
        0.05203068628907204,
        0.009739975444972515,
        -0.05239726975560188,
        0.10826287418603897,
        0.030253848060965538,
        0.03341956064105034,
        0.0017751575214788318,
        -0.014594800770282745,
        -0.05563373491168022,
        0.030638400465250015,
        -0.06206794083118439,
        0.10964574664831161,
        0.027071690186858177,
        0.014841926284134388,
        0.001491542556323111,
        0.045255374163389206,
        -0.05136563628911972,
        -0.14185301959514618,
        -0.012591639533638954,
        0.06860875338315964,
        -0.07472401112318039,
        6.409189725974606e-33,
        0.000771986145991832,
        0.08558617532253265,
        -0.04753012955188751,
        0.04333162307739258,
        0.019048364832997322,
        0.07976432889699936,
        -0.03501416742801666,
        0.022694120183587074,
        -0.01787833496928215,
        0.03922826424241066,
        -0.033947285264730453,
        0.0025469043757766485,
        -0.0325486995279789,
        0.038823023438453674,
        0.006011965684592724,
        -0.09483371675014496,
        -0.05098571255803108,
        -0.01955532096326351,
        -0.03938538581132889,
        -0.016033606603741646,
        0.03122383914887905,
        -0.01623508147895336,
        -0.0008552461513318121,
        -0.00012518547009676695,
        0.06884633004665375,
        0.052165690809488297,
        0.08248555660247803,
        -0.03423973545432091,
        0.029820458963513374,
        0.004583343863487244,
        -0.09680428355932236,
        -0.01540957298129797,
        0.023183194920420647,
        -0.09770543873310089,
        0.06639763712882996,
        -0.002123400801792741,
        0.02155473455786705,
        -0.04753187298774719,
        0.009866009466350079,
        -0.06630582362413406,
        -0.011186342686414719,
        0.040449485182762146,
        -0.092371866106987,
        -0.015231393277645111,
        -0.01801653578877449,
        0.03412211686372757,
        0.01812351681292057,
        0.01361726876348257,
        -0.0030421316623687744,
        -0.013227677904069424,
        0.016184208914637566,
        -0.041303787380456924,
        -0.06974488496780396,
        -0.05123325437307358,
        -0.0534110888838768,
        -0.033289097249507904,
        0.017359698191285133,
        -0.0402853861451149,
        0.012364866212010384,
        0.023281004279851913,
        0.00872865878045559,
        0.05569888651371002,
        -0.08562443405389786,
        0.032951388508081436,
        -0.03363332152366638,
        0.07206296175718307,
        0.05412887781858444,
        -0.0071419780142605305,
        -0.09927256405353546,
        0.04243146628141403,
        -0.009108539670705795,
        0.006422323174774647,
        0.02369127795100212,
        0.008183136582374573,
        0.03662613406777382,
        0.024357769638299942,
        0.003978207241743803,
        -0.025777311995625496,
        0.031507376581430435,
        -0.010563917458057404,
        -0.07228630036115646,
        0.003117975080385804,
        0.08659377694129944,
        -0.010084090754389763,
        -0.012903198599815369,
        -0.04702237248420715,
        0.00273853144608438,
        -0.0634036436676979,
        0.032577548176050186,
        -0.03736330568790436,
        0.008191565051674843,
        -0.02269424870610237,
        0.038019854575395584,
        -0.04668257385492325,
        -0.08346022665500641,
        -6.1135444478771544e-33,
        -0.04589523375034332,
        0.02778824046254158,
        -0.018768055364489555,
        0.013129469938576221,
        0.00882510095834732,
        -0.04393946751952171,
        0.07452338188886642,
        0.05633016675710678,
        -0.01637181080877781,
        -0.055016182363033295,
        0.04260960966348648,
        0.017322227358818054,
        0.014257649891078472,
        0.007890118286013603,
        0.0076026092283427715,
        -0.006093895528465509,
        0.042004212737083435,
        -0.09731937944889069,
        0.005982211325317621,
        0.012119720689952374,
        0.09768427908420563,
        0.03149210661649704,
        0.0020488763693720102,
        0.013418063521385193,
        0.012172484770417213,
        0.06850668042898178,
        0.09910663962364197,
        0.041427697986364365,
        0.08501356840133667,
        -0.02889973483979702,
        0.009732569567859173,
        -0.08308207243680954,
        -0.013623377308249474,
        0.022117402404546738,
        0.029360514134168625,
        0.03977925702929497,
        0.0062100645154714584,
        -0.04301518201828003,
        -0.016705451533198357,
        -0.05767817050218582,
        -0.03230065107345581,
        0.027279764413833618,
        0.02192501723766327,
        -0.020047461614012718,
        0.020881954580545425,
        -0.04694877564907074,
        -0.034881290048360825,
        0.1104421466588974,
        -0.0494072325527668,
        -0.022174203768372536,
        -0.007874377071857452,
        0.0520302914083004,
        -0.04838382080197334,
        -0.07191918045282364,
        -0.05135582014918327,
        0.03144421800971031,
        0.03006996214389801,
        -0.04205760359764099,
        0.041463445872068405,
        -0.003235198324546218,
        0.07448720932006836,
        -0.057601723819971085,
        -0.05946296080946922,
        -0.08772296458482742,
        -0.03248591348528862,
        0.053169168531894684,
        0.09229011833667755,
        -0.023714497685432434,
        -0.017832977697253227,
        0.01917002722620964,
        -0.029505260288715363,
        -0.0011652075918391347,
        -0.033742066472768784,
        -0.16292569041252136,
        -0.00903625413775444,
        0.1170259639620781,
        -0.08111540973186493,
        -0.010784830898046494,
        -0.0007272003567777574,
        -0.0470244400203228,
        -0.048966292291879654,
        0.00011122412252007052,
        0.08490241318941116,
        0.03580018877983093,
        0.052762873470783234,
        0.009840074926614761,
        -0.03632088378071785,
        0.035252295434474945,
        0.04970656335353851,
        0.039749253541231155,
        -0.07975257933139801,
        0.016705773770809174,
        -0.059449393302202225,
        0.1374845951795578,
        0.02139931544661522,
        -5.76341037117345e-08,
        3.647791163530201e-05,
        0.061384886503219604,
        0.038640767335891724,
        -0.021719319745898247,
        -0.011343401856720448,
        -0.07292160391807556,
        -0.0328097864985466,
        -0.022367360070347786,
        0.10350345820188522,
        -0.006894128397107124,
        0.015494590625166893,
        -0.06776729971170425,
        -0.12870047986507416,
        0.07182048261165619,
        0.08120941370725632,
        0.07671314477920532,
        -0.0789465457201004,
        0.030053235590457916,
        -0.01695523038506508,
        -0.015257485210895538,
        0.039267562329769135,
        0.011764966882765293,
        -0.00782785750925541,
        -0.032656364142894745,
        0.05871282145380974,
        -0.0046813003718853,
        -0.08001097291707993,
        0.03916361182928085,
        0.06521762162446976,
        -0.06733474880456924,
        2.7843358111567795e-05,
        0.023462966084480286,
        -0.0049445671029388905,
        -0.05349269509315491,
        -0.053374167531728745,
        -0.07374364137649536,
        -0.027210157364606857,
        -0.02059907279908657,
        0.11688898503780365,
        0.06349948048591614,
        0.020917458459734917,
        -0.05497249588370323,
        -0.003789636306464672,
        0.07476644963026047,
        -0.0779925212264061,
        -0.16166430711746216,
        0.08962500095367432,
        -0.08138801902532578,
        0.008010884746909142,
        0.04258348420262337,
        -0.06729280203580856,
        -0.05650778114795685,
        -0.055455271154642105,
        0.022020457312464714,
        0.07339257001876831,
        0.051032211631536484,
        0.03303152695298195,
        0.006413556169718504,
        -0.06527817249298096,
        0.03887255862355232,
        -0.006223554257303476,
        -0.06524922698736191,
        -0.07416067272424698,
        0.07331299781799316
    ]
}