{
    "id": "PqRVo2niA_8",
    "title": "Hack WiFi with a Raspberry Pi and Kali Linux",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-02-11T15:00:14Z",
    "video_url": "https://www.youtube.com/watch?v=PqRVo2niA_8",
    "category": "Science & Technology",
    "tags": [
        "kali linux",
        "raspberry pi",
        "wifi hacking",
        "hack wifi",
        "hack wifi password",
        "raspberry pi 4",
        "wifite kali linux",
        "kali linux tutorial",
        "kali linux install",
        "how to",
        "wi-fi hacking",
        "ethical hacking tutorial",
        "kali linux for beginners 2021",
        "kali linux raspberry pi 4",
        "raspberry pi 4 projects",
        "how to hack wifi password",
        "wifi",
        "how to hack",
        "ethical hacking",
        "hacking wifi",
        "hacking wi-fi",
        "raspberry pi 3",
        "network adapter",
        "kali linux tutorial for beginners",
        "kali linux hacking tutorials",
        "kali"
    ],
    "views": 411917,
    "likes": 13142,
    "comments_count": 309,
    "description": "Learn how you can learn to hack WiFi networks using a Raspberry Pi 4 model B running Kali Linux!   // MENU // 0:00  Introduction 0:23  Raspberry Pi OpenFlow Switch 0:36  Raspberry Pi 4 Model supports wifi monitor mode 2:11  Download software (Kali Linux and Pi Imager) 3:33  Install Kali Linux on Raspberry Pi 5:28  Boot Kali Linux on Raspberry Pi 7:22  Login into Kali Linux 7:53  Use Fern to attack WiFi networks 9:55  Use Wifite to attack WiFi networks  // PDF Instructions // Raspberry Pi Kali Linux PDF:   // PREVIOUS VIDEOS // Brute force Wifi WPA2 with GPU:  Wifite Kali Linux:  Fern WiFi Kali Linux:  Raspberry Pi OpenFlow switch video 1:  Raspberry Pi OpenFlow switch video 2:   // MY STUFF //   // SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  wifi raspberry pi raspberry pi 4 raspberry pi 4 model b raspberry pi wifi raspberry pi kali linux kali linux raspberry pi 4 kali linux kali linux raspberry pi kali linux wifi fern fern wifi wifite wifite wifi fern kali linux wifite kali linux fern raspberry pi fern wifi raspberry pi wifite raspberry pi ethical hacking kali linux hacking kali linux wifi wifi wpa2 wpa2 wifi  #wifi #raspberrypi #kalilinux",
    "description_links": [
        "https://davidbombal.wiki/kalilinuxpi",
        "https://youtu.be/J8A8rKFZW-M",
        "https://youtu.be/TDVM-BUChpY",
        "https://youtu.be/Ezy1KTNF6dw",
        "https://youtu.be/-G_gPet7evY",
        "https://youtu.be/YJDXb31UwPI",
        "https://www.amazon.com/shop/davidbombal",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- In this video, I'm gonna show you how to install Kali or Kali Linux, if you prefer, on a Raspberry Pi. (rock music) In previous videos, which I created a long time ago, 2016, I showed you how to turn a Raspberry Pi such as this into an OpenFlow switch. So basically take a device like this and make it a switch. But in this video, once again, I'm gonna show you how to install Kali on a Raspberry Pi. What's fantastic about this Raspberry Pi which is a Raspberry Pi four Model B is that the wifi adapter built into the Raspberry Pi supports monitor mode. So I can use one of these Raspberry Pi's to capture packets off the wifi network and use tools within Kali to attack or hack wifi networks. So I'll show you two examples of applications that you can use to get started with a Raspberry Pi. Those two applications can built into Kali phone as well as wifi. Great way to start learning ethical hacking if you wanna attack wifi networks. Now, as always what I'm demonstrating in this video is for ethical hacking purposes only. Don't use the information here to go and attack networks that you don't have permission to attack. Use the information ethically, don't get into trouble. Now the Raspberry Pi's require a micro SD card. It needs to be at least 16 gig in size. What I'll do is install Kali on this SD card, insert it into the Raspberry pie and boot it up and show you how you can start learning ethical hacking, learning wifi, using a Raspberry Pi. I've got a whole bunch of Raspberry Pis here, but for this demonstration, I'm gonna be using a Raspberry Pi four Model B. Now, before we continue, if you enjoy these types of ethical hacking videos, please like this video. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. That really does help me with the YouTube algorithm. And it also helps you learn lots of ethical hacking content. Okay, so without further ado, let's get started. In this example, I'm running Windows 11 on this laptop but you could use Windows 10 as an example or Linux or a Mac, if you prefer. To make it easier for you, I've created a PDF that shows you all the steps to get this working. It shows you the Raspberry Pi that we're using. In this case, I've got a four gig Raspberry Pi. Eight gig would have better performance but four gig is fine. It shows you where to get the software as an example. So the first place you need to go is to the Kali website and we are gonna click get Kali to get the Kali operating system. In our example, we need to get the, the arm version of Kelly because we are running this on a Raspberry Pi. In this case it's for the Raspberry PI four 64 bit. So I'll save that to my downloads directory. It's about two gig in size. We also need to get the Raspberry Pi software. So you can get that from raspberrypi.com/software. And what we are gonna do in this example is download the Raspberry Pi imager for Windows. You could use this on a Mac as well, as well as a Ubuntu. But in this example, I'll install this on a Windows computer. So I'll download that software. I'll double click on the imager. I'll click, yes, to install it. Very simple installation, basically click install and the software is installed. I'll keep this checked and click finish to run the imager. So what we need to do now is choose the operating system as well as the storage that we're gonna use. So in my example, I've got this microSD card. I'll put it in here and then insert it into the laptop. So the storage that I'm gonna use is that microSD card. The next thing I need to do is choose the operating system. So I'm gonna click choose OS. You could install Raspberry Pi, you can install other software but I'm gonna go all the way to the bottom and select use custom. And then I need to select the Kali installation software but I'll use my previously downloaded version. Click open. Now you can change various options here, such as setting the host name, enabling SSH, configuring wifi and various other options. I'm not gonna use those options. I'm simply gonna write this to the SD card. Now we told that the card will be erased. Do we wanna continue? And the answer is yes. It starts preparing to write the image and then writes it. This is the time to go and get a coffee while that writes to the SD card. You simply need a wait now for that to complete. (rock music) okay, software is now being verified. Just like the ticking of time (rock music) And there you go. We told that the image has been written successfully. We can now remove the SD card from the reader. So I'll close the software and I'll eject the SD card. Okay, so I can remove the SD card. Now we finished with the Windows laptop. Now we can take the SD card and insert it into the Raspberry Pi. So I'll insert it over here. Okay and there you go. So we ready to plug this in. Now we need some power. I'm using the official Raspberry Pi power supply. So I can use that and plug it in to the Raspberry Pi and power it up. I've actually got one already installed here. So here we go. I could plug that in. Before I plug that in, I'm gonna plug in a HDMI cable. Now this uses a micro HDMMI. So I've got a converter converting the HDMMI output from this monitor to micro HDMI. So I'll plug that in. What I'll also do which is not required is plug ethernet in. So I'll plug in an ethernet cable here. So I've got ethernet connected to the Raspberry Pi as well as HDMI. I need to plug in a keyboard. So what I'll do is unplug my keyboard from my Mac and plug it into the Raspberry Pi. That will in this case give me keyboard as well as mouse. So this is actually plug into the monitor but you could plug in your keyboard and mouse separately. Now, before I power it on, what I'm gonna do is change this monitor to have multiple inputs. So I've got the Mac on the right hand side and I'll have the Raspberry Pi on the left hand side. I'll just put a camera here so that we can see what it does when it boots up. What I'll do now is plug that in. So plug the power supply into the Raspberry Pi. Hopefully, what we should see is we should see something happen on the screen. And there you go. You can see that it's booting up. You can see that Kali is starting to boot. You just need a wait now for that to boot up. It will take a while to boot up. So just give it some time to do its initial boot. First boot takes a while. Okay and there you go. We've got a Kali login prompt, takes a while but we can log into Kali. Okay, so default login is Kali or Kali. If you prefer default password is the same. So Kali, I'm gonna log into the Raspberry Pi, which is running Kali. And there you go. I've logged in successfully. Now Kali's installed and running on this Raspberry Pi. I could do a lot of the tasks that I could do on a computer. So as an example, I'll open up a terminal. I'll ping google.com from the Raspberry Pi. And there you go. That works. I could, as an example, also open up phone which is a wifi cracker. I need to run this with root privileges. So I need to put my password in, phone is starting up. And what this allows me to do is to do basic wifi cracking. So as an example, I'll say no to download the premium version, I'll select an interface, which is WLAN zero. That's an interface that's built into the Raspberry Pi. In my example, I'm using two interfaces. I've got an ethernet interface as well as a wifi interface. But what I'll do here is select the wifi interface and then click scan for access points to scan for access points in the vicinity. Now, if that works properly, I'll be able to see WEP or WPA networks. And this example, it's already detected eight wifi network. So there they are. As an example, I'll select one of the wifi networks which is this one, that's a real wifi network in my environment. And I could attack that. Now to do the attack, you need a word list. So in this example, I'll go to user share Dict, which is one of the dictionaries available in Kali and select wordless, probable that will then try and attack that wifi now network using passwords in that dictionary. Now that won't work in my example because I'm using a very good password but if someone was using a bad wifi password you could crack that wifi password using this word list. You could also use the rockyou wordlist to crack the wifi network. I have a look at other videos, which I've linked below on my channel, where I show you different options when cracking wifi networks. This is a very basic program that allows you to learn the basics of wifi cracking. It will try and deauthenticate a client and then launch the attack against the client. So I'll stop that for the moment because it's not gonna work 'cause my wifi network is properly configured. Okay, so that's one application that you could use. Another one that I prefer is wifite. So I'll open up a terminal and then I'll type sudo wifite to run wifite. What you'll notice here is that the interfaces already in monitor mode, one of the problems with a lot of wifi interfaces is they don't support monitor and injection mode but this Raspberry Pi does which is fantastic. So what I'll do is press control C and then I could attack a wifi network. In this example, I'll attack my wifi 123 which is this little wifi router here. I'm only attacking my own networks. I'm not attacking other people's networks and neither should you. So what I'll do is I'll specify two here because that's the network that we want to attack. And then what it's gonna try and do is launch an attack against that wifi network. What I'll do in this example is on my phone connect it to that wifi network. So mywifi123 and in Kali I'll control C this to break out the Pixie Dust attack. I'll also break the Null Pin attack. I'll stop the WPS attack. But what you can see here is it's running through various attacks against that wifi network. What it's gonna try and do now is do a WPA handshake capture. So what I'll do is connect the client back to that wifi network. In my tests this has worked well sometimes, but other times not so well, but you may need to use some of the other attacks to try and break up the wifi network or wait for this or do this multiple times to deauthenticate the client to get Kali to capture the handshake and then crack the handshake. So in my test, this kind of worked alright I personally would prefer using a wifi adapter such as this. So this is my favorite Alfa wifi adapter. They're not paying me to say this. It's just one of the adapters that I really like. So if you really wanna get serious about this, an Alfa adapter such as this is really, really good for doing the captures and attacks, but you can learn about wifi attacks using the Raspberry Pi. In my test, once again, sometimes it works well, sometimes not so well depends on the access point that you're attacking but I'll stop that now. You can see videos below once again where I show you how to do this full attack. But as an example, let's run this once more and see if it does something. This wouldn't work if the adapted in support monitoring mode, which it does. So I'll control C this and let's choose another network. Now, in this example, I'll choose ABC four. In this example, it's already trying to deauth the clients. So on my iPhone, I'll connect to that network. And what it's done now is capture the handshake already. So it's already captured the handshake. It's gonna try and run passwords against the handshake to see if it can crack it. Now, the password on this wifi network is really good. So none of these passwords are gonna work but if I was using a weak password it would've been able to capture that. This is an example of using a word list or a preconfigured list of passwords. None of those passwords that are showing you there are the wifi password on my network. I'm using a much stronger password than that but there's an example of where it managed to capture the handshake from the iPhone to the network, ABC one. And then it started to crack that. If this crack doesn't work, you could use the captured handshake and then use a brute force attack using a GPU. I've shown that in other videos as well and I'll create updated versions of that video. Basically little Raspberry Pi like this can do a whole bunch of stuff. I've shown you this video how to install Kali on the Raspberry Pi. I've shown you how to boot it up. I've shown you how to use the built in wifi network to capture a handshake and then run an attack against it. As you can see here, it's still going, may take a while but I know it's not gonna work because my password is not in this list of passwords. Make sure that you use strong passwords for your wifi networks, but also do not attack networks that you don't own. As always, disclaimer, do not attack any wifi network that you don't own. Now I'm David Bombal. I hope you enjoyed this video. If you did, please like it. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. So I wanna wish you all the very best. (rock music) (static sounds)",
    "transcript_keywords": [
        "Raspberry",
        "wifi",
        "Kali",
        "wifi network",
        "network",
        "attack",
        "install Kali",
        "plug",
        "networks",
        "card",
        "password",
        "install",
        "software",
        "Raspberry Pis",
        "handshake",
        "wifi password",
        "Windows",
        "passwords",
        "click",
        "install Raspberry"
    ],
    "transcript_entity_values": [
        "first",
        "Linux",
        "123",
        "these Raspberry Pi's",
        "SSH",
        "Mac",
        "HDMI",
        "WPA",
        "OpenFlow",
        "HDMMI",
        "a Raspberry Pi",
        "Null Pin",
        "WPS",
        "four",
        "two",
        "Pixie Dust",
        "eight",
        "a Raspberry Pi",
        "micro HDMI",
        "Kelly",
        "Alfa",
        "YouTube",
        "ABC",
        "iPhone",
        "Raspberry Pi",
        "this Raspberry Pi",
        "four 64",
        "Kali",
        "the Raspberry Pi",
        "Mac",
        "Dict",
        "Raspberry Pis",
        "one",
        "Raspberry Pi",
        "GPU",
        "Windows 11",
        "2016",
        "at least 16",
        "SD",
        "PDF",
        "Raspberry",
        "Windows 10",
        "Kali Linux",
        "First",
        "WLAN",
        "Eight",
        "Windows",
        "the Raspberry Pi's",
        "about two",
        "David Bombal",
        "microSD",
        "a Raspberry Pi",
        "this Raspberry Pi",
        "Raspberry Pi",
        "the Raspberry Pi"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "FAC"
    ],
    "vector": [
        -0.05557902902364731,
        -0.011870712973177433,
        -0.014849087223410606,
        -0.018245520070195198,
        0.038825489580631256,
        -0.001296539674513042,
        0.020923718810081482,
        -0.054065145552158356,
        -0.011220966465771198,
        0.04350656270980835,
        0.05915486067533493,
        -0.018534692004323006,
        -0.031059125438332558,
        0.001202573999762535,
        -0.010404144413769245,
        0.007835007272660732,
        -0.006566863972693682,
        -0.026503894478082657,
        -0.03334386646747589,
        -0.08359021693468094,
        -0.01343587413430214,
        -0.04005016013979912,
        0.0747346431016922,
        -0.07996250689029694,
        0.03592890128493309,
        -0.013684336096048355,
        0.05741453915834427,
        0.03875843808054924,
        -0.04897724837064743,
        -0.07030852884054184,
        0.0007831751136109233,
        0.07552289962768555,
        -0.041395388543605804,
        -0.011984089389443398,
        -0.027207138016819954,
        -0.05678205564618111,
        -0.020944587886333466,
        0.07061395049095154,
        0.0231260284781456,
        -0.03990264609456062,
        -0.057315826416015625,
        -0.08631682395935059,
        -0.009604721330106258,
        0.06409914046525955,
        -0.04506218805909157,
        -0.033348448574543,
        -0.078828826546669,
        0.018292460590600967,
        0.03287075459957123,
        -0.08772771060466766,
        -0.03782825171947479,
        -0.009332077577710152,
        0.005960367154330015,
        0.05475528910756111,
        0.009304407984018326,
        -0.07969602942466736,
        -0.00918783713132143,
        0.06224130466580391,
        0.12142438441514969,
        -0.0087272385135293,
        0.04385221004486084,
        -0.0073133111000061035,
        -0.01076398603618145,
        0.04066721722483635,
        -0.04915307089686394,
        -0.03122500330209732,
        0.0005471339100040495,
        0.05219275876879692,
        0.017150258645415306,
        0.0011177422711625695,
        -0.0033595154527574778,
        0.054581835865974426,
        0.013102000579237938,
        -0.010197052732110023,
        0.03631787747144699,
        0.06311289221048355,
        -0.03288363292813301,
        0.005162967834621668,
        -0.014672940596938133,
        0.05912882089614868,
        0.07659410685300827,
        0.043981488794088364,
        0.05538204312324524,
        0.01743692345917225,
        0.02165778912603855,
        0.05338869243860245,
        -0.04794181510806084,
        -0.006171063054352999,
        0.04308629781007767,
        -0.01644437573850155,
        -0.036922916769981384,
        0.12268024682998657,
        -0.004534441977739334,
        0.00580649683251977,
        0.05630655214190483,
        0.002015965059399605,
        -0.04997337982058525,
        -0.014815326780080795,
        -0.09704211354255676,
        0.06465685367584229,
        -0.06930000334978104,
        -0.033621303737163544,
        0.02049749717116356,
        -0.007494601421058178,
        0.02868225798010826,
        -0.000337111676344648,
        0.03059355542063713,
        0.025893593207001686,
        0.02890075370669365,
        0.021612748503684998,
        -0.01062521617859602,
        -0.013472480699419975,
        -0.015541255474090576,
        -0.0800895243883133,
        0.01220814697444439,
        -0.020421793684363365,
        0.0030982987955212593,
        0.08752287179231644,
        0.029411116614937782,
        0.0774301066994667,
        0.031040286645293236,
        -0.00966321025043726,
        0.0062677389942109585,
        -0.028038987889885902,
        -0.020264165475964546,
        0.0017330286791548133,
        -0.014101866632699966,
        9.753862005935663e-33,
        0.15178990364074707,
        0.08106353878974915,
        -0.11414776742458344,
        -0.025720305740833282,
        0.09070053696632385,
        -0.0835258737206459,
        -0.020183119922876358,
        -0.030740465968847275,
        -0.12107660621404648,
        0.042136721312999725,
        -0.01972563937306404,
        -0.08662304282188416,
        -0.04577750712633133,
        0.00940841343253851,
        0.10621986538171768,
        -0.01990717649459839,
        0.009816531091928482,
        0.01621245965361595,
        0.0020000634249299765,
        0.07936180382966995,
        0.02099245972931385,
        -0.044338613748550415,
        -0.036668017506599426,
        -0.005041130818426609,
        0.03474222123622894,
        0.04645233228802681,
        -0.056679315865039825,
        -0.048279933631420135,
        0.01536421850323677,
        0.005807831883430481,
        -0.0015233899466693401,
        -0.030160224065184593,
        -0.02641981653869152,
        -0.020775599405169487,
        -0.06086081266403198,
        -0.09893374890089035,
        -0.034445278346538544,
        -0.056655049324035645,
        -0.048721395432949066,
        -0.05866345390677452,
        -0.0488690622150898,
        -0.012150969356298447,
        -0.04431664198637009,
        -0.025902017951011658,
        0.10033484548330307,
        -0.05354170873761177,
        -0.009336770512163639,
        0.04876192286610603,
        0.05110606551170349,
        0.07159054279327393,
        -0.0720134899020195,
        -0.051136456429958344,
        -0.004455119371414185,
        0.015167366713285446,
        0.022410767152905464,
        0.034636251628398895,
        0.01785210333764553,
        0.006166727747768164,
        0.029068123549222946,
        0.04970002546906471,
        -0.04548266530036926,
        -0.005520131904631853,
        -0.017440006136894226,
        -0.0164401326328516,
        -0.020351184532046318,
        -0.10412202030420303,
        -0.056572794914245605,
        -0.012030083686113358,
        0.02530188299715519,
        0.08067354559898376,
        -0.08352396637201309,
        -0.03206990286707878,
        0.0016522692749276757,
        0.02240612357854843,
        -0.0363151989877224,
        -0.015772121027112007,
        0.041799236088991165,
        0.03467683494091034,
        -0.04144572466611862,
        -0.006356779485940933,
        0.02837836928665638,
        -0.017670083791017532,
        0.04270152375102043,
        0.00406258599832654,
        -0.025990067049860954,
        -0.0013015475124120712,
        0.018075499683618546,
        -0.14745821058750153,
        0.008991166017949581,
        0.11392069607973099,
        -0.06243593245744705,
        0.06439151614904404,
        -0.0015755660133436322,
        -0.00303057162091136,
        -0.05510575696825981,
        -9.771437850532364e-33,
        0.02080596797168255,
        0.12425071001052856,
        0.05262922868132591,
        -0.018535872921347618,
        0.011628231965005398,
        -0.04128771275281906,
        -0.005665147677063942,
        0.006618635728955269,
        0.04429541528224945,
        9.564445645082742e-05,
        0.008816007524728775,
        -0.0014178971759974957,
        0.04105305299162865,
        -0.04731154441833496,
        -0.010447700507938862,
        -0.0679936408996582,
        0.07627243548631668,
        -0.07326839119195938,
        -0.054500192403793335,
        0.0134417824447155,
        -0.07838135212659836,
        0.1173822209239006,
        0.019337430596351624,
        -0.0785985067486763,
        0.0024454977829009295,
        0.02851245179772377,
        0.11084537953138351,
        0.10457251965999603,
        0.00681703444570303,
        0.05643635243177414,
        0.019152242690324783,
        -0.008112989366054535,
        7.36621514079161e-05,
        0.07080745697021484,
        0.06518904864788055,
        0.044584713876247406,
        0.08500219136476517,
        0.10083546489477158,
        -0.03902527317404747,
        -0.060680292546749115,
        0.12744933366775513,
        0.03721201792359352,
        -0.058477792888879776,
        -0.036120764911174774,
        -0.029310693964362144,
        -0.07417821139097214,
        0.054807234555482864,
        0.05131857097148895,
        -0.13419966399669647,
        -0.12187188118696213,
        0.05980760604143143,
        0.03153796121478081,
        -0.008692404255270958,
        0.033359747380018234,
        -0.02127954550087452,
        0.04578584060072899,
        0.05232652276754379,
        -0.033843059092760086,
        0.06579533219337463,
        0.01342619489878416,
        0.02863096445798874,
        -0.06767914444208145,
        -0.011083624325692654,
        0.08387728035449982,
        0.04220283776521683,
        -0.033847350627183914,
        -0.0710156112909317,
        0.05015154555439949,
        -0.018913261592388153,
        -0.00998617336153984,
        -0.0927051454782486,
        -0.024511542171239853,
        0.03587181866168976,
        0.05685820430517197,
        0.11271660029888153,
        -0.06470619887113571,
        -0.049521688371896744,
        0.021348468959331512,
        -0.04753456264734268,
        0.030221590772271156,
        -0.007924333214759827,
        0.04482243210077286,
        -0.08166477084159851,
        -0.11167927831411362,
        0.058523617684841156,
        -0.00341814779676497,
        0.019110694527626038,
        0.02802066132426262,
        0.050688620656728745,
        -0.009410850703716278,
        -0.08043570816516876,
        0.04396093264222145,
        -0.027691636234521866,
        0.07744891941547394,
        0.05643024668097496,
        -5.399859404064955e-08,
        -0.0057336739264428616,
        0.050338014960289,
        0.0043693240731954575,
        0.043453775346279144,
        0.03589431196451187,
        -0.013855415396392345,
        0.09366292506456375,
        -0.10364581644535065,
        0.002346121473237872,
        0.023915978148579597,
        -0.044817764312028885,
        0.05985007435083389,
        -0.060295216739177704,
        0.00903661735355854,
        0.05056588351726532,
        -0.025542326271533966,
        -0.057466279715299606,
        -0.07548165321350098,
        -0.03355829045176506,
        -0.007648295257240534,
        0.016417235136032104,
        -0.024484476074576378,
        0.016729870811104774,
        0.008421411737799644,
        -0.037513937801122665,
        0.03558282181620598,
        0.021408686414361,
        -0.0350603349506855,
        -0.034975044429302216,
        0.06075550243258476,
        -0.09014087915420532,
        -0.007930846884846687,
        -0.0016186546999961138,
        -0.019086996093392372,
        0.0023168260231614113,
        0.05601110681891441,
        -0.1067807599902153,
        -0.024028098210692406,
        0.005335482303053141,
        0.04310273751616478,
        -0.13893096148967743,
        -0.05876273661851883,
        0.029242316260933876,
        -0.0129688810557127,
        -0.10532724112272263,
        -0.009405549615621567,
        -0.04421833157539368,
        -0.02640230767428875,
        0.044753026217222214,
        -0.027109835296869278,
        0.05759642645716667,
        -0.009277915582060814,
        -0.002445631893351674,
        -0.023320144042372704,
        -0.04640175402164459,
        0.03873893991112709,
        0.07416112720966339,
        -0.09174029529094696,
        0.00019938853802159429,
        -0.0012960678432136774,
        0.04105955362319946,
        -0.057838279753923416,
        -0.01989096961915493,
        -0.039227236062288284
    ]
}