{
    "id": "PR-1tMih0fM",
    "title": "Samsung is Hiding This Monitor’s Best Feature – Odyssey OLED G8",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-19T18:00:40Z",
    "video_url": "https://www.youtube.com/watch?v=PR-1tMih0fM",
    "category": "Science & Technology",
    "tags": [
        "Samsung",
        "OLED",
        "QD-OLED",
        "Gaming",
        "34 inch monitor",
        "Samsung Display",
        "Linus Tech Tips",
        "LTT",
        "Samsung Gaming",
        "Windows 11",
        "Colour Fringing",
        "Color Fringing",
        "175Hz monitor",
        "Gaming Monitor"
    ],
    "views": 1517762,
    "likes": 47305,
    "comments_count": 2705,
    "description": "Thanks to Samsung for sponsoring this video! Learn more about the S34BG85 at:   Samsung's new Odyssey OLED G8 is a 34\" ultrawide monitor with a 175Hz refresh rate, AMD FreeSync Premium Pro, and a gorgeous QD-OLED panel. But for some reason, they don't want you to know it's QD-OLED on their website. What other secrets does this monitor hold?  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:50 Unboxing 2:07 The QD-OLED panel 4:45 Odyssey OLED G8 features 7:25 Let's talk colour fringing",
    "description_links": [
        "https://displaysolutions.samsung.com/monitor/detail/2086/S34BG85",
        "https://linustechtips.com/topic/1474967-why-does-samsung-keep-sponsoring-me-%E2%80%93-odyssey-oled-g8/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Samsung's marketing is geared toward the kinds of people whose eyes glaze over, the second they hear terms like QD-OLED panel, FreeSync Premium Pro, or USB power delivery, all of which are included on this monitor, and, yet, all of which are absent from its product page. For many gamers this process is enough, but this is Linus Tech Tips. You all need to know every little detail when you're shopping for a gaming monitor, and Samsung, yes, sponsored this video, packed this display to the gills with features that I get to tell you about, including their incredible QD-OLED panel that we have already seen in action a couple of times, and absolutely fallen in love with. It's not cheap, but it did say Odyssey G8 in the title, so you already knew it was gonna be among the best gaming displays on the planet. Let's crack her open. Inside the box, we find some things we expect like a monitor stand and a Vasa adapter. It's a curved monitor, so you'll need one of these, if you want to use it with a Vasa mount. It's nice that that's included, and some things we don't expect like a remote. That's right, the OLED G8 packs in a bunch of the same features that you would find in Samsung's smart TVs like built-in streaming apps and even some free TV channels through Samsung TV plus, which is great if you want a display that can pull double duty as a more TV-like experience, say, if you're living in a dorm room or something, and it's got a couple of five watt speakers, which sound surprisingly usable, actually, maybe even good. (upbeat music) the stand assembly is a straightforward affair. We've got a nice hefty base for the bottom that screws on with two number two Phillips head screws, lttstore.com, but as much as I love stands, this is the centerpiece. It blew my mind when Adam, who worked on this video, pointed out that Samsung mentions QD-OLED a grand total of zero times on their product page for the OLED G8. Seriously, go look, go check. I'll wait, but they should, because this panel is based on the exact same technology as Samsung's S95B TV, and is as close as you can get to zero compromises. Every pixel on it turns off completely for incredibly deep blacks, and, because you don't need to wait for the crystals to slowly change positions like on an LCD, this is the fastest display in Samsung's lineup, with pixels boasting response times of just 0.1 milliseconds grey-to-grey. In practice, this results in virtually no blur to all 3,440 by 14,40 pixels, especially, if you're running at the maximum 175 hertz refresh rate. None of that is what makes this so special though. Any OLED is gonna be fast with deep blacks. QD-OLED uses a quantum dot layer to overcome traditional OLED's biggest shortcomings though, like subpar brightness, and the potential for burning. It also significantly pumps up the color gamut for the best looking gaming that we've ever seen. We should probably have a game open. Let's get a game going here. What do you think? Should we mix it up, and go with do material? - I don't know how to install it on here. - You bastard, how dare you! - No, it is installed. - Oh, yes, got 'em! We have a much more detailed explanation in this video here, but the short version is that quantum dots are particles that get excited by one wavelength of light, then with incredibly efficiency, turn that into a different wavelength of light, so, instead of RGBW sub-pixels that shine out in their respective colors, W is white, to boost brightness at the expense of saturation. You get a single color of OLED panel that excites an RGB quantum dot layer in front of it. This allows that single color OLED panel behind it to wear out much more gracefully over time. Plouffe from our writing team, for example, has been gaming on his QD-OLED for six months already with no sign of burning whatsoever, and it does all of this while boosting brightness and improving color saturation, thanks to the absence of that white sub-pixel. Of course, there's a lot more to a monitor than just the stand. Samsung included their Neo Quantum processor to help with a number of things, starting, of course, with, \"Hey, cool, look at that. That's their upgraded correlating module with CoreSync, and it helps with image optimization and powers the Tizen based smart entertainment media and gaming hub that helps improve gaming scaling through the use of machine learning. A media and gaming center on a monitor? That's right. Built right into the monitor is access to all your favorite streaming apps including game streaming apps like GeForce Now and Xbox Game Pass Ultimate, so you can play a ton of amazing games without worrying about your power hungry PC heating up your room. It also enables the OLED G8 to support AMD FreeSync Premium Pro, which gives you the benefits of variable refresh rate with HDR, so you get a great picture with strong resistance to tearing or to stuttering, even if your system is struggling to hold a steady 60 FPSs frame rate. I know this is the older \"Horizon,\" but, man, does this ever look so good? It's worth noting, by the way, that \"DOOM Eternal\" can only run high refresh rate or HDR, because the game doesn't support FreeSync Premium Pro. \"Horizon Zero Dawn,\" on the other hand, butter smooth with HDR, man, is that ever gorgeous? Not the most ergonomic setup that I've created for myself here. This stand, by the way, supports height adjust, as well as tilt. This also gives us a better look at the IO, which is a little unusual on this monitor. It's got a mini display port 1.4, a micro-HDMI 2.11, one USB-C port, and a USB-C port with power delivery. This last one is great, because it can do up to 65 watts, meaning that you can use the monitor as an additional display with your laptop, and charge your laptop while you're doing that for a one cable solution. This is great for students or, really, anyone who wants to minimize cable clutter. Also, perfect for watching movies in the dorm. The OLED G8's gonna be joining Samsung's monitor lineup alongside the Neo G8, which uses a mini-LED backlight with a traditional LCD panel, which probably raises the question, why would you go with one over the other? Well, let me tell you, if you find that you're particularly sensitive to color fringing like you would find on a QD-OLED today, or, if you're in a room where you have no light control and it's super bright, the brighter picture of the Neo G8 could make it a better choice, but, if you're pretty much anyone else, I would recommend sticking with the OLED G8, but, in the future, the Neo might, actually, lose one of its only two advantages. Let's talk about color fringing. Because of the unique triangle sub-pixels layout of QD-OLED, sharp lines can render with distracting green and pink outlines. This is something that affects all QD-OLED panels, no matter which company is making the display. Now, for me, and, actually, almost everyone else we pulled in the office, it's the kind of thing that I would forget within a week or two. Besides, my home PC is almost exclusively used for gaming, where you won't notice it at all, but, for Adam, who worked on this video, it's a deal breaker, so, what's the solution? Well, to understand the solution, we need to also understand the problem, and the current situation is partly thanks to Microsoft. To improve text rendering in Windows, Microsoft uses ClearType, which is kind of this color trickery that takes the sub-pixels around black text, and slightly colors them to soften edges, giving fonts a smoother, less aliased appearance, but this is a super new panel with an unusual triangular sub-pixel layout, remember? It's currently unsupported by ClearType. That means that the wrong values are getting sent to those sub-pixels, causing green tops and pink bottoms. Now, this effect can be mitigated by changing the scaling windows or sitting a little bit farther away from your display, but those just make the fringing less noticeable, rather than eliminating it completely. Another option is to use Better ClearType Tuner, which is a program that lets you adjust the same settings that Windows ClearType does, but in a useful manner, and it helps, but it doesn't quite resolve the issue, so, realizing that we were committed to this rabbit hole, we kept going, and sought out the more granular Mac type, which allows for low level access to Windows text rendering. With MacType, you can, actually, configure the exact coordinates of each sub-pixel to force Windows ClearType to properly smooth the text, and when it works, it looks amazing, which is great news, because it means it's not a hardware problem, like, you haven't seen text until you've seen the kind of contrast that you get with deep blacks like this, but thanks to Windows 10's wonky approach to text rendering, MacType requires such deep access to our system that our corporate anti-virus, actually, alerted our sysadmin, while he was on vacation, and wiped out the program on its own, like we're talking registry edits and more. It also ended up breaking a bunch of software. Now it's possible that with more time, we could have made it run a bit smoother, but there's a catch. It doesn't even fix all the text on your system. Lots of apps like Chrome, and, hilariously, even Microsoft Office don't use Windows to render text. Rather, they'll use an alternative like FreeType, which also doesn't support this new sub-pixel layout, meaning that, even if the text in Windows looks crisp, it'll still be wonky pretty much everywhere else, so, please, Microsoft, FreeType Project, everyone, I'm begging you, support this new pixel layout. You'll find a link to the Odyssey OLED G8 in the video description. It's already amazing, and if I get my way, it's only gonna get better. If you guys like this video, why don't you check out the one where we sent James to a quantum dot factory to learn just what the heck they are, and how they're made.",
    "transcript_keywords": [
        "Linus Tech Tips",
        "OLED",
        "Samsung",
        "QDOLED",
        "Windows",
        "monitor",
        "USB power delivery",
        "USB power",
        "color OLED panel",
        "FreeSync Premium Pro",
        "Tech Tips",
        "Linus Tech",
        "OLED panel",
        "text",
        "QDOLED panel",
        "gaming",
        "Premium Pro",
        "Samsung marketing",
        "Samsung mentions QDOLED",
        "marketing is geared"
    ],
    "transcript_entity_values": [
        "3,440",
        "one",
        "hertz",
        "second",
        "a couple of five watt",
        "Windows",
        "Horizon Zero Dawn",
        "smart entertainment",
        "Horizon",
        "Samsung TV",
        "DOOM Eternal",
        "USB-C",
        "RGB",
        "a week",
        "FreeType Project",
        "zero",
        "Phillips",
        "FreeSync Premium Pro",
        "Xbox Game Pass Ultimate",
        "1.4",
        "the Neo G8",
        "ClearType",
        "MacType",
        "IO",
        "CoreSync",
        "today",
        "Neo",
        "175",
        "just 0.1 milliseconds",
        "Plouffe",
        "Microsoft Office",
        "GeForce Now",
        "S95B TV",
        "James",
        "Neo Quantum",
        "six months",
        "OLED",
        "Mac",
        "AMD",
        "only two",
        "Linus Tech Tips",
        "2.11",
        "USB",
        "Tizen",
        "Odyssey G8",
        "Adam",
        "Chrome",
        "Vasa",
        "LCD",
        "QD",
        "14,40",
        "60",
        "the OLED G8",
        "two",
        "Microsoft",
        "Better ClearType Tuner",
        "Samsung",
        "up to 65 watts"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.10834816098213196,
        0.10675475746393204,
        -0.011994975619018078,
        -0.0432792566716671,
        0.12694044411182404,
        0.02185913547873497,
        -0.020501883700489998,
        -0.011669902130961418,
        0.05560741201043129,
        0.011873230338096619,
        0.004341457039117813,
        0.016689356416463852,
        0.05133814364671707,
        -0.04178270697593689,
        -0.033355358988046646,
        -0.08165566623210907,
        0.04294156655669212,
        -0.11917470395565033,
        -0.055591728538274765,
        -0.038922447711229324,
        0.002875525737181306,
        -0.044569700956344604,
        0.03670548275113106,
        -0.010886174626648426,
        0.024459123611450195,
        -0.022075988352298737,
        -0.008379951119422913,
        -0.03686799481511116,
        0.006148407701402903,
        -0.03451467305421829,
        0.023566758260130882,
        0.0625910684466362,
        0.023118136450648308,
        -0.006972860544919968,
        -0.07528766244649887,
        -0.1019824966788292,
        0.04152334854006767,
        -0.11616495251655579,
        -0.07501276582479477,
        -0.03369316831231117,
        0.010125760920345783,
        -0.006793994922190905,
        -0.05152814835309982,
        -0.005209154449403286,
        0.001830704160965979,
        -0.015454058535397053,
        -0.010686418041586876,
        -0.026393933221697807,
        -0.05771511420607567,
        -0.07026003301143646,
        0.02104402706027031,
        -0.03089180402457714,
        0.009018998593091965,
        -0.014138641767203808,
        -0.05478089302778244,
        0.00925520807504654,
        0.010677392594516277,
        -0.01364931557327509,
        0.04282368719577789,
        0.08039375394582748,
        0.07005294412374496,
        -0.07697029411792755,
        0.04236289858818054,
        0.077872134745121,
        -0.030175989493727684,
        0.017510008066892624,
        -0.03257252648472786,
        -0.0590352825820446,
        -0.0582733154296875,
        -0.07382933050394058,
        -0.021311750635504723,
        -0.013728121295571327,
        0.010363932698965073,
        0.021771259605884552,
        0.05266951769590378,
        0.003278501331806183,
        0.03185846656560898,
        -0.025759194046258926,
        0.048572342842817307,
        -0.0419093482196331,
        0.0064645553939044476,
        -0.03244737535715103,
        -0.016974924132227898,
        0.0361262783408165,
        0.10032889246940613,
        -0.035297587513923645,
        0.048851996660232544,
        0.028459781780838966,
        -0.01610424742102623,
        -0.06382661312818527,
        -0.023835960775613785,
        -0.01880422979593277,
        -0.039176587015390396,
        -0.009786674752831459,
        -0.055117323994636536,
        -0.03505384549498558,
        -0.005652656313031912,
        -0.03131164237856865,
        -0.05487420782446861,
        0.01944546587765217,
        0.012776208110153675,
        0.06432398408651352,
        0.08610845357179642,
        0.007397962734103203,
        -0.10566194355487823,
        -0.05182972177863121,
        0.04406971484422684,
        0.10463880747556686,
        -0.01953345350921154,
        0.012449241243302822,
        0.0037823948077857494,
        0.050472866743803024,
        -0.02419586107134819,
        -0.00480710668489337,
        0.016936972737312317,
        0.030104657635092735,
        -0.06518750637769699,
        -0.015332101844251156,
        0.0775056928396225,
        -0.04765176400542259,
        -0.006667952053248882,
        -0.0033658628817647696,
        -0.043606966733932495,
        -0.03264841064810753,
        -0.03785446286201477,
        0.07527949661016464,
        -0.04026626795530319,
        -2.5548465709457114e-35,
        0.03406200930476189,
        0.030742470175027847,
        -0.07326094061136246,
        -0.08765718340873718,
        0.027101531624794006,
        0.1343022882938385,
        -0.004126372747123241,
        0.03356236219406128,
        0.03528958931565285,
        0.031337350606918335,
        -0.028739791363477707,
        0.0775073990225792,
        -0.029435455799102783,
        0.0319000706076622,
        0.003558975411579013,
        -0.010128091089427471,
        -0.035428017377853394,
        0.0688016265630722,
        0.0070074996910989285,
        -0.04928900673985481,
        0.037498850375413895,
        0.0015876827528700233,
        0.006816671695560217,
        -0.011814789846539497,
        0.0882733166217804,
        0.0011880979873239994,
        0.007805232424288988,
        0.04581126198172569,
        0.050050683319568634,
        0.03749597817659378,
        -0.05505995824933052,
        -0.030697764828801155,
        0.0019516859902068973,
        -0.0946650505065918,
        -0.039310354739427567,
        -0.00402185320854187,
        -0.07809524983167648,
        -0.04919779300689697,
        0.014775289222598076,
        0.0039777206256985664,
        0.024632612243294716,
        0.026276664808392525,
        -0.03381603583693504,
        -0.00030818916275165975,
        -0.07928244024515152,
        0.0981619581580162,
        0.04166099801659584,
        0.012805641628801823,
        0.052102524787187576,
        0.04654768109321594,
        -0.0718710795044899,
        -0.024754151701927185,
        -0.08466343581676483,
        -0.07102645188570023,
        -0.024067210033535957,
        -0.009583000093698502,
        0.009931899607181549,
        -0.05705520510673523,
        -0.012135365046560764,
        0.004154079593718052,
        0.04305080324411392,
        0.05161990225315094,
        0.001018325798213482,
        0.027131225913763046,
        -0.10763620585203171,
        0.03495403751730919,
        0.10442307591438293,
        0.0027014194056391716,
        -0.15386168658733368,
        0.01043954398483038,
        -0.011371330358088017,
        -0.016220981255173683,
        0.09885457903146744,
        -0.006736287847161293,
        0.008286809548735619,
        -0.044622212648391724,
        -0.01987086422741413,
        -0.00142138940282166,
        0.04801804572343826,
        -0.05258548632264137,
        -0.0046203541569411755,
        -0.05627649649977684,
        0.050427742302417755,
        0.003143555484712124,
        -0.05561104044318199,
        -0.037548650056123734,
        0.014843081124126911,
        -0.04516289010643959,
        -0.021228546276688576,
        0.016278525814414024,
        -0.009574724361300468,
        -0.030973777174949646,
        0.02607400342822075,
        0.04885319992899895,
        -0.061675991863012314,
        -3.6791760952188314e-33,
        -0.0142009062692523,
        -0.013797156512737274,
        -0.03329269587993622,
        -0.08808925002813339,
        -0.009622524492442608,
        -0.020041190087795258,
        0.047449156641960144,
        0.10932813584804535,
        0.0027386867441236973,
        -0.10122603923082352,
        0.07532388716936111,
        0.014649325981736183,
        -0.10370128601789474,
        -0.01473816204816103,
        0.01690400019288063,
        -0.011331593617796898,
        0.02659374661743641,
        -0.07145332545042038,
        -0.042215194553136826,
        -0.0277318824082613,
        0.013616143725812435,
        -0.04990704730153084,
        0.040492650121450424,
        0.10816892981529236,
        0.06282307207584381,
        -0.01814211532473564,
        0.05343908816576004,
        0.000792751379776746,
        0.0027587460353970528,
        0.030160870403051376,
        0.002891660900786519,
        -0.09986560046672821,
        -0.0777333602309227,
        0.044225696474313736,
        0.027731748297810555,
        -0.05397021397948265,
        0.047807659953832626,
        -0.005161665845662355,
        -0.01682472974061966,
        0.006336518097668886,
        -0.027862362563610077,
        0.07056169956922531,
        -0.0017105506267398596,
        0.06667601317167282,
        0.03669886291027069,
        0.0354546457529068,
        -0.049814969301223755,
        -0.0390939861536026,
        -0.020583121106028557,
        -0.0575575977563858,
        0.01803634501993656,
        -0.02422984316945076,
        0.09249839931726456,
        -0.016448864713311195,
        -0.04240432009100914,
        0.03871287405490875,
        -0.03821438550949097,
        0.13196134567260742,
        -0.021301938220858574,
        -0.041596777737140656,
        0.1515933871269226,
        -0.006794347427785397,
        -0.11674628406763077,
        -0.03592976555228233,
        -0.001964409137144685,
        0.001572096603922546,
        0.05538052320480347,
        -0.02599855326116085,
        0.01801324263215065,
        -0.02154742181301117,
        -0.014588450081646442,
        -0.13494698703289032,
        -0.06921286880970001,
        -0.06645607948303223,
        -0.02395753003656864,
        0.05816669762134552,
        0.011572420597076416,
        -0.06631577014923096,
        -0.013429257087409496,
        -0.029260536655783653,
        0.044355060905218124,
        0.013304946012794971,
        0.0644349679350853,
        -0.06180097162723541,
        0.04458479583263397,
        -0.02926115319132805,
        -0.009717747569084167,
        -0.023924220353364944,
        0.040468838065862656,
        0.04770565405488014,
        -0.13130074739456177,
        0.05191996693611145,
        -0.12836132943630219,
        0.05342451110482216,
        0.08292873203754425,
        -5.150298321154878e-08,
        -0.004411578644067049,
        0.010297441855072975,
        0.02921108342707157,
        -0.005486632697284222,
        0.03494355082511902,
        -0.10684290528297424,
        0.02544107288122177,
        -0.010135055519640446,
        0.036511052399873734,
        -0.032087698578834534,
        0.03476540371775627,
        -0.08650681376457214,
        -0.041357219219207764,
        -0.007687128148972988,
        0.09783607721328735,
        0.0003194244345650077,
        -0.03733733668923378,
        0.04967159777879715,
        0.0014315382577478886,
        0.011545468121767044,
        0.018255511298775673,
        0.044859010726213455,
        0.05084211751818657,
        -0.06602571904659271,
        0.009482518769800663,
        0.01316954754292965,
        0.03341256454586983,
        0.06572994589805603,
        0.09327273815870285,
        -0.02220350317656994,
        0.01686125062406063,
        -0.019087664783000946,
        0.03550310432910919,
        0.019690103828907013,
        0.030749546363949776,
        0.00896056741476059,
        -0.05372186750173569,
        0.025014536455273628,
        0.10128159821033478,
        0.11195588111877441,
        -0.04672461748123169,
        -0.04945620894432068,
        -0.01595414988696575,
        0.04682305455207825,
        0.029839709401130676,
        -0.016572067514061928,
        -0.004917557816952467,
        -0.023493843153119087,
        -0.031231461092829704,
        0.0653332993388176,
        0.0021857409738004208,
        -0.08756167441606522,
        -0.008366980589926243,
        0.026467012241482735,
        -0.03291327878832817,
        -0.10146240890026093,
        -0.02274496480822563,
        0.05604984611272812,
        -0.046971965581178665,
        0.04367648810148239,
        0.0556437186896801,
        -0.09771472960710526,
        0.02756500244140625,
        0.11681357026100159
    ]
}