{
    "id": "PtxtnIsqOEQ",
    "title": "So much GAMING HORSEPOWER in a laptop! - Lenovo Legion 7i",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-06T14:59:35Z",
    "video_url": "https://www.youtube.com/watch?v=PtxtnIsqOEQ",
    "category": "Science & Technology",
    "tags": [
        "Lenovo",
        "Legion",
        "7i",
        "Gaming",
        "PC",
        "Laptop",
        "NVIDIA",
        "RTX",
        "Apex Legends",
        "Forza",
        "Unboxing",
        "Linus",
        "Notebook",
        "Intel"
    ],
    "views": 1246861,
    "likes": 36300,
    "comments_count": 2689,
    "description": "Thanks to Lenovo Legion for sponsoring the video! Check out the Legion 7i gaming laptop at   Who knew a gaming laptop could look so business-like yet so powerful? Linus takes a look inside the laptop and tests it out in a couple of games!  Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://bit.ly/LenovoLegion7i",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- As much as I'd love to show you guys the packaging for the Lenovo Legion 7i, which I am unboxing (throat clearing) under the table here, this is a pre-released unit that was sent over in non-finalized packing materials. So I'm unfortunately unable to do that. Lenovo sponsored this video and we are gonna be checking out their state of the art Legion 7i Windows 10 gaming notebook, a slim, fully-featured machine that has as much gaming horsepower as you might expect from a machine twice the thickness. But apparently, it's got a cooling system on it that can more than tame the beast within. Wow, first impressions of this are really professional. And that's not a word that I would normally use to describe something with like a core i9 HK processor and 2080 Super Max-Q graphics card. But this looks like, you know, it's like business, but like gaming business. Look at this thing. Would you guys know this is a gaming machine? I mean, that's a hint. (laughs) The entire bottom of the thing has got perforations all across here. And then for cooling, we've got a vent on this side, two vents on the back, and then another vent over on the other side. Another thing we've got more of than you might expect in a modern machine is I/O. That's really nice to see. So we've got a type A over on the right-hand side, which personally, I'm not a huge fan of on gaming machines, especially when that's where all of the Type A ports are lined up. But fortunately, this, this I'm a big fan of. We've got most of the I/O here on the back. So HDMI out, two more Type As; God, gigabit ethernet, thank you, as well as a power plug and Kensington lock. Then, over on the left-hand side, that is not one but two USB type Cs, one of which is Thunderbolt. And we've got a headset jack. That's about as much as most people are going to need. Now, the main things Lenovo asked me to draw attention to here are the screen; the graphics horsepower; their TrueStrike keyboard, which has 1.3 millimeters of travel, in spite of the fact that this is a relatively slim gaming notebook; and, of course, their cooling system. Naturally, I wanna know how you keep a core i9 HK processor and a 2080 super-cool in a machine like this. We were told Lenovo submitted it to UL for verification, and it ran for as long as nine hours without throttling. That's impressive. (imitates bird warbling) Look at those fans. Now there has been a trend towards much, much thinner fan blades over the years, but those are tiny. Oh, no way. Before even turning it on, we know there's RGB lighting. Look at that. Tiny strips of RGB LEDs on the rear exhaust right there and right there. I love it. Oh, look at that, wow! Look at that cooler. The whole thing is one gigantic piece here. Now, why would they do it that way? Let's run through what we're lookin' at here. This is our CPU. And the Legion 7 can be equipped with up to a core i9 10980 HK. That's Intel's top-of-the-line mobile chip. Right here is our GPU surrounded by our graphics memory. So here we're looking at anything from a GTX 1660 Ti all the way up to an RTX 2080 Super Max-Q. I actually don't know exactly what's in here, but what I can tell you guys for sure is that it is not a 1660 Ti because that is a gigantic dye. I will say, though, actually, they did a fantastic job of their thermal paste application. A lot of the time on these, like, pre-done machines, you'll see just like gobs and gobs of thermal paste, and it's kind of gloppin' all over the place. But this is really tiny. Right over here is our motherboard chipset. And over here, we've got our dual M.2 drives. So these are both OEM versions of Samsung drives. I'm expecting very solid performance out of these. And if I had to guess, I'd say they're running in a Raid 0 configuration out of the box. Storage should be extremely snappy on this machine. Curiously, whatever is under this here seems to be, is that soldered down? Can't tell. Oh, that makes sense. Here I am all used to seeing soldered memory in laptops these days, but no, they have, in fact, not gone that route. There we go. So, under this little shield right here, we've got two slots for DDR4 SDM memory. And one of the remarkable things about this machine is that it can be equipped with up to 3,466 megahertz RAM. That would be in a two by eight gig configuration, although I'm not 100% sure what we've got on here. No, it turns out we're running 32 gigs at 3,200 megahertz. Something to note, guys, is that while they're using all Samsung parts for the RAM and SSDs in these, it is very typical for these types of notebooks to multi-source. So you wouldn't expect necessarily the exact same make or model, especially when you choose a different memory configuration. Not all suppliers have the same availability of different speeds and capacities. Now to take a closer look at the cooler. This is really neat. I did notice that there was a surprisingly small number of heat pipes in the system. And I guess this is to save on bulk. Because if you look at this, they've actually got a heat pipe running over to this radiator right here. And then this one goes and sits right next to the CPU. And they've got a second heat pipe coming over near the GPU that runs over to this exhaust radiator right here. But heat is actually carried from the CPU and GPU to these two, the larger of the radiators, by a vapor chamber. Vapor chambers are like a heat pipe, except they are flat instead of tubes. So that helps 'em save on some space and they're very high-performance. And it allows both of these to contribute to cooling for both the CPU and GPU, depending on which one you're loading up more heavily. Because not every workload is gonna stress both of them equally. One thing you guys might have noticed is that on the inside, there's no cooling for the M.2 modules. That's because we've actually got these thick thermal pads on the bottom of the unit that are going to allow the M.2s to use the bottom of the laptop, so the entire bottom plate, as kind of like a giant aluminum heat spreader. This is, of course, (metal tapping) metal, not plastic. I'm impressed at how accessible this is. It's only, what, like 10 screws and you can get at RAM storage. Pretty much anything that you'd want to upgrade after the fact. Oh, there's even more RGB than I expected. (laughs) The keyboard is very RGB. The good news is that I'm sure that there's a software way that you can tame that a little bit if you're not quite as into it. This is pretty cool, though. Check that out. So you've got kind of like an RGB like underglow effect on the back where I showed you those strips that were coming out of the exhaust. And, oh, oh, there's more than I thought around the sides too. Look at this. RGB all the way around the bottom of the unit. (laughs) I didn't even see that one. Immediately upon using this machine, the high refresh rate display absolutely stands out. It's about as light as you could possibly expect it to be. I think they saved quite a bit of weight by going with a vapor chamber rather than heat pipes. And that also seems to be a big factor for how they were able to keep it so thin. So you can actually see from the outside what the internal layout is here. Under the touchpad, which is relatively thin, they've got the battery pretty much all the way across the front. And then under the keyboard, which they needed a lot of space for, because they've got RGB lighting, which is apparently Corsair iCUE-compatible, which is pretty cool. So they've got that RGB lighting. They've got that long travel on these keys. And then, of course, they had to keep the rest of the machine, all the performance guts, as thin as possible. It's pretty common to see the high-performance stuff loaded towards the back. So it's less likely that, when you've got your palms down on the top of the machine, you're gonna get all sweaty and all that. It occurs to me, I never actually pulled out the power adapter. So, it's definitely a big boy. (plastic rustling) This thing's rated at 230 watts. But they've done a pretty good job of keeping it relatively slim. In fact, it's not that different from the thickness of the laptop. So, whatever you're planning to slide your laptop into, the power brick should fit in just nicely alongside it. Video editing might not have been Lenovo's main goal when they were designing this laptop, but given how many gamers put together montage clips or stream or whatever the case may be, light to medium or even pretty heavy video production has become an expectation, even if it's just like a gaming-centric machine. So, the first thing I'm gonna do is load up a timeline in Premiere Pro, and we're gonna encode a video and see just how well our CPU manages to turbo with that cooling solution we just looked at. Actually, while I wait for that, let's go ahead and see if there's any way for us to control the RGB on our keyboard and system here. Network boost prioritizes games. All right, what else we got in here? What is auto close? Oh, okay, so it'll close apps you don't need when you launch a game. Suppress keyboard noise, that's a handy feature. Not that the keyboard is particularly loud, actually. It stands out as not being particularly loud at all. Can you guys hear how quiet that is? - [Man] It's pretty quiet. If you press it lightly, you can't even hear the thing. You definitely have to type with more intent than you might have to on a laptop keyboard that doesn't have such a long travel. But it's closer to what you'd expect from a desktop like numbering keyboard. Curiously, I don't see anything in the main app here for RGB control. But what does draw my attention over here is an X-Rite Color Assistant cog down in the system tray. That is pretty cool. So we're running the 144 hertz model, but there are actually three different displays that this notebook could be equipped with. From an SRGB 144 hertz to an Adobe RGB 144 hertz, all the way up to the 240 hertz model, all of which are up to 500 nits peak brightness, and our VESA display HDR 400 certified with Dolby Vision Awareness, so you'll be able to interpret Dolby Vision content. Another standout feature of the display is G-SYNC compatibility. Now, if we're running on the integrated GPU, which you can see we are right now, obviously we're not gonna be able to do that. But once we switch over to the Nvidia GPU, we should see that G-SYNC menu show up right here in the Nvidia control panel. Man, this CPU turbos like mad. So we're just generating peak files for the project right now. And you can see we are regularly turboing up in the 4.5-plus gigahertz range. Now this is a light workload. This is not a heavily multi-threaded workload, but that's (finger snaps) what gives you that snappiness. This'll give us a better idea of what to expect when this thing is being stressed. This is 8:1 REDCODE RAW footage that we're playing back in Premiere. You can hear the fans rampin' up a little bit now, hey? But, even at about 40% CPU load, we're still turboed up to around 4.35, 4.45 gigahertz. That is not too shabby. Actually, we don't even need to do a video export. All I need to do is flick playback to full on 8K 8:1 RED footage, and that'll give us a full CPU load, won't it? Yep. (laughs) So let's see what we turbo to when we're absolutely slamming this thing. Even the GPU's getting hit for about 20 high, 30 low percent load here. Dang, that is a surprisingly low hum. Let's flick it into the performance thermal mode and see how loud it gets. Now it's goin'. Holy Schnikes. Okay, just a second. We need to go back to that same segment and play this back again here. Wow, in the performance mode, it actually turbos several-hundred megahertz higher across all eight cores. And it's louder, but it's not whiny. It's more whooshy. You can actually see the playback is visibly smoother than it was when we were in the balanced mode. Four gigahertz, four-plus gigahertz, all core boost on mobile was a pipe dream not that long ago. And yet here we are averaging over four gigahertz across all eight cores under heavy load. All right, enough thermal testing. Let's go ahead and jump into a game. We're gonna start with Apex Legends. All the settings are high with VSync off. And we're just in training mode, so we don't mess with other people's games. This is so smooth. Apex is running at about 130 to 140 FPS at 10 ADP. Wow, those guns sound good. Speakers are surprisingly boomy. Now on to Forza Horizon 4. All high settings again, VSync off. There is a ton of detail on these cars. That's what a high-powered GPU and a mobile device will do for ya. This is running really smooth, thanks to the high refresh rate display, and we're not seeing any tarry. And as for the most important thing in car games, the sound. Sounds good. These speakers are real solid for a laptop. With a surprisingly good cooling setup for the included core i9 and 2080 Super, a solid high refresh rate display, and a quiet long-travel keyboard, Lenovo has put together a pretty darn compelling machine starting at $1,599.99 U.S. dollars. Oh, I almost forgot what's preinstalled. You've got the usual bloat that comes with Windows for whatever reason. Like from king.com, you've got iCUE. Oh, that explains why the RGB controls were not in Lenovo's software, because you would use Corsair's software for that. That's pretty cool, Corsair movin' up in the world. There we go, (laughs) okay. Everything is controlled from within iCUE. They've got McAfee and their Lenovo utility. And other than that, nothing that I would really consider to be egregious bloat. Everything else here is either stuff that we installed or stuff that I think is pretty cool, like the X-Rite Color Assistant that allows you to quickly change your display color settings. So, that's it. That's a look at the Lenovo Legion 7i. Thanks to Lenovo for sponsoring this video and to you guys for watching it. Oh, I have more things plugged into the back than I remembered. (laughs) You're gonna find a link to it in the video description if you wanna check it out. It's a lotta gaming laptop in a very Slim Form Factor and with great thermals, considering how thin it is.",
    "transcript_keywords": [
        "RGB",
        "nonfinalized packing materials",
        "Lenovo",
        "machine",
        "Pretty",
        "thing",
        "CPU",
        "GPU",
        "Lenovo Legion",
        "pretty cool",
        "keyboard",
        "gaming",
        "RGB lighting",
        "back",
        "guys",
        "laptop",
        "heat",
        "cooling",
        "packing materials",
        "nonfinalized packing"
    ],
    "transcript_entity_values": [
        "the Legion 7",
        "Dolby Vision Awareness",
        "8",
        "USB",
        "SDM",
        "Corsair",
        "8:1",
        "Forza Horizon 4",
        "Windows",
        "about 40%",
        "about 130 to 140",
        "Samsung",
        "3,466 megahertz",
        "10",
        "Nvidia",
        "the years",
        "VESA",
        "1660 Ti",
        "Four gigahertz",
        "FPS",
        "Apex",
        "Lenovo",
        "Dang",
        "a ton",
        "four-plus gigahertz",
        "2080",
        "HK",
        "Adobe",
        "4.5-plus gigahertz",
        "Apex Legends",
        "Raid 0",
        "Corsair movin",
        "4.35",
        "first",
        "ADP",
        "several-hundred megahertz",
        "two",
        "144",
        "GPU",
        "up to 500",
        "Premiere Pro",
        "all eight",
        "1.3 millimeters",
        "Legion 7i Windows 10",
        "CPU",
        "1660",
        "eight",
        "32",
        "30 low percent",
        "Thunderbolt",
        "RAM",
        "Kensington",
        "one",
        "king.com",
        "second",
        "four gigahertz",
        "Dolby Vision",
        "Premiere",
        "3,200 megahertz",
        "these days",
        "McAfee",
        "as long as",
        "4.45 gigahertz",
        "10980 HK",
        "230 watts",
        "hertz",
        "jack",
        "TrueStrike",
        "Cs",
        "$1,599.99 U.S. dollars",
        "GTX",
        "Intel",
        "100%",
        "three",
        "One",
        "the X-Rite Color",
        "240",
        "Holy Schnikes",
        "the Lenovo Legion 7i",
        "M.2",
        "VSync",
        "RGB",
        "about 20"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.06842932105064392,
        -0.02445955201983452,
        -0.045564375817775726,
        -0.06811534613370895,
        0.08737640082836151,
        0.022001491859555244,
        -0.01301449816673994,
        0.005926705431193113,
        -0.02316449210047722,
        0.03879259154200554,
        -0.013606049120426178,
        0.031454142183065414,
        0.0373821035027504,
        -0.05062001571059227,
        0.12910640239715576,
        0.004871362820267677,
        0.09967982023954391,
        -0.09264662116765976,
        -0.03491954877972603,
        -0.022341536357998848,
        0.01931200735270977,
        -0.0436924509704113,
        0.004548981320112944,
        -0.020944595336914062,
        0.03561287745833397,
        -0.005118242930620909,
        0.04086042195558548,
        -0.04275934398174286,
        -0.056386798620224,
        -0.06764619052410126,
        -0.0217793770134449,
        0.04095923528075218,
        -0.048813752830028534,
        0.03996824473142624,
        0.013455526903271675,
        -0.0784590020775795,
        0.02582903578877449,
        -0.08309070020914078,
        0.007477473933249712,
        -0.11709550768136978,
        -0.030042553320527077,
        -0.08190860599279404,
        0.02178145945072174,
        -0.03279327228665352,
        0.025772102177143097,
        -0.052235137671232224,
        0.00854270625859499,
        -0.018168950453400612,
        0.06878985464572906,
        0.03785983845591545,
        -0.017783358693122864,
        -0.06480398029088974,
        0.04210550710558891,
        -0.054122380912303925,
        -0.052288785576820374,
        0.022400444373488426,
        0.008540930226445198,
        -0.05986160784959793,
        0.009588534012436867,
        -0.008017553016543388,
        0.06802055239677429,
        -0.10193958878517151,
        -0.03782234713435173,
        0.11614998430013657,
        -0.023301824927330017,
        -0.05290931835770607,
        0.053042568266391754,
        -0.018186764791607857,
        -0.043126508593559265,
        -0.06927534192800522,
        0.03876033425331116,
        0.01743117719888687,
        0.03880617767572403,
        0.059956636279821396,
        -0.033721521496772766,
        0.0032683182507753372,
        0.06393029540777206,
        -0.05111491680145264,
        0.049884963780641556,
        0.039952512830495834,
        -0.011896957643330097,
        0.053333401679992676,
        0.011241708882153034,
        0.012337064370512962,
        0.00967602338641882,
        -0.007158033084124327,
        0.011967720463871956,
        0.022787997499108315,
        -0.01823565922677517,
        -0.08961918205022812,
        0.02666746824979782,
        0.037086017429828644,
        0.06185925006866455,
        0.047210946679115295,
        -0.032237738370895386,
        -0.012238061986863613,
        0.0581602044403553,
        -0.1040215939283371,
        -0.06117245927453041,
        0.09583933651447296,
        -0.029610365629196167,
        0.04891163110733032,
        0.1023024246096611,
        -0.03861096128821373,
        -0.05883105844259262,
        -0.012967950664460659,
        0.0069171651266515255,
        0.12915052473545074,
        -0.016605118289589882,
        -0.01585615985095501,
        -0.08572166413068771,
        -0.0036945801693946123,
        -0.04362066835165024,
        0.03416726738214493,
        -0.023236408829689026,
        -0.00680195027962327,
        -0.05457429587841034,
        0.00013397964357864112,
        0.05481444299221039,
        0.04004921019077301,
        0.02429274283349514,
        -0.009248227812349796,
        -0.004523600917309523,
        0.03275088220834732,
        0.004586297553032637,
        0.046942275017499924,
        -0.06666530668735504,
        -1.0062182051870856e-33,
        -0.018876858055591583,
        0.01355092041194439,
        -0.007412283681333065,
        -0.08940615504980087,
        0.011181251145899296,
        0.03240857645869255,
        0.02675764448940754,
        -0.0255266260355711,
        -0.03348439931869507,
        0.01097965519875288,
        -0.10387970507144928,
        0.06677833199501038,
        -0.07678478211164474,
        0.04843524470925331,
        0.09074722230434418,
        -0.06915628165006638,
        -0.00834051612764597,
        0.028553422540426254,
        0.03622516244649887,
        0.004639958497136831,
        0.037179019302129745,
        0.010406219400465488,
        0.03656015172600746,
        -0.07572013139724731,
        -0.005262808408588171,
        0.02239241823554039,
        -0.06066995486617088,
        0.013783770613372326,
        0.06690382957458496,
        0.07306163758039474,
        -0.03552238643169403,
        -0.09463480114936829,
        -0.05000966787338257,
        -0.06779372692108154,
        -0.03274447098374367,
        -0.035385068506002426,
        -0.11446095257997513,
        -0.1053922027349472,
        0.02150050550699234,
        0.04281318560242653,
        -0.07203500717878342,
        0.12126341462135315,
        -0.1244349554181099,
        -0.07155907154083252,
        -0.08891903609037399,
        0.038675349205732346,
        0.02623865380883217,
        0.012393719516694546,
        -0.03730824962258339,
        0.04256776347756386,
        -0.12897206842899323,
        0.04138799384236336,
        -0.012253670953214169,
        -0.03488756716251373,
        0.018218865618109703,
        -0.040754884481430054,
        0.07350065559148788,
        -0.04285532236099243,
        0.06929167360067368,
        0.04267363250255585,
        0.03432687371969223,
        0.00343899498693645,
        -0.020199263468384743,
        -0.012528758496046066,
        -0.08113007992506027,
        0.0298642348498106,
        0.11332331597805023,
        0.026699280366301537,
        -0.0674750804901123,
        -0.018985822796821594,
        0.0212473813444376,
        -0.011186315678060055,
        0.07023889571428299,
        -0.03765442222356796,
        0.0476795993745327,
        -0.002373250899836421,
        -0.05061735585331917,
        -0.02898445911705494,
        -0.021919813007116318,
        -0.032941266894340515,
        -0.03680073842406273,
        0.029300441965460777,
        -0.003701983718201518,
        0.044728804379701614,
        -0.03917732089757919,
        0.07680068165063858,
        -0.021309377625584602,
        -0.01512093748897314,
        -0.06241273507475853,
        -0.03499123826622963,
        -0.010152051225304604,
        -0.034561511129140854,
        -0.004410646390169859,
        0.0042644371278584,
        -0.017492249608039856,
        -6.552792799481361e-34,
        -0.06747996062040329,
        -0.04997291415929794,
        -0.015470117330551147,
        0.058878351002931595,
        0.05645418167114258,
        0.0006924752960912883,
        0.004424636252224445,
        7.464916416211054e-05,
        -0.06012348085641861,
        -0.039003435522317886,
        -0.02408754639327526,
        0.09935615211725235,
        -0.029787644743919373,
        -0.016821308061480522,
        0.04763209819793701,
        -0.05639251694083214,
        0.05602297559380531,
        -0.07857400923967361,
        0.06780144572257996,
        -0.051814012229442596,
        0.06258075684309006,
        -0.005385665223002434,
        -0.012509540654718876,
        -0.018988139927387238,
        0.024589423090219498,
        -0.01316727977246046,
        -0.07084224373102188,
        -0.009303620085120201,
        -0.00306744989939034,
        0.07531920075416565,
        0.01197933591902256,
        0.015754632651805878,
        0.016521884128451347,
        0.02285882830619812,
        0.05869342386722565,
        -0.06829483062028885,
        0.08679543435573578,
        0.020798027515411377,
        0.006914762780070305,
        -0.04312519729137421,
        0.07496248185634613,
        0.0036625214852392673,
        0.021986860781908035,
        0.007287112530320883,
        0.06954247504472733,
        0.0116486307233572,
        -0.06281153112649918,
        -0.13806866109371185,
        0.08713942766189575,
        -0.005323994439095259,
        -0.03817926347255707,
        -0.006791159976273775,
        0.046540237963199615,
        -0.0454719103872776,
        -0.048279181122779846,
        -0.07853750884532928,
        -0.0503421314060688,
        0.05945068597793579,
        0.025396017357707024,
        -0.01919742301106453,
        0.0002670943213161081,
        -0.015072877518832684,
        -0.05777814984321594,
        0.03997345268726349,
        0.02344140037894249,
        0.031953658908605576,
        0.04563279077410698,
        0.08615325391292572,
        -0.0012233450543135405,
        -0.049397725611925125,
        -0.051452189683914185,
        -0.08534474670886993,
        0.027548300102353096,
        -0.014204112812876701,
        -0.1117638647556305,
        0.01869969815015793,
        0.03047405742108822,
        -0.03857143223285675,
        0.012363603338599205,
        0.0121016725897789,
        -0.009014601819217205,
        -0.015487132593989372,
        0.028817864134907722,
        -0.038886744529008865,
        0.036544252187013626,
        0.010339168831706047,
        0.07859137654304504,
        -0.040979452431201935,
        -0.08103344589471817,
        -0.018430842086672783,
        -0.008879403583705425,
        0.04888163134455681,
        -0.011027353815734386,
        0.07251964509487152,
        0.015130951069295406,
        -5.621896548291261e-08,
        0.018498022109270096,
        -0.048930294811725616,
        0.04975561425089836,
        0.06471406668424606,
        0.009689067490398884,
        -0.026159927248954773,
        0.03182654455304146,
        0.015449422411620617,
        0.10304544866085052,
        -0.016914358362555504,
        0.08595491945743561,
        -0.11757439374923706,
        -0.00804535299539566,
        0.03810976818203926,
        0.03365836665034294,
        0.07392024993896484,
        -0.011264597997069359,
        0.07334566861391068,
        -0.013584940694272518,
        -0.03707181289792061,
        0.003081856993958354,
        0.021205268800258636,
        0.11961711943149567,
        -0.07304295152425766,
        0.017566736787557602,
        0.021625112742185593,
        -0.04503524675965309,
        0.014977979473769665,
        0.06565701216459274,
        -0.032163672149181366,
        -0.09769489616155624,
        0.023343369364738464,
        0.002189056947827339,
        -0.04277060553431511,
        0.031680818647146225,
        -0.05365421250462532,
        0.0072526102885603905,
        0.07042848318815231,
        0.08378367125988007,
        0.04796476289629936,
        -0.06033656373620033,
        -0.03025505319237709,
        -0.026503724977374077,
        -0.01755860075354576,
        0.13390949368476868,
        0.022774992510676384,
        -0.026350386440753937,
        -0.029898572713136673,
        -0.004102897364646196,
        0.013750138692557812,
        0.016494132578372955,
        -0.00776970200240612,
        0.033237382769584656,
        0.030746426433324814,
        0.03917061537504196,
        0.01351715438067913,
        -0.019220158457756042,
        0.05330948904156685,
        0.016075855121016502,
        0.07101194560527802,
        0.07239371538162231,
        -0.125492662191391,
        -0.02429276332259178,
        0.07830207794904709
    ]
}