{
    "id": "pUtJ8HPZRkw",
    "title": "Lidar vs. Tesla: the race for fully self driving cars",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-06-28T14:00:37Z",
    "video_url": "https://www.youtube.com/watch?v=pUtJ8HPZRkw",
    "category": "Science & Technology",
    "tags": [
        "lidar",
        "lidar sensor",
        "lidar scanner",
        "lidar vs radar",
        "what is lidar",
        "iphone lidar",
        "lidar mapping",
        "lidar news",
        "apple lidar",
        "lidar ipad pro",
        "ipad pro lidar",
        "lidar explained",
        "tesla",
        "elon",
        "elon musk",
        "self driving cars",
        "autonomous vehicles",
        "lidar camera",
        "lidar technology",
        "how lidar works",
        "apple lidar scanner",
        "iphone 12 pro lidar",
        "sensor lidar",
        "lidar sensor explained",
        "technology",
        "cars",
        "transportation",
        "the verge",
        "verge"
    ],
    "views": 169021,
    "likes": 4702,
    "comments_count": 545,
    "description": "In the world of autonomous vehicles, lidar sensors are the center of debate. Self-driving car companies, like Cruise and Waymo, use lidar as the key ingredient to advance their autonomous vehicle navigation while skeptics, like Elon Musk, claim it to be useless. Transportation editor, Andrew Hawkins, explores the landscape of both and why exactly lidar continues to be at the forefront of complete autonomous driving. #technology #cars #lidar   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- [Hawkins] So if you'll recall, way back in 2018, Waymo sued Uber for stealing trade secrets. - So there's no trade secrets gonna be shown today If that's what you came for, too bad. - [Hawkins] Waymo is the self-driving car spinoff of Google. Uber was also working on self-driving cars at the time. Uber's chief tech bro, Travis Kalanick, was questioned on the stand about a weird phrase that he wrote on a whiteboard during a \"late night jam sesh.\" A phrase I don't really appreciate having to say out loud on camera, but here it goes: \"Laser is the sauce.\" I also don't really enjoy having to say \"jam sesh,\" but that's beside the point. That phrase spawned some terrible memes, but it got to a core belief that's helping power the development of self-driving cars, a huge multi-billion dollar science experiment that could potentially change the way we get around forever. And that core belief is that lasers or rather LiDAR is the secret sauce that could really crack this incredibly complex problem of autonomous vehicles wide open. There's a big debate between companies who use LiDAR and the one company that doesn't, and it all comes down to a question: how self-driving do we need our self-driving cars to be? I'm Andrew Hawkins, and this is your status update. (upbeat, funky music) Before we get to that, we have to address the autonomous elephant in the room. A lot of people think that self-driving cars are just fully a scam. That they're basically vaporware from billion dollar companies who have been promising a fully driverless future for decades, but never deliver. All those viral clips of self-driving car fails in San Francisco certainly help paint this picture. - [Thorn] Yeah, we got a Cruise vehicle. Nobody in the car, no place for us to go. - [Cameraperson] Everyone's getting off the bus. There's no one driving the car. - No, self-driving cars are not poised to suddenly take over the world. And yeah, the AV industry is struggling. Thousands of employees have been laid off, timelines has stretched into the future with no visible endpoint. Some companies have even shut down completely after losing all their funding. But true driverless cars, companies like Waymo and Cruise, they're in San Francisco and Phoenix, and they're picking up real passengers and taking their money for trips, right now. And part of the reason that they're able to navigate these complex environments is because they use a lot of sensors, including cameras, radar, and ultrasonic sensors to create 3D renderings of their environment. But most critically, they use LiDAR. Travis Kalanick's laser sauce. LiDAR stands for light detection and ranging. It works by sending out a pulse of light waves that bounce off of objects and return to the sensor. LiDAR uses the time it took for each pulse to return to the sensor to calculate distance traveled, and that way it can measure how far away an object is. A typical LiDAR pulse contains thousands of beams of infrared laser light. These pulses create point clouds, which can be used to create 3D renderings of the environment, and the result is a much more detailed 3D map of the world than cameras and other common sensors can offer. It even works at night, when cameras alone are essentially blind. Cars like Waymo's still use the full complement of sensors, and the vehicle's brain fuses all the data together to get the best possible view of reality. LiDAR isn't just for autonomous cars. Lately it's been showing up in a lot of different places, like iPhones and iPads, and the new Vision Pro augmented reality headset that Apple just unveiled. It's being used in farm equipment, in warehouse vehicles, and in aviation. LiDAR companies like Luminar are working to put their sensors into vehicles that you can buy yourself. LiDAR is going mainstream, but not everyone thinks that LiDAR is the sauce. (door slams) (seatbelt buckle clicks) Tesla, the most aggressive company in pushing autonomous tech on its customers, doesn't include LiDAR in its vehicles. And Elon Musk has been talking all kinds of trash about LiDAR in recent years. Here's what he said in 2019. - And anyone left relying on LiDAR is doomed. Expensive sensors that are unnecessary. It's like having a whole bunch of expensive appendices. - And he's criticized Google's approach, which includes LiDAR. In a CNBC interview from earlier this year, he bragged that Tesla's vehicles are more powerful than Google's because they can drive in more places. So if LiDAR is so powerful, what's that about? Well, Tesla's vehicles used to include a bunch of different sensors, but Elon Musk decided it was too complex and too expensive, so he ripped everything out but the cameras. The truth is that LiDAR just doesn't work for Tesla's business model. Elon Musk wants to sell cars to lots of people, cars that he promises will become fully autonomous someday. But including LiDAR would just make them too expensive for most people to afford. Now, the price of LiDAR has dropped dramatically in recent years, from around $75,000 a pop to now around $6,000. But the tech is basically incompatible with Tesla's balance sheet. For all of Elon's claims about the future, Tesla's present tech is still just driver assist. Autopilot and full self-driving still require the driver to pay attention to the road and take over when something goes wrong. And when it does, the driver's the one liable for whatever happens. If a Waymo or Cruise crashes, the companies are liable for the damage. In other words, robo taxi companies aren't selling cars to people, so they can afford to add LiDAR to their vehicles. Tesla still needs people behind the wheel because it needs people to buy its cars. Waymo and Cruise just need people to ride in them. That's the difference that LiDAR makes. Another difference is car crashes. More specifically, the severity of the crash. When Waymo vehicles crash, they tend to be pretty minor, like low speed rear end collisions. The company only reported two crashes and 18 minor contact events after driving 1 million fully driverless miles in California and Arizona. The number of people injured in those incidents? Zero. The number of people injured in Tesla vehicles using autopilot? Very much not zero. According to federal crash data, Tesla vehicles using autopilot were involved in 736 crashes since 2019. 17 people died in those crashes, including 11 since May 2022. Experts told the Washington Post that the removal of some sensors, including radar, appear to have contributed to the increased number of incidents. Now, there are a lot more Tesla vehicles on the road than Waymo vehicles, and Tesla's aren't geofenced to specific areas like Waymo. And we're not saying that radar or even LiDAR would've prevented any of these crashes from taking place. But if you're comparing the two companies, Waymo's cars arguably can see more of the world than Tesla's, and that's partly because of the sensors. (mellow music) So what happens if LiDAR suddenly becomes so cheap it pays for itself? Will Elon flip flop on his LiDAR skepticism? Musk isn't anything if not unpredictable, but that would be a huge reversal on his part if he went and added LiDAR to his cars. But if he wants Tesla to ever be fully autonomous, not just use fancy driver assist systems like autopilot and full self-driving, he may have to accept LiDAR in his heart. It doesn't have to be the whole sauce, but it certainly could be one of the most important ingredients. I'm sure you're tired of listening to me talk about sauce, but we'd love to hear from you about self-driving cars. Do we need self-driving cars? There's lots of questions about the relevancy of driverless technology, so let us know what you think in the comments below.",
    "transcript_keywords": [
        "LiDAR",
        "Tesla",
        "selfdriving cars",
        "cars",
        "Tesla vehicles",
        "Waymo",
        "selfdriving",
        "vehicles",
        "Waymo sued Uber",
        "stealing trade secrets",
        "people",
        "sensors",
        "companies",
        "Elon Musk",
        "trade secrets",
        "Waymo vehicles",
        "car",
        "Elon",
        "sauce",
        "Cruise"
    ],
    "transcript_entity_values": [
        "11",
        "Elon",
        "18",
        "Waymo",
        "multi-billion dollar",
        "one",
        "Apple",
        "Waymo",
        "iPhones",
        "LiDAR",
        "1 million",
        "today",
        "Tesla",
        "the Washington Post",
        "Google",
        "Thousands",
        "California",
        "Arizona",
        "iPads",
        "around $75,000",
        "late night",
        "17",
        "Vision Pro",
        "night",
        "Phoenix",
        "thousands",
        "CNBC",
        "two",
        "736",
        "billion dollar",
        "Elon Musk",
        "Cruise",
        "2019",
        "2018",
        "Travis Kalanick's",
        "Waymo",
        "Luminar",
        "decades",
        "Andrew Hawkins",
        "AV",
        "recent years",
        "May 2022",
        "Travis Kalanick",
        "San Francisco",
        "Waymo and Cruise",
        "Zero",
        "Waymo",
        "Will Elon",
        "around $6,000",
        "earlier this year"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "GPE",
        "ORG",
        "MONEY",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "NORP",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE"
    ],
    "vector": [
        -0.06419473886489868,
        -0.00697775324806571,
        0.00855232123285532,
        -0.01310854684561491,
        0.023955559358000755,
        -0.0775979608297348,
        0.03529973328113556,
        0.014318868517875671,
        -0.026618996635079384,
        -0.010910892859101295,
        -0.037240076810121536,
        0.06616715341806412,
        0.020802678540349007,
        0.008279715664684772,
        -0.01689869351685047,
        -0.005858332850039005,
        0.08059047907590866,
        -0.02389444038271904,
        -0.01700069010257721,
        0.0415419302880764,
        -0.015622553415596485,
        0.03407574072480202,
        0.03548960015177727,
        0.03829824551939964,
        -0.0746651291847229,
        0.0236660186201334,
        -0.03924407809972763,
        -0.059213679283857346,
        -0.06299956887960434,
        -0.042124394327402115,
        -0.018851544708013535,
        0.06226092576980591,
        -0.06491423398256302,
        0.029676903039216995,
        -0.08613742142915726,
        -0.0819978341460228,
        0.00571774784475565,
        0.017090924084186554,
        -0.030293069779872894,
        -0.12072589993476868,
        0.022585226222872734,
        -0.11795616149902344,
        -0.060064442455768585,
        0.00961004476994276,
        0.040538255125284195,
        0.029666973277926445,
        0.08489784598350525,
        -0.06221076101064682,
        0.03194659948348999,
        -0.05179149657487869,
        -0.07544650882482529,
        -0.0659402534365654,
        0.0278425645083189,
        -0.05318274348974228,
        -0.03370827063918114,
        0.007937077432870865,
        -0.050351668149232864,
        0.09071304649114609,
        0.014596190303564072,
        0.03982190415263176,
        0.05067209526896477,
        -0.043432965874671936,
        -0.03833071514964104,
        0.04123392701148987,
        0.03931836783885956,
        -0.01288524642586708,
        0.0069427997805178165,
        -0.006221815012395382,
        -0.03650885820388794,
        -0.017260078340768814,
        0.08016097545623779,
        0.0019041020423173904,
        0.030812934041023254,
        -0.031142108142375946,
        0.029884163290262222,
        -0.06162283942103386,
        0.06751326471567154,
        0.019455911591649055,
        -0.0019272534409537911,
        -0.058831337839365005,
        0.09911219030618668,
        0.044757112860679626,
        -0.019898662343621254,
        0.05927964299917221,
        -0.018997780978679657,
        -0.08486522734165192,
        -0.024449722841382027,
        0.021754728630185127,
        0.059491850435733795,
        -0.0475940927863121,
        -0.06837382912635803,
        -0.021101778373122215,
        -0.0472356341779232,
        -0.038189440965652466,
        0.05360710248351097,
        -0.018605615943670273,
        0.0163420420140028,
        -0.015430117025971413,
        0.011692432686686516,
        -0.0076952287927269936,
        0.05432925373315811,
        -0.038989584892988205,
        -0.06576123833656311,
        -0.020767496898770332,
        -0.007954101078212261,
        0.047294504940509796,
        0.012650232762098312,
        0.0019436809234321117,
        0.06769556552171707,
        0.061531610786914825,
        0.01493242010474205,
        -0.0012536004651337862,
        -0.02081809751689434,
        0.02067633531987667,
        -0.04034920781850815,
        0.004426328931003809,
        -0.021220427006483078,
        0.0803942158818245,
        0.08292290568351746,
        0.03995080664753914,
        -0.0961381122469902,
        -0.017260657623410225,
        0.09370829910039902,
        -0.0008569421479478478,
        0.08403022587299347,
        0.003852659137919545,
        -0.08894501626491547,
        1.5453458322222656e-33,
        -0.0666232630610466,
        0.08142014592885971,
        -0.003470553318038583,
        -0.009377692826092243,
        0.049266181886196136,
        -0.007689046207815409,
        -0.040934979915618896,
        0.011141885071992874,
        -0.08402831107378006,
        0.01659243367612362,
        -0.05836504325270653,
        0.07213138043880463,
        -0.08106061816215515,
        0.05450259521603584,
        0.12299155443906784,
        0.02342524565756321,
        -0.09166128933429718,
        -0.0423947349190712,
        -0.11740356683731079,
        -0.09172092378139496,
        0.03484443947672844,
        7.178251053119311e-06,
        0.04546564444899559,
        0.04968421161174774,
        0.10061316937208176,
        0.002947151428088546,
        0.0708010196685791,
        -0.021282488480210304,
        0.015585965476930141,
        0.03869624808430672,
        -0.05053512379527092,
        0.09671290218830109,
        -0.04014081135392189,
        0.07622529566287994,
        0.03402804583311081,
        0.06969590485095978,
        -0.10883069783449173,
        -0.05520419776439667,
        -0.0581706203520298,
        -0.02980281040072441,
        -0.020176777616143227,
        -0.045957017689943314,
        -0.05762866511940956,
        -0.06972744315862656,
        -0.08512331545352936,
        -0.01614736020565033,
        -0.042011190205812454,
        0.030928924679756165,
        0.00014989239571150392,
        0.002420231467112899,
        -0.016693763434886932,
        0.030068909749388695,
        -0.08302789181470871,
        -0.055827997624874115,
        0.00833360105752945,
        0.0009367250604555011,
        0.005227444227784872,
        -0.00017285057401750237,
        0.04199207201600075,
        -0.03691589832305908,
        -0.07176205515861511,
        -0.014680004678666592,
        0.019215548411011696,
        0.039310455322265625,
        -0.04801672697067261,
        0.022914143279194832,
        0.05457655340433121,
        0.07422332465648651,
        -0.013943969272077084,
        0.05778361111879349,
        -0.01854872889816761,
        -0.013435731641948223,
        -0.06281023472547531,
        0.026297451928257942,
        0.03419511765241623,
        0.014222830533981323,
        -0.02630718983709812,
        0.010775720700621605,
        -0.007178216241300106,
        0.06299808621406555,
        0.011941004544496536,
        0.05176275223493576,
        0.004724068567156792,
        -0.031791556626558304,
        -0.028008705005049706,
        0.01819945126771927,
        -0.035175543278455734,
        -0.020887648686766624,
        0.01038715336471796,
        0.07534166425466537,
        -0.016767557710409164,
        -0.0029207656625658274,
        -0.030227847397327423,
        0.018891243264079094,
        -0.11504150182008743,
        -3.8152403010104804e-33,
        -0.034813832491636276,
        -0.04818969592452049,
        0.03813047334551811,
        0.04075852409005165,
        0.052284255623817444,
        -0.02850785292685032,
        0.016858788207173347,
        -0.09108306467533112,
        0.08865664154291153,
        0.03986729308962822,
        -0.07401659339666367,
        0.04080851748585701,
        0.11060549318790436,
        0.06303247809410095,
        0.016138076782226562,
        -0.056493885815143585,
        -0.005948220379650593,
        -0.15069307386875153,
        -0.08568839728832245,
        -0.03631768748164177,
        0.03517637029290199,
        0.021819036453962326,
        -0.11452319473028183,
        0.0315450020134449,
        -0.018729109317064285,
        0.008831588551402092,
        -0.023359710350632668,
        0.11345034837722778,
        0.016229845583438873,
        -0.008857550099492073,
        -0.03699903562664986,
        0.01450404990464449,
        0.0002405242994427681,
        -0.04129316657781601,
        0.08138154447078705,
        0.10227888077497482,
        -0.007936857640743256,
        -0.014008678495883942,
        -0.050989530980587006,
        -0.02646474726498127,
        0.004776084795594215,
        -0.030678531154990196,
        0.042537759989500046,
        -0.06316433101892471,
        -0.0006734492490068078,
        -0.06798270344734192,
        -0.03677978366613388,
        -0.015801459550857544,
        -0.01936917006969452,
        0.010336591862142086,
        0.05510874092578888,
        0.03186887130141258,
        -0.02847449854016304,
        0.03872004523873329,
        -0.011870110407471657,
        0.01387868169695139,
        0.03288087993860245,
        0.03867502510547638,
        -0.01599881984293461,
        0.04451874643564224,
        0.03247189149260521,
        0.029896697029471397,
        0.0003228974237572402,
        0.019390834495425224,
        -0.06533748656511307,
        -0.09288834035396576,
        0.004497612826526165,
        -0.06763947755098343,
        -0.004633653908967972,
        0.016801191493868828,
        0.08226687461137772,
        -0.045325007289648056,
        -0.0006865003961138427,
        -0.01590181514620781,
        -0.048029575496912,
        0.022045988589525223,
        0.01938561350107193,
        0.015106778591871262,
        -0.06188899278640747,
        -0.037704337388277054,
        0.11926421523094177,
        -0.001280681579373777,
        0.11525821685791016,
        0.09824119508266449,
        0.030853040516376495,
        0.04861078038811684,
        -0.015401842072606087,
        0.026292582973837852,
        -0.028469083830714226,
        0.08100391924381256,
        0.04082237556576729,
        -0.025073623284697533,
        -0.11049754172563553,
        0.0982903391122818,
        -0.06969364732503891,
        -5.503182265442774e-08,
        -0.037720199674367905,
        0.04530632123351097,
        0.013655735179781914,
        -0.012659190222620964,
        0.019974615424871445,
        0.023911263793706894,
        0.11136054992675781,
        0.06832269579172134,
        -0.10529395192861557,
        -0.003060078015550971,
        0.03481176123023033,
        -0.08634818345308304,
        -0.03003944456577301,
        0.06228424608707428,
        0.03105146996676922,
        0.04166821017861366,
        0.0003792924399022013,
        -0.015832891687750816,
        -0.030540278181433678,
        0.027628611773252487,
        0.025578847154974937,
        -0.011729167774319649,
        -0.05103151500225067,
        0.013042519800364971,
        0.0031917067244648933,
        0.014771665446460247,
        -0.07370129972696304,
        -0.009345526807010174,
        0.035023629665374756,
        -0.013195586390793324,
        -0.10251154005527496,
        0.03459281101822853,
        0.07662994414567947,
        0.02349049039185047,
        -0.04644811153411865,
        -0.011502321809530258,
        0.049574803560972214,
        0.01963445357978344,
        0.05611938610672951,
        0.011190125718712807,
        0.05061859264969826,
        0.06250680983066559,
        -0.012202911078929901,
        0.02160576544702053,
        -0.07574530690908432,
        0.0032539560925215483,
        -0.08717449754476547,
        -0.08943948894739151,
        -0.046160873025655746,
        0.07067137956619263,
        0.07647404074668884,
        -0.055213600397109985,
        0.03220166265964508,
        0.09952111542224884,
        0.06225396320223808,
        0.015694579109549522,
        -0.014571295119822025,
        -0.09040555357933044,
        -0.011262373998761177,
        0.045260656625032425,
        0.0203411728143692,
        -0.00863324012607336,
        0.044340748339891434,
        0.08040449023246765
    ]
}