{
    "id": "pV3QT6iVfcM",
    "title": "I bought a NEW Windows 98 PC! Nixsys",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-09-06T15:13:50Z",
    "video_url": "https://www.youtube.com/watch?v=pV3QT6iVfcM",
    "category": "Science & Technology",
    "tags": [
        "nixsys",
        "windows",
        "windows 98",
        "windows 95",
        "pc",
        "computer",
        "austin",
        "austin evans",
        "microsoft",
        "bob",
        "microsoft bob",
        "diablo",
        "starcraft",
        "retro",
        "vintage",
        "gaming",
        "system"
    ],
    "views": 362428,
    "likes": 13213,
    "comments_count": 881,
    "description": "Buying Pawn Shop Tech:  The \"Refurbished\" Steam Deck:   Nixsys:   Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 What is NIXSYS? 1:21 Building My Windows 98 PC 2:31 How They Build It 3:17 Unboxing 4:58 Inside the PC 7:37 The 1998 Specs 8:47 Trying the PC 10:40 Enter Bob 12:44 Using Microsoft Bob 14:32 Windows 98 Gaming",
    "description_links": [
        "https://youtu.be/nu-GKUd4wxs",
        "https://youtu.be/jRwpOjThBYc",
        "https://nixsys.com",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- So when I saw an ad offering to sell me a brand new Windows 98 computer, I couldn't help but investigate. So this company is known as NIXSYS, and they have a few things including they advertise legacy computers, also custom built industrial systems which I don't even know what the point of that is. But essentially they'll build you a computer from Windows 10 all the way down to like 7, XP. I get the idea that if you're like a business or you have a piece of software that requires Windows 98 that you would need a newer computer to maybe replace something that's been sitting around for 20, 25 years. But I'm just very curious on like where do they source these from? Is this actually a new computer? Are they just building it from like refurbished components? Holy, $1,100! The fact that they're charging, $850 is the cheapest model that they've got. Oh, they have servers so we can buy motherboards too which does kind of make sense. Have they rebadged these? Oh, $465! Oh my god, they're not building new motherboards, are they? They just give you the ISO files for like Windows XP and like Windows NT and Windows 98. What! Is that legal? Could they just just, oh, okay. They also have drivers for all the motherboards. So if you buy this stuff you can just grab whatever you want. Let's build a computer. Let's go with Windows 98. I think Windows 98 is the right move. I'm gonna go with one of the actual desktops. I kind of wanna do a smaller one. What about the micro workstation? When Windows 98 was out, I didn't really have it, 'cause I was like six years old and I didn't really have a computer at the time. So this is gonna be new. For context, I grew up with Windows XP. That was the first computer that we had at the house. That was what I used. So this is a little bit before my time. So it starts out at $865 for not a lot. You don't get a lot for 865 bucks. I think they're really charging you that for the motherboard. So we've got chassis, motherboard, yada yada yada. So we've got ourselves a Intel Pentium III one gigahertz processor. So we'll spend $15 on a 512MB RAM update. It does come with a Rage ATI Graphics card. So if you're not familiar, ATI is what AMD used to be before the CPU and the GPU sides kind of merge. Previously AMD made CPUs, ATI made GPUs and then a AMD bought out ATI and created a larger company that we know today. But before that, they made the RAGE XL Graphics card for Windows 98. And this my friends, is my brand new Windows 98 computer. So after placing the order for the system I emailed NIXSYS basically saying, Hey, I'm a YouTuber. I would love to actually come and take a look. And they were very gracious in allowing me to not only pick this up in person at their office but they also gave me a tour of their facility. And honestly what these guys do is way above what I thought. What's really interesting about these guys is that this is a small niche, right? Not a lot of people need a brand new Windows 95 or 98 computer, but there are a lot of businesses there are a lot of corporations that rely on not only older software but also older hardware. Imagine you've got yourself a CNC machine that's worth $200,000. Well if the computer that's running it goes down you can't exactly go plug in a Windows 11 box. All right, I am very, very high-key excited to open this up. So I actually got to meet the guy who built this system. It's just so cool. Like I have so much appreciation for what these guys do. Like I 1000% going into this video thought that they're basically a company who just recycle and refurbish like old systems and resell 'em. But that's not what they're doing at all. Like, this is almost entirely new components. So they were very gracious to include not a a mouse but also the keyboard, important because I don't think this system has USB, maybe it has a couple USB ports, but this is a PS2 mouse and keyboard which is very important for our system. This actually might be my first time trying Windows 98 on camera. So the chassis doesn't look particularly old and that's because it kind of isn't. So this is a modern style of chassis, but it has been customized by NIXSYS. So we've got ourselves a 3.5 inch floppy disc. We also have a DVD drive, which I'm not entirely sure. I think Windows 98 was the first version of Windows to support DVDs. Other than that, it does have a little NIXSYS branding on the front. We've got some ventilation on the side and here where we get a little bit more spicy. So let me go through these ports. So we actually do have USB ports. Okay, so this does support USB, which is fair enough. We also have our mouse and keyboard PS2 slots. So while this should work with a USB mouse and keyboard they actually did include both a PS2 keyboard and mouse. We've got ourselves VGA for onboard graphics although this is optioned with our graphics card. We've got ourselves serial, we've got ourselves audio. We've got ourselves a 100 megabit ethernet card. So open it up. You have these little like flippy guys. I mean it's still actually screwed together but you could like literally just like pop it open. That's actually kind of neat. The moment of truth. Let's take a look at our system. That's so red! I didn't realize how red that one's gonna be. Yo. So this is, for all intents and purposes, a brand new Windows 98 computer. Whoa, whoa, whoa. Okay, hold, I gotta like take this in for a second. So bunch of stuff here. So going from the top to the bottom we do have a power supply. So there's a 300 watt power supply, but even this power supply is not a standard off the shelf component. It has a minus 12 volt rail which is not something that any modern power supply has but I assume you need for the motherboard or something? So they have to have these custom made for the power supplies. Right here we've got ourselves a one terabyte WD blue. And because it is a modern SATA hard drive, it actually does have a SATA to IDE adapter on it. Again, as I'm gonna say a lot in this video, this is based on a lot of older tech. So this motherboard does not support SATA, which is already kind of old at this point. But instead uses the predecessor, which is IDE. We also got Molex, Molex, Molex. This is the only acceptable time when Molex is allowed. All right? If you're using Molex on your RGB hub in 2023, stop it. - Get some help. - We've also got on top here it's another Molex to SATA adapter for our DVD drive and it looks like, yeah, so the actual floppy disk. So looking at this floppy disk drive, it does look older although it is apparently new. So what they're telling me is that they source components from a bunch of different places, the logistics of running a business like NIXSYS would keep me up at night. Because not only are you having to remanufacture stuff so you've gotta call factories who like Hey remember when you made this motherboard in 1999? Can I go order 10,000 of them please? And then you gotta wait months, you gotta, you know, hold all this inventory and even some stuff that, I had no idea you could still get. So this right here is a 512 megabyte stick of RAM. I'm gonna open this up. This is, and I cannot believe that this is true. A brand new stick of RAM. Look at that. It looks absolutely ancient. In fact, actually it looks, it actually looks cool. Wow. Yeah, that you know what? It looks way cooler than like regular RAM, look, it's like double sided. There's no funny business there. It's just straight RAM. This, even though again the last time anyone realistically probably bought a new system with this was like 20 plus years ago they are still able to source this brand new. You're not using old RAM you're not using any old components. The only component that I was told that is used in the system is the Intel Pentium III processor which obviously Intel are not making new Pentium III processors anytime soon. Oh you know what actually, there's one other thing that's not new. Let me, lemme pull that off. So if you take a look here there are a couple of expansion slots. So we have three PCI slots, which is where we have our graphics card as well as our ethernet. But down here we have an ISA port. Now this is the predecessor to PCI which is the predecessor to PCI Express which is what you would plug your graphics card into today. If you've bought a graphics card the last 20 years, then you probably haven't seen one of these lately. This my friends, is the ATI RAGE XL. This is what graphics cards used to look like. To tell you how far we've come on graphics, this is the entire GPU of the system. So we've got ourselves the actual GPU and we have some memory of some amount probably a megabyte or two, it's not gonna be a lot. And then we have a single VGA. This is it. This is completely unmodified. It just show how far we've come because there's no heat sink or fans or anything. It's just the GPU just sitting right there letting air cool it off. So I was gonna say that we have acquired a period correct CRT for the proper Windows 98 experience. But that's a damn lie. This CRT was made a full decade after this system. This is a 2006 CRT. Obviously Windows 98 is from 1998. So, an almost period correct setup. Oh, I hear all like the hard drives and everything just, oh, and the monitor's coming up too. Yo, let's go Windows 98 baby! It probably looks really bad on camera, doesn't it? Here's the thing, to my eyes, it's a beautiful image of Windows 98. When we actually like play some games and stuff, we'll probably swap over to another monitor. But for now, I want to appreciate our old school system with the greatest technology of all time. And there we go. We're up and running. We've got ourselves Windows 98. We've got Internet Explorer. I also see our little ATI. You know what? I'm not gonna lie, that booted up way faster than I thought. There we go. That's the screen saver right there. You know, I really enjoy doing these old school videos and just like, I haven't seen this stuff in forever. We used to have a Windows 98 computer at school and I remember one of my classmates was a complete freaking moron. And so here's the thing if you've never used a CRT before, they're really cool. But one of the downsides is that they are highly allergic to magnets. And so my stupid classmate would take a magnet and wreck the screen and my teacher would get so mad. We had one computer in the whole school. It was in my classroom. And he is like, he, he, he, my teacher was about to like throw him outside. In a lot of ways, Windows 98 was one of the first OSs that was kind of meant to be online, right? I mean there's obviously internet compatibility with some earlier devices, but like, this actually has Internet Explorer 5 installed. Wow, I didn't realize that 98 went that far. So to properly put our brand new Windows 98 computer through its paces, it is time to go back in time. Whoa, whoa, whoa. It was actually boxed. Oh, I thought it was just everything individually. Okay. So when we started talking about doing this video, it's one thing to show the computer and obviously it's very cool what NIXSYS are doing but it's another thing to actually do something with it. And while we're gonna play some games and whatnot we were able to get a apparently boxed copy of Microsoft Bob. It's like even an emoji before emojis we're a thing. I'm gonna be super honest with you. I don't fully understand how this works because it's got, if you look on the back, it's got a bunch of stuff. So you've got a calendar, a letter writer. The way it works, though, is that your desktop is like an actual desk and the things you wanna do are all the things on your shelf. Like this is really designed to very much kind of ease someone who does not know anything about computers into, well, using a computer. This was released back in 1995. So the box is in incredibly good shape, I'll say. Someone took care of it and oh my goodness. Oh, oh, okay. So before you got your software on CDs, you got it on floppies. And for this we've got 1, 2, 3, 4, 5, 6, 7, we've got eight floppies, which has our Microsoft Bob on it. I'm like, I can't believe how cool this all is. Like someone got this back in 1996, apparently, January of 1996 and kept everything absolutely pristine. Oh, I haven't heard that noise in so long. Chunk! So here's the thing. Bob was not beloved. People thought it was a dumb idea but it did bring some really important things to Windows. This is the birth of the Comic Sans font. Yes. This beautiful font right here. And this is where Clippy got started. Yeah, buddy. Clippy. Time to experience the Bobinator. Oh my God, that's, wow. Wow. That's a graph. Okay, we're good. Good afternoon. Click on the door to sign in. Okay. What's a password all about? Oh my God, they have to explain what a password is. Yikes. I'll see you inside. Oh wow. There we go. We are now in my home. I've got myself a calendar. I've got myself encyclopedia. Oh, it's a decorative object. It doesn't do anything. Okay. I will say there's a problem with this. There's no like indication of what's actually clickable and not. What else can I do? Can I move stuff? Oh. Oh, you can just grab stuff. Oh my. Oh dude. Okay, that's kinda cool. I found a vault! There's a vault behind the calendar. What's in the vault? Oh I got a secret spot! I, this is really dumb, but it's kind of cool. All right, what kind of car am I gonna buy? Oh wow. It actually tells me, so like, it's actually like advice. Okay, maybe I'm starting to see why Bob wasn't actually super expensive for us to find a box copy of. I get the idea. Microsoft Bob was a very, very poor idea. Even giving them the benefit of hindsight. I understand why everyone hated this, because like it is oversimplified to an extreme degree. There is no freedom at all. It's like basically like you're constantly being like handheld by Clippy or Mr. Doggy clip dude or whatever. You're being handheld the entire way through. So you can do a lot of stuff with this. Or you could just install actual real things like Microsoft Works or whatever and do pretty much all these exact same things just without the annoying interface and the constant handholding. Like, I can't do anything without following all this stuff. Like it's like, Hey, do this, do this, do this. You know, we also could play some games too. Let's play some Diablo. Diablo came out in 1996. I always thought it was later than that. Mattio. Wait, did Matt already play? Matt already played Diablo, didn't he? You know what, this loads really fast. You know, I will say the game looks like we're running at some good settings. The sum of our knowledge is, and the sum of its people. Should you find a book or scroll that you cannot decipher, do not hesitate to bring it to me. Oh this. Oh, dungeon time. Ah, get 'em, get 'em, get 'em! There we go. I believe my friends, it is time to play StarCraft. It's funny. So one of the things I know that a lot of people like about older systems like this is the fact that you can use the PS2, like mouse and keyboard. If you're playing on a CRT, you actually find that like the input latency is incredibly minimal. Oh no, hell no. Hell no, no. Nah, nah, nah, nah, nah, nah. That's way too many dudes. It's starting to.. Ah, no no, no, no. Go away! Go around and get around and get around and go! Go, go get 'em, get go, go, go, go, go! No, you do... what are ya doing? They're right there! They're right there! Get them! Get them! Yeah! We got it!! Oh no, there's another one. Okay, well thank you very much for watching this episode of Austin loses his mind in StarCraft. I will say though, NIXSYS is dope. I am so happy to see that, while it's obviously not for everyone, someone is out here not only keeping the dream alive for old hardware and software that simply just doesn't exist anywhere else. But on top of that, they're actually building these things right. They're building it with new components. They're actually manufacturing new like motherboards and stuff. And that is incredibly cool. Maybe though we can leave Microsoft Bob back in 1995.",
    "transcript_keywords": [
        "Windows",
        "computer",
        "stuff",
        "lot",
        "kind",
        "system",
        "time",
        "NIXSYS",
        "Graphics card",
        "brand new Windows",
        "Microsoft Bob",
        "Graphics",
        "ATI",
        "things",
        "Molex",
        "RAM",
        "cool",
        "thing",
        "Intel Pentium III",
        "Bob"
    ],
    "transcript_entity_values": [
        "WD blue",
        "six years old",
        "first",
        "Explorer",
        "1",
        "two",
        "Matt",
        "3.5 inch",
        "2023",
        "20 plus years ago",
        "one",
        "1,100",
        "1996",
        "CNC",
        "3",
        "NIXSYS",
        "7",
        "GPU",
        "Pentium III",
        "Molex",
        "865",
        "10,000",
        "865 bucks",
        "afternoon",
        "Internet Explorer 5",
        "1999",
        "Windows 98",
        "USB",
        "SATA",
        "a full decade",
        "Austin",
        "StarCraft",
        "2006",
        "a megabyte",
        "Windows 95",
        "PCI Express",
        "1000%",
        "Doggy",
        "Windows XP",
        "7",
        "XP",
        "PCI",
        "Yo",
        "12 volt",
        "512 megabyte",
        "2",
        "Microsoft Bob",
        "today",
        "ISO",
        "1995",
        "AMD",
        "CRT",
        "Molex",
        "98",
        "1998",
        "850",
        "eight",
        "ISA",
        "RGB",
        "Windows 10",
        "StarCraft",
        "Microsoft",
        "CPU",
        "the last 20 years",
        "January of 1996",
        "20, 25 years",
        "15",
        "Microsoft Works",
        "three",
        "months",
        "Bob",
        "Clippy",
        "ATI",
        "RAM",
        "4",
        "6",
        "Windows 11",
        "Windows",
        "512",
        "second",
        "465",
        "300 watt",
        "Intel",
        "VGA",
        "100 megabit",
        "200,000",
        "5",
        "NIXSYS",
        "IDE"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "TIME",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.06026110425591469,
        0.05894993618130684,
        -0.01228342019021511,
        -0.0905391052365303,
        0.04721324145793915,
        -0.024868257343769073,
        0.019659247249364853,
        0.07013555616140366,
        -0.07389163970947266,
        -0.06028420850634575,
        -0.04543168842792511,
        0.05840471386909485,
        0.006254744250327349,
        0.0034506272058933973,
        0.024574773386120796,
        -0.04178117215633392,
        0.010653297416865826,
        -0.05910531431436539,
        -0.03712504729628563,
        -0.02455390989780426,
        -0.044504906982183456,
        -0.01842653565108776,
        -0.08091291040182114,
        -0.06407956779003143,
        -0.030861422419548035,
        -0.018000079318881035,
        -0.005236010532826185,
        -0.0255340114235878,
        -0.029189158231019974,
        0.06530953198671341,
        -0.026611948385834694,
        0.06176748871803284,
        0.004067768808454275,
        0.05588449910283089,
        0.0198979489505291,
        -0.08905971050262451,
        0.08341025561094284,
        0.028404412791132927,
        -0.07188703119754791,
        -0.03555682674050331,
        -0.004259639419615269,
        -0.021698683500289917,
        -0.07426750659942627,
        0.062101222574710846,
        -0.03233456611633301,
        0.0985850840806961,
        0.014085150323808193,
        -0.0669834241271019,
        -0.0035109766758978367,
        -0.004985680337995291,
        -0.09667133539915085,
        -0.053416501730680466,
        0.010210350155830383,
        -0.03784957155585289,
        -0.049595367163419724,
        -0.03487906605005264,
        0.04456266760826111,
        0.0015942914178594947,
        -0.06704574823379517,
        -0.07841769605875015,
        0.09016511589288712,
        -0.07119295001029968,
        -0.017740828916430473,
        -0.0016721567371860147,
        0.029711829498410225,
        0.03166859969496727,
        -0.07832613587379456,
        -0.033064357936382294,
        -0.024889059364795685,
        -0.10413042455911636,
        0.013636842370033264,
        -0.0909261479973793,
        -0.06770259141921997,
        0.06594571471214294,
        -0.043073903769254684,
        -0.03752133622765541,
        0.07230877131223679,
        0.028590058907866478,
        -0.007009441964328289,
        -0.026367081329226494,
        0.0262473002076149,
        0.07535447925329208,
        -0.007851652801036835,
        -0.03888407722115517,
        -0.07326678186655045,
        0.05998599901795387,
        -0.05364276468753815,
        0.03720417618751526,
        0.044398192316293716,
        -0.03886888176202774,
        -0.0017086336156353354,
        -0.09292929619550705,
        0.003985193558037281,
        0.020261162891983986,
        0.11783807724714279,
        0.017052197828888893,
        0.06649736315011978,
        -0.0013847274240106344,
        0.04544645920395851,
        0.036587778478860855,
        -0.016916437074542046,
        0.006221903022378683,
        0.06855733692646027,
        -0.03664093837141991,
        -0.0297230277210474,
        -0.025045059621334076,
        -0.04034629464149475,
        0.03328859433531761,
        -0.028310120105743408,
        -0.02685827575623989,
        -0.03773266449570656,
        -0.015150605700910091,
        -0.009015521965920925,
        -0.01946883462369442,
        0.03788693994283676,
        -0.11086191982030869,
        -0.09818285703659058,
        0.07698622345924377,
        0.015911007300019264,
        0.008019069209694862,
        0.10041967779397964,
        0.018257979303598404,
        -0.010133778676390648,
        0.0011509626638144255,
        0.027553992345929146,
        0.03054465353488922,
        -0.047692034393548965,
        4.601564839131987e-33,
        -0.057706352323293686,
        0.07826672494411469,
        -0.049274347722530365,
        0.0357501395046711,
        0.014805528335273266,
        0.0027157410513609648,
        0.0028806705959141254,
        0.05028684437274933,
        -0.0648161768913269,
        0.07155907154083252,
        -0.02250278741121292,
        0.04680473729968071,
        -0.011556636542081833,
        0.0013463720679283142,
        0.0854194164276123,
        -0.0006726505234837532,
        -0.015902943909168243,
        0.055630337446928024,
        0.05216027423739433,
        -0.06495413184165955,
        0.055554140359163284,
        0.0797802209854126,
        -0.002800174755975604,
        -0.07441077381372452,
        0.06931652128696442,
        -0.06384487450122833,
        -0.06597355753183365,
        0.002621258841827512,
        0.07068070024251938,
        -0.015586079098284245,
        -0.02090442180633545,
        0.024144351482391357,
        -0.014262537471950054,
        -0.021151818335056305,
        -0.022906744852662086,
        0.0454060360789299,
        -0.03685113787651062,
        -0.134280264377594,
        0.055472612380981445,
        -0.0036918825935572386,
        -0.014783882535994053,
        0.055911917239427567,
        -0.037640154361724854,
        -0.046781670302152634,
        0.07063304632902145,
        -0.021882515400648117,
        0.024937951937317848,
        0.007907012477517128,
        0.01863682270050049,
        -0.012160032987594604,
        -0.054133545607328415,
        0.024535952135920525,
        0.014158612117171288,
        0.08570322394371033,
        -0.0986967533826828,
        -0.09644276648759842,
        0.05962780490517616,
        -0.0961313545703888,
        0.053940776735544205,
        0.015594090335071087,
        0.07198838144540787,
        -0.027834635227918625,
        -0.00016682122077327222,
        -0.026934439316391945,
        -0.0019071687711402774,
        0.0066237617284059525,
        0.11127886176109314,
        0.06479480117559433,
        -0.044656768441200256,
        0.05151485279202461,
        0.00994932185858488,
        -0.1077273041009903,
        -0.0389079712331295,
        -0.024435902014374733,
        0.016547612845897675,
        0.020754234865307808,
        0.0023831420112401247,
        0.004904992412775755,
        -0.031117403879761696,
        -0.0313902422785759,
        0.06857975572347641,
        0.018622184172272682,
        -0.06917042285203934,
        0.05714085325598717,
        0.05837158113718033,
        0.07399766892194748,
        -0.03658057749271393,
        0.004755541682243347,
        -0.04145946726202965,
        -0.008522783406078815,
        -0.03962217643857002,
        -0.023706432431936264,
        -0.1329103708267212,
        0.11238673329353333,
        0.017455123364925385,
        -6.679881830397993e-33,
        0.00828411802649498,
        -0.08070944249629974,
        -0.06191560626029968,
        0.021752137690782547,
        0.032272618263959885,
        0.0030416660010814667,
        -0.05232958495616913,
        -0.05595843493938446,
        -0.005919780116528273,
        -0.009367578662931919,
        0.011583888903260231,
        -0.04652385413646698,
        0.05469211935997009,
        -0.03939764201641083,
        -0.04808257520198822,
        -0.006732353940606117,
        -0.027018936350941658,
        -0.025579901412129402,
        0.00903080403804779,
        -0.004800752736628056,
        -0.0020294964779168367,
        0.1088385060429573,
        -0.07995066046714783,
        -0.04763878881931305,
        -0.005431883502751589,
        -0.010398849844932556,
        -0.06488297134637833,
        -0.0034930261317640543,
        0.03897355869412422,
        0.07122842967510223,
        -0.005498592276126146,
        -0.08154917508363724,
        0.02086104266345501,
        0.04625669866800308,
        0.09771116822957993,
        -0.01867036148905754,
        0.055269259959459305,
        -0.052767034620046616,
        0.0013878586469218135,
        -0.046325042843818665,
        0.0649540051817894,
        0.017384225502610207,
        0.02198636531829834,
        0.05377131700515747,
        0.00676247663795948,
        0.008407128043472767,
        -0.04608612507581711,
        -0.025182031095027924,
        0.10364311933517456,
        0.0036651163827627897,
        0.10096076130867004,
        0.0025516448076814413,
        0.04922916740179062,
        0.01513233408331871,
        -0.06543241441249847,
        0.025243258103728294,
        -0.01378541998565197,
        0.0686747282743454,
        0.013216884806752205,
        -0.03567664325237274,
        0.03092101961374283,
        -0.024284588173031807,
        0.01818792149424553,
        -0.012533904984593391,
        -0.0065339235588908195,
        0.019466914236545563,
        0.01550743356347084,
        0.06914278864860535,
        -0.07116751372814178,
        -0.08054434508085251,
        -0.021341344341635704,
        0.04814884811639786,
        -0.04822380095720291,
        -0.07166768610477448,
        -0.06571893393993378,
        0.016261326149106026,
        0.05208689719438553,
        0.008093161508440971,
        -0.03035714104771614,
        0.04773673415184021,
        -0.04700083285570145,
        -0.03897116705775261,
        0.07902614027261734,
        0.055670950561761856,
        0.015027091838419437,
        -0.008256985805928707,
        -0.021253280341625214,
        -0.01143009401857853,
        -0.04623724892735481,
        -0.08321496099233627,
        0.01143717858940363,
        -0.05459187552332878,
        -0.014735887758433819,
        0.08451012521982193,
        0.015737337991595268,
        -5.416880810571456e-08,
        0.011234859935939312,
        -0.016857655718922615,
        -0.016204161569476128,
        0.017909279093146324,
        -0.04503053426742554,
        -0.0535534992814064,
        0.03867247328162193,
        -0.04219520837068558,
        -0.06543975323438644,
        0.016584470868110657,
        0.043641433119773865,
        -0.08572462946176529,
        -0.05643588677048683,
        0.036248158663511276,
        0.06809191405773163,
        0.020816868171095848,
        -0.08300507068634033,
        0.04329609125852585,
        0.012137877754867077,
        0.043984852731227875,
        0.04627750813961029,
        0.01309988833963871,
        0.11119828373193741,
        0.043916452676057816,
        -0.06542545557022095,
        0.04004794359207153,
        0.0795404389500618,
        0.00024766643764451146,
        0.06867510080337524,
        0.01374228298664093,
        0.03009507618844509,
        -0.0020259313751012087,
        0.033633191138505936,
        0.03699107840657234,
        0.029029997065663338,
        -0.12610942125320435,
        -0.0627005323767662,
        0.11884303390979767,
        0.045073069632053375,
        -0.06661234050989151,
        -0.03238879144191742,
        -0.0623033307492733,
        -0.06476298719644547,
        0.06297475844621658,
        0.02504001557826996,
        -0.0272639412432909,
        -0.1242770329117775,
        -0.08807803690433502,
        -0.024824760854244232,
        -0.011125301942229271,
        0.06450357288122177,
        0.08612343668937683,
        0.03806844353675842,
        0.10013005882501602,
        0.011906864121556282,
        -0.007701344788074493,
        -0.050894200801849365,
        0.05303853005170822,
        0.026629848405718803,
        0.07174022495746613,
        0.018678681924939156,
        0.00735054723918438,
        0.04799408093094826,
        0.02979707531630993
    ]
}