{
    "id": "Pv9TFU8auUg",
    "title": "This laser is FRICKEN HUGE!!! - Trotec Speedy 400",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-02-26T20:59:51Z",
    "video_url": "https://www.youtube.com/watch?v=Pv9TFU8auUg",
    "category": "Science & Technology",
    "tags": [
        "Laser",
        "Engraver",
        "Expensive",
        "Industrial",
        "Engineering",
        "Trotec",
        "Speed",
        "Flex",
        "Engrave",
        "Cutting",
        "Custom",
        "Fast",
        "Colin",
        "Unboxing",
        "Lazer"
    ],
    "views": 288575,
    "likes": 19283,
    "comments_count": 836,
    "description": "Thanks to Trotec for sponsoring this video! Contact them for a free laser demo and more information about their laser engravers at   Laser engraving machines aren't anything new but when you've got something this premium it makes us a wee bit interested as it's not just speedy, it's really powerful. Also, we use it to make memes.  Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://geni.us/trotec",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- This is a Dick button (knocking) and it's etched onto wood. And it only took eight minutes with this Speedy 400. This beautiful, fast, sleek machine can accelerate at 5 G's. If you accelerated at 5 G's with no training, you would pass out. It's an incredible industrial machine and we are so lucky to have it. And I'd like to thank Trotec for lending it to us. So I'm gonna tell you a little bit about why it's so amazing and maybe we'll have etch somethings while we're at it. The reason this machine can move at 5 G's and I'm not talking about wifi here, is because it does all the heavy lifting in the actual body. It only shoots the laser beam towards this and it just bounces the light around with mirrors. So, with no weight on the head, the servos that control the axes don't have any mass to deal with. They can just move them really, really fast. I can talk about it until I'm blue in the face. Why don't we just turn it on and I'll show you how fast this thing can move. Gotta close the lid though there're safety interlocks everywhere. It's an industrial machine so no tomfoolery. We are green on the status bar but let's see how fast this goes, David. (machine swishing) That is 4,300 millimeters per second. 4.3 meters per second. - [Jono] What's that in miles? - What's that in miles? I can't do that math right now. - 9.6 miles per hour. Which sounds kinda slow. - [Host] That's faster than you can walk. - Yeah! That's pretty fast. - I have a Prosumer machine that's similar to this and it operates at 1/10 the speed. 1/10. What's really, really neat about this machine is it's not just one laser. It's not even two lasers. It's technically three lasers and I'll show you how that works. I gotta pull the machine out though. I should probably shut it off. Don't scratch the paint. Okay. So this is where all the fun bits are stored. Here we have not one, not two but three laser sources. They're all combined with fancy mirrors. We have a fiber laser, so this can directly etch onto metal. We have a CO2 type laser. This is actually a ceramic core laser. And then we have a little tiny diode here which is the red dot that you see. They're all combined with these beam combiners and they just fly around inside the machine and come out and bounce off mirrors to actually get to the workpiece. Now, when I say technically three, I mean because this diode laser doesn't really do anything it only just tells you where the laser head is. That's the third laser source, and a diode laser is a good introduction to how low spec lasers work. They just use a little LED diode essentially and they can go up to about 2 Watts and they can etch an image on paper, but they have no speed and no power. These are much, much, chunckieser. No, much bigger chunkises. - [Jono] Chunkasores. - Chunksi? We're gonna talk about the fiber laser first. This yellow cable here is very much like the fiber optics that we use now with our editing dens to transmit data, except this just transmits a wavelength of light that's about 20 Watts in this machine, and this can directly affect metal. So we can etch right onto a sheet of steel. I think we did that with (snaps fingers) the Pyramid PC. - Lttstore.com. Now that is what a six-figure laser gets you. - And we don't have to have any coatings that we're actually removing, which is the classical way to use a laser of this size. That would be using the CO2 or this is actually an RF, radio frequency emitter. And it has a gas trapped inside two ceramic cores that gets vibrated by radio frequencies and it starts to emit light. And that's part of the laser acronym, the ER, is emitted radiation. I wrote it down because it's crazy. Here, so laser, light amplification by the stimulated emission of radiation. That's a mouthful. Anyway, more lasers, more better. Another interesting feature that you're gonna see inside this laser is that all of the motion components are separated from where the work takes place. As you're shooting lasers into things you're ablating material, you're vaporizing and it all gets sucked out and into the vacuum system I'll tell you about in a bit. But by containing everything over in here, we keep all that dust and grime off of the machinery. That way the machinery can run for thousands of hours. There's gonna be some service involved and you have to keep it clean, but it keeps it cleaner. And this is the sort of thing that you see in a production machine, not a hobbyist grade machine. Moving on from what we saw in here, the same sort of principle applies to this gantry. Everything's protected inside here. We're supposed to clean there but I doubt I ever will. And you can actually see the dust that started to settle on things. - [Jono] Is that acrylic dust? - That is acrylic dust. So lasers classically can't do you know, part way. They can only really etch a layer or cut, but when your machine moves this fast you can just etch multiple times and you can end up creating this. This is a failed LTT reservoir. This was my failure. But I needed to create a relief behind the Rez, so the water could flow through it. And I just etched, I think 9 or 10 times with a full power pass. And that's what all that dust is. And I removed about 2 millimeters of material just by slowly scanning over the piece over and over again. So you can use a machine that's this powerful and this fast to do that sort of thing. I think it took like three hours, but it worked. So all that ablated material needs to go somewhere. And we don't actually have any ventilation for this machine in particular, because we have the Atmos system. This is a huge carbon filter bag house that sucks all of the vapors that get admitted by this machine. And it just stores them in here. And it's completely controlled by the machine. When you turn it on, it turns on the bag house. When it's done it shuts itself off. It is a beautiful, relatively quiet machine. As someone who has a blower machine or blower fan to suck out all of his dust, I actually keep it in another room in my shop. This is a beautiful, beautiful quality of life improvement. Hello? Hey, that's kinda neat. When you suck out bigger chunks of things like paper disks from whatever we were cutting, it comes in this little spot and we can pick it out. So it doesn't go into the bags. That's neat. And this thing's really interesting in that it monitors its ability to do its job. When it gets full, it will send an alarm and then it'll tell the machine, \"Hey, you should probably get that fixed.\" Danger high voltage, I'm in. Disconnect mains before opening. Okay, fine. Okay. We're safe. Ooh, what do we have in here? Okay. Look at that. So this is why it's so quiet. Look at all the sound padding in here. We have dual blowers. I assume that one of them can fail and you'd still have at least something. The controls are pretty simple. We have some solid state relays for turning big things on and off. I'm not gonna poke the capacitor. All of the parts in these machines are grounded really well. Not only because there's some pretty heavy electronics inside but also because as you're drawing air through things you create static, and static can destroy electronics. So everything in here is designed to last for thousands and thousands of hours, and hopefully prevent any static discharge from killing things. That's why this wire is here and it connects directly to the metal chassis. This little clip back here. Okay. We've seen how the insights work, let's actually make something now. Welcome to Ruby. This is Trotec's new software. The old stuff used like a printer driver. It was really archaic, I am so glad they're coming into the 21st century. As someone who tried to start with the old software, it wasn't fun. It wasn't anything I even wanted to touch. If I was a business owner, I wouldn't want it. This is next level though. We've got our piece of art. Got this piece of wood. I think this is about a 100 mill. So we're gonna scale this roughly to 100 mill. And there is a feature to fit to design so we can shrink our part down to there and we can go create job. Boom. Now it placed it on the laser table. Now we've gotta turn on the laser. - [James] So that represents the whole table? - Yes, this is the whole table. So the whole table is 24 inches by 40 inches. Turn the laser on. (vocalizing) Contact. It'll do a quick little homing sequence and figure out where it is. Doing a little check it's gonna zero the bed all the way down. We'll see a little bit of a circle happen on the head and it's figuring out the location of the laser. We're gonna use one of my favorite features of this machine is auto height sensing. This is that third laser I told you about, the red dot. This is the coolest feature of all time. We get it pretty close, cool. - [James] How do you know you're putting it in the same place as it shows on the screen? - I'll show you that in a minute. This dot represents the laser. So we're gonna take our art and we're gonna anchor it right there. Now we know our part is where the laser dot is. And as far as material prep goes all we gotta do is shut the lid, press up and down, the machine will move over so the sonic sensor is over top of the material. It's gonna home itself right to the perfect focal point. And now we're ready to cut. And the important thing to say is focal point is if we look here, the laser beam isn't actually like a perfect point. It's actually comes out of the machine as a cylinder. This is the focal lens. It takes the cylindrical beam and turns it into a cone and the cone will come, converge, and then diverge. You can get different lenses that have different focal length, just like a camera depending on what you're cutting. You wanna use, typically, the tightest focal range you can given the material. If I'm only cutting a quarter of an inch I can have a pretty tight focal range. But if I'm cutting 5 inches of foam you wanna have a really long beam so that your cut comes out straight rather than tapered. This machine is able to do both the fiber and the CO2 type laser. So this lens is capable of doing both. If I used a CO2 lens and ran the fiber laser on it, it would blow up the lens and they're kinda toxic. So that's bad, but this particular lens is able to do both. It's also a little dirty. If you look really closely on this lens I don't know if you can see it, but there's a little bit of fluff on there. Any material that's left on the lens when you all of a sudden hit it with a 100 Watts of power will heat up, and when you have heat on a lens, it breaks. And these are really expensive, so we try to keep them really, really clean. There's actually an air purge that comes out of the nozzle specifically to keep dust and crap away from your nozzle. Blowing up lenses really, really isn't fun. And I've been there. So we're gonna use proper lens tissue. Give it a little wipey wipe, and these all index right into the metal body which is so nice. Okay. We're ready to cut. So let's get to it. Turn it back on. It's gonna do the homing, I think again. - [James] It'll only operate if the lid's closed? - [Host] Yeah. There's lots of interlocks, lots of interlocks. It's also tinted, which helps a lot. Mine is just clear acrylic, and if I'm not wearing like sunglasses while, and I'm like staring at the beam, I'll like start to lose vision. I think that's why I have some vision damage in one. - [James] Oh, wow. - Yeah. Let's go search for wood. Oh, actually, can I show you this feature? Something that's really nice that Trotec has done here is categorize and characterize all of their materials. So I'm cutting, this is maple, maybe? A solid maple? We can cut plywood or, plywood. Wood plywood, boom. They've already done all of the settings. These will get you really close to actually what you wanna cut, and that's it. We're just gonna send it. We'll push to laser and press play, suction came on. This is where that acceleration comes in really handy. When you're doing small parts and you're scanning down them really quickly, the amount of lines you have is greatly affected time-wise by how fast you can change direction. This is actually a loading bar. If you're doing a big array. Say you had 50 different etches. As the etch is progressing, this bar will progress. So anywhere in your shop, if you're doing something else while the machine is running, you can keep an eye on it. But, you should always be keeping an eye on it. It is a laser. It does light fire to things. Ask me how I know. One thing you'll notice is it's not over scanning. It's not just doing the whole like rectangle. It only moves where it needs to move. And that just saves time over the whole part. So this is done. I can turn off the noise. (gasps) What are you stepping on there? Now we can pull her open. Look at that. Stock settings, I didn't do any dialing in, literally click and print. Some of the other things that I'd like to highlight. I mean, things like you gotta watch it run. Otherwise things can happen like this where your parts light on fire. This wasn't in this machine for the record. This is my machine. It trying its hardest. Yep. Acrylic lights to light on fire. And you can also do things like circuit boards, because this has the flex laser you can etch a circuit board, wire it up and it'll run. So we're gonna use this for prototyping here for a couple of small projects that we have coming up. And that's gonna be it for this ShortCircuit Thanks to Trotec for sending us this lovely laser. Check them out in the link in the description if you wanna get into one of these machines, and I'll see you next time.",
    "transcript_keywords": [
        "laser",
        "machine",
        "Dick button",
        "things",
        "lasers",
        "fast",
        "lens",
        "fiber laser",
        "etch",
        "thing",
        "light",
        "Dick",
        "dust",
        "material",
        "turn",
        "laser beam",
        "diode laser",
        "focal",
        "beam",
        "cut"
    ],
    "transcript_entity_values": [
        "about 2",
        "three",
        "CO2",
        "James]",
        "One",
        "one",
        "thousands and thousands of hours",
        "this Speedy 400",
        "100",
        "Watts",
        "9",
        "eight minutes",
        "Watts",
        "LTT",
        "9.6 miles per hour",
        "like three hours",
        "4.3 meters",
        "Dick",
        "David",
        "Pyramid",
        "Trotec",
        "Jono] Chunkasores. -",
        "roughly to 100",
        "the 21st century",
        "about 2 millimeters",
        "third",
        "50",
        "10",
        "first",
        "1/10",
        "thousands of hours",
        "5 inches",
        "4,300 millimeters",
        "two",
        "six",
        "Atmos",
        "about 20",
        "James",
        "40 inches",
        "ER",
        "24 inches",
        "5",
        "Rez",
        "a quarter"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "LOC",
        "ORG",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.08378315716981888,
        -0.00653495080769062,
        0.010045728646218777,
        -0.030148347839713097,
        0.013401124626398087,
        -0.03376558795571327,
        0.03862259164452553,
        0.0027461962308734655,
        0.024847999215126038,
        -0.040246717631816864,
        -0.004003896843641996,
        0.03144077956676483,
        -0.006020841188728809,
        -0.006657264195382595,
        -0.03584232181310654,
        0.0070075830444693565,
        0.00370190292596817,
        0.01205159816890955,
        -0.02685226872563362,
        -0.007502178195863962,
        0.06575394421815872,
        -0.07350357621908188,
        -0.031981851905584335,
        0.023395003750920296,
        -0.06967603415250778,
        -0.007943544536828995,
        -0.09378713369369507,
        -0.017572039738297462,
        0.03994858264923096,
        -0.012834901921451092,
        -0.020917901769280434,
        -0.021234137937426567,
        -0.04382709041237831,
        0.07615785300731659,
        0.02665020525455475,
        -0.008160504512488842,
        0.002723059616982937,
        0.037767305970191956,
        -0.0003515457210596651,
        -0.0313788466155529,
        0.0014097557868808508,
        -0.06589735299348831,
        0.0030430990736931562,
        0.08986517041921616,
        0.03304406628012657,
        -0.007178908679634333,
        -0.04235800728201866,
        -0.03674664348363876,
        -0.027157530188560486,
        0.09105168282985687,
        -0.05656806379556656,
        -0.04032066836953163,
        -0.017629781737923622,
        -0.0509655587375164,
        0.0060774353332817554,
        0.0018455892568454146,
        -0.009253515861928463,
        -0.07866840064525604,
        0.04639042541384697,
        -0.06757862120866776,
        0.012355607934296131,
        0.014667615294456482,
        -0.08648310601711273,
        0.028178831562399864,
        0.003103547729551792,
        -0.008705535903573036,
        0.0014063712442293763,
        0.03877481445670128,
        -0.029461359605193138,
        -0.012783997692167759,
        0.08316612243652344,
        -0.0011375172762200236,
        -0.004440912511199713,
        0.09754946827888489,
        0.009324561804533005,
        -0.02494535781443119,
        0.03714821860194206,
        -0.05361466854810715,
        -0.03502602502703667,
        0.04881403595209122,
        0.060923583805561066,
        0.04544922336935997,
        0.027673712000250816,
        0.07976628094911575,
        -0.03086274117231369,
        -0.01916344091296196,
        0.0037048552185297012,
        0.010067611932754517,
        -0.009545647539198399,
        -0.07456834614276886,
        -0.0052643027156591415,
        0.020085887983441353,
        -0.021073738113045692,
        -0.0337088406085968,
        -0.05340614542365074,
        -0.001627497375011444,
        0.060046352446079254,
        -0.0676405057311058,
        -0.0645110085606575,
        0.07519382983446121,
        0.016820082440972328,
        -0.006013254635035992,
        0.037769053131341934,
        -0.037820812314748764,
        -0.08625581860542297,
        -0.05374259501695633,
        -0.03398618474602699,
        0.09598853439092636,
        -0.006162918638437986,
        -0.00873313844203949,
        -0.0272015780210495,
        -0.0030487817712128162,
        -0.05224403366446495,
        -0.03776681795716286,
        -0.04574155434966087,
        -0.004969201982021332,
        -0.13869509100914001,
        -0.03083043545484543,
        0.12787529826164246,
        -0.010086198337376118,
        -0.04034509137272835,
        0.03525010496377945,
        -0.029213424772024155,
        0.004174650181084871,
        0.015279573388397694,
        0.07401891052722931,
        -0.015512817539274693,
        4.8063131798421824e-33,
        0.011303834617137909,
        0.1652372181415558,
        -0.0005922634154558182,
        -0.025455892086029053,
        0.05208003893494606,
        0.04281255230307579,
        0.020481212064623833,
        -0.004294771701097488,
        -0.12921495735645294,
        -0.013317745178937912,
        -0.05396726727485657,
        0.09892135113477707,
        -0.0489557608962059,
        0.10810093581676483,
        -0.020973000675439835,
        -0.12718930840492249,
        0.08472145348787308,
        0.06977368891239166,
        -0.03207342326641083,
        0.019780263304710388,
        -0.05065242946147919,
        -0.022310417145490646,
        0.06184149906039238,
        0.030065519735217094,
        -0.061154626309871674,
        0.07548342645168304,
        -0.05754544213414192,
        0.022238727658987045,
        0.042246777564287186,
        0.03962278366088867,
        -0.015905307605862617,
        0.05207837373018265,
        0.047017812728881836,
        -0.13321319222450256,
        0.006034731864929199,
        -0.048692625015974045,
        -0.04853478819131851,
        -0.07782144099473953,
        -0.016258060932159424,
        -0.015917623415589333,
        -0.012758824042975903,
        0.035625360906124115,
        -0.01056066807359457,
        -0.07442069798707962,
        -0.03402870520949364,
        -0.018826255574822426,
        -0.03843158110976219,
        0.031520139425992966,
        0.05341339856386185,
        -0.005828089080750942,
        -0.022614004090428352,
        0.04652639478445053,
        -0.08470997214317322,
        -6.510328239528462e-05,
        0.054989468306303024,
        -0.028300710022449493,
        0.04044593870639801,
        -0.01566374860703945,
        0.023909013718366623,
        -0.036544956266880035,
        0.03588453307747841,
        0.027346981689333916,
        0.0752866119146347,
        0.04647836089134216,
        -0.019694024696946144,
        -0.01774057187139988,
        -0.045480962842702866,
        -0.01703670620918274,
        0.00996536947786808,
        -0.011331262066960335,
        -0.07180280983448029,
        0.011980797164142132,
        0.13376067578792572,
        -0.05731590837240219,
        0.06707854568958282,
        0.012046396732330322,
        0.003993139136582613,
        0.012707301415503025,
        0.005118066910654306,
        0.008889645338058472,
        -0.1576196849346161,
        -0.01629221811890602,
        0.023168006911873817,
        -0.0634671002626419,
        0.06408316642045975,
        -0.02067525126039982,
        0.014045757241547108,
        -0.0354328416287899,
        -0.06840097904205322,
        -0.008029021322727203,
        -0.07418017089366913,
        -0.06130540743470192,
        -0.050626497715711594,
        -0.0015878597041592002,
        -0.09098034352064133,
        -6.160161982436874e-33,
        -0.0564204677939415,
        -0.03101976402103901,
        0.0061744581907987595,
        0.09721055626869202,
        0.041987378150224686,
        0.02578127011656761,
        0.04075547680258751,
        0.06684468686580658,
        0.013920534402132034,
        -0.010668113827705383,
        0.04582115262746811,
        0.06335809826850891,
        -0.017246197909116745,
        -0.05369525030255318,
        -0.03046325221657753,
        -0.061079662293195724,
        0.061797481030225754,
        0.06817033886909485,
        0.026717867702245712,
        -0.07937245815992355,
        0.07382244616746902,
        -0.01659340225160122,
        -0.07678578794002533,
        0.08150049299001694,
        0.03786066174507141,
        0.01659790240228176,
        0.07896146923303604,
        -0.018874244764447212,
        -0.04781819507479668,
        0.008643506094813347,
        -0.04127543047070503,
        -0.006787043996155262,
        0.01825024001300335,
        0.05819220468401909,
        -0.04789167642593384,
        -0.04012960568070412,
        0.0884920209646225,
        0.057479675859212875,
        -0.0033942863810807467,
        -0.04282616451382637,
        0.022859547287225723,
        0.009983357042074203,
        0.002144864294677973,
        0.0395330972969532,
        -0.06695043295621872,
        -0.06560313701629639,
        -0.058585964143276215,
        -0.051569078117609024,
        0.11546622216701508,
        0.10885310173034668,
        -0.022071076557040215,
        -0.06056508421897888,
        0.05371972918510437,
        0.0055771758779883385,
        -0.03851348161697388,
        -0.0558466874063015,
        -0.08066532015800476,
        0.05144977942109108,
        -0.024478035047650337,
        0.09769148379564285,
        -0.03543985262513161,
        0.014594036154448986,
        0.00030871009221300483,
        0.034554917365312576,
        0.10824074596166611,
        0.003653068095445633,
        0.03343593701720238,
        0.028283923864364624,
        -0.07059594243764877,
        0.03633024916052818,
        0.0062646022997796535,
        0.05650867521762848,
        -0.03162611648440361,
        0.004839166067540646,
        -0.0019270122284069657,
        -0.007989907637238503,
        0.06285049021244049,
        0.053070489317178726,
        -0.025432050228118896,
        0.0006547712255269289,
        0.030385760590434074,
        -0.0001624340220587328,
        -0.006791212595999241,
        0.05777718499302864,
        0.034204185009002686,
        0.0023499869275838137,
        0.005124089773744345,
        0.010702447965741158,
        -0.0661483034491539,
        0.03451216593384743,
        -0.003295794129371643,
        0.088966965675354,
        0.04474766179919243,
        -0.05395214632153511,
        0.08856132626533508,
        -6.713595013252416e-08,
        -0.05179540067911148,
        0.01998463273048401,
        0.00023926405992824584,
        -0.06550448387861252,
        0.03582907095551491,
        -0.009897214360535145,
        0.07722298055887222,
        -0.021569417789578438,
        -0.07754522562026978,
        -0.09011725336313248,
        0.06598059833049774,
        -0.1258261650800705,
        -0.039341509342193604,
        -0.06334543973207474,
        0.03474339842796326,
        -0.034470852464437485,
        0.021484527736902237,
        -0.01827372796833515,
        -0.07489839941263199,
        -0.06713402271270752,
        -0.030414344742894173,
        0.00010770896187750623,
        0.10503868758678436,
        -0.07036083191633224,
        -0.14805306494235992,
        0.007123816758394241,
        -0.0029312772676348686,
        0.06740505993366241,
        0.02604539692401886,
        -0.05889235436916351,
        -0.0006925489287823439,
        -0.004798060283064842,
        0.05181508883833885,
        0.019297830760478973,
        -0.00901025626808405,
        -0.0675814300775528,
        -0.07024691998958588,
        0.020274044945836067,
        -0.02722233161330223,
        0.037689365446567535,
        0.03678159415721893,
        0.00991544034332037,
        -0.020409470424056053,
        -0.005380057264119387,
        0.03559080883860588,
        0.06890962272882462,
        0.0002920106635428965,
        -0.09799908101558685,
        -0.03503461182117462,
        0.12630639970302582,
        0.009464072994887829,
        -0.017404504120349884,
        -0.012247654609382153,
        0.016291452571749687,
        -0.015038724057376385,
        0.037518784403800964,
        0.010622345842421055,
        0.036369748413562775,
        0.031120870262384415,
        0.07947072386741638,
        0.08247394114732742,
        -0.09418968856334686,
        0.004854770377278328,
        0.06560736894607544
    ]
}