{
    "id": "pVm7sNRC6sE",
    "title": "Connect to the internet ANYWHERE! - SpaceX Starlink",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-02-01T22:06:40Z",
    "video_url": "https://www.youtube.com/watch?v=pVm7sNRC6sE",
    "category": "Science & Technology",
    "tags": [
        "Satellite",
        "Internet",
        "Dish",
        "Attennae",
        "SpaceX",
        "Rockets",
        "Signal",
        "Broadband",
        "Remote users",
        "ISP",
        "Connection"
    ],
    "views": 1158611,
    "likes": 63127,
    "comments_count": 3860,
    "description": "Check out the Govee Immersion TV Backlight at   Satellite internet isn't new, but Starlink is looking to provide internet speeds that are almost as good as your current provider but the ideal use is to connect people who don't have access to broadband due to living remotely.  Check out Starlink at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://bit.ly/ShortCircuit6199",
        "https://lmg.gg/wVf6m",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Wow, it's really like proactive about getting lined up again. Many of us in urban areas take something for granted. What is that you may ask? Well, high speed, low latency internet. But if you're not those people say, you live in the mountains somewhere or out in the boonies. You might be stuck with something else and that's called satellite internet and that might be your only option. If you've spoken to any of those people or are one of those people, you'll probably know that satellite internet, it's generally kind of dog (beep) You are probably going to contend with hundreds of milliseconds of latency and generally, really slow speeds. Not to mention that many of these providers might implement data caps say only two or 300 gigabytes. If you could even hope to download that much in a month given how slow the speeds can be. And for those who don't know or don't care to know, latency is a measurement of time. And in this context, we're measuring how long it takes for a signal to go from here all the way up to the satellite and to come back. Fortunately, our friends over at SpaceX and daddy Elon have invented some fantastic new technology called Starlink. It's like satellite internet except way fricking better. Let's check it out. This is a pretty big box. Like there we go, Mac book for scale. We got some instructions right off the bat. I'm guessing that icon means download something on your phone, put it outside, make sure it's sunny. I don't think that actually matters. Then go back inside, run the internet cable into the box and plug the box in and plug the box into the other box, connect to the internet. There's nothing on the back. Hopefully that's enough instructions for us. Ooh. All right, all right. We should be expecting sort of like, you know Tesla SpaceX sort of style design cues. So, hopefully the glass is invincible and it's very flat. We got what looks like a stand here. Wow. They actually ship everything pre plugged in. I guess it's like a idiot proofing. So we won't have any problems there. I think this is the sort of WiFi box. Oh, there's a reset button on the bottom. It looks like the input and auxiliary. I'm not sure if you can run two Starlinks or maybe you can hook up your other backup internet connection to that. I don't know. Or it might even just be like an outport if you like have a computer, you wanna hardwire into this. Will see if there's some more documentation that can tell us about that. Oh man. Actually, you know what? I don't like that everything's pretty plugged in. This is a mess. You got our satellite box here. Oh look, they carefully color coded them so you really can't screw this up. All right. What does it say on here? Starlink power supply. AC adapter POE injector. Oh, cool. So this operates over POE. Yeah. Cause I guess there's no power connection for this WiFi box, so this must be powered by POE. And then the actual Starlink itself is also just connected with like, you know, standard ethernet cable. So this is total 180 Watts on this whole thing. Pretty beefy little guy there. Okay. Get that put right there. Leave our WiFi box there. Plug the white into the white. Oh man. I guess with the understanding that you're gonna put this on the roof, you got a lot of cable. I don't even wanna unwind this but this is probably like 50, a hundred feet at least. It doesn't look like this is a hundred meters, which is usually the max you can go for like cat six, a but it's definitely a bit. And we get the fun part. The holy crap, that dish is huge. Oh, that's heavy too. Wow. That is very anticlimactic. It's sort of like a soft fabricy material. It's probably radio signal transparent. I imagine this is actually sort of a dish on the inside rather than just being flat. And then we've got the mount, which I believe is motorized. So we can't really tilt it ourselves. Just stick it in there. The man, video done, see you later. All right description. It's good to minus 30 Celsius or plus 40 Celsius, that's pretty good. Power supply and router restricted to indoor use only. Okay. So you'd wanna have these two boxes on the inside. You can't mount them outside and then you run your big old black cable out there. Cool. Let's plug it in. Look, we got some lights and another light. Wow. And the dish, it's not moving. Okay. Let me get the Starlink app. Whoa. It's probably gonna be confused 'cause we're not outside. I bet you can actually pop this dish off the stand. Like I mentioned before, there is a lot of differences between Starlink and traditional satellite internet. Most of the 2000 ish telecom satellites that currently orbit the earth operate at around 22,000 miles above the earth surface. These satellites actually orbit so high that they're rotating around the same speed as the earth and they're considered geostationary, meaning that they service the same area at the same time, always. If you thought 2000 was a lot you got something else coming for you because SpaceX hopes to launch around 42,000 of their Starlink satellites with around a thousand currently in orbit and operation for the beta period. What sets Starlink apart is their satellites operate within low earth orbit at around 340 miles above the earth surface. That is way lower than 22,000 at least by my calculations. At this altitude a Starlink satellite can complete a full orbit of the earth in around one and a half to two hours which allows them to service multiple different areas at the same time. And you're never really gonna have the same Starlink satellite in the same position. All of this contributes to Starlink's main advantage which is latency expected during the beta period to only be about 30 to 40 milliseconds. You can totally play video games on that. Traditional satellite providers, companies like HughesNet or XSEDE, average around 700 milliseconds of latency according to speed test intelligence. I wouldn't wanna be gaming on that. The Starlink team is even advertising that they expect the latency of a device like this to be around 16 to 19 milliseconds just by this summer. That's, that's better than some cable internet. Oh, it's getting warm, whoa. We should probably take this thing outside before it starts yelling at us for locking it in this concrete dungeon. But not before our sponsor, Govee. Govee Immersion TV Backlights add multiple dynamic colors to your games and movies. It's color sense camera recognizes and captures the colors on your TV and automatically applies them to your backlights. They offer multiple control options including Google assistant and Amazon Alexa support, multiple lighting effects that react to music and can easily be installed on up to a 65 inch TV. Check the link in the description to learn more. Oh man, there's a lot of obstructions out here. So this might not actually be ideal but we're gonna try it. The dish has been doing sort of some adjusting and I think that's what it's supposed to do but we're gonna go on the Starlink app and start the setup at least. So let's plug everything in, we've already done that. Okay I need to sign into the network. So we've made our own WiFi name and password. That's good. It says it's connected, it says we have internet. Although my phone still has the LTE thing in the top corner. So, that's a little weird. So this like a good connection though. You're currently still collecting data on obstructions. It's usually takes about 24 hours check for obstructions. So we have like a sort of AR thing where it shows you where not to put it. I don't really know how I could use this information. It's just sort of like a black thing all the way around. It's nothing but sky and view. I guess you're supposed to sort of put it at the angle. The Starlink is just going to lay it at the same angle. Okay. Well it says it's not necessarily ideal but supposedly you need 24 hours to check for obstructions but it works, I have internet. I'm not gonna show you guys a speed test 'cause we're actually gonna test this thing out on an LTT and give a better explanation of the technology behind it and their satellites and all that cool stuff. But for now, it's pretty cool. Apparently our latency to the Fortnite Oregon server is 37 milliseconds. It feels like I'm just on cellular. Maybe, maybe better than cellular actually. Since we're not showing you guys speed tests or latency just yet, stay tuned for the full LTT video for that. We figured we load up a LTT video and just see if it plays. So I've got our latest fiber adventure video plan 1080P and - [Announcer] 20 40 kilometers is typically and requires much more expensive. - It doesn't look like there's a 4K choice but - [Announcer] This means that for our application. - That's pretty damn impressive. - [Announcer] You could use single node but that would be really expensive and kind of stupid. - It looks like it's almost struggling just a little bit. It's not pre-loading too much but it's playing without buffering so that's a pass in my books. I guess it's safe to say that this could be a serious game changer for anybody that's out in the boonies on a mountain. Even if you have like an RV with a generator you could stick this thing in the back. And when you get where you're going, pop it on top and you've got full internet access. Currently during the beta our unit is actually location locked. They split the continent up into little cells that are like 15 or so kilometers wide that it only sort of works there. And that's where your Starlink is assigned but in the future, there are plans to allow full mobility of these things. So, man I just can't wait to see what the future brings. So thanks for watching guys. If you'd like cool high-tech stuff. Maybe check out the short-circuit I recently did on Ubiquity's G4 PTZ camera, get subscribed to all that fun stuff and thanks for watching.",
    "transcript_keywords": [
        "Starlink",
        "internet",
        "satellite internet",
        "satellite",
        "sort",
        "Starlink satellite",
        "box",
        "latency",
        "thing",
        "satellites",
        "pretty",
        "earth",
        "Starlink app",
        "speed",
        "WiFi box",
        "guess",
        "plug",
        "put",
        "man",
        "cable"
    ],
    "transcript_entity_values": [
        "around 22,000 miles",
        "SpaceX",
        "40 Celsius",
        "Alexa",
        "up to a",
        "LTE",
        "Tesla SpaceX",
        "HughesNet",
        "Elon",
        "around 42,000",
        "Fortnite Oregon",
        "4",
        "15 or so kilometers",
        "22,000",
        "this summer",
        "Google",
        "Mac",
        "around 340 miles",
        "Amazon",
        "Starlinks",
        "24 hours",
        "Watts",
        "LTT",
        "RV",
        "Starlink",
        "about 24 hours",
        "Starlink",
        "AC",
        "Ubiquity",
        "XSEDE",
        "Govee",
        "50",
        "a month",
        "about 30 to 40 milliseconds",
        "a hundred meters",
        "180",
        "two",
        "hundreds of milliseconds",
        "G4 PTZ",
        "POE",
        "around 700 milliseconds",
        "a hundred feet",
        "only two",
        "six",
        "Starlink",
        "1080P",
        "37 milliseconds",
        "16 to 19 milliseconds",
        "20 40 kilometers",
        "2000",
        "Govee Immersion TV Backlights"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "TIME",
        "LOC",
        "ORG",
        "GPE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.030507106333971024,
        -0.0773785412311554,
        0.04765674099326134,
        -0.033084381371736526,
        0.04222172126173973,
        0.03953462839126587,
        0.003890503430739045,
        -0.00337156536988914,
        -0.030765807256102562,
        0.03978310525417328,
        -0.016235481947660446,
        0.056619156152009964,
        -0.03707496449351311,
        -0.05150121822953224,
        0.03119838982820511,
        -0.04601377621293068,
        0.07753027230501175,
        -0.08564075082540512,
        0.0012313928455114365,
        0.011074778623878956,
        -0.011165653355419636,
        -0.09393656253814697,
        -0.02658596634864807,
        -0.04296077415347099,
        0.04838361218571663,
        -0.04098869860172272,
        0.023271871730685234,
        -0.0017131151398643851,
        -0.0006514124688692391,
        -0.057867538183927536,
        -0.0165219958871603,
        -0.012208174914121628,
        -0.07759791612625122,
        0.003791246796026826,
        -0.04714902490377426,
        -0.027458667755126953,
        0.018434137105941772,
        -0.06689869612455368,
        -0.08666180074214935,
        0.022213324904441833,
        0.08218774944543839,
        -0.10197506099939346,
        -0.01514777634292841,
        0.027174167335033417,
        0.008805845864117146,
        -0.0633145272731781,
        -0.004948743619024754,
        -0.0002689481480047107,
        0.03886455297470093,
        0.036972809582948685,
        0.003127350239083171,
        -0.05663985013961792,
        0.03296777233481407,
        0.02286369539797306,
        -0.009866719134151936,
        -0.017517413944005966,
        -0.026966987177729607,
        0.013631124049425125,
        0.024050507694482803,
        0.01520965900272131,
        0.08356031775474548,
        -0.07998139411211014,
        -0.04502482712268829,
        0.04480419680476189,
        -0.041070159524679184,
        -0.0001356607535853982,
        0.002743716351687908,
        0.11047609895467758,
        -0.05877366662025452,
        -0.06987299770116806,
        -0.07436592131853104,
        0.017667492851614952,
        0.020870288833975792,
        0.09085012227296829,
        -0.02513493224978447,
        -0.024922242388129234,
        0.17243361473083496,
        -0.0213612150400877,
        0.09017778933048248,
        0.05491003766655922,
        0.01716567948460579,
        0.01572210155427456,
        -0.03312419354915619,
        0.012525796890258789,
        0.023734180256724358,
        -0.056943025439977646,
        0.02635090798139572,
        0.037646982818841934,
        -0.027734046801924706,
        -0.09122785180807114,
        0.001506533706560731,
        0.09732261300086975,
        0.05370759591460228,
        0.04926710203289986,
        -0.009903235360980034,
        -0.004683167207986116,
        0.01794138364493847,
        -0.13666532933712006,
        -0.06056290119886398,
        0.058621495962142944,
        -0.021848125383257866,
        0.040666669607162476,
        0.00691779050976038,
        0.009005418047308922,
        -0.04672977328300476,
        -0.05641903355717659,
        -0.0006304906564764678,
        0.10787468403577805,
        0.08734893053770065,
        0.02729913406074047,
        -0.09677736461162567,
        -0.010828712955117226,
        -0.08283471316099167,
        -0.01268849615007639,
        -0.11444725096225739,
        0.03365665301680565,
        -0.0809057205915451,
        0.005470243748277426,
        0.17001836001873016,
        -0.08241713047027588,
        -0.022957175970077515,
        -0.00752635020762682,
        0.010288613848388195,
        0.044099923223257065,
        0.06016966328024864,
        0.011736864224076271,
        0.010692713782191277,
        -2.9773042599659307e-34,
        -0.046629153192043304,
        0.11224336177110672,
        -0.04459385946393013,
        -0.10349531471729279,
        0.04985176399350166,
        0.057267606258392334,
        -0.017068371176719666,
        0.014701125212013721,
        -0.0666799545288086,
        -0.008641963824629784,
        -0.08510858565568924,
        0.05234692245721817,
        -0.039208244532346725,
        0.0346740260720253,
        0.04945368319749832,
        -0.07396348565816879,
        0.029920658096671104,
        -0.005426071118563414,
        0.03554943948984146,
        0.046694930642843246,
        -0.03658794239163399,
        -0.05512942001223564,
        0.04695209860801697,
        -0.02440623566508293,
        0.04465058445930481,
        -0.05716567113995552,
        -0.02741609327495098,
        0.019330604001879692,
        0.12777414917945862,
        0.01954985223710537,
        0.014851042069494724,
        -0.018820347264409065,
        0.03430236876010895,
        0.009572756476700306,
        0.03154038265347481,
        -0.03028140589594841,
        -0.0943523719906807,
        -0.0967610776424408,
        -0.03485877811908722,
        0.03015817701816559,
        -0.030889930203557014,
        0.02466294728219509,
        -0.11108643561601639,
        -0.05929775908589363,
        -0.051122359931468964,
        -0.022156372666358948,
        0.05319957435131073,
        -0.04324232041835785,
        0.023425856605172157,
        0.04865594208240509,
        -0.07472432404756546,
        0.07955598831176758,
        -0.16666698455810547,
        -0.06024893373250961,
        0.029631856828927994,
        0.03480665758252144,
        -0.021805597469210625,
        0.03686925396323204,
        0.03648682311177254,
        -0.03313980624079704,
        0.027691766619682312,
        -0.044304259121418,
        0.021819880232214928,
        -0.035718657076358795,
        -0.023666342720389366,
        0.012113328091800213,
        0.045636437833309174,
        0.01561739481985569,
        -0.053181275725364685,
        -0.0583014078438282,
        -0.027711154893040657,
        0.04273737967014313,
        0.12892712652683258,
        0.008079650811851025,
        -0.043288346379995346,
        0.02630741335451603,
        -0.07743111252784729,
        0.017273491248488426,
        0.00048211569082923234,
        0.011272056959569454,
        -0.032295241951942444,
        0.0036850287578999996,
        -0.008491224609315395,
        0.07406701892614365,
        0.05689699947834015,
        0.011880778707563877,
        -0.0221817959100008,
        0.017547212541103363,
        -0.04890521243214607,
        0.0077524809166789055,
        -0.03976936638355255,
        2.024606374106952e-06,
        0.0017587910406291485,
        0.0003503492334857583,
        -0.05646001920104027,
        -2.0837428160500127e-33,
        -0.055335819721221924,
        -0.0470132976770401,
        -0.02066725492477417,
        0.04686084762215614,
        0.04782111570239067,
        -0.017656950280070305,
        0.09504294395446777,
        -0.004896535072475672,
        0.027257567271590233,
        0.015482248738408089,
        -0.0027401649858802557,
        0.03833043947815895,
        0.007266735192388296,
        -0.07087884843349457,
        0.009306059218943119,
        -0.07319653034210205,
        0.03129485622048378,
        -0.018958263099193573,
        -0.019611652940511703,
        -0.06245763972401619,
        0.06803043931722641,
        -0.022678740322589874,
        -0.010659228079020977,
        0.038486067205667496,
        0.02580180950462818,
        -0.028502367436885834,
        0.05972132831811905,
        0.026646815240383148,
        -0.09963737428188324,
        0.04720259830355644,
        -0.011390505358576775,
        0.027151603251695633,
        -0.0324559360742569,
        0.0011025654384866357,
        0.01740606687963009,
        0.07436191290616989,
        0.06830649822950363,
        0.11056062579154968,
        -0.03370725363492966,
        -0.057690173387527466,
        0.01942487247288227,
        -0.026422971859574318,
        0.00574195571243763,
        0.011025018990039825,
        0.017062343657016754,
        -0.02958744764328003,
        -0.11736936867237091,
        -0.06721056252717972,
        -0.09535075724124908,
        0.061537906527519226,
        -0.0005588259664364159,
        -0.03893697261810303,
        0.04606091231107712,
        -0.011840710416436195,
        -0.05762739107012749,
        -0.003913285676389933,
        -0.03935367614030838,
        0.06068725511431694,
        -0.017963167279958725,
        0.03975049406290054,
        0.07307566702365875,
        -0.04184383898973465,
        -0.025871064513921738,
        0.13054493069648743,
        0.034398578107357025,
        -0.03608815371990204,
        0.04147450253367424,
        0.05655759200453758,
        0.007956132292747498,
        0.061044685542583466,
        -0.014709304086863995,
        -0.008614091202616692,
        -0.009553217329084873,
        -0.016301263123750687,
        -0.018024414777755737,
        0.04565723240375519,
        0.05310850962996483,
        0.06887152791023254,
        -0.025413841009140015,
        -0.010446968488395214,
        0.026183197274804115,
        0.08424870669841766,
        0.0434628464281559,
        -0.04026796296238899,
        0.05959322676062584,
        0.014550401829183102,
        0.08283846825361252,
        -0.01116208452731371,
        -0.021370550617575645,
        -0.0582311674952507,
        -0.08127230405807495,
        0.015478035435080528,
        -0.07601293176412582,
        0.021028608083724976,
        0.053327448666095734,
        -5.125231794522733e-08,
        0.005701655521988869,
        0.016931841149926186,
        -0.04483816772699356,
        -0.017516987398266792,
        -0.007711982354521751,
        -0.013366689905524254,
        0.0181792750954628,
        -0.05831518396735191,
        0.010801290161907673,
        -0.03633742779493332,
        0.0020375584717839956,
        -0.05074845999479294,
        -0.051370177417993546,
        0.018654409795999527,
        0.006116755772382021,
        -0.04699070006608963,
        -0.015355994924902916,
        -0.027937131002545357,
        -0.02007247693836689,
        0.053057894110679626,
        -0.0698285922408104,
        0.031802453100681305,
        0.035845473408699036,
        0.004023903049528599,
        0.0475015863776207,
        0.045122988522052765,
        0.03212295472621918,
        0.08047501742839813,
        0.0605069138109684,
        -0.06074213981628418,
        -0.04830598086118698,
        0.01651582308113575,
        -0.02628735452890396,
        -0.03488597646355629,
        -0.0681263655424118,
        0.01779436692595482,
        -0.028501953929662704,
        0.06078788638114929,
        0.01275632344186306,
        0.10193590819835663,
        0.027397017925977707,
        -0.031670596450567245,
        0.056899093091487885,
        -0.035546112805604935,
        0.032055966556072235,
        0.008050184696912766,
        -0.04231146350502968,
        -0.03603792563080788,
        0.036490753293037415,
        0.022656846791505814,
        -0.01648896187543869,
        -0.01575520820915699,
        -0.09373515099287033,
        -0.09481493383646011,
        0.06393040716648102,
        -0.005083353724330664,
        -0.007079487666487694,
        0.029027769342064857,
        -0.01727527752518654,
        0.1375659704208374,
        0.007407225202769041,
        -0.06903344392776489,
        -0.065549336373806,
        0.070428267121315
    ]
}