{
    "id": "pyVZ05SO0Ic",
    "title": "I saved the best for last - Intel Design Center Development Motherboard",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-06T17:21:45Z",
    "video_url": "https://www.youtube.com/watch?v=pyVZ05SO0Ic",
    "category": "Science & Technology",
    "tags": [
        "intel motherboard",
        "intel development lab",
        "intel israel design center tour",
        "intel design center motherboard",
        "development motherboard",
        "top secret development board",
        "intel alder lake"
    ],
    "views": 1361306,
    "likes": 65430,
    "comments_count": 1952,
    "description": "Checkout iFixit's toolkits at:    In the last part of my Intel Israel Design Center tour we got to go deeper into their validation lab and see up close and personal what a development motherboard and the tools around it look like.  Discuss on the forum:   Learn more about Intel Transistors:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro & Motherboard 6:46 The TOP & Remote Validation 8:07 Cooling & The Thermal Head 9:28 Hot-Swap Chipset? Think Again 10:03 The Overclocking Lab 14:19 The Game Demo Room 16:47 Thank You",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://linustechtips.com/topic/1441525-this-secret-motherboard-is-priceless/",
        "https://youtu.be/Z7M8etXUEUU",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- My mind was so blown by the 12th gen Alder Lake reference validation platform motherboard that I had to do an entire video about not just it, but the amazing test benches that Intel uses in their validation labs. Why is this so mind blowing to me? Well, not because it has the most features, or overclocks better than a retail board, or even fits in a normal computer case, but because the tools that Intel creates for CPU development, including these boards, are absolutely freaking incredible. Incredible, like this segue to our sponsor. - iFixit. Whether it's your first time repairing a device or you've been doing it for years, iFixit wants to make it easier for you to keep your devices functioning. Stay tuned to the end of the video to learn more about iFixit's toolkits. (upbeat music) - Every new CPU that Intel builds needs an accompanying development platform motherboard. And I'm sure they'd be happy to have a Asus or Gigabyte do it for them, but the cold hard truth is that no one but Intel could possibly hope to build a motherboard for a CPU that hasn't even been manufactured yet. Oh, and also, most of the features and tools of these boards are both specific to the process of designing and debugging upcoming platforms. So, not as much value to general consumers and chalk full of proprietary IP that could enable Intel's competitors to clone their development methods. Whenever these things leave the building, it is under tightly controlled circumstances. This is so cool. Out of the gate, the reference validation platform, or RVP, has a lot in common with the normal motherboard. You got your LGA1700 socket, eight pin CPU power connector, 24 pin motherboard power, your PCI express lots, but it's when you get into the details that you discover the difference between a motherboard that's designed for the general public and a motherboard that's designed for day-to-day use by engineers. For example, check this out. The M.2 SSD slot up here, this is the one that runs off of the CPU directly, PCI-Express gen four by four, instead of having a little screw or a little plastic retention mechanism, this is so cool. You could mount an SSD to this thing in probably less than two seconds. You just throw the SSD in, turn this little half of a thumb screw around and boom, it's locked into place. Those are the kinds of quality of life improvements that a normal person doesn't need, but an engineer who's installing and uninstalling constantly, absolutely will. Let's go ahead and build up this board. Everything about this feels so naughty right now. I know it's just a regular CPU socket, but it's a forbidden one. Like any motherboard, we've gotta install our memory. In this case, we're installing some 4,800 mega transfer per second DDR5. 'Cause of course, that's one of the key new features of the Alder Lake platform. Then moving over to the IO, things get normal for a little bit, audio, USB, display, and then not normal. On most desktop motherboards you wouldn't find one of these. This is a female ribbon connector for eDP. And the reason that they have these on their test motherboards is because these super cool extruded aluminum test benches actually have little mounts for bare laptop displays that they can quickly and easily move around 'cause they're so light and so convenient to use and just pop on here, plug in, and boom, they're able to monitor everything the system's doing through this ribbon connector right up here at the top of the board. And the board is chalk full of similar quality of life improvements for the engineers. So, in addition to headers that you would normally see, like fan headers or internal USB 3.1, or I dunno, what do they call it now? Even here, nobody can remember the new names for all the stupid USB standards. Anyway, the point is, in addition to those, you've got stuff like this. This is a perfectly common connector, but normally you would find it on the back plane of something like a hot swappable server chassis, right? Because what it allows you to do is take a two and a half inch SSD and just plunk it on like that. Here's a fun one. You guys use PS2 because it just always works? Pretty much? Why has it got PS2? - Why not? - Why not? Why not, indeed. Bring back PS2, that's what I say. Here's another one. This is super common on server motherboards because it's pretty typical for a server to boot either from a USB drive or from the network. So, having a USB type A that you can just plug a little USB key into and you're off to the races is pretty nice, but for most desktop users you'd have no purpose for that. And even on any server board that I've ever seen, I haven't seen two of them. So, that's clearly to save them the trouble of hooking upfront IO. Here's a fun one. Another thing you wouldn't normally hook up on a test bench is your front activity LEDs. So instead ,you've actually got activity LEDs for the SATA ports built directly into the motherboard so that you can monitor the functionality. Another big difference between this and a retail board is that modern motherboards try to make as many of the parameters of the motherboard adjustable through software as they possibly can. Either because it's more work to develop that software or because sometimes it actually is just quicker to move a jumper or flip a dip switch. An engineering board like this is absolutely littered with little jumpers and dip switches that are gonna allow all kinds of different functionality to be enabled or disabled or altered as the engineers are going through their testing. Oh, this is another thing I really love. The PCIe 16x slot has no lock. That is, I just, honestly I hate them so much. I just wish every board had no lock. As for the rest of these headers, honestly, the majority of them are either so proprietary or so specialized that most of the people in this room wouldn't even have any reason to know what they're for. However, there's one really cool thing that I absolutely have to show you guys. I was really curious about this. Immediately I looked at that and I thought, oh, okay, that's a really unusual cooling solution for the PCH or for the motherboard chipset, but I was wrong. What this is actually for is so that as they are revising the hardware of the chipset, they can remove it from the motherboard, swap it out for the new revision, put it onto the board, flash a new BIOS, and there's no reason to completely recycle or remanufacture this board. That is an enormous time savings in development because while I'm sure the engineers would love to wait around for a partner to manufacture a whole new motherboard for them, ain't nobody got time for that. Here's one I didn't recognize, but we found out what it does. It actually, here we go. You can see it running on this system right here. It is connected to the CPU through kind of like a, you could call it a back door, but really what it's for is monitoring and diagnostics. And it goes out to this proprietary box, which goes into this USB hub right here that actually communicates to this guy. So, this you could think of as kind of like the brains of the test bench because something you might have noticed throughout our series of videos here is that most of the testing stations don't actually have an engineer sitting in front of them, staring at the screen watching the test run. That would be kind of silly in this day and age. So, almost every parameter can be adjusted other than physically unplugging and re-plugging something into the device, remotely through this host system. And they've got some other really cool quality of life devices as well. There isn't one on this bench, but we saw one on the gaming test bench down in the demo room that's basically a BIOS emulator. So, under normal circumstances if you wanna flash the BIOS, it's extremely slow. That's very, very slow memory that you need to overwrite in order to put a new BIOS on the motherboard. So, instead what you can do is you can get a BIOS emulation device that you can just quickly dump a new BIOS onto and you can have it become a new version of the BIOS in like three seconds. Now, of course, the reference validation platform is compatible with normal air coolers like this one, but the engineers here have much, much cooler toys. This is called a thermal head and we kind of glossed over this one in one of our previous videos. But in a nutshell, it connects to a water supply that is run throughout the building. So, it can either be chilled or heated, as well as an air supply that runs throughout the building. And this puppy is capable, in fact, this just came off a running test bench. So you can see if I flip it over it's got condensation on it because this thing is capable of reaching subzero temperatures which is what allows Intel to validate their processors at the entire thermal operating range that they advertise. And according to the engineers here, a lot of the time they'll push it quite a bit beyond that just to see what happens. Now, I can't give you too many details about how this puppy works. In fact, I can't even show you the rig on the bottom of it because it's for a processor that's not really released yet, but you can see that in addition to water and air in, which is handling heating, cooling, and then condensation management, they've got this interface right here that plugs into their control module that can be configured either manually by the technician or remotely as part of one of these complete setups like we see running behind me. Another superpower of this board is that Intel obviously has many different motherboard chipsets that support the features of their accompanying processors to various degrees. Maybe over clocking or not, or fewer PCI express lanes, or other connectivity. So, naturally I assume that since they have a swappable chipset socket system, that they would just swap on a B series chipset or whatever they need. Think again, ladies and gentlemen, the chips that they use here are actually called a super sku and they can be reconfigured to be whatever the engineer wants it to be. Of course, as you guys can probably imagine, not everything Intel wants to test can be done on exactly the same motherboard. Welcome to the overclocking lab where they've actually got a different version of the RVP that instead of having 8-phase power is equipped with 16-phase power and, at least at the moment, an LN2 pot for a subzero overclocking demo that they've got set up for me. So, you guys are running, I'm assuming this is gonna be a 12900K, is that right? - Yes, right. - Okay. This is obviously the DDR5 version of the platform and I see XTU is up here. So, here's one of those test bench control hosts. And then what is this connected to? - To the motherboard. - Where? - Here, in this USB. - Okay. So, it's the same thing we saw before and then you guys are allowed to go in and just play around with CPU parameters live? - Yeah. - Sure, check this out. - Okay, check this out, Dennis. - We're gonna close it. - Okay. - [Man] I'm gonna reload it with a new configuration that we just changed through the host. - Okay, that is hilarious. Now for the rest of us, I know one of the big things that you guys are proud of with Alder Lake is the new one touch speed optimizer. Is that right? So, we did an overclocking demo yesterday where basically they demonstrated that with one button you can get about 5% extra performance out of the platform. But, I think your intention was to push it a little bit further today. Is that right? - Yes. And one more thing . As you mentioned, we can do it all through the tap boxes. We don't need exterior, no need BIOS, nothing. - Wait, so you're gonna, wait. You're gonna overclock it using your developer interface. - Correct. - Okay, I love it. I love it. So wait, so, so that just interfaces using USB? Doesn't it have anything else? The one upstairs was connected to like this guy or something. - [Man] There are several connectors. - Oh. - There is XTP. - There is- - Typical engineer things. Why have one interface when you can have three? Okay, okay. Do it. Basically he's got like a terminal open over there. So this is like legit packing the mainframe level overclocking. Hit me. Now tell me something, as part of your overclocking validation, do you guys go and like hand cherry pick silicon to see what the limits are? - [Man] As you can see here, just a second. - We're about to see a golden sample, ladies and gentlemen. So, is this the percentile out of like 100 for quality or something like that? - [Man] Yes. - So, if I want a really nice E-Core overclocker, I want this one right here? It's a joke, it's a joke. - Yes. - 'Cause it's, it's, yeah. Yeah, terrible, I know. Tell me something. This one looks really nice. Is that the maximum P-Core overclock? - [Man] Yes. - Woo, hoo, hoo! (light music) We're watching the frequency. Okay, we're at 5.2, just like that. Ladies and gentlemen, it is the power of the tap box, which I've been informed stands for top access probe. Fun fact, you might think that top is because it's like top tier, but actually it's because the probe used to be on the top of the CPU. Now it's on the bottom, but the name is still the same. And you're just going in and you're just changing values on the CPU right now. - We're changing the ratio. - Have internal access through the registers. - Ridiculous. Whoa, those E-Core clocks though. 4.8 on the E-Cores? How high are you guys expecting to go here? - [Man] Till I think 5.2, 5.3, maybe more. - On the E-Cores? - Yes. - Five plus on E-Cores. Okay, it's official. I need like- - Now you're dead. - Oh, that's okay. Honestly, for our purposes, that is an amazing demo of the kinds of tools that you guys have to go in and just make alterations to the CPU while it's working. A lot of what we learned about the reference validation platform though was actually here in the demo room where I got a chance to chat with some of the folks who work on the gaming performance validation team. So, they explained to me in real world terms why functionality like this is so important. So, we're looking at Hitman 3 running over here right now, all of the tests that they do are automated. So, it'll run through 10 loops of the benchmark and then it'll pull all the performance parameters that you would normally expect. Your average FPS, your 99 percentile lows, all of that good stuff, but that's not enough because they're going through so many revisions of firmware, for example, that they would end up running a benchmark suite like this, literally over 1,000 times over the course of product development. And when you're testing that many variations of the BIOS, the difference between waiting around two to five minutes for it to flash and being able to do it in three seconds is absolutely critical. You might have noticed, by the way, that this test platform isn't using the Intel integrated graphics. And that's because this team is laser focused on treating the SOC as a gaming CPU. So instead, they're using a high-end, third-party graphics card, in this case, an RTX 3090 and they're actually running all of their benchmarks at 1080p because they are mostly concerned with situations where the CPU would end up being the bottleneck. So, if say a security fix rolls in, they wanna make sure that that's not gonna cost you any FPS today. And even if you were to upgrade your graphics card, you're still gonna be able to get the most out of it. And since we're here, the demo room was full of all kinds of other cool stuff that's worth taking a look at. This crazy monitor stand includes a next level Thunderbolt dock that not only does everything a Thunderbolt dock does, but allows the notebook to run in a completely hands-off manner. So, it can even control powering it on and powering it off. The new Killer networking app allows you to connect via two wireless bands simultaneously and steer your high priority apps like games to the fast lane while you redirect background tasks to 2.4 gigahertz. This animation here, demonstrating Alder Lake's Thread Director, is super cool. Basically what you're seeing is the CPU's ability, no matter what types of tasks are being thrown at it, to provide hints to the operating system about which processes should stick to which types of cores in order to help achieve the enormous generational performance gains that we're seeing over Rocket Lake. And you can see those on display at the productivity table. Absolutely incredible stuff, guys. But the most unbelievable part of this whole trip was walking into a place like IDC and seeing the engineers and techs clamoring to get a selfie with me. I mean, I'm flattered. Thank you. But, y'all know that you're the real MVPs, right? Like it's kinda like watching a weird comedy sketch where the professional sports ball game ends and then the players all run over to the sidelines to get an autograph from the play-by-play commentator. Like, thank you, but you guys are doing the real work. None of that matters though. What matters is that you guys were the most gracious and accommodating hosts that I could have possibly asked for. And I appreciate all the love y'all gave me. And I hope that I can visit again the next time you make something groundbreaking. Or well, scratch that. If I commit to come back here every time you guys create something groundbreaking, I'm gonna spend more time in Israel than telling you about my sponsor. Got you with that segue, didn't I? iFixit. iFixit is here to help you repair or upgrade everything from your phone to vintage game consoles. Their Pro Tech kit has 64 steel bits and the popular steel blade, Jimmy, for precise prying. The kit also includes a flex extension for screws in hard to reach places, suction cups, antistatic wrist straps, and more. And there's no need to worry if a tool breaks thanks to iFixit's lifetime warranty. So, start saving time and money by repairing your own electronics and use one of iFixit's over 70,000 detailed step-by-step photo guides to ensure you don't get lost along the way. Find your perfect repair kit by heading to iFixit.com/LTT. - You guys enjoyed this video, frankly, we've never experienced anything quite like it. So, just go watch something else from the series, it's been absolutely unreal.",
    "transcript_keywords": [
        "CPU",
        "motherboard",
        "Intel",
        "guys",
        "USB",
        "BIOS",
        "board",
        "test",
        "Alder Lake",
        "platform",
        "test bench",
        "reference validation platform",
        "platform motherboard",
        "thing",
        "engineers",
        "validation platform",
        "time",
        "development platform motherboard",
        "normal",
        "validation platform motherboard"
    ],
    "transcript_entity_values": [
        "Alder Lake",
        "IP",
        "Rocket Lake",
        "E-Core",
        "iFixit",
        "one",
        "day-to-day",
        "second",
        "XTP",
        "SOC",
        "four",
        "over 70,000",
        "12th",
        "first",
        "LGA1700",
        "100",
        "SSD",
        "two to five minutes",
        "Thunderbolt",
        "eight",
        "RVP",
        "less than two seconds",
        "Asus",
        "some 4,800",
        "three seconds",
        "Thunderbolt",
        "Alder Lake's",
        "2.4 gigahertz",
        "99",
        "Dennis",
        "1080p",
        "4.8",
        "today",
        "16",
        "5.3",
        "PCI",
        "SATA",
        "10",
        "3090",
        "16x",
        "Israel",
        "8",
        "about 5%",
        "64",
        "3",
        "Gigabyte",
        "yesterday",
        "E-Cores",
        "over 1,000",
        "three",
        "Pro Tech",
        "CPU",
        "Jimmy",
        "like three seconds",
        "USB",
        "5.2",
        "USB 3.1",
        "third",
        "this day",
        "PCH",
        "P-Core",
        "24",
        "PCI-Express",
        "two",
        "DDR5",
        "Intel",
        "IO",
        "Alder Lake",
        "years"
    ],
    "transcript_entity_types": [
        "LOC",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.09211257100105286,
        -0.05351819470524788,
        -0.01701340638101101,
        -0.03605854511260986,
        0.04170266166329384,
        -0.012376604601740837,
        -0.02405441924929619,
        0.06262313574552536,
        -0.05293906107544899,
        -0.008732029236853123,
        0.014913924038410187,
        -0.053257957100868225,
        -0.11096803843975067,
        -0.051763832569122314,
        -0.07969047129154205,
        0.05711701512336731,
        0.03180569037795067,
        -0.03670840337872505,
        -0.018568897619843483,
        -0.024429192766547203,
        0.005776785779744387,
        -0.06524774432182312,
        -0.01095972303301096,
        -0.004332172684371471,
        0.006761880125850439,
        0.08215128630399704,
        0.09789540618658066,
        0.027758924290537834,
        0.01073880773037672,
        -0.08506473153829575,
        -0.027185438200831413,
        0.06579086929559708,
        0.016653355211019516,
        -0.04094919562339783,
        0.019515862688422203,
        0.011294976808130741,
        0.04273397475481033,
        -0.04907689616084099,
        0.036120761185884476,
        -0.13430480659008026,
        -0.020048372447490692,
        -0.06128164753317833,
        0.027372734621167183,
        0.015177132561802864,
        0.00992543250322342,
        -0.0028832568787038326,
        0.006302181165665388,
        -0.18572919070720673,
        0.00558461481705308,
        0.0009965975768864155,
        -0.05784083902835846,
        -0.13970716297626495,
        0.03450321778655052,
        -0.027180638164281845,
        -0.016101982444524765,
        0.021614056080579758,
        0.04235777258872986,
        -0.05170213058590889,
        0.08147505670785904,
        -0.0514339879155159,
        0.07959149032831192,
        -0.05596635863184929,
        -0.019245143979787827,
        0.06234614923596382,
        0.03302586078643799,
        -0.00293536763638258,
        -0.005541473161429167,
        0.03339767083525658,
        -0.021464429795742035,
        -0.041373807936906815,
        0.010441582649946213,
        -0.002221539383754134,
        -0.037393465638160706,
        0.05143551528453827,
        3.4100488846888766e-05,
        0.028272900730371475,
        0.06582330167293549,
        -0.04836338385939598,
        0.03704908490180969,
        -0.06540273129940033,
        -0.008306718431413174,
        0.01673286408185959,
        0.037822868674993515,
        -0.016891619190573692,
        0.05683833733201027,
        0.0185804795473814,
        0.03361757844686508,
        -0.004158787429332733,
        0.05396728962659836,
        -0.07354611158370972,
        0.03447192907333374,
        0.056102994829416275,
        0.08027160912752151,
        -0.007457063067704439,
        0.06919052451848984,
        0.018154744058847427,
        -0.03015162982046604,
        -0.09448088705539703,
        0.01643049530684948,
        0.05836492404341698,
        0.02308608405292034,
        0.03313343971967697,
        -0.004313554149121046,
        0.046441782265901566,
        -0.034476183354854584,
        0.013753063976764679,
        0.00944663118571043,
        0.09561979025602341,
        -0.05029458552598953,
        0.003971821162849665,
        -0.027273226529359818,
        0.05727868154644966,
        -0.07246517390012741,
        -0.06105690449476242,
        0.044246893376111984,
        -0.023312097415328026,
        -0.02298407442867756,
        0.05482793226838112,
        0.08249550312757492,
        0.0004061119398102164,
        -0.04016188904643059,
        0.04351441189646721,
        -0.030756428837776184,
        0.01713033951818943,
        -0.01058134250342846,
        0.04616570845246315,
        -0.14000585675239563,
        -1.5771331624522307e-35,
        0.021533777937293053,
        0.031109554693102837,
        -0.08287517726421356,
        0.003136272309347987,
        0.05498794838786125,
        -0.0325981080532074,
        -0.014158996753394604,
        0.021052241325378418,
        -0.04870810732245445,
        0.026661667972803116,
        -0.011253434233367443,
        -0.06347180157899857,
        -0.037467941641807556,
        0.03375214338302612,
        0.01777033880352974,
        -0.10322526842355728,
        0.0037993399892002344,
        -0.03862156346440315,
        0.0051774801686406136,
        0.036521535366773605,
        0.007935344241559505,
        -0.06560706347227097,
        -0.013552975840866566,
        -0.02095729298889637,
        0.12209106236696243,
        0.010621159337460995,
        0.02550315670669079,
        0.021755538880825043,
        -0.056401897221803665,
        0.012963560409843922,
        -0.0311351977288723,
        -0.049765244126319885,
        -0.0004099238431081176,
        -0.10714628547430038,
        0.006034069694578648,
        0.08192822337150574,
        -0.018853239715099335,
        -0.07226594537496567,
        -0.03675153851509094,
        -0.01632583886384964,
        -0.04023928940296173,
        0.029554028064012527,
        -0.0765126645565033,
        -0.042831458151340485,
        0.021649276837706566,
        0.032252997159957886,
        -0.003316952148452401,
        -0.004239088390022516,
        0.10130978375673294,
        -0.03389299288392067,
        -0.0960489884018898,
        -0.007775455713272095,
        -0.03948791325092316,
        -0.030088121071457863,
        -0.005614369176328182,
        0.01746462471783161,
        -0.016732079908251762,
        -0.009019988588988781,
        0.09517210721969604,
        0.1135573759675026,
        -0.027556391432881355,
        0.03370044752955437,
        -0.06175294890999794,
        -0.0007048471015878022,
        -0.06898356974124908,
        0.10860192030668259,
        0.03229960426688194,
        0.0006219668430276215,
        -0.010594082064926624,
        -0.0395440012216568,
        -0.085988350212574,
        -0.07458537817001343,
        0.08899474143981934,
        0.00266528339125216,
        -0.06858314573764801,
        0.015318063087761402,
        -0.0988246276974678,
        -0.10334184765815735,
        -0.040434081107378006,
        -0.06681172549724579,
        -0.023323673754930496,
        -0.012458248995244503,
        0.0032765292562544346,
        0.008200334385037422,
        0.04775408282876015,
        -0.015497426502406597,
        -0.014655422419309616,
        -0.0552690252661705,
        -0.03247794881463051,
        -0.017322933301329613,
        -0.04970338195562363,
        -0.0323837585747242,
        0.04305969923734665,
        -0.0013575300108641386,
        -0.07922189682722092,
        -3.313639963783317e-33,
        0.0018008362967520952,
        0.03790793567895889,
        -0.025094764307141304,
        0.06045714020729065,
        -0.019804690033197403,
        -0.00688836770132184,
        0.024261772632598877,
        -0.026018887758255005,
        0.01599820889532566,
        0.013254319317638874,
        0.06431087851524353,
        0.024041900411248207,
        -0.06767323613166809,
        -0.11764207482337952,
        -0.03264826536178589,
        0.009713537059724331,
        -0.05659417808055878,
        -0.09346108883619308,
        0.10410929471254349,
        -0.04442042112350464,
        0.09242536872625351,
        0.07387290894985199,
        -0.04566764831542969,
        0.007594796363264322,
        -0.02117234468460083,
        0.008856313303112984,
        0.03742222115397453,
        0.08114125579595566,
        0.008517698384821415,
        -0.0012233264278620481,
        0.027971934527158737,
        -0.05901416391134262,
        -0.024677271023392677,
        0.06779403984546661,
        0.008472677320241928,
        -0.023145310580730438,
        0.041036467999219894,
        0.009431893937289715,
        0.01538077276200056,
        0.028783518821001053,
        0.013270318508148193,
        0.07012119144201279,
        -0.0375991091132164,
        0.03306746110320091,
        -0.06225954741239548,
        0.05661347508430481,
        0.013392875902354717,
        0.03585619479417801,
        0.016538089141249657,
        -0.07589703798294067,
        -0.02120096981525421,
        -0.08011295646429062,
        0.0214198287576437,
        -0.014225966297090054,
        -0.02801448479294777,
        -0.009984232485294342,
        0.05429718643426895,
        0.0718773603439331,
        0.003172876313328743,
        -0.019208936020731926,
        0.06980407983064651,
        -0.042962510138750076,
        0.05123215541243553,
        -0.07175253331661224,
        0.023443587124347687,
        -0.04085899144411087,
        0.03638758882880211,
        0.07014791667461395,
        -0.04434235394001007,
        0.021627409383654594,
        -0.10072056204080582,
        -0.02129688486456871,
        -0.017596861347556114,
        -0.07684146612882614,
        -0.029969846829771996,
        0.01974695362150669,
        -0.005524769891053438,
        -0.036734797060489655,
        0.06927479058504105,
        -0.05555596947669983,
        -0.02351386658847332,
        0.01789698377251625,
        0.016389649361371994,
        -0.00459741847589612,
        0.10791581869125366,
        0.02971327304840088,
        0.010776503942906857,
        0.017060356214642525,
        -0.012321333400905132,
        -0.03571689873933792,
        -0.0999351367354393,
        -0.02381211519241333,
        -0.0019030345138162374,
        -0.00879401434212923,
        -0.07350416481494904,
        -6.44695674623108e-08,
        0.0746544599533081,
        -0.028699859976768494,
        -0.030775848776102066,
        0.026546066626906395,
        0.02024410106241703,
        -0.10279974341392517,
        0.05034632980823517,
        -0.049957986921072006,
        0.009802364744246006,
        -0.01748538576066494,
        -0.022337358444929123,
        -0.06324860453605652,
        -0.06958015263080597,
        0.05624813959002495,
        0.06052076071500778,
        0.039360739290714264,
        -0.035220835357904434,
        0.0962008386850357,
        -0.04479373246431351,
        -0.10595366358757019,
        0.012433522380888462,
        0.03644140437245369,
        0.09599179774522781,
        -0.033981792628765106,
        -0.006715205032378435,
        0.03851865231990814,
        0.032922450453042984,
        0.08928330987691879,
        0.06424125283956528,
        -0.005850615445524454,
        -0.019064050167798996,
        0.045279961079359055,
        0.1030416190624237,
        -0.06508559733629227,
        0.09247712790966034,
        0.02550482749938965,
        0.004206615965813398,
        0.012389852665364742,
        0.1038067638874054,
        0.04335305094718933,
        -0.04300565645098686,
        -0.046568162739276886,
        0.005645222961902618,
        0.019499728456139565,
        -0.018706222996115685,
        0.007723397109657526,
        -0.039225053042173386,
        -0.05189291760325432,
        -0.028417035937309265,
        0.024113748222589493,
        0.003903157077729702,
        -0.022708889096975327,
        -0.04767609015107155,
        0.06144137308001518,
        0.09733806550502777,
        0.05061577633023262,
        -0.0998644232749939,
        0.045457903295755386,
        0.04279739782214165,
        0.050616949796676636,
        0.12218871712684631,
        -0.05458863824605942,
        -0.022550389170646667,
        -0.012912169098854065
    ]
}