{
    "id": "Q0sxqze-8tc",
    "title": "This is just too fast! 100 GbE // 100 Gigabit Ethernet!",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-06-25T14:13:52Z",
    "video_url": "https://www.youtube.com/watch?v=Q0sxqze-8tc",
    "category": "Science & Technology",
    "tags": [
        "100gbe",
        "100g ethernet",
        "100 gigabit ethernet",
        "100 gigabit internet",
        "100gbe switch",
        "ethernet",
        "100gbe network",
        "25gbe switch",
        "25gbe",
        "network switch",
        "100 gig",
        "dac cable",
        "ryzen 9",
        "rx 6900 xt",
        "networking",
        "aruba",
        "aruba networks",
        "QSFP28",
        "qsfp",
        "100g",
        "100g qsfp",
        "aruba 8360",
        "aruba 6300m",
        "aruba 100g switch",
        "aruba 50g switch",
        "aruba networking",
        "ethernet switch",
        "qsfp+",
        "hpe",
        "dac",
        "sfp+",
        "ethernet cable",
        "arubaos",
        "mellanox",
        "mellanox connectx-4",
        "mellanox connectx",
        "iperf",
        "iperf3",
        "iperf windows 10",
        "robocopy",
        "hp"
    ],
    "views": 77488,
    "likes": 2159,
    "comments_count": 408,
    "description": "This is crazy! Testing 100 GigE (100 Gigabit Ethernet) switches with AMD Ryzen 9 5950X CPU and Radeon RX600XT GPU! Who will win? 100 GbE Network or Gaming PCs with 100 Gig network cards?  Menu: 100GbE network! 0:00 How long will it take to copy 40Gig of data: 0:22 Robocopy file copy: 1:08 Speed results! 1:28 Windows File copy speeds: 1:59 iPerf speed testing: 2:30 iPerf settings: 3:20 iPerf results: 3:42 100G Mellanox network cards: 5:14 Jumbo Packets: 6:04 Aruba switch: 6:26 Switch configuration: 7:07 Back to back DAC 100GbE connection:8:52 iPerf testing using DAC cable: 10:05 Windows File copy speeds: 11:00 Robocopy test: 11:30  ========================= Free Aruba courses on Udemy: ========================= Security:  WiFi:  Networking:   ================================== Free Aruba courses on davidbombal.com ================================== Security:  WiFi:  Networking:   ====================== Aruba discounted courses: ====================== View Aruba CX Switching training options here:   To register with the 50% off discount enter DaBomb50 in the discount field at checkout.   The following terms & conditions apply: 50% off promo ends 10/31/21 Enter discount code at checkout, credit card payments only (PayPal) Cannot be combined with any other discount. Discount is for training with Aruba Education Services only and is not applicable with training partners.  ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:     aruba aruba 8360 aruba networks aruba networking abc networking qsfp iperf robocopy aruba 6300m 100gbe switch 25gbe switch  dac cable  aruba instant one hpe hp hpe networking aruba mobility aruba security training free aruba training clearpass clearpass training hpe training free aruba clearpass training python wireshark mellanox mellanox connectx mellanox connectx-4  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #100gbe #100gigethernet #arubanetworks",
    "description_links": [
        "https://davidbombal.wiki/arubasecurity",
        "https://davidbombal.wiki/arubamobility",
        "https://davidbombal.wiki/freearubacourse",
        "https://davidbombal.wiki/dbarubasecurity",
        "https://davidbombal.wiki/dbarubamobility",
        "https://davidbombal.wiki/dbarubanetworking",
        "https://davidbombal.wiki/arubatraining",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- Now, this is the type of home network that you want in 2021. Notice the interface speed on this PC, 100 gigabits per second. On this PC 100 gigabits per second. How long will it take me to copy a folder, 40 gigabytes of data from one PC to the other. Now to speed things up, I'm gonna use Robocopy rather than Windows file copy. It supports multiple threads so I can copy data more quickly. How long will it take me to copy a folder from C, Users, David, Downloads, large files, 40 gigabytes of data to this shared drive in the temp directory on my server. So on the PC on the right. Windows, temp, nothing is in that folder. Let's press enter and see how long it takes to copy 40 gigabytes of data from one PC to the other. 6.6 gig, interview file has been copied. 12.8 gig, movies file has been copied. 20.4 gig, VMware zip file has been copied. According to Robocopy that's the speed of transfer. That amount of bytes a second equates to 4.10 gigabytes of data per second or 32.835 gigabits of data per second. Now that's not too bad. I think for a home network. Again on my server, I now have 40 gig of data. If I delete that and go back to the client PC and copy that using Windows file copy. I will get lower speeds, but two gigabytes is not too bad for using Windows file copy. I personally would use Robocopy 'cause it's much quicker. I've got a problem that my network is too fast. What a good problem to have the network is too quick. PCs can handle this amount of bandwidth. (upbeat music) Now let's use Iperf to check the actual sending of traffic from one PC to the other. So on both PCs I'll go to my Iperf directory. Iperf is software that you can download to do performance testing of a network. On the PC on the right I'm going to start a server process. Server is listening on port 5201. On the client PC I'm gonna send traffic to 10.1.1.102 which is this PC on the right 10.1.1.102 So PC on the left, IP address, 10.1.1.101 is gonna send traffic to the PC on the right 10.1.1.102. In Iperf we're connecting to the server on port 5201 that's the port number that the server is listening on. I'll set the length to 512K that gave me the best throughput, time out of 30 seconds. 18 processes will be used. We won't count the first three seconds. We are connecting from the client to the server. Try that again. Connecting from the client to the server. We're getting 49.9 gigabits per second, 55 gigabits per second. In my test here the best I could get was about 56.3 gigabits per second. This is not a network problem. This is a PC problem. The PCs can simply not handle the amount of traffic being sent into the network. So if I have a look at performance as an example, you can see that this is displaying network at 100% even though it's not actually at 100%. You can see 55.3 gigabits per second was the summary. I'll run that again. Back in Task Manager, you can see it's showing 56 gigabits per second, being sent, 46 meg been received. The PC is struggling with this amount of data. On the PC on the right you can see 56.2 gigabits per second of data is being received. Once again, on PC on the left of 56 gig, 55 gig. This PC, even though the CPU is low, these are Ryzen 9 processors in these PCs. The PC cannot handle the amount of data probably to do with the bus on the PC or Windows or something else. If you have suggestions on ways that I can improve this, let me know. But in my tests, I found that even optimizing the PC, for example, under Network and Sharing Center, going to adapter settings. These are 100 gig Mellanox Connect four X network cards in the computer. You can see 100 gigabits per second. My PCs, even with a bunch of optimization, including setting jumbo packets to 9,000, couldn't handle more than about 56 gigabits per second. So limitation on the PC, I'll show you later in this video where I connect them back to back and do a similar kind of test. Didn't get much better performance than that. I've got a problem that my network is too fast. What a good problem to have. The network is too quick. PCs can handle this amount of bandwidth. So go to properties here. Configure on the side, Mellanox ConnectX-4, jumbo packets is set to 9,000. I've enabled a bunch of other settings, such as network direct technology. I've played around with a buffers. A whole bunch of other settings best I could get was about 56 gigabits per second. I've also added a very basic configuration to the Aruba switch that I'm using in this typology. Right click on Windows Start, Device Manager, have a look at COM ports. I've got a USB Serial COM port. In this example, I've downloaded PuTTY. I can connect it to COM5. The COM port that I was picked up. Speed I'll use is 115200. Click open, log in with my user name of admin. No password, that's the default . I'll make this slightly bigger so it's easier to see. In this example I've got an Aruba 8360 Switch. Show run shows me the configuration on the switch. Very basic configuration IP address of VLAN 1 is 10.1.1.254. The important piece, however, is that port and this port. Those are the two ports that my PCs are connected to. Show interface brief shows me that, I'll make PuTTY bigger. Type the command again. Notice interface 1/1/1 running at 100 gigabits per second. It has a QSFP28 DAC cable connected. Interface 1/1/5 QSFP28 DAC1, running at 100 gigabits per second. Those two interfaces have been configured with no routing. Rather than using routing I'm just using simple switching between one interface and the other. I've set the MTU to 9198, which is bigger than what the PCs are using. That is the biggest MTU that I could configure the interfaces to use. So I've used an amount of 9198 bytes, biggest interface size. Very simple configuration on the Aruba switch. I'm basically switching from one interface to the other. PC one is connected to this port. PC two is connected to this port using DAC cables. This however is the kind of home network that you want. I really wanna thank Aruba for sponsoring this video and sending me some cool equipment to demonstrate 100 gig per second is the kind of home network that I think all of us want in 2021. Now let's see if removing the switch makes any difference. Spoiler alert, it won't. The PCs are the limiting factor here, but let me demonstrate a back-to-back connection. So one PC connected directly to the other PC and I'll send traffic between these two PCs. Let's see if the results get any better. Okay, so PC on the left, I'll open up a Command Prompt. I'll go to my Iperf directory. I'm gonna use the command Iperf. We're acting as a client, we're connecting to the server. Server is the PC on the right IP config shows me that the IP address of the server is 10.1.1.102. That's the server that we're connecting to. We're gonna use port 5201. The reason for that is when I run Iperf on the computer and I'll clear the screen. So Iperf, and I'll make it a server, by default it's using port 5201. So that's the port we'll use on the client. The length that we'll use is 512K, timeout is 30 seconds. 18 processes will be used and the first three seconds will not be taken into account. As you can see there, we're sending at 50 gigabits per second, 55 gigabytes per second, but that's not too bad. 56 gig a second. This is again, a direct connection from one PC to the other. PC on the left is the client sending traffic to the server on the right. We can see similar kind of results on the server. Notice 56 gigabits per second. The average there was 55.8 gigabits per second. Okay, so open up File Explorer. We've got this large files directory, 40 gig of data. I'll open up another window. The O directory is a share on PC two. So I'm connecting to PC two to the temp directory on PC two, the server on the C drive. Nothing is in the temp directory. If I try and copy that directory to the PC on the right, the speeds I'm getting are about 2.2 gigabits per second. Windows file copy is limited. It doesn't use multiple threads, not the best way to copy files from one PC to another, but there you go, that didn't take too long. I've now got those files on the right-hand side. I'll delete those files and let's rather use Robocopy, which is multi-threaded allows me to send the data a lot quicker. So I'll open up another Command Prompt. I'll paste my command in. Okay, no files on the server at the moment. Press enter. We can see the file is been copied. So that's 6.6 gig on the server. We can see a test directories there. We can see some files have been copied already. Movies has been copied. 20 gig file has been copied. That entire file copy took 11 seconds, 11 seconds to copy 40 gig of data from PC on the left to PC on the right. Notice it started at this time and it ended at this time. According to this, the speed is that per second. So that amount of bytes per second equals 3.86 gigabytes of data per second, which is 31 gigabits per second. I was hoping to get closer to 100 gigabits per second, but that's probably an issue with Windows. It might be the motherboards on these computers, maybe other issues on these computers. These CPUs are Ryzen 9 CPUs. They are not pushed to the limit, but they are probably some other limiting factors. If you've got any ideas of how I can improve this, let me know. And I'll see if I can improve this in a second video, but hopefully you enjoyed this video. I really wanna run my home network at 100 gigabits per second, but there are issues that I'm encountering. PCs can support that amount of bandwidth. A lot of home devices can simply not use all of that bandwidth, but fantastic way to run a home network. Now, if you enjoyed this video, please like it. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I'm David Bombal, I wanna wish you all the very best. (upbeat music)",
    "transcript_keywords": [
        "gigabits",
        "Windows file copy",
        "network",
        "server",
        "data",
        "copy",
        "Windows file",
        "file",
        "file copy",
        "gig",
        "port",
        "Iperf",
        "Windows",
        "home network",
        "PCs",
        "amount",
        "files",
        "gigabytes",
        "directory",
        "interface"
    ],
    "transcript_entity_values": [
        "4.10 gigabytes",
        "Mellanox Connect",
        "11 seconds, 11 seconds",
        "Windows Start, Device Manager",
        "Robocopy",
        "31 gigabits",
        "55 gigabits",
        "9198",
        "50 gigabits",
        "about 56.3 gigabits",
        "49.9 gigabits",
        "40",
        "40 gigabytes",
        "40 gigabytes",
        "56.2 gigabits",
        "32.835 gigabits",
        "four",
        "this PC",
        "two",
        "MTU",
        "6.6",
        "Aruba 8360 Switch",
        "512",
        "Ryzen 9",
        "CPU",
        "55.8 gigabits",
        "second",
        "YouTube",
        "100%",
        "2021",
        "9,000",
        "Mellanox",
        "56",
        "100 gigabits",
        "VLAN",
        "IP",
        "File Explorer",
        "1/1/1",
        "20.4",
        "46 meg",
        "the first three seconds",
        "Aruba",
        "one",
        "about 56 gigabits",
        "about 2.2 gigabits",
        "Ryzen 9",
        "40",
        "VMware",
        "5201",
        "9198",
        "10.1.1.101",
        "55 gigabytes",
        "David, Downloads",
        "Network and Sharing Center",
        "100",
        "30 seconds",
        "12.8",
        "Windows",
        "55",
        "David Bombal",
        "55.3 gigabits",
        "two gigabytes",
        "20",
        "3.86 gigabytes",
        "18",
        "56 gigabits"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "WORK_OF_ART",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.02381199225783348,
        0.005768916103988886,
        -0.03760629892349243,
        -0.0017201800365000963,
        0.017766376957297325,
        -0.04999313876032829,
        -0.018881382420659065,
        -0.01986178569495678,
        -0.11144986748695374,
        0.02791789546608925,
        0.01268804632127285,
        -0.01413156371563673,
        -0.10975225269794464,
        -0.046780649572610855,
        -0.08501184731721878,
        -0.004408976063132286,
        0.07812778651714325,
        -0.0658072978258133,
        -0.04034049063920975,
        0.05859210342168808,
        0.004667161963880062,
        -0.1291104406118393,
        -0.02796235866844654,
        -0.09361006319522858,
        0.05320383608341217,
        0.04567896947264671,
        0.015320884063839912,
        -0.02925441414117813,
        -0.07342138141393661,
        -0.023825157433748245,
        -0.012177987955510616,
        0.024180876091122627,
        -0.032263945788145065,
        0.028516031801700592,
        -0.03539936617016792,
        -0.039430271834135056,
        0.03832246735692024,
        -0.059214554727077484,
        0.03365800902247429,
        -0.1033882275223732,
        0.05000787973403931,
        -0.00876077264547348,
        -0.009167570620775223,
        0.05222376063466072,
        0.012530582956969738,
        0.022343182936310768,
        0.0514456145465374,
        0.025411933660507202,
        0.07148732990026474,
        -0.05813147500157356,
        -0.09296303242444992,
        0.05168653652071953,
        -0.03500233218073845,
        -0.06358431279659271,
        -0.03389021009206772,
        0.014055769890546799,
        0.04181099683046341,
        -0.0453726090490818,
        0.016658229753375053,
        0.042510006576776505,
        -0.036479201167821884,
        -0.043187208473682404,
        -0.04021972790360451,
        0.04091262072324753,
        0.03318982571363449,
        -0.0032036700285971165,
        0.017532313242554665,
        0.06686202436685562,
        0.011891576461493969,
        -0.025140203535556793,
        -0.0159068014472723,
        0.08071698248386383,
        -0.03246721625328064,
        0.052998725324869156,
        0.024938849732279778,
        0.0319291353225708,
        0.030154380947351456,
        0.039117492735385895,
        0.008722450584173203,
        -0.1150243803858757,
        0.005881982389837503,
        -0.07502606511116028,
        0.07276823371648788,
        -0.06670088320970535,
        0.026073478162288666,
        -0.006345817819237709,
        0.02839348092675209,
        0.015519300475716591,
        -0.06824175268411636,
        -0.14193911850452423,
        0.02804918773472309,
        0.08532201498746872,
        0.04746288061141968,
        0.03324010595679283,
        0.083718441426754,
        0.01749766804277897,
        -0.024857208132743835,
        -0.029091186821460724,
        -0.047222912311553955,
        0.0009507958311587572,
        -0.0025306956376880407,
        0.0280242208391428,
        0.07972230017185211,
        0.04592417553067207,
        -0.008485204540193081,
        0.005152803845703602,
        0.05481307953596115,
        0.03189051151275635,
        -0.09221173822879791,
        0.04477204382419586,
        0.0019936752505600452,
        0.1049111932516098,
        -0.027887554839253426,
        -0.040449753403663635,
        0.034945107996463776,
        -0.016813332214951515,
        -0.0856885015964508,
        0.0647786557674408,
        -0.02921201102435589,
        0.031935036182403564,
        -0.06401695311069489,
        -0.05664672330021858,
        -0.011438180692493916,
        -0.025843331590294838,
        0.07330887019634247,
        0.030518412590026855,
        0.011448391713202,
        1.0648381615500745e-32,
        -0.0396873839199543,
        0.0240375567227602,
        -0.061878807842731476,
        -0.022318679839372635,
        -0.01720137894153595,
        -0.03380800038576126,
        0.06908761709928513,
        0.024486970156431198,
        -0.033745795488357544,
        -0.0075468095019459724,
        -0.12000135332345963,
        -0.06110656261444092,
        -0.009216690436005592,
        0.07792428880929947,
        -0.0369894877076149,
        -0.053034354001283646,
        0.03782150521874428,
        0.008668152615427971,
        -0.012514034286141396,
        0.0033502071164548397,
        0.07767549157142639,
        -0.009450755082070827,
        0.03189323842525482,
        -0.03447384387254715,
        0.029420670121908188,
        -0.05378710478544235,
        -0.037910908460617065,
        -0.0594339445233345,
        0.0627363994717598,
        0.024901133030653,
        -0.029404299333691597,
        -0.06968827545642853,
        -0.02948278933763504,
        -0.03222525492310524,
        -0.004312998615205288,
        0.045998331159353256,
        -0.0029075625352561474,
        -0.0645642876625061,
        0.001808991888538003,
        0.009405085816979408,
        -0.044144272804260254,
        -0.055104173719882965,
        -0.027378464117646217,
        -0.08169004321098328,
        -0.0984732061624527,
        -0.040596961975097656,
        0.027582334354519844,
        -0.018162308260798454,
        -0.08423735946416855,
        0.12539778649806976,
        -0.027552617713809013,
        0.00833160150796175,
        -0.04536927118897438,
        0.05649945139884949,
        0.02503630332648754,
        -0.050278183072805405,
        0.08266284316778183,
        0.035953257232904434,
        0.10743893682956696,
        0.21618764102458954,
        -0.009349585510790348,
        -0.022022241726517677,
        -0.05860045924782753,
        0.059372276067733765,
        -0.014764833264052868,
        -0.011253537610173225,
        0.02163969911634922,
        -0.00230236304923892,
        -0.02106497436761856,
        0.05760077387094498,
        0.019681205973029137,
        -0.05221930146217346,
        0.028008539229631424,
        -0.04230077192187309,
        0.10762476176023483,
        0.01380184292793274,
        -0.07358301430940628,
        -0.0574495792388916,
        -0.07198946923017502,
        -0.042239680886268616,
        -0.05708374083042145,
        0.06435250490903854,
        -0.026352757588028908,
        -0.07199985533952713,
        0.04707658663392067,
        -0.0029562748968601227,
        0.013152522966265678,
        -0.021310286596417427,
        -0.028867846354842186,
        0.01095983199775219,
        0.0076138912700116634,
        0.025888018310070038,
        0.027783812955021858,
        0.014863215386867523,
        0.013160571455955505,
        -9.212083271797394e-33,
        0.03434465453028679,
        -0.03044588677585125,
        0.04624418541789055,
        0.11578524857759476,
        0.005273059010505676,
        0.011830994859337807,
        0.06949148327112198,
        0.07218562066555023,
        -0.019212348386645317,
        -0.0567488931119442,
        0.011021796613931656,
        -0.0356123149394989,
        0.006805177312344313,
        -0.09086468070745468,
        0.008830094709992409,
        -0.10710155218839645,
        0.06066382676362991,
        -0.03986676037311554,
        0.05917483568191528,
        0.015876812860369682,
        -0.030227983370423317,
        0.07473856210708618,
        0.006027450785040855,
        0.012454546988010406,
        -0.09521453827619553,
        -0.01646438241004944,
        -0.0035028145648539066,
        -0.001797811477445066,
        0.04723518714308739,
        -0.018975840881466866,
        -0.028314441442489624,
        0.06076563522219658,
        -0.04232895001769066,
        0.01763893850147724,
        0.0862567201256752,
        0.09654023498296738,
        0.10363063216209412,
        0.0709017738699913,
        -0.03423314914107323,
        0.013646883890032768,
        0.014951305463910103,
        -0.009936941787600517,
        -0.12652692198753357,
        -0.009600172750651836,
        0.05330042541027069,
        0.03086826018989086,
        -0.06857824325561523,
        -0.05615423247218132,
        -0.024211421608924866,
        0.027632733806967735,
        0.059506356716156006,
        -0.02284354902803898,
        0.06116502359509468,
        -0.0063189673237502575,
        0.04044201597571373,
        0.003709221025928855,
        -0.056811701506376266,
        -0.020401928573846817,
        -0.01956363022327423,
        0.03394228219985962,
        0.06824344396591187,
        -0.05212303623557091,
        -0.035451848059892654,
        -0.0051567042246460915,
        0.06443201005458832,
        0.0002448480809107423,
        0.0812993049621582,
        0.03379819542169571,
        -0.0013334117829799652,
        0.032064277678728104,
        -0.05782981589436531,
        0.05653570964932442,
        -0.04365803301334381,
        -0.01497764140367508,
        -0.044940974563360214,
        -7.142847607610747e-05,
        0.06123412773013115,
        0.07625158131122589,
        0.0749456062912941,
        0.04532242938876152,
        -0.03702390566468239,
        0.04722197726368904,
        -0.025904983282089233,
        0.04886484146118164,
        -0.03708178922533989,
        0.056543633341789246,
        0.017333487048745155,
        -0.04422729089856148,
        0.028323309496045113,
        -0.09488002210855484,
        -0.00617657694965601,
        -0.01563373953104019,
        0.01946992240846157,
        0.058278024196624756,
        0.05404870584607124,
        -4.851227686231141e-08,
        0.06603224575519562,
        -0.0228766817599535,
        -0.00900019146502018,
        0.03785198926925659,
        0.003697743406519294,
        0.03611551970243454,
        -0.055164895951747894,
        -0.02039426565170288,
        -0.03371080011129379,
        0.01193945948034525,
        0.09272955358028412,
        0.025293901562690735,
        -0.07112139463424683,
        -0.025397617369890213,
        -0.029259510338306427,
        -0.024196850135922432,
        0.019599808380007744,
        -0.06173223629593849,
        0.017430614680051804,
        -0.0077715362422168255,
        0.043194480240345,
        0.027219094336032867,
        0.018193451687693596,
        -0.012671275064349174,
        0.018862759694457054,
        -0.026044895872473717,
        0.09576745331287384,
        0.017740163952112198,
        -0.015641015022993088,
        -0.04394090175628662,
        -0.026273056864738464,
        -0.07542844861745834,
        -0.03747273236513138,
        0.023499254137277603,
        0.05312729999423027,
        -0.03123490698635578,
        0.05692093446850777,
        0.14104405045509338,
        0.10355925559997559,
        -0.006045476067811251,
        -0.028351278975605965,
        -0.05484126880764961,
        0.001189757720567286,
        -0.043403927236795425,
        -0.021852949634194374,
        -0.05156939476728439,
        -0.12243001908063889,
        0.01681557670235634,
        -0.0073690470308065414,
        -0.07660199701786041,
        0.027319511398673058,
        0.03903506323695183,
        -0.03882087767124176,
        0.02768399752676487,
        0.020503975450992584,
        0.009040185250341892,
        -0.030481308698654175,
        -0.006018863525241613,
        0.006229645572602749,
        0.09845138341188431,
        0.06971385329961777,
        -0.02694525197148323,
        -0.10134609043598175,
        -0.010857036337256432
    ]
}