{
    "id": "Q2arEqzW-F8",
    "title": "iPhone XR DROP TEST vs Pixel 3 - Which Phone Survives?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-12-05T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=Q2arEqzW-F8",
    "category": "Howto & Style",
    "tags": [
        "iPhone Xr Drop test",
        "iphone xr review",
        "new iphone",
        "cheap iphone",
        "best iphone",
        "pixel 3",
        "pixel 3 review",
        "best smartphone",
        "durability test",
        "most durable iphone",
        "drop test",
        "cell phone",
        "mobile phone",
        "smartphone",
        "LastPass",
        "Lastpass chrome",
        "lastpass login",
        "last pass download",
        "random password generator",
        "lastpass premium",
        "recover",
        "lastpas",
        "lastpass",
        "lastpass.com",
        "last password",
        "how secure is my password",
        "cracked glass"
    ],
    "views": 1238530,
    "likes": 38047,
    "comments_count": 5388,
    "description": "Lets drop test the iPhone Xr and the Pixel 3!! Huge thanks to LastPass for sponsoring this video:  I noticed that there were quite a few reviewers with a broken Pixel 3. Could it be that The Pixel 3 is too fragile? And cracks easy? The only way to find out is with a drop test. Lets put the Pixel 3 head to head against the iPhone Xr. Apples 'cheaper' iPhone. With its aluminum side rails, it should have a much different result than the stainless steal sides of the iPhone XR Drop test:   Which phone is more durable in your opinion! Let me know in the comments.   Fix your iPhone or Pixel yourself with parts and guides from iFixit!:   Current iPhone XR Pricing on Amazon:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://bit.ly/2Q4IGN7",
        "https://youtu.be/WKayUI0sppQ",
        "https://www.ifixit.com/store?utm_source=youtube",
        "https://amzn.to/2JPNUX6",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Huge thanks to LastPass for sponsoring this drop test. Today we'll be drop testing the iPhone XR verses the Pixel 3. I noticed something strange when the Pixel 3 came out. All of the review units were breaking, from people like iJustine, MKBHD, Danny, even Jonathon Morrison broke Austin Evans' unit. And I don't think it's their fault. It could just be that the Pixel 3 is weaker than it should be. But the only way to find out for sure is with a drop test. Huge thanks to LastPass for sponsoring this drop test. Switching phones is a hassle. Every single app has it's own password, and you're probably being lazy and using the same password for everything. That's not good. One app that makes switching phones easier is LastPass. Used by literally millions of people, LastPass has the ability to generate long secure passwords that are encrypted, which means they are secure and you never have to remember what they are since they are saved inside of the LastPass app and auto fill for you. And since you don't need to remember your passwords, you don't need to write them down somewhere that's not secure. And you don't need to use the same password for everything. Whether you're at your computer or your cellphone, LastPass is 100% free. I'll leave a link in the description. But if you want a few extra perks, like a gigabyte of encrypted storage, it's just $2 a month. Huge thanks to LastPass again for sponsoring just drop test. Link is in the description. Let's get started. [Intro] So you might remember from the previous iPhone XS drop test that XS did really really well. It didn't break at all. But the side rails of the XS are made from stainless steel which is much different than aluminum. Aluminum is softer, which could change the results of the drop test. So right here we'll be recording in slow motion with my transparent Pixel 3. And then over here on this side we'll be using the Razer Phone 2, which is also transparent. And then I'll be preforming the drop test from relatively realistic situations, you know, like getting up from a chair, knee height, dropping it as it pulls out of your pocket from waist height. And then if it lasts long enough, we'll be doing it from a head height drop, all the way onto the concrete. Both of these phones are brand new and ready to be drop tested. So for the first drop we'll start from about knee height, because that's where if you're sitting in a chair and your phone's on your lap and it just slides off...that's where it will be. We'll start with the iPhone first, sitting at knee height. [Music playing] So far, so good. And now we'll do the Pixel 3 starting from knee height. [Music playing] Both phones so far looking pretty good. No damage done to do the iPhone XR and no damage done to the Pixel 3. A little bit of scuffing right there along the aluminum frame. Scuffing up along the top, but no cracks or anything yet. Both phones are still working perfectly fine. Drop test number 2, this time we'll be pulling it out of my pocket and simulating it just slipping out of your hands. Starting with the iPhone XR. [Music playing] And the Pixel 3. Pulling it out of my pocket. Letting it drop. [Music playing] Check this out, no damage done to the back glass yet. Still got those same scuffs along the bottom. No cracks along the screen yet. Same thing goes for the iPhone XR no damage whatsoever. A little bit of scuffing right there along the top. Let's go for drop number 3. We'll do the same pocket style drop as last time. Starting with the iPhone XR, pulling it out of my pocket. [Music playing] And then the Pixel 3. Pulling it out of my pocket. [Music playing] So far, no damage yet. Pixel 3....oh wait...just kidding. The Pixel 3 is the first one to get damaged right there along the corner the glass is shattered just a little bit. Down at the bottom...still no major damage, just a little bit...just a little bit of scuffing. No damage on the back. And no damage on the front. It will be interesting to see which phone cracks first. This time we'll do it from chest height by pulling it out of my pocket and dropping it from about, you know, 4 and feet or so. [Music playing] Drop number 4. Okay, we'll go with the Pixel. Pulling it out of my pocket at 4 and feet. [Music playing] Still no damage. I'm impressed! You would think the phones from a drop that tall...you would think there would be more damage. We're going to keep going until one of these is completely broken. Yeah, the Pixel 3 has a little bit of damage up at the top, but that's not a crack yet. Let's do one more from chest high. Chest high iPhone drop right here, straight down. [Music playing] Chest high Pixel 3 drop right here, straight down. [Music playing] Ooo, I think we might have a crack. Check that out right there. All along the bottom, but still no damage to the screen. We'll keep going until one of these screens is shattered. No damage to the camera lenses. No damage to the upper glass. One interesting thing to note, with the repair prices for both of these phones, to repair the screen on the iPhone XR is $199. To repair the back glass, it's $399. Now, to repair the back glass on the Pixel 3, it's just $100. And to repair the screen, it's $269 because it's an OLED. So the screen is more expensive on the Pixel 3, but the back is much less expensive to replace than the iPhone XR. Let's do it from head height. Alright, we've got the iPhone XR from head height. Just like if you're talking on the phone and you accidentally drop it. That was a bad one! [Music playing] And then we've got the Pixel 3, head height, talking on the phone, accidentally dropping it. [Music playing] Not too bad. Still no damage to either one. Let's keep going. We're going till a screen breaks. Iphone XR, head height. [Music playing] And then Pixel 3, head height. [Music playing] Oh boy. Pixel 3 is not having a good day. Check this out right there the camera lens is completely shattered out of the Pixel 3. That's not good news. But the iPhone XR still intact. Oh, check it out, there's a screen crack right there. All through the screen, all the way down. Would you rather have a cracked screen, or a shattered camera lens? The reason I don't do drop tests very often is because the results are totally unpredictable. You know, it really just depends on what surface your dropping on, how high it is, how the phone flips in the air. But it's still interesting to see what breaks first on which phone. With the Pixel 3, the back glass is cracked, along with the camera lens. Both relatively inexpensive repairs. But with the iPhone XR, the front screen cracked, which is the cheapest thing to fix, $199, but the back glass is still intact, which is good because the repair price on the back glass of the iPhone XR is $399 through Apple directly. Let's do one more drop for kicks and giggles from above head height, and we'll drop it from there. Alright, the screen-cracked iPhone XR from above head height. We'll do it right here. [Music playing] Oooo, oh no! The screen! And then we have above head height the Pixel 3. [Music playing] Oh man! Above head height that did not turn out well for the iPhone at all. The back glass is totally shattered all the way through, and the screen is now completely worthless. While the Pixel 3...the screen is still totally functional, which is good because it's an OLED and relatively expensive to repair. And the back glass has about the same amount of damage as before cracks running through the whole thing. And there we have it. I tried to keep it as scientific as possible. But the results of this particular drop test are a completely destroyed iPhone XR. Both the front and the back are unusable. The display is completely non functional. And we still have a functional Pixel 3 with the cracked glass and a cracked camera lens. So the main takeaway from this is that a case is always a good idea because glass is glass, and glass can break. Which phone held up the best in your opinion? Let me know down in the comments. If you have any questions, leave them down in the comments. Give this video a thumbs up if you found it enjoyable. And hit that subscribe button. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "Pixel",
        "drop",
        "drop test",
        "iPhone",
        "damage",
        "height",
        "head height",
        "glass",
        "back glass",
        "screen",
        "back",
        "head",
        "Phone",
        "test",
        "phones",
        "pocket",
        "LastPass",
        "good",
        "repair",
        "bit"
    ],
    "transcript_entity_values": [
        "Jonathon Morrison",
        "iPhone",
        "399",
        "Austin Evans'",
        "just $2",
        "199",
        "100%",
        "Danny",
        "Pixel 3",
        "XS",
        "4",
        "4 and feet",
        "Pixel 3",
        "XR",
        "Pixel 3",
        "XS",
        "Apple",
        "iJustine",
        "millions",
        "XR",
        "iPhone XR",
        "first",
        "just $100",
        "a good day",
        "LastPass",
        "Today",
        "3",
        "One",
        "269",
        "iPhone XS",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERCENT",
        "PERSON",
        "EVENT",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "LAW",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.11963605880737305,
        -0.01684265211224556,
        0.10140684247016907,
        -0.07130911946296692,
        0.02553733065724373,
        -0.09322445839643478,
        0.028106683865189552,
        0.058774590492248535,
        -0.04544015973806381,
        -0.014234109781682491,
        0.06902193278074265,
        -0.05818164348602295,
        -0.01893576607108116,
        0.04459693282842636,
        0.03880917653441429,
        -0.02422071434557438,
        0.04606573283672333,
        -0.037999264895915985,
        -0.03860832750797272,
        0.06329955905675888,
        -0.02291015535593033,
        -0.06658504158258438,
        0.004609348718076944,
        0.019226059317588806,
        0.04103294387459755,
        0.07863527536392212,
        -0.018926743417978287,
        -0.0684715136885643,
        -0.007375465705990791,
        -0.08305460959672928,
        0.025839541107416153,
        0.10013758391141891,
        -0.017266439273953438,
        0.05758938565850258,
        0.0046317786909639835,
        -0.05409964546561241,
        0.054713476449251175,
        0.020805884152650833,
        -0.03651759773492813,
        -0.016671063378453255,
        -0.02531227096915245,
        0.01494498923420906,
        0.033558838069438934,
        0.001912065432406962,
        0.017372867092490196,
        0.013973401859402657,
        0.0811113566160202,
        -0.003838784759864211,
        0.03507746756076813,
        -0.022209670394659042,
        -0.018588611856102943,
        0.03298277407884598,
        0.04471343755722046,
        0.0580805167555809,
        -0.07844263315200806,
        0.009991226717829704,
        0.026823779568076134,
        -0.021798675879836082,
        0.014949895441532135,
        0.022166550159454346,
        0.06209756061434746,
        0.02897864766418934,
        0.015384922735393047,
        0.05067190155386925,
        0.047998592257499695,
        -0.03080703131854534,
        -0.030322080478072166,
        -0.11188904941082001,
        -0.03100946918129921,
        0.08198781311511993,
        -0.027152715250849724,
        -0.030176421627402306,
        -0.07771532237529755,
        -0.007867123000323772,
        -0.017653493210673332,
        0.06901004165410995,
        0.03214628994464874,
        -0.013887139968574047,
        -0.06367522478103638,
        0.03737756609916687,
        0.032676178961992264,
        -0.012834805063903332,
        -0.03273222967982292,
        0.0566197894513607,
        0.0035177927929908037,
        0.027103183791041374,
        0.012690214440226555,
        0.08902321010828018,
        -0.05415613204240799,
        -0.06728368997573853,
        0.032227516174316406,
        0.1562231481075287,
        -0.06689335405826569,
        0.05612592399120331,
        0.07550874352455139,
        0.05250721052289009,
        -0.0027547271456569433,
        -0.08014039695262909,
        0.003971524070948362,
        0.0009784861467778683,
        0.043867163360118866,
        -0.04592170938849449,
        0.015101619996130466,
        0.006950292270630598,
        -0.013075320981442928,
        -0.06277121603488922,
        -0.07359589636325836,
        -0.026088304817676544,
        0.0027827112935483456,
        0.09540679305791855,
        -0.012379899621009827,
        -0.026268167421221733,
        -0.040033046156167984,
        0.044605471193790436,
        -0.014659066684544086,
        -0.043019793927669525,
        -0.024514172226190567,
        0.03932788595557213,
        0.09355704486370087,
        -0.009068205952644348,
        -0.019099678844213486,
        0.024865394458174706,
        -0.057377833873033524,
        -0.06464716792106628,
        0.02738400176167488,
        -0.0456664003431797,
        -0.06632857024669647,
        1.6000658289370124e-33,
        -0.020758725702762604,
        0.0817403644323349,
        -0.05712069571018219,
        -0.040175214409828186,
        -0.06017276272177696,
        0.010358995757997036,
        0.07029885053634644,
        0.09422481060028076,
        -0.018339024856686592,
        0.015953632071614265,
        -0.03349555656313896,
        -0.06324601173400879,
        -0.044685136526823044,
        -0.044460415840148926,
        0.05351170524954796,
        0.0017762880306690931,
        -0.0976140946149826,
        -0.08282691985368729,
        -0.08092102408409119,
        0.020888863131403923,
        0.02802562154829502,
        -0.09158150106668472,
        -0.06552401185035706,
        0.06573701649904251,
        -0.019481755793094635,
        -0.01504380814731121,
        0.06374775618314743,
        -0.010941408574581146,
        -0.0011903016129508615,
        -0.01199334766715765,
        -0.05494939535856247,
        -0.005018380004912615,
        0.03807024657726288,
        0.034084074199199677,
        -0.10747203230857849,
        0.0530812069773674,
        -0.0208921916782856,
        -0.025662705302238464,
        -0.05446116626262665,
        0.068696990609169,
        -0.10382524877786636,
        0.04654190316796303,
        0.04561749845743179,
        -0.025231460109353065,
        0.07581298798322678,
        0.014064673334360123,
        -0.042079512029886246,
        -0.03326553478837013,
        -0.05232025310397148,
        -0.041082289069890976,
        0.024966755881905556,
        -0.06662847846746445,
        -0.0034296554513275623,
        -0.009519008919596672,
        -0.03489591181278229,
        0.04861342906951904,
        0.001423036796040833,
        -0.0032593407668173313,
        -0.0036200450267642736,
        0.03540314733982086,
        -0.005342850461602211,
        0.0007972584571689367,
        -0.0630061998963356,
        0.06460908055305481,
        -0.02270806021988392,
        0.03599712625145912,
        0.005820795893669128,
        0.011136740446090698,
        -0.08323974162340164,
        0.08613675832748413,
        -0.03372735157608986,
        -0.028958478942513466,
        0.028940843418240547,
        -0.013077875599265099,
        0.04947327822446823,
        -0.009698753245174885,
        -0.08371584117412567,
        -0.002704768208786845,
        0.05048636719584465,
        -0.035864196717739105,
        -0.02290305495262146,
        0.01772119477391243,
        0.08923323452472687,
        0.035195596516132355,
        -0.0663137137889862,
        -0.01931595988571644,
        0.023940252140164375,
        -0.06653989851474762,
        0.03472301363945007,
        0.06639271229505539,
        -0.005998392589390278,
        -0.08987995982170105,
        -0.07266765087842941,
        -0.03488465026021004,
        0.028659189119935036,
        -3.4497030675490124e-33,
        0.0050726281479001045,
        -0.05061103403568268,
        0.07760100811719894,
        0.07594528049230576,
        0.01225977297872305,
        -0.05921070650219917,
        0.033122364431619644,
        0.08880850672721863,
        0.056298889219760895,
        -0.055544234812259674,
        -0.010029461234807968,
        0.0708174929022789,
        -0.020064594224095345,
        0.04908917099237442,
        -0.04550693556666374,
        -0.04955495148897171,
        -0.02748750150203705,
        -0.13822919130325317,
        -0.0024770183954387903,
        0.03284648433327675,
        0.10116935521364212,
        0.06120866909623146,
        -0.01385923009365797,
        0.032142527401447296,
        -0.07372375577688217,
        -0.00898845586925745,
        0.035155054181814194,
        -0.0560150071978569,
        0.017658840864896774,
        -0.041664864867925644,
        -0.015399694442749023,
        -0.0491521954536438,
        0.03433170169591904,
        0.027115078642964363,
        0.0846228376030922,
        -0.004877319093793631,
        0.016909806057810783,
        -0.03501234948635101,
        0.03950861841440201,
        -0.036258514970541,
        -0.001049959217198193,
        0.08511748164892197,
        0.020589949563145638,
        0.0008444691193290055,
        0.054433178156614304,
        0.014426292851567268,
        0.041358571499586105,
        0.048053327947854996,
        0.05264604091644287,
        0.13435626029968262,
        0.0035552321933209896,
        0.01338251307606697,
        -0.030609313398599625,
        0.060173798352479935,
        -0.0062773339450359344,
        -0.03716300427913666,
        0.008910628966987133,
        -0.08291272819042206,
        -0.033518146723508835,
        0.04114376753568649,
        0.018866585567593575,
        0.04995514079928398,
        -0.01589106395840645,
        -0.01851293444633484,
        -0.058463096618652344,
        -0.0677846148610115,
        0.016162898391485214,
        0.048265524208545685,
        0.0023558277171105146,
        0.06461449712514877,
        -0.02256437949836254,
        -0.049454934895038605,
        0.008807490579783916,
        -0.06230047717690468,
        0.0750642716884613,
        0.02944965846836567,
        -0.1228385791182518,
        0.00896739773452282,
        -0.0015612381976097822,
        -0.04798730090260506,
        0.028700564056634903,
        0.02092890441417694,
        0.014402417466044426,
        0.03728339076042175,
        0.0973379984498024,
        0.07186242938041687,
        0.006039637140929699,
        0.04986600950360298,
        -0.04055928811430931,
        -0.009071366861462593,
        -0.030307618901133537,
        -0.0063470350578427315,
        0.0036624211352318525,
        -0.0023875951301306486,
        -0.03962893411517143,
        -4.486149762783498e-08,
        0.06894877552986145,
        0.018779641017317772,
        -0.03634518012404442,
        -0.054977741092443466,
        -0.025362471118569374,
        0.004636549390852451,
        0.004462691489607096,
        -0.008135688491165638,
        0.12951508164405823,
        -0.02869601920247078,
        -0.015020089223980904,
        -0.09187779575586319,
        -0.10576847195625305,
        0.0893155112862587,
        -0.021966619417071342,
        0.014100408181548119,
        0.012408477254211903,
        0.02176923304796219,
        0.006473254412412643,
        -0.07572026550769806,
        -0.09221085906028748,
        0.03071955218911171,
        0.06456945836544037,
        -0.07348637282848358,
        -0.01540360040962696,
        0.09630399197340012,
        -0.0725189819931984,
        -0.04356362670660019,
        0.035337720066308975,
        0.02893061935901642,
        -0.03287887945771217,
        -0.005115327425301075,
        0.047098658978939056,
        0.01797265000641346,
        -0.00732197891920805,
        -0.022432921454310417,
        -0.05940276384353638,
        -0.03623040020465851,
        0.12421779334545135,
        -0.01062056701630354,
        0.04312492534518242,
        -0.04137064889073372,
        -0.021904725581407547,
        -0.022547731176018715,
        0.016860011965036392,
        -0.09065458923578262,
        0.005936642177402973,
        -0.12327940762042999,
        -0.044234368950128555,
        -0.007577517535537481,
        -0.07213014364242554,
        -0.05099733918905258,
        -0.04985302314162254,
        0.005859194789081812,
        0.08665458858013153,
        0.030330458655953407,
        0.015594844706356525,
        -0.0003876627597492188,
        -0.01358054205775261,
        0.012851336970925331,
        0.03682393208146095,
        -0.1355936974287033,
        0.009667910635471344,
        0.11860156804323196
    ]
}