{
    "id": "Q43srkV1d6k",
    "title": "WEIRDEST Touch of Modern Tech",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-01-04T19:07:36Z",
    "video_url": "https://www.youtube.com/watch?v=Q43srkV1d6k",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 166760,
    "likes": 5238,
    "comments_count": 190,
    "description": "Who is even buying this?! I Got Scammed by Circuit City (in 2022):  WORST Tech Fails:  Steam needs to CHILL:  I Have to Come Clean:  I Got SCAMMED At Five Below...AGAIN:   Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:24 BLOC Bottle Opener ( C U B E ) 1:05 Crypto Throw Pillows 1:55 Designer Toilet Paper 2:43 Cutlery Set (Curvy Knife) 3:23 Chinese Bathtub Whisky 4:31 Minecraft Couch 5:36 NFT Picture Frame 6:04 Aviator Egg Pod 6:54 Berlin Sky Cart 7:16 Golden Shoe Horn 7:42 Sensuality M A N Sculpture 8:45 T-Rex Tooth 9:15 GLITCH Picture 9:54 Jolly Jug 10:16 The Horse is Here 10:52 Scotch Whisky (Helmet) 11:42 Lumpy Coffee Table 12:45 What do you think?",
    "description_links": [
        "https://youtu.be/-AuSICToosU",
        "https://youtu.be/pFlFn3IWQ7w",
        "https://youtu.be/WgrKtO_L9Os",
        "https://youtu.be/iw-6-SfTZ-Y",
        "https://youtu.be/nCONf7g52dM",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello and welcome to \"This is,\" was Uncrate not alpha maley enough for you? Well, we got some more for you. We got even more modern alpha male paradise junk with Touch of Modern. - [Austin] If you frequent youtube.com, you probably have seen a couple ads for Touch of Modern. - Touch. (bell rings) - You're not supposed to touch the modern. (bell rings) First item is- (Matt laughs) - The Bloc Bottle Opener is an eye-catching desktop monolith that just so happens to also open bottles. - How much is this? $5, $10? - Well, no, because it's made of brass. - $17? - Brass, the most expensive of all the metals. - That's not true, not, that's not true. - This costs a whopping $144, which is offensive that they didn't just call- - Like- - 145. - Like rupees? - No, like American freedom dollars. - So what we're looking at here is a brass cube with a cutout on the bottom for $144 and it is a Touch of Modern and a touch of you a stupid (Minecraft Steve groans) if you buy this thing. - I'm worried that this is gonna be the thing that pisses us off the least. (Austin laughs) - No! No! - Crypto throw pillows. - So these are from Epic Graffiti. - Boy- - And- - Epic is the word. - What's really useful about these is it's a nice useful medium to scream into the void when crypto inevitably crashes again and your 20 Bitcoin is worth about six bucks again. - Don't talk about my Bitcoin. (Matt laughs) - Do you want me to get you these? Because this is a perfect way to signal to everyone that comes and visits you- - Yeah. - That you have terrible financial decisions in life. - I'm gonna stuff my- - It is so ugly. - The only thing you need to do is just stuff your cold wallets inside this, no one will ever think to find your Bitcoin when they're inside your pillow. - Mm. - Well, the good thing is these are not only a clear and tasteful reminder to your guests that you are a crypto bro of the highest caliber, but they're a mere $100, or roughly one-tenth of an Ethereum. (air whooshes) - Renova Tissue! - Wait, Renova. - Have you ever wished that your toilet paper was a different color other than white, yellow, or brown? Well, now you can get that with- - Wait, wait, say it one more time. What color is your toilet paper? - White, yellow, and brown. It comes in a stylish Shrek green/black combo. - This toilet paper comes out to $4 a roll, which is roughly the amount of money that you are wasting every day by not avidly purchasing everything on A Touch of Modern. You realize that if you don't buy this, you're losing money, Matt? Otherwise, people will realize that you're a scam, you're a fraud, you're using white toilet paper? Pfft, hah! - If I'm paying $4 a roll, this thing better be four-ply and unclog my toilet when I try and flush a four-ply toilet paper. (Austin laughs) (air whooshes) Next we have the Arte Cutlery 5 Piece Set. - Would you like a weird curvy knife to cut your steak as you eat the rich? This is a five-piece set. - Yep. - That has a regular fork, a big fork which is too big for regular people to use, a weird curvy knife, a giant spoon, which is just silly, and a regular human-sized spoon which is, again, the only sized spoon you should use. You are just- - We all just wanna- - Overcompensating. - Be the little spoon, okay? Little spoon is better than big spoon in every scenario. The thing that we're really glossing over here is this set is $116.07. I wanna remind people this is just for one five-piece set. - Five- - This equals out to be $23 per fork. - Wow! - Okay, here we go. 5 Year Single Malt Chinese Whiskey. \"The flavor profile is anything but young thanks to the fluctuating climate in South-Central China where each barrel was aged.\" (Matt cackling) Hold on, are you just trying to say that you didn't, like, put this in an air-conditioned room? So, like, sometimes the barrel's, like, really hot, sometimes it's really cold and that gives a different flavor? - \"We distilled this in the finest of bathtubs and bottled it for your pleasure.\" (Austin cackling) - [Austin] I will say I do like the fact that this bottle does look like it's a potion. It's only $135. - It's 135 gold, so- - I'm outta rupees. (Matt laughs) - It's also small, it's only 25 ounces. - Oh, it's a normal size, isn't it? - Nope. - 750 milliliters for a- - A Coke, a bottle of Coke is 20 ounces. - Are you drinking a bottle of whiskey like you drink a bottle of Coke? - Yeah, look at me - Matt is what it looks like when you hit max level in the game. (laughs) - Self-esteem, whew. - No, you're max level, you're like a snorlax, Matt. - Oh, the fat Pokemon that can only be woken from the sound of a poke flute? (Austin imitates a poke flute hooting) Sometimes we make good videos, today is not that day. The Zipline Convertible Sleeper Sofa. Do you ever wish your couch and/or bed was made from Minecraft wool blocks? Did you just lose at Fortnite? Well, you can go right into Sicko Mode and cover up the room in couch blocks. For a mere $1,300 you too can stack these just up vertically. What if we put our Minecraft beds together? - They can't see us craft though. - What if we kissed- - So- - On the Minecraft bed? - \"Honey, go sleep on the couch bed.\" - I'm taking my half- - I'm taking my half the bed. (Austin laughs) Did you guys ever have to, like, sleep with somebody and you're like, you gotta build like the pillow wall or something, this is, like, built in so you can just, \"You stay on your side of the Minecraft bed, I stay on this my side,\" and everything's fine. - I have a story. - Oh no. We're gonna censor the rest of the story. - No, is, like- - Instead you can listen to the wonderful Sounds of Sea Shanty 2 as Matt unleashes something which should not be shared on the internet. (playful music) (sped-up chatter screeching) And out of the sensor break. Well, that was a wonderful story. Subscribe to This Is After Dark for the full uncensored version of Matt's questionable antics. (air whooshes) We might all be riding that crypto wave into the crashed grounds in which our hopes and dreams have been shattered with the Block Frame NFT GM1. - I... (Austin inhales loudly) All this stuff is so dumb. - Well, you know what though, Matt? It is a bargain, it is only $599. - I know there's someone watching like, \"Oh yeah, I have the Block Frame NFT, why? Because it's a great way-\" - No. - \"For me to display my,\" no. - I will tell you, Matt, zero people who are watching this video have this, zero people. - I hope, I hope. (air whooshes) - The Aviator Egg Pod. - Mm! - Now hold on a second. - Mm! - Hold on a second, timeout. - Mm. - This is actually cool, I'm down. Look, it's a chair, but, goodbye, Matt. Here's the deal. The Egg Pod is for the most sophisticated people of all time who want to show off your opulence, your wealth, and have a talking point that is not an upside-down pineapple. The polished aviation-grade aluminum has riveted seams to simulate the look of a vintage aircraft. And Matt, it spins. (metal creaks) (aluminum clanking) Probably better than that. - Last time I saw one of these things was at one of these events and... (chuckles) - Oh. - Yeah, now you get it. - Oh. - For the low price of 3499.99, you too could pretend that you work out of a Google office. - The Skycart. Do you ever wish you had the cart that's on the airplane that hits you in the elbow when you're sitting in the aisle seat? - Yeah. - What's the deal with airline food? (drum bangs) (Austin cackles) For a mere $1,300 you can own your own airline food and beverage trolley. What I wanna try and do is have this be my carry-on. (Matt laughing) Go to the airport with this as my carry-on. All right, next up we have (puffs) The Golden Horse Shoehorn. An actual quote from the website is, \"After all, putting on your shoes by hand is just so,\" mm, mm, mm, mm, mm, \"pedestrian.\" - It's 134.99 - A shoehorn is like 99 cents for a good one. - 'Cause it's plastic. That's so pedestrian, Matt. - Just like damn horses. - Are you a pleb? Are you one of the commoners who have to use their two feet to get from place to place? Hah. (air whooshes) Woo! We may have to censor this one. This is the banned episode of \"This is\" because this is the Sensuality Man Sculpture. What could be more sensual than nude rock climbing? Matt! - I got a secret for you, guys. Austin has this very statue of me in his living room. I'm not rock climbing- - You're not supposed to tell them that, Matt! - I'm not rock climbing. - That was our little secret. - But- - I needed you to pose for that for like six hours while I sculpted it. Matt, why you gonna blow me up like this? - What pisses me off is I didn't get $300 for posing for this- (Austin cackles) Which is what you're selling it for? - Well, we'd like to thank you very much for staying along for the journey with us. This is officially canceled after this video but hopefully you enjoyed the most sensual man of all. Matthew H. M. Ansini. - [Matt] Look at the scale of this thing. - Oh, you're right. - Yeah. - It's tiny. - It's not like it's a life size, like, sculpture of man and the human form. What's he looking back there for? What's he looking- - He's looking down, he's climbed up. - He's looking down at all the clothed rock climbers. (Austin laughs) You know when they call it free climbing? They're not talking about no harness. (Austin claps and chuckles) Next up we have the African- - What? - T-Rex Tooth. - Wait. - I'm gonna let you go ahead- - Okay. - And try and pronounce this. - This is from the Carcharodontosaurus or the African T-Rex. Now, it was originally $10,000. - Oh. - However, they had no takers so they had to lower the price to only $5,000 because they stole it from a Hobby Lobby. (laughs) - All I know is this African T-Rex tooth needs to go to a dentist. - Yeah, it looks a little plaque there. - Yeah, yeah, a little, little. - Little wear- - Yeah. - On the front too. Yeah, it's not looking good. - Wait. - \"MM\" by Glitch. Are you telling me that what I do in Photoshop every day for our thumbnails, they're charging $120 for? Look. Ready? I'm gonna do this right now. We're gonna snap our fingers and we're gonna make one of these. (Matt snaps fingers) Look at that. - Whoa. Can I buy you for 199.99? - [Matt] Oh honey, I'm way more expensive than that. - \"Glitch is an artist that is inspired by the greats,\" by stealing from their images. \"Many of his works distort ever famous and popular imagery.\" So you know, like Banksy, who clearly has a copy of Photoshop, I like to be mysterious too by mosaicing photos that I stole on Google images. The Jolly little jug. Have you ever wanted your jug to be jolly, Matt? - This looks like the Kool-Aid man's unfortunate cousin. - Oh, now I cannot unsee it as like- - Yeah. - Related to Kool-Aid Man. - Yeah, but, like, too related to Kool-Aid Man. - Yeah. He's still jolly though, he is jolly. He is jolly. - He's making the best of the situation- - Yeah. - That life- - We all do, really. I mean, for 39.99 I too would make the best of the situation. - Oh, I- - Oh, no, no. - Okay. - Well, instead we've got \"A Love of Horses.\" No, not that kind of love of horses. - Are you a horse girl? - No, I'm not. - Because there's no such thing as a horse guy, that's just a cowboy, apparently. - (laughs) Well, one of these is way cooler than the other. - It's almost like there's sexism involved here. - Yeah, Matt. (Matt puffs) - That was a neigh. (both laughing) (TV beeps) - Any animal that's bigger than me, I'm not okay with. - Anything that's that big and has giant feet- - Whales? Come on. - Powers. - Bears? Mm-mm. Horses? Absolutely not. If I can't pick it up or be taller than it, it does not need to exist. Now hold on a second, Matt. - Okay. - This is The Immortal Clan Blended Scotch Whisky. - The main and central element is a Clan Blow, Blazing? - I don't know. - Clan Blazing, which is stylized with two swords on the shielded background. - The main element is the huge knight helmet that they put on- - Yeah. - What I'm sure is subpar whiskey to make it look cool so that it will be on top shelf that you'll never drink, but it looks cool and you can get- - $170 of this $190 whiskey is this bust of an ancient knight. What do you think tastes better? Knights of the Round Table whiskey or bathtub Chinese whiskey? - I'm gonna go with the bathtub whiskey, I'm not gonna lie. - Yeah, I agree. - This, to me, if it's this gimmicky, you know that it's not good. - No. - If it was good, it would stand on its own, instead they put a stupid knight's helmet on it so you'll pay attention to it and pay extra money, but this is probably gonna be be very bad. - Is your coffee table not loopy and lumpy enough? Well, I've got the coffee table for you. - The Calder Coffee Table. Calder sounds like the name of the burn you get when you're not paying attention, you get your hot coffee all over your hand. - In case you're worried about your coffee table moving, it's okay, it does remain still according to the listing. - I get that high art exists, I get that fashion and that architectural norms need to be broken, but this thing costs $6,930 for a coffee table which just looks like it's a 3D print gone wrong. - That is more than we paid for our company 1994 Ford Focus car. (car honks) One thing I do like about this coffee table is the dual layer. I would appreciate a coffee table that had multiple layers to it, but why does it have to look like if Venom was trying to, like, bond with a coffee table? - Wait, do you eat dinner on your coffee table? - I do. - I do too, 'cause- - Like, yeah. - I'm immediately thinking, like, this actually is kind of useful 'cause I gotta be like- - Well, so I have- - Set higher. - One of those ones that, like, it raises up, I stole it from you. - Oh, yeah, yeah, yeah, yeah, yeah. Would you know what you could spend your $6,930 on? Treating yourself to a lifetime subscription to \"This Is.\" Available for a limited time only by ring-a-linging that ding-a-ling bell and Venmo me the $6,930, and you'll be able to hit the Subscribe button. Make sure to subscribe now or you'll be forever stuck using a regular coffee table and watching non-banned videos. (calm music) - Like, subscribe, follow, and let us know what other ridiculous things we missed in here because we know there's a lot. So, yeah. - But don't forget. (calm music)",
    "transcript_keywords": [
        "Yeah",
        "Matt",
        "coffee table",
        "Touch of Modern",
        "Touch",
        "Table",
        "coffee",
        "modern",
        "thing",
        "Uncrate not alpha",
        "toilet paper",
        "Whiskey",
        "Man",
        "Uncrate",
        "modern alpha male",
        "Wait",
        "toilet",
        "spoon",
        "people",
        "modern alpha"
    ],
    "transcript_entity_values": [
        "zero",
        "American",
        "two feet",
        "Sicko Mode",
        "a mere $1,300",
        "Glitch",
        "African",
        "10,000",
        "Coke",
        "Knights of the Round Table",
        "Minecraft Steve",
        "mm",
        "300",
        "4",
        "20",
        "20 ounces",
        "One",
        "Ethereum",
        "199.99",
        "190",
        "The Immortal Clan Blended Scotch Whisky",
        "Uncrate",
        "GM1",
        "120",
        "1994",
        "17",
        "Matthew H. M. Ansini",
        "The Egg Pod",
        "Google",
        "750 milliliters",
        "Matt",
        "Skycart",
        "Photoshop",
        "A Love of Horses",
        "Renova",
        "Austin",
        "The Calder Coffee Table",
        "135",
        "Carcharodontosaurus",
        "Shrek",
        "Clan Blow",
        "about six bucks",
        "134.99",
        "Minecraft",
        "only 25 ounces",
        "Chinese",
        "a Hobby Lobby",
        "Minecraft",
        "Subscribe",
        "roughly one-tenth",
        "5",
        "116.07",
        "Kool-Aid Man",
        "Fortnite",
        "39.99",
        "Banksy",
        "like six hours",
        "Minecraft",
        "second",
        "five",
        "South-Central China",
        "Bitcoin",
        "3499.99",
        "Epic Graffiti",
        "Calder",
        "First",
        "Venmo",
        "Ford",
        "one",
        "four",
        "Single Malt Chinese Whiskey",
        "a mere $100",
        "today",
        "145",
        "Pfft",
        "144",
        "only $5,000",
        "half",
        "only $135",
        "two",
        "This Is After Dark for the",
        "only $599",
        "A Touch of Modern",
        "Pokemon",
        "10",
        "23",
        "99 cents",
        "Venom",
        "170",
        "6,930"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "NORP",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "MONEY",
        "PERSON",
        "FAC",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "NORP",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "NORP",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "MONEY"
    ],
    "vector": [
        -0.08017946034669876,
        0.018428118899464607,
        0.08039838820695877,
        -0.036617521196603775,
        0.027069326490163803,
        -0.049407441169023514,
        0.10871736705303192,
        0.015792183578014374,
        -0.03203374147415161,
        -0.019056010991334915,
        0.01992715336382389,
        0.008833056315779686,
        0.08226115256547928,
        -0.005466565489768982,
        -0.07113400101661682,
        -0.038841553032398224,
        0.019199958071112633,
        -0.08704544603824615,
        -0.028560999780893326,
        -0.008858773857355118,
        -0.06558874249458313,
        -0.03956039994955063,
        -0.005993952509015799,
        0.02932106703519821,
        0.021723786368966103,
        0.07728853076696396,
        -0.08089080452919006,
        -0.018245166167616844,
        -0.11145082861185074,
        -0.050030823796987534,
        -0.09144587069749832,
        0.12659446895122528,
        -0.04215193912386894,
        -0.022956345230340958,
        -0.009243845008313656,
        -0.03793805465102196,
        0.05194408819079399,
        0.035476457327604294,
        0.050595711916685104,
        -0.0489150770008564,
        -0.04998583719134331,
        -0.10914511233568192,
        -0.028209419921040535,
        0.10752832144498825,
        0.02640637755393982,
        0.035683270543813705,
        -0.026225516572594643,
        -0.061093490570783615,
        -0.011240093968808651,
        -0.034869514405727386,
        -0.04704465717077255,
        -0.07796763628721237,
        0.12600748240947723,
        -0.02042948268353939,
        -0.01933119259774685,
        -0.041722118854522705,
        -0.0234322901815176,
        0.009182747453451157,
        0.05163004994392395,
        0.0029161255806684494,
        0.01925835572183132,
        0.005238336510956287,
        -0.003779756370931864,
        0.04335073009133339,
        0.04325878620147705,
        -0.0205941591411829,
        -0.099528469145298,
        0.039966970682144165,
        -0.0361463725566864,
        -0.013275773264467716,
        0.07970616221427917,
        -0.0636889860033989,
        0.06423189491033554,
        0.03380633518099785,
        0.025831013917922974,
        -0.019949769601225853,
        0.004736760631203651,
        -0.05624048411846161,
        -0.04372256249189377,
        0.037529971450567245,
        -0.012337813153862953,
        -0.04489707574248314,
        0.018917027860879898,
        -0.022406592965126038,
        -0.043385181576013565,
        0.0258958637714386,
        0.0021445422898977995,
        -0.02746701054275036,
        -0.011733969673514366,
        -0.040891144424676895,
        -0.05397888645529747,
        0.0032534368801862,
        0.05634508654475212,
        -0.06388775259256363,
        0.10740485042333603,
        -0.03699088469147682,
        0.020756272599101067,
        0.03283407539129257,
        -0.001391153666190803,
        0.07276427000761032,
        0.004994559101760387,
        0.09365899860858917,
        -0.0008909876924008131,
        -0.07404006272554398,
        0.07610730826854706,
        -0.0327468104660511,
        -0.09266917407512665,
        0.03453012555837631,
        0.05397600680589676,
        -0.010897199623286724,
        -0.04386267438530922,
        0.006501297000795603,
        -0.0819355845451355,
        -0.017266368493437767,
        -0.02414155751466751,
        -0.004361317027360201,
        -0.11423695087432861,
        0.04596702754497528,
        0.012628944590687752,
        -0.014125649817287922,
        0.010051950812339783,
        0.09050067514181137,
        -0.05936103314161301,
        -0.03624642640352249,
        -0.03285465016961098,
        0.016631653532385826,
        -0.013640896417200565,
        3.428878083098242e-33,
        -0.09534180909395218,
        0.08159375935792923,
        -0.054224252700805664,
        0.005761404987424612,
        0.05694383382797241,
        -0.028142202645540237,
        0.005955599248409271,
        0.06982430070638657,
        -0.03575574606657028,
        0.07612693309783936,
        0.019892752170562744,
        0.0730818510055542,
        -0.06383425742387772,
        0.02913939580321312,
        0.04868914932012558,
        -0.03080933168530464,
        0.0032442850060760975,
        -0.04741927236318588,
        -0.0076070139184594154,
        -0.09030397236347198,
        0.014806902036070824,
        0.0391254760324955,
        0.047671932727098465,
        -0.010291190817952156,
        -0.06797745823860168,
        -0.0151919424533844,
        -0.019615478813648224,
        0.04063965752720833,
        0.13711324334144592,
        0.042461514472961426,
        -0.029056118801236153,
        0.0389484241604805,
        0.06836008280515671,
        -0.02503719925880432,
        -0.06861543655395508,
        0.0031193748582154512,
        -0.004362346604466438,
        -0.15747833251953125,
        0.012470090761780739,
        -0.01815607212483883,
        -0.03481093421578407,
        0.025605568662285805,
        -0.033670250326395035,
        0.006961172912269831,
        -0.06814193725585938,
        0.13104864954948425,
        -0.006821714341640472,
        -0.03132585063576698,
        -0.029854949563741684,
        0.02239670418202877,
        -0.09209761768579483,
        0.04582367464900017,
        0.05255340412259102,
        0.08785431832075119,
        -0.024144738912582397,
        -0.0889938697218895,
        0.028073975816369057,
        -0.07092298567295074,
        -0.014665438793599606,
        0.00644295709207654,
        -0.004441464319825172,
        0.03909682482481003,
        0.02702290751039982,
        -0.05092797055840492,
        -0.034265872091054916,
        0.03996674716472626,
        0.07393878698348999,
        0.051720816642045975,
        -0.04338877648115158,
        0.08082302659749985,
        -0.0484234020113945,
        0.02698367089033127,
        -0.05933937057852745,
        -0.025422686710953712,
        0.05833778530359268,
        0.0056009856052696705,
        0.004598780069500208,
        0.010938264429569244,
        -0.022942490875720978,
        -0.05723469331860542,
        -0.03354940935969353,
        0.004378225654363632,
        0.02374896965920925,
        0.03068816103041172,
        0.008604595437645912,
        0.008336296305060387,
        0.02474808879196644,
        -0.019589250907301903,
        -0.02721969597041607,
        0.05790887773036957,
        -0.053645189851522446,
        -0.03993234783411026,
        -0.0019810667727142572,
        0.031104566529393196,
        -0.04137042909860611,
        -5.432892076448771e-33,
        0.0008637040737085044,
        -0.04644488915801048,
        -0.01729278452694416,
        0.08992122113704681,
        0.025405507534742355,
        -0.07648196071386337,
        -0.023694830015301704,
        -0.023994706571102142,
        0.013566096313297749,
        0.05850858986377716,
        0.04225054755806923,
        0.035159409046173096,
        0.0288366861641407,
        -0.00019031301781069487,
        0.05008965730667114,
        -0.04089486971497536,
        0.039978619664907455,
        0.04119043052196503,
        -0.0036813579499721527,
        0.030948268249630928,
        0.08357267081737518,
        0.0454774871468544,
        -0.0783497542142868,
        0.017405839636921883,
        -0.0668410062789917,
        0.10894878208637238,
        -0.04183946177363396,
        -0.05639638751745224,
        0.012829924002289772,
        0.010908907279372215,
        -0.018117142841219902,
        -0.006518134381622076,
        0.06938537210226059,
        0.036417923867702484,
        0.03408122435212135,
        0.023470237851142883,
        0.04225827008485794,
        -0.013216949999332428,
        -0.0026847808621823788,
        -0.11040913313627243,
        0.04843751713633537,
        -0.034693747758865356,
        -0.03155042231082916,
        0.07715283334255219,
        -0.031078312546014786,
        -0.06370268762111664,
        -0.10807041823863983,
        -0.02193520963191986,
        0.04247519001364708,
        0.053232233971357346,
        0.06311974674463272,
        0.05343973636627197,
        0.025505883619189262,
        -0.06897882372140884,
        -0.0939972922205925,
        0.034455012530088425,
        -0.07215417176485062,
        -0.03662419319152832,
        0.0071337404660880566,
        0.0789695531129837,
        0.059618689119815826,
        0.07617878913879395,
        -0.021823396906256676,
        0.041305650025606155,
        -0.004710924345999956,
        -0.05385998636484146,
        0.06057771295309067,
        0.04371969401836395,
        -0.027556059882044792,
        -0.07335018366575241,
        0.021526910364627838,
        0.03329934924840927,
        -0.04376405477523804,
        -0.04443059861660004,
        0.011856208555400372,
        1.1513543540786486e-05,
        0.009916379116475582,
        -0.043828029185533524,
        0.041059527546167374,
        -0.00010410790127934888,
        0.06553202122449875,
        0.03108617663383484,
        0.06931840628385544,
        0.057315852493047714,
        0.08970066905021667,
        0.017223067581653595,
        -0.019109372049570084,
        0.022800276055932045,
        -0.02010095864534378,
        0.013010968454182148,
        0.04360340163111687,
        -0.011241558939218521,
        -0.03350887447595596,
        0.09788805991411209,
        0.04861689731478691,
        -7.160829795793688e-08,
        0.020948197692632675,
        0.003929720725864172,
        0.039397284388542175,
        0.0380118228495121,
        0.08175491541624069,
        -0.05978216230869293,
        -0.02647439017891884,
        0.04396427050232887,
        -0.06920704245567322,
        0.006986159365624189,
        -0.040169958025217056,
        -0.02614966221153736,
        -0.10407813638448715,
        0.0067367772571742535,
        -0.0071720764972269535,
        0.02050839737057686,
        -0.07242707908153534,
        0.008278687484562397,
        -0.05125550180673599,
        -0.02983958087861538,
        0.03489263355731964,
        0.021960485726594925,
        0.10716985911130905,
        -0.07965028285980225,
        -0.09542682766914368,
        -0.02376384846866131,
        -0.045914243906736374,
        0.018409788608551025,
        0.04983245208859444,
        0.012689601629972458,
        -0.04014795646071434,
        -0.05222170799970627,
        -0.016985204070806503,
        -0.0034934240393340588,
        -0.012899698689579964,
        -0.037491120398044586,
        -0.0859462097287178,
        -0.031094642356038094,
        0.007666879799216986,
        -0.014092540368437767,
        -0.053555067628622055,
        -0.14734698832035065,
        -0.06488673388957977,
        0.04345656558871269,
        -0.038749054074287415,
        -0.06117086112499237,
        -0.06203358620405197,
        -0.06083737686276436,
        0.01902083493769169,
        0.029334351420402527,
        -0.0026002496015280485,
        -0.0064387996681034565,
        0.08837218582630157,
        0.02343369461596012,
        -0.002617527497932315,
        0.01749109849333763,
        0.017731938511133194,
        0.009623585268855095,
        -0.01223025843501091,
        -0.011101383715867996,
        0.07476991415023804,
        -0.14478760957717896,
        0.013403917662799358,
        0.05761461332440376
    ]
}