{
    "id": "Q7DP4BouzT4",
    "title": "Everyone else already reviewed this.... - Atari VCS Console",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-06-10T19:57:19Z",
    "video_url": "https://www.youtube.com/watch?v=Q7DP4BouzT4",
    "category": "Science & Technology",
    "tags": [
        "Atari",
        "Retro",
        "VCS Console",
        "New",
        "Gaming",
        "Emulation",
        "PC",
        "controllers",
        "Xbox",
        "AMD",
        "Processor",
        "grammarly"
    ],
    "views": 657308,
    "likes": 32072,
    "comments_count": 1937,
    "description": "Save time on your work and emails with Grammarly! Sign up for a free account and get 20% off Grammarly Premium:   The ATARI VCS Console allows you to not just play all the old-school games, but it's actually a PC with an AMD processor?? Also, we wish we could get our hands on this last year.  Check out the ATARI VCS Console at   Buy ASUS ROG PG259QN 360hz Gaming Monitor On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  Timestamps:  0:00 - It's RETRO TIME! Kinda... 0:40 - What's in the box? 4:36 - Unboxing 4:52 - Controllers 8:08 - Console  9:56 - Setting it up 10:34 - Grammarly! 11:17 - Gaming and exploring the menus 14:33 - Conclusion  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://grammarly.com/shortcircuit",
        "https://lmg.gg/vpldD",
        "https://geni.us/i5eK8",
        "https://geni.us/DBjexh",
        "https://geni.us/mI3h12T",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It's retro time!? Maybe, sort of. I've been waiting for this for a long time. Like this unassuming looking package, you can probably actually tell what it is by the tape on the top. It's from a small company you might've heard of called Atari. They had a console called the VCS which is currently called the Atari 2600 and that is, I'm led to believe, what this is modeled after. So I don't have a whole lot of nostalgia for Atari personally 'cause I didn't really grow up with it but I am really interested in seeing what this is because it's more than just a game console. So let's get this open. Oh, here we go. I might be able to finagle this side. - [Jono] I taped over the top. - Yeah, yeah, you didn't tape over the bottom did you, Jono? - [Jono] Well, you're not supposed to open things from the bottom. - Well I'm opening it from the bottom. It's what you get. - [Jono] You mean like the back door? - Backdoor, best way to get in. We're in through the back door and it is actually the bottom, I guess they didn't expect me to open it from this end. So let's get this out of here. Oh, look at that. So what size shirt did they send us? XL. - [Andy] I'm XL. Thank you! - let's show them the shirt First. (laughing) Atari VCS. Quite a nice little logo there. It kind of reminds me of the Atari boot screen with the like multicolored rainbow effect that they had going on there and it actually says on the back here that it was backed in 2008. So I was a year off, it was 2000, - [Jono] 2018. - It was backed in 2018. I was 10 years off. (laughing) Since Andy is XL and I am, well, unfortunately not quite XL. Here you go. - [Andy] Thank you, Atari! - I don't know if we can keep that or not. Moving on. We have other things that we might be able to keep like this, this here sticker. They're actually pretty high quality stickers. So that's the ancillary stuff. Let's get this out of the outer wrapping and take a look at the box. Ooh, sexy. Actually that is quite fetching. I actually really do like the like subtle dark walnut that they got here, that's what they call it here, black walnut. Video computer system, gaming plus PC streaming. Okay. 800, I don't know what that means. Does it mean that it has Atari 800 support? Can I play 800 games? - [Jono] Could you? - Could I? - [Jono] Should you? - Should I? - [Jono] Should you!? - I mean the Atari 800 was actually not a bad machine if I remember correctly, it's like the 5200 except it's a computer. One thing that might be throwing a couple of you off if you haven't been keeping up, is this gaming plus PC plus streaming bit. As it turns out, this is actually straight up an AMD Ryzen based machine. It's actually a Ryzen embedded processor and the graphics are Vega 3 I think. So it's not super powerful but it's more than enough to play. - [Jono] Can I scalp it? - These kinds of games. Can you scalp it? I don't know. I mean, it'll probably be scalped a little bit but I'm not sure how big the market is for it. So we'll have to see. - [Jono] But memories. - Memories, can you put a price on memory? I mean, I lose mine all the time. So yeah, it's got the new and retro games and apps built in, a 100 plus Atari classics. Okay. Discover Atari classics with a modern controller. Yep. Okay, featuring LED effects in rumble. I dunno what the LED effects are all about but we'll find out and customize, unique PC mode, upgradable ram and storage. Every console should have this. I mean, maybe not actually but you know, this is good. This is basically a console on a PC. You remember the Subor Z+ that we looked at on LTT a little while ago? That was basically the same kind of idea, is to have like a special game OS filled with games and then like a straight up PC OS like Windows or Linux or in this case, it also supports Chrome OS. Yeah, this could be a very useful little machine for somebody who wants to, you know, play games and have a small little computer to occupy a very little space in their home. Let's get it out of the box. Two chambers, this feels like it might be the main unit. Oh yeah, almost certainly. Let's work our way up in terms of size here. That is adorable. I like the matte. The mirror kind of works alongside it but I know that this is gonna pick up fingerprints. This button here is the connect slash pairing button, I'm sure, these two seem to be menu and back and oh yeah, here's another button on the front here. So you've got two buttons like that and then you've got your directions. Never been a fan of this particular layout for controls, but it is classic. So they've got that going for them. It feels, it feels pretty solid actually. It's not like creaky or anything like that and two nice rubber strips on the bottom so you can plant it down and really get going. There's no suction cups and there's no place to put suction cups though. So if you're into that, then you're out of luck unfortunately. Nice lengthy micro USB cable. I'm more interested in this box though. Okay, yeah. So there's a little quick start in here. That button is in fact for pairing and for power but these two buttons here, you can toggle between VCS and Xbox mode. That basically means that you can toggle between like their proprietary like controller mode, to being able to be used in the PC mode, so in Windows 10 or whatever. And here's their, not an Xbox controller. (laughing) - Hmm. Okay. So Atari is much lighter than Microsoft. There's no knurling on the back or anything. It's just soft plastic. It's actually pretty solid again, it's not creaky or anything. This D-pad is at very least passable. This D-pad is not good. If you don't like how the Sega Genesis controller feels with it's like disc shaped D-pad, this is a million times worse because there's no like actual D-tense. Yeah, Like I don't feel like I'm pressing anything in particular after this first press. So if i were to do like a Dragon Punch in Street Fighter that might or might not fire, I have no idea because there's no feedback. I'm just like rubbing my finger across the D-pad. So that's a thing, but I guess we'll have to see how it feels in game. Triggers feel okay but they're a little spongy. Yeah, these are a little bit spongy on the way down too I guess. It's soft, let's put it that way. They're not bad though and then there's these bumpers, which I mean, they're just bumpers. Presumably this has a built-in battery and yes it does. It's at 75% charged right now if the three dots are to be believed. That's Atari's controller. It's basically this but it's different. I would say for the worse, but I mean, they tried. Yeah, just another micro B cable, and finally the main event, the Atari VCS itself. There it is. These nice little tabs to pull it out. That's cute. It's got an external power supply. What are these different types of bags here? This one is resealable. This one is just open and this one is sealed. - [Andy] It gives you three types of unboxing experiences. - Yeah, you get three times the unboxing experience. Anyway, this guy here is just the other end to this power adapter and we've got an HDMI cable. Anything else in here? Snack for later. All right. So all of this stuff is boring. This is the real meat of the experience here. Stop, thank you for your Atari VCS purchase. If you have questions or problems with your purchase please do not return it to the retail store. Great. We didn't get it from a retail store. So I don't know where we return it if we had any problems with it. So thank you. We're stuck with it. (laughing) This is mine now. I'll just make it so that the taking up space in the warehouse and then at some point they'll beg me to take them. That is real wood. I'm touching real wood right now. - [Jono] How much does this thing cost? - 399. It's more than most mini consoles but when you consider it's like a Ryzen computer that's upgradable, like it's not too bad. You got your two USB ports upfront, these are 3.0 type A. Around the back we've got two USB ports. HDMI, ethernet, Gigabit, AC power and power, power. Okay, so should we get set up then? I mean, I could like do this kind of thing. Verify the account, Jono. - [Jono] I did! - [Presenter] Hi, Short. - [Jono] Hi, Linus. (laughing) - How to install Companion APP, yep. Okay, so I have the VCS Companion APP here. I may actually have to connect it to the same WiFi network but it's taking a minute to find the VCS. Okay, you know what? I think I don't care enough about that feature. - [Jono] I wanna play some games. - Yeah, let's play some games. Thanks Grammarly for sponsoring today's video and hopefully you don't hate that we forgot to segue this. Grammarly is a digital writing assistant that helps you with grammar and spelling suggestions. Simply install the browser extension, log in and start typing. There's also Grammarly Premium which provides more feedback on your writing. For the job hunters out there, we recommend checking out the vocabulary and clarity suggestion tools. They help you save time and make your writing more compelling by finding synonyms for overused words and completely removing unnecessary words. Now it's much easier to make a great first impression on every application or introductory email. Go to grammarly.com/shortcircuit to sign up for a free account and get 20% off Grammarly Premium and get Premium today to help you save time and work more efficiently. Well, let's go to the VCS Vault, see what happens. Ooh. Okay, so Asteroids, I guess these are the arcade versions? Okay, so you can choose 2600 games or Atari arcade games. Let's go with Asteroids. Up is thrust, directions are directions. The A button is shoot. B is that teleport thing that almost always kills you. It's got some pretty hefty rumble actually, like it's hefty. So that's Asteroids. It's neat how the box is in 3D and the cabinet is in 3D, ah, the back of the box isn't modeled, come on. I'm gonna switch to the other controller for the authentic 2600 experience. To be clear, I've never actually played a real 2600. So I'm gonna suck at this. Sprint Master. Oh cool. Oh, that's neat. It's got the owner's manual. There was an NES emulator for Dreamcast called NesterDC SE that let you do this as well. This is super sweet. I love it. Oh, okay, you can turn on scan lines. Oh, you can do realistic vector display, bright, bold, standard, okay, cool. So they're actually giving you a lot of options here. Audio, yeah. Flicker authentic, yeah, you can, I think what that means is either they're actually filtering it or they're removing the Sprite Limit which I mean, I guess technically this didn't, the 2600 hardware was weird. Right, These are all the settings that you would set with jumpers, like switches on the original 2600, it's kind of hilarious. Oh, this isn't what I thought it was gonna be. Oh yeah, I crashed immediately and I crashed again. I am not good at this game. I'm not good with this controller. Yeah, he lapped me like twice. And oftentimes this is what happened when you play a 2600 game, the game just runs and you do a game and then it kicks you back out. There's the back of the box. So I guess they have the back of the box for some games but not all of them. Yars' Revenge, that's a classic. I've never played it but this is far more minimal to the joystick than Sprint Race or whatever it was called was. Like I've seen this game played before but I've never played it myself. Let's try something with like dial support here. Oh yeah and I immediately missed. Oh hey, this even has rumble in it. Okay, This rotary encoder is really good, I love it. There is the slight issue of there being a little bit of stiction when you turn it, making finer adjustments is a little bit difficult but making flicks is super satisfying. What else is there to say? This is a pretty neat little console. Oh, we don't, we didn't try the operating system PC mode but they didn't have a PC mode. So I don't know what we can do with that. Yeah, like obviously there's more to this. Let us know if you wanna see a full in-depth review in LTT, like, I mean there's the PC mode, there's the upgradability, there's so many different things that can be done with this. I mean, I know there have been reviews of it already but maybe we can find some other angle to kind of really push it or do something weird with it. I don't know. All I know is that it's a really neat little mini PC for 400 bucks you're getting a 100 games for free. Well, a 100 games built in. Now they're not the most complex games, they're certainly not the games that I have the most nostalgia for but they are still like classic games and some that I wasn't even expecting to see there, like the Swordquest games which you should actually read up on. Those are ridiculously interesting. So yeah, like, let us know if you want to see more about this, otherwise for now, thanks for watching. Make sure you get subscribed to see more ShortCircuits in the future. - Oh my, don't do this!",
    "transcript_keywords": [
        "Atari",
        "Yeah",
        "Atari VCS",
        "games",
        "VCS",
        "game",
        "back",
        "Atari classics",
        "Atari VCS purchase",
        "mode",
        "box",
        "Atari arcade games",
        "controller",
        "kind",
        "play",
        "guess",
        "power",
        "Dpad",
        "button",
        "feels"
    ],
    "transcript_entity_values": [
        "AMD Ryzen",
        "Atari 800",
        "Sega Genesis",
        "2600",
        "NES",
        "Dreamcast",
        "Grammarly Premium",
        "Atari",
        "Atari",
        "Linux",
        "One",
        "three",
        "20%",
        "USB",
        "399",
        "Nice",
        "the Sprite Limit",
        "2018",
        "100",
        "the VCS Vault",
        "Andy",
        "Windows",
        "Atari VCS",
        "LTT",
        "a million",
        "Grammarly",
        "AC",
        "a Dragon Punch",
        "Microsoft",
        "Chrome",
        "Jono",
        "the Subor Z+",
        "75%",
        "Ryzen",
        "XL",
        "first",
        "3.0",
        "HDMI",
        "two",
        "Asteroids",
        "ShortCircuits",
        "VCS",
        "Gigabit",
        "Two",
        "the Atari 2600",
        "Sprint Race",
        "Linus",
        "Swordquest",
        "Xbox",
        "First",
        "2008",
        "10 years",
        "Windows 10",
        "Vega",
        "today",
        "the Atari VCS",
        "2000",
        "400 bucks"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "FAC",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERCENT",
        "NORP",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "LAW",
        "PERSON",
        "DATE",
        "PRODUCT",
        "DATE",
        "MONEY"
    ],
    "vector": [
        -0.021768657490611076,
        -0.017468607053160667,
        0.03059801273047924,
        -0.11538281291723251,
        0.10582682490348816,
        0.07705488801002502,
        0.0018431906355544925,
        0.010995440185070038,
        0.01437336951494217,
        0.08024323731660843,
        0.008623438887298107,
        0.026376836001873016,
        -0.018658388406038284,
        -0.022154878824949265,
        0.028986221179366112,
        0.002808819990605116,
        0.06656128168106079,
        -0.04750258848071098,
        -0.021247319877147675,
        -0.028337597846984863,
        0.016723426058888435,
        -0.05113845318555832,
        -0.026325760409235954,
        -0.013278714381158352,
        -0.01909545622766018,
        0.001537052565254271,
        -0.02063235640525818,
        -0.00748031260445714,
        -0.0031611467711627483,
        -0.03649606928229332,
        -0.057247355580329895,
        -0.01922403648495674,
        0.07898890972137451,
        0.00283991452306509,
        -0.04274779558181763,
        -0.06674802303314209,
        0.08375494927167892,
        -0.11251935362815857,
        -0.10394128412008286,
        -0.08770051598548889,
        -0.05169610306620598,
        0.030581921339035034,
        -0.014197422191500664,
        0.0597786009311676,
        -0.007766562979668379,
        -0.03173856437206268,
        0.03925785422325134,
        -0.10881173610687256,
        -0.04585197940468788,
        0.047795627266168594,
        0.02855013869702816,
        -0.03358137235045433,
        0.10448313504457474,
        -0.055147238075733185,
        -0.05704347416758537,
        0.15114888548851013,
        -0.04150962084531784,
        -0.009579128585755825,
        0.012636770494282246,
        -0.003948518540710211,
        -0.035660918802022934,
        -0.05387634038925171,
        -0.0294138565659523,
        0.031551264226436615,
        -0.018820811063051224,
        -0.0015856625977903605,
        0.06905008852481842,
        0.05944083258509636,
        -0.018549229949712753,
        -0.07831360399723053,
        -0.05997493863105774,
        0.0073919519782066345,
        0.03729287162423134,
        0.07192152738571167,
        -0.02282978594303131,
        -0.011697753332555294,
        0.07189781218767166,
        -0.03128825128078461,
        0.10348700731992722,
        -0.04720507934689522,
        0.008280467242002487,
        -0.0526856891810894,
        -0.0628315657377243,
        -0.03919855132699013,
        -0.016920331865549088,
        0.03323398530483246,
        -0.011456805281341076,
        0.05690837278962135,
        0.08596854656934738,
        -0.09645450115203857,
        -0.05746661499142647,
        -0.017967306077480316,
        0.11980166286230087,
        -0.007733828853815794,
        0.06350918859243393,
        -0.015082103200256824,
        0.08080055564641953,
        -0.03192661330103874,
        -0.02999277226626873,
        0.05516133829951286,
        -0.0018807542510330677,
        0.05693822354078293,
        0.07372792065143585,
        -0.016500525176525116,
        -0.03163846954703331,
        -0.0059967925772070885,
        -0.03768486529588699,
        0.12465235590934753,
        -0.025989821180701256,
        -0.005558698903769255,
        -0.10377846658229828,
        0.007804120425134897,
        -0.001168144284747541,
        0.02240900695323944,
        0.055859580636024475,
        0.011658127419650555,
        -0.08550595492124557,
        0.021121712401509285,
        0.06883437186479568,
        0.007700870279222727,
        0.03620614483952522,
        0.003993130289018154,
        -0.013006987050175667,
        0.03947405889630318,
        0.023706112056970596,
        0.02690259926021099,
        0.011165604926645756,
        8.080039600285313e-33,
        0.014466301538050175,
        0.0839005708694458,
        -0.02681736834347248,
        -0.025685179978609085,
        0.03669878840446472,
        0.06352248042821884,
        0.03231631964445114,
        0.09317991137504578,
        -0.02741951122879982,
        0.02709507755935192,
        -0.019724298268556595,
        -0.008574496023356915,
        -0.1121494397521019,
        0.0725475326180458,
        0.09587526321411133,
        -0.02727719582617283,
        -0.022780857980251312,
        0.016761166974902153,
        0.04915523901581764,
        -0.011551566421985626,
        -0.03747745603322983,
        0.023062938824295998,
        0.018868757411837578,
        -0.07558254897594452,
        0.013590576127171516,
        -0.0502750389277935,
        -0.0843464732170105,
        0.0196125078946352,
        0.07430712133646011,
        -0.0014902191469445825,
        -0.04544795677065849,
        -0.009680438786745071,
        -0.0682506412267685,
        -0.024890393018722534,
        0.07294682413339615,
        -0.0020851637236773968,
        -0.04334360361099243,
        -0.093113973736763,
        -0.049883823841810226,
        0.08095139265060425,
        0.0046314215287566185,
        0.015231725759804249,
        -0.09090898931026459,
        -0.08807417005300522,
        -0.01543458178639412,
        -0.006751846056431532,
        0.03414363041520119,
        -0.024152157828211784,
        0.002204087795689702,
        0.055840250104665756,
        -0.1008560061454773,
        0.07813335210084915,
        -0.057052575051784515,
        -0.10430261492729187,
        -0.0036618919111788273,
        -0.06393423676490784,
        0.031038474291563034,
        0.010892932303249836,
        0.02993057481944561,
        0.06174251064658165,
        0.049716170877218246,
        -0.0353674590587616,
        0.03854333236813545,
        -0.04771126061677933,
        -0.11005821079015732,
        0.0625079944729805,
        0.027812298387289047,
        -0.013115258887410164,
        -0.002279220847412944,
        0.07130466401576996,
        -0.018961023539304733,
        -0.018699167296290398,
        0.033504243940114975,
        -0.000445867539383471,
        0.029372258111834526,
        0.05864182859659195,
        -0.06655719131231308,
        -0.045847248286008835,
        0.0002247858210466802,
        -0.037283360958099365,
        -0.0003230936417821795,
        -0.005305823870003223,
        -0.04069199785590172,
        0.07601577788591385,
        0.08391766250133514,
        0.0031887914519757032,
        0.05880085751414299,
        -0.006361993029713631,
        0.01401858776807785,
        -0.04135982692241669,
        -0.07537558674812317,
        -0.06962040066719055,
        0.029779484495520592,
        0.048321835696697235,
        0.01091551873832941,
        -9.018834204574117e-33,
        -0.07963716983795166,
        -0.05140591785311699,
        -0.08431509882211685,
        0.022686460986733437,
        -0.007263824809342623,
        -0.02628929913043976,
        0.004795797169208527,
        0.023305268958210945,
        0.06580664217472076,
        -0.07644610106945038,
        -0.006663850508630276,
        0.048283450305461884,
        -0.021296784281730652,
        0.004372428171336651,
        0.006510189268738031,
        -0.01906392350792885,
        0.04233322665095329,
        -0.07404783368110657,
        0.035448282957077026,
        -0.05594007298350334,
        0.09109313786029816,
        0.017140641808509827,
        -0.02861263044178486,
        0.014125397428870201,
        0.07174036651849747,
        -0.009127951227128506,
        0.043302275240421295,
        0.01751578599214554,
        0.006421155296266079,
        0.05734703689813614,
        0.034595686942338943,
        0.009023618884384632,
        0.06237964332103729,
        0.027649158611893654,
        0.02572448179125786,
        0.007029948756098747,
        0.1238701194524765,
        0.027800850570201874,
        -0.07166464626789093,
        -0.04595312476158142,
        0.04784494265913963,
        -0.012449881993234158,
        -0.061061643064022064,
        0.046965885907411575,
        -0.01430581510066986,
        0.04627618566155434,
        -0.055063433945178986,
        -0.09447012841701508,
        0.02251424267888069,
        0.020487722009420395,
        -0.022323181852698326,
        -0.15507833659648895,
        0.08205973356962204,
        -0.07271039485931396,
        -0.07517896592617035,
        -0.060984525829553604,
        -0.06759002804756165,
        0.05246360972523689,
        0.04569625109434128,
        -0.011095157824456692,
        0.004937110468745232,
        0.029220955446362495,
        -0.08094989508390427,
        -0.0718071460723877,
        0.03907996416091919,
        -0.04115673154592514,
        0.05979765206575394,
        0.028737807646393776,
        -0.05671250820159912,
        -0.08733106404542923,
        -0.021670563146471977,
        -0.04610146954655647,
        -0.03902243822813034,
        -0.0504673570394516,
        -0.05008130520582199,
        -0.02883809618651867,
        0.014359797351062298,
        -0.026465335860848427,
        -0.02072964794933796,
        -0.029258670285344124,
        -0.07387036830186844,
        0.0020807983819395304,
        0.0904385969042778,
        0.0058576930314302444,
        -0.03472613915801048,
        -0.027601905167102814,
        0.0297086238861084,
        0.04707169905304909,
        0.02488653175532818,
        -0.06182904914021492,
        -0.008588992059230804,
        0.049827419221401215,
        -0.05434967949986458,
        0.1272631287574768,
        -0.004716923460364342,
        -6.78518148333751e-08,
        0.06434515118598938,
        -0.003412926336750388,
        0.00623345049098134,
        0.03394351154565811,
        0.04796280339360237,
        -0.019971122965216637,
        0.02249538153409958,
        -0.006441271863877773,
        0.057908542454242706,
        0.003125332063063979,
        -0.005325828213244677,
        -0.030348973348736763,
        -0.04948670417070389,
        -0.00046904681948944926,
        0.07438914477825165,
        0.07262223958969116,
        -0.08227215707302094,
        0.026707159355282784,
        -0.06349682062864304,
        -0.018659917637705803,
        0.001733377343043685,
        0.050777189433574677,
        0.06058858707547188,
        -0.0701562762260437,
        -0.031026354059576988,
        -0.029979053884744644,
        -0.014815413393080235,
        0.043771062046289444,
        0.073836550116539,
        0.02346617728471756,
        -0.0011659091105684638,
        0.004258857108652592,
        0.022198155522346497,
        -0.07974055409431458,
        0.03135273978114128,
        -0.05464211478829384,
        0.028372567147016525,
        0.044362373650074005,
        0.07842136174440384,
        0.015852829441428185,
        0.0001918102498166263,
        -0.1179284080862999,
        -0.05053166672587395,
        0.01908716931939125,
        0.06039123237133026,
        0.0007124676485545933,
        -0.09950653463602066,
        -0.06329306215047836,
        -0.019850414246320724,
        -0.026309074833989143,
        0.047845259308815,
        0.0156455859541893,
        0.011532780714333057,
        0.047919534146785736,
        0.05510123819112778,
        -0.05748951435089111,
        -0.011719892732799053,
        -0.01885519176721573,
        0.03846260905265808,
        0.015871766954660416,
        0.0648818090558052,
        -0.025598734617233276,
        0.008316785097122192,
        0.020476868376135826
    ]
}