{
    "id": "Q7pKwLJ7o2U",
    "title": "Why Does the iPod touch Still Exist?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-06-26T17:28:18Z",
    "video_url": "https://www.youtube.com/watch?v=Q7pKwLJ7o2U",
    "category": "Science & Technology",
    "tags": [
        "ipod",
        "ipod touch",
        "ipod touch 7",
        "ipod touch 2019",
        "ipod touch 7th generation",
        "apple",
        "new ipod touch",
        "ipod touch 7th gen",
        "2019 ipod touch",
        "ipod 2019",
        "iphone",
        "ipod touch vs iphone",
        "iphone 6s",
        "ios",
        "new ipod",
        "apple ipod touch",
        "why does this exist",
        "this is",
        "austin evans"
    ],
    "views": 575564,
    "likes": 16584,
    "comments_count": 1841,
    "description": "After six years with minor spec bumps, is the iPod touch still relevant in 2019? The 2019 iPod touch 7th Generation on Amazon:  Latest This Is episode: where do banks keep your money?   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/ipodtouch7g",
        "https://www.youtube.com/watch?v=gqIaghWK6Ec",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. Why does the iPod Touch still exist in 2019? This is an especially relevant question today, because this is the first time that this iPod has seen an update in over three years. And this design has been around for a full six years at this point. So, why? Hey guys, this is Austin. And today we're gonna be talking about the iPod Touch 2nd Generation. So the iPod Touch and I go way back. I actually started my channel with an iPod Touch 2nd Generation, and pretty much every single one that's come out, I have covered. So it only feels natural to be able to take a look at this 7th Generation. Because, as much as things have changed over the last decade, the iPod Touch really hasn't. Which is really bizarre, right, because I mean, you look at the iPhone, you look at the iPad, I mean all these things have come so, so far. And yet Apple just keeps making the iPod, just keeps coming out every three to five years. So for $200 you can get this, the iPod Touch 7th Generation, but what you can also get for $200 is an iPhone 6s. And this is not an unlocked one, mind you, it is through a prepaid carrier. My question here, is for the same price, shouldn't you just get an iPhone? So it has been a long time since I have unboxed an iPod Touch. And from the looks of it, it has not changed one bit. I totally forgot just how tiny this thing is. Yo, these are the original 3.5 millimeter EarPods. Damn, I guess actually this does still have the headphone jack, one of the only devices that Apple sells that still has the headphone jack. Well, actually, also including the iPhone 6s. So something to keep in mind is that the iPhone 6s is nearly four years old at this point. Now it is still supported on iOS 12, and soon to be iOS 13. But it is the minimum spec that you do need to run iOS 13. That being said though, I immediately am such a much bigger fan of this larger design. Now the iPod feels, I mean it's nice that it's thin and lightweight and everything, but it just, the screen is so tiny. I mean, I know some people are big fan of the SE and stuff, but a 4.7 inch screen really, to me, feels like the minimum that I would want to use on a regular basis. Part of the reason I wanted to do this video is that I know a lot of people who still use the 6s, and it works completely fine. I mean it shoots 4K video, it's got LTE, but importantly, it does have the physical home button as well as the headphone jack, two features which I know, some people are a big fan of. I mean I don't really care about the home button too much but the headphone jack is nice. The iPod Touch doesn't come with a power adapter. It just comes with a USB cable. Wait, has it always been like that? (dinging) When it comes to using an iPhone as an iPod Touch, generally speaking, it is really straight forward. So with this guy, all I had to do was jump on WiFi, log into my Apple ID, and I am up and running. And of course your mileage will vary based on which phone you get, but generally speaking, this is the way it works, unless you actually want to get it up on a carrier. So there it is usually locked to whichever specific carrier that you purchased it from. So, you can't just buy a cheap one off the shelf, and then throw your current SIM card in, usually, but if you just want to use it as an iPod Touch, and of course that's the comparison I'm doing today, then this should be pretty close to Apples to Apples, and on top of that, they're both the exact same price. So what is actually new with the 7th Generation iPod Touch? Not exactly a lot. So it does have an Apple A10 processor, which is a pretty substantial upgrade over the Apple A8 of the last iPod Touch, but there's a little bit more to it than that. First of all, that A8, as well as the iPhone 6 that it's based on, is no longer being supported in iOS 13. So to continue selling the iPod Touch, Apple kind of had to upgrade the spec, and they did, to like the minimum degree possible. Now you may have seen news articles saying that the iPod Touch has been updated with the iPhone 7 processor, but if you look into it, there's actually a little bit more to it than that. So first of all, this is actually not the full Apple A10 chip, instead, it has not only been brought down to two cores, but also is only running at a mere 1.6 gigahertz, a pretty substantial underclock from the roughly 2.2 gigahertz of the standard A10. What this means is that if you put this side by side with the older Apple A9 and the iPhone 6s, it performs almost identically. And this is not a huge surprise. Traditionally iPods do have their CPUs underclocked because it's such a thin design, it has such a tiny like 1,000mAh battery, but it does mean that even though on paper this is a much more powerful processor, in reality, it's almost the exact same spec as far as the CPU side as the iPhone 6s. There are some new storage tiers. So the base model comes with 32 gigs of storage for $200, 128 for $300, or 256 gigabytes for $400. But let me just pause for a second, $400 for an iPod Touch? Okay, all right, good luck with that. Now a lot of people probably buy these iPods to play games, and here, the iPod touch is a pretty decent jump up. So take a look at Fortnite, we're actually able to play on medium settings at full resolution. Partly because it does have a low res screen. But this is a pretty big jump over the very low settings and the low resolution on the iPhone 6s. I mean, there's also the fact that this is the very first iPod Touch which supports Fortnite. So, you know, that's a thing, I guess. And you know this might not be the full Apple A10, I will give Apple props. This is a lot of power for a $200 handheld. I mean, this is not wildly far off of the kind of performance you can get out of a Switch, except obviously on a cheaper and much, much smaller form factor. So, it's easy to get caught up on all the speeds and feeds, but, this is a powerful device for $200. The problem though, is that the 6s isn't that much less powerful and it is packing some additional features. Like cameras that don't suck. The front-facing camera on the iPod Touch is straight garbage town. With a full 1.2 megapixels, and 720p video, yeah, this thing just doesn't look great, and the photos are certainly not much better. The rear-facing camera is a little bit better. So it's 8 megapixels that supports 1080p video, and it does look decent, but the main problem is that it gets pretty shaky, and there's no continuous auto-focus. You have to constantly tap on the screen to make sure that things are sharp. Not a huge issue, and I will say that you know, it's decent, but it certainly does not compare to that iPhone 6s. The 6s has a 12 megapixel sensor, which is a lot better than the much older tech in the iPod Touch. Now it does shoot 4K video with actually real stabilization, as well as continuous auto-focus, and the stills are a huge jump up. I mean seriously, this is where you can see the biggest difference, and especially if you're using this for taking lots of photos, or going out and about. I mean, this is really the one that you want to go for. But, if you're not so much caring about the camera, it's just for like FaceTime and that kind of stuff, the iPod Touch is going to be totally fine. It's just that I really feel like the camera, as well as the larger screen, is the main selling point for the 6s. It makes a big difference. So why does the iPod Touch exist in 2019? Well put simply, if Apple didn't update it, then it would've been obsolete when iOS 13 comes out in a few months. Now I get that it is a small update, but really, there are just better options. I mean that iPhone 6s, which was brand new from a prepaid carrier, is again, that same $200. And even if that's not available in your country, you should be able to get used iPhones for around that same price, which will just deliver a better experience. Bigger batteries, bigger screens, Touch ID, and of course the ability to use them as an actual phone. As far as I'm concerned, as much as I love the iPod Touch, it kinda feels like its time has passed.",
    "transcript_keywords": [
        "iPod Touch",
        "Touch",
        "iPod",
        "Generation iPod Touch",
        "Apple",
        "iPhone",
        "iPod Touch exist",
        "Generation",
        "Generation iPod",
        "pretty",
        "full Apple",
        "lot",
        "Apples",
        "screen",
        "iOS",
        "full",
        "video",
        "Austin",
        "Touch exist",
        "iPods"
    ],
    "transcript_entity_values": [
        "Generation iPod",
        "iOS 12",
        "4.7 inch",
        "1,000mAh",
        "12 megapixel",
        "iPhone",
        "nearly four years old",
        "Apple A10",
        "A10",
        "2019",
        "7th",
        "a few months",
        "3.5 millimeter",
        "iPad",
        "roughly 2.2 gigahertz",
        "first",
        "a mere 1.6 gigahertz",
        "jack",
        "USB",
        "over three years",
        "Austin",
        "Apples",
        "the Apple A8",
        "400",
        "1.2 megapixels",
        "two",
        "300",
        "a full six years",
        "Apple",
        "iOS 13",
        "Switch",
        "iPhone 6s",
        "Touch ID",
        "4",
        "Apple A9",
        "iPhones",
        "one",
        "second",
        "SE",
        "iPods",
        "32",
        "128",
        "200",
        "8 megapixels",
        "the last decade",
        "Fortnite",
        "256 gigabytes",
        "CPU",
        "1080p",
        "iPod",
        "iOS 13",
        "Yo",
        "iOS 13",
        "FaceTime",
        "A8",
        "today",
        "LTE",
        "First",
        "6s",
        "the iPod Touch"
    ],
    "transcript_entity_types": [
        "PERSON",
        "LAW",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "LAW",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "EVENT",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.014484789222478867,
        -0.06922417134046555,
        0.12160179018974304,
        -0.0005337926559150219,
        0.05936970189213753,
        -0.00698448671028018,
        0.005688422825187445,
        0.02579258196055889,
        0.016453931108117104,
        0.018667269498109818,
        0.04984661564230919,
        0.08200469613075256,
        0.038074951618909836,
        -0.027424991130828857,
        0.06492339819669724,
        -0.020826241001486778,
        0.009053366258740425,
        -0.1256096363067627,
        -0.014770420268177986,
        0.004443829879164696,
        -0.019855445250868797,
        -0.0038752532564103603,
        0.02721807174384594,
        -0.05115855485200882,
        -0.04232488200068474,
        0.04624887928366661,
        -0.01944682188332081,
        -0.0338987298309803,
        -0.07514441758394241,
        -0.049548372626304626,
        -0.025881629437208176,
        0.1968494951725006,
        0.04003399610519409,
        -0.05980914831161499,
        0.0011398710776120424,
        -0.09512197971343994,
        0.01694469526410103,
        0.01601468399167061,
        -0.030156217515468597,
        -0.05210268497467041,
        -0.06132720410823822,
        -0.053270842880010605,
        0.0219099223613739,
        0.026601742953062057,
        -0.07491325587034225,
        -0.02997085638344288,
        0.06812763959169388,
        -0.029668061062693596,
        0.03493453934788704,
        -0.0034050215035676956,
        0.0210623387247324,
        -0.05295296385884285,
        0.15006670355796814,
        -0.041926637291908264,
        0.04202837496995926,
        0.012984361499547958,
        -0.019206952303647995,
        0.07374745607376099,
        0.052523043006658554,
        0.025419047102332115,
        0.06843964755535126,
        -0.06212999299168587,
        -0.023847157135605812,
        -0.04939104616641998,
        0.0669284537434578,
        -0.054664578288793564,
        0.051990948617458344,
        0.016040846705436707,
        0.014131112955510616,
        -0.017819145694375038,
        0.012073022313416004,
        -0.0306524820625782,
        0.004937547724694014,
        0.025279974564909935,
        0.05239766091108322,
        0.044607486575841904,
        0.07540369033813477,
        0.008907664567232132,
        -0.0269794799387455,
        -0.002743341261520982,
        0.01857973262667656,
        -0.04654865711927414,
        0.01718645542860031,
        -0.08318470418453217,
        -0.06122524291276932,
        0.00423771608620882,
        0.01089176069945097,
        -0.03424577787518501,
        -0.07395824044942856,
        -0.0319521464407444,
        -0.0020941123366355896,
        0.10669859498739243,
        -0.03699469193816185,
        -0.08349808305501938,
        0.050133783370256424,
        -0.006883531343191862,
        -0.07051032036542892,
        0.0053613875061273575,
        0.014199869707226753,
        0.023422107100486755,
        0.06630799174308777,
        0.07787010818719864,
        0.044368643313646317,
        -0.022353703156113625,
        0.059012144804000854,
        -0.12342871725559235,
        -0.03725182265043259,
        0.02197369933128357,
        -0.061750628054142,
        0.0818352922797203,
        0.02213439717888832,
        -0.023954926058650017,
        -0.031606800854206085,
        0.058638881891965866,
        -0.01351962424814701,
        -0.04006798565387726,
        -0.010334164835512638,
        0.08261781930923462,
        0.08339823782444,
        0.05769116058945656,
        0.06633111089468002,
        0.03839891776442528,
        -0.04825393483042717,
        0.006361156236380339,
        -0.03497583419084549,
        0.029315399006009102,
        -0.050973255187273026,
        1.663598910876057e-33,
        -0.07275222986936569,
        0.044513802975416183,
        -0.039468467235565186,
        -0.048845697194337845,
        -0.07485164701938629,
        -0.07265212386846542,
        0.014494593255221844,
        0.07025151699781418,
        -0.021053824573755264,
        -0.01146453246474266,
        0.017132185399532318,
        0.005955107510089874,
        -0.03457925468683243,
        0.012828836217522621,
        0.08713413774967194,
        -0.045162707567214966,
        -0.12724463641643524,
        -0.042641088366508484,
        0.00540487514808774,
        0.011497043073177338,
        -0.003693685168400407,
        0.018921691924333572,
        0.013352436013519764,
        0.011675168760120869,
        -0.048487432301044464,
        0.020713044330477715,
        0.03948692977428436,
        -0.0014262686017900705,
        0.0570884570479393,
        -0.0124741792678833,
        -0.034642528742551804,
        0.0034614969044923782,
        0.0719231590628624,
        -0.10302378237247467,
        -0.05230025202035904,
        -0.008178827352821827,
        0.06120249629020691,
        -0.08632111549377441,
        0.011324407532811165,
        -0.06761711835861206,
        -0.03471469506621361,
        0.004539432004094124,
        -0.04414010047912598,
        0.09088217467069626,
        0.028530193492770195,
        0.02117850072681904,
        0.0632316917181015,
        -0.03160477429628372,
        -0.05514993891119957,
        -0.011770816519856453,
        -0.022330673411488533,
        -0.0372689850628376,
        -0.03561678156256676,
        -0.040215350687503815,
        -0.010264359414577484,
        -0.04411414638161659,
        -0.026188993826508522,
        -0.035135164856910706,
        0.06151421740651131,
        0.027077410370111465,
        0.05058353766798973,
        0.005376584827899933,
        -0.023006297647953033,
        0.008164803497493267,
        -0.06211395561695099,
        0.15246352553367615,
        0.07290532439947128,
        0.061375368386507034,
        -0.05881867930293083,
        0.09511549770832062,
        0.0010223985882475972,
        -0.036114536225795746,
        -0.05305182933807373,
        -0.028935160487890244,
        0.029851030558347702,
        0.012760544195771217,
        -0.006064994260668755,
        -0.05597423389554024,
        0.017254319041967392,
        -0.03224480152130127,
        -0.003299720585346222,
        0.05217850208282471,
        -0.006756582763046026,
        0.07103437185287476,
        0.04934876784682274,
        -0.08126965165138245,
        0.027983030304312706,
        -0.004977396689355373,
        -0.005676940083503723,
        -0.00496645737439394,
        0.005352479871362448,
        0.0011361922370269895,
        -0.0464274026453495,
        0.03222592920064926,
        0.03629321604967117,
        -3.7571029218127025e-33,
        0.016832880675792694,
        0.002696274546906352,
        -0.023092471063137054,
        -0.00895830150693655,
        -0.030721062794327736,
        -0.07547184079885483,
        -0.02515278197824955,
        0.060567278414964676,
        -0.05538764223456383,
        -0.06574110686779022,
        0.00213156221434474,
        -0.013682922348380089,
        -0.022931035608053207,
        0.017170237377285957,
        -0.04799387603998184,
        0.03284759819507599,
        -0.008664894849061966,
        -0.0666559711098671,
        -0.026846282184123993,
        -0.0077871414832770824,
        0.05593254417181015,
        0.05099687725305557,
        -0.028683016076683998,
        0.03728797659277916,
        -0.08935738354921341,
        -0.03686582297086716,
        -0.02685406804084778,
        0.01359799038618803,
        -0.01314073707908392,
        -0.012417957186698914,
        -0.050967566668987274,
        -0.13071118295192719,
        0.04887145757675171,
        0.029314830899238586,
        0.033960167318582535,
        0.004185992758721113,
        -0.01681477762758732,
        -0.05677815526723862,
        -0.019453449174761772,
        -0.01613622158765793,
        -0.009993414394557476,
        0.022076282650232315,
        0.018947478383779526,
        -0.0035288180224597454,
        0.030039386823773384,
        0.008648816496133804,
        -0.014359808526933193,
        0.1220802292227745,
        0.04083232581615448,
        -0.058907151222229004,
        0.04141780734062195,
        0.029542870819568634,
        -0.0005494632641784847,
        -0.08143466711044312,
        -0.0939788818359375,
        -0.0038383263163268566,
        0.04604105278849602,
        0.026173483580350876,
        0.007502824999392033,
        0.07254564762115479,
        0.046768199652433395,
        -0.06188865751028061,
        0.060474496334791183,
        -0.06366182118654251,
        -0.03224645555019379,
        -0.0004861172055825591,
        0.09439944475889206,
        0.01995430327951908,
        -0.0638217106461525,
        0.043078161776065826,
        0.012515602633357048,
        -0.012002169154584408,
        -0.05084952712059021,
        -0.07679271697998047,
        -0.02582455985248089,
        0.09314118325710297,
        0.006730308756232262,
        -0.000660618010442704,
        -0.013736488297581673,
        -0.022709479555487633,
        -0.043748222291469574,
        0.11894900351762772,
        -0.010990943759679794,
        0.020639261230826378,
        0.12878911197185516,
        0.08191149681806564,
        -0.013424113392829895,
        0.0044687348417937756,
        -0.03881129249930382,
        0.035455118864774704,
        -0.042253278195858,
        -0.07239650189876556,
        -0.12369946390390396,
        0.08053116500377655,
        -0.0638393983244896,
        -5.0008047480787354e-08,
        0.07111458480358124,
        -0.00866120308637619,
        0.04272616282105446,
        -0.04677253216505051,
        0.13346140086650848,
        0.03850097581744194,
        0.011179577559232712,
        0.0579642578959465,
        0.05004528537392616,
        0.0160222165286541,
        -0.017387060448527336,
        -0.054764892905950546,
        -0.07978568226099014,
        0.06422436982393265,
        0.07050611078739166,
        0.09789076447486877,
        -0.05632583796977997,
        0.016525736078619957,
        -0.04939699545502663,
        -0.03142990916967392,
        -0.045591920614242554,
        0.0033279042690992355,
        0.03650232031941414,
        0.0057404059916734695,
        0.03387898951768875,
        0.027805328369140625,
        -0.046547092497348785,
        0.0018645032541826367,
        0.0070389374159276485,
        -0.054903965443372726,
        0.023033512756228447,
        -0.05627359449863434,
        -0.07398991286754608,
        -0.012464789673686028,
        -0.04591808840632439,
        -0.04699944332242012,
        -0.051569946110248566,
        0.01730707660317421,
        -0.0039001265540719032,
        -0.024003297090530396,
        0.007040832191705704,
        -0.09124836325645447,
        -0.0563473142683506,
        0.05085044726729393,
        0.012520881369709969,
        -0.05641373246908188,
        -0.0236422847956419,
        0.006099701393395662,
        -0.035160936415195465,
        0.09645948559045792,
        -0.06993922591209412,
        -0.07904118299484253,
        0.003514793934300542,
        0.05202207341790199,
        0.06182730570435524,
        -0.034612808376550674,
        -0.03810599446296692,
        0.021627670153975487,
        -0.023415781557559967,
        0.0276741161942482,
        0.0713072195649147,
        -0.06305574625730515,
        0.04923555999994278,
        0.11471623927354813
    ]
}