{
    "id": "q90BY07oO4U",
    "title": "How to Remove Scratches on an iPhone Screen? - (Not Clickbait)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-04-16T13:15:07Z",
    "video_url": "https://www.youtube.com/watch?v=q90BY07oO4U",
    "category": "Howto & Style",
    "tags": [
        "How to remove scraches",
        "how to fix scratched screen",
        "how to get rid of scratches",
        "scrached phone screen",
        "screen",
        "display",
        "iphone",
        "android",
        "smartphone",
        "ios",
        "ipad",
        "diy",
        "DIY scratch remover",
        "toothpaste",
        "scratch",
        "phone scratch",
        "level 6",
        "jerryrigeverything",
        "new iphone",
        "apple iphone",
        "remove scratches"
    ],
    "views": 3638490,
    "likes": 108885,
    "comments_count": 4986,
    "description": "After scratching phones for the past 8 years... now its time to figure out how to remove scratches and make phones look brand new again. The machine we use is this one:  This video is not sponsored. In this video we see how much work is involved with getting minor scratches removed from smartphone displays. Can we remove a level 6 scratch? We'll see what levels of scratches this machine can get rid of.   Watch the Laser iPhone repair here:   Huge thanks for Fixd for letting me borrow their machine:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://shop.rewa.tech/detail/refox-automatic-grinding-polishing-machine-for-mobile-screen-scratch-repair.html?utm_source=YTB_JRE",
        "https://youtu.be/Lj4Od9D4puc",
        "https://www.youtube.com/channel/UCoBTIuhduIoXk3x81trUnzQ",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So do you remember that lazor machine that could zap the shattered glass off of an iPhone in just a few minutes? Well that same company made another machine that can remove scratches from cellphone screens. Now we're all pretty familiar with scratches at this point, you know, they start at level 6 with deeper grooves at a level 7. Today we're going to test out this machine, see if it works, and see what level of scratches it can actually remove. Let's get started. [Intro] So right off the bat this machine is a beast. We're probably not going to buy one of these for your living room, but at the same time it's nice to know they exist so if your screen ever has scratches you can get it fixed. So inside of this machine we have a polishing pad down here at the bottom, along with a little coolant hose pump thing that we would normally see on a CNC machine or a metal band saw. And the whole concept behind this is that we are going to remove a microscopic layer of glass off of the surface of this display. And we're going to do that with science. We need something harder than a level 6 on Mohs scale of hardness. So in our particular case we're going to use a super fine powder called cerium oxide. Each of these tiny pulverized fragments of dust are harder than a level 6 on Moh's scale of hardness. So we'll measure it out and add it to distilled water to make that magic sauce that removes scratches from smartphones. We're using distilled water because there are no minerals and it makes it slightly more safe for a cellphone. Even if a cellphone is watertight, you never really want to test it's water resistance. It's dangerous. So if you're thinking about removing the scratches from your phone, you do have to weight the pros and cons. One, you're getting rid of your scratches, but two, you're putting your phone in an abrasive liquid...let's just see how it turns out. This is one of the phones I've taken apart for my durability tests and teardowns. As you can see from the scratches at level 6 and deeper groves at a level 7. And there are quite a lot of other scratches since this phone is in use currently. So this is the before shot and let's hope that the after shot looks a little cleaner. The white plastic mold is just to hold the phone secure while the machine is doing it's work. And the blue glue, that waterproof sealant, is helping keep that milky abrasive from entering in through the microphone holes, around the edge of the screen, or through the earpiece all of which are ingress points inside of the phone, which is where we don't want that milky liquid to be. Once we're done caulking around the edge of the phone, we can put it inside of the UV light which cures the adhesive. Very similar to the adhesive we used on the glass only Apple Watch repair we did last year. Once the adhesive is cured we can take the plastic mold and drop it into the metal mold, which is what the machine grasps onto when it's doing the polishing. And since the waterproofing adhesive is now solid, the polishing abrasive should stay out of the phone. So this is my first time using this machine so it's going to be interesting to see how it goes. This puck right here helps keep the phone in place while we set it on top of the polishing pad, right up against those two wheels. Just so you can see, the phone is still in there and still alive for the moment. Position the abrasive spitter outter. Now we can turn it on. Emergency kill switch. And I can hit start. Now I'm sure normally this is supposed to be down, but we're not about that life, so we're going to go ahead and take a look from the inside. So right now we have the abrasive liquid, which we can kind of just spray wherever we want. This has a little magnetic base to it. But if we put it here in the center, the centrifugal force of the spinning pad kind of pulls the liquid out towards the edge. But the puck is also spinning around. And I assume it's spinning to kind of help remove that microscopic layer of glass uniformly across the surface without having lines running in a single direction. So we just finished 5 minutes in this glass resurfacer, but I think it's time we see if the phone is still alive or not. It's got the liquid all over it. And surprisingly, the level 6 and level 7 deeper grooves are both just gone. Now of course, by removing a microscopic layer off the surface of the screen, we've also removed the oleophobic coating on the top of the glass, but we can bring that back easy enough. I'll take my razor blade and pop out the adhesive surrounding the phone. All the blue goo is turned into a hard plastic, and it's fairly difficult to get it out since the plastic mold is exactly shaped to the sides of the phone. This of course is an iPhone mold, but I know they have molds made for other phones as well. To get that oleophobic back in place, all we have to do is clean off the screen really well. So you can see how the screen reacts when I add isopropyl alcohol to the surface. It just kind of stays in one spot and runs off the edge of the screen. But you can see it's sticking to the glass surface, which means that the oleophobic coating is gone and that oleophobic coating is what keeps your fingerprints from getting the screen dirty. Once the screen is totally clean, then I can take the oleophobic coating, drop a couple drops on the top, rub it in, and then throw it in that UV light for another 30 seconds. And when it comes out you can see that the alcohol, instead of sticking to the screen, is kind of beading up on the surface of the phone which is exactly what we're looking for. Now the phone is pretty much back to the factory scratch-free finish, and is still fingerprint resistant. Now I do have one of my iPhone XR's and as you can see from the screen, we still have the level 6 scratches, with deeper grooves at level 7. Now, normally I stop at a level 7 because any more damage would be, you know, excessive. But I think today we can make an exception. If you phone ever sustained a level 8 scratch in real life, the reality is it would probably be broken. They are more like gauges in the screen. And well, a level 9 scratch is something entirely different all by itself. And a level 9, instead of being gauges is more scoring the glass and cracking it all the way through. I doubt we can get rid of a level 9 scratch. Alright we have the level 6 scratches, level 7 deeper groove, level 8 gauges, and level 9 a score across the surface of the glass. Let's see what can be removed. We have everything set. We're just going to go for another 5 minutes on this round, but I want to show you the back here. This is that milky abrasive liquid that is just being pulled up through the pump, through the pipes, all the way inside through this adjustable spout. And once again, we're just removing a microscopic layer off of the surface of that phone. But is it microscopic layer enough for level 8 gauges? Just if you're curious, this is kind of like a shag carpet just chilling there like a doormat. And the phone. It's nice and milky. It still turns on. Let's dry it off and put it under the light. So we can already see just from this lighting right here that 6 and 7 are already gone, but levels 8 and 9 are still there. Now personally, I think level 9 is going to be there forever. But let's throw it in one more time for 5 more minutes and see if we can get level 8 to disappear a little more. So it has now been 25 minutes. We left it in for quite a bit longer cuz those level 8 gauges are pretty rough. Well, we made progress. Let's get it under the light. So it looks like the level 6 scratches and the level 7 deeper grooves are totally removed after those first 5 minutes...minus the one little divot from the level 7 where I assume the pick just gauged out the glass a little bit. But the level 8 gauges and the level 9 score are still present, even after 25 minutes from the abrasive pad. So overall I'm pretty impressed. The machine can probably handle scratches that happen to your phone with every day life. You know, whether it's in your pocket or your purse. Anything from a regular level 6, to a deeper groove level 7. But anything that takes a chunk out of the glass, the machine's not going to be able to handle. In reality, if you got a level 8 or 9, the screen's probably cracked at the same time so you have a bigger issue on your hands. So if you've had your phone for a couple years and you want it to look like new again, there's a good chance this machine can help you out. But, once again, you gotta weigh the pros and the cons. You are putting your phone in liquid and that could be game over. But with enough protection around the edge, it should turn out just fine. I'll leave a link for this machine down in the video description. This video's not sponsored. Huge thanks to FIXD for letting me borrow their machine for this video. And let me know what you think. Would you risk your phone to get rid of some scratches? I'm curious. Come hang out with me on Instagram and Twitter. Hit that subscribe button if you haven't already. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "level",
        "phone",
        "scratches",
        "machine",
        "screen",
        "glass",
        "surface",
        "abrasive",
        "liquid",
        "deeper",
        "minutes",
        "kind",
        "gauges",
        "deeper grooves",
        "microscopic layer",
        "mold",
        "remember that lazor",
        "zap the shattered",
        "inside",
        "adhesive"
    ],
    "transcript_entity_values": [
        "another 5 minutes",
        "5 more minutes",
        "just a few minutes",
        "iPhone",
        "FIXD",
        "9",
        "6",
        "8",
        "Instagram",
        "5 minutes",
        "two",
        "those first 5 minutes",
        "6",
        "9",
        "Moh",
        "25 minutes",
        "another 30 seconds",
        "CNC",
        "XR",
        "first",
        "last year",
        "today",
        "Today",
        "One",
        "Apple Watch",
        "one",
        "7",
        "Twitter",
        "a couple years"
    ],
    "transcript_entity_types": [
        "TIME",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "PERSON",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.15897013247013092,
        0.010605519637465477,
        0.08625418692827225,
        -0.06847652792930603,
        0.004187288228422403,
        -0.03244346007704735,
        0.09489713609218597,
        0.005326676648110151,
        -0.03962775319814682,
        0.013615685515105724,
        0.1074138879776001,
        -0.013777567073702812,
        0.028240418061614037,
        0.07293742895126343,
        -0.030955728143453598,
        -0.02047787420451641,
        0.014099830761551857,
        -0.045834291726350784,
        -0.03804510831832886,
        0.09307382255792618,
        -0.01857845112681389,
        -0.010619303211569786,
        0.03260454535484314,
        -0.09371540695428848,
        0.01815900392830372,
        0.025399476289749146,
        0.011880042031407356,
        0.027848858386278152,
        -0.03668370842933655,
        -0.0491703562438488,
        -0.0008233488188125193,
        0.07235763221979141,
        0.007323528174310923,
        0.07351337373256683,
        0.08814532309770584,
        -0.033315904438495636,
        -0.017244400456547737,
        0.06555914878845215,
        -0.05615004524588585,
        -0.016429036855697632,
        -0.025714555755257607,
        -0.03392605111002922,
        0.006358415354043245,
        -0.017492614686489105,
        0.057794660329818726,
        -0.010236206464469433,
        0.06277412176132202,
        -0.029108474031090736,
        0.056145623326301575,
        -0.05618476867675781,
        -0.03788185864686966,
        0.01682526059448719,
        0.02140353061258793,
        -0.02826877310872078,
        -0.06467542797327042,
        -0.001396080362610519,
        0.04273103550076485,
        -0.013703101314604282,
        0.06779707223176956,
        -0.01770589128136635,
        0.04825294390320778,
        0.017983779311180115,
        -0.007854286581277847,
        0.04757265746593475,
        0.048283565789461136,
        -0.020609259605407715,
        0.0103462478145957,
        -0.09569977223873138,
        -0.007169890683144331,
        0.05158260464668274,
        -0.012894123792648315,
        -0.0030661330092698336,
        0.07030733674764633,
        -0.03427443280816078,
        -0.016259631142020226,
        0.01961185783147812,
        -0.04560256004333496,
        -0.03881068527698517,
        -0.064103864133358,
        0.020512426272034645,
        0.008765723556280136,
        -0.009276996366679668,
        0.03503625839948654,
        0.02868727594614029,
        -0.017001910135149956,
        0.04596319422125816,
        -0.03156594932079315,
        0.07943403720855713,
        -0.021322881802916527,
        -0.07743950933218002,
        -0.019849667325615883,
        0.07978297024965286,
        -0.051236968487501144,
        -0.027391575276851654,
        -0.00019610527670010924,
        -0.06000108644366264,
        -0.07358386367559433,
        -0.0619136318564415,
        -0.01655188947916031,
        0.053086843341588974,
        0.024178188294172287,
        -0.08840463310480118,
        -0.03107302263379097,
        -0.0010011645499616861,
        0.028172610327601433,
        -0.02492527849972248,
        -0.10787511616945267,
        0.01007352489978075,
        -0.0362602062523365,
        0.032726552337408066,
        0.023881057277321815,
        0.009605921804904938,
        -0.060788244009017944,
        0.020801883190870285,
        0.0376674048602581,
        0.009414518252015114,
        0.02986401505768299,
        0.0011219298467040062,
        0.09568106383085251,
        -0.04397498816251755,
        0.048130180686712265,
        -0.013751239515841007,
        -0.03079657442867756,
        -0.049399662762880325,
        -0.0019983267411589622,
        0.010486291721463203,
        -0.00801624171435833,
        2.318202694832203e-33,
        0.05124788358807564,
        0.13664239645004272,
        -0.00825648382306099,
        -0.06956346333026886,
        0.0032987501472234726,
        0.02780374512076378,
        0.05255325511097908,
        0.07811543345451355,
        -0.010663140565156937,
        0.03091982938349247,
        0.029675019904971123,
        0.018228240311145782,
        0.03968840464949608,
        -0.019882628694176674,
        0.04302779212594032,
        0.013301580213010311,
        0.03242569416761398,
        -0.04995988309383392,
        -0.07736068964004517,
        -0.02564547210931778,
        -0.022066378965973854,
        -0.05492115020751953,
        -0.02046162821352482,
        0.09458348900079727,
        0.006490662228316069,
        0.0836755782365799,
        0.05489091947674751,
        -0.023612819612026215,
        0.02724592201411724,
        0.013546700589358807,
        -0.05870577692985535,
        0.050298061221838,
        0.024648087099194527,
        0.03520544245839119,
        -0.0975363552570343,
        0.07315512001514435,
        -0.0068128458224236965,
        -0.0499274767935276,
        -0.006490728817880154,
        -0.018908122554421425,
        -0.031571514904499054,
        0.0016600784147158265,
        0.024235090240836143,
        -0.06305652856826782,
        -0.000859858060721308,
        -0.03007735125720501,
        -0.04373503103852272,
        0.03736088052392006,
        -0.05422939360141754,
        0.006779825780540705,
        0.02577841281890869,
        -0.059836845844984055,
        0.060663703829050064,
        -0.09747129678726196,
        -0.1677689403295517,
        0.020199347287416458,
        0.007216577883809805,
        -0.008371948264539242,
        0.056641966104507446,
        0.04236018657684326,
        0.06228344887495041,
        -0.030589992180466652,
        -0.03081260249018669,
        0.08396851271390915,
        -0.06645382195711136,
        0.04255637899041176,
        0.04575791582465172,
        0.02676112949848175,
        -0.0669647604227066,
        0.026348011568188667,
        -0.04833541437983513,
        0.0522439070045948,
        0.033585380762815475,
        -0.01800309121608734,
        0.0029721963219344616,
        0.029186587780714035,
        -0.014672212302684784,
        -0.01206247042864561,
        0.014155803248286247,
        -0.043026164174079895,
        -0.012764324434101582,
        0.023942677304148674,
        0.07461106032133102,
        -0.06590406596660614,
        -0.026156563311815262,
        -0.10097312927246094,
        -0.043454643338918686,
        -0.010053617879748344,
        0.048776764422655106,
        0.05641268938779831,
        -0.026396144181489944,
        -0.08054990321397781,
        -0.1210111603140831,
        -0.022061074152588844,
        -0.05177551135420799,
        -4.882058729731309e-33,
        0.024713484570384026,
        -0.055391620844602585,
        0.045667681843042374,
        -0.0251917764544487,
        0.018404806032776833,
        -0.08492288738489151,
        0.058824364095926285,
        0.09291710704565048,
        0.014093651436269283,
        -0.09973885118961334,
        -0.040598344057798386,
        0.09500978887081146,
        -0.011945934034883976,
        0.003501949831843376,
        -0.05464678630232811,
        0.014955888502299786,
        -0.10270928591489792,
        -0.06098374351859093,
        -0.0137479268014431,
        0.0273705143481493,
        0.03888723626732826,
        0.042080797255039215,
        0.06844479590654373,
        0.08250692486763,
        -0.04406870901584625,
        0.00982241053134203,
        0.01689321920275688,
        -0.06378131359815598,
        0.038610175251960754,
        0.011022270657122135,
        0.03728646785020828,
        -0.09078812599182129,
        -0.017203882336616516,
        -0.03086240403354168,
        0.054631154984235764,
        0.07215174287557602,
        0.030069593340158463,
        -0.02539546974003315,
        0.0013229167088866234,
        -0.055526599287986755,
        0.056647833436727524,
        0.05885756388306618,
        -0.036357853561639786,
        -0.009950305335223675,
        -0.009238875471055508,
        -0.057060010731220245,
        -0.027128197252750397,
        0.04256189242005348,
        -0.04057048633694649,
        0.0031786481849849224,
        -0.04393097385764122,
        0.029503395780920982,
        -0.021459219977259636,
        0.003404304152354598,
        -0.05039149150252342,
        0.0969439372420311,
        0.06800849735736847,
        -0.07524638622999191,
        0.03252372145652771,
        0.01285360474139452,
        0.1155448704957962,
        0.03371111676096916,
        -0.11408119648694992,
        0.013840030878782272,
        0.0035782952327281237,
        -0.04608917981386185,
        0.07148880511522293,
        0.035452887415885925,
        -0.008794926106929779,
        -0.022935006767511368,
        0.003531532594934106,
        0.019848056137561798,
        0.02244800142943859,
        -0.10619234293699265,
        -0.010784318670630455,
        0.0031809473875910044,
        -0.06613137573003769,
        -0.013130364008247852,
        -0.045931074768304825,
        -0.02149765007197857,
        0.08452624082565308,
        -0.06912578642368317,
        0.05096866562962532,
        0.12037321925163269,
        0.08250685036182404,
        -0.010168936103582382,
        0.04432851821184158,
        0.03703717514872551,
        -0.04228471219539642,
        -0.06965942680835724,
        -0.09894835948944092,
        -0.018361933529376984,
        0.0017003316897898912,
        0.03013000264763832,
        -0.0508817695081234,
        -5.72074654314747e-08,
        0.06799224019050598,
        0.0242045596241951,
        -0.0010768779320642352,
        -0.03753321245312691,
        0.005044534336775541,
        -0.05020170286297798,
        -0.0018432755023241043,
        0.015644298866391182,
        0.049032241106033325,
        -0.08665954321622849,
        -0.024553045630455017,
        -0.08047391474246979,
        -0.0825301930308342,
        0.061355385929346085,
        -0.002888659480959177,
        0.07005041092634201,
        -0.00942687876522541,
        0.09961367398500443,
        -0.0350738987326622,
        0.014037651009857655,
        -0.087513267993927,
        0.017803948372602463,
        0.08961840718984604,
        -0.01026956457644701,
        0.013323287479579449,
        0.04353388398885727,
        -0.06923187524080276,
        0.018727196380496025,
        0.043863944709300995,
        -0.00284826778806746,
        -0.04094215855002403,
        -0.04144010320305824,
        0.03282945603132248,
        0.039582427591085434,
        0.03655959293246269,
        -0.032753266394138336,
        -0.06977643072605133,
        -0.03854432702064514,
        0.07023022323846817,
        -0.03277269005775452,
        -0.021619491279125214,
        -0.08966072648763657,
        -0.016141308471560478,
        0.02299209125339985,
        -0.051342613995075226,
        -0.08172117918729782,
        -0.012478836812078953,
        -0.1710045039653778,
        -0.01534376572817564,
        0.03947264328598976,
        -0.05928969755768776,
        0.012897719629108906,
        -0.06512001156806946,
        0.022927971556782722,
        -0.00719964224845171,
        0.007374577224254608,
        0.12242086231708527,
        -0.058901507407426834,
        0.04257063567638397,
        0.0007934333407320082,
        0.061356205493211746,
        -0.06355728209018707,
        0.05057654157280922,
        0.025143010541796684
    ]
}