{
    "id": "q9hbEIihYWs",
    "title": "Building the Portable Xbox One",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-03-24T16:16:54Z",
    "video_url": "https://www.youtube.com/watch?v=q9hbEIihYWs",
    "category": "Science & Technology",
    "tags": [
        "xbox",
        "xbox one",
        "xbox one s",
        "portable xbox",
        "portable xbox one",
        "microsoft",
        "gaming",
        "unboxing",
        "game console",
        "austin evans",
        "console",
        "fortnite"
    ],
    "views": 3949682,
    "likes": 71501,
    "comments_count": 5593,
    "description": "The Xbox One is finally ready to get the portable treatment. Microsoft Xbox One S on Amazon:  G-Story 11.6\" Portable Xbox monitor on Amazon:  iPRIGENT Portable Battery on Amazon:  Xbox One Design Lab controller:  Astro A10 Gaming headset on Amazon:  Peak Design Everyday Backpack on Amazon:  Building the Portable PS4:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://austin.tech/ones",
        "http://austin.tech/xboxmonitor",
        "http://austin.tech/portablepower",
        "https://xboxdesignlab.xbox.com/en-us/?rtc=1",
        "http://austin.tech/astroa10",
        "http://austin.tech/peakeveryday",
        "https://www.youtube.com/watch?v=0SmVHslppDQ",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and this is the portable Xbox One S setup. So ... (sighs) Hang on a second. This is not right. Now this is a little bit more like it. This is the Xbox One S. Now you might be asking, \"Why are we using the One S as opposed to the newer and more powerful One X?\" First of all, it's going to be easier to power the One S. Because it's going to be a fully portable setup running on battery, this guy's gonna last a lot longer. But the second reason is the screen. While the One S will technically output 4K, pretty much all the games are going to be running at 1080p or below, which is where this comes in. This is the G-Story display for the Xbox One S. The idea here is that this is actually going to mount onto our Xbox, sort of like a laptop. And because it's going to be full 1080p, it actually shouldn't look too bad. Take a look at the box, and not only will you see this monitor, but you'll also see the PS4 Pro option, which is very similar to what we did when we built the ultimate PS4 Pro. There's some key upgrades with this one, though. Not only does it support HDR, which we'll see how good that actually is, but impressively, also is going to support AMD's FreeSync. This is not available on the Xbox One yet. However, an upcoming patch will allow FreeSync monitors to work with the One S as well as the One X. Once that's available, that actually might make a pretty big difference to actual gameplay. As you can see, we're getting an 11.6\" display with a 1080p resolution. What's kind of cool with this is, not only does it have dual HDMI ports, but it's also going to have the speakers built-in. Pop open the box, and the first thing we're going to see are the accessories. And here, we have our actual display itself. You can see it matches the Xbox One S pretty well. I think it's a touch brighter, but this is also an Xbox that might be a little bit dirty right now. That's actually gonna be pretty close. The next question is, \"How do I actually mount it?\" Doesn't seem like there's an obvious way to mount this. Two clips on the sides later, we have what looks to be an Xbox One S laptop. You can open up the screen, close it, and it doesn't look crazy, although I will say that there's nothing holding the screen down like this, so you might wanna be a little bit careful with putting this in a bag. However, that's actually a fair bit of the way of getting our Xbox One portable. However, that is not anywhere near ready. It's okay. It's not a real video until I've drawn blood or hurt my funny bone. Next up, we have the iPRIGENT solar portable battery generator thing. The idea here is that this is a pretty powerful battery bank that you can charge either via solar or ... What's gonna be a lot more practical is to just plug it into the wall. But importantly for us, it's going to have a full outlet so we can power not only our monitor, but also our Xbox One S. Or at least, that's what I hope we'll be able to do. We haven't tried it yet. Whether you're climbing in the Himalaya, living in your village while you travel in the world, or camping on the beach, we will keep you powered. I feel so safe and powered thanks to this generator, I guess. All right. So it's metal. It feels like a car battery. But importantly for us, in addition to our USB ports, which actually might come in handy for the monitor, but importantly, we do have that full outlet. So if we plug it in, in theory, this should be capable of delivering enough power to run everything we need. You know what? This actually doesn't look all that ridiculous right now. However ... Actually, no, there's not a however. We're not gonna go crazy with this one. We're actually going to make something that is remotely practical. For the rest of this setup, we're going fairly basic. This is going to be an Xbox One Design Lab controller, although obviously, you can use any Xbox One controller you want. It's important to have at least a slightly newer one with the headphone jack because we have a headset. This is the Astro A10. It's, of course, not going to be super necessary to have a headset, but because this is going to be a portable setup and we might not always wanna actually rely on the speakers here, it's going to be nice to have this guy we can plug into the controller. So to make this fully portable, we have the Peak Design Everyday bag. This is actually Ken's Everyday bag, right? - [Ken] Yeah. - Oh wait, I just said every day. (mocking) It's every day ... No, I almost did it. I almost did it, but I didn't do it. You're welcome. What's nice about this is that it's going to be fully modular. In addition to the awesome little clasps you have to open up to the top section, if you want, you can just unzip the side and everything in here can be pulled out. Right now, it's set up as a camera bag, but if I just rip out these sections, we should be able to fit the Xbox. So inside this bag, we have everything we need for our portable Xbox setup. Except the headphones, which didn't quite fit, but close enough. If you're crazy enough like me and you actually wanna play your Xbox in the park, hopefully this is actually going to work. Although whether it actually does or not, that's a little bit of a different story. The real question I have here is whether this battery is actually going to be able to power not only the Xbox, but you also have to keep in mind that we have to power the display. I can't imagine that that screen's going to take up all that much power. Probably only 10 watts or so. But we do need a multi-tap to be able to get this single outlet on the actual battery bank into the two outlets we need for both the Xbox as well as the display. Luckily though, it should just pop in like this, and (laughs) it's good to go. The first thing I wanna do is make sure that our battery can power the display, which shouldn't be a problem, but none of this might work. We'll see. If I hit the power button twice, it should turn on. Then I hit the power button here, and okay. So at least we have the monitor up. Now let's plug the Xbox in, and (laughs) I really hope this works. Otherwise, we're gonna have to redo this entire part of the video. All right, plug the Xbox in. And because we broke our home button, I'm gonna hit the disc eject button. But if you give it a second, it will turn on. Sweet. I still need to plug in the HDMI, but I think we actually might be okay here. Okay, so we have our fully portable Xbox One setup. This is actually much less ridiculous than the last one we did. So the next step is to get actually online. Normally, that would be a problem. If you're playing something that's offline, it's no big deal. However, thanks to the magic of tethering, we actually should be able to play online. All right, the console is connected to the network. Now the next thing is ... Actually, I'm curious about the display. It does show that we support HDR video, however, it doesn't support HDR10 for gaming. So I guess in theory, we could maybe watch a video or something. However, the display itself is actually surprisingly decent. It is really bright out here, and yet, while it's a little bit reflective, I can totally see the screen no problem. So it's time to put all of this to the test with a game of Fortnite on my Xbox in the middle of a park, even though the phone version exists. Oh hey, we're up and running. Dude, this totally works. (laughs) I can't really tell if there's latency. Obviously we're playing on LTE, but it feels fine. Hi, little guy. You wanna play some Fortnite? Come here. Come here, play some Fortnite. Yeah, want some Fortnite? I don't have anything for you, sorry. Don't bite me, please. The squirrel approves of Fortnite. I have no idea where I am. (laughs) Dude, he's totally just chilling here. (laughs) Really just does not care. I'm actually not totally sure how long this is going to last on battery. I could tell, but this actually covers up the battery indicator, so we'll see. Usually when you're outside with pretty much any kind of screen, but especially something that's going to be gaming related, you're usually gonna have to deal with a lot of glare. But I'm surprised at how matte this display is, as well as just how decent it is to play outside, especially the brightness helps. It's really not that hard to see at all. I feel like the headset just pushes me over the edge right now. I can't really notice any serious latency. I'm sure it's there. I haven't really seen a ton of other people just yet. But as far as I'm concerned, I'm playing on Xbox anywhere else. The idea that I'm fully untethered running on LTE doesn't really seem to be an issue, which is kinda cool, actually. So if you'd like to build your own portable Xbox One, we'll have links to everything we used to build this in the description of this video. And you also might wanna go check out the original video where we built a portable PS4. Anyway guys, thank you so much for watching and I will catch you in the next one.",
    "transcript_keywords": [
        "Xbox",
        "portable Xbox",
        "portable",
        "portable Xbox setup",
        "power",
        "display",
        "fully portable Xbox",
        "battery",
        "Austin",
        "Fortnite",
        "bit",
        "pretty",
        "Xbox setup",
        "plug",
        "setup",
        "screen",
        "video",
        "fully portable",
        "plug the Xbox",
        "bag"
    ],
    "transcript_entity_values": [
        "PS4 Pro",
        "AMD",
        "the G-Story",
        "Xbox One S",
        "11.6",
        "first",
        "USB",
        "jack",
        "Two",
        "Ken",
        "Austin",
        "the Peak Design Everyday",
        "Xbox",
        "FreeSync",
        "two",
        "PS4",
        "Xbox One",
        "Xbox",
        "HDMI",
        "only 10 watts",
        "4",
        "1080p",
        "second",
        "Xbox One S.",
        "Fortnite",
        "Xbox One",
        "Fortnite",
        "every day",
        "1080p",
        "Himalaya",
        "One",
        "Xbox One S",
        "the Astro A10",
        "LTE",
        "First",
        "Xbox One Design Lab"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        0.040876902639865875,
        0.031756822019815445,
        -0.006055350415408611,
        -0.026432251557707787,
        0.12935687601566315,
        0.0363992378115654,
        0.010140929371118546,
        0.01322913821786642,
        0.09796132892370224,
        0.035112541168928146,
        -0.05185049772262573,
        0.09029829502105713,
        0.08760697394609451,
        -0.013029182329773903,
        -0.038004063069820404,
        0.032016362994909286,
        0.12394712120294571,
        -0.11833291500806808,
        -0.09048047661781311,
        0.04394051060080528,
        0.002842189744114876,
        -0.10236414521932602,
        -0.01638704724609852,
        0.01331932470202446,
        -0.030679013580083847,
        0.041421595960855484,
        -0.07249171286821365,
        -0.036602672189474106,
        -0.023476336151361465,
        -0.05367860570549965,
        -0.007114837411791086,
        0.021050192415714264,
        0.016928372904658318,
        -0.004884501453489065,
        -0.026915622875094414,
        -0.04296058788895607,
        0.10791189968585968,
        0.005140664987266064,
        -0.08868507295846939,
        -0.06476888805627823,
        -0.030126357451081276,
        -0.03288504108786583,
        0.07414593547582626,
        0.06010317802429199,
        -0.08286315202713013,
        -0.014833140186965466,
        -0.0571456104516983,
        -0.03783341869711876,
        0.015945108607411385,
        -0.03928491845726967,
        0.08271875977516174,
        -0.0770186334848404,
        -0.010410691611468792,
        -0.04540187120437622,
        -0.03677225485444069,
        0.04675280675292015,
        -0.06910964101552963,
        0.04074281454086304,
        0.016008350998163223,
        -0.018866078928112984,
        0.03196144476532936,
        -0.06602301448583603,
        0.04495760053396225,
        0.02634255401790142,
        0.02724478766322136,
        -0.0760510265827179,
        0.05617394298315048,
        -0.036205392330884933,
        -0.04819239303469658,
        -0.013771386817097664,
        -0.044866710901260376,
        -0.04035395756363869,
        -0.05081900209188461,
        -0.04998912289738655,
        -0.012271599844098091,
        0.015143055468797684,
        0.03661744296550751,
        0.0032547498121857643,
        0.08173948526382446,
        0.014512487687170506,
        0.03821181505918503,
        0.034039054065942764,
        -0.11495494097471237,
        -0.010536713525652885,
        0.005000331439077854,
        0.012985003180801868,
        -0.005026740487664938,
        -0.027927229180932045,
        -0.028297502547502518,
        -0.03575186803936958,
        0.037189751863479614,
        0.005489836446940899,
        0.10018220543861389,
        0.06235749274492264,
        -0.004632547032088041,
        -0.037983112037181854,
        -0.01201049704104662,
        -0.004570648539811373,
        0.007381202187389135,
        0.023854929953813553,
        0.007472438737750053,
        0.07193311303853989,
        0.1320246011018753,
        0.05301499366760254,
        0.008005008101463318,
        -0.11235068738460541,
        -0.07138831168413162,
        0.032764583826065063,
        -0.023752287030220032,
        -0.03029809519648552,
        0.000468707294203341,
        -0.013247300870716572,
        -0.041498225182294846,
        0.06465436518192291,
        -0.004530549515038729,
        0.057879116386175156,
        -0.02188197150826454,
        0.02065025083720684,
        0.024724213406443596,
        0.003413976402953267,
        0.010603830218315125,
        -0.06009657680988312,
        0.028726672753691673,
        -0.06327412277460098,
        0.09478432685136795,
        0.010187018662691116,
        -0.008603030815720558,
        2.420779454291825e-33,
        -0.012011810205876827,
        0.05769246071577072,
        0.008303445763885975,
        -0.019675133749842644,
        -0.015734152868390083,
        -0.03194492310285568,
        0.016219498589634895,
        0.0954248383641243,
        0.05279209464788437,
        0.04227480664849281,
        -0.019832173362374306,
        0.08660711348056793,
        -0.05168616771697998,
        0.061426129192113876,
        0.05993978679180145,
        -0.01744559220969677,
        0.05144628882408142,
        -0.003287989879027009,
        -0.0504942461848259,
        -0.011118456721305847,
        0.0017583399312570691,
        -0.001018116599880159,
        0.04250134900212288,
        -0.061310429126024246,
        0.02386174537241459,
        0.0033197186421602964,
        0.05826285481452942,
        0.030506223440170288,
        0.006718054413795471,
        0.02946970798075199,
        -0.11195895820856094,
        -0.0030963115859776735,
        -0.09082184731960297,
        -0.03787275031208992,
        0.02433410845696926,
        -0.04533736780285835,
        0.021848682314157486,
        -0.030788326635956764,
        0.017940469086170197,
        0.044996194541454315,
        -0.09882532805204391,
        0.02058764547109604,
        -0.042813245207071304,
        -0.06836950778961182,
        0.06577510386705399,
        0.03671572357416153,
        -0.020585115998983383,
        0.017622441053390503,
        -0.069272980093956,
        0.015431812033057213,
        -0.034983109682798386,
        0.03944994881749153,
        0.009580670855939388,
        0.01177995651960373,
        0.03689583018422127,
        -0.10449615865945816,
        0.04321961849927902,
        -0.0853918269276619,
        0.036566153168678284,
        0.013633101247251034,
        0.044680405408144,
        3.1361330911749974e-05,
        -0.05812276154756546,
        0.05873441323637962,
        -0.04486970975995064,
        0.025245822966098785,
        0.06831715255975723,
        -0.007372697815299034,
        -0.04803558066487312,
        -0.021603688597679138,
        0.06631872057914734,
        0.015450946055352688,
        0.04751107841730118,
        -0.0746341198682785,
        0.09500856697559357,
        -0.0025726293679326773,
        -0.0628497526049614,
        0.054126787930727005,
        -0.026444578543305397,
        0.0002336475590709597,
        -0.05290082097053528,
        0.061236441135406494,
        -0.031640417873859406,
        0.03414222598075867,
        -0.07391377538442612,
        -0.028331676498055458,
        -0.011595231480896473,
        0.019336793571710587,
        -0.028537629172205925,
        -0.01651727221906185,
        -0.013423803262412548,
        -0.004686329979449511,
        -0.006476774346083403,
        -0.004024682100862265,
        0.036200203001499176,
        -3.762728029623372e-33,
        -0.010747035034000874,
        -0.09277108311653137,
        0.018608056008815765,
        -0.026199599727988243,
        0.04372353479266167,
        0.021011507138609886,
        0.015794560313224792,
        -0.048490896821022034,
        -0.017469173297286034,
        -0.007038670592010021,
        -0.04276377707719803,
        -1.82115600182442e-05,
        -0.04100554436445236,
        0.03333267942070961,
        0.02926064282655716,
        -0.04482639208436012,
        -0.02615944668650627,
        -0.08189138025045395,
        0.027274448424577713,
        0.010274241678416729,
        0.08462267369031906,
        0.05548893287777901,
        -0.0068272934295237064,
        0.028330858796834946,
        -0.009393101558089256,
        -0.04512635990977287,
        -0.020087461918592453,
        0.01875964365899563,
        0.0326404832303524,
        0.03261549770832062,
        0.01472869049757719,
        -0.03177265077829361,
        0.04681965336203575,
        0.006074107252061367,
        0.004801447968930006,
        0.015378084033727646,
        -0.02621227689087391,
        0.03273014351725578,
        0.017959337681531906,
        0.0029869582504034042,
        -0.016521764919161797,
        0.00520796375349164,
        0.01547878235578537,
        -0.028513818979263306,
        0.09975214302539825,
        0.016586190089583397,
        -0.052386920899152756,
        0.033383484929800034,
        0.08426428586244583,
        0.0024278180208057165,
        0.06591366976499557,
        0.02978087216615677,
        -0.06942173093557358,
        -0.013413666747510433,
        -0.04121556878089905,
        -0.08859512209892273,
        -0.07861342281103134,
        0.05528492107987404,
        -0.09261588752269745,
        -0.00786963663995266,
        0.06774777919054031,
        -0.0186186283826828,
        -0.04082557186484337,
        0.004623793996870518,
        -0.06019945070147514,
        0.011842044070363045,
        0.08591174334287643,
        0.020620889961719513,
        0.051964662969112396,
        0.020801519975066185,
        -0.08354675024747849,
        -0.0718093290925026,
        -0.009269454516470432,
        -0.07068371772766113,
        0.046288881450891495,
        0.06876363605260849,
        -0.03500011935830116,
        -0.10026852041482925,
        0.03455031290650368,
        -0.03142544627189636,
        -0.08383483439683914,
        -0.006559608969837427,
        0.06874781101942062,
        -0.03692486882209778,
        0.04777960479259491,
        -0.05917933210730553,
        0.08823071420192719,
        0.02434132620692253,
        -0.027259716764092445,
        -0.04475947469472885,
        0.02774909697473049,
        -0.00161179737187922,
        -0.11714332550764084,
        0.08895956724882126,
        0.011664881370961666,
        -5.5026095679977516e-08,
        0.029237641021609306,
        0.022363906726241112,
        -0.027109570801258087,
        -0.017183557152748108,
        -0.06612773984670639,
        -0.05337875336408615,
        0.007187864277511835,
        0.023986630141735077,
        0.10989000648260117,
        -0.0026160674169659615,
        0.029244225472211838,
        -0.06882811337709427,
        -0.02486690692603588,
        0.05602775141596794,
        0.05327640473842621,
        0.07286400347948074,
        -0.10183341056108475,
        0.016744395717978477,
        -0.02217218466103077,
        0.029401935636997223,
        -0.005763212684541941,
        0.0003962114860769361,
        0.006340117659419775,
        -0.10962018370628357,
        -0.01588134467601776,
        0.006433699280023575,
        -0.09292146563529968,
        0.008026878349483013,
        0.04219251871109009,
        -0.0012491866946220398,
        0.008397048339247704,
        0.021640125662088394,
        -0.07807711511850357,
        -0.023908933624625206,
        0.01544912625104189,
        -0.07980028539896011,
        0.011001063510775566,
        0.04324822500348091,
        0.13350443542003632,
        0.02327096089720726,
        0.0250617153942585,
        -0.12520048022270203,
        -0.13682974874973297,
        0.026080001145601273,
        0.032859399914741516,
        -0.012624209746718407,
        -0.04404988884925842,
        -0.07628919929265976,
        -0.12711524963378906,
        0.12114971876144409,
        -0.03611277416348457,
        -0.02364172786474228,
        -0.02088179811835289,
        -0.054346855729818344,
        0.16238436102867126,
        -0.002504090778529644,
        0.053535498678684235,
        0.0059102666564285755,
        0.005750883370637894,
        0.05324782058596611,
        0.00854430440813303,
        0.003798776539042592,
        0.019337153062224388,
        0.07806184142827988
    ]
}