{
    "id": "Q_8ssQ7uBtw",
    "title": "New M2 iPad Pro Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-10-25T13:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=Q_8ssQ7uBtw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 510313,
    "likes": 12594,
    "comments_count": 531,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today, we have hands on with a brand new M2 iPad Pro. I know, I can't believe it. I just feel like the iPad M1 Pro just came out and I have used that thing so much this year. For whatever reason, earlier this year, I decided to start drawing a lot and I got super into Procreate. I did a ton of illustrations and I was having so much fun. So I really got this all new appreciation for the iPad and using the iPad Pro because it is such a high-end device. I never had to worry about performance at all. One of the things I cannot wait to come to the new M2 iPad is DaVinci Resolve. Now I was actually really surprised to hear that DaVinci was coming to the iPad before Final Cut. Because that is something that all of us have just patiently, maybe not so patiently, have been waiting for that to come to the iPad. I mean, I'm honestly just waiting for iMovie to be able to edit vertical video. Like that's small, simple request. But in the meantime, there's other apps like LumaFusion which is one of my favorite editing apps on the iPad currently. DaVinci isn't out yet so I won't be able to demo that. But I will show you guys LumaFusion which is one of my favorite editing apps on the iPad. And it's super fun, super intuitive, and it really does take advantage of not only the touch space environment, but you could also use a mouse and keyboard, using shortcut keys, and it's pretty incredible. So with the new M2 chip, this will be giving the iPad an increased 15% faster CPU, 35% faster graphics, and 50% more memory bandwidth all while maintaining the 10-hour battery life. Another new feature is Apple Pencil Hover. Now I haven't tried this yet, so I think that's gonna be kind of the first thing that I'm gonna try. There's still more that I'm gonna tell you about. But since I haven't tried this yet, let's just test it out before we get into more. So right here, it's not touching, not touching, not touching. Like that's far. That is a very far hover. And as I get closer, the icon gets a little bit bigger. This is something that I never really thought that I would want, but this is gonna be great for illustrating because you're able to choose brush sizes, you're able to see if the color will match with the other color and how they will mesh. So I'm super excited to try this out in Procreate. So on this 12.9-inch iPad, it has an immersive Liquid Retina XDR display with extreme dynamic range with up to 1600 nits of peak brightness. Another cool thing is it can actually also be used as a display for reference color. Let's check out some of the apps. I have a few things installed here. I've got Adobe Fresco, Photoshop, and Lightroom. So I'm gonna test out Adobe Fresco. I've actually only used this on a PC. I know. I'm shook. But I've actually got a few photos here already. Look at the hover. I'm not touching. But I like this because I can actually see, okay, that's the smudge brush, that's the eraser, vector brush. I'm into vector. Let's do that. So there's Adobe Fresco. Looks great. How about some Photoshop? Okay, let's see what we can open up. And this is something that's new not only in the iPad OS 16, but also in iOS 16. Let's go into our images. So when you press and hold, look at that. There it is. Go into Procreate 'cause I know this'll work. There it goes. And we just imported our image. Look at that. Oh my gosh, I love the hover so much. What a great feature. Super hyped to start using that. Now check that out. Look at this beautiful work of art that I just made. The fact that it this cuts out so well is super impressive. Looks great. So now in Photoshop, let's see here. We're gonna open up a thumbnail. This is my podcast thumbnail. So this is great. So you can see I've got all of my layers on here. Giving me a tutorial. I probably should read the tutorial 'cause I really have not used Photoshop on the iPad before. But I use Photoshop all the time. It's like my go-to. The hover once again. I mean everything is working super seamless. Look at that. Just gonna move us around. Wow, it's actually quite nice using the Apple Pencil in Photoshop. All right, what else do we have? Shaper 3D? I've actually never used this. Let's set it up. What device do you wanna use for modeling? We're gonna use an Apple Pencil. - [Voiceover] Let's learn the basics. - Oh, this is tutorial. This is a full on tutorial. It's fast. Super responsive. Oh shoot. Shut up. That's fun. You've been holding your Apple Pencil with your left hand. Do you wanna swap the UI to the other side? That's so considerate that they knew. They know me. Great, look at that. - [Voiceover] Let's cut out some material. - [Justine] Now obviously the iPad is made for either consuming contents or editing content. But you can actually create content on this as well. This does have two cameras on the back and one on the front, and you can actually shoot 4K ProRes content on this iPad. So there's a 12 megapixel wide and a 10 megapixel ultra wide. Plus, this does have a True Tone flash. And like I said, this does have the lidar right here on the back near the cameras. Now much like the previous iPad, this does have support for Thunderbolt 3 and USB 4. And this will give you access to high performance external storage docks, 10 gigabit ethernet connections. And one thing that's pretty great is you can also connect it to an external display up to 6K resolution. One thing I've been super excited to test out on here is Stage Manager because that's something that is in the Pro models in iPad OS 16. So you do have to enable it. So when you swipe down, you have this little icon right here. So when you click that, this will allow you to turn on Stage Manager. And as I open up something else, this is gonna be giving you a more windowed view. So it kind of almost feels more desktop Mac-like than an iPad. Also has anybody listen to the new Taylor Swift album? Streaming everywhere now. Also there's an entire Apple Fitness class dedicated to \"Midnights.\" So super excited to start taking some of those classes. Now here's the Stage Manager. You've got all of your items over here. You can click through. So basically it just gives you like another dock. Dock on the side, dock on the bottom. So another cool thing you can do is you can kind of double up with apps. So if I click up here, I can add another window. So you're able to add another window that's already open. So let's add my Procreate here. So you can see that I have this now side-by-side with my Apple Music. You can make this smaller, you can make this larger. It's more Mac OS than iPad if you ask me. So you can also full screen back into whatever app it is that you want and then it will activate again whenever you open something else up. This is also a pretty big deal in iOS 16 is there's now a weather app. I know seems like something that should have been there from day one, but we now have a weather app. So it looks like it's raining in Redmond. Cupertino? Partly cloudy. Also, I don't know if I like this 'cause this is just making me anxious. It's showing all of my devices that need charged. My other iPad is at 55%. My AirPods Pro are 100%. But the case? 17%. Another cool app is FiLMiC Pro. I really like this app because this is one of the apps that a lot of people do use to do more high-end filmmaking. Basically lets you go in and edit every setting manually, which is super exciting. Now you may also have noticed that there are some other iPads that have also came out at the same time as this new M2 Pro. And that's just the regular iPad, which comes in four different colors. You've got a pink, a blue, a yellow, and a silver. Now the main big difference is, of course, this does not have an M2 chip in it. It does have the A14 Bionic chip. The M2 supports Thunderbolt and USBC 4. And one of the other new features, like the landscape camera placement, which is a lot of my favorite features did not carry over to the Pros and I'm so sad about it. They now have landscape. So when you're doing conference calls the camera is placed right up here as it should be. But on the Pro, it is still placed in the landscape position. Now kinda makes sense why they didn't do this because this really isn't a huge massive upgrade from the M1 version. So to completely reconfigure this to have a landscape camera, even though it makes sense, that I still am very sad because that was one of the features that I really, really was looking forward to. I do have a feeling though, I think, that the next iPad Pro will definitely have it. You wanna learn more about the iPad and the landscape? I do have a full video going over some of the new details on this one so feel free to check that out. I'll put a link in the description. The other big difference is the Apple Pencil 2 does not work with the new iPad. So one of the big benefits to getting the Pro is you will be getting the new Apple Pencil 2 support. And this also does have a weird kind of charging connecting configurability because you have to use a USB-C cable and a dongle to connect to the Apple Pencil 1. I mean obviously it's pretty intuitive. I will say it is better than having this stick out the side of your iPad like you had to do before. So you just plug it into the dongle and then you plug this into your iPad using USB-C. I'm definitely glad that they did decide to use USB-C on this iPad because that does allow you to transfer data faster. But the downside is this is what you're gonna have to do. Which is why I'm a really big fan of the Apple Pencil 2 because it does have gesture control and now you can actually change inside of the settings what you want those gesture actions to be. So it definitely makes things a lot more smooth when you are doing different tasks. It is also a nice added benefit that this is a matte pencil. It's not super shiny like the Apple Pencil 1. I also like that it has a flat edge which is where you magnetically connect and charge. But I feel like that kind of helps me orientate my pencil and draw a little bit easier. So I definitely do prefer the Apple Pencil 2. Now as you can see, I do have this on the Magic Keyboard and this is an added accessory. And it is pretty expensive, but it does kinda change the way that you use your iPad. Now one of the things that is new in the other iPad that I just showed you is this has the new Smart Keyboard Folio. And what I actually really like about the Smart Keyboard Folio is how this folds down. It gives you a much more firm placement of the display. Whereas this one, yes, you can do this. It's free floating. It looks really cool. But when you are drawing or something, it has a little bit of bounce. But this on the other hand... Look at that. Nice Touch ID. You know what doesn't have Touch ID? iPad Pro. I know. See, look at this. Like I feel so much better about like pressing into this display. So I feel like this is a really great example of kind of what the route is that they're gonna go I think for the next keyboard because this is perfect. Like I can actually draw like this, no problem at all. It works but you can't be as precise. The other upside to the Pros is it does have a ProMotion display. It also supports extreme HDR. So you really can see the difference when you are actually editing or watching content. And especially, the ProMotion, when you're sliding through, it's so much smoother. I also really like that you can connect any controller to this, Xbox, PlayStation, Nintendo Switch, and actually be able to play games. Though this iPad will be really great for gaming, you can definitely take advantage of the increased performance with the M2 chip, and, of course, the extreme dynamic range that this iPad delivers. So you will get about the same battery life. You get about 10 hours and this is connected to the Magic Keyboard. I know I've talked so much about this, but I really, really love it. So this does have the pass through USBC charging which will free up this other port. I love being able to connect one of my external Thunderbolt drives to this and be able to get all of my files. I can start doing rough edits in LumaFusion. So the starting price for these iPads. The 11-inch is $799 and the 12.9-inch is actually $1099. Now you can choose between Wi-Fi or cellular and you can get them in two colors, the silver and the graphite. As for storage capacity, you can configure this from 128 all the way up to two terabytes. This is the one terabyte version. and my M1 iPad was also a one terabyte and I still haven't actually filled that entirely up. But I was using it for a lot of file storage. So if you are actually gonna be editing and storing files on here I definitely would recommend getting something at least in the 512 range if you are gonna be actually wanting to put files on here because these things fill up very, very quickly. So that was just a first look at the new M2 iPad Pro. Definitely very excited about this. Now it really isn't that huge of an upgrade from the M1. But this will definitely give you a boost in performance and especially if you don't already have an M1, this can be a huge upgrade for a lot of people. Well thank you guys so much for watching. I would love to hear from you in the comments below. Is there anything else that you would like me to test out here with the new iPad Pro? If you haven't already, please like this video, leave me some comments, and be sure to hit the subscribe button. And don't forget to hit the bell as well so you be notified when I post new videos. And with that my friends, I will see you in the next video. And if you haven't seen it already, be sure to check out my unboxing of all of the iPads and also an overview of the new colored iPads that just came out. I'll see you as the next one. Bye! (upbeat music)",
    "transcript_keywords": [
        "Apple Pencil",
        "iPad",
        "iPad Pro",
        "Pro",
        "Apple",
        "Pencil",
        "Justine and today",
        "super",
        "Apple Pencil Hover",
        "great",
        "Photoshop",
        "Adobe Fresco",
        "iPads",
        "kind",
        "keyboard",
        "Justine",
        "thing",
        "USBC",
        "apps",
        "Stage Manager"
    ],
    "transcript_entity_values": [
        "10-hour",
        "iOS 16",
        "one",
        "USB-C",
        "K ProRes",
        "the Smart Keyboard Folio",
        "11-inch",
        "Shaper 3D",
        "Bionic",
        "CPU",
        "LumaFusion",
        "UI",
        "Nice Touch ID",
        "100%",
        "Adobe Fresco",
        "16",
        "Midnights",
        "Procreate",
        "a ton",
        "the iPad Pro",
        "Xbox",
        "M2 iPad Pro",
        "Photoshop",
        "6",
        "Apple Pencil",
        "Apple Fitness",
        "50%",
        "Wi-Fi",
        "iPad Pro",
        "first",
        "Mac",
        "1",
        "512",
        "earlier this year",
        "iPad",
        "2",
        "up to two terabytes",
        "Mac",
        "4",
        "USBC",
        "M1",
        "the Magic Keyboard",
        "Smart Keyboard Folio",
        "1099",
        "10 megapixel",
        "Thunderbolt",
        "today",
        "day one",
        "ProMotion",
        "M1 iPad",
        "15%",
        "PlayStation",
        "USB 4",
        "iPads",
        "12.9-inch",
        "1600",
        "799",
        "Taylor Swift",
        "Thunderbolt 3",
        "M2",
        "35%",
        "Justine",
        "Cupertino",
        "the Apple Pencil",
        "Nintendo Switch",
        "12 megapixel",
        "one terabyte",
        "this year",
        "DaVinci",
        "My AirPods Pro",
        "128",
        "17%",
        "10",
        "the Magic Keyboard",
        "55%",
        "Apple Music",
        "USB-C.",
        "Thunderbolt",
        "Pros",
        "Apple",
        "about 10 hours",
        "M2 iPad",
        "iPad Pro",
        "iPads",
        "four",
        "Lightroom",
        "Liquid Retina XDR",
        "two",
        "Redmond",
        "One"
    ],
    "transcript_entity_types": [
        "TIME",
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "CARDINAL"
    ],
    "vector": [
        -0.04198304936289787,
        -0.08958858996629715,
        -0.0810713991522789,
        -0.1313163787126541,
        0.045954007655382156,
        0.017934633418917656,
        0.03543927147984505,
        0.03288411721587181,
        -0.030734460800886154,
        0.09481349587440491,
        0.06881986558437347,
        0.0052815210074186325,
        -0.04648502916097641,
        -0.0042312112636864185,
        0.02460772730410099,
        0.09461257606744766,
        0.04302606359124184,
        -0.019440513104200363,
        0.0002066201705019921,
        0.038312267512083054,
        -0.03412992134690285,
        -0.05363531783223152,
        0.06975017488002777,
        -0.007983138784766197,
        -0.0380210280418396,
        0.060534652322530746,
        0.03453896939754486,
        0.07591037452220917,
        -0.07556125521659851,
        -0.04730542376637459,
        -0.020476099103689194,
        0.01685102842748165,
        0.08820648491382599,
        0.03316528722643852,
        -0.004630708135664463,
        -0.06424343585968018,
        0.04143267497420311,
        -0.02249903418123722,
        -0.04541850835084915,
        -0.06164749339222908,
        0.010445266030728817,
        -0.04546988010406494,
        0.002225173870101571,
        -0.0522204264998436,
        -0.03245126083493233,
        -0.03804635629057884,
        -0.019389018416404724,
        -0.05148113891482353,
        0.05310671404004097,
        0.03943413496017456,
        -0.06735517829656601,
        -0.035531092435121536,
        0.004144027829170227,
        -0.0010155580239370465,
        -0.08618026971817017,
        -0.01837705262005329,
        -0.0817827507853508,
        0.029475608840584755,
        0.06713186204433441,
        -0.04348090663552284,
        0.018637288361787796,
        -0.03927634656429291,
        0.04428279399871826,
        0.05394027382135391,
        -0.02048921212553978,
        -0.04822955280542374,
        0.030336543917655945,
        0.009817634709179401,
        -0.00569662731140852,
        -0.004951808135956526,
        -0.11707346886396408,
        0.037318237125873566,
        -0.011096784844994545,
        0.0251883827149868,
        -0.04571728780865669,
        0.0787435844540596,
        0.0033370580058544874,
        -0.02710700035095215,
        -0.00566396489739418,
        0.0482303649187088,
        0.05150848254561424,
        -0.000955602212343365,
        -0.05063972622156143,
        -0.0050593349151313305,
        0.030409405007958412,
        0.025326140224933624,
        -0.0015004887245595455,
        0.01660773903131485,
        -0.04441662132740021,
        -0.05057250335812569,
        -0.054929960519075394,
        -0.0031524389050900936,
        -0.022978421300649643,
        0.02958904579281807,
        -0.01133093610405922,
        -0.033617693930864334,
        -0.004450945183634758,
        -0.06441295892000198,
        -0.06259661912918091,
        0.06503036618232727,
        0.033404357731342316,
        -0.016427239403128624,
        -0.009468973614275455,
        -0.046255964785814285,
        -0.03359534963965416,
        -0.08257460594177246,
        -0.02723630517721176,
        0.02620653435587883,
        0.0383744090795517,
        0.035410962998867035,
        0.006306940224021673,
        0.02721993625164032,
        -0.06780751794576645,
        -0.058780938386917114,
        0.05553233623504639,
        0.08981458097696304,
        -0.04004662483930588,
        0.07118092477321625,
        0.043620359152555466,
        0.03325016424059868,
        -0.053963519632816315,
        -0.045273859053850174,
        -0.036938004195690155,
        -0.016479406505823135,
        -0.03181879222393036,
        0.06751857697963715,
        -0.04815265163779259,
        1.3922931249331436e-32,
        -0.024138586595654488,
        0.0985618457198143,
        -0.01334363967180252,
        0.03791274502873421,
        0.00793748814612627,
        -0.07204020768404007,
        -0.005237286444753408,
        0.12528447806835175,
        0.005378729198127985,
        -0.0034252379555255175,
        -0.013962755911052227,
        -0.0049128783866763115,
        -0.07321268320083618,
        -0.001715177553705871,
        0.01362010557204485,
        -0.0783684179186821,
        0.013896032236516476,
        -0.055830374360084534,
        -0.03128994256258011,
        0.018794288858771324,
        -0.0077087837271392345,
        -0.04713774099946022,
        0.021566126495599747,
        0.05856466665863991,
        0.09475691616535187,
        0.09596067667007446,
        0.07786707580089569,
        0.026217466220259666,
        0.08308753371238708,
        0.012498706579208374,
        -0.07416447252035141,
        -0.051168330013751984,
        -0.03859792277216911,
        -0.12912242114543915,
        -0.01794404163956642,
        -0.034212179481983185,
        -0.06323570013046265,
        -0.023470353335142136,
        -0.015778042376041412,
        -0.06951967626810074,
        -0.06830094754695892,
        0.0033542325254529715,
        -0.07844828814268112,
        -0.038993362337350845,
        0.06744356453418732,
        0.043605539947748184,
        0.03706863150000572,
        0.0886344388127327,
        -0.01298658736050129,
        0.004450824111700058,
        -0.05281272530555725,
        -0.024689514189958572,
        -0.05979328975081444,
        -0.016937395557761192,
        -0.026017962023615837,
        -0.07504786550998688,
        -0.04275121912360191,
        0.046724461019039154,
        0.04564874619245529,
        0.028640886768698692,
        0.014743277803063393,
        -0.029819179326295853,
        -0.015232814475893974,
        -0.019616061821579933,
        -0.06990115344524384,
        0.10550422221422195,
        0.032930538058280945,
        -0.038311395794153214,
        0.03358687832951546,
        0.014982333406805992,
        0.016725024208426476,
        0.01656951569020748,
        0.07209751754999161,
        0.004835650324821472,
        0.023730916902422905,
        0.061125919222831726,
        -0.0629582479596138,
        -0.04012010991573334,
        0.003109900513663888,
        -0.035530924797058105,
        -0.09387168288230896,
        0.08826160430908203,
        -0.012463981285691261,
        0.10453137755393982,
        -0.06462295353412628,
        -0.06339509040117264,
        0.05229715257883072,
        -0.05785898491740227,
        -0.0277663916349411,
        0.009984631091356277,
        0.023171409964561462,
        0.07610224932432175,
        -0.06211800500750542,
        -0.03878052160143852,
        -0.025277167558670044,
        -1.2631890211927134e-32,
        0.04794827103614807,
        0.06969557702541351,
        -0.030685437843203545,
        -0.04162320867180824,
        0.018758561462163925,
        -0.05379330366849899,
        0.04074745252728462,
        0.09374576061964035,
        0.04681207239627838,
        -0.07350368797779083,
        0.06434645503759384,
        -0.08250164985656738,
        -0.07630901783704758,
        -0.014037180691957474,
        -0.03581296280026436,
        -0.026075100526213646,
        -0.08333879709243774,
        -0.05284922569990158,
        0.1183997094631195,
        -0.03437642753124237,
        0.12574607133865356,
        0.14255866408348083,
        0.12641696631908417,
        0.01120111346244812,
        0.02017786353826523,
        0.008859112858772278,
        0.034403979778289795,
        0.041726693511009216,
        0.05290568619966507,
        0.029901603236794472,
        0.06557364761829376,
        -0.05069506913423538,
        -0.031213779002428055,
        -0.001382275833748281,
        0.0322808176279068,
        0.029661986976861954,
        0.05671890825033188,
        0.03258032724261284,
        0.011394447647035122,
        -0.05781708285212517,
        0.06758736073970795,
        -0.005034767556935549,
        -0.009655613452196121,
        -0.05367399379611015,
        -0.005644741468131542,
        -0.09189002960920334,
        -0.013905570842325687,
        0.051688045263290405,
        0.038006819784641266,
        -0.04854416102170944,
        -0.08152938634157181,
        -0.0019431763794273138,
        -0.05629563704133034,
        -0.028058290481567383,
        -0.02661174349486828,
        -0.009747521951794624,
        -0.057463519275188446,
        -0.04200300574302673,
        -0.00012115910067223012,
        -0.004797045607119799,
        0.03158685192465782,
        -0.04484192281961441,
        -0.06902771443128586,
        -0.07520791888237,
        0.012669768184423447,
        -0.013749693520367146,
        0.07377805560827255,
        0.012179838493466377,
        0.030249031260609627,
        0.02998899295926094,
        -0.0340360589325428,
        0.011578680016100407,
        0.05397656559944153,
        -0.009687504731118679,
        0.05747662112116814,
        0.029002811759710312,
        -0.05073070526123047,
        -0.03483188897371292,
        0.07948939502239227,
        -0.07592107355594635,
        -0.04992423206567764,
        -0.013794408179819584,
        0.008632850833237171,
        0.07744930684566498,
        0.07219124585390091,
        0.07350873202085495,
        0.09185830503702164,
        -0.04751991108059883,
        -0.0410505011677742,
        0.07179893553256989,
        0.015791932120919228,
        0.04247052222490311,
        0.03776886686682701,
        0.10725995153188705,
        -0.08625089377164841,
        -6.485791459454049e-08,
        0.012932552956044674,
        0.048858314752578735,
        -0.008640353567898273,
        -0.004531742539256811,
        0.03634685277938843,
        -0.10193751752376556,
        -0.04467936232686043,
        0.02163475751876831,
        0.11117914319038391,
        -0.0615888312458992,
        0.04690902680158615,
        -0.0330829881131649,
        -0.030600467696785927,
        0.10828518122434616,
        0.028777629137039185,
        0.008235248737037182,
        -0.09161117672920227,
        0.07209493219852448,
        -0.029767226427793503,
        -0.07212267071008682,
        0.004537974018603563,
        0.029891362413764,
        0.005181236658245325,
        -0.03221045807003975,
        0.03734074532985687,
        -0.00329857156611979,
        -0.04212454706430435,
        -0.007574474439024925,
        0.01054499763995409,
        0.04133244976401329,
        -0.08728886395692825,
        0.012560774572193623,
        0.036430347710847855,
        -0.017736775800585747,
        -0.018937764689326286,
        -0.039852242916822433,
        -0.054090358316898346,
        -0.011890415102243423,
        0.018038131296634674,
        -0.006766061298549175,
        0.005629152059555054,
        -0.14082926511764526,
        -0.045603785663843155,
        -0.0019430873217061162,
        0.018837209790945053,
        -0.04086547717452049,
        0.03688212111592293,
        -0.06847243010997772,
        -0.04304397851228714,
        0.0028508109971880913,
        -0.004472064785659313,
        0.041508451104164124,
        0.07716130465269089,
        -0.009338220581412315,
        0.05158167704939842,
        0.002409572247415781,
        0.04440918192267418,
        0.044663261622190475,
        -0.0029406610410660505,
        -0.0027636524755507708,
        0.08202312141656876,
        0.0008942690910771489,
        -0.03606089577078819,
        0.04405944049358368
    ]
}