{
    "id": "Q_xM7sVFb8g",
    "title": "How to dye Easter Eggs!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-04-20T16:45:54Z",
    "video_url": "https://www.youtube.com/watch?v=Q_xM7sVFb8g",
    "category": "Science & Technology",
    "tags": [
        "Easter egg dying",
        "how to dye easter eggs",
        "dying easter eggs",
        "easter 2019",
        "jenna",
        "ijustine",
        "ijustine cooking"
    ],
    "views": 155941,
    "likes": 4517,
    "comments_count": 506,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and this is my sister, Jenna. - Hello! - And today, we are prepping for Easter. So we're gonna do all of the Easter prep work for you, so you don't have to. - Well, they can do it too, if they want. - You don't wanna do this. - Oh, yeah. - You don't wanna do this because I ordered all kinds of, okay, looks like I've got a couple of-- - [Jenna] Duplicates. - Looks like I have four of the same ones. (laughs) Okay, I think I made a mistake. - You can win $1000. - (inhales) Well, I probably-- - Oh, gosh. - How'd I order four of these, is the question. I'm not really sure, I ordered a bunch of these, apparently I ordered duplicates. We have a Shimmering Pearl. - I used that before. - Egg, Neon Molten Magic, Marble egg, - Wow. - Candy Apple egg. Oh, we also have this. - You spin on it. - You spin, spin an egg. Also got some little Easter lights. - And - Oh. - I got an Easter Lego set, look at this. - Did you wanna hang these up before? - Yeah, open 'em up. The best part about this Lego set, look at this little guy. He is searching for Easter eggs, he's got a magnifying glass. This is the coolest thing I've ever seen. - You should get out more. - You're mean. - This is me as a person, I can't help it. - You're mean. - Imagine existing in this. - You know I don't get out a lot, so that's like diggin' deep. That's like jab, jab. - No. - Jab. - No. - Jab, jab, jab. - Stop it. - Alright, what should we test first? - Oh, I don't-- - We should probably get the cla, what do we need? Okay, we need cups. So tablets. - [Jenna] Yes. - Oh no. - What? - We need vinegar? - You have vinegar, you might not have vinegar. Can you fit an egg in here? - Yes, but what, I don't have vinegar. - Yes, you do. - Do I have vinegar? I have vinegar, white vinegar? - What kind of vinegar? - [Justine] Distilled. - I'm holding a thing of vinegar, apple cider though. - Wait, I have some. Let's test each one of these. This is gonna be the marble one. Is that a tablespoon? Do you think that's a tablespoon? - Generous. - Okay. - Whoa, science. This is content. - Yeah, okay so what do we do with this one? Look at that. - Ooh! - 24 karat gold egg glaze. - We should just do those. How can I help? - Okay this came out of here. So this is-- - Dazzlin' color, color brilliant, colorant brilliant. - This one we can't just paint them. So let's put this here, so this is our classic color. - Do you need this still? I'm gonna move it over here. - Yeah, but I need it, put it in here. - Well you're putting it in a very. - Okay, put it in there. Okay. Okay. - Oops, ooh wow, wow! - Yeah, that's pretty, that's pretty, that's pretty. - [Jenna] You're pretty. - You're pretty. - I'm going to put my egg in the machine. - What are you doin' over there? - I'm spinning an egg, okay. Where's my packet? Shh, what color do we want? Green, purple, yes. Eight to 10 drops. Oh, aw, that was. - That's half the package. - That's all I got. (laughs) Okay, place top on spinner. Pump the top and watch the eggs spin. Who's ready for fun? This is thrashing the egg around. We can get real wild and add more color. Ooh, ya, ya. It doesn't say that on the packet though, I'm adding my own creative-- - Spins. Oh my God, you're so funny. - Oh my God, humor. - This is science, pink, I don't, I'm thinking that like-- - What are you doing? (both laugh) Have you made any eggs yet? - No, I'm still trying to open all these packets. - So I'm now adding a pink to my mixture. There's so much going on. - So I think that I could probably use all these same colors, because all of these are the same. - That's fine, you can do what ever you want. - We just have a lot of little added extras. - Uh oh. We're fine. - You're in trouble. - Everything. This is your, you did this to me. Okay here we go, we added two colors, everyone. - How much do I put in there? (eggs rumbling) - This is like the weirdest. - Do I just put the egg in there now? - Wait, you're supposed to use the-- - Did I-- - The machine the stick. - [Justine] Have I done it? - [Jenna] Use the stick. - Have I done it? This looks like paint. I thought that this was gonna work out. - How old are we? - This is, this is extra ordinary. - It's trapped. - Now we gotta like dye the egg and stuff. - Oh, wow. It's beautiful! Put this on. (mumbles) - Okay? - A gem. That has a very bad smell. (laughs) (Justine sniffing) (Justine coughing) I don't like the smell of that. I realize that there's not, I'm not even, am I even-- - [Both] Whoa! - What do I do with this? - Oh, I need another dry egg. - When I told you guys that I was gonna be reviewing these, I think that you should probably not expect any sort of review, and you should not listen to anything that I say. - Well I'm doing a very good job at this egg spinner review. I'm gonna add another color, I'm gonna add yellow. Have you made an egg yet? - No! - I mean, it's like Easter 2020 at this point. - Oh my gosh! - Here we go. Hookin' 'em up. This is exactly what I thought I'd be doing today. - Whoa, egg just slipped. - Oh my gosh! - So I think I'm just gonna paint one gold and see what happens. - This is a gem of an art work, look at this Just. - Oh, that is nice. Okay, I'm gonna paint this gold. So, I was thinking that this would be a little bit more eggciting. - Should I check to see if there's a murderer here or like? - Maybe. - Oh! Our batteries. - Oh my God, yeah, you're right, wow that was fast. What did we need that for again? - The lights. Very important part of this. - Put 'em up, hang 'em up. - Oh my gosh, this is gorgeous. - Where's that glitter at? Alright, so the Marble egg. - I don't think it's gonna work out very well. Here, get that side. - I think it looks lovely. - Alright, there's still no eggs that are made. - Have we made an egg, I've made one egg. - What do I do with this? - Look at this egg. - This is like clay. - You keep it in there and you wet it. Do I have scissors? - Oh my God, are you kidding me? I'm leaving, I'm going home. - It's like water color. I think you're-- (both laugh) Oh no, I made a mess! - Water color, it actually is rejecting water. - Wait a minute. - What's happening? - (laughing) I've got all of my colors mixed up. Place the colored wax square on the egg. Place egg. - So it is a wax. - It is a wax. - I was like it's repelling. - Oh my God, we need a hair dryer. Turn a hair dryer on low, point warm air-- (laughs) - Oh, let's use fire. - No. - I'm so lazy to walk up the stairs to get a hair dryer. So I'm using my brain, little small brain. This is gonna work. - Okay, so I didn't read past what you're supposed to do after the hair dryer bit. - Oh. - Oh my God, that looks incredible. (Jenna laughing) That looks really good. - Hold on, don't make me laugh I'm gonna burn myself. - Sorry. - So children, don't do this. What if the wax burns me? - [Both] Oh! - [Justine] Is it hot? - I don't know, I got scared. - Are you crisp, are you okay? - I got scared. - Oh my God, are you alright? - I got so scared. I don't think this is the best way to dye eggs. - These have been in here for an hour, an hour. I don't even know what's gonna happen. - It's probably hatched. - They probably have hatched. What is this? - [Jenna] Oh, so that's dry. - Oh, this is my marbled egg. Okay, that's absolutely not even marbled anymore because it's been in here for so long. Wow. - Do we have any more paint brushes? What's this is this a? - This looks good. - I was painting this one pink but do we have any more paint brushes? - Okay. - Do we have any more paint, what's this? (groans) I'm really upset. - [Justine] You need to simmer down. - I bet this is exactly how it went down as children when we were doing this. - Probably. (laughs) - Just screaming at each other, that's my egg. - That's my egg, give me my egg. - Actually we probably got along 'cause we were probably really nice. - Well, I don't-- - Now we've really come into our bodies and our personality. - Hmm. - Okay, so. - This is stupid. Who thought this was a good idea? Oh here we go, oh, that's hot. Oh, that's hot! Oh my God ,it's burning my fingers. - Well yeah. Where'd my egg go? - Why would anybody, this is so. Is it working? Oh yeah, oh yeah. Oh yeah! Look! - I see. - Oh my God, it's burning me! Ow, ow! Ow, son of a egg biscuit. Ow! (laughs) I think the fire might've been better than this hair dryer. Okay kids, use fire. - Don't use the fire. - Should I set it down? Ow, freaking dumb. Now there's wax everywhere. Ah, ow! (laughs) Oh God, I'm blowing things everywhere! There's so many colors on this egg. - [Jenna] That smells. - This is so stupid. I'm so upset right now. Ow, it's getting all over everything! - Well was it worth it? - I don't think it was. Look at this, how bad this is. - [Jenna] What does this go to? - Oh my God, it stinks, it smells like a crayon. So I guess I'm gonna paint this gold. - So what do I do with this? Oh, that's, yeah, yeah, yeah, I'd like to use that please. - Okay. Here you go. - Oh, thanks. - I think that this went terribly. - Where should I put this? - I don't know, I think you should put it in the trash. - Trash can. - This is a disaster. - Can we pick our favorite? - Yeah, I think this is my favorite. - This one's my favorite. - Oh, but look at that side. I don't think we made a single egg that looks good. - Is there a silver I could like, no I don't wanna ruin it. - The silver, I put inside of one of them. - Why would you do that? - How do you get all the sides to look good? - How'd you get that silver? Well you put them like you. - Where did you gey these at? - They're over here. - Oh heavens, look. (both laughing) - Oh heavens, look at that. - Well guys, I hope that-- - I'm sorry. - This helps you a little bit, I don't think that it did. (both laughing) I am gonna leave you now. Just delete this video, don't delete my channel. - [Jenna] I don't like it. - I don't like it. - The best thing about this video it that it's over. (both laughing) - Bye. (soothing instrumental music)",
    "transcript_keywords": [
        "Egg",
        "God",
        "yeah",
        "put",
        "Easter",
        "vinegar",
        "color",
        "eggs",
        "made",
        "paint",
        "jab",
        "Jenna",
        "Justine",
        "Marble egg",
        "Wow",
        "Easter eggs",
        "good",
        "colors",
        "pretty",
        "work"
    ],
    "transcript_entity_values": [
        "a minute",
        "one",
        "an hour",
        "1000",
        "Justine",
        "Ow",
        "Lego",
        "four",
        "Easter Lego",
        "half",
        "Shh",
        "Hookin",
        "today",
        "two",
        "Eight to 10",
        "Justine] Distilled",
        "Easter",
        "Easter",
        "Easter",
        "first",
        "Jenna",
        "Green"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "TIME",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "GPE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.02548663690686226,
        -0.07173290103673935,
        -0.025112692266702652,
        -0.13406838476657867,
        0.05075354129076004,
        0.05066357180476189,
        0.09662406891584396,
        0.03726720064878464,
        -0.006581776309758425,
        0.011980807408690453,
        -0.006502471398562193,
        0.006017371080815792,
        -0.0027896538376808167,
        -0.003110960591584444,
        0.007090254686772823,
        0.0778358057141304,
        -0.03592703491449356,
        -0.019625220447778702,
        -0.050573308020830154,
        -0.02972988411784172,
        -0.037177108228206635,
        -0.10226301848888397,
        0.01925724186003208,
        -0.012734628282487392,
        -0.03621763736009598,
        0.07149162888526917,
        0.045062292367219925,
        0.03249215707182884,
        -0.07674150168895721,
        -0.07613226771354675,
        0.010695335455238819,
        2.9943827030365355e-05,
        0.13482102751731873,
        -0.04233839735388756,
        -0.0005055519286543131,
        -0.06341385841369629,
        0.02532043866813183,
        0.023350650444626808,
        -0.030078759416937828,
        0.010533632710576057,
        0.05817752704024315,
        -0.04588447883725166,
        -0.024032559245824814,
        -0.04533109441399574,
        -0.024087578058242798,
        -0.10887002944946289,
        0.05251974239945412,
        -0.038126882165670395,
        0.051323261111974716,
        0.06562235206365585,
        -0.05751553922891617,
        -0.046675000339746475,
        0.015088667161762714,
        0.027860090136528015,
        -0.08476129919290543,
        0.05513183772563934,
        -0.07110939174890518,
        -0.027061734348535538,
        0.050940413028001785,
        -0.09896520525217056,
        -0.029184363782405853,
        -0.052368439733982086,
        0.017718147486448288,
        0.030762527137994766,
        -0.0599023662507534,
        -0.05708104372024536,
        0.016791708767414093,
        0.03331136703491211,
        0.021114295348525047,
        -0.0197888296097517,
        -0.10268741101026535,
        0.07011894881725311,
        -0.024373037740588188,
        0.062431108206510544,
        -0.008832679130136967,
        0.11152016371488571,
        0.06366627663373947,
        -0.04140700772404671,
        -0.025904225185513496,
        0.03594798594713211,
        0.005191742908209562,
        -0.05528200790286064,
        -0.037716519087553024,
        0.024418124929070473,
        0.030606379732489586,
        0.08791554719209671,
        0.04226445406675339,
        0.01971527375280857,
        -0.062496550381183624,
        -0.07307729125022888,
        -0.061261046677827835,
        0.009390664286911488,
        0.0034212530590593815,
        -0.04035118222236633,
        0.006712668109685183,
        -0.01939968578517437,
        0.0043437848798930645,
        -0.0818140059709549,
        -0.020517555996775627,
        0.07657714188098907,
        0.04009198769927025,
        -0.11394437402486801,
        0.02382075972855091,
        -0.08155498653650284,
        -0.03204604983329773,
        -0.1042957752943039,
        -0.046554744243621826,
        0.04793880879878998,
        0.02615976519882679,
        -0.035761188715696335,
        -0.03796214610338211,
        -0.015712283551692963,
        -0.01771315187215805,
        -0.06851354241371155,
        -0.0008495718939229846,
        0.08245884627103806,
        -0.03650128096342087,
        0.05661445111036301,
        0.04174541309475899,
        0.04016966000199318,
        0.030355369672179222,
        -0.08485507220029831,
        -0.06118306890130043,
        0.025644732639193535,
        -0.018097659572958946,
        0.012024693191051483,
        -0.05347643420100212,
        1.326638532830254e-32,
        0.001663808710873127,
        0.09302830696105957,
        0.009857558645308018,
        0.07028651982545853,
        0.008941909298300743,
        0.01914896070957184,
        -0.022461775690317154,
        0.042353276163339615,
        -0.05258812755346298,
        -0.008544176816940308,
        0.06904342770576477,
        0.03828538954257965,
        -0.061201468110084534,
        0.06458603590726852,
        -0.014833858236670494,
        -0.03209070861339569,
        0.005180830601602793,
        -0.055667441338300705,
        -0.07133055478334427,
        -0.007509203627705574,
        -0.031291767954826355,
        -0.021723391488194466,
        0.002595524536445737,
        0.04524306207895279,
        0.10557688027620316,
        0.08137252181768417,
        0.05295765399932861,
        0.0017212220700457692,
        0.07570650428533554,
        -0.006434489041566849,
        0.027614200487732887,
        -0.030041741207242012,
        0.015006466768682003,
        -0.04904309660196304,
        -0.05269356444478035,
        0.016656693071126938,
        -0.06750952452421188,
        -0.025388656184077263,
        0.007210087962448597,
        0.020397750660777092,
        -0.012725301086902618,
        0.013052167370915413,
        -0.0577496774494648,
        0.007482821587473154,
        0.08467484265565872,
        0.053966224193573,
        0.04077779874205589,
        0.06328323483467102,
        -0.025488093495368958,
        0.03956855461001396,
        0.001471647177822888,
        0.02056736871600151,
        -0.04514772817492485,
        -0.02987251989543438,
        -0.022550368681550026,
        -0.04075046628713608,
        -0.012212816625833511,
        -0.01603684388101101,
        0.06954503804445267,
        0.021387379616498947,
        -0.014472340233623981,
        0.01860395073890686,
        -0.014247185550630093,
        -0.021013906225562096,
        -0.05702419579029083,
        0.06698185205459595,
        0.09073511511087418,
        -0.04983169585466385,
        0.016355594620108604,
        0.017817841842770576,
        0.004291675053536892,
        -0.02544691227376461,
        0.04269542172551155,
        0.031208261847496033,
        -0.0032344930805265903,
        0.0357109010219574,
        -0.053651727735996246,
        -0.07669880241155624,
        0.048403192311525345,
        -0.062286701053380966,
        -0.11401230841875076,
        0.060422495007514954,
        -0.051150403916835785,
        0.048767488449811935,
        -0.0292519424110651,
        -0.09191668033599854,
        -0.0018509968649595976,
        -0.02087152749300003,
        -0.04885813966393471,
        0.0038247667253017426,
        0.01026909053325653,
        0.08930069953203201,
        -0.09834080189466476,
        -0.06380157172679901,
        -0.02375982515513897,
        -1.2490019798726392e-32,
        0.027012810111045837,
        0.022714320570230484,
        -0.0628182515501976,
        0.03251289576292038,
        0.07044009864330292,
        -0.02529197372496128,
        0.10539232194423676,
        0.06840723752975464,
        0.07967336475849152,
        -0.06713606417179108,
        0.03498818725347519,
        0.0008774829329922795,
        -0.12483727931976318,
        0.013871118426322937,
        -0.04540852829813957,
        -0.01789763942360878,
        -0.0013944186503067613,
        0.059553079307079315,
        0.09349247813224792,
        -0.04039674252271652,
        0.0056641558185219765,
        0.12360699474811554,
        0.08320019394159317,
        0.023547179996967316,
        -0.009343813173472881,
        0.029143640771508217,
        0.046519242227077484,
        0.060991086065769196,
        0.0786745548248291,
        0.06634434312582016,
        -0.05609847232699394,
        -0.03767095506191254,
        0.014863846823573112,
        -0.013018888421356678,
        0.011933335103094578,
        0.015974415466189384,
        0.07454270869493484,
        -0.0022051476407796144,
        0.013648118823766708,
        -0.034744951874017715,
        0.017971398308873177,
        -0.03816654160618782,
        0.006636955309659243,
        -0.052548278123140335,
        -0.06552664935588837,
        -0.08459439873695374,
        -0.04843192920088768,
        0.03155927732586861,
        0.0074411178939044476,
        0.01653210259974003,
        -0.05216987803578377,
        -0.05232904478907585,
        -0.0394146665930748,
        -0.010172856971621513,
        -0.006399076897650957,
        -0.02176569774746895,
        -0.03393307328224182,
        -0.020289352163672447,
        0.020816776901483536,
        0.05967837572097778,
        -0.024616418406367302,
        -0.04034304991364479,
        -0.02203756757080555,
        -0.049120109528303146,
        -0.02871091477572918,
        -0.05364363268017769,
        0.09182409197092056,
        0.012022025883197784,
        -0.014186372980475426,
        -0.03307194635272026,
        0.01350968424230814,
        0.04121454432606697,
        0.06689396500587463,
        -0.0009868951747193933,
        0.019975557923316956,
        -0.05153167247772217,
        -0.07473491132259369,
        0.030280426144599915,
        0.0794229805469513,
        -0.06793975830078125,
        -0.05706137791275978,
        -0.01397540420293808,
        0.01151419896632433,
        0.06419859826564789,
        0.07352101057767868,
        0.1060868576169014,
        0.07905874401330948,
        0.00468707038089633,
        -0.032588232308626175,
        0.03165857121348381,
        0.032883305102586746,
        0.10142698884010315,
        0.09493843466043472,
        0.11894026398658752,
        -0.06518816202878952,
        -6.451296741261103e-08,
        0.06650979816913605,
        -0.0014655229169875383,
        0.027654290199279785,
        0.004611361771821976,
        0.03681490197777748,
        -0.05925225093960762,
        -0.005203103180974722,
        -0.021381990984082222,
        0.06023257225751877,
        -0.05767674371600151,
        0.04135691747069359,
        -0.0012506474740803242,
        -0.016050614416599274,
        0.06803349405527115,
        0.044690314680337906,
        0.05464939773082733,
        -0.06470619887113571,
        0.04628022387623787,
        -0.06424732506275177,
        -0.051520995795726776,
        -0.06476611644029617,
        0.1386321783065796,
        -0.01862005889415741,
        -0.016960028558969498,
        0.05043759196996689,
        0.026129068806767464,
        0.042429789900779724,
        -0.007296771742403507,
        0.017819050699472427,
        0.02160538174211979,
        -0.060251664370298386,
        -0.0066002109088003635,
        -0.019164729863405228,
        -0.05589267238974571,
        -0.05756448209285736,
        -0.07823029160499573,
        -0.08169922977685928,
        -0.026219820603728294,
        0.020743241533637047,
        -5.912931737839244e-05,
        -0.0074428073130548,
        -0.09563297778367996,
        -0.056313227862119675,
        -0.03155044466257095,
        0.022977754473686218,
        -0.08485999703407288,
        0.029544368386268616,
        -0.09335483610630035,
        -0.09920178353786469,
        -0.024118317291140556,
        -0.04197190701961517,
        0.0100892698392272,
        0.04930013790726662,
        -0.02132371813058853,
        0.015076322481036186,
        -0.034844379872083664,
        0.02255440317094326,
        0.11037185788154602,
        -0.009887889958918095,
        0.010648134164512157,
        0.017468078061938286,
        -0.0012098659062758088,
        -0.001430323114618659,
        0.004125651903450489
    ]
}