{
    "id": "QBNP5I2y668",
    "title": "$12 Hack To Boost Your Laptop Performance!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-03-03T00:07:55Z",
    "video_url": "https://www.youtube.com/watch?v=QBNP5I2y668",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Repasting",
        "XPS 9560",
        "Thermal",
        "Boost",
        "Performance",
        "CPU",
        "Laptop CPU",
        "How to fix Laptop",
        "Laptop broken",
        "Laptop Slow",
        "Repair"
    ],
    "views": 3596963,
    "likes": 85713,
    "comments_count": 4274,
    "description": "These tweaks can give gaming laptops some serious performance gains. Good luck! Arctic Silver 5 -  AS5 + Cleaning Kit -  Thermal Pads -   Intel XTU -  Throttlestop -  Prime95 -   Music Credits: Intro: Matanoll - Clearness (Robotaki Remix) Background: Fili - Closure  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2mjW9B0",
        "http://amzn.to/2lFdNvA",
        "http://amzn.to/2lkczd4",
        "https://downloadcenter.intel.com/download/24075/Intel-Extreme-Tuning-Utility-Intel-XTU-",
        "https://www.techpowerup.com/download/techpowerup-throttlestop/",
        "https://www.mersenne.org/download/",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey how is it going? Dave2D here. So, I need to preface this video with a pretty big disclaimer. Everything I talk about in this video, you kind of do it at your own discretion, because opening up your computer, fiddling with stuff, playing with software that affects like under-volting and bios and stuff like that, you kind of do it at your own risk, because there's always an element of risk to it, right? I think it's safe, I've created this video, I've experimented with it extensively, but it is at YOUR own risk. Ok, this video is about two powerful tweaks that can greatly improve the performance of your laptop. And there's two parts to it, first is a software. It's a relatively easy tweak super safe and then the second part involves opening up your laptop to apply thermal compounds. It's something a little more dicey, but it should keep your warranty intact, as long as you don't tell anyone about it. Okay, the first thing we're going to look at is the software, and this software will give you tremendous control over your CPU, and if you just start clicking things randomly, yeah, you can mess things up. But we're going to be dealing with one thing, which is undervolting and it's super safe. Undervolting is a process where you reduce the voltage that's going to the CPU, but it doesn't affect performance at all and the reason why you can do this safely, it's because CPUs are fed more voltage than they actually need. It's just a matter of finding that sweet spot. The two more popular apps that people use for this are: XTU by Intel and ThrottleStop. Both are free, both are good, but for beginners, I would recommend XTU, because it has all the basic components you need to properly undervolt. This is XTU when you first load it up. I know it looks crazy complex, lots of numbers, but we can ignore most of it. First, let's adjust the graphing monitor to show 30 minutes of data. We're going to stress test your CPU at its baseline, without any adjustments, just to see what numbers we're getting. So, this is the XPS15 9560, it's running a KabyLake 7700HQ. So, during the stress test the CPU is running pretty much full tilt, occasional dip and the temperatures are going up and down as the fans turn on and off. At its hottest it's 88 degrees and at the coolest around 75/76 degrees. Now, the way to undervolt properly is to drop the voltage, run a stress test and if it checks out, drop the voltage again and repeat. You're basically starving the CPU more and more. And so, to do that in XTU, you go to advanced tuning and on the score tab you click on the core voltage offset and you want to scroll upwards from 0 to see negative numbers. Remember, we're undervolting here, so you want to choose a negative number. So, we're going to start with an undervolt of 50 millivolts. So I'm going to reduce it by 0.050 volts, and when I run the stress test now, we're getting a max of 83/84 degrees. For a couple of clicks not bad, right? System is still completely stable, we're getting full clock speeds, and to step in the right direction. Ok, then we're going to kick it up a notch and I'm going to reduce it by a 120 millivolts, which is -0.120 volts and I'm cheating here because I know this is near the limit for this particular CPU, you should reduce it one increment at a time and test a bit, but for the sake of speed, I'm cranking that knob to ten. So at this undervolts when we stress test and activate the graph, we're getting even lower temperatures, maxing at around 77 degrees, so a good 10 or 11 degree drops from the original unaltered voltage. So, just to demonstrate, I'm going to drop my voltage to negative 130 millivolts, I know it's going to freeze, because I've done this before, my even blue screen. And when it does, that's when we know you hit the undervolt limit. And when you're there, reboot, go back into XTU and go back to the last voltage that worked. And for me that was -120 and that's your limit. To really test the stability, you want to run something like Prime95 overnight, just to make sure it's all good. If it doesn't last overnight, bump up the voltage. Now, every CPU is different, so it's tough for me to tell you exactly where to start, but I would recommend looking up your CPU or your particular laptop and seeing what other users with that hardware have been able to undervolt to and just kind of use it as a starting guide. For the KabyLake 7700HQ, I would start around 100 millivolts, so that's -0.100 volts. For the SkyLake 6700HQ I undervolted it at around 150 millivolts so that's -0.150 volts. And when you're done, you can close XTU down, the settings apply even on reboot, you don't have to keep the front end application open. So, undervolting laptops can give you better thermals, but in my experience the best results come from something called repasting. Okay, when a laptop manufacturer makes a laptop, there comes a point in the manufacturing process, when someone or something usually person has to apply a thermal paste onto the CPU and the GPU, and usually they don't do an amazing job, usually they're in a rush. It's like a person who's doing like hundreds of laptops, I just made that number up, but they're doing a lot of laptops every day and they're just squirting paste, so they don't really give that much attention to each CPU. What ends up happening is that the application is imperfect. Usually there's too much and there's a good chance they're not using the best quality thermal paste, there's nothing super terrible about this, the laptop will perform to spec, but it'll run hot. To resolve this, we're going to reapply that thermal paste and we're going to use better quality stuff, which results in lower temperatures. So, for the uninitiated, thermal paste is this goopy stuff, that you apply on to CPUs or GPUs, to help transfer heat away from it. And the better quality paste that you use and the better the application process, the better of a job that it does. Again, every laptop is different, so you'll have to search around to see if people have done it on yours, but the more popular laptops tend to have some kind of guide or tutorial as to \"how to do it\". For the XPS 15 once you're inside carefully unplug the battery, loosen up the screws here, carefully remove the heatpipe assembly and then clean off the original paste, using alcohol or Arctic Cleaner or whatever you want. And then apply some good thermal paste. So, I tend to do a small blog for the GPU and then a small line for the CPU. Just use good quality paste I like Arctic Silver 5. You don't need a lot, but you're better off using too much then way too little. On some laptops, you'll see thermal pads, you can swap those out for better quality ones or potentially thicker ones. Basically you want the thermal pad to eliminate any kind of air gap and then when you're done place the heatsink back on, but don't lift up to check how you did, just trust, because if you lift it up, you can put air bubbles into the paste and that's no good. One other thing that's kind of unique to the XPS 15: this area here has voltage regulator modules that get pretty warm. I've always put thermalpads over this area just to help transfer the heat to the aluminium paneling. And in the end the repasting gives you a further drop in temperature, better battery life, fans that come on less and most importantly no more CPU throttling. Your laptop will be able to run at maximum clock speed for as long as it wants. And if you play games, render videos or just do anything that pushes your laptop hard, you're going to get some nice performance gains from this. The thing is some people are going to watch this video and they're just going to jump to the conclusion that this is the best thing ever. It's cool, it's awesome, but it's not for everyone. If you've never opened your computer before, if you don't know what thermal paste is, if you've never used it before, you can still learn and figure out how to do this stuff and it's great once you do, but take your time, do the research, understand what you're doing, before you do it, because there is an element of risk to this. I really don't want you breaking your laptop, just because you were a little overzealous. Take your time, do it properly. Hope you guys enjoyed this video, thumbs of you liked it, sub if you loved it, I'll see you guys next time.",
    "transcript_keywords": [
        "CPU",
        "thermal paste",
        "paste",
        "laptop",
        "voltage",
        "XTU",
        "thermal",
        "video",
        "stress test",
        "test",
        "good",
        "laptops",
        "kind",
        "undervolting",
        "thing",
        "undervolt",
        "stress",
        "risk",
        "CPUs",
        "millivolts"
    ],
    "transcript_entity_values": [
        "0.050 volts",
        "75/76 degrees",
        "50 millivolts",
        "KabyLake 7700HQ",
        "Arctic Cleaner",
        "9560",
        "CPU",
        "GPU",
        "One",
        "fed",
        "ten",
        "one",
        "88 degrees",
        "XPS",
        "First",
        "second",
        "Arctic Silver 5",
        "around 100 millivolts",
        "30 minutes",
        "83/84 degrees",
        "two",
        "about two",
        "first",
        "120 millivolts",
        "130 millivolts",
        "ThrottleStop",
        "77 degrees",
        "a good",
        "the SkyLake 6700HQ",
        "hundreds",
        "Intel",
        "11 degree",
        "15",
        "around 150 millivolts",
        "0"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "LOC",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.07079101353883743,
        -0.01781298778951168,
        0.01500588096678257,
        -0.018852951005101204,
        0.11583119630813599,
        -0.017555424943566322,
        0.061054449528455734,
        0.01836114376783371,
        -0.045049987733364105,
        -0.022297339513897896,
        -0.01716236211359501,
        0.0023823308292776346,
        0.0034993195440620184,
        -0.06721337884664536,
        0.027416711673140526,
        0.05308704823255539,
        0.08912768214941025,
        -0.0007208750466816127,
        -0.12522365152835846,
        -0.030597709119319916,
        0.025446902960538864,
        -0.09306718409061432,
        0.010198692791163921,
        -0.014342952519655228,
        0.019489405676722527,
        0.045717790722846985,
        0.08356684446334839,
        0.07029669731855392,
        -0.10489755868911743,
        -0.07062764465808868,
        0.021782921627163887,
        0.00035428005503490567,
        -0.028807153925299644,
        -0.03982044383883476,
        0.02450760453939438,
        -0.044645678251981735,
        -0.041319843381643295,
        -0.009446127340197563,
        -0.024960273876786232,
        -0.08119361102581024,
        -0.06334573030471802,
        -0.03941787779331207,
        0.05096898227930069,
        0.009395672008395195,
        0.0016618353547528386,
        0.020087722688913345,
        0.02631157636642456,
        -0.1328365057706833,
        0.019201690331101418,
        -0.07926183938980103,
        -0.05285124480724335,
        -0.047226835042238235,
        0.051328979432582855,
        -0.06503491848707199,
        -0.07907067984342575,
        0.007112364750355482,
        0.037978965789079666,
        -0.10167225450277328,
        0.0036079958081245422,
        -0.05104351416230202,
        0.13216711580753326,
        -0.08820851892232895,
        -0.04069862887263298,
        0.06848403811454773,
        0.00938426237553358,
        -0.023934531956911087,
        0.064301498234272,
        0.002318630926311016,
        0.004269411321729422,
        0.08685063570737839,
        -0.03555741161108017,
        0.008513955399394035,
        0.006257406901568174,
        0.044505491852760315,
        0.008822392672300339,
        -0.02048579230904579,
        -0.019002243876457214,
        -0.06716100126504898,
        0.014600653201341629,
        0.01006331667304039,
        0.06683443486690521,
        0.0006277355132624507,
        0.029148951172828674,
        -0.05886043235659599,
        -0.03523556515574455,
        0.07429125905036926,
        0.05208155885338783,
        -0.06498489528894424,
        0.009560571052134037,
        -0.014480439014732838,
        -0.021471042186021805,
        0.060243871062994,
        0.09831055253744125,
        0.02051752619445324,
        0.04075067862868309,
        -0.010146552696824074,
        -0.018256541341543198,
        -0.15159955620765686,
        -0.05917496606707573,
        0.08011534810066223,
        0.022417614236474037,
        0.014335306361317635,
        0.01600036397576332,
        -0.05443070828914642,
        -0.01094864122569561,
        -0.044621340930461884,
        0.011654761619865894,
        0.05668766051530838,
        -0.015082789584994316,
        -0.01662828028202057,
        -0.00946289487183094,
        0.018414705991744995,
        -0.07749225944280624,
        0.0316828191280365,
        0.08618758618831635,
        0.09532549232244492,
        -0.04417116940021515,
        0.05125107616186142,
        0.028453633189201355,
        0.08553940057754517,
        0.007556541357189417,
        -0.03804638609290123,
        -0.005968315992504358,
        0.04537372291088104,
        0.032195329666137695,
        -0.03259265422821045,
        -0.03796361759305,
        2.0965015215312424e-33,
        0.07213820517063141,
        -0.018851393833756447,
        -0.10438636690378189,
        0.0061747669242322445,
        0.08743192255496979,
        -0.04198165610432625,
        0.01676071435213089,
        -0.04128780961036682,
        -0.09047877788543701,
        0.07813646644353867,
        0.0384187214076519,
        -0.051819317042827606,
        -0.08269275724887848,
        0.018267938867211342,
        0.04736589640378952,
        -0.056175731122493744,
        -0.03303908184170723,
        -0.0266561396420002,
        -0.01015725638717413,
        -0.031993284821510315,
        0.0962337777018547,
        -0.05653534084558487,
        -0.02475009858608246,
        -0.05796297639608383,
        0.02284581959247589,
        0.028353305533528328,
        -0.01959432289004326,
        -0.00956505723297596,
        0.10764258354902267,
        0.04717226326465607,
        -0.13708673417568207,
        -0.0178348608314991,
        -0.09408516436815262,
        -0.048635389655828476,
        -0.02185773476958275,
        0.04559406638145447,
        -0.1136099249124527,
        -0.03986174985766411,
        0.03381592780351639,
        0.024401403963565826,
        -0.018574774265289307,
        0.073714978992939,
        -0.043965864926576614,
        -0.014108775183558464,
        -0.012711276300251484,
        -0.0007970582228153944,
        -0.007976817898452282,
        0.026108184829354286,
        -0.060214996337890625,
        0.03377196192741394,
        -0.09173991531133652,
        0.007413844112306833,
        0.054322149604558945,
        -0.017028726637363434,
        -0.08412531763315201,
        -0.06641322374343872,
        0.11231805384159088,
        0.034274619072675705,
        0.0680631473660469,
        0.10331781953573227,
        0.031007587909698486,
        -0.04942694306373596,
        -0.05539098009467125,
        -0.030747655779123306,
        -0.06064833328127861,
        0.06842081993818283,
        0.10824557393789291,
        0.012021162547171116,
        -0.002962856786325574,
        -0.0037781214341521263,
        -0.0514054149389267,
        -0.035694777965545654,
        0.04136861115694046,
        -0.04049818962812424,
        0.03976009786128998,
        -0.02801596187055111,
        -0.03233599290251732,
        -0.027046654373407364,
        -0.013711375184357166,
        -0.02184797078371048,
        0.011271792463958263,
        0.010688541457057,
        0.001330781844444573,
        0.035798780620098114,
        -0.03701331838965416,
        -0.0016561622032895684,
        -0.045212291181087494,
        -0.047020524740219116,
        -0.010591607540845871,
        0.013782300986349583,
        -0.048165831714868546,
        -0.033947933465242386,
        0.05665534734725952,
        0.040734611451625824,
        -0.013072163797914982,
        -3.2255509885265874e-33,
        0.0072174412198364735,
        -0.015971340239048004,
        0.0418999157845974,
        0.0952746570110321,
        0.02429879643023014,
        0.0411246083676815,
        -0.044203758239746094,
        -0.01200309582054615,
        0.028659218922257423,
        -0.0164644718170166,
        -0.009658493101596832,
        0.048269178718328476,
        -0.01559140719473362,
        -0.0647282674908638,
        0.022343039512634277,
        -0.03895271569490433,
        -0.02185678295791149,
        -0.025816660374403,
        0.03315061330795288,
        -0.003953681793063879,
        0.01840159483253956,
        0.04661516100168228,
        0.02423321083188057,
        -0.03612376004457474,
        -0.03728688508272171,
        0.0297560915350914,
        -0.04923165589570999,
        0.059362590312957764,
        0.049801964312791824,
        0.045242540538311005,
        0.005804600194096565,
        0.06794755905866623,
        -0.01225642766803503,
        -0.030697766691446304,
        0.05580074340105057,
        -0.01864132098853588,
        0.10049843788146973,
        -0.01447359286248684,
        -0.030565956607460976,
        -0.029294131323695183,
        0.08445390313863754,
        0.08451550453901291,
        -0.049301132559776306,
        -0.07271622866392136,
        0.03530305624008179,
        -0.03569579869508743,
        -0.04689634591341019,
        -0.0854637548327446,
        -0.01424980629235506,
        0.0029842026997357607,
        0.00998232513666153,
        -0.029675068333745003,
        0.02745702490210533,
        0.003441920503973961,
        -0.04508672654628754,
        -0.05491261184215546,
        0.01516498252749443,
        0.10677764564752579,
        0.08613301813602448,
        0.001273183268494904,
        0.0016726385802030563,
        0.03719912841916084,
        -0.024818507954478264,
        -0.02412061206996441,
        0.013260984793305397,
        0.008155856281518936,
        0.02933952398598194,
        0.07123097777366638,
        0.08134075999259949,
        0.012705340050160885,
        -0.0884966105222702,
        0.02029094658792019,
        0.015957042574882507,
        -0.06253024190664291,
        -0.009766310453414917,
        -0.025529414415359497,
        0.07801942527294159,
        -0.018313758075237274,
        -0.020292073488235474,
        0.026193201541900635,
        -0.016105441376566887,
        -0.013044646009802818,
        0.004714061971753836,
        -0.011196873150765896,
        0.027347473427653313,
        -0.006738068535923958,
        0.07776443660259247,
        0.03987083584070206,
        -0.050380971282720566,
        0.006460641976445913,
        0.007486226502805948,
        0.05342572182416916,
        -0.0021341878455132246,
        0.07926415652036667,
        -0.015609030611813068,
        -5.756267640322221e-08,
        0.055651143193244934,
        -0.037625521421432495,
        0.014315076172351837,
        0.12274462729692459,
        0.029461020603775978,
        -0.041078317910432816,
        -0.008952696807682514,
        -0.034509412944316864,
        0.0611560232937336,
        -0.008250669576227665,
        0.08896676450967789,
        -0.04720526188611984,
        0.01866542547941208,
        -0.0015686280094087124,
        -0.021397579461336136,
        0.05277463048696518,
        -0.07656276971101761,
        0.13564158976078033,
        -0.04323301836848259,
        0.011753294616937637,
        0.010516127571463585,
        -0.004112479742616415,
        0.11400347203016281,
        -0.07270145416259766,
        0.03540438041090965,
        0.0516490712761879,
        0.07735440880060196,
        0.03408271074295044,
        0.02364226244390011,
        -0.02103121392428875,
        -0.14262869954109192,
        -0.01124641951173544,
        -0.01847228966653347,
        -0.007466914132237434,
        0.007349921856075525,
        -0.02925623394548893,
        0.0025329277850687504,
        -0.016650144010782242,
        0.04067171737551689,
        0.09797677397727966,
        -0.03803349286317825,
        -0.04805222153663635,
        0.035059720277786255,
        0.021326733753085136,
        -0.027487004175782204,
        -0.03910801559686661,
        -0.08030469715595245,
        -0.09858861565589905,
        0.02206600457429886,
        -0.007300667930394411,
        -0.004922774620354176,
        0.0013840672327205539,
        -0.009058624505996704,
        0.04342484101653099,
        0.04255397990345955,
        0.048974256962537766,
        -0.02575298398733139,
        0.10528913885354996,
        -0.013254836201667786,
        0.0754953995347023,
        0.0066938214004039764,
        -0.0882253646850586,
        -0.06374271214008331,
        -0.04422013461589813
    ]
}