{
    "id": "QCNxNg9AGkk",
    "title": "Apple's Worst MacBook Pro (and How They're Fixing It) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-02-25T19:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=QCNxNg9AGkk",
    "category": "Science & Technology",
    "tags": [
        "Apple's Worst MacBook Pro (and How They're Fixing It) - Krazy Ken's Tech Misadventures",
        "Apple",
        "MacBook Pro",
        "16-inch MacBook Pro",
        "MacRumors",
        "Apple Rumors",
        "2016 MacBook Pro",
        "USB-C",
        "Butterfly Keyboard",
        "Mac",
        "macOS",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Computer",
        "Computer Clan"
    ],
    "views": 63490,
    "likes": 2939,
    "comments_count": 672,
    "description": "Do you think Apple's MacBook Pros have been a little sucky, lately? Today, Krazy Ken will share his thoughts, and he'll tell you about the 2021 MacBook Proand how Apple is backpedaling on many of their 2016 decisions.  Download our epic wallpapers   Get more Tech Misadventures episodes   Subscribe and listen to our podcast   Subscribe for more tech videos!    Like us on Facebook   Follow us on Twitter    Krazy Ken's Tech Misadventures - Apple's Worst MacBook Pro (and How They're Fixing It)  Special thanks to @ThisDoesNotCompute for his awesome neon-filled MacBook Pro shot.    Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://thecomputerclan.com/wallpapers",
        "https://krazyken.thecomputerclan.com",
        "https://anchor.fm/computerclan",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- There is a reason why I haven't purchased a new MacBook Pro in over seven years. In my opinion, they've been a little sucky lately, but the good news is reportedly, Apple is backpedaling on a lot of the choices they made with the newer MacBook Pros and a brand new, super awesome MacBook Pro is coming up real soon. So let's talk all about this stuff right now. (upbeat electronic music) - Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and today I'm just going on a bit of a semi-rant with all of you about Apple's MacBook Pro and where it's going to be going in the future. Now this is a looser, freestyle episode, so I guess if you want, feel free to just play me in another tab while you do something else, but if you do that, I'll miss you. : ( So in my opinion, the 2016 MacBook Pro is Apple's worst MacBook Pro ever. I think they just jumped the gun too much and changed way too much at once. First off, they killed all the ports. Everything is USB-C/Thunderbolt 3. They do have a headphone jack on there, at least, thank goodness, but that wasn't the greatest decision in my opinion. They also got rid of MagSafe which is a feature I personally don't care about very much but it's still really cool, and it's a safe way to keep your stuff charging but they got rid of that, too. And one of the worst things by far is this butterfly keyboard. Not only does it feel weird, but the failure rate is so fricking high, I was never confident about buying a new MacBook Pro. At my day job office, I have heard of several stories about employees getting stuck keys and I just can't take that chance when I'm on the go. And in my opinion, the whole butterfly thing could have been easily avoided. I think Apple was trying to fix an issue that didn't really exist. They were talking about how key caps wiggle and all this stuff, and they want to make them more stable and increase the surface area but did anyone really complain about that problem in the first place? I mean, you know, you guys let me know what you think. I don't want to speak for you, but I have never had a problem typing on this traditional looking Chiclet-style keyboard ever. Now the newer one does feel a little bit weird. I got used to it, but still, the probability of the failure rates and everything just made me very cautious about purchasing a MacBook Pro. Speaking of the keyboard, the Touch Bar. I do not see the point of this Touch Bar thing at all. I tried to be open-minded and I tried to be thinking forward and I tried to think, wow, this can be so good, but I just can't. I've tried it, and there's ways to make it work. It's actually very customizable, which is really cool, but not having the tactile feeling of a physical row of keys just slows me down, especially as a pro that uses a lot of keyboard shortcuts, having to constantly look down to see where I'm tapping just slows me down way too much. It's kind of distracting. And a part of that Touch Bar issue, no Escape key. They got rid of the Escape key. So just years of muscle memory going up to the upper left to press the Escape key were just immediately destroyed. The more I think about it, like half of these issues have to do with the keyboard layout, and it seems like all of this stuff could have been completely avoided. I really don't know what was going on through Apple's head. Now, yes, they like to try to change things and be innovative and everything, but they're not perfect. You can't win them all, but let's talk about some positives. The computer is faster, if there's no thermal throttling issues, it's usually faster. I like the bigger track pad. The speakers are really nice too, so that's really cool, and I do like the design. I like the space gray and the thinness, but overall, that's not enough to sell me. But the good news is Apple has already fixed a few things with their upgraded computers. They tried a second-generation butterfly switch for these butterfly keys, but they eventually did away with that with the 16-inch MacBook Pro. They went back to the scissor switch, which I think was a way better idea. They should have just stuck with that in the first place. They also added an Escape key back, which is great. But other than that, not much has changed, but those are two big things still, and if I had to buy a new MacBook Pro, I think I could get along with that because that addresses some major issues with the keyboard, a fundamental part of interfacing with your computer. My big issue in addition to the keyboard stuff is the ports. Now I was willing to go the dongle life, you know, I was willing to go the extra mile and get all these dongles and stuff for the USB-C ports but it's just kind of a pain in the (quack), not to mention they also removed the SD card slot, which is super handy. I (quack) you not, guys, 20 minutes before I started taping this, I got a message from someone who was at a video shoot and they needed an SD card dongle. This is still a big issue. Cameras use SD cards, people. So many of them do unless you're using CFast or like, SSD modules on a RED or something, like most of the time, you're going to be using SD cards, and it's still a problem where if you're on location on a shoot and your adapter dies or you forget to bring your adapter, you're screwed. And I get that Apple wants to help push the world forward, but here's the problem. There's way too many fricking devices using USB type A still. Too many people rely on it. Trust me, I would love everything to go Thunderbolt and everything. It's all one connection for Thunderbolt 3, it's super fast, and I use the Thunderbolt 3 RAID and it's fricking awesome but hardly anything uses that type of connector, and it's just impossible to fit in. Now, some might say, \"Oh, Ken, they killed the SCSI port and went to USB on the iMac. They pushed forward for that.\" Sure, and I think that's great, but we have to remember how many people were using personal computers back then? How many SCSI devices were there back then? A lot less. The transition, although still kind of hard to do, was much more manageable back then, in my opinion, because there were fewer devices and fewer people that needed to make the switch. Nowadays there's bajillions of USB type A devices and over, what, how many personal computer users are there? Not just Macs, but in general, like a billion, 2 billion? Like it's insanely high and transitioning that is just way too complex for now. But here's the even better news: word on the street is that we're going to be seeing a new 16 and 14-inch MacBook Pros, not only with the really fast, really efficient Apple silicon chips in them, but also with other feature changes, including a new redesign, which is inspired by the iPad Pro design language, which I'm really excited to see, but Apple is also reversing their decisions on a few things. Reportedly, MagSafe is making its way back into the computer. For those who don't know, it's designed so if someone trips over your power cord, it just comes out and doesn't yank your computer off the desk. But I don't think that's ever happened to me in my life, ever. If it's happened to one of you guys, let me know. Sorry for your loss. Also, the Touch Bar is likely going away, which thank you, Apple. I still don't see the point of the Touch Bar. Guys, if you like it, let me know. I'm trying to be open-minded and thinking about new technologies and stuff, you know, let me know what I might be missing but I'd rather have a physical row of function keys any day of the week. And more ports are coming back. They're going to bring back USB type A, maybe other connections, too. I do like that this computer has HDMI on it as well, but you know, if I have to trade that off, whatever. USB type A is the main thing I'd like to see come back. And we also might see the SD card slot come back which is a big deal to me because, guys, tons of people still use these. I mean, coincidentally, I don't, I shoot with a Blackmagic camera and I shoot on to CFast media. So I still need an adapter either way but my Canon DSLR shoots SD cards, and I'm glad that Apple isn't so stuck up where they're willing to subtly admit they were dead wrong with a lot of these choices and the backpedaling will actually make a lot of people super happy. But what about the future? What are we going to see after that new generation of product? Well, we're going to maybe see mini-LED displays, which will help reduce blooming and keep those blacks nice and black without again, the blooming effects around colors. There could be OLED. There's some rumors going around about OLED displays but there's a lot of talk about it actually being mini-LED that Apple uses. And there's also talk about Face ID being integrated into the display, kind of like what you use on your phone. So that could be nice, too. Hopefully they still keep Touch ID. I think Touch ID is a nice move they made with the computer but Face ID would also be pretty convenient. But we're likely not going to see that stuff in this next release because well, one, Apple needs to be able to work on the right amount of stuff and not do too much at one time, but also what I think is really important is they gotta stagger their features. They can't just release everything at once. You know, you gotta release some great stuff here and then, you know, nine months down the road or whatever, release some great stuff here. Don't just do everything at once, because then you're just going to burn yourself out and peak right there. But let me know in the comments, let me know about things you like with the newer computers and about things you don't like. And also what you're looking forward to with the new 2021 models and so on. I keep hitting this display. I'm going to slice my hand open. This thing is sharp. Okay, not really, it's just thin. So subscribe and stay tuned because as soon as I can get my hands on the newer MacBook Pros, I would love to test them in future first impressions episodes for you guys. And if you'd like to help fund the future of the Computer Clan, plus get some awesome perks along the way, feel free to pledge to my Patreon. Thanks in advance for your support. And hey, if you liked this episode, you know what to do. Thanks for sticking with me, catch the crazy, and pass it on. (upbeat dance music)",
    "transcript_keywords": [
        "Apple MacBook Pro",
        "MacBook Pro",
        "newer MacBook Pros",
        "Apple",
        "USB type",
        "Pro",
        "awesome MacBook Pro",
        "MacBook",
        "back",
        "USB",
        "Pros",
        "computer",
        "guys",
        "people",
        "stuff",
        "Touch",
        "Touch Bar",
        "Apple MacBook",
        "type",
        "lot"
    ],
    "transcript_entity_values": [
        "USB",
        "Ken",
        "Blackmagic",
        "nine months",
        "2 billion",
        "14-inch",
        "two",
        "Apple",
        "any day of the week",
        "SSD",
        "3",
        "Touch Bar",
        "USB-C/Thunderbolt 3",
        "iPad Pro",
        "20 minutes",
        "16-inch",
        "seven years",
        "MacBook Pros",
        "Patreon",
        "like half",
        "Krazy Ken",
        "jack",
        "SD",
        "2021",
        "MagSafe",
        "first",
        "one",
        "SCSI",
        "the Touch Bar",
        "MacBook Pro",
        "iMac",
        "MacBook Pro",
        "2016",
        "16",
        "a billion",
        "First",
        "second",
        "the Computer Clan",
        "Macs"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.06382406502962112,
        -0.03785974532365799,
        0.12836548686027527,
        -0.07547949254512787,
        0.06907135993242264,
        -0.000823331531137228,
        0.021096117794513702,
        0.016733119264245033,
        -0.033633723855018616,
        0.029565079137682915,
        0.04557580128312111,
        0.059838153421878815,
        0.03335098177194595,
        -0.06922072172164917,
        0.00436820974573493,
        1.975561463041231e-05,
        0.08177660405635834,
        -0.08538340032100677,
        -0.02851617895066738,
        0.007299264892935753,
        -0.06336662173271179,
        -0.06850734353065491,
        -0.020712535828351974,
        0.0040396335534751415,
        0.013590852729976177,
        0.01861070841550827,
        0.0513540580868721,
        -0.02899174764752388,
        -0.08926915377378464,
        -0.04988843575119972,
        -0.022329041734337807,
        0.0035584333818405867,
        -0.0036799570079892874,
        0.0031630664598196745,
        0.029544003307819366,
        -0.10299903899431229,
        0.056713033467531204,
        -0.006018676329404116,
        -0.037519797682762146,
        -0.0953848734498024,
        -0.030820591375231743,
        -2.419799056951888e-05,
        -0.0011895563220605254,
        0.11320340633392334,
        0.043768446892499924,
        -0.016927313059568405,
        0.06858234107494354,
        -0.06456869095563889,
        0.04132934287190437,
        -0.02026253007352352,
        -0.011969980783760548,
        -0.10500034689903259,
        0.05568373575806618,
        0.0022514064330607653,
        0.000801114016212523,
        0.038839809596538544,
        0.013738374225795269,
        -0.01950274594128132,
        0.13906414806842804,
        0.026786424219608307,
        0.05665038526058197,
        -0.11520678550004959,
        -0.026981230825185776,
        0.012443413026630878,
        0.05407775193452835,
        -0.06905508041381836,
        0.05303081125020981,
        0.005629520397633314,
        0.003941898699849844,
        0.04281746596097946,
        0.0539894662797451,
        0.035895105451345444,
        0.03462717682123184,
        0.060055751353502274,
        -0.01870977319777012,
        0.01801810972392559,
        -0.016444537788629532,
        -0.057395875453948975,
        0.03070402890443802,
        -0.026052331551909447,
        -0.024985557422041893,
        -0.003232654184103012,
        -0.014452685602009296,
        -0.02481718920171261,
        0.01417548954486847,
        -0.04662873223423958,
        -0.02814607135951519,
        -0.08722421526908875,
        -0.041389767080545425,
        -0.015492888167500496,
        0.009112702682614326,
        0.05202314257621765,
        0.11234255880117416,
        -0.03515820577740669,
        -0.002575981430709362,
        -0.04426960274577141,
        0.04538301005959511,
        -0.03975709155201912,
        -0.02752084657549858,
        0.06752949208021164,
        -0.05228929594159126,
        0.08766684681177139,
        0.09574110805988312,
        -0.1039632186293602,
        0.01848570816218853,
        -0.04130387678742409,
        0.027423255145549774,
        0.055443305522203445,
        0.011924699880182743,
        0.052672408521175385,
        0.002790727885439992,
        -0.00811066571623087,
        -0.04940284788608551,
        0.0368456169962883,
        0.07985974848270416,
        0.03496253862977028,
        -0.014695379883050919,
        0.06118718907237053,
        0.08656098693609238,
        -0.002326441230252385,
        0.0506768561899662,
        0.05849921330809593,
        0.0016749713104218245,
        -0.008950871415436268,
        0.023558400571346283,
        0.020007509738206863,
        -0.043264299631118774,
        4.901022759687934e-33,
        0.008768425323069096,
        0.029248259961605072,
        -0.07552684843540192,
        0.022687144577503204,
        0.030525794252753258,
        -0.06552841514348984,
        -0.01454312913119793,
        0.015566300600767136,
        -0.016986899077892303,
        0.03801257535815239,
        -0.04664623364806175,
        -0.005997863132506609,
        -0.06332974880933762,
        0.002365253632888198,
        0.06638684123754501,
        -0.07743226736783981,
        -0.07161089032888412,
        -0.016860682517290115,
        -0.08484062552452087,
        0.08173932135105133,
        0.0928436890244484,
        0.01951705291867256,
        0.02071646973490715,
        -0.06828708946704865,
        -0.0019144596299156547,
        0.02220485918223858,
        0.03659577667713165,
        -0.038790661841630936,
        0.08866316080093384,
        0.034345269203186035,
        -0.11159452050924301,
        -0.002141106640920043,
        0.02887505479156971,
        -0.05388550087809563,
        -0.04550165310502052,
        -0.06862114369869232,
        0.01113221887499094,
        -0.06333138048648834,
        0.04756598174571991,
        -0.009704715572297573,
        -0.15701940655708313,
        -0.010027593933045864,
        -0.07329026609659195,
        -0.06073390692472458,
        0.044454123824834824,
        0.000945055449847132,
        0.018372774124145508,
        0.022545216605067253,
        0.02432361990213394,
        0.011958025395870209,
        -0.06831364333629608,
        -0.006139787379652262,
        0.0619865283370018,
        0.013908054679632187,
        -0.08208179473876953,
        0.014067242853343487,
        0.05150504410266876,
        -0.05768069997429848,
        0.07801065593957901,
        0.0872177928686142,
        0.09952522069215775,
        0.07590983062982559,
        0.025016967207193375,
        -0.008369923569262028,
        -0.08074666559696198,
        0.037728652358055115,
        0.05573062598705292,
        0.031314000487327576,
        -0.0685664638876915,
        0.018514586612582207,
        -0.08982805162668228,
        -0.02374148927628994,
        -0.006368408910930157,
        -0.0933406725525856,
        -0.03965521976351738,
        -0.055297866463661194,
        -0.09774591773748398,
        -0.014660906046628952,
        -0.10404372960329056,
        0.013521977700293064,
        0.015626249834895134,
        -0.04782098904252052,
        0.011654389090836048,
        0.036207735538482666,
        -0.034650810062885284,
        0.06944452226161957,
        0.039463143795728683,
        0.03768518939614296,
        -0.042253293097019196,
        0.03652777522802353,
        0.006655242294073105,
        0.012990941293537617,
        0.02839505299925804,
        0.06282825767993927,
        -0.024886202067136765,
        -5.8969970826205804e-33,
        0.0387655645608902,
        -0.08057238161563873,
        0.009876874275505543,
        0.035884663462638855,
        -0.010105586610734463,
        0.03647798299789429,
        0.008792242035269737,
        0.027135010808706284,
        -0.04183490574359894,
        -0.062119293957948685,
        -0.023661240935325623,
        0.04631608724594116,
        -0.07630641758441925,
        -0.04769371077418327,
        -0.009609954431653023,
        -0.0006549914251081645,
        -0.056022725999355316,
        -0.012215929105877876,
        -0.04864504188299179,
        -0.059877295047044754,
        0.058620162308216095,
        0.014572115615010262,
        0.005427513271570206,
        -0.005098690278828144,
        -0.0016159119550138712,
        0.019063791260123253,
        0.028125828132033348,
        0.05086704343557358,
        -0.018575964495539665,
        0.037392426282167435,
        -0.01062574703246355,
        0.03411956876516342,
        0.002432179870083928,
        0.018391067162156105,
        0.07673108577728271,
        0.0405728705227375,
        -0.019155245274305344,
        -0.006027803290635347,
        -0.03525233641266823,
        -0.045482195913791656,
        0.10119438916444778,
        0.06167782098054886,
        -0.05215802788734436,
        0.013963664881885052,
        0.032955773174762726,
        0.05310165509581566,
        -0.07942701876163483,
        -0.026449840515851974,
        0.01936287060379982,
        -0.058040011674165726,
        -0.04161987081170082,
        -0.061455558985471725,
        -0.018253028392791748,
        -0.003463641507551074,
        -0.06228940561413765,
        -0.022723058238625526,
        -0.038921549916267395,
        0.05120183527469635,
        0.07597852498292923,
        0.04912612587213516,
        -0.0884924829006195,
        -0.02659093588590622,
        0.04782404005527496,
        -0.06634993851184845,
        0.020983129739761353,
        -0.03241197392344475,
        0.03945745527744293,
        0.03911086171865463,
        0.04010826349258423,
        0.04183010756969452,
        0.01858557015657425,
        0.04094822332262993,
        -0.0793999433517456,
        -0.10125589370727539,
        0.029497506096959114,
        0.12218627333641052,
        0.013245773501694202,
        -0.043206360191106796,
        -0.08285391330718994,
        0.010125643573701382,
        0.021756121888756752,
        0.0594356507062912,
        0.011663025245070457,
        0.02888580411672592,
        0.027150385081768036,
        0.07429756969213486,
        0.05183793976902962,
        0.010836707428097725,
        -0.06060947850346565,
        0.0037317818496376276,
        -0.06236372888088226,
        -0.05770145356655121,
        -0.041140466928482056,
        0.02575773373246193,
        -0.07718604803085327,
        -5.5124136366657694e-08,
        -0.044988445937633514,
        0.02654769830405712,
        0.016631126403808594,
        0.03932676836848259,
        0.06490364670753479,
        -0.07432184368371964,
        -0.05653291568160057,
        0.04707915708422661,
        0.0660882219672203,
        0.04861266911029816,
        0.028103401884436607,
        -0.07177142798900604,
        -0.05867250636219978,
        0.020791063085198402,
        0.01834152080118656,
        0.08022792637348175,
        -0.09019552916288376,
        0.14726896584033966,
        -0.04187910631299019,
        -0.08469469845294952,
        -0.0011956486850976944,
        0.012842996045947075,
        0.09449483454227448,
        -0.030014434829354286,
        -0.013578072190284729,
        0.006934467703104019,
        -0.03012215532362461,
        0.0591483935713768,
        0.019037961959838867,
        -0.003949868492782116,
        -0.10133010894060135,
        -0.022395335137844086,
        -0.019079403951764107,
        -0.00021091032249387354,
        0.043137796223163605,
        -0.02685508504509926,
        -0.027596481144428253,
        0.07542248070240021,
        0.033145755529403687,
        0.035940300673246384,
        -0.08582358807325363,
        -0.09206361323595047,
        -0.013850941322743893,
        -0.020903894677758217,
        -0.036596961319446564,
        -0.0010010870173573494,
        -0.06735661625862122,
        0.022701658308506012,
        -0.0215627271682024,
        -0.00405510701239109,
        0.039646293967962265,
        -0.038148071616888046,
        -0.020149484276771545,
        0.061629194766283035,
        -0.011935843154788017,
        0.021421413868665695,
        -0.009854084812104702,
        -0.04180791601538658,
        -0.024364955723285675,
        0.061921536922454834,
        0.10312016308307648,
        -0.052091311663389206,
        -0.07580327242612839,
        0.04306592047214508
    ]
}