{
    "id": "QD_IlFkqSnA",
    "title": "Galaxy S10 Durability Test - Ultrasonic Fingerprint Scratched?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-03-01T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=QD_IlFkqSnA",
    "category": "Howto & Style",
    "tags": [
        "Galaxy S10",
        "Samsung galaxy s10",
        "Samsung",
        "Galaxy",
        "Android",
        "pie",
        "smartphone",
        "best smartphone",
        "premium smartphone",
        "best smartphone 2019",
        "flagship",
        "iphone",
        "android",
        "apple",
        "s10 unboxing",
        "s10 review",
        "s10 durability test",
        "s10 bend test",
        "Ultrasonic fingerprint",
        "ultrasonic"
    ],
    "views": 7366148,
    "likes": 152656,
    "comments_count": 14078,
    "description": "The Samsung Galaxy S10 is ready to be tested! See what your phone looks like with dbrands new skin Black Swarm:  Thanks to dbrand for sponsoring this video. Samsung just released the new Galaxy S10, the S10 + and the S10e. Samsung has always been a leader in premium flagships. Ive never had a Galaxy phone fail my durability test yet. Its time to see how the S10 holds up to a bend, scratch, and burn test. We'll be paying special attention to the in screen fingerprint scanner. Using ultrasonic fingerprint capturing technology... will it still work through scratched glass?   Fix your Galaxy with repair guides and parts from iFixit!:   Galaxy S10 Teardown video HERE:   Current Galaxy S10 Pricing on Amazon:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/nature",
        "https://ifix.gd/2zMN4Xf",
        "https://youtu.be/kHzmFPoZbCA",
        "https://amzn.to/2XXOFlY",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Galaxy S10 Samsung's latest flagship phone with all the bells and whistles a tech enthusiast could ask for is here. But is it durable? Can the under-screen ultrasonic fingerprint scanner handle a few scratches? Do the included headphones use a headphone jack? There's only one way to find out. Let's go. Wait....no....that's not it. Let's get started. [Intro] The Galaxy S10 is the one with the infinity-o display. It's easy to remember because it's kind of got a cheerio in the top corner. As always, we start with the scratch test, which means the included plastic screen protector which means the included plastic screen protector should probably come off first. Samsungs have always held up very well during my durability test. In fact, the first phone I ever tested was a Samsung Galaxy S6 four years ago. And to be honest, physically not much has changed since then. The screen bezels have shrunk of course, giving the S10 a more modern feel. If the screen were made of plastic, it would scratch at a level 3. Sapphire would scratch at a level 8. And here with the S10, we see scratches at a level 6, with deeper grooves at a level 7. The 10 megapixel front facing cheerio camera is tucked up in here, protected by the same Gorilla Glass 6, and unscratchable by my razor blade. We'll go down and check the ultrasonic fingerprint scanner in just a second. The speaker grill is also up here, tucked into the black sliver of a bezel. And it looks to be made of metal with rhombus shaped holes to let the sound through. Fun fact: the rhombus shape is never really naturally found out in nature. Hexagons, on the other hand, are everywhere. Honeycomb, rocks, turtle shells, snake skin, bubbles. It's literally the most efficient and least wasteful shape found in nature, and is structurally sound. And currently makes up dbrand's most textured skin yet called Swarm. Applying this skin will make it appear like you know all kinds of cool nature facts without needing to go outside. Plus, you avoid social interaction altogether with online ordering. Win-win for everyone. Thanks to dbrand for sponsoring this video. Link in the description. Three cameras adorn the back of the S10 this year: a 12 megapixel telephoto, a 12 megapixel normal camera, and a 16 megapixel ultra wide camera. The perfect trifecta, all protected with the flash underneath a slab of glass. I'll pull off the Swarm cuz what we do next happens without protection. Aluminum is the metal of choice this year again for Samsung, even on the buttons. It might not be as durable or heavy as stainless steel, but it is cheaper and easier to work with, and is usually still more structural than plastic. The bottom has a USB-C port that can connect with a keyboard and monitor to act like a PC with decks. It also still has a headphone jack that can accept credit card readers or external microphones, and headphones. Good guy to have around. Bixby is still here, but supposedly can be remapped now to activate another app. Thanks Samsung. The buttons still come out and are actually purple inside this time. Purple might not be my favorite color, but it's consistent on all the buttons. Each of them have the same purple niblets. No purple on the SIM and expandable SD card tray though, even with the removable buttons on the Galaxy S10, it's still IP68 water resistant. It's nice to have that extra protection against liquids. I'll get the buttons back in. Now this might just be my imagination, but every time a new phone comes out, I feel like people seem to collectively lose their minds over the smallest improvements, when in reality, taking a step back shows that not a whole lot has changed in the last few years. Samsung did manage to flip the wireless charging around, so now it can give and receive wireless power. It will be fun to see what it looks like inside during the teardown. Before we check the fingerprint scanner, let's talk about the screen. The smaller bezels do make it look futuristic and cool. Each of Samsung's stock wallpaper is dark in the upper right hand corner to hide the cheerio-looking camera. The S10 has a 6.1 inch infinity-o display, with HDR10 and 1440 resolution. I left my lighter in place for about 30 seconds before a white mark started to appear. But then, when the heat was removed, the pixels completely recovered and went back to normal. Flame still evaporates the outer oleophobic coating of course, so don't try this at home. The real reason we're here though is to durability test the new ultrasonic fingerprint scanner the first of it's kind. The ultrasonic scanner uses high frequency sound waves pass through the screen to hit your fingerprint and reflect back down into the sensor. Kind of like that echo location that bats use. Setting up my fingerprint was easy enough. The screen itself doesn't need to illuminate since it's all done with sound waves, and it works super quick, every single time with a cool little ripple animation. But what happens if the front glass becomes scratched or cracked? Will the fingerprint scanner still function? Let's bring over the deeper grooves level 7 pick, and we'll rough up the glass to mimic a substantial amount of abuse. We can all agree that this phone is much more scratched than could ever happen naturally out in the wild. It's pretty brutal and almost makes me sad inside, but science must continue. Even with the heavy unrealistic abuse, the fingerprint scanner is able to read the high frequency sound waves bouncing from my already programmed fingerprint, and unlocks the phone every single time with no struggles. Thumbs up for that. It's good to know that normal scratches will never inhibit the fingerprint reader. We'll check and see what happens with cracks in the glass in just a second. First we got to try the bend test. With only minor changes to the overall glass sandwich design in the last four years. Samsung phones have always been super solid, and this Galaxy S10 is no exception. Whether pressure is applied from the front or the back, there is no flex to the phone, and no glass separation on the back panel or the front screen. No kinks, no cracks, and no damage done to the water resistance to the phone. The Galaxy S10 passes the bend test and is an impressively solid phone. What happens though if there are cracks over the ultrasonic fingerprint scanner? Would cracks be enough to deflect the sound waves and disable the fingerprint scanner. Let's bump things up to a level 8 beyond scratches and deeper grooves, this level 8 pick creates gouges that only sapphire resists, effectively imitating cracks in glass. The glass directly above the scanner is a mess now and unfortunately the fingerprint scanning ability is not able to function. Completely unable to recognize my fingerprint. The ultrasonic fingerprint scanner is out of order. Yeah I can draw a pattern and use the less secure face ID, but the fingerprint scanner is no more. A while ago, MKBHD took sandpaper to scuff up the glass over an optical in-screen scanner, and afterward it still functioned just fine. So in comparing the two side by side, my initial impression is that the ultrasonic scanners, like the one in the S10, are more affected by scratches than an optical scanner would be. Either way, technology is pretty cool. If you want a feature rich premium smartphone with all the bells and whistles currently available, the S10 is the phone for you. But it's kind of also just another rectangle with marginal improvements over last year's phone. I'm going to keep using my Galaxy S8 Plus for a little while longer. I don't feel the need to switch just yet. You can always plop a skin on your old phone and pretend it's new, and then take that $1,000 you just saved and fly to Hawaii and back. Who knows, maybe nature is worth visiting. Feel free to spam my Twitter with natural hexagons if you go outside, and use your fingerprint to hit the subscribe button. Thanks for watching. I'll see you around.",
    "transcript_keywords": [
        "fingerprint scanner",
        "ultrasonic fingerprint scanner",
        "fingerprint",
        "scanner",
        "Samsung latest flagship",
        "ultrasonic fingerprint",
        "latest flagship phone",
        "phone",
        "Galaxy",
        "Glass",
        "Samsung",
        "screen",
        "back",
        "level",
        "ultrasonic",
        "latest flagship",
        "tech enthusiast",
        "Samsung latest",
        "sound",
        "Samsung Galaxy"
    ],
    "transcript_entity_values": [
        "about 30 seconds",
        "the last four years",
        "1440",
        "1,000",
        "Hawaii",
        "8",
        "MKBHD",
        "SD",
        "two",
        "jack",
        "6",
        "the last few years",
        "Three",
        "12 megapixel",
        "only one",
        "Galaxy S8",
        "Samsungs",
        "7",
        "6.1 inch",
        "S10",
        "this year",
        "last year's",
        "S10",
        "first",
        "four years ago",
        "second",
        "Sapphire",
        "Samsung",
        "First",
        "Twitter",
        "3",
        "16 megapixel",
        "Bixby",
        "10 megapixel",
        "Swarm",
        "this Galaxy S10",
        "the Galaxy S10",
        "Samsung Galaxy S6",
        "Honeycomb"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "CARDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.1564171016216278,
        -0.0073102121241390705,
        0.05859757214784622,
        -0.08617880195379257,
        0.06721629202365875,
        0.019084667786955833,
        0.037713922560214996,
        0.008480062708258629,
        -0.16683511435985565,
        -0.07320725172758102,
        0.11634169518947601,
        0.048404209315776825,
        0.0483308807015419,
        0.10408814251422882,
        -0.007594681810587645,
        -0.08593381941318512,
        0.08328700810670853,
        -0.0019795051775872707,
        -0.012460479512810707,
        0.019543226808309555,
        0.01710282452404499,
        -0.012701604515314102,
        0.02951766550540924,
        -0.10746406018733978,
        0.04074754938483238,
        -0.048831164836883545,
        -0.005612727254629135,
        -0.056426264345645905,
        -0.06690092384815216,
        -0.010889367200434208,
        0.07203192263841629,
        0.06983599811792374,
        -0.013555079698562622,
        0.07150832563638687,
        0.06784721463918686,
        -0.1548904925584793,
        0.016244996339082718,
        0.05121247470378876,
        -0.00442857202142477,
        -0.0610099621117115,
        -0.0790611132979393,
        -0.05262180045247078,
        0.0013602161779999733,
        -0.03853214904665947,
        0.0693102702498436,
        -0.06207933649420738,
        0.08133915066719055,
        0.01938473805785179,
        0.019131409004330635,
        0.016598794609308243,
        -0.04083013907074928,
        0.0021008686162531376,
        0.05283377692103386,
        -0.05058693140745163,
        0.0018691536970436573,
        0.02048073709011078,
        0.016391582787036896,
        -0.041807763278484344,
        0.007714861072599888,
        -0.0637865662574768,
        0.0561336912214756,
        -0.028713086619973183,
        -0.020852023735642433,
        0.046330224722623825,
        0.04623828083276749,
        0.003113501239567995,
        0.07484601438045502,
        -0.04145389050245285,
        0.06353408098220825,
        0.040850382298231125,
        0.033089686185121536,
        -0.030349645763635635,
        0.015944162383675575,
        0.000558539992198348,
        -0.02681269682943821,
        0.06617452204227448,
        -0.02504780702292919,
        -0.02307269535958767,
        -0.07735739648342133,
        0.03329368308186531,
        0.004763426724821329,
        -0.08982159942388535,
        -0.020518872886896133,
        0.0040901158936321735,
        -0.0413084402680397,
        0.017427409067749977,
        -0.022137438878417015,
        0.034204788506031036,
        -0.07097486406564713,
        -0.014246325008571148,
        0.04066896066069603,
        0.025466715916991234,
        -0.04907751455903053,
        -0.036032695323228836,
        0.030098197981715202,
        -0.028554953634738922,
        -0.03372141718864441,
        -0.011087413877248764,
        -0.029874509200453758,
        -0.00648803636431694,
        -0.050722166895866394,
        -0.040097735822200775,
        -0.03255453333258629,
        -0.016026442870497704,
        0.06146199628710747,
        -0.03515522927045822,
        -0.04308200255036354,
        -0.05758187919855118,
        0.018037099391222,
        -0.024210842326283455,
        0.06720227003097534,
        0.05483586713671684,
        -0.00677918316796422,
        0.06537354737520218,
        0.018025437369942665,
        -0.08392862975597382,
        0.01104649342596531,
        -0.0025008120574057102,
        0.022964993491768837,
        0.03273417055606842,
        0.034124892204999924,
        -0.0386853851377964,
        -0.08801005780696869,
        -0.04316296428442001,
        0.010684625245630741,
        0.07323728501796722,
        -0.008860556408762932,
        3.0441670674069236e-33,
        0.06668721139431,
        0.10808364301919937,
        -0.030294638127088547,
        -0.04107509180903435,
        0.007075320463627577,
        0.04192580655217171,
        -0.02044394239783287,
        0.04404396936297417,
        -0.02260749228298664,
        0.021921539679169655,
        -0.06788189709186554,
        0.03590447083115578,
        -0.04815622419118881,
        0.0027093300595879555,
        0.014117575250566006,
        0.053706809878349304,
        -0.028315605595707893,
        -0.001512235263362527,
        -0.1162053793668747,
        0.011286058463156223,
        -0.0011251319665461779,
        -0.05178006365895271,
        0.007534312549978495,
        0.024782028049230576,
        0.06402702629566193,
        0.03859037905931473,
        0.01769968494772911,
        0.0007332345121540129,
        0.06996876746416092,
        0.04377254098653793,
        -0.07287785410881042,
        0.006689808331429958,
        0.0019821515306830406,
        0.06525279581546783,
        -0.007543712388724089,
        0.09029948711395264,
        0.06048938259482384,
        -0.024291282519698143,
        0.032164935022592545,
        -0.04355589672923088,
        -0.025138579308986664,
        0.0005297844763845205,
        0.013973205350339413,
        0.008717653341591358,
        0.0351434089243412,
        -0.059394631534814835,
        -0.08987577259540558,
        0.07279836386442184,
        -0.034551240503787994,
        -0.01748201809823513,
        -0.0392899215221405,
        -0.016524041071534157,
        -0.04150504246354103,
        -0.03593004122376442,
        -0.1000993400812149,
        0.03140418976545334,
        0.06103447079658508,
        -0.03856131434440613,
        -0.017670579254627228,
        0.05916037783026695,
        0.05883224308490753,
        -0.019180599600076675,
        -0.049545008689165115,
        0.07042665034532547,
        0.023728003725409508,
        0.05669545382261276,
        -0.01639460399746895,
        -0.03693993017077446,
        0.03501065820455551,
        0.003546722000464797,
        0.04331604763865471,
        0.011269734241068363,
        0.02676933817565441,
        0.0213431715965271,
        0.06856131553649902,
        0.06985829770565033,
        0.04683142527937889,
        0.009623932652175426,
        0.02250553108751774,
        -0.03632873669266701,
        -0.022384513169527054,
        0.06993868947029114,
        0.022454066202044487,
        -0.10202691704034805,
        0.009219208732247353,
        0.0012153995921835303,
        -0.03425959497690201,
        -0.0706542357802391,
        0.043883949518203735,
        -0.02413666807115078,
        -0.015452883206307888,
        -0.04131349176168442,
        0.002015986479818821,
        -0.024972787126898766,
        -0.06524238735437393,
        -3.675935404230408e-33,
        -0.04088139906525612,
        -0.021257102489471436,
        0.04631771519780159,
        0.012705831788480282,
        -0.013028251938521862,
        -0.047038767486810684,
        0.11038325726985931,
        0.1298346072435379,
        -0.008674836717545986,
        -0.0510282926261425,
        0.006725000683218241,
        0.021824689581990242,
        0.002923337509855628,
        -0.025592759251594543,
        -0.08155152201652527,
        -0.01782858557999134,
        0.014953004196286201,
        -0.02420327439904213,
        -0.02750222198665142,
        0.006601256318390369,
        0.05646464228630066,
        0.05533074587583542,
        0.032278068363666534,
        0.12263154238462448,
        -0.05459349602460861,
        0.0014863453106954694,
        -0.002854571444913745,
        -0.08174469321966171,
        -0.005395653657615185,
        0.009583246894180775,
        0.05985365808010101,
        -0.03832109272480011,
        -0.026975687593221664,
        0.02390325255692005,
        0.06524024903774261,
        0.04321310669183731,
        0.06646326184272766,
        -0.009087715297937393,
        0.013667688705027103,
        -0.06770919263362885,
        0.047923535108566284,
        0.035690903663635254,
        -0.06841748207807541,
        -0.07070086151361465,
        0.015331488102674484,
        0.01927504874765873,
        -0.008791709318757057,
        0.04099873825907707,
        0.008474179543554783,
        -0.008108501322567463,
        0.06820283830165863,
        -0.03531207889318466,
        0.054551247507333755,
        0.05669866502285004,
        0.028570506721735,
        0.04804237186908722,
        0.04197897017002106,
        -0.029708201065659523,
        -0.030429724603891373,
        0.018289074301719666,
        0.027169514447450638,
        0.08222229033708572,
        -0.023054473102092743,
        -0.04392249509692192,
        -0.013773346319794655,
        -0.059454064816236496,
        0.06464359909296036,
        0.028947163373231888,
        -0.003193080658093095,
        0.016859428957104683,
        -0.01363106444478035,
        0.008976072072982788,
        0.0217460747808218,
        -0.0013585812412202358,
        0.02315623126924038,
        0.07224827259778976,
        -0.10802822560071945,
        -0.04248083010315895,
        -0.04555608332157135,
        -0.03256852179765701,
        0.02829577960073948,
        -0.060661014169454575,
        -0.0003446788468863815,
        0.08105925470590591,
        0.1301429718732834,
        -0.02059418521821499,
        -0.012118727900087833,
        -0.020443178713321686,
        0.023780157789587975,
        0.010457414202392101,
        -0.09378130733966827,
        0.018720081076025963,
        -0.022071652114391327,
        -0.04327613115310669,
        0.017990704625844955,
        -4.535540298888918e-08,
        0.07052423804998398,
        0.0463489294052124,
        0.01246646698564291,
        -0.058277979493141174,
        -0.019376395270228386,
        -0.055191606283187866,
        0.045394837856292725,
        -0.08012349903583527,
        0.08109627664089203,
        -0.0910516008734703,
        -0.08325894922018051,
        -0.1179037094116211,
        -0.07639746367931366,
        -0.019412990659475327,
        -0.017585856840014458,
        0.001936106476932764,
        0.0613628625869751,
        0.054743442684412,
        -0.023772284388542175,
        -0.04476344957947731,
        -0.015371409244835377,
        0.0541284903883934,
        0.04885253682732582,
        0.008347636088728905,
        -0.03867897018790245,
        0.07237426191568375,
        -0.07447461038827896,
        0.003256332129240036,
        0.027293328195810318,
        0.016668401658535004,
        -0.02759714052081108,
        -0.06829489767551422,
        -0.06756104528903961,
        0.08629758656024933,
        -0.04954632744193077,
        -0.04042075201869011,
        -0.012853262946009636,
        -0.007303915917873383,
        0.11430977284908295,
        0.045231543481349945,
        -0.018584290519356728,
        -0.03303123265504837,
        -0.030847826972603798,
        0.02813859097659588,
        -0.025261957198381424,
        -0.12291263043880463,
        0.04933074116706848,
        -0.14360718429088593,
        -0.09583699703216553,
        0.030663762241601944,
        0.005321628414094448,
        0.0253906212747097,
        -0.07397523522377014,
        -0.02948111481964588,
        0.0010579961817711592,
        0.014058731496334076,
        0.11575313657522202,
        -0.023162715137004852,
        -0.007568718399852514,
        0.07120632380247116,
        0.08304301649332047,
        -0.050468966364860535,
        -0.0068757603876292706,
        0.06412861496210098
    ]
}