{
    "id": "qEWO68Tegf8",
    "title": "Totally Transparent Galaxy S9!! - Clear Smartphone Mod",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-03-11T17:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=qEWO68Tegf8",
    "category": "Howto & Style",
    "tags": [
        "Clear Galaxy S9",
        "Galaxy S9",
        "Samsung",
        "samsung galaxy s9",
        "mod",
        "smartphone",
        "android",
        "S9",
        "S9 plus",
        "s9+",
        "transparent s9",
        "clear smartphone",
        "teardown",
        "review",
        "hands on",
        "cool smartphone",
        "best smartphone",
        "disassemble",
        "fix",
        "repair",
        "S9 review"
    ],
    "views": 2036220,
    "likes": 45212,
    "comments_count": 3729,
    "description": "So much easier to Mod your Phone with These:  Its time to see if the Galaxy S9 can be made totally transparent! Samsung has been building their smartphone lineup with glass back panels lately. And the color on the back glass, along with the laminate layer, can be removed completely with a little persuasion.  While I dont recommend doing this to your own phone, since so many things can go wrong, Its still a fun project to watch.    I started making clear phones back with the Galaxy s7, after I saw a picture on Reddit of someone who had done the same thing. I think that Samsung should start making Clear S9's for everyone. What do you think?  Awesome Smartphone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/jerryrig-s9",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRig..."
    ],
    "transcript": "Let me start with, I highly recommend that no one attempt making their own transparent Galaxy S9. So many things can go wrong and there are plenty of safe ways to mod your phone without voiding the warranty, like dbrand skins or a case. Making a totally transparent phone is rather dangerous. Let's get started. [Intro] I'm going to turn the phone off and heat is our best friend during this project. The hotter the phone is, the softer the adhesive gets under the glass. A strong suction cup helps out as well. Once the phone is just barely too hot to touch, I'll get my metal pry tool slid between the glass and the metal frame of the phone, while the suction cup lifts up to relieve some of the pressure on the glass. After that initial penetration is made, I'll grab some business cards or card stock and slip little bits under the glass so it'll wrap around the curve without putting too much pressure on that edge. Glass is glass, and glass can break. The adhesive gets hard as it cools down, so I'll bump up the heat and continue slicing through the adhesive around the edge of the phone. Slice too deep though, and I'll risk damaging that fingerprint scanner ribbon or the wireless charging pad which you'll see revealed as I finally twist that back glass panel off to the side exposing the black plastic mid layers. The fingerprint scanner has it's own Lego style connector that popped off as I was removing the back glass. The little guy can press out from the camera lens housing and then I'll heat up the camera lens housing itself so I can separate that metal frame from the glass. The glass back itself needs to be clear of adhesive and hardware before we can actually make it clear. So once that glass camera lens is gone, I'll start pulling off all the extra adhesive left on the back panel. There's kind of a lot of it, but that's what makes the phone water resistant, so I can't complain too much. Now the adhesive is cleared, let's get rid of the black plastics and see how much of the phone's circuits we can expose. There are 15 Phillips head screws holding down the protective plastics, but once those screws out I can lift up the wireless charging pad and detach the top black plastic slab. We'll come back to this later. The rectangular black piece of plastic is less than mandatory so I'll toss that. And finally the loud speaker over the charging port can pull away. The buffer sticker between the battery and the wireless charging pad is probably not super important, so I'll pull that off and toss it. Interesting that there aren't any no dogs allowed warnings on this battery like we've seen on some of the Samsung batteries in the past. What's Inside will be happy about that one. Now I want this phone to be functional when I put it back together, so I'm going to keep the important components like this loudspeaker. This thin little portion off to the side though, only contains the water damage indicator and since my warranty is void at this point anyway, I'll toss that. After a teardown, phones aren't water resistant. Also 92% sure I don't need this other little plastic segment so I'll toss that. And now I can press the loud speaker back into place with the little silver screws that hold it snug. Now let me explain the wireless charging coil. I can turn the phone on at this point and everything is still working, but if I go to plug in the phone, it tells me that the phone temperature is too low and the battery won't charge. Obviously this is an issue if I want the phone to be useful. Turns out the wireless charging pad also has a battery temperature sensing niblet attached to it. And that temperature reading is required before the battery can charge. Samsung is pretty sensitive about battery safety nowadays for some reason. So I need to keep that wireless charging pad. I snipped away most of the nonessential plastics around the wireless charging and temperature niblet, leaving the circular connector pads and the screw holes next to the pads which hold the connections tight to the motherboard. I'm going to leave the wireless charging intact because I want my S9 to be fully functional when I put it back together. I'll screw those golden pads down. If you remember during my clear Galaxy S8 video, I snipped off the wireless charging, leaving just the contacts to the niblet. So that might very well be an option here with the S9 if I wanted to expose more of the motherboard. The phone now still turns on when the USB-C cable is plugged in. And the whole thing can charge now that the wireless coil's in place with the battery temperature sensor. Not too shabby. Now let's clarify some things...literally. In the past I've had use of some powerful paint stripper to remove the color from the underside of the glass. But this time around it looks to be a little easier, at least with this black color variant. There's still a tight black plastic laminate layer between the metallic color and the glass, but the whole thing can be peeled up and pulled off. If I were to drop this phone now that the laminate layer is removed, and the back glass panel were to crack, it wouldn't be held together anymore, and the large shards of glass would go everywhere like a glass cup accidentally dropped on a kitchen floor. So removing the laminate does add a bit of risk. Peeling away the color though is rather satisfying, just saying. Especially when it comes off in one big chunk. Now that the back panel is as clear as Russian collusion, I'll make sure the rest of the screws get screwed...kind of like we all did. And then I'll add a piece of double sided tape to each of the 4 sides, taking special care not to overlap the layers or leave any gaps so the tape will keep all the dust and pocket lint from entering under the glass and into the phone. I'll tuck the camera lens back into the slot it came from, along with our little fingerprint scanning friend with it's own little ribbon cable. I'll take special care to plug that in first before the glass goes down. And I'll make sure everything is clean before securing it in place. The tape is pretty strong stuff and doesn't like to let go of things it grabs onto. And it's finished. The phone is totally transparent and still totally functional with a working charging port. Which phone do you think looks best: my new S9, or the Note 8 with it's wireless charging port intact, or the Galaxy S8 with it's wireless charger removed so you can see the battery better? Let me know in the comments. And keep in mind while the transparent S9 might look sweet, it does void your warranty and won't be water resistant anymore. So I highly recommend simpler mods like this camouflage dbrand skin. I'll add a link in the video description for the entire dbrand selection, so show them some love for supporting my channel. And maybe come back again and watch this video after your S9 warranty expires. That way it won't be as big of a deal if you mess up and break the whole thing. Come hang out with us on Twitter and Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "wireless charging",
        "glass",
        "wireless charging pad",
        "phone",
        "charging",
        "wireless",
        "back",
        "back glass",
        "charging pad",
        "back glass panel",
        "battery",
        "adhesive",
        "black plastic",
        "black",
        "glass panel",
        "plastic",
        "pad",
        "glass back",
        "charging port",
        "camera lens"
    ],
    "transcript_entity_values": [
        "Phillips",
        "Samsung",
        "92%",
        "first",
        "Glass",
        "Galaxy S9",
        "the Galaxy S8",
        "niblet",
        "S9",
        "one",
        "15",
        "Galaxy S8",
        "Lego",
        "Twitter",
        "Instagram",
        "Russian",
        "4"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERCENT",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL"
    ],
    "vector": [
        -0.13201004266738892,
        0.039297766983509064,
        0.06111830100417137,
        -0.07988330721855164,
        0.07811333984136581,
        -0.025600546970963478,
        0.08444682508707047,
        0.043082695454359055,
        -0.07408692687749863,
        -0.01800474151968956,
        0.04096860811114311,
        0.021534770727157593,
        0.03236118704080582,
        0.026488004252314568,
        -0.0021760337986052036,
        -0.06800394505262375,
        0.051351916044950485,
        -0.04782945290207863,
        -0.013065671548247337,
        0.033396072685718536,
        0.03658323362469673,
        0.007399443071335554,
        0.0124149639159441,
        -0.07504609227180481,
        0.05246352404356003,
        0.002943664789199829,
        -0.0010152715258300304,
        -0.03657698631286621,
        -0.038502730429172516,
        -0.055894192308187485,
        0.025326330214738846,
        0.04409211501479149,
        -0.024866076186299324,
        0.0688285157084465,
        -0.01917303539812565,
        -0.14312535524368286,
        0.009482642635703087,
        0.03429098427295685,
        -0.03634016215801239,
        0.003470658091828227,
        -0.034043002873659134,
        0.008868078701198101,
        0.005614239722490311,
        -0.05529935285449028,
        0.003525483189150691,
        -0.05180785432457924,
        0.1512301117181778,
        -0.05346177518367767,
        -0.011465098708868027,
        -0.06636791676282883,
        0.005902388133108616,
        -0.0451434925198555,
        -0.033629484474658966,
        -0.005690660327672958,
        -0.06666968762874603,
        0.003617316484451294,
        0.005850720219314098,
        -0.09003057330846786,
        0.029524516314268112,
        -0.06751176714897156,
        0.06694205105304718,
        -0.03367345780134201,
        -0.04126837104558945,
        0.08850390464067459,
        0.02381950058043003,
        0.04875841736793518,
        0.02911856397986412,
        -0.06682007759809494,
        0.061833299696445465,
        -0.02322651632130146,
        0.04987163469195366,
        0.0643862634897232,
        0.036198943853378296,
        -0.023572811856865883,
        -0.021497348323464394,
        0.04050101339817047,
        0.05832782760262489,
        0.022456694394350052,
        -0.09251044690608978,
        0.026455216109752655,
        0.1176675334572792,
        -0.03828365355730057,
        -0.04369766265153885,
        0.01598467491567135,
        -0.01125572994351387,
        0.002984224120154977,
        -0.048827946186065674,
        0.06358776986598969,
        -0.05989024043083191,
        -0.01853489875793457,
        0.019029326736927032,
        0.096956767141819,
        -0.01964663900434971,
        -0.06611500680446625,
        -0.03006485104560852,
        -0.03812946006655693,
        -0.06132092699408531,
        -0.10136519372463226,
        -0.027073493227362633,
        0.07735340297222137,
        0.0017246350180357695,
        -0.01928647980093956,
        0.03203463926911354,
        -0.013746771030128002,
        0.042903609573841095,
        0.016159309074282646,
        -0.016382213681936264,
        0.03519720211625099,
        -0.028893956914544106,
        -0.02171245962381363,
        -0.01028676237910986,
        -0.005317858420312405,
        -0.030050771310925484,
        0.035472653806209564,
        -0.038736600428819656,
        -0.013007037341594696,
        0.06679932773113251,
        0.030400021001696587,
        0.05367930233478546,
        0.023264111950993538,
        0.00517660565674305,
        0.0443422831594944,
        -0.03880465775728226,
        -0.05530449002981186,
        0.05553191900253296,
        0.01381091307848692,
        -0.07775824517011642,
        3.61782814707537e-33,
        0.0433468297123909,
        0.10605627298355103,
        -0.02163001522421837,
        0.0025338539853692055,
        0.018320346251130104,
        0.0801386833190918,
        0.02641424909234047,
        0.031914517283439636,
        -0.051768675446510315,
        0.008381464518606663,
        -0.01641441322863102,
        -0.03382522612810135,
        -0.06801808625459671,
        0.02110118977725506,
        0.06312249600887299,
        -0.05843263864517212,
        0.0074096801690757275,
        -0.02824275940656662,
        -0.05372355878353119,
        -0.022969365119934082,
        7.824756175978109e-05,
        -0.01166277751326561,
        -0.043928954750299454,
        0.011133450083434582,
        0.07375248521566391,
        0.052746452391147614,
        0.09590208530426025,
        -0.02339816465973854,
        0.04825977981090546,
        0.03485757112503052,
        -0.07726120948791504,
        0.08298232406377792,
        0.059733375906944275,
        0.0537930428981781,
        -0.022837884724140167,
        0.05222183093428612,
        -0.05813506245613098,
        -0.07780256867408752,
        0.090736985206604,
        0.006652864161878824,
        -0.020109834149479866,
        0.04142579436302185,
        -0.04258537292480469,
        -0.00667564244940877,
        0.06064668297767639,
        0.01930783875286579,
        -0.026837026700377464,
        0.04558858275413513,
        -0.061332833021879196,
        0.023574098944664,
        0.05347609147429466,
        -0.0686071440577507,
        -0.02962653711438179,
        -0.08787085860967636,
        -0.11284957081079483,
        -0.03357565030455589,
        0.030145494267344475,
        -0.029520202428102493,
        0.002912129508331418,
        -0.04117385670542717,
        0.07207413762807846,
        -0.030466679483652115,
        -0.08915361762046814,
        0.03364402428269386,
        -0.03607612103223801,
        0.031706489622592926,
        -0.008794430643320084,
        0.010796036571264267,
        -0.0804828628897667,
        -0.03625037893652916,
        -0.03470301255583763,
        -0.06172536313533783,
        0.044272083789110184,
        -0.009255270473659039,
        0.05837618559598923,
        0.031201232224702835,
        0.0009306492283940315,
        -0.03335557505488396,
        0.05783345177769661,
        0.004582673776894808,
        -0.04900997877120972,
        0.011120322160422802,
        0.007934809662401676,
        -0.015039670281112194,
        -0.04536563530564308,
        -0.05449214577674866,
        0.01898452267050743,
        -0.017690839245915413,
        0.016022151336073875,
        0.028870001435279846,
        -0.0028745022136718035,
        -0.010785182937979698,
        0.006661258637905121,
        0.028014712035655975,
        -0.10454046726226807,
        -3.5831800837428985e-33,
        -0.012935285456478596,
        -0.01720973290503025,
        0.009658251889050007,
        0.03278159722685814,
        0.06288955360651016,
        -0.047137677669525146,
        0.0902736559510231,
        0.09986989200115204,
        0.036156393587589264,
        -0.03181588649749756,
        0.028282301500439644,
        0.037711251527071,
        -0.00651275971904397,
        -0.08492166548967361,
        -0.050620801746845245,
        -0.01981622353196144,
        0.03910645470023155,
        -0.048200082033872604,
        -0.06208145245909691,
        0.02207438461482525,
        -0.01578083634376526,
        -0.01280664000660181,
        0.04860463738441467,
        0.04938892647624016,
        0.0024475043173879385,
        -0.021424274891614914,
        0.042304735630750656,
        0.016784928739070892,
        0.04829870164394379,
        0.040990278124809265,
        -0.011858636513352394,
        -0.0841718539595604,
        0.04190352186560631,
        0.006917709484696388,
        0.006810527294874191,
        0.04393032565712929,
        0.05830957368016243,
        -0.013267375528812408,
        0.02988472767174244,
        -0.10263830423355103,
        0.05366213619709015,
        0.0212751142680645,
        -0.046884115785360336,
        -0.049162860959768295,
        -0.007844078354537487,
        -0.023085616528987885,
        -0.001610266393981874,
        0.057965364307165146,
        -0.041912827640771866,
        -0.008589991368353367,
        -0.017765142023563385,
        0.00856772717088461,
        0.00022402677859645337,
        -0.0044582318514585495,
        0.0022378454450517893,
        0.0362362302839756,
        0.07879214733839035,
        -0.039261236786842346,
        0.03828931227326393,
        0.010115663520991802,
        0.0985463559627533,
        0.08831001818180084,
        -0.06027904152870178,
        -0.08112028241157532,
        0.0008805450052022934,
        -0.055063970386981964,
        0.04991355910897255,
        0.0568893738090992,
        -0.010031296871602535,
        -0.06046532839536667,
        0.0037988824769854546,
        -0.07885874807834625,
        -0.035817939788103104,
        -0.0032978712115436792,
        0.12423209846019745,
        -0.023680055513978004,
        -0.03770733252167702,
        -0.0420449823141098,
        -0.009358965791761875,
        0.03357104957103729,
        0.004661197308450937,
        -0.020903468132019043,
        0.0415775328874588,
        0.022146733477711678,
        0.14688007533550262,
        -0.01525856088846922,
        0.032771483063697815,
        0.007116363383829594,
        -0.0032367350067943335,
        0.03408200666308403,
        -0.10900162905454636,
        0.015897953882813454,
        0.03133971244096756,
        0.047337308526039124,
        0.04558413475751877,
        -4.6500762351797675e-08,
        0.09179112315177917,
        0.00888160988688469,
        0.046441588550806046,
        -0.0018350462196394801,
        -0.0647900179028511,
        -0.059325963258743286,
        0.008039449341595173,
        -0.0740419551730156,
        0.05945677310228348,
        -0.1313788741827011,
        -0.00800870917737484,
        -0.0829785093665123,
        -0.076896071434021,
        0.05257133021950722,
        0.012473788112401962,
        0.0527702160179615,
        -0.03939804807305336,
        0.02237856015563011,
        -0.017007874324917793,
        0.021392568945884705,
        -0.08257094770669937,
        0.007000444456934929,
        0.017161065712571144,
        -0.026609499007463455,
        0.012336811982095242,
        0.10585159063339233,
        -0.10838440805673599,
        0.03466670215129852,
        0.11357736587524414,
        0.019793160259723663,
        0.0074389330111444,
        -0.029258986935019493,
        -0.005269644316285849,
        0.06090571731328964,
        -0.08891075849533081,
        -0.06144321709871292,
        -0.016006484627723694,
        -0.04190998896956444,
        0.07647818326950073,
        0.03978370130062103,
        0.027232782915234566,
        -0.06401781737804413,
        0.01383285317569971,
        0.05058014765381813,
        -0.04620477184653282,
        -0.06930121034383774,
        0.06441990286111832,
        -0.06096130609512329,
        -0.08038704097270966,
        0.025272667407989502,
        0.025101620703935623,
        -0.048211731016635895,
        -0.11098051816225052,
        0.013657595962285995,
        0.06635710597038269,
        -0.09652064740657806,
        0.15453799068927765,
        -0.024349570274353027,
        -0.054180409759283066,
        0.046681519597768784,
        0.05866675078868866,
        -0.011401979252696037,
        -0.040598295629024506,
        0.057972945272922516
    ]
}