{
    "id": "qfZ6yLeC1OI",
    "title": "PS5 - Unboxing the DualSense Controller!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-10-23T15:40:47Z",
    "video_url": "https://www.youtube.com/watch?v=qfZ6yLeC1OI",
    "category": "Science & Technology",
    "tags": [
        "ps5",
        "playstation 5",
        "dualsense",
        "dual sense",
        "ps5 unboxing",
        "ps5 controller",
        "controller",
        "ps5 dualsense",
        "ps5 hands on",
        "ps5 review",
        "playstation",
        "sony",
        "logic",
        "xbox",
        "ps4",
        "xbox series x",
        "dualshock",
        "vs",
        "ps5 teardown",
        "teardown",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 3615346,
    "likes": 129398,
    "comments_count": 8308,
    "description": "The PS5 controller: the PlayStation 5 DualSense unboxing!  I tested the new iPhone 12!  Follow @logic3230 on Twitch!   My new podcast @TheBackmarkers!  Our second channel @thisis!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/-u3J7lz0x7U",
        "https://www.twitch.tv/logic",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- This is the brand new DualSense controller for PS5, which we happen to have a little early. So why don't we take a deeper dive on what the PS5 controller is all about? - [Ken] Are you sure it won't be sand? - If there's sand inside this box, I'm gonna cry live on camera. So up front, DualSense wireless controller for PS5. We'll flip it over to the back; \"Haptic feedback, feel more \"with physically responsive feedback to \"your in-game actions, adaptive triggers.\" That's actually something I definitely wanna try. The built-in microphone, which is nice to have because I'm someone who doesn't usually keep a headset around, and signature comfort. Contents; \"DualSense wireless controller \"and an instruction manual.\" No USB-C? \"Compatible hardware, PlayStation Five.\" I hope that that's not always gonna be the case because it's gonna be really sad if this doesn't work on Android, iOS as a normal Bluetooth controller. All right, here goes nothing. Let's unbox the PS5 controller for the first time. And inside here... - [Ken] No, literally facing you. - This thing? This thing? - [Ken] Do you want me to unbox it for you? - Oh, this thing. Oh yeah, yeah, yeah, that. I saw that. Oh yeah! That is a DualSense controller. This isn't white at all, this is gray. All of the images make it look totally white. Wait, here, for comparison, this is a DualSense... or sorry, a DualShock four. Can you see a difference there? This looks so significantly grayer. All right, all right, before I look too much into the controller, that's literally all you get in the box. There's an instruction manual but there's no USB cable or anything like that. So what do you get with your $70 DualSense controller for PS5? Well, first of all, a very similar, familiar layout. So you have your D-pad here, which I will say, the D-pad is like one individual piece. So you can see that the entire thing moves as you tap it back and forth. You also do have your standard buttons, which actually have a little bit of a different feel to them. We have our clickable PlayStation button. Oh, oh, it's come alive, okay. Well, we'll ignore that for a moment. There's a physical button on here, which looks like it is for muting either your headset or, I assume, the actual mic. And you have your little touch pad, which feels very similar to what you got on the PS4. Now, the thumb sticks... I like, it's actually a very grippy kind of finish. So it's got that little dome on the inside so it's easy to grab. I mean, literally, no matter where I touch it, it's very, very grippy. \"I'm gonna teabag your mom.\" I don't know, is that what kids sound like on PSN these days? So on, top we have our triggers. Oh! That's actually really nice. This actually is surprisingly stiff. Not so much, the fact that you really have to crank it in, but you have a lot of sort of levels of sensitivity there. Interesting. Something I'll say with all of these buttons, they feel well damped, right? So if you use a lot of controllers, especially if you use like cheap controllers, you can tell that, oftentimes, you can see that it's a button but it kind of just feels sort of hollow. It doesn't feel very, I wanna say, premium but like you can kinda tell, it just feels a little cheapy. Every single of these buttons, I mean you can hear it. It's very like satisfying sounding. So of course we have our USB-C port down here. Nothing really on the back, short of, it looks to be, a little like pinhole. I wonder if this is how you reset it. There's a little QR code on the back. I wonder what happens when you scan the QR code. There we go, get the code. Oh, look, that exactly lines up with the actual number on the back of the PS5 controller. So I don't think you can see but it's really pretty sharp, whereas you look at something like the DualShock Four, it's much rounder on the bottom. So there's no doubt that the DualSense is a larger overall controller than what you get with the DualShock Four. Oh! Lookie, what we've got here. Yo, 'sup dude? - Why are you upside down? - You're upside down! - I said, it's like, we're looking in a sexy mirror. - All right, dude, look at this, look at this. - That's dope. - It is a lot bigger than the DualSense, or the DualShock Four. Like, if you put it like side by side... - I prefer Xbox controllers. - So I've got the Series X controller here. So the thing is they've got like the same layout. - Yo, I'm definitely gonna get the PS5. The controller's dope. I don't know, I think the PlayStation kind of looks ugly. But, I mean, we say that as ever since PS2, it's always been black, slim, to the point, whatever. I don't give a (censored) how it looks, I just want to play it. Thank you for showing me that. It means a lot, dude. - Yeah, of course, man. So when you put the DualSense controllers side by side with the Xbox Series X controller as well as the DualShock Four, there are a few things that really jump out. First of all, this guy seems tiny, right? Both of these controllers seem much larger. Specifically, the DualSense, actually, I think is the biggest of the three. I'm not gonna say that I need to tear this thing apart but I kind of want to see what's inside. Just a little bit, just a little bit. Welcome friends to a trip down bad idea lane, starting out with \"Let's do what no one \"in their right mind would ever try \"and think would remotely work.\" Let's plug the DualSense controller into an Xbox Series X. Does it make sense to try this before the PS4 or any of the other options that might have a slight chance of working? Of course. Am I going to do it anyway? Absolutely. Oh, it's charging. The PlayStation is harvesting its energy from the Xbox. Nope. Okay, don't plug this into your Series X. Let's try a PS4. So I don't think this is supposed to work. And is it going to work? - [Ken] Wait, wait, wait, wait, wait. Look, look, look, look. - Oh my God, the microphone works! Check! Check! Ah, it works! I mean, that sounds terrible. - Oh, look at that. - Is that... - Oh my God! - Is that it? - No, it is not! - Wait. No. - But it paired though. It showed up as a wireless controller. Wait a minute. - It's blue though. - It's connected. - And it's not to say that this, in the future, couldn't work with a PS4. I don't think they would necessarily-- - They wanna sell PS5s. - Yeah, absolutely. - This just got spicy, my friends! Spicy! Next up, we have one of the most hardcore gaming PCs that I own, the Surface Laptop Go. Is that because it's the only PC that I have that I don't have to go search for? Yes, yes it is. But hey, a PC is a PC, right? Oh, it works. Okay, so our X axis works. Our Z is a little bit weird but the top buttons work, rotation works, face buttons work. Dude, this is a fully functional PC controller. It might not be set up quite right. I would say, almost definitely, won't be. But I plugged it in and it just works right out of the box. Wireless controller, yes please! The DualSense is now paired with my Pixel 5, what happens if I press buttons? It works! It works as the home button! Wait, hang on. If I scroll... Dude, this 100% works. Now, let's play some Xbox games via XCloud with our DualSense controller. Yeah, buddy! I am playing an Xbox game using the DualSense 5 or the DualSense regular. So this certainly isn't the way I thought I would first test out the DualSense controller but there are some things that we can learn here. So of course, some of the things, some of the special features simply are not working here. So I don't have any of the vibration, I don't have any of the haptic feedback but what I do have as a good sense for how the controller feels. So there are a couple of things that jump out to me. I really like these triggers, even without the fact that I don't have that extra sort of level of feedback that I will when I'm playing on a PS5, but they just have a nice feel to them. Something else that's interesting, as I wildly go off the road, is the fact that this has a little bit of a looser style of stick than I'm used to. So especially, if you played a lot on the Xbox controller, you'll know that that is a little bit of a firmer feel. This actually feels a little bit lighter but I don't hate it. It's easy enough to control. I also really like the size of this controller. I don't exactly have huge hands but this feels very, very comfortable to me. But with very little setup, I am up and running, using the DualSense controller on Android and specifically, inside of Xbox Game Pass. We all know what time it is. - [Ken] We're gonna open it? - We're gonna open it. There's no clear way of doing this so I think my only way to do it is to start by getting some guitar picks in here and just trying to separate it from the chassis. Did you realize that all the bumps on the controller are tiny, little triangles and squares and circles? I know that phrase. It's all the face buttons. - That's really in there. Oh, Oh! - No, it's fine, that's fine. That's fine. Calm down, calm down, calm down. We got it, we got it. - Now would be a great time to remind you to subscribe to the channel and ring that notification bell because we have a whole lot more PlayStation content on the way soon. Including, who knows? Maybe a little bit of a in-depth look at the PS5 itself. And not, it's horribly mangled controller friends. - So update, this now looks like nightmare fuel but we've gotten at least the first level. So we can start to see the rumble motors in the controller. We see some circuit boards. Now, the main thing is just trying to detach it from the top. - Yeah, that's it, that's it. Boom! - Well, we broke it but it's fine. - Oh, we did break it, well... - That's okay. Whatever. For science! For science! - So inside we have what are pretty major rumbles in the actual handle themselves. You also see that the impulse triggers. There's a whole lot going on here. I'm not sure if you can quite see that but essentially, right below the trigger, there's this huge mechanism here which, well I can't actually get it to fire up. Now we also do have our 1560 mAh battery. This part, if I was going to say any part of this controller is mildly user serviceable, it would probably be the battery. You can kind of get the battery out without destroying everything. The main problem we had was removing this shell. You see that the plastic is very complex shapes would actually come in underneath where the triggers are and it's really hard to get that out without breaking, so maybe some slight damage there. But I think we actually can get this back together and it should work. This has two microphones. Wait, you see this? So there's a microphone right here, which is what you would see on this part of the controller, right? So it's like right below where the PlayStation logo is. But if you look on the back, there's a second microphone which lines up with the little hole right here. - [Ken] Well maybe, that's like a noise-canceling microphone? - Yeah! So I guess it doesn't have to listen to the sounds of your hands furiously clicking in Red Dead Three. - [Matt] Sure it's not a speaker? - No, 'cause the speaker, you can see, is actually right here and the speaker is actually fairly large. The speaker looks like an HDMI port from here. There is a whole lot of tech that is crammed into the DualSense controller, which makes sense, especially at 70 bucks. But until next time, thank you very much for watching. Make sure to subscribe to the channel for more PS5 content like this. And I will now go and spend the next three hours trying to reassemble this and maybe go get some super glue.",
    "transcript_keywords": [
        "controller",
        "DualSense controller",
        "DualSense",
        "Xbox",
        "works",
        "Wait",
        "work",
        "DualSense wireless controller",
        "wireless controller",
        "yeah",
        "bit",
        "buttons",
        "thing",
        "lot",
        "Xbox Series",
        "feel",
        "feels",
        "back",
        "kind",
        "Xbox controllers"
    ],
    "transcript_entity_values": [
        "Ken] Wait",
        "5",
        "70 bucks",
        "Pixel 5",
        "three",
        "first",
        "PlayStation",
        "DualShock",
        "USB",
        "Xbox",
        "two",
        "PS4",
        "Matt",
        "PS4",
        "Xbox",
        "four",
        "100%",
        "XCloud",
        "Red Dead Three",
        "DualShock Four",
        "these days",
        "one",
        "the Surface Laptop Go",
        "second",
        "DualSense",
        "PS5",
        "PlayStation Five",
        "70",
        "Four",
        "Yo",
        "1560",
        "a minute",
        "PSN",
        "Xbox Game Pass",
        "First",
        "the next three hours",
        "Android"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "ORG"
    ],
    "vector": [
        -0.07379104197025299,
        -0.07856620103120804,
        0.025143954902887344,
        -0.01697247475385666,
        0.12811604142189026,
        -0.024327900260686874,
        0.056876786053180695,
        -0.019045161083340645,
        0.0012786550214514136,
        0.07099264860153198,
        -0.006453503854572773,
        0.008083845488727093,
        -0.0526268444955349,
        -0.06632544100284576,
        0.036870259791612625,
        0.01715024933218956,
        0.07821441441774368,
        -0.026663081720471382,
        -0.03053477220237255,
        0.02227875217795372,
        -0.006200501695275307,
        -0.02429792284965515,
        0.06981908529996872,
        0.0378604382276535,
        -0.04021359607577324,
        0.04027391970157623,
        -0.0409337542951107,
        0.039786044508218765,
        -0.05766282230615616,
        -0.05390539765357971,
        -0.02720467746257782,
        -0.0641084685921669,
        -0.06788182258605957,
        -0.01777581125497818,
        -0.024194074794650078,
        -0.06715906411409378,
        0.01891927234828472,
        0.007024836726486683,
        -0.08769438415765762,
        -0.08504877984523773,
        -0.05814433842897415,
        -0.012932110577821732,
        -0.01317824050784111,
        0.04208206385374069,
        0.030098697170615196,
        0.03615139052271843,
        -0.029684267938137054,
        -0.06279432028532028,
        -0.0023589408956468105,
        0.0015226026298478246,
        0.015463555231690407,
        -0.07068668305873871,
        0.10975945740938187,
        0.003298447234556079,
        -0.09512463212013245,
        0.056780122220516205,
        -0.009199084714055061,
        0.017287857830524445,
        0.03700229898095131,
        -0.04845655336976051,
        0.011161798611283302,
        -0.027840768918395042,
        -0.0023490965832024813,
        -0.029175909236073494,
        -0.0007552633178420365,
        0.0015106021892279387,
        0.0380910262465477,
        0.004285039380192757,
        0.10624464601278305,
        0.044060055166482925,
        -0.06817490607500076,
        0.059023667126894,
        0.06919676810503006,
        0.014710646122694016,
        0.012841301038861275,
        -0.08515570312738419,
        -0.004510290455073118,
        -0.0036771937739104033,
        -0.006696684285998344,
        0.058974094688892365,
        0.059424228966236115,
        -0.01683107577264309,
        -0.06591416895389557,
        -0.059732794761657715,
        0.026349302381277084,
        0.008385739289224148,
        -0.04418591409921646,
        0.05542609095573425,
        -0.07044793665409088,
        -0.09984338283538818,
        -0.08956974744796753,
        -0.017248639836907387,
        0.01777859963476658,
        0.010414975695312023,
        -0.057503558695316315,
        -0.06024682894349098,
        -0.10170053690671921,
        -0.018082395195961,
        -0.03590228036046028,
        0.026659714058041573,
        0.02037803642451763,
        -0.022984247654676437,
        -0.02199694700539112,
        -0.0246109701693058,
        0.04487823322415352,
        -0.06380746513605118,
        -0.06875448673963547,
        -0.07457182556390762,
        0.030283883213996887,
        0.021786795929074287,
        -0.11490066349506378,
        0.028609657660126686,
        -0.051725856959819794,
        0.0660458356142044,
        0.07973885536193848,
        0.09805502742528915,
        -0.06766508519649506,
        0.0390150249004364,
        0.010716097429394722,
        -0.04528306797146797,
        0.010270781815052032,
        -0.07134325802326202,
        -0.08356378227472305,
        0.016272781416773796,
        0.039827652275562286,
        -0.015469087287783623,
        -0.062257010489702225,
        3.1716597153291704e-33,
        -0.016532106325030327,
        0.11968908458948135,
        0.07055279612541199,
        0.026559453457593918,
        0.014555024914443493,
        0.014422462321817875,
        0.03851594030857086,
        -0.011156311258673668,
        -0.011301986873149872,
        0.12507830560207367,
        -0.008065964095294476,
        0.005442518275231123,
        -0.07585280388593674,
        0.06016060709953308,
        0.07919483631849289,
        -0.03738414868712425,
        -0.06759911775588989,
        -0.03224163502454758,
        0.04239622876048088,
        -0.07265137135982513,
        -0.013847081921994686,
        0.05663854628801346,
        -0.05690674111247063,
        0.06543322652578354,
        0.07865320146083832,
        0.08443226665258408,
        0.05587274208664894,
        0.016851918771862984,
        0.06597496569156647,
        0.016387714073061943,
        -0.11143972724676132,
        -0.04329574108123779,
        -0.035695359110832214,
        -0.013240667060017586,
        0.07801412791013718,
        0.022083934396505356,
        -0.03588350862264633,
        0.010315378196537495,
        -0.00713856378570199,
        -0.006040716078132391,
        0.03291262686252594,
        -0.013538727536797523,
        -0.044282007962465286,
        -0.03754153847694397,
        0.02845659665763378,
        -0.062037646770477295,
        -0.04333317652344704,
        -0.009764383547008038,
        -0.064784936606884,
        -0.08216312527656555,
        -0.02288958989083767,
        -0.0034594216849654913,
        -0.011788897216320038,
        0.014314512722194195,
        -0.012558947317302227,
        -0.13962480425834656,
        0.04276219382882118,
        0.0017893374897539616,
        0.02931681089103222,
        0.04737775772809982,
        0.06486960500478745,
        -0.08509892225265503,
        -0.0034510528203099966,
        0.0009268850553780794,
        -0.07540550827980042,
        0.08929122239351273,
        0.041593264788389206,
        0.019070006906986237,
        0.047670476138591766,
        -0.014528464525938034,
        -0.049176160246133804,
        0.11331745982170105,
        0.007794123142957687,
        -0.017282860353589058,
        -0.027526499703526497,
        0.04649164527654648,
        -0.053136128932237625,
        -0.01855245977640152,
        -0.0011961495038121939,
        0.06485727429389954,
        -0.021896446123719215,
        0.02819395251572132,
        -0.051259398460388184,
        0.11137295514345169,
        0.0011111374478787184,
        -0.051162686198949814,
        0.03314585983753204,
        -0.055680014193058014,
        -0.08149237930774689,
        0.04890086501836777,
        0.006552019622176886,
        0.025525996461510658,
        0.02669118344783783,
        0.03964005410671234,
        -0.044836629182100296,
        -5.639539575219514e-33,
        -0.0054031796753406525,
        -0.03374341130256653,
        -0.03060539998114109,
        0.029653072357177734,
        -0.016552774235606194,
        0.02454272098839283,
        0.06629892438650131,
        0.0014813158195465803,
        -0.010440721176564693,
        -0.05018659681081772,
        0.015097477473318577,
        -0.06281210482120514,
        -0.0001621311530470848,
        0.09397321939468384,
        -0.003807571018114686,
        -0.020281298086047173,
        -0.07741451263427734,
        0.025511885061860085,
        0.11189576238393784,
        0.05947161093354225,
        0.13049690425395966,
        0.10818668454885483,
        0.039135731756687164,
        0.05828235670924187,
        -0.018056180328130722,
        -0.021805904805660248,
        -0.007053897250443697,
        0.015100750140845776,
        -0.006555971223860979,
        0.023441972211003304,
        -0.03803124278783798,
        -0.05315938964486122,
        0.07151704281568527,
        -0.04229239374399185,
        0.01123026292771101,
        -0.0016370182856917381,
        0.0386747345328331,
        -0.02258802019059658,
        -0.0260628554970026,
        -0.026159584522247314,
        -0.02804182656109333,
        0.050525251775979996,
        0.0011092856293544173,
        -0.020794788375496864,
        0.02660219371318817,
        -0.00970159750431776,
        -0.01773919351398945,
        0.04150567576289177,
        -0.016319958493113518,
        0.03472112864255905,
        0.040070079267024994,
        -0.025743599981069565,
        -0.09056977182626724,
        -0.05487614870071411,
        -0.021953517571091652,
        -0.025911472737789154,
        0.0003723970730789006,
        -0.013933656737208366,
        -0.006862577982246876,
        0.0408056378364563,
        0.03610881045460701,
        0.024054497480392456,
        -0.06328250467777252,
        -0.000522473594173789,
        0.09656205773353577,
        0.06790371239185333,
        0.13677097856998444,
        0.023631276562809944,
        0.06110461428761482,
        0.004246136173605919,
        -0.04500067979097366,
        0.03848215565085411,
        0.0900413766503334,
        0.00045624523772858083,
        0.09384330362081528,
        0.06169317290186882,
        -0.029262082651257515,
        -0.05501888692378998,
        0.004420335870236158,
        -0.017320886254310608,
        -0.12261378765106201,
        -0.037404514849185944,
        0.043947700411081314,
        0.04802664741873741,
        0.06577518582344055,
        0.05433311313390732,
        0.0002556330873630941,
        0.0069851805455982685,
        0.010687110014259815,
        -0.021966740489006042,
        0.016223935410380363,
        0.023430559784173965,
        0.02622852846980095,
        0.021919116377830505,
        -0.023653870448470116,
        -5.688229620659513e-08,
        0.03469840809702873,
        0.013334871269762516,
        0.005100028123706579,
        -0.055397260934114456,
        -0.02482626773416996,
        -0.05326041579246521,
        -0.030001286417245865,
        -0.07503591477870941,
        0.02107420563697815,
        -0.02518864907324314,
        0.02545711025595665,
        -0.013367313891649246,
        0.0038220847491174936,
        0.024299347773194313,
        -0.01263774186372757,
        0.029536893591284752,
        -0.06160945072770119,
        0.10536855459213257,
        -0.009437532164156437,
        -0.041337184607982635,
        0.010710830800235271,
        0.056372787803411484,
        -0.004343138076364994,
        -0.03160644322633743,
        0.057759884744882584,
        -0.028542324900627136,
        -0.05609320476651192,
        0.03131968155503273,
        0.030606072396039963,
        -0.03226367011666298,
        -0.024365535005927086,
        -0.06463787704706192,
        -0.02921319007873535,
        0.02888062410056591,
        -0.07080728560686111,
        -0.023465603590011597,
        -0.05261498689651489,
        0.0024079398717731237,
        0.0050964648835361,
        -0.010465464554727077,
        -0.04763813316822052,
        -0.04986920580267906,
        -0.11272470653057098,
        0.0030701574869453907,
        -0.001187157817184925,
        -0.03858165070414543,
        0.025974519550800323,
        -0.1688990443944931,
        -0.06524024903774261,
        0.021265743300318718,
        -0.09138413518667221,
        -0.002885900205001235,
        0.08539687097072601,
        0.01612592302262783,
        0.1335248351097107,
        0.09429094195365906,
        0.013076581992208958,
        -0.017059531062841415,
        -0.036690693348646164,
        0.026503346860408783,
        -0.02273034118115902,
        -0.006858265958726406,
        -0.06236393377184868,
        0.09395430237054825
    ]
}