{
    "id": "QgrVVyIzecM",
    "title": "There’s NO WAY this works - Debunking bogus network splitters.",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-08T16:55:50Z",
    "video_url": "https://www.youtube.com/watch?v=QgrVVyIzecM",
    "category": "Science & Technology",
    "tags": [
        "networking",
        "ethernet",
        "network splitter",
        "ethernet splitter",
        "cat5",
        "cat5 splitter",
        "cat6",
        "cat6 splitter",
        "scam",
        "fake spitter",
        "debunking",
        "rj45",
        "rj45 splitter",
        "network switch",
        "ethernet switch"
    ],
    "views": 4116847,
    "likes": 99047,
    "comments_count": 4903,
    "description": "Get a free 30-day trial with AutoDS at:   Ethernet splitters are all over the internet, but arent they just a scam to steal from the uninformed? Well, mostly. But with a little knowledge of the history of networking, you really CAN run two devices over a single network cable!  Discuss on the forum:    Buy a TP-Link 5 Port Gigabit Ethernet Switch:  Buy a TP-Link 5 Port Ethernet Switch:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:15 Andy's Car Collection 1:14 Let's try them out! 2:16 The Headphone Splitter 4:06 What's going on here? 5:40 Networking like it's 1999 6:51 But Linus... 8:55 Outro",
    "description_links": [
        "https://platform.autods.com/register?ref=NDAxMTY5",
        "https://linustechtips.com/topic/1511843-there%E2%80%99s-no-way-this-works/",
        "https://lmg.gg/lp5ev",
        "https://lmg.gg/3F5f5",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- On the surface, this is the most sensible thing in the world. If I have one Ethernet jack, but two devices to plug in, why not use a splitter? Splitters are great. They work for everything from headphones to coax, video to power, except that's not how Ethernet works, meaning that all of these devices on Amazon are big fat scams, or are they? While these ones don't work, and I'm gonna explain why in a moment. We actually managed to make our own splitters that do work. It's just a little bit more complicated than a traditional Y cable. We're gonna talk about that in a moment. First, a closer look at the world ge... Oh boy, I'm not even gonna try. They mostly call it Ethernet splitter in their marketing. So let's go with that. Looking at this thing, you could easily assume that you just plug this end into anywhere you want and it turns one Ethernet port into two. But if we look at the product page, all of the different ways that you can use them, pretty much boil down to the same thing. Splitting a single Ethernet cable, say one that runs from your garage to your living room into two separate physical connections on both ends, which doesn't really sound like a scam at all. In fact, that sounds great. Come over here. Let's pretend that this side of the table is my garage. This basic switch is gonna represent our home internet router. Then this side is the living room, where I sit on beanbag chairs, and also wanna plug in my Nintendo Switch and my Xbox. Unfortunately, whoever built my house, only ran a single Ethernet cable between these two spaces. No matter, we'll simply put a splitter in each of the rooms, then plug in our devices. A voila! More like a wab. Neither of them has a connection, meaning that all we've managed to accomplish is turning our jack here into jack all. But hold on a second. What if we disconnect one of these from either end? And there it is. Huh! What the heck is going on here? We haven't even told you about our sponsor. AutoDS. Wanna manage an e-commerce business, but worried about the costs of managing inventory? Don't know how to find the right products to sell? Stay tuned to the end of this video to find out how AutoDS can help. You've probably encountered a headphones splitter before. These are made by simply wiring a single plug up to multiple jacks, allowing you and your friend to enjoy the same mixtape on the school bus. And this works because it's an analog signal. It's kind of like a river with the water being your music. Splitting that river into two or even more might reduce the amount of water or the volume, but it's still the same water. By contrast, a network connection is digital, which okay, is still just electrical pulses on a wire. But it's different because the ones and the zeros are flowing bidirectionally as the connected devices communicate with each other. So back to our garage here. If my router sends out a data packet, it expects to receive confirmation that it arrived safely. So if I had two devices hooked up to that port, it wouldn't know what to do with it. With that said, the diagram on the product paid for this isn't entirely unreasonable. There are enough conductors inside a modern Ethernet cable to support more than one physical connection. So how would that work? Okay, we really are gonna get to it, but first, you might have heard these network cables referred to as Cat 5 or maybe Cat 6 cables. The exact label doesn't matter much for what we're talking about. What you need to know is that these Cat or category cables have eight individual wires inside them that are twisted together into four pairs. And here's the thing, older standards, like 100Base TX, which runs at 100 megabit per second only used two of those pairs. So if we don't need to run gigabit or higher speeds, we've actually got enough pairs for two of those slower connections, which well, wait a second then, this splitter should have worked. Hey, what's going on here? (machine whirring) I must look ridiculous. Am I just completely covered in schmoo. Is my face schmoo covered? - [Andy] Yep. - Okay, great. Yes, there we go. Look at that. I even managed to mostly non-destructively do this. Oh, am I not done yet? Oh, crap. (machine whirring) Wait for it. Yes! Yes! I got it. Holy crap, every contact goes to both sides. It's wired just like a headphone splitter would be. Now we could have confirmed this with a multimeter and in fact we did, but this was way more fun. So what you're looking at here is all the pin 1s are wired together, as are all the pin 2s, 3s, and so on, all the way to pin 8. So you could try to use these things exactly like they show on the product page and they're not going to work. Now, some of the brands marketing these things are more honest. This one we're looking at clarifies that it only works if one of your devices is powered on at a time. But that's pretty useless, especially considering that you can get a full on Ethernet switch for $9 or a gigabit capable one for $16. Those will allow you to share that single jack with up to four devices all at the same time without bandwidth restrictions to each one. We're gonna have those linked down below. However, that doesn't mean that we're done with our janky splitters yet. I mean, if a real one could be made, then obviously a real one should be made. To hell with your ethics Dr. Malcolm! 100Base T uses pins 1 and 2 to transmit and pins 3 and 6 to receive. So we wired up ours A ends using just the orange and green pairs. I should note that we used the T568B color coating so orange for transmit, green for receive. Then for the B end, we decided to use the blue pair as our transmit on pins 1 and 2, and the brown pair as our receive on pins 3 and 6. Then on the combined end, we just followed the T568B coating. As long as you're not mixing a transmit and a receive pin onto the same twisted pair, you should be okay. With that said, you do wanna pay special attention to the labeling on whatever keytones you use. You cannot assume that the connectors will be a numerical order. Now let's try it. All we gotta do is unplug this worthless adaptor. See, just like before. I gotta say this, this is kinda thing that in a hundred years never would've occurred to me. Now give it a second. Boo-poro-boo! I am now the proud owner of two rock solid 100Base T connections between my garage and my living room. Bananas. A hundred megabit is so slow you might say, and well, yeah, but also, no. I mean, if you wanna transfer big files back and forth between machines on a network, then maybe this isn't a good solution. You should definitely go buy a switch. I mean, $9, guys. But if you're just trying to get a couple of machines online with a reliable wired connection so you could watch exclusive behind the scenes content on floatplane.com/ltt, ours at least does what it says on the tin. And with the average internet speed in the US being barely over 100 megabit, statistically speaking, you're probably not actually giving anything up. But before you run out and try this, there's a couple of other things to consider. And I mean, aside from the fact that a switch costs $9, like POE or Power Over Ethernet. While this method should allow for Mode A POE to work as normal, Mode B or four pair POE will definitely not work and could cause some serious damage to your equipment if you try it. Of course, if you've got POE equipment, you're probably not resorting to hacks like this. Whether we're talking the potentially scammy commercial ones or our functional DIY versions. Functional, like this functional segue to our sponsor. AutoDS. AutoDS is a dropshipping platform that's dedicated to equipping you with the necessary tools to kickstart your own e-commerce business. The best part, you can sell products on various platforms like Shopify, Amazon, eBay, and more. You can get access to over five hours of free courses that will guide you through the starting process. Explore the AutoDS marketplace and choose from millions of trending products. The marketplace also allows you to filter and narrow down products so you can recommend items that truly resonate with your audience. If you're having trouble deciding on a product, AutoDS has you covered their winning product feature. It provides hand-picked pre-vetted products along with advanced analytics, insights, and revenue projections. Once orders start rolling in, you can leverage the built-in automation features and let your business practically run itself. Start today and enjoy a free 30-day trial with AutoDS at the link down below. If you liked this video, you might wanna watch the one I did upgrading my home network to 10 gig, 'cause I guess you're into networking or something.",
    "transcript_keywords": [
        "Ethernet",
        "Ethernet cable",
        "single Ethernet cable",
        "work",
        "single Ethernet",
        "splitter",
        "devices",
        "AutoDS",
        "Ethernet splitter",
        "product",
        "products",
        "Ethernet works",
        "thing",
        "end",
        "plug",
        "POE",
        "switch",
        "Ethernet switch",
        "receive",
        "pin"
    ],
    "transcript_entity_values": [
        "Ethernet",
        "one",
        "second",
        "TX",
        "four",
        "1s",
        "16",
        "first",
        "POE",
        "eBay",
        "millions",
        "100 megabit",
        "eight",
        "a hundred years",
        "First",
        "over five hours",
        "zeros",
        "6",
        "today",
        "Power Over Ethernet",
        "Amazon",
        "Nintendo Switch",
        "10",
        "Y",
        "1",
        "DIY",
        "8",
        "Xbox",
        "barely over 100",
        "jack",
        "Malcolm",
        "3",
        "US",
        "Cat 5",
        "a second",
        "Shopify",
        "30-day",
        "2",
        "100Base",
        "two",
        "9",
        "A hundred megabit",
        "more than one"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.10326697677373886,
        -0.07242312282323837,
        0.07980402559041977,
        -0.09070740640163422,
        0.06275979429483414,
        0.05585644394159317,
        -0.027691179886460304,
        0.04080752655863762,
        -0.036107975989580154,
        0.028490321710705757,
        0.028259143233299255,
        0.009959631599485874,
        0.0226980559527874,
        -0.05688875913619995,
        0.02418818511068821,
        0.0068128579296171665,
        -0.01522811409085989,
        -0.08829756826162338,
        -0.03479195386171341,
        -0.00035831393324770033,
        0.04944693297147751,
        -0.02871832251548767,
        -0.004120307043194771,
        -0.024866141378879547,
        0.060582585632801056,
        -0.04199333116412163,
        0.041233569383621216,
        -0.05351417139172554,
        -0.03479750081896782,
        -0.041026316583156586,
        0.07351088523864746,
        0.013860846869647503,
        -0.13942235708236694,
        -0.002719873795285821,
        -0.04624691605567932,
        -0.07452476769685745,
        -0.01512332633137703,
        -0.021104004234075546,
        -0.044875890016555786,
        -0.03232879936695099,
        0.0859656110405922,
        -0.057995159178972244,
        -0.053555190563201904,
        -0.03996437415480614,
        -0.027837831526994705,
        -0.04138379916548729,
        -0.014225607737898827,
        0.00959058292210102,
        0.0555783249437809,
        0.0008910166216082871,
        0.0008020203094929457,
        0.004784934688359499,
        0.019578583538532257,
        0.02768520638346672,
        0.019773710519075394,
        0.04945510998368263,
        -0.035172950476408005,
        0.024066055193543434,
        -0.02674960345029831,
        0.03274945914745331,
        0.015080227516591549,
        0.02136554941534996,
        -0.018936660140752792,
        0.030130641534924507,
        0.005536534823477268,
        -0.00226832483895123,
        2.124147067661397e-05,
        0.09893175214529037,
        -0.042244404554367065,
        -0.03356439247727394,
        -0.023597875609993935,
        -0.03147165849804878,
        0.05484496057033539,
        0.12299001961946487,
        0.05460035800933838,
        0.04284793138504028,
        0.07099413871765137,
        -0.011072560213506222,
        0.025570804253220558,
        -0.021792905405163765,
        -0.01748540997505188,
        0.028219304978847504,
        -0.0011306166416034102,
        -0.03793342038989067,
        -0.02237766794860363,
        -0.039066530764102936,
        -0.018936755135655403,
        0.03506937995553017,
        -0.025299469009041786,
        -0.11432495713233948,
        0.01955929584801197,
        0.059427693486213684,
        0.0625569224357605,
        0.08379294723272324,
        0.03604135289788246,
        -0.02923557162284851,
        -0.08041113615036011,
        -0.07014144957065582,
        0.005826473236083984,
        0.04270973429083824,
        -0.010855259373784065,
        0.020150166004896164,
        0.009434379637241364,
        -0.06304723024368286,
        -0.029821431264281273,
        -0.08232872933149338,
        -0.02877633459866047,
        -0.031565967947244644,
        0.06006971001625061,
        -0.0435064360499382,
        -0.06736601144075394,
        0.05464406684041023,
        -0.07818669825792313,
        0.015968138352036476,
        0.018260713666677475,
        0.03036751225590706,
        -0.006790515501052141,
        0.04214354231953621,
        0.09835562855005264,
        -0.07639382779598236,
        -0.12020996958017349,
        -0.045551057904958725,
        0.05468936637043953,
        0.05566275492310524,
        0.08449111878871918,
        0.03297759220004082,
        0.022175850346684456,
        5.1451935075048626e-33,
        -0.03889964520931244,
        0.02288725972175598,
        -0.046308912336826324,
        -0.009281228296458721,
        0.03906720504164696,
        0.0380500964820385,
        -0.018728487193584442,
        0.047708310186862946,
        -0.028260378167033195,
        0.010198123753070831,
        -0.09993308782577515,
        -0.009121953509747982,
        -0.016319427639245987,
        0.0043576788157224655,
        -0.010869831778109074,
        -0.03490626811981201,
        -0.003208897076547146,
        -0.023282650858163834,
        0.08751127123832703,
        -0.03493668511509895,
        -0.036674026399850845,
        0.04585222527384758,
        0.05649993196129799,
        -0.019260477274656296,
        -0.004594061523675919,
        -0.08955317735671997,
        0.00387124577537179,
        -0.0696486085653305,
        0.10821470618247986,
        0.04534406587481499,
        -0.07961898297071457,
        -0.032313186675310135,
        0.0522289015352726,
        0.02319556102156639,
        -0.011532663367688656,
        0.08069509267807007,
        -0.0915369912981987,
        -0.023679612204432487,
        -0.02566167712211609,
        0.0568055585026741,
        0.029010964557528496,
        -0.05358441174030304,
        -0.027435187250375748,
        -0.12834694981575012,
        -0.10703285783529282,
        -0.04658918082714081,
        -0.05460586026310921,
        0.032344039529561996,
        -0.03213668242096901,
        0.030746985226869583,
        0.047338150441646576,
        0.022432617843151093,
        -0.05532330647110939,
        0.012956774793565273,
        0.04959690943360329,
        -0.012666388414800167,
        -0.03195562958717346,
        0.014255567453801632,
        0.149267315864563,
        0.027333838865160942,
        -0.004338826518505812,
        -0.008609251119196415,
        -0.019482308998703957,
        0.05400194972753525,
        -0.059330280870199203,
        0.056332629173994064,
        0.09257478266954422,
        -0.04436947777867317,
        -0.018851350992918015,
        -0.0098738307133317,
        -0.06241314113140106,
        -0.010208376683294773,
        0.009604198858141899,
        -0.07258015125989914,
        0.01837032660841942,
        0.03686193376779556,
        -0.11266059428453445,
        -0.04909225553274155,
        0.06863430142402649,
        0.06015881150960922,
        -0.07656458020210266,
        0.03459877148270607,
        0.07501671463251114,
        0.030310094356536865,
        0.050872042775154114,
        0.0535702183842659,
        0.007676732260733843,
        -0.020624008029699326,
        -0.04686318337917328,
        0.10765096545219421,
        -0.0019776476547122,
        -0.0070037576369941235,
        -0.028752146288752556,
        0.025215867906808853,
        0.06858621537685394,
        -5.859622974420155e-33,
        -0.07983680814504623,
        0.064032182097435,
        -0.04290297254920006,
        -0.008562961593270302,
        0.04360925033688545,
        -0.08163783699274063,
        0.06298056244850159,
        -0.01468074694275856,
        0.02074820175766945,
        0.011418416164815426,
        0.03622525557875633,
        -0.02255571261048317,
        -0.01490161381661892,
        -0.044278182089328766,
        -0.010439161211252213,
        -0.16813765466213226,
        0.07204760611057281,
        -0.023689843714237213,
        0.06420132517814636,
        0.014815573580563068,
        0.09024810791015625,
        -0.03962957486510277,
        0.027781302109360695,
        0.009235544130206108,
        0.028380807489156723,
        0.023859305307269096,
        0.08051019161939621,
        0.04274851828813553,
        -0.01541045494377613,
        0.04579421505331993,
        -0.011872336268424988,
        -0.024687521159648895,
        0.02388077788054943,
        -0.012394070625305176,
        0.06402508914470673,
        0.07066863775253296,
        -0.008003599010407925,
        0.1365264356136322,
        -0.004719950258731842,
        -0.048979662358760834,
        -0.03978165611624718,
        -0.04947083815932274,
        -0.04653904587030411,
        -0.016778450459241867,
        -0.010835330933332443,
        -0.08428246527910233,
        -0.07605287432670593,
        -0.039253368973731995,
        -0.09494607895612717,
        0.002650315873324871,
        0.014303520321846008,
        0.014491432346403599,
        0.07380140572786331,
        -0.003123615635558963,
        -0.0012671294389292598,
        -0.02644514851272106,
        0.026694996282458305,
        0.07554443925619125,
        -0.05732608586549759,
        0.08384165912866592,
        0.08490186929702759,
        -0.0527242012321949,
        -0.08780688792467117,
        0.032009996473789215,
        0.0720585286617279,
        -0.04150243476033211,
        0.044567760080099106,
        -0.031893644481897354,
        -0.0577884204685688,
        0.04511283338069916,
        0.02884889952838421,
        0.07160675525665283,
        0.06143483892083168,
        -0.07349296659231186,
        0.02159203216433525,
        0.02157437428832054,
        -0.03769056871533394,
        0.019598325714468956,
        0.043459467589855194,
        0.000996204325929284,
        -0.03504632040858269,
        -0.003093179315328598,
        0.049453891813755035,
        -0.03526492044329643,
        -0.07969892770051956,
        -0.02951769344508648,
        0.09983722865581512,
        0.04605424031615257,
        0.053801022469997406,
        -0.07610327750444412,
        -0.03949978947639465,
        -0.042930614203214645,
        -0.038079340010881424,
        0.032908596098423004,
        0.04866962879896164,
        -6.063486779339655e-08,
        -0.006707788910716772,
        0.080436572432518,
        -0.033957339823246,
        0.054216835647821426,
        -0.04146377369761467,
        -0.05996254086494446,
        -0.027285486459732056,
        -0.028527455404400826,
        0.06037825345993042,
        0.0022186858113855124,
        -0.01181059144437313,
        0.0007106800330802798,
        -0.06071576103568077,
        0.04251759126782417,
        -0.0271422378718853,
        -0.05522080510854721,
        -0.02382534183561802,
        -0.025769731029868126,
        -0.035097382962703705,
        0.0013574628392234445,
        -0.042034927755594254,
        -0.014035711996257305,
        0.032200418412685394,
        0.03759264573454857,
        0.024615000933408737,
        0.022647233679890633,
        0.021282095462083817,
        0.052450619637966156,
        0.059945810586214066,
        -0.029564103111624718,
        -0.10052872449159622,
        -0.06039013713598251,
        -0.06567493826150894,
        0.0936611220240593,
        -0.004351509734988213,
        0.028520137071609497,
        -0.07270077615976334,
        0.11910370737314224,
        0.02362765185534954,
        0.07155019789934158,
        -0.058347299695014954,
        -0.034875255078077316,
        0.029488682746887207,
        0.0064219641499221325,
        0.06164785102009773,
        -0.015358959324657917,
        -0.06665501743555069,
        -0.009898869320750237,
        0.024297380819916725,
        -0.003980610519647598,
        0.0017532403580844402,
        0.04822386056184769,
        0.009866929613053799,
        -0.011084181256592274,
        0.009758850559592247,
        -0.06398984044790268,
        -0.003871839726343751,
        -0.02113424986600876,
        -0.06053166463971138,
        0.044773317873477936,
        -0.06961632519960403,
        -0.0721135064959526,
        -0.013420102186501026,
        0.10256646573543549
    ]
}