{
    "id": "qKGyJ8Ff9Ds",
    "title": "How To Build an Electric Jet Ski (Water Durability Test!)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-11-10T15:06:00Z",
    "video_url": "https://www.youtube.com/watch?v=qKGyJ8Ff9Ds",
    "category": "Howto & Style",
    "tags": [
        "Power Sports",
        "Taiga Motors",
        "Taiga",
        "Electric Jet ski",
        "Electric Snowmobile",
        "Taiga review",
        "factory tour",
        "how to build electric snomobile",
        "Taiga factory",
        "Orca Jet ski review",
        "Skidoo",
        "Nomad",
        "iPhone",
        "technology"
    ],
    "views": 762353,
    "likes": 25501,
    "comments_count": 1039,
    "description": "Electric Powersports are on a whole other level. Powerfully quiet with No Maintenance. Plug it in and forget about it. Get $500 dollars off with discount code \"JerryRig\" The Electric Jet Ski is here:  and the Electric Snow Machine is HERE:  Taiga Motors makes some *really* cool machines.  Taking a tour of the Taiga Electric Jet Ski Factory is a dream come true, with robot arms, power tools, and an absolutely epic rotating jet ski fixture... I could spend all day just hanging out watching components come in one door and fully assembled electric Orca Jet Skis get shipped out the other side.   Watch my lithium battery Recycling video here:   Get my JerryRig Razor knife HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.taigamotors.com/en/products/orca/",
        "https://www.taigamotors.com/en/products/nomad/",
        "https://youtu.be/s2xrarUWVRQ?si=ozkK_WW9nj8TXNFX",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "Today we're here with Taiga Motors at their electric power sports factory and we're going to see how build and waterproof an electric jet ski. This right here is vehicle number 1000 and we get to see how it all happens. Let's get started. To build an entirely electric personal watercraft, Taiga starts off with two pieces of sheet molded composite. It's an incredibly lightweight material that's going to hold all of the batteries and electronics motor and electronics inside. Tyga's been nice enough to let me be a part of the construction of this 1000th vehicle. Jet skis are rather large and awkward to handle. Luckily they've been put on these carts that allow 360 degrees worth of access using just a power drill. Rotating the entire hull so it can be accessed from the top and the bottom. The metal grill getting on the bottom is there to help keep out debris from the jet as well as keep the water flow laminar it goes through the motor. Before we can install the motor though, we need to build the battery. The battery Packs that power the jet ski and the electric snowmobile are assembled right here in this same factory with the robot arms behind me, Taking the pouch style lithium cell, putting cooling in between each layer, and smashing the whole pack together so it fits inside one of the electric vehicles. Taiga has their own in-house automation team which means that they designed the machine that makes machines. Pouch cells go in and fully completed battery modules come out the other side. Once the battery modules are assembled Tiga sends it through an ultrasonic welding robot arm. The ultrasonic welder is a cold welding process using pressure and vibrations to fuse the metals together. In high vibration applications like you would find while jet skiing or off-roading on a snowmobile, ultrasonic welds hold up better than say a laser welder. The laser welds add heat and are more to breaking than an ultrasonic. There are a total of 4 modules giving us a total of 24 kilowatt hours in each of the machines. Just like an electric vehicle these batteries are 400 volts. Which is why the guy assembling it has high voltage gloves and is using a high voltage rated screwdriver. Once the battery packs are fully assembled and enclosed, they're connected to a massive DC power supply where they're fully charged and discharged to make sure everything's functioning correctly. The reason the battery has been designed with a cavity in the center is so that it hugs the motor sits in the base of the watercraft as much as possible, giving it a low and very stable center of below the waterline. Some people might think that the 120 kilowatts worth of energy, which is about 160 horsepower, is coolest part of the all electric drivetrain, but to me the zero maintenance part is the coolest. You can take these jet skis out in the middle of the ocean with the salt water and everything, And all you have to do when you come back is rinse it off with a hose. There's no winterization or anything. No fuel to deal with. It's pretty amazing. Plug it in and forget about it. The nice thing about the 400 volt architecture though is that these jet skis can be charged up at normal electric vehicle charging stations. Going from zero to 80% charge in about 40 minutes. They can also charge up overnight using a normal household plug. As anyone involved in extreme motor sports can tell you, these machines go through quite a lot of abuse. which is why the motor and the battery sit on vibration dampeners, which helps isolate and protect drivetrain from those extreme situations. The electric motor mounted inside the hull connects to something called a jet powered impeller. The fins inside the nozzle help keep the jet stream laminar, giving us the most possible power. After it's mated up with the electric motor, a maneuverable nozzle on the exterior is what's by the handlebars and dictates what direction the jet ski goes. The battery pack itself is sealed shut and water tight, and designed in a way that the motor fits conveniently on the underside. If you remember back during the battery construction, each cell has fins built into the module. Taiga has a proprietary thermal management system that's duplicated here in the jet ski as well as the snowmobile keeping the battery healthy whether you're riding in 40 or - 40. The coolant is piped through the aluminum ride plate next to the jet pump. It's interesting that the jet ski is being cooled down by the literal water it's driving through. With the thermal management system being fully sealed, it means that the Orca can go in fresh water or salt water without any additional maintenance. With the hull completed, now we move on to the deck, Which is where we find the seat, the electronics, the handlebars, and all of the aesthetic things that are visible from the outside. As the top half of the Orca jet ski gets lowered down onto the hull, there's a rubber gasket which seals the two halves together making a watertight enclosure. In the extremely unlikely event water ever does get inside, you know, if you ever hit a rock or damage the hull, the foam blocks ensure that the craft will stay afloat even if it's filled with water. Before the jet ski can be shipped out to customers, It has to go through a final shakedown. Just like the Raptors in Jurassic Park, the Orca is strapped down and caged up for an underwater in a massive tank. But unlike the Raptors in Jurassic Park, the Orca is completely silent. The only noise is the water being blasted out of the rear jet pump. You can see how powerful it is, as well as how quiet it is. Super impressive. I'm standing right here next to it. After the internals are tested, the Orcas pass through an LED canopy, where they go through the final visual cosmetic inspection before getting crated up and shipped out. The owner of this jet ski doesn't know they are number 1000, But we're including a special little bag anyway because they have a very special place in the electrification of the power sport industry. In the next few weeks, Taiga is going to be switching over their entire assembly line from jet skis to snowmobiles. Let me know down in the comments. If you want to see how these are assembled. And I'll leave links for the current pricing of both of these machines down in the video description. If you're in the market for a zero-maintenance, zero-noise, and zero-emissions off-road performance vehicles. TaigaMotors.com. Huge thanks to them for letting us all come out and see how they're assembled. And thanks to you for watching, and I'll see you around.",
    "transcript_keywords": [
        "jet ski",
        "jet",
        "Jet skis",
        "Orca jet ski",
        "battery",
        "electric jet ski",
        "electric",
        "motor",
        "ski",
        "water",
        "electric motor",
        "Taiga",
        "power",
        "Orca",
        "electric vehicle",
        "skis",
        "battery Packs",
        "Orca jet",
        "electric jet",
        "assembled"
    ],
    "transcript_entity_values": [
        "zero to 80%",
        "Jurassic Park",
        "number 1000",
        "24 kilowatt hours",
        "two",
        "Tiga",
        "Orca",
        "Taiga",
        "the next few weeks",
        "about 160 horsepower",
        "Taiga Motors",
        "DC",
        "half",
        "4",
        "zero",
        "overnight",
        "1000",
        "Orcas",
        "360 degrees",
        "400 volt",
        "1000th",
        "Tyga",
        "about 40 minutes",
        "120 kilowatts",
        "40",
        "Today",
        "400 volts"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "GPE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "QUANTITY",
        "GPE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY"
    ],
    "vector": [
        -0.12316130101680756,
        0.04348297789692879,
        0.01363861933350563,
        -0.014763406477868557,
        0.024844683706760406,
        -0.03952856361865997,
        0.04497141018509865,
        0.026528820395469666,
        -0.044429387897253036,
        0.04180070385336876,
        0.01314424630254507,
        -0.010379335843026638,
        -0.041814032942056656,
        0.06957834213972092,
        0.003354052547365427,
        0.03409891203045845,
        -0.006914470344781876,
        0.004004125017672777,
        -0.05536901578307152,
        0.04023517668247223,
        0.08169704675674438,
        -0.04502560943365097,
        0.05201728641986847,
        -0.037673890590667725,
        -0.028204768896102905,
        0.09166248887777328,
        -0.0032451050356030464,
        0.1083904281258583,
        -0.07277361303567886,
        -0.05337725207209587,
        0.007665970362722874,
        0.008250826969742775,
        -0.15216726064682007,
        0.00809502974152565,
        0.10052672773599625,
        0.019514797255396843,
        0.0179889015853405,
        -0.02951742522418499,
        -0.020497813820838928,
        0.03854993358254433,
        -0.02875685691833496,
        -0.0034822903107851744,
        0.07382101565599442,
        -0.03291640803217888,
        0.021443158388137817,
        0.015772376209497452,
        0.05390891060233116,
        -0.08043546229600906,
        0.087600477039814,
        -0.003382262075319886,
        -0.1087525486946106,
        -0.10067139565944672,
        0.07384548336267471,
        -0.048102304339408875,
        0.0022110622376203537,
        -0.006851848214864731,
        0.002351189497858286,
        -0.08374927937984467,
        -0.05319613590836525,
        -0.041805364191532135,
        0.07069088518619537,
        -0.0114841777831316,
        -0.06592079252004623,
        0.04703526198863983,
        -0.0629124715924263,
        -0.06905986368656158,
        -0.0034502947237342596,
        -0.024201057851314545,
        -0.06184358149766922,
        -0.0278314296156168,
        -0.05218610540032387,
        0.065280020236969,
        0.00030300969956442714,
        0.03954315930604935,
        -0.03798345476388931,
        -0.032681092619895935,
        0.07968112826347351,
        -0.029679829254746437,
        -0.0056632752530276775,
        0.04245622456073761,
        0.03020869940519333,
        -0.03366292268037796,
        -0.018676411360502243,
        0.07409434020519257,
        -0.0030631860718131065,
        0.048294395208358765,
        0.09278721362352371,
        -0.009983355179429054,
        0.020634694024920464,
        0.03993752971291542,
        -0.05725197494029999,
        -0.008880184963345528,
        -0.004103869199752808,
        0.007324278354644775,
        -0.0040522729977965355,
        0.038824137300252914,
        -0.06055119261145592,
        -0.014266188256442547,
        -0.01169008482247591,
        0.026960670948028564,
        -0.03156806156039238,
        -0.03639836236834526,
        0.07556802779436111,
        -0.057338643819093704,
        -0.02555529959499836,
        0.026517270132899284,
        -0.05601169914007187,
        0.07808449119329453,
        0.059592314064502716,
        -0.02967495284974575,
        -0.041550856083631516,
        0.029116084799170494,
        -0.07172812521457672,
        0.043256327509880066,
        -0.04945870861411095,
        0.019718166440725327,
        -0.10406777262687683,
        -0.024907171726226807,
        0.03318517282605171,
        0.022068360820412636,
        0.06339611858129501,
        -0.0031671326141804457,
        0.044889185577631,
        0.11411667615175247,
        0.05172618106007576,
        0.03874504938721657,
        0.043327782303094864,
        5.368848205480096e-33,
        0.0076017118990421295,
        0.04840191826224327,
        -0.03407991677522659,
        -0.014254244975745678,
        -0.001590157044120133,
        -0.0024597952142357826,
        0.04524069279432297,
        0.07112482935190201,
        -0.08313436061143875,
        0.07264256477355957,
        -0.034843359142541885,
        0.06899415701627731,
        -0.06698661297559738,
        0.06773746013641357,
        0.06193554028868675,
        -0.1353890746831894,
        0.05803624540567398,
        -0.13338986039161682,
        -0.0875166729092598,
        0.0058447979390621185,
        0.05915758013725281,
        -0.03669239953160286,
        0.03463204950094223,
        0.033335842192173004,
        0.04798293113708496,
        0.022018123418092728,
        0.055720821022987366,
        -0.009016632102429867,
        -0.014154080301523209,
        0.045438993722200394,
        -0.005557873751968145,
        0.05359618365764618,
        0.0150767732411623,
        0.0732620358467102,
        0.0004086852422915399,
        -0.017466943711042404,
        -0.019291294738650322,
        -0.07596494257450104,
        -0.01737106777727604,
        0.014374963939189911,
        0.018208017572760582,
        0.03673091530799866,
        -0.04166363924741745,
        -0.04827322065830231,
        0.012880316935479641,
        0.00965553056448698,
        0.037661414593458176,
        0.05464215204119682,
        0.008047952316701412,
        0.02641674131155014,
        -0.008882982656359673,
        0.07904451340436935,
        0.045868564397096634,
        0.022263899445533752,
        -0.02874002791941166,
        -0.013294738717377186,
        0.04533448815345764,
        -0.044931232929229736,
        0.014070380479097366,
        0.003469536080956459,
        -0.08754946291446686,
        0.05910668894648552,
        -0.006705171894282103,
        -0.007286502048373222,
        -0.05973666533827782,
        0.00298054376617074,
        0.10722442716360092,
        0.010554677806794643,
        -0.010911374352872372,
        -0.02662685327231884,
        -0.04938572272658348,
        -0.05675114691257477,
        -0.03422083333134651,
        -0.045192889869213104,
        0.02041962742805481,
        -0.0020769929978996515,
        -0.08269985020160675,
        0.01702418178319931,
        0.0030648251995444298,
        0.007482802961021662,
        -0.05378958210349083,
        -0.01692560687661171,
        0.07980456203222275,
        -0.00447930907830596,
        0.005921870935708284,
        -0.034680791199207306,
        0.027083666995167732,
        0.007627725135535002,
        -0.0273923110216856,
        -0.015436220914125443,
        -0.010926684364676476,
        0.009589111432433128,
        0.02852500230073929,
        -0.045506399124860764,
        0.010071433149278164,
        -7.463879991730826e-33,
        0.07330527156591415,
        0.00932658463716507,
        -0.0022007429506629705,
        0.03727777302265167,
        0.022140292450785637,
        0.010263485834002495,
        0.06663314998149872,
        -0.036415379494428635,
        -0.012633471749722958,
        -0.030830610543489456,
        -0.1350332349538803,
        -0.02077818661928177,
        -0.011927581392228603,
        -0.044946249574422836,
        0.05578315630555153,
        -0.06135953217744827,
        -0.058678530156612396,
        -0.010568613186478615,
        0.03163823485374451,
        0.003702959744259715,
        0.10792232304811478,
        0.12531352043151855,
        0.04225068911910057,
        0.020121825858950615,
        0.05683990195393562,
        0.006631797645241022,
        0.03719265013933182,
        -0.00655808812007308,
        -0.0444084033370018,
        0.03469833359122276,
        -0.032108232378959656,
        -0.012152382172644138,
        0.049322325736284256,
        0.0019844332709908485,
        -0.05758533254265785,
        0.036804813891649246,
        0.001751830568537116,
        -0.0010889205150306225,
        0.019420066848397255,
        -0.0880601704120636,
        0.051737263798713684,
        -0.07154403626918793,
        -0.018480496481060982,
        -0.018812576308846474,
        -0.07132954895496368,
        -0.053248368203639984,
        -0.07761526852846146,
        0.022963065654039383,
        -0.0030598887242376804,
        0.026972755789756775,
        -0.09341737627983093,
        0.03170347958803177,
        -0.041793063282966614,
        -0.03087293542921543,
        0.00021218045731075108,
        -0.04417111352086067,
        0.046444837003946304,
        -0.08664233237504959,
        -0.04585196077823639,
        -0.012277212925255299,
        0.010505003854632378,
        -0.08567081391811371,
        0.01595192961394787,
        0.010857988148927689,
        -0.024073362350463867,
        -0.012045202776789665,
        0.1276196390390396,
        -0.015097526833415031,
        0.012186381965875626,
        -0.022597536444664,
        0.010989733040332794,
        0.0374995656311512,
        0.05758313834667206,
        -0.07011958956718445,
        -0.023667918518185616,
        -0.0374266654253006,
        0.0077573396265506744,
        0.006524348631501198,
        0.07011298835277557,
        -0.029563672840595245,
        0.03169899806380272,
        -0.018609121441841125,
        -0.018844274803996086,
        0.03636572137475014,
        0.04804176837205887,
        -0.02250770665705204,
        -0.011216698214411736,
        -0.015315201133489609,
        -0.02590208686888218,
        0.03730146586894989,
        0.05660214647650719,
        -0.0028540678322315216,
        0.0660582035779953,
        0.059045229107141495,
        -0.00377664458937943,
        -6.158063570183003e-08,
        0.07582683116197586,
        0.06746583431959152,
        -0.010163593105971813,
        0.0029351962730288506,
        -0.0021049133501946926,
        -0.056339435279369354,
        -0.016965258866548538,
        0.016212711110711098,
        -0.009287775494158268,
        -0.06910024583339691,
        0.0554022416472435,
        0.013952949084341526,
        0.027522828429937363,
        0.14534370601177216,
        -0.06889928132295609,
        0.01860221102833748,
        0.0014364614617079496,
        0.0637875348329544,
        -0.05488888919353485,
        -0.010534225031733513,
        -0.08134426921606064,
        -0.08336952328681946,
        0.007647052872925997,
        0.05543060228228569,
        -0.032565049827098846,
        0.06666810810565948,
        -0.09386096894741058,
        -0.07340246438980103,
        0.0937759131193161,
        0.0284526776522398,
        -0.13799640536308289,
        -0.05425030738115311,
        0.010859353467822075,
        0.06045982241630554,
        -0.011326795443892479,
        -0.03232874348759651,
        -0.1522466540336609,
        -0.014903689734637737,
        -0.009390258230268955,
        -0.00926142930984497,
        0.004962214268743992,
        -0.03805115073919296,
        0.000618557445704937,
        0.02339811436831951,
        -0.015985757112503052,
        0.014130774885416031,
        -0.041140709072351456,
        -0.17082998156547546,
        -0.06774868071079254,
        0.05211776867508888,
        0.02700803242623806,
        -0.03483131155371666,
        -0.00039061610004864633,
        0.06700263917446136,
        -0.033685941249132156,
        0.16127485036849976,
        -0.01082308404147625,
        -0.06744460761547089,
        -0.06385959684848785,
        -0.018054910004138947,
        -0.024221941828727722,
        -0.03374117240309715,
        -0.07893577218055725,
        -0.013597670011222363
    ]
}