{
    "id": "qKLS6-mz7bk",
    "title": "NEW iPad Pro M1 Durability Test! - Are Apple Mini LED's Stronger?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-06-10T13:15:06Z",
    "video_url": "https://www.youtube.com/watch?v=qKLS6-mz7bk",
    "category": "Howto & Style",
    "tags": [
        "Apple iPad Pro",
        "Mini LED ipad",
        "Apple iPad M1",
        "M1 ipad pro",
        "m1 ipad",
        "ipad pro review",
        "mini LED review",
        "ipad os",
        "ipad os 15",
        "m1 ipad benchmark",
        "ipad M1 durability test",
        "ipad bend test",
        "ipad scratch test"
    ],
    "views": 1985247,
    "likes": 78336,
    "comments_count": 6518,
    "description": "The large 12.9 inch Apple iPad Pro with the M1 boost inside is ready to be tested! Grab my Teardown skin for your device HERE  The iPads have never really been known for their structural integrity... But, with the new iPad M1 being slightly thicker and heavier... maybe this time around it wont snap in half! We can dream.   tell Tim Cook 'Thanks for saving the elephants' here:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.dbrand.com/teardown",
        "https://twitter.com/tim_cook?s=09",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Well, we're back again with another iPad...this time the bigger one. Will it suffer the same fate as the last two? Probably. Are we going to test it anyway? Definitely. There are a few major improvements to the iPad this year, the main one being the mini LED screen, but only on the bigger 12.9 inch tablet. We've never tested the larger size iPad before so it should be interesting. I'm curious to see how the new mini LED screen reacts to the burn test. And, of course, I'm curious to see if it breaks in half like the last two. [Evil voice] Do it! [Zack] Let's get started. [Intro] This 12.9 inch M1 iPad Pro starts at $1,099. And unfortunately as we can see, it still has the microphone hole in the side. Might as well give it an RIP down in the comments. Rest in peace. Let's start with the screen. This thing is massive. [Voice] That's what... [Another voice] Don't do it. [Zack] Apple's calling this screen a liquid retina XDR Mini LED display. A mouth full of buzz words but basically it's just the next generation of LCD technology. It's still a screen with a backlight. I'll get into more detail about what's under the glass later in the video, but for now we can see from the Mohs scale of hardness that it still scratches at a level 6, with deeper grooves at a level 7; just like most cellphones. There is a 12 megapixel front facing camera at the top, which can do motion tracking on video calls or video chats. The sides of the M1 Pro are made from 100% recycled aluminum, which is great. We still have the magnetic pencil dock right here at the weakest point in the frame. We'll see how that works out later. The 5G version will also have additional antennas built into the frame. And, of course, we still have the volume buttons up here at the top corner. The top of the iPad Pro has two of the four speakers, along with two more microphone holes and the power button. Then here on the left side we get that microphone hole that caused the demise of the last two iPads we tested. This time around the iPad Pro is half a millimeter thicker than the previous versions, so maybe Apple did add some more structure to the metal. We'll find out soon enough. The bottom has two more speakers along with a USB-C thunderbolt connector. Still no headphone jack, but I think people are used to that at this point. There are a few cameras on the back. The top one being the 10 megapixel ultra wide, and the bottom one being the regular 12 megapixel main sensor, with a dual LED flash built into the hump, and a lidar sensor for AR and auto focusing. There is a long antenna line running along the top and bottom, and you can hear the difference between the aluminum and the plastic that allows signals to pass through. For the rest of the back we have some good news and some bad news. Not too long ago, back in the 1970's, Africa had a population of about 1.3 million elephants. Nowadays, due to poaching and loss of habitat, the elephant population is less than a third of what it was back in the 70s. There are only about 400,000 left. Now, I'm not normally a 'save the elephants' type of guy, but yikes. The good news is that Kenya has really stepped up their game, and managed to double their own elephant population in the last 30 years. Nice work, Kenya. But that's just one country out of the 54 countries in Africa. I personally don't know how to fix it, but Apple is sitting on about 200 billion dollars of cash right now. Maybe they can think of some way to help out. That would be pretty cool. It is a tricky issue since elephants are pregnant for about two whole years. I think she turned out pretty good. Now let's talk about the screen for a second. This is where the iPad has noticeably improved since last year...But remember, only on the big one. Apple is calling this the Liquid Retina XDR Mini LED display, and this is our first time burning a mini LED. While it's very different than OLED technology, it's definitely taking the LCD style of back light to the next level. Apple has installed 10,000 mini LED's under the screen. Notice I didn't say pixels. There are about 5 million pixels and those pixels are backlit by the 10,000 mini LEDs. So it still has a backlight. But those mini LEDs give way more brightness and control over the pixels in front of them, more so than a conventional LCD screen. OLED screens, on the other hand, like on the iPhones, had self-emissive pixels that don't need a backlight. By comparison, the iPad's mini LED screen has a fantastically awesome 1 million to 1 contrast ratio. But if we look at the OLED screens on the iPhones, it's an infinity to 1 contrast ratio since the blacks are perfect with zero light behind them. Both screens, of course, are great and get the job done, just different technologies. Personally, I see the mini LED screen, like the one this iPad is using, being more color accurate and good for work and editing, while the OLED screens are more vibrant and better for entertainment and movies. But that's just my personal preference. Either way, the mini LEDs are pretty fantastic and still acting like an LCD during the burn test going black with the heat from my lighter in about 17 seconds and recovering after the heat is removed. The average person, of course, would have no idea there's even a difference between OLED and mini LED. There is no fingerprint scanner. Apple's relying on the face ID thing. So I guess it's time for the bend test. This is the largest device I've ever attempted to bend before. While it is indeed half a millimeter thicker, it still has the microphone hole and magnetic pencil mount in the weakest spots. It's time to find out what happens. Bending from the back, the screen bends and flexes out and away from the aluminum frame. I didn't know glass could do that. The adhesive on the screen even separates from the metal, but the iPad did not catastrophically snap in half like it did last time. Oh, it's bent for sure, but bent is better than broke. Everything still seems to be functioning just fine just around this newly installed bend. I still highly recommend not sitting on the tablet, of course. But it is good to know that the M1 iPad Pro can survive at least one round of the bend test. Bending from the screen side this time we get even less flex, probably because the glass has adjusted with the metal frame and doesn't give it much room to bend in this direction. It's starting to look like a crinkled piece of paper, but even after round 2 from the back, the 2021 larger M1 iPad Pro survives my durability test. It's definitely a sad little unit now, but still alive and kicking. Nice work, Apple. Thumbs up for that. I told dbrand that I would show off my new M1 Teardown Skins, but I kind of forgot to do it earlier in the video. Definitely would have been easier to apply the Teardown Skin back when the tablet was still straight. Like all problems, including our elephant issue, it's easier to do things before it gets too bad. I'll leave a link down below so you can grab a Teardown Skin for your own devices so you can see the insides from the outside. I'll be linking that right next to Tim Cook's Twitter. Maybe just ping him about the elephant thing. Actually, about an hour after I filmed this video and finished drawing my elephant, Tim Cook himself tweeted about how Apple is now supporting wildlife conservation in Kenya. And I don't know what Seri told him, but that is a creepy fast coincidence. Either way, 10 out of 10, our elephant friend approves. Any step is a great step in the right direction. Maybe we can ping him with a 'thank you' instead. As always, hit that subscribe button. I've got plenty of more videos on the way. And thanks a ton for watching, I'll see you around. [Voice 1] That's what she... [Voice 2] Stop it!",
    "transcript_keywords": [
        "mini LED screen",
        "mini LED",
        "LED screen",
        "XDR Mini LED",
        "iPad Pro",
        "LED",
        "mini LEDs",
        "screen",
        "iPad mini LED",
        "mini",
        "iPad",
        "Mini LED display",
        "OLED screens",
        "Apple",
        "back",
        "Pro",
        "retina XDR Mini",
        "mini LEDs give",
        "OLED",
        "time"
    ],
    "transcript_entity_values": [
        "the iPad Pro",
        "12.9 inch",
        "Kenya",
        "Tim Cook",
        "the 70s",
        "the last 30 years",
        "at least one",
        "four",
        "100%",
        "two",
        "less than a third",
        "the last two",
        "jack",
        "awesome 1 million",
        "6",
        "the iPad Pro",
        "Africa",
        "M1 iPad Pro",
        "1,099",
        "about 200 billion dollars",
        "1",
        "Twitter",
        "1970",
        "12 megapixel",
        "half",
        "half a millimeter",
        "zero",
        "about two whole years",
        "only about 400,000",
        "the M1 iPad Pro",
        "about an hour",
        "iPad",
        "10",
        "this year",
        "5",
        "about 17 seconds",
        "Apple",
        "iPhones",
        "Seri",
        "about 5 million",
        "iPads",
        "54",
        "M1 Teardown Skins",
        "last year",
        "second",
        "first",
        "Zack] Apple's",
        "LCD",
        "about 1.3 million",
        "Zack",
        "10,000",
        "Tim Cook's",
        "2021",
        "the Teardown Skin",
        "XDR Mini",
        "10 megapixel",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "FAC",
        "QUANTITY",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "LOC",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "NORP",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.088762067258358,
        0.0321575291454792,
        -0.03029496595263481,
        -0.07284529507160187,
        0.06681467592716217,
        -0.08307015150785446,
        0.046520575881004333,
        0.06542426347732544,
        -0.0520673505961895,
        0.08413216471672058,
        0.11487403512001038,
        0.042257703840732574,
        -0.05789825692772865,
        0.020215719938278198,
        0.03244442492723465,
        0.022816162556409836,
        0.0813695415854454,
        1.8492901290301234e-05,
        -0.07618676126003265,
        0.12338448315858841,
        -0.017311302945017815,
        0.0038273660466074944,
        0.06337106972932816,
        0.009079021401703358,
        -0.039671819657087326,
        0.04267532378435135,
        0.03440507501363754,
        0.04494844004511833,
        -0.06929519027471542,
        -0.05294632166624069,
        0.018905913457274437,
        -0.007757348939776421,
        -0.06346851587295532,
        0.051333241164684296,
        0.051724281162023544,
        0.012614494189620018,
        0.009270339272916317,
        -0.023441359400749207,
        -0.06109483540058136,
        -0.08529870957136154,
        -0.06011110544204712,
        -0.001020150724798441,
        0.02845590002834797,
        -0.021579723805189133,
        0.028346212580800056,
        0.02971508912742138,
        0.059564221650362015,
        -0.050998639315366745,
        -0.033027734607458115,
        -0.02829434536397457,
        -0.05599181354045868,
        -0.03642622381448746,
        0.011143654584884644,
        0.002894922625273466,
        -0.02126111462712288,
        -0.04072512686252594,
        -0.011592147871851921,
        -0.01963455229997635,
        0.056674644351005554,
        0.009581071324646473,
        0.012375099584460258,
        -0.0003812905924860388,
        0.03766975924372673,
        0.04722405970096588,
        0.01833905652165413,
        -0.020802251994609833,
        0.041795514523983,
        -0.12495571374893188,
        -0.06109791621565819,
        0.01747475378215313,
        -0.017935290932655334,
        -0.020317280665040016,
        -0.01660941168665886,
        0.009725541807711124,
        -0.0002798176137730479,
        0.03673212230205536,
        -0.01849467121064663,
        0.046137720346450806,
        -0.010880396701395512,
        0.03490100055932999,
        0.03715785592794418,
        0.038448184728622437,
        0.0016088496195152402,
        0.005981022026389837,
        0.03215762972831726,
        0.013073396869003773,
        -0.02187984436750412,
        0.08243830502033234,
        -0.05440641939640045,
        -0.01959136873483658,
        0.04048990458250046,
        0.05627008154988289,
        -0.015558824874460697,
        0.06312519311904907,
        0.028708133846521378,
        -0.06713593006134033,
        -0.07987112551927567,
        -0.09242427349090576,
        -0.11318709701299667,
        0.06499288976192474,
        0.04320227727293968,
        -0.00030030266498215497,
        -0.01303943432867527,
        0.000993215711787343,
        0.022370900958776474,
        -0.004255461506545544,
        -0.008350804448127747,
        0.013513302430510521,
        0.037266165018081665,
        0.04091717302799225,
        0.0808592364192009,
        0.04257788509130478,
        -0.05757508799433708,
        -0.008059333078563213,
        0.05142431706190109,
        -0.025903210043907166,
        -0.085389643907547,
        0.07778167724609375,
        0.11839555203914642,
        0.031601205468177795,
        -0.0018316188361495733,
        0.028943976387381554,
        -0.035348184406757355,
        -0.0301473680883646,
        0.0024849199689924717,
        0.030354514718055725,
        -0.064115971326828,
        4.299828296245368e-33,
        0.02731512300670147,
        0.1350315362215042,
        -0.02828121744096279,
        -0.03396186605095863,
        -0.008072388358414173,
        -0.04273054376244545,
        0.04568598419427872,
        0.11130813509225845,
        -0.005608759354799986,
        -0.010407770983874798,
        -0.01922377571463585,
        0.001354276086203754,
        -0.037121184170246124,
        -0.014036442153155804,
        0.025310471653938293,
        -0.06572208553552628,
        0.02181394211947918,
        -0.00317234150134027,
        -0.02804778330028057,
        -0.016285216435790062,
        -0.0783122330904007,
        -0.08172661066055298,
        0.02085898071527481,
        0.024477727711200714,
        0.047569748014211655,
        0.05980982631444931,
        0.044551774859428406,
        0.0021748680155724287,
        -0.015500586479902267,
        0.044791918247938156,
        -0.10691065341234207,
        -0.01323584746569395,
        -0.012739153578877449,
        -0.025563998147845268,
        -0.07304845005273819,
        0.001702381414361298,
        -0.041829708963632584,
        -0.13313724100589752,
        -0.05307914316654205,
        -0.03097202070057392,
        -0.054747384041547775,
        0.011086483485996723,
        -0.018247755244374275,
        -0.04021838679909706,
        0.006438356824219227,
        0.01647052727639675,
        -0.015663059428334236,
        0.04717880114912987,
        -0.05084091052412987,
        -0.07745712250471115,
        -0.02423975244164467,
        -0.06370679289102554,
        0.014944498427212238,
        -0.05963171273469925,
        -0.09712401777505875,
        0.016143426299095154,
        -0.0033075553365051746,
        -0.0269919466227293,
        0.06615850329399109,
        0.018160320818424225,
        0.022229228168725967,
        -0.03468460962176323,
        -0.02120773121714592,
        0.084225594997406,
        -0.10431938618421555,
        0.015240528620779514,
        0.0033985015470534563,
        0.03000904805958271,
        -0.04637794941663742,
        0.009731649421155453,
        -0.003251470159739256,
        0.03346633166074753,
        0.03969888389110565,
        -0.024961717426776886,
        -0.02212546393275261,
        -0.01509665884077549,
        -0.012638120912015438,
        0.04292766749858856,
        0.02490309439599514,
        -0.013876155018806458,
        -0.07492734491825104,
        0.04948509484529495,
        0.03115088678896427,
        -0.009861651808023453,
        -0.11103365570306778,
        -0.005827079992741346,
        0.0346347875893116,
        -0.10431618243455887,
        0.029183106496930122,
        0.027991019189357758,
        0.004973136819899082,
        -0.031770382076501846,
        -0.07788384705781937,
        -0.062125418335199356,
        -0.029405517503619194,
        -6.244918063867038e-33,
        -0.008232769556343555,
        0.011993360705673695,
        -0.01801104098558426,
        0.006832886021584272,
        0.00368770444765687,
        -0.05643558129668236,
        0.0592300109565258,
        0.04996436834335327,
        -0.021455509588122368,
        -0.07539204508066177,
        -0.02487831749022007,
        0.018694333732128143,
        -0.056237343698740005,
        -0.09310543537139893,
        0.051357392221689224,
        -0.02256011962890625,
        -0.07024029642343521,
        -0.09490533173084259,
        0.09203333407640457,
        -0.02285146154463291,
        0.13210275769233704,
        0.05764586851000786,
        0.10515154898166656,
        0.024348728358745575,
        -0.0016155762132257223,
        0.0019946955144405365,
        -0.008563259616494179,
        -0.03667297586798668,
        0.04796672612428665,
        -0.003918919246643782,
        0.08521532267332077,
        -0.06093372777104378,
        -0.05155574157834053,
        0.06735849380493164,
        -0.00540499622002244,
        0.08546856045722961,
        0.025974702090024948,
        -0.020659517496824265,
        -0.012026634067296982,
        -0.059294890612363815,
        0.05166113004088402,
        0.05985352024435997,
        0.004855085629969835,
        -0.04595924913883209,
        -0.07057059556245804,
        -0.06649190187454224,
        0.048708561807870865,
        0.035057421773672104,
        0.05029159039258957,
        -0.04119362309575081,
        -0.04690348729491234,
        0.0424518920481205,
        -0.041799623519182205,
        0.03773494064807892,
        -0.10783293098211288,
        0.005046726670116186,
        0.05530298873782158,
        -0.056053902953863144,
        -0.05200957506895065,
        0.012041431851685047,
        0.06940433382987976,
        0.01656276546418667,
        -0.041945941746234894,
        -0.014902190305292606,
        -0.014588791877031326,
        -0.013585601933300495,
        0.01967952586710453,
        -0.033099617809057236,
        0.05821184441447258,
        0.06288259476423264,
        0.037276457995176315,
        -0.06284094601869583,
        0.06653787195682526,
        -0.05477166920900345,
        0.0002823926042765379,
        0.06392788887023926,
        0.03621954470872879,
        -0.045288924127817154,
        -0.023813148960471153,
        -0.047013964504003525,
        0.06636304408311844,
        -0.030431807041168213,
        -0.014482202008366585,
        0.07931584119796753,
        0.03612182289361954,
        0.013642816804349422,
        0.06986626237630844,
        0.042828720062971115,
        -0.09188280254602432,
        0.040006544440984726,
        -0.05783746391534805,
        0.012436458840966225,
        -0.041874248534440994,
        0.0798252746462822,
        -0.060614075511693954,
        -6.452930989553352e-08,
        -0.012240546755492687,
        0.059570182114839554,
        -0.0014086855808272958,
        0.0023828046396374702,
        0.009605002589523792,
        -0.026645971462130547,
        -0.005979534238576889,
        0.012163059785962105,
        0.05924099311232567,
        -0.042645908892154694,
        -0.0205584317445755,
        -0.12967760860919952,
        -0.054106149822473526,
        0.08452630043029785,
        -0.047148749232292175,
        0.05444173514842987,
        -0.07669783383607864,
        -0.007408250588923693,
        -0.020880844444036484,
        -0.0377175509929657,
        -0.08684790879487991,
        -0.004237284418195486,
        0.03487153723835945,
        -0.04882575571537018,
        -0.048266686499118805,
        0.05671243369579315,
        -0.15186567604541779,
        0.04755208268761635,
        0.03970067948102951,
        0.08483269065618515,
        -0.07347334921360016,
        0.014176707714796066,
        0.03315006569027901,
        0.015425932593643665,
        -0.010776083916425705,
        -0.05059923976659775,
        -0.050561703741550446,
        0.024734755977988243,
        0.04925078898668289,
        0.006989560555666685,
        0.009144271723926067,
        -0.11921947449445724,
        0.04797855392098427,
        0.04240100830793381,
        -0.021928897127509117,
        -0.009356698021292686,
        0.010923371650278568,
        -0.1273975968360901,
        -0.06904185563325882,
        0.06861528754234314,
        0.02649313025176525,
        -0.0016918552573770285,
        -0.016983408480882645,
        0.06576662510633469,
        -0.01898796483874321,
        0.029133634641766548,
        0.07466305047273636,
        -0.038871463388204575,
        -0.016013531014323235,
        -0.009769365191459656,
        0.1053304597735405,
        -0.11958083510398865,
        0.0026219075080007315,
        0.0722958967089653
    ]
}