{
    "id": "QMMzfGTy4PA",
    "title": "Trying KIDS Science Kits with the Physics Girl!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-06-21T14:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=QMMzfGTy4PA",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "the physics girl",
        "science kits"
    ],
    "views": 151217,
    "likes": 6326,
    "comments_count": 320,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? I'm so excited because today in my kitchen I've got Dianna, the Physics Girl. Her channel is so awesome. - Oh, thank you. - I am so excited you're here! - I'm so excited to be here. I've been watching your stuff for a very, very long time so I'm really happy to be in your kitchen with the science. - This one I'm super excited about because it says Kaboom! (both chuckle) - It does. - Today we're going to be doing a bunch of science kits that are made for children, we're also gonna be doing a video on her channel so I'll put a link in the description to go check that out and make sure you go subscribe to her channel especially if you guys like science. - Physics, particularly. - Well science and physics. Well you are the Physics Girl. - Yeah but this is all kinds of science here. There's even a little bit of tech. - This is super exciting, a gemstone dig kit? - Yeah. - I used to collect rocks when I was little. - I used to collect rocks too! I still do. - Collecting crystals, you know, cleansing my crystals in the moon light, stuff like that. We get all of these? - I don't know. - Oh my goodness. - I think you dig and you find out. - There's like a little mallet, oh this is gonna be so fun. - Is that a bracelet? - Is that a bracelet in here? - I hope so. This is the warm up because it's not really like the science. - Tools? - I've never unboxed anything I feel like that was-- - Do you wanna give it just a stab, like right in there, just you know? - Like how do you do it? - Just stab it. - Like from the? - Well not from the. (both laugh) You wanna get in there, like right there, a nice corner. - All right, all right. - Go, you got this! Yay! - That was satisfying. - Did you plan this? - Sure, I planned it. - Oh my gosh, it says iStone Discovery. Well we're gonna get digging. - 20 real gems. - 20? - Yeah, it's like a big block of, I don't know. - Dirt? Not give them hammer or anything? - I think that's this, like a chisel. Being a paleontologist requires patience and care. - I have neither of those, well I have care I don't have patience. We've got two machetes. I had to get another one because I always felt bad like when I had friends over that they wouldn't have machetes. - This is what I expected when I came to iJustine's house. - I love this, they already have sort of a little pattern. So do we kind of like try to dig where the pattern is? - I don't know, I kind of want to just get in there. - Okay. - I'm a little worried about your counter, can we do a little bit of? (chuckles) - Look at this, 'cause we don't wanna hurt our gem stones. Oh we can just like chip away at the edge. - Oh yes! How are you doing this? - You just gotta get in there, get it on the edge give it a little jam! - Oh that is so-- (exclaims happily) - Oh I see a gem, wait! No you can't use your hands. - Oh, sorry. - What kind of paleontologist are you? (Dianna laughs) We've got a rock, I see it. - We must be delicate. - I see-- - Oh that's amazing. - Two gem stones. - I think there's three. - Three, I can't count. - Why didn't it come with a machete? - I don't know. - That's the real question. - Like a kid machete? There's another one, I'm sorry. - It's okay, I've got you. I mean. (both exclaim) Careful, don't taint the rocks. Look, our first excavation. - Now how do you get them out? What are we gonna do with these? - Oh I'm gonna put them on my shelf. - Okay. Do you think that-- (Justine exclaims) - This one had a hole in it already. - Nice! - Do you think if you put this in water it would all just melt away? - Probably, it would just slide off. - I love science, let's try it! - Oh my gosh. - Oh I want this one, look at that one, that's nice. Do you think there's something else we could put in here that would make it, vinegar? - I'm totally on board with us trying things. - It's a little diluted with the water but. - Why did I fill it so full? We think Tin Can Robot next. - Yeah because it's adorable and you get to make a walking, wobbling bog-eyed robot. - Look how cute he is! - It's so cute. - Do you think we need to have our own can? Shall I pop a La Croix, do people still like La Croix? - Oh I am a fan. - Do you want one? They might be moldy, do they expire? - They might be moldy? - I don't know, I don't-- - I don't think that, from my scientific experience I don't think that happens to La Croix. - We've got a coconut! - Cheers. - La Croix. - To the maybe expired La Croix. 2018, but it's at the end of 2018. - Do you think we need a battery? - I don't know. - No-one ever likes to include batteries. - It's like the goal of this is to use a tin can just as the body of a robot. - Does it give us instructions or do we just figure it out? - I'm sure, we just figure it out. - Look at all the stuff. Do we need to screw it in there? Drop the motor, push in to four pegs. - Four pegs. - Nice, nice. The arms are now being attached. I think I'm making it worse by trying to help you. (both laugh) We're making a lot of progress I just want everyone to know, he has very long arms. I think that they decided to trim their hands but we're not going to. - Oh, that's amazing. - We're gonna leave it just like that. - The screwdriver saved the day. - It really did. - Test number one, Can Robot 1.0. So cute! - It works! - That's pretty cute. - I feel like we're missing something right there. This is team work. - Team work makes the dream work. - I mean this is my dream. So I guess you turn it on, okay, are you ready for this? - I have never been more ready for anything. - Yeah. Oh it's going the wrong way! - No! - Oh no. Look we can just turn his eye backwards and his hands this way. - Oh perfect. - Bye, bye. He's dead! - Maybe if you switch these wires? (Justine gasps) - Hey-oh. - Okay but this is not the way that it told us to do it. - It's not the way it told us to do it. - At all! Well I'd like to call this a success. We're really incredibly intelligent and you guys should give this video a thumbs up. - As far as a science kit for eight years old plus go we got it nailed. - Get it! Okay well even Matty doesn't like it. We have done a lot of things. - We can work on any assembly line you need. - This one says there's 25 experiments. - We'll see how the one goes. - Oh that was-- - Advanced move! It's got some ingredients. - Yeah let's show them. - It's got iron powder, citric acid. I think this one's gonna be pretty exciting. - Let's see what we have in here! - Safety goggles. - There's only one pair, you can have them. - This is for a child. - Oh my gosh, that's really-- - It's very small. - That's so small. It's all squished to your head! (chuckles) Look at all these chemicals, let's mix them all together. - So many options, this is fire. This candle has the most warnings I've ever seen on a candle. - Comets of M&M's, is there M&M's in here? - No, I feel like you have to BYO M&M. - No. So a lot of these require things that I don't have which in most normal households most people would probably have them. So this magic potion one looks easy I think. - Yeah. - I have cooking oil, vinegar. Step one! - Ask an adult for help. - Oh shoot. Can you help me? Tyler, can you help us? We need 35ml of hot water and 10ml of vinegar. They have us food coloring. - They did! - But they didn't give us M&M's? This is shocking. 40ml of oil, is this the trick? - Okay, so you can see the two layers of oil and water because they have different densities. You had a question? - Is this what we did? Is this done? - This is-- - Did we do it? Is there a next step? Did we do it? Is this it? - I mean if you're a kid and you're like whoa, why don't they mix? You can see the layers of liquid. - You're right, it is cool but it also says now add the oil with the plastic spatula two spoons of sodium tur-bur-tur sodium tur-bur-tur, do you know what that is? - What? - My sister and I once made slime and I couldn't pronounce this type of ingredient so I've been calling it tur-bur-turs. Now we need one level spoon of sodium tur-bur-tur. - Where's my sodium tur-bur-tur? Sodium Perborate? - So if you can't pronounce an ingredient you can just say tur-bur-tur. So we're gonna put the sodium tur-bur-tur. - We can call this tur-bur-tur and see what happens. In this particular case the tur-bur-tur is sodium bicarbonate but (laughs). - Sodium tur-bur-tur. - That much? - That looks cool to me. Can you get a good view of this because this might truly be magic. - Who knows what's gonna happen? - Are we ready? - We're learning today. - You wanna mix it? - Do I mix? Yeah. Are we making slime? - I don't know! Is it truly magic? - No, it's science. Well it bubbled. - I mean, cool. - What if we add more? - I don't really, yeah okay. (laughs) I'm not really sure what we're looking for. - Oh god, oh jeez, we'll put it in here. - The sodium bicarbonate moves slowly in the oil until reaching the vinegar. Here it reacts with the acetic acid of the vinegar giving off carbon dioxide. It is this gas that creates the effervescent bubbles. - We as adults needed to know this and now we know. We have accomplished a lot today. - We did way more science than I even usually do on my channel. - We should bring back the dig. - Did it get any easier? - Oh, it didn't really. - It just smells. - Well I think that we might have gotten most of our gem stones out. I mean there's still a lot of these little guys but realistically I'm probably not gonna make a bracelet out of it. Oh, something! - Keep digging. Keep digging. - Look at this one! Just kind of like. - Move the knife. - Do you wanna? I'll just get it there. This is so fun, this is my favorite. - I feel like I shouldn't be digging while you're digging with your knife. - You shouldn't, I'm gonna put the knife away. I almost burnt myself on the candle! I didn't listen to any of the warnings. Well guys thank you so much and a huge thank you to Dianna for coming over. She brought all of these incredible sets over for us to try out today. - Thank you so much for doing them. I've never, even as a kid who was interested in science have never done anything like this and I was like, I know the person who will be able to unbox with me and test everything out. - Honestly, these gem stones were so much fun to dig out and we definitely didn't do it the proper way. - No but we did it with machetes. - We did. - Yeah. - Don't forget, when you decide to do laundry you have a corpus in your pocket. - Oh my gosh, I still have that in there. - You're gonna be like why did my washer and dryer just explode? This was so much fun. Make sure you guys go check out her channel. I'll put all the links in the description below and this was incredible. I'm so excited to see what we do on your channel! - I'm really excited for it. - I'm terrified. (both screaming) No! (upbeat music)",
    "transcript_keywords": [
        "sodium turburtur",
        "science",
        "Yeah",
        "sodium",
        "turburtur",
        "excited",
        "put",
        "Physics Girl",
        "Croix",
        "Physics",
        "give",
        "channel",
        "guys",
        "gem",
        "make",
        "gem stones",
        "dig",
        "sodium turburtur sodium",
        "nice",
        "lot"
    ],
    "transcript_entity_values": [
        "La Croix",
        "Matty",
        "eight years old",
        "one",
        "iJustine",
        "Justine",
        "Two",
        "25",
        "so--",
        "the end of 2018",
        "Dianna",
        "20",
        "iStone Discovery",
        "three",
        "10ml",
        "the day",
        "La Croix",
        "four",
        "only one",
        "Four",
        "today",
        "two",
        "2018",
        "Tyler",
        "Kaboom",
        "first",
        "35ml"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PRODUCT"
    ],
    "vector": [
        -0.03845364227890968,
        -0.07142329961061478,
        -0.024852393195033073,
        -0.10868144035339355,
        -0.00626368448138237,
        -0.02193121425807476,
        0.031206829473376274,
        0.06150245666503906,
        -0.02508694678544998,
        0.0767616331577301,
        0.08799512684345245,
        -0.053871214389801025,
        -0.03170265629887581,
        0.004084337968379259,
        -0.015541354194283485,
        0.06905627250671387,
        0.030700691044330597,
        0.0072089387103915215,
        -0.03139561042189598,
        0.00468252832069993,
        -0.022615209221839905,
        -0.046708766371011734,
        0.07078871876001358,
        -0.006496100220829248,
        -0.04932503402233124,
        0.1304040104150772,
        0.030067352578043938,
        0.04361721873283386,
        -0.08342307806015015,
        -0.08164877444505692,
        0.010684248991310596,
        0.011368826031684875,
        0.08222968131303787,
        -0.028728561475872993,
        -0.00523719796910882,
        -0.01920512691140175,
        0.07042209804058075,
        -0.02677082270383835,
        -0.06581808626651764,
        -0.003470258554443717,
        -0.040546491742134094,
        -0.03563910350203514,
        0.03672858700156212,
        -0.037402719259262085,
        -0.06659723073244095,
        -0.06018128991127014,
        0.023409385234117508,
        -0.07395686209201813,
        0.07529616355895996,
        0.023501338437199593,
        -0.10681124031543732,
        -0.09215204417705536,
        0.059075526893138885,
        0.008882659487426281,
        -0.062479037791490555,
        0.03770601376891136,
        -0.05516020953655243,
        -2.8833834221586585e-05,
        0.04619515314698219,
        -0.11725224554538727,
        0.026677152141928673,
        -0.035949643701314926,
        -0.04592127352952957,
        0.03290397301316261,
        -0.059185322374105453,
        -0.07135425508022308,
        0.005253095645457506,
        0.030849549919366837,
        0.031204253435134888,
        0.018949229270219803,
        -0.08290033787488937,
        0.06050817295908928,
        0.012362339533865452,
        0.044603779911994934,
        0.02814231440424919,
        0.0347026102244854,
        0.03959479182958603,
        -0.04401880130171776,
        0.03745010122656822,
        0.06745433062314987,
        -0.0033166762441396713,
        -0.07021341472864151,
        -0.0946398600935936,
        -0.052858565002679825,
        -0.01205757912248373,
        0.0689082071185112,
        0.03593187406659126,
        0.025311844423413277,
        -0.03995482623577118,
        -0.055346205830574036,
        -0.0665656104683876,
        -0.02727787382900715,
        -0.0009329319000244141,
        -0.009391448460519314,
        0.007230542600154877,
        -0.048353709280490875,
        -0.0498969703912735,
        -0.09360752254724503,
        -0.04964354261755943,
        0.04800964146852493,
        0.04409666731953621,
        -0.03258804231882095,
        0.02336311712861061,
        0.03699279949069023,
        -0.046555809676647186,
        -0.0982636958360672,
        -0.05015905946493149,
        0.020948268473148346,
        0.05280625820159912,
        0.01642758958041668,
        -0.05185069888830185,
        0.029821397736668587,
        -0.06455551087856293,
        -0.024955306202173233,
        0.012681626714766026,
        0.08176255971193314,
        0.02060088887810707,
        0.06931020319461823,
        -0.004121656529605389,
        -0.004095649346709251,
        0.0137430215254426,
        -0.08590597659349442,
        -0.004347299691289663,
        0.05064947530627251,
        0.025609565898776054,
        -0.01715133897960186,
        -0.06283768266439438,
        1.183462880089718e-32,
        -0.020359063521027565,
        0.06121852248907089,
        0.008181189186871052,
        0.1024371087551117,
        0.014925663359463215,
        -0.0412839874625206,
        0.036095622926950455,
        0.08467119932174683,
        -0.006679913029074669,
        0.027397701516747475,
        0.0013017159653827548,
        0.05109424516558647,
        -0.05112345144152641,
        0.033982500433921814,
        0.02069954201579094,
        -0.0323265977203846,
        -0.028041252866387367,
        -0.06286075711250305,
        -0.0823359340429306,
        0.04471740499138832,
        -0.002531822305172682,
        -0.03673788905143738,
        0.04121552035212517,
        0.08364702016115189,
        0.10969994962215424,
        0.11061299592256546,
        0.06574136763811111,
        0.058060597628355026,
        0.06314843893051147,
        0.006809476763010025,
        -0.0466584786772728,
        -0.04489334300160408,
        -0.025758538395166397,
        -0.08829256147146225,
        -0.012553251348435879,
        0.004739539232105017,
        -0.005034669302403927,
        -0.006868159398436546,
        -0.008211931213736534,
        -0.016687070950865746,
        -0.005115525331348181,
        -0.009881971403956413,
        -0.02228584513068199,
        -0.01877523958683014,
        0.05596266686916351,
        0.054254233837127686,
        0.08174902200698853,
        0.08404290676116943,
        -0.017417529597878456,
        0.04877321049571037,
        -0.05866677686572075,
        -0.01669662818312645,
        -0.057283516973257065,
        -0.03298017755150795,
        -0.002515216125175357,
        -0.04833528771996498,
        -0.024464797228574753,
        0.09569202363491058,
        0.006969378795474768,
        0.02959289588034153,
        0.021023428067564964,
        0.01150892861187458,
        0.0288242120295763,
        -0.027113191783428192,
        -0.07157576829195023,
        0.08039358258247375,
        0.021773943677544594,
        -0.02338523603975773,
        0.0645345076918602,
        0.0402713418006897,
        -0.013215882703661919,
        0.011670852079987526,
        0.010473540984094143,
        0.004914714023470879,
        0.07106272876262665,
        0.06049025431275368,
        -0.06916769593954086,
        -0.06189345195889473,
        0.014501770958304405,
        -0.03533736243844032,
        -0.07480344921350479,
        0.0673045963048935,
        0.007715752348303795,
        0.06089344620704651,
        -0.06281675398349762,
        -0.10460016876459122,
        0.001079981797374785,
        -0.02648063749074936,
        -0.022868935018777847,
        -0.03259243443608284,
        -0.01857125572860241,
        0.03459521383047104,
        -0.05835101008415222,
        -0.025419825688004494,
        -0.02810649946331978,
        -1.1918664157353495e-32,
        0.015603904612362385,
        0.03783920407295227,
        -0.011619594879448414,
        -0.008160237222909927,
        0.09033418446779251,
        -0.007051944267004728,
        0.05046875774860382,
        0.06378401070833206,
        0.06857836246490479,
        -0.05602751299738884,
        0.05520855635404587,
        -0.05618720501661301,
        -0.14829540252685547,
        -0.018075600266456604,
        -0.02127041295170784,
        2.7017997126677074e-05,
        -0.05658788979053497,
        -0.052887994796037674,
        0.07420480996370316,
        -0.054119937121868134,
        0.05082361772656441,
        0.15419074892997742,
        0.052183862775564194,
        0.013576426543295383,
        0.03235235810279846,
        -0.016549810767173767,
        0.03229314461350441,
        -0.015508393757045269,
        0.059723034501075745,
        0.06207575276494026,
        -0.0028740791603922844,
        -0.05272270739078522,
        0.009434876963496208,
        0.036607906222343445,
        0.019381070509552956,
        0.005807087291032076,
        0.028549062088131905,
        0.02473679929971695,
        0.02116001583635807,
        -0.11867401003837585,
        0.026394527405500412,
        0.029184885323047638,
        -0.005061445292085409,
        -0.031233694404363632,
        -0.005565608385950327,
        -0.086417555809021,
        -0.012414058670401573,
        0.04345455393195152,
        0.009847031906247139,
        0.021548882126808167,
        -0.04303557798266411,
        -0.07651973515748978,
        0.007112712599337101,
        -0.045965805649757385,
        0.012317541055381298,
        -0.0019347976194694638,
        -0.028422405943274498,
        -0.008604025468230247,
        0.061429984867572784,
        0.012849514372646809,
        0.010909667238593102,
        -0.08153579384088516,
        -0.06813863664865494,
        -0.037430841475725174,
        -0.02572408691048622,
        -0.06613343209028244,
        0.06502632051706314,
        0.06359727680683136,
        0.0038545478601008654,
        0.01257942896336317,
        -0.013695859350264072,
        0.08706755936145782,
        0.07504621148109436,
        -0.031413353979587555,
        0.0517287440598011,
        -0.018204636871814728,
        -0.06395255029201508,
        -0.00292174331843853,
        0.09485884755849838,
        -0.04306487366557121,
        -0.05200716480612755,
        -0.003182025393471122,
        0.03134596720337868,
        0.06917978078126907,
        0.09002627432346344,
        0.07951802760362625,
        0.06424077600240707,
        -0.021120449528098106,
        -0.037429288029670715,
        0.051939867436885834,
        0.06005982309579849,
        0.07211621105670929,
        0.10695213079452515,
        0.11546554416418076,
        -0.07616546005010605,
        -6.316800948980017e-08,
        0.04678293317556381,
        0.014703475870192051,
        -0.054884061217308044,
        -0.0245415810495615,
        -0.0024831551127135754,
        -0.02922373078763485,
        -0.024629248306155205,
        -0.01823926344513893,
        0.0347953662276268,
        -0.04301627352833748,
        0.021198196336627007,
        0.02046225592494011,
        0.02671070396900177,
        0.11872957646846771,
        0.008764647878706455,
        -0.0006586572853848338,
        -0.1024153083562851,
        0.09450914710760117,
        -0.0447472482919693,
        -0.06826897710561752,
        -0.018606845289468765,
        0.050151653587818146,
        0.05473608523607254,
        0.017229747027158737,
        0.04345262050628662,
        -0.010556599125266075,
        -0.031119221821427345,
        -0.016477257013320923,
        0.016991956159472466,
        -0.011576085351407528,
        -0.059918709099292755,
        -0.02424454502761364,
        0.0023792332503944635,
        -0.0014003273099660873,
        -0.055592410266399384,
        -0.06750662624835968,
        -0.08422976732254028,
        0.022827256470918655,
        0.016207240521907806,
        0.04119764268398285,
        -0.016575228422880173,
        -0.12269041687250137,
        -0.05160166695713997,
        0.002025640569627285,
        0.01129548717290163,
        -0.06011276692152023,
        0.0026909911539405584,
        -0.12962494790554047,
        -0.041156940162181854,
        0.038275983184576035,
        -0.035967063158750534,
        0.040339142084121704,
        -0.004722949583083391,
        -0.06808649748563766,
        0.06359189748764038,
        0.02644636668264866,
        0.009637177921831608,
        0.02773749642074108,
        -0.05296049267053604,
        -0.03802959620952606,
        0.015293685719370842,
        0.03273604437708855,
        -0.08042037487030029,
        0.020685145631432533
    ]
}