{
    "id": "qMWAY8Cdsz0",
    "title": "I Have to Pirate COLOURS Now?? - Pantone Connect + Adobe split",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-11-13T18:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=qMWAY8Cdsz0",
    "category": "Science & Technology",
    "tags": [
        "adobe",
        "pantone",
        "creative cloud",
        "creative suite",
        "photoshop",
        "illustrator",
        "colour",
        "color",
        "colour books",
        "books",
        "colour matching",
        "colour system",
        "pigment",
        "licensing",
        "software",
        "software as a service",
        "saas",
        "pantone connect",
        "swatches",
        "spot colour",
        "plastic chips",
        "piracy"
    ],
    "views": 3413788,
    "likes": 132322,
    "comments_count": 10608,
    "description": "TEAMGROUP's Black Friday/Cyber Monday Sale:  TEAMGROUP Delta RGB DDR5 6400 - White at Micro Center:   Buy a Seasonic Prime TX-1600:   Pantone recently decided that their expensive plastic chips and colour matching binders were not making enough money. Now, even old files will stop working if you dont pay up.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:26 Who is Pantone and what do they do? 2:49 Adobe x Pantone comes to an end 3:50 That doesn't make sense... 4:19 It's literally just business 5:48 Adobe pockets the money and Pantone double-dips 7:51 Why is it bad when Pantone does it? 9:14 It's not in itself as big a problem as you think 10:45 Some ways around the problem 11:48 DO WHAT YOU WANT CAUSE A PIRATE IS FREE 12:23 You can't own Creative Cloud 14:08 Adobe can do whatever they want and you have no say 15:30 Conclusion - Make some noise",
    "description_links": [
        "https://bit.ly/3FffwDC",
        "https://bit.ly/3CGMObR",
        "https://geni.us/TBRYP9U",
        "https://linustechtips.com/topic/1467378-i-have-to-pirate-colours-now/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This tweet from Ian Anderson is a preview of what you'll see if you load a file that uses Pantone colors in Adobe Creative Cloud after November, 2022. And if you think that's outrageous, you're absolutely right. Creators projects are suddenly getting held for ransom all because Pantone, the color control monopoly got into a slap fight with Adobe, the creative software monopoly and somehow managed to come out looking even worse, worse than Adobe. No one likes Adobe. Pantone did this to force users to pay their own $15 per month subscription on top of what they already pay for Creative Cloud. And to say that the internet hated that would be putting it very lightly. To say that, I hated that as the owner of a company that makes such heavy use of Pantone that I spent $10,000 on their fancy colored plastic would be like saying water is wet. But hold up. There are so many questions right now, like who even is Pantone? Whose fault is all of this really? Is there a workaround? And who's the sponsor? Who's gonna help cover all this cost? - It's Seasonic, Seasonic Prime TX-1600 Watt Power Supply features in 80 plus titanium rating, hybrid fan control, and a 12-year warranty. Learn more at seasonic.com or through the links below. - Pantone has been around since before the digital age and today is best known for producing colour swatches in various mixtures and materials that aim to ensure that when you specify Pantone 1655-C to a printer or fabricator, your ad or screwdriver or hoodie will definitely be exactly LTT orange unless the producer messes something up. It's a proprietary system and a walled garden. But when it works, it works really well and we use it all the time at Creator Warehouse and for our own channel branding. And while it's a pricey system, it saves so much time and effort going back and forth with partners trying to get a color just right that it's kind of actually justified. They don't even need a color calibrated display because you can calibrate right in the real world. This convenience comes at a cost though. Pantone's different material color matching books cost hundreds of dollars each and that's what the expectation that they will ideally be replaced every year or at most 18 months. Take it from me. Rebuying this crap all the time, sucks. But it also makes sense considering that paper, inks, fabrics, and even plastics do fade over time diminishing the accuracy of the color swatches which defeats the purpose entirely. Thankfully, Adobe added support for Pantone spot colors back in Photoshop 5.0. Allowing you to use colors in your digital art that can be easily verified by your printing partner. The problem is that those Pantone books I was talking about don't come with a digital edition or license to use them in, for example, Photoshop or Illustrator. So when Pantone revoked the license that they had previously issued to Adobe to include Pantone color books with Creative Cloud, end users were left with solid black instead of LTT orange or short circuit purple or whatever else. Even if they created their file with those colors before Adobe and Pantone parted ways. And it's this that me of the most. The fact of the matter is that I'm the customer. And when I look at both Adobe and Pantone, all I see is massive corporations that are ranked as some of the most profitable enterprises on Earth. Like are you seriously telling me that Pantone so desperately needed to make that extra little bit of money that they couldn't have just made a small adjustment to the prices of their already ridiculously expensive books? And then on the other side, Adobe's profits have gone to the moon since moving to a subscription model. Whatever Pantone was asking for, could they not have easily absorbed it even without raising prices? But they didn't. And besides Linus, you might say, you took the complete opposite position with YouTube's 4K paywall debacle. And you're right, I did. But there's a reason. It's because that's a fundamentally different situation. 4K video playback is a massive undertaking in terms of development, storage costs, and the bandwidth cost to serve it compared to lower resolutions. That has a real cost, a real ongoing cost such that it outstrips whatever ad supported viewing could possibly sustain in the long term. And yes, Google is a massively profitable company that could simply absorb YouTube's losses wouldn't be the first time but they're not obligated to, and the Silicon Valley mentality is shifting right before our eyes. YouTube as a business unit, needs to get profitable on its own if it's going to survive with Adobe on the other hand. Well, color accuracy is a core part of their business. The core service that they provide for any number of professionals to have to do their work without color matching on what is meant to be the set of tools for doing design work, that's 100% F. And there is no ongoing cost argument. Digital Inc don't fade, and the whole situation revolves around what is literally a collection of files that are less than half a megabyte in size. This is a licensing thing, it's a pacing match and it has nothing to do with any real cost. What's worse? Creative Cloud isn't exactly getting any cheaper to compensate us for the loss in functionality. Adobe will simply be pocketing whatever amount used to go to Pantone or using it to buy Figma for example. Now you could on that subject argue that Adobe has provided more and more features and services as time goes on to the Creative Cloud suite. But that's sort of the point of a subscription model to begin with, isn't it? If they stopped adding features, they couldn't even pretend that they're not just rent-seeking off of software they've long ago recouped their dev costs on and locked people into. I'm not gonna give them any bonus points for increasing the power of their monopoly here. And for their greed, both Adobe and Pantone are now suffering a serious blow to PR over this dumb spat that resulted in colors being removed from Creative software that has had them since at least 1998. For me though, that's not the real issue. My question is, if they can take this away from me, what else can they take away from me? Adobe no longer sells perpetual licenses to their software products and Creative Cloud subscribers are provided only one major revisions worth of older builds. So if Adobe decides, unilaterally to downgrade rather than upgrade some function, you are going to be forced to go along with it whether you like it or not. I don't know exactly how this whole thing went down. Both sides seem tight-lipped about it likely for legal reasons, but I do have some theories and the most likely one in my opinion is that Pantone saw that Adobe was becoming more popular and more profitable than ever. And since Creative Cloud has millions of active users paying for access every month than, gosh dang it, Pantone should get a cut of each of those subscriptions. Whatever happened next, Adobe likely told them to pound sand and Pantone Connect, Pantone's own subscription service that cost nearly as much per month as Photoshop itself was born. Now you might be thinking Pantone doing this is kind of the same thing as what Adobe did back in 2013 when they transitioned from Creative Suite to Creative Cloud, and the parallels are there. Massively expensive semi-regular purchases getting replaced with a smaller monthly fee that makes it easier for freelancers and occasional users to buy in but increases costs in the long term. There's just one problem with that. Pantone Connect in spite of the apps admittedly cool features like color extract is pretty much useless on its own. You still need the regular expensive purchases like the physical books to compare against. Because even the most precisely calibrated cameras and displays have fundamentally different color gamuts than inks and plastics, it's the fundamental reason Pantone exists to begin with. When you buy these expensive books and color swatches then in my opinion, you should get access to the digital databases for at least the usable life of the book, say 12, 18 months. Now some of the listings mention it, but none that I can find explicitly say you get online access. So unless I'm missing something here, you are now being forced to pay for your books and chips and a monthly fee. And in Adobe's defense, the vast majority of Creative Cloud users, people like photographers, artists, and especially casual users have never and will never use Pantone for much of anything. The people who do have a need for Pantone, people like us at Creator Warehouse, are the ones losing out. And as much as it pains me to admit it, we are the ones who are most able to absorb the extra cost. Looking at it from that perspective, while we'll probably never know what Pantone was asking for, I can kind of see why Adobe wouldn't want to absorb it or pass on an increased cost for Pantone's licensing to all of their users. And if I'm right about that, I don't have the numbers to back it up, then the outrage from the internet at large might be a little overblown even if the whole situation is hard to swallow. Adobe isn't innocent here either though. If you've tried using Pantone and Creative Cloud recently, you'll probably have noticed that colors are straight up missing or wrong. Because ever since Pantone started with Connect, Adobe has refused to update them. Pantone claims that the reason for this is that Adobe hasn't bothered to update them since 2010, and the facts seem to corroborate that. Why Adobe left Pantone hanging like this is anyone's guess until one of the two fess up. Maybe they're trying to build their own color matching system with blackjack and hookers. They certainly have the spare cash to throw around. The good news is that if you're one of those people who desperately needs to clinging to Adobe's apparently quite outdated Pantone books and can't or doesn't want to pay Pantone's fee, then you're in luck. There are ways around it, at least for now. For one thing, three books are still going to be part of the suite so you might not even need to bother with any of this if you're covered by those. Arguably the easiest work around if you aren't though is to simply copy the books out of your old version and plop them down into the new one that doesn't have it. This may not work forever though. And obviously, those outdated books aren't getting any fresher this way. Another solution is to opt out of the Adobe experience altogether by using Affinity by the Serif. Unlike Adobe, Affinity does have the latest books from Pantone and you're dropping a one-time fee to purchase the software, though you do have to pay to upgrade between major revisions just like you used to with Creative Suite back in the before four times. They also have the added benefit of having mobile apps that don't suck. Then there's the other solution. I would never advocate for software piracy, but someone clearly does. Photoshop has long been one of the most pirated applications in the world. And while many people did sign on with Creative Cloud, it never really stopped. And this whole situation is one of the reasons that pirates, who otherwise have the means to buy, do what they do. And if anything, the reasons they have for pirating Creative Cloud have only broadened, and Adobe and others who are looking to emulate this software as a service business model should be taking notes. Think about it. When you sign up for any software as a service, what are you actually getting? You're not getting the software, not really. You're getting access to the software and that's an important distinction. Actually getting the software means you get to keep it and use it in perpetuity. It may not get support or major new features without a paid upgrade, but you have the choice to do that or not. And up until Adobe superseded Creative Suite 6 with Creative Cloud, you had that choice. Some people even held onto even earlier versions of Creative Suite. And and I cannot stress this enough, all of those people can still use Pantone colors as outdated as they may be. When you pay for access to software, you're subject to the whims. Yes, it's often at a substantially lower cost of entry. But how does it add up in the long term? Creative Cloud might seem like a steal at $55 a month compared to paying hundreds up front per app. But after just under four years, you will have actually paid for the most expensive all inclusive CS 6 package that existed. And that price, which incidentally is what you're locked into after the free trial comes with a yearly obligation. That's right, I still remember when I found this out the hard way when I wanted to remove one of our Creative Cloud suites. If you cancel early, you get slapped with a big fat fee. If you want pay as you go instead, it's 82.49 a month and you'll hit that crossover point with CS 6 in less than three years. With the added bonus of not even getting to keep it and your Pantone colors when you stop paying. And what would happen to you as a subscriber if Adobe's authentication service went down? All right, we've seen what happens. The entire Creative world screeches to a halt. And if Adobe shut down, everything tomorrow, literally everyone using Creative Cloud would be screeched to that halt permanently no matter how much they've paid. This is the problem with software as a service and there are many parallels with always online games. And this situation with Pantone is as much Adobe's fault as Pantone's. And Adobe is also responsible for the lack of competition in this space that might give Pantone or their users any leverage. I mean, what are you going to do, use GIMP? They've already purchased most of the serious competition and the rest have caveats that people in professional settings can't really work around if they wanna be able to collaborate with everyone else who's standardized on Adobe. Adobe has effectively created its own little monopoly sandbox. And almost universally, their users are unhappy about it. But like they always have, they ensure a steady stream of new users by supplying students with dirt cheap rates to learn on so that they are well and truly hooked into the ecosystem by the time they graduate. In case you were wondering by the way, how it came to be that Adobe became the de facto standard for professionals. All of which is to say neither Pantone nor Adobe are coming outta this smelling like roses. And the biggest loser as always is you, the customer. This time we got away with a mere $15 a month extra fee. This time it only affected a small subset of users. But what will they come for next time? What will they charge to get it back? If companies are gonna provide this one price all access software as a service experience only to have it be degraded like this and the users accept it, you can expect more just like it in the future. Just like you expected this segue, to our sponsor. - TeamGroup, it's that time of year once again. TeamGroup is having their annual Black Friday and Cyber Monday sales, and they've organized a cyberpunk style website with tons of deals, save on high quality RAM, storage, flash drives, and SD cards. One of the things on sale is their Delta RGB DDR5 RAM kit. The kit is compatible with various RGB software like Asus Aura Sync offers up to 6,600 megahertz and supports Intel's XMP 3.0 for easy one click over clocking. Use the link in the description to check out TeamGroup's Black Friday/Cyber Monday sale today. - If you liked this video, go check out the time I actually went to bat for YouTube charging for 4K only to have them bump my YouTube premium price by $5 a month the next day. That was a bit of a wild ride.",
    "transcript_keywords": [
        "Creative Cloud",
        "Pantone",
        "Adobe",
        "Ian Anderson",
        "Adobe Creative Cloud",
        "Creative",
        "Cloud",
        "Creative Cloud suite",
        "Pantone colors",
        "Creative Suite",
        "Creative Cloud users",
        "Adobe left Pantone",
        "tweet from Ian",
        "Pantone color books",
        "Adobe Creative",
        "software",
        "color",
        "Adobe superseded Creative",
        "Pantone books",
        "Pantone Connect"
    ],
    "transcript_entity_values": [
        "Silicon Valley",
        "one",
        "82.49",
        "hundreds of dollars",
        "Connect",
        "four",
        "Seasonic",
        "Figma",
        "10,000",
        "Google",
        "first",
        "Seasonic",
        "2010",
        "Cyber",
        "Asus Aura Sync",
        "Intel",
        "Affinity",
        "One",
        "SD",
        "Adobe",
        "RGB",
        "less than half",
        "Adobe",
        "Black Friday/Cyber",
        "a mere $15",
        "monthly",
        "less than three years",
        "5",
        "Pantone Connect",
        "80",
        "15",
        "Creative Cloud",
        "up to 6,600 megahertz",
        "today",
        "12-year",
        "Digital Inc",
        "2013",
        "TeamGroup",
        "November, 2022",
        "Adobe Creative Cloud",
        "Photoshop",
        "Creative Cloud",
        "Ian Anderson",
        "at least 1998",
        "100%",
        "Pantone",
        "every month",
        "Earth",
        "4",
        "Creative Suite 6",
        "LTT",
        "Monday",
        "Serif",
        "Black Friday",
        "three",
        "Delta RGB DDR5 RAM kit",
        "5.0",
        "3.0",
        "YouTube",
        "12",
        "the next day",
        "18 months",
        "Linus",
        "55",
        "hundreds",
        "CS 6",
        "only one",
        "Creative Suite",
        "two",
        "millions",
        "nearly as much per month",
        "tomorrow",
        "most 18 months",
        "every year",
        "the Creative Cloud",
        "Creator Warehouse"
    ],
    "transcript_entity_types": [
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.12009303271770477,
        0.0002865719434339553,
        0.009710287675261497,
        -0.10550186038017273,
        0.13276556134223938,
        0.0412408709526062,
        0.034482989460229874,
        -0.034521736204624176,
        -0.005319500342011452,
        -0.06483691930770874,
        -0.008883765898644924,
        0.053838349878787994,
        0.01563432812690735,
        -0.07068917900323868,
        0.03221326321363449,
        0.014048884622752666,
        -0.019215671345591545,
        -0.02275393344461918,
        -0.0634567067027092,
        -0.008581283502280712,
        -0.09454766660928726,
        -0.07700841128826141,
        -0.01613602414727211,
        -0.014638416469097137,
        -0.07890312373638153,
        -0.00495266355574131,
        0.003758907550945878,
        -0.020585723221302032,
        -0.016466785222291946,
        -0.10544952750205994,
        -0.014886321499943733,
        0.08639658242464066,
        0.0609549880027771,
        0.02525423653423786,
        0.10066989809274673,
        -0.09641056507825851,
        0.029451634734869003,
        -0.05563870817422867,
        -0.08933036774396896,
        -0.05087105557322502,
        0.06168147549033165,
        -0.027515487745404243,
        -0.051808491349220276,
        -0.026266274973750114,
        -0.02171887829899788,
        -0.051414236426353455,
        0.06039987877011299,
        0.02562100812792778,
        -0.012856925837695599,
        0.03010222129523754,
        -0.019811196252703667,
        -0.004670989234000444,
        -0.014886126853525639,
        -0.04516927897930145,
        -0.02547815814614296,
        0.0294721070677042,
        0.027507901191711426,
        -0.010845527052879333,
        0.04209427908062935,
        -0.0029169623740017414,
        -0.001694720471277833,
        -0.05766534060239792,
        -0.07634616643190384,
        0.07838308066129684,
        0.01487182080745697,
        0.0345446839928627,
        0.06631659716367722,
        0.06308335810899734,
        -0.011575689539313316,
        -0.029599709436297417,
        -0.0028078940231353045,
        -0.014086540788412094,
        0.06375942379236221,
        0.12287498265504837,
        0.009279918856918812,
        0.05876517295837402,
        0.06863223761320114,
        -0.013200066052377224,
        -0.029490433633327484,
        -0.11337491124868393,
        -0.06240038201212883,
        -0.08198835700750351,
        0.0226303618401289,
        -0.002375288400799036,
        0.04347541183233261,
        0.05338205024600029,
        0.002215421525761485,
        0.049638960510492325,
        -0.037933092564344406,
        -0.06623068451881409,
        -0.02108575589954853,
        0.1095174178481102,
        0.06218108907341957,
        0.02055060863494873,
        -0.025678010657429695,
        0.01779600791633129,
        0.0708450898528099,
        -0.025599613785743713,
        -0.006230582483112812,
        0.0738150030374527,
        0.06231807544827461,
        0.008660484105348587,
        -0.01752789318561554,
        -0.07767125219106674,
        -0.07396722584962845,
        -0.0952107161283493,
        0.023056315258145332,
        0.09806905686855316,
        -0.02477124333381653,
        0.029746344313025475,
        0.025743933394551277,
        -0.018132271245121956,
        -0.04725559800863266,
        -0.059292253106832504,
        -0.026229824870824814,
        0.017611494287848473,
        -0.0791781097650528,
        0.017565501853823662,
        0.045132264494895935,
        -0.07202082127332687,
        0.026702115312218666,
        -0.02503788471221924,
        -0.08068148791790009,
        -0.07095979154109955,
        -0.0871121808886528,
        -0.04109364375472069,
        0.043920133262872696,
        2.740109244601667e-34,
        -0.028484666720032692,
        0.026616031304001808,
        -0.04799771308898926,
        -0.06974257528781891,
        0.05059564486145973,
        -0.00862310640513897,
        0.04523846134543419,
        0.03207770735025406,
        -0.11578407138586044,
        -0.007698860950767994,
        -0.003085581585764885,
        0.0072989147156476974,
        -0.1412934958934784,
        0.0566854253411293,
        -0.03365879878401756,
        -0.024268707260489464,
        -0.01827063411474228,
        -0.009110834449529648,
        -0.02787811867892742,
        -0.020581133663654327,
        -0.06829153001308441,
        0.016829349100589752,
        0.03778163343667984,
        0.003930042497813702,
        0.037345316261053085,
        0.010694227181375027,
        -0.010945044457912445,
        0.0059841531328856945,
        0.15762783586978912,
        0.027308102697134018,
        0.00717146834358573,
        0.03402959927916527,
        0.11132876574993134,
        0.016155336052179337,
        -0.06515947729349136,
        0.06913184374570847,
        -0.06849992275238037,
        -0.05989191308617592,
        0.027260607108473778,
        0.04272191971540451,
        0.002852469915524125,
        -0.00458492198958993,
        -0.09133681654930115,
        -0.032181642949581146,
        -0.03728970140218735,
        0.0006055354606360197,
        0.04722675308585167,
        -0.010092749260365963,
        0.012345433235168457,
        0.03750751167535782,
        -0.05393819883465767,
        0.01939895935356617,
        -0.07721347361803055,
        -0.02877620793879032,
        -0.0027545145712792873,
        -0.08476551622152328,
        -0.01650068908929825,
        -0.04289387911558151,
        0.08968980610370636,
        -0.051212944090366364,
        0.053948309272527695,
        0.05431927740573883,
        0.06209205836057663,
        -0.026233000680804253,
        0.013658375479280949,
        0.079271599650383,
        0.07834433764219284,
        -0.01006502378731966,
        -0.08417913317680359,
        -0.018511109054088593,
        0.01178461592644453,
        0.014000244438648224,
        0.06225426122546196,
        -0.0035825390368700027,
        0.006666270084679127,
        -0.038459811359643936,
        -0.10019496828317642,
        -0.03538817912340164,
        0.04689866304397583,
        0.03128795325756073,
        -0.012643731199204922,
        0.007721296511590481,
        -0.022596698254346848,
        0.013458662666380405,
        -0.08489321917295456,
        0.02696717530488968,
        0.06007646024227142,
        0.03838755190372467,
        -0.029278980568051338,
        -0.020481128245592117,
        0.017237365245819092,
        -0.0013773939572274685,
        0.007383489515632391,
        -0.0247449092566967,
        -0.022360842674970627,
        -4.249564892488176e-33,
        -0.022777767851948738,
        -0.028837189078330994,
        -0.05753924325108528,
        0.10155491530895233,
        -0.03018219769001007,
        -0.03561525419354439,
        0.02380826696753502,
        0.023004785180091858,
        0.07378729432821274,
        0.005109201185405254,
        0.022374412044882774,
        0.033443253487348557,
        -0.057741984724998474,
        -0.04684595391154289,
        -0.05925488844513893,
        -0.05569235980510712,
        0.03401459380984306,
        0.08556167036294937,
        0.015432354062795639,
        -0.07011063396930695,
        -0.006832336075603962,
        0.0002745727833826095,
        -0.005092465318739414,
        0.1248672679066658,
        -0.021360676735639572,
        0.02231827937066555,
        -0.0014017274370416999,
        0.01501462422311306,
        -0.03690645098686218,
        0.039077114313840866,
        0.0543350875377655,
        0.0027703691739588976,
        -0.05254051089286804,
        -0.040618546307086945,
        0.034890614449977875,
        -0.046180397272109985,
        0.05173903703689575,
        0.09980931878089905,
        -0.05840393900871277,
        -0.032221127301454544,
        -0.022951984778046608,
        -0.04673440009355545,
        -0.03317281976342201,
        -0.03197578713297844,
        -0.000506047741509974,
        -0.1274147480726242,
        -0.010920591652393341,
        -0.03087284043431282,
        0.015957225114107132,
        0.010296689346432686,
        0.04911515489220619,
        -0.034282512962818146,
        0.08874453604221344,
        -0.08323665708303452,
        -0.0020368769764900208,
        0.10125923156738281,
        0.003872934263199568,
        0.04402368515729904,
        -0.008547741919755936,
        0.02234199084341526,
        0.01102033443748951,
        0.022801002487540245,
        -0.06306570768356323,
        0.0034227557480335236,
        0.0255681574344635,
        0.018646765500307083,
        0.07864132523536682,
        0.00940066110342741,
        -0.008257860317826271,
        0.03468715026974678,
        0.00605792598798871,
        -0.013007115572690964,
        0.03880107402801514,
        -0.045767247676849365,
        0.006967803929001093,
        0.0047589261084795,
        -0.017143726348876953,
        0.08186504244804382,
        -0.06086549162864685,
        0.0075475359335541725,
        0.027828767895698547,
        0.04768522456288338,
        0.08748539537191391,
        0.03269768878817558,
        -0.02347753196954727,
        0.023391256108880043,
        0.022823287174105644,
        -0.008774961344897747,
        0.0024755464401096106,
        -0.07684005051851273,
        -0.06318934261798859,
        0.006782736629247665,
        0.017429236322641373,
        0.04393748566508293,
        0.0014477459480986,
        -5.662520052851505e-08,
        0.018929198384284973,
        -0.006207756698131561,
        6.31034272373654e-05,
        0.04070385918021202,
        -0.014735320582985878,
        -0.024854807183146477,
        0.022068623453378677,
        -0.008416476659476757,
        0.05626479536294937,
        0.009514471516013145,
        0.014444165863096714,
        -0.1125517413020134,
        -0.050518348813056946,
        -0.01766272820532322,
        -0.036189038306474686,
        0.004920517094433308,
        0.017822233960032463,
        0.002689759014174342,
        -0.0648103803396225,
        -0.09640904515981674,
        -0.06487260013818741,
        0.06289837509393692,
        0.10783855617046356,
        -0.042411498725414276,
        -0.022778291255235672,
        0.07250366359949112,
        -0.008155194111168385,
        0.048949580639600754,
        0.07625430822372437,
        -0.01269973162561655,
        -0.09287341684103012,
        -0.0065536187030375,
        -0.00875022355467081,
        0.006033105310052633,
        0.022949116304516792,
        -0.0862760990858078,
        -0.05392532795667648,
        0.09791893512010574,
        0.011744238436222076,
        0.0045569781213998795,
        -0.042240384966135025,
        -0.04419436305761337,
        -0.028844419866800308,
        -0.011511111631989479,
        0.04345046356320381,
        -0.10717591643333435,
        -0.045548271387815475,
        -0.007599723059684038,
        -0.02908712439239025,
        0.013587730936706066,
        -0.004471818916499615,
        -0.009158860892057419,
        -0.057503022253513336,
        0.05698074772953987,
        0.03205028921365738,
        -0.08548438549041748,
        -0.017509859055280685,
        0.10034048557281494,
        -0.013462452217936516,
        0.04405343532562256,
        -0.0023611984215676785,
        -0.1734585016965866,
        0.009869573637843132,
        0.0835862010717392
    ]
}