{
    "id": "QNakbNjdrjk",
    "title": "4K PC Gaming is Cheap Now! - $1000 Gaming PC Build 2022",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-14T19:00:49Z",
    "video_url": "https://www.youtube.com/watch?v=QNakbNjdrjk",
    "category": "Science & Technology",
    "tags": [
        "$1000 gaming pc",
        "4k gaming pc $1000",
        "nvidia",
        "amd",
        "intel",
        "gaming computer",
        "gaming pc",
        "pc gaming"
    ],
    "views": 2591133,
    "likes": 83029,
    "comments_count": 3591,
    "description": "Visit  and use offer code LTT for 10% off  Check out Teamgroup's giveaway at   $1000 Gaming PCs are BACK baby! 4K wont cost you an arm, a leg, and your first born anymore.  Discuss on the forum:   Buy Intel Core i5 Core 12400F CPU:  Buy ASUS Prime B660-PLUS D4:  Buy G.Skill Ripjaws V 16 GB (2 x 8 GB) DDR4:  Buy Intel 670p 1TB M.2 NVME SSD:  Buy EVGA SuperNOVA 120-GP-0850-X1 PSU:  Buy Phanteks Eclipse P300A Case:  Buy Fractal Design Pop Air Case:  Buy Intel Core i5-12600KF CPU:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:48 Motherboard 1:40 CPU 2:58 SSD 4:14 RAM 4:40 Case 5:45 Power Supply 6:45 Assembly 8:37 GPU 9:37 Closing it up 10:29 Gaming 11:16 Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://bit.ly/3P1bcJy",
        "https://linustechtips.com/topic/1443227-4k-gaming-is-cheap-now/",
        "https://geni.us/A2vtpj",
        "https://geni.us/YTBx",
        "https://geni.us/K6VW",
        "https://geni.us/Apet2kv",
        "https://geni.us/vzvNHL",
        "https://geni.us/IEv1G",
        "https://geni.us/H5LAbPk",
        "https://geni.us/Hq3A",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Whatever will we do to keep warm during this frigid crypto winter? - Have you tried looking at the hot prices on GPUs? There's so many deals to be had that clearly, it's time to party And by the party, I mean build computers. Now, we did just do a $500 PC build. But the case wasn't very good and it was filled to the brim with used components. So this time, we're spending $1,000 and we are going brand new, baby. Except for the graphics card. That's still gonna be used. But it's gonna be great! You know, what else is great? Today's sponsor! Team Group. Team Group is giving away an exclusive set of their 32 gigabyte, Delta RGB, 6,400 mega transfers per second, DDR5 memory modules, along with other fabulous prizes. Learn more at the link down below. At double the budget of our last bang for the buck gaming PC, we've clearly got more money to spend. But what we don't have is money to waste. And that's why, instead of springing for Intel's shiny Z690 premium platform, we've gone with their mid tier B660. It's everything we need. You get twice as many Ram slots compared to H610, greater bandwidth to the chip set which enables better I/O, like front USB Type-C, more M.2 slots, that kind of good stuff. And, perhaps most importantly, it supports memory overclocking, allowing us to squeeze a little bit more performance out of our CPU. The particular board we've chosen, the B660-PLUS D4 from Asus is fine. It's got RGB, 2.5 gig LAN, decent cooling on the VRM's, and as much I/O as most people are likely to need. It's got a lot of RGB. It has five RGB headers. (laughs) Okay. For our CPU, we've got a big upgrade over last time. The 12400F may only turbo 100 MHz higher than the 12100 that we used last time, but it also has two full additional cores. Now, you could spring for a 12600KF. Four additional cores, even if they're efficiency ones, would be a huge boon for multi-threaded workloads. But it's 70 more dollars and doesn't come with a heat sink, which adds at least another 25 to $40 to your cost. At this budget, we just can't make that work without another trade-off that we wouldn't be comfortable with. We've used this cooler before, so I'll need to apply some thermal compound to the CPU. But if you bought this brand new, there would already be some thermal paste pre-applied here and you really don't need to reapply it. And the installation of this boy is as simple as pressing on these. It's like sticking pins into a baby. (baby crying) - [David] What? - One typical drawback of budget boards is that you might not find the headers in their usual or ideal locations. So the CPU fan header is over here by the rear I/O, rather than being up along the top edge. It's not as nice for cable management, but it's not going to affect performance. I'm gonna take all these horrible little M.2 standoffs and pre-install them. ASUS, you could have done this. But instead, you wanted to save a dollar. Since we're at it, now seems like a perfect time to install our SSD. While the conventional wisdom would tell us, take your boot drive and install it in your highest performing M.2 slot, the one connected directly to the PCIe lanes coming off of the CPU. In our case, we went with a 670P drive from Intel. It's got a five year warranty, and is a great bang for the buck, but what it isn't is a top performer. So rather than waste our top performing slot, which we could install something else in later, I'd rather choose between one of these two. Both of them run at PCIe Gen 4 speeds through the chip set, meaning that you could encounter bottlenecks if you've got a lot of other heavy I/O going on at the same time. But, one of them has 4 lanes and one of them has only 2. We're gonna choose the 4 lane slot. And the reason for that, is that if we installed it in a Gen 4 x2 lane slot, well, because the drive only supports Gen 3, and the slot only supports 2 lanes, we would get Gen 3 x2, cutting our maximum, whoop! I got it. Cutting our maximum throughput in half. It is very convenient that ASUS silk screens this information onto their PCB so you don't have to consult the manual. And it's just such good energy building rigs people can actually afford, you know. - [David] Screws? - Yeah I haven't, oh. For our RAM, the obvious choice was DDR4. We've gone with a 3,600 mega transfers per second, 16 gig kit from G.SKILL because we feel this is the sweet spot in terms of bang for the buck for gaming. We could have gone for a DDR5 board and DDR5. But the reality of it is, while there are performance benefits in some scenarios, it's not all the time, and the additional cost just doesn't make sense to us at this price. Now it's time to drag out our case. The P300A from Phanteks. It might not come with the greatest packing material, and it might not have all the frills and gimmicks, but what it is is a solid value, pretty darn good looking, and compared to our last case, it has much better airflow and is a lot nicer to build in. Just little creature comforts, like better cable management here. You can see, you can hide everything away back there. And just having all the edges folded over. So you're not liable to cut yourself while you're digging around in it. You don't have to go the same route as us, though. At this price, about $80 USD, there are lots of options. One notable one is the Fractal Design Pop Air. Before you forget, bend back these. Otherwise, they will end up in your slots and you will have to take out your motherboard to fix it. Then the I/O shield pops in, a little something like that. Credit to Phanteks for having a nice, (screwdriver tapping) robust system for attaching their hard drive cage to the case. But that means that if we wanna completely remove it to fit our large power supply, we've gotta take out a whopping eight screws. Our power supply choice, an EVGA superNOVA 850 G+, might look a little overkill. It's 850 watts, 80 Plus Gold, and it's got a modular interface. But at this price point, we can afford some creature comforts and we can afford a little bit of the f-word. Future proofness. A good quality power supply is a benefit both today, giving your components nice, clean power, and down the line when you go to upgrade and knowing what we know, at least from the rumor mill, about NVIDIA's upcoming 4000 series cards, a high wattage power supply is looking like a pretty good play at the moment. They're accustomed to operating on GPU margins. So they came into the power supply space all like, \"Who needs to make (beep) money! We're EVGA!\" And that right there is why we can't have a hard drive cage. You could pick up an 850 watt power supply that's a little shorter than this one. Maintain your hard drive cage. But at 90 bucks, it is hard to argue with that value. The last two modular cables we're gonna install are an 8 pin CPU connector. Well, it looks a little something like that. And one of these dual 6+2 pin connectors for our GPU. One option, by the way, for expanding your storage now that you've given up your hard drive base, is throwing two and a half inch SSDs on these sleds. Well, this one sled at the back, or you could just double side a tape them wherever you want. Pro move at this stage in the game is to pre-run your cables to where they need to go. Ow! Now we can go ahead and install our motherboard. One of my favorite features of Phanteks' cases is that the middle motherboard standoff has this little kind of raised, nipple, lip thing, that helps the board stay in place. Once you've got it positioned over the middle hole. All right, won't move. EVGA doesn't have the little the little things that hold the two 4 pins together, so. (grumbles) I'll figure it out. While you're cursing EVGA trying to get that installed, you can just think about the money you saved. Here comes our front USB 3.0. Little something like that. Isn't it beautiful? Our one case fan does not quite reach. (Linus groaning) (Linus laughing) - [David] Aww. - That's okay, there's a solution to this problem. We will un-zip tie it. Gotta appreciate nice clear labels on front panel connectors. Shout out motherboard manufacturers and case manufacturers that do that. Why look at the manual if I don't have to, you know? Now we've got our front panel audio right down here in the bottom left corner. Boop! And that is pretty much it. Can I just say I love budget builds? No RGB, no all-in-one water coolers with a whack ton of fans everywhere, and especially RGB. (beep) RGB. This is great. - [David] Ridiculous gamer bull (beep). It's kind of amazing when you think about it, that 999 has been the sweet spot for a DIY gaming rig for basically as long as I have been in the business. You can get RTX 3070's these days for anywhere from around 400 to $450. Yes, they are second hand, and there is a chance that someone will sell you defective goods. But that's what buyer protections are for. So if a shady seller says, \"Oh hey, why don't we do the transaction off of eBay so that I can save the transaction fee?\" You say \"No.\" Buy it, make sure it works and if it does, $400 RTX 3070 baby, let's go! If you dispute something, say, \"Look, they shipped me a brick.\" Or \"They shipped me a defective product.\" You can get a refund pretty much no questions asked. We went with a ZOTAC card, but really at this point you're gonna be choosing based on the price that you can find it for as opposed to which particular brand you prefer. It's not like you're gonna have warranty support anyway because it is a secondhand product. One thing that occurs to me is you will wanna watch out for I/O. If, for whatever reason, you need dual HDMI ports, not every 30 series has those. And you can see that ours does not. It can fit so much gaming in here. (hand patting) RTX 3070! Jake was sad he missed the peel, but there's a second peel. Cable management here is not bad. I think we're ready to close it up. By the way, if you haven't already signed up for a notification, the LTT screwdriver is coming so soon. (screwdriver rattling) Head over to lttstore.com. I have some doubts about our RTX 3070 in a case with no front intake fan, but optimism? This computer GPU fan is definitely ramping up a little bit. I happen to also shoot the all Noctua build today. That was quieter. (laughs) You know, we're not in game yet. We're not in match. Serviceable. What's also serviceable is our Floatplane exclusives. (fingers snapping) By the time this goes up, Yvonne's Meet the Team will probably be there. I haven't watched it. I don't know what she said. Hopefully it was all nice things. Guys, I'm running at 4k medium presets right now. That is responsive. It's responsive! Look at that. You got a nice, no one on my team is gonna drive me. (guns firing) 60 FPS, Halo Infinite, 4k medium. If you can't get kills at these kinds of settings, then the issue was not, okay really? (guns firing) What is my partner doing? Did you wanna get me a shot at anything, maybe? Oh my God. The worst driver ever. That 3070 baby. Definitely good enough to get kills, boys! I love that this is a grand. You, too, could be the proud owner of this machine. And you could die just like that. We are turbo-ing all the way to 1,850, 1,875. GPU temps are under 80. That's fantastic! I mean, you gotta love that nice open front mesh panel because even though we've only got the one exhaust fan and boy, is it ever moving some heat out. (laughs) It's just that there's no resistance to the airflow. So it's able to draw that fresh air in from the front and keep that GPU fed. I kind of love this machine. Just like I love our sponsor! - Squarespace! If you're thinking about creating and sharing your own content online, give Squarespace a try. Squarespace is the all-in-one platform for building top tier websites to grow your brand online. There are award-winning designs with easy to use tools, have you up and running in no time, even if you have little to no experience building websites. Upload or embed your video library and organize them with Squarespace's best-in-class templates to explore new ways you can monetize your work. Display your social media posts and push website content out to your channels together. Use Member Areas to unlock a whole new revenue stream for your videos by posting exclusive content behind a subscription or one time fee. And Squarespace's analytics and insight ensure you're optimizing your website every step of the way. Head squarespace.com/ltt to get 10% off today. - If you guys enjoyed this video, we just did a $500 gaming ring that is also fricking amazing.",
    "transcript_keywords": [
        "frigid crypto winter",
        "time",
        "RGB",
        "power supply",
        "CPU",
        "case",
        "drive",
        "crypto winter",
        "frigid crypto",
        "good",
        "power",
        "front",
        "GPU",
        "hard drive",
        "nice",
        "supply",
        "Squarespace",
        "slot",
        "Gen",
        "hard drive cage"
    ],
    "transcript_entity_values": [
        "3070",
        "five year",
        "one",
        "eBay",
        "LAN",
        "SSD",
        "Phanteks",
        "eight",
        "One",
        "Floatplane",
        "RGB",
        "the Fractal Design Pop Air",
        "two and a half inch",
        "6,400",
        "around 400 to $450",
        "fed",
        "10%",
        "The P300A from Phanteks",
        "EVGA",
        "GPU",
        "Ram",
        "David] Screws",
        "400",
        "LTT",
        "at least another 25",
        "Linus",
        "half",
        "Four",
        "G+",
        "ASUS",
        "USB 3.0",
        "H610",
        "80",
        "VRM",
        "6",
        "Today",
        "3070",
        "12400F",
        "4",
        "Gen 4 x2 lane",
        "Squarespace",
        "CPU",
        "un",
        "60",
        "2.5",
        "DIY",
        "Intel",
        "1,875",
        "DDR5",
        "12100",
        "12600KF",
        "4000",
        "Delta RGB",
        "32 gigabyte",
        "USB Type-C",
        "Gen 3",
        "B660",
        "only 2",
        "16",
        "Boop",
        "five",
        "between one",
        "1,850",
        "Team Group",
        "M.2",
        "30",
        "under 80",
        "superNOVA 850",
        "two",
        "these days",
        "999",
        "PCB",
        "second",
        "Gen 3 x2",
        "90 bucks",
        "Jake",
        "Halo Infinite",
        "G.SKILL",
        "Yvonne's",
        "winter",
        "Asus",
        "PCIe Gen 4",
        "70 more dollars",
        "850 watt",
        "ZOTAC",
        "today",
        "NVIDIA",
        "4k",
        "3,600",
        "RAM",
        "8",
        "850 watts,",
        "40",
        "1,000",
        "500",
        "2",
        "about $80 USD",
        "DDR5",
        "Noctua"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "FAC",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.019121496006846428,
        0.011319968849420547,
        0.008076777681708336,
        -0.02484614960849285,
        0.02832333743572235,
        0.0093397106975317,
        0.0032300977036356926,
        0.04554736614227295,
        -0.05583413690328598,
        0.036381516605615616,
        -0.057597145438194275,
        -0.030255436897277832,
        -0.03780139237642288,
        -0.05832548066973686,
        0.019877327606081963,
        0.057525020092725754,
        0.11830571293830872,
        -0.05717671662569046,
        -0.039399657398462296,
        -0.03757317364215851,
        -0.06050165370106697,
        -0.08641187101602554,
        -0.03601585701107979,
        -0.07504595816135406,
        0.04530595615506172,
        -0.011151300743222237,
        0.07585399597883224,
        -0.07438214123249054,
        -0.013448757119476795,
        -0.028113331645727158,
        0.03460186719894409,
        0.011724881827831268,
        -0.024376902729272842,
        0.03907471522688866,
        0.04598470404744148,
        -0.034031059592962265,
        0.09340701252222061,
        -0.09140848368406296,
        -0.03141424432396889,
        -0.05921030044555664,
        -0.025138283148407936,
        -0.014583404175937176,
        -0.04025276005268097,
        0.054086118936538696,
        0.028965724632143974,
        0.03450947627425194,
        -0.01979408599436283,
        -0.012928711250424385,
        0.06364179402589798,
        0.015952840447425842,
        -0.003831236157566309,
        -0.050686273723840714,
        -0.00473548611626029,
        -0.04318292438983917,
        -0.13057751953601837,
        0.029329827055335045,
        -0.03742581233382225,
        -0.05733133479952812,
        0.04442979395389557,
        0.04040711745619774,
        0.07202330976724625,
        -0.13371822237968445,
        -0.02719009481370449,
        0.0665695071220398,
        0.016192937269806862,
        0.024412253871560097,
        0.07071336358785629,
        -0.005406529642641544,
        0.004613421391695738,
        -0.0002603967150207609,
        0.023339541628956795,
        0.029641559347510338,
        0.040855925530195236,
        0.03313158079981804,
        -0.0323696993291378,
        0.014664297923445702,
        0.0980115532875061,
        -0.10274796187877655,
        0.06518208235502243,
        0.028130140155553818,
        -0.02454761415719986,
        -0.0012438750127330422,
        -0.028248103335499763,
        -0.08579276502132416,
        -0.022594956681132317,
        0.001972694881260395,
        -0.003351296065375209,
        -0.027191344648599625,
        0.018861737102270126,
        -0.08749973028898239,
        0.06372775882482529,
        0.049905505031347275,
        0.07740020006895065,
        0.02116939052939415,
        0.04350629448890686,
        0.08736240118741989,
        0.027547122910618782,
        -0.1022283285856247,
        -0.03614050894975662,
        0.08065927773714066,
        -0.028336644172668457,
        0.02276715822517872,
        0.0875353291630745,
        0.013741233386099339,
        -0.05767311155796051,
        -0.01978178322315216,
        -0.030278095975518227,
        0.058948200196027756,
        -0.07903318107128143,
        0.014273258857429028,
        -0.059433359652757645,
        0.04455523192882538,
        -0.07042723894119263,
        0.015065036714076996,
        0.06526563316583633,
        -0.03373093530535698,
        -0.01898074522614479,
        -0.0016611915780231357,
        0.05423389747738838,
        0.03678421303629875,
        -0.014261899515986443,
        -0.014370187185704708,
        -0.03576720133423805,
        0.03322272375226021,
        -0.007038711570203304,
        0.009364444762468338,
        -0.08280646800994873,
        1.0009457089474645e-32,
        0.016443323343992233,
        0.10295427590608597,
        0.0035146712325513363,
        -0.07812903821468353,
        -0.0380256362259388,
        -0.022988326847553253,
        0.06796444952487946,
        -0.02379288151860237,
        -0.029734091833233833,
        0.04867151379585266,
        -0.017463602125644684,
        -0.04113372042775154,
        -0.027024192735552788,
        0.054200269281864166,
        0.07470299303531647,
        -0.07469990104436874,
        0.015724647790193558,
        0.006309186574071646,
        0.04284568503499031,
        0.0415620431303978,
        0.016909390687942505,
        -0.007222706917673349,
        0.01976628229022026,
        -0.014423196204006672,
        0.0022993104066699743,
        -0.02388809621334076,
        -0.011042717844247818,
        -0.07821241021156311,
        0.0745636448264122,
        0.024315904825925827,
        -0.06742846965789795,
        -0.08041563630104065,
        -0.0340641587972641,
        -0.061302244663238525,
        0.017635520547628403,
        -0.01390005461871624,
        -0.04892018064856529,
        -0.07632378488779068,
        -0.004293547477573156,
        0.002805582946166396,
        -0.0727807879447937,
        0.08772163838148117,
        -0.10485412925481796,
        -0.09097224473953247,
        0.017435932531952858,
        0.004953678697347641,
        -0.0285548847168684,
        -0.0036142440512776375,
        -0.0288961511105299,
        -0.0035904974211007357,
        -0.09349982440471649,
        0.039818115532398224,
        -0.041910186409950256,
        0.0009034803952090442,
        -0.012263483367860317,
        -0.06589651107788086,
        0.062480196356773376,
        -0.062399379909038544,
        0.11473893374204636,
        0.10568860173225403,
        0.008707774803042412,
        -0.05963387340307236,
        -0.0030714324675500393,
        0.020677028223872185,
        -0.05153444781899452,
        0.02686237171292305,
        0.08455383032560349,
        0.03427043557167053,
        -0.09180686622858047,
        0.016369342803955078,
        0.0043588439002633095,
        -0.07216311246156693,
        0.08813567459583282,
        -0.02118467539548874,
        0.05090920254588127,
        0.03184838593006134,
        -0.06176336482167244,
        -0.05158925801515579,
        -0.05260145664215088,
        -0.02880169078707695,
        -0.05389264598488808,
        0.08005321025848389,
        -0.01948501542210579,
        0.032959241420030594,
        0.08314972370862961,
        0.039795126765966415,
        -0.013307621702551842,
        0.02578688971698284,
        0.016596728935837746,
        -0.022346479818224907,
        -0.04468239098787308,
        -0.016432877629995346,
        0.048074979335069656,
        0.008690022863447666,
        -0.032612282782793045,
        -9.779249010493578e-33,
        -0.04554225876927376,
        -0.008327256888151169,
        -0.045320846140384674,
        0.11622338742017746,
        0.058264683932065964,
        -0.013214333914220333,
        0.059978410601615906,
        0.02012750133872032,
        -0.011208140291273594,
        0.04318135231733322,
        0.016433458775281906,
        0.06014276295900345,
        0.018555114045739174,
        0.04006967693567276,
        0.015044022351503372,
        -0.049271635711193085,
        -0.03050454519689083,
        -0.06455790996551514,
        0.09933309257030487,
        -0.03151877224445343,
        0.059661559760570526,
        0.05300261080265045,
        -0.008073708973824978,
        0.032845355570316315,
        0.05234786868095398,
        -0.008875551633536816,
        -0.03167005628347397,
        -0.004701322875916958,
        -0.0011942675337195396,
        0.04849383234977722,
        0.007617441937327385,
        0.009456932544708252,
        0.03164917230606079,
        0.004878687206655741,
        0.0712328553199768,
        -0.04983780160546303,
        0.07914765179157257,
        0.011940928176045418,
        -0.015768105164170265,
        0.0009291269816458225,
        0.02967783808708191,
        0.05540066584944725,
        0.0068807657808065414,
        0.030415212735533714,
        0.033728331327438354,
        -0.011469660326838493,
        -0.007268545217812061,
        -0.06119004264473915,
        0.07685243338346481,
        -0.016684694215655327,
        0.020714256912469864,
        -0.02134353294968605,
        0.04207582026720047,
        0.0016699559055268764,
        -0.05353998392820358,
        -0.110111303627491,
        -0.03718099370598793,
        0.01991148665547371,
        0.006761442869901657,
        -0.043441981077194214,
        0.0048107970505952835,
        -0.02264564111828804,
        0.03543182462453842,
        -0.0012012544320896268,
        0.09193294495344162,
        -0.05088026076555252,
        0.04311508685350418,
        0.04459526762366295,
        -0.05468042567372322,
        -0.03956422954797745,
        -0.11474815756082535,
        -0.05795871466398239,
        -0.019339660182595253,
        -0.0637471005320549,
        -0.06327491998672485,
        0.0746646597981453,
        0.029405763372778893,
        -0.02920115366578102,
        0.08407429605722427,
        0.0096456753090024,
        -0.08453666418790817,
        0.02288505993783474,
        0.025333134457468987,
        -0.05413758382201195,
        0.011046583764255047,
        -0.08091481775045395,
        0.03293028846383095,
        0.016307184472680092,
        -0.03800564631819725,
        -0.050797875970602036,
        -0.039821285754442215,
        -0.003018854418769479,
        0.032995522022247314,
        0.03457581624388695,
        -0.022097382694482803,
        -6.019790532718616e-08,
        0.05874671787023544,
        0.027339588850736618,
        0.017941325902938843,
        0.07676156610250473,
        0.036173876374959946,
        -0.07988456636667252,
        -0.012274487875401974,
        -0.0002615758858155459,
        0.10164646059274673,
        -0.030449090525507927,
        0.04271498695015907,
        -0.09981568902730942,
        0.0030130690429359674,
        -0.025280941277742386,
        0.03770100697875023,
        0.013708953745663166,
        -0.09814175218343735,
        0.0513930507004261,
        -0.023220954462885857,
        -0.06808647513389587,
        0.04281643405556679,
        0.04435655102133751,
        0.06095162779092789,
        -0.059789255261421204,
        -0.013174034655094147,
        -0.00012182293721707538,
        0.02554876171052456,
        0.015945641323924065,
        0.05831863358616829,
        0.01634777896106243,
        -0.07264076173305511,
        -9.787527233129367e-05,
        0.05087457597255707,
        -0.15415993332862854,
        0.06226218864321709,
        -0.03733156621456146,
        0.004039625637233257,
        0.09779042750597,
        0.11648274213075638,
        0.05380091816186905,
        -0.05709926784038544,
        -0.08905930817127228,
        0.0008521998533979058,
        -0.03086310252547264,
        -0.005502153653651476,
        -0.031338371336460114,
        -0.09478836506605148,
        -0.1208498477935791,
        0.014819717966020107,
        0.04867757484316826,
        -0.061817001551389694,
        0.025313468649983406,
        -0.0357544869184494,
        0.016505423933267593,
        0.07372873276472092,
        0.04334656894207001,
        -0.045062288641929626,
        0.05641312152147293,
        0.01063766609877348,
        0.01284502912312746,
        0.026003696024417877,
        -0.10908728092908859,
        -0.08704733848571777,
        0.05836671218276024
    ]
}