{
    "id": "qNAlQ786cmM",
    "title": "A Rugged SAPPHIRE Covered Smartphone? - Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-11-29T14:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=qNAlQ786cmM",
    "category": "Howto & Style",
    "tags": [
        "Kyocera Duraforce pro 2",
        "Kyocera",
        "sapphire",
        "sapphire screen",
        "sapphire glass",
        "sapphire crystal",
        "iphone",
        "apple",
        "ipad",
        "new iphone",
        "Duraforce Pro 2",
        "smartphone",
        "best android",
        "best smartphone",
        "durability test",
        "Best rugged phone",
        "most durable phone"
    ],
    "views": 3637571,
    "likes": 94543,
    "comments_count": 6723,
    "description": "We don't take sapphire claims lightly around these parts. When Kyocera announced their DuraForce Pro 2, with a full sapphire covered display and back camera. I knew i had to get my hands on one. Is Kyocera using real sapphire crystal to protect the display? or did they use the same Apple Junk Sapphire that's found on the iPhones and iPads? The only way to find out is with a durability test.  We'll start by taking the Kyocera Duraforce Pro 2 and put it through a scratch, burn, and bend test.   Do you think all phones should start using Sapphire? Let me know in the comments.   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Kyocera, a name I haven't heard of in a while, has released a new phone. An extremely rugged smartphone called the Dura Force Pro 2. Kyocera claims this phone has a full sapphire display, but there's only one way to find out for sure. At only $450, this should be interesting. On the back of the phone it says 'Class 1 Division 2' which means this phone can be used in hazardous locations without causing explosions. Gotta love that. Let's get started. [Intro] Right out of the box the phone feels smooth, plastic, almost fluffy compared to the dense glass and metal phones we're used to seeing. It definitely still has that rugged, durable look to it. Let's get started with the scratch test. A phone with real sapphire on the display doesn't come around very often. As we know, these Mohs hardness picks tell the difference between different materials. Plastic would leave marks at a level 3. Normal glass would scratch at a 6. And sapphire should only start to scratch at level 8. Sapphire has a totally different composition than glass. It's a crystal structure that's actually grown in a lab, and it's hardness level is up there with precious gems and diamonds. An incredibly impressive, expensive and premium material. Taking a look at the level 6 and 7 pick locations where glass normally starts to scratch, we see no marks. The screen of this Dura Force Pro 2 is still flawless. Let's take it up to a level 8. Finally, at a level 8 we start to see some damage. This is exactly where we would expect sapphire to be. It's what we saw on the HTC U Ultra Sapphire edition, as well as the sapphire covered Tissot watches that I've used to explain sapphire in the past. Kyocera says the camera lens on the back of the phone is sapphire as well. We'll be verifying that in just a second. A level 9 pick, of course, also leaves marks on the crystal, as would diamonds at a level 10, but I'm kind of fresh out of those at the moment. The earpiece up at the top is covered in plastic and can be scratched. The whole phone is designed to handle abuse though and keep working. So superficial damage is kind of irrelevant. There is a 5 megapixel selfie camera under that same sapphire display, so it's definitely protected from scratches. The thick knobby corners of this phone are made from a softer, slightly grippy plastic. Under the large flap on the side we have our SIM and SD expandable memory slot, and a dedicated camera button below that. This can be programmed to be a Google assistant or another app instead. It's super nice of Kyocera to let us choose how to use our own buttons. Phenomenal idea. I hope Samsung is watching. The bottom of the phone has a huge, watertight ip68 plastic flap covering the USB-C charging port. We have even more plastic along the sides, with another large programmable button on the left side. This button is supposed to be 'push-to-talk', a radio style button, but can also be remapped to literally anything else. I'm a fan. The volume rocker is also made from plastic. And look what we have up here. A headphone jack instant thumbs up. It's protected with the same watertight flaps that cover the SD card and charging port. This durable smartphone's turning out to be a winner. The power button doubles as a fingerprint scanner. I'll scratch that up to simulate a guy on YouTube who scratches stuff. But while adding my fingerprint I would get constant 'fingerprint is dirty' messages. Even when it finally did accept my fingerprint, the dirty little fingerprint scanner was not efficient at recognizing my finger, nor would it unlock the screen every time. There are always other ways to unlock your phone of course, but the weaker fingerprint scanner is just something to keep in mind. The back of the Kyocera Dura Force Pro 2 has 4 smooth hard rubber pads on each of the corners. Definitely an added perk for drop protection. Now back to the sapphire. It's a pretty incredible substance. The optically clear stuff used in technology and like on phone screens and camera lenses is lab grown, fabricated in a lab over weeks into a large clear cylinder called a boule. This massive chunk of sapphire is then bored out and cut up to make watch faces, or smaller bores to make camera lenses. Or sawed into rectangular chunks and polished to make smartphone displays like the one here on the Kyocera. It's a fascinating process that I'd love to show off in real life if anyone over there at Kyocera is watching. The back panel covering the wireless charging pad is plastic. Not all sapphire is created equal. One company, who shall remain nameless, uses an impure version of sapphire...Just kidding, it's Apple. Apple is using junk sapphire on their camera lenses. You can see here with the piece of sapphire that's covering the normal 13 megapixel camera, and the 8 megapixel wide angle lens (great combo by the way), it does not scratch with a level 6 or 7 Mohs pick. It's only when we reach levels 8 and 9 that the surface of the lens starts to get damaged. This is the good quality sapphire. Apple, on the other hand, has sub-par sapphire lenses on every single one of their iPhones. Those get scratched starting at levels 6 and 7, just like glass would. There's a definite difference in quality. I'm impressed with Kyocera. Their product is behaving as advertised. Imagine that. Like any rugged smartphone, this guy is supposed to work in extreme heat, which might just give us another reason for this burn test. I've been struggling for years trying to justify this one...I mostly just like fire. The 1080p IPS LCD underneath the 5 inch slab of sapphire on the Kyocera Dura Force Pro 2 lasted 30 seconds under the heat from my direct flame. Watch how fast I recovers though. It's ready for round 2 with zero damage done to the display underneath. Impressive. Now for the bend test. A rugged smartphone with no structure would be rather dumb. Independent third party testing though is really the only way to tell. This rock solid Dura Force Pro 2 has zero flex and passes my durability test. Kyocera has managed to make a durable, rugged phone out of premium materials, and I'm very impressed. It might even very well be the most durable phone of this year. Apple should be reaching out to Kyocera to find a quality sapphire supplier. Should we be putting sapphire on all cell phone screens? If you enjoyed this video and want to see other phones tested in the future, hit that subscribe button. And come hang out with me over on Twitter and Instagram. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Dura Force Pro",
        "sapphire",
        "Kyocera Dura Force",
        "Dura Force",
        "Force Pro",
        "phone",
        "Kyocera",
        "level",
        "Kyocera Dura",
        "plastic",
        "Force",
        "Dura",
        "Pro",
        "camera",
        "scratch",
        "button",
        "fingerprint",
        "glass",
        "back",
        "smartphone"
    ],
    "transcript_entity_values": [
        "Google",
        "8 megapixel",
        "9",
        "Tissot",
        "6",
        "8",
        "ip68",
        "SD",
        "Instagram",
        "IPS LCD",
        "jack",
        "Mohs",
        "6",
        "the Kyocera Dura Force Pro 2",
        "years",
        "only one",
        "4",
        "Kyocera",
        "zero",
        "10",
        "this year",
        "5 megapixel",
        "Apple",
        "iPhones",
        "Kyocera",
        "over weeks",
        "5 inch",
        "second",
        "30 seconds",
        "Sapphire",
        "13 megapixel",
        "Samsung",
        "Dura Force Pro 2",
        "third",
        "3",
        "One",
        "YouTube",
        "only $450",
        "Mohs",
        "7",
        "2",
        "Twitter",
        "1080p"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.1818486601114273,
        0.008378969505429268,
        0.06143644452095032,
        -0.035611119121313095,
        -0.05190495401620865,
        -0.07924263179302216,
        0.006878524087369442,
        0.02413446269929409,
        -0.07785578072071075,
        -0.011727528646588326,
        0.05562058091163635,
        -0.011369016952812672,
        -0.029414141550660133,
        0.09744538366794586,
        -0.03508705273270607,
        0.025822551921010017,
        0.08085929602384567,
        -0.02609114721417427,
        0.004620075691491365,
        0.11505941301584244,
        0.05481840297579765,
        -0.04752368852496147,
        0.025732435286045074,
        -0.0028560913633555174,
        0.019253278151154518,
        0.06130770221352577,
        0.01783016137778759,
        0.0008449089946225286,
        -0.002637082478031516,
        -0.03334931284189224,
        -0.025278842076659203,
        0.018549548462033272,
        -0.048749662935733795,
        0.09324915707111359,
        -0.01804310828447342,
        -0.06980381160974503,
        -0.008540533483028412,
        -0.00017925494466908276,
        -0.09416677057743073,
        -0.03963731601834297,
        -0.04625128209590912,
        0.0033733490854501724,
        -0.02985001541674137,
        0.04930161312222481,
        0.04694853350520134,
        -0.01748538948595524,
        0.10229741036891937,
        -0.04171977564692497,
        -0.025771288201212883,
        -0.04117737337946892,
        0.020483016967773438,
        -0.01654982939362526,
        0.03930016607046127,
        -0.04325362294912338,
        0.01347627118229866,
        0.002436910755932331,
        -0.03748191520571709,
        -0.0676649734377861,
        0.0945524126291275,
        0.02520165778696537,
        0.04527383670210838,
        0.03890005126595497,
        -0.02166276052594185,
        0.08006536960601807,
        0.008099193684756756,
        0.00040396282565779984,
        -0.012590683065354824,
        -0.046199455857276917,
        0.03757045790553093,
        -0.02737249806523323,
        0.04542382434010506,
        -0.01597369834780693,
        0.0038576938677579165,
        -0.036586783826351166,
        0.005996734369546175,
        0.0964193046092987,
        0.03264854475855827,
        -0.03319240361452103,
        -0.12045986950397491,
        -0.03992648795247078,
        0.023006249219179153,
        -0.03340619429945946,
        0.017188286408782005,
        0.060596853494644165,
        0.0696580559015274,
        -0.012298240326344967,
        0.023152383044362068,
        0.1131531372666359,
        -0.03778812289237976,
        -0.0883452519774437,
        0.0683254674077034,
        0.12312383204698563,
        -0.1218874529004097,
        0.05057552084326744,
        -0.027871383354067802,
        -0.01196589507162571,
        0.008596766740083694,
        -0.038334548473358154,
        -0.09661865234375,
        0.020247848704457283,
        0.027793003246188164,
        0.018989229574799538,
        0.031009379774332047,
        0.009455219842493534,
        -0.03861682116985321,
        -0.05133795738220215,
        -0.037139035761356354,
        -0.005696868523955345,
        -0.02107747457921505,
        0.08170311152935028,
        0.06705625355243683,
        0.0047549051232635975,
        -0.05518154427409172,
        0.058750398457050323,
        -0.009982987307012081,
        0.016210807487368584,
        -0.0653204545378685,
        0.0982360690832138,
        0.1255384087562561,
        0.028117574751377106,
        -0.04265545681118965,
        0.04201893135905266,
        -0.020389843732118607,
        0.02829902619123459,
        0.01751480996608734,
        0.021921440958976746,
        -0.08401388674974442,
        1.770942116257271e-33,
        0.00380540918558836,
        0.11946777999401093,
        -0.06222515180706978,
        0.001019421499222517,
        -0.09192414581775665,
        -0.07128545641899109,
        0.004254629835486412,
        0.0303232129663229,
        0.0049253650940954685,
        -0.024064432829618454,
        0.03919743001461029,
        0.06458327919244766,
        -0.049138765782117844,
        0.017955726012587547,
        0.04361901432275772,
        0.010406093671917915,
        -0.03825901076197624,
        -0.06760793924331665,
        -0.044481150805950165,
        0.05258288234472275,
        -0.025649435818195343,
        -0.060173820704221725,
        0.005213816650211811,
        0.040652189403772354,
        -0.057323355227708817,
        0.05601556599140167,
        0.06835330277681351,
        0.023892842233181,
        0.043904148042201996,
        0.04603675380349159,
        -0.008654036559164524,
        -0.031008074060082436,
        0.007163370959460735,
        -0.018620990216732025,
        -0.0371490977704525,
        0.07227351516485214,
        -0.0451417975127697,
        -0.0444907508790493,
        -0.043240536004304886,
        0.04386214539408684,
        -0.08513068407773972,
        0.011796600185334682,
        -0.01129742618650198,
        -0.00937843881547451,
        0.06253274530172348,
        -0.0573832169175148,
        -0.031124740839004517,
        0.040408555418252945,
        -0.05132441222667694,
        -0.022408204153180122,
        -0.07848843932151794,
        -0.08434776216745377,
        -0.017375489696860313,
        -0.027683701366186142,
        -0.08663861453533173,
        0.001940746558830142,
        -0.00513736717402935,
        -0.056353043764829636,
        0.09981442987918854,
        0.0001312351960223168,
        -0.0013503939844667912,
        -0.03383880853652954,
        -0.06996582448482513,
        0.0918809100985527,
        -0.09679050743579865,
        0.012659070082008839,
        -0.012241316959261894,
        -0.0014183513121679425,
        -0.1436845362186432,
        0.033451419323682785,
        -0.021999357268214226,
        0.024069003760814667,
        -0.008105146698653698,
        -0.01845867931842804,
        0.0012699224753305316,
        -0.06265231966972351,
        0.038597602397203445,
        0.01860412210226059,
        -0.01779133453965187,
        0.04032374173402786,
        -0.061868056654930115,
        0.020399633795022964,
        0.08782055228948593,
        -0.03984295204281807,
        -0.06221459060907364,
        -0.008508882485330105,
        0.019461287185549736,
        -0.044043950736522675,
        0.009496409446001053,
        0.03441941365599632,
        -0.022575493901968002,
        -0.06679870188236237,
        -0.024118157103657722,
        -0.051911525428295135,
        0.01894042082130909,
        -2.6792884781239007e-33,
        0.015334942378103733,
        -0.04790223389863968,
        0.08292921632528305,
        0.009697046130895615,
        0.022963855415582657,
        -0.034968484193086624,
        0.021424036473035812,
        0.07432155311107635,
        0.04554200917482376,
        -0.05884428322315216,
        0.03419340401887894,
        0.05528557673096657,
        0.01755754090845585,
        -0.03852825611829758,
        0.01300355326384306,
        -0.034057993441820145,
        -0.008574921637773514,
        -0.08610234409570694,
        -0.0137717854231596,
        0.01151125319302082,
        0.06662365049123764,
        0.07075679302215576,
        0.013520335778594017,
        0.04391396418213844,
        -0.007022316101938486,
        -0.007185399532318115,
        -0.0032367086969316006,
        -0.047253165394067764,
        0.023074986413121223,
        -0.017065608873963356,
        0.07113451510667801,
        -0.03386654332280159,
        -0.0037130815908312798,
        0.05680878460407257,
        -0.018383417278528214,
        0.05661330744624138,
        0.06580358743667603,
        -0.005507395602762699,
        -0.0009442757000215352,
        0.021969763562083244,
        0.051402732729911804,
        0.0812351331114769,
        -0.031639982014894485,
        -0.014725524932146072,
        0.004500098992139101,
        0.02576390653848648,
        0.055382825434207916,
        0.025407807901501656,
        0.053264692425727844,
        -0.0009191572898998857,
        0.05090148746967316,
        0.04447126016020775,
        -0.08052156865596771,
        0.01239535678178072,
        -0.020240290090441704,
        -0.02997657097876072,
        0.026213649660348892,
        -0.02763230912387371,
        -0.0674576461315155,
        -0.01030373852699995,
        0.08347944915294647,
        0.006903633009642363,
        0.0002479781396687031,
        -0.10714520514011383,
        -0.08687108755111694,
        0.0022182122338563204,
        0.06835799664258957,
        0.07642596960067749,
        0.015183699317276478,
        0.0534878745675087,
        -0.04612066224217415,
        0.005624176003038883,
        -0.03394163027405739,
        -0.07993564754724503,
        0.03752504289150238,
        0.0356481671333313,
        -0.06577274203300476,
        -0.018487513065338135,
        0.00430356664583087,
        -0.07544887065887451,
        0.07780510932207108,
        0.029849601909518242,
        0.01474781148135662,
        0.006509425584226847,
        0.14456412196159363,
        -0.00696512870490551,
        0.0027557353023439646,
        0.04239606484770775,
        -0.050508905202150345,
        -0.012791771441698074,
        -0.011133343912661076,
        -0.016280265524983406,
        -0.022111954167485237,
        0.006097538396716118,
        -0.023611150681972504,
        -4.593383096107573e-08,
        0.077049121260643,
        0.0851418748497963,
        -0.01909109577536583,
        -0.02675851806998253,
        -0.08515756577253342,
        -0.06038828566670418,
        0.06617081165313721,
        -0.03299318999052048,
        0.07001721858978271,
        -0.07750339806079865,
        -0.010150987654924393,
        -0.08349207043647766,
        -0.05717455968260765,
        0.049389395862817764,
        -0.019270319491624832,
        0.07302574068307877,
        -0.01258478220552206,
        0.03708150237798691,
        -0.002527558011934161,
        0.014076094143092632,
        0.00580142205581069,
        -0.0039857663214206696,
        0.05229592323303223,
        -0.04042521491646767,
        -0.051109641790390015,
        0.08512299507856369,
        -0.0807437002658844,
        -0.0770149677991867,
        0.0230548232793808,
        -0.034986115992069244,
        -0.0011997869005426764,
        -0.04374142736196518,
        0.043787211179733276,
        0.011544758453965187,
        0.03154734522104263,
        -0.012004929594695568,
        -0.014330053701996803,
        0.01845209300518036,
        0.08730584383010864,
        0.05757681652903557,
        0.013106402941048145,
        -0.08507402241230011,
        -0.000773668522015214,
        0.03426232188940048,
        0.001429083407856524,
        -0.046178411692380905,
        0.023488402366638184,
        -0.12547487020492554,
        -0.05580809339880943,
        0.059198588132858276,
        0.016411038115620613,
        -0.045185282826423645,
        -0.0052689239382743835,
        -0.04785718396306038,
        0.008160024881362915,
        0.019044984132051468,
        0.09430020302534103,
        -0.04937407374382019,
        -0.06195497885346413,
        -0.022081395611166954,
        0.10399337857961655,
        -0.11701096594333649,
        -0.005503625143319368,
        0.09356433898210526
    ]
}