{
    "id": "Qqp1ClBm-_I",
    "title": "Clicks Keyboard for iPhone - EXPOSED",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-08-31T16:13:24Z",
    "video_url": "https://www.youtube.com/watch?v=Qqp1ClBm-_I",
    "category": "Howto & Style",
    "tags": [
        "keyboard for iphone",
        "iphone",
        "new iphone",
        "iphone 16",
        "iphone vs lightsaber",
        "starwars",
        "lightsaber",
        "hacksmith",
        "mr. mobile",
        "chrisfix",
        "iphone 15",
        "iphone teardown"
    ],
    "views": 1224962,
    "likes": 47304,
    "comments_count": 1580,
    "description": "Today we teardown the Clicks Keyboard for iPhone! Get started building credit today at  Chime. Feels like Progress. I've been looking forward to taking apart my friends products for awhile now. Releasing a keyboard case for the iPhone is a brave venture but I think Mr. Mobile is onto something here.   Get the Chrisfix Wrench set here:  Get The Hacksmith Lightsaber here:  Linus Screwdriver here:  and the Clicks Creator Keyboard here:",
    "description_links": [
        "https://www.chime.com/JERRYRIG.",
        "https://amzn.to/3yXgUKj",
        "https://www.hacksmith.store/en-us/collections/mini-sabers",
        "https://amzn.to/3X9q52d",
        "https://www.clicks.tech/"
    ],
    "transcript": "So, I've been secretly amassing a collection of YouTuber merch for a while now, and I think today's the day we tear them down and expose the internals. We have an actual lightsaber from the Hacksmith. We have a vanadium plated extendable 72 tooth ratchet set from Chrisfix. And of course we have the Clicks Creator Keyboard from the Mr. Mobile himself. All sponsored of course with Chime secured credit building credit card but more on them later. First let's take Linus' screwdriver and open up Chrisfix's ratchets. When someone says the phrase, YouTuber merch, premium Automotive ANSI grade tools aren't what first pop in my mind, but here we are. Three different sized extendable ratchets, cuz who hasn't wished their tool is a little longer. That foam insert doubles as a long-term tool storage box organizer by the way. So, don't throw it out. The little quarter inch drive has two extensions. The 3/8 has three extensions, and the inch drive has five notches for ratcheting in tight quarters or expanding all the way out to breaker bar status. But how does it work? The whole point of the clicky bits inside of a ratchet is so that you don't have to lift the socket off the bolt and waste time repositioning things while working in cramped spaces under a vehicle. The more teeth, or the more clicks it has inside, means it takes less movement of the handle to make progress rotating a bolt. Going to be honest this is my first time taking one of these apart, but I have always been curious. Turns out it's surprisingly simple with two long screws on the back removed and one short screw on the front. The whole head separates from the vanadium steel body. I'm not going to individually count the teeth. Chrisfix says theres 72 and I'm just going to trust him on this one. And inside the only remaining components are the left and right prawls two springs and the selector switch. The prawls have a bunch of little teeth of their own that intersect with the round gear that we took out earlier. Allowing continuous motion in one direction. While preventing motion in the opposite direction when the prawls teeth engage with the gears teeth. The prawls are conveniently l labeled, of course, left and right for our tear down convenience. With the center selector back in place and both spring-loaded prawls tucked into their grooves. You can see the teeth engage and ratchet depending on where that selector is positioned. Adding vanadium to a stainless steel alloy can increase the material strength by 10 or 20%. But it also increases its weight by about that same percentage, 10 to 20%. But I've never heard a mechanic complain about how heavy a ratchet is. So, in this case weight's probably not an issue. I imagine we would find a similar ratcheting mechanism inside of Linus' screwdriver, but we can't take that apart just yet. Since we still need its help disassembling the Hacksmith lightsaber. Which is an elegant weapon from a more civilized age. Obviously, this one might have some limitations due to our current understanding of physics, but I can't actually even test this out right now because the Hacksmith doesn't include fuel, which is smart. A normal Jedi saber is powered with kyber crystals. But I don't have any stores local to me that sell that kind of thing. So, we're going to have to settle for some butane. And my friends at Chime are temporarily spotting me the funds for this purchase. Since that's how credit cards work. Chime is an award-winning banking app with no hidden fees or monthly minimums. It's the banking of the future that's 100% mobile and 100% online. Personally, I use my credit card to make everyday purchases and just pay that card off in full at the end of every month. There's no annual fees or interest, and as I buy cool stuff I also build my credit. Multitasking. The better my credit the better my opportunity for lower rates when I go to get a loan for a house or a car. With Chime secure credit card you can be improving your own credit score this summer at Chime.com/Jerryrig. Buy the stuff you would normally buy anyway like, groceries, gas, concerts, or weapons from other galaxies. And uh, build your credit in the process. Chime.com/Jerryrig. How do you know when it's full? Oh! Can you see that? That is sweet! I'm not going to touch it. That's a that's a terrible idea. Where was I? Ah yes, lightsabers. This is the green Gen 2 mini saber from the Hacksmith. It's got a safety lock switch a rotating flame adjuster. Sorry saber. Saber length adjuster and a clicky igniter. Which you'll see in a second. and when it comes to burning things let's just say it works. The iPhone 15 lasted for less than 1 second under the heat from my 2,600 degree butane lightsaber. Let's watch that again in slow motion just for fun. Absolutely wild! I can see why someone would need to be trained in the force before wielding one of these. That's not good. It's interesting to me as well, that the Hacksmith has found a way to change the colors of the saber in real time. Canonically, lightsabers can be all kinds of colors and with this color changing insert the mini saber flame also changes color. I imagine this is done with different elements, like barium. Which in fireworks is what glows green when they explode. In Star Wars lore you only get a red saber when you bleed your kyber Crystal. Infusing it with rage and hate and all that stuff. Corrupting it red is bad. Also as a side note be careful when filling up the saber with butane, cuz there might be excess around the lighter that explodes and burns all your arm hairs when you ignite it. Not that I would know from personal experience or anything. Wow holy smokes! The red saber insert, probably made with strontium, requires much less rage to bleed out. And I'm sure Vader would approve. Popping the lightsaber open from the bottom we have two Phillips head screws. Which when removed and my melted arm hair is brushed off we see the internal tank of butane. It's unfortunate that the igniter has to be clicked in for the shaft's removal. Meaning that the flame is literally flaming while I'm taking it apart. The handle is made from aluminum while the upper is manufactured with cast zinc. There are a few more screws holding the tank to the igniter but with enough yoinkage I can pull the hardware from the tip. And as you can see the igniter wire snakes all the way up to the tip of the mini saber to light the gas on fire as it exits the handle. Since I'm holding the tip of the bare wire while clicking the igniter I can feel each zap from the ignition through my fingers. And you can visually see the electricity leave the wire when it gets close to the metal. Probably not the safest activity I've done all day, but at least we know how the mini lightsaber works. Finally coming back to our own universe, and not a galaxy far far away, we have our Clicks keyboard for iPhone made by Mr. Mobile. This is the Bumblebee colored version. Now apparently you can plug a full-size USBC keyboard directly into an iPhone then it works as a keyboard. None of my iPhones have ever lasted long enough to try it, but basically this Clicks keyboard for iPhone just miniaturizes a regular keyboard to the size of a Blackberry and embeds it in a flexible rubber case. Cuz why not. The biggest difference I immediately see, once the iPhone is clicked into the Clicks case, is that the on screen keyboard now disappears. Making the screen appear even longer. And as we know every inch matters when you're writing long messages or emails. Reviews on the website say it takes a few days to get used to. Which I can relate to as someone whose first phone was a Nokia 6800 with a full keyboard and then a BlackBerry Pearl after that. I definitely see the appeal to having physical buttons. Popping open the London sky colored Clicks keyboard we see a $36 store credit coupon. Which I can almost assure you that someone has probably already use by the time you're watching this, but it could be worth a shot. Going straight from the externals to the internals I can pop off the back plastic cover. And we immediately see four Phillips head screws one of which has a tamper evidence sticker on th back. Keep in mind that here in the USA at least these kind of stickers are just decoration and have no legal teeth. With the plastic removed we find two T-shaped metal weights embedded into the plastic. These are most likely for comfort. With the weight of the full iPhone sitting in the top half of the case there has to be something to bring balance to the contraption. Adding weights to the back is a smart design in my own opinion. There's a circular water damage indicator sticker next to the lower charging port. And two Phillips head screws near the upper charging port. Which when removed releases the whole brains of the operation. The motherboard into our hands. The motherboard has no battery or power source of its own just passively connects to the iPhone, and transmits each of its little button clicks up into the device. Pretty cool looking! The keyboard buttons themselves remind me of a Nintendo or video game controller. Kind of like a nerdy blanket for ants. All the buttons held together with a rubber strip. I don't think the Clicks keyboard is for everyone but for the right person. Just like a lightsaber picking its owner, or was that a Harry Potter wand? Either way, the right person will definitely enjoy having a keyboard on their iPhone. It's super cool to see my friends here on YouTube branch out beyond just creating videos and release actual products into the real world. It's a lot of work. A lot of risk, but ever so rewarding when it succeeds. The Clicks keyboard lives on to write more messages. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "Clicks keyboard",
        "Keyboard",
        "Clicks",
        "Clicks Creator Keyboard",
        "credit",
        "saber",
        "iPhone",
        "secretly amassing",
        "amassing a collection",
        "teeth",
        "Hacksmith",
        "Phillips head screws",
        "credit card",
        "lightsaber",
        "mini saber",
        "back",
        "colored Clicks keyboard",
        "Clicks Creator",
        "ratchet",
        "prawls"
    ],
    "transcript_entity_values": [
        "this summer",
        "Mobile",
        "Hacksmith",
        "USBC",
        "iPhone",
        "72",
        "Vader",
        "Chrisfix",
        "the end of every month",
        "15",
        "2,600 degree",
        "YouTuber",
        "four",
        "100%",
        "two",
        "a few days",
        "all day",
        "Hacksmith",
        "three",
        "Blackberry",
        "Harry Potter",
        "Automotive ANSI",
        "YouTuber",
        "Jedi",
        "72",
        "Crystal",
        "Three",
        "half",
        "36",
        "monthly",
        "Phillips",
        "Linus",
        "USA",
        "five",
        "iPhones",
        "first",
        "second",
        "London",
        "Nintendo",
        "First",
        "today",
        "annual",
        "3/8",
        "Bumblebee",
        "YouTube",
        "10 to 20%",
        "10 or 20%",
        "less than 1 second",
        "one",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.1559964269399643,
        -0.040192149579524994,
        0.04847804084420204,
        -0.09216280281543732,
        -0.058646880090236664,
        0.036122191697359085,
        0.08232449740171432,
        -0.02131807990372181,
        0.017793115228414536,
        0.024190520867705345,
        0.10143139213323593,
        0.049242809414863586,
        0.0764184296131134,
        -0.016243835911154747,
        -0.04789417237043381,
        0.00722786458209157,
        -0.017722884193062782,
        -0.044191814959049225,
        -0.030969392508268356,
        0.07957933098077774,
        0.01931316778063774,
        -0.0375964492559433,
        0.07216284424066544,
        -0.037733618170022964,
        -0.027618858963251114,
        0.020838957279920578,
        -0.06241960451006889,
        -0.010652327910065651,
        -0.02230987325310707,
        -0.03595365956425667,
        -0.012047329917550087,
        0.03304540365934372,
        -0.026317929849028587,
        -0.016524309292435646,
        -0.041557975113391876,
        -0.06754375249147415,
        -0.0024416788946837187,
        0.05247236788272858,
        -0.033249929547309875,
        -0.07653596997261047,
        -0.048817191272974014,
        -0.04808324575424194,
        0.05635155737400055,
        0.042713165283203125,
        -0.025919577106833458,
        0.037536803632974625,
        0.019012974575161934,
        0.0038829478435218334,
        0.028499821200966835,
        0.01467165071517229,
        -0.022280486300587654,
        -0.020735057070851326,
        0.08531774580478668,
        -0.06750547140836716,
        -0.08789893239736557,
        0.07385442405939102,
        0.04666634649038315,
        -0.04009733721613884,
        0.12876397371292114,
        0.017214646562933922,
        0.06107746437191963,
        0.015847859904170036,
        -0.0355721078813076,
        0.06024211272597313,
        -4.333351171226241e-05,
        0.010699660517275333,
        -0.018993260338902473,
        -0.0929739847779274,
        -0.04124370217323303,
        0.02154874987900257,
        0.027969785034656525,
        -0.11100687086582184,
        0.0017069269670173526,
        0.02724752016365528,
        0.001187957706861198,
        0.007281803991645575,
        -0.04565818980336189,
        -0.007410569116473198,
        -0.08520462363958359,
        -0.011652921326458454,
        0.0171231497079134,
        -0.00844770111143589,
        0.074216827750206,
        0.02023904211819172,
        0.07273928821086884,
        0.10643532872200012,
        0.03706267103552818,
        0.013563386164605618,
        0.011204984039068222,
        -0.019647955894470215,
        -0.05322757735848427,
        -0.026200128719210625,
        0.023593634366989136,
        -0.013833051547408104,
        0.058877699077129364,
        -0.055808793753385544,
        0.02515191212296486,
        0.046389613300561905,
        -0.05249692499637604,
        0.03468076512217522,
        0.056016888469457626,
        -0.011114510707557201,
        -0.008870200254023075,
        -0.1295301765203476,
        0.0639508068561554,
        0.013251792639493942,
        -0.06141071021556854,
        -0.05662020668387413,
        -0.008660315535962582,
        -0.015094729140400887,
        0.03738842532038689,
        0.042737361043691635,
        -0.03414994478225708,
        -0.011188389733433723,
        -0.012300153262913227,
        0.008417323231697083,
        -0.025193439796566963,
        0.04559753090143204,
        0.1610046923160553,
        -0.02643008716404438,
        0.05484899505972862,
        0.012918567284941673,
        -0.12579622864723206,
        -0.03803383931517601,
        -0.008080280385911465,
        -0.0038844633381813765,
        -0.07074829936027527,
        5.917626273793542e-33,
        -0.022674009203910828,
        0.11706145107746124,
        -0.08091258257627487,
        -0.0749652236700058,
        0.01960092969238758,
        -0.016552085056900978,
        0.028974179178476334,
        0.04349847510457039,
        -0.01669430173933506,
        0.013031051494181156,
        0.029977085068821907,
        -0.006252304185181856,
        -0.05620589107275009,
        -0.01106257364153862,
        0.038654983043670654,
        -0.022208569571375847,
        -0.034578170627355576,
        -0.010666796006262302,
        -0.02445116639137268,
        -0.08268015831708908,
        0.012235783971846104,
        0.021434247493743896,
        0.017421085387468338,
        0.02551305666565895,
        0.0470084585249424,
        0.053218040615320206,
        0.05886515602469444,
        0.01150270365178585,
        0.061637140810489655,
        0.020041098818182945,
        -0.08045455813407898,
        -0.006418928969651461,
        -0.01856616884469986,
        -0.04555665701627731,
        -0.0649150013923645,
        0.007353901397436857,
        0.018629243597388268,
        -0.11789999157190323,
        -0.003249863861128688,
        -0.03419356793165207,
        -0.033881284296512604,
        -0.009515092708170414,
        -0.08502300083637238,
        -0.06644190847873688,
        -0.07251760363578796,
        0.05558113381266594,
        0.009181911125779152,
        0.07643785327672958,
        0.01791619509458542,
        -0.07588238269090652,
        -0.040168456733226776,
        -0.05388651415705681,
        0.024650925770401955,
        -0.032979752868413925,
        -0.07739055156707764,
        -0.026034381240606308,
        -0.011397277936339378,
        -0.07081124931573868,
        0.09598223865032196,
        0.03840872645378113,
        -0.006738425698131323,
        0.033769842237234116,
        0.10602079331874847,
        0.07334114611148834,
        -0.03836324065923691,
        0.036873143166303635,
        0.01381341740489006,
        -0.06419648230075836,
        0.0271193478256464,
        0.010592068545520306,
        -0.022494690492749214,
        -0.02361525222659111,
        -0.01157145295292139,
        -0.028794344514608383,
        -0.0012726751156151295,
        -0.011232195422053337,
        -0.020053798332810402,
        -0.03298255056142807,
        0.06494658440351486,
        -0.011623545549809933,
        0.0017439544899389148,
        0.034266576170921326,
        0.02054431475698948,
        0.029378140345215797,
        0.06740635633468628,
        -0.08659610897302628,
        -0.00965090747922659,
        -0.11239244788885117,
        -0.04103885963559151,
        0.06666606664657593,
        -0.021637529134750366,
        -0.054140254855155945,
        -0.1385565549135208,
        -0.013129780068993568,
        -0.054515987634658813,
        -6.459676473658454e-33,
        -0.010368894785642624,
        -0.03153902292251587,
        0.03144558146595955,
        0.04157010838389397,
        0.024864936247467995,
        0.019208209589123726,
        -0.04906928539276123,
        -0.041527338325977325,
        0.03240654617547989,
        -0.08580033481121063,
        -0.0008217777940444648,
        0.05321171507239342,
        0.019190244376659393,
        -0.06179240345954895,
        0.03211821988224983,
        0.02653103694319725,
        0.01833709329366684,
        0.04380571469664574,
        -0.05239928886294365,
        0.0021517914719879627,
        0.10516964644193649,
        0.004723150748759508,
        -0.036927059292793274,
        0.0971902534365654,
        -0.04034924879670143,
        -0.02192712388932705,
        0.029088931158185005,
        -0.009081599302589893,
        0.02325383387506008,
        0.036336321383714676,
        -0.07334515452384949,
        -0.004735267721116543,
        -0.04882056638598442,
        0.014486381784081459,
        -0.02698981948196888,
        0.051087670028209686,
        -0.01590937003493309,
        0.021430691704154015,
        0.028105059638619423,
        -0.029210058972239494,
        0.07362334430217743,
        0.02114873006939888,
        0.017722638323903084,
        -0.0006847830954939127,
        -0.02344241365790367,
        -0.09178539365530014,
        -0.059731803834438324,
        0.01574157550930977,
        0.0037404175382107496,
        0.07095866650342941,
        0.03530072420835495,
        -0.01758270524442196,
        0.018842987716197968,
        -0.04986084625124931,
        -0.13561473786830902,
        0.04866703972220421,
        0.03642290458083153,
        -0.09235239773988724,
        -0.00454021617770195,
        0.002204296411946416,
        0.04603495076298714,
        0.031160593032836914,
        0.03452998772263527,
        0.04120227321982384,
        0.00140250229742378,
        -0.08818108588457108,
        0.05844079703092575,
        -0.006754034198820591,
        -0.03982379660010338,
        0.002775172470137477,
        0.0398881733417511,
        0.013145782053470612,
        0.08099778741598129,
        -0.0709565281867981,
        0.095725417137146,
        0.0658687874674797,
        0.032843586057424545,
        -0.03604656085371971,
        -0.06802587956190109,
        -0.11849170178174973,
        0.06664107739925385,
        0.019030852243304253,
        0.06737782806158066,
        0.06174460053443909,
        0.05398217961192131,
        0.10539886355400085,
        0.00714427325874567,
        0.04359014332294464,
        -0.007861373014748096,
        0.06225036829710007,
        0.04033024609088898,
        0.05171174556016922,
        0.022690217941999435,
        0.09079644083976746,
        0.0278755035251379,
        -5.7388096053045956e-08,
        0.03075363114476204,
        0.07510942220687866,
        -0.02809705026447773,
        -0.05291508510708809,
        -0.010166478343307972,
        0.01898348331451416,
        -0.04412812367081642,
        0.00047409982653334737,
        0.0036277968902140856,
        -0.06703784316778183,
        0.06080370768904686,
        0.031858257949352264,
        -0.043314989656209946,
        0.0819934830069542,
        -0.052307236939668655,
        0.07434368133544922,
        -0.05696208402514458,
        0.04922112822532654,
        -0.04770326241850853,
        0.033037010580301285,
        0.022867882624268532,
        0.052136555314064026,
        0.10289525240659714,
        0.01924165152013302,
        -0.036639608442783356,
        0.04481172934174538,
        -0.0680498406291008,
        0.059840306639671326,
        0.0163975078612566,
        -0.0002445476711727679,
        0.01129712164402008,
        0.03144887462258339,
        -0.0613209493458271,
        -0.03939881920814514,
        -0.05194735527038574,
        -0.05423334613442421,
        -0.04537338390946388,
        0.043016791343688965,
        0.03480404242873192,
        0.019070643931627274,
        -0.03230242431163788,
        -0.10945561528205872,
        -0.07593493163585663,
        0.04282994940876961,
        -0.10749752074480057,
        -0.015515046194195747,
        -0.03203698620200157,
        -0.06259066611528397,
        0.035549506545066833,
        0.05905955657362938,
        -0.047328561544418335,
        -0.038390547037124634,
        -0.012886534444987774,
        -0.04142650216817856,
        0.06788857281208038,
        0.040570762008428574,
        0.0452527217566967,
        0.061112504452466965,
        0.002382082398980856,
        -0.022158363834023476,
        0.05190642550587654,
        -0.048548705875873566,
        -0.0066320332698524,
        0.06935879588127136
    ]
}