{
    "id": "Qqu3B97qb4w",
    "title": "Save your body from your DESK - Levus Zero Gravity Workstation",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-10T18:22:22Z",
    "video_url": "https://www.youtube.com/watch?v=Qqu3B97qb4w",
    "category": "Science & Technology",
    "tags": [
        "ergonomic",
        "workstation",
        "levus",
        "altwork",
        "workspace",
        "back pain",
        "alternative workspace",
        "desk",
        "computer desk",
        "desk alternatives",
        "comfort",
        "gaming comfort",
        "zero gravity",
        "backpain",
        "chair for my back",
        "improve health",
        "improve back pain"
    ],
    "views": 1378998,
    "likes": 47535,
    "comments_count": 2109,
    "description": "Get up to 25% Off Pulseway's IT Management Software at   Create your build at   Could this big metallic cage be the work/play setup of your dreams? The Levus Zero Gravity Workstation brings a focus ergonomics and flexibility that allows you to set up your work station in any way you like. But, a workplace revolution? Yeah probably not.  I swear it's not a sex thing.  Discuss on the forum:   Buy the Levus Zero Gravity Workstation   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:11 Meet Levus 2:25 Comfort/Ergonomics 3:46 Adjustability 6:08 Impressions 9:27 Vs the Competition 10:27 Is it right for you? 14:34 Outro",
    "description_links": [
        "https://lmg.gg/PulsewayLTT",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1473141-the-half-price-gaming-cockpit/",
        "https://levus.co/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- The desk, the killer of health and happiness. We spend more time sitting than ever before and it is literally, killing us! Back pain, cardiovascular disease, depression, I don't want any of that stuff, but I sit at work, sit in the car, and then sit at my gaming PC. I'm going to die! - You're right Linus, but not anytime soon. Let me introduce you to the LEVUS Zero Gravity workstation. It brings an end to back pain, giving gamers, workers and everybody else, an ergonomic dream seat to work and play at. - Wow, that sounds pretty good. Now switching from sitting to lying down, isn't going to do much for your heart disease problems, but if you're going to be chained to your computer all day, you might as well be comfortable. Right, Adam? Atta boy! Almost as comfortable as I am, segueing to our sponsor. - Build Redux takes the challenge and hassle outta building your own PC with configuration options, support guides to aid you, and competitive pricing versus building a PC yourself. Why not kick up your feet and let Build Redux handle it for you? So head to buildredux.com/linus and start your new build today. - This isn't the first time we've covered a product that hopes to be a paradigm shifting workspace revolution. The difference is that this one aims to do it on a budget. Hmm, kind of! The zero gravity workstation promises to eliminate all environmental distractions and muscle tension. And with it LEVUS claims that gravity is no longer a problem. Those are some very bold claims. Now, when we talk about anything ergonomic, it's important to keep the principles of ergonomics in mind. And the major ones that concern desk workers are these. We want to maintain neutral positions as much as possible. So straight back, supported back, wrist straight, rather than bent, et cetera. We also want to reduce static load. That is the amount of time that you spend activating your muscles in the exact same position. Finally, we want to reduce excessive motions by keeping the tools of our trade near at hand. It's not the most stylish thing around with most of our colleagues comparing it to one of these, (whistling) and saying it looks less like a professional workstation and more like a professional wank-station. But this isn't about looks, it's about ergonomics. So the question is, is it comfortable? Can I give it a shot? - Sure, yeah. - Okay. (laughing) Yeah, you do have to kind of give it a, give it a little shuffle. Once you're in it though, the LEVUS workstation, in all of its black aluminum tube glory here, does seem to cover our main ergonomic bases. Aesthetic load, I mean, you're not even sitting, you're pretty much lying down. Reducing motions, I mean, on first glance, pretty much everything I could possibly need is within arm's reach, but when it comes to neutral positions, I would say that the keyboard situation is not really ideal. It does have an elbow rest. Oh, where did that go? Okay, that's not with an easy reach. Ah! Ah! Ooh! Awesome, thank you. Ah, which way does this go again, I forget, like that. It does have an elbow rest but, this, is a neutral position for your hands, and this is what a typical keyboard posture looks like on the zero gravity workstation. Or if you got a split or go keyboard, which is probably common for this product's target audience then you'll be better off. But, it's still not really perfect. And, that's kind of the common theme here. One of the best things about the LEVUS is that, nearly everything about it can be adjusted, but one of the worst things about it, is how difficult it is to do so. Nearly every component either bolts or screws together, and can only be adjusted with tools. Even the position of this plywood keyboard tray can only be changed. Look, there's no sliders or anything, can only be changed with wood screws. And once it's assembled, the complete lack of hydraulics is pretty frustrating. I mean, look, I've got this side table here, see, I can put my mouse and my USB charging hub, my coffee, et cetera. But let's say I wanted to change my posture a little. To do this, I have to get out of my desk, lift up the whole frame, move the stand underneath to a different height, and then set the desk back down and resume working. It's simple enough but it's not nearly as elegant as the videos would lead you to believe. First, the large chair makes it, so you can't really see where you're moving the stand. So lining it up requires a little bit of guesswork. And second, once you've added all of your monitors, and you've got the seat on here, things get pretty heavy. The worst part is that if you switch to the lowest position, well, it's easier to show than to tell. (laughing) (objects thudding and clattering) No! Look! However, once you're in the cockpit, it not only makes you feel like an astronaut, ready for takeoff, it is super comfy. The chair or I mean, really it's more like a mattress, it's thick, with four inches of foam padding, so you'll never feel the wooden slabs under it, and it features adjustable lumber support. You will need to take off the mattress, screw in another lumber piece, and then put it back on in order to make that adjustment. But once everything is dialed in, you shouldn't need to flex a single muscle to look at your monitor, or monitors. The LEVUS makes up for a lot of its flaws, with it's flexible display configurations. You can mount multiple curved ultra wide monitors inside the frame, put up to a 55 inch display outside the frame, and with the purchase of additional connectors you can go pretty much buck wild. Thanks to the sturdy construction of the frame, you can mount displays of any weight you want as long as they have a compatible base able pattern. Though if you have a very heavy one above you I would personally recommend some kind of, backup safety strap, in case, something bad happens. There are definitely some critical flaws, I'm noticing. You basically need a wired mouse, in case it falls, so you have some way of retrieving it. - To be fair, this is the lowest setting, and it is called sleep. There's work, game, relax and sleep. - But they actually expect you to adjust that horrible bar thing multiple times a day. - I guess! What do you think about the, what do you think about the mattress, you like it? - I think that I definitely need like, a steel plate here, and some magnets on the bottom of my keyboard. I've seen that before in other ones. - Yeah, with the soft rubber on this keyboard, I never had any issues with it sliding. I also, this because I'm a little thicker than you, - Oh! - This is up a little higher. So it never caused me any issues. But at this steep angle it's, just don't, just don't shake too much. - Don't move! - If you wiggle a little, the- - The mattress is really nice. - Yeah, I really enjoyed it. Though, I do wish that there was like an option for a non pleather cover, because I just get a little sweaty. - As the kind of boy who literally water cooled my chair. I could definitely see that being better. I can also see why they went with this, wimpy skinny plywood here, for the keyboard tray. Like on the one hand, it's not the sturdious thing ever, but on the other hand, unless you are absolutely cranking the adjustments for this, if it was any heavier, it would put a significant amount of weight on your lap because they don't have any hydraulics. - I mean even if they put like a ratcheting mechanism up there that would help this stay like lock in a place. - Oh yeah! And then if you just had like a little release here. - Yeah. - Yeah, maybe it was a mod or something. The pillows, pretty okay. I mean it's not, I wouldn't sleep on a pillow like this, but it's supportive. - Yeah, I found that it lacked adjustment points. You can kind of, you kind of wrap it along the slats underneath, and you can either go at the second slat, or the first slat, and neither of them really fit me for my height. - I see. Yeah, I think it's the kind of thing that I would end up just kind of moving around every time anyway. - Yeah. - I don't know if you noticed this, the thing I said earlier, remind me to tell you about something that bothers me so much. When you are sitting dead center in front of the keyboard, that monitor is off to the side. (laughing) I'm so bothered. It's like two and a half, three inches off. - That's not their fault. That's, that's our fault. - Oh, that's on you. - That's on me. There's, it's on a TV mount, 'cause the vasa, it was an ordeal getting this thing mounted. - Okay, all right, that's fair. I mean I think most of the problems could be pretty easily solved. Like it would be a simple DIY mod to just put some rubber on here, to fix the sliding issue. - Yeah, but when you're spending the kind of money you're spending to get this, you kind of want those problems to be solved a little bit ahead of time. - That's fair. One really cool thing I could see though is with headphones on, looking up like this, man, you'd be able to get in the zone, like really well. - Oh, a hundred percent! People would eat lunch just over there, and I would just be focused on my screen with my headphones on. I didn't notice anything. - That's kind of wild. Kind of lonely though. - It was, yeah. (laughing) I also wouldn't see anything going on any other time of day. It's going to be easier if I, you just lift it up, and I'll just move it. - Yep! - It's going to be so, higher. Higher. - Oh my god! This is not very good. So convenient. Now at $4,000, you're probably wondering, why we've referred to the LEVUS as the half price cockpit. It's because similar products, that we've looked at in the past cost twice as much, or more. They tend to be more richly featured, with things like, motorized adjustments, magnetic mouse pads. Or even in the case of that wild one from Acer, and included gaming PC. But to LEVUS's credit, they achieved a lot of the same end result at this much lower price. And if you don't like it, they offer a two week return window. Though you will have to pay for return shipping. All of that is pretty good. The bad, is that it takes a long time to build. Thank goodness for the LTT screwdriver, lttstore.com. And while you're there, don't forget the Metric Hex Bit Set. The LEVUS uses five different sizes of hex bits. It also includes no cable management other than some straps. So it was an adventure, and we're going to have the full build vlog with Adam up on floatplane.com. A really uncomfortable moment for us in this review, was when we realized that a lot of the selling points on the LEVUS website could be easily addressed by spending your $4,000 budget, on, well, something else entirely. Want to recline? Why don't you buy an easy chair, and a lapboard? Prefer a big screen? Why don't you sit in the recliner you just bought, buy a TV, because you got so much budget to spend and mount that to your wall. And unfortunately, even if it might be a great choice compared to the other options, there are some problems that affect nearly every product in this category. If this is the cockpit then the vehicle you're driving is the forever alone mobile. (laughing) - Why, why are you laughing? What's funny? - That's funny. - You're just mad that I'm more ergonomic than you. - Well, you can purchase additional joints to allow monitors to tilt and swivel. Even with these adjustments, I mean, it's not that easy for someone to sit with you and collaborate on a project, unless that is you and your colleagues, have a special kind of relationship. - No, no, no, thanks. Thanks Linus. - Another problem is space. While the footprint isn't actually that much bigger than a standard desk and chair, when you account for, you know, pushing out the chair to get away, it is far less flexible. So if you had, for example, a computer, but also a side desk, where you could work with your hands, or a shelf on the other side, an office chair can be easily swiveled from one workspace to another, or kick to the side when you don't need it. While the LEVUS, would make moving around in your space extremely difficult. It's also difficult to move, and I mean that in two ways. One bad the other worse. Moving the LEVUS workstation is pretty much a non-starter. It is much wider than a standard doorway. Meaning that even with two people, it would be easily a multi-hour endeavor to pack it up and move it to another office or to another room. And the other way I meant that is that moving yourself in and out of the LEVUS workstation, even just to go to the bathroom, is such a chore, that it disincentivizes the only real solution to your ergonomic problems. Moving around! It is so easy to just lie still on your little computer cloud that yeah, your muscles might not hurt now but eventually they will, when they atrophy. Not that I think that will actually happen. As cool as I myself thought this idea was back in 2016, when I built the world's most comfortable gaming setup. The novelty of using a computer or gaming while reclined, wore off pretty quickly for me and my family, and we ended up not recreating that at our new house. So I strongly suspect that like your treadmill, your LEVUS will spend more of its life, as a laundry drying rack than an actual desk. Like with any miracle cure then, the LEVUS zero gravity workstation only works if you put the work into it. It is not a substitute for exercise, rest, and a healthy diet. But with this tool in your ergonomic toolkit I could see a path toward better comfort and happiness for many at desk worker. Just try to get your boss to pay for it, right? (laughing) - Speaking of which, now I hated this thing when I first got it, but after a week working in it, can I call dibs? - Not like I've called dibs on this message, from our sponsor. Pulseway, when your network devices require attention, wouldn't it be nice to have control while you're out running errands instead of having to sit there in front of a computer? Well, pulseway offers a convenient solution to these sorts of dilemmas. Their All In One platform allows you to monitor all your servers, computers, and network devices from any mobile phone or tablet. So you can respond quickly, no matter where you are. Whether that's running scripts, checking CPU temperatures, pushing through updates, or even running diagnostics on that pesky printer that never cooperates. You know which one I'm talking about. All of them. They also offer a hefty suite of automation options for critical IT tasks or simply shutting down your home systems when the babysitter needs help putting the kids to bed. It works with Windows, MAC OS, and even Linux, which means more control for you. And since you can do all of this on the go, you'll have more time for the things you love. while Pulseway handles the rest. Try a no commitment, free trial of Pulseway by following the link down below. - But can I have it? - If you like this video, maybe check out our video on the Altwork workstation. It's kind of a windows to Linux of these cockpits comparison. - You're not answering the question, and that worries me. (upbeat music)",
    "transcript_keywords": [
        "LEVUS",
        "kind",
        "yeah",
        "LEVUS workstation",
        "pretty",
        "workstation",
        "Gravity workstation",
        "thing",
        "keyboard",
        "time",
        "Back",
        "killer of health",
        "put",
        "desk",
        "ergonomic",
        "chair",
        "things",
        "Build",
        "Gravity",
        "Build Redux"
    ],
    "transcript_entity_values": [
        "LEVUS",
        "one",
        "second",
        "Acer",
        "Windows",
        "first",
        "One",
        "four inches",
        "a week",
        "zero",
        "First",
        "all day",
        "Atta",
        "today",
        "Pulseway",
        "five",
        "55 inch",
        "two week",
        "MAC",
        "a hundred percent",
        "LTT",
        "the Metric Hex Bit Set",
        "4,000",
        "Build Redux",
        "CPU",
        "USB",
        "Adam",
        "Altwork",
        "Linus",
        "Linux",
        "Linux",
        "two and a half",
        "two",
        "DIY",
        "half",
        "Zero",
        "three inches",
        "2016"
    ],
    "transcript_entity_types": [
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "LAW",
        "MONEY",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        -0.026883339509367943,
        -0.001379706198349595,
        -0.012900608591735363,
        -0.05498424172401428,
        -0.015011746436357498,
        0.01312942709773779,
        0.027879806235432625,
        0.009519252926111221,
        -0.058054644614458084,
        -0.025618890300393105,
        -0.07599788159132004,
        0.05510831996798515,
        0.04204493388533592,
        -0.02489626035094261,
        0.043656714260578156,
        -0.030668875202536583,
        0.0784737840294838,
        -0.08116510510444641,
        0.006564841140061617,
        0.04933740943670273,
        -0.004919749218970537,
        -0.023416686803102493,
        -0.02361983433365822,
        -0.03261956200003624,
        -0.0422603040933609,
        0.006396906450390816,
        0.007064381148666143,
        0.009926569648087025,
        -0.01995193585753441,
        -0.044662702828645706,
        0.016049815341830254,
        0.030183883383870125,
        -0.00013734442472923547,
        -0.042144592851400375,
        -0.00887534860521555,
        0.01070857048034668,
        0.06667012721300125,
        -0.028375206515192986,
        -0.09675580263137817,
        -0.054983511567115784,
        -0.01917717233300209,
        -0.05421709269285202,
        0.04403287544846535,
        -0.001236035954207182,
        -0.00321951718069613,
        -0.016221867874264717,
        0.04450121894478798,
        -0.09174378961324692,
        0.029743438586592674,
        -0.0185994952917099,
        0.04921505227684975,
        -0.1371731162071228,
        0.11079622060060501,
        0.004557372070848942,
        -0.05813611298799515,
        0.020449364557862282,
        -0.0032712279353290796,
        -0.02399948239326477,
        0.026438280940055847,
        -0.04414062574505806,
        0.04726516455411911,
        -0.045227158814668655,
        0.003875404130667448,
        0.06781028211116791,
        0.06614561378955841,
        0.029255347326397896,
        -0.02391749806702137,
        0.052562836557626724,
        -0.009357694536447525,
        -0.0037004740443080664,
        0.025434022769331932,
        -0.09916063398122787,
        -0.04908939078450203,
        0.05695992335677147,
        0.06831779330968857,
        0.00422195577993989,
        0.04200732335448265,
        -0.07054842263460159,
        0.10046268254518509,
        0.055453136563301086,
        -0.002972715999931097,
        0.03324732556939125,
        -0.03884610906243324,
        0.004928512964397669,
        -0.1131378710269928,
        -0.029453085735440254,
        0.05377958342432976,
        0.08216769993305206,
        0.014569643884897232,
        -0.07036258280277252,
        -0.02468734048306942,
        0.08434837311506271,
        0.0028650136664509773,
        -0.02507917769253254,
        -0.05064857751131058,
        -0.018123190850019455,
        -0.060514211654663086,
        -0.006187633145600557,
        -0.07314691692590714,
        0.08953338861465454,
        0.014810441993176937,
        0.013721956871449947,
        0.09170884639024734,
        -0.009480461478233337,
        -0.08432590961456299,
        -0.047643810510635376,
        -0.007739597000181675,
        0.05604515224695206,
        -0.06454499065876007,
        -0.033010706305503845,
        -0.02603965625166893,
        0.013237959705293179,
        -0.07246055454015732,
        0.01851574145257473,
        -0.03394341468811035,
        0.014722582884132862,
        -0.041682202368974686,
        0.015468196012079716,
        0.0087764086201787,
        0.08097565919160843,
        0.05533812195062637,
        -0.01975553296506405,
        -0.008462416008114815,
        -0.012977554462850094,
        -0.017204269766807556,
        0.012415729463100433,
        -0.02802748791873455,
        -1.593740750974627e-33,
        -0.00960685033351183,
        -0.0338810458779335,
        0.01748657412827015,
        0.02180832251906395,
        0.14590094983577728,
        -0.019596368074417114,
        -0.007654063869267702,
        0.06413566321134567,
        0.049908410757780075,
        0.06162700057029724,
        -0.06554301083087921,
        0.09307201206684113,
        -0.029918186366558075,
        0.03597291186451912,
        0.008898490108549595,
        -0.06419801712036133,
        0.028771812096238136,
        0.031578052788972855,
        -0.04090096801519394,
        -0.056287627667188644,
        -0.04171611741185188,
        -0.04795641824603081,
        -0.020380213856697083,
        -0.0355072095990181,
        0.07361503690481186,
        0.011256163939833641,
        -0.007604952435940504,
        -0.04547110199928284,
        0.05018322169780731,
        0.027229318395256996,
        -0.09269766509532928,
        -0.001731237629428506,
        -0.013151435181498528,
        -0.07505252957344055,
        -0.029485659673810005,
        0.07164501398801804,
        -0.085573710501194,
        -0.06746631115674973,
        0.04611414298415184,
        -0.01675940863788128,
        -0.04980964958667755,
        0.002680970123037696,
        0.008130948059260845,
        -0.07059876620769501,
        -0.0073997871950268745,
        0.062287118285894394,
        0.10967965424060822,
        -0.012370537966489792,
        0.01735484041273594,
        0.014602120034396648,
        -0.027739521116018295,
        0.01739775761961937,
        -0.058332521468400955,
        -0.026274006813764572,
        0.008962471969425678,
        -0.05277038738131523,
        0.03918330371379852,
        -0.04650665819644928,
        0.11475757509469986,
        0.05650791525840759,
        -0.019919997081160545,
        0.029436836019158363,
        0.024878328666090965,
        0.02395901270210743,
        -0.0012905258918181062,
        -0.004323309287428856,
        0.04212041199207306,
        -0.007436397951096296,
        -0.02023213915526867,
        -0.0272684246301651,
        -0.0285225547850132,
        -0.0047750468365848064,
        0.014932370744645596,
        0.0069191716611385345,
        0.00394824193790555,
        0.08880728483200073,
        -0.06799503415822983,
        -0.08186881244182587,
        -0.09069738537073135,
        0.007693828549236059,
        0.01958993449807167,
        0.052803851664066315,
        0.052788641303777695,
        0.0045198411680758,
        0.11329823732376099,
        0.05071837082505226,
        0.010510106571018696,
        -0.03781953454017639,
        -0.06031093746423721,
        0.02868693508207798,
        -0.09274395555257797,
        0.01406955812126398,
        0.002462152624502778,
        0.013735290616750717,
        -0.04513835161924362,
        -1.4872322384179926e-33,
        -0.054021984338760376,
        -0.055880364030599594,
        -0.05434204638004303,
        -0.01934666931629181,
        0.14273220300674438,
        0.06096149981021881,
        0.09835132956504822,
        -0.0735369622707367,
        -0.03385056182742119,
        0.12186780571937561,
        0.01626393385231495,
        -0.022854574024677277,
        -0.04209200665354729,
        -0.015384793281555176,
        0.04480155557394028,
        -0.06110678240656853,
        -0.0190469641238451,
        -0.033847007900476456,
        -0.06332317739725113,
        -0.003019636729732156,
        0.06073515862226486,
        0.024870257824659348,
        0.004067632369697094,
        0.045535456389188766,
        0.045541901141405106,
        -0.01367107778787613,
        -0.00756362359970808,
        0.04330475255846977,
        0.00915792677551508,
        0.11756011098623276,
        -0.06040768697857857,
        -0.014972983859479427,
        -0.04165418818593025,
        -0.015245542861521244,
        0.1348901093006134,
        -0.05891384184360504,
        -0.005424580071121454,
        0.08771888166666031,
        0.047926947474479675,
        -0.06879352033138275,
        0.024256009608507156,
        0.0003010399523191154,
        -0.03245930001139641,
        0.009383435361087322,
        0.025074204429984093,
        -0.10246404260396957,
        -0.060748256742954254,
        -0.06262186914682388,
        -0.07460842281579971,
        -0.041682999581098557,
        -0.02981269732117653,
        -0.052680425345897675,
        0.03134019672870636,
        -0.05689466372132301,
        -0.0174826942384243,
        -0.029235200956463814,
        -0.006916239857673645,
        -0.037026677280664444,
        -0.07587134093046188,
        0.006167724262923002,
        -0.017618227750062943,
        -0.02540459670126438,
        0.0075879283249378204,
        0.040739621967077255,
        0.029714779928326607,
        -0.0058850012719631195,
        0.05669765546917915,
        0.029907504096627235,
        -0.07516071200370789,
        0.05022912472486496,
        0.03692019358277321,
        -0.005274532362818718,
        -0.008813843131065369,
        -0.05780544504523277,
        -0.07561781257390976,
        0.0035284373443573713,
        0.10669960081577301,
        -0.0696479082107544,
        -0.04308747127652168,
        -0.06294549256563187,
        0.015680458396673203,
        0.004460710566490889,
        0.09740239381790161,
        -0.009985621087253094,
        0.017075220122933388,
        0.04491756483912468,
        -0.0025265004951506853,
        0.034557078033685684,
        -0.04268857464194298,
        -0.0059416876174509525,
        -0.03012692555785179,
        -0.016092145815491676,
        -0.07432138919830322,
        0.02194214053452015,
        0.005339877679944038,
        -5.820362858344197e-08,
        -0.11270461976528168,
        0.0033666493836790323,
        0.023550886660814285,
        0.028583548963069916,
        -0.09786813706159592,
        -0.06519053876399994,
        0.03240816667675972,
        -0.12028492242097855,
        0.06511364132165909,
        -0.008101038634777069,
        0.029515810310840607,
        -0.15022052824497223,
        0.055698927491903305,
        0.060474470257759094,
        0.05974997580051422,
        0.09602566808462143,
        -0.0011137953260913491,
        0.11466403305530548,
        -0.0960698276758194,
        -0.05191962793469429,
        0.06019386276602745,
        0.01416041050106287,
        0.08062838017940521,
        -0.039157602936029434,
        0.05964202806353569,
        -0.003004967700690031,
        0.0334167405962944,
        0.0855836421251297,
        0.07188697159290314,
        -0.0007049106061458588,
        -0.05382196977734566,
        0.0005953770014457405,
        -0.07407445460557938,
        0.022309789434075356,
        -0.014062176458537579,
        -0.09979350864887238,
        0.0375090017914772,
        0.0754864439368248,
        -0.007774436380714178,
        0.025208525359630585,
        -0.07192887365818024,
        -0.030250022187829018,
        2.363092607993167e-05,
        0.015122825279831886,
        -0.024249423295259476,
        -0.06476905196905136,
        -0.03530387207865715,
        -0.010892258025705814,
        -0.007463258691132069,
        0.053182199597358704,
        0.022027738392353058,
        0.02395305223762989,
        0.042808227241039276,
        0.021792152896523476,
        0.02714593894779682,
        0.037976689636707306,
        -0.04517035558819771,
        0.0396747887134552,
        -0.0751417949795723,
        0.033861998468637466,
        -0.033521078526973724,
        -0.06837198883295059,
        -0.045125070959329605,
        0.057398077100515366
    ]
}