{
    "id": "QtFOpkpytjw",
    "title": "iPad mini Bend Test! - Do ALL Tablets Break?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-04-04T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=QtFOpkpytjw",
    "category": "Howto & Style",
    "tags": [
        "ipad mini",
        "2019 ipad mini",
        "ipad mini 5",
        "apple ipad mini",
        "ipad pro",
        "ipad",
        "tablet",
        "tablet computer",
        "best ipad",
        "cheap ipad",
        "ipad mini review",
        "ipad mini unboxing",
        "ipad mini durability test",
        "jerry rig everything",
        "ipad mini bend test",
        "iphone",
        "apple",
        "new iphone"
    ],
    "views": 6915346,
    "likes": 129686,
    "comments_count": 17883,
    "description": "The New iPad mini 2019 kinda looks like the older iPad mini's. Customize your phone or tablet with dbrand:  Thanks to dbrand for sponsoring this video! Is the iPad mini weaker than the larger iPads? Does more money equal more strength? The only way to find out is with an iPad mini Durability test from JerryRigEverything. The industry standard scratch test, burn test and bend test is here to confront the iPad mini. Lets see if this new 2019 iPad mini 5 can survive. Is the iPad mini stronger than the iPad pro?   iPad Pro bend test:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://dbrand.com/ibend",
        "https://youtu.be/hUBsxCcJeUc",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The iPad lineup is getting pretty crowded lately with the iPad, the iPad Air, the iPad Pro, and this new 2019 iPad Mini that Apple just released. They all do pretty much the same thing. To get any real work done, you'll still need a laptop or a desktop computer, but sometimes it's nice to have a bigger screen to read or watch movies on. Today though, we'll be assessing the durability and build quality of the littlest iPad. You already know how the iPad Pro handled this durability test. Let's hope the Apple's iPad Mini is built a bit stronger. Let's get started. [Intro] You might be thinking to yourself, 'Man, that iPad Mini looks kind of old. What year is it?' And you're right. The exterior design hasn't changed much in the last 7 years. It has that lightning port on the bottom instead of USB-C, but does come with a fast charger in the box...something that Apple has yet to include with their iPhones. The overall appearance of the new iPad Mini is the same as it was back in 2012, with its large bezels and curved edges, but if it works, it works. Let's start with the scratch test. I'll use my set of Mohs mineral picks to check the hardness level of the front surface. We've seen clear plastic screens scratch at a level 3. Glass screens would scratch at a level 6, and sapphire screens, like the Kyocera DuraForce Pro 2 will scratch at a level 8 or 9. The iPad Mini 5 looks like it's covered in tempered glass since we see the industry standard scratches at a level 6 with deeper grooves at a level 7. The 7 megapixel selfie camera is up here in the top Texas-sized bezel protected with the same scratch resistant glass. Little guy is unable to do face unlock, but does film in 1080p. The bottom bezel includes some hardware we haven't seen since 2015 a physical clicky home button. Yeah, it's still scratch resistant and does that fingerprint scanning thing. Apple must just have a bunch of old parts they're trying to get rid of with this new release. The gold colored 2019 iPad Mini is made from metal, along with both of the volume buttons up here at the top. Speaking of old school hardware, let's welcome back the headphone jack. Apple trying to milk an old design for more money does have it's perks for the rest of us. Maybe they'll bring back the iPhone SE this year too. The iPad Mini does have one little microphone hole up at the top, but we'll come back to this later. We have more metal over here on the left side of the tablet. You can see that silver glinting through under the gold anodizing. So far, no big issues. The bottom of the iPad Mini has dual stereo speakers and the same lightning port that Apple's been using for the past seven years. We should see an update to USB-C at some point. One thing I am glad to see though is that there's no weak points along either of the iPad Mini sides. The longer and thinner something is, the more prone it might be to breaking like the iPad Pro. With it's microphone cutout on one side, and wireless charging dock for the Apple pencil on the other side, it made an already fragile piece of tech even weaker. That's probably why people were getting brand new tablets bent right out of the box. The iPad Mini doesn't have any of these builtin deformities on the long sides, just the one microphone hole up at the top on the short side. Hopefully this helps the iPad Mini survive the rest of this test. The 8 megapixel 1080p capable rear facing camera is a circular inlay with no protruding camera lens. Apple doesn't mention sapphire on their website for this iPad Mini, but judging by my diamond selector tool and scratches at levels 6, 7, and 8, they're using the same material they've always been using. No surprises there. One thing that has improved with this year's model is the front of the tablet is now compatible with the Apple pencil 1 - also 4 years old at this point. (Everything sold separately.) The back side of the tablet is also compatible with the Apple pencil if you believe in yourself, but I recommend something a little sharper. I asked on Twitter a few days ago what people wanted to learn from Art Class with Jerry and Thanos was suggested. As somewhat of an expert in fine razor blade art, I'll do my best. Bald guys are pretty easy to draw. And here we are...Thanos eating an apple. Not sure if this is pre or post universal destruction, but it looks to me like Thanos did nothing wrong. One thing you can add to your tablet before it gets scratched or after it gets scratched, is a dbrand skin. This particular skin camouflages not only the scratches, but also the Apple logo...effectively debranding the tablet, making it perfectly balanced as all things should be. I'll put a link in the description so you can customize your own phone or tablet. Thanks to dbrand for sponsoring this video. One thing that Apple changed with version 4, and subsequently this version 5, is the outer glass is now glued to the LCD screen underneath it, making screen repairs quite a bit more expensive. Replacing the front glass on the iPad Mini 3 only cost about $20. Once Apple started laminating the glass to the LCD, the repair price skyrocketed to the point where people just live with cracked screens nowadays. Kind of fun. After about 16 seconds of intense flame, the 7.9 inch LCD pixels go black and turn off, but do eventually come back to life and make a full recovery...hopefully like the Avengers will recover in Endgame. The iPad Pro failed my bend test catastrophically, and it's time now to see if the miniature iPad will suffer the same fate. With the initial flex the tablet moves easily into an extremely compromised obtuse angle, but then locks out and amazingly retains full functionality. I'm impressed that Apple has found a way to defy physics. The tablet is still fully functional despite the massive bend, and this isn't even a flexible AMOLED display - it's an LCD. I'll try bending the iPad Mini 5 back the other direction, and it pops into place...mostly, but does not allow any flex towards the screen size. It still surprisingly doesn't shatter or stop working. There is some adhesive separation between the glass and the frame. Yeah, Thanos has some curves, but some people are into that. Apple definitely wins this round. That was quite possible the biggest bend I've ever seen on a device that still survived. The iPad Mini is way more durable than the iPad Pro. I'm impressed. Hopefully this isn't an omen of Thanos surviving in Endgame. Tell me your predictions for the movie down in comments below. Hit that subscribe button it's free. And then see hat your phone looks like with a dbrand skin. Link in the description. Thanks a ton for watching. And I'll see you around.",
    "transcript_keywords": [
        "iPad Mini",
        "Apple iPad Mini",
        "iPad",
        "Mini",
        "iPad Pro",
        "Apple",
        "iPad Air",
        "iPad Mini sides",
        "iPad Mini survive",
        "Pro",
        "Apple iPad",
        "Apple pencil",
        "tablet",
        "iPad Pro handled",
        "iPad lineup",
        "back",
        "Thanos",
        "Glass",
        "level",
        "Air"
    ],
    "transcript_entity_values": [
        "iPad Mini",
        "about $20",
        "2019",
        "9",
        "the Kyocera DuraForce Pro 2",
        "the last 7 years",
        "6",
        "8",
        "8 megapixel 1080p",
        "Texas",
        "7",
        "the iPad Pro",
        "1080p",
        "2015",
        "the iPad Pro",
        "The iPad Mini",
        "this iPad Mini",
        "Thanos",
        "the iPad Mini",
        "7 megapixel",
        "Jerry",
        "6",
        "the iPad Pro",
        "4 years old",
        "the past seven years",
        "the iPad Air",
        "Avengers",
        "Twitter a few days ago",
        "2012",
        "4",
        "iPad",
        "about 16 seconds",
        "this year",
        "year",
        "iPad Mini 3",
        "5",
        "Apple",
        "USB-C",
        "iPhones",
        "Endgame",
        "iPad Mini 5",
        "LCD",
        "Today",
        "1 - also",
        "3",
        "One",
        "AMOLED",
        "one",
        "7.9 inch"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "DATE",
        "PRODUCT",
        "DATE",
        "DATE",
        "LAW",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "LAW",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY"
    ],
    "vector": [
        -0.036939386278390884,
        -0.0026108603924512863,
        0.0029319869354367256,
        -0.0900583490729332,
        0.08121373504400253,
        -0.06492210924625397,
        -0.0022526925895363092,
        0.10412580519914627,
        -0.02929549105465412,
        0.08526371419429779,
        0.06946796178817749,
        0.06903716176748276,
        -0.08595536649227142,
        0.029557479545474052,
        0.03201640769839287,
        0.019180988892912865,
        0.04856380447745323,
        0.002084465464577079,
        -0.10947000980377197,
        0.0893135741353035,
        -0.03499545902013779,
        -0.030397307127714157,
        0.025547415018081665,
        -0.0321277491748333,
        -0.033035386353731155,
        0.03598315268754959,
        -0.03432575240731239,
        0.023183537647128105,
        -0.021353891119360924,
        -0.012228057719767094,
        -0.0053169033490121365,
        0.03947779908776283,
        -0.1060345247387886,
        0.08038514107465744,
        0.0062058428302407265,
        -0.037118859589099884,
        0.0008240911993198097,
        0.0022689737379550934,
        -0.0404510423541069,
        -0.06292279064655304,
        -0.07319118827581406,
        -0.039092935621738434,
        -0.03517274558544159,
        -0.006166656967252493,
        0.004998036194592714,
        -0.002053825883194804,
        0.056312039494514465,
        -0.06668166816234589,
        -0.021047228947281837,
        -0.01592942327260971,
        -0.03050169162452221,
        -0.00204648869112134,
        0.04896271973848343,
        -0.013527576811611652,
        -0.039424311369657516,
        -0.06774751096963882,
        0.004716876428574324,
        -0.019958505406975746,
        0.08682382106781006,
        0.06698796898126602,
        0.04226412996649742,
        -0.04912572726607323,
        0.07449457049369812,
        0.07004182785749435,
        0.037178002297878265,
        -0.019248347729444504,
        0.06370285898447037,
        -0.12473368644714355,
        0.002451132982969284,
        -0.03382144123315811,
        -0.051574740558862686,
        0.016313891857862473,
        -0.021079225465655327,
        0.037737201899290085,
        0.04787001013755798,
        -0.009544231928884983,
        -0.000377076183212921,
        0.005606567487120628,
        -0.0024902496952563524,
        -0.0019714690279215574,
        -0.005683321040123701,
        -0.0019451789557933807,
        0.03050088696181774,
        -0.003671604208648205,
        -0.014538264833390713,
        0.017444882541894913,
        -0.0021756114438176155,
        0.06079317629337311,
        0.009145905263721943,
        -0.010210201144218445,
        0.017258968204259872,
        0.10194884985685349,
        -0.055549707263708115,
        0.06163663789629936,
        0.013676242902874947,
        -0.07859070599079132,
        -0.061929985880851746,
        -0.11792154610157013,
        -0.11438530683517456,
        0.024850379675626755,
        0.036356352269649506,
        0.05087466910481453,
        0.0690680742263794,
        0.004709422588348389,
        0.05222305282950401,
        -0.05426977202296257,
        0.034536171704530716,
        -0.0930950790643692,
        0.028279254212975502,
        0.05208628252148628,
        0.056198325008153915,
        0.05372268334031105,
        -0.0031628315337002277,
        -0.02984079346060753,
        0.03746955096721649,
        -0.04531746357679367,
        -0.08043169230222702,
        0.10510597378015518,
        0.06131400913000107,
        0.018979350104928017,
        0.014139866456389427,
        0.03149881958961487,
        -0.04433830454945564,
        -0.07784565538167953,
        0.00045169101213105023,
        0.0383899062871933,
        -0.0479670912027359,
        4.713095743138006e-33,
        -0.013934556394815445,
        0.16240960359573364,
        -0.017829114571213722,
        -0.020042823627591133,
        0.010653423145413399,
        -0.0769122913479805,
        0.00210903724655509,
        0.12285719811916351,
        -0.013682415708899498,
        -0.004657387267798185,
        0.0076017859391868114,
        -0.051715437322854996,
        -0.05168590322136879,
        -0.027613328769803047,
        0.10306908190250397,
        0.007620934396982193,
        -0.027844414114952087,
        -0.01659182645380497,
        -0.06639011949300766,
        0.03059348650276661,
        -0.03515631705522537,
        -0.09513124078512192,
        0.02862427569925785,
        -0.010146265849471092,
        -0.002051691757515073,
        -0.011035660281777382,
        0.0647653341293335,
        0.030341630801558495,
        -0.012849021703004837,
        0.019796140491962433,
        -0.12546926736831665,
        -0.04749495908617973,
        -0.016475850716233253,
        -0.06826987862586975,
        -0.06607180088758469,
        -0.02685752511024475,
        -0.021986447274684906,
        -0.06342802941799164,
        -0.030982742086052895,
        0.026354944333434105,
        -0.11011072993278503,
        0.008724008686840534,
        0.03537542000412941,
        -0.03137403354048729,
        0.039304737001657486,
        -0.018341077491641045,
        0.04830041900277138,
        0.07151994109153748,
        -0.04075074940919876,
        -0.07989955693483353,
        -0.050975147634744644,
        -0.048201628029346466,
        -0.002905870322138071,
        -0.03450664505362511,
        -0.03411516919732094,
        0.0297884289175272,
        0.01018758025020361,
        -0.07595927268266678,
        0.03383631631731987,
        0.08751706033945084,
        0.0043270704336464405,
        -0.04528846964240074,
        -0.05892636999487877,
        0.04326355457305908,
        -0.09805012494325638,
        0.03888111189007759,
        0.03043336793780327,
        0.027480196207761765,
        -0.00806254893541336,
        0.004652281757444143,
        -0.021584760397672653,
        0.05646909773349762,
        0.03361930698156357,
        -0.05101601779460907,
        -0.0025800170842558146,
        0.0040274267084896564,
        0.04613739252090454,
        -0.00017998529074247926,
        0.021521499380469322,
        -0.050224579870700836,
        -0.06866572797298431,
        0.057980895042419434,
        0.07620573788881302,
        0.02742636576294899,
        -0.12418621778488159,
        -0.005563078913837671,
        -0.00017543656576890498,
        -0.13398611545562744,
        -0.011916404590010643,
        0.013098160736262798,
        -0.016303207725286484,
        -0.03428824245929718,
        -0.07101887464523315,
        -0.04885626584291458,
        -0.014502854086458683,
        -5.56167997220883e-33,
        -0.05164583399891853,
        -0.0004671938077080995,
        -0.0397983081638813,
        -0.003394361585378647,
        0.004584095906466246,
        -0.08711367845535278,
        0.09137263894081116,
        0.06747875362634659,
        0.023807786405086517,
        -0.06007058545947075,
        0.0010877029271796346,
        0.017107971012592316,
        -0.07448606193065643,
        -0.06896814703941345,
        0.004984412807971239,
        0.001546840532682836,
        -0.0735115334391594,
        -0.08963444083929062,
        0.10474013537168503,
        -0.0017193796811625361,
        0.10284753143787384,
        0.06983596831560135,
        0.06709641963243484,
        0.0260448157787323,
        0.04694055765867233,
        0.02387542836368084,
        0.02164086513221264,
        -0.05422935262322426,
        0.06153089553117752,
        -0.025943156331777573,
        0.1299251765012741,
        -0.07609068602323532,
        -0.023513054475188255,
        0.10432480275630951,
        0.03592631593346596,
        0.0397198349237442,
        0.03389273211359978,
        -0.07230962812900543,
        -0.008192642591893673,
        -0.056169357150793076,
        0.06838411837816238,
        0.11345545947551727,
        -0.001778846955858171,
        -0.06180350109934807,
        -0.026999028399586678,
        -0.0387437641620636,
        0.03714865446090698,
        0.023487450554966927,
        0.007675090339034796,
        -0.04461996629834175,
        -0.00013124974793754518,
        0.04673547297716141,
        -0.04848814755678177,
        0.04129025340080261,
        -0.051839254796504974,
        -0.010465134866535664,
        0.0712299719452858,
        -0.052447691559791565,
        -0.07358770072460175,
        -0.006874687038362026,
        -0.005014765076339245,
        0.02220882475376129,
        -0.04513605311512947,
        0.003249733941629529,
        -0.03017330728471279,
        0.0042614080011844635,
        0.021393772214651108,
        0.034296952188014984,
        0.06164693459868431,
        0.044920191168785095,
        0.023976989090442657,
        -0.028958884999155998,
        0.0636986792087555,
        -0.09805405139923096,
        0.02386314421892166,
        0.11547987908124924,
        0.042747605592012405,
        -0.040206462144851685,
        -0.02870369702577591,
        -0.02739761583507061,
        0.033379606902599335,
        -0.008129214867949486,
        -0.003935951739549637,
        0.03582793474197388,
        0.04697037860751152,
        0.011565675027668476,
        0.019412977620959282,
        0.02912312000989914,
        -0.06238476186990738,
        0.10024897009134293,
        -0.04400257393717766,
        0.016791285946965218,
        -0.017517201602458954,
        0.051924023777246475,
        -0.028924275189638138,
        -5.392750423993675e-08,
        -0.004959536716341972,
        0.052689261734485626,
        -0.0070103611797094345,
        -0.0044191982597112656,
        -0.004354661796241999,
        -0.035205770283937454,
        0.043894678354263306,
        0.010596574284136295,
        0.01408965140581131,
        0.008784765377640724,
        -0.051765814423561096,
        -0.09088503569364548,
        -0.02193196676671505,
        0.10706537961959839,
        -0.027921246364712715,
        0.0918317437171936,
        -0.03306223079562187,
        0.025724630802869797,
        -0.012231478467583656,
        -0.0414770245552063,
        -0.0959453284740448,
        0.009634686633944511,
        0.02028520777821541,
        -0.051698002964258194,
        -0.07233275473117828,
        0.02572161890566349,
        -0.11394818127155304,
        -0.006528825499117374,
        -0.03309861943125725,
        0.015367778018116951,
        -0.07327377796173096,
        0.008416606113314629,
        0.014525366015732288,
        -0.0025263193529099226,
        0.03421245515346527,
        -0.05500510707497597,
        -0.057081080973148346,
        0.04658636450767517,
        0.012867513112723827,
        0.07020360231399536,
        -0.00676457304507494,
        -0.08513011783361435,
        0.011653645895421505,
        0.03819933161139488,
        0.045604024082422256,
        -0.04324093833565712,
        -0.01341029442846775,
        -0.0800098180770874,
        0.0021029210183769464,
        0.029829910025000572,
        0.04550229385495186,
        -0.001561271375976503,
        -0.005360194481909275,
        0.03819699212908745,
        0.010678780265152454,
        0.029938649386167526,
        0.008745676837861538,
        -0.003990242723375559,
        -0.027633799239993095,
        0.004201583098620176,
        0.06743385642766953,
        -0.0626693069934845,
        0.0321224182844162,
        0.0811663344502449
    ]
}