{
    "id": "QV6qeIi_Uoc",
    "title": "Building a Gaming PC...at Best Buy??",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2021-04-10T18:07:06Z",
    "video_url": "https://www.youtube.com/watch?v=QV6qeIi_Uoc",
    "category": "Science & Technology",
    "tags": [
        "best buy",
        "gaming pc",
        "pc build",
        "gaming computer",
        "gaming pc build",
        "best buy pc",
        "gaming pc best buy",
        "best buy gaming pc",
        "amd",
        "graphics card",
        "gpu",
        "cpu",
        "this is",
        "austin evans"
    ],
    "views": 3546601,
    "likes": 85243,
    "comments_count": 3024,
    "description": "Check out our sponsor Synology to upgrade your storage!  We built a gaming PC at Walmart:  Building a laptop is \"possible\"   My new podcast @TheBackmarkers!  Our second channel @thisis!  My Twitch channel:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://sy.to/b5m8x",
        "https://youtu.be/KWzwX8kZ5bw",
        "https://youtu.be/zjv0RHRfqvE",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today I have a simple challenge to buy every single component I need to build a gaming PC from Best Buy. - [Ken] That'd be better than Walmart and Etsy and Ebay. - You say that now my friend, you say that now. So they definitely have CPUs, we have a 3700x, a 10850k. We can do pretty much anything Intel, or we have a Ryzen 5 3600 or a Ryzen 7 3700x. I actually kind of think we might want to go Intel on this. 'Cause that i5 10400, that's only $160. - [Ken] So are you going for value? - We can build a lot of different kinds of PCs at Best Buy, but the question is what can we actually get our hands on? The hard part is gonna be the graphics card, right? So if we can find a high-end graphics card, we should go for a high end system. My guess though is this gonna be really difficult to find a GPU. Which means that we may wanna go for a more budget option. I'm gonna say, I'm going to throw an i5 in the cart and I'm going to throw a Ryzen five in the cart. And we'll decide on which one we are actually gonna go for. Let's try motherboard. Okay. So we can find a B550 board for $150. That actually looks pretty good. There's a B550 for $94. That actually is a good deal. It's a micro ATX, but that's fine. 94 bucks. Yeah. All right. So let's go AMD with this. Between motherboard and CPU, we're at $294. All right. Should we go for a case? So they have an H510 for $69. - [Ken] Nice. Oh, here we go. a Thermaltake Level 20. That's got three RGB fans. Pre-populated in the front. That actually looks pretty decent. - [Ken] It looks good. - Hundred bucks, sign me up. Let's find 16 gigs of Ram. LPX, 82 bucks. Vengeance. Oh, you can get RGB pro actually. There's actually a fair bit of stuff here though. Although we should get the RGB pro, huh? It's $99. It's only 3200 megahertz, but that's fine. - [Ken] That's actually not a terrible price. I've seen them both below and above that. I think you're actually right on the money. - I'll spend an extra $10 basically to have the RGB. Wait, hang on a second. Get expert advice from a blue shirt. Let's chat. It's a virtual agent. I'm talking with someone. I'm talking with someone. I want to build a gaming PC, but it's gotta be able to play Fortnite. - [Ken] Why? (laughing) - I need to play Fortnite. Let's see if Best Buy can help me. What graphics card should I buy for Fortnite? He hasn't responded though. - [Ken] Nick, God. - Nick, I need my Fortnite graphics card. (laughing) - Wait, should I just look up graphics cards by myself? Do you think that's what Nick is doing? I can just search the word graphics card. - [Ken] Yes. The amount of times I've been into a Best Buy, only to have the Best Buy employee go to bestbuy.com on their phone to look up stock. Unavailable, unavailable, sold out. (shouting in surprise) An RX 580 for $390. - [Ken] Wow. That was retail. - No, I don't even think that was retail. Dude. An RX 580. You could regularly find for less than $200. Oh my God. That's awful. Oh, Nick's typing, Nick's typing, Nick's typing. Nick, hook me up, I need a graphics card right now. I've checked and found the best graphics card. I will help you with the link. Here's the link. Click the link to view. And it is a RX 580 for $390. Nick. - [Ken] He did the same thing. I told you. - Nick, that's so expensive. Is there anything cheaper? That's a lot of money. (laughing) Okay. He found me a 1030. - [Ken] He's predictable too. - Nick, Nick. Wait, apparently I purchased this graphics card in 2017, according to Best Buy. All right. Well Nick, thanks for nothing. So it does show that some of these graphics cards are available in store but they're unavailable here. What I'm going to do right now is I'm gonna purchase all of the components we have in the cart, which is everything we need for the PC build except for the graphics card. We're gonna go to Best Buy in person and see if we can track what we need down. And when we inevitably fail, we are going to spend a lot of money on a really old graphics card instead. Sounds like a plan? - [Ken] Yes. - This video is sponsored by Synology. If you're like me you may have your photos backed up online. Which is great right up until the point where they start charging you for it and imposing caps or worst of all, you lose access to your account. Don't get me started on if you don't have your photos backed up to begin with. That's exactly where Synology NAS solutions come in. With this, there's no subscription fee. You actually own your data as opposed to trusting some cloud everywhere. And on top of that, what's nice about it is that you have easy access to your content not only on your local network, but also via an app. And you have that built-in redundancy with Synology's hybrid RAID. If you have important data, whether it's photos or anything else, you should absolutely have your ownership of that data to make sure that you always have the safe copy. That's exactly where Synology comes in. So definitely be sure to check them out at the link in the description and thank you very much to Synology for sponsoring this portion of the video. (upbeat techno music) (upbeat techno music) (upbeat techno music) (upbeat techno music) Okay, let's see what we're able to get from our friends over at Best Buy. I think it's heavy. We're still building a PC. Don't get me wrong. We have a gaming PC right here, but we're just taking parts out of this to build a gaming PC because that's better than using a GT 710, Am I right? - [Ken] And I'd like to point out that a lot of the things that are listed here on the side that are in this PC are also... - The things that we purchased? - [Ken] Yeah. - It actually gets worse. Some of the components that we ordered from bestbuy.com did not actually arrive. So we're actually gonna end up taking a fair bit from this. It's okay. We'll get to that part later. Let's see what we actually have here. It's gonna be funny when this case is actually nicer than the one we purchased, but I doubt it. - [Ken] That is actually one of the most outdated looking designs, I think I've ever seen in my life. - A little bit. Good news here, they've got actual padded foam inside. So this is what we've been using when we ship out our PC builds recently. It's the heat activated one where you basically pop it, you put it in an expands. It actually does a really good job protecting it. Bunch of emotions here. So we do have a couple of fans on the front. We have a Cooler Master cooler of some variety. Which actually looks to be pretty decent. Of course we have our 580. One thing I'm not a huge fan of is the fact that they definitely shipped us eight gigs of Ram in single channel. That's about the bare minimum that you would want to get away with. You really do want something at least dual channel and a little bit faster, but this is fine. This board is actually better than I had expected though. Dude, hold on a second. This is an 80 plus gold 600 watt EVGA supply. Wait a minute, this is good. To a point where we have other components, right? So in fact, I'll grab some of the other stuff. So we have a 700 watt supply, but it's an 80 plus white. This is not as good as the supply that is in our system. - [Ken] Return it. - We shouldn't use that. Yes, we do have a couple of things. We do have a 500 gig SSD instead of the 240 gig SSD on that. And the two terabyte hard drive. And we certainly have much better memory. We've got 16 gigs of 3600 or 3200. But if you notice there's something missing in our parts bin here, that would be a CPU. They attempted to deliver it. But they tend to deliver here at the office at nine o'clock at night. And when no one was here to sign for it, they brought it back to Best Buy, automatically canceled the order and gave us a refund. With no attempts to redeliver or pickup or anything. It just was immediately canceled when no one was here at nine o'clock at night. Now I think it's time. Let's cut to a montage of us tearing apart a perfectly good system and rebuilding it in a very slightly better way. I've never been so defeated by something that's good news. (upbeat music) And so my friends, we have it. The Best Buy gaming PC special. Inside the system, we have the Ryzen 5 3600, we've got an upgraded B550 motherboard, as well as 16 gigs of Corsair Vengeance RGB memory, two SSDs and a hard drive. 650 watt gold power supply, a very stylish chassis. And what I would argue is a very competently built system. Lots of hard work from us to take apart a CyberPower and rebuild most of it in a new system. Am I right? - [Ken] This is the most first world way to build just an average PC that we could have just bought. - Unless you want to go with that GT 710 that we found that every Best Buy on the West Coast. Then this is actually a reasonable way of going. And let's not forget, we've got eight gigs of VRAM on that RX 580. It might be old, but certainly has some performance. I will now show you what that performance looks like with a handy game of F1 2020. - [Ken] It's kind of crazy how old the RX 580 is. - I know. - [Ken] It's still being sold in pre-built right now. - Dude, so the thing is the reason that the CyberPower PC even exists is because I think CyberPower, at least I was told, CyberPower is actually sitting on a bunch of their old 580s and they're like, \"Oh, we might as well just sell these and get them out of the door.\" But I don't think they had anticipated just how expensive GPUs were really going to be. So the 580 is certainly an older graphics card. But the thing is, especially for games that are not Black Ops, you actually can get pretty decent performance. Especially if you're playing at 1080P, 60 FPS should be pretty doable in most games. Right now I'm playing on ultra high settings, 1080P. We're getting what? 85, 90? No, it's even a hundred frames per second. - [Ken] Hundred frames per second, pretty good. That's like hitting consistent too. - And we're playing at 1080P, 144 hertz monitor with FreeSync. There's a lot that you're getting out of this. All right, next up, we have a game of Valorant. Which really should suit the strengths of this PC nicely. Now, the way we've got the set up, 1080P, pretty much max settings. Look, I am under no illusions that this is going to be a difficult game to play. But Valorant is I think one of the better examples of a game that would make a lot of sense on a system in that $800 price range, theoretically. The 580 has no problem running this at 200 frames per second or so. Let's actually run around a little bit but 260, 270 in well a hallway. - [Ken] So Austin, I have a question. - Go for it. - [Ken] Do you think with how much $800 is getting you right now and probably even more so, with the fact that everything's so jacked up. - Yeah. - [Ken] Is a gaming laptop a better idea? - Should you just buy a gaming laptop? That's actually not a bad idea. It depends. Sometimes gaming laptops can be pretty reasonably priced. I think specifically about the the Asus Zephyrus, the G14. That is a laptop which is about a year old now, but that thing has serious power and it's got a 2060 inside. And you'd be able to easily play it in 1080P settings and then some. Obviously you're always going to be giving up a little bit by using a laptop instead of a desktop. Certainly you don't have the expandability. You're gonna lose a little bit on the CPU side. But generally speaking, that's actually not a crazy idea. Something like a G14, a little over a thousand dollars. I mean, that might be a better move. Although, it sounds fun to build a laptop. Unless you're watching \"This Is\", in which case we build laptops all the time. You're subscribed, right? Haven't you rang a lang the dangling bell. - [Ken] Oh my God. Oh my God, this hurts. This hurts so much. (Austin laughing) - [Ken] How are you getting away with all of those? (Austin laughing) - So should you buy a gaming PC at Best Buy? Maybe. Should you build a gaming PC at Best Buy? Not right now, there's no scenario in which you should try to buy using purely new parts a gaming PC at Best Buy. Maybe if you're able to find a prebuilt and do what we did. But even that, the value proposition gets really sketchy based on what kind of system, what kind of GPU and price you're paying. But thank you very much for watching. Make sure to Ringling that Dingaling a bell. Subscribe to the channel until the next time we try to build a gaming PC at Target. Thank you very much for watching. We're not actually doing that. - [Ken] It's actually not feasible. - You can't do that. - [Ken] You really can't. You just can't.",
    "transcript_keywords": [
        "buy",
        "graphics card",
        "Nick",
        "graphics",
        "gaming",
        "card",
        "build",
        "good",
        "Etsy and Ebay",
        "Walmart and Etsy",
        "pretty",
        "RGB",
        "system",
        "Synology",
        "build a gaming",
        "Ryzen",
        "bit",
        "Fortnite graphics card",
        "simple challenge",
        "find"
    ],
    "transcript_entity_values": [
        "85",
        "Dingaling",
        "1080P",
        "1030",
        "G14",
        "Ken] Nice",
        "first",
        "99",
        "less than $200",
        "94",
        "two",
        "80",
        "Ken] Nick",
        "60",
        "Corsair Vengeance RGB",
        "Black Ops",
        "ATX",
        "69",
        "20",
        "LPX",
        "GT 710",
        "a minute",
        "82 bucks",
        "1080P",
        "GPU",
        "Ram",
        "Ryzen",
        "3200",
        "F1 2020",
        "Valorant",
        "Walmart",
        "Ken",
        "hertz",
        "Austin",
        "Ebay",
        "Best Buy",
        "90",
        "the West Coast",
        "H510",
        "an extra $10",
        "16",
        "500",
        "260",
        "Fortnite",
        "only $160",
        "Target",
        "FPS",
        "only 3200 megahertz",
        "700 watt",
        "270",
        "10400",
        "240",
        "294",
        "Synology",
        "3600",
        "lang",
        "B550",
        "AMD",
        "Nick",
        "a hundred",
        "Synology NAS",
        "800",
        "Ryzen 5 3600",
        "eight",
        "about a year old",
        "RGB",
        "FreeSync",
        "2060",
        "Etsy",
        "94 bucks",
        "580",
        "Fortnite",
        "CyberPower",
        "CPU",
        "390",
        "144",
        "max",
        "One",
        "Ringling",
        "Valorant",
        "2017",
        "three",
        "EVGA",
        "650 watt",
        "3700x",
        "150",
        "- Nick",
        "580s",
        "second",
        "nine o'clock at night",
        "bestbuy.com",
        "five",
        "Intel",
        "200"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "TIME",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "FAC",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "LAW",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.03763837367296219,
        -0.02443762868642807,
        0.025141436606645584,
        -0.030156485736370087,
        0.013147815130650997,
        0.0005382546223700047,
        0.03579308092594147,
        0.046221546828746796,
        -0.05115833133459091,
        0.027593133971095085,
        -0.055191777646541595,
        0.024938717484474182,
        0.015403177589178085,
        -0.007872221991419792,
        0.021584603935480118,
        0.02820112556219101,
        0.07691967487335205,
        -0.04558853432536125,
        -0.028468403965234756,
        0.012928204610943794,
        -0.032413505017757416,
        -0.09964121133089066,
        -0.029338346794247627,
        -0.07010762393474579,
        0.034047044813632965,
        0.10467681288719177,
        0.06647992879152298,
        -2.708833198994398e-05,
        -0.03454378992319107,
        0.01957520842552185,
        0.004483613185584545,
        -0.008458823896944523,
        -0.008839196525514126,
        0.015891531482338905,
        0.030565256252884865,
        -0.01013096608221531,
        0.011241978965699673,
        -0.06059850752353668,
        0.009652792476117611,
        -0.09645726531744003,
        -0.02467786893248558,
        -0.019856728613376617,
        -0.0580899752676487,
        0.05943698436021805,
        0.011325059458613396,
        0.019211098551750183,
        0.01837611384689808,
        -0.04717566817998886,
        -0.008609727025032043,
        0.0017374953022226691,
        -0.07951989024877548,
        -0.045387450605630875,
        -0.009709098376333714,
        -0.07577913999557495,
        -0.10222287476062775,
        0.07900550216436386,
        0.016423916444182396,
        -0.08872388303279877,
        0.006535062566399574,
        -0.017335636541247368,
        0.006593344267457724,
        -0.16803598403930664,
        0.05287042632699013,
        0.020767081528902054,
        0.027081694453954697,
        -0.05023355409502983,
        0.05043896287679672,
        0.014013854786753654,
        0.009037799201905727,
        0.02678740955889225,
        0.05203556269407272,
        -0.02249068021774292,
        0.006421766709536314,
        0.04303702339529991,
        -0.010936908423900604,
        0.0014686804497614503,
        0.08907938003540039,
        -0.08309950679540634,
        0.06899283081293106,
        0.034089963883161545,
        -0.014094329439103603,
        0.02650555595755577,
        -0.00607276102527976,
        -0.059658583253622055,
        0.0032215663231909275,
        0.023276977241039276,
        0.029129158705472946,
        0.07505436986684799,
        -0.0007347046630457044,
        -0.1252543181180954,
        -0.005968705751001835,
        0.019526522606611252,
        0.023084944114089012,
        0.01780877076089382,
        0.06737666577100754,
        0.11141584813594818,
        -0.015138311311602592,
        -0.07409895956516266,
        -0.02192946895956993,
        -0.008842290379106998,
        0.04250846058130264,
        0.002328024245798588,
        0.1213894933462143,
        -0.04065192863345146,
        -0.05591384321451187,
        -0.020054223015904427,
        -0.10886947065591812,
        0.052175719290971756,
        -0.03778818994760513,
        -0.032274823635816574,
        -0.09189324080944061,
        0.03184100240468979,
        -0.011551699601113796,
        0.03801550716161728,
        0.04621492698788643,
        -0.004776660352945328,
        -0.016780266538262367,
        -0.011267110705375671,
        0.07365419715642929,
        0.003450582968071103,
        0.031162967905402184,
        -0.014201109297573566,
        0.01766769215464592,
        0.04114488884806633,
        0.01874944008886814,
        0.018501844257116318,
        -0.1251000016927719,
        1.4979544917719189e-34,
        -0.03307844698429108,
        0.10109688341617584,
        -0.04428361356258392,
        -0.048692721873521805,
        -0.011362336575984955,
        0.0048601701855659485,
        0.06643939763307571,
        0.014776420779526234,
        -0.011006738990545273,
        0.11248928308486938,
        -0.05405883863568306,
        0.0009991645347326994,
        -0.029459502547979355,
        0.08638081699609756,
        0.08351876586675644,
        -0.04348919913172722,
        0.009454579092562199,
        -0.0159673523157835,
        -0.007761506829410791,
        -0.014942394569516182,
        0.030489908531308174,
        -0.012071508914232254,
        0.04414491355419159,
        -0.04723254218697548,
        0.030628062784671783,
        -0.095488540828228,
        -0.02241988480091095,
        -0.036638546735048294,
        0.03807640075683594,
        -0.008662531152367592,
        -0.045119836926460266,
        -0.09707040339708328,
        -0.04448702186346054,
        -0.0039087641052901745,
        0.011328834109008312,
        -0.05275696516036987,
        -0.022888435050845146,
        -0.0604141466319561,
        0.002054151613265276,
        0.002551531884819269,
        -0.0468180850148201,
        0.14853733777999878,
        -0.09001883864402771,
        -0.05680029094219208,
        -0.03495129570364952,
        0.08326074481010437,
        -0.007085207849740982,
        0.02167481556534767,
        -0.07149019837379456,
        -0.024263454601168633,
        -0.09264793246984482,
        0.03437838330864906,
        0.04856603965163231,
        -0.013994233682751656,
        -0.01758969947695732,
        -0.05286865681409836,
        0.07996019721031189,
        -0.025845225900411606,
        0.12798666954040527,
        0.08311823755502701,
        -0.03714689239859581,
        -0.023372750729322433,
        -0.03787993639707565,
        0.030091674998402596,
        -0.08608176559209824,
        0.04782450199127197,
        0.07734173536300659,
        0.08766645938158035,
        -0.039941683411598206,
        0.0281294584274292,
        0.056621089577674866,
        -0.05542079731822014,
        0.03498707339167595,
        -0.05466961860656738,
        0.07607027143239975,
        0.05327488109469414,
        -0.10243397951126099,
        0.028988437727093697,
        -0.03854401409626007,
        -0.010613547638058662,
        -0.035402972251176834,
        0.05856553465127945,
        -0.05920829623937607,
        0.04376337304711342,
        0.009105673991143703,
        0.06053479015827179,
        -0.035335473716259,
        -0.017621872946619987,
        0.005258905701339245,
        -0.03422333300113678,
        -0.04992060735821724,
        0.0241882111877203,
        0.033528584986925125,
        -0.011034421622753143,
        0.019265899434685707,
        -1.962333167722279e-33,
        -0.024285268038511276,
        -0.030943002551794052,
        0.004312263336032629,
        0.10749684274196625,
        0.028489965945482254,
        -0.006907165050506592,
        0.012270049192011356,
        -0.0887492373585701,
        0.02579621598124504,
        -0.001604457967914641,
        -0.012458260171115398,
        0.009802058339118958,
        0.03571070730686188,
        -0.004401173442602158,
        -0.05196541175246239,
        -0.01053865160793066,
        -0.02823212370276451,
        -0.06726327538490295,
        0.11407627165317535,
        -0.07691847532987595,
        0.00797289703041315,
        0.03596129268407822,
        -0.05456626042723656,
        0.02402978204190731,
        0.036184508353471756,
        0.022616315633058548,
        -0.015276025980710983,
        -0.05733644217252731,
        0.02464795857667923,
        0.03499758243560791,
        -0.020073125138878822,
        -0.08536604046821594,
        0.07569301873445511,
        0.07333854585886002,
        0.06996478140354156,
        -0.012271156534552574,
        0.060810916125774384,
        -0.012191032990813255,
        0.00409596785902977,
        0.03277904540300369,
        0.06920788437128067,
        0.0046392870135605335,
        -0.017491698265075684,
        0.017059998586773872,
        -0.003852319438010454,
        0.01349683292210102,
        -0.01253922376781702,
        -0.042233288288116455,
        0.09919088333845139,
        -0.0516766756772995,
        0.010877360589802265,
        -0.022749776020646095,
        0.059884991496801376,
        -0.0695483535528183,
        -0.06829454004764557,
        -0.05369168892502785,
        0.010255360044538975,
        0.048923589289188385,
        0.05293405428528786,
        -0.07032882422208786,
        0.029713859781622887,
        -0.022956574335694313,
        0.03566628322005272,
        0.004356723744422197,
        0.010495319962501526,
        -0.009540211409330368,
        0.05369669198989868,
        0.023176344111561775,
        -0.03085247054696083,
        -0.10358831286430359,
        -0.11141911149024963,
        -0.05790742114186287,
        0.03551766648888588,
        -0.028112806379795074,
        -0.04515691101551056,
        0.060235463082790375,
        0.05113399028778076,
        -0.013742243871092796,
        0.07711642980575562,
        -0.04067375510931015,
        -0.014485503546893597,
        -0.03594786301255226,
        0.0011581025319173932,
        -0.02021000348031521,
        0.056691478937864304,
        -0.04229538515210152,
        -0.0008570154313929379,
        -0.021921144798398018,
        -0.0468909926712513,
        -0.09758462011814117,
        -0.02820129320025444,
        0.03882293403148651,
        -0.0164817925542593,
        0.003968899603933096,
        -5.3747753554489464e-05,
        -4.6970860978490236e-08,
        0.0710693970322609,
        -0.07648000866174698,
        -0.04309022054076195,
        0.051719781011343,
        -0.006513369269669056,
        -0.05930473655462265,
        0.03965838998556137,
        -0.002695054979994893,
        0.12659712135791779,
        0.05861251801252365,
        0.04652980715036392,
        -0.0815652459859848,
        -0.019781677052378654,
        0.04524374008178711,
        -0.022294577211141586,
        0.03160380199551582,
        -0.024309072643518448,
        0.06311315298080444,
        -0.0007123560644686222,
        -0.03896941989660263,
        -0.011803857050836086,
        0.053360141813755035,
        0.10191021859645844,
        -0.010098135098814964,
        -0.0596688836812973,
        -0.006405448541045189,
        -0.005724268965423107,
        -0.0355486124753952,
        0.027928698807954788,
        0.028305118903517723,
        -0.039525654166936874,
        -0.02888515591621399,
        0.05677178129553795,
        -0.026497360318899155,
        0.08717994391918182,
        -0.10054478049278259,
        -0.016155961900949478,
        0.07961437851190567,
        0.11663459986448288,
        0.0159063171595335,
        -0.06927572935819626,
        -0.10334030538797379,
        -0.02155209705233574,
        -0.02960447035729885,
        0.040005866438150406,
        -0.037841130048036575,
        -0.13524456322193146,
        -0.09388524293899536,
        -0.01469247043132782,
        0.026349807158112526,
        -0.0001238560798810795,
        0.0028164756949990988,
        0.033926822245121,
        0.043197669088840485,
        0.054354775696992874,
        0.018795719370245934,
        -0.03414284810423851,
        0.049345653504133224,
        0.06174752861261368,
        -0.0073783500120043755,
        0.06031697243452072,
        -0.08710403740406036,
        -0.017916284501552582,
        0.021762458607554436
    ]
}