{
    "id": "qxDDBOKDpb0",
    "title": "M1 iPad Pro (2021) review: dream screen",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-05-19T13:00:18Z",
    "video_url": "https://www.youtube.com/watch?v=qxDDBOKDpb0",
    "category": "Science & Technology",
    "tags": [
        "ipad pro",
        "new ipad",
        "ipad",
        "pro",
        "ipad pro 2021",
        "m1 ipad pro",
        "2021 ipad pro",
        "apple",
        "apple iPad Pro",
        "new ipad pro",
        "new iPad Pro 2021",
        "apple iPad Pro 2021",
        "m1 iPad Pro",
        "2021 iPad Pro",
        "m1 chip",
        "apple m1 chip",
        "apple m1",
        "apple tv",
        "imac",
        "new imac",
        "m1 imac",
        "imac 2021",
        "iphone",
        "iphone 12",
        "iphone 12 pro max",
        "air tags",
        "airtags",
        "apple airtag",
        "air pods",
        "airpods",
        "air pods pro",
        "airpods 2",
        "dieter bohn",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 784932,
    "likes": 17493,
    "comments_count": 868,
    "description": "The all-new 2021 iPad Pro has Apple's latest M1 processor, originally designed for the MacBook Air. The 12.9-inch version also has an incredible Mini LED screen, making it the best thing for watching movies that isn't a TV. But for all that, is it still an iPad? Dieter Bohn reviews.  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the 2021 iPad Pro here: Best Buy:  Amazon:   Read more:    Watch our review on the new iMac:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3uYyWEA",
        "https://amzn.to/3yjW2aX",
        "https://bit.ly/3otEIeV",
        "https://bit.ly/33Zr8Xa",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(ambient music) - This is the new iPad pro 12.9. And here is the 11 inch model. Plus we've got the new white magic keyboard accessories. Now, despite the fact that both of these iPads have M1 processors that were originally put inside Mac computers, I'm here to tell you that this thing right here, it's an iPad. And so is this one. So let's review 'em. (relaxed lo-fi music) The 12.9 inch iPad pro starts at $1099 which is $100 more than last year's version but there's a good reason for that. But that only gets you 128GBS of storage, and I think if you're already spending that much money you should probably spring for a little bit more. The 11 inch version starts at $799 and same deal. It's 128GBS of storage and I think that you're spending that much money, you might as well get more. And of course, if you're going to get all those you might want to get the keyboard too, the magic keyboard here with the track pad is $300 or $350 depending on which size you get. You can also spend more for 5G or get an Apple Pencil. They're expensive, even compared to some powerful laptops and there's no getting around that. (soft electronic music) There are really only two things that you need to know about these new iPad pros. The first is that they have that M1 processor and that is important because it's supposed to enable a bunch of new features and functionality inside these iPads. But before we go any further, no, the M1 chip does not mean that you can run Mac apps on these iPads, even though it is the exact same processor as in the new iMac, the new MacBook Pro, the new MacBook Air, and the new Mac Mini. And I have some thoughts on all of that, but actually mostly they're really emotions, but I'm a good Minnesotan so I'm going to bury those emotions deep down and I'm not going to talk about them until they explode out in a fit of rage which is probably going to happen a little bit later in this video. M1 we're going to talk about in a minute. The second thing that you need to know is that the big iPad with its 12.9 inch screen has an all new kind of screen. Apple calls it the Liquid Retina XDR display. But what that actually means is that they're using a new kind of screen technology here: Mini LED. (soft ambient music) Let's talk screens. Display pixels show colors by combining red, green, and blue but they need to be lit up so that you can see them. Different screen technologies use different ways to light up all of those pixels. LCD panels have a big backlight behind all of them to evenly light everything. Although some of the more advanced ones do have a few different panels to enable a little bit of local dimming. Now, OLED screens, they have pixels that are self lit. So there's no need for a separate backlight, which is very cool because you get perfect blacks, but it's also very expensive and it comes with other limitations like the longevity of the screen, you know, for years and years. Mini LED puts lights behind the screen like LCD but it has way, way more of them. The new iPad Pro 12.9 has 10,000 tiny LEDs back there. Yeah, they're split up into 2,500 local dimming zones which is about 30 zones per square inch. It's enough. All of this tech is in service of just one thing: not lighting up pixels that are supposed to be black. That means it has a very high contrast ratio and blacks look, well, truly black. On regular LCDs, including on this 11 inch iPad Pro, the blacks are just kind of a dark gray. So with the 12.9 inch iPad Pro, part of what that extra $100 that you're paying for for this year's version is an amazing screen. But at first, when I was just using this iPad as an iPad I didn't really know if I thought Apple delivered here. When you're just using the iPad to do iPad stuff, you know, edit documents, browse, whatever, whatever, it looks pretty normal. It maxes out at 600 nits of brightness which ain't all that special. Colors are accurate and all, but yeah, it just seemed like an iPad. But then when you open up something with proper HDR, it's \"POW!\" like original Batman show, \"BAP!\" \"BAM!\" \"POW!\" It is legit. You don't see it until you see it and then you SEE it. When the iPad Pro jumps into HDR for videos and photos the max brightness for the whole screen jumps up to 1,000 and individual points of light can hit up to 1,600 nits. That is very bright. And since the blacks are truly black, well it basically looks like an OLED screen to me. But look, maybe you don't get into the whole picture quality thing and TV nerds that talk about contrast ratio and calibrating their OLEDs just make you (groans) I get it. There are other benefits to this screen that are just harder to explain and I definitely can't really show them to you here on video. Colors look better to me on this screen because of that contrast ratio especially when there's like yellows with a lot of texture. The fact that the darker parts are actually darker makes the whole thing just look more accurate and sharper, richer and better. I love this screen, but it's not perfect. Anytime you're trying to light up individual pixels, or in this case, have 2,500 local dimming zones, some of the light is going to bleed out a little around the pixel. It's going to bloom. So, if you run a test that bounces a white square dot around the screen, you can see the blooming. But to me, this is no big deal. I mean, I don't know, how often are you gonna be playing Pong on your iPad Pro. I did run into one weird issue though. Reading eBooks in Kindle or the Apple books app in dark mode, there's just this wild like, gray pillow underneath the text, it's much more than blooming. It's more like the software algorithm for the dimming zone somehow went haywire. I really hope this gets fixed. I don't know if Apple needs to do it, or Kindle, or the books app or what, because having true deep blacks meas that if you're using this to read in bed in dark mode there are just fewer pixels lit up shining in your eyes. But look, movies are so good on this screen. That \"Tenet\" actually made perfect sense to me when I watched it on this iPad. It is that good. Nothing's that good. This is a very good screen though, I promise. (ambient music) Okay well, let's finally talk about that M1 processor, which, again, is on this big one here but it's also on the smaller 11 inch iPad Pro. What does it really mean that a processor from a Mac is inside an iPad? Well, I mean, I guess it means that Apple is going to tell us how much RAM is inside these iPads now. So that's neat, but otherwise the question is: Does it really change the iPad experience in any significant way? So here's an example. The M1 means that these things can now support Thunderbolt accessories, but that experience is still pretty iPad-ie. I plugged it into my Thunderbolt dock and that worked but it didn't seem to want to pick up the microphone that I had plugged into the dock for reasons. And, since the iPad doesn't give you any real system-level control over things like audio I couldn't get any sound out of it 'cause I don't have speakers plugged into my dock and it wouldn't let me switch the audio back to the iPad speakers. I couldn't just change it to do what I wanted it to do. It did light up my monitor, which is very cool. But, when you plug an iPad into a monitor it just mirrors the iPad. I also had a hard time getting it to recognize this, admittedly, pretty old LaCie Thunderbolt drive. So, your mileage may vary with compatibility. Okay, The M1 is much faster, but whether or not you're actually going to experience any of that quickness totally depends on what apps you use. So for example, Apple says that LumaFusion can run six streams of 4K HDR. That's cool. But for me doing an Adobe Premier rush export on this 2021 M1 iPad, I got the exact same speed is what I got on my 2018, 11 inch iPad Pro. Apple is doing one nice thing with the increased power here. The front facing cameras automatically follow and zoom in on faces. And it works really well. And it also works in any video conferencing app, including Zoom. So, that's very cool, but (sighs) of course the cameras are still in the wrong place over here on the side so you look like you're staring off to the right most of the time. And that juxtaposition, it is still the story of the iPad Pro. It does amazing stuff but you still hit that weird wall of iPad limitations when you start really trying to push it. (calm music) Okay. Emotions. I get, and I think I agree with Apple's reasoning for not wanting to put Mac apps on the iPad. That is fine. Let the Mac be the place that does everything and let you fiddle with anything and let the iPad be simpler. But what that means is that Apple is kind of recreating every single trope in computer land in the iPad way from files, to external monitor support, to multi window. Apple has basically committed itself to re-inventing computer wheels for the iPad. And that is kind of cool. Sometimes they make some pretty neat wheels, but it's all moving way, way too slowly. And again, you should never buy a thing today based on the promise of a software update tomorrow, or at the next WWDC. The Files app can't do basic things like tell you how big a folder is and with the Epic versus Apple trial going on right now I just have to say it: You can install it pretty much any software you want on a Mac, but on the iPad you've got to use the App Store. And don't get me started on the fact that Apple refuses to offer multi-user support on the iPad. So sharing this with somebody else in your family is a huge hassle. Now, look, I love this computer but I have to be realistic here. A 256GB, 12.9 inch iPad Pro with a magic keyboard costs $1,548. A MacBook air with the same storage and the exact same processor is $999. And it weighs less, and battery life on the MacBook Air is maybe slightly better if you're using these things all day for work. On this machine, if I'm in a ton of Zoom calls and I have the screen brightness set relatively high, if I use it all out for Slack and web browsing and everything else, it'll clock out after eight hours or so of use. Of course, if you use it less rigorously it can last much longer, but yeah, battery life is about the same as an Air. So what that 550 bucks gets you is this touch screen and nicer hardware all around. Really great cameras, much better speakers. And so on. Plus you get this incredible screen. It is the best thing for watching movies that isn't attached to a wall. Those are all perfectly good reasons to spend more money to get the iPad Pro and it can do some amazing feats of computing. But as I use this thing, this very beautiful object every day, and as I run into its limitations, I can't help but think about the M1 processor that's inside it and what I know the M1 processor can do on a Mac. I've been saying the same things about the iPad and the iPad Pros for years now. And they're still true. If you need a new iPad and you're willing to spend the money on getting the very best iPad, this is the very best iPad. Just remember that it's an iPad. All right, thanks for watching. Is this screen enough to (inaudible) (slams computer) All right, thanks for watching. Is this screen enough to convince you get an iPad Pro? Discuss. Also, there's a lot going on this week, Google I/O is happening, Monica Chin just reviewed the new iMac. You should definitely go watch that video and you should click subscribe on her video! Or on this video, either one, both!",
    "transcript_keywords": [
        "iPad pro",
        "inch iPad pro",
        "iPad",
        "pro",
        "screen",
        "inch iPad",
        "Apple",
        "iPad pros",
        "Mac",
        "inch",
        "iPad pro starts",
        "thing",
        "iPads",
        "iPad Pro jumps",
        "things",
        "processor",
        "good",
        "Mac apps",
        "pixels",
        "light"
    ],
    "transcript_entity_values": [
        "1099",
        "M1",
        "the next WWDC",
        "about 30",
        "12.9 inch",
        "LCD",
        "up to 1,600",
        "this week",
        "one",
        "Mac",
        "Apple",
        "1,548",
        "the MacBook Air",
        "the iPad Pros",
        "999",
        "iMac",
        "2,500",
        "12.9",
        "LumaFusion",
        "Slack",
        "today",
        "Minnesotan",
        "Batman",
        "Pong on your",
        "the App Store",
        "year",
        "six",
        "5",
        "a white square",
        "the iPad Pro",
        "iPad Pro",
        "MacBook Pro",
        "300",
        "iPad",
        "years",
        "10,000",
        "MacBook",
        "Thunderbolt",
        "iPads",
        "MacBook Air",
        "Adobe",
        "11 inch",
        "the iPad Pro",
        "Mac Mini",
        "iPad Pro",
        "BAP",
        "100",
        "LaCie Thunderbolt",
        "256",
        "550 bucks",
        "350",
        "4",
        "a ton",
        "eight hours",
        "Monica Chin",
        "second",
        "2018",
        "iPad Pro 12.9",
        "first",
        "600",
        "Mac",
        "128GBS",
        "799",
        "1,000",
        "Kindle",
        "last year's",
        "tomorrow",
        "max",
        "2021",
        "Kindle"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "FAC",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "FAC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PERSON",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.02550046145915985,
        -0.07943614572286606,
        0.005375170148909092,
        -0.08335085958242416,
        0.07703981548547745,
        -0.014096979051828384,
        -0.06377014517784119,
        0.0018219106132164598,
        0.044940099120140076,
        0.05562429875135422,
        0.08796465396881104,
        0.10555077344179153,
        -0.04581291601061821,
        -0.014315169304609299,
        0.04789557680487633,
        -0.014350739307701588,
        0.09678058326244354,
        -0.09243135154247284,
        -0.013754592277109623,
        -0.0020807934924960136,
        -0.06881409883499146,
        -0.006163188721984625,
        0.045440562069416046,
        0.008235746994614601,
        0.0031666778959333897,
        0.00030837845406495035,
        0.02387838251888752,
        -0.007659986615180969,
        -0.054946474730968475,
        0.019142962992191315,
        0.003325823461636901,
        0.027026580646634102,
        0.0008749985136091709,
        0.030406873673200607,
        -0.04434420168399811,
        -0.07351593673229218,
        0.052736442536115646,
        -0.03940720856189728,
        -0.0746641755104065,
        -0.1343376785516739,
        -0.06137778237462044,
        -0.05957122519612312,
        0.009423644281923771,
        0.034233223646879196,
        0.047505635768175125,
        -0.019553011283278465,
        -0.009627516381442547,
        -0.13022886216640472,
        -0.014946532435715199,
        -0.00044827497913502157,
        -0.01120828278362751,
        -0.06260665506124496,
        -0.005783145781606436,
        -0.012529700994491577,
        -0.009600639343261719,
        -0.02084454335272312,
        0.01079055480659008,
        -0.0020045889541506767,
        0.08458926528692245,
        0.04059441387653351,
        -0.006263041403144598,
        -0.06796439737081528,
        0.05150764808058739,
        0.026532743126153946,
        0.029442936182022095,
        -0.0029485695995390415,
        0.014157638885080814,
        -0.05817433074116707,
        0.016427775844931602,
        -0.09351992607116699,
        0.010214362293481827,
        -0.04129333421587944,
        0.08413013070821762,
        -0.008822128176689148,
        -0.004077589605003595,
        0.0013294232776388526,
        0.012898793444037437,
        -0.034329336136579514,
        -0.013237690553069115,
        -0.04316725209355354,
        0.04562297835946083,
        0.040197793394327164,
        -0.0023770583793520927,
        -0.029722845181822777,
        0.019107403233647346,
        -0.026651432737708092,
        0.021109264343976974,
        0.012321164831519127,
        -0.03717295452952385,
        -0.00721751106902957,
        0.005744303110986948,
        0.07025822252035141,
        -0.032169803977012634,
        0.04086950421333313,
        0.05174901708960533,
        -0.06099487841129303,
        0.0047190748155117035,
        -0.06718963384628296,
        -0.07312935590744019,
        0.020847709849476814,
        0.03919510915875435,
        0.04739372804760933,
        0.06079789996147156,
        -0.04671173915266991,
        -0.032697755843400955,
        -0.049947332590818405,
        0.0865832194685936,
        0.0067034089006483555,
        0.018203385174274445,
        0.03565559163689613,
        0.08431273698806763,
        0.010941196233034134,
        -0.061335351318120956,
        -0.004418850876390934,
        0.08162302523851395,
        -0.039338186383247375,
        0.007161695510149002,
        0.045227374881505966,
        0.15219958126544952,
        0.04782230034470558,
        -0.047826725989580154,
        0.06909450888633728,
        -0.03181219846010208,
        -0.05867514759302139,
        -0.06614226847887039,
        0.035861317068338394,
        -0.0775851160287857,
        1.8796224464625457e-33,
        -0.03076472505927086,
        0.07350200414657593,
        -0.08466563373804092,
        -0.059542715549468994,
        0.07840698212385178,
        -0.04879969730973244,
        0.029162688180804253,
        0.08728645741939545,
        0.011286958120763302,
        -0.03986625373363495,
        -0.015218663960695267,
        -0.020337658002972603,
        -0.09866906702518463,
        0.012312255799770355,
        0.026015523821115494,
        -0.12934519350528717,
        -0.007929516024887562,
        0.0277737844735384,
        -0.047879111021757126,
        -0.006431180983781815,
        -0.01868239976465702,
        -0.025554109364748,
        0.017261218279600143,
        -0.044363413006067276,
        0.02452808804810047,
        0.019356518983840942,
        0.002107972512021661,
        0.02792072482407093,
        0.035822544246912,
        0.02141311578452587,
        -0.10594239085912704,
        -0.024618396535515785,
        -0.05336736887693405,
        -0.097491554915905,
        -0.03648509457707405,
        -0.05365423485636711,
        0.007167784497141838,
        -0.0972379744052887,
        0.053427744656801224,
        -0.06849142163991928,
        -0.11020279675722122,
        0.03602621331810951,
        -0.08065848797559738,
        -0.037441499531269073,
        0.03908676281571388,
        0.06019493192434311,
        0.043028999119997025,
        0.06495079398155212,
        0.03513217344880104,
        -0.048530783504247665,
        -0.05982652306556702,
        -0.025932077318429947,
        -0.006753798108547926,
        -0.06848501414060593,
        -0.03951697796583176,
        -0.0478854738175869,
        -0.00186002382542938,
        -0.004808973986655474,
        0.13285870850086212,
        0.03354226425290108,
        0.013392438180744648,
        0.05894433706998825,
        -0.04134165495634079,
        0.04881612956523895,
        -0.07339940220117569,
        0.06643309444189072,
        0.05008099228143692,
        0.06421181559562683,
        -0.007596187759190798,
        0.01093888096511364,
        -0.040340013802051544,
        0.000705334881786257,
        0.021296866238117218,
        -0.005612834822386503,
        0.010692008771002293,
        -0.00898938812315464,
        -0.019757794216275215,
        -0.03201206773519516,
        -0.04139101877808571,
        0.0049816519021987915,
        0.001640500733628869,
        0.09175392985343933,
        -0.00491095706820488,
        0.05348801612854004,
        -0.08537061512470245,
        0.05805683135986328,
        -0.00428804662078619,
        -0.049202144145965576,
        0.006989343091845512,
        -0.004590306431055069,
        0.003079534275457263,
        -0.0012230499414727092,
        0.0030370685271918774,
        0.04602291062474251,
        -0.03610968217253685,
        -2.7334721555410848e-33,
        0.010266441851854324,
        -0.026446431875228882,
        -0.09466001391410828,
        -0.019842229783535004,
        -0.02282736636698246,
        -0.045760221779346466,
        0.0479607917368412,
        -0.01213501300662756,
        -0.0006960563478060067,
        -0.05412369221448898,
        0.04157499596476555,
        0.0069654351100325584,
        -0.004282593727111816,
        -0.03057248331606388,
        0.00939312856644392,
        -0.017467208206653595,
        -0.08182044327259064,
        -0.05332108587026596,
        0.0978352352976799,
        -0.024551015347242355,
        0.10652714222669601,
        0.04053196683526039,
        0.011366554535925388,
        -0.05059374123811722,
        0.028368787840008736,
        0.011907744221389294,
        0.0318484790623188,
        0.06172303482890129,
        0.020228656008839607,
        -0.0068299113772809505,
        0.047816403210163116,
        -0.007060705684125423,
        -0.0022091709543019533,
        0.04315926507115364,
        0.042634833604097366,
        0.02816246822476387,
        0.03988824784755707,
        -0.07643822580575943,
        -0.056997593492269516,
        0.010178009048104286,
        0.062345076352357864,
        0.04330337047576904,
        0.011794773861765862,
        -0.021716751158237457,
        -0.040533628314733505,
        0.05766763165593147,
        0.03541392832994461,
        0.0260593481361866,
        0.03860526904463768,
        -0.09833801537752151,
        -0.005045899655669928,
        0.052277062088251114,
        -0.07695873826742172,
        -0.06875459104776382,
        -0.08924833685159683,
        -0.05004820600152016,
        -0.021858597174286842,
        0.04220587760210037,
        -0.0159175843000412,
        0.017832322046160698,
        0.04333839565515518,
        0.025357000529766083,
        0.004872122313827276,
        -0.0750732496380806,
        0.002279178472235799,
        0.06542181223630905,
        0.01394346822053194,
        0.018098749220371246,
        -0.000640697602648288,
        0.0451648123562336,
        -0.002434771740809083,
        -0.022161109372973442,
        -0.009356011636555195,
        -0.07129085063934326,
        -0.017114218324422836,
        0.12195337563753128,
        0.08067046105861664,
        -0.057598136365413666,
        -0.020598173141479492,
        -0.03398100659251213,
        0.04042337089776993,
        0.012012293562293053,
        0.03928983211517334,
        0.037506528198719025,
        0.04772011563181877,
        0.02316613681614399,
        0.004817423410713673,
        0.005999399349093437,
        -0.0829516351222992,
        0.09984958916902542,
        -0.026138894259929657,
        -0.015254664234817028,
        -0.04707109555602074,
        0.042594894766807556,
        -0.005837376695126295,
        -5.256347535009809e-08,
        0.0022245715372264385,
        0.048976097255945206,
        0.07498009502887726,
        0.015218948014080524,
        0.02890288084745407,
        -0.06371228396892548,
        0.05377664789557457,
        -0.010829356499016285,
        0.13064461946487427,
        0.021739650517702103,
        -0.02967654913663864,
        -0.13276492059230804,
        -0.06645562499761581,
        0.03733048215508461,
        0.01997341960668564,
        0.09221939742565155,
        -0.05978049710392952,
        0.029498020187020302,
        -4.353741314844228e-05,
        -0.05400128662586212,
        0.012631227262318134,
        0.016124723479151726,
        0.01087734755128622,
        -0.07194661349058151,
        -0.026955675333738327,
        0.00582491047680378,
        -0.0808325931429863,
        0.0335959829390049,
        0.04810482636094093,
        0.006721633020788431,
        -0.0446510873734951,
        -0.005214505363255739,
        0.05523746460676193,
        -0.06821651011705399,
        0.03949536755681038,
        -0.08339914679527283,
        -0.016038980334997177,
        0.062071580439805984,
        0.027630005031824112,
        -0.0027229974512010813,
        -0.0078057777136564255,
        -0.14755015075206757,
        -0.04081284999847412,
        -0.01437469944357872,
        -0.01741238683462143,
        -0.0062164803966879845,
        -0.0448802225291729,
        -0.06049126759171486,
        -0.031093215569853783,
        0.13514815270900726,
        0.08672292530536652,
        -0.016132233664393425,
        0.08073624223470688,
        0.06209276244044304,
        0.04508679360151291,
        0.008917954750359058,
        0.03269871696829796,
        -0.023508721962571144,
        -0.04532516002655029,
        0.04927058890461922,
        0.15614891052246094,
        -0.05988670885562897,
        0.03746034950017929,
        0.09492015838623047
    ]
}