{
    "id": "r-RRWT0d9xc",
    "title": "The TINEST Action Camera just got better! Insta360 Go 3 Unboxing + Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-06-27T13:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=r-RRWT0d9xc",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 138977,
    "likes": 4409,
    "comments_count": 206,
    "description": "Click the link here:  to check out the new @insta360 Go 3! #Insta360Partner #insta360  #Insta360GO3   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://www.insta360.com/sal/go-3?insrc=INR9M2I",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- This is the smallest and cutest little action camera ever. The new Insta 360 Go 3. Over the last two years, this has been one of my favorite little cameras, but there's been like small things with each generation that I'm like, man, I really wish they would do this or I wish they would do that. And now with this version, they've actually added some surprises that I didn't even know that I wanted. Let's check it out. So we've got a couple of things to unbox here. We've got the actual camera itself. We've got a little monkey tail mount, a quick release mount, and a mini two in one tripod. I love how many different accessories that they have. This makes it so much more fun and versatile when you're out filming and shooting. You just got all the right little things that you might need. Look at it. It is so tiny. It is still magnetic but it's also got these little quick release sides on it, so it'll actually attach to the mounts. So it's way more secure, which is definitely a problem that I had in the past. The magnet is pretty strong, but if you're doing, you know, action sports and you're really getting into the action, you really do want this to be attached. Okay, we've got our camera, we've got our user guide, which actually I know I always like throw out directions but I'm gonna, I'm gonna set this aside because this may be useful. Oh, and we've got all of our mounts here. I love the smell of new technology. My goodness, that smells delicious. So this is so awesome. This basically will turn this into like a traditional kind of action camera, but what's really awesome about it, it will be able to wirelessly transmit the video to the screen. So I can have this off to the side. I could be filming and somebody else could be kind of monitoring it. Okay, let's keep that in there. Get that all charged up. We've got some mounts in here. So this is like your traditional kind of tripod mounts. This is the little quick release. Oh, that's, it's also magnetic. Look at that. It's magnetic. But to release it, you do have to push those little buttons on the side. I also really like this mount because this will give you all sorts of different angles. Look at that. So good. And the bottom of this is a little sticky mount so I'm not gonna take it off now. But this is cool because this'll let you kind of attach this to anything really. It does say to, please make sure the surface is clean before applying sticky pad. And there's a little cover for it too. This is the little hat clip. So this you would clip to your hats. Wow, that's really in there. That's great. Like you have to push this little button here to unlock it so it's not gonna fall out or anything. So this is the little hat mount. This is magnetic. This doesn't have any extra little clasps in it but for the most part, this has been so fun to test out. I loved putting this on my hat while I was out in Hawaii doing hikes. This though was one of my favorite accessories. It's a magnetic necklace mount, and they added this in so that you can wrap the cable up inside of it. It was just so nice because this little cord would always get stuck in things whenever I would have it in my travel bag. So now this just will completely fold itself up inside or you can unravel it. (magnet clicks) Magnetic. Ooh, that feels, that feels actually stronger than the other one. That's very strong. Here we go. This is how I like to wear it. (magnet clicks) Like, so cool. This right here is also pretty cool. This is a new addition to the Gen 3. This is a little wedge that you can attach to the necklace and this will let you get a different angle because before when you have this attached, you would only be getting a straight view. But now this will allow you to get like a downward angle, an upward angle, and you can change the view slightly with the little wedge. Nice little addition. Oh my goodness, I have so many things and we're not even done yet. We've got the mini two in one tripod. Little tiny. Oh, that extends actually more than I thought it would. Cute. We've got a nice little quick release mount. I have shredded this box. Absolutely shredded it. This is why I'm excited because this has a built-in little tripod mount. So you'll be able to quickly attach this little mount to the bottom or even to your action camera and this will give you quick access to be able to mount it or even attach it to just a regular traditional tripod. Next, we've got a monkey tail mount. I've actually never used one of these before but it looks cool. This is probably heavier than everything that I just unboxed in this entire thing. This is cool. Like I could wrap this around my arm. So, even thinking like an easy top-down camera. Definitely gonna be trying this out. I'll take a closer look at this little camera. I'm obsessed with this little enclosure. Like they made it so much more useful because now not only will this charge it but you can use it as a separate viewer. So, I guess let's turn this on and get it set up. Here's how we switch between shooting modes and if I slide the edge of the screen, I can get my settings. This is great because before you really couldn't see what you were filming. I'm recording. Oh my gosh, this is my first video. Hello, hello. Hi, peace and love, peace and love. Okay, bye. So here it is. This is the smallest and cutest little action camera ever. It is so lightweight and it has this incredible magnetic mounting system that lets you attach it to all sorts of accessories. This lets you get all sorts of shots that you'd never be able to get with anything else. It shoots at 2.7 K. It has up to 173 minutes of battery life with this new action pod. It has the ever so popular flow state stabilization to keep everything looking super smooth. 360 horizon lock. The camera is waterproof up to five meters. It's got voice control and AI editing. There's a lot of fun modes that you can shoot in, like time shift, slow motion, time lapse, timed capture, and pure shot HDR photo. There's three different versions that you can purchase depending upon the capacity of storage on the camera. I'm out on my first test with the Insta 360 Go 3. I'm excited. I'm just gonna sort of take some photos and some videos and see how it works on my walk slash run. We'll see if I get to the running but I gotta do it for the testing. I've got my hat mount, I've also got the necklace mount so I'm excited to try that out. This is something that I used so much on hikes on my previous version when I'd be climbing rocks and doing things that I had to be hands free. It's the necklace chest mount. (mellow music) Hello, little donkey. Hi honey. Hello. Sorry, I don't have any snacks for you. Look at that. Look at you. You're so cool. Okay, bye. (mellow music continues) Okay, I just found a hole and this is a huge hole. Look at this. I'm just put you guys in there. What do you guys see? You guys see anything? I mean, this is like right in the middle of the road. Is somebody gonna fix this? I don't think they are. We have got hat mode engaged. Now, I feel like this might be the mode that I use more often, kind of being able to see in front of me and then when I look down I can see my feet. The other frame that I tried out was flipping it super close to my face. So it basically was just like it, this is what it looked like. I feel like the train guy on TikTok. Have you ever seen him, he's always like running to get to the trains and he's always so happy. Huge fan. I'm not sure if this is a mode that I would like. And there's also another when I, well, I guess it depends on my outfit. I need a t-shirt for this one. Now the other cool thing is this can actually be used as remote control. So, I can remote view what this is seeing. So, if I do have this on my head and I wanna make sure that it's framed upright or I wanna switch to photo mode, I can do all of those things right here and it makes it super simple. One of the things that I like is if you don't wanna bring this case around, you don't have to. You can just bring the little tiny inside camera. The case just is an added bonus to give you extended battery life and a viewer. So you don't have to have it, but it is nice to have. It turned it into like a traditional action camera. Whew, it's a nice day out. I'm not gonna do anything to you. Well, don't be scared. So it's hard to keep testing. Now, in those previous shots I was filming in a set standard mode, but now I'm gonna use freeform. And I love this because this allows me to really get a lot more flexibility with my footage. So I can go into the Insta 360 Studio app and I can choose however I want this to be framed. I also really like this because this really does take advantage of the flow state stabilization. And you'll see here while I'm out riding around in this how stable this footage is. It's gonna be so fun. So let's rig this up and head on out. (gentle upbeat music) Now I've got this set up where I have the monitor right here so I can actually see what I'm filming. I can hit record, I can change some settings. So let's go for a ride and get some shots. (gentle upbeat music continues) (gentle upbeat music continues) (gentle upbeat music continues) Got this slow-mo and I'm gonna try to run it over to get a shot. I'm nervous. This is the last shot of the day so let's hope I don't run it over, like actually run it over. (gentle upbeat music continues) Now that my ride and filming is finished, the best part is editing. I love that I'm able to use Insta 360 cameras so seamlessly with their mobile app. It's awesome because you can basically import all of the footage. You can edit, export, and save everything right out from your phone and then post it. They also have some incredible AI editing, which not gonna lie, I love to edit, but having AI do it for me and add a soundtrack and text and everything, this is awesome to be able to get out content super quick. Doing things on mobile is so easy on the go but if you do want to export in higher quality, that's when you can use the Insta 360 Studio app on your computer. So I can change this from ultra wide or if I want it to be linear, depending upon what look I'm going for, I can change these clips and then export them all directly to my computer and take them into Final Cut to edit or Premiere or DaVinci whatever it is that you edit with. Thank you guys so much for watching. I had so much fun testing out this new Insta 360 Go 3. This was so much fun and I cannot wait to take this on some more adventures. It's gonna be so incredible. I love the previous versions and now this one is better than ever. If you guys haven't already, please subscribe, and hit the bell to be notified when I post new videos. And if you wanna check out any more of my videos they'll be here on the end screen. And with that, I will see you guys in the next one. See ya.",
    "transcript_keywords": [
        "mount",
        "camera",
        "action camera",
        "things",
        "Insta",
        "action",
        "love",
        "magnetic",
        "quick release mount",
        "cool",
        "mounts",
        "quick",
        "guys",
        "attach",
        "quick release",
        "fun",
        "filming",
        "hat mount",
        "release mount",
        "hat"
    ],
    "transcript_entity_values": [
        "Insta",
        "Insta 360 Go",
        "one",
        "five meters",
        "Hawaii",
        "three",
        "the Insta 360 Go",
        "the day",
        "up to",
        "Premiere",
        "3",
        "a nice day",
        "Final Cut",
        "two",
        "DaVinci",
        "AI",
        "the Gen 3",
        "the last two years",
        "first",
        "the Insta 360 Studio",
        "173 minutes",
        "up to",
        "TikTok",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09631741046905518,
        -0.03302379697561264,
        0.020960837602615356,
        -0.10079322010278702,
        0.14149948954582214,
        -0.027913494035601616,
        0.08519230037927628,
        0.055768080055713654,
        0.00725482776761055,
        0.08962351828813553,
        0.06681739538908005,
        -0.01134779304265976,
        -0.029814433306455612,
        0.02370956540107727,
        0.04348373785614967,
        0.01313604973256588,
        0.015013953670859337,
        -0.05081895738840103,
        -0.09206575155258179,
        0.04710744321346283,
        -0.05387389287352562,
        -0.0627836212515831,
        0.0435514934360981,
        0.00227508507668972,
        -0.046481356024742126,
        -0.023283284157514572,
        -0.05072639882564545,
        -0.028574777767062187,
        -0.12994928658008575,
        -0.12147516012191772,
        0.008968470618128777,
        0.021054966375231743,
        0.021182315424084663,
        -0.042139772325754166,
        -0.00349375675432384,
        -0.045995574444532394,
        -0.004383440595120192,
        -0.06992589682340622,
        -0.07026606053113937,
        -0.05150190368294716,
        -0.052067145705223083,
        0.005837222095578909,
        0.062275003641843796,
        -0.02471601590514183,
        0.002737500239163637,
        0.045823950320482254,
        0.026722753420472145,
        -0.03254207968711853,
        0.01100445631891489,
        -0.011615109629929066,
        -0.051844626665115356,
        -0.002949146553874016,
        0.02420412376523018,
        -0.014836031943559647,
        -0.10001292079687119,
        0.026168035343289375,
        -0.05320391431450844,
        -0.026167504489421844,
        0.05926526337862015,
        -0.020070169121026993,
        0.07682283967733383,
        -0.014535348862409592,
        0.017443859949707985,
        0.013016392476856709,
        0.008669734001159668,
        0.005996583495289087,
        0.0413464717566967,
        -0.06346007436513901,
        0.023920875042676926,
        -0.009468629024922848,
        -0.03368765488266945,
        0.020764611661434174,
        -0.03406122326850891,
        0.039663203060626984,
        -0.016523368656635284,
        -0.029542524367570877,
        0.04169821739196777,
        0.01784665137529373,
        -0.03342956304550171,
        -0.0017399638891220093,
        0.02897239476442337,
        0.015732770785689354,
        -0.016781240701675415,
        0.027783047407865524,
        0.04354944825172424,
        0.03359098732471466,
        -0.026825301349163055,
        0.02176458202302456,
        -0.0685284212231636,
        -0.011195624247193336,
        -0.07914745807647705,
        0.015514281578361988,
        -0.02767692506313324,
        -0.014110386371612549,
        -0.00402462761849165,
        -0.051930204033851624,
        -0.05782103165984154,
        -0.02946067973971367,
        -0.07044852524995804,
        0.04645942524075508,
        0.0705317035317421,
        -0.010307133197784424,
        -0.021399950608611107,
        -0.01868937537074089,
        0.03964734077453613,
        -0.05663205683231354,
        -0.024733340367674828,
        0.05771892890334129,
        0.03583532199263573,
        0.03729104995727539,
        -0.006847290322184563,
        -0.026568535715341568,
        -0.03396390751004219,
        0.03605454042553902,
        0.006776194553822279,
        0.04678083211183548,
        -0.05498691275715828,
        0.0675482451915741,
        0.029995141550898552,
        -0.03725128248333931,
        0.11399955302476883,
        -0.04283438250422478,
        0.0009345420985482633,
        0.016343671828508377,
        0.0033780080266296864,
        -0.025716310366988182,
        -0.011151350103318691,
        5.282526879853415e-33,
        0.010711565613746643,
        0.1180911436676979,
        0.00698391767218709,
        0.006901476066559553,
        0.09584136307239532,
        0.02284824475646019,
        -0.008237115107476711,
        0.06942221522331238,
        -0.12221322953701019,
        0.05252616107463837,
        -0.07062941044569016,
        0.08192700892686844,
        -0.04783903434872627,
        0.022629709914326668,
        0.02790549024939537,
        -0.026010386645793915,
        -0.04402860626578331,
        -0.031227264553308487,
        -0.022645527496933937,
        0.005250959657132626,
        0.020983558148145676,
        0.019950395449995995,
        -0.01875598356127739,
        0.037015728652477264,
        0.08776366710662842,
        0.08514315634965897,
        0.09715277701616287,
        -0.010037138126790524,
        0.00803411565721035,
        0.025171177461743355,
        -0.10090795159339905,
        -0.018175939098000526,
        0.0691906064748764,
        -0.04072737693786621,
        0.07387271523475647,
        -0.10416347533464432,
        -0.0689232274889946,
        -0.07104168832302094,
        -0.00975953321903944,
        0.02586366795003414,
        0.06965918838977814,
        0.0010378368897363544,
        -0.14803817868232727,
        -0.019984930753707886,
        -0.02491477131843567,
        0.06473968923091888,
        0.10511727631092072,
        0.11406883597373962,
        -0.026472965255379677,
        -0.0004118730139452964,
        0.033919807523489,
        -0.019279874861240387,
        -1.2640043678402435e-05,
        -0.029319344088435173,
        -0.02383938618004322,
        -0.04285037890076637,
        -0.06795784085988998,
        -0.013612480834126472,
        0.05180634930729866,
        -0.017257209867239,
        0.04383380711078644,
        0.008924716152250767,
        0.009814592078328133,
        -0.040248118340969086,
        -0.028089584782719612,
        0.010716550052165985,
        0.027128830552101135,
        0.007663974538445473,
        0.003185858018696308,
        -0.04097798094153404,
        -0.05772775411605835,
        0.016614137217402458,
        0.029287677258253098,
        -0.09677935391664505,
        0.05854824557900429,
        0.010819241404533386,
        -0.10267023742198944,
        -0.04194072261452675,
        0.035954274237155914,
        0.009499610401690006,
        -0.04505833238363266,
        0.017682619392871857,
        -0.0015266111586242914,
        0.04842384532094002,
        -0.02027488499879837,
        -0.05243363603949547,
        0.052655648440122604,
        -0.01594855822622776,
        -0.059137359261512756,
        0.0780240148305893,
        0.031830042600631714,
        -0.009659087285399437,
        -0.02382100559771061,
        0.02438574843108654,
        0.084805928170681,
        -5.046203658854179e-33,
        0.06601215153932571,
        0.015431470237672329,
        -0.05327393859624863,
        -0.07102780044078827,
        0.022532811388373375,
        -0.011132369749248028,
        0.10116579383611679,
        0.06537120789289474,
        0.09869050979614258,
        0.01752120442688465,
        -0.005955157335847616,
        -0.023612016811966896,
        -0.09189030528068542,
        -0.025852974504232407,
        0.009272653609514236,
        -0.014189395122230053,
        0.00697289127856493,
        -0.09982537478208542,
        -0.0121725182980299,
        -0.040866777300834656,
        0.05359642207622528,
        0.04450980946421623,
        0.00564389256760478,
        0.018670523539185524,
        -0.02703665755689144,
        0.08981399238109589,
        0.08723356574773788,
        0.0320722833275795,
        0.036353714764118195,
        -0.056002527475357056,
        -0.02763308957219124,
        -0.011591451242566109,
        0.000895473815035075,
        -0.0274482611566782,
        0.03540925681591034,
        0.04142151027917862,
        0.0640120804309845,
        -0.02412976510822773,
        -0.04914836585521698,
        -0.038823287934064865,
        -0.0062081655487418175,
        -0.011430858634412289,
        -0.016060322523117065,
        -0.031013773754239082,
        0.02978789433836937,
        -0.06495434045791626,
        -0.01413184218108654,
        0.08359023928642273,
        -0.07899200171232224,
        0.06033160910010338,
        0.021466361358761787,
        -0.06304876506328583,
        -0.009970642626285553,
        -0.037103455513715744,
        -0.051837317645549774,
        -0.02130584605038166,
        -0.03091077134013176,
        -0.007542778737843037,
        0.03258887305855751,
        0.0479971319437027,
        0.04201314598321915,
        -0.010395199991762638,
        -0.11164185404777527,
        -0.015355965122580528,
        0.0027234365697950125,
        -0.01936221681535244,
        0.10059519112110138,
        -0.0014535959344357252,
        -0.01652497798204422,
        0.03319311887025833,
        0.008200854063034058,
        -0.037600163370370865,
        0.030832326039671898,
        -0.12061180174350739,
        0.11535642296075821,
        0.02759885974228382,
        0.004197100177407265,
        -0.04275857284665108,
        0.07911384105682373,
        -0.06857842206954956,
        -0.04691703990101814,
        -0.026201926171779633,
        0.06582962721586227,
        0.1034441888332367,
        0.05038899928331375,
        0.057248007506132126,
        0.019094934687018394,
        0.09536333382129669,
        -0.02792692556977272,
        0.08248070627450943,
        -0.03658917546272278,
        0.06611955910921097,
        0.037482623010873795,
        0.10261216014623642,
        -0.00803658738732338,
        -5.4601283494548625e-08,
        0.04114163666963577,
        0.05003568157553673,
        0.009482116438448429,
        0.02028634212911129,
        0.02631523087620735,
        -0.023946769535541534,
        -0.013608654029667377,
        0.06509704887866974,
        0.010078135877847672,
        -0.06763066351413727,
        0.04454691708087921,
        -0.00988332275301218,
        -0.026562608778476715,
        0.06319266557693481,
        -0.010819786228239536,
        0.012385805137455463,
        -0.038015853613615036,
        0.048946723341941833,
        -0.026924792677164078,
        -0.00775119848549366,
        -0.018012866377830505,
        0.013416016474366188,
        0.03018365055322647,
        -0.1025591790676117,
        -0.05746902525424957,
        -0.04799001291394234,
        -0.018070075660943985,
        0.02435961924493313,
        0.014227895997464657,
        -0.028283607214689255,
        -0.08384042978286743,
        -0.030396906659007072,
        0.028051307424902916,
        0.02957041934132576,
        -0.06983364373445511,
        -0.08722502738237381,
        -0.051121413707733154,
        -0.030921122059226036,
        0.06024923548102379,
        -0.030411820858716965,
        0.0242494847625494,
        -0.01828167960047722,
        -0.009962012991309166,
        0.016224423423409462,
        -0.054211217910051346,
        0.0013397783041000366,
        0.05031929910182953,
        -0.13770422339439392,
        -0.024778906255960464,
        -0.022628679871559143,
        -0.12312442809343338,
        -0.05538411810994148,
        -0.0034821112640202045,
        0.10217208415269852,
        0.0463251955807209,
        0.03308503329753876,
        0.10792113840579987,
        -0.016885509714484215,
        -0.0407898984849453,
        0.10819968581199646,
        0.03205825760960579,
        -0.01335279643535614,
        -0.08540388196706772,
        0.09459950774908066
    ]
}