{
    "id": "r0LAk3F8ldg",
    "title": "What’s the WORST Microsoft product?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-08-09T17:32:53Z",
    "video_url": "https://www.youtube.com/watch?v=r0LAk3F8ldg",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "microsoft",
        "microsoft surface",
        "surface go 2",
        "surface laptop",
        "surface pro 7",
        "surface pro x",
        "surface studio",
        "surface book",
        "microsoft laptop",
        "windows",
        "ipad",
        "apple",
        "surface pen",
        "best microsoft products",
        "xbox",
        "xbox one",
        "xbox series x",
        "series x",
        "one s",
        "one x",
        "surface keyboard",
        "tablet",
        "computer",
        "laptop",
        "desktop",
        "tech",
        "technology",
        "review",
        "tier list",
        "ranking"
    ],
    "views": 121781,
    "likes": 5581,
    "comments_count": 525,
    "description": "What is the F tier Xbox?   Samsung Note 20 Is(n't) Garbage Town.  The Google Pixel 4a Wins.  What is the WORST PlayStation?  Best vs. Worst Apple Products:  The IMPOSSIBLE Apple Challenge ft. iJustine:    Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/ZC0vdejEoYw",
        "https://youtu.be/W3tgJ7uBDew",
        "https://youtu.be/OkBdZoqLqdA",
        "https://youtu.be/pQWqbZ1raE0",
        "https://youtu.be/sd8UfamDJOg",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, welcome to This Is, Microsoft is the fine purveyor of many wonderful products, but today we're going to rank which one is best to worse. Starting Ken, with the Surface Go 2. Have you used the Surface Go 2 yet? - I have, I have, in fact, we were sent one in the office by Microsoft. And I know you used it more, but from the little bits that I've used of it, actually really like it a lot. - In my opinion, it actually fills a niche that almost none of the other surface products do. So yes, it does start at 400 dollars, but realistically you should be looking at the more expensive model, especially considering that it doesn't come with a keyboard. And once you step up to that, roughly 700 dollar price tag, you get the much better processor. You get a 10 and a half inch tablet, which really is sort of the only real competitor, in my opinion, to something like the iPad Pro and the standard iPad. And of course you have the added benefit of running full windows. As far as I'm concerned, if I'm gonna use one Surface on a regular basis, it's gonna be the Surface Go 2. It's got the portability, you've got the optional LTE. In my opinion, and obviously I'm biased to someone who really likes sort of smaller tablets, but it really is sort of the best non iPad model as far as, if you wanna do everything on one device. - It has the battery life of a tablet, which is great because I think that's probably one of my bigger problems with the normal Surface Pro line. Is, the battery life isn't bad, but it's certainly not there for something of that size. I think the Surface Pro, the Surface Go 2, has that down pack. - With previous Surface Go devices, they had this very slow Pentium processor, and it just, wasn't very good. Like, yeah, sure. You get that 400 dollars price tag, and yeah, you get like nice design, you get the kickstand. There's a lot of stuff that comes with it, but it just felt so slow. Like it was so slow. But if you upgrade to that in three now, in the Surface Go 2, it makes a world of difference. It feels much more like a sort off device that you can live of every single day. - It makes a difference of you running just word and PowerPoint, versus being able to run apps like Photoshop. And I think that's a huge, huge win in my book, especially for something of that size. - I think I'm ready to give it A tier. I don't know, to me it feels like a very solid device and one of my favorite Surfaces. - [Ken] I think, I think A tier as well. It is the one that I would recommend most people, even at that higher price point. If you're not considering an iPad, but still want a full fledged tablet, that can also do desktop or laptop related things. Alright, so, I think I'm going to throw in one, that a lot of people are probably waiting for, 'cause this is a Microsoft tier list. We cannot talk about Microsoft, without bringing in some Xbox stuff. So, let's start a little simple, let's throw in the Xbox One S. - [Austin] Okay, so the Xbox One S, has the distinction of actually being the only Xbox currently in production. So, both the Xbox One S All-Digital, as well as the One X, which I think we'll talk about in a minute, are actually now out of production. So, that doesn't mean that you can't buy them. They still have stock in a lot of stores, and we'll likely have that for the rest of the year. But right now, if you wanna buy an Xbox, short of waiting for a Series X, the Xbox One S is your only option. Now, this is a little bit of a interesting one, because obviously if you look at a console, which at this point is approaching seven years old, this is the end of the life cycle, right? I mean, the One obviously will still be continued to be supported, but really it's time to start thinking about at the very least stuff like the Xbox One X and a series X, and maybe even the potential Series S. Like, there's a lot of new stuff. And if you buy an Xbox One S right now, you're definitely looking at something which is pretty old. - So, I feel like if you were ever curious about the Xbox One, and you can find this on sale for a, for a decent penny, I think that might be a little worth it. I mean, it's still weird because the new console is coming out and maybe you should just, it's half the price of the console that's coming out essentially right now. Or the, have the price of the console, that's gonna be coming out next gen. - I think this one's C tier, it's kinda tough to recommend, but there's some use cases where it makes sense. - Yeah, I think I might agree with C, if the, if this was like an episode that was shot a little bit before now, like if this was in like April, maybe I would have said the Xbox One S would have been a better buy, but no, I think you're right. That the C is the better move. - So, along that same line, how about the Xbox One X? So, obviously we have the caveat, that this is now out of production. And so, whatever's available in new and stores right now, that's gonna be it. There's no more Xbox One Xs being produced, but that being said, there's still plenty of them available, of course, on the used market, especially when you consider, there are a lot of people who are at heart of course, like Xbox fan boys, they're dumping their one Xs, in preparation for the Series X coming soon. With that being said, I mean, there are some major advantages. - [Ken] So, let me ask you, what do you think is the transition? Like, what do you think that looks like for people that will buy the One X now? Because it's not like, it's not like the Xbox One's gonna be totally phased out. There's, there still has to be some time to work up to it. - [Austin] I actually think the One X makes more sense sort of in that context, but I think it very much depends on the price. So, I know that if you're going to buy one new in a store and you're can actually track one down, I think the MSRP is now 400 dollars. So, it's a little bit cheaper than it was at launch, but really where I would look for, is in that used market, right? Because there are a lot of rumors, that we're going to see a lower end Xbox Series S, which could very well be in that three, 400 dollar price range. And if that comes out and supports all of these new games, it's really gonna make that Xbox One X, sort of obsolete very quickly. So, that's sort of my biggest sort of issue with recommending an Xbox One X right now. I actually think that as far as right now, it's hard to recommend. I think we've gotta put it pretty low on this list, like D. - I think B, because if the, if the One S was C... - No, no, but that's the thing, One S is cheap enough that I think it makes sense. One X I think is far too expensive. - [Ken] It could be C if it's the context of, like, if you know, you're not gonna get the Series X for a while, and you just wanna hold yourself over. You will have that support down the line. - I think the One X is gonna plummet in value, which to me makes it a really hard sell right now. That's the main reason why I personally think it goes below One S. - Oh yeah, no, I think no matter what you should, you should, until the Series X comes out. - Does this just mean that the Xbox One X is F. Like all X boxes are at right now? (laughing) - No, I'm gonna, I'm gonna, say the thing, that Austin probably doesn't wanna hear, cause he's sponsored by Microsoft. But the thing that everyone watching this video wants to hear, which is, all X boxes F tier, until the Series X comes out. - But you just said B, so I'm getting some conflicting messaging here. Do you think it's B or do you think it's F? - This is too many factors from my one brain cell to think about, but I'm just going to say, I think you're right. Maybe we get One X, like F tier, and we get like Xbox One S, I would almost wanna move that to D tier. (giggling) I want, I kinda wanna move it down. - I'm done with that, okay. Don't buy an Xbox One X until they're much cheaper, buy a One S only if you need like a Blu-ray Player, and something to that, play a few games. That seems really sad. - Okay, so here's a little bit of a controversial one, the Surface Book 3. - So, if you're not familiar, Microsoft of course has quite a few different Surfaces. And the Surface Book is sort of the highest end of the laptop convertible range. So, essentially the top portion, there's a 13 as well as a 15 inch model. The top portion detaches, right? So, it's a tablet, has all the guts of sort of a tablet inside, but when you attach it to the base dock, which is the sort of keyboard, you get a few things, including a much larger battery, some actual ports, and importantly, a dedicated graphics card. It doesn't have a sort of super sleek design. Like, yes, it's nice to be able to take off the screen, sort of bend it around, you use it as a tablet. The problem is that it doesn't actually close completely. So, the hinge sort of always leaves some gap, which means that, especially in a bag it's quite thick, and it is just very, very expensive. - The Surface Book, my biggest problem with it, is that, it's an older design. And it's not like, it's not like it's a design that exists, everywhere it is certainly unique. I don't think we're discounting that. My other problem is that I feel like this was only made yeah, for like five people. - I don't wanna be too mean, I feel like D tier a little bit too harsh, but I feel like it's C or D. I don't think it deserves to be any higher than that. - I think it's D and look, I'll give the disclaimer that and much what like, with other surface products that we're going to rank a little down the line, I have like a love-hate relationship with these things. And the Surface Book 3, is pretty much the poster child of that in my mind. - [Austin] Alright, D tier it is. Let's be a little bit kinder to our friends at Microsoft. And why don't we give them a shot with the Surface Pro 7. Now this is a device, you actually dailyed for a little while. - I guess the appeal for the Surface Pro 7 for me, was definitely the pen. Like actually using it as a tablet to make thumbnails, with a full fledged version of Photoshop, took me miles further than with this guy, the, the iPad Pro. - [Austin] The thing with the Surface Pro 7, is that, a lot of those sorts of issues I have, with the Surface Go, sort of disappear, right? It is a larger device, which I'm not personally a huge fan of. But in return you have real specs, you have like sort of laptop level, like kinda like Core i5, and i7 processor options. You also have what a lot of people would say, is a little bit of a nicer keyboard. It's obviously just a little bit bigger, and it's not actually that much more expensive. And as much as I liked the Surface Go, the Surface Pro is probably better for most people. - When I say I would recommend the Go more to people, I think that there I'm in context of tablets, but I think the Surface, the Surface tries to be more like a laptop. And I think the Surface Pro, in that regard, does it better than the Go. - So, could we give Surface Pro 7 a B. - [Ken] I can be down with that. B sounds about right. - So next up we have the Surface laptop. So, the laptop I think, is in a lot of ways, sort of the more traditional design, right? So it's not a two in one, it is touchscreen, but it's a traditional laptop. And they do have some cool things. So, the taller three by two aspect ratio, as well as the option for alcantara on the wrist rest, does give it a very unique sort of feel. And the fit and finish of course, was all the services. But specifically with the laptop is really nice. Now, the downside here, is that as we sort of talk about older designs, this definitely is a little bit on the, the simpler side. So, you look at the port selection, right? It's still kind of thick compared to a lot of other devices, but only has a couple of USB ports. They finally have a USB-C on it, but no Thunderbolt, it feels a little bit old, especially when you look at the 15 inch model. It feels a little bit half-baked to me. - Here's kind of the overarching problem with... I think this pegs the laptop even more, but it's something that we talk about between us, when we're talking about Surface products, like off camera. And the, the biggest problem that we have with Surfaces I think, is these things don't get refreshed that often. Sometimes even when these products come out, they're not exactly up to date. - The problem is they're updating them in kind of weird times, right? Like a new thing will come out, and then six to nine months later, then there'll be a Surface incorporating it, right? Which kind of feels weird when you see so many other co-manufacturers. Oh, cool, there's a new chip, boom. Here's our seven laptops that already have it. To me I just don't quite understand that. And Surface laptop for me is fine, it's decent. Especially with the Intel, the 13 inch Intel model's probably the one I like most, but I think it's C tier. - I like it better than the Surface Book 3. That's literally what I'm looking at right now. I'm like, I do like it more than that. So, I think C is correct. I definitely don't like it more than the Surface Pro 7, but I like it more than the Surface Book 3. (giggling) - Next, we have, Ken, well I know, is your personal favorite product, which is these Surface Pro X. - [Ken] So, back when I looked at this in the fall, it was the fall, huh, it's been the majority of a year. Back then, Microsoft unveiled the Surface Pro X, with the whole idea that they were working on a Windows on ARM. It felt so broken. And let's just say that editing, even the simplest photo in Photoshop was not possible. There were just graphics issues all over the place. Things weren't optimized. I just don't like this thing at all. - Honestly, I agree. And the thing is, it's tough to really justify for the Surface Pro X, because, it's not like some brand new thing, where brought out ARM on Windows. I mean, we did a video on a Snapdragon 835 powered HP tablet. Like three, four years ago, it was a long time ago, right? So, this is not a new project, and it has been very, very slow going. Well, as you see on the Apple side, obviously it's not a perfect Apple's or Apple's comparison, but essentially they're sort of just cutting it off. Like, hey, you know what, all new stuff, I'm done we're making our own chips. So, to me, I liked that hardware, but I can't recommend anyone buy a Surface Pro. I just, I just, it doesn't make any sense. Get the Seven, get the Go. The X is just a really tough sell, especially considering how expensive it is. - [Ken] I think it's F tier. - [Austin] I agree, I think that there's progress that can be made. I think this product will be better in the future, but today, 2020, uh uh. A product which has so much potential, and yet I feel like fails to live up to that these days, is the Surface Studio 2. So, I remember, we went to the original launch of the Microsoft Surface Studio. And it was incredibly cool, right? So, if you're not familiar, it's an all-in-one desktop, but it has the coolest hinge where it's a touchscreen, where you can sort of bring it all the way down, or you can pick it up. You can use it with like the dial, you can use it, obviously, of course, with your finger or with the pen. It's a very cool concept. The problem with this, the problem with it, is that if you're looking at Microsoft saying, \"Hey, don't update your products very often here, there.\" The Studio has been out of date since day one. And the Surface Studio 2, is, God, it's gotta be, is it two years old? I mean, they have, the specs are so far behind. - It's the same thing as the Surface Book 3, it's such a good idea, but they just haven't fully flushed it out. They haven't done the thing that most companies do, which is, oh, this thing was cool, let's improve on it. - If this thing literally just gets the most up to date 2020 specs, I think is really high on my list. But because it's so old, I gotta give it an F tier man. Like you just can't sell any computer that's this expensive, that's this out of date. - Awesome, we're not gonna get that money like that, man. - It's okay, that leaves us with one product and one product only. The Microsoft, Xbox Series X. - The S tier. - Stop it right now, how dare you. - So, my biggest problem with Microsoft is... and this is some of it's more personal reason, other bits of it is, I feel like I'm not the only one that thinks this way, but the most important thing, about the console are the games. But, they haven't really showed many things that are more interesting, at least to me, than the PS 5. The PS 5, I actually have things that I'm excited for, that are legitimately making me think about buying that console day one. Obviously, it has really great specs. It is arguably up there, with a high end PC. And we've talked about how performance of the Xbox Series X, lines up better, if not very similarly a least, to the PS 5, for right now, as of shooting. I think it's B for me. - [Austin] So, I'm between B and A. If I'm being completely honest with you. So, there's a lot going for Series X, right? So, obviously Microsoft spent Xbox One's generation kind of in the wilderness. They were way behind PlayStation, and they sort of spent a lot of time developing things like Xbox Game Pass, like xCloud. Like of course they're excellent backwards compatibility. So, they've sort of built a lot of that stuff up, which is sort of comes baked into the Series X. They have the most powerful console, They have, in my opinion, especially now that we've seen the PS 5 design, the better overall design, it's sort of gonna be generally speaking smaller. We obviously know sort of how it is designed and how kinda cooling solution, all that kind of stuff works. PS 5 have sort of mad exclusives, right? And the Xbox simply doesn't, right? 'Cause all those exclusives are available on PC. I don't think Microsoft cares, if you play the next Halo on a PC or on an Xbox, right? It doesn't matter to them sort of. They just want you to sign up for Game Pass and sort of experience the games, in some sort of Xbox form. But for you and I, who are sort of avid PC gamers and also kind of enjoy console games, it's a little bit of a tough sell, because like I'm probably gonna play most of my games on a PC instead of the Series X. I think I'll come down on B for now, but with the huge caveat, that we do not know what the price is. We have so many sort of question marks, on where the Series X really is gonna come out, when we actually get a sort of much closer look at it later this year. So, I'm curious, what do you think about our Microsoft tier list, and why would you rank the Xbox Series X to be, either S or F tier? 'Cause obviously there's no middle ground, right? - Sorry, I got just taken aback, by the fact that you called yourself an avid PC gamer. - Thank you very much for watching. Make sure to subscribe to This Is, for the lots more of the Austin roasts. And until next time I will be avidly PC gaming. Don't listen to anyone else, because I am telling you the truth and that's all you need to hear. (bright upbeat music)",
    "transcript_keywords": [
        "Surface Pro",
        "Surface",
        "Xbox",
        "Surface Book",
        "Xbox Series",
        "sort",
        "Microsoft Surface Studio",
        "Pro",
        "Series",
        "Microsoft",
        "Surface Studio",
        "give Surface Pro",
        "Surface Pro line",
        "surface products",
        "end Xbox Series",
        "Microsoft Surface",
        "normal Surface Pro",
        "tier",
        "thing",
        "lot"
    ],
    "transcript_entity_values": [
        "The PS 5",
        "three",
        "2",
        "the Surface Pro",
        "seven years old",
        "835",
        "One",
        "every single day",
        "the PS 5",
        "Xbox One's",
        "Microsoft",
        "PowerPoint",
        "Studio",
        "the Surface Pro 7",
        "D.",
        "10 and a half inch",
        "Pentium",
        "the Xbox Series X",
        "Xbox Series S",
        "USB",
        "15 inch",
        "the iPad Pro",
        "2020",
        "Surface Pro 7",
        "iPad",
        "roughly 700 dollar",
        "Photoshop",
        "Austin",
        "the Surface Pro X",
        "Xbox One",
        "Seven",
        "PS 5",
        "Xbox",
        "the Surface Pro X",
        "four years ago",
        "Surface",
        "today, 2020",
        "400 dollars",
        "the Series X.",
        "Windows",
        "LTE",
        "One S",
        "Xbox Series X. - The S",
        "alcantara",
        "the Surface Studio 2",
        "the Surface Book 3",
        "13",
        "the Series X",
        "Xbox One Xs",
        "HP",
        "Xbox One X",
        "these days",
        "later this year",
        "five",
        "400 dollar",
        "Intel",
        "PlayStation",
        "Xbox Game Pass",
        "the Surface Pro 7",
        "the year",
        "xCloud",
        "six to nine months later",
        "Blu-ray Player",
        "the Surface Book",
        "one",
        "Apple",
        "13 inch",
        "today",
        "F",
        "a year",
        "half",
        "Xs",
        "two years old",
        "two",
        "the Microsoft Surface Studio",
        "Xbox One S",
        "Xbox One",
        "MSRP",
        "Surface Pro",
        "Ken",
        "the Xbox Series X",
        "seven",
        "the Surface Go",
        "April"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "NORP",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "EVENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "EVENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "EVENT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.027354774996638298,
        -0.06332092732191086,
        0.06940113008022308,
        -0.07818262279033661,
        0.035068318247795105,
        0.030455049127340317,
        0.05936143174767494,
        0.09288830310106277,
        0.01478517334908247,
        0.06889964640140533,
        -0.026073036715388298,
        0.025998681783676147,
        0.05748065561056137,
        0.03155732527375221,
        0.006220212671905756,
        0.054715245962142944,
        0.08284264802932739,
        -0.10027899593114853,
        -0.04933405667543411,
        0.07767020910978317,
        0.005918648559600115,
        -0.058156032115221024,
        -0.043447140604257584,
        -0.02838940918445587,
        0.05684758350253105,
        0.08268935233354568,
        -0.036896247416734695,
        0.0025311722420156,
        0.01001892052590847,
        -0.016372378915548325,
        -0.07220675051212311,
        -0.00340888905338943,
        0.03979038819670677,
        0.02781827002763748,
        -0.003324381075799465,
        -0.08351665735244751,
        0.027133187279105186,
        -0.04338894411921501,
        -0.1277618110179901,
        -0.09244734793901443,
        -0.06305507570505142,
        0.0004154294729232788,
        -0.025502406060695648,
        0.04710421338677406,
        0.1163434386253357,
        -0.004553557373583317,
        0.028781332075595856,
        -0.013788865879178047,
        -0.057494767010211945,
        0.06612715870141983,
        -0.046556256711483,
        -0.08402343094348907,
        0.023231850937008858,
        -0.04496234655380249,
        -0.05681914463639259,
        0.045935772359371185,
        0.01382314320653677,
        0.08195506036281586,
        0.060013435781002045,
        -0.017965618520975113,
        0.012202650308609009,
        -0.14811770617961884,
        -0.017954465001821518,
        0.01728590577840805,
        0.02236897312104702,
        0.006057201884686947,
        -0.0002242841583210975,
        -0.09137535840272903,
        -0.0010351060191169381,
        0.012592919170856476,
        -0.08048167079687119,
        0.016549350693821907,
        0.030196016654372215,
        0.02207392267882824,
        0.009987291879951954,
        0.02996859699487686,
        0.05322200059890747,
        -0.05665513128042221,
        -0.037138115614652634,
        0.021549280732870102,
        0.0420512929558754,
        0.0032956625800579786,
        -0.09244716912508011,
        0.008021659217774868,
        0.00833103060722351,
        -0.015753857791423798,
        0.015708643943071365,
        0.01661931537091732,
        0.00691875908523798,
        0.001202450948767364,
        -0.029280299320816994,
        0.06204329431056976,
        0.02118421532213688,
        0.052790138870477676,
        0.024194341152906418,
        -0.003018811345100403,
        0.01611713320016861,
        -0.08440468460321426,
        -0.035100068897008896,
        0.016370056197047234,
        -0.024666115641593933,
        0.014114872552454472,
        0.05684817209839821,
        -0.04542071372270584,
        0.04091141000390053,
        -0.08932427316904068,
        0.012783406302332878,
        0.025780608877539635,
        -0.005671542603522539,
        0.002445800928398967,
        0.009671532548964024,
        -0.014967204071581364,
        -0.08616388589143753,
        -0.0011839711805805564,
        0.01717463880777359,
        -0.02346161939203739,
        0.003608117811381817,
        0.008673588745296001,
        0.07278048992156982,
        0.018721705302596092,
        -0.009541241452097893,
        0.03621585667133331,
        -0.054927315562963486,
        -0.024738216772675514,
        -0.05256737768650055,
        0.010090175084769726,
        -0.039147503674030304,
        4.862144018718456e-34,
        -0.019409898668527603,
        0.10149481147527695,
        -0.05213300138711929,
        -0.0652063861489296,
        0.011613770388066769,
        -0.026435062289237976,
        0.06955710053443909,
        0.0917726457118988,
        0.05556287243962288,
        0.056341879069805145,
        -0.08124745637178421,
        0.031160803511738777,
        -0.06618840247392654,
        0.035599589347839355,
        0.1336130052804947,
        -0.02641119994223118,
        0.01688344031572342,
        -0.008767088875174522,
        -0.061670005321502686,
        -0.028811298310756683,
        0.04388894513249397,
        -0.0030680883210152388,
        0.017675088718533516,
        -0.07723214477300644,
        -0.026998333632946014,
        -0.015441427938640118,
        -0.04642752557992935,
        -0.02193620055913925,
        0.07167216390371323,
        -0.009985269978642464,
        -0.08033344149589539,
        -0.0710592120885849,
        -0.018562402576208115,
        -0.07135413587093353,
        0.010127289220690727,
        -0.046756040304899216,
        -0.02367093227803707,
        -0.08351536095142365,
        0.08299587666988373,
        0.0047309803776443005,
        -0.126358300447464,
        0.04716784134507179,
        0.026437291875481606,
        0.00014090958575252444,
        0.0910036638379097,
        0.008260592818260193,
        0.009121961891651154,
        -0.016706589609384537,
        -0.011732999235391617,
        0.011632748879492283,
        -0.031378086656332016,
        0.04138557240366936,
        -0.008620085194706917,
        0.08921510726213455,
        -0.08774522691965103,
        -0.08624877035617828,
        0.027870401740074158,
        -0.014731115661561489,
        0.028746163472533226,
        0.11568054556846619,
        -0.004240910988301039,
        -0.014951574616134167,
        0.005794384516775608,
        0.02198968268930912,
        -0.07995525747537613,
        -0.005353252869099379,
        0.1687939167022705,
        0.03223956376314163,
        -0.07641344517469406,
        -0.0008454604540020227,
        0.021578699350357056,
        0.008730527944862843,
        -0.02390972711145878,
        -0.07312116771936417,
        0.0030037916731089354,
        -0.030262239277362823,
        0.03543916717171669,
        -0.024912860244512558,
        0.012739312835037708,
        -0.04842686280608177,
        -0.04020213708281517,
        0.09320112317800522,
        -0.023967575281858444,
        -0.02027796022593975,
        -0.09484212100505829,
        0.06506706029176712,
        0.04955320060253143,
        -0.07759976387023926,
        0.0027637938037514687,
        0.061209019273519516,
        -0.08573425561189651,
        -0.020915258675813675,
        -0.0032133201602846384,
        0.03416712209582329,
        -0.0031498419120907784,
        -1.3070203219002971e-33,
        -0.038690660148859024,
        -0.08571512997150421,
        0.04820999875664711,
        0.07301177084445953,
        -0.04386087879538536,
        -0.0013994374312460423,
        0.035327132791280746,
        -0.04458831250667572,
        0.009720014408230782,
        -0.009015259332954884,
        0.018259156495332718,
        0.04785235971212387,
        0.07545682787895203,
        0.05506286397576332,
        0.006398182362318039,
        0.0018019381677731872,
        -0.019398493692278862,
        -0.06285779923200607,
        0.11563196033239365,
        -0.05753127858042717,
        0.03078342042863369,
        0.03681464493274689,
        -0.052398890256881714,
        0.055938251316547394,
        -0.008861696347594261,
        -0.0122440867125988,
        -0.05150270089507103,
        -0.04226858913898468,
        0.015122449025511742,
        0.0356714092195034,
        0.03469977155327797,
        0.02945077046751976,
        0.047720860689878464,
        0.012703092768788338,
        0.048041071742773056,
        0.050354450941085815,
        0.027345584705471992,
        -0.07246161997318268,
        0.027996372431516647,
        0.019475167617201805,
        0.07484384626150131,
        -0.010926933959126472,
        -0.008418318815529346,
        -0.0025935517624020576,
        0.05289890989661217,
        0.021481722593307495,
        -0.047350507229566574,
        -0.024259371683001518,
        0.030971866101026535,
        0.02323794737458229,
        0.012600664980709553,
        0.01971356011927128,
        -0.07396841794252396,
        -0.023028088733553886,
        -0.061353154480457306,
        -0.07695317268371582,
        -0.07484927028417587,
        -0.023897022008895874,
        -0.015574592165648937,
        -0.03682423755526543,
        0.03552163392305374,
        0.011839393526315689,
        -0.08166865259408951,
        0.00830736942589283,
        0.013912616297602654,
        0.08554813265800476,
        0.13518738746643066,
        0.0035238272976130247,
        -0.02457112818956375,
        0.0034682059194892645,
        -0.08574487268924713,
        0.002973387250676751,
        -0.02531481720507145,
        -0.08047758042812347,
        -0.0483679324388504,
        0.09855134040117264,
        0.04900360479950905,
        0.011673514731228352,
        0.020403636619448662,
        -0.05765290558338165,
        0.03072506934404373,
        0.04660823941230774,
        0.10070036351680756,
        -0.018586670979857445,
        0.020877622067928314,
        0.023283371701836586,
        0.042631350457668304,
        -0.021407300606369972,
        -0.11486897617578506,
        0.03608604893088341,
        -0.065372996032238,
        -0.047681115567684174,
        -0.014416860416531563,
        0.07154544442892075,
        0.04398275166749954,
        -5.3007990885589606e-08,
        0.04059375822544098,
        0.027135925367474556,
        0.05918310582637787,
        -0.0017578339902684093,
        -0.02097511850297451,
        -0.022814789786934853,
        0.025004103779792786,
        0.08800634741783142,
        0.04870111867785454,
        -0.009857342578470707,
        -0.019819065928459167,
        -0.13769149780273438,
        -0.10153928399085999,
        0.04983147233724594,
        0.05255685746669769,
        0.14000901579856873,
        -0.06350786238908768,
        0.0210590697824955,
        -0.00038128666346892715,
        -0.09110396355390549,
        -0.025207648053765297,
        0.08182398229837418,
        0.04258975386619568,
        -0.09206394106149673,
        0.004982561804354191,
        0.005913210567086935,
        0.015169988386332989,
        0.09787028282880783,
        0.029508253559470177,
        -0.03591480106115341,
        -0.01593468151986599,
        -0.05060378834605217,
        0.009783645160496235,
        0.0009268238791264594,
        -0.0037400773726403713,
        -0.045949824154376984,
        0.0018186613451689482,
        0.04322350397706032,
        0.037267401814460754,
        0.06768961995840073,
        0.0005620491574518383,
        0.010450202971696854,
        -0.07764825969934464,
        -0.02663571946322918,
        -0.008620185777544975,
        -0.023328330367803574,
        -0.06356707960367203,
        -0.09113847464323044,
        0.004749649204313755,
        0.005552955437451601,
        -0.011214638128876686,
        0.0034261737018823624,
        0.005192320793867111,
        0.04779733717441559,
        0.021886350587010384,
        -0.015870248898863792,
        0.015182907693088055,
        -0.03202831745147705,
        0.0018919013673439622,
        0.07131388038396835,
        0.03715614974498749,
        -0.06047424301505089,
        -0.02765854075551033,
        0.062144920229911804
    ]
}