{
    "id": "r1bsHNawugI",
    "title": "I might have some REGRETS! - ASUS TUF VG28UQL1A 4K 144hz gaming monitor",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-01-26T19:55:44Z",
    "video_url": "https://www.youtube.com/watch?v=r1bsHNawugI",
    "category": "Science & Technology",
    "tags": [
        "4K",
        "Gaming",
        "ASUS",
        "TUF",
        "ROG",
        "VG28UQL1A",
        "Display",
        "Performance",
        "Who needs 4K gaming?",
        "Is 4K gaming viable now?",
        "Should you game in 4K?"
    ],
    "views": 451058,
    "likes": 13435,
    "comments_count": 711,
    "description": "Thanks to ASUS for sponsoring this video! Check out the VG28UQL1A 4K 144hz gaming monitor at   1440p gaming might be replacing 1080p sometime soon, but what about 4K? It's getting a bit more affordable and the hardware can start supporting it. Will you switch or give 4K gaming a try soon?  Buy the Asus TUF Gaming VG28UQL1A   Amazon:    Best Buy:    Newegg:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS ---------------------------------------------------   0:00 - I hope I don't have any regrets 0:30 - Overview 1:39 - Unboxing 2:29 - Monitor assembly and feature overview 5:24 - Monitor display setup 5:56 - Screen door effect 6:15 - Display port vs HDMI 2.1 6:50 - OSD impressions 8:12 - 4K Content impressions 8:30 - Gaming at 4K and impressions 10:49 - Final thoughts",
    "description_links": [
        "https://bit.ly/TUF-VG28UQL1A",
        "https://geni.us/dlrlB",
        "https://geni.us/BewCfa1",
        "https://geni.us/qnkWoDc",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- So I just bought a 32-inch, 1440p monitor, and I love it. But it costed me like $800. Now, ASUS sponsored this video to check out their ASUS TUF VG28U. It's a 28-inch, 4K, 144-hertz display. It's really nice and it's about $800. Did I make a mistake? - Yes. (Nicholas laughs) - Jono seems to think so. I don't know. The pixel density I've been looking at is okay, but 4K, 28 inches, that's a lot of PPI. So let's unbox it, open it up, and take a look, and see if I really did screw up. Jono actually just pointed out; it doesn't say 4K anywhere, at least not on the front, which is kinda where you're looking for, like a bunch of specs and stuff. I'm surprised because normally, it's a huge selling feature, right? Everyone, \"Oh, it's 4K, \"oh, it's 144 hertz.\" Like all we're seeing is the screen size. ACS TUF Gaming and the model. This side has like nothing on it. What does this side have on? This has got everything? Oh, yeah, here we go: 4K, HDR, 90% DCI-P3 coverage. - [Jono] What does that mean? - It can cover 90% of the DCIP3 color gamma. ELMB Sync, it's got this one millisecond, trace-free response time. So this is actually Rapid IPS. IPS has actually gotten a little better over the last few years. And Rapid IPS is kinda one of the newest ones. What else? Did I miss anything else? Got G-Sync, like everything. It's got HDMI 2.1 ports, even though that's like not a thing anymore 'cause I think all 2.0 is 2.1 now. I don't know. Yeah, it's a really stupid thing. It was on (indistinct) last week. I flip this thing over. (indistinct) 28 inches. (cables fall) All right, that's fine. That's just cables. Don't worry about that. Don't worry about these, that's okay. Oh, you can do this vertical. So I actually have the VG27A something. It's there, 27 inch, 1440p, 144 hertz, 165 over-clock; the 144 Hertz monitor at home. And I love that thing. So now, I have a guy like this that's 27 inches, and I've flipped it vertically, and it's awesome. I mean, it's not for everyone and it's kinda weird you have to... It takes some getting used to, but it's really nice having that super long screen space for like lists or just browsing or like if you've got chat, and then like Discord up here, and then your game on your main monitor, it's awesome. Any more distraction? You want me to throw the monitor on the ground? - Yeah. (Nicholas laughs) - I don't think ASUS would like that very much. I kinda opened this upside down. For most monitors, you're supposed to try to get panel side down, and then you can attach the stand, and then you just pull the whole thing off like that. But I mean, this has got actually, a surprising amount of like protective foam. So I'm just gonna put it like this on the (indistinct). It'll wiggle around, but it's fine. So this is awesome. it's tool-less. You can just slide it on. Screw this guy down. Did I mention ASUS sponsored this video? Thanks, ASUS. I love how they've got basically almost no bezel on the side and the top actually. There's a bit of a small one on here, but whatever, that's fine. One other thing I kinda like is that this part of the stand came attached. This was packed like right on there, which is great. It just eliminates a whole step you have to do. These are probably screws that you can just pull out. Just show me the screws. Oh, look at how easy. Yeah, cool. So thanks, Jono and our handy-dandy. I fixed the kit. Yeah, they're screws. So you just pop those guys out, and then you can probably just unscrew this whole thing, take it off, and then put this on a mount if you really want to. You know this is a lot easier in vertical. Here's the other nice thing about vertical monitors. Boom, wow! Now I can just reach the IO so much easier. Like I just plug it in. And that's not the power plug. This is HDMI. Is this 2.1? It says 8K. Did it come with display port? (paper crunches) Yes. Okay, so yeah, we've got two USB 3.0, and then there's two HDMI 2.1, and then two HDMI, and then a display port. And then there's a headphone jack at the very top, I think, which is great. I do like that they've labeled everything on here. So you can look at this instead of trying to go underneath. But like I said, if you're plugging in a bunch of stuff and setting up your monitor, highly recommend if it can go vertical, just do it all like this. Turn the whole thing, cable manage it, put it on your desk, you're basically done. We're done, look, you cable managed it. It looks nice. From the front, most of these cables are up high enough that you don't really see them. And then it just run straight at the back. We had a little trouble getting this to clip in quite the right way, but we're also in a rush. So this thing's great. ASUS tends to put in a lot of like swivel and tilt. So you've got a fair amount of motion that way. And then how much can it... Yeah, it's got quite a bit. - [Jono] 20 degrees back, 5 degrees front. - And it's not terrible, yeah. Honestly, the fact that it can go vertical, really also helps that a lot. There's also a bunch of control buttons. Like here's your main navigation nipples, we like to call it. And then it's got these four, probably like selector buttons here. I don't know. Like you can just... This thing has side to side functionality. You could just do everything on the nipple. I honestly don't understand. Oh, yeah, so Menu. That's an X, so that's go back. That's like forward one or forward two. I'm not sure what that means. And then that's a power button. I still think he could have done it all just on the navigation nipple, but whatever. So this is basically the setup that I've got at home right now. I've got one vertical monitor that's 27 inches. So I think it's a little bigger than this. Do you know what size this is? 24? All right, well, this is a vertical widescreen monitor. And then I've got my main display right here, except mine is like 32. So it's kinda like this. It's just a little bit bigger. - [Jono] But it's 1440p. - But it's 1440p. So the pixel density is worse, and yeah. 4K at 28 inches. Like don't get me wrong, this is nice. I can't see like any pixels. Like there's no screen door even when I'm right there. Which is great, but the reality is there's not much screen door when I'm on my 32-inch, 1440p. So-- - What's a screen door? - Screen door effects when you see pixels. You know when you're looking at a screen door and you can see like the individual spots where the screen intersects? You can see the same thing with pixels, kind of when it's a low pixel per inch density. (indistinct) by HDMI 2.1 to 4K-120. So let's actually get the display port in there and see if it does natively do 144 or if it'll go straight to just 120, and then you have to actually overclock it to 144. So another small complaint that I have is that HDR 400, it's really hardly HDR. But you know, it's better than not having it at all. And 4K-144. So it (indistinct) 144 native, which is cool, but you'll need a display port cable for that. Cool, so we've gotta install some games 'cause we moved our library, and things got messy when that happened. So we're just gonna look at the onscreen display while things download. Yeah, see, I really wish it was down here. I hate when they're on the side. Like even if I wasn't filming and trying to like show you guys this stuff, and keep my hand kind of out of the way, even just this is a lot more annoying than just like right here. This is just so much easier. Just put it down there every time. Yeah, it's got Adaptive Sync on, JSON compatible, Variable D. You cannot like cross here (indistinct). This is actually pretty cool. You can do like an FPS Counter and display alignment, which is nice. Oh, dynamic frame rate graph. That's cool. ASUS Gaming HDR. So you can choose Cinema, HDR, Console mode. I don't know what Console mode does. You should probably have that on if you're using a PS5 or something. Cinema is probably just more color accurate, and Gaming is probably just... Either there's some like low latency stuff enabled in it or it's just more vibrant probably. It's got some extra features that are... A few years ago, a lot of these stuff would actually be like really impressive. These days, it's stuff that you kind of just expect to have if you're spending more than four or $500 on a display. It feels great, 4K, you know, 120 hertz, 144 hertz. Like you really can't complain. And $800, like it's not a bad price, considering the screen size and resolution, and everything you're getting. - [Jono] Wow, look at that! - Yeah, it looks pretty. I wish it would get a little brighter. Like I said, HDR 400 isn't gonna get too bright, but it does look really nice. Yeah, so contrast ratio is about 1000:1, which is okay. We're seeing displays retire in that, these days. But like, honestly, for this price, you're not gonna find much better. Retracing, ultra, textures, high, field of view, 80. No, 100. I wanna see everything in 4K. I don't wanna upscale or downscale anything, I just wanna be straight native 4K. Well, just keep the 90 degree field of view 'cause, come on, 80 is not enough. And then we're gonna go down to... Let's just do the big. Retracing, medium. 24, yeah, see. - [Jono] I think you have to play with DLSS. - You're right, like you basically need... At higher resolutions, you basically need DLSS 'cause 4K, (indistinct) 30-90, is just too strong. I'll try turning this back to 80. There's a couple of settings that really make a huge difference. Like anisotropy can go down to like four and it'll still look pretty good. (Nicholas sighs) But here's what I'm getting at; is like this is not even a new game anymore. And yeah, it's not very well optimized, sure, but a lot of brand new Triple-A games aren't well optimized. Especially when they're reported to PC is like a secondary thing. And with DLSS on and some stuff turned down to like high or medium, we're only getting like 55, 60 FPS. It's okay, but, you know, we want the 120, we want the 144 hertz. So let's get out of \"Cyberpunk.\" You know what? It looks beautiful on this thing. And you know what? 300, okay, well, it's \"Deathmatch.\" So, I mean, I'm just gonna get shots from every angle. But 200 FPS, 250 FPS, if you play anything competitive, like \"Counter-Strike\" or \"Rainbow Six-Siege\" would probably also see pretty good frame rates. It's a really good size, like 28 inches. I went from 27 to 32. And 32 is fine. But 28, especially when you're gaming like this close to it, is a really, really good screen size. I don't have to turn my head to look at anything. I can just use my eyes, and it's all like within my field of view; I don't have to worry about something going on in the bottom-left corner or something like that. I think for anyone looking for an upgrade, especially if you're running 1080p, you should probably get something like this because you are future-proofing. Especially with the high refresh rate, you're not stuck with like, \"Oh, it's 4K-60.\" Okay, well that's great. I know that not a lot of games can run past like 60 hertz and 4K. I mean, hey, (indistinct). I'm getting 300 frames per second here. Yeah, it's a 30-90, but whatever, this thing can do it. You wanna buy a monitor that can match for your hardware. So if you spent a lot on your computer, a 4K, 120 hertz display at $800, it's a pretty good deal. Thanks for watching, guys. It's the ASUS VG28U, 4K, 144 hertz. Really gorgeous display. If you like this video, check out the 360... No, sorry, 390-hertz Acer video we did. You know, 120 is a lot, but it could always be better.",
    "transcript_keywords": [
        "yeah",
        "thing",
        "ASUS",
        "display",
        "lot",
        "screen",
        "kind",
        "hertz",
        "monitor",
        "HDR",
        "ASUS Gaming HDR",
        "HDMI",
        "side",
        "screen door",
        "vertical",
        "nice",
        "stuff",
        "display port",
        "inches",
        "great"
    ],
    "transcript_entity_values": [
        "5 degrees",
        "24",
        "500",
        "Deathmatch",
        "JSON",
        "FPS",
        "32",
        "60 hertz",
        "Adaptive Sync",
        "Hertz",
        "One",
        "4",
        "one",
        "32",
        "USB",
        "about $800",
        "DLSS",
        "4K-144",
        "800",
        "28",
        "Rapid IPS",
        "ACS TUF Gaming",
        "4K-120",
        "ELMB Sync",
        "60 FPS",
        "100",
        "165",
        "27 inches",
        "more than four",
        "second",
        "last week",
        "30-90",
        "28-inch",
        "200",
        "IO",
        "the last few years",
        "80",
        "4K-60",
        "20 degrees",
        "Jono",
        "These days",
        "28 inches",
        "IPS",
        "300",
        "DCI-P3",
        "PS5",
        "80",
        "ASUS TUF VG28U.",
        "ASUS",
        "Nicholas",
        "90%",
        "these days",
        "two",
        "120",
        "144",
        "55",
        "Menu",
        "four",
        "ASUS Gaming HDR",
        "A few years ago",
        "32-inch",
        "Rainbow Six-Siege",
        "27",
        "90 degree",
        "27 inch",
        "So--",
        "250",
        "390",
        "2.1",
        "jack",
        "HDR",
        "ASUS",
        "about 1000:1",
        "2.0",
        "Cinema"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        0.01917015202343464,
        0.008328667841851711,
        -0.020001443102955818,
        -0.02701393887400627,
        -0.05545166879892349,
        0.039433762431144714,
        -0.04224107414484024,
        0.0074780890718102455,
        0.008756555616855621,
        0.061533018946647644,
        -0.0761890709400177,
        -0.01070354413241148,
        -0.008796785958111286,
        -0.03499717265367508,
        -0.023828521370887756,
        0.04070315882563591,
        0.08271193504333496,
        -0.05084875971078873,
        -0.04828094318509102,
        -0.08708343654870987,
        -0.03492611274123192,
        -0.10225661098957062,
        -0.006466901395469904,
        -0.08596189320087433,
        0.018225131556391716,
        -0.032297197729349136,
        -0.007375576999038458,
        -0.1067689061164856,
        -0.0171638373285532,
        -0.06535504013299942,
        0.01329080481082201,
        0.02518676593899727,
        0.007840716280043125,
        0.044324032962322235,
        -0.0084307212382555,
        -0.03485850244760513,
        0.0285047497600317,
        -0.16239230334758759,
        -0.04738973081111908,
        -0.06127442792057991,
        0.013239150866866112,
        0.021322710439562798,
        -0.017781073227524757,
        0.02994058094918728,
        -0.013078887946903706,
        0.0324215292930603,
        0.03579477220773697,
        0.009372181259095669,
        0.0368850976228714,
        0.03477330133318901,
        0.028396744281053543,
        0.010435603559017181,
        0.01926475390791893,
        -0.028808122500777245,
        -0.11208083480596542,
        0.05571430176496506,
        -0.09547015279531479,
        -0.0103438226506114,
        0.035858288407325745,
        0.10653892159461975,
        0.1182393878698349,
        -0.073950856924057,
        -0.024182649329304695,
        0.08090730756521225,
        -0.009084527380764484,
        0.0038589071482419968,
        0.02543073147535324,
        -0.01941140554845333,
        -0.051078107208013535,
        0.02476375177502632,
        -0.0035132127813994884,
        0.052791789174079895,
        0.06083972379565239,
        0.023305712267756462,
        -0.016444098204374313,
        0.001193012110888958,
        0.05027753487229347,
        -0.06838776916265488,
        0.10314114391803741,
        -0.009070320054888725,
        0.02676951326429844,
        0.021873770281672478,
        0.0026380273047834635,
        -0.07772696018218994,
        0.011094392277300358,
        -0.05816196650266647,
        0.002292213961482048,
        -0.01280287466943264,
        0.04415060952305794,
        -0.11823731660842896,
        0.03069094382226467,
        0.060367461293935776,
        0.08572269976139069,
        0.055155009031295776,
        -0.0004728960630018264,
        0.011921560391783714,
        0.04245646670460701,
        -0.04739948734641075,
        -0.020532535389065742,
        0.08053234219551086,
        0.013305098749697208,
        0.012985878624022007,
        0.06042327731847763,
        0.05366024002432823,
        -0.030777104198932648,
        0.02256832644343376,
        0.04359694570302963,
        0.02944551780819893,
        -0.10026955604553223,
        0.05177140608429909,
        -0.04710216075181961,
        0.07944153249263763,
        -0.004310416057705879,
        0.008640228770673275,
        0.06137147918343544,
        0.08344518393278122,
        -0.012237097136676311,
        -0.060482207685709,
        0.06563090533018112,
        -0.014817783609032631,
        -0.024846045300364494,
        -0.033694788813591,
        0.004327516071498394,
        0.006169604603201151,
        0.0211702361702919,
        0.08251525461673737,
        -0.07557380944490433,
        7.33904175698953e-33,
        -0.07760383188724518,
        0.14182324707508087,
        0.043342474848032,
        -0.12240426242351532,
        0.032561011612415314,
        0.03273436427116394,
        0.09310830384492874,
        0.019245252013206482,
        -0.012820763513445854,
        0.0097506707534194,
        -0.05339088663458824,
        -0.02472781203687191,
        -0.058703385293483734,
        0.07311956584453583,
        -0.012135510332882404,
        -0.0504796989262104,
        0.051568880677223206,
        0.04689774289727211,
        -0.006785183679312468,
        0.04866601154208183,
        0.017584340646862984,
        -0.04412244260311127,
        -0.010746289975941181,
        0.019524788483977318,
        0.0055113285779953,
        -0.07477989792823792,
        0.015379423275589943,
        0.0307210311293602,
        0.03265303373336792,
        0.03170817717909813,
        -0.019247112795710564,
        -0.05636133998632431,
        -0.031767573207616806,
        -0.09896548837423325,
        -0.046078603714704514,
        -0.08557958900928497,
        -0.06429387629032135,
        -0.01592382974922657,
        -0.04828391969203949,
        0.039936915040016174,
        -0.014687594026327133,
        0.08654321730136871,
        -0.06722499430179596,
        -0.11856359243392944,
        -0.08111853897571564,
        0.027413472533226013,
        0.020142599940299988,
        0.010166984051465988,
        -0.0016192927723750472,
        0.02185024321079254,
        -0.034226831048727036,
        0.008381755091249943,
        -0.055998846888542175,
        -0.09810958057641983,
        0.06800857186317444,
        -0.04524713754653931,
        0.03940773010253906,
        -0.05990978330373764,
        0.02505619078874588,
        0.04555496945977211,
        0.011494825594127178,
        -0.07113267481327057,
        -0.027352990582585335,
        -0.00301270536147058,
        -0.03658567741513252,
        -0.004072369541972876,
        0.09304456412792206,
        0.05609007924795151,
        -0.13995687663555145,
        -0.05177048221230507,
        -0.016133617609739304,
        0.011883918195962906,
        0.07048705220222473,
        -0.09639786928892136,
        0.017869379371404648,
        0.0018481614533811808,
        -0.06815487146377563,
        -0.013396346010267735,
        -0.04939054325222969,
        -0.013085243292152882,
        -0.03920287638902664,
        0.05243462324142456,
        0.04809886962175369,
        -0.017632871866226196,
        0.016002323478460312,
        0.0005772221484221518,
        0.06962160766124725,
        0.03783959522843361,
        0.0357237346470356,
        -0.011702551506459713,
        -0.04221605136990547,
        -0.007990702986717224,
        -0.02923862636089325,
        -0.009916970506310463,
        0.000721433840226382,
        -7.412507949864015e-33,
        0.0055559189058840275,
        0.05370241776108742,
        -0.07482545077800751,
        0.07291540503501892,
        0.04057696461677551,
        -0.007354255765676498,
        0.0753633975982666,
        0.054771751165390015,
        0.041501834988594055,
        -0.05168938264250755,
        0.05494394525885582,
        0.03511640802025795,
        0.0045264954678714275,
        0.0276574045419693,
        0.0025715010706335306,
        -0.05592358484864235,
        0.02032690867781639,
        -0.09345804154872894,
        0.014269998297095299,
        -0.05206179618835449,
        0.01404177863150835,
        -0.013947640545666218,
        0.007780931890010834,
        0.04609242454171181,
        0.04116932302713394,
        -0.06883181631565094,
        0.02752605453133583,
        0.04119350016117096,
        -0.027863265946507454,
        0.09355635195970535,
        0.008310209959745407,
        -0.05010559409856796,
        0.08686739206314087,
        0.02082444541156292,
        0.10061533004045486,
        -0.04931127652525902,
        0.10066702961921692,
        -0.028123512864112854,
        -0.051747895777225494,
        0.01622202806174755,
        0.035814572125673294,
        0.056195493787527084,
        0.023975813761353493,
        0.0039173755794763565,
        0.04541730508208275,
        -0.0014564009616151452,
        -0.0049476767890155315,
        -0.06184525415301323,
        -0.004710327368229628,
        -0.051379527896642685,
        0.03938338905572891,
        -0.020779255777597427,
        0.03678649663925171,
        -0.02370103821158409,
        0.00490975845605135,
        -0.04571911692619324,
        -0.10518203675746918,
        0.05297228693962097,
        -0.04949897900223732,
        -0.024429842829704285,
        -0.0017110768239945173,
        -0.01838703453540802,
        -0.045709505677223206,
        0.013873765245079994,
        0.09903295338153839,
        -0.0315852090716362,
        -0.034185126423835754,
        0.02912219613790512,
        0.015844441950321198,
        -0.013376332819461823,
        -0.09795398265123367,
        -0.11253757029771805,
        -0.08228711038827896,
        -0.01840587519109249,
        -0.015103059820830822,
        0.022328753024339676,
        0.014009310863912106,
        0.004172607325017452,
        0.008061548694968224,
        0.01204715482890606,
        -0.0802738219499588,
        -0.030042625963687897,
        0.06675836443901062,
        -0.02820381335914135,
        0.049806397408246994,
        -0.04082394391298294,
        0.026774298399686813,
        -0.008413284085690975,
        0.010166529566049576,
        0.018036870285868645,
        -0.0517989844083786,
        0.0021074803080409765,
        -0.09471729397773743,
        0.06018352136015892,
        0.05246670916676521,
        -5.741628683608724e-08,
        -0.045134857296943665,
        0.05144517496228218,
        -0.011811004020273685,
        0.01301611214876175,
        -0.017062652856111526,
        -0.07454564422369003,
        -0.004336812999099493,
        -0.03413129597902298,
        0.09121006727218628,
        -0.0456661731004715,
        0.0016636665677651763,
        -0.04855785146355629,
        0.036510348320007324,
        0.018923437222838402,
        0.01628992334008217,
        -0.014626639895141125,
        -0.038231030106544495,
        -0.006670461501926184,
        0.0203639417886734,
        0.03638191521167755,
        0.05751120671629906,
        0.06066139414906502,
        0.07080722600221634,
        -0.07225073128938675,
        0.03415095806121826,
        0.03177161142230034,
        -0.009453401900827885,
        0.04459051787853241,
        0.05888689309358597,
        -0.034152790904045105,
        0.015359875746071339,
        0.012607390061020851,
        0.02767275832593441,
        -0.12051750719547272,
        0.06525743752717972,
        -0.058488134294748306,
        -0.025007354095578194,
        0.09347135573625565,
        0.13432328402996063,
        0.07173850387334824,
        -0.021561672911047935,
        -0.03667673096060753,
        -0.024307098239660263,
        -0.012167921289801598,
        -0.02023417316377163,
        0.0222630612552166,
        0.023582544177770615,
        -0.0863294005393982,
        -0.0004683039151132107,
        0.015931613743305206,
        -0.07320158183574677,
        0.04895881563425064,
        -0.03331531211733818,
        -0.043868690729141235,
        0.05449629947543144,
        -0.01805015094578266,
        0.002422359772026539,
        0.08536503463983536,
        -0.0160177294164896,
        -0.009040235541760921,
        0.00586271146312356,
        -0.10507757216691971,
        -0.08010898530483246,
        0.09802837669849396
    ]
}