{
    "id": "r34cBQMrzIk",
    "title": "The Next Elon Musk",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-09-29T15:48:46Z",
    "video_url": "https://www.youtube.com/watch?v=r34cBQMrzIk",
    "category": "Science & Technology",
    "tags": [
        "elon musk",
        "spacex",
        "rockets",
        "bps space",
        "bps",
        "joe barnard",
        "rocket",
        "launch",
        "science",
        "model",
        "space",
        "space x",
        "flight",
        "rocket launch",
        "wesley knapp",
        "overclock media",
        "documentary",
        "this is",
        "austin evans"
    ],
    "views": 859332,
    "likes": 22846,
    "comments_count": 1742,
    "description": "Thanks to LastPass for sponsoring a portion of this video. Click here to start using LastPass: Our first real documentary: meet Joe Barnard and BPS Space. Huge thank you to Joe for his time, definitely check him out!   Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://lastpass.onelink.me/HzaM/2019Q3IncrementalAustinEvans",
        "https://www.youtube.com/bpsspace",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. And this is something a little different. Today's story actually takes place on the other side of the country. Meet Joe Barnard, a rocket scientist who inspired by a certain aerospace company has started to develop his own self landing rocket just on a slightly different scale and with no formal education. I mean, this guy designs and builds pretty much everything all by himself and is able to keep the lights on by documenting the entire process and selling some of the components. However, right about now, he's preparing for his biggest challenge yet. This has been an absolutely massive project, and it wouldn't had been possible without our friends at LastPass who sponsored this portion of the video. With LastPass you don't need to write, remember, or reset your passwords, as it will keep all of them safe and secure inside the LastPass vault. And it will even generate brand new super secure passwords for you. LastPass even works on mobile sites and apps on iOS and Android, which means that with a single tap you can not only login with your username but also your saved passwords. Unlike the old days where I used a handful of passwords for every website I went to, instead LastPass is great for keeping safe and very secure passwords that are unique to each and every website, as well as app I use. This is all available for free, however, there's also LastPass Premium available for $2 a month. And this is what I personally use, especially because they have some very advanced multifactor authentication options. So you know that all of your logins are as safe as possible. Best of all LastPass works across pretty much all of your devices, including phones, tablets, computers, you name it. Now I legitimately have been using LastPass everyday for a very long time. So if your password game is in need of an upgrade, definitely be sure to go check out LastPass at the link in the description, and again huge, huge thank you to LastPass for making this video possible and sponsoring this madness. (birds chirp) (computer beeps) (drone buzzes) - Okay, and it's time. Here we go. (bright music) (rocket fires) The BPS Echo test vehicle. This is actually the computer I use to land the rockets. (computer beeps) (rocket fires) This is like extremely basic stuff. We're only firing a single core vehicle, which means we only need four clamps. These four here. (machines whirl) You know, this is how they really do it in real aerospace companies. They have just one desk, and there's like just trash all over it. Okay, so the whole thing is put together, the motor's inserted. (computer beeps) (clamps creak) Hey, bingo! And then if we release the clamps. This is what happened at launch. It's good to go. And that's how they work. (computer beeps) (switch clicks) (rocket fires) And done. Well, done with that part. Now there are like several hundred other more parts. Before I got any footage of anything working, the general consensus was, no, you can't do this. I put this by the door so that if there's a fire, it's gonna be a lot harder to get out. - [Announcer] Five, four, three, two, one. (rocket fires) (rocket fires) I studied at the Berklee College of Music. The joke is that at Berklee they teach you how to say, \"Do you want fries with that?\" I have been making YouTube videos of like cover songs and original songs in my parents basement for years. (indie rock music) And when she said no I said no, no, no I said no No So I got better at film making, and some point I realized people will pay me money for this. And that's a surprisingly big motivator. I had been working in film for awhile. It was just something I saw scrolling on Facebook. It was this little video of SpaceX doing a test with what's called the Falcon 9 Dev-R. It's a rocket booster, but it's not going into space. It's just doing little hop tests down in Texas somewhere. I saw that, and I was like, oh, man. I need to be working for these people. I had to like prove in a non-go-back-to-college kind of way that I was serious about it. I thought maybe I could try to like land a model rocket. It's just a model rocket. Like how hard could it be? (drum roll music) And I still haven't been able to land it. Welcome to the rocket factory (laughs), which is my apartment, not a factory. There's a lot of propellant in one apartment, and it's all in a fireproof box. Don't worry, Mom. We've got our washer here, and a 3D printer number one. And the dryer here, and 3D printer number two. We can do both laundry and 3D printing services here. Moving to Nashville was like the most painful experience of my life. I had been in Boston for a few years watching all of my friends slowly leave. It was just a slow steady downward hill of emotion. I had to move home with my parents for a few months just 'cause like money's tough, man. I got some recognition for my work from like larger aerospace entities. - One potential future for our hobby. - [Joe] One of them is SpaceX. And like Elon has like seen my tweets. They send a big Dragon spacecraft up to the space station, and then they tried to land their booster on the drone ship out in the ocean. - [Announcer] And the Falcons have landed. - It was a realization of like uh-oh. Like they're really serious. There's been like several different instances where it seems like a drop could've panned out. And then it just has never felt like the right time. Every single BPS launch has taken place between this piece of wood and this launch pad. And at some point, I'd spent enough money so that I was like, all right, something has to change. So we're gonna have to do something else. So that this can be not cashflow negative. So for awhile I thought we could sell the flight computers directly to model rocketry consumers. I made this in September of 2015. I have failed a whole lot. And I figure if I can save other people some time trying to do these similar things, that would be great. We're in the black now. The business works. It makes money, but it did not for awhile. Most projects or tasks or jobs that look difficult are, but not if you've been doing them for awhile. So like all of these things that are just so dry and boring to learn, they all become cool once you know what you're working toward. You can learn most things on YouTube. It's kind of coming full circle though. Like I learned all of these things through YouTube tutorials. The YouTube tutorialer has become the YouTube tutorialee. The goal has for a lot of these flights is just to continue getting it closer and closer to landing. I've done tests where it lands a little too high. I've done tests where it hits the ground because it's going too fast. Three, two, one. (rocket fires) The thing that like gets to me the most is probably imposter syndrome. Like I don't feel like I should be doing this. I don't feel like I'm good enough to be doing this. Even like the people who accomplish a whole lot of stuff, I thinks they feel that sometimes too. And so it's really easy to, you know, if someone says like, hey, what's your next plan? What's the next big thing? Are you gonna go orbital, or are you gonna try to build a rocket that goes to space? And the answer is like I have no idea if I can. What if this is it? Like what if I plateau here? And I don't think that's rational. But that's what gets to me the most is just thinking like I'm gonna hit a wall at some point of I don't know. The flight computer, I still need to build. That's not that hard to do, but I just need to do it. (rocket fires) The launchpad computer. This is called Impulse. It's another custom design board. This computer controls all of the events that happen on the launch pad. Upload. (computer beeps) There it is. Okay, cool. There are all of these different stages that the flight computers have to go through in order to actually fly a rocket. I keep using the pronoun we to describe BPS both because I do plan on scaling up to more people and because there's such tremendous support on platforms like Patreon by people who are not just supporting financially but like providing really solid advice. It's extremely cheesy to be like, well, really we're more of a community, but that's what it feels like. (upbeat music) (computer beeps) (machines whirl) There we go. There's a little flight computer package. (rocket fires) So sometimes when you spend a lot of money on rocket motors, just because of the way that money works you have a little bit less to spend on food. And the great place to go to get cheap food is right here at the Food Lion. Now the Food Lion has food. It's a grocery store. But the thing about it is you're still paying. Hazelnut's objectively the best coffee, and no one carries it. And primarily you're paying in your hope and your will to live. Got the coffee. Got the seltzer, the food line Brent. (cans thud) (laughs) Oh my god, I shouldn't have picked it up. (laughs) Oh, my poor little seltzers. We have eight boards to build today. And we'll go through the whole process. (gentle music) That's probably enough. (board clanks) (laughs) BPS produces a bunch of signal flight computers roughly every two months. There's like nothing like this on the market. This is like spring of 2017. This is like September of 2017. October of 2017. Each one of these contains three accelerometers and three gyroscopes. It is unbelievable that they can fit so much technology in such a small amount of space. If this thing right here doesn't work, you have the potential to slam your rocket into the ground. (groans) All upside down again. This is like the whole product lineup of BPS. This is an old launch pad computer called Impulse. This is Impulse D2. So you start with the hard parts, and then when the easy work comes around, it's like even easier. This may not be technically correct, but it's how I'm gonna think about it. I feel like it's pretty close, man. (hoots) (computer beeps) (gentle music) You know, I'm not that nervous. It's a weird feeling. It's not nerves. Maybe it's just regular stress. (laughs) I don't know. I don't really know how I feel. (laughs) All right, these are my serial killer gloves. So it says remove before flight, and we've done just that. (drone buzzes) (dramatic music) (rocket fires) Ouch. That's no good. All right, let's land the drone. (drone buzzes) Go faster, little buddy. Yeah, that is no good. I think that's the worst landing yet. But the drone won't come down. There we go. I mean, the big thing is like why was it so unstable. That was really unstable. I do not know why. (sighs) I'm telling you, man. Anytime I bring anyone else to the launches, it doesn't go well. That's too bad. (computer beeps) I haven't had a flight that bad so far. So. Boy, that's too bad. I'm sorry it didn't really work. - [Austin] No, that's okay. Well, I'm sorry it didn't really work. - I just don't. I think new rule, like no one at the test site. Okay, so for Scout V-0.6, this is the sixth rocket that I launched as part of the BPS program. I brought out like I think like 15 people. Like my parents were there. My dog was there. A couple of friends and a bunch of videographers, and was like this is gonna be great. It's gonna be so good. And I couldn't even get the motor to light. I used all of my igniters. I couldn't get the motor to light. And I just had to tell everyone like I'm sorry. It just won't launch. But for whatever reason, just when I bring people to launches, it doesn't go well. I wish that weren't the case. 'Cause it's really helpful to have other people there. But what are you gonna do? Fly more rockets until they don't fail so much. Yeah, you know what? Yeah. Something is really wrong there. Ooh. Boy. I bet I now how to fix that. Walk with me (laughs). So here's how you could do it. This is a very hot take. This is steaming hot take right now. You drop, rely on the gyros for like literally the four seconds of free fall and burn toward the ground, and like you can't drift very far in those four seconds, and I think that's how you would fix it. There, done. That's a good ending. And then we'll find out in like an hour when I look at all of this that I'm totally wrong. We'll see. That'll be a good thing. That's like real, too. That's like actually how you'd fix it. (laughs) (laughs) That's awesome. You can certainly see the trend over time. They just get crazier and they sort of, they start to drift down. But this is where the magic happens. This is where the magic happens. The thing that I can clearly see is that the rocket even though it's rotating back and forth, it's not rotating all the way to like 12 degrees as it thinks it is here. So much to work with here. It's really. It's so beautiful. I love it. In the mind of the rocket, it did a really good job. And in real life, it didn't. This is so exciting. So today's test, if you have to categorize it as good or bad, it's gonna be bad. That's what it's gonna be. But I'm comfortable calling this a failure, and I'm also comfortable being really happy with it. I've never been so excited after a rocket hasn't worked. I think it's good to talk about when things don't work. It forces you to explain why they didn't. And often times it forces you to examine it a little bit closer. Got a little preachy at the end there (laughs). I wanna see how far I can go. I just really love doing this stuff, and I wanna keep doing it. - [Austin] And I can't help but notice that you're pretty dressed up. - I am, yeah. I'm going to a wine tasting with my girlfriend. I don't know, it's going well (laughs). You can't work all the time. You have to balance it out. So just enjoy your life. You might think I'm crazy from the outside And darling I'll assure you you're right Because these are just my thoughts (indie rock music) You're right because these are just my thoughts Hey Hey You're right because these are just my thoughts",
    "transcript_keywords": [
        "rocket",
        "LastPass",
        "good",
        "work",
        "thing",
        "people",
        "BPS",
        "flight",
        "computer",
        "Austin",
        "food",
        "things",
        "flight computers",
        "passwords",
        "time",
        "lot",
        "Hey",
        "money",
        "launch",
        "works"
    ],
    "transcript_entity_values": [
        "2",
        "2017",
        "15",
        "Boston",
        "LastPass",
        "three",
        "the Food Lion",
        "Falcons",
        "Impulse D2",
        "a few months",
        "Three",
        "Falcon",
        "SpaceX",
        "Nashville",
        "September of 2017",
        "September of 2015",
        "eight",
        "Berklee",
        "roughly every two months",
        "October of 2017",
        "Austin",
        "LastPass Premium",
        "Elon",
        "Impulse",
        "Five",
        "two",
        "a few years",
        "four",
        "the four seconds",
        "Brent",
        "Today",
        "one",
        "YouTube",
        "several hundred",
        "like an hour",
        "years",
        "the old days",
        "Facebook",
        "Patreon",
        "sixth",
        "Scout V-0.6",
        "Texas",
        "12 degrees",
        "One",
        "those four seconds",
        "today",
        "the Berklee College of Music",
        "Joe Barnard",
        "9",
        "Android"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "LOC",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.04283217340707779,
        -0.019118422642350197,
        0.005492265336215496,
        -0.09706606715917587,
        0.032678086310625076,
        -0.014883703552186489,
        0.0008589357603341341,
        0.03314508870244026,
        0.014802047051489353,
        -0.0002773354353848845,
        -0.049657050520181656,
        0.04174008592963219,
        0.04846605658531189,
        -0.006029742769896984,
        -0.05600617453455925,
        0.044031064957380295,
        -0.017163801938295364,
        -0.009065593592822552,
        -0.06672081351280212,
        -0.016842547804117203,
        0.01981036178767681,
        -0.06422918289899826,
        0.01744719222187996,
        0.04954097047448158,
        -0.07481379806995392,
        0.08965199440717697,
        0.018709085881710052,
        -0.025534633547067642,
        -0.030056752264499664,
        -0.07385529577732086,
        -0.0019410407403483987,
        0.00466093560680747,
        0.014403985813260078,
        0.005332916043698788,
        0.056710466742515564,
        0.06275497376918793,
        -0.0069795167073607445,
        0.007185982074588537,
        0.000543270434718579,
        -0.08832103759050369,
        -0.05900111049413681,
        -0.08135300129652023,
        0.01368224062025547,
        0.1225685104727745,
        0.010428105480968952,
        0.05584031715989113,
        0.04762747511267662,
        -0.12163466960191727,
        0.0497715100646019,
        0.008448200300335884,
        -0.014448938891291618,
        -0.051424913108348846,
        0.107220359146595,
        -0.0637107864022255,
        -0.03512614592909813,
        -0.044013865292072296,
        0.028416741639375687,
        0.02618657425045967,
        0.02803226374089718,
        -0.06630463153123856,
        0.0656776949763298,
        -0.0817018374800682,
        -0.038210295140743256,
        0.04196608439087868,
        0.017332857474684715,
        0.060974977910518646,
        -0.02421714924275875,
        0.04938233643770218,
        0.052530787885189056,
        -0.02398115023970604,
        -0.006960063707083464,
        0.01109776459634304,
        -0.052247319370508194,
        -0.0048762219958007336,
        0.07749442011117935,
        -0.006826719269156456,
        0.02920890785753727,
        0.051666177809238434,
        0.04138263687491417,
        -0.021867187693715096,
        0.04568224772810936,
        -0.0638575404882431,
        -0.12861286103725433,
        -0.006583607289940119,
        -0.051316652446985245,
        0.014877062290906906,
        -0.03416552022099495,
        0.038343265652656555,
        0.10206082463264465,
        0.001818843767978251,
        -0.024970557540655136,
        -0.033357925713062286,
        0.038949571549892426,
        -0.04634428024291992,
        -0.04741020128130913,
        0.014720113016664982,
        -0.04250282421708107,
        -0.009947683662176132,
        -0.06532958149909973,
        0.014808452688157558,
        -0.00496596610173583,
        0.05635606870055199,
        0.08054962009191513,
        -0.06837788969278336,
        0.10167113691568375,
        -0.07092974334955215,
        0.048531562089920044,
        0.06188857555389404,
        0.053180910646915436,
        0.015240676701068878,
        -0.024511834606528282,
        0.023545758798718452,
        -0.0316779799759388,
        0.07139319181442261,
        0.0615835003554821,
        0.062301985919475555,
        -0.05764375254511833,
        0.055476490408182144,
        -0.012014222331345081,
        0.006898865103721619,
        0.04274275153875351,
        0.030874673277139664,
        0.06150317192077637,
        0.02421358972787857,
        -0.022965509444475174,
        -0.03808477893471718,
        -0.020217815414071083,
        3.391331324165039e-33,
        0.016767146065831184,
        0.008528891950845718,
        -0.06742016226053238,
        0.07285316288471222,
        0.024797586724162102,
        -0.015649108216166496,
        0.02349042147397995,
        0.03987261280417442,
        -0.09067485481500626,
        0.028159476816654205,
        0.053973857313394547,
        0.021946996450424194,
        0.019537119194865227,
        0.051549844443798065,
        0.01813467964529991,
        -0.0045132702216506,
        -0.07146688550710678,
        -0.032745152711868286,
        -0.037228528410196304,
        -0.0562058761715889,
        0.0027867427561432123,
        -0.005913107190281153,
        0.046045031398534775,
        -0.023098530247807503,
        0.058468326926231384,
        -0.03619195148348808,
        0.04819227755069733,
        -0.008229928091168404,
        0.0015592457493767142,
        0.013297125697135925,
        -0.13059338927268982,
        0.05887371674180031,
        -0.018315797671675682,
        0.05221022665500641,
        -0.0046847546473145485,
        0.06277133524417877,
        -0.024383777752518654,
        -0.09881488978862762,
        0.03832261264324188,
        0.007372790016233921,
        -0.039322689175605774,
        0.038883380591869354,
        0.004299823194742203,
        -0.05119907110929489,
        -0.04697147011756897,
        -0.05109067261219025,
        0.12228891998529434,
        0.05666828528046608,
        0.08691926300525665,
        0.02840193174779415,
        -0.053372859954833984,
        0.03259139135479927,
        -0.06942734867334366,
        -0.09811918437480927,
        0.02152121067047119,
        -0.09020569175481796,
        -0.006025377660989761,
        -0.0345584861934185,
        0.027190420776605606,
        -0.02750859223306179,
        0.014398493804037571,
        0.07846881449222565,
        -0.051604632288217545,
        0.14173880219459534,
        -0.0838664248585701,
        -0.03488874062895775,
        0.007984544150531292,
        0.03930763900279999,
        0.049988772720098495,
        0.02066110447049141,
        -0.02287519909441471,
        -0.03252657875418663,
        -0.11139236390590668,
        -0.08520983904600143,
        -0.05311199650168419,
        -0.007819985039532185,
        0.023254187777638435,
        0.07445406913757324,
        0.06360715627670288,
        0.07543537020683289,
        0.055674899369478226,
        -0.009582174941897392,
        -0.004177525639533997,
        0.08864513784646988,
        -0.04514343664050102,
        0.0442655049264431,
        0.04711868613958359,
        -0.01865920051932335,
        -0.0687846839427948,
        -0.012302176095545292,
        -0.03327331691980362,
        -0.11633916944265366,
        0.012025619857013226,
        0.006638463586568832,
        -0.048098109662532806,
        -4.488577056814918e-33,
        -0.011398829519748688,
        -0.05079090967774391,
        0.07138694077730179,
        0.0075890240259468555,
        0.057783618569374084,
        0.0016018383903428912,
        -0.019604595378041267,
        -0.06129704788327217,
        -0.020602969452738762,
        0.052382320165634155,
        -0.019581427797675133,
        0.007490773219615221,
        0.03493471071124077,
        -0.04838627204298973,
        -0.018531469628214836,
        -0.027967538684606552,
        0.03731803968548775,
        -0.05127879977226257,
        -0.027762340381741524,
        -0.08309634029865265,
        0.03448956459760666,
        0.0979643240571022,
        -0.06729152053594589,
        -0.04642314091324806,
        -0.04666569456458092,
        0.010171481408178806,
        0.02095012553036213,
        0.08711868524551392,
        -0.03905109688639641,
        -0.04822131246328354,
        -0.016450021415948868,
        -0.035295385867357254,
        -0.007256935816258192,
        0.0586298443377018,
        -0.048181258141994476,
        0.013369196094572544,
        0.06272602081298828,
        0.05560332164168358,
        -0.0018577928422018886,
        -0.06932251900434494,
        0.05240024998784065,
        0.04046735540032387,
        0.022964777424931526,
        -0.051565930247306824,
        -0.057723626494407654,
        -0.023280341178178787,
        -0.08143777400255203,
        -0.006823942065238953,
        -0.07685286551713943,
        0.012033986859023571,
        -0.014784741215407848,
        -0.046156853437423706,
        0.02046694979071617,
        -0.08484039455652237,
        -0.052992913872003555,
        0.047893378883600235,
        0.005756865255534649,
        0.055180516093969345,
        0.10323475301265717,
        -0.02961605228483677,
        0.019477102905511856,
        0.0097847580909729,
        0.0970793291926384,
        -0.01997135579586029,
        -0.09986486285924911,
        -0.054414547979831696,
        0.04166489467024803,
        0.08643241971731186,
        -0.17564064264297485,
        0.07677238434553146,
        0.01680484414100647,
        -0.010997209697961807,
        -0.013182414695620537,
        -0.027723858132958412,
        0.037765342742204666,
        -0.007884715683758259,
        -0.027010468766093254,
        -0.005744077265262604,
        -0.02011670172214508,
        -0.07251176983118057,
        0.027174679562449455,
        -0.038656800985336304,
        0.0026701660826802254,
        0.0784330740571022,
        0.09281697124242783,
        0.011736157350242138,
        -0.02186039835214615,
        -0.01795799843966961,
        0.03463832661509514,
        0.0850614681839943,
        -0.057955771684646606,
        -0.004800638183951378,
        -0.03771238029003143,
        0.09538015723228455,
        0.041710373014211655,
        -6.028783872125132e-08,
        -0.024811185896396637,
        0.007835379801690578,
        -0.05307278782129288,
        -0.017707528546452522,
        0.01995033212006092,
        0.03852074220776558,
        0.005166721995919943,
        0.015536299906671047,
        -0.048494450747966766,
        0.011255629360675812,
        0.0546744205057621,
        -0.04153881222009659,
        -0.0489242859184742,
        0.06636510044336319,
        -0.08508510142564774,
        0.016710883006453514,
        0.01650998182594776,
        -0.0467325858771801,
        -0.0570603683590889,
        0.011742666363716125,
        -0.050408776849508286,
        -0.006677759345620871,
        0.04506731778383255,
        -0.02354208007454872,
        0.052865009754896164,
        0.09177880734205246,
        -0.004808334168046713,
        0.041913580149412155,
        0.040193110704422,
        -0.036822427064180374,
        -0.025532187893986702,
        0.009300006553530693,
        -0.023741083219647408,
        -0.02266477793455124,
        -0.09649522602558136,
        -0.047085124999284744,
        0.02090512402355671,
        -0.016586188226938248,
        -0.024975350126624107,
        0.12778958678245544,
        -0.06040710583329201,
        0.020276803523302078,
        6.363808643072844e-05,
        0.07906884700059891,
        -0.011170998215675354,
        -0.03632378950715065,
        -0.09445883333683014,
        -0.045543935149908066,
        -0.015480943024158478,
        0.05105569586157799,
        0.036209482699632645,
        -0.08815427124500275,
        0.014377507381141186,
        0.1006363108754158,
        0.07171168923377991,
        0.027305973693728447,
        -0.025874115526676178,
        0.06067206710577011,
        0.011447174474596977,
        0.05228421837091446,
        0.04625483229756355,
        -0.004490407649427652,
        -0.05385730415582657,
        0.007941599935293198
    ]
}