{
    "id": "R6doWcA6q6Y",
    "title": "Kids today got it good! - Arduboy Mini",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-02-10T19:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=R6doWcA6q6Y",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 510596,
    "likes": 16112,
    "comments_count": 691,
    "description": "Check out the Vessi StormBurst and their other styles at   Use code SHORTCIRCUIT for 15% off your entire order and free shipping.  Gameboys are cool but they're sooooo big/cumbersome. If only there was something even smaller I could carry around... Luckily, Anthony is here to check out the Arduboy FX and Arduboy Mini which are two compact handhelds with over 200/300 games loaded onto it. Is this actually a viable gaming experience or is there a reason most handhelds are bigger?  Check out the Arduboy Mini:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 It's a pun, get it? 0:10 Arduboy FX 3:04 Arduboy Mini 5:44 Sponsor - Vessi 6:20 Looking at the UI 7:23 Gaming 9:07 Why does this exist? 11:45 Overall thoughts 12:28 Outro",
    "description_links": [
        "http://vessi.com/ShortCircuit",
        "https://www.arduboy.com/mini",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/masponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is going to be somewhat arduous. For you see, this video isn't quite about the Arduboy FX here. It kind of is and what we have here is a little credit card sized, what would you call it? Almost like a Game Boy that we actually looked at the earlier version of this on LTT, \"Handy Tech under a 100.\" And the problem with that one was that it could only hold one game. This adds a little chip here, which is 16 megabytes of flash to allow for up to 200 plus games. I mean obviously, depending on the complexity of the games. Okay, so we've got instructions. Yep, and we can download stuff directly to it using our computer, but we don't need a computer, unlike the old one. The old one required you to have a computer to load new games onto it, whereas this is a lot more user-friendly. The idea for this actually came from a mod that got really popular. They're actually selling that mod for I think $20 on the Arduboy store but, for now we're looking at the whole unit. It's got this nice little magnetic USB Micro to, well it's not even a full sized A, it's like just the plastic part of the A which is something I've seen before but is fairly uncommon. This means you can actually plug it in upside down but it won't hurt anything because there's no pins on that side. As for this, it's a nice solid piece of kit. Now our review or mini review, capsule review, kind of thing on LTT, said that the buttons were subjectively awesome and they misquoted us on the website as saying, \"It's objectively awesome.\" They feel pretty good. They're not the snappy like Micro Switch buttons that some things this size have. They actually feel like, you know, game controller buttons, which is actually, objectively pretty good. (Anthony chuckles) Subjectively, I feel like I could play with this but one thing to note is that the D-pad here is four distinct buttons with no rocker. So you can actually mash the whole thing all at once. Could be a good thing or a bad thing depending on how the game uses those buttons. This screen here, that is an OLED, it's got a high resolution in terms of DPI I think, but it's not a huge number of Ds, you know, not that many dots. Powers on instantly. This is gonna be difficult to film because it's tiny and reflective. There you go. This is like this little semi-3D thing and in this case we're just trying to get higher and higher. I think there was a PlayStation One game that was similar to this in concept, at least sort of, back when the 3D era of video games was kind of new, and yeah, you just fall forever when you fail. This, as cool as it is and it has a beeper, I'm not sure if you can hear it, I don't know where the volume control is, if there is one. The only thing that I don't like about this is that it's got a Micro B slot for power. Thankfully, they fixed that. In these little ESD safe baggies, the Arduino mini. I don't know how you would even begin to use this. Well, one thing that you'll notice right away, aside from it being absolutely tiny, is that there's no battery. So I can't turn this on even if I wanted to, I am told by the developer that the speaker will actually be populated on the final product and there'll be pins like a header for the battery instead of just these contact points. Oh, these buttons. Ooh, these buttons don't feel good though. The buttons themselves feel like these buttons here, they have the same kind of feel to them. They go down, they don't quite feel like a membrane, but they also don't quite feel like a clicky switch. The thing is, these are the- like buttons that are underneath these plastic pieces that are on the buttons here. So you're just directly pushing on those buttons. That being said, I mean if you broke one it's just a matter of desoldering it and putting another one on and that's the beauty of the Arduboy and I mean there's even an Arduboy Nano, out there. They don't sell it anymore. I think they actually had it for a little while in the store. But it was a community project to shrink this thing down. And it's even smaller than this, if you can believe that. There's a little peel on the screen here and this is just the bare screen unlike this where there's like an acrylic kind of overcoat over shell to protect the whole thing which I mean I could throw this in my wallet if I wanted to. It's actually credit card sized. This is very bare. In fact, you'd probably want to bring a battery bank. Now, unlike the Arduboy FX this is Type-C, also it doesn't have a power switch because it'll just power on the instant you plug it in. There is a reset button on the back here though. There's a very recessed button in here. You had to reach a pin in to push it whereas this guy is just kind of hanging out right there. Of course I have two of these. One is white, the other is black graffiti. So you can get this in a range of colors. White and black obviously. There's also I think like red, yellow, green, maybe blue and they all have the option I think, of getting graffiti. So they're just, yeah, so basically just the Arduboy community developers, just graffiti tags of those guys, which is awesome, really. Which one should I power on? While we think about that, I'll tell you about our sponsor. Thanks to Vessi footwear for sponsoring this video. Meet your new everyday shoes. Vessi Footwear claims that their Dyma-Tex technology makes their shoes 100% waterproof and keep your feet cool in the summer and warm in the winter. And as far as we can tell, that's true. Their new StormBurst shoes combine the comfort of a sneaker with the grip and coverage of an outdoor boot. Vessi's added additional layering for additional warmth as well as extra grip to prevent you from slipping and sliding in unfavorable weather conditions like we experienced not too long ago. The StormBursts are feature packed and they'll make great gifts with the unpredictable spring weather that's coming up and use code SHORTCIRCUIT to get 15% off your order. Shall we power it on? I'm told there's something special. Here we go. (Anthony laughs) That's perfect. And yeah, we have the same menu as before. Tabletop, Racing, RPGs, yeah, there's RPGs that are like kind of- like full RPGs. Game pad. Oh right. You can plug this into a PC and pass the game pad through to your PC because it's just a microcontroller it can do whatever you want. Where's the previous version? The FX, had over 200 games. This, has over 300. Although I'm not sure if all 300 are loaded onto this pre-release version. Multiple screensavers- Uh-oh. Uh-oh. The power draw for this thing is so low that the battery bank shut off. Oh, the battery bank's actually kinda low too, but like it's not in danger mode. It just shut off cuz it thinks there's no load on this thing. I'm gonna need the plugin adapter. _ For you, sir. - Thank you. Alright, let's go ahead and play some games. \"Catacombs of the Damned!\" Now I saw this briefly on the Kickstarter and this is actually a fully 3D game. Okay so that's attack and holding that strafes. Okay. It's really difficult to see much going on here. Also there's like, yeah this is like a- almost like a full 3D engine, which is kind of weird cuz like when I turn the whole thing kind of tilts and of course just like with the Playdate this thing doesn't have multiple different shades of black and white. It's literally just black and white. So that's part of how I can manage all of that. But it's still really impressive and you can learn to do it for yourself. Like this was actually coded by not somebody who's like making the Arduboy but like a community member. If we want to go back, there's a reset button on the back here and I can just hit that. I think if you hit I guess A or whatever this bottom right button is supposed to be, Enter or Select, it'll just bring you to the last game you played which in this case, \"Catacombs of the Damned!\". The bullets are way too small for me to see reliably in like, at this angle and from this far away from my face. It's, like I said, surprisingly good in terms of like resolution and in terms of brightness as well. Well okay, it's not super studio light-ey in here. We've got got a light over there and I can see this just fine when I get the angle right so that there's no reflections. The mini is more like a tool/less hectic gameplay experience kind of thing. And I guess that leads us to, \"Why?\" Right? Like this is already super small. Like I could probably literally like I've got a Ridge Wallet! And I could probably fit it in there. Yeah, there. These are significantly less expensive. This is like, this has got a stamped aluminum back, it's got an acrylic front, it's got the buttons. It's significantly more correct in terms of like- it's a complete console experience, sort of. Whereas this is the bare bones, this is meant to be hackable and it's meant to be a really low cost way to get into this. Like this is not expensive, it's like 60 bucks but this is like 30 bucks. If I had access to this when I was in like junior high, even maybe elementary school then it could have changed the course of my life, quite significantly. I could have been like a coder like somebody who creates programs that other people use. And I admire that complete dedication to just making things out of thin air a lot. And this is doing both the hardware and the software. You can actually build this yourself if you want to or something like it. There are classes out there that do put these together on breadboards, like solderless breadboards. And it just gets you more involved and that's something that you don't really get so much with a completed product like this. You've got, you know, it's fully contained and yeah it looks kind of hacky and cool cuz it's got the- you can see all the components and you know you can build one of these yourself too, but it's not quite the same experience as this. It's obviously not going to be for everyone. Like I said, I probably wouldn't carry this around with me. I would probably destroy it instantly. Whereas this is more, I guess my speed. This is something that is open source that plays open source software and you know, I can hack. I can go into the games and adjust parameters, change the jump heights of characters or, you know, make it different from how it like normally is. I'm kind of into hacking. Would I buy it? I mean, maybe not me. It is really, really amusing how small it is. It's smaller than the tag the banana comes with. Smaller in every dimension- well, okay, not every dimension. It's not thinner, but it's not that thick. So yeah, it's probably not for me but like it's super awesome. I love it. So should you want to buy one, if you get in line now then you should get yours in June or you should at least be able to to buy one in June. I mean, I personally hope that you do think that this is worth buying because stuff like this just really makes me happy, you know. Maybe it makes you happy too. Like we didn't really go into super detail in the Arduboy back in that \"Handy Tech under a 100\" episode and I don't feel like I went into sufficient detail in this, to kind of really sell it in terms of what it's supposed to be for, you know, it's more of a surface level thing. And if you want to see more of this, just let us know down in the comments below, like seriously, it's definitely something that I want to look into more. For now though, thanks for watching. Make sure you get subscribed so you don't miss other videos like this one, should we do more in the future or unlike it. There's plenty of stuff here.",
    "transcript_keywords": [
        "thing",
        "buttons",
        "kind",
        "Game",
        "Arduboy",
        "games",
        "feel",
        "yeah",
        "button",
        "Micro Switch buttons",
        "power",
        "back",
        "Game Boy",
        "good",
        "thing kind",
        "battery",
        "game controller buttons",
        "terms",
        "Micro",
        "Game pad"
    ],
    "transcript_entity_values": [
        "SHORTCIRCUIT",
        "up to 200",
        "the Arduboy FX",
        "100%",
        "Dyma-Tex",
        "One",
        "one",
        "June",
        "Arduboy Nano",
        "20",
        "Racing",
        "Handy Tech",
        "60 bucks",
        "the summer",
        "Catacombs of the Damned",
        "Vessi Footwear",
        "100",
        "Kickstarter",
        "LTT",
        "Handy Tech",
        "over 300",
        "Arduboy",
        "Arduboy",
        "StormBursts",
        "over 200",
        "Anthony",
        "Arduboy",
        "two",
        "StormBurst",
        "four",
        "30 bucks",
        "USB Micro",
        "FX",
        "16 megabytes",
        "15%",
        "ESD",
        "PlayStation One",
        "all 300",
        "Arduino",
        "Vessi",
        "Micro Switch",
        "Arduboy"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "FAC",
        "ORG",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.014732169918715954,
        0.023267488926649094,
        0.024403998628258705,
        -0.10082408785820007,
        0.00128514866810292,
        0.06211130693554878,
        -0.0053095631301403046,
        0.10042867064476013,
        -0.06166304275393486,
        0.0571330189704895,
        0.009742550551891327,
        0.06663879007101059,
        -0.0083366883918643,
        -0.029916048049926758,
        0.07555509358644485,
        -0.02052214741706848,
        0.14103618264198303,
        -0.039922185242176056,
        0.039957936853170395,
        0.0047521633096039295,
        -0.089235320687294,
        -0.05699286609888077,
        -0.021690072491765022,
        -0.008688281290233135,
        0.0271762628108263,
        0.05609006807208061,
        -0.0783131942152977,
        0.0030813654884696007,
        0.015349644236266613,
        -0.0653383731842041,
        0.027045687660574913,
        0.11116923391819,
        0.01554613932967186,
        -0.05287402495741844,
        0.015667352825403214,
        -0.004662342835217714,
        -0.022508125752210617,
        -0.04087943583726883,
        -0.06289646774530411,
        -0.04859558492898941,
        -0.019761012867093086,
        0.031368955969810486,
        0.0025393690448254347,
        0.01440624613314867,
        -0.009715843945741653,
        -0.05310394987463951,
        0.01300814189016819,
        -0.016773493960499763,
        0.03818564489483833,
        0.05228636413812637,
        0.07026247680187225,
        -0.059810589998960495,
        0.11444135010242462,
        0.013016060926020145,
        -0.02835676446557045,
        -0.04410580173134804,
        -0.06831389665603638,
        -0.0649707019329071,
        0.010689291171729565,
        0.03830500692129135,
        -0.017002644017338753,
        -0.07592698931694031,
        -0.0244889073073864,
        0.017256755381822586,
        0.007329892832785845,
        -0.061777323484420776,
        0.052533358335494995,
        0.02175193838775158,
        -0.03201627731323242,
        -7.533554889960214e-05,
        0.026646945625543594,
        0.05709420517086983,
        -0.04350615292787552,
        0.16996674239635468,
        -0.010169384069740772,
        0.0077180685475468636,
        0.0654253289103508,
        -0.023696215823292732,
        0.004237732384353876,
        0.05655350536108017,
        0.015558681450784206,
        -0.041871458292007446,
        -0.014865705743432045,
        -0.02326895482838154,
        -0.006160115823149681,
        -0.04321921244263649,
        0.008880644105374813,
        -0.04879545420408249,
        -0.07363934814929962,
        -0.05817708745598793,
        -0.013009360991418362,
        0.09396787732839584,
        0.09285788238048553,
        0.04637780413031578,
        -0.03420987352728844,
        -0.026873625814914703,
        -0.06229190155863762,
        -0.041480083018541336,
        -0.11016928404569626,
        0.04022657871246338,
        0.09326595067977905,
        0.08500757068395615,
        0.09921945631504059,
        -0.03245469927787781,
        -0.019942790269851685,
        -0.03884747624397278,
        0.0037328642792999744,
        -0.009336842224001884,
        0.03289928287267685,
        0.015614491887390614,
        -0.11940675228834152,
        0.03031686693429947,
        -0.036148346960544586,
        -0.019277583807706833,
        0.0005604604375548661,
        0.011064231395721436,
        -0.01574079506099224,
        0.035852719098329544,
        0.010388417169451714,
        0.0001395623985445127,
        0.00834962259978056,
        -0.004141468554735184,
        -0.0008033632766455412,
        0.01320810616016388,
        0.04176538437604904,
        0.025675054639577866,
        -0.011539659462869167,
        4.246951988951489e-33,
        -0.0027436665259301662,
        0.06300222128629684,
        -0.06645990908145905,
        -0.01706070266664028,
        0.046019721776247025,
        -0.01697651296854019,
        0.08969194442033768,
        0.016190864145755768,
        -0.0841422751545906,
        0.017992710694670677,
        -0.06034011393785477,
        0.0708349198102951,
        -0.0852668508887291,
        0.0945299044251442,
        0.14043138921260834,
        -0.10765843838453293,
        -0.0025735117960721254,
        0.0052795070223510265,
        0.013190725818276405,
        -0.02779969945549965,
        -0.05151909589767456,
        -0.019670823588967323,
        0.03271736949682236,
        -0.005035212729126215,
        0.050665631890296936,
        -0.02506321482360363,
        0.003684594528749585,
        0.014171106740832329,
        0.07163282483816147,
        0.018593301996588707,
        -0.09335719048976898,
        -0.06794125586748123,
        -0.04309461638331413,
        -0.062396541237831116,
        0.004387788474559784,
        -0.04998525232076645,
        -0.03675856813788414,
        -0.07672802358865738,
        -0.013055146671831608,
        -0.0019620482344180346,
        -0.0272770207375288,
        0.0336751826107502,
        -0.13470837473869324,
        -0.05775024741888046,
        -0.024215897545218468,
        0.02348247356712818,
        0.05276697501540184,
        -0.010301444679498672,
        -0.024940049275755882,
        -0.03454076871275902,
        -0.040446698665618896,
        0.0031598112545907497,
        -0.09916039556264877,
        -0.029473206028342247,
        0.009829466231167316,
        -0.06450009346008301,
        0.016864513978362083,
        -0.037540655583143234,
        0.041508130729198456,
        -0.014900918118655682,
        -0.004806976765394211,
        0.0010844431817531586,
        0.025158746168017387,
        0.03276216983795166,
        -0.08733226358890533,
        0.06830006837844849,
        0.1011204794049263,
        -0.02159237116575241,
        -0.0076899160631000996,
        -0.02573683112859726,
        0.0090441033244133,
        0.017809582874178886,
        0.045214831829071045,
        -0.0811515524983406,
        0.15538035333156586,
        0.021609758958220482,
        -0.0688077062368393,
        -0.020729517564177513,
        -0.00904681347310543,
        -0.02609521523118019,
        -0.010587538592517376,
        0.018213562667369843,
        0.0370761938393116,
        0.0632290244102478,
        -0.030802380293607712,
        -0.05242675170302391,
        0.06546371430158615,
        -0.043719034641981125,
        -0.04829516261816025,
        0.009084753692150116,
        -0.051757074892520905,
        0.020166931673884392,
        -0.06147373095154762,
        0.05739077925682068,
        -0.0014542125863954425,
        -5.202709711406628e-33,
        -0.03113081119954586,
        -0.014724254608154297,
        -0.008875638246536255,
        0.021421344950795174,
        -0.02770852856338024,
        -0.007718608248978853,
        0.05952709540724754,
        0.06774161756038666,
        -0.04617789387702942,
        -0.03715725615620613,
        -0.06613864749670029,
        0.06986812502145767,
        -0.04141192510724068,
        -0.042065467685461044,
        0.013997609727084637,
        -0.07704590260982513,
        0.05948502942919731,
        -0.023693768307566643,
        0.11189320683479309,
        -0.12304656952619553,
        0.1694525182247162,
        0.015300617553293705,
        -0.03367331251502037,
        0.01859104260802269,
        0.014961011707782745,
        -0.023111259564757347,
        -0.01844916120171547,
        -0.056131407618522644,
        -0.04984639212489128,
        0.03973230719566345,
        0.017431458458304405,
        -0.03333137929439545,
        0.03972679376602173,
        0.030531082302331924,
        0.015929030254483223,
        -0.0061363838613033295,
        0.02123132161796093,
        0.10490451753139496,
        -0.01577007956802845,
        -0.04379504919052124,
        0.0029399057384580374,
        -0.040798138827085495,
        -0.015144904144108295,
        -0.03801652789115906,
        0.051136694848537445,
        -0.05691353604197502,
        -0.04327089712023735,
        -0.045418087393045425,
        0.04190763086080551,
        0.0048637413419783115,
        -0.03541461378335953,
        -0.0034950843546539545,
        0.04711628332734108,
        -0.04351558908820152,
        -0.024481138214468956,
        -0.10018740594387054,
        -0.060969483107328415,
        -0.04166708514094353,
        0.018041091039776802,
        0.040769822895526886,
        0.034438688308000565,
        -0.05612827092409134,
        -0.10021460801362991,
        -0.022819096222519875,
        -0.014621561393141747,
        0.0043650781735777855,
        0.05642378330230713,
        0.016339674592018127,
        -0.02737821266055107,
        0.004272882826626301,
        0.0021358325611799955,
        -0.0007050975691527128,
        0.07605277746915817,
        -0.008979995734989643,
        -0.03700278326869011,
        0.08991647511720657,
        0.0571843646466732,
        0.028762515634298325,
        0.05434771999716759,
        -0.029923800379037857,
        -0.003796920645982027,
        0.0456700325012207,
        -0.0012850859202444553,
        -0.030338233336806297,
        -0.014356730505824089,
        0.028052618727087975,
        0.03466663137078285,
        -0.029539097100496292,
        -0.06494200974702835,
        0.04174703732132912,
        0.014227193780243397,
        0.09781147539615631,
        0.06402794271707535,
        0.021321242675185204,
        0.04184854030609131,
        -5.869789632129141e-08,
        0.038925450295209885,
        0.02236674353480339,
        0.017327582463622093,
        0.04462101310491562,
        -0.021443627774715424,
        -0.033330585807561874,
        -0.03066917136311531,
        0.024951903149485588,
        0.08605857938528061,
        0.07144669443368912,
        -3.473119795671664e-05,
        -0.04214182123541832,
        -0.019467512145638466,
        0.022563934326171875,
        0.054742686450481415,
        0.009213916026055813,
        -0.013303663581609726,
        -0.06749193370342255,
        -0.036782968789339066,
        -0.025196433067321777,
        0.05938483774662018,
        0.09513296186923981,
        0.04617781564593315,
        -0.059224050492048264,
        -0.004940631799399853,
        -0.03671058639883995,
        -0.03403425216674805,
        0.021910410374403,
        -0.0105328019708395,
        -0.0383855402469635,
        -0.058542102575302124,
        0.04200580343604088,
        -0.05187563970685005,
        -0.016866549849510193,
        0.02495846338570118,
        -0.08119605481624603,
        -0.0593315064907074,
        0.08583537489175797,
        0.04358091950416565,
        -0.015698200091719627,
        -0.04850965738296509,
        -0.13019387423992157,
        -0.014891318045556545,
        -0.0203546229749918,
        0.039523717015981674,
        -0.0004769805818796158,
        -0.02065572701394558,
        -0.09602224081754684,
        0.00015044031897559762,
        0.017223449423909187,
        -0.0014409812865778804,
        -0.020494820550084114,
        0.03955507650971413,
        -0.02156880684196949,
        0.09802985936403275,
        0.027879435569047928,
        -0.04954875260591507,
        0.026275448501110077,
        0.004179257899522781,
        -0.0050950245931744576,
        -0.02234835736453533,
        -0.06865473091602325,
        -0.11505884677171707,
        0.14824186265468597
    ]
}