{
    "id": "R7-fs1dISRI",
    "title": "This watch has a SIREN! - Apple Watch Ultra",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-10-07T01:21:54Z",
    "video_url": "https://www.youtube.com/watch?v=R7-fs1dISRI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "apple",
        "watch",
        "ultra"
    ],
    "views": 384347,
    "likes": 13961,
    "comments_count": 696,
    "description": "Get a dbrand skin or else at   Apple's new Apple Watch ULTRA sets lofty goals by aiming for divers, hikers, and extreme sport lovers, but does Apple reach their goals? Though not all the features are available, Jake is taking a look at this new watch to see if it could possibly be worth it's high price tag.  Buy an Apple Watch Ultra:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The last unboxer 0:19 Unboxing and band impressions 2:58 Unboxing the watch 4:04 Initial design and feature impressions 6:35 Do regular Apple Watch bands fit? 6:59 Sponsor - dbrand 7:39 Specs and battery life 9:53 Testing the siren 10:09 Trying out the depth gauge 12:23 Speaker and mic impressions 13:07 New fancy watch face 13:57 Action button and waypoints 15:09 Overall thoughts 15:42 Outro",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://geni.us/srit",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- No, Jake, you can't help you. But why Yoda? Because you suck. - [Bell] Oh God. - Oh, but you know what doesn't suck? Hopefully this, I'm actually pretty excited for this. I got a banana for scale already. Look, relative to the box. The box is, you know, one banana. But, that's not what we care about. What we care about is inside. This is the Apple Watch Ultra. It's not the Pro-Max or the Max or the Plus, it's the Ultra. Wow. Look at that. This is an unboxing experience. It's almost like they expect that people will unbox this and show it on camera. We got a little Apple Watch book here. I'll check that out in a sec. And there's the watch, and oh, our band. Hey, that, that's pretty What mountain is this you think? Do you know? You know what mountain this is? - [Andy] A snow mountain. - Snow mountain. Woo All right, let me look at the book. Ah, there's the, the three different ones you can get that are all the same. So you got the Alpine band, which is what we got. There's an ocean band and a trail band. I don't know if regular Apple Watch bands will work on these watches. I would like to be able to use other bands. So, it would be kind of crappy if this is the only option you had. Open your box. I'm getting to the box, you're telling me how to unbox. Ooh, look, there's all this information here. This will be useful later. Ooh, what should I open first? The band or the watch? - [Andy] Band. - Band. Really? I was expecting you guys to say watch. Wow, that looks beautiful. Holy crap. You know, it looks beautiful. It doesn't feel like the most premium thing ever. These are titanium end bits and the clasp, which is cool. Oh, I see how it's adjustable. There's little loopy guys inside and you take this out and you slide it into the loopy boy of your choice. Which loopy boy do you choose? It's nice and stretchy, which is cool. It's very size adjustable. The orange looks sexy. I mean, of course it's gonna match the orange action button on the side of the watch, which we'll get into in a sec. I'm gonna open the other band we got here first though. This is the ocean band for those divers. Apple's put a very large emphasis on diving for this watch. It's, it's rated for actual diving. It's got a depth gauge, which we'll get into later and, and like a dive computer app, which I don't think is out yet. But also, there is like a dive ocean band. Whoa, that is weird. Look at the holes. That is cool. This feels nice. It's very like, soft rubber. This doesn't feel like a super huge band, but actually I guess the watch has to go in there, so. Is there different sized of the, the bands or is there just one band? Yellow Ocean band, Apple Watch 49 millimeter. I think it's just the one. Oh, I see. When you've got the extra kind of flappy bit, you don't want that flapping around. I mean, unless you do, but I don't. So, you put this little clasp on here. Oh man, this is high tech, brother. And the little ridges in the rubber actually keep it from sliding out. That's, that's a nice design. Speaking of which, just clean up a bit. Let's open the watch. We should get some dry ice so we can put it in the box. So when you open the box like, steam comes out, that'd be cool. It's a little bit different than the regular boxes. The Apple Watches are usually really long with the bands attached or underneath. But this one, it's a little more eloquent, I would say. Whoa. Braided cable. Seeing an interesting change in the industry here. Everyone seems to be going to braided cables. Anker's doing braided cables. Apple's doing braided cables. They were kind of like a thing in the past, but it kind of got phased out and now they're, they're making a comeback. - [Plouffe] It's not braided, it's sleeved, Jake. - Sleeved, What do you mean? This got a braid to it. - [Plouffe] No, it's sleeved. - It's sleeved. Well I don't care. - [Plouffe] Braiding's the whole thing. You can like make it. - Sleeved. Whatever. It's a charger. You put your watch on the charger. Let's see. Mm, that's upside down. Ooh, that's got a nice, wow. I kind of crap talked the Galaxy Watch a little bit for not being strong enough. That's on there brother. USB-C, which is nice. Obviously, there's no charger in the box cuz it's Apple. If you already have Apple products you're gonna have a USB-C charger anyway, so you're probably okay. Wow, this thing is heavy. It feels premium. Holy crap. I wasn't sure about it when I saw the product photos, but it actually kind of looks cool. Looks, looks a little more industrial. It's large man, don't get me wrong. It's very large. If you have a petite wrist, you might not wanna rock this watch. Now, this is a series 7 45 mil and this is a 49 mil case. So, we've got five extra mils. Now, there's a lot of things that are different on the ultra compared to the previous watches. You're getting a few things that are better. Specifically, there's a triple microphone array over here. We've got a depth gauge over here for up to 40 meters of depth tracking, if you're somebody who likes to scuba dive. There's a new bigger digital crown with a little bit more aggressive grooves to make it easier to use with gloves. And, there's also a raised side button, again, to also make it easier to use with gloves. Now controversially, at least according to the internet, is this new like side thing that sticks out. Now, Apple says this is to protect against edge impact, so you don't snag your crown on something if you're going through the woods, cuz you're an adventurer. That's the only person that buys an Ultra Apple Watch. On this side there's the new action button in bright orange. That's like a configurable button you can set to do many things like, start a workout or customize your workout or start a trail ride and all that sort of stuff. There's a dual speaker array that's up to 40% louder than the series eight along with a new siren. It's exactly what it sounds like it, it literally makes loud noises. But, when you're out in the woods or off the grid somewhere and you need help, this can be heard up to 600 feet away, apparently. So, we'll definitely have to try that out later. I'm sure it's really annoying sounding, but it could save your life and I think that's that's pretty cool. Compared to the series seven, the series eight and the Ultra also have a temperature sensor, which is cool. Apple talked a lot about that being helpful for women's health tracking, which is super awesome. Compared to like a series seven or series eight, which has a kind of rounded glass, the Ultra has a perfectly flat sapphire crystal on the front and the titanium case on the Ultra is raised around the crystal to protect from side impacts, which is pretty cool. My series seven is super scratched around the edges. So, this is definitely something I could appreciate. And man, I mean overall, I think it looks pretty cool. It looks very like, I do things with my watch. I'm, I'm an adventurer. I scuba dive. What do you think? What do you think looks better? - [Andy] The orange. - The orange matches the orange on the crown and the button here pretty well. But, the yellow's cool too. I wanna see if a regular band fits though. Let's see. Oh dude, sick. Okay, screw these watch bands. I like mine. They didn't really talk about this at all, but it does fit with Sandra watch bands, which is super awesome. Oh, I'm so happy. Oh damn, I might buy this now. (laughing) Oh, it's turning on. Ooh, we gotta hide that, because first we need to talk about our sponsor, Dbrand. It's always Dbrand. You know usually, in sponsor spots you're supposed to be happy, but whenever it's Dbrand I'm like, those guys, they make good products, but boy are they bad people. Dbrand doesn't have any skins for the Apple Watch or the Apple Watch Ultra. I mean, why would you want to cover this beautiful titanium right? But, they do have skins for your iPhone and AirPod Pros. Their skins are made from high quality 3M vinyl that are laser cut to fit perfectly on your device. They're patented adhesive is guaranteed to leave no residue on your device if you wanna change the skin down the road. And their grip cases are super durable and fit nice and snug. So, buy yours today using the link down below or don't because *** those guys. Apple also says this watch can function in temperatures as low as negative 20 Celsius and as high as 55 Celsius. But, most electronics are sort of in that range anyways. So, if you take your non Ultra into minus 20 it'll probably also work. It's IP6X, dust resistant and mil standard 810 H rated. Like all of the Galaxy watches, even the standard ones. The Pro, is it the Pro, did they call it the pro? They called it the Pro. Galaxy Watch five, four, and the Five Pro are all that same military spec, but the series eight is not. It's only the Ultra, which I mean, it's not to say that they're not durable, but they don't go as far as to rate all of them with that spec. On the Ultra model, you're also getting a better screen to say 2000 nit peak brightness display, similar to the iPhone 14 Pro. It's super bright, which is great when you're outdoors and doing outdoorsy stuff, like Apple Watch people do. The resolution for those that are wondering is 502 by 410 pixels and that's a roughly 338 pixels per inch density, which is super nice, it looks wonderful. Lots of bright colors. You're getting in that fancy O-LED display. In terms of processor, the Ultra's using the same chip as the series eight, so that's the S8, series eight SoC, which is a dual core processor, but it does also have dual frequency GPS to be a little bit more accurate, for those high fitness and adventurey types that, if you wanna track your workout very accurately, or you're following a route on a triathlon or something like that. Like previous Apple watches, this one comes in a cellular version, except that's the only version. So, if you buy this thing, you're getting cellular, you don't have to use it, I guess, you can just connect it to your phone and use the regular Bluetooth connection. But, if you're out on the go this one is going to have cellular, which is pretty sweet. Similar to the Galaxy Watch Pro, this one's gonna have a lot bigger battery than the regular series eight. This one's 542 milliamp hours, and it's rated for 36 hours of battery life. I will mention that the 36 hour battery life test was done with only eight hours of LTE. So, if you don't use LTE you might be able to get a little bit more than that. Or if you do use LTE, like your phone is not with you, you're on a run, you're only gonna get 18 hours of battery on the LTE, which is still pretty good. Apple also talked about a new low power mode, that can extend the battery life on this watch up to 60 hours, but that's not out yet. So, you're gonna have to wait for a future software update to get that functionality. Ooh, okay, let's play with it now. I wanna try the siren first, cuz that seemed like the most chaotic thing. Okay, compass backtrack, emergency call or siren. (alarm sounding) Oh wow. Is that SOS? - [Andy] Yeah - I got the siren mode going and Jake's gonna run to the street and see if this works. See how far you can hear me. Can can you still hear it? - [Jake] Yeah - It's, It's kind of annoying but I guess if you're dying, that you're not gonna be worried about that. Can you still hear it? - [Jake] Oh, it's like it right next to me. - You see how far he is? - [Jake] It's getting pretty faint. - Can you hear it? I'm seeing a thumbs up. It's pretty loud. I'm sure he could hear this way further than he is even. - [Jake] I can still hear it and we are at the limit of where I can walk, so I guess that's it. - Wow, that was loud. Let's see how loud it is underwater. Just kidding. I do want to try the depth sensing thing. 0.1 meters. It's only supposed to be accurate down to the meter so I wouldn't expect that this is accurate at this level. What else does it say? The water temperature is 23 degrees. Feels a little, yeah, it's, it's about, it's about 22 degrees on the butt dino or the hand dino. Can I still use it underwater? How does that work? Touch screen, not so good underwater. For the diving folks out there, the Apple Watch Ultra's depth gauge is EN 13319 compliant. I'm not sure on the exact specifics of what that means, but it is an internationally recognized standard for diving gauges. So, Apple included that. Now, another thing for the divers out there, Apple is planning on releasing a fully featured dive computer app. I imagine it'll probably come around the same time as the low power mode. So, if you are a diver, this could be a pretty cool watch for you. I have seen a couple reviews say that it's pretty good, but is missing a few features. So, if you are into that sort of thing, definitely check out some more diving oriented reviews. But, at least for me in my bucket of water it seems to work pretty well. Interestingly enough, the ocean band kind of holds water so when you get outta the water, it's full of water. But, I guess you'll also be full of water, so that doesn't really make that much of a difference. - [Phone voice] Subscribe to LMG Clips. Subscribe to LMG Clips. Don't do that. Buy buy a mousepad at lttstore.com. Screw LMG Clips - [On phone] Classic, buy the wind hoodie. - Buy the wind hoodie. Dude, this sound, this thing sounds really good. - [On phone] You sound pretty decent as well. I would've assumed that you are like on a phone, like phone to your face. - Do you, Do you hear noise at all? I'm blowing at it. - [On phone] Yeah. Sounds like you're outside. - But can you still hear me while I'm blowing wind at it? Do I still sound good? - [On phone] You're not doing both at the same time. - I am doing both at the same time. - [On phone] Wow. - Here, let's switch. Let's switch spots so they can hear me. (broken audio) Hi, this is what I sound like. Does it sound pretty good? - Wow, you sound just like Jake. That's crazy. - No way, no way. Wait. Which Jake? - Yeah - The fancy compass face that I've been showing you is called the way finder face. And Apple designed it specifically for this watch. It features up to eight complications as Apple call 'em. So, you can put like here, let's see. You can have a compass elevation. There. You can have the UV index, you can have a timer, you can have compass waypoints or your parked car. You can have a compass, you can have a temperature. You can have so many things visible. And, what you can also do is put it in night mode. You just lower the gauge. Look at that. It's all red now. The nice thing about red colored light is it doesn't force your eyes to adjust as much. So, when you're in a low light setting, having a red screen is really helpful. You probably have noticed that cop cars, the lights inside of them at night, they're red. It looks nice. I just walk around like this all the time. Looks like I'm like a terminator. Err. Pew pew. All right, then here's the last thing. The action button. Okay, we got a few options here. Workout. I'm assuming that it starts and stops a workout. You got a stopwatch, waypoint, backtrack, die, flashlight and a shortcut. Let's do flashlight. Cool. It makes the watch into a flashlight. Look at how, you see that? It's a little bit brighter. Waypoint create. Cool. I made our waypoint, save. Can I set like a name for it? Oh yeah, you can label it. With the waypoint feature, you just hit the action button, it saves your current coordinates and you can, you can set a color. Let's try purple. We'll call this one Short Circuit set. Dictation is disabled. Short curb. That's what it is. And then you see on my compass there's a little indicator. There's a little purple indicator right there, that points me in the direction of my waypoint. So, say you're camping or something, you could set a waypoint at the, the, the spot where you took a poop, so you don't step on it, or a spot where your, your camp is. And then you just pull up the compass and you can walk right to it. - [Andy] Make sure, make sure you set them at the different color. - Yeah. Make sure you set the colors properly. What Andy said, whatever. Anyways, this is the Apple Watch Ultra. I think it looks pretty sick, despite what the internet thinks. It feels really premium. I like that the, the case protects the edge of the glass, cuz mine's super scratched. And the fact that it can use the regular bands. Oh, I forgot that I didn't even mention the price. It's, it's steep. Mind you, it comes to the watch band. Fancy watch bands. They, they are titanium, the case is titanium, that's gonna drive up the price, but you're looking at 799. That's a lot of Canadian monies. It's like 1100 Canadian dollars. Maybe I won't buy this. Okay, I can just borrow it from work. Right? That's all I've got for you guys today. If you like this video, maybe check out the Galaxy Watch five and five Pro unboxing I did a few weeks ago. That, those are pretty cool. The Ultra or the Pro Galaxy watches. Very similar to the Ultra and, and how they've marketed it and how they've set it up. Hit that subscribe button. Hit the like button and I'll see you later. Man. Look guys, I know how to use watch bands.",
    "transcript_keywords": [
        "Apple Watch Ultra",
        "Apple Watch",
        "Watch",
        "Apple",
        "Ultra Apple Watch",
        "Watch Ultra",
        "Watch bands",
        "Apple Watch bands",
        "Ultra",
        "band",
        "Galaxy Watch",
        "pretty",
        "Galaxy Watch Pro",
        "regular Apple Watch",
        "thing",
        "cool",
        "Pro",
        "bands",
        "Apple Watch people",
        "Watch Ultra depth"
    ],
    "transcript_entity_values": [
        "S8",
        "mil",
        "49 millimeter",
        "USB",
        "0.1 meters",
        "Jake. - Sleeved",
        "Max",
        "about 22 degrees",
        "SOS",
        "23 degrees",
        "36 hours",
        "the Galaxy Watch Pro",
        "up to 600 feet",
        "18 hours",
        "The Apple Watches",
        "2000",
        "Short Circuit",
        "roughly 338",
        "five extra mils",
        "542 milliamp hours",
        "810",
        "today",
        "up to 60 hours",
        "LTE",
        "the Apple Watch",
        "Ultra",
        "49 mil",
        "3M",
        "Alpine",
        "36 hour",
        "Andy",
        "the Galaxy Watch",
        "a few weeks ago",
        "the Apple Watch Ultra",
        "as high as",
        "first",
        "Galaxy",
        "1100 Canadian dollars",
        "LMG Clips",
        "SoC",
        "Mm",
        "eight",
        "Galaxy Watch",
        "Apple Watch",
        "7 45 mil",
        "Jake",
        "one",
        "iPhone",
        "Ultra Apple Watch",
        "sec",
        "Ultra",
        "799",
        "Sandra",
        "the Apple Watch Ultra's",
        "Ultra",
        "502",
        "20 Celsius",
        "five",
        "minus 20",
        "Apple",
        "only eight hours",
        "Five",
        "seven",
        "Yellow Ocean",
        "Anker",
        "three",
        "up to 40%",
        "up to 40 meters",
        "night",
        "410",
        "Classic",
        "Yoda",
        "Dbrand",
        "up to eight",
        "Canadian",
        "four",
        "USB-C",
        "IP6X"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "NORP",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "NORP",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.030046259984374046,
        -0.021189184859395027,
        0.02908603474497795,
        -0.03645005822181702,
        0.1154705062508583,
        0.036758411675691605,
        0.060266733169555664,
        0.005569294095039368,
        -0.00993658322840929,
        -0.005146152339875698,
        -0.01895655132830143,
        -0.00808701477944851,
        -0.023145897313952446,
        -0.01369419600814581,
        0.04394211247563362,
        -0.052113957703113556,
        0.11862889677286148,
        -0.07552754133939743,
        -0.05940666422247887,
        0.022827744483947754,
        -0.006315356120467186,
        -0.0479363277554512,
        0.07434624433517456,
        0.101076640188694,
        -0.01474588830024004,
        -0.014607577584683895,
        -0.037016432732343674,
        -0.051096752285957336,
        -0.04516381397843361,
        0.004086695611476898,
        -0.03905070200562477,
        -0.008489367552101612,
        -0.01063434686511755,
        0.020254768431186676,
        0.00017128796025644988,
        0.0009324513957835734,
        0.03559790551662445,
        -0.052112877368927,
        -0.11461382359266281,
        -0.031443189829587936,
        0.0009750922326929867,
        -0.05000302568078041,
        -0.018731214106082916,
        0.07298651337623596,
        -0.007342129945755005,
        0.016564439982175827,
        0.02044503204524517,
        -0.004732087720185518,
        -0.013992087915539742,
        0.06693728268146515,
        -0.027885811403393745,
        -0.09533429890871048,
        0.08428100496530533,
        -0.04861623793840408,
        0.04117344692349434,
        0.03288494050502777,
        -0.0418425016105175,
        -0.04587763920426369,
        0.08003703504800797,
        -0.01195560023188591,
        0.07133562117815018,
        -0.06805466115474701,
        -0.03967343643307686,
        0.05481230467557907,
        -0.011476493440568447,
        -0.04295363277196884,
        -0.10470390319824219,
        0.07938147336244583,
        0.013890820555388927,
        -0.04127438738942146,
        0.05236316844820976,
        0.016600141301751137,
        0.08990967273712158,
        0.07798254489898682,
        0.04352141544222832,
        -0.002546617528423667,
        0.06445059925317764,
        -0.07036612927913666,
        0.004167261533439159,
        0.024773214012384415,
        -0.052365612238645554,
        -0.09587371349334717,
        0.006062113214284182,
        0.00047369461390189826,
        0.06859985738992691,
        -0.03160817548632622,
        0.031225405633449554,
        -0.04290999472141266,
        -0.04526650533080101,
        -0.01633770391345024,
        0.004892731085419655,
        0.05974072590470314,
        -0.003536526346579194,
        -0.006221999879926443,
        -0.07381374388933182,
        0.06334022432565689,
        -0.03370416536927223,
        0.014015299268066883,
        -0.08094918727874756,
        0.05170483887195587,
        0.05311578884720802,
        0.04898479953408241,
        -0.023710479959845543,
        0.016776151955127716,
        -0.013367559760808945,
        -0.15589827299118042,
        -0.003474876517429948,
        0.03252560645341873,
        0.06798606365919113,
        0.10269524902105331,
        9.535440767649561e-05,
        0.01029081828892231,
        -0.006261897273361683,
        0.03378836065530777,
        -0.03252008184790611,
        0.04183913394808769,
        -0.1121683120727539,
        0.054900284856557846,
        0.08910366147756577,
        0.035285573452711105,
        0.05129178985953331,
        0.07785473018884659,
        0.03801374137401581,
        0.06393905729055405,
        0.022506430745124817,
        0.04714605212211609,
        -0.03797191381454468,
        -1.7114205924614e-33,
        -0.037747666239738464,
        0.051421456038951874,
        0.010934126563370228,
        -0.07353691756725311,
        0.00944532547146082,
        -0.04619432985782623,
        -0.05517568066716194,
        0.013658015988767147,
        0.004809489939361811,
        0.046656474471092224,
        -0.08260126411914825,
        0.08773748576641083,
        -0.006728453561663628,
        0.10208293050527573,
        0.0896543636918068,
        -0.08957845717668533,
        -0.026260679587721825,
        -0.03753293678164482,
        -0.02909267507493496,
        -0.028956543654203415,
        -0.03736838698387146,
        -0.051473647356033325,
        -0.035745397210121155,
        -0.04346461221575737,
        0.02508428692817688,
        0.000717171176802367,
        0.03773699328303337,
        0.029327604919672012,
        0.0366593673825264,
        0.05362517386674881,
        -0.09014549851417542,
        -0.018279261887073517,
        -0.005622323136776686,
        -0.10836303234100342,
        -0.00878798495978117,
        -0.03964398056268692,
        -0.033559009432792664,
        -0.037939298897981644,
        0.017563890665769577,
        0.03327411040663719,
        -0.052728381007909775,
        -0.007545651867985725,
        -0.08184397220611572,
        -0.11775156855583191,
        -0.0043227793648839,
        0.06410922855138779,
        0.10379820317029953,
        0.027958545833826065,
        -0.016450075432658195,
        -0.03788376599550247,
        -0.024849936366081238,
        -0.05298976972699165,
        -0.05167560651898384,
        -0.11574169248342514,
        -0.011319071985781193,
        0.028969265520572662,
        0.024974405765533447,
        -0.08336246758699417,
        0.010168672539293766,
        0.005182379856705666,
        0.00794148538261652,
        -0.01244945079088211,
        0.07856474071741104,
        0.03783464804291725,
        -0.06370982527732849,
        0.09771732985973358,
        0.05583951249718666,
        -0.024450981989502907,
        -0.05727246031165123,
        0.005090333055704832,
        -0.04647782817482948,
        0.021208392456173897,
        0.051390159875154495,
        -0.0671863779425621,
        -0.029580801725387573,
        0.0014568758197128773,
        -0.016430983319878578,
        -0.030021412298083305,
        0.03908701613545418,
        0.028091633692383766,
        -0.02923624962568283,
        -0.004352817311882973,
        0.08772554248571396,
        0.06051066145300865,
        0.01593482308089733,
        0.030352331697940826,
        -0.01749185472726822,
        -0.0542355515062809,
        -0.034246060997247696,
        0.017074724659323692,
        -0.005560919642448425,
        0.035015564411878586,
        -0.03868165984749794,
        -0.0455423928797245,
        -0.11209925264120102,
        -2.125510701728621e-33,
        0.0024573516566306353,
        -0.0008276546723209321,
        0.02947787009179592,
        -0.060500070452690125,
        0.0900808572769165,
        0.00024334898625966161,
        -0.010381512343883514,
        -0.004487663507461548,
        0.06440002471208572,
        0.04174177348613739,
        -0.04090869426727295,
        -0.04537404328584671,
        -0.11035080254077911,
        0.013855230063199997,
        -0.00518844835460186,
        -0.03611847013235092,
        0.05352913960814476,
        -0.025218553841114044,
        -0.021913006901741028,
        -0.0651002824306488,
        0.08389237523078918,
        -0.01692153327167034,
        0.007718720007687807,
        0.027053773403167725,
        0.05752432346343994,
        -0.03721097111701965,
        0.07640748471021652,
        0.08561290055513382,
        -0.04247826710343361,
        -0.05248383805155754,
        -0.007063090801239014,
        -0.06217959523200989,
        -0.015454591251909733,
        0.005077212117612362,
        0.022411901503801346,
        0.03870798274874687,
        0.012168953195214272,
        0.021693678572773933,
        -0.061707235872745514,
        -0.01825474202632904,
        0.045547790825366974,
        -0.02974458783864975,
        0.04305282235145569,
        -0.03930264711380005,
        0.0016923961229622364,
        0.020372813567519188,
        -0.023769479244947433,
        0.0601968877017498,
        -0.04972895607352257,
        -0.029487648978829384,
        -0.00626846868544817,
        -0.07008522748947144,
        0.039231397211551666,
        0.036520861089229584,
        -0.12000800669193268,
        0.004194391425698996,
        -0.054619479924440384,
        0.013210546225309372,
        -0.030895693227648735,
        -0.05108225718140602,
        0.03930526226758957,
        0.002326482906937599,
        -0.019257832318544388,
        0.01923627033829689,
        0.022355785593390465,
        0.0045194984413683414,
        -0.012597712688148022,
        -0.030455637723207474,
        -0.07760439813137054,
        0.01827734149992466,
        0.035986319184303284,
        -0.06236285716295242,
        -0.09203262627124786,
        -0.05479532852768898,
        -0.062256474047899246,
        0.05567508935928345,
        0.04000392556190491,
        -0.01084920484572649,
        -0.10037386417388916,
        -0.036751460283994675,
        9.285330452257767e-05,
        0.06157990172505379,
        0.07359494268894196,
        -0.010314617305994034,
        0.08601309359073639,
        0.056656911969184875,
        -0.022705692797899246,
        -0.009290171787142754,
        -0.038321107625961304,
        0.11301064491271973,
        -0.0616142600774765,
        0.047432154417037964,
        -0.04165356978774071,
        0.05668466538190842,
        -0.018684733659029007,
        -5.955010351499368e-08,
        -0.049832288175821304,
        0.03415779396891594,
        0.01398563850671053,
        -0.031737666577100754,
        0.0060659293085336685,
        -0.006768622901290655,
        -0.014164398424327374,
        -0.06337077915668488,
        0.02974453568458557,
        0.013466669246554375,
        0.004291664808988571,
        -0.07944775372743607,
        -0.047342538833618164,
        0.05097423121333122,
        0.0006771237240172923,
        -0.038491617888212204,
        0.011617143638432026,
        0.02929643541574478,
        -0.05223657935857773,
        0.007441546767950058,
        -0.029501166194677353,
        0.08182051032781601,
        0.0011932427296414971,
        -0.029966531321406364,
        0.010997653938829899,
        0.05302567407488823,
        -0.057182084769010544,
        0.050031665712594986,
        0.10545103996992111,
        -0.008525040931999683,
        -0.021565943956375122,
        0.019770614802837372,
        -0.001039673574268818,
        0.004937606398016214,
        -0.0271475687623024,
        -0.07065726816654205,
        -0.06528566032648087,
        0.05271406099200249,
        0.0159782562404871,
        0.08681808412075043,
        -0.01869179867208004,
        0.01809067837893963,
        0.025102166458964348,
        0.05851736664772034,
        -0.006424227729439735,
        -0.06549651175737381,
        -0.012915906496345997,
        -0.1128351017832756,
        0.05923726409673691,
        0.017956962808966637,
        0.00474209850654006,
        -0.06115994229912758,
        -0.014834758825600147,
        0.03529500961303711,
        0.013436993584036827,
        0.04360811412334442,
        -0.02126672863960266,
        -0.040080394595861435,
        -0.11167587339878082,
        0.08179980516433716,
        0.07907228916883469,
        -0.16948258876800537,
        -0.04878317564725876,
        0.11397907882928848
    ]
}