{
    "id": "R7wUCM4b2Fk",
    "title": "Apple Is Watching You...",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-01-25T22:06:16Z",
    "video_url": "https://www.youtube.com/watch?v=R7wUCM4b2Fk",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "apple",
        "apple glasses",
        "apple watch",
        "watch os",
        "iphone",
        "ipod",
        "ipad",
        "ios",
        "macos",
        "google",
        "microsoft",
        "halo lens",
        "google glass",
        "android",
        "wearables"
    ],
    "views": 149837,
    "likes": 2845,
    "comments_count": 213,
    "description": "Tim Cook would like to know your location... Huge shoutout to Storyblocks for sponsoring this video!   I sold my body on Amazon.com:  The Pocket Gaming PC - GPD Win3:   I was Wrong about the Samsung Galaxy S21:  Did Samsung Ruin the Galaxy S21?  Apple's Next Mac :   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "http://storyblocks.com/ThisIs",
        "https://youtu.be/ayPHtwncuGU",
        "https://youtu.be/XldRhq0rz-g",
        "https://youtu.be/btP4DK5Nm6U",
        "https://youtu.be/P0Qc1nl8VkE",
        "https://youtu.be/l8b3WWc8Rxw",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is. Austin, have you ever wished that Tim cook could just hang around with you all day and whisper sweet nothings in your ear? - Yeah, Tim seems like a fun guy. - I mean, that's fair. That is fair. (laughter) So inevitably, we're gonna have, Apple Glasses. - We have Apple watches, Apple phones, Apple pads, Apple books. Why not Apple Glasses? Right after this word from our sponsor, Storyblocks. Thank you very much Storyblocks, for sponsoring this section of our video. - With Storyblocks, you get access to over 1 million royalty free stock images and video and after effects projects, and backgrounds, and pretty much any asset you would ever need to have your creative video come to life. - And especially when you're making a video like the Apple Glasses, where, we don't actually have Apple Glasses to show, having a variety of stock footage like this to show, is very helpful. This also is one of my real favorites when it comes to stock video. In fact, we actually, for pretty much, since the very first episode of This Is, have heavily relied on Storyblocks to provide a lot of the stock footage that you see in all of these videos. If you are a creator and you want to be able to up your production level without necessarily going out and shooting things that you might not even have access to, something like Storyblocks is incredibly helpful to have. Honestly, we could not make This Is without it. - For one low monthly price, you get unlimited downloads. So be sure to check out our link in the description, and thank you Storyblocks for sponsoring this video. - So the rumors of Apple creating their own set of glasses have been around pretty much since they first brought out the Apple watch. However, they're certainly not the first to bring out a product like this. Cue, the Echo Frames. - I like how you framed it like, framed, hey! - Framed, hey! - I like how you said that, like, Amazon was the first one too. And that Google Glass didn't exist. 'Cause it doesn't exist anymore. - There've been so many different companies who've tried this. We're gonna talk a lot about what Apple has. I wanna actually try the Echo Frames, but there's so many like potential. There's so much potential when it comes to smart glasses, right? Because so quickly when you think about wearables, typically you think about a watch, right? And it's been a pretty seamless transition, right? There's so many things that your watch can do beyond the health benefits, beyond the idea of giving you notifications. Beyond the idea that it actually just gives you the time. It's helpful, and honestly, it's been fairly easy, quote, unquote fairly easy, to integrate a lot of this stuff into a watch. - And as much potential there as there is for something like a wearable glasses, smart glasses, - Wearable glasses? - No one's, you shush. No one has done it right. Which is why Google Glass failed. - So, for reference. Ooh, that those frames are nice and bendy. So for reference, these are the Echo Frames. Now these do not go as far as what we expected the Apple Glasses to do. Essentially these are standard glasses, that have Bluetooth, and essentially Amazon Echo built in. And I'm gonna have to say the A word a lot. So just mute your Alexas. So with Amazon Alexa built in, I should be able to do, Oh, Oh well, that's cool. It's got a little light when it it's on. Wait, hang on. Hey Alexa, what time is it? Can you hear this? - I don't know about you guys, I I'm sitting right next to him, I barely heard it. I mean, it's quiet in here, I barely heard it. So I mean, that's a great thing because with any, anything like that, where it's a, you know, kind of it's not bone conducting, it's just a very small personal speaker. - [Austin] Small speaker, so essentially, the speakers are on the bottom and they're essentially directly aimed at your ears. This is a cool idea. I mean, I'm not sure how often I need to say, \"Hey Alexa, who is the greatest YouTuber?\" How dare you tell me T Series? Okay, so we're gonna take these glasses off. - I couldn't hear it, but I knew it was gonna be awesome-- - It just said T Series, and I immediately took off the glasses. But there's a lot more to it than just pure Echo Frames, right? So Google Glass, I think is still, what, five, six years after it first came out? Is still the number one, sort of, smart glass in my mind, because it was so ambitious. So if you don't remember, Google Glass was essentially a, very futuristic set of glasses. In fact, I actually did a video with my good buddy, Lamar, all the way back when they first came out. And essentially what you got there was a camera and a tiny little like kind of floating screen on the corner-- - Very small. - Which essentially, - About the size of your pinky nail. - But, because it was so close, you could at least get some information. So you actually had a sort of heads up display. The camera, I think, was one of those things that was a little bit sketchy for a lot of people since you're wearing the glasses with a camera into the bathroom, for example. And no one wants to dock disrespected accidentally. Can I just say something? When you're wearing these, you look like an accountant. These are like accountant glasses. - So fun fact, I used to wear glasses before I got LASIK a few years ago. And, I think I had these exact pair of glasses. (laughter) Except in green. These are Pacific blue, I think. - So these are also Bluetooth headphones, essentially. - Yeah, so - 'Cause you need to use this with a phone. These are not standalone glasses. They are connected via Bluetooth to your phone. I assume when you say the magic words, it just triggers it on your phone and then plays it back through the speakers. But the thing is, this all really is just a precursor to what I think what the Apple Glasses can be, right? So, when I, as a glasses wearer, think about what I want out of smart glasses. Right now, a lot of what you can get at the moment doesn't really sell me that hard, right? The idea of having headphones built into my glasses is cool, right? I will say that that is one of the big things. We don't need to keep around a pair of Galaxy Buds, or Alexa Buds, or Apple buds or whatever. You can keep that audio directly in your glasses. That's cool. - There's pros and cons to that because, a lot of those headphones you mentioned also have noise cancellation, which is why a lot of people buy them to begin with. Obviously, don't have those. You don't have to deal with something like transparency mode. You don't actually have headphones in. - But there's a lot more to it than I think just the audio side. So, there have been for years, all of these rumors about what the Apple Glasses could do. And in fact, it seems pretty clear to me that, through the various leaks and rumors that we've had over the years, and specifically a lot of stuff that they're building into iOS, right? So you think about something like AR Kit. It doesn't do a ton on the iPhone right now. So this is the thing where you can like move Ikea furniture around your place and, it has a really good sense for the depth and the distance and stuff. But to me, that all just seems like a prototype that they're sort of shipping on the iPhone, for the technology that would go into the Apple Glasses, right? Imagine if it has full screen displays, right? Or at least one full screen display on one eye. You're trying to, you know, you're mapping or whatever. When instead of your watch tapping and you saying, \"Hey, take a right to the next light.\" Imagine a big arrow following the road, as it's able to contextualize where you are and how you're driving, right? Or if you've got an Apple Car, it is all integrated in the same ecosystem. So as soon as you put it on, it connects to the car and it can do everything. Obviously, I think something like this will still be tethered to your phone. But you can imagine some of these use cases for a smart set of glasses. - I mean, we've all been playing \"Cyberpunk\" a whole bunch. Instead of having an ocular implant, this would basically do the same thing if you wanna get for the layman term. However, like, - Wait, are you trying to tell me that an ocular implant is the layman's term? - No, I mean. - I think that's like the opposite of a layman's term. - I'm saying what the ocular implant. (laughter) I agree that like AR Kit and stuff like that has good use cases. The problem with that is, all that technology that's in the iPhone right now has to go into the glasses. The processing can happen on the phone. But like the depth sensors, the actual camera, like the LiDAR camera, would have to sit on the the frames themselves in order for this to work. It's not gonna work, you know, you can't really do this in your pocket. - If anyone's gonna do this, it's Apple. Think about the Apple Watch for one second, right? This is not a large watch, right? I mean, you can see it's the same size as the first version. Inside this watch, is not only a battery. All of the processing power. You have GPS, you have WiFi, Bluetooth, you have LTE connection. All of which lasts, pretty easily one, honestly the newer watches will do two days. - You're absolutely right. If anyone was gonna do this, it would be Apple. And a big reason why we haven't seen this is because, exactly what Apple does. Everyone jokes to death and memes it to death, that someone comes out with the technology. - Yeah. - And then, five years later, Apple comes out with on the paint on paper, the same technology. And they say, \"We've innovated this, we've invented this.\" They don't release something until it is perfect. - Well, good. It needs to be not okay, it needs to be good, I would say. But I think at this point, there's no real doubt that Apple have been laying the groundwork, for probably five years now, to build something like Apple Glasses. And it would make a lot of sense for them to integrate a lot of this technology with AR Kit, with the audio side of things, with the ability for it to connect with your iPhone and your Apple Car and all of these other devices, to essentially be the next big product alongside, I mean, what? The last time they launched a major product would be what, AirPods? Apple Watch? I mean, it's been a while since they've actually brought out a major new product category. There've been plenty of rumors - [Matt] Yeah, I mean. - That there's an Apple Car coming. But I think this is probably gonna happen sooner than that. - I agree on that too. I don't, doubt that the next coming piece of technology is gonna be, instead of a Google Glass which had the little screen coming out, there'll be right on the regular lenses. - Yeah, I can imagine a scenario due to privacy concerns that people may not want, a actual camera on the glasses that they wear every day. I mean, I just think about the amount of things that I am. Like, for example, when I go to a press briefing. Back in the old days, when you did things in person, I remember there are a lot of press briefings. When you walk in, you have to take your phone out. They put a little sticker over every camera to make sure you don't accidentally or purposefully leak something. Imagine me just like, \"Oh, you know what? I'll just leave my glasses at the door. Oh, wait a minute, I can't see anything.\" Like, I think there were real concerns with having a camera on your glasses. I'm not totally sure they have to go that route. - Let's say does have a camera. Because all, every other attempt at smart glasses has had a camera. - Snapchat Spectacles, remember those? - Right, I'll use Amazon for example, because I feel like Amazon, I feel like they have the most potentially nefarious use case for, if they would add like a camera to these. - [Austin] Which to be fair, these do not have a camera, right? - So imagine you have a camera on here. And you're walking through Whole Foods. You have a heads up display that'll show you where everything is in the Whole Foods. - Yeah. - This, right here can, you can scan your item and check out right from your glasses. How, that's great, it's super. - [Austin] Sure. - There's your convenience. However, now Amazon knows, I'm spending a lot of my like I'm spending a lot of my time picking between these two brands. That's another piece of information they have. And then, now your targeted ad, which are already a little bit more annoying, are even more targeted. - [Austin] To be fair, this is all very theory crap. Like, this is not something that is happening yet. - [Matt] This is our black, our \"Black Mirror\" conspiracy. - But you can very easily see it happening, right? I mean, Amazon already have like sort of automatic stores or cashiers in the stores. So you can imagine a scenario in which, they're constantly pulling this data. Now, I think we're a long way away. And I think if this was a product that would get shutted down pretty quick. The thing is, people forget. You, once you get used to the water, it's kinda hard to get-- - It's hard to get out of the tub. - I actually trust a company like Apple much more so than most when it comes to my privacy. I think Apple has a very strong track record. It might not necessarily be proven. A lot of people don't trust Apple. But, when you look at their business model, you look at the amount of privacy protections that they've build into their products. I think they deserve real kudos for that. - [Matt] Yeah. - I trust Apple with my data, personally. I use a lot of products from Amazon and Google and whatnot. I trust Apple above, pretty much anyone. Actually I will say, Apple is probably the number one consumer tech company that I trust with my own personal data, right? Because, everyone else has some stake in selling it and advertising off it, whatever. Apple doesn't, Apple makes their money selling you slightly expensive products, sure. But I would rather pay up front for something. And I know that it's protecting me versus, you know, so here's a good example of this. So, you know, obviously CarPlay and Android Auto, right? CarPlay does not capture a ton of data. And it certainly, doesn't Apple doesn't sell that data. So the reason why a lot of cars have CarPlay and not Android Auto, is that, unless you have a very specific arrangement, Google essentially gets information on what your car is. Sometimes the GPS location and the various bits and pieces which is very valuable as an ad targeting company, right? Where if I know you own a 2019 Toyota Corolla, and you drive it 13,000 miles a year, I might find that very valuable to sell you ads with that information. When we do videos like the privacy protection video, they're like the many times we've shown how, many times, Amazon and Google capture all of these recordings and keep them safe, like there's a lot of this creepy data. But the thing is as time goes on, people get used to it. People don't really question it. And I know like, Oh, look, I wear an Apple Watch every day. I know that at any point, this thing had could have Siri on and listening to me. Half the time I look down and I see Siri transcribing my conversation. But at least I have some faith in Apple that, as they repeatedly say, they don't store this stuff unless you specifically give them permission. They don't sell it because they're Apple. They don't need to sell it, because they're making their money on the product. That is why I would trust something like Apple Glasses, beyond something like a Google or an Amazon equivalent. Because I think that there's the incentive there for them to try to protect my privacy as much as possible. - As soon as you've had a phone in your pocket, a lot of your data's already been given up, just by that. - Every second you spend on the internet, or an app or whatever, is being meticulously tracked. - I save $6 a month in electricity bill because, Phillips Hue tracks when I leave the house and turns off all my lights. - Or the TV you use sells the information on the programs that you're watching. - Yeah, it's. - There's a lot of this stuff, so I think ultimately, I've been excited, it's not excited. I've been very interested in this whole privacy conversation. But as we look toward the future, maybe in the somewhat near. I mean, I'd still think we're probably at least a year or two out from the Apple Glasses, but it's certainly a product coming out. I think this is something that you as consumers should really give a lot of thought to, as far as, when you sort of spend your money on these devices, when you really invest your personal and your digital life into a device, whether it's a phone, whether it's a smart device, whatever the case is, give some thought to the motivations behind the company who are using it. And give some thought to how you can protect your privacy and ultimately, how much you value that. Because again, I'm not gonna sit here and tell you that you're wrong for trusting a Google device or an Amazon device. I mean, we all do it, right? And there's a certain level of privacy versus convenience that we all trade off, right? Otherwise, everyone's phone would have a 64-digit passcode on it to make sure that you have the utmost security, no matter what. Like certainly, we all make these trade-offs. But I think there's a difference between making an informed trade off on the devices and the services that you use, and blindly using things. And then at one point in your life being caught out by, the big data breach or someone selling this stuff off or getting these creepy ads or whatever the case is. Just a little bit of food for thought. Thank you very much for watching this episode of This Is. Make sure to subscribe here on this Google owned platform, and allow the algorithm gods to know that you enjoyed this piece of content so they can serve you even more fresh This Is videos, and we can all continue the endless cycle of consumerism, and turning into \"Cyberpunk\" in real life.",
    "transcript_keywords": [
        "Apple Glasses",
        "Apple",
        "Glasses",
        "lot",
        "Apple watch",
        "Google Glass",
        "Apple Car",
        "Google",
        "Amazon",
        "trust Apple",
        "Echo Frames",
        "camera",
        "smart glasses",
        "watch",
        "Storyblocks",
        "video",
        "Essentially",
        "things",
        "phone",
        "Glass"
    ],
    "transcript_entity_values": [
        "Google Glass",
        "Alexas",
        "Apple Glasses",
        "Amazon Echo",
        "T Series",
        "one",
        "five years",
        "Apple",
        "Storyblocks",
        "Lamar",
        "Alexa Buds",
        "LTE",
        "Alexa",
        "the Echo Frames",
        "YouTuber",
        "Galaxy Buds",
        "Google",
        "CarPlay and Android Auto",
        "Storyblocks",
        "LASIK",
        "Matt",
        "five years later",
        "a few years ago",
        "years",
        "the years",
        "6",
        "the Apple Glasses",
        "13,000 miles",
        "Tim",
        "monthly",
        "at least a year",
        "AR Kit",
        "Austin",
        "Ikea",
        "at least one",
        "Cyberpunk",
        "a minute",
        "Siri",
        "two",
        "Amazon",
        "six years",
        "Toyota",
        "Black Mirror",
        "Apple Watch",
        "five,",
        "Pacific blue",
        "Alexa",
        "AirPods",
        "2019",
        "CarPlay",
        "Google Glass",
        "Echo Frames",
        "the Apple Watch",
        "one second",
        "the old days",
        "Half",
        "second",
        "Phillips Hue",
        "over 1 million",
        "first",
        "iPhone",
        "Corolla",
        "every day",
        "64-digit",
        "a ton",
        "two days"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "LOC",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE"
    ],
    "vector": [
        -0.029841551557183266,
        -0.025844311341643333,
        0.1070239320397377,
        -0.06475505232810974,
        0.09960906952619553,
        -0.0005221584578976035,
        0.09920839965343475,
        -0.033376142382621765,
        0.07320518791675568,
        0.03258398920297623,
        0.02886258065700531,
        -0.001383489929139614,
        0.012040829285979271,
        0.014940360561013222,
        0.022035883739590645,
        -0.11355164647102356,
        0.07527466118335724,
        -0.07449416816234589,
        -0.041375260800123215,
        0.05767715349793434,
        0.040983401238918304,
        -0.021681558340787888,
        0.06544323265552521,
        0.013345982879400253,
        0.00871228240430355,
        0.0467064268887043,
        -0.0596843957901001,
        -0.049610115587711334,
        0.0014574483502656221,
        -0.0245744027197361,
        -0.02885611169040203,
        -0.012816838920116425,
        0.037665028125047684,
        0.02028629556298256,
        0.012855832464993,
        -0.09501844644546509,
        0.018255164846777916,
        -0.007968897931277752,
        -0.12067271023988724,
        -0.03992742672562599,
        -0.010560126043856144,
        -0.0035399533808231354,
        0.008203406818211079,
        0.0958293229341507,
        0.070200115442276,
        -0.03088686801493168,
        0.06602313369512558,
        -0.016974998638033867,
        -0.016924263909459114,
        0.0545375682413578,
        -0.07965230941772461,
        -0.03788520023226738,
        0.040025267750024796,
        -0.06260708719491959,
        0.020359156653285027,
        0.012979445978999138,
        0.0259894710034132,
        -0.022909950464963913,
        0.09976834058761597,
        0.050158411264419556,
        0.06652484089136124,
        -0.12583930790424347,
        -0.05964439734816551,
        0.05895261839032173,
        -0.008977471850812435,
        -0.06119570881128311,
        -0.018796395510435104,
        0.0831124559044838,
        0.03489399701356888,
        -0.03596799820661545,
        -0.007594120688736439,
        -0.007844758220016956,
        0.1137649267911911,
        0.07301133126020432,
        0.020639151334762573,
        0.02739824913442135,
        0.08573348820209503,
        -0.0795925110578537,
        -0.011265786364674568,
        -0.02237379550933838,
        0.022285696119070053,
        -0.06247742474079132,
        0.004552163649350405,
        -0.04270371049642563,
        -0.012496810406446457,
        -0.048442598432302475,
        -0.003325869794934988,
        -0.0010362172033637762,
        -0.03867629915475845,
        0.022444013506174088,
        -0.07022567838430405,
        0.060791708528995514,
        0.035979632288217545,
        -0.04698992520570755,
        -0.004075629636645317,
        -0.057904671877622604,
        -0.053532492369413376,
        -0.051786232739686966,
        -0.07490251958370209,
        0.07220994681119919,
        0.024293821305036545,
        0.04275257885456085,
        0.060385603457689285,
        0.03528003767132759,
        0.03304847329854965,
        -0.05267757922410965,
        -0.0738154873251915,
        0.02392604760825634,
        0.0585998073220253,
        0.08774349838495255,
        -0.009896871633827686,
        0.07647861540317535,
        -0.06893055140972137,
        0.006966780871152878,
        0.014146794565021992,
        -0.023509139195084572,
        -0.07929444313049316,
        0.024239229038357735,
        0.10991913080215454,
        -0.007173560094088316,
        0.06204371899366379,
        0.07301370054483414,
        0.008915281854569912,
        -0.037845440208911896,
        0.03352765738964081,
        -0.03863666206598282,
        0.004069492220878601,
        1.0386900427671012e-33,
        0.019951531663537025,
        0.07361215353012085,
        0.02176649682223797,
        0.036807186901569366,
        0.04296101629734039,
        -0.014414673671126366,
        -0.0028017570730298758,
        0.06818096339702606,
        -0.04168315976858139,
        0.02802586928009987,
        -0.005043203942477703,
        -0.004855622537434101,
        -0.04522881284356117,
        0.09750770777463913,
        -0.0004852100682910532,
        -0.05577483028173447,
        -0.08267855644226074,
        -0.04860564321279526,
        0.03476952761411667,
        -0.0028064034413546324,
        0.0012271329760551453,
        -0.07207703590393066,
        -0.004354033153504133,
        0.011418003588914871,
        -0.033592887222766876,
        -0.015374815091490746,
        0.03072916902601719,
        -0.06380713731050491,
        0.09279817342758179,
        0.040926408022642136,
        -0.10027030110359192,
        0.0052634794265031815,
        0.06676747649908066,
        -0.10597293078899384,
        -0.004858538042753935,
        -0.04206177592277527,
        0.008768931962549686,
        -0.14271435141563416,
        0.063284732401371,
        0.0340791679918766,
        -0.11666399240493774,
        0.029659822583198547,
        -0.027759242802858353,
        -0.05654193460941315,
        -0.029560476541519165,
        0.016321763396263123,
        0.026689760386943817,
        0.03464975953102112,
        -0.07089725136756897,
        -0.03151111677289009,
        0.012335456907749176,
        -0.030716409906744957,
        0.021839823573827744,
        -0.09172362834215164,
        -0.04181954264640808,
        0.011767959222197533,
        0.011043271981179714,
        -0.07784845679998398,
        0.054220717400312424,
        0.011677481234073639,
        0.027582397684454918,
        0.030848339200019836,
        0.02030511014163494,
        0.04878632351756096,
        -0.10143454372882843,
        0.053053099662065506,
        0.06432488560676575,
        -0.01161900907754898,
        -0.06747447699308395,
        0.04310739412903786,
        -0.026423320174217224,
        0.007467520423233509,
        -0.01897827349603176,
        -0.07126972079277039,
        -0.06653116643428802,
        0.022725440561771393,
        -0.04676230251789093,
        0.045254115015268326,
        -0.07276050001382828,
        0.02480451576411724,
        9.16202407097444e-05,
        -0.027478888630867004,
        -0.016530543565750122,
        -0.011239643208682537,
        -0.03779096528887749,
        0.0030752085149288177,
        0.01886773109436035,
        -0.11149881780147552,
        0.017061712220311165,
        -0.04119903966784477,
        -0.05904192104935646,
        -0.0025897284504026175,
        0.034556806087493896,
        0.002355129923671484,
        -0.0633028894662857,
        -1.9550873470754134e-33,
        -0.02406592108309269,
        -0.06027233973145485,
        0.014843227341771126,
        -0.05078676715493202,
        0.026080871000885963,
        -0.08361048996448517,
        0.0265980027616024,
        0.03226887062191963,
        0.0593964122235775,
        -0.06349694728851318,
        0.0006251003942452371,
        -0.0057457429356873035,
        -0.11678911000490189,
        -0.05839371681213379,
        -0.07892870903015137,
        -0.03781408444046974,
        0.039548568427562714,
        -0.04806966334581375,
        -0.03691192716360092,
        -0.013838294893503189,
        0.011780889704823494,
        0.018292991444468498,
        0.01849488355219364,
        0.029957588762044907,
        -0.020551497116684914,
        -0.0013121562078595161,
        0.016166754066944122,
        0.04385267198085785,
        0.02590615302324295,
        -0.023568078875541687,
        0.010580926202237606,
        -0.06837552040815353,
        -0.03495927155017853,
        0.03466702252626419,
        0.03568892553448677,
        0.06357817351818085,
        0.016130194067955017,
        -0.00041046232217922807,
        -0.03694966807961464,
        -0.05321915075182915,
        0.10702189058065414,
        0.05370716005563736,
        0.007997645065188408,
        0.03306391090154648,
        0.015697864815592766,
        0.012291131541132927,
        -0.05461892858147621,
        0.016696801409125328,
        -0.02127719298005104,
        -0.05504732206463814,
        -0.007580359000712633,
        -0.02697977051138878,
        -0.017374534159898758,
        -0.0012059571454301476,
        -0.09581740945577621,
        0.011355794966220856,
        0.053345438092947006,
        0.03801032528281212,
        0.06897040456533432,
        -0.04268580302596092,
        0.03352195397019386,
        0.009046752005815506,
        -0.03124522976577282,
        -0.08542302250862122,
        0.01289108395576477,
        -0.00587157579138875,
        0.03636706992983818,
        0.023192010819911957,
        -0.008808241225779057,
        0.01637650839984417,
        0.007080816198140383,
        0.0014080088585615158,
        -0.08364726603031158,
        -0.056085653603076935,
        -0.02648651786148548,
        0.15416014194488525,
        0.043592192232608795,
        -0.033327966928482056,
        -0.02857161872088909,
        -0.04719509556889534,
        0.034752264618873596,
        0.08835882693529129,
        0.06613839417695999,
        0.04839440807700157,
        0.09829720854759216,
        0.062109798192977905,
        0.025318890810012817,
        0.04501057043671608,
        -0.043501611799001694,
        0.08416544646024704,
        -0.08670370280742645,
        -0.014001905918121338,
        0.03496541827917099,
        0.06623480468988419,
        -0.013573546893894672,
        -5.343342479591229e-08,
        -0.048169393092393875,
        0.008669765666127205,
        0.006279463414102793,
        -0.010515025816857815,
        -0.021881600841879845,
        0.01428890973329544,
        -0.018380803987383842,
        -0.007646075449883938,
        0.10236656665802002,
        -0.04177572578191757,
        0.01768207736313343,
        -0.055497825145721436,
        -0.1045021265745163,
        0.04549909010529518,
        0.06311510503292084,
        0.04724881798028946,
        -0.016132179647684097,
        0.06022724136710167,
        -0.03907181695103645,
        0.0003827042237389833,
        -0.010416042990982533,
        0.08123668283224106,
        0.02303237095475197,
        -0.0011780466884374619,
        -0.010560153983533382,
        0.040419429540634155,
        -0.02548760175704956,
        0.05126935616135597,
        0.07087040692567825,
        0.034437865018844604,
        -0.02530520036816597,
        -0.011708454228937626,
        -0.04425744339823723,
        0.001337085966952145,
        0.021896231919527054,
        -0.10265359282493591,
        -0.05439390614628792,
        0.01147711742669344,
        0.06000814214348793,
        0.01937757059931755,
        -0.055621061474084854,
        -0.10964041948318481,
        0.07455860823392868,
        0.036564938724040985,
        -0.05983985960483551,
        -0.028990471735596657,
        -0.05772332474589348,
        -0.0397786982357502,
        0.02941853553056717,
        0.06143011897802353,
        -0.04601188004016876,
        -0.10337544977664948,
        0.006649332586675882,
        0.05299606919288635,
        0.010581879876554012,
        -0.05476731061935425,
        0.07197953015565872,
        -0.06177406758069992,
        0.018930625170469284,
        0.007969220168888569,
        0.11093039810657501,
        -0.075346440076828,
        -0.03751511126756668,
        0.0669298991560936
    ]
}