{
    "id": "r_6Ec2Zd3l0",
    "title": "WORST First Products Ever",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-01-13T19:05:42Z",
    "video_url": "https://www.youtube.com/watch?v=r_6Ec2Zd3l0",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 304329,
    "likes": 6524,
    "comments_count": 175,
    "description": "Its Time to Switch to BING:  WEIRDEST Touch of Modern Tech:  I Got Scammed by Circuit City (in 2022):  WORST Tech Fails:  Steam needs to CHILL:   Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Lynaugh  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:20 Sony 1:24 Nintendo 2:10 Samsung 3:30 SEGA 4:47 Nokia 6:53 Motorola 8:02 Logitech 9:04 Hewlett-Packard 10:50 LG 11:41 Lego 12:22 Casio 13:16 Namco 14:12 Toyota 15:34 Mazda 17:26 Who Won??",
    "description_links": [
        "https://youtu.be/XfXcgAYmyj0",
        "https://youtu.be/Q43srkV1d6k",
        "https://youtu.be/-AuSICToosU",
        "https://youtu.be/pFlFn3IWQ7w",
        "https://youtu.be/WgrKtO_L9Os",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello and welcome to This is. Today we're gonna try and guess, what some first products are from your big famous companies. And we are gonna try and guess what their very first product was. And we also are going to try and guess what year that was. - But you know, I'm gonna tell you right now I'm gonna be deadly serious. I'm gonna competitive. - Okay. - I'm getting serious. I'm getting serious right now. - All right, all right. Moving on to the first product, Sony. - [Austin] Oh, god, okay, so, oh, I do know this. I know this one. I believe Sony was founded in like the, oh boy, I wanna say in the '50s. Obviously, Japan had like this massive spurt of growth which there's a wonderful Danki video all about the electric town, part of the reason why I actually know the answer to this. - Oh, that's not fair. - I'm sorry. - I don't watch Danki. - That sounds like your problem. I don't know the year, but I can take a guess, I already told you it was think in the '50s, but if you wanna- - I'm gonna say a toaster. - Okay. - From 1948. - All right, I'm going to say a rice cooker from the year 1952. - [Austin] What? - [Matt] A transistor radio? - [Austin] Wait, wait. - [Matt] Did you just put this on here because it's so green. - I will say this thing looks retro and awesome, so- - Well, it's not retro when it came out in the '50s. - I think on the year I was closer, correct? - Yeah, you get the point. - One point. And I'ma say, I'm not gonna claim an extra half point but in spirit, I think I have to it. Just a little bit. - We don't do half points here. - You make up the rules all the time. - I should get three points for trying- - No, incorrect, incorrect. All right, Nintendo. - [Matt] I do know this one. - [Austin] Go for it. - It's a deck of playing cards and that was in 1948. - Okay, I think it's like 1887. - [Matt] 18. - It is. I'm pretty confident in the 1800s. - Time's not real. - It's a long time ago. - That's not real, okay. - [Austin] 1889. Yep. - [Matt] Okay. - [Austin] The Hanafuda Cards. - I would say two points for Austin, one for Matt. - Wait, how does Matt get a point? Oh, okay. - Wow. - [Kenzi] He got the product right. - Sorry, sorry, sorry, sorry, sorry, I forgot, I forgot. Okay, that's fine. So is that a tally of 3 for Austin, 1 for Matt right now? - [Kenzi] Yes. - Do we really need the recap on- - We do. - The second one? - We do. Just to refresh everyone on Austin being a big brain individual so big brained, that I'm gonna tell you to subscribe and ring-a-ling the ding-a-ling button for absolute dominance of the This is game shows. Yeah, you heard me right, dominance. All right. - [Matt] Samsung. - [Austin] Samsung. Okay, now I will say I know a little bit about Samsung because I actually watched an excellent Wendover productions video. Look, I'm a nerd, okay? I watched an excellent Wendover production video on essentially how Samsung has become such a dominant part of South Korea's economy and whatnot. Highly worth checking out by the way. Really, really interesting video. - This is where we're gonna be, it's gonna be exposed that I know nothing about anything. - Wow. The tables have turned. - [Matt] I know they make tanks. - [Austin] They do that was not their first product, I will tell you that. - I'm gonna say a toaster from 1948. - I'm gonna say 1935 is the year. I'm gonna say it's a radio. I don't, I don't remember, I should know this. I, the knowledge is in my brain, I can't unlock it. Oh, okay. That was a little bit off. - [Matt] Okay, they start as a grocery store. - [Austin] Yeah. - With dried fish, vegetables, and noodles in 1938. So, you get the point for that. - They were doing that before. - [Matt] Yeah. - But they had built up a reputation, they had built up the company. So, after the Korean War when everything was kind of really taking off with the Korean economy. Samsung were perfectly positioned to absolutely explode. Which is the big reason why Samsung, they don't just make phones, they don't just make washing machines. If you look at the pie chart of what Samsung does it is incredible. It's like a ridiculous figure of like South Korea's GDP is just Samsung- - Right. - One company, like it is wild. - [Matt] Sega. - Oh, oh, no. I don't know if I know this one, Matt. I mean, obviously some of the first like actual proper hardware you could buy from Sega it was, you know, like the master system which would've been like mid 80s or so. I wanna say they had a part in arcades in the '70s. - [Matt] They definitely did. - I'm gonna make a guess that they made like pinball machines or some kinda like amusemety kind of things. I'm just gonna throw a guess out there. They were found in like 1965. - I'm gonna say board games of just like, I don't know a better way to describe what I think they made. And I'm gonna go 1930s. - 1930s? - Yeah. - Whoa. - I'm gonna say 35. - [Austin] Coin operating slot machine. Oh, Service Games, I know the story. (Austin screams) - So yeah, like this is the story I definitely knew. I just didn't realize this was their first product. - Basically the story is, is that in 1946, Service Games, SEGA- - Yeah. - Was actually established in Hawaii. They were creating slot machines for the US, sort of military and whatnot. But in 1952, they actually banned slot machines which meant that they moved over to the military bases in Japan. They did some dissolving, they kind of like- - [Matt] Yeah. - Reformed a couple of times. But essentially they were there to create not arcade games but adult games. - SEGA does what Nintendo do too. - Making gambling machines? - Yeah. (Austin laughs) - [Austin] Nokia, oh boy. - [Matt] I know. - [Austin] You do know this one? - [Matt] I know this one flat. - So Nokia is I believe a, oh boy, it's Finnish, right? Where? Oh- (Matt chuckles) - Oh, you're not even close, my friend. Have you ever seen a globe? - I'm gonna guess that Nokia made some kind of radio. I'm gonna be a little broad there cause I don't know the answer. And for the year, I'm gonna say 19 37. - So, this is a very, very obscure, fun fact. - Okay. - Nokia is actually Egyptian. - Get the (beep) outta here. You are lying to me in my face. - And they, their first products were the bricks that they made pyramids in 800 B.C. - Did you just gaslight me that whole time that you know what's up and you give me the most dumb (beep) thing I've ever heard. Matt, I'm so upset with you right now. - I don't know these, so if I can make a Nokia is the strongest material ever in the world joke- - You trying to tell me that like, Nokia are actually the aliens who built the pyramids, that what we hear next? - Go look up the Nokia cellphone that they found in the pyramid, okay? (Austin laughs) Tell me. - Those higher graphics were really suspicious, Matt. Wake up, Sheepo. What? - [Matt] Wood? Okay. - [Austin] Wood fiber board for paper making from 1865 in Finland. - [Matt] Finland. Fredrik Idestam. - I think you're about to offend some Finnish people. - Established some pulp mills and form the company in 1968. - 1868. - 1868, that's what I said. Named it after the town of Nokia which was the site of one of the pulp mills which had good hydro power resources. So, basically it was next to a river. - How do we score this one, Matt? - [Kenzi] I think everyone was so far off, no points for that. - [Austin] No points? I'm okay with no points. - I think that I was actually closer in the spirit of- - [Kenzi] No. - No, no. - Material goods, not electronics. They made fiber boards, all right? And what is a fiber board? But just a thin brick made out of paper. Can Nokia bring back their old logo? That's just a Trout. - [Matt & Austin] Motorola. - [Austin] Okay. - [Matt] Do you think it's the pyramid? - [Austin] It's not the pyramids. So, I know Motorola was, I believe it was founded in Chicago. I feel like they made like old school TVs, something like radios, I wanna say like transistor tubes. I keep saying radio cause I just feel like that's like a safe answer, but I actually don't think that's the answer. - Well, that was the bread and butter of Motorola for a very long time. I think these were auto parts. - Okay. - In, in the early, early 1900s. - Nah, it's too broad. You gotta gimme an actual year. - I'm walking myself through this. - Okay. All right, all right, all right. - So, I'm gonna say sprockets in 25. - [Matt & Austin] 1925. - Okay, I'm gonna say transistor tubes in 1917. - [Matt & Austin] Battery eliminators. - [Austin] Oh, 1928 that's pretty close. Motorola comes from the words motor car and Victrola. Whoa! You're actually pretty close on that. - I knew, like I knew they did a bunch with cars. I think I get one and a half points. - You gonna give me two? - No, I'm gonna do a half, I'm gonna do a half. - You're doing okay, so I get two then. - Okay, I gotta get my serious pants on here. - [Matt] Now I'm, now I'm really regretting that 800 B.C. guess. Logitech. - [Austin] Is it Logitech or Logicool? - [Matt] Or is it Logi? - [Austin] Logi. - Logitech is, oh boy, I wanna say it's a Swiss company. - I'm gonna say that this is in, this is a serious, like an abacus. (Austin chuckles) - What an abacus? - 1890. (Kenzi laughs) (Austin laughs) - All right, I feel good that Kenzi's laughing. So, I'm gonna not go that direction at all. Year wise, I'm gonna guess 1962. And I'm going to guess that Logitech got their start with transistor tubes. I all my answers are gonna be radios and transistor tubes. Transistor tubes. 1962. Final answer. - [Matt & Austin] What? - [Austin] The Logitech P4 mouse from 1981. What is this? - Well, I see what I did wrong because - Dude. - What I was thinking of it was actually Logitacntn which was the company before they became Logitech. - Stop it. - And they sold, they sold a series of abaci to, to the fishermen who were bringing fish back and forth, down the Norwegian channel moving - Moving on. HP. Hewlett. Hewlett. Wait, Hewlett or Hewlett? Hewlett Packard. - Hewlert. - Hewlett. - Hewlett. Hewlert. - Packard. So I know that this is a Silicon Valley company. In fact, I believe Apple Park is actually built on the old HP campus in Cupertino. Apple purchased that from HP. I also know that HP got their starts in those early PC days. So, I feel pretty confident, we're talking in '70s here - After you. - No, no, no, no, I've gone first enough times. - You get your winning. - I gave you an info dump of a bunch of very good clues. You can take it- - I'm just, I'm gonna go with the Packard part of this and say that this was cars. - No. - In 1930s. - I'm trying to help you Matt. I'm trying to make this more fair. That's the wrong answer. You should go again. The Packards were a tank that was rep purple, repurposed- - Repurpalized? - I'm gonna say cars, car parts. - I'm gonna say 1975, and I'm gonna say it was not a computer, but like like a tape. - An abaci? - No, I'm gonna say like a, a tape drive or, or something very closely related to PCs, but maybe not an actual full computer, but definitely PC adjacent. - Oh! - What? What? 1938, Audio frequency oscillator. Wow! That's legitimately surprising to me. I did not know that. I thought HP was a one of those like sort of- - So I actually knew that this was- - Apple, Atari- - No, I knew this was a very old company. - Shut up. - But, 'cause I remember the logo. If I could just, an aircraft is close to a tank which is close to- - No. Matt, no. No, no. - People keep yelling at me for giving myself half points. - Yeah, we're trying to play- - Five points to Matt. - We read your comments, we understand that we need to take these seriously, which is why I'm deadly serious right now. 4 to 4, let's go. - I like how intense you are in this game and I am not at all on this one. - [Austin] LG. - [Matt] Lucky Gold. - [Austin] Lucky gold star. - [Matt] Lucky Gold star. - [Austin] I know that. Matt, you go first. I think I know the answer to this. - I don't remember it. - Okay, you go first, I actually, I think I remember this. - Kenzi, morse code, blink to answer to me. (Austin laugh) - Why did I not learn Morse code? (Austin & Matt laughing) Okay, I'm gonna say in the 1940s Telegraph Machine. - I'm gonna say it was 1952 and it was a TV. - [Matt & Austin] Lucky Cream? - [Matt] What? - Oh, my God, wait, it wasn't LG. Lucky Gold Star or a Gold Star was the electronics division from 1958. - Yeah. - 1947 the company started. It was Lucky Chemical industry. I feel like we should have got that. We should have got that. - You're technically closer on the year and you're close enough that I'll give it to you. - I was closest without going. - No, no, no, don't gimme some surprises, right bullshit. - It's not Blackjack rules. (Austin laughs) - [Matt] Lego. - [Austin] Oh, no. Can you just get Matt the points so we move on here? Okay, well, since Matt obviously knows the answer, I'll go first. I believe Lego was Danish. I think that they started with wood toys. Mostly because I think Matt told me that like three months ago for some random reason. And the year I'm gonna guess is 1930. - You're right with the wood. It was a wooden duck, specifically a mallard. - Okay, well your is more specific so you win- - On wheels. - Okay, sure. - And I wanna say it was 48 that came out. - Oh, that's a big difference in years. - [Austin] 1935? - [Matt] 35? Okay. - [Austin] So, it was a wooden duck. It did have wheels. So, I think I get a point for the year. - Yeah. - You get a point for the duck. - Yep. - Fair. - [Matt] Casio. - Oh (beep). - [Matt] I forgot that Casio was a brand. - [Austin] Big yikes. - Can I go back to my Abacus? - Okay, yeah abacus away. - In 1890. - 1890, okay. I'm gonna say probably a little newer than that. I'm gonna say Casio is 1915 and their first product was a watch. I was just gonna say a watch. - A watch? - It's obviously not a watch. I would say a watch in 1915. A Yubiwa pipe. (Matt laughing) It's a ring that holds a cigarette. So, 1946 they started by creating a ring that holds a cigarette to allow to smoke it all the way down to the nub and leave your hands free. - And this was so profitable, that they had to start making calculators in the '50s to start calculating how much money they were making from from this ring. - Wow. - [Matt] Namco. - [Austin] Namco, Namco. This is before Bandai obviously, before they had merged. My strong inclination is just to say arcade machine but were they doing something before that? Were they making pinball machines, Matt? - I do think this was pinballs in the '20s. I'm gonna say, I'll just say 25 to head to my bet. - I'm gonna say, yeah, arcade machine, 1975. - [Austin] Wow, wow. Could you be more wrong about a question? That's amazing. This a 1955 hand cranked rocking horses. They were installed in the roof garden of a department store in Yokohama. Children love them. They made decent profit and they even made rides for Disney in the '60s before they eventually found their way into video games. Wow. This video is gonna teach you if nothing else, the value of a subscription to This is, so you can learn all kinds of broaden horizon facts and trivia, factoids that will surprise and delight even your harshest of nemesis. - I'm just realizing how little I know about- - [Austin] Life? I, me too. - Anything. - Yeah. - [Matt] Toyota. - [Austin] Oh no, I need to know this one. I need to know this one. I've been to like Toyota factories. I've been to like Toyota Museums. I should know this. This is one of those questions where like the answer is locked deep in some like box in my file cabinet in like the upper third quadrant behind my ear. - Look at the size of that thing, that's- - It's in here, I just gotta shake it a- - That's an Amazon warehouse up there. Are you kidding me? (thud) Yeah. - I gotta think on this one. This is like 80% shot of being completely false. But I think instead of cars it was like wagons or something and it was like 19 05. You should say cars, that's the safe, that's the layup answer, I could, I think it is cars. - I'm gonna go with like an, like a scooter, like a motorized scooter. - Those did not exist. What are you talking about? Motorized scooters? - Yeah. - That, that's not an old thing at all. There's no shot. There's zero shot. - And I'm saying- - Okay. - 1930. - [Austin] Power loom, 1906, okay. I was- - [Kenzi] You get the year. - [Austin] Pretty much dead on the year. So Toyota started out as Toyota Loom Company. God, now that you say I feel like I knew this and I forgot it. I was, I was pretty much on the year though, at least. I'm happy about that. - [Matt] If you wanna know more about looms, you can watch a very old This is video, - [Austin] It was a good video. - [Matt] About the very first computer. Also Linus hosted that video. - [Matt & Austin] Mazda. - [Austin] Right, Japanese car company. - [Matt] Zoom, zoom. - [Austin] Zoom, zoom. I mean- - Motorized scooter. - Stop it, Matt. Motorized scooters were like 1985 or something. - No they weren't. Honda had one in the '60s. - I think about Mazda and Subaru a lot, although they're obviously totally different companies. 'Cause I know Subaru is actually like Fuji Heavy Industries which is like a much bigger overall company. And that's just sort of part of it, I wanna say. I mean certainly I think Mazda's ammo now are really just focused on cars. But in the early days were they all making cars? They may have done something else weird to begin with because I will say it is really difficult to start a company making cars. If you look at any of the like startups today I mean you're talking unbelievable piles of money you have to burn to actually get a car company off the ground. I think the safe bet with Mazda is there was something else and then they built into making cars. Also, for some reason Mazda feels like very like a '60s company - I'm gonna go with manufacturing rubber. - Oh, okay. Manufacturing rubber in 1940? - I'm gonna go down to 1940. - I'm gonna say Mazda was founded in 19, oh wait, wait, wait, wait, I just realized. - Oh, here we go. - No, no, no, hold on, no. I think - Oh, he just realized after I conveniently gave my answer. - No, no, no, no, no, no. I was about to say I guess the '60s but now I'm remembering I think like the Cosmo or something that actually had in like the late '50s. So, actually Mazda has to be an older company than that. If they were already making cars in the '50s. So then you know what? I'm gonna back my guess up a lot. I'm gonna say 1932. And I am going to say that they were making parts like they were making like some kind of mechanical like car slash plane parts. - You scoffed when I said sprockets. - [Austin] 1920, Cork? - [Matt] Cork? - [Austin] Well you know what? You're not too far away from rubber. Mazda was started in Hiroshima which is surrounded by cork trees and back then plastic, rubber that was not really all that common. Also, wait, cork comes from trees. - Yes. - So, Matt gets point for the item which is fair. It's pretty, pretty close. But I think I was closer on the year. - You were, you definitely were. - So, Kenzi, can we get the final score please? - Our final score. It is Matt, 6, Austin, 7. - Let's go! - No! - Let's go! Subscribe and ring-a-ling the Ding-a-ling button for other highly competitive tournaments where I can finally make it on Family Feud. - What? - I wanna be on Family Feud. - Yeah, so do I. - We should do a Overclock Family Feud. - Subscribe for, This is Family Feud. (soft upbeat music)",
    "transcript_keywords": [
        "Matt",
        "Yeah",
        "year",
        "company",
        "guess",
        "points",
        "Nokia",
        "cars",
        "answer",
        "point",
        "Samsung",
        "Making",
        "Mazda",
        "Wait",
        "made",
        "Family Feud",
        "video",
        "making cars",
        "make",
        "pretty"
    ],
    "transcript_entity_values": [
        "zero",
        "Bandai",
        "Cork",
        "the '70s",
        "Korean",
        "Norwegian",
        "Austin] Wood",
        "three",
        "Mazda",
        "35",
        "1948",
        "1925",
        "1917",
        "Matt] Wood",
        "Packards",
        "Audio",
        "Oh, Service Games",
        "Swiss",
        "Nintendo",
        "One",
        "1968",
        "Service Games",
        "1915",
        "1947",
        "Hawaii",
        "Logitacntn",
        "80%",
        "Logicool",
        "Honda",
        "the year 1952",
        "1938",
        "Abacus",
        "18",
        "Yubiwa",
        "Blackjack",
        "third",
        "1868",
        "three months ago",
        "Danki",
        "Time",
        "Telegraph Machine",
        "Victrola",
        "an extra half",
        "Matt & Austin] Mazda",
        "35",
        "Matt & Austin] Motorola",
        "Nintendo",
        "Matt",
        "B.C.",
        "'70s",
        "Ding",
        "Austin",
        "Samsung",
        "Toyota Loom Company",
        "Casio",
        "Logi",
        "1981",
        "Toyota",
        "the '20s",
        "1906",
        "Japanese",
        "1958",
        "first",
        "Austin & Matt",
        "Matt & Austin] Lucky Cream",
        "1928",
        "4 to 4",
        "the late '50s",
        "morse code",
        "Matt & Austin",
        "mid 80s",
        "those early PC days",
        "Chicago",
        "Packard",
        "the 1940s",
        "1932",
        "Today",
        "Sega",
        "Egyptian",
        "Cupertino",
        "'60s",
        "Hewlett",
        "48",
        "LG",
        "Hewlett?",
        "1955",
        "Kenzi",
        "1865",
        "Silicon Valley",
        "Danish",
        "Disney",
        "the early days",
        "US",
        "7",
        "19 05",
        "19",
        "Hewlett Packard",
        "6",
        "19 37",
        "25",
        "Finland",
        "the early, early 1900s",
        "1889",
        "1935",
        "the 1800s",
        "1965",
        "HP",
        "1952",
        "Linus",
        "second",
        "1887",
        "Logitech",
        "the year",
        "SEGA",
        "1",
        "Hewlett.",
        "Austin] Logi",
        "Gold Star",
        "one",
        "Subaru",
        "1940",
        "Apple",
        "Matt] Cork",
        "Austin] Coin",
        "Cosmo",
        "Toyota Museums",
        "1962",
        "Matt] Sega",
        "Namco",
        "Nokia",
        "today",
        "1930",
        "Family Feud",
        "Matt] Zoom",
        "South Korea's",
        "1930s",
        "1985",
        "Fredrik Idestam",
        "Austin",
        "years",
        "Yokohama",
        "Austin] 1920",
        "3",
        "1946",
        "the '50s",
        "half",
        "Lego",
        "two",
        "Matt & Austin]",
        "Motorola",
        "Apple Park",
        "Amazon",
        "Japan",
        "Hiroshima",
        "the Korean War",
        "Morse",
        "Sony",
        "Finnish",
        "Matt] Casio",
        "Wendover",
        "1975",
        "1890",
        "Fuji Heavy Industries"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "GPE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "LOC",
        "NORP",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "GPE",
        "GPE",
        "EVENT",
        "PERSON",
        "ORG",
        "NORP",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.11045055091381073,
        -0.0057967063039541245,
        0.09120499342679977,
        -0.07675913721323013,
        0.059128955006599426,
        0.008637083694338799,
        0.10195087641477585,
        0.047501370310783386,
        -0.059206824749708176,
        -0.0309222973883152,
        0.05382169038057327,
        0.006097217556089163,
        0.07052834331989288,
        -0.007937109097838402,
        -0.07773133367300034,
        0.010853239335119724,
        0.04308633133769035,
        -0.08409029990434647,
        -0.05696990713477135,
        -0.04824880138039589,
        -0.030981920659542084,
        -0.043943170458078384,
        -0.06680174916982651,
        0.06163053587079048,
        0.00029282746254466474,
        0.08381427079439163,
        0.0035589055623859167,
        -0.02218266949057579,
        -0.06379202753305435,
        -0.08270327001810074,
        -0.05441603809595108,
        0.03337512165307999,
        0.05272258073091507,
        -0.009468535892665386,
        0.040838200598955154,
        -0.1022634282708168,
        0.009931549429893494,
        -0.09245599806308746,
        -0.020371410995721817,
        -0.09760407358407974,
        0.010187163017690182,
        -0.06125669553875923,
        -0.023140979930758476,
        0.04770439863204956,
        -0.0009553655982017517,
        -0.021876689046621323,
        0.07978206872940063,
        0.02630915865302086,
        -0.02798166498541832,
        0.010824051685631275,
        -0.06314177811145782,
        -0.01621725782752037,
        0.004454668145626783,
        -0.05174713209271431,
        -0.02153044566512108,
        -0.05249554291367531,
        -0.048505749553442,
        0.07366038858890533,
        0.02749691531062126,
        0.020225413143634796,
        -0.010787260718643665,
        -0.11487982422113419,
        -0.00593717023730278,
        -0.005289601627737284,
        0.0038134579081088305,
        0.009885556995868683,
        -0.030418096110224724,
        0.005136435851454735,
        -0.07597985863685608,
        0.04023517295718193,
        0.010857474990189075,
        -0.007620824966579676,
        0.030173061415553093,
        0.08755868673324585,
        -0.004794726148247719,
        0.022137057036161423,
        0.056562501937150955,
        -0.02974480576813221,
        -0.02871164306998253,
        -0.006325898692011833,
        0.020185561850667,
        -0.05945650488138199,
        -0.08153852075338364,
        -0.01948699913918972,
        -0.04756850749254227,
        0.026625193655490875,
        0.015627924352884293,
        0.02404038980603218,
        0.013101630844175816,
        -0.030000288039445877,
        -0.11668572574853897,
        0.013444332405924797,
        0.06206265464425087,
        0.03152162581682205,
        0.06401686370372772,
        0.006896624807268381,
        0.027726126834750175,
        -0.030761713162064552,
        0.033638421446084976,
        0.0635162815451622,
        0.003991768695414066,
        0.042514655739068985,
        0.05569568648934364,
        -0.0034713514614850283,
        0.04455002769827843,
        -0.05703970789909363,
        -0.0895194485783577,
        -0.018858948722481728,
        0.02944532036781311,
        0.051394980400800705,
        -0.05840623378753662,
        -0.027238517999649048,
        -0.047024913132190704,
        0.007487673312425613,
        -0.024120116606354713,
        -0.04766850918531418,
        -0.04520732909440994,
        0.08559364825487137,
        0.004788643214851618,
        0.03870876505970955,
        0.021830152720212936,
        0.056192826479673386,
        -0.011109093204140663,
        -0.015399306081235409,
        -0.060291800647974014,
        0.09612611681222916,
        -0.024954868480563164,
        4.964082337808788e-34,
        0.0035325493663549423,
        0.026009803637862206,
        -0.026476867496967316,
        0.07201047986745834,
        -0.05258831009268761,
        0.009730062447488308,
        -0.01794995740056038,
        0.11027730256319046,
        -0.05164658650755882,
        0.06661909818649292,
        -0.038973599672317505,
        -0.039771366864442825,
        -0.0755944773554802,
        -0.02539295144379139,
        0.1184777170419693,
        0.007965310476720333,
        -0.06831405311822891,
        -0.04986687749624252,
        -0.012445260770618916,
        -0.05523734912276268,
        -0.012193646281957626,
        0.033034149557352066,
        0.02876550331711769,
        -0.06795323640108109,
        0.0017653163522481918,
        -0.04277092590928078,
        -0.06624383479356766,
        -0.014820369891822338,
        0.06413227319717407,
        0.012451061978936195,
        -0.012233730405569077,
        -0.01967655122280121,
        0.019256476312875748,
        -0.01961326226592064,
        -0.018131719902157784,
        -0.028082771226763725,
        -0.036795809864997864,
        -0.1500650942325592,
        0.030343348160386086,
        0.022211620584130287,
        -0.026539357379078865,
        0.040111809968948364,
        -0.07037454843521118,
        -0.006067920010536909,
        -0.016861971467733383,
        0.04441102221608162,
        -0.06342443078756332,
        -0.02825261279940605,
        0.043803468346595764,
        0.012260288931429386,
        -0.10701057314872742,
        0.03932610899209976,
        0.04654873535037041,
        0.013838524930179119,
        -0.01908431202173233,
        -0.07913503050804138,
        0.02615589089691639,
        -0.050227031111717224,
        0.049706898629665375,
        0.07839158922433853,
        -0.049145154654979706,
        0.07880455255508423,
        0.008501107804477215,
        -0.00476444698870182,
        -0.08126641809940338,
        0.014052161015570164,
        0.1431410312652588,
        0.03529573604464531,
        -0.028058208525180817,
        0.06341701745986938,
        -0.003961645066738129,
        -0.044534288346767426,
        0.005295267794281244,
        -0.10652543604373932,
        0.12381134927272797,
        0.05856022983789444,
        0.024296745657920837,
        0.021896351128816605,
        -0.039216335862874985,
        -0.017000854015350342,
        0.03808974847197533,
        0.036067813634872437,
        -0.004204809665679932,
        0.030447667464613914,
        -0.0012156120501458645,
        0.028727494180202484,
        0.004831458441913128,
        -0.0312858447432518,
        -0.02691815420985222,
        0.07308810949325562,
        -0.04713980108499527,
        -0.00013948623382020742,
        0.04736201837658882,
        0.0729028657078743,
        -0.0011310911504551768,
        -2.6848160566376502e-33,
        -0.01482990849763155,
        -0.03855908662080765,
        0.11716042459011078,
        0.002857578219845891,
        0.011505277827382088,
        -0.0914096012711525,
        -0.04809439182281494,
        -0.02058279700577259,
        -0.003390782279893756,
        0.03493212163448334,
        0.09352573752403259,
        0.018297789618372917,
        0.0730254054069519,
        -0.010059302672743797,
        0.005835909396409988,
        0.024558553472161293,
        0.06368739902973175,
        -0.06950483471155167,
        0.02861679531633854,
        -0.026381926611065865,
        0.0335131399333477,
        0.06504984945058823,
        -0.1520145833492279,
        0.025381220504641533,
        -0.05299975723028183,
        0.07323364168405533,
        0.04535543546080589,
        -0.02092284895479679,
        0.021555649116635323,
        -0.05226236209273338,
        -0.013123496435582638,
        -0.0254503283649683,
        0.031421832740306854,
        0.0527983121573925,
        0.08110784739255905,
        0.035320620983839035,
        0.0017267485382035375,
        -0.030675172805786133,
        -0.016620520502328873,
        -0.13182112574577332,
        0.05571654438972473,
        0.02173951268196106,
        -0.048579778522253036,
        0.0729043111205101,
        -0.04986352100968361,
        -0.08898985385894775,
        -0.06295198947191238,
        -0.017401430755853653,
        0.07875032722949982,
        0.061704039573669434,
        -0.009990530088543892,
        0.022303616628050804,
        -0.015045133419334888,
        -0.04264570400118828,
        -0.06502419710159302,
        -0.02734435349702835,
        -0.019281452521681786,
        0.02053574100136757,
        0.05134959518909454,
        0.03274749591946602,
        0.015643427148461342,
        -0.024279490113258362,
        -0.02264251746237278,
        0.022992020472884178,
        -0.06104925647377968,
        -0.039490580558776855,
        0.09017602354288101,
        0.069879911839962,
        -0.029680702835321426,
        -0.04975653812289238,
        0.027107590809464455,
        0.07464583218097687,
        -0.02035881206393242,
        -0.06054416671395302,
        -0.05960150063037872,
        0.02976257912814617,
        -0.037017498165369034,
        0.0317804329097271,
        -0.01847223937511444,
        -0.06282991915941238,
        0.07056646049022675,
        0.06445622444152832,
        0.04789482802152634,
        0.03086378239095211,
        0.07726617157459259,
        0.04311777651309967,
        0.04493741691112518,
        -0.007839146070182323,
        -0.005833127535879612,
        -0.01067384798079729,
        -0.007470333948731422,
        -0.011563385836780071,
        -0.0567009262740612,
        0.12292256206274033,
        0.023564403876662254,
        -6.334622071335616e-08,
        0.03123806044459343,
        -0.039011914283037186,
        -0.025475291535258293,
        0.0317486897110939,
        0.11022830009460449,
        -0.06554786115884781,
        -0.03577590733766556,
        0.12322661280632019,
        0.004091965965926647,
        -0.00918648112565279,
        -0.030295170843601227,
        0.037784866988658905,
        -0.05467598885297775,
        0.03203018754720688,
        0.03632555529475212,
        0.027278712019324303,
        -0.12475218623876572,
        -0.018237905576825142,
        -0.0005774248274974525,
        -0.05363647639751434,
        0.008823007345199585,
        0.06631342321634293,
        0.09341507405042648,
        -0.07121206074953079,
        -0.06761478632688522,
        -0.03251248598098755,
        -0.004790348932147026,
        0.015626901760697365,
        0.09383387863636017,
        0.022006921470165253,
        -0.022259531542658806,
        -0.0914774090051651,
        -0.00795530341565609,
        -0.03574898838996887,
        0.014017707668244839,
        -0.052942000329494476,
        -0.01240452378988266,
        0.005466874688863754,
        -0.02397335320711136,
        -0.04491443186998367,
        0.03641809895634651,
        -0.024359816685318947,
        -0.010997959412634373,
        0.02676170878112316,
        -0.06191420927643776,
        -0.049985360354185104,
        -0.051418714225292206,
        -0.0980452373623848,
        -0.002088996348902583,
        -0.029890257865190506,
        0.014089623466134071,
        0.02614624798297882,
        0.01249565090984106,
        0.028840919956564903,
        0.016749795526266098,
        -0.008069184608757496,
        -0.02775397337973118,
        3.511745308060199e-05,
        -0.040597908198833466,
        0.009552271105349064,
        0.07622730731964111,
        -0.0541297011077404,
        0.02371377870440483,
        0.11246950179338455
    ]
}