{
    "id": "raKSq-hW47Y",
    "title": "MASSIVE TECH UNBOXING!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-02-12T20:32:38Z",
    "video_url": "https://www.youtube.com/watch?v=raKSq-hW47Y",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "massive tech haul",
        "unboxing",
        "pixel slate",
        "kindle",
        "team super"
    ],
    "views": 1312655,
    "likes": 38731,
    "comments_count": 5061,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine, and today we are doing one of the most massive tech hauls that I have ever done. This unboxing is absurd. I got so many things over the holidays. And a bunch of this stuff I got last year and I hadn't got a chance to check it out or open or review, so I thought, let's do it all in one big massive crazy video. There's also two boxes on the ground, so we've got a lot of stuff to cover today. Gonna try to go sort of quickly, but also, I just need to say a huge thank you to you guys for supporting my channel, for supporting me over the past freaking ever, so while I'm doing this unboxing of a lot of cool stuff, I also wanted to give you guys something, and make this super simple, I'll be sending it to you directly from Amazon. I'll probably put in like an Echo Show, or like an Echo Dot or a couple of things from the Amazon line. This is not sponsored at all. I just felt like I'm opening a bunch of stuff and a lot of you guys are watching this and saying, \"I want something, too.\" Which is totally normal, totally fair, so I see you, I hear you. All you have to do is like, comment, subscribe on this video and then tweet me some photo proof that you guys did it. My Twitter handle is @iJUSTINE. Of course, you can follow me on Twitter, as well. And you might as well follow me on Instagram, because maybe I'll post the winner on Instagram, wow. Let's really make this super silly crazy scavenger hunt. So with that being said, my friends, welcome to my first 2019 crazy wild tech haul. There's so many random things in here. Like I've got something here from Lily, which I'm excited about. I got the oval Lamborghini phone that I got a long time ago. And never really got a chance to check out. I got Red Dead Redemption little surprise here. What if we put these items off to the side? Are you like, how are you, why are you holding me back? Oh. This is not what I thought was gonna be in this box. Read and relax. What is this? There's some lotion? This is actually one of my favorite brands of lotion, too. So that's something. Did I just turn into a beauty vlogger and I didn't know it? This stuff is incredible. And it's lavender, I feel so relaxed already. We've got slippers. I'm gonna go put these in the bath right now. All new Kindle Paper White. Oh, a reviewer's guide. They sent me this a long time ago. So I feel like this has probably been out for like seven months already. Look, Bluetooth built in, listen to your favorite, wait a minute, I can listen to Audible on my Kindle? This isn't even an Audible sponsorship. My Kindle came with bath supplies. What's in here? This is gonna take me five hours to film and 20 hours to edit. God, whatever this is, it smells really good. Is this from Lush? This is from Lush. Oh my goodness. If this is a bath bomb, I'm gonna be so hyped. Oh, yeah. Two bath bombs. (coughing) I may have inhaled it. Not just one. We've got two. This is a very strong smell. I think I'm gonna take a bath later. I love Lush. It may not seem like it, but I do. And a freaking robe? OK, well, it looks like I may have been out in the barn with my robe, but it's a very sweet gesture. God, I'm spending five hours on this Kindle. Oh, I thought that was a sticker, but that was just the screen. And so as you guys know, I'm a huge Xbox fan. I really don't play Battlegrounds that often. I did play when it first came out. But I am a huge, huge fan of all the custom controllers. So thank you, Xbox, for this. This actually came out a while ago. And what I do love about these controllers, too, is they will work with Windows 10. And I have a Microsoft Surface laptop that I use a lot when I travel, so I will use a controller and I game with the controller on my PC. I know, it's counter intuitive, but I don't really want to hear your judgment because I'm not here for that. Even though this is the internet and you're free to judge. I just don't care. I used to care a lot more. And the moment you stop caring is when you start living. So guess what? Let me use a controller with my PC. Although, I do say that, but then when I was at CES, I was checking out the Razor Titan that they have. It's basically a keyboard mouse setup for your Xbox. PC gaming with a controller, mouse and keyboard gaming on a console? I don't know. I just wish that I had more time to play video games. I used to play so much more. But the good news is that the time that I used to spend playing video games, I go outside, I work out now, and I try not to watch Netflix. So my quality of life since I've played less video games is actually significantly improved. But that doesn't mean that I don't love sitting and just playing a game and completely losing myself. But that's when you need to try to have something that sort of counterbalances that. Like, OK, if you just play games for five hours, go for a hike, go for a walk, go for a run, jog, I don't know, do something. So that was something that I had to learn last year. So hopefully I can instill some of that go outside mentality into you, as well. Echo Show. This is one of the newer ones, which I'm excited about because I really do love the Echo. I just am such a sucker for all smart home devices. And yeah, if you're gonna start jumping into crazy privacy issues, look, the moment that you have a phone in your hand, you post anything on the internet, like you're basically giving away your life, so just know that. Did I do this the wrong way? Am I supposed to like lift it up like this? Oh, I guess so. Look at you. Look at you and your little hat. You've got a little hat on. I used to wear that one Tiffany's T-necklace all the time and a lot of you guys were like is that an Amazon smile necklace? No. But I love Amazon. Wow, this screen is a lot bigger than the previous version. This is like one of my favorite kitchen devices. Probably gonna set this up and drop in on my friend Ed. Oh. That is an ominous sound. So I guess while that's happening, I'm gonna open up this box from Lily. I got a little note. Stay cozy. Oh my gosh, Skittles, yes, please. Oh, what do we got here? Oh. It's loading, it's loading, something's happening. Oh, this is super cute. Lily, these are awesome. I, oh my gosh, these are great. I love them. Oh, and a super cute jacket, too? Yes, I could have used this during this past couple of weeks. Because it was raining so bad. This is so cute. Thanks, girl. Oh, is it gonna take a while? Yes. Surface headphones, super hyped about that. Oh, all right, well. It's a clock. What? OK, it's a huge clock. Oh, it's a stop, oh, it's a timer. This is nice, I could put this in my gym. Little, what do they call it? Sweatbands? Is that what they're called? Do people wear those? I'm not sure if they do, but this is a thing. I'll put them in the gym. I'll push the button, OK. It's water resistant. Let's see what else you guys got in here. Oh. (laughing) So confused. It's like, is there supposed to be a charger in there? No, there's a whole 'nother level. Here's the Power Station XL. Little mini guy. I like this because it's more of the plastic feel. Some of the previous ones, they had, it's like a soft, kind of like material. This is so much packaging. Wow, oh and a cable. Hello, yes please. That's still updating. Next up, we've got some Surface headphones. These are great. I'm so excited to add this to like my Surface setup. I'm loving the new Surface Studio. It's such a great machine. And these are gonna look so great with it. Jenna has been using hers for a while. And I was like, I gotta go open 'em. Look at this case. That's a big case. The smell of new tech. Here they are. I like the little foam cups here, those are super soft. Hello? These are cool, I'm going to charge them up. Goodbye, she just said goodbye. It's got a 3.5 millimeter headphone jack. Just in case. You decide you need to plug them in, which is good because I've been needing some good wired headphones for when I'm shooting videos. You're still not setup yet. So this is the Oppo Lamborghini collaboration. Oh, wow. I am such a sucker for carbon fiber. Whenever I was ordering my car, I was like, I need the carbon fiber trim, stat. It's like, super fancy. I'm just, I've already smushed it up. Oh, oh. We've got accessories. Gosh, I love braided USB cables so much, and this is a USB C one. Look at this industrial. Not a plug that I can use here. But I guess when I travel, this will be lovely. This is huge. Thus is absolutely, just absolutely massive. Super. What are you? Whoa, look at that. Those are super, super fancy. And I like that they don't have the rubberized stuff on them. The rubber stuff just, it kind of ends up actually hurting my ears. Oh, yeah, these are nice. I don't think they're gonna quite stay in my ear, though. Just kind of jam it in there a little more, maybe. OK, that hurt. Oh, gosh, there is, this is the gift that keeps giving. Oh, nice. Carbon fiber Lamborghini case. I love the accessories. Like this just looks super fancy. Like now I want to go out and drive a Lamborghini. I had zero interest in driving one previous to opening this phone. Isn't that kind of like the reverse? Like shouldn't I want to buy this phone because I'm super into Lamborghinis? No. I just got a cool phone that's Lamborghini branded and now I want to go drive one of their cars. I don't know. Can we skip this? Because like. I don't, I really don't want to see this. Almost done. Oh, geez, it's only five hours later. Next up. This is, I made this a long time ago. This is kind of cool. It's called PowerPic Wireless Charger. It's a wireless charger, but it's also a picture frame. Certified fast charger delivers up to 10 watts of wireless power. Wireless charges phones. This video is taking a long time. In editing, it might not seem like it. Am I doing this completely wrong way? Wait, it said, OK. Lift here to open. But that's counter intuitive. Because it says lift here to open, but it's also like upside down. Wow, look at this. This is cool. What picture am I going to put here? This is such a cute idea. What is this? I'll probably put a picture of my dog in here. Drop in on Ed. - Did you mean Ed Baloombo? - Yes. Hello? Are you doing the dishes? Are you taking a shower? Are you peeing? Are you OK? Are you dead? Let me see where he's at. I feel like a super creep right now. It looks like he's out. So maybe I'll send him a picture. (laughing) Of me at his house. That was super fun. I had a really great time in Ed's house while Ed wasn't there. Let's move on to this. What? OK, I'm so into this. I really, really like it. When I originally read the packaging, I thought it was like a digital photo frame. But it's like an actual, real picture frame, but you can charge your phone. This is pretty exciting. This came in a bigger set of Red Dead Redemption stuff, but I'd opened the other things before the holidays, and I found this one that I hadn't opened yet. This is a Red Dead candle, and I love candles. I love Red Dead. I wish I would have played more over the holidays. My family's internet was so bad that every time I'd go to play my Xbox, and I would do an update, that it would take so long that by the time I got my update, it was time to come back to Los Angeles. Oh my gosh, I am so in love with it. This is an, this whole thing is a candle. Oh my God, and it smells so good. I am a beauty vlogger. This whole thing is a candle. Blood orange incense amber rock rose smoked cedar sandlewood violet leaf and juniper tar scented black wax candle. We've got a couple of other things here. These I'm really excited about. So, also over the holidays, I finally got one of the Razor Two phones, and it is a really amazing phone. Here's a few of the accessories that I didn't get a chance to open yet. This is the wireless charger. Looks fairly simple. Oh, yeah. That looks good. My cord wasn't long enough. It was like pulling on the cable. So that looks cool. Also, they sent over their Hammerhead USB C headphones. These look awesome. A nice little carrying case. Oh, yeah. Look at that. It's like, their attention to detail is something that I love so much. Like the headphones even have little lights on them, as well. Whoa. OK, it says Wi-Fi has no internet access. I know because my internet sucks. Like Time Warner Spectrum, I don't understand why you're such trash. Love this little carrying case so much. It has like a little clip and everything. Super overwhelmed. This video's almost over. Next up, oh, this is something that I was gonna do an entirely dedicated video to and then I ran out of time and everyone else released their videos, so I just never did it. This is the Google Pixel Slate. Tada. OK, so first up, let's peep those accessories. Directions. No thanks. Charging brick, of course, USB C, hey. Whoa, there was more things in there. Headphone jack dongle. How many of those do we see today? My video cut because Sony 7S21E goes to 29 minutes, which is one of the things that I really wanted one of the newer cameras, just please not have a recording length. For the sake of my sanity and a lot of other people's sanity every time I start filming, there's, I mean, are we looking for some criminals? Are we looking for criminals? There's a helicopter if you can't hear it. Should I say hi? Do you want to say hi? Like what's happening out there? (chopper whirring) So I'm gonna go inside now because that's pretty freaking close to me. It looks like there may be some criminal activity. They were flying right above my house, the police were here. So what you guys missed in the unboxing because everything basically shut off. I unboxed the Pixel Pen, the Pixel Slate Keyboard, and the Pixel Slate itself. And there's also one last thing. This is actually our last bit of unboxing. I'm exhausted. This was a lot of stuff. My recycling bin is going to be super full. Bridge Wireless Keyboard. All right, I'll take a look at you. Wow, this is heavy. This is super heavy. OK, no, it's not. It was picking up the box. So, this is another little keyboard option. For your Pixel Slate. Right into it like that. So, I think that I might like the other one a little more because it's lighter. And this one is also just like a wireless keyboard, so it'll probably just connect with Bluetooth, it seems like. And I don't really like this little, I don't like that. I don't like this at all, actually. It does match very nice, though. So that's a good thing. But I think I might prefer this other folio case instead. Another thing that you missed is I was struggling to figure out how to get this to stand up because I didn't read the directions, obviously. I'm kind of used to the Surface, or like the iPad. Like it's super simple, you just kind of like go like that or on the Surface, it has it built in. But you just slide this case down, and then it magnetizes itself to the back. At first I was like, that's an interesting choice, but now that I've been kind of messing with it a little bit, of course, you guys would have seen it, but my camera cut, and I'm kind of into it. Magnifying glass. Oh, look at this. Capture region, I'll capture that. Great, great screenshot. Well, guys, that was just a very massive tech haul. Probably one of the biggest I've ever done. A lot of this stuff, like I said, had just built up over time and I just wanted to share it with you guys and do a fun unboxing and like I said at the beginning, if you guys wanted to enter to win my Justine is sending me something from Amazon, I don't know what it is, surprise gift box, make sure you subscribe to my channel, like this video, comment below, and take a screenshot of all of those things and tweet it to me @iJUSTINE. What's my heart rate? It's probably super high. Getting all amped up over all this tech. (gentle music)",
    "transcript_keywords": [
        "super",
        "time",
        "guys",
        "love",
        "video",
        "lot",
        "stuff",
        "Pixel Slate",
        "Surface",
        "Red Dead",
        "things",
        "kind",
        "long time",
        "Wireless",
        "case",
        "thing",
        "Red Dead Redemption",
        "Lamborghini",
        "phone",
        "Amazon"
    ],
    "transcript_entity_values": [
        "zero",
        "Ed Baloombo",
        "Surface Studio",
        "a minute",
        "one",
        "Amazon",
        "iPad",
        "USB C",
        "the Pixel Slate",
        "Echo Show",
        "Lamborghini",
        "Justine",
        "Two",
        "CES",
        "Red Dead",
        "Sony",
        "Windows 10",
        "Instagram",
        "like seven months",
        "Skittles",
        "Bluetooth",
        "jack",
        "Microsoft Surface",
        "PowerPic Wireless Charger",
        "Twitter",
        "Kindle",
        "last year",
        "Xbox",
        "Los Angeles",
        "My Kindle",
        "up to 10 watts",
        "Netflix",
        "Oppo Lamborghini",
        "an Echo Show",
        "Titan",
        "Tiffany",
        "the holidays",
        "Time Warner Spectrum",
        "Razor",
        "29 minutes",
        "Lily",
        "the Google Pixel Slate",
        "five hours",
        "Ed",
        "today",
        "Surface",
        "two",
        "your Pixel Slate",
        "20 hours",
        "3.5 millimeter",
        "Wi-Fi",
        "Xbox",
        "first",
        "only five hours later",
        "Red Dead Redemption",
        "Bridge Wireless Keyboard",
        "this past couple of weeks",
        "Kindle",
        "Kindle Paper White",
        "USB",
        "Hammerhead USB C",
        "Jenna",
        "Tada"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "EVENT",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "TIME",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.021509971469640732,
        -0.06805254518985748,
        -0.05114412307739258,
        -0.11017099767923355,
        0.03279406204819679,
        0.0237420704215765,
        0.030551929026842117,
        0.027067895978689194,
        -0.03918202593922615,
        0.056816939264535904,
        0.017447570338845253,
        0.0201917365193367,
        -0.009205551818013191,
        -0.0121495071798563,
        -0.03160732612013817,
        0.04365690425038338,
        -0.0035170631017535925,
        -0.02206561155617237,
        -0.014454548247158527,
        0.041747890412807465,
        -0.0335606150329113,
        -0.06674584001302719,
        -0.007225414738059044,
        -0.007933808490633965,
        -0.018358590081334114,
        0.08450805395841599,
        0.0011114838998764753,
        0.02387969382107258,
        -0.09959043562412262,
        -0.10416791588068008,
        -0.029200907796621323,
        0.03219965845346451,
        0.07815898954868317,
        0.007233088370412588,
        0.0246833898127079,
        -0.021615849807858467,
        0.016376977786421776,
        -0.0002998711133841425,
        -0.027653681114315987,
        -0.05055040493607521,
        0.0023440993390977383,
        -0.03977338224649429,
        0.027469925582408905,
        -0.023771772161126137,
        -0.05401226505637169,
        -0.09243445098400116,
        -0.013320120051503181,
        -0.06863746792078018,
        0.06212173029780388,
        0.02928924933075905,
        -0.06625666469335556,
        -0.023539112880825996,
        0.038465678691864014,
        0.0479392483830452,
        -0.0774531289935112,
        -0.030763350427150726,
        -0.06080491840839386,
        0.004094370175153017,
        0.02397814765572548,
        -0.09102901071310043,
        0.02043789252638817,
        -0.02888820320367813,
        0.010671879164874554,
        0.04251798987388611,
        -0.03353883698582649,
        -0.022347738966345787,
        0.026924636214971542,
        0.021340882405638695,
        0.0008893952472135425,
        0.02121742069721222,
        -0.09569473564624786,
        0.04919685050845146,
        -0.050075508654117584,
        0.0339820422232151,
        0.026970315724611282,
        0.033262524753808975,
        0.009239699691534042,
        -0.04896019026637077,
        0.015989627689123154,
        0.09786307066679001,
        0.038347505033016205,
        -0.035447489470243454,
        -0.07850395888090134,
        -0.03198528289794922,
        -0.004910505376756191,
        0.0388089157640934,
        -0.004489012528210878,
        0.03953130915760994,
        -0.04286321625113487,
        -0.08643185347318649,
        -0.10123630613088608,
        -0.006661125458776951,
        0.01653655245900154,
        0.01852952502667904,
        -0.011950775980949402,
        -0.08673582226037979,
        -0.05730031803250313,
        -0.05289623141288757,
        -0.05148192495107651,
        0.059950243681669235,
        0.061066076159477234,
        -0.052756376564502716,
        0.01409067027270794,
        -0.05197645351290703,
        -0.03203925862908363,
        -0.11376206576824188,
        -0.05139002948999405,
        0.030193567276000977,
        0.014096764847636223,
        -0.0005368530401028693,
        -0.07642107456922531,
        0.03960244357585907,
        -0.06477431207895279,
        -0.039401471614837646,
        0.00982428528368473,
        0.13141314685344696,
        -0.019178427755832672,
        0.09006527811288834,
        0.013563372194766998,
        0.023298444226384163,
        0.0029170899651944637,
        -0.10562603920698166,
        -0.014958521351218224,
        0.026017364114522934,
        0.006199766416102648,
        0.03909457474946976,
        -0.06395679712295532,
        1.2356698168192005e-32,
        -0.018864933401346207,
        0.05785898119211197,
        -0.008845413103699684,
        0.09631230682134628,
        0.02211371436715126,
        -0.01714901626110077,
        -0.01617301255464554,
        0.11217924952507019,
        -0.02510000579059124,
        0.026955008506774902,
        0.0007073806482367218,
        0.06443781405687332,
        -0.033600907772779465,
        0.0474836491048336,
        0.04035564512014389,
        -0.08456765115261078,
        -0.011300540529191494,
        -0.02998303435742855,
        -0.06140218675136566,
        -0.01732875034213066,
        0.006682281848043203,
        -0.003339019836857915,
        0.008933833800256252,
        0.08641686290502548,
        0.10481972992420197,
        0.09396389126777649,
        0.04716397076845169,
        0.004431457724422216,
        0.07820533961057663,
        0.005865374580025673,
        -0.04496379941701889,
        -0.0671815499663353,
        -0.009405392222106457,
        -0.06829792261123657,
        0.00572447432205081,
        0.0034048918168991804,
        -0.07680545747280121,
        -0.0014642828609794378,
        0.00950788427144289,
        -0.0023511401377618313,
        -0.00032255929545499384,
        -0.014330517500638962,
        -0.07362709939479828,
        -0.06961685419082642,
        0.09134232252836227,
        0.02959344908595085,
        0.050753094255924225,
        0.07843826711177826,
        -0.05274944752454758,
        -0.012411326169967651,
        0.004313006531447172,
        0.013018405996263027,
        -0.047061048448085785,
        -0.011263668537139893,
        -0.019123313948512077,
        -0.08135442435741425,
        -0.022611675783991814,
        0.058938972651958466,
        0.08450722694396973,
        0.06916097551584244,
        0.019619420170783997,
        -0.018322421237826347,
        -0.016193348914384842,
        -0.020860012620687485,
        -0.06444869190454483,
        0.09997592866420746,
        0.04296969249844551,
        -0.025196803733706474,
        0.025181252509355545,
        0.07053159177303314,
        0.009212215431034565,
        -0.0016142664244398475,
        0.04293273761868477,
        0.009009217843413353,
        0.05706724151968956,
        0.07322884351015091,
        -0.08476420491933823,
        -0.04147433862090111,
        0.00783947017043829,
        -0.02610328607261181,
        -0.09881860017776489,
        0.08956585079431534,
        -0.002106282627210021,
        0.08338547497987747,
        -0.02056504599750042,
        -0.0648663341999054,
        0.0077737499959766865,
        -0.023198939859867096,
        -0.053021322935819626,
        0.0168632622808218,
        -0.009218226186931133,
        0.0807226374745369,
        -0.0754709467291832,
        -0.050774648785591125,
        -0.018630821257829666,
        -1.2037127539293489e-32,
        0.031279079616069794,
        0.02052401565015316,
        -0.007197986356914043,
        -0.03901905193924904,
        0.07171281427145004,
        -0.02907569706439972,
        0.03709324449300766,
        0.0837579146027565,
        0.0653255432844162,
        -0.06980349123477936,
        0.03568866476416588,
        -0.06868238002061844,
        -0.10018441081047058,
        0.006403859239071608,
        -0.034267038106918335,
        -0.0376761220395565,
        -0.038237329572439194,
        -0.04737476631999016,
        0.05047295615077019,
        -0.010267892852425575,
        0.08993489295244217,
        0.13028517365455627,
        0.08807636797428131,
        0.025182196870446205,
        -0.017755957320332527,
        0.011978121474385262,
        0.009006363339722157,
        0.05992025509476662,
        0.07435617595911026,
        0.06979713588953018,
        -0.0022910486441105604,
        -0.06382325291633606,
        -0.0213735681027174,
        0.012845426797866821,
        0.026275919750332832,
        0.06663772463798523,
        0.021564524620771408,
        0.06307963281869888,
        0.007998552173376083,
        -0.07251478731632233,
        0.01356272492557764,
        0.017613131552934647,
        -0.04039875045418739,
        -0.00630273437127471,
        0.010778653435409069,
        -0.12112356722354889,
        -0.06754129379987717,
        0.025795219466090202,
        0.019184593111276627,
        0.000735172419808805,
        -0.09083321690559387,
        -0.06046780198812485,
        0.0005316423485055566,
        -0.0404893197119236,
        -0.025708936154842377,
        0.020085234194993973,
        -0.05264010652899742,
        -0.021911950781941414,
        0.040498971939086914,
        0.0007367514190264046,
        0.047531820833683014,
        -0.04580758884549141,
        -0.06692617386579514,
        -0.07038511335849762,
        0.003640483133494854,
        -0.07026425749063492,
        0.10667965561151505,
        0.029660029336810112,
        -0.028658248484134674,
        0.0016343051102012396,
        -0.007690425496548414,
        0.03784101456403732,
        0.039843954145908356,
        0.007098973263055086,
        0.04754198342561722,
        0.013461403548717499,
        -0.08267528563737869,
        0.003626203630119562,
        0.1008409634232521,
        -0.04688454046845436,
        -0.057103365659713745,
        -0.02836800366640091,
        0.03073413483798504,
        0.06016961857676506,
        0.09654434770345688,
        0.08499462157487869,
        0.10311385244131088,
        -0.02819152921438217,
        -0.022054113447666168,
        0.03371085599064827,
        0.008622915484011173,
        0.04578953608870506,
        0.08570872992277145,
        0.1049167811870575,
        -0.0877709686756134,
        -6.188690804265207e-08,
        0.0514986515045166,
        0.013812586665153503,
        -0.03677790239453316,
        0.003073451342061162,
        0.017516832798719406,
        -0.10767100751399994,
        -0.03474467992782593,
        0.04889645427465439,
        0.07095374912023544,
        -0.06794776767492294,
        0.06959065794944763,
        -0.024287384003400803,
        -0.026918558403849602,
        0.11242055147886276,
        0.04925193637609482,
        0.01900542341172695,
        -0.10113107413053513,
        0.08095020800828934,
        -0.045707009732723236,
        -0.05009159818291664,
        -0.04447602108120918,
        0.05053642764687538,
        0.05223631113767624,
        0.00961790606379509,
        0.05618312209844589,
        0.01336350105702877,
        0.010667194612324238,
        -0.011524693109095097,
        0.052784327417612076,
        0.02402857132256031,
        -0.09167972952127457,
        -0.00824287161231041,
        -0.01341178733855486,
        -0.008346064947545528,
        -0.061469875276088715,
        -0.04245326668024063,
        -0.03984681889414787,
        -0.00032943280530162156,
        0.02748952805995941,
        -0.0003079247544519603,
        0.027281012386083603,
        -0.12910757958889008,
        -0.05735453963279724,
        -0.002703186124563217,
        0.007570955902338028,
        -0.07624422758817673,
        0.022246913984417915,
        -0.06187515705823898,
        -0.05220923200249672,
        -0.02629784867167473,
        -0.02992231212556362,
        0.05201112478971481,
        0.021544700488448143,
        -0.019022203981876373,
        0.07841943204402924,
        -0.008187828585505486,
        0.02205730229616165,
        0.06295206397771835,
        -0.0001855219597928226,
        0.004246335010975599,
        0.017453858628869057,
        0.017718220129609108,
        -0.05082038789987564,
        0.03127310425043106
    ]
}