{
    "id": "rDl8Pikg95A",
    "title": "Where is the 8th BUTTON? - Razer DeathAdder V2 Gaming Mouse",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-04-12T17:14:46Z",
    "video_url": "https://www.youtube.com/watch?v=rDl8Pikg95A",
    "category": "People & Blogs",
    "tags": [
        "gaming",
        "mouse",
        "pc",
        "desktop",
        "computer",
        "razer",
        "performance",
        "skates",
        "smooth",
        "best",
        "ultimate",
        "lift",
        "features",
        "DPI",
        "Polling",
        "Click",
        "Optical",
        "Mechanical",
        "50 million",
        "70 million",
        "durable",
        "wheel",
        "cord",
        "light",
        "heavy",
        "shape",
        "claw",
        "unboxing"
    ],
    "views": 878792,
    "likes": 26752,
    "comments_count": 1888,
    "description": "Does this gaming mouse live up to the hype of the original? Will it dethrone the legend? Check it out with James!  Buy Razer DeathAdder V2 On Amazon (Paid Link):     On NewEgg (Paid Link):       Buy Razer DeathAdder Elite On Amazon (Paid Link):     On NewEgg (Paid Link):      On Best Buy (Paid Link):   Buy Large Mousepad On Amazon (Paid Link):      On NewEgg (Paid Link):       Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/wZ9RX",
        "https://geni.us/wcFD4y",
        "https://geni.us/alVHsG",
        "https://geni.us/jR0N",
        "https://shop-links.co/1725431991881478907",
        "https://geni.us/h6c5A",
        "https://geni.us/ALHi3c",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Better late than never, it's the Razer Deathadder V2. Obviously, a very popular mouse. But what's new with it, compared to the other Deathadder Elite that was also super popular? Well, a few things. And I'm gonna tell you what they are. Very simple box. Not too hard to get into. Comes with a bunch of stuff we probably don't care about. Unleash your true potential! Signature from the C.E.O. Oh my God, I can put this on my motorcycle helmet visor. Cool! (humming \"Halo\" theme\") There's a hair in there! (blows) Someone's been here before. Well, immediately it feels quite light, compared to other Deathadders. Okay, this is a nice looking mouse. It's kind of matte plastic on the top, with sort of rubberized side. Gnarled on the sides a bit. Feels pretty light. I got a scale here. Without the cable, comin' in at 78 grams. I know the scale's not perfect. It's not. But relatively speaking, that says 80, 82. Let's see what it is relative to this other Elite. There we go. See, this box has the green inside. I kinda like that more. Oh yeah! This thing is a chonk! Compared to this. At least 16 grams heavier. That's pretty impressive, considering the chastity is almost identical. Looking at these side by side, the shell shape is very similar, especially on this side of the center line. The most notable difference is over here. Now on the existing Elite, some people were bothered by the way this curves out. Especially if you had smaller hands. This is kind of a safer design. It's less extreme over here. And this will probably be more comfortable to more people, especially those with small hands. Other than that, I guess these DPI buttons are kinda further down, a little more out of the way than these ones. It's a different button design. (clicking button) the wheel looks slightly different. There's just smaller bumps on it than this one. It's not like a Logitech MX Master wheel, where you can free spin it. The MX Master 3S, which is obviously not even a gaming mouse, it's nice because it's ratcheted at lower speeds, but then you can flick it and it'll free spin. That is not going on here. And you probably, maybe you wouldn't even want it to. This is just designed to easily go through your weapons with your scroll wheel, if you're the kind of person that goes through your weapons with your scroll wheel. It doesn't feel that different, but there may be a little more force on it than the last one. While we're clicking things, the left and right mouse clicks. They're actually different. The Elite used to use mechanical switches, omron switches that were ready for about 50 million clicks. The V2 though, uses optical switches, which I believe are lower latency, and they're ready for 70 million clicks. And this is what they sound like. (clicking rapidly) Another change on the V2 is the cable, actually. You already had a braided cable, which is all right. It's a fine braided cable on the Elite. You can see the cable is slightly fatter on the V2, and that's 'cause it uses their speedflex cable. Speedlfex. It's very supple. Oh my goodness. It's, it's just almost frictionlest. Frictionlest. The spirit of the design here is low friction. So, it's not gonna drag as much when you're, you know, when you have your low DPI setting, you're-- But that's not the only thing interacting with the table. There's also the feet on the bottom. And the V2 has new and improved feet. These standard feet are way draggier. They say, in comparison. And in fact, I mean it's hard to tell because this is also lighter, but it does feel a little more frictionless. These are PFTE feet. That's a material that's used in non-stick pans. It's used to coat piping and containers for corrosive chemicals, because it's nonreactive. On a side by side comparison that I saw on Razer's own website, they said that the new one has eight buttons while the Elite had seven buttons. And I don't know if I'm missing something here, but it looks like one, two, three, four, five, six, seven. Where's the eighth button on this thing? Maybe up in the comments? (laughing) I don't know. Ah, what a dog! Give me that speedflex cable. PFTE skates. It actually is noticeably. I don't know what to attribute the smoothness to, the weight, the cable or the feet, but it's noticeably nicer. And of course, RVB. Sharp. That's the outside of the mouse. But there's also some changes on the inside. Because this uses a new and improved sensor. Added their Razer focus plus sensor. It has a DPI of 20,000 dots per inch. Up from 16K on this peasant mouse. It also has a tracking speed of 650 inches per second. Which is, I mean, that's pretty damn fast. You're gonna have to be moving your mouse at 37 miles per hour, 60 kilometers an hour to exceed that. It also has a 50G acceleration. But the cool thing is that the sensor is paired with an SOC inside, which allows some cool other features. Well, three other cool features. The first cool feature is something called smart tracking. The sensor itself calibrating relative to whatever surface it's on. You'll get the same consistent lift-off distance, without having to calibrate the mouse every time you set up in a different location, if you go from your mousepad to a glossy table to something else. Because, you're on the road with your mouse, going to LAN parties and stuff, and you don't want to mess around just because you don't have the same battle station conditions as usual. Feature number two! Is called asymmetric lift off. What this is is it's a distance that you can set in the synapse software, where the mouse kind of turns off at a certain distance, the lift off distance when you lift it up. Because again, if you're playing with a low sensitivity, and you're going like this, you're gonna be lifting the mouse up a lot. You can set it to say, two or three milimeters. To deactivate as you lift it. But, if you did not have asymetric lift off distance, that would mean that when you put it back down, it turns back on at that same distance, say two or three millimeters. You may not want that, actually. Because then on its way back down, it'll start reading when you're still kind of far away from the table, and then your mouse cursor will actually move a little bit before you pad it back down. What you want is asymetric. That's where it's three millimeters to get off the desk, but it doesn't activate again until a millimeter off the table. So you're gonna have your cursor to stay where you want it to be less adrift. And that is awesome. And feature number three is motion sync. Which is basically aligning the pulling rate of the mouse and the host PC so that the information is arriving at the same time, so there's reduced input life in that. It's kinda like, if I can VRR for holding rate. Is that a stretch? And finally, the other thing that is different about this mouse is onboard memory. Again, because the SOC. Previous Elite had no onboard memory. That meant that you'd always have to isntall the Razer synapse software, which you may not want 'cause it's kind of annoying and clunky. With this, you can have up to five profiles saved on device. You just set up the synapse software once when you first get it. And you can change all the lighting profiles, and even macros and all the stuff like that. Then you save that profile onto the mouse, so you don't have to open up that software anymore. You can even uninstall it for a time. And then you can bring your mouse to other places and tournaments and your profiles are still on there. But if you want to adjust the lighting and add your macros, you're gonna have to install that software again. If you're into RGB stuff, this is of course, in the ecosystem of Razer Chroma, which means it can sync with all your other peripherals, all your other Razer stuff. Your keyboard, all the lights in sync together. And of course, with Philips Hue. You can be watching a movie or playing a game, and your mouse lighting will sync up with that too. In sync. What a world. What a time to be alive. - [Andy] Does the button on the bottom count as the eighth button? - Yes. Oh my God, it has to. You're right. Andy, you're a genius. You found the eighth button! It's the profile selection button on the bottom of the mouse. I'll allow it. I'll allow it. Should you get the V2, particularly should you get it if you already have an Elite, ooh God. I would say, yeah. If you don't mind the $69.99 price tag. Nice. It's a worthy upgrade. It's 20 grams lighter. That's significant. Especially if you're the type of person who stopped using Elite because it was too heavy. Yeah, relative to all the other much lighter wired mice that exist today. If you wanted to love the Deathadder, but the feeling wasn't good in your hand, because of the shape, especially if you have small hands, then this is great. Especially if you're a palm-grip player, I mean it'll work for claw grips and finger-tippy people as well. I think give this a feel. Give it a lift. See if you like it. It might be worth it. It might be your next mouse. Thanks for watching \"Short Circuits\" today guys. If you liked this video, give it a like. If you really, really like it, give it a subscribe. And be sure to stay tuned. If you guys hit us up in the comments, and tell us to cover the new Razer Basilisk Ultimate, or ultra, whatever it's called, maybe we'll do that too. If enough of you yell at me. See you next time.",
    "transcript_keywords": [
        "mouse",
        "Elite",
        "Razer",
        "kind",
        "cable",
        "Deathadder Elite",
        "button",
        "side",
        "Razer Deathadder",
        "Deathadder",
        "lift",
        "distance",
        "thing",
        "feet",
        "Cool",
        "software",
        "sync",
        "Give",
        "stuff",
        "time"
    ],
    "transcript_entity_values": [
        "Previous Elite",
        "seven",
        "78 grams",
        "five",
        "VRR",
        "At least 16 grams",
        "20 grams",
        "Razer",
        "three",
        "about 50 million",
        "V2",
        "one",
        "82",
        "three milimeters",
        "Razer Basilisk Ultimate",
        "Deathadders",
        "20,000",
        "Logitech",
        "Deathadder",
        "Andy",
        "three millimeters",
        "SOC",
        "eighth",
        "3S",
        "omron",
        "Elite",
        "80",
        "69.99",
        "LAN",
        "Halo",
        "650 inches",
        "50",
        "Razer Chroma",
        "first",
        "Deathadder Elite",
        "16",
        "Razer",
        "two",
        "up to five",
        "Razer",
        "the Razer Deathadder V2",
        "four",
        "RVB",
        "37 miles per hour",
        "RGB",
        "six",
        "60 kilometers an hour",
        "eight",
        "today",
        "MX",
        "Philips Hue",
        "70 million"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.07037036120891571,
        -0.09506449848413467,
        -0.02450789324939251,
        -0.07305681705474854,
        0.09670130908489227,
        0.015273956581950188,
        0.061484698206186295,
        0.05321957916021347,
        -0.024684716016054153,
        0.13540467619895935,
        0.020752545446157455,
        0.05240187048912048,
        -0.05808273330330849,
        -0.03186745569109917,
        0.02712884172797203,
        -0.03159734606742859,
        0.04625800997018814,
        -0.06277429312467575,
        -0.07810758054256439,
        -0.02018713764846325,
        0.0029126780573278666,
        -0.06343012303113937,
        0.05986006185412407,
        0.017186513170599937,
        -0.08962082862854004,
        -0.002305779606103897,
        -0.019321944564580917,
        -0.021270422264933586,
        -0.01636567898094654,
        -0.05500244349241257,
        0.014135529287159443,
        0.0185482706874609,
        -0.03391188755631447,
        -0.00781839806586504,
        -0.04512573406100273,
        -0.06629320234060287,
        0.027401022613048553,
        -0.042131952941417694,
        -0.0723329558968544,
        -0.024670269340276718,
        -0.0336235873401165,
        -0.028745610266923904,
        0.003772691125050187,
        0.07903672009706497,
        -0.031037112697958946,
        -0.030409198254346848,
        -0.003674115287140012,
        -0.028899140655994415,
        0.05946455895900726,
        0.04548316448926926,
        0.06388325989246368,
        -0.08178327977657318,
        0.06589258462190628,
        -0.06796407699584961,
        -0.010958188213407993,
        0.04628932476043701,
        -0.029605824500322342,
        -0.06735837459564209,
        0.024794869124889374,
        0.021393902599811554,
        0.00982845202088356,
        -0.06475307792425156,
        0.0013359059812501073,
        0.037134524434804916,
        0.007072224747389555,
        -0.04654255136847496,
        0.02137947827577591,
        -0.0200266744941473,
        -0.058799318969249725,
        0.014928631484508514,
        -0.000557746971026063,
        -0.008876718580722809,
        -0.019006146118044853,
        0.09015627950429916,
        0.01042889803647995,
        -0.07085610926151276,
        0.018790775910019875,
        0.0413278304040432,
        0.024047207087278366,
        -0.020621398463845253,
        0.027749156579375267,
        -0.04070718213915825,
        0.022404300048947334,
        0.03260914981365204,
        0.023373601958155632,
        0.017271772027015686,
        -0.027926575392484665,
        0.0607333742082119,
        0.015013793483376503,
        -0.05748650059103966,
        0.001037326641380787,
        0.09364718198776245,
        0.01839369535446167,
        -0.015248745679855347,
        0.028166446834802628,
        0.011393600143492222,
        0.01933721825480461,
        0.0049045635387301445,
        -0.07323884963989258,
        0.03230315074324608,
        -0.009971878491342068,
        -0.03748280182480812,
        0.036286428570747375,
        0.0022934055887162685,
        0.048204775899648666,
        -0.056282252073287964,
        -0.03254937380552292,
        0.06472119688987732,
        -0.039533451199531555,
        0.04977758228778839,
        -0.06134311109781265,
        -0.017692754045128822,
        -0.033075883984565735,
        -0.0021904243621975183,
        0.02540496550500393,
        0.06280263513326645,
        -0.03964724764227867,
        0.011228355579078197,
        0.13395799696445465,
        -0.00744936428964138,
        0.05708926543593407,
        0.004319959785789251,
        -0.007957513444125652,
        -0.03520744666457176,
        0.03458891063928604,
        0.09329641610383987,
        -0.03194364532828331,
        3.463914794250454e-33,
        0.03633488342165947,
        0.018340567126870155,
        -0.03564639762043953,
        -0.04198051989078522,
        -0.11944659054279327,
        0.023794693872332573,
        0.055207714438438416,
        0.05930549278855324,
        -0.04969067871570587,
        0.07495205849409103,
        -0.06279727071523666,
        -0.03892518952488899,
        -0.07765687257051468,
        0.0613061897456646,
        0.07349587231874466,
        -0.06329119950532913,
        -0.009299444034695625,
        0.027267470955848694,
        -0.06416449695825577,
        -0.09034370630979538,
        -0.012369269505143166,
        0.1101151779294014,
        0.015643922612071037,
        0.05215936526656151,
        0.03827111795544624,
        0.1103169173002243,
        -0.03710006922483444,
        -0.0005369486752897501,
        0.0206610020250082,
        0.0037535973824560642,
        -0.056792519986629486,
        -0.03828012943267822,
        -0.027551254257559776,
        -0.0511026605963707,
        -0.03897123411297798,
        -0.015946922823786736,
        -0.014060650020837784,
        -0.11498475074768066,
        0.05307852476835251,
        -0.004308473318815231,
        -0.025482933968305588,
        -0.055589646100997925,
        -0.0943785160779953,
        -0.10938208550214767,
        -0.00030333027825690806,
        0.05162147805094719,
        -0.007417008280754089,
        -0.08750615268945694,
        0.01917243003845215,
        -0.040974751114845276,
        -0.061926890164613724,
        0.016228366643190384,
        0.03589191287755966,
        0.0069039654918015,
        -0.03867365047335625,
        -0.041042476892471313,
        0.04058610275387764,
        0.02638746052980423,
        0.07329032570123672,
        0.02064303122460842,
        0.02661239542067051,
        -0.009500640444457531,
        0.007140772882848978,
        0.07589289546012878,
        -0.01973487064242363,
        0.11427834630012512,
        0.02306031808257103,
        -0.03634282574057579,
        0.007456711493432522,
        0.025782963261008263,
        -0.0051912181079387665,
        -0.0012619637418538332,
        -0.006886094342917204,
        -0.07134788483381271,
        0.050628840923309326,
        0.03479374945163727,
        -0.07031967490911484,
        0.017460158094763756,
        -0.02401343360543251,
        0.025187931954860687,
        -0.0043674735352396965,
        0.010642730630934238,
        -0.0830044224858284,
        0.09163066744804382,
        0.018965238705277443,
        -0.04898811876773834,
        -0.02146206423640251,
        -0.019752908498048782,
        -0.026899348944425583,
        -0.04752150550484657,
        -0.007386223878711462,
        -0.01641702838242054,
        -0.060682591050863266,
        0.019110381603240967,
        -0.023884886875748634,
        -6.271308646726967e-33,
        -0.0327552929520607,
        0.0012898631393909454,
        0.007106462959200144,
        0.07879313826560974,
        -0.025812901556491852,
        0.10050692409276962,
        -0.04760841652750969,
        0.003850305685773492,
        0.0007791491807438433,
        -0.04824594408273697,
        0.014741403050720692,
        0.09358292073011398,
        -0.0336221307516098,
        -0.012208743020892143,
        0.06065209582448006,
        0.004307232331484556,
        -0.02878345176577568,
        0.02562236599624157,
        0.0715685486793518,
        -0.09890338033437729,
        0.12001316994428635,
        0.04377075657248497,
        -0.03258243575692177,
        0.01666868105530739,
        -0.01509974617511034,
        -0.09637846797704697,
        0.05696169286966324,
        0.04692773520946503,
        -0.0004590186581481248,
        0.0013082484947517514,
        0.07493197172880173,
        0.01721847429871559,
        0.04193897545337677,
        0.08851934224367142,
        0.04981508105993271,
        0.0005214237608015537,
        0.0393700934946537,
        -0.005565846338868141,
        -0.05409223958849907,
        -0.03635542839765549,
        0.0074293408542871475,
        -0.02070130780339241,
        0.0681668072938919,
        -0.041327398270368576,
        0.014549197629094124,
        -0.06829067319631577,
        -0.10523595660924911,
        -0.0430905856192112,
        0.019760584458708763,
        0.04502316191792488,
        -0.04447445273399353,
        -0.0734054297208786,
        0.0012495152186602354,
        -0.05873086303472519,
        -0.13056978583335876,
        -0.012220888398587704,
        -0.09778580814599991,
        -0.02651946432888508,
        0.0685652419924736,
        -0.013604980893433094,
        0.023168282583355904,
        0.03180992230772972,
        -0.043017975986003876,
        0.05627236142754555,
        -0.015325441025197506,
        -0.022492308169603348,
        0.049455199390649796,
        0.04615846648812294,
        -0.0921202152967453,
        0.004540208727121353,
        0.027541300281882286,
        -0.029271842911839485,
        0.02664376050233841,
        -0.009924374520778656,
        0.016817348077893257,
        0.06110891327261925,
        0.022717658430337906,
        0.01584380678832531,
        0.02383413538336754,
        -0.0677824392914772,
        -0.0028669368475675583,
        -0.04021405056118965,
        0.14509983360767365,
        0.012182116508483887,
        -0.020540570840239525,
        0.06104343384504318,
        -0.007746622432023287,
        -0.006416787393391132,
        0.01325061172246933,
        -0.028113165870308876,
        -0.020156433805823326,
        -0.03918078914284706,
        -0.04587332531809807,
        0.10847217589616776,
        -0.051979176700115204,
        -5.7222653282451574e-08,
        0.017984583973884583,
        0.022177232429385185,
        0.033561982214450836,
        -0.05661355331540108,
        0.05763991177082062,
        -0.01753781922161579,
        -0.009533233009278774,
        0.09734165668487549,
        -0.023114560171961784,
        0.06476102769374847,
        -0.00023357724421657622,
        0.01965511031448841,
        -0.028277438133955002,
        0.017694750800728798,
        0.021886909380555153,
        0.10207854956388474,
        -0.10697812587022781,
        0.0093266936019063,
        0.007870295085012913,
        -0.0027280792128294706,
        -0.0179862380027771,
        -0.035281021147966385,
        0.152128204703331,
        -0.09791180491447449,
        -0.010744919069111347,
        0.0011074041249230504,
        -0.08796310424804688,
        0.06115194782614708,
        0.07314912229776382,
        -0.006498416420072317,
        -0.0010741124860942364,
        0.005520053207874298,
        0.1073213741183281,
        0.024684075266122818,
        -0.00681652594357729,
        -0.03228273615241051,
        -0.04139713570475578,
        0.013950304128229618,
        -0.01701132394373417,
        0.009347916580736637,
        0.010012304410338402,
        -0.12051206082105637,
        -0.03538326919078827,
        -0.028739789500832558,
        -0.03842586651444435,
        -0.0015170093392953277,
        -0.03228789567947388,
        -0.1055876687169075,
        -0.04203128069639206,
        -0.0839143842458725,
        -0.035598866641521454,
        0.022876959294080734,
        -0.024418629705905914,
        0.0028257397934794426,
        0.01724589429795742,
        -0.0444946214556694,
        -0.08744962513446808,
        0.020936187356710434,
        0.08214732259511948,
        0.016549138352274895,
        0.14853821694850922,
        -0.02256622165441513,
        0.0003893830580636859,
        0.13327324390411377
    ]
}