{
    "id": "Rh5hL47z2us",
    "title": "Reacting to our Most PROFITABLE Videos!",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-15T18:37:41Z",
    "video_url": "https://www.youtube.com/watch?v=Rh5hL47z2us",
    "category": "Science & Technology",
    "tags": [
        "money",
        "youtube",
        "how much money do youtubers make",
        "how much money is a million views",
        "can you make money on youtube",
        "what's the best ltt video?",
        "how much money does linus make",
        "reaction",
        "youtube business",
        "is mrbeast rich"
    ],
    "views": 2337162,
    "likes": 113222,
    "comments_count": 4098,
    "description": "Check out the OnePlus 10 Pro 5G with 12GB RAM & 256GB of storage at   SmartDeploy: Claim your FREE IT software (worth $580!) at   Linus and James look back at the LTT videos that made the most money and try to figure out the secret to their success.  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:00 Number 10 3:00 9 4:11 8 5:07 What are CPMs? 6:09 7 7:59 6 9:07 5 10:44 IT'S NOT CLICKBAIT 11:54 3 13:17 NUMBA 2 14:45 Don't skip to the end you monster 16:00 Key Take-aways 18:12 Outro",
    "description_links": [
        "https://bit.ly/LinusTechTipsOnePlus10Pro",
        "https://www.smartdeploy.com/linus/?utm_source=linus",
        "https://linustechtips.com/topic/1437361-reacting-to-our-most-profitable-videos-ever/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Do you have any idea what are our all-time most profitable videos are? (laughs) Are you kidding me? Well, neither do I, but I wanna know. So, I asked the team to put together a list of our 10 biggest money makers. And on camera, I'll be trying to guess just how much we made on YouTube Ad Sense. Reaction goggles, please? Wow, that's a fast throw. Oh yeah, James helped put together the list, and he's gonna be here too. - I don't know where it's on it either though. - Oh, you don't? Well, you know what we do know, is our sponsor. SmartDeploy now powered by pdq.com. It's zero touch, zero headache PC management for IT. You can deploy windows, apps and drivers from the cloud. No VPN required. Get your free subscription worth over $500 at smartdeploy.com/linus. We're gonna have that linked down below. (bright upbeat music) Before you guys asked, no, this is not necessarily just gonna be our videos with the highest view counts. As we know both from our own experience and from talking to other YouTube creators, there are different topics, or different entire categories on YouTube that pay dramatically better, or dramatically worse than the average. - Okay, here we go. This is the 10th. - [Linus] Really? - [James] \"Opening the ULTIMATE PC - Intel's 28 Core Xeon W.\" - You know what's the funniest thing about this video, is we didn't even know if this was gonna be a video. The main point of it, was I think it had a super weird cooler inside it. This is over three years ago, and it's a stream. This I kind of expected. And I get asked this all the time. People will say, \"Oh man, I feel so bad because I subscribe to YouTube Premium. So, you're not getting any ad revenue. Is that bad for content creators?\" And the answer is no, it's not bad. And the way that YouTube Premium pays out, is not based on the view, like ads, based on an ad impression. It's based on how much watch time you dedicated to that video. - [James] All right, this thing has 6.6, almost 6.7 million views. So, how much money do you think this thing made? - My general rule of thumb, is per million views, it's about two grand for us. - 14? - I'm gonna say 14, because a lot of this, 'cause it's a long stream, 14. - We have the breakout between Ad Sense and Premium dollars. How do you think it's allocated? - I think that for Ad Sense, the CPMs are gonna be on the lower side. - Mm-hmm. - So, I think it's gonna be like 10 grand of Ad Sense. I'm gonna revise it. I'm gonna say 15k, another 5k of Premium. - Okay- - Whoa. Are you kidding me? - The total revenue is almost 34 grand. 18k not 5k for YouTube Premium. And it's 15k not 10 for ad revenue. - That one, we have a pretty good explanation for, it's got keywords from major brands, Intel, Xeon. It's long, it was clearly engaging enough. - Look at that thumbnail? - That's a good thumbnail. - It's just an excited dude, buy a big box. The box has nothing on it. All right, Producer Man, show us the ninth most profitable video. - [Linus] No way. - [James] \"The All-AORUS Gaming PC Build.\" - We like quadruple dipped on this thing. So, we get paid by a gigabyte to do an All-AORUS build- - Which is not included in this. Oh, this is also a stream? Two and a half hours... Actually half hour compared to the last one, 6.7. - Almost the same view count. The last one was 33k, right? - Yeah. - I'm gonna say that it is 20% more. No, no, no, no, no. There's no way. I'm gonna say it 15% more. $38,000. - [James] Survey says, 34. - And over. It's barely. - It's barely more. - The thing that's really baffling me here, is the Premium revenue. That means that either that last half an hour of the video, was so unengaging, that people were tuning out at pretty much the same time. Or overall, the video was less engaging and that sharp drop off at the beginning, was drop off here. And then you had fewer people watching the entire rest of the video. - I mean, between our 10th and 9th most profitable videos, the difference is only $675. That's close. - I didn't see that coming. Is this just all gonna be streams then? - I don't think so. Let's see. \"Who has the Best PC at LTT??\" That's not a stream. Remember the Quails? - [Linus] I do remember the Quails. This one's hard for me to watch for other reasons. - They're long gone. Look at that thumbnail? - We miss you, Tyler. - It's a good thumbnail. You're holding this thing that people want but can't have. - This is another one that I looked at it and I went, \"Is this even a video?\" Because the inspiration for this one, was that we did, I believe who has the worst PC at LTT first. - That came first. - Sponsored by Intel. And it was more obvious, how the Intel sponsorship would play into it, because whoever had the worst PC, was gonna get an Intel upgrade. - But this question is way more interesting to the audience. - But how do you? What? You're giving the best person with the best PC an upgrade. It didn't make any sense. - Yeah, but that's your brain on the inside of this company? This thing has 12.4 million views. - [Producer] Woo. - It's because everybody wants to know if you work here, you must have a good PC. So, who has the best one? - Oh, wow. You should have totally had me guess the Premium versus ad revenue split. I wouldn't have gotten it though. On the previous ones, the streams, we were 50/50. This goes to show you, guys, how much of a difference it makes, how long the content is. I think this video's about 15-20 minutes long. So, that's even a pretty long video by YouTube standards. But even 12 million views, is only worth $4,600. - Is that a six? - Compared to 6 million views being worth? What was it? Almost 20? - And this is a sixth as long. - Yeah. - Our typical CPMs, lately have been, actually, have this down about eight bucks. Some other categories are way higher than that. So, that is the amount of money you get per 1000 impressions. Here's a list, email marketing, and insurance, and real estate are the highest. It seems to be the kinda thing that like you only watch it, if you're about to make a purchase decision, and it's a big purchase. - High intent, vloggerpro.com. I have no idea what their resources that they use to make this list. - Really just the top Google result. I didn't vet this list at all. - Fair enough. - [James] All right, let's look at the next video. \"Hive Mind Setup Build.\" - This was our first full build stream. And we only did it because LG sponsored us to do this weird ultra wide festival thing that they used to do. We couldn't figure out a way to make it compelling content, other than to just, I don't know, screw it. Let's just stream it. This video went on to get over 5 million views, which absolutely blew my mind, and is the reason that we have done other PC building streams since then. Now, this one I know, made a ton of money, because it was the one that raised the question for me in the first place. What is going on with these live streams? Why are they performing so well? And why are they so profitable? As it turns out, YouTube's Discovery algorithm for stream archives, is actually different than YouTube's discovery algorithm for VOD content. - Yeah, you gotta remember guys, when people talk about the YouTube algorithm, it is actually a family of algorithms. And sometimes the left hand doesn't know what the right hand's doing. - Sometimes that family don't get along. - They're not on speaking terms. - This one is a two to one Premium to add revenue split. Could it be, that people hadn't figured out this whole long live streams, YouTube Premium hack. And we were getting a disproportionate amount of YouTube Premium revenue way back in 2018? Tech viewers might be more likely early adopters of something like a YouTube Red or a Premium. - Yeah, they could be. - Maybe we just kind of locked out, and we hit it at the right time. The playback-based CPM is crazy high on this one, but to the point where I almost wonder if it was specifically targeted, that does happen. You know, when there's a big Apple launch, for example, every time you go and watch a tech video, it's like, boom. - Every billboard. - iPhone ad, iPhone ad. - Hit it. - \"The Walmart PC.\" This is just through sheer view numbers. 14 million views this thing ended up doing. The answer was yes, by the way, if you haven't seen the video already and you don't feel like sitting through 18 minutes. And I'm willing to bet that this is a double whammy of having a ton of views, and also being a long-ish video. So, it'll have significant Premium revenue - 18 minutes. This is the first kind of topical video that we did where we had to get this immediately hit it hard. - Let me go back to my general rule, which is about 2000 per million. So, I'm gonna say this thing did like $30,000 in Ad Sense alone. and I'm gonna give myself another five grand in Premium. - That's only 35- - So, that's less than the last one. Oh, crap. - Well look? - 38. - It's 14 million. So, 38.4- - Hey, I got the first one right? - Almost no Premium 33.7 from ad revenue - [Linus] CPMs, the lowest of our top performers so far. - [James] That's right. - But that makes sense, because if you're getting that big YouTube Premium money from longer form content. So, we're into our top five now. - [James] Oh yeah, you knew this was coming. - Okay, well, this is just one of the top performing videos on the channel ever. I took so much flack for this video where apparently, I was just like mean and/or rude. Scotty and I are fine, everything's fine. I was super tired. The big problem we ran into here, was that I set out to go into this weird tech mall full of weird stuff, supposedly. And it just had all the same freaking stuff from the same freaking brands that we have back here in North America. So, my whole angle for the video, was falling apart in front of my eyes. - I've heard you say before, that you're surprised that this ever did as well as it has. So, why do you think it did? - I think it's just the sheer drama and energy of me not knowing if it's a video. - [James] Okay. - Scotty played his role perfectly. He was the ultimate tour guide. And that's one of the reasons that I'll often tell you guys. \"No, no, I don't wanna see it. Don't tell me anything about this product before I can sit down and experience it.\" So, it's like going to an ethnic restaurant with someone who really knows the menu, and knows the cuisine. And with someone who just really loves food and just that raw joy and excitement, and fun of that. It's just great. There's a reason it works so well. - Are you asking me out? - I wasn't, but I'm not saying no. I am asking you to check out our amazing water bottles of run lttstore.com. - Cheers. (laughs) All right. How much money did this make? - I mean, you spoil it. - You saw it already? - 40 grand. This gotta be almost all Ad Sense, right? Yup, pretty much all Ad Sense. - Number four. - I wrote this video. \"Faster Internet for Free in 30 seconds.\" - [James] This is just like 1.1.1 DNS. - Oh no. - This is such a click-baity title, man. - It's not click-bait, it's clicky. - It's click-worthy - Yes. - AF. Because it is what we said it was. It does give you faster internet for free in 30 seconds. - So, how much do you think I made for daddy? - (laughs) I don't like being called daddy. But let's say 42. It seems like we're getting 43. No Premium. This is the lowest YouTube Premium ratio we've seen- - [James] Look at this hump? - Because this is the shortest video, and nobody's watching the whole thing. There's the hump here, man. Like show me how to do it? And then I think we show 'em how to do it, and then, we just explain DNSS and stuff. And who cares? I wonder what the- - We'll we never make videos like this anymore. We would never have that much exposition in a row because we know it's terrible for retention now. But this was four years ago. - And this thumbnail, (laughs) pushes it over the edge. It makes it look like there's a setting, or a router you buy or something. - I know. I'm so sorry, that was totally on purpose. - Next? - Number three. - So, this warms my heart, \"Building a $500 AMD Gaming PC.\" - This one performed crap outta the gate, and then just went, swamp. - [James] 113 days after posting it, it went whoosh. - Is this a stream archive, or is this a VOD? Go back to your search. Look at this? - [James] Streamed. - There was a problem with the stream VOD. So, it got all screwed up, we had to edit something out. You can see the runtime of these is actually different. And we had to upload it as a VOD, something that we always avoid. And that's why I remember it having a slow start because normally when you upload a duplicate of a thing you just streamed, YouTube only gives you so many notifications to each subscriber per day. So, you start notifying too many times, and they just go, \"Nope, forget it. You don't get any more notifications.\" - [James] And the money is, there it is. - 43,000, Man, so I could buy like a car. Like a nice car. - A new car. - Just for \"Building a $500 AMD Gaming PC.\" We should just upload videos like this every day. We won't though. And the reason for that, is that unless you do all the other groundwork, making really cool other content, no one will care about your opinion on a $500 AMD gaming PC. So, it's not as simple as just, \"Well, let's just cash in.\" - \"We got the formula, guys.\" - \"Yeah, let's just do these every day.\" - Okay. So, we're on the podium now. Let's see which video gets a silver medal, second most profitable ever. \"Building a PC.\" - \"Using only, wish.com.\" This is our top performing video ever. It's the most mainstream. How can you not click on this? - I seem to recall that we were borderline late on the whole wish.com trend. Now, we already know it's been done. - How have we not done the home theater with wish.com yet? - We should do everything using only wish.com. - Yeah, this is something we actually do need to make a series of. - We should do like a streaming setup using wish.com. - The stupidest thing, is we've done other concepts that we're riffing on this one. - [James] \"The All AliExpress PC\" did pretty well itself. - [Linus] Yeah, its a good concept. - [James] But it doesn't slap the same. - Wish.com, man. It's garbage and you love it. This is a great thumbnail. - The hand on the head obviously means exasperation frustration, but you're still smiling. - Yeah. - You're almost like, \"Those damn wish.com people.\" - It's clearly gonna be hilarious, right? Now, I know that wish.com and other online scammy-type sellers, do spend a lot on online advertising. So, I would guess this is well above our average CPM. I'm gonna say this boy at 22 million views, is probably like 60 grand. - Oh, let's see. Oh my God, it was published on my birthday. $67,000. And let's look at the CPMs. - I nailed it for Ad Sense though - But totally wrong take on the CPMs - But for one that has so many views, that's pretty good. - All right. Are we ready for the number one? Oh, my gosh. - I love building computers. Okay. This one obviously is super long. So, almost four hours, that's part of it. But this title also was like one of our first just troll titles, like \"PC go Brrr,\" \"Damn, Apple.\" - Yeah, this was me just sitting there going, \"We need to build some workstations.\" Nobody else with the experience to build machines that we're gonna rely on, is available to do it. So, the only justification we can have to allocate four plus hours of my time to just building computers, is if we plant a camera at it. This only has 83,000 likes. The actual engagement with this video, is extremely low. Only 1% of viewers engage with it. - I mean, 10 million views. - Is it even a good video? I don't even think so. \"I love watching people build computers I can't afford.\" Yeah. Fair enough. What I wanna know, is if we made enough on this stream to buy all of those computers? - Well, how much do you think all those computers are worth then? - They're Threadrippers I'm gonna say, 80k. And I just pulled that out of my butt. - [James] Just like this video, 74. - That's nuts. - Wow. - I think the big thing we've learned, is that evergreen content is the king. Because you can't rely on just that initial view spike. You need something that's gonna continue to be served to people, and continue to be clicked on for years to come. Otherwise, there's no way it's gonna be a top tier performer for this. - Long live streams. - Long live streams, and get lots of views. - So, should we do a live stream every week? - That was the guidance for a while, remember? - If people know it's on the same bad time and same bad channel, then they can plan for it, right? When we do live streams like this, they're just so random. - So, random. And the thing too though, is not every live stream performs like that. Here, let's pull up the tab. We've done lots of live streams, but you can see that even the ones that do perform. These have 3 million views, they don't necessarily perform like that. And the drop off, it's pretty steep. Unboxing a surprise gaming PC. I don't see why that would perform so much worse than that one where I'm sitting next to the box. I don't know. I've waited so long for this with the black question mark. And it's clear, it's not a silver bullet. - Yeah. And this one's 2 and 40 minutes. Maybe we should just go more straight shooter with the title. What was this one? I think PCs finally became like affordable again, or something like that. When did this one go up? - [James] No, it doesn't tell me the year. - This was two months ago. - Okay. - There's still time. - Still time to hear about your sponsor? (laughs) - OnePlus, the OnePlus 10 Pro 5G is officially available starting June 15th, with 12 gigabytes of RAM and 256 gigabytes of storage. The 10 Pro is launching in the U.S and Canada in a gorgeous, volcanic black color. It comes with a triple camera system which was co-developed with the photography experts over at Hasselblad, a 65 watt wired charger to charge your device from 1 to a 100% in just 34 minutes. And a 120 Hertz display with LTPO technology, all coupled with OnePlus's hyper boost gaming engine for a smooth gaming experience. You can get the new OnePlus 10 Pro 5G at OnePlus.com, Amazon, Best Buy, and T-Mobile, the exclusive wireless carrier of the 10 Pro 5G in the U.S. OnePlus is also launching their Red Cable Club membership program, where 10 pro owners can receive an extended warranty, free shipping vouchers, and other perks. Learn more about the OnePlus 10 Pro 5G and the Red Cable Club at the link down below. If you guys enjoyed this video, maybe you like this kind of inside baseball, maybe go check out how does Linus Media Group make money? Because Ad Sense is just a fraction of the iceberg. A top fraction of it. There's more. There's merch.",
    "transcript_keywords": [
        "video",
        "Premium",
        "YouTube Premium",
        "million views",
        "thing",
        "YouTube",
        "Sense",
        "yeah",
        "views",
        "stream",
        "million",
        "long",
        "Premium revenue",
        "live streams",
        "streams",
        "long live streams",
        "videos",
        "People",
        "YouTube Premium revenue",
        "time"
    ],
    "transcript_entity_values": [
        "40",
        "last half an hour",
        "50/50",
        "15k",
        "one",
        "VOD",
        "almost four hours",
        "DNS",
        "every week",
        "LG",
        "33k",
        "Hive Mind Setup Build",
        "Only 1%",
        "only $675",
        "18k not",
        "5k",
        "about eight bucks",
        "over 5 million",
        "zero",
        "30 seconds",
        "iPhone",
        "2018",
        "120",
        "Hasselblad",
        "18 minutes",
        "Two and a",
        "10th",
        "12 million",
        "North America",
        "OnePlus 10",
        "43,000",
        "22 million",
        "Opening the ULTIMATE PC - Intel's",
        "256 gigabytes",
        "1",
        "38.4-",
        "AMD",
        "LTT",
        "Pro 5G",
        "Discovery",
        "LTT first.",
        "four years ago",
        "three",
        "Almost 20",
        "Linus",
        "Canada",
        "YouTube",
        "CPM",
        "Linus",
        "about two",
        "1000",
        "80k",
        "half hour",
        "years",
        "the year",
        "U.S",
        "30,000",
        "14",
        "Apple",
        "first",
        "Hertz",
        "12 gigabytes",
        "James] Okay",
        "2 and 40 minutes",
        "almost 6.7 million",
        "67,000",
        "6.7",
        "9th",
        "The All AliExpress",
        "Red Cable Club",
        "about 2000 per million",
        "Amazon",
        "Premium",
        "James] Look",
        "James] Survey",
        "No Premium",
        "OnePlus 10 Pro 5G",
        "YouTube",
        "6 million",
        "six",
        "3 million",
        "three years ago",
        "60",
        "28",
        "Intel",
        "10 million",
        "Ad Sense and Premium",
        "four",
        "Google",
        "Linus Media Group",
        "113 days",
        "almost 34",
        "SmartDeploy",
        "LTPO technology",
        "James]",
        "another 5k",
        "over $500",
        "five",
        "42",
        "YouTube Premium",
        "DNSS",
        "38,000",
        "about 15-20 minutes",
        "10",
        "James",
        "a ton",
        "100%",
        "43",
        "20%",
        "15%",
        "T-Mobile",
        "74",
        "two",
        "two months ago",
        "four plus hours",
        "James] No",
        "OnePlus",
        "the Red Cable Club",
        "ninth",
        "second",
        "34",
        "Tyler",
        "12.4 million",
        "14 million",
        "4,600",
        "just 34 minutes",
        "million",
        "YouTube Ad Sense",
        "RAM",
        "Walmart",
        "The All-AORUS Gaming PC Build",
        "June 15th",
        "James] Streamed",
        "6.6",
        "500",
        "sixth",
        "83,000",
        "Best Buy",
        "65 watt",
        "Xeon"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "GPE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "PERCENT",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.11098868399858475,
        -0.09616994857788086,
        -0.005786293186247349,
        -0.06457030773162842,
        0.0900142639875412,
        0.014860771596431732,
        0.02822297066450119,
        0.07616367936134338,
        -0.017903510481119156,
        -0.027659298852086067,
        -0.0224341731518507,
        0.023458106443285942,
        -0.045232925564050674,
        -0.05270467698574066,
        -0.006074097938835621,
        -0.01323428563773632,
        0.07669413834810257,
        -0.060159653425216675,
        -0.023958023637533188,
        -0.0789945051074028,
        0.005749748088419437,
        -0.07521548867225647,
        0.004273686092346907,
        -0.009610199369490147,
        0.09595823287963867,
        -0.020068524405360222,
        -0.0621921569108963,
        -0.06473813951015472,
        0.037871841341257095,
        -0.048818137496709824,
        0.019599739462137222,
        0.059040289372205734,
        -0.0360000841319561,
        -0.013922208920121193,
        -0.049962058663368225,
        -0.043471574783325195,
        -0.018472062423825264,
        -0.06124936044216156,
        -0.0499810166656971,
        -0.05746016651391983,
        0.00033306816476397216,
        -0.021875139325857162,
        -0.022637056186795235,
        -0.06851387023925781,
        -0.015164008364081383,
        -0.06586141884326935,
        0.029267793521285057,
        -0.06704219430685043,
        0.0053422339260578156,
        0.0188372153788805,
        -0.047603409737348557,
        -0.05964050441980362,
        0.01826603338122368,
        -0.00956918578594923,
        -0.054254721850156784,
        -0.030928529798984528,
        -0.007743911352008581,
        -0.004897258244454861,
        0.06092828884720802,
        -0.030890723690390587,
        0.03886483982205391,
        -0.05281335487961769,
        -0.03968018665909767,
        0.02770998701453209,
        0.006244293414056301,
        -0.01979018747806549,
        0.022241704165935516,
        0.10324978828430176,
        -0.024732694029808044,
        0.0051148864440619946,
        3.9373862819047645e-05,
        0.023193804547190666,
        -0.05425524711608887,
        0.07712963968515396,
        -0.019987650215625763,
        0.006719287019222975,
        0.06645380705595016,
        -0.014649935998022556,
        -0.009114108979701996,
        -0.0017479807138442993,
        0.07132213562726974,
        -0.03667622432112694,
        -0.021456383168697357,
        -0.08646394312381744,
        0.013560885563492775,
        -0.04479993134737015,
        0.04426303133368492,
        0.06316691637039185,
        0.009498875588178635,
        -0.08542968332767487,
        -0.04271465167403221,
        0.15743406116962433,
        0.016446687281131744,
        0.010881476104259491,
        -0.010255527682602406,
        0.0023918114602565765,
        -0.03795545548200607,
        -0.09685473144054413,
        -0.0013415849534794688,
        0.08738511800765991,
        0.04915349557995796,
        0.06991871446371078,
        0.023766247555613518,
        -0.008006875403225422,
        -0.03274306654930115,
        -0.06275326013565063,
        0.08068756014108658,
        0.11412828415632248,
        0.07558723539113998,
        0.01421951875090599,
        -0.032448820769786835,
        0.01119467057287693,
        -0.061015643179416656,
        -0.04590795189142227,
        -0.02832847833633423,
        0.053672559559345245,
        -0.11138845980167389,
        0.0439249724149704,
        0.022026007995009422,
        -0.018877647817134857,
        -0.014992869459092617,
        -0.010622869245707989,
        -0.04666973650455475,
        0.012823883444070816,
        -0.0025151842273771763,
        0.030357936397194862,
        -0.055658333003520966,
        -8.031545866539086e-34,
        -0.004703656770288944,
        0.01052444614470005,
        -0.0041549066081643105,
        -0.06094253063201904,
        0.055171310901641846,
        0.011225959286093712,
        -0.03919888660311699,
        0.023357970640063286,
        -0.05574813112616539,
        0.06235627457499504,
        -0.021481802687048912,
        -0.00043352600187063217,
        -0.08327275514602661,
        0.036432087421417236,
        0.008221115916967392,
        -0.10216318070888519,
        -0.04966224357485771,
        0.001047259196639061,
        -0.00022956798784434795,
        -0.03391968086361885,
        0.008973629213869572,
        -0.010261360555887222,
        -0.009654105640947819,
        -0.020715218037366867,
        0.05461292341351509,
        -0.02223135344684124,
        -0.0005331538850441575,
        -0.0451672226190567,
        0.090951107442379,
        0.03146526217460632,
        -0.08003011345863342,
        -0.03487849980592728,
        0.02627386339008808,
        -0.04535720869898796,
        -0.013159039430320263,
        -0.00915492419153452,
        -0.0463155061006546,
        -0.0923251286149025,
        0.011607702821493149,
        -0.06375272572040558,
        0.019520804286003113,
        0.042545489966869354,
        -0.11188559979200363,
        -0.09557061642408371,
        -0.062373869121074677,
        0.026125337928533554,
        0.06853850185871124,
        0.050813861191272736,
        0.028701594099402428,
        0.035161640495061874,
        -0.0333070307970047,
        0.02551846206188202,
        -0.11854419112205505,
        0.0031522009521722794,
        0.020557112991809845,
        0.0868024080991745,
        0.008194991387426853,
        -0.008423663675785065,
        0.09098538011312485,
        0.06007719039916992,
        -0.007878406904637814,
        -0.003112690057605505,
        0.01870797388255596,
        -0.04253936558961868,
        -0.12291917204856873,
        0.07223714143037796,
        0.08117053657770157,
        0.004670108202844858,
        0.0001043520969687961,
        0.049177709966897964,
        -0.07542728632688522,
        -0.0466427318751812,
        0.05947544053196907,
        -0.09226123988628387,
        0.037964120507240295,
        0.013862157240509987,
        -0.027054155245423317,
        -0.0634891539812088,
        -0.054142653942108154,
        0.05363580584526062,
        -0.03762344643473625,
        -0.05647934228181839,
        0.09000316262245178,
        0.020132845267653465,
        0.040246788412332535,
        0.045391835272312164,
        0.01826956309378147,
        -0.041652996093034744,
        -0.04041150212287903,
        0.0334588922560215,
        -0.07533781230449677,
        0.02142002061009407,
        0.023626059293746948,
        -0.043699704110622406,
        -0.05825861543416977,
        -1.848978043420578e-33,
        -0.04101226478815079,
        0.07493498176336288,
        0.005586404353380203,
        0.01628943160176277,
        0.07370179891586304,
        -0.0489027164876461,
        -0.020821593701839447,
        0.008329442702233791,
        0.0139379957690835,
        0.018889330327510834,
        -0.036733854562044144,
        -0.03454500436782837,
        -0.12210814654827118,
        -0.036548007279634476,
        -0.048613499850034714,
        -0.09755440056324005,
        0.06616056710481644,
        -0.06742536276578903,
        -0.018612606450915337,
        -0.009853673167526722,
        0.04582235962152481,
        0.04641597718000412,
        0.03678004443645477,
        0.052609849721193314,
        0.000105864237411879,
        0.012730236165225506,
        0.0435178317129612,
        0.11554454267024994,
        -0.0008485779981128871,
        0.025760505348443985,
        0.06900009512901306,
        -0.000833220430649817,
        -0.04236498475074768,
        -0.059452567249536514,
        0.030548730865120888,
        -0.0025584683753550053,
        0.11920499056577682,
        0.07591792196035385,
        -0.07226615399122238,
        -0.015196751803159714,
        0.041969992220401764,
        0.03483208268880844,
        -0.008610094897449017,
        -0.025268729776144028,
        -0.013008295558393002,
        -0.010601464658975601,
        -0.0659751370549202,
        0.04203818365931511,
        -0.05434230715036392,
        -0.017907962203025818,
        0.02938126213848591,
        0.016195708885788918,
        0.01653772033751011,
        0.017884481698274612,
        -0.015321910381317139,
        -0.021897081285715103,
        0.010656501166522503,
        0.06657659262418747,
        -0.0509164072573185,
        -0.0016242361161857843,
        0.03699197247624397,
        -0.04617224633693695,
        -0.025329895317554474,
        0.006711397785693407,
        0.042782895267009735,
        -0.036909978836774826,
        0.08498778194189072,
        0.020684372633695602,
        -0.04353944584727287,
        0.05402491241693497,
        -0.02881908044219017,
        0.0012980017345398664,
        -0.005876914132386446,
        -0.017851831391453743,
        -0.07117641717195511,
        0.0762096643447876,
        -0.012188751250505447,
        -0.022433467209339142,
        0.08501575887203217,
        -0.10101572424173355,
        -0.010569693520665169,
        0.04068516567349434,
        0.07598639279603958,
        -0.05960582196712494,
        0.05187961831688881,
        0.07038801163434982,
        0.0020084059797227383,
        0.005526012275367975,
        -0.022684246301651,
        0.019144343212246895,
        -0.07317835837602615,
        -0.002486345125362277,
        -0.07989002764225006,
        0.04425666481256485,
        0.06966511905193329,
        -6.156179210847768e-08,
        -0.03367999196052551,
        0.03374268487095833,
        -0.022644856944680214,
        0.02592482604086399,
        0.02767503261566162,
        -0.053103167563676834,
        0.04205160588026047,
        0.05062132328748703,
        0.08037982136011124,
        -0.03280859813094139,
        -0.009474417194724083,
        -0.07655166834592819,
        -0.08789175003767014,
        0.0004614708886947483,
        0.013940786942839622,
        -0.02314772829413414,
        -0.042548466473817825,
        0.030546359717845917,
        -0.05172217637300491,
        -0.006213218905031681,
        0.004118884447962046,
        0.06399935483932495,
        0.10125435888767242,
        -0.0991823673248291,
        0.03493979573249817,
        0.02056373469531536,
        0.08593840152025223,
        0.09958496689796448,
        0.12503305077552795,
        -0.03076542168855667,
        0.0018753415206447244,
        0.004396416246891022,
        -0.06306841969490051,
        -0.07948004454374313,
        0.06487753987312317,
        -0.039192043244838715,
        -0.01024817954748869,
        0.06167573854327202,
        0.01867426559329033,
        0.023332281038165092,
        0.00618892814964056,
        0.05841245502233505,
        0.08153042942285538,
        0.0013515312457457185,
        -0.05840389430522919,
        0.0012664817040786147,
        -0.011068090796470642,
        -0.04125382378697395,
        0.05769253522157669,
        0.01796368695795536,
        -0.04124553129076958,
        -0.016104115173220634,
        -0.05565642938017845,
        -0.0023231643717736006,
        0.11249031871557236,
        -0.04041486606001854,
        -0.03758283331990242,
        0.050357092171907425,
        -0.0680149644613266,
        0.07364793121814728,
        0.0669679120182991,
        -0.12357437610626221,
        0.0003729804593604058,
        0.08536157011985779
    ]
}