{
    "id": "rkwJe2rzz_M",
    "title": "This IMPRESSED me! - Fujifilm GFX100S Camera",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-04-21T20:20:54Z",
    "video_url": "https://www.youtube.com/watch?v=rkwJe2rzz_M",
    "category": "Science & Technology",
    "tags": [
        "Fujifilm",
        "GFX100S",
        "Camera",
        "Photography",
        "Digital",
        "Stills",
        "Videography",
        "Cinematography",
        "Fujinon",
        "Fujon",
        "Fujijifilm",
        "DSLR",
        "Full Frame",
        "Medium Frame",
        "Brandon",
        "Unboxing"
    ],
    "views": 193494,
    "likes": 10700,
    "comments_count": 597,
    "description": "Setapp uncomplicates the way you work by giving you an all-access pass to curated Mac and iOS apps. Check them out at   I've always been a fan of Fujifilm cameras but this one really impressed me. It is a bit pricey but when you're looking at professional-grade gear, it's actually fairly affordable.   Buy the Fujifilm GFX100S Body at BHPhoto (PAID LINK):      Buy the Fujinon GF80mm Lens at BHPhoto (PAID LINK):    Buy the Hasselblad X1D II at BHPhoto (PAID LINK):  Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://stpp.co/ShortCircuit",
        "https://geni.us/2maZI",
        "https://geni.us/lEgt5",
        "https://geni.us/jh5mnY",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- For those of you who've been watching ShortCircuit for over a year now, since the channel is just over a year old, last year we did a video on the GFX 100, which at the time was Fujifilm's best medium format digital camera. And I would argue that they might've topped themselves, with a cheaper camera this year. On top of this camera, then I'm about to un-box, they sent over this 80 mil F1.7, I will tell you why that's important in a moment. And their really cool 45 mil 2100 F4. Okay. So in the box we've got a manual, warranty, actually it looks like this is a digital manual and something about capture one. Everyone who I've ever spoke to who uses capture one prefers capture one by a long shot over light room. No, there's no license. It's literally just an ad to download the software. Okay. Let's see what's on the rest of this box. We have a type C charging cable, a camera strap. For $6,000, this is a lackluster camera strap. I mean, you, like I usually say you're probably going to replace this, but I might put it on the camera just to see how it feels. Okay. We've got a couple of adapters for different countries, a wall wort, It's a type C and they include the cable but, I always hate charges like this because it means you have to have a C to C cable which I'm sure many of you out there do, but it's not the type of cable that you still just have lying around your house all the time. Like you might have a couple of them for different devices around the house but if you lose this cable, it's kind of hard to find like, you can't go into a random grocery store and find a type C to C cable all the time. You might be able to in some places. See another traveling adapter, another traveling adapter. Ooh. For those of you who don't know, medium format, all you really need to understand is it's a format that is larger than the typical full frame sensor size that you'll find in mirrorless and DSLR cameras these days. So, for example the Sony A7S3 that I covered in a recent video, is a full frame camera. This is a medium format digital camera. And it has a 102 megapixel gigantic medium format sensor. As you can see, this sensor is much larger, than the one that was in A7S3, and it is a much higher resolution. And that's one of the advantages of medium format, cameras that are much higher resolution, and have a much shallower depth of field than your full frame cameras. So while this is 900 grams, it feels, it feels not that heavy. So let's look at the rest of the body. On the top, we have a very familiar model for anyone who used a Fuji camera before. This is their little button lock, and then they have a manual aperture priority, shutter priority program, and then six custom profiles, which is pretty awesome. I don't actually know a camera that gives you that many. You have these two buttons here. This top one is set to do face detection or eye detection auto focus, which is nice, but I'm pretty sure you can customize it to anything. And then this bottom button is currently set to change the display on this camera. So right now it shows all of our settings and our film simulation, and the mode that we're in, which is manual. But if you change it, you can also display like this which is kind of cool because it's got these virtual dials. I actually liked this display better. I feel like I'd use this one the most. And then I believe this one is your histogram which just shows a top view. If you're shooting from the hip like this if you wanted a bigger version of your histogram and you didn't want it on your LCD display, this is a nice touch to have it available, so you can check your exposure. On the back of the camera, we've got the same flippy screen that was originally in the GFX 100. I'm not the hugest fan of this display, It's not bad, there are certain situations where if like you're holding the camera like this, and then you want to pop out the display to see your shot at a better angle, that's nice, but I find it overall less useful. We have the focus out here which just allows you to go from manual, continuous or single, a little joystick, which feels pretty good. The AE lock button, the menu button, display, play, quick settings, which is all standard. This camera has dual SD card slots, which is very important. Especially if you're a professional photographer. You do not ever want a lack of redundancy in your media. Which honestly should be a standard for all cameras at this point but. Every time a manufacturer who does not have dual slots for the media is doing something wrong. On the right of the camera with the SD card door, we have a 2.5 millimeter. Is this a mic jack, What is this? Oh, it's a remote Jack. Okay, so if you're doing a time-lapse, of one of those like 2.5 millimeter, you can just like have a trigger to the side or, there's other camera accessories that will utilize that port. I just realized that this battery is the same battery that I use in my Fuji XT4, which is super awesome. So if you're an XT4 user, and you wanna add this camera as a second body or you wanna upgrade, you can keep your batteries. We have, ah, here we go. Here's where we have mic and headphone and then. They did it guys. They put micro HTMI on this camera. Press F that's unfortunate. Micro HTMI for those of you who don't know, not a great connector, very easily breaks. I'm not surprised there wasn't space for a full-size HTMI in this body specifically, but maybe Fuji can figure that out on their next revision. And then a flash sync port. So for all of you professional photographers out there, who want a flash sync port for your lights or any other camera accessories that use it, this camera has one it's not, surprisingly it's not a photography feature that is on lower end cameras. So it's not surprising to see it on a professional level, medium format camera. Okay, so enough about the camera physically. We've gone through the whole thing. It's got a two quarters holding port on the bottom like every other camera let's move on. Let's talk about this lens. Fuji sent over their 80 millimeter 1.7. Now, for those of you who don't know, this lens is a big deal, because it's the first, I believe, GF lens that Fuji has designed, that is below F2. A full frame camera with an F1.4 lens, is already gonna give you a ridiculously shallow depth of field. And up until this point, a lot of people have argued that Fuji's medium format system is not that much better than full frame because their lenses were all F2.8 at the fastest. And what that meant was the depth of field between a medium format sensor with an F2.8 lens, and a 35 five millimeter sensor with an F1.4 lens, was very similar. That changes today with this lens this lens is 80 millimeters. So that makes it about 63 millimeters compared to a full frame camera, or on a full frame camera, I should correct myself. This lens comes with a little bag. It's a nice touch I won't complain. It's always nice to have a bag to go along with your lenses. We've got quite a large lens hood, which is nice. The lens, wow. GF 80 millimeter. We've got a 77 millimeter front filter thread, which is a pretty standard size, that's awesome. And honestly, this lens isn't that heavy. I would have expected it to be quite a bit heavier. It's an 80 millimeter medium format, there's a lot of glass in here. It has to cover a gigantic, look how large this band at circle is. It's huge. Ready for that click, that beautiful click. Oh, that sounds nice. This feels like a great combination. Now the body does feel quite a bit heavier with the lens, but not any heavier than DSLRs that I've used. Like something like a 5D with a decent size lens, it feels about the same as this. And I feel like it feels pretty balanced in the hand. One last comment I'll make about the actual body of this camera though is they probably used a less premium material on the edges of the camera here, because they do feel like a little bit, I don't know rougher, is how I would describe it. Now that the lens is on the camera, let's go test it out. But first, a message from our sponsor. Setapp gives you immediate access to curated collections of more than 200 great productivity focused apps at once. Just type it in the search box and find the right tool immediately. Security, remote work, productivity GDT, a standard kit for newbies and app collections for advanced users to build and enhance their workflows. It offers an app recommendation system, so you can think about the tasks you can solve not what apps you should install. And now there's also no need to search for the right app on the internet. To manage tons of pages prescriptions, you're never gonna use any more. It includes apps like Luminaire which is a modern AI photo editor, and the famous CleanMyMac and much more. Plans start at 9.99 a month, and they offer a seven day free trial to try everything out. Achieve more with your Mac and download Setapp at the link in the video description. Okay, let's go test this camera. So we're just gonna do a quick demo of a portrait photo of Chase here. And I wanna try Fuji's new film simulation, nostalgic negative, I think it's called let's see. Wow. This is really shallow, honestly, from the onset it feels like the auto focus is keeping up pretty decently. Even if I go like this, Oh, it's hunting a little, but that wasn't that slow. Is that an lttstar.com hat? And then look at me. Nice. So before we take a look at these photos on a computer, let's go outside and do a quick video test, and to see how well the in-body stabilization works. Okay, I'm really having a very hard time stop for a sec. Wow. This is shallow. That was super hard to pull focus on cause it's a focus by wire lens. So there's no feedback. This lens is not amazing for video, it looks really good. I really like this color profile. I've been shooting Fuji for about five years now and, I think this might be my new favorite profile. The skin tone looks pretty good already, and when you punch in, look at that detail. This shot is at F1.7, so the widest open you could be, and it is so sharp. I'm really impressed with this actually. Like this one came out a little bit soft so the auto-focus on this camera is not perfect, but I was kind of being unfair to it. I feel like I wouldn't, you wouldn't move as drastically forward and backward as I did a couple of times when I was just shooting photos. it's not gonna be anything close to something like a Sony, A7R or honestly anything Sony makes. But you shouldn't expect it to be because that's not what they're trying to do. They're just trying to deliver decent auto-focus on a medium format camera. Let's take a look at the other thing that we tried and that's video. Right off the bat at F1.7 this shot is so shallow. You can see, see that like I was having a hard time, finding focus because the lenses just like most Fuji lenses, unfortunately they're all focused by wire. So you don't have that immediate feedback in the focus. When I was focusing, it was actually lagging a little bit as I was changing focus, which is really not acceptable when you're trying to pull focus on video manually. And that's kind of what, in my opinion, has always prevented Fuji cameras from being good video options. Of course you can adapt lenses. You can use older lenses, you can use Sydney lenses but the lenses that they make for stills, unfortunately aren't that great for video. And while they might look good in like a static shot, they are not the best choice when you're doing a lot of movement or just doing honestly any video cause pulling focus is an essential part of shooting video. There's a weird digital look to Fuji's video. And this camera doesn't seem to have that same like digital looking sharpness texture to the image. And that's a really good thing. But again, guys it's a stills camera that can shoot video and it does it decently. So like if you're shooting like a landscape, or something that doesn't move a lot and you just want like a nice static shot of like a waterfall or something, this camera would actually do a very good job of that. For the enthusiast and the professional who want to take the plunge and start shooting medium format digitally, this is probably one of your best options. The only other camera that is similar to this one in its price range is the Hasselblad X1D Mac II. But that camera is a leaf shutter. It doesn't have the same level of auto-focus. It doesn't have inbuilt image stabilization. Lenses are great on both systems but for my money, $6,000 plus $2,300 for this lens. I think I'd pick this. Thank you guys for watching. I hope you enjoyed this video. If you wanna watch more camera videos, we recently did a video on the Sony FX3 and, or you could watch last year's video on the GFX 100, If you wanna see how it compares to this guy. That was also a great camera. Thanks for watching. Please subscribe.",
    "transcript_keywords": [
        "camera",
        "lens",
        "medium format",
        "Fuji",
        "video",
        "full frame camera",
        "medium format camera",
        "format",
        "frame camera",
        "medium",
        "cameras",
        "format digital camera",
        "focus",
        "full frame",
        "feels",
        "nice",
        "format camera",
        "lenses",
        "Fuji camera",
        "Fuji medium format"
    ],
    "transcript_entity_values": [
        "Chase",
        "102 megapixel",
        "5D",
        "last year",
        "last year's",
        "One",
        "Fuji",
        "one",
        "45 mil 2100 F4",
        "9.99 a month",
        "seven day",
        "Setapp",
        "this year",
        "Jack",
        "two quarters",
        "Mac",
        "sec",
        "a year",
        "about five years",
        "second",
        "DSLR",
        "AI",
        "Sydney",
        "80 mil",
        "2.5 millimeter",
        "about 63 millimeters",
        "F2",
        "77 millimeter",
        "first",
        "Fujifilm",
        "these days",
        "Sony",
        "two",
        "6,000",
        "80 millimeter",
        "Hasselblad",
        "LCD",
        "Fuji",
        "900 grams",
        "80 millimeter 1.7",
        "Setapp",
        "AE",
        "GDT",
        "ShortCircuit",
        "SD",
        "six",
        "80 millimeters",
        "Luminaire",
        "35 five millimeter",
        "more than 200",
        "today",
        "2,300"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "LOC",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "MONEY"
    ],
    "vector": [
        -0.07632151991128922,
        -0.025786107406020164,
        0.017108295112848282,
        -0.06271271407604218,
        0.058617617934942245,
        -0.027477456256747246,
        0.07228564471006393,
        0.10354623198509216,
        -0.03870076313614845,
        0.04428665712475777,
        0.07209758460521698,
        -0.06671363115310669,
        0.03975701332092285,
        0.03739723190665245,
        0.07168150693178177,
        -0.031610384583473206,
        0.05961473286151886,
        0.009776771068572998,
        -0.017180833965539932,
        0.01459963247179985,
        -0.004584544338285923,
        -0.10206194221973419,
        0.1000392809510231,
        -0.009292440488934517,
        0.02961893379688263,
        -0.03264014795422554,
        -0.0009863496525213122,
        -0.06543751060962677,
        -0.01658480241894722,
        0.013306043110787868,
        -0.049755342304706573,
        0.07639865577220917,
        0.011371740140020847,
        0.012453065253794193,
        0.047438159584999084,
        -0.011411057785153389,
        0.06640014052391052,
        -0.0466579794883728,
        -0.15869425237178802,
        -0.057026855647563934,
        -0.07074978947639465,
        0.02436087280511856,
        0.04972919076681137,
        0.04473714157938957,
        0.018521538004279137,
        -0.019426709040999413,
        0.11140270531177521,
        0.012454690411686897,
        0.06426207721233368,
        0.030997399240732193,
        -0.0345403291285038,
        -0.04515974968671799,
        0.02343391627073288,
        0.04777223989367485,
        0.008480570279061794,
        0.026838498190045357,
        -0.05834685266017914,
        -0.12009172886610031,
        0.01866845041513443,
        -0.03039715811610222,
        -0.007804715074598789,
        -0.103328637778759,
        -0.0271754153072834,
        0.057352736592292786,
        -0.021377630531787872,
        0.0008605782059021294,
        0.0003575337468646467,
        -0.020757177844643593,
        -0.04521426185965538,
        -0.04317266494035721,
        -0.009398186579346657,
        0.030673552304506302,
        -0.035354916006326675,
        0.055710453540086746,
        -0.09209425747394562,
        0.05514811351895332,
        0.09870802611112595,
        -0.02649003453552723,
        0.023362979292869568,
        0.006604854017496109,
        0.05470739305019379,
        -0.019753338769078255,
        0.03324950486421585,
        0.04115450009703636,
        0.02200404927134514,
        -0.054213762283325195,
        0.05432775989174843,
        0.07671867311000824,
        -0.020919566974043846,
        -0.03258568421006203,
        0.0011504949070513248,
        0.05352655425667763,
        0.0010004971409216523,
        -0.024581220000982285,
        -0.03184502199292183,
        -0.05561071261763573,
        0.04174569994211197,
        -0.020455220714211464,
        -0.07942425459623337,
        0.03238993138074875,
        0.000241458707023412,
        -0.07210926711559296,
        0.04700254276394844,
        -0.03911575675010681,
        -0.02508489042520523,
        -0.02919466234743595,
        -0.027353813871741295,
        0.032423168420791626,
        0.0013086118269711733,
        0.059636011719703674,
        -0.0889214351773262,
        0.04617894068360329,
        -0.09282965213060379,
        -0.018368419259786606,
        -0.027611052617430687,
        0.06134813651442528,
        0.00851704552769661,
        0.02592325396835804,
        0.09871745109558105,
        -0.06502005457878113,
        -0.031003927811980247,
        -0.011330191045999527,
        -0.03209783881902695,
        0.03237410634756088,
        0.03119775466620922,
        0.041234321892261505,
        -0.038283951580524445,
        5.447397676737918e-33,
        -0.026074569672346115,
        0.08954323828220367,
        0.016837770119309425,
        -0.03412077948451042,
        -0.028943199664354324,
        -0.0509539432823658,
        0.05049555376172066,
        0.07204544544219971,
        -0.047795169055461884,
        -0.023332146927714348,
        -0.054835714399814606,
        0.0468299463391304,
        -0.08295563608407974,
        0.08425361663103104,
        0.008362959139049053,
        -0.04782651364803314,
        0.01627422496676445,
        -0.026481671258807182,
        0.08830827474594116,
        0.07775022834539413,
        0.00621463218703866,
        -0.0603976808488369,
        0.044523973017930984,
        0.03556428477168083,
        0.02604476734995842,
        -0.011702991090714931,
        0.04030399024486542,
        0.0010720303980633616,
        0.057377513498067856,
        0.026426073163747787,
        -0.05774252861738205,
        -0.007340739946812391,
        0.022744765505194664,
        -0.03779863566160202,
        -0.0165865458548069,
        -0.00835262518376112,
        -0.05758386850357056,
        -0.07389311492443085,
        0.018605966120958328,
        0.004610834177583456,
        -0.0670619010925293,
        0.042727164924144745,
        -0.07912638783454895,
        -0.07056684792041779,
        0.022534847259521484,
        0.010718362405896187,
        -0.03878829628229141,
        0.046349409967660904,
        0.012833085842430592,
        0.09421788156032562,
        0.03874078020453453,
        -0.04739876091480255,
        -0.1110793873667717,
        -0.029851600527763367,
        -0.05029287934303284,
        0.04153694957494736,
        -0.02558066137135029,
        -0.05007396265864372,
        -0.04725223407149315,
        0.035945501178503036,
        0.012989791110157967,
        0.03629082441329956,
        -0.08203510195016861,
        -0.014815322123467922,
        -0.1262478530406952,
        0.041148748248815536,
        0.03513249382376671,
        -0.05994321405887604,
        -0.13072465360164642,
        0.0621705986559391,
        -0.07708101719617844,
        -0.044355668127536774,
        0.046992719173431396,
        -0.02185351401567459,
        0.08502897620201111,
        0.021006735041737556,
        -0.10338468849658966,
        -0.016718218103051186,
        0.008757654577493668,
        0.08119314908981323,
        -0.08053985238075256,
        0.04389185830950737,
        0.036722008138895035,
        0.1304786503314972,
        0.00290856440551579,
        0.006978412624448538,
        0.01722445897758007,
        0.018748683854937553,
        -0.011179627850651741,
        0.004106180742383003,
        0.010453268885612488,
        -0.0735984593629837,
        0.0032972374465316534,
        0.006467448081821203,
        -0.05245799571275711,
        -5.496412485089346e-33,
        -0.019155628979206085,
        -0.03260617330670357,
        -0.03127016872167587,
        0.06979086250066757,
        0.03727419674396515,
        0.008458376862108707,
        0.018894946202635765,
        0.04546284303069115,
        0.056746188551187515,
        -0.08909518271684647,
        0.018085310235619545,
        0.019215300679206848,
        -0.06286222487688065,
        0.003417250234633684,
        -0.05739884451031685,
        -0.0732848271727562,
        -0.02008562907576561,
        -0.06417103856801987,
        -0.019341815263032913,
        -0.07373934239149094,
        0.1050005555152893,
        0.0217820443212986,
        0.09421596676111221,
        0.006961451377719641,
        -0.04361775144934654,
        -0.029377708211541176,
        0.06672453880310059,
        0.016938166692852974,
        -0.019438492134213448,
        -0.03192483261227608,
        -0.10834203660488129,
        0.01850118301808834,
        0.0030993621330708265,
        -0.024952009320259094,
        0.06160056218504906,
        0.033072881400585175,
        -0.013552657328546047,
        0.053014714270830154,
        0.009827201254665852,
        0.05311830714344978,
        -0.08908571302890778,
        -0.017183376476168633,
        0.06917477399110794,
        0.01270177960395813,
        -0.026715829968452454,
        -0.017893126234412193,
        -0.03270050883293152,
        -0.003494859440252185,
        0.07423257827758789,
        0.048280663788318634,
        -0.08486443012952805,
        0.019099893048405647,
        0.014813881367444992,
        0.030192187055945396,
        -0.05879512056708336,
        -0.05968360975384712,
        -0.006819787435233593,
        0.002013162709772587,
        -0.0146493474021554,
        0.025770816951990128,
        0.028257912024855614,
        -0.021816963329911232,
        -0.06006874516606331,
        0.04464929923415184,
        -0.0027908121701329947,
        -0.04271956533193588,
        -0.01517399214208126,
        0.008441561833024025,
        -0.042207520455121994,
        0.06930074095726013,
        0.013419934548437595,
        -0.03684127703309059,
        0.04593297094106674,
        -0.02081914432346821,
        -0.0006112572737038136,
        0.02255861647427082,
        -0.019646046683192253,
        0.047978952527046204,
        0.11710294336080551,
        -0.0004312180099077523,
        0.11538524925708771,
        0.055217109620571136,
        0.03628641366958618,
        0.10047923028469086,
        0.07748300582170486,
        0.062402017414569855,
        0.04551321640610695,
        -0.0672612339258194,
        0.026434380561113358,
        -0.004338700324296951,
        -0.09174510091543198,
        0.019440283998847008,
        -0.00690193148329854,
        0.050277359783649445,
        -0.0227831844240427,
        -5.92626250295325e-08,
        -0.03308159112930298,
        0.04632197692990303,
        0.02787826582789421,
        -0.030989238992333412,
        0.00634135864675045,
        -0.07973352819681168,
        -0.06776008009910583,
        0.02107592672109604,
        0.08707880228757858,
        -0.011748116463422775,
        -0.002972934627905488,
        0.01408520620316267,
        -0.048156604170799255,
        0.012343164533376694,
        -0.08315213769674301,
        -0.013891644775867462,
        0.0197175070643425,
        0.06762588024139404,
        0.007280351128429174,
        -0.030207108706235886,
        -0.04603634774684906,
        0.01253048237413168,
        0.028097933158278465,
        -0.035623110830783844,
        -0.0013362540630623698,
        -0.03213370218873024,
        -0.019207578152418137,
        0.00814820360392332,
        0.11134661734104156,
        0.02229827456176281,
        -0.06218075379729271,
        -0.03039037622511387,
        -0.030583085492253304,
        0.04878827556967735,
        -0.02714872919023037,
        -0.05093475058674812,
        -0.061013113707304,
        0.05531157925724983,
        0.043294522911310196,
        0.02175625041127205,
        -0.013394918292760849,
        -0.011019634082913399,
        0.04460529610514641,
        -0.02393893338739872,
        0.04417824372649193,
        0.04853368178009987,
        0.035865165293216705,
        -0.08435487002134323,
        -0.03393273428082466,
        0.08686546981334686,
        0.049579232931137085,
        -0.04572269320487976,
        -0.05728844553232193,
        -0.008887345902621746,
        -0.07040353119373322,
        0.055038079619407654,
        0.062248680740594864,
        -0.04412277415394783,
        -0.01784929260611534,
        0.10247277468442917,
        -0.03737629950046539,
        -0.09077127277851105,
        -0.09452636539936066,
        0.10740602761507034
    ]
}