{
    "id": "rMA2g6dygjU",
    "title": "This is NOT what it looks like... - Megalodon Console 64",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-05-25T20:29:24Z",
    "video_url": "https://www.youtube.com/watch?v=rMA2g6dygjU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "nintendo",
        "switch",
        "console",
        "keyboard",
        "controller",
        "cool",
        "stylish"
    ],
    "views": 222755,
    "likes": 7436,
    "comments_count": 348,
    "description": "Get a dbrand skin or grip case today at   The new DOIO Megalodon Console 64 is a keyboard that looks suspiciously like the most popular gaming handheld of the last few years, but does it also take features from it? Plouffe is here to see if this is a great keyboard/controller hybrid or if it fails at delivering in either camp.  Check out the DOIO Megalodon Console 64 Keyboard:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 This looks familiar... 0:23 Unboxing 0:46 Design impressions 4:29 Sponsor - dbrand 4:52 Bell doesn't know how to build a keyboard 5:46 Taking out a switch and customization options 7:57 Trying out the buttons and knobs 10:38 Typing test impressions 12:25 Pricing and overall thoughts 13:54 Outro",
    "description_links": [
        "http://ShortLinus.com",
        "https://lmg.gg/MegalodonConsole64",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- As a PC gamer, it can be pretty hard to choose. Do you play with a mouse and keyboard or do you pick up a controller? Well, today we've got the Megalodon Console 64 from DOIO. You pronounce that DOIO. You can find it on drop.com. And they're currently doing a pre-release sale. It's going for, well, we'll tell you later, but ooh, this is pretty cool. It does not come with key caps and switches. Just so you're aware, we actually put this together beforehand or rather belted. What else do we get though? Cable is okay, A to C. Oh, isn't the, what's the arm span thing? Your arms is like how tall you are. Yeah, I'm like 5.6, 5.7 on a good day. This thing is crazy. Sorry, I lost my train of thought. It's so weird having an actual keyboard that you can hold like a controller. I've been looking at a lot of handhelds recently like the steam deck and the ROG Ally, they're definitely not this big, but they're also not that much smaller to be perfectly honest. And I'll be frank, I don't think you're actually supposed to hold this keyboard like this. The joystick is joy to mouse and you can map everything through via, which is great, but I'm pretty sure this is not the intended use. The right side is also not a thumbs stick, it's just a knob for anyone who is hoping for an actual controller that you could use. But you do also get four little mini buttons down here. They feel terrible to press. I don't like those at all actually. They don't even feel like really good face buttons. It's kind of just like a little pogo stick that's sitting up and you can press it down. So I'm not a fan. (button clicks) Yeah, not comfortable. Does not feel good to press. But you know, you're not using this like an actual controller, so whatever. It's not the end of the world. This is apparently a little screen that we'll see once it's plugged in, it just displays a bit of information. You can change it yourself, which is pretty cool. You like, (laughs). - [James] I wanna mention the other color. - (laughs) sorry. We got the red and blue one, which looks a lot like a switch if that wasn't super obvious to basically everyone watching. It comes in a bunch of other colorways, white, yellow, soy and pink. Those are all sold out right now apparently. I don't know if they're gonna change stock at some point. It's currently a pre-order and ships July 7th so maybe you'll get lucky and they'll restock if you're not a big switch fan. But for everyone else, yeah, should be fine. If you like red and blue, then this is maybe for you. If you haven't already noticed, this is a 60% keyboard, but it's got 64 keys and part of the problem is they've really squished it in here and you've got a two U shift and then a one U shift on this side. And as you can see from our key cap set, that is not included. It doesn't match. We've got our enter key sideways that's not supposed to be there at all. And then we're using a Windows key for the one U, the nice thing but the one U is, that's basically any other key cap. You can put literally whatever you want there, but two U is kind of a weird size that you don't see super often and you might need to buy a more expensive key cap set if you wanna make sure everything fits perfectly on here. GMK sets, for example, tend to ship with basically every option under the sun. Your options from Amazon that are like 30, 40 bucks, they might not quite fit, so be careful. It might be a 60% keyboard, but it's definitely longer than average. This is honestly almost a full-size board in terms of length at least. And it weighs, they advertise about 1300 grams. Let's see how accurate that is. 1500. Wow, this is a heavy board. Oh, it's probably 1300 without the key caps and switches and everything. But then you add switches, key caps and it'll add probably a couple hundred grams. So, that actually sounds about right. It normally has a 5.5 degree typing angle which is pretty okay for most people. You might wanna wrist rest just because of how tall the whole keyboard is actually. I don't know why it's this tall. The case is a little excessive. It's acrylic and aluminum mostly acrylic and plastic though. I actually don't know where the aluminum is in here and I can't take it apart to find it. So, that's all we're gonna get. It's got a pretty cool see through bottom for anyone who's been a fan of that craze kind of returning. I'm gonna plug it in and turn it on and see if it actually feels any good to type on, but not before a word from our sponsor, Dbrand. Although you can't skin this, they do have real skins for your Nintendo Switch. They're made from high quality 3M vinyl. That is true texture. The patented adhesive is guaranteed to leave no residue on your device if you want to change them. They also have grip cases for your phone or AirPods that fit snug and are super durable with thousands of grippy contact points. Go to shortline.com and buy your overpriced stickers today. If you're spending a good amount of money on a mechanical keyboard already, it's not gonna kill you to just buy a slightly nicer cable that's gonna look a bit better, feel a bit better and match your desk and accessories a lot better too. I don't really fault them for not including a nicer cable. It's a bare bones kit and it's fine. The cable's gonna work. It's gonna do exactly what you want it to do and honestly it kind of matches with the black, but you know, it's just not sleeved, just leave it, make it, make it just that little touched better. This is really cool. The screen's got a one on it. We're gonna type on it first and then I'm gonna check out all of those sweet, sweet extra buttons that it's got. I didn't install these switches and I am just finding out now that a couple of them don't actually work. I'm assuming that whoever did install them just kind of bent some pins and it's a quick and easy fix, but you know what? You know, it's a lot better than that. Watching me make a ton of mistakes on monkey type. Oh, control doesn't work. One nice thing that we can actually show off I guess while I fix these switches is the fact that this is indeed a hot swap board. Ooh Lord. Yep. Bent pin. That's pretty cool. And it's five pins so any switch is gonna fit into this board without issues except for maybe (indistinct) 'cause they're thinner pins. But that's okay if you also didn't notice, it's got RGB which is pretty great, south facing and it looks like you can set it to a bunch of different customizations. It's QMK firmware, so you can use via to map it, however you want, including the RGB. The nice thing about south-facing RGB is it's super compatible with whatever switch you want to use. The nice thing about north facing though is it tends to shine through the shine-through key caps a little bit better. So take your pick, pick your poison, whatever you want to use. I personally prefer north facing just 'cause I like the shine-through on key caps, but it honestly doesn't matter all that much. I really do like this little screen with the one on it. 'Cause on player one, I don't know how to customize that, but that's apparently also customizable so you can just put whatever you want on that teeny tiny little screen there. One thing I wanna mention before we do the typing test is that the switches in here aren't my personal preference and so I might not like the feel of the actual switches, whoever. I wanna point out that the gaskets in this thing, it is gasket mounted. They're very squishy. There is a ton of flex. So if you like a soft bottom out feel, then you shouldn't be disappointed. Gasket mounting just means that the board and the plate are basically sandwiched in between these little rubber gaskets so that when you press down it has some give to it into the rubber. There's a ton of different mounting styles. You can have top mount plate mount, gasket mount. Gasket mount actually comes in a bunch of different forms too. There's socks, there's bowls now. One thing I'll mention actually is that it looks like it's pretty easy to take apart with all of the bolts being on the bottom. However, there's quite a few of them. Most of the time you're only gonna have maybe 6 or 8K screws, maybe 10, but this is got (indistinct). 13, 14, 14K screws. It's quite a few. It's not the end of the world. It's probably because of all of their little extra electronics, like for the thumbs stick and the extra knobs on the bottom. Oh they work. So this knob on the bottom left acts as an up and down scroll wheel. The bottom right acts as a volume knob. Cool. What's this guy do? 'Cause this is usually volume. This is not doing anything. The really cool thing is that the thumbs stick while it doesn't do a great job, this is not a good experience at all navigating with the thumbs stick, but it is doable. So you could hold this thing and use it as your mouse if you so desire. I don't recommend anyone does that. I think it's honestly just a really cool kind of fidget toy. I've been sitting here playing with it constantly 'cause there's just so many little dials and buttons and knobs to press. You could map the thumbs stick to (indistinct) and then use it as your, you know, single-thumb navigation tool instead of using (indistinct) like a keyboard. - [James] What if you pick it up on that one hand? - Like this (laughs). Yeah, this just feels wrong. It's one of the only keyboards that I'd actually suggest that you pick up and handle constantly instead of just finding the heaviest thing you can and plunking it on your desk and leaving it there. Let's open a keyboard tester and see what they're actually triggering. Launch the tester, sorry, this is actually registering as a dash or hyphen when you press it. This one doesn't seem to be activating anything. This guy's also not set to click. Oh, page up. Page down. Oh yeah, that makes sense 'cause it scrolls and then the thumb stick is just joy to mouse. And then what's the click? Click is not mapped to any buttons. You could probably map it to your mouse theoretically. I don't know if I'd want to. And then these face buttons don't seem to be anything either, so if you wanna make use of these outta the box, you're not really gonna be able to do that. You're gonna have to actually go and map it. Oh, they're doing the RGB. Oh, that's what I get for pressing buttons while not looking at the keyboard. One seems to just turn RGB on or off. That's like your A button, but X and B aren't changing anything. Y seems to also be changing the RGB in terms of like solid color whether you want flashing colors, whether you want it to like pulse when it presses a certain key. Oh, that's a mute button. Oh, so clicking on this guy is a mute button. Overall, you know, I think all the extra buttons are pretty cool. It's kind of like a macro person's dream. I'm not really that person. I tend to just use my keyboard as is. Maybe I use a function button for a couple of keys like F5 if I'm using 65% or 60%. But otherwise I tend to just leave it as is. I'm not even a big via user, but it does support that and you can use it if you'd like to. Monkeytype. You know, it's cool though I'm not gonna use the track pad on the laptop. Well, I don't have a mouse click so I am gonna use the track pad on the laptop. (typing) Oh, my C button doesn't work (laughs). That's definitely the worst I've ever done both here. And I think in general I got 60 words per minute, 82% accuracy only part of that is because of our C switch not being properly working here. Otherwise, it's mostly the layout. It's really condensed and I have a bit of a problem going for some keys, especially my shift key when it's this small. So if you're new to 60 or 65% keyboards, it might take quite a bit of learning to get used to typing on this smaller layout. Otherwise, it's not bad though. We've only got some pretty stock switches and not the greatest key caps to be perfectly honest. But the sound isn't bad. It does come with a number of sound dampening pads. I don't know what kind of foam or padding they are, but it is included and I can hear it at work. It's okay, not great. You could probably mod this to make it sound quite a bit better though. And the stabilizers. (typing) Are not terrible. There's actually not a ton of rattle at all and they're pretty evenly spaced, so yeah. Oh, one thing I didn't notice about the bottom as well is that this DOIO logo is actually machined in. So it's not just, you know, overlaid or painted on or anything like that. It's a pretty deep machine so you can actually feel it. - [James] Hey, if you're using it as controller. - Yeah, yeah, that's a good point actually. If you're using it as a controller, then maybe you are gonna care about having a nice machine back like this. Overall, I think it's not bad. I think it's pretty cool in a number of ways and it's definitely for a very specific audience if you're a big Switch fan or if you're looking for something that's just unconventional. I know a lot of people that buy keyboards only because they're different. And the reality is this is incredibly unique. I've never seen something quite like this before. The only problem is that they do charge a bit of a premium. It's $219 right now down from 228, big sale. Probably because there's only the one color left. It's hard to swallow that pill when you've also gotta buy switches and key caps on top of that. And it's a little harder to swallow when the key caps that you're gonna want are going to have to be very specific to fit this very specific layout. That being said, you know, the build quality is not awful. Either way, at 220 bucks, once you add in switches, you know another 40 at least probably more like $60 depending on what you buy. And then throwing on a key cap set especially something that's probably a bit more premium, you're looking at an extra 8,000 bucks, if not more. The price for this quickly adds up and I think that if you're looking for just a regular mechanical keyboard, one that's a little funky, that looks like a switch, it's probably not worth your money. However, if you want a really, really cool macro pad that's got a bunch of different functions that you could map to whatever your heart's desire, maybe it is for you. Thanks for watching Short Circuit. If you wanna look at another keyboard short circuit we did that was at a similar price point that I liked a lot more. Check out the Key Boom. It's also clear, but it's just a bit more premium for like--",
    "transcript_keywords": [
        "key caps",
        "key",
        "pretty",
        "keyboard",
        "pretty cool",
        "thing",
        "key cap set",
        "key cap",
        "cool",
        "switches",
        "bit",
        "caps",
        "switch",
        "buttons",
        "RGB",
        "Yeah",
        "kind",
        "feel",
        "good",
        "nice thing"
    ],
    "transcript_entity_values": [
        "U",
        "AirPods",
        "6",
        "40 bucks",
        "a ton",
        "One",
        "James]",
        "8,000 bucks",
        "8",
        "one",
        "14",
        "60",
        "Switch",
        "5.5 degree",
        "F5",
        "3M",
        "60%",
        "64",
        "Amazon",
        "July 7th",
        "14",
        "1300",
        "today",
        "13",
        "GMK",
        "219",
        "Nintendo Switch",
        "Dbrand",
        "5.7",
        "5.6",
        "the ROG Ally",
        "a good day",
        "10",
        "thousands",
        "first",
        "82%",
        "two",
        "a couple hundred grams",
        "four",
        "30",
        "Short Circuit",
        "about 1300 grams",
        "DOIO",
        "RGB",
        "more like $60",
        "220 bucks",
        "five",
        "James",
        "U",
        "1500",
        "228",
        "65%",
        "Megalodon"
    ],
    "transcript_entity_types": [
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG"
    ],
    "vector": [
        -0.009329238906502724,
        0.007593756541609764,
        0.03899829462170601,
        -0.09206505119800568,
        0.004557057283818722,
        0.09676109254360199,
        0.008052452467381954,
        0.048765260726213455,
        -0.029016226530075073,
        0.11869541555643082,
        0.008179190568625927,
        0.02638557180762291,
        0.057461872696876526,
        -0.037894438952207565,
        0.07038573175668716,
        -0.035818979144096375,
        0.01864694058895111,
        -0.056841831654310226,
        -0.01385966595262289,
        0.05781332775950432,
        0.03038947656750679,
        -0.04632681608200073,
        -0.043918538838624954,
        -0.019264716655015945,
        -0.013253302313387394,
        -0.01907804049551487,
        -0.005325112026184797,
        0.016716383397579193,
        0.03435276448726654,
        -0.05605153366923332,
        -0.07945504039525986,
        0.10670839995145798,
        -0.01824970170855522,
        -0.0371670238673687,
        0.01822444051504135,
        0.0025714035145938396,
        0.022124342620372772,
        -0.12716802954673767,
        -0.10165771842002869,
        -0.04713103920221329,
        -0.06541742384433746,
        -0.04872243106365204,
        0.05736617371439934,
        0.05414200574159622,
        0.04347166419029236,
        0.0036810245364904404,
        -0.04672877490520477,
        -0.04336974397301674,
        -0.01330574695020914,
        0.0422665998339653,
        0.03825042396783829,
        -0.06089966744184494,
        0.08723660558462143,
        -0.009034368209540844,
        0.00931316614151001,
        0.012896347790956497,
        -0.10776643455028534,
        -0.023143120110034943,
        0.07033386081457138,
        0.0076462929137051105,
        -0.04036375507712364,
        -0.05468550696969032,
        -0.012472610920667648,
        0.03137706220149994,
        -0.018472766503691673,
        -0.01591675542294979,
        0.00973019003868103,
        -0.03245750442147255,
        -0.011551544070243835,
        -0.09118818491697311,
        0.08580461889505386,
        -0.04235212877392769,
        0.02649237960577011,
        -0.00019044490181840956,
        -0.017066102474927902,
        -0.02601321041584015,
        -0.008859663270413876,
        -0.012102711014449596,
        0.03938969597220421,
        -0.0300354715436697,
        0.012548333033919334,
        -0.0027138658333569765,
        -0.02860395610332489,
        0.027271410450339317,
        0.05367264896631241,
        0.05246540158987045,
        0.03479587286710739,
        -0.022154655307531357,
        -0.0777050107717514,
        -0.053205426782369614,
        0.012907353229820728,
        0.004005732014775276,
        0.0343313030898571,
        -0.013237584382295609,
        -0.10134188830852509,
        -0.06320539116859436,
        0.03264326974749565,
        -0.021730728447437286,
        -0.0885162428021431,
        0.07517553120851517,
        0.02775908261537552,
        0.08605749905109406,
        0.004342055879533291,
        -0.042445190250873566,
        0.011876910924911499,
        -0.03528491407632828,
        0.04513808339834213,
        0.0398944616317749,
        -0.02483963780105114,
        -0.07639598101377487,
        -0.08038091659545898,
        0.019724123179912567,
        -0.09479671716690063,
        0.0727163553237915,
        -0.07680445909500122,
        -0.005022150464355946,
        -0.044848423451185226,
        -0.010444273240864277,
        0.06461398303508759,
        -0.030174745246767998,
        -0.010978791862726212,
        -0.06721623241901398,
        -0.08349961042404175,
        0.046580150723457336,
        -0.050941772758960724,
        0.057557761669158936,
        0.010578671470284462,
        2.0730915515346166e-33,
        -0.0138239786028862,
        0.041448503732681274,
        -0.05659424141049385,
        -0.07708878815174103,
        0.0663016065955162,
        0.035987742245197296,
        0.05070352926850319,
        0.08900757879018784,
        -0.06823373585939407,
        0.013248469680547714,
        -0.08094654977321625,
        0.02919483371078968,
        -0.07725422084331512,
        0.0721457451581955,
        0.041168462485075,
        -0.0968000665307045,
        0.022948645055294037,
        0.06060511991381645,
        -0.00525041576474905,
        -0.0443902462720871,
        0.01189685333520174,
        0.05408826097846031,
        0.042424123734235764,
        -0.0651187002658844,
        0.067156121134758,
        0.07359275966882706,
        -0.022045817226171494,
        -0.028148360550403595,
        0.04314180091023445,
        0.05839980021119118,
        -0.07325077801942825,
        -0.014504285529255867,
        -0.05911095812916756,
        -0.06536306440830231,
        -0.03499121963977814,
        -0.09480983018875122,
        -0.01282198540866375,
        -0.0852133259177208,
        -0.02365580014884472,
        0.037546463310718536,
        -0.056046709418296814,
        -0.017082594335079193,
        -0.17516329884529114,
        -0.12160062044858932,
        -0.03965296968817711,
        0.010267610661685467,
        0.07979234308004379,
        -0.030789600685238838,
        0.06468571722507477,
        -0.05034841597080231,
        -0.029057350009679794,
        0.040371183305978775,
        -0.09258438646793365,
        -0.034180790185928345,
        0.00787529069930315,
        -0.14315669238567352,
        -0.09365513175725937,
        0.03439977392554283,
        0.07641419768333435,
        0.06329263001680374,
        0.05182024464011192,
        0.052896253764629364,
        0.0940774530172348,
        0.04296107217669487,
        0.009208005852997303,
        0.0397321991622448,
        -0.0073281205259263515,
        -0.04984818398952484,
        -0.04145042598247528,
        -0.033022839576005936,
        0.02135210484266281,
        -0.03640158101916313,
        0.03555654361844063,
        0.0007486621616408229,
        0.06403429806232452,
        -0.03506224602460861,
        -0.042527779936790466,
        -0.019434364512562752,
        0.02578877843916416,
        -0.050025857985019684,
        0.045768752694129944,
        0.0169723778963089,
        0.0135994553565979,
        0.06820135563611984,
        0.05028920620679855,
        0.01682610623538494,
        0.05552453547716141,
        -0.10467931628227234,
        -0.050143443048000336,
        0.008627552539110184,
        -0.05055368319153786,
        -0.04934880509972572,
        -0.03135904297232628,
        -0.025337014347314835,
        -0.037874989211559296,
        -3.561588456570201e-33,
        -0.0048833745531737804,
        -0.0033386305440217257,
        0.019506312906742096,
        -0.02427307702600956,
        -0.024636244401335716,
        0.015056092292070389,
        0.0004548695287667215,
        -0.013049074448645115,
        -0.006367641966789961,
        -0.058275215327739716,
        0.03318430110812187,
        0.05082225799560547,
        0.011086350306868553,
        -0.06652334332466125,
        -0.02357233129441738,
        0.0152619993314147,
        0.01880655437707901,
        -0.04207456111907959,
        0.024235358461737633,
        -0.06407202780246735,
        0.07639717310667038,
        -0.06494570523500443,
        -0.05218953639268875,
        0.07649679481983185,
        -0.012698937207460403,
        0.018398042768239975,
        0.06044808402657509,
        -0.019453223794698715,
        -0.023242183029651642,
        0.03436607867479324,
        -0.022699367254972458,
        0.06250873953104019,
        -0.021381530910730362,
        -0.002897530561313033,
        -0.02078055590391159,
        -0.0060955132357776165,
        0.03893594816327095,
        0.07891524583101273,
        0.0040624188259243965,
        0.03353719040751457,
        0.012799958698451519,
        -0.1159021183848381,
        0.05060337111353874,
        0.015203478746116161,
        0.03210413083434105,
        -0.06221521645784378,
        -0.031499605625867844,
        -0.05080553516745567,
        0.13458797335624695,
        0.04857531189918518,
        0.044816676527261734,
        -0.06712593883275986,
        0.023897897452116013,
        -0.04495193064212799,
        -0.06333655118942261,
        -0.062424186617136,
        -0.13480301201343536,
        -0.0468398816883564,
        -0.026637021452188492,
        -0.004365749657154083,
        0.06853290647268295,
        0.0017079097451642156,
        -0.06342471390962601,
        0.006785521283745766,
        0.10804300755262375,
        0.017779503017663956,
        0.10850094258785248,
        -0.012688159011304379,
        0.001873269211500883,
        -0.004668458830565214,
        0.05270692706108093,
        -0.04688088968396187,
        -0.007406644057482481,
        -0.024767788127064705,
        0.004908195696771145,
        0.03823602572083473,
        0.0008398715872317553,
        -0.027080560103058815,
        0.05930636078119278,
        -0.031474385410547256,
        0.01455917488783598,
        -0.01685599982738495,
        0.030006926506757736,
        0.021043948829174042,
        0.03468376398086548,
        0.029622171074151993,
        0.03929033502936363,
        0.0460197888314724,
        -0.04179878905415535,
        0.010580062866210938,
        -0.04743575677275658,
        0.08244574815034866,
        -0.0026210651267319918,
        0.10429097712039948,
        0.0835268571972847,
        -6.239903882487852e-08,
        0.07842328399419785,
        -0.002426630351692438,
        -0.05535241588950157,
        0.03946544975042343,
        -0.04187755659222603,
        -0.05201337859034538,
        -0.034072451293468475,
        -0.02693663164973259,
        0.0022484001237899065,
        -0.009553910233080387,
        -0.016989829018712044,
        -0.012723460793495178,
        -0.0014474036870524287,
        -0.019073817878961563,
        0.03497150540351868,
        0.06555607914924622,
        -0.01545126736164093,
        0.03279239311814308,
        -0.029102012515068054,
        0.03286394476890564,
        0.044211845844984055,
        -0.005537904798984528,
        0.11255347728729248,
        -0.0630820170044899,
        -0.06865772604942322,
        -0.03323286771774292,
        -0.01532403752207756,
        0.12327995896339417,
        0.061062466353178024,
        -0.0391685925424099,
        0.002630974631756544,
        0.027529247105121613,
        0.0010192203335464,
        0.014440090395510197,
        0.07286478579044342,
        -0.018960073590278625,
        -0.008132198825478554,
        0.08209236711263657,
        0.046592097729444504,
        -0.02744108811020851,
        0.011767743155360222,
        -0.029330315068364143,
        -0.03325038403272629,
        0.023919017985463142,
        -0.016155434772372246,
        0.030144844204187393,
        0.006775140296667814,
        -0.03389234095811844,
        -0.007859821431338787,
        0.06330367177724838,
        -0.018115323036909103,
        -0.002207579091191292,
        0.0043842424638569355,
        0.06416015326976776,
        0.040002379566431046,
        0.1018875390291214,
        -0.004852376878261566,
        0.047158945351839066,
        0.052330370992422104,
        0.030314747244119644,
        0.042980317026376724,
        -0.09479852765798569,
        -0.052369121462106705,
        0.07759730517864227
    ]
}