{
    "id": "rnPPygtQH-w",
    "title": "Google Pixel 7 Pro – the big ‘bump’ has a few big problems….",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-10-31T21:48:14Z",
    "video_url": "https://www.youtube.com/watch?v=rnPPygtQH-w",
    "category": "Howto & Style",
    "tags": [
        "Pixel 7 pro",
        "pixel 7",
        "google phone",
        "android",
        "pixel phone",
        "flagship",
        "best phone 2022",
        "apple",
        "google",
        "iphone",
        "pixel 7 review",
        "pixel 7 pro durability test",
        "scratch test"
    ],
    "views": 1381549,
    "likes": 45339,
    "comments_count": 1597,
    "description": "The new google phone is all brains... not so much brawn. Let Audible help you discover new ways to laugh, be inspired, or be entertained. New members can try it free for 30 days. Visit  or text JerryRig to 500-500.  Googles smartphones have always been really smart. And while none of the recent Pixel phones have *failed* my durability test... some have come close. (Nothing as bad as the Google Nexus 6P from back in the day though)   Today we find out whats going on with the massive metal camera visor on Googles new phone - and what we can expect for longevity with the Pixel 7 pro.   Watch the Pixel 7 Pro Teardown HERE:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.Audible.com/jerryrig",
        "https://youtu.be/DRQ5wzCDK84",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're durability testing what's been called 'The World's Smartest Smartphone' the Pixel 7 Pro. Even though primarily focused on software, the latest phone from Google should be pretty interesting. Inside the box we get the phone itself with its absolute unit of a metal camera visor. I have some definite thoughts on this one. We also get a white USB-C cable and a cute little tiny booklet just for the SIM card removal tool. Creative. This video is sponsored by Audible. Let's get started. [Intro] The biggest question I have with this new Pixel 7 Pro is how well this all-metal glossy camera cliff is going to hold up against scratches and daily use in my pocket. Nothing ages a phone or a vehicle faster than wear and tear on the paint job. Even out of the box for just a few minutes, the camera bump already has some scratches and my test hasn't even started yet. Hardware has never been the main focus of the Pixel phones. From both a component and structural perspective, software has always taken precedence. The Pixel 7 Pro is really no different. For example, for people who are hard of hearing, Google has an impressive list of accessibility tricks like live captions for any playing media, as well as live translation for that same media into 48 different languages. A pretty impressive feature to be sure. For people with visual impairments there is a TalkBack guided frame feature that we'll talk about with the cameras later on in this video. But first, the scratch test. Finding out what the screen is made from has always been the first phase of the JerryRigEverything durability tests for the past 7 years. It's been quite the journey as we work our way up through the Mohs scale of hardness. Some phones scratch at a level 2 like the Galaxy Flip. Some phones scratch at a level 8 or 9 like the DuraForce Ultra. But most phones, most phones my friends, scratch at level 6 with deeper grooves at a level 7. And this Pixel 7 Pro is no different. With Gorilla Glass Victus on top, the tempered glass is indeed scratch resistant. The glass also covers the 10.8 megapixel hole punch camera in the front which sits right below the super thin earpiece lid. The second phase of our durability test is finding out what the frame is made from. Sounds to me like we have some metal over here. A bit different than the thick layer of plastic we found on the Pixel 6A last year, and the Pixel 5 the year before. The non-glossy matte buttons are also made of metal which also has knowledge in the case with the Pixel phones. And up here at the top we have an ultra glossy plastic section and this is to let the 5G in. We have more metal along the left side near the IP68 SIM card tray which is designed to keep water out. And of course down at the bottom we have our loudspeaker, microphone, and 23 watt fast charging USB-C charging port. I italicized my voice because the 23 watts is actually pretty slow. Slower than even an iPhone. But hey, who's keeping track anymore anyway. Let's chat about that metal camera bump. There are a few ways to paint metal. Paint is one of those obviously, powder coating is another, but usually too thick for smartphones. And then we also have anodizing, which is accomplished by electrifying the metal in an acid bath. And while anodizing is indeed very durable since the metal itself is becoming the coating, it can still be worn down over time like on my very thinly anodized Rivian key fob that's only been in my pocket for about 6 months. To be completely fair, that fob also went through the washing machine once, but that's beside the point. The point is that no matter what the coating, constant abrasion will eventually wear through. Whether it's keys, coins, or 1,000 grit sandpaper that you might have rumbling around in your pocket, eventually the camera lens coating will rub off. And like we saw on the fob, even a cloth pocket is abrasive if you're patient enough. My prediction is that two years from now the Pixel 7 series of phones is going to aesthetically look pretty hammered more so than even the glass lens Pixel 6 phones released a whole year before. Unless, of course, you have a case that protects those raised anodized corners. Google has said that their phone frame is made from 100% recycled aluminum which is pretty awesome. Thumbs up for that. The biggest thumbs up, however, goes to a story that for some reason I just heard about for the first time. It's a true story called The Boy Who Harnessed The Wind that I've been listening to from my channel sponsor, Audibel. It's about a teenager from Malawi, Africa who made an electricity producing windmill with recycled bike parts and scrap metal to help save his family from a drought. And he did it all with information he found in a book. It's really a fantastic listen and makes you think outside the box. You, too, can listen to The Boy Who Harnessed The Wind and try Audible free for 30 days. Just head to Audible.com/JerryRig or text jerryrig to 500-500. Audible has everything from best sellers, memoirs, mysteries, motivations. Personally, my favorite type of audiobook are the true stories of people who have made a difference throughout history. And The Boy Who Harnessed The Wind with William Kumkwamba is definitely one of those stories. You can listen anytime, anywhere with Audible. And get a free title every month with the link in the description: Audible.com/jerryrig. And feel free to check out the exclusive Audible Originals from top experts, celebrities, and new voices in audio. One of these days I think it would be fun if Audible let me narrate something cool. Until then though, the link is down in the description. Where were we? Oh yes, the camera. Google has pretty much always been known for their good picture quality. We have the normal 50 megapixel camera on the left, then a 12 megapixel ultra wide in the center, and a 48 megapixel telephoto camera off in its own little circle all protected with glass. Now it was about here when I noticed a slight deviation from what we normally see. My razorblade started leaving marks on the back glass. Both the neon green knife, as well as my transparent knife were both leaving scratches on the surface. Very strange. I thought about this phenomenon all while setting my fingerprint with the optical scanner under the front glass since both sides are protected with Victus and we don't normally see scratches from steel knife blades. However, my level 7 deeper grooves do leave some hefty damage on the front glass. And while the fingerprint scanner is still functional, the scratches are still a big deal. Moving my razor blade to the previous level 4 position, we can tell it's still leaving marks on the front. But the calibrated level 5 pick still does not, whether on the front or the back. Basically with the calibrated and standardized scratch test tools we see no damage. But with my uncalibrated razor blades, that very well could be an alloy of anything, changing from batch to batch and brand to brand. We do see some marks. Long story short, the scientific Mohs test says the glass is indeed normal. It's the razor blade alloy that probably has the variation. So I would indeed recommend against taking a razor blade to your phone. Thanks for watching Jerry Tech Tips. Flipping our very scratched Pixel 7 Pro over the front we can commence phase 3 the burn test. Google has a 120 hertz 1440p 1500 bit display which has a very subtle glass curve around the edges. We see the pixels on the Pixel start to go black after about 20 seconds under the heat from my flame, and they very much do not recover. With the screen visually damaged you might be surprised to learn that as long as the touch function digitizer remains intact, the phone is still 100% usable, even if we were to burn every AMOLED pixel. People with visual impairments have been using software tricks like TalkBack to navigate smartphones for years. But Google has recently added a guided frame feature to the selfie camera that supposedly helps the phone find your face and guide the camera to the best position to take good selfies. [Phone TalkBack voice] One cropped face. Move your phone left and down. One face ready for selfie. 3, 2, 1, photo taken. [Zack] ...even if the person is unable to visually see the screen during this process. I'm a pretty big fan of accessibility and I see this feature as a definite win. [Phone TalkBack voice] 3, 2, 1, photo taken. Tap. TalkBack off. [Zack] Now for phase 4 the bend test. Applying pressure to the back of the Pixel 7 Pro I found more flex than I was anticipating. This is a very heavy phone and now it has some definite curve right at that antenna line, next to the lower camera cliff. Enough curve that I legitimately thought that we were going to lose him with the first bend. Flipping the phone over and applying pressure to the front had no effect, but the back has some very unnerving flex. The Pixel 7 Pro does not snap in half nor break catastrophically, but Google is definitely snuggling up a little too close to that Nexus 6P standard of structural integrity. The visual gap in the antenna line means that this phone has definitely lost its water resistance. And while the Pixel 7 Pro does survive my durability test, it's only barely. So I would recommend a case with this smartphone for both structure as well as some aesthetic protection on the camera bump. A smartphone can last a really long time. And just like with brushing your teeth, a little help will allow them to last even longer. Hit that subscribe button so you don't miss any more epic Tech Tips with Jerry. And come hang out with me on Instagram and Twitter. And don't forget about Audible's The Boy Who Harnessed The Wind down in the description. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "World Smartest Smartphone",
        "World Smartest",
        "Pixel",
        "Pixel phones",
        "camera",
        "phone",
        "Pro",
        "Boy Who Harnessed",
        "Harnessed The Wind",
        "phones",
        "Smartest Smartphone",
        "Glass",
        "Audible",
        "metal",
        "Google",
        "test",
        "glass lens Pixel",
        "level",
        "pretty",
        "front"
    ],
    "transcript_entity_values": [
        "Google",
        "The Boy Who Harnessed The Wind",
        "1,000",
        "Audible Originals",
        "just a few minutes",
        "iPhone",
        "Rivian",
        "about 6 months",
        "9",
        "30 days",
        "50 megapixel",
        "Nexus",
        "a whole year before",
        "6",
        "8",
        "10.8 megapixel",
        "the year before",
        "The Pixel 7 Pro",
        "2",
        "Instagram",
        "100%",
        "two years from now",
        "the DuraForce Ultra",
        "Jerry",
        "Africa",
        "the past 7 years",
        "about 20 seconds",
        "years",
        "The World's Smartest Smartphone'",
        "TalkBack",
        "Malawi",
        "1",
        "12 megapixel",
        "half",
        "Victus",
        "the Pixel 6A",
        "4",
        "SIM",
        "Audible.com/JerryRig",
        "the Galaxy Flip",
        "5",
        "Jerry Tech Tips",
        "USB-C",
        "daily",
        "Zack] Now",
        "first",
        "second",
        "last year",
        "48",
        "23 watt",
        "500-500",
        "Pixel 7 Pro",
        "Pixel 7 Pro",
        "120 hertz 1440p 1500",
        "6P",
        "William Kumkwamba",
        "Audibel",
        "Today",
        "Tech Tips",
        "3",
        "One",
        "Zack",
        "this Pixel 7 Pro",
        "48 megapixel",
        "USB",
        "Audible",
        "Mohs",
        "The Boy",
        "7",
        "Twitter",
        "the Pixel 7 Pro",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "FAC",
        "PERSON",
        "LOC",
        "DATE",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "LAW",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "GPE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.15404310822486877,
        0.014150729402899742,
        0.1440424919128418,
        -0.026179114356637,
        0.07003963738679886,
        -0.09181670844554901,
        0.06708122044801712,
        0.031111232936382294,
        -0.07010211795568466,
        0.02770574390888214,
        0.03283693268895149,
        0.022939173504710197,
        -0.02309897169470787,
        0.02642189897596836,
        0.015157879330217838,
        -0.045409101992845535,
        0.04018443822860718,
        -0.05761769041419029,
        -0.07179483026266098,
        0.07309196144342422,
        -0.05296020954847336,
        -0.061741314828395844,
        0.053948428481817245,
        -0.0008572042570449412,
        0.019769344478845596,
        0.03723638132214546,
        0.026269903406500816,
        -0.027368780225515366,
        -0.01492974255234003,
        -0.08345927298069,
        -0.05116467922925949,
        0.06635183095932007,
        -0.03554055094718933,
        0.0917450413107872,
        0.011255028657615185,
        -0.03097824938595295,
        0.026274405419826508,
        0.07549649477005005,
        -0.10598371177911758,
        -0.008378719910979271,
        0.017364025115966797,
        -0.0627170205116272,
        0.0003561148187145591,
        -0.07370169460773468,
        0.026038816198706627,
        -0.031006965786218643,
        0.11966464668512344,
        -0.04186709225177765,
        0.014417937025427818,
        -0.06668667495250702,
        -0.02588246949017048,
        -0.07122061401605606,
        0.06607908755540848,
        -0.01419126708060503,
        -0.09431804716587067,
        -0.007727699354290962,
        0.003343775402754545,
        -0.05401752516627312,
        0.07076022028923035,
        0.03553340956568718,
        0.024141760542988777,
        -0.01896805875003338,
        0.0011293754214420915,
        0.08276322484016418,
        0.004227043129503727,
        0.0343184657394886,
        0.058187320828437805,
        -0.12326788902282715,
        -0.0346071682870388,
        0.0331428162753582,
        -0.01094420813024044,
        0.07218863815069199,
        -0.05174047872424126,
        -0.03432496637105942,
        -0.005194853059947491,
        0.04938244819641113,
        -0.005971534643322229,
        -0.010960984043776989,
        0.002162267453968525,
        -0.03526473790407181,
        0.05399024859070778,
        -0.005101544316858053,
        0.008723211474716663,
        0.05851510539650917,
        0.04076770320534706,
        0.041878290474414825,
        0.049539849162101746,
        0.07430852949619293,
        -0.05733916908502579,
        -0.06948476284742355,
        0.0013937581097707152,
        0.10389392822980881,
        -0.02445410005748272,
        0.02700330689549446,
        -0.051764991134405136,
        -0.006960696540772915,
        -0.04603460431098938,
        -0.06889688968658447,
        -0.004828842356801033,
        0.05144525691866875,
        0.002820671070367098,
        0.010386737063527107,
        0.04679359495639801,
        0.007912248373031616,
        0.022614944726228714,
        -0.016807381063699722,
        -0.09346935898065567,
        0.045285116881132126,
        0.025005606934428215,
        0.018535124137997627,
        0.017381537705659866,
        0.036233194172382355,
        -0.015425904653966427,
        0.016955619677901268,
        -0.027894623577594757,
        -0.05384543165564537,
        -0.06640445441007614,
        0.03731062263250351,
        0.10035005956888199,
        2.6521111067268066e-05,
        0.026971176266670227,
        0.012252243235707283,
        -0.07638769596815109,
        -0.057088956236839294,
        0.025287343189120293,
        0.009237142279744148,
        -0.057094182819128036,
        6.045369448949308e-33,
        0.06793048977851868,
        0.0953432023525238,
        0.03540859743952751,
        -0.030042944476008415,
        -0.07059907913208008,
        0.0802532508969307,
        0.015409941785037518,
        0.06601735949516296,
        -0.03554816544055939,
        -0.039660073816776276,
        0.002512693405151367,
        0.007132779806852341,
        -0.04541400074958801,
        0.01087893731892109,
        0.06523881107568741,
        -0.02218172512948513,
        -0.003211386501789093,
        -0.04073358699679375,
        -0.036200158298015594,
        -0.01332980114966631,
        -0.03825127333402634,
        -0.03691067919135094,
        -0.06080032140016556,
        0.01708090491592884,
        -0.00586341880261898,
        0.11929681152105331,
        0.07597020268440247,
        0.04311174526810646,
        -0.015100807882845402,
        0.008624212816357613,
        -0.11032124608755112,
        0.02515176497399807,
        0.0977213978767395,
        0.07820111513137817,
        -0.0573580302298069,
        0.031285252422094345,
        -0.046601302921772,
        -0.06507223099470139,
        0.003562960773706436,
        -0.001489963848143816,
        -0.08305389434099197,
        0.006225632503628731,
        -0.045941662043333054,
        -0.02054707705974579,
        0.019139010459184647,
        0.03044808655977249,
        0.013132498599588871,
        -0.05519844964146614,
        -0.04782464727759361,
        0.01822407729923725,
        0.0589841865003109,
        -0.02997167408466339,
        -0.02967679128050804,
        -0.037587448954582214,
        -0.0939582884311676,
        -0.017089180648326874,
        -0.006978238932788372,
        -0.05188686028122902,
        0.07530693709850311,
        0.03253882750868797,
        0.048353586345911026,
        0.017602991312742233,
        -0.04548681899905205,
        0.06178508326411247,
        -0.0291316919028759,
        0.007729041390120983,
        0.04094235599040985,
        0.06711553782224655,
        -0.13767878711223602,
        0.03308870643377304,
        -0.012635670602321625,
        0.009994343854486942,
        0.03558684140443802,
        -0.03539807349443436,
        0.012950189411640167,
        0.0035679026041179895,
        -0.06226569786667824,
        -0.04746372252702713,
        0.008846926502883434,
        0.001076088985428214,
        -0.03257644921541214,
        -0.03271756321191788,
        0.09632714837789536,
        -0.012043983675539494,
        -0.02959723211824894,
        -0.0588785819709301,
        0.016556033864617348,
        -0.07140941172838211,
        -0.0397208146750927,
        0.014617197215557098,
        -0.029712427407503128,
        -0.05977519974112511,
        -0.046275775879621506,
        0.02811088226735592,
        -0.01641952618956566,
        -7.163207638573685e-33,
        0.008931768126785755,
        -0.038310348987579346,
        0.02382521890103817,
        0.03652972728013992,
        -0.03362555429339409,
        -0.060849420726299286,
        0.11231406778097153,
        0.11932329088449478,
        0.0023586717434227467,
        -0.06906084716320038,
        0.03185752406716347,
        0.06374429911375046,
        0.022928526625037193,
        0.0025172552559524775,
        -0.011795100755989552,
        -0.048946134746074677,
        -0.008240369148552418,
        -0.10109320282936096,
        -0.002324132015928626,
        -0.028723040595650673,
        0.08636873960494995,
        0.019562000408768654,
        0.0011340266792103648,
        0.07340993732213974,
        -0.014749554917216301,
        0.018256476148962975,
        0.02166147530078888,
        -0.04206785559654236,
        -0.0011163585586473346,
        -0.013905790634453297,
        0.016736727207899094,
        -0.08544134348630905,
        -0.005928875412791967,
        0.02051280438899994,
        0.06403320282697678,
        -0.0025883575435727835,
        0.02718176878988743,
        -0.06470737606287003,
        0.047953322529792786,
        -0.08555813133716583,
        -0.05606977641582489,
        0.007466444745659828,
        0.04072406888008118,
        -0.07696924358606339,
        0.05248282477259636,
        -0.033374350517988205,
        0.03453584760427475,
        0.009232809767127037,
        -0.01689169928431511,
        0.0778876468539238,
        -0.020234733819961548,
        0.036212753504514694,
        -0.05703968554735184,
        -0.0029442603699862957,
        -0.08166702836751938,
        0.024864891543984413,
        0.01352760847657919,
        -0.046350184828042984,
        0.018182305619120598,
        -0.0015298692742362618,
        0.06426692754030228,
        0.02752085030078888,
        -0.05627970024943352,
        -0.0037321101408451796,
        -0.054652485996484756,
        0.015473215840756893,
        0.0630931705236435,
        0.0180172398686409,
        -0.004203349351882935,
        0.02655009925365448,
        0.016338570043444633,
        -0.0069934227503836155,
        0.0005993660306558013,
        -0.05467942729592323,
        0.03358309715986252,
        -0.012674679048359394,
        -0.012482034973800182,
        0.023719994351267815,
        -0.010860079899430275,
        -0.01704305410385132,
        0.061479680240154266,
        -0.05869763717055321,
        0.05636122077703476,
        0.027679085731506348,
        0.07613744586706161,
        0.023052584379911423,
        0.05143772438168526,
        0.006307580973953009,
        -0.0271612461656332,
        0.0010194985661655664,
        -0.10191122442483902,
        0.00785295944660902,
        -0.09756539762020111,
        0.08915577083826065,
        -0.03247576579451561,
        -5.692450244509928e-08,
        0.04805270582437515,
        0.019681688398122787,
        0.0007827418157830834,
        -0.09809163957834244,
        0.1010541170835495,
        -0.0980706661939621,
        -0.0009297993965446949,
        0.035002220422029495,
        0.08208215236663818,
        -0.07186312228441238,
        -0.011908024549484253,
        -0.07581270486116409,
        -0.027751963585615158,
        0.07621542364358902,
        -0.02212337590754032,
        0.07025003433227539,
        -0.05539360269904137,
        -0.02572077512741089,
        -0.02428204007446766,
        -0.04390764236450195,
        -0.07717385143041611,
        -0.03148283064365387,
        0.06736481189727783,
        -0.04023110121488571,
        -0.014026091434061527,
        -0.004682410508394241,
        -0.05473091080784798,
        0.050571512430906296,
        0.026878327131271362,
        -0.051262594759464264,
        -0.08757564425468445,
        -0.02500658854842186,
        0.023265505209565163,
        0.014812923036515713,
        0.03887007758021355,
        0.003702367888763547,
        -0.03992067277431488,
        -0.04549631103873253,
        0.13386401534080505,
        0.010935735888779163,
        0.016079138964414597,
        -0.06729628145694733,
        0.06468464434146881,
        0.026169858872890472,
        -0.013075974769890308,
        -0.06032467260956764,
        0.028859589248895645,
        -0.09101498872041702,
        -0.013071885332465172,
        0.06553909182548523,
        -0.06105436757206917,
        0.023927835747599602,
        -0.06819124519824982,
        0.03743559867143631,
        0.077161505818367,
        -0.05958371236920357,
        0.0792553648352623,
        -0.029499389231204987,
        -0.021284563466906548,
        0.05097038298845291,
        0.06029157340526581,
        -0.08687584847211838,
        0.02262432686984539,
        0.12426868826150894
    ]
}