{
    "id": "Ro6DKfFS1vk",
    "title": "ROG Phone 5 Teardown! - Why did it break?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-03-19T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=Ro6DKfFS1vk",
    "category": "Howto & Style",
    "tags": [
        "ROG phone 5",
        "ROG 5",
        "Asus",
        "Best gaming phone",
        "flagship",
        "smartphone",
        "android",
        "mobile game",
        "gaming phone",
        "iphone",
        "asus rog",
        "Republic of Gamers",
        "ROG",
        "game",
        "gaming",
        "video game"
    ],
    "views": 1377406,
    "likes": 61145,
    "comments_count": 2821,
    "description": "Its time to take apart the ROG Phone 5 and see why it breaks under pressure. The ROG 5 is the latest and greatest gaming phone from Asus. It packs a powerful punch... but we found some structural issues that other phones dont have. Today we will dissect the ROG Phone 5 and see what makes it work (or not work) from the inside. Remember that ALL structural defects can be easily fixed with a simple hard case. The ROG Phone 5 is sill a *great* phone. With many positive aspects. Just make sure you have a case on it and it will last forever, just like any other phone.   Get my razor knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   Anker is named as the Official Charging Partner of JerryRigEverything:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "http://ankerfast.club/JREpartnership",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Well, here we are with what's left of the ROG Phone 5. This top of the line gaming phone did not survive my durability test. The one billion color display is cracked underneath the glass, and well, the back glass is also broken, shattered, or I don't know, I guess obliterated might be the best word. Why though? ROG has made 3 other super structurally solid gaming phones in the past, and even the normal line up of ASUS phones has always been super solid. What made this ROG 5 so much weaker. Today we're going to take this guy apart to see what really happened. And of course, we'll see how these LEDs are still working from the inside as well. Let's get started. [Intro] Now normally I use heat to soften the adhesive under the glass so I can remove the glass without it breaking. I don't think it's physically possible for this glass to break any more than it has, but the adhesive underneath is still super strong. So I'll bring over that heat gun anyway. I would have to say that holding this phone is rather unpleasant. Immediately upon removal of the glass we get a glimpse of two free floating LED ribbons. These ribbons would normally be seated at the top and bottom of the panel logo, shining their light up into a piece of translucent white plastic. The plastic diffuses the colored LEDs to fill up a much larger area. Kind of the same thing we've seen in previous ROG phones. It's pretty cool to see it all from the inside. There are definitely two batteries in here, which is probably one of the reasons for our structural issues. I'll remove 6 screws on the bottom plastic plate. Five more screws on the middle plate. And 6 screws on the top plate, which also contains the top loudspeaker and earpiece. It does have a little chamber of sound dampening foam balls inside, which is a good thing. And we need all the good things we can get at this point. The battery connectors are not immediately visible, so I'll just start popping off ribbons just like little Legos. And there are quite a lot of them. I'm still not sure where the batteries are plugged in, but since the phone's already toast, I'm not super worried about it. Normally phones are built with motherboards and batteries running lengthwise inside the phone. And battery compartments running lengthwise usually have a tall metal ridge inside the phone to separate the battery from the motherboard. And that metal ridge, by default, helps give the phone structural rigidity and strength. But this ROG 5 has five different internal segments, two battery portions and three circuit board portions....which explains the plethora of extension ribbons. The problem is that none of these segments are running lengthwise inside of the phone, which means nothing internally is helping the structure. And also, unfortunately, right there in the middle of the frame are two super thin weak points where large chunks of the frame have been cut out. The antenna line and the accessories port provide the perfect dotted lines for the phone to fold on. And when it bends too far, the glass breaks...on both sides. Putting the ROG Phone 5 in a back pocket and sitting down would definitely be a no-no. The motherboard in the center is stacked, and comes with the cutest shortest little ribbon connectors we've ever seen. At this point I'm not super invested in trying to save the phone since it's pretty far gone. I just want to see the batteries and the internal vapor chamber if there is one. There are a ton of ribbon cables in here. If there was a price for the most ribbon cables, this phone definitely wins. The bottom circuit board comes out. This has a headphone jack soldered in place, which is weird because everything else has a ribbon. The bottom stereo speaker does not have little foam balls inside. And the vibrator looks pretty normal and unbroken, so I'm not sure why it was making those dying cat noises during the durability test. Asus has made the batteries very difficult to remove. Prying is pretty dangerous, since if the internal layers of the pouch-style battery were to crush together and short out, they would start on fire. But isopropyl alcohol does work its magic in dissolving the adhesive, and with a little less force I can pull it loose. It's still unable to be removed though since the plug is running underneath the center motherboard. Now, at first glance I thought the middle motherboard had a rivet through it, pinning it to the frame, which I just broke off because that's how done I am with this phone and its glass shards. But at closer glance it looks like it's actually the world's smallest hex bolt right below that circular head, so it probably can be removed safely, with little tiny pliers, or maybe asking a mouse if you can borrow a wrench. The top battery is also glued in place. Remember, this phone probably would have survived if these batteries were oriented differently. And there they are. Two batteries tied together with one plug. Each of them are 2885 milliamp hours in capacity, and each one can be charged at 30 watts, bringing the total charging wattage to 60. A Tesla, by comparison, can charge at 150,000 watts since they have 6,000 batteries inside. It's cool how it scales up like that...well, cool until we realize that the dual battery design is what killed the phone. You win some and you lose some. It does look like we are in luck though with the vapor chamber. We'll have to dig that out after we check on the cameras. The ROG Phone 5 has 3 cameras. Once I get them out we can see that the 64 megapixel main sensor on the left does not have optical image stabilization. Then we have the 13 megapixel ultra wide camera in the middle, which also does not have OIS. Asus says they both have internal electronic image stabilization, but that's not quite the same thing. The small five megapixel macro lens also just has that EIS and not OIS. The front 25 megapixel camera also does not have OIS, but that's pretty normal. Finally, the vapor chamber. Last week we took apart the Xperia Pro, which has the largest vapor chamber we've ever seen in a smartphone. I sliced open my finger trying to pull this out for you guys...which is a fair injury I guess since, well, you saw what I did to the phone first. To remove the vapor chamber, once again we have to take off the screen. I don't feel as bad about this one since the screen is already broken. I can get it warmed up a bit and then slip my razor inside and slice under the glass all around the edge, separating the screen from the body. What I am impressed with is how the Victus glass has not yet shattered or cracked even one bit. The rest of the phone has been obliterated, but the front glass is still in one piece. Nice work, Corning. And we see why the fingerprint scanner is so terrible. It's the size of an ant and doesn't have a lens. Honestly, a lot of things in this phone don't seem planned out very well. It's almost like there was a pandemic last year and instead of waiting it out, ROG threw this guy together with a socially distant team who did the best with what they had. And what they had was blue thermal paste. Now it looks like I poked a Smurf. The vapor chamber isn't winning any size awards this year though. I think Sony's going to hold that record for a while. There does seem to be a little bit of liquid inside you can see evaporate very quickly after I slice open the copper. Well, this was a tough one. The ROG series gaming phones have been some of my favorites for a long time. And just because the ROG 5 failed the durability test, it doesn't make it a bad phone, it just has some weak points that potential owners should be aware of. Take care of it and don't sit on it. There's no need to baby it of course, just don't not baby it. A beefy case would solve 100% of it's structural problems and leave you with nothing to worry about. I'm definitely looking forward to the ROG Phone 6 next year for sure. As always, let me know what you think down in the comments. Hit that subscribe button if you haven't already. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Phone",
        "ROG Phone",
        "ROG",
        "glass",
        "inside",
        "phones",
        "ROG phones",
        "previous ROG phones",
        "vapor chamber",
        "gaming phones",
        "line gaming phone",
        "batteries",
        "battery",
        "chamber",
        "super",
        "vapor",
        "solid gaming phones",
        "top",
        "pretty",
        "ribbons"
    ],
    "transcript_entity_values": [
        "30 watts",
        "150,000 watts",
        "6",
        "2885 milliamp hours",
        "Asus",
        "25 megapixel",
        "Instagram",
        "the Xperia Pro",
        "two",
        "Corning",
        "100%",
        "jack",
        "ASUS",
        "three",
        "Five",
        "Two",
        "Sony",
        "ROG",
        "a ton",
        "Victus",
        "EIS",
        "this year",
        "5",
        "five",
        "6 next year",
        "60",
        "64",
        "Tesla",
        "first",
        "Asus",
        "last year",
        "Last week",
        "one billion",
        "Today",
        "3",
        "ROG",
        "13",
        "6,000",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.12393704056739807,
        0.025744441896677017,
        0.11440695822238922,
        0.0039857663214206696,
        0.07342226058244705,
        -0.1077309250831604,
        -0.001245235907845199,
        0.07032976299524307,
        -0.03859254717826843,
        0.029925474897027016,
        -0.0016770117217674851,
        0.06929357349872589,
        -0.0400753989815712,
        -0.005759409163147211,
        -0.0002051324991043657,
        -0.009762018918991089,
        0.005182687193155289,
        -0.06461668759584427,
        -0.10275410115718842,
        0.05621259659528732,
        0.02385578490793705,
        -0.004656026139855385,
        -0.0001613812055438757,
        -0.005355773959308863,
        0.04482076317071915,
        0.007242689840495586,
        0.0035471338778734207,
        -0.004582461901009083,
        -0.044773612171411514,
        -0.13003955781459808,
        0.08197492361068726,
        0.1057494655251503,
        -0.04677445814013481,
        0.029578877612948418,
        -0.03308890387415886,
        -0.015602205879986286,
        0.036502473056316376,
        -0.026264676824212074,
        -0.07217364758253098,
        -0.03262901306152344,
        -0.04039537161588669,
        0.032072801142930984,
        0.0297672338783741,
        0.013408266007900238,
        0.03273267671465874,
        -0.06877025216817856,
        0.03245800733566284,
        -0.039540182799100876,
        0.06921733170747757,
        0.03668710216879845,
        -0.0446346290409565,
        -0.003013872541487217,
        -0.045280519872903824,
        -0.005173561163246632,
        -0.13985246419906616,
        0.07518088817596436,
        -0.03249602019786835,
        -0.04991733655333519,
        0.0802193135023117,
        -0.03629728779196739,
        0.07949123531579971,
        0.03430451825261116,
        -0.0627531111240387,
        0.05569230020046234,
        -0.01527848094701767,
        0.03204496577382088,
        0.02724056877195835,
        -0.11099150031805038,
        0.0010732999071478844,
        0.09051865339279175,
        -0.009640131145715714,
        -0.0642525777220726,
        -0.03604813665151596,
        0.05017673224210739,
        -0.020968325436115265,
        0.07515007257461548,
        0.0045450301840901375,
        -0.003471678588539362,
        0.008519219234585762,
        0.06050761416554451,
        0.03858865052461624,
        -0.023434489965438843,
        0.011032193899154663,
        -0.01793135516345501,
        0.04984002932906151,
        0.03484732657670975,
        0.029968341812491417,
        0.07083379477262497,
        -0.03304138407111168,
        -0.058562830090522766,
        -0.008287613280117512,
        0.0971338227391243,
        0.0067665777169167995,
        -0.0070256623439490795,
        -0.003894147463142872,
        -0.06351425498723984,
        -0.08165573328733444,
        -0.09444741904735565,
        -0.06292369216680527,
        0.045112837105989456,
        -0.005050566978752613,
        0.020117152482271194,
        0.04886343330144882,
        -0.00040235708002001047,
        0.0550052635371685,
        -0.05529182776808739,
        -0.07119208574295044,
        0.0014488641172647476,
        -0.06921853125095367,
        -0.009358715265989304,
        -0.05342516675591469,
        0.04165022447705269,
        -0.012312629260122776,
        -0.026898568496108055,
        0.06704025715589523,
        -0.004041679669171572,
        -0.08534718304872513,
        0.05195455998182297,
        0.04308653995394707,
        0.00021064671454951167,
        0.01862340234220028,
        0.0013678920222446322,
        -0.12288219481706619,
        -0.04372882843017578,
        0.05856727436184883,
        0.04377922788262367,
        -0.032645586878061295,
        4.689203453115558e-33,
        0.03487708419561386,
        0.061484213918447495,
        0.023415038362145424,
        0.029887905344367027,
        -0.06433594226837158,
        0.026004044339060783,
        0.046752266585826874,
        0.01706716977059841,
        -0.01582666113972664,
        0.08287716656923294,
        -0.030606964603066444,
        0.009409292601048946,
        0.006770721636712551,
        -0.0567101426422596,
        0.06714636087417603,
        0.021298276260495186,
        -0.032349009066820145,
        -0.05836036428809166,
        -0.0703747421503067,
        0.03557039424777031,
        -0.015745200216770172,
        -0.0029269421938806772,
        -0.01432114653289318,
        0.03893613815307617,
        0.06104162335395813,
        0.07326211780309677,
        0.058181457221508026,
        -0.05456310138106346,
        0.039469558745622635,
        0.019601045176386833,
        -0.06483172625303268,
        -0.027367910370230675,
        0.035625357180833817,
        0.060517318546772,
        -0.07557692378759384,
        0.04303600266575813,
        -0.06381255388259888,
        -0.0827016532421112,
        -0.004299856722354889,
        -0.028109900653362274,
        -0.008460694923996925,
        0.03156638145446777,
        -0.049018461257219315,
        0.04170282185077667,
        0.026420999318361282,
        -0.02230244129896164,
        -0.06528601795434952,
        0.022577092051506042,
        -0.026671506464481354,
        -0.0021727068815380335,
        -0.020175404846668243,
        -0.049478840082883835,
        0.029780814424157143,
        0.06306778639554977,
        -0.07021259516477585,
        -0.030394762754440308,
        0.016123313456773758,
        0.01867634616792202,
        0.04282281547784805,
        0.06413573771715164,
        0.0910135880112648,
        -0.06248869746923447,
        -0.023565523326396942,
        0.06908927112817764,
        -0.0008422675309702754,
        0.04593619331717491,
        0.0025848918594419956,
        -0.021597011014819145,
        -0.042034417390823364,
        -0.002371538430452347,
        -0.0024519748985767365,
        -0.004099247511476278,
        0.03294267877936363,
        0.0018086620839312673,
        0.008663925342261791,
        0.00841715931892395,
        0.01686127856373787,
        -0.04436792805790901,
        -0.039044398814439774,
        0.008208041079342365,
        -0.06822944432497025,
        0.002886345377191901,
        0.06732697784900665,
        0.014389485120773315,
        0.015109370462596416,
        -0.015682971104979515,
        0.03318563848733902,
        -0.10845597088336945,
        0.027597684413194656,
        0.07552369683980942,
        -0.020870503038167953,
        -0.11125592887401581,
        -0.026583807542920113,
        0.01748422533273697,
        0.01944468915462494,
        -4.387233280726713e-33,
        -0.04365145042538643,
        -0.07476591318845749,
        0.027018120512366295,
        0.02776670642197132,
        -0.013801850378513336,
        -0.05558767169713974,
        0.06180278956890106,
        0.10896533727645874,
        -0.01681576296687126,
        -0.09093741327524185,
        0.029586507007479668,
        0.07048448175191879,
        0.010064546018838882,
        -0.005893681664019823,
        0.048471998423337936,
        -0.07250025868415833,
        0.04904061555862427,
        -0.09710811823606491,
        0.08934491872787476,
        0.053351350128650665,
        0.05962792783975601,
        0.08062154799699783,
        0.06255318969488144,
        0.11254327744245529,
        0.06830053776502609,
        0.017815861850976944,
        0.03426432982087135,
        -0.12038873881101608,
        0.044965025037527084,
        -0.0029092824552208185,
        0.002852782141417265,
        -0.013633064925670624,
        0.022681385278701782,
        0.07627401500940323,
        0.028442954644560814,
        0.08578958362340927,
        0.041866153478622437,
        0.04738926887512207,
        -0.007782720495015383,
        -0.09238691627979279,
        -0.011598669923841953,
        0.08264841884374619,
        0.007328094448894262,
        -0.026028836145997047,
        0.00908427033573389,
        -0.08569949865341187,
        0.023584140464663506,
        0.03298872709274292,
        -0.010113630443811417,
        -0.01848161593079567,
        0.024394502863287926,
        -0.040756382048130035,
        -0.012655900791287422,
        0.012949394062161446,
        -0.01627383939921856,
        0.023055745288729668,
        0.05109165236353874,
        -0.1283412128686905,
        -0.02069799229502678,
        0.015604761429131031,
        0.06383385509252548,
        0.06288491189479828,
        0.017864063382148743,
        -0.019879404455423355,
        -0.015622767619788647,
        -0.0026752226985991,
        0.08333839476108551,
        0.014924613758921623,
        -0.034087810665369034,
        0.005816329270601273,
        -0.0845528319478035,
        0.04364229738712311,
        0.04027358815073967,
        -0.0030489256605505943,
        0.069426029920578,
        0.07299662381410599,
        -0.10874231904745102,
        0.04358452185988426,
        -0.02738664485514164,
        0.006505280267447233,
        0.024386348202824593,
        -0.07620483636856079,
        -0.03938758000731468,
        0.03472600504755974,
        0.04029657319188118,
        -0.024724196642637253,
        0.007947462610900402,
        0.06528999656438828,
        0.027298511937260628,
        -0.01724163629114628,
        -0.09271780401468277,
        -0.02276488021016121,
        -0.04095511883497238,
        0.06465218961238861,
        0.048804886639118195,
        -4.9806878621438955e-08,
        0.0748787447810173,
        0.043590251356363297,
        -0.01688903197646141,
        -0.028604445978999138,
        0.023131774738430977,
        -0.009442091919481754,
        -0.018766330555081367,
        -0.07147495448589325,
        0.06322766840457916,
        0.009981921873986721,
        -0.06163182854652405,
        -0.04345289617776871,
        -0.0454360693693161,
        0.0434822216629982,
        -0.11723095923662186,
        0.07808542251586914,
        -0.04532318562269211,
        0.09562717378139496,
        0.02360849827528,
        0.02096521481871605,
        -0.02756599523127079,
        -0.02073254995048046,
        0.06318466365337372,
        -0.03888377547264099,
        0.07020898163318634,
        -0.009373067878186703,
        -0.08721847832202911,
        0.0033025783486664295,
        0.06443290412425995,
        -0.005562182981520891,
        0.019277574494481087,
        -0.05221987143158913,
        0.02197982370853424,
        0.02480805292725563,
        -0.06489724665880203,
        -0.028041528537869453,
        -0.010711281560361385,
        0.0011689650127664208,
        0.07041916996240616,
        0.013080677948892117,
        -0.001164172077551484,
        -0.043751299381256104,
        0.008424214087426662,
        0.0027548179496079683,
        -0.06590831279754639,
        -0.0590791255235672,
        0.05783642455935478,
        -0.13615354895591736,
        -0.04053090885281563,
        -0.013147312216460705,
        -0.05429994687438011,
        -0.03814772889018059,
        -0.08850079774856567,
        -0.056311868131160736,
        0.044281210750341415,
        -0.018878387287259102,
        0.06445186585187912,
        -0.03005572408437729,
        0.028337717056274414,
        -0.0034766080789268017,
        -0.06946133077144623,
        -0.06047675758600235,
        -0.013136099092662334,
        0.08534171432256699
    ]
}