{
    "id": "Ro971vwsgPg",
    "title": "Nothing Phone (1) Durability Test! - Here Goes Nothing...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-07-30T13:45:03Z",
    "video_url": "https://www.youtube.com/watch?v=Ro971vwsgPg",
    "category": "Howto & Style",
    "tags": [
        "Nothing phone",
        "Nothing phone 1",
        "oneplus",
        "flagship killer",
        "nothing phone review",
        "nothing phone durability",
        "nothing phone scratch test",
        "nothing phone drop test",
        "nothing phone water restance",
        "nothing phone IP rating",
        "nothing",
        "smartphone",
        "android",
        "iphone",
        "nothing phone 1 price"
    ],
    "views": 3258997,
    "likes": 100081,
    "comments_count": 2629,
    "description": "Its time for Nothing. Grab a Something Skin from dbrand for your phone here:  The Nothing Phone (1) is probably the most interesting looking phone weve gotten in a very long time. Bonus points for Nothing (1) even being in a decent midrange price point. BUT... a good price means nothing without durability. Today we durability test the new Nothing phone to see how it can stand up to the test of time. We'll do the scratch, burn and bend tests that JerryRigEverything is known for... and hopefully... fingers crossed.... 'Nothing' happens.   dbrand real glass screen protectors for your device:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.dbrand.com/shop/something",
        "https://dbrand.com/shop/nothing",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Nothing Phone. In a world of boring rectangles, Nothing is here to save us. It's got a box made of recycled fibers that opens like a pack of bubble gum. The $400 midrange nothing phone is designed to stand out and look very different...starting with the SIM card removal tool transparently unique. The USB-C charging cable is a bit more routine, but then we have the phone itself. Nothing quite prepares you for the cleanliness of seeing this thing in person. However, it won't be pristine for long. Let's get started. [Intro] I'm a huge fan of transparent phones, and while this Nothing Phone 1 might not be showing off the actual internals, it does add a lot of depth and individuality to the design. Nothing, of course, needs to make sense back here, it's all aesthetic. But you can see the textures and layers along with these subtle metal accents, like these silver torx head screws that dot the phone underneath the glass. And it looks like they're actually holding things together. We'll have to check on that for sure during the teardown. It's not all about depth and textures though, it's also luminescent, smooth, smokey strips underneath the glass turn into very brightly lit LED bars. Bright enough to make the RGB gaming phones, that cost twice as much, look like little children's nightlights. Nothing has some next level illumination. [Beeping] The lights are used for notifications and phone calls. There are supposedly 900 little LEDs underneath these diffuse strips, which is enough to catch anyone's attention. [More beeps] I've seen on other videos that the exclamation point at the bottom is supposed to show how much charge is left, but with my particular unit, I tried on 4 different chargers and was not able to get that particular feature working, even though my phone is only partially charged. That's fine though. We'll have to come back to the back in a minute. It's time for the front. Flipping this phone over makes it look like just a regular smartphone again. It does have a preinstalled plastic screen protector which is kind of them. Plastic screen protectors don't last forever, so we'll test the hardness of the screen underneath. A plastic screen would scratch at a level 2 or 3. Glass would be a 5 or 6, and sapphire would be a level 8 or 9. And as we can see, this phone does not have much wobble to it during the scratches, but we do start seeing scratches at a level 6, with deeper grooves at a level 7. Pretty normal. There is Gorilla Glass on both the front and back of the Nothing 1. This means that the front facing 6 megapixel hole punch camera will also be protected by that glass. Glass is glass though, as we know, so if you're looking for more long-term protection that's better than Nothing's preinstalled plastics, my channel's sponsor dbrand has you covered with an easy to install glass protection that's made from real glass. Link is down in the description. Where was I? Oh yeah...Nothing. As we rotate Nothing to the sides, we find that the iPhone...sorry, Nothing Phone, is made from aluminum. One hundred percent recycled aluminum to be exact. Even the large power button is made from metal. Going up to the top we have a microphone hole along with more metal. Dropping down to the left side, we get more aluminum, along with the individual metal volume buttons. The bottom is where we find our metal SIM card tray, 33 watt USB-C port, and our bottom stereo loudspeaker. The dual SIM card tray does have a red rubber ring around the opening, the phone itself is still only rated at ip53...which is basically nothing. It might be fine in the gentlest drizzles of rain, but that's about it. With how dry all the lakes are getting though, soon we won't have to worry about anything getting wet, so Nothing is just ahead of the curve. The back panel of nothing is made with smooth, clear, transparent glass. Making our way up to the dual cameras, we have a 50 megapixel wide angle, and another 50 megapixel regular camera. Both are also protected with glass. I'll leave the image quality and software analysis to other reviewers, we're just sticking to hardware. Back around to the front again with its equally proportioned bezels. The Nothing Phone is rocking a 6.5 inch, 1080p, 10 bit, 120 hertz display. And as we can tell from the 40 seconds under the heat from my lighter, it is OLED, going white, yet still mostly recovering. Now as far as security goes, it does have a face unlock feature, as well as an underscreen optical fingerprint scanner. Unfortunately though, Nothing was unable to complete my enrollment. I don't always have the best luck with optical scanners. I am remodeling a new shop, which I'll show you guys very soon, and optical fingerprint scanners just don't seem to be built for people with worn out fingerprints. I failed to scan in 2 times in a row, so that part doesn't work too good. Which brings us to the bend test. The phone is cheaper than most and prettier than most, but that doesn't mean nothin' if it can't hold up to the test of time. Bending from the front we do have some pretty concerning flex, but no damage yet. Bending from the back feels super solid. Rotating around to the front again, there's that same weird sound and some separation along the antenna line, but still nothing from the back. Listen closely, it's kind of crazy. The phone is definitely moving internally making a bunch of noise as stress is applied. And we can see that stress focusing on the antenna line, but it does lock out and stay in one piece. Rather narrowly escaping destruction. Nothing better thank their lucky ducks that it locked out, because this has probably been the closest a phone has been to breaking without actually breaking. Hopefully next year those antenna lines are fortified or it's going to get real awkward when we get Nothing Squared. If you enjoy having a unique looking phone but don't like spending lots of money, dbrand is bringing Nothing to the real world with Something, by now letting every phone look like Nothing. Aesthetically updating your current phone is always cheaper than buying a new one, so I'll leave a link down in the description so you can grab a Something Skin for your own phone. Or, even better, a grip case if you'd like Something to protect your own device. Personally, I'm not ready to upgrade my 3 year old Note 10 Plus just yet, but when I am, with seeing how unique and sustainable Nothing is attempting to be, when it does come time to upgrade I'll definitely be checking to see what Nothing has to offer. Maybe we'll have to count those 900 LEDs during the teardown video. Hit that subscribe button if you haven't already so you don't miss it. Grab a Something Skin with a link down in the description. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Phone",
        "glass",
        "back",
        "front",
        "level",
        "SIM card",
        "made",
        "metal",
        "plastic screen",
        "phones",
        "underneath",
        "SIM",
        "phone underneath",
        "screen",
        "RGB gaming phones",
        "plastic",
        "SIM card tray",
        "transparent phones",
        "time",
        "bottom"
    ],
    "transcript_entity_values": [
        "50 megapixel",
        "iPhone",
        "9",
        "6",
        "400",
        "Gorilla Glass",
        "8",
        "Instagram",
        "6 megapixel",
        "120",
        "Glass",
        "6",
        "3 year old",
        "33 watt",
        "RGB",
        "Nothing Squared",
        "4",
        "SIM",
        "the 40 seconds",
        "6.5 inch",
        "10",
        "next year",
        "5",
        "ip53",
        "The Nothing Phone",
        "The Nothing Phone",
        "3",
        "50",
        "One hundred percent",
        "one",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "LOC",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.16231216490268707,
        0.08808564394712448,
        0.07765505462884903,
        -0.0316908061504364,
        0.027082549408078194,
        -0.06232868880033493,
        0.08794096112251282,
        -0.02164340205490589,
        -0.035185132175683975,
        -0.017343834042549133,
        0.062883161008358,
        -0.023241015151143074,
        0.018539562821388245,
        0.08127755671739578,
        -0.03713415190577507,
        -0.05076785385608673,
        0.048099346458911896,
        -0.053272899240255356,
        -0.04512239992618561,
        0.09554722160100937,
        -0.0009808751055970788,
        -0.010215185582637787,
        0.011336317285895348,
        -0.056898657232522964,
        -0.0059870099648833275,
        0.04167622700333595,
        -0.029652975499629974,
        -0.027859635651111603,
        -0.052577804774045944,
        -0.06183513253927231,
        0.012154505588114262,
        0.06376489251852036,
        -0.05247494950890541,
        0.02642807736992836,
        0.0595657080411911,
        -0.0703820064663887,
        0.06836780160665512,
        0.04339787736535072,
        -0.06962412595748901,
        0.011228294111788273,
        -0.06560306251049042,
        -0.045632150024175644,
        -0.059213872998952866,
        0.00014654261758551002,
        0.021296711638569832,
        -0.024538414552807808,
        0.08697143942117691,
        -0.033771809190511703,
        -0.023196181282401085,
        -0.019552994519472122,
        -0.012499185279011726,
        0.01470278948545456,
        0.01970609650015831,
        -0.05497243255376816,
        -0.022708069533109665,
        0.021734286099672318,
        -0.04000142961740494,
        0.031515542417764664,
        0.04291295260190964,
        0.02502669207751751,
        0.020261667668819427,
        0.021351389586925507,
        -0.010658160783350468,
        0.09593091905117035,
        0.040520668029785156,
        0.028715744614601135,
        0.03112141788005829,
        -0.0755782350897789,
        0.01047102827578783,
        0.05580172687768936,
        -0.06426515430212021,
        -0.006766165606677532,
        -0.017269592732191086,
        0.0032489667646586895,
        -0.007250574417412281,
        0.03231104090809822,
        0.008792325854301453,
        -0.035472430288791656,
        -0.02101869136095047,
        0.05522865056991577,
        -0.02029469609260559,
        -0.08323101699352264,
        -0.040544651448726654,
        0.02387663535773754,
        0.016598140820860863,
        0.055743809789419174,
        0.04063905403017998,
        0.0905919298529625,
        -0.04658938944339752,
        -0.05915123224258423,
        -0.03378721699118614,
        0.11305541545152664,
        -0.05502547696232796,
        -0.005166622344404459,
        -0.027404513210058212,
        -0.0029272688552737236,
        -0.10143373161554337,
        -0.06897900253534317,
        -0.045830681920051575,
        0.067398302257061,
        -0.018056297674775124,
        -0.023605728521943092,
        0.056083794683218,
        -0.0034236814826726913,
        0.06979674100875854,
        -0.03659972548484802,
        -0.05643153935670853,
        -0.03734060004353523,
        0.003947624936699867,
        0.047752756625413895,
        -0.000935931398998946,
        -0.005989027209579945,
        -0.009726785123348236,
        0.03787977620959282,
        -0.029209336265921593,
        -0.06411373615264893,
        -0.03442881256341934,
        0.03690347075462341,
        0.08698152005672455,
        -0.003914026077836752,
        0.07232924550771713,
        4.2483628931222484e-05,
        -0.06523698568344116,
        -0.027671029791235924,
        -0.011338535696268082,
        0.057408545166254044,
        0.0021045743487775326,
        5.029245683475629e-33,
        0.09264001250267029,
        0.1406358778476715,
        0.01905098930001259,
        0.01059576217085123,
        -0.007735322695225477,
        0.0017546298913657665,
        0.053203389048576355,
        0.06962748616933823,
        -0.02307911403477192,
        0.08488733321428299,
        -0.0042425342835485935,
        0.04782639816403389,
        -0.024749990552663803,
        -0.039708904922008514,
        0.045822981745004654,
        0.03693167120218277,
        -0.015705382451415062,
        -0.09091450273990631,
        -0.02205275557935238,
        0.005680156406015158,
        -0.040581684559583664,
        0.01870245859026909,
        -0.01896979659795761,
        0.045495472848415375,
        0.07137814164161682,
        0.02289806865155697,
        0.0389116071164608,
        -0.055358994752168655,
        0.007982026785612106,
        0.010596079751849174,
        -0.1432487815618515,
        0.03773485869169235,
        0.043395522981882095,
        0.046254195272922516,
        -0.04987165704369545,
        0.06484247744083405,
        -0.06206546351313591,
        -0.07356579601764679,
        -0.0037201966624706984,
        -0.0358494371175766,
        -0.11671236157417297,
        0.025979023426771164,
        0.00047641058336012065,
        -0.04536840319633484,
        0.0360979400575161,
        -0.01573239453136921,
        -0.017100315541028976,
        0.07964558899402618,
        -0.036295220255851746,
        -0.01179607305675745,
        -0.03515646234154701,
        -0.043781742453575134,
        0.007469507399946451,
        -0.04052457585930824,
        -0.20635387301445007,
        -0.006800919305533171,
        0.02254534512758255,
        -0.0347738154232502,
        0.010891783982515335,
        0.017484575510025024,
        0.06356028467416763,
        -0.04038570448756218,
        -0.03665098920464516,
        0.014704729430377483,
        -0.02339751087129116,
        -0.0011267048539593816,
        -0.030948957428336143,
        -0.03362718224525452,
        -0.05972658842802048,
        -0.04351062700152397,
        -0.003347946098074317,
        0.03301010653376579,
        0.04493657127022743,
        -0.010320201516151428,
        0.04854593053460121,
        0.024845212697982788,
        0.0010928174015134573,
        -0.03758806735277176,
        0.008455988951027393,
        -0.026136251166462898,
        0.05781000107526779,
        -0.03909402713179588,
        0.08424022793769836,
        -0.08713715523481369,
        0.04110794514417648,
        -0.04158487543463707,
        0.009633161127567291,
        -0.08524516224861145,
        -0.008325677365064621,
        -0.016543788835406303,
        0.03563902899622917,
        -0.05006048455834389,
        -0.03947315737605095,
        -0.04504534229636192,
        0.035062164068222046,
        -6.021310753007822e-33,
        0.04296206310391426,
        -0.05159732699394226,
        0.0501273088157177,
        0.06154115870594978,
        0.04306039959192276,
        -0.06212040036916733,
        0.04979845508933067,
        0.09518174827098846,
        0.029588347300887108,
        -0.09093955159187317,
        0.02368970774114132,
        0.048877302557229996,
        0.005534910596907139,
        -0.04129260778427124,
        0.006606092676520348,
        -0.0010175021598115563,
        0.026781613007187843,
        -0.05546317622065544,
        -0.010174598544836044,
        0.057219747453927994,
        0.07279452681541443,
        0.06850197911262512,
        -0.041566841304302216,
        0.06465055793523788,
        -0.06922411918640137,
        0.00884290225803852,
        0.04573293402791023,
        -0.05451313033699989,
        0.02273280918598175,
        0.013432366773486137,
        0.03544243797659874,
        -0.045779600739479065,
        -0.00316908722743392,
        0.025797409936785698,
        0.06098867207765579,
        0.05309843644499779,
        0.11411513388156891,
        -0.03610958158969879,
        0.0016935027670115232,
        -0.09241260588169098,
        0.025179008021950722,
        0.08848148584365845,
        0.011370186693966389,
        -0.006036037113517523,
        0.008261305280029774,
        -0.0005439962260425091,
        -0.0058904532343149185,
        0.01256432943046093,
        -0.04036738723516464,
        -0.008609896525740623,
        0.008539186790585518,
        0.007906624116003513,
        -0.027707412838935852,
        0.04018821939826012,
        -0.03708955645561218,
        0.024460362270474434,
        0.06881144642829895,
        -0.08190847933292389,
        0.001344379736110568,
        0.01813737489283085,
        0.044901471585035324,
        0.08649677038192749,
        -0.04093563184142113,
        0.007393069099634886,
        -0.061165254563093185,
        0.012276923283934593,
        0.08020467311143875,
        0.07491416484117508,
        0.01329910196363926,
        -0.02153955213725567,
        -0.0057093296200037,
        0.010940885171294212,
        -0.01734863966703415,
        -0.10223496705293655,
        0.04385259374976158,
        0.04956274852156639,
        -0.08069445937871933,
        -0.02508518286049366,
        -0.0706009566783905,
        0.022623231634497643,
        0.07598415017127991,
        -0.03552134707570076,
        -0.02438579872250557,
        0.019569147378206253,
        0.1162261962890625,
        0.001399734290316701,
        0.06288371980190277,
        0.03864191845059395,
        -0.052917927503585815,
        -0.010792521759867668,
        -0.09880603104829788,
        0.06785829365253448,
        -0.06906211376190186,
        0.11509887874126434,
        0.02249128930270672,
        -5.7631527994317366e-08,
        0.055923111736774445,
        0.018031155690550804,
        -0.03230001777410507,
        -0.07168302685022354,
        -0.015461268834769726,
        -0.05796303600072861,
        0.01171971671283245,
        -0.061322860419750214,
        0.03517341986298561,
        -0.10591543465852737,
        -0.02387712150812149,
        -0.01998244971036911,
        -0.04336877539753914,
        0.048522718250751495,
        -0.041471902281045914,
        0.06803057342767715,
        -0.011166144162416458,
        0.03428962454199791,
        -0.03624684736132622,
        -0.010005949065089226,
        -0.08370719105005264,
        0.009906752035021782,
        0.026240723207592964,
        -0.04794968664646149,
        0.01587541773915291,
        0.05259471759200096,
        -0.06333701312541962,
        0.030635187402367592,
        0.10578177124261856,
        0.031158652156591415,
        -0.023805513978004456,
        -0.02561921253800392,
        -0.03709300234913826,
        0.009222918190062046,
        -0.045866746455430984,
        -0.033355895429849625,
        -0.009395048022270203,
        0.0008917604573071003,
        0.07916116714477539,
        0.011505314148962498,
        0.0004300426517147571,
        -0.07505113631486893,
        -0.007265107706189156,
        0.058645203709602356,
        -0.023658387362957,
        -0.1050543338060379,
        -0.020277220755815506,
        -0.1685679703950882,
        -0.03666277602314949,
        0.009214679710566998,
        0.025944245979189873,
        0.027741000056266785,
        -0.10446419566869736,
        -0.0178284402936697,
        0.05020418018102646,
        -0.027478139847517014,
        0.08586274087429047,
        0.016259633004665375,
        0.01553460955619812,
        0.028402533382177353,
        0.0533452108502388,
        -0.09661243855953217,
        0.013271561823785305,
        0.07802344858646393
    ]
}