{
    "id": "rof4GJ5sc44",
    "title": "FINALLY I got what I wanted - CriCut Maker 3",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-05-22T18:03:13Z",
    "video_url": "https://www.youtube.com/watch?v=rof4GJ5sc44",
    "category": "Science & Technology",
    "tags": [
        "Hobby",
        "Arts and crafts",
        "Vinyl",
        "Cutting",
        "Machine",
        "CriCut",
        "Cricut 3",
        "Maker",
        "CNC",
        "Cutter",
        "I finally always bought something I always wanted",
        "Linus isn't the only one she gets the shiny toys",
        "I splurged",
        "Money",
        "Treat yourself"
    ],
    "views": 1763503,
    "likes": 89959,
    "comments_count": 4596,
    "description": "Get 10% off all Jackery products with code LinusTechTips at   It can cut, slash, emboss, and even draw! It's not an infomercial, but it's the CriCut 3. Yvonne is really excited that she can finally buy something high-end for herself to satisfy her arts and crafts after-work hobby, maybe she'll take it even further.   Buy a Cricut Maker 3:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - It's not just Linus 0:30 - Unboxing and overview 1:42 - What it can do and extra tools 3:20 - What we made so far 4:30 - Sponsor - Jackery 5:05 - What is Cricut's design space software? 6:13 - Let's make something! 9:26 - Making stickers 13:35 - Peace offering for TechLinked 14:53 - Price 15:30 - Final thoughts",
    "description_links": [
        "https://www.jackery.com?aff=27",
        "https://geni.us/G4x8QGm",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I made these with the Cricut machine. Aren't they cute? Oh, (yelps) dropping things. It runs in the family. Today, we're gonna be unboxing the Cricut Maker 3. So, this machine here is essentially a CNC machine, but really user-friendly. And it's great for people like me who have creative vision, but don't have professional maker engineering experience. Going into our shop and trying to use the trotec laser or LightBurn, it's really intimidating. I don't want to blow up the machine or set things on fire. One thing that I love about this machine is the versatility. So the great thing about professional routers and laser cutters and things like that, is they do one thing extremely well. Whereas the Cricut does a lot of things pretty well. Surprisingly well, actually. A lot of people use this machine to make products that they sell on Etsy or in their store. This is actually the commercial-grade one. They have five or six different types of machines. And there's a list on their website where you can compare all the different ones to see which one you should choose. The reason I got the Maker 3 is because I wanted versatility. I wanted the most options possible for what I can cut and the kinds of projects I can make. And also, I wanted the newest, shiniest best one, 'cause Linus gets shiny toys all the time, so why shouldn't I get some? In the box comes the machine itself and also the power adapter to connect it to the wall, and the USB A-to-B to connect it to your computer if you didn't have Bluetooth connectivity on your computer. To note, it actually also works with phones and tablets. I usually use my laptop just because of the functionality. The mobile is great for browsing in bed for what projects I might be interested in doing next, but actually designing and working on my laptop is way easier. So the machine itself opens up like that. The machine comes with the fine-point blade already, but I got a whole bunch of different blades because I wanted to be able to cut different materials and do different things. This one here is the deep-point blade. And this one allowed me to cut leather for a scrapbook that I was making for a wedding coming up. This one here is the engraving tool. And then this one here is the deeper point blade. So, just cutting thicker materials as well. One of the things I like about the Maker 3 is that it has this quick house driving where you can actually change the tips of the blades that you got. So that one there was the engraving one and now I'm gonna put the debossing tool on. When I bought the Cricut Maker 3, I bought the essentials bundle, which actually came with all of these accessories here. So these accessories are a tool to help you flatten the materials that you're putting on the mat, if you're using the mat. Scissors, a tool to help you scrape things off your mat. We've also got tweezers. This is great for when you're working on projects that have little tiny pieces that you need to peel off to get your design. Scoring tool, so that's to help with folds that you might make, especially like this. Oh, (yelps) dropping things. It runs in the family. And then we've got this tool, another weeding tool just to help get rid of the little bits and pieces that you might have. - [Jono] What is weeding? - Weeding. So that's when you have a design and you have to remove pieces that you don't want from your design. So Sarah got $10,000 worth of Pantone color chips. Well, this is my version of all the pretty colors, (laughs) which is a pen set that I got for the Cricut because the Cricut can actually draw for you as well, on top of cutting things. - [Jono] What, really? - Yeah. Cricut says this is their commercial-grade machine. What do you think? Does it look like it's built really well? - No. - (giggles) On top of vinyl, you can cut all kinds of different materials. So I have iron-on material where the kids and I actually made a present for Linus. And so we made him PJs because his old PJs were so gross. They had a hole literally that he would put his foot through in the knee. So he would put it on and he would just rip it every time a little bit more. So we bought him PJs and I know it doesn't look the greatest, but they're supposed to be PJs and they're supposed to be things that he likes, or that the kids found that made them think of him. For example, there's his Chevy Volt, blue Chevy volt, his badminton. They like to read books with him, but that's some pretty small iron-on pieces right there. Linus calls this my Chinese knockoff. (everyone laughing) Made by me, with love. So, I actually made all of those not using this one. I made it using the Explore Air that Logistics now has. I'm still really glad I upgraded, just because I was able to do a project that I couldn't have done on the other one. - [Jono] Whoa, that's so cool. - Yeah. I made this scrapbook for a coworker's wedding upcoming and I used it to cut this design right here for them. I could have used it to cut the entire book, but because they were square edges, it didn't seem worth the time to put it in the machine to cut. It took a long time to cut this design out of here because it's so thick. Here, you can probably see how thick that leather is right there. It can cut paper too. We made this card during a craft night, me and Sarah, which is really cute. Look at that. About enough about what it can do, let's actually do something with it. But before that, let's talk about our sponsor. Thanks to Jackery for sponsoring this video. Their Explorer 1500 Portable Power Station has enough juice to keep all your devices powered and connected. It's huge 1500 wat hour capacity and 1800 wat output rate, allows up to seven devices plugged in simultaneously. It takes only four hours to recharge up from zero to 80%. Check out the Explorer 1500 at the link below and get 10% off with code LinusTechTips. Right now, we're connected to the machine using Design Space. And we're going to be drawing our pattern on here for what we wanna cut or print or whatever the case may be. So it's connected by Bluetooth right now, but you also have the option of that cable if you wanted to use it. Design Space is made by Cricut, so that's actually one thing that I'm not as huge a fan of is you're tied to their system. So if, for whatever reason, Cricut ever went away, I don't know that I would be able to use my machine still. One thing that I do like about Design Space and about the Cricut community is that there is a huge following out there. You can find all kinds of projects. You can pull images off Google, or you can actually subscribe to their service, their monthly subscription service, which gives you ready-made projects that you can do or images that are already designed for their software. I hate paying a monthly subscription, but one thing that I do like is that they have ready-to-make projects that are good to go and that look good. So if you're just sitting down and you don't want to spend a whole bunch of time designing your own thing, you can just get going. But that's also one of the things that I really love about the Cricut. If I want to, I can be really involved. I can create my own from-scratch design and import it and do it. Or I can just pick something off the shelf. I'm gonna be personalizing my laptop today 'cause I don't have anything on it right now. I got some images from Sarah for our channel logos. And what I'm gonna do is I'm gonna upload them to Design Space right now to cut on this really cool vinyl that I got. And you don't actually have to use Cricut branded stuff, there's a lot of third party people that make replacement blades or materials or card stock or whatever the case may be. So I have four different files here. Okay, we can only upload one at a time. We'll do that. And so when you upload an image, the Cricut actually needs an SVG to cut and it'll help convert it to an SVG for you. To get this to be an SVG, we have to get rid of the background. So you can see, anything that's checkered here means that I've gotten rid of that. That I don't want that cut. So I'm gonna apply and continue. And I'm just going to do a cut image right now. And we're gonna upload that. Oh no. What happened? It seems like it was asking me to update its data terms of service and now, hopefully we're working again. So, that is definitely one of the downsides to using proprietary software. Oh, wow. Sarah gave me a huge image. I don't think we're gonna cut something that big. So what do you think? Should we cut a four inch LTT logo? Something like that? Yeah and I'm gonna do some other channel ones. We're gonna do Short Circuit. - [Jono] Yeah. - That one's super fun. Right now, all of my images are black, which means that it would cut all on the same mat or piece of vinyl that we're gonna put in. So if I want to use different colors or if I want different cutting sessions, I have to change the colors of these. We're gonna do each one a different color. These colors don't necessarily mean the color that I'm actually gonna do, but it would be helpful if they were representative. Oh, well Jono, maybe you get to pick the color for Short Circuit. - Heck yeah. Ooh. - Super shiny. I love it. While Jono does that, I'm actually going to be using a mat for this project. With the Maker 3, you don't have to use a mat if you get smart vinyls. And honestly, I've seen YouTube videos where people will actually pretend that their vinyl is a smart vinyl. Like they're tricking their machine into doing it because smart vinyl costs quite a bit more. I like using my mat. Part of it is I can lay it out exactly where I want to and if I don't have a piece that is exactly 12 by 12, or 12 by whatever dimension I want, I can just put a tiny piece that I want to use on the side and it'll still cut. But if you don't use a mat, you can't just load a small piece inside. You have to load the whole width. So smart vinyl is essentially vinyl, but has a thicker backdrop so that it's more stable and it goes in without a mat and it'll just cut the top layer, but it just provides extra support for it. I'm gonna challenge dbrand, I'm gonna make my own little Cricut business. (giggles) So, this is the standard grip mat, which means it's a little bit sticky to help your project stick to it. That's exactly what you want because you don't want it to move while it's in the machine, otherwise it's not gonna cut properly. We're just gonna flatten this down so that it's sticking properly. Oh, and apparently this tool sucks because it scratched my vinyl. What the heck? - Oh no. - Yeah. I think this sheet of vinyl is 12 by 24 and they do have 12 by 24 mats, but because my design is only gonna be four by four, I'm not gonna bother doing that. We're just gonna give it a shot. We're ready to cut. Right now, we've got the base material set to the holographic vinyl. We've got the pressure set to default. We've got the tools loaded correctly. There's no tool required in A. Normally, this would be for your scoring stylus or your pen if you're drawing something. And then we've got our fine-point blade already loaded, so we're ready to load our mat. So, hopefully this works with the roll at the end. We'll see. Oh, you know what? I think the Maker 3 actually measures your mat length, so this might not work. I forgot about that. Oh no, it did it. Yay. (Jono laughing) As you can tell, I'm still learning how to use this too. Perfect. So it measured and it says it's ready to go. It's flashing the start button. So here we go. We're gonna see it cut. Every time it's cutting, I can't help but just stare at it. It's so mesmerizing. It's like those Facebook crafty videos, those five minute crafts that you're just glued to the whole time. And it's done. Can you see the design? - (gasps) It's so cool. - Yeah. Okay. So what we're gonna do is we're gonna pull it off the mat. Sometimes you might have to give it one or two tries before you actually get what you want, but I'm expecting this to work first go just because I'm using the Cricut material and I chose the right setting. - Cricut material. - Cricut material. (Jono laughing) Oh my gosh. I always do that. You're supposed to remove all the bits that you don't want, or you could just remove your design. Another thing too, is a lot of people will use transfer paper, which is this clear sticky paper where you put it on top of your design, pull the whole thing off and then stick it on something and then pull the transfer paper off. But because my design is one solid piece and it's pretty big and I'm not really worried about this piece fitting not quite right or in the right location, I'm just gonna go for it and peel it. Ooh. All right. Where should we put it? Where? Let's put it right here? - Yeah. - Do you like that, Jono? - Yeah. - I can't see, so you're guiding me here. - Whoa - Cool, hey. I'm just gonna open this and get ready to cut this one. I have lots more projects to come. I wanna make stencils for our kids' rooms so that we can cut out whatever design we want. There's all kinds of things you could do. We make kid signs using the actual lasers during a Thursday night workshop class with Colin, but I probably could do it on here if I was willing to use the, what's it called? that basa wood or basil wood? I can't remember. - Balsa wood. - Balsa, which is the thinner wood, but we ended up using quite a thick wood. And you can tell it's actually not that loud, which I really like. The laser in there is really loud. Okay, so we're gonna peel that off. And this time instead of weeding, I'm just gonna take our design right off because I think it'll do that. Transfer paper is probably not a bad idea, but I tend to be kind of just winging it with my crafts. And I wung wrong because I did tear it a little bit. (Jono gasping) But that's okay. What did I do? No. See. (Jono laughing) I should have used transfer paper. Oh my gosh. I tore it. (Jono laughing) All right, here we go. We're gonna do it again. And we're gonna do it with transfer paper this time. So what I'm gonna do is I'm gonna cut this out and then we're gonna put the transfer paper on. So yeah, it would definitely be a lot easier to just leave it on the mat like this, which is what I normally do. I'm just being bad right now. See, there we go. We cut a transfer paper approximately the same size. So we're gonna put our transfer paper on. Smooth that out. Okay and then let's peel that whole thing off. Oh, see now all the pieces I stuck on the back are left. (Jono laughing) Oh boy. See, here we go. That's how you're supposed to do it properly without ripping and having to redo your project. But you can all learn from my mistakes. And then now you get to see exactly how you wanna lay it out and it's just way easier. I'm gonna put it right there. Does that look good? - [Andy] Yeah. - Okay. Now we're gonna peel that off. There. I think part of the problem is that I didn't clean my laptop, like I said before. So here I am being lazy again when I really shouldn't. So that might be part of why you see the bubbles. I've done lots of transfers where that hasn't happened before. But yeah, it's like orange and pink. I love it. It looks amazing. I should have left it on here weeded it and then put the transfer on and then put it on. But I was not thinking straight and just pulled it off 'cause I was so eager to put it on, but don't do it that way. So I'm gonna do something sneaky. We're gonna print the Tech Link logo for Riley, but I'm gonna cut it out on the Short Circuit background. We'll see if he notices. (giggles) We're gonna do a nice bright yellow, and we'll pick a nice color pen. What color, Jono? - Blue. - Blue. Okay. So the way you load tools is you open the flap and then you take the pen, you'll hear a little click and then you close it. It's the same thing if you need to change the blade. Right now, because we're doing paper and vinyl, we can use the fine-point blade. So, we're just gonna keep that. It'll tell me I need to load a pen. It says black pen right now because I just went with the default black, but I'm gonna do whatever color pen I want. I have the blade that I need and I'm ready to load my mat. One of the things I love about the Cricut is that you don't have to be great at drawing. You don't have to be a great artist to make really nice looking stuff. So this one had nothing to do with your art ability. It was about basically folding paper, origami. The Cricut cut everything, scored everything so I knew exactly where to fold and I ended up with a really cool design piece for my kid's room. - [Jono] Oh wait. It's drawing and cutting. Oh, yeah. - Get that out of here. No. (everybody laughing) - [Yvonne] But look how well-made it is. - [Riley] That is actually kind of nice. - It's from the Cricut machine. So it can draw, it can cut. It can do all kinds of things. Price, I think, is the last thing that we haven't talked about. I spent about 450 U.S. dollars on this, but that was the essentials bundle that I got that came with those two sets of tools. Plus, it came with a bunch of materials that I didn't show you. The lower end models start at around I think 230 U.S. dollars. For a lot of people, it is expensive. I'm not gonna disagree with that. But what it is, is a hobby. And when I make things that I would've had to otherwise spend money for, like decals for my car, for our little family figures, that would've cost me 50 bucks. Yes, I'm paying for vinyl and I'm paying for the machine, but over time with all those projects that I've made, I've probably already earned back what I would've spent on that. And I have my machine now, which I can use for future projects. And everything is completely custom, which is cool or not custom, if you don't want it to be, and you just wanna take somebody else's design or subscribe to their service and use one of their designs. And homemade nowadays is incredible. I would've never thought 10 years ago that I would've been able to make a homemade this. It doesn't really look like that. I don't know that I would recommend the Maker 3 to everybody. You don't need the highest end model. In fact, most of the projects I've made so far that I've shown you, have been something that you can do on the Explore, which is a really old model. But like I said, I wanted that flexibility and that versatility to have the option available to me in the future if I do wanna do different kinds of projects. The leather one was one that I was finally able to do that I wouldn't have been able to do on the old one. Also, embossing and some of the other quick-swap tools that you can use on this machine, you don't have that option on the other ones. So, what I would recommend is just to look on the Cricut website, they have a great comparison chart that you can see. To just kind of pick and choose what you want. Whether or not I'm happy that I got the machine, absolutely. I've spent so much time doing this. A lot of people will buy coffee as their splurge or they'll go to the movies or they'll go to the casino or they'll drink or whatever. This is my splurge and my hobby. So, when you count the amount of time that I've spent tinkering and playing with it, I think it's definitely worth it. Thanks for watching my first Short Circuit. I hope you liked it. Thanks for bearing with me. If you wanna check out the product, click the link below, and if you like my hosting then let me know what you wanna see next time. And let me know if you want me to come back.",
    "transcript_keywords": [
        "Cricut",
        "cut",
        "machine",
        "design",
        "things",
        "thing",
        "Cricut Maker",
        "mat",
        "put",
        "Cricut material",
        "time",
        "Cricut machine",
        "Maker",
        "vinyl",
        "Design Space",
        "made",
        "Yeah",
        "projects",
        "paper",
        "transfer paper"
    ],
    "transcript_entity_values": [
        "3",
        "only four hours",
        "24",
        "basa wood",
        "four inch",
        "Cricut",
        "blue Chevy",
        "230 U.S. dollars",
        "One",
        "Etsy",
        "one",
        "USB",
        "Thursday",
        "zero to 80%",
        "Google",
        "night",
        "the Cricut Maker 3",
        "Today",
        "LTT",
        "about 450 U.S. dollars",
        "monthly",
        "LightBurn",
        "the Explorer 1500",
        "10 years ago",
        "Jono",
        "third",
        "Pantone",
        "1800",
        "Cricut",
        "first",
        "10,000",
        "Chinese",
        "the Explore Air that Logistics",
        "Facebook",
        "Sarah",
        "up to seven",
        "Jackery",
        "10%",
        "two",
        "Riley",
        "four",
        "five minute",
        "SVG",
        "Short Circuit",
        "CNC",
        "Linus",
        "the Cricut Maker 3",
        "Design Space",
        "12",
        "six",
        "five",
        "YouTube",
        "Colin",
        "1500",
        "50 bucks",
        "LinusTechTips",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "LAW",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.06810116767883301,
        -0.07723798602819443,
        -0.02345740795135498,
        -0.14014741778373718,
        0.10655567795038223,
        0.07414041459560394,
        -0.004724753554910421,
        0.03747032210230827,
        0.028508245944976807,
        -0.04505375400185585,
        -0.021564872935414314,
        -0.026214169338345528,
        -0.008515414781868458,
        -0.0038644522428512573,
        -0.03363921120762825,
        -0.027427734807133675,
        0.04128535836935043,
        -0.016578255221247673,
        -0.016340499743819237,
        -0.03180047869682312,
        0.046027738600969315,
        -0.054587457329034805,
        0.09386450797319412,
        0.038829904049634933,
        -0.003441706532612443,
        -0.014491617679595947,
        -0.038775596767663956,
        -0.01571553945541382,
        0.019304992631077766,
        -0.09127190709114075,
        0.012051586993038654,
        0.04257290065288544,
        0.0463896282017231,
        -0.004725252743810415,
        0.06593593209981918,
        0.015547627583146095,
        -0.024961644783616066,
        -0.0026484187692403793,
        -0.09804099053144455,
        0.02566196210682392,
        -0.04237198829650879,
        -0.0017958388198167086,
        -0.03620285168290138,
        -0.0338970310986042,
        -0.026656972244381905,
        -0.04313598573207855,
        0.02565179206430912,
        -0.04232357442378998,
        -0.034330595284700394,
        0.061682745814323425,
        -0.043977975845336914,
        -0.057482294738292694,
        -0.01932935230433941,
        -0.05046790838241577,
        -0.04413273558020592,
        -0.02367331087589264,
        -0.024573681876063347,
        -0.060609523206949234,
        0.0694350078701973,
        -0.03255268186330795,
        0.06651895493268967,
        -0.0431300550699234,
        -0.0063884626142680645,
        0.025307074189186096,
        0.01574639603495598,
        -0.0065176161006093025,
        -0.03941934555768967,
        0.10500795394182205,
        -0.04900900647044182,
        -0.0009673105087131262,
        -0.04062425345182419,
        -0.04025058448314667,
        -0.021533465012907982,
        0.06983920186758041,
        0.030269823968410492,
        -0.03309828042984009,
        0.04007382690906525,
        -0.06625522673130035,
        -0.05217479541897774,
        0.005375181790441275,
        0.0036311610601842403,
        -0.012768236920237541,
        0.0435895211994648,
        0.004017047118395567,
        -0.019673090428113937,
        0.029082780703902245,
        0.06129538640379906,
        0.0299792792648077,
        -0.02883465215563774,
        -0.0643172413110733,
        -0.1305941343307495,
        0.05186315253376961,
        0.07363110035657883,
        -0.02410764992237091,
        0.015392162837088108,
        -0.028219858184456825,
        -0.05428893491625786,
        -0.10944515466690063,
        -0.04756574705243111,
        0.07699985802173615,
        -0.0020696166902780533,
        0.04256501421332359,
        0.030778178945183754,
        -0.10296184569597244,
        -0.012469932436943054,
        -0.05183810368180275,
        0.0025798073038458824,
        0.09092925488948822,
        0.011783398687839508,
        0.05218292027711868,
        -0.0734439492225647,
        0.05843955650925636,
        -0.07788144797086716,
        -0.05185415595769882,
        0.05584403872489929,
        0.027351729571819305,
        -0.06406897306442261,
        0.02502487041056156,
        0.07274481654167175,
        -0.03501567617058754,
        0.0886659324169159,
        -0.025399615988135338,
        -0.06498025357723236,
        -0.03400819003582001,
        -0.00987222045660019,
        0.022748654708266258,
        0.018468091264367104,
        3.520058608497634e-33,
        -0.004449197091162205,
        0.06688780337572098,
        -0.03196967393159866,
        0.01564931869506836,
        0.0839875340461731,
        0.030093003064393997,
        -0.00927495677024126,
        0.10257328301668167,
        -0.0912085771560669,
        0.0068104262463748455,
        0.0276288241147995,
        -0.019008712843060493,
        -0.028865672647953033,
        0.15236511826515198,
        -0.055262498557567596,
        -0.04666838422417641,
        -0.017997782677412033,
        -0.003413153812289238,
        -0.02525867149233818,
        -0.07410701364278793,
        -0.05381612852215767,
        0.01369805820286274,
        0.017141785472631454,
        0.04546469822525978,
        -3.431235745665617e-05,
        -0.06355561316013336,
        0.037606965750455856,
        -0.04168732836842537,
        0.10127129405736923,
        0.0024159473832696676,
        -0.029796678572893143,
        -0.017581982538104057,
        0.07355813682079315,
        -0.07605033367872238,
        -0.020495086908340454,
        0.023867102339863777,
        -0.11671923100948334,
        -0.09295158833265305,
        0.022187989205121994,
        0.10593762993812561,
        0.03262383118271828,
        -0.010696645826101303,
        -0.08282600343227386,
        -0.08261053264141083,
        -0.013980822637677193,
        0.03128968924283981,
        0.09075778722763062,
        0.009056509472429752,
        0.012082618661224842,
        -0.01830979250371456,
        0.046852611005306244,
        0.07131148874759674,
        -0.007737535983324051,
        -0.0541117861866951,
        -0.013277722522616386,
        -0.05998028814792633,
        -0.003248381894081831,
        -0.05756010860204697,
        0.07134143263101578,
        -0.10298459231853485,
        0.023596590384840965,
        0.08482743799686432,
        0.09420149028301239,
        -0.040515825152397156,
        -0.06246449798345566,
        0.03617211803793907,
        0.05191880092024803,
        -0.07042151689529419,
        0.00409449590370059,
        -0.006235676351934671,
        -0.06321602314710617,
        0.06104156747460365,
        0.017866263166069984,
        -0.05270928144454956,
        0.016591979190707207,
        0.02479594387114048,
        -0.08403266966342926,
        -0.06912636011838913,
        0.045061301440000534,
        0.02774522453546524,
        -0.012547409161925316,
        -0.03915031999349594,
        0.11403889209032059,
        -0.02648698166012764,
        0.06254389882087708,
        -0.09319945424795151,
        0.007807704154402018,
        -0.05548332259058952,
        -0.06468800455331802,
        0.0026563946157693863,
        -0.013862553052604198,
        0.015768198296427727,
        -0.07940409332513809,
        0.04532454162836075,
        0.02785295806825161,
        -4.455566236707951e-33,
        0.01872395910322666,
        0.05899312347173691,
        0.021438056603074074,
        0.027642711997032166,
        0.12300173938274384,
        0.04250572621822357,
        0.026424434036016464,
        -0.015335392206907272,
        0.06694866716861725,
        -0.016713635995984077,
        -0.02528759092092514,
        -0.0842866525053978,
        -0.1205507442355156,
        -0.06881759315729141,
        -0.0011301100021228194,
        -0.032044559717178345,
        0.003345625940710306,
        -0.033261626958847046,
        -0.01178992073982954,
        -0.04649410769343376,
        0.04922753572463989,
        0.01625846140086651,
        0.02449263259768486,
        0.059502117335796356,
        -0.0006747693405486643,
        0.0556921660900116,
        0.04913772642612457,
        0.011950962245464325,
        0.029763510450720787,
        0.016500908881425858,
        0.001038511167280376,
        -0.11946907639503479,
        -0.04106498509645462,
        -0.016333123669028282,
        -0.02633492648601532,
        0.009700809605419636,
        0.031095784157514572,
        0.08850592374801636,
        -0.032440248876810074,
        -0.04194523021578789,
        0.03667672723531723,
        0.008096123114228249,
        -0.035865165293216705,
        -0.017178315669298172,
        -0.017566490918397903,
        -0.08067277818918228,
        -0.0860726535320282,
        0.01616598851978779,
        0.04298669099807739,
        0.015546957030892372,
        -0.028522556647658348,
        0.002126360544934869,
        0.06113189086318016,
        -0.016748351976275444,
        0.020174086093902588,
        0.026585545390844345,
        -0.0600273460149765,
        0.0017182753654196858,
        0.017514707520604134,
        0.056820325553417206,
        -0.022783813998103142,
        -0.02385207824409008,
        -0.06698085367679596,
        -0.03221046179533005,
        0.0852777287364006,
        -0.04560167342424393,
        0.06073177978396416,
        0.02123991772532463,
        -0.08932521194219589,
        -0.0008721266640350223,
        0.06916699558496475,
        0.07558484375476837,
        0.034234095364809036,
        -0.04578903689980507,
        0.006712125148624182,
        0.05866120755672455,
        0.013711460866034031,
        -0.02374589815735817,
        0.02381894364953041,
        -0.030035436153411865,
        -0.021981649100780487,
        -0.07055401057004929,
        0.072792187333107,
        0.03655990585684776,
        0.056038521230220795,
        0.07318592071533203,
        0.026987941935658455,
        0.014014091342687607,
        0.001555864466354251,
        0.05582296848297119,
        0.0013104041572660208,
        0.04247017577290535,
        0.06911604851484299,
        0.05408017337322235,
        0.07591025531291962,
        -6.762732596143906e-08,
        0.01085266750305891,
        -0.009041041135787964,
        -0.014091181568801403,
        -4.1313098336104304e-05,
        -0.04358905926346779,
        -0.022407524287700653,
        0.024702250957489014,
        -0.03209972009062767,
        0.06547869741916656,
        -0.06634628772735596,
        -0.015409320592880249,
        -0.07460808753967285,
        -0.010225048288702965,
        0.08479799330234528,
        -0.01246110163629055,
        -0.011840141378343105,
        0.030228551477193832,
        0.08144567906856537,
        -0.006578089669346809,
        -0.00544370012357831,
        0.01583409309387207,
        0.007547552697360516,
        0.10599324107170105,
        -0.05427305027842522,
        -0.10220262408256531,
        0.020174654200673103,
        0.022314786911010742,
        0.04612524062395096,
        0.051301151514053345,
        -0.023831050843000412,
        -0.0539531446993351,
        0.005313285160809755,
        0.011394144967198372,
        -0.009095395915210247,
        -0.021651683375239372,
        -0.11703407764434814,
        -0.07436014711856842,
        0.025801464915275574,
        -0.09509637206792831,
        0.06533678621053696,
        0.07072301208972931,
        -0.00012460882135201246,
        0.027640506625175476,
        -0.011971665546298027,
        0.05793283134698868,
        0.026020977646112442,
        0.05505923926830292,
        -0.12303589284420013,
        -0.024959158152341843,
        0.021296069025993347,
        -0.049170996993780136,
        -0.013792883604764938,
        -0.02082637883722782,
        0.06523852050304413,
        0.07224392145872116,
        -0.009043811820447445,
        0.009398013353347778,
        0.0611812099814415,
        -0.006807111669331789,
        0.029717501252889633,
        -0.06056423857808113,
        -0.050773002207279205,
        0.002441137796267867,
        0.07033772021532059
    ]
}