{
    "id": "RQzW0RT1YSg",
    "title": "My Electric Hummer has a HUGE Problem... and its all my fault.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-05-27T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=RQzW0RT1YSg",
    "category": "Howto & Style",
    "tags": [
        "Electric Hummer",
        "EV Humvee",
        "Whisper project",
        "DIY Electric hummer",
        "hummer",
        "Humvee",
        "Hmmwv",
        "jerryrig hummer",
        "cybertruck",
        "ford lightning",
        "electric truck",
        "electric conversion",
        "best electric truck",
        "ev conversion",
        "hummer ev",
        "ev humvee"
    ],
    "views": 1549030,
    "likes": 68290,
    "comments_count": 2964,
    "description": "MY EV HUMVEE BROKE AND ITS ALL MY FAULT! - Thank you to Audible for sponsoring this video! New Audible members get a 30-day free trial. Visit  or text \"jerryrig\" to 500 500 to try Audible today! Ive been noticing a weird sound coming from the back of my Electric Hummer as ive been driving around... But it was hard to tell exactly what was going on. Let me know if you can spot what happened...   Watch all the EV Humvee build videos in order HERE:    Get my HUMMER Shirt and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://audible.com/jerryrig",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Motor sounds] -[Random person] I love your videos! -[Zack] Thank you! Something terrible....Oh, we aren't even connected. Something terrible just happened. Dude, that was bad! That was so bad! So there is something catastrophically wrong with the Humvee at the moment, and I think it's time we figure out what that is. Let's get started. [Intro] -[Jacom] Don't push the gas anymore. -Why? -Oh no! Oh geez! -Dude, how did that happen? So the nut came off. -That is completely sheared off. -I'll explain the hose in a second, but dude, so we snapped that? -Yeah, it's snapped. -No way. So the reason we have all of the coolant hose back there is because we don't have the charger hooked up yet. So the coolant hoses just loop to itself and then eventually put the charger in line. But let's see if we can find that nut. Dude, what the heck? Oh, it's still hot. Ah, it's way hot. -My theory is that the splines on the yoke are too big. So it went together, cinched it with the nut and that was holding enough friction to drive. And as you drove it would slip a little bit, but when it was slipping it was tightening the nut. -Until it just cinched it right... -Until it sheared it off. -Woo! So we have taken off the yoke. We have put a strap here to support the driveshaft. Now we're going to try to limp home in front wheel drive. We are back in the garage again and we have an idea of what happened, but hopefully we can figure it out for sure. I think we need a new diff though. So I think I got it. Here we have what was connected to the current driveshaft, the current setup that we have going to the differential. And this is what was previously on the differential. If you notice there are a bunch of little tiny teeth inside of there. This particular yoke has 28 teeth, while this yoke has 29 teeth. So when it felt good on the output shaft of the differential, it wasn't actually sitting perfectly. So when the motor was spinning, it was tightening that bolt like a wrench, and yoinked it right in half. And here is the bolt that got sheared off. It is massive, both a testament to the strength of the electric motor we installed, and also the inability to count of the guy who installed it. Either way though, I do know we need a new differential, and I should probably put the correct yoke on this time so we can actually go somewhere. It's not very cost effective to be shredding the original hardware to bits every time we go for a drive. [Power tool sounds] With the Hummer back up on the lift again where it's been for the last year and a half, it's interesting that the piece that bridged the new stuff from the old stuff is the part that broke. And, of course, I do have to accept some of the blame for that since it was the wrong yoke in place, but it did feel like the right yoke. At the rate we're going, the Humvee of Theseus does seem to be an apt description of what we have going on. [Power tool sounds] As we're taking this thing out, the differential is the link between all of my new electric equipment and the previous 27 year old equipment that made up the 1995 military Humvee. I did expect it to be the weak link, however I also speedlined that failure by installing the wrong yoke. The differential is what takes the rotational force from the motor and sends it out to each of the tires. It's pretty crazy inside. It's called a torsion torque sensing differential, and what makes it different from a regular differential is the special spur gear and worm gear combination that allows for better traction off-road. It's like a naturally locking differential without actually having lockers. Dropping the differential down is pretty simple. It took us about an hour or so. We disconnected the half shafts, uncoupled the e-brake lines, pulled the brake calipers off. Brake pads look good. And finally there are 6 large bolts holding the whole housing in place. We don't need to disconnect the driveshaft of course since the electric motor already did that for us earlier. Check this out. All this dust up here on top it's definitely not from me. I only put about 20 miles on this thing before it went kablooey. So all this dust is from wherever it was previously. And as you can see, this is where the failure happened. And while it is sketchy, it's not a matter of life or death...just kind of expensive. Some mistakes, however, are a matter of life and death. I'm currently listening to an audiobook from my channel sponsor, Audible, about the early days of the space race. Back in the 1950's when the United States and the Soviet Union were trying to orbit men around the earth and put a man on the moon. Millions of little details have to perfectly align to keep people alive in space, which Gene Krantz talks about in his audiobook, 'Failure is Not an Option.' If you've liked watching this hummer project and want to hear about a much higher stakes, life or death engineering project, I'll leave a link for this free audiobook and free 30-day trial of Audible down in the description. Audible.com/JerryRig or text JerryRig to 500-500. Along with a free title, you also get access to Audible's Plus Catalog with podcasts, Audible Originals, guided fitness and meditation programs. And you'll get a free audiobook every month as you continue your subscription. I've personally been subscribed to Audible for 5 years now with no regrets. Auible.com/JerryRig or text JerryRig to 500-500. No long term commitments or contracts just how we like it. Failure is Not An Option. And huge thanks to Audible for sponsoring this video which supports the project. Out with the old, in with the new. [Ratchet sounds] Alright, now up. [Tool sounds] Another thing that might have been the issue is that when this yoke gets attached to the pinion, it needs to be a certain resistance as it's rotating. It's not a certain torque, which means that if we replace it we need to match that same turning resistance instead of matching a certain torque spec. All due to the fact that there's some kind of crush ring inside and we can't crush it more than it's already been crushed or else it breaks apart, which could have also been the issue. So if I take our little inch pound torque wrench gizmo and put it up here, we can see that it's actually 40 inch pounds worth of force for the rotation. And we will just match that rotation when we have the new yoke installed and this is what the manual is telling us to do. So right now we are replacing the yoke with a larger one that can handle larger u-joints and more torque. The one we're installing right now can handle 2200 foot pounds, which is more than what my electric motor can output so we should be pretty safe. This yoke is no joke. And here is the new one with the slots for the larger u-joint. That fits much better. [Tool sounds] Still 30's. So now with the nut tightened down, it looks like we're getting right around 49, which is a smidgen more than we had previously. So we should be good. Fingers crossed. Now with everything installed we should be right back to where we started at the beginning of the video. Let's see if it works. Alright we are in 4...we are back in two wheel drive so we should just have power coming from the rear. No weird noises yet. So we are at a construction site right now. Probably shouldn't be doing this since we've barely put this thing back together again. But there's this little pile of cement over here. It should be interesting. We're in 4-wheel drive. Should probably go into 4-low. So we are in 4-low right now. How are we looking? -That's deep. -Am I going to scrape? I'm not going to clear this? -No. -Should I turn back? -Yeah, you're not making it. -Ah man. What if we just park right here? This is a great spot. We just won't count this as the official off-road test, it'll just be a test of the emergency brake. Dude, we sank deep! Honestly I thought this surface was going to be way harder. Like, seems solid! That is a heavy truck. We're going to try one more hill just for fun. Holy smokes. -You've got like four feet to the crest. -Yeah, we're going to have to back it down. [Laughing] Woo! So let it be known that the Hummer could have done it if the terrain was a little less soft. Either way, I think we are successful in figuring out that particular issue. We still have a couple more things we have to do before we really test it off-road, like actually connect the charger and the coolant lines like you saw earlier. Didn't expect you guys to see those but here we are. If you have any questions leave them down in the comments. Huge thanks for watching this whole project. I think this is video number 20. It has been a fantastic learning experience. Super glad I did it. Don't forget to check out Failure is Not An Option from Audible down in the description. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "yoke",
        "differential",
        "Audible",
        "back",
        "put",
        "failure",
        "Dude",
        "nut",
        "motor",
        "drive",
        "torque",
        "wrong yoke",
        "electric motor",
        "Humvee",
        "thing",
        "Option",
        "electric",
        "JerryRig",
        "free",
        "audiobook"
    ],
    "transcript_entity_values": [
        "Audible Originals",
        "1950",
        "30-day",
        "Humvee",
        "Hummer",
        "6",
        "about 20 miles",
        "Instagram",
        "two",
        "20",
        "5 years",
        "Humvee",
        "40 inch pounds",
        "every month",
        "JerryRig",
        "half",
        "4",
        "Gene Krantz",
        "Theseus",
        "about an hour",
        "Millions",
        "28",
        "29",
        "the United States",
        "around 49",
        "the last year and a half",
        "second",
        "500-500",
        "1995",
        "four feet",
        "our little inch pound",
        "the previous 27 year old",
        "the Soviet Union",
        "Audible's Plus Catalog",
        "30",
        "Audible",
        "2200 foot pounds",
        "one",
        "the early days",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "FAC",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.062338199466466904,
        0.05541364103555679,
        0.057271745055913925,
        -0.07641275227069855,
        0.04092007502913475,
        -0.036451201885938644,
        0.048846472054719925,
        -0.04831264540553093,
        -0.03833213448524475,
        0.010327146388590336,
        0.05779467523097992,
        -0.06198710575699806,
        -0.004041648935526609,
        0.005456035956740379,
        -0.0441775843501091,
        -0.029625998809933662,
        0.055043552070856094,
        -0.03781415522098541,
        -0.029726793989539146,
        0.04115966707468033,
        -0.03667249530553818,
        0.04911869019269943,
        0.06733328849077225,
        -0.02513130195438862,
        -0.022842207923531532,
        0.04641164466738701,
        0.02724919095635414,
        0.04585813730955124,
        -0.08787812292575836,
        -0.13810895383358002,
        0.10649299621582031,
        -0.002407115651294589,
        0.014793011359870434,
        -0.01277534756809473,
        0.021963872015476227,
        0.042636070400476456,
        0.036447323858737946,
        0.005051561165601015,
        0.021967941895127296,
        -0.04156000539660454,
        0.05943076312541962,
        -0.08899155259132385,
        0.012247775681316853,
        -0.14743506908416748,
        -0.0935906395316124,
        -0.0027130076196044683,
        0.060787443071603775,
        -0.1294058859348297,
        0.09431617707014084,
        -0.014931905083358288,
        -0.017407353967428207,
        -0.08615383505821228,
        0.1194988265633583,
        -0.020555442199110985,
        -0.024598941206932068,
        0.004238130059093237,
        0.09523957967758179,
        -0.012802502140402794,
        0.0025595652405172586,
        -0.07710400223731995,
        -0.016322428360581398,
        0.010623644106090069,
        -0.005266886204481125,
        0.013719793409109116,
        0.004774416796863079,
        -0.06390400975942612,
        0.04732687026262283,
        -0.008615675382316113,
        -0.08940773457288742,
        0.021311063319444656,
        0.03079361468553543,
        -0.03620323911309242,
        -0.07322924584150314,
        0.005413460545241833,
        0.015614098869264126,
        0.1264546662569046,
        0.03082946129143238,
        -0.033479273319244385,
        0.028412872925400734,
        0.028137683868408203,
        -0.010191991925239563,
        -0.01718193106353283,
        -0.022881878539919853,
        -0.05042504146695137,
        -0.0026759605389088392,
        0.05183614417910576,
        0.052738431841135025,
        -0.017198514193296432,
        -0.03120693936944008,
        -0.03702767565846443,
        -0.013964214362204075,
        -0.022395102307200432,
        0.007224059198051691,
        0.07553762197494507,
        0.040748629719018936,
        -0.01599293202161789,
        -0.054774630814790726,
        -0.028273647651076317,
        0.014202927239239216,
        0.04595061019062996,
        0.0009275100892409682,
        -0.016221094876527786,
        0.010536902584135532,
        -0.10655884444713593,
        0.009118786081671715,
        -0.027854155749082565,
        -0.0645824745297432,
        0.04136462137103081,
        0.0061775860376656055,
        -0.0436246395111084,
        -0.01849304512143135,
        -0.004363885149359703,
        -0.0739738866686821,
        0.012967947870492935,
        0.06101028248667717,
        0.06893572956323624,
        -0.09644187986850739,
        0.09527529031038284,
        -0.018409160897135735,
        -0.041401296854019165,
        0.050201259553432465,
        0.0011786718387156725,
        -0.039112284779548645,
        0.041981250047683716,
        0.11194469779729843,
        0.001899662078358233,
        -0.06779205799102783,
        2.815366275568981e-33,
        -0.049221914261579514,
        0.08264248073101044,
        0.014443235471844673,
        -0.023325597867369652,
        0.009858444333076477,
        0.025306612253189087,
        -0.0434722863137722,
        0.12088293582201004,
        0.0421086922287941,
        0.06793587654829025,
        0.012685065157711506,
        0.00735646765679121,
        0.04400426521897316,
        -0.049003906548023224,
        -0.06067546829581261,
        -0.10506206005811691,
        -0.055760595947504044,
        -0.03247584030032158,
        -0.09919525682926178,
        -0.06922528147697449,
        -0.0002210144593846053,
        0.014913410879671574,
        0.07320503145456314,
        0.09550830721855164,
        0.0595715157687664,
        0.03170409053564072,
        0.08715192973613739,
        -0.06176310405135155,
        0.08017943799495697,
        0.024150749668478966,
        -0.030421970412135124,
        0.04407923296093941,
        0.09491271525621414,
        -0.025136275216937065,
        -0.033495157957077026,
        0.03379271924495697,
        -0.033738911151885986,
        -0.017358871176838875,
        -0.1160634458065033,
        -0.05168478563427925,
        -0.002586855785921216,
        -0.06566547602415085,
        -0.0840073749423027,
        -0.013425697572529316,
        -0.03916853293776512,
        -0.054990578442811966,
        -0.00037747120950371027,
        -0.05470074713230133,
        0.04621509462594986,
        0.0520157627761364,
        -0.016542211174964905,
        -0.06290106475353241,
        0.060480475425720215,
        0.028479736298322678,
        -0.043766286224126816,
        0.0033977539278566837,
        0.029350094497203827,
        -0.05672341212630272,
        0.028994180262088776,
        -0.0475703701376915,
        0.07440196722745895,
        0.020561836659908295,
        0.05965453386306763,
        -0.06424188613891602,
        -0.043489132076501846,
        0.01771281659603119,
        0.0029324591159820557,
        0.02270369790494442,
        -0.009797685779631138,
        0.05182145535945892,
        0.043792370706796646,
        0.025933487340807915,
        0.06445536762475967,
        -0.02996739372611046,
        -0.022528860718011856,
        0.042301468551158905,
        -0.10963795334100723,
        0.02115326002240181,
        0.026661664247512817,
        -0.06357452273368835,
        -0.11006882041692734,
        0.027457378804683685,
        0.04064175486564636,
        0.020773153752088547,
        0.004089646972715855,
        -0.01639178954064846,
        -0.028103183954954147,
        0.04944974184036255,
        0.00676132645457983,
        0.028561735525727272,
        0.013186679221689701,
        0.016718721017241478,
        -0.0674005001783371,
        -0.06280620396137238,
        -0.013170870020985603,
        -5.589075235396728e-33,
        0.0007453229627572,
        0.08455226570367813,
        -0.012621737085282803,
        -0.005552200134843588,
        0.05533505231142044,
        -0.02419307827949524,
        0.0915573239326477,
        0.1325148195028305,
        -0.01938888616859913,
        -0.07223280519247055,
        -0.024243293330073357,
        -0.005945880431681871,
        -0.035687949508428574,
        -0.030868414789438248,
        0.03517399728298187,
        -9.382909047417343e-05,
        -0.044734783470630646,
        -0.0163322314620018,
        0.04675426334142685,
        0.0703592523932457,
        0.008069385774433613,
        0.05622626468539238,
        0.13026294112205505,
        0.04563840478658676,
        0.010616048239171505,
        0.009520520456135273,
        -0.016698971390724182,
        -0.013066807761788368,
        0.08336932212114334,
        -0.011065413244068623,
        -0.049599871039390564,
        0.01764632947742939,
        0.030257195234298706,
        0.0020084127318114042,
        -0.003910472616553307,
        0.02185255102813244,
        -0.00950306374579668,
        0.019007880240678787,
        -0.02259557694196701,
        -0.13410189747810364,
        -0.0829533040523529,
        0.06474418193101883,
        0.02219022437930107,
        0.003053105203434825,
        -0.025347812101244926,
        -0.06367265433073044,
        -0.07037398219108582,
        -0.0067141554318368435,
        -0.014387983828783035,
        0.0657428428530693,
        -0.0023181040305644274,
        -0.018781716004014015,
        0.09740356355905533,
        -0.017058109864592552,
        -0.022071223706007004,
        0.038115885108709335,
        0.02665230818092823,
        -0.02115331031382084,
        -0.0013960133073851466,
        0.022297026589512825,
        -0.010670850053429604,
        0.05548737570643425,
        0.04842673987150192,
        -0.04840291291475296,
        -0.018876180052757263,
        -0.007390288636088371,
        0.032257143408060074,
        -0.028867142274975777,
        0.0585467666387558,
        0.002190984785556793,
        0.0442303866147995,
        0.023952379822731018,
        -0.030619924888014793,
        -0.09148487448692322,
        -0.01110844686627388,
        0.018446872010827065,
        -0.11143792420625687,
        -0.04168965667486191,
        -0.007104547694325447,
        -0.06957749277353287,
        0.006183949299156666,
        -0.011020535603165627,
        0.004395476542413235,
        0.08156464248895645,
        0.029837729409337044,
        0.0008744876831769943,
        0.034740470349788666,
        0.0052749766036868095,
        -0.015379996038973331,
        0.027646375820040703,
        -0.022524824365973473,
        0.05684930831193924,
        0.0324968658387661,
        0.10852717608213425,
        -0.02932402491569519,
        -6.611398362110776e-08,
        -0.01587941125035286,
        0.04244223237037659,
        0.017343321815133095,
        -0.028621865436434746,
        0.14462727308273315,
        -0.0303668063133955,
        0.0033280884381383657,
        0.013708231970667839,
        -0.01902538165450096,
        -0.02108483389019966,
        0.015478496439754963,
        -0.0750076025724411,
        0.05865296348929405,
        0.03862736001610756,
        -0.02168167196214199,
        -0.0287519209086895,
        -0.08449157327413559,
        0.07269228994846344,
        -0.054746758192777634,
        -0.07871580123901367,
        -0.10962022095918655,
        0.030047276988625526,
        -0.022058699280023575,
        9.881731966743246e-05,
        0.04417522996664047,
        0.044058892875909805,
        -0.04646703973412514,
        0.01073592808097601,
        -0.004133685026317835,
        -0.046487003564834595,
        -0.037563614547252655,
        0.01655247062444687,
        -0.01774200052022934,
        -0.05801209434866905,
        -0.06303858011960983,
        -0.00563921220600605,
        -0.0656953677535057,
        -0.03956640884280205,
        0.05424831807613373,
        -0.001546140294522047,
        -0.03379371762275696,
        -0.054534830152988434,
        0.029713131487369537,
        -0.0070502012968063354,
        -0.08123158663511276,
        -0.02477230131626129,
        0.006956479977816343,
        -0.1394113302230835,
        -0.0032413580920547247,
        0.08408325910568237,
        -0.04252944141626358,
        0.040280379354953766,
        -0.048116330057382584,
        0.001059316797181964,
        0.04990055412054062,
        0.028233550488948822,
        -0.04885505512356758,
        0.0005067593301646411,
        0.008803446777164936,
        -0.008007803931832314,
        0.05602235719561577,
        -0.08363223075866699,
        -0.006776916328817606,
        0.04388990253210068
    ]
}