{
    "id": "RS2WGKUezDQ",
    "title": "Mystery tech gift unboxing! What’s in the box?!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-11-07T21:57:32Z",
    "video_url": "https://www.youtube.com/watch?v=RS2WGKUezDQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "best buy",
        "best holiday gifts",
        "holiday gift guide",
        "holiday 2022",
        "holiday gift guide 2022"
    ],
    "views": 74850,
    "likes": 3379,
    "comments_count": 159,
    "description": "Thanks to @bestbuy for sponsoring this video! Check out all of the products discussed here:   Dyson - Supersonic Hair Dryer - Iron/Iron/Fuchsia:     Tru Grit - 18-lb Medicine Wallball - Black:    Ninja - Foodi 6-in-1 8-qt. 2-Basket Air Fryer with DualZone Technology - Dark Grey:    Ninja - Creami, Ice Cream Maker, 7 One-Touch Programs - Cloud Silver:    Bose - SoundLink Flex Portable Bluetooth Speaker with Waterproof/Dustproof Design - White Smoke:    Belkin - BOOSTCHARGE PRO 3 in 1 Wireless Charger with MagSafe for iPhone 14/13/12 Series Devices - White:    Osmo - Creative Starter Kit for iPad - Ages 5-10 - Drawing, Word Problems & Early Physics - STEM Toy (Osmo Base Included) - White:    LEGO Super Mario Adventures with Peach Starter Course 71403 Toy Building Kit (354 Pcs):    LEGO Super Mario Goombas Shoe Expansion Set 71404 Toy Building Kit (76 Pcs):       PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://bestbuy.7tiv.net/5bvNWn",
        "https://bestbuy.7tiv.net/LPMNjO",
        "https://bestbuy.7tiv.net/9W7YmQ",
        "https://bestbuy.7tiv.net/P0MDeq",
        "https://bestbuy.7tiv.net/5bvNWD",
        "https://bestbuy.7tiv.net/a1MXbQ",
        "https://bestbuy.7tiv.net/GjMNxB",
        "https://bestbuy.7tiv.net/15vNXB",
        "https://bestbuy.7tiv.net/ZdMAoW",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys, it's Justine, and today we are doing a really fun video. So inside of these boxes are some of the best gifts this holiday season from Best Buy. I partner with Best Buy on this video, and I'm such a huge fan of them, and I've done so many fun videos with them. This one is going to be no exception. Now, I don't know what's inside of these. Again, these are some of the best gifts for this holiday season, which I can't believe the holiday season is round the corner. So now, my friends, I'm going to blindfold myself, open these up, and see if I can guess what the gift is. I will not be using a knife blindfolded, so let's just hope that I can open these up without a knife. Okay, blindfold on, and let's get to unboxing. (upbeat music) Blindfold going on. Okay, here we go. Let's go with this. (chuckling) (whimsical music) It's got a pretty decent weight to it. If I had to guess what was in here, I have absolutely no idea. I don't know, 'cause it's not even making any sort of sound. (wrapper crinkling) That felt pretty good. That opening seemed pretty easy. This has an outer layer on it. I feel like a lot of times when I see this, it's usually some type of camera device or like, oh, a tripod. Maybe it's a tripod. Okay, there's no smell. (sniffing) It doesn't look like it feels like, I can't see anything. Okay, we've done that. What's this? This is definitely not a tripod. Oh, so there's a very long cable. (chuckling) So it is something that plugs in. What is happening down here. What the heck is this? I think I actually know what this is. (laughing) This gave it away, because I have the same thing. I have a hair dryer, and this is the diffuser part, 'cause you put this on your head like this. Is this a hair dryer? Now I'm second-guessing myself, but this is definitely it. This is definitely like a diffuser. I'm going with hair dryer, but I have no idea what type this is, because this feels so interesting. I don't know how it would actually work though. My first guess is hair dryer. (audience applauding) Oh my goodness. This has actually been, okay, I probably have makeup all over my face, but this has been on my wishlist for a very long time. This is one of the Dyson hair dryers. This is the Supersonic, magnetic styling attachments. Okay, that makes sense why I was trying to figure out how does this actually go on? You just attach it on just like so, I can't believe this is what gave it away. I had no idea what this was. I was actually gonna guess one of those like fling thrower heat guns. But this did not feel, that gave it away. It's so funny because I was planning on getting this for my sister. So Jen, I hope that you're not watching this video, because anytime she's at my house, she always asks to use my hair dryer, and she does not like my hair dryer. I'm gonna have to test this out first and see how it works. I feel like women, and men included, oftentimes need a hair dryer, and this is such a super high-quality one. I love the fact that this is magnetic. And it's small, portable, compact. I can take this to travel. This is taking hair drying to a whole new level. Okay, well, I am actually surprised at how easy that was. So I guess we carry on and hope that I do as well on the next gifts. Here we go. Gift number two. (wrapper crinkling) Now the problem is, how do I open this? I've done a lot of unboxing, so I feel like I'm pretty proficient at opening box. Oh, I thought I was proficient, until I realized that this, is this the top, maybe? Can the camera see me? Am I facing the right way? Yeah, okay. Instructions, I imagine, these are gonna do me absolutely no good. Okay, this feels like something that you plug in, okay. Is this a 3D printer? It feels like a 3D printer. That doesn't come off. Is there anything else in here? Okay, it doesn't feel like there's anything else in the box. So 3D printer, I bet, okay, that's my guess, mostly because I feel like, a lot of times, 3D printers have this very similar shape. I just don't know what brand this would be. I'm not really that familiar with 3D printer brand names. I don't know why I can't get that open though. Okay, I'm gonna vote 3D printer. (whimsical music) - [Speaker] Merry Christmas. - What is it? Oh, it's an air fryer, dual baskets. A dual basket air fryer. Oh my god, okay, here's the thing. Ever since air fryers have come out, they have been on my holiday gift guide for the past several years, mostly because the convenience of how easy it is to make food in them. Also, there's so many added health benefits because you're not actually frying your food in greases and oils. So I am such a huge air fryer fan, and obviously, Ninja is such a name brand. I absolutely love all of the Ninja products, like the Ninja blenders. And this is why I couldn't open it, because there's tape, tape on the baskets, which is probably good. I don't even know if this would've helped me guess, 'cause I still would've probably thought this was a 3D printer, 'cause I thought this is where the items would've been printed and you would've taken them out. Yeah, definitely, I'm gonna stick with my 3D printer guess, but this is pretty awesome. So we can air fry 400 degrees Fahrenheit for 28 minutes. You can roast 360 degrees at 18 minutes. And actually, that is pretty cool, because this has the Dual Zone Technology. You'll be able to use different temperatures and different times for each one. So you can make a bunch of different things. Eight quart capacity, six customizable cooking functions. They're air broiling salmon. Oh boy, this is super exciting. Now why I think this is a really great gift is I feel like household items like this are incredible for pretty much anyone. Whether you are a college student, you're a parent, you're a grandmother, this is something I feel like can run all of the age levels. Maybe not like a five-year-old child. I don't know if you should be getting them an air fryer. But they can definitely benefit from the air fryer from their parents or their caretakers. So this is definitely an incredible gift for the next foreseeable future, adding air fryers to my holiday gift guides. Onto the next one, definitely not a 3D printer. (wrapper crinkling) Maybe this tiny one, and then maybe we'll do the bag later. (whimsical music) Okay, this is pretty small, but it has a decent weight to it. Doesn't really make a sound. Oh, this just opened right up. No smell, seems to be in some sort of a plastic bag. (wrapper crinkling) Now it has a smell. Okay, so it's hanging, something that hangs, like a cheese grater. (laughing) Seems like we have a cable, and I can, in fact, tell you that this is a USB-C cable. I feel buttons, okay, there's a bunch of buttons on top. Maybe it's a light. Oh, like one of those emergency lights that you take camping? I don't see any light through my head, through my headband. I mean, I'm gonna go with either a camping light or a speaker. Oh my god, it is a speaker. (laughing) It's one of the Bose speakers. So this is the SoundLink Flex by Bose. I always love putting speakers on my holiday wishlist, especially small, portable ones like this, because even though these are super small, a lot of these are really powerful. You could pretty much have an entire party, and this could be your entire music source right here in the palm of your hands. I also like that it has this little handle right here. 'Cause I thought this was like one of those emergency portable lights that you would take with you when you go camping. But you could actually also take this with you when you go camping because it is battery-powered and does charge with USB. Okay, yes, it was USB-C, I was right. It does connect with Bluetooth. So, basically, you can connect your computer, you can connect to your phone, you can connect anything that is Bluetooth-compatible to this. So this is definitely something that I think is a really great holiday gift for pretty much anyone of any age. Okay, what next? These two bags apparently go together. I guess I'll just open them both at the same time. Okay, something that works together. (wrapper crinkling) That sounds like cereal. Is this like a little cereal kit? (upbeat music) (wrapper crinkling) A tool kit? That has kind of a familiar sound to it? Something maybe that's not cereal and not edible. This is not even fair, like, to give a Lego fanatic a box of Lego, and be like, \"Oh, I wonder if you can guess what this is.\" Geez, I don't know. Oh, but now, here's the thing, which Lego set is it. That I don't know. A hundred percent certainty, and if I'm wrong, you guys can have, I will give my YouTube channel away. Well, oh my god, it's the Lego Mario Set. And this is the Princess Peach one. Okay, okay, okay. This is actually super exciting, because I not only am a huge Lego fan, but I'm a huge Lego Mario fan, and I have almost all of these sets, and this is actually one that I don't have yet. So to get all of these Lego Mario kits to work together, you need a starter kit. So this is one of the starter kits, this is the Princess Peach. So this works with all of the expansion sets, and there's different starter kits. So there's a Mario, there's Luigi, and now they have the Princess Peach. And this is one of the Little Goomba accessories. So all of these accessories and expansion kits can all work together. But like I said, you need the starter kit. So this is an incredible gift for not only somebody who is a Lego fan, but he is a Mario fan, and maybe even for someone who has never got into the whole Lego ecosystem. This definitely has just moved to the top of my gift guide list, without a doubt. Where do we even go from here? So it has a bounce. (wrapper crinkling) My guess, without opening it, is some sort of lumbar support pillow, I dunno. (upbeat music) (wrapper crinkling) Oh, it's rolling away. (chuckling) Come back. I don't wanna take off something that actually was the item. Where are you going? I don't think this is a pillow any longer, 'cause it's definitely not very comfortable. Not comfortable. Has a very industrial smell to it. So what is, maybe a punching bag? What's this? Oh, it does have a hang. This little hang. I'm gonna go with a punching bag. Oh geez, wow. Okay, I'm gonna go with a punching bag, because it has this hanging thing, it has the consistency, the feel. Well, we already know from my last video that I have the ability to hang something from the ceiling. So we're set in that capacity. Okay, punching- Oh, it's one of the medicine balls. This is a great gift for any fitness fanatic. I actually use these all the time at my gym. So these are like the wall medicine balls. So you can actually take these inside, outside. I'm having like traumatic flashbacks to my trainer always making me take these and just repeatedly throw it against the wall. This is an 18-pound one. I think, normally, I would go a little bit lighter, but I feel like this is something that I'm gonna have to work up to. To the gym you go! We just went from an air fryer, to a speaker, to Lego, to a medicine ball. What's gonna be next? I have no idea. (wrapper crinkling) Oh, it's already opening, it's opening up as we tear off the packaging. Okay, so this feels like a piece of art, some sort of art, something for gaming, like a headphones stand maybe. Okay, so plugs in, maybe a light. Oh, oh, we just peeled something off, okay. Interesting, I have no idea. Oh my gosh, (laughing) this is actually really terrible. But I have this, this is one of the things that I use to charge my Apple watch. Oh my gosh. Now I'm sad that I didn't guess this, but this is honestly one of my favorite chargers. I use a couple throughout the studio and in my bedroom. But why I love this one so much is the fact that you do have three areas to charge. You can charge your phone, your Apple Watch, and your AirPods all in one go. So this is definitely a great gift to get anyone who has multiple items that they may need to charge on the daily, whether it's their Apple Watch or their iPhone or their AirPods, which is why I would definitely suggest this for any iPhone fanatic, because this has all of the things that they would need to charge. This is definitely high on the gift list. Blindfold going on here. (whimsical music) Well, we go. (wrapper crinkling) Doesn't sound like anything that I'm familiar with. (Justine vocalizing) I'm doing this because I don't wanna rub my hand along something and get a paper cut. Okay, that smells like plastic. I have no idea what this is. Unboxing tech blindfold, it's a little nerve-wracking, 'cause I don't wanna hurt myself. Okay, so Lisa, I know this is the right way. (wrapper crinkling) We've got a cable, we have a cord, this is something we plug in, something we plug in. (wrapper crinkling) Lots of plastic. It's a coffee maker, 'cause the coffee maker would go down here, and then the coffee comes outta here. Can be like in here. 'Cause maybe there's like another, I have a small coffee pot, maybe it's like one of those like one-serve. I'm going with coffee maker. Ice cream, sorbet, light ice cream, smoothie bowl, gelato milkshake. Okay, this is absolutely not a coffee maker, also that I don't think comes off at all. (chuckling) Okay, this is by Ninja. This is the Ninja CREAMi. You can make indulgent, low-sugar, keto, dairy-free, and vegan ice cream. I mean, you can make so many different things, even the smoothie bowl, that's something that I'm very interested in. This could actually save me so much money, because I have a lot of fruits that I have leftover sometimes from the farmer's market, but I also buy premade acai bowls, and those can actually add up quite a bit, so to be able to be able to customize my own ingredients. And if I wanna make it low-sugar, keto, or do dairy-free or vegan, you basically can make this whatever you want. And the fact that you can make your own ice cream, I'm kind of an ice cream addict. So this is super exciting, and I cannot wait to try this out. If any of you have one of these, please send me some recipes, 'cause I would love to hear it. Definitely feel like this is a great gift for almost pretty much anyone as well. I don't think that you can find a person who doesn't like ice cream, but I feel like you may be able to find some people who like ice cream but may have a dairy intolerance, who may be vegan, or who may need special needs for their ice cream. So you could actually make that, and I'm so hyped up about it. So this is going to be so much fun to test out. I think this is it. This was our last gift of our holiday gift guide. I do feel like I should get some bonus points, because this kind of feels like it would be a coffee maker, although I almost completely ripped this top off, which I don't think it's actually removable. (chuckling) So good thing I didn't continue to try to pry that open to figure out where the coffee beans go. Thank you, guys, so much for watching this video. And again, a huge thank you to Best Buy for sponsoring this video. I had the best time trying to guess some of these gifts, and it looks like I got three correct. I got the hair dryer, the speaker, and the Lego set. Now, granted I couldn't name the Lego set, but I think that that's okay. Let's just give me a pass there. All of the links will be in the description if you wanna get more details about each product. I'll see you guys in my next video. Thank you again for watching. If you haven't already, please subscribe and hit the bell to be notified when I post a new video, and leave me some comments below what gift is on your wishlist this year. I'll see you later, bye. (Justine grunting) (upbeat music)",
    "transcript_keywords": [
        "Lego",
        "gift",
        "feel",
        "hair dryer",
        "Lego Mario",
        "guess",
        "pretty",
        "hair",
        "Lego set",
        "air",
        "Ice cream",
        "holiday gift",
        "air fryer",
        "feels",
        "dryer",
        "make",
        "Lego Mario Set",
        "printer",
        "great gift",
        "holiday"
    ],
    "transcript_entity_values": [
        "AirPods",
        "second",
        "one",
        "USB-C",
        "A hundred percent",
        "Ninja",
        "400 degrees Fahrenheit",
        "Bose",
        "Apple",
        "this holiday season",
        "Justine",
        "Eight quart",
        "Blindfold",
        "Luigi",
        "iPhone",
        "three",
        "Lego Mario",
        "18-pound",
        "360 degrees",
        "Dyson",
        "Supersonic",
        "Bluetooth",
        "the Princess Peach",
        "YouTube",
        "Lego",
        "18 minutes",
        "five-year-old",
        "Jen",
        "the holiday season",
        "Mario",
        "six",
        "today",
        "this year",
        "two",
        "28 minutes",
        "the past several years",
        "Best Buy",
        "first",
        "Christmas",
        "Ninja",
        "the Dual Zone Technology",
        "Apple Watch",
        "USB",
        "Lisa"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.15091858804225922,
        0.020778683945536613,
        0.04472000151872635,
        -0.009330895729362965,
        0.04809527471661568,
        0.020996296778321266,
        0.06650585681200027,
        0.02162175253033638,
        -0.0724128857254982,
        0.007691564038395882,
        0.05355718731880188,
        -0.018559057265520096,
        0.0010327377822250128,
        -0.022419249638915062,
        -0.0096944160759449,
        0.03261240944266319,
        0.05004708468914032,
        -0.07362797111272812,
        -0.03655971214175224,
        -0.024681683629751205,
        -0.01901973783969879,
        -0.004831536207348108,
        0.06026538461446762,
        0.0027713782619684935,
        -0.0480533130466938,
        0.08774054795503616,
        0.018847491592168808,
        -0.03185581415891647,
        -0.08214259147644043,
        -0.11240130662918091,
        -0.004075924400240183,
        0.03738467022776604,
        0.021748431026935577,
        0.006644438486546278,
        0.026721952483057976,
        -0.0893024280667305,
        0.09449544548988342,
        0.007559682708233595,
        -0.050157953053712845,
        -0.08965732157230377,
        -0.059022773057222366,
        -0.09164922684431076,
        -0.016022764146327972,
        0.0612211637198925,
        0.014209123328328133,
        -0.01523663755506277,
        0.016807494685053825,
        -0.09766419976949692,
        -0.021201469004154205,
        0.03537527844309807,
        -0.002561665140092373,
        -0.05628754198551178,
        0.018193978816270828,
        0.05148008465766907,
        0.03268718346953392,
        0.011631498113274574,
        -0.012664122506976128,
        -0.01929730921983719,
        0.04603506252169609,
        -0.044252581894397736,
        -0.008048162795603275,
        -0.04481882601976395,
        -0.02063446305692196,
        -0.004988450091332197,
        0.0071846358478069305,
        -0.07136479765176773,
        -0.05237816646695137,
        0.04272415488958359,
        0.019609468057751656,
        -0.05108312889933586,
        0.0028530170675367117,
        0.03139321133494377,
        0.06252526491880417,
        0.08760190010070801,
        0.0693727359175682,
        0.05301976576447487,
        0.05784071609377861,
        -0.016910269856452942,
        -0.017699597403407097,
        0.05867813527584076,
        -0.02646384760737419,
        -0.04601167514920235,
        -0.037031203508377075,
        -0.008659016340970993,
        -0.00535903126001358,
        0.04957259073853493,
        -0.005130113568156958,
        0.018162013962864876,
        -0.09497945010662079,
        -0.029844146221876144,
        -0.05056892707943916,
        -0.00011282851482974365,
        0.0405544675886631,
        0.005780747625976801,
        -0.021029625087976456,
        -0.008126010186970234,
        -0.06704473495483398,
        -0.06538419425487518,
        -0.05634094402194023,
        0.03066396899521351,
        0.033750273287296295,
        -0.02205890417098999,
        0.0978768989443779,
        -0.05400030314922333,
        0.03863600268959999,
        -0.116111159324646,
        -0.07039244472980499,
        -0.029391586780548096,
        0.08341439068317413,
        0.05719953775405884,
        -0.04483237862586975,
        -0.04802277684211731,
        -0.06865908205509186,
        -0.04472075030207634,
        -0.03425907716155052,
        0.007327130995690823,
        -0.04884346202015877,
        0.10987904667854309,
        0.09880949556827545,
        0.011626068502664566,
        0.07355298101902008,
        0.00984219741076231,
        0.019111303612589836,
        -0.02578410692512989,
        -0.037416715174913406,
        -0.0038468155544251204,
        -0.06966130435466766,
        7.566765869470516e-33,
        0.016980327665805817,
        0.07381168007850647,
        -0.04270889237523079,
        0.04958814010024071,
        0.046346019953489304,
        -0.022185644134879112,
        6.521130126202479e-05,
        0.04838411137461662,
        -0.042908500880002975,
        0.07970315217971802,
        -0.07053760439157486,
        0.12916573882102966,
        -0.06327445060014725,
        0.06980495154857635,
        0.03441736847162247,
        -0.10848617553710938,
        -0.09069594740867615,
        -0.055582985281944275,
        0.02216452732682228,
        -0.005031158681958914,
        -0.01725407876074314,
        0.03174261003732681,
        0.023742442950606346,
        0.07353120297193527,
        0.047331325709819794,
        0.0512283518910408,
        0.049009665846824646,
        0.01808895915746689,
        0.0198211669921875,
        0.007590688765048981,
        -0.07248666882514954,
        -0.0010186064755544066,
        0.05866168439388275,
        -0.062197133898735046,
        -0.05818772315979004,
        -0.012681050226092339,
        -0.02086408995091915,
        -0.13740606606006622,
        0.028037291020154953,
        -0.001796176889911294,
        -0.03706415370106697,
        -0.0814572349190712,
        -0.07931294292211533,
        0.040851444005966187,
        0.05064745619893074,
        -0.021660782396793365,
        0.06941690295934677,
        -0.01598615199327469,
        0.00826213601976633,
        0.024691954255104065,
        -0.11271614581346512,
        -0.0762162059545517,
        0.009156066924333572,
        -0.014506998471915722,
        -0.06651873141527176,
        -0.0918586328625679,
        0.03256162628531456,
        -0.01255034189671278,
        0.07865975052118301,
        -0.0038825953379273415,
        0.05568598955869675,
        0.04870958998799324,
        0.023663369938731194,
        -0.029712354764342308,
        -0.06389012932777405,
        0.05588690936565399,
        0.036563239991664886,
        -0.001040352857671678,
        -0.033306024968624115,
        0.056328482925891876,
        -0.0506892092525959,
        0.03893711790442467,
        0.014957870356738567,
        -0.04806429520249367,
        0.007132534869015217,
        0.02738899365067482,
        -0.030581999570131302,
        -0.02084624581038952,
        -0.016482941806316376,
        -0.08243074268102646,
        -0.029849130660295486,
        0.038315530866384506,
        0.022296616807579994,
        0.12315978109836578,
        -0.041965726763010025,
        -0.012258642353117466,
        -0.030637644231319427,
        -0.011716348119080067,
        -0.024276629090309143,
        0.020859558135271072,
        -0.0038274002727121115,
        -0.04136800765991211,
        0.001066527096554637,
        0.006990643218159676,
        -0.015851126983761787,
        -8.9032493144257e-33,
        0.024429209530353546,
        -0.02295665629208088,
        -0.013366258703172207,
        0.03023398667573929,
        0.12349332869052887,
        0.01646268367767334,
        0.023247549310326576,
        0.012148076668381691,
        0.06438029557466507,
        -0.024197913706302643,
        -0.027842804789543152,
        0.050621673464775085,
        0.01613706164062023,
        -0.00858308281749487,
        0.025371218100190163,
        0.06251126527786255,
        -0.05494382977485657,
        -0.01579376868903637,
        0.1092681735754013,
        -0.02304396778345108,
        0.035490356385707855,
        0.11688647419214249,
        -0.04334834963083267,
        0.009835464879870415,
        -0.051313068717718124,
        0.02720697782933712,
        0.019740544259548187,
        -0.04559185355901718,
        0.04202334210276604,
        0.08700311928987503,
        0.0027922517620027065,
        -0.05211438238620758,
        0.09305324405431747,
        0.027257729321718216,
        0.016256183385849,
        -0.027313940227031708,
        0.04995736852288246,
        -0.0068593500182032585,
        0.027175772935152054,
        -0.06830938905477524,
        0.020141344517469406,
        -0.007851915434002876,
        0.00046586975804530084,
        0.06476255506277084,
        0.004073773510754108,
        -0.05247505381703377,
        -0.10569232702255249,
        0.0011835213517770171,
        0.03562502935528755,
        0.06256332993507385,
        -0.011134104803204536,
        -0.0108047379180789,
        -0.042258162051439285,
        -0.03524317592382431,
        -0.1081487312912941,
        0.046812985092401505,
        -0.03974727541208267,
        0.03610420972108841,
        0.06575113534927368,
        0.06339962780475616,
        0.03605123236775398,
        -0.04010675102472305,
        -0.01092731487005949,
        -0.017605215311050415,
        -0.04246693477034569,
        -0.013525266200304031,
        0.10236803442239761,
        0.026668496429920197,
        0.021391863003373146,
        -0.0629085972905159,
        -0.03901064023375511,
        0.05200536176562309,
        0.005274509079754353,
        -0.0863385871052742,
        0.020090894773602486,
        0.023595161736011505,
        -0.01784266158938408,
        -0.003397366264835,
        0.031580425798892975,
        0.004595810081809759,
        -0.04237740486860275,
        0.07366150617599487,
        0.05381402373313904,
        0.055835798382759094,
        0.044252194464206696,
        -0.035604123026132584,
        0.0316842757165432,
        0.04059223458170891,
        -0.006326695438474417,
        -0.005533162038773298,
        0.011924847960472107,
        0.05875697731971741,
        0.021265972405672073,
        0.10394670814275742,
        -0.03644074127078056,
        -6.277350195205145e-08,
        0.06119697913527489,
        0.03055006079375744,
        -0.05727043002843857,
        -0.036288272589445114,
        0.04972531646490097,
        -0.05568431317806244,
        -0.0170300230383873,
        0.00796528346836567,
        0.002138786017894745,
        -0.0005163817550055683,
        0.003990507684648037,
        0.0012552838306874037,
        -0.10222926735877991,
        0.004337240010499954,
        0.0716920867562294,
        0.06329823285341263,
        -0.08444873243570328,
        0.11957573890686035,
        -0.03475192189216614,
        -0.0006210634601302445,
        0.037784140557050705,
        0.049248501658439636,
        0.050529155880212784,
        -0.03468817472457886,
        -0.05643615126609802,
        0.003127079689875245,
        -0.03412792086601257,
        -0.018618719652295113,
        0.08693823218345642,
        0.020718315616250038,
        -0.05449867248535156,
        -0.025905728340148926,
        0.0004702824226114899,
        -0.047062695026397705,
        -0.029156044125556946,
        -0.06913856416940689,
        -0.07374675571918488,
        -0.0530535914003849,
        0.019571509212255478,
        0.003842998994514346,
        0.04364218935370445,
        -0.18082664906978607,
        -0.08815358579158783,
        -0.001170603558421135,
        -0.075053870677948,
        -0.08138246834278107,
        -0.0723559781908989,
        -0.09019079059362411,
        -0.06131754815578461,
        0.08626381307840347,
        -0.04264924302697182,
        0.020325155928730965,
        -0.027106335386633873,
        -0.030882282182574272,
        0.045464761555194855,
        0.05106279253959656,
        0.004326718393713236,
        -0.029717817902565002,
        0.028143133968114853,
        0.002727727871388197,
        0.03525435924530029,
        -0.037001270800828934,
        0.008959227241575718,
        0.06159990653395653
    ]
}