{
    "id": "rSFNpJJeo4c",
    "title": "Google Pixel 3 and 3 XL review: the best camera gets a better phone",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-15T16:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=rSFNpJJeo4c",
    "category": "Science & Technology",
    "tags": [
        "pixel 3",
        "pixel 3 xl",
        "google",
        "google pixel",
        "google pixel 3",
        "pixel",
        "google pixel 3 xl",
        "smartphone",
        "pixel 3 camera",
        "pixel 2",
        "google pixel 2",
        "pixel 3 unboxing",
        "features",
        "review",
        "android",
        "phone review",
        "pixel 3 xl unboxing",
        "made by google",
        "google android",
        "pixel 3 xl rumors",
        "google event",
        "event",
        "keynote",
        "pixel 3 launch",
        "pre order",
        "android p",
        "is it worth it",
        "google phone",
        "the verge",
        "android pie",
        "technology",
        "gadgets",
        "apple",
        "iphone",
        "apple iphone",
        "tech",
        "latest updates",
        "mkbhd",
        "verge"
    ],
    "views": 965642,
    "likes": 22999,
    "comments_count": 2474,
    "description": "Google unveiled the new Pixel 3 and Pixel 3 XL, their new flagship Android phones. This time, these phones are back with better screens, better cameras, and a big old notch on the Pixel 3 XL. But, can these phones beat the iPhone XS camera? Dieter Bohn reviews the phones to find out.  Subscribe:   Here's a link to buy Google's new flagship Android phones:  Google Pixel 3:  Google Pixel 3 XL:   Note: we sometimes place affiliate links directly to the best deals in our video descriptions, so we may earn a commission if you buy something.  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://fave.co/2S3rIuT",
        "https://fave.co/2BCsU2L",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - Here we go. It's the Pixel 3 and the Pixel 3 XL. These might be the most leaked phones in history but nothing can replace actually using the things for a week which I have and I can tell you right up front that they're great and the resolve a lot of the small complaints that people have had about the Pixel 2. There's a lot to talk about here. There's two sizes, a camera that has to live up to last year's Pixel 2. There's a big notch on the Pixel 3. There's the screens, there's wireless charging and there's price for what feels like a pretty small update compared to last year there's a surprising amount of stuff to get into, so let's get into it. First I wanna talk about what might be the most important improvement on the Pixel 3. The one that's gonna have the biggest impact on your daily experience with it and that is the screen. The screen on both the Pixel 3 and the Pixel 3 XL are massive improvements over last year's phones. We're still looking at OLEDs here but they're bigger on both phones and simply the biggest most important change is the color quality and the brightness, especially on the Pixel 3 XL. Last year's Pixel 2 XL felt like you were looking at colors through, like, parchment paper but that problem is 100% gone now. The screen is brighter, the reds are redder and everything just pops more. It's not Samsung levels of color saturation or iPhone Xs levels of brightness and contrast but it's finally where it should be for a phone that can cost as much as $1000. The smaller Pixel 3 it also has a great screen but it's not as dramatic an improvement since the smaller Pixel 2 wasn't so bad. Then there's the notch on the Pixel 3 XL. Yes, it's big, like super big and because it's so tall it makes the whole screen look sort of doofy. Doofier than it looks on the iPhone X and also it looks like a face? Okay, I'm sorry I'm not really gonna make you have this thing on the video but I will tell you that it does sort of go away when you use the phone and it does look much less annoying in person than it does in photos but anyway, the game, the whole game here is just this, did Google justify the notch with the features that you get for it? So let's just go through what you get. First you get more screen, but that doesn't necessarily mean that you get more information. In fact if you look at the status bar you'll see that you have to turn off the battery percentage in order to see all the status icons and with the time on the other side you can only see two notification icons. Second, front facing speakers. Google really, really believes in stereo front facing speakers. Two speakers means that this phone also has a pretty big chin and it's generally not very symmetrical, which I don't like. Now, Google claims that it's speakers are 40% louder this year and I don't know that they're 40% louder but I will say that they're 40% better. There's much less distortion at high volume. Third, you get a wide angle selfie camera. Yes, look don't worry, we're gonna talk a lot more about cameras later but my basic attitude about that wide angle camera is kinda, shrug. So, did Google justify the notch? Sorta, face ID to me seems like a much better justification but after using the Pixel 3 XL for just a little bit I didn't notice the notch too much and I really don't think it's a reason to not get the big phone if you want the big phone because once again the screen on these phones are great. This year the build quality and just overall feel of the Pixel is just really top notch. I mean, okay it's really good. Switching the back to glass gives you wireless charging. Sure, but it also just makes the whole thing feel more refined. The seams around the aluminum rail are minimal and the rear glass has this etched matte finish that just feels awesome, although the glass does make it feel a tad heavier. I've said a lot of nice things about this matte glass but there is one very serious problem, stick this thing in your pocket with keys and it's gonna get scuffed, if not scratched right away. It happened to two of our phones, we weren't rubbing the keys or anything it just happened. You are absolutely going to need a case with this thing. There are a ton of other just really nice subtle touches. Like the haptics, they're way better now. It's not quite as good as the iPhone but the vibration is a lot subtler. Instead of feeling like you've got a hand buzzer or something. Now, in terms of overall hardware quality the Pixel 3, the small one is a bigger change. It's finally really great now instead of feeling like the cheap little step brother to the larger Pixel. Neither model is quite as nice as say a Galaxy S9 but at least Google's in the ballpark now and yes there is no headphone jack and even though that's the way things go now I still think it's a pain but the good news is Google's finally including USB headphones in the box, heck they even work with the USB ports on my Mac. Wouldn't it be nice if everything was USBC? Okay, we can't got there. That's a whole other video. Let's move on because I know what you've really been waiting for. You've been waiting to hear about the camera. Let's do it. (upbeat music) The first thing to know is that when it comes to hardware specs Google didn't significantly change the equation on the rear camera, it's still a 12.2 megapixel sensor and there's still just one of them. Honestly, it's pretty much the same as last year but that doesn't mean that the pictures are the same. Google's made a bunch of software updates to improve how the photos come out. Google's still doing its HGR plus thing where it takes a bunch of photos and then computationally combines them into a single better image, but over the past year the company's just gotten better at it and better at using the dedicated pixel visual core image processing chip and it's using all of those images to create a whole bunch of new camera features. Here's the thing. We've seen lots of companies announce lots of weird camera features for smart phones and almost all of them end up being gimmicks that you just try once and then you ignore forever after. So the big question for the Pixel is whether these new features are just gimmicks or if they'll be something you'll actually use. Top shot, it uses machine learning to detect blinks and bad photos and will suggest better ones from your bursts or you can choose one later if you want to. It works pretty well in my testing and even though we've seen this feature on other cameras before I think Google does a better job of recognizing good shots. Motion auto focus it works super well on both photo and video, it tracks your subject and keeps a focus on them. We didn't shoot a ton of video but I will say as far as video goes I do think the new stereo mics are better now than that awful mic that was on the Pixel 2. Next is super res zoom. From a technical perspective it's wild. Google uses your handshake to grab extra data when you're zoomed in. They claim you don't even need a telephoto lens and I don't think it's quite as good as a proper telephoto lens. It's better than the digital zoom on the Pixel 2 for sure but it will get you something usable where before it was garbage, and usable doesn't mean great. Another feature's called, night sight and it seems technically impressive creating photos in the dark that you'd never get otherwise but we can't test it until it comes out later this year. Then there's all the stuff that I think is kind of in that gimmick zone. Photo booth is basically a party game. You turn the mode on and then you and your friends watch a progress bar expand and depending on whether or not you're smiling it will take a picture. Playground is just more AR stickers. And then there's Google lens. It is super cool to copy text directly out of an image but I do not plan on doing my shopping by pointing my camera at things. And then lastly the one everyone's excited about is group selfie feature. Well, it does let you get more people into a selfie when you zoom out but you also end up with a bunch of weird distortion from the wide angle lens and that's unavoidable but for me I think of this as just another for fun feature. Some of these features you're gonna use and some you won't, but a lot of them are just built in instead of being in special modes so I think most of these count as improvements that really will matter to you. But the real question, the obvious question, are the photos better than they were in the Pixel 2 which had already beaten the iPhone Xs? My answer is yes, but that they also have a different style. What do I mean? Well, it's easiest to just look at some photos so here's three photos all lined up. What do we see here? First, we see the Pixel 3 is doing a better job than the Pixel 2 of getting detail out of the shadows. But you can also see that the colors are a little bit warmer. Now, compared to the iPhone Xs it does feel to me a little bit more true to life where the iPhone is just doing everything that it can to light everything evenly in a way that feels kind of overdone. Here's another comparison from the selfie cam. The Pixel 3 again has much more detail and the iPhone Xs really does look a little bit over smoothed, and the Pixel 2 it's right smack in the middle. Last here's portrait mode and I think all three look pretty good but you can see that the Pixel 3 is more willing to brighten up the shadows and soften the highlights in the Pixel 2 but not nearly as much as the iPhone. I prefer the Pixel 3 again because the iPhone, I think it makes my face a little bit too soft but I will say that the iPhone Xs does a better job at tricky portrait situations because it has that second lens. The Pixel 3 just straight up duffed it on this photo. Bottom line, for most shots the Pixel 3 is consistent. It screws up less often than the Pixel 2 or the iPhone Xs. On any given photo you might prefer one or the other but on the whole I think the Pixel 3 has more restrained HDR and better looking photos than the iPhone Xs. Most of all I trust the Pixel 3 more. The Pixel 2 was the best camera for all of last year and it seems like the Pixel 3 is gonna be the best camera for all of this year. Alright, specs. The Pixel 3 is pretty standard for high end Android phones. It's got a snapdragon 845, 4 GB of RAM and 64 or 128 GB of storage. All the usual stuff. But the reason Pixel phones are generally better isn't about the specs, it's about the software and I think Google's done a good job of optimizing here so far as I can tell. Everything feels fast and smooth and I haven't detected any real lag to speak of. Battery life though it's pretty middle of the road. You'll get through a day with either phone but the big one should last a little bit longer. There's really no major improvements here in other words. But you do get wireless charging now and I love that. It's a little thing but for me it's so much more convenient than plugging in. The Pixel 3 also ships with the digital wellbeing software which helps you track your smartphone usage and it has helped me cut down on Twitter a little bit but mostly I just like that you can get a quick setting right in your settings to turn the whole screen gray scale whenever you want which is kind of weirdly soothing. But the coolest new software thing is this new call screening feature. It has a duplex robot answer your calls for you and speak for you and then you can read a live transcription of what's being said on your phone so that you can see if it's a spam call and really I am totally (phone rings) impressed with how well it works. - [Phone] Hi, the person you're calling is using a screening service from Google and will get a copy of this conversation. Go ahead and say why you're calling. - Hey Deeter, it's Neil. I'm calling because I wanna talk to you. - [Phone] Do you need to get ahold of them urgently? - Yes. - [Phone] Just so it's clear go ahead and say more about why you're calling. - It's because I'm Neil. I'm you're friend and colleague and I'd like to talk to you. - [Phone] They can't talk right now but they'll give you a call later. - Thanks robot. - [Phone] Thanks, and goodbye. (beeping) - If you're worried about privacy you should know that all this happens locally on the phone and none of the transcripts are stored or sent to Google at any point. Just, you know what? Don't use it on people you actually know 'cause that's actually kind of a jerk move. Here's what I think Google did with the Pixel 3. It made a list of everything that people were unhappy with on both the Pixel 2 and the Pixel 2 XL and then it tried to fix them. The camera's less crunchy, the screens are way better, the bezels are smaller and yes, there is a notch but still, the hardware overall is dramatically better. That's why I think this years Pixels are kind of like the iPhone S year upgrades. They seem like small, unexciting improvements but they make for a way better phone than anybody will give them credit for. These are simply great phones. If I have one major complaint about the Pixel 3 it's the price. It starts at 799 for the base Pixel 3 and the top tier, top storage Pixel 3 XL is a 1000 bucks. Are they worth that much? Well, yes they're top tier phones with great cameras and specs and build quality but you can get a lot of what these phones offer for way less in the Android world. Now, should you upgrade? Well, that depends on what you have now. If you have a Pixel 2 a lot of these features will come to you via software update, and if you have an iPhone well take a long look at your blue bubbles and your iCloud photo groups and have a think about how important they are to you. But if you want the best Android experience and the best camera you can get on a phone today the Pixel 3 is it. Thank you so much for watching, really appreciate it. I had a lot of things to say about the Pixel 3. Let me know in the comments, are you thinking about getting a Pixel 3 and what's gonna make your decision for you? And also Google announced a few other things and we have a really great hands on with the Chrome OS Pixel Slate Tablet so you should check that out too.",
    "transcript_keywords": [
        "Pixel",
        "Google",
        "year Pixel",
        "iPhone",
        "phones",
        "year",
        "camera",
        "phone",
        "Pixel phones",
        "smaller Pixel",
        "years Pixels",
        "reason Pixel phones",
        "thing",
        "photos",
        "lot",
        "screen",
        "Pixel Slate Tablet",
        "Pixel Slate",
        "big",
        "great"
    ],
    "transcript_entity_values": [
        "iCloud",
        "last year",
        "Pixel",
        "Sorta",
        "12.2 megapixel",
        "Android",
        "one",
        "799",
        "Second",
        "845",
        "128",
        "three",
        "Twitter",
        "USB",
        "Deeter",
        "HGR",
        "today",
        "Pixel 2",
        "a week",
        "Google",
        "iPhone Xs",
        "2",
        "4 GB",
        "Pixel 3",
        "GB",
        "Third",
        "daily",
        "selfie",
        "3",
        "100%",
        "the iPhone Xs",
        "Samsung",
        "Pixel 2 XL",
        "two",
        "Neil",
        "Pixel 2",
        "the past year",
        "40%",
        "Two",
        "This year",
        "this year",
        "64",
        "Galaxy S9",
        "as much as $1000",
        "the iPhone Xs",
        "Pixel 3 XL",
        "second",
        "later this year",
        "Playground",
        "1000 bucks",
        "first",
        "iPhone",
        "Mac",
        "USBC",
        "Last year's",
        "last year's",
        "RAM",
        "XL",
        "a ton",
        "First"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "EVENT",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "FAC",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "EVENT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL"
    ],
    "vector": [
        -0.12028221786022186,
        -0.04942117631435394,
        0.08489393442869186,
        -0.08504779636859894,
        0.06072652339935303,
        -0.0343618281185627,
        0.024181190878152847,
        0.023073086515069008,
        0.026531197130680084,
        0.03370770439505577,
        0.02168487198650837,
        0.002825329313054681,
        0.011177632957696915,
        -0.011049733497202396,
        0.07692752778530121,
        -0.027783773839473724,
        0.08851294219493866,
        -0.03261440247297287,
        -0.035420048981904984,
        0.014058999717235565,
        -0.022581681609153748,
        -0.07367900013923645,
        0.03757838159799576,
        0.014462171122431755,
        0.036745812743902206,
        0.04719185084104538,
        -0.040652260184288025,
        -0.05998922884464264,
        0.0019261908018961549,
        -0.055129244923591614,
        -0.05633758008480072,
        0.11120304465293884,
        0.014697548933327198,
        0.001767000532709062,
        0.005851408001035452,
        -0.0721173956990242,
        0.020612072199583054,
        0.013786053285002708,
        -0.021290211006999016,
        0.03183406963944435,
        0.013074103742837906,
        0.00933990627527237,
        0.021733883768320084,
        -0.005745656322687864,
        -0.014582389034330845,
        -0.03190038725733757,
        0.041984181851148605,
        -0.0628107339143753,
        -0.008748773485422134,
        -0.036520473659038544,
        -0.03225620463490486,
        -0.04382188990712166,
        0.012177088297903538,
        0.05443328246474266,
        -0.08882884681224823,
        -0.053410567343235016,
        -0.08056037127971649,
        0.0032939601223915815,
        0.04769326001405716,
        0.05453803762793541,
        0.028462139889597893,
        0.036798469722270966,
        0.028584694489836693,
        0.05784481018781662,
        -0.013361290097236633,
        0.02786133624613285,
        -0.030360570177435875,
        -0.08039320260286331,
        -0.009534919634461403,
        0.0320671871304512,
        -0.029667014256119728,
        0.05653815343976021,
        -0.02258528396487236,
        -0.029493298381567,
        -0.025642849504947662,
        0.058326032012701035,
        0.03303055465221405,
        -0.007829469628632069,
        -0.08153185248374939,
        -0.03986917436122894,
        0.013508835807442665,
        -0.050310734659433365,
        -0.03944467008113861,
        0.03370766341686249,
        -0.016631802543997765,
        -0.06484893709421158,
        -0.008827302604913712,
        0.07221303135156631,
        -0.07560724765062332,
        -0.07214104384183884,
        -0.06831015646457672,
        0.14847618341445923,
        -0.04134319722652435,
        0.005490951240062714,
        0.011351136490702629,
        0.018022822216153145,
        -0.0015275111654773355,
        -0.06216178834438324,
        0.0012160560581833124,
        -0.006383911706507206,
        0.02184438519179821,
        0.04495212063193321,
        0.06905681639909744,
        -0.023997722193598747,
        0.04068988934159279,
        -0.04270599037408829,
        -0.08949510753154755,
        0.0058852555230259895,
        0.026341622695326805,
        0.07361055910587311,
        -0.016156697645783424,
        0.0018830468179658055,
        -0.041572827845811844,
        -0.014219788834452629,
        -0.018329791724681854,
        -0.03202658146619797,
        -0.004480842035263777,
        -0.012530599720776081,
        0.11054616421461105,
        0.003601370146498084,
        0.005506851244717836,
        0.001535702613182366,
        -0.06128229573369026,
        -0.10329815745353699,
        -0.010359440930187702,
        -0.0021010981872677803,
        -0.0838625580072403,
        2.939849106940146e-33,
        7.090165308909491e-05,
        0.12937307357788086,
        -0.05820434167981148,
        -0.009510463103652,
        -0.05923561379313469,
        0.06945835053920746,
        0.04500648006796837,
        0.03922894969582558,
        -0.018375597894191742,
        0.010705148801207542,
        -0.07794550061225891,
        0.00406348193064332,
        -0.07027272880077362,
        0.03864122927188873,
        0.08430849760770798,
        0.01357201673090458,
        -0.04987116903066635,
        -0.036284174770116806,
        -0.04167719930410385,
        0.015083267353475094,
        0.03871103376150131,
        -0.0866721048951149,
        0.010994145646691322,
        0.03095640428364277,
        0.003911297768354416,
        -0.017028866335749626,
        0.09162658452987671,
        -0.004947577603161335,
        0.023366333916783333,
        -0.008655508980154991,
        -0.027667101472616196,
        0.024550192058086395,
        0.06081979349255562,
        0.027224857360124588,
        -0.05447603017091751,
        0.07150734215974808,
        -0.04476809501647949,
        -0.06160762906074524,
        0.03853963315486908,
        0.018107226118445396,
        -0.06237564980983734,
        0.05132764205336571,
        -0.05419248342514038,
        -0.07121457904577255,
        0.04355473443865776,
        0.09821277856826782,
        -0.03577446937561035,
        -0.09100522100925446,
        -0.01315988041460514,
        -0.06113791838288307,
        0.0435660183429718,
        -0.010402328334748745,
        -0.08812322467565536,
        0.007176054175943136,
        -0.03457614779472351,
        0.011824778281152248,
        -0.004246870521456003,
        0.013414197601377964,
        0.030976196750998497,
        0.04056960716843605,
        -0.0006342741544358432,
        0.014959248714148998,
        -0.08744234591722488,
        0.08126631379127502,
        -0.06375937163829803,
        0.07757320255041122,
        0.07596471905708313,
        0.028257112950086594,
        -0.11157441139221191,
        0.07088061422109604,
        -0.008488919585943222,
        -0.06231685355305672,
        0.049316614866256714,
        -0.03374510630965233,
        0.0779280960559845,
        0.00452549010515213,
        -0.09491097927093506,
        -0.007374225649982691,
        -0.0009253979078494012,
        0.0031681896653026342,
        -0.018350865691900253,
        -0.03294895961880684,
        0.09990061074495316,
        0.09650102257728577,
        -0.05692506581544876,
        -0.05727497488260269,
        0.01767713390290737,
        0.015970055013895035,
        -0.02028607949614525,
        0.054628998041152954,
        -0.06922806799411774,
        -0.008667227812111378,
        -0.025936294347047806,
        0.01718633808195591,
        -0.06174129247665405,
        -4.002492142992655e-33,
        -0.03404635190963745,
        -0.007552510127425194,
        -0.003891927422955632,
        0.0015469695208594203,
        -0.0048657492734491825,
        -0.02044878900051117,
        0.017216481268405914,
        0.057279035449028015,
        0.06386798620223999,
        -0.013559114187955856,
        0.0026370384730398655,
        0.05246051028370857,
        -0.04675603657960892,
        -0.0040111541748046875,
        -0.01631738990545273,
        -0.1021655946969986,
        0.03559950739145279,
        -0.15739557147026062,
        -0.0326918289065361,
        -0.02351171150803566,
        0.04561654478311539,
        0.02696186490356922,
        -0.03325054422020912,
        0.03332030773162842,
        0.0018799460958689451,
        0.02755102515220642,
        0.03345319628715515,
        0.009603243321180344,
        -0.035417281091213226,
        -0.05622086673974991,
        -0.034825559705495834,
        -0.01870260387659073,
        0.015507420524954796,
        0.041926756501197815,
        0.09438440948724747,
        -0.022111043334007263,
        0.02022714912891388,
        -0.0430438332259655,
        0.027510249987244606,
        -0.003642578609287739,
        -0.028558192774653435,
        0.022851645946502686,
        0.055341687053442,
        -0.012972502037882805,
        0.05184461921453476,
        0.011230339296162128,
        -0.014237604103982449,
        0.02869589440524578,
        0.01589120738208294,
        0.12441595643758774,
        -0.0028414695989340544,
        0.03591703251004219,
        -0.06831824779510498,
        0.0019198573427274823,
        -0.06400758028030396,
        -0.02867112122476101,
        -0.030585192143917084,
        -0.056612011045217514,
        0.022171003744006157,
        0.021093975752592087,
        0.03605432063341141,
        0.004807337187230587,
        -0.04276902228593826,
        -0.02267792820930481,
        -0.08926723152399063,
        0.010440071113407612,
        0.029746511951088905,
        0.004729534965008497,
        0.012694328092038631,
        0.08561594784259796,
        0.010554595850408077,
        -0.049013227224349976,
        0.026978088542819023,
        -0.04309379681944847,
        -0.03302120044827461,
        0.019790442660450935,
        -0.10707230120897293,
        0.0005173497484065592,
        0.01998405158519745,
        -0.02156505361199379,
        0.06839586049318314,
        0.0076830629259347916,
        0.07630717009305954,
        0.04396707937121391,
        0.12372951209545135,
        0.03900987654924393,
        -0.0030835880897939205,
        -0.035175394266843796,
        -0.06208641454577446,
        -0.023421958088874817,
        -0.044413622468709946,
        -0.0030954608228057623,
        -0.08034663647413254,
        0.051041752099990845,
        0.02036776766180992,
        -5.236190858681766e-08,
        0.08673557639122009,
        0.020862553268671036,
        0.02008938416838646,
        -0.012741511687636375,
        0.012257611379027367,
        -0.08118078112602234,
        -0.029120516031980515,
        0.10459553450345993,
        0.17177654802799225,
        0.026976365596055984,
        0.059548553079366684,
        -0.1299358457326889,
        -0.04548898711800575,
        0.07881772518157959,
        -0.004135435912758112,
        0.0308170598000288,
        0.009186415001749992,
        -0.055035728961229324,
        0.013001694343984127,
        -0.03325028717517853,
        -0.08852691203355789,
        0.043499819934368134,
        0.04945707321166992,
        -0.0704561099410057,
        0.07719261944293976,
        -0.0008723395294509828,
        -0.049807965755462646,
        -0.06138913333415985,
        0.08418601751327515,
        0.03392952308058739,
        -0.019903793931007385,
        -0.0233754999935627,
        0.0837712362408638,
        0.012906374409794807,
        0.012282272800803185,
        -0.07421057671308517,
        -0.0012973244301974773,
        -0.058830853551626205,
        0.09937102347612381,
        0.018882809206843376,
        0.054006170481443405,
        -0.05283840745687485,
        0.03416870906949043,
        0.021733343601226807,
        0.00608376320451498,
        -0.10255826264619827,
        0.07688000798225403,
        -0.12396231293678284,
        -0.033695872873067856,
        0.04512239992618561,
        -0.06047789007425308,
        -0.04028322920203209,
        0.007603089325129986,
        -0.0018444479210302234,
        0.06760761886835098,
        -0.015774456784129143,
        0.0020947461016476154,
        0.0072587039321660995,
        -0.027584584429860115,
        0.03481147065758705,
        0.023427268490195274,
        -0.09009768813848495,
        0.04279511049389839,
        0.1190987229347229
    ]
}