{
    "id": "RteJVUwzhWs",
    "title": "Samsung Z Fold 4 Durability Test! - Samsung says its 'Unbreakable'?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-08-29T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=RteJVUwzhWs",
    "category": "Howto & Style",
    "tags": [
        "Fold 4",
        "samsung fold 4",
        "folding phone",
        "coolest phone",
        "cool phone",
        "technology",
        "mobile phone",
        "smartphone",
        "iphone",
        "android",
        "samsung",
        "z fold 4",
        "z fold",
        "new folding phone",
        "best folding phone",
        "apple iphone",
        "apple"
    ],
    "views": 2430979,
    "likes": 79865,
    "comments_count": 4582,
    "description": "Today its time to durability test the Samsung Fold 4. Grab a Teardown Skin for your phone HERE:  Im a huge fan of the phone phone lineup. All fancy and stuff. I'm not sure which I would prefer, the Fold or Flip since both are equally awesome. But... of course... only if Samsungs folding phones can survive the test of time. Come watch as we put years worth of stress on the new Fold 4 from Samsung to see how it holds up.   Get my Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://dbrand.com/teardown/fold-4",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "-[Hypothetical Samsung employee in Right Speaker] Hey boss, it's time to release another folding phone, but we ain't got nothin' new. What should we do? -[Hypothetical Samsung Boss in Left Speaker] Hmmm. I think we just throw a new number on the old one and hope nobody notices. -[Employee] Should we make it cheaper though? -[Boss] No. -[Employee] Maybe a bigger battery? -[Boss[No. -[Employee] And you're sure nobody will notice that we're releasing the same phone over again? -[Boss] I mean, Apple does it every year. -[Employee] True. -[ Boss] They've been selling the same phone over and over for years now. -[Employee] Alright, Fold 4. Same box? -[Boss] Same box. -[Zack] Let's get started. [Intro] So there aren't a whole lot of changes this year with the Fold 4, externally or internally. It's got the same multitudinous smorgasboard of regulations that you have to agree to before gaining access, like the usual, don't touch it too hard. But while it's mostly the same, there are a few minor perks this new Fold 4 has over the previous Fold 3, even though they are both near indistinguishable at first glance. The Fold 4 is slightly thinner, and in my particular case, slightly more glued together. That, of course, will be rectified all in good time. All in good time. -[Employee] This guy's crazy. -[Boss] I think we should see what he does next. -[Zack] Another difference is the front screen. The smaller exterior full frontal screen on the Fold 4 has 3 entire millimeters more real estate than the Fold 3. Every millimeter matters I guess. It's not something I necessarily worry about. Corning also added the word plus to their victus lineup of glass, giving us Gorilla Glass Victus Plus, which has a nice ring to it. Even though it still scratches at a level 6 with deeper grooves at a level 7. The front 10 megapixel camera is protected by the Victus Plus, and it's all snugged up right up to the super thin earpiece slit. Now don't get me wrong, the Fold 4 is so far ahead of any other device, technologically speaking, it doesn't really need to innovate to stay ahead in the cool phone department. Samsung is the only one realistically competing in the folding space, and they have nothing to worry about. It's like Tesla worrying about a Prius. Or Michael Jordan worrying about me on the basketball court. There's no shame in the Fold 4 taking a little break this year when it's so far ahead of the competition. -[Employee] This guy's actually kind of nice. -[Boss] Interesting. It appears Apple has trained consumers to be happy about getting nothing new. -[Zack] On the large inner screen, the bezels are slightly smaller when compared to last year's phone, along with a slightly better hidden under display camera. You can see the pixel density improvement on the 4 verses 3. There are like at least 20 more pixels in there over the sensor. Nice work, Samsung. -[Boss] See, I told you it's a totally new phone. -[Zack] And if we test the hardness on the Fold 4's inner screen, we still see scratches at a level 2, with deeper grooves at a level 3. -[Boss] Okay fine, maybe some things are still a little bit the same. -[Zack] Making our way over to the side, Samsung is using the Armor Aluminum again, which is metal. We also have a scratchable side mounted fingerprint scanner where they should all be. And we have a metal removable volume rocker. Above that is a plastic patch where I believe the 5G antennas are located. Up at the top if we close the phone we can multitask with two sides at once. More metal, some microphone holes and a loudspeaker grill. And Samsung has left a bit of a gap between the two halves so dust and dirt doesn't get smashed into the plastic layers. Thumbs up for that. With so many sides to scratch, I'm feeling like a fruit ninja. But we do find more metal along with a SIM card tray and no expandable memory. It does have a rubber ring though and a water resistance rating of IPx8, meaning that it's pretty impervious to liquids, but has no rated resistance against dust. More on that later. -[Employee] Did he just say dust? -[Boss] This guy is crazy. -[Zack] Down at the bottom we have our 25 watt fast charger and another loudspeaker with more metal. Finally, the spine. Metal, with the very familiar recessed and inlaid Samsung lettering that we saw in the hinge last year. Moving around to the triple camera setup, it's time to see what materials we have back here. Just kidding, I swapped the phone to last year's Fold 3 and you didn't even notice. -[Employee] Is he making fun of us? -[Boss] I think he is. -[Zack] We have a new 50 megapixel camera which is cool. And then a 10 megapixel telephoto and a 12 megapixel ultrawide. A decent trifecta all protected with glass. And as you can tell, a metal camera housing. There is a matte glass finish on the rest of the back panel. Personally, I'm a pretty big fan of the matte glass aesthetic. Samsung did warn us at the beginning before even getting to the operating system to avoid dust. Samsung also left dust out of their ingress protection rating so it's time we see what actually happens when dust does come in contact with the Fold 4. This is the same batch of dust that I used on previous generations of the Flip and Fold lineups, so it should be a fair test across the board. -[Boss] Does he recycle the dirt? -[Employee] Someone really needs to stop this man. -[Zack] Now that the phone is dirtier than a politician trying to steal classified documents, it's time to see how much dust ends up inside the gears of the phone. It should be fairly audible. Gears never sound real good with contaminants. I don't notice any grinding. I do notice, however, that my dust appears to be metallic since it's congregating at little dots along both edges of the phone. And these same locations are then able to magnetically hold my metal tweezers. Very interesting. I don't hear any grating sounds yet. Let's add some more dirt for good measure, specifically along the spine. And I do have to say the phone still sounds super good. The only crunch I hear is from the dust being pinched between the two halves as the big screen opens. But nothing is actually inside of the phone or the hinge. Nice work again, Samusng. As far as the fingerprint scanner goes, I was able to read and set my dusty fingerprint which is nice. And after some extra damage with my razor blade, it does appear to still be working and still be extremely fast. This is where every fingerprint scanner should be located in my opinion. Now for the burn test. -[Employee] Where is this boy's mother? -[Zack] We already established that the inner foldable 7.6 inch screen is made from a super thin plastic. And in just about 10 seconds we see the pixels go completely black and a bit green and never recover. The exterior glass fares a bit better at 16 seconds before the flame leaves a permanent white mark on the AMOLED pixels. I imagine the glass helps distribute the heat leaving less damage behind from the flame, you know, since fire management is a major issue when selecting a smartphone. I got you covered. Finally, the bend test. Samsung has gotten a little cocky lately, called this Fold 4 unbreakable on their website. Brave words coming from a Mohs 3. But I'm going to be honest, I do kind of agree with them. Each of the previous years this phone's come around and structurally survives, where some other phones do fail catastrophically. May OnePlus rest in peace. And this Fold 3 with a 4 on the box appears to be no exception. Rigidly strong in every direction with the phone closed, obviously. If, however, we were to bend the phone in the opposite direction while open, where each and every single one of us expect and almost hope for carnage, there is none. The Samsung Fold 3/4 once again passes my durability test. Dust slams and bends, yet still lives. Yeah, it's a little soft on the inside, but aren't we all? Now I don't think that this new Fold is going to survive the teardown though. Its predecessor for sure did not. So if you'd like to see your phone from the inside while it's still alive, might I suggest one of my Teardown Skins. Dbrand and I have been working on this teardown project for years now, and we cover nearly every major device. You might be like, if the phone didn't change much how come there's a new Teardown Skin for it? And if you keep asking those questions we'll just release the Fold 3 again next year too. -[Boss] This guy's brilliant. Write that down. -[Zack] And yeah, the Fold 4 Skin is still full price even though it only covers one quarter of the phone. -[Employee] Has this man ever worked for Apple? -[Zack] Link is down in the description. Rumor is there's a new iPhone coming out. I think it's the iPhone 10 version 4. I lose track. Either way, I'm already sharpening my razor blades, which are also right down there in the description next to my Teardown Skin. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Fold",
        "phone",
        "Samsung",
        "dust",
        "Samsung Fold",
        "metal",
        "year",
        "glass",
        "Hey boss",
        "year Fold",
        "time",
        "screen",
        "teardown",
        "Teardown Skin",
        "nice",
        "camera",
        "good",
        "test",
        "previous Fold",
        "Skin"
    ],
    "transcript_entity_values": [
        "the Victus Plus",
        "50 megapixel",
        "at least 20",
        "just about 10 seconds",
        "Flip",
        "Michael Jordan",
        "Teardown Skins",
        "iPhone",
        "one quarter",
        "6",
        "the previous years",
        "Instagram",
        "Corning",
        "two",
        "Prius",
        "the Fold 4",
        "7.6 inch",
        "years",
        "25 watt",
        "the Fold 4 Skin",
        "Fold 4",
        "12 megapixel",
        "3 entire millimeters",
        "4",
        "next year",
        "this year",
        "the Fold 4",
        "last year's",
        "5",
        "IPx8",
        "Apple",
        "Samusng",
        "Tesla",
        "first",
        "last year",
        "Fold",
        "Samsung",
        "16 seconds",
        "3",
        "Samsung Fold",
        "The Fold 4",
        "10 megapixel",
        "AMOLED",
        "one",
        "Twitter",
        "victus",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "LAW",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.19277963042259216,
        0.07297834008932114,
        0.019703608006238937,
        -0.039437927305698395,
        0.025234635919332504,
        -0.06609627604484558,
        0.03680489957332611,
        0.08913379162549973,
        -0.056570570915937424,
        0.06827196478843689,
        0.051084645092487335,
        0.019746609032154083,
        -0.015009675174951553,
        0.061288345605134964,
        0.01187855564057827,
        0.03272778540849686,
        -0.02206544578075409,
        -0.04024752974510193,
        -0.0663377195596695,
        0.12840811908245087,
        0.0733865275979042,
        -0.043315961956977844,
        0.042459599673748016,
        -0.07702670991420746,
        -0.005155290476977825,
        0.039958443492650986,
        -0.01562567800283432,
        -0.04172569140791893,
        -0.03618767112493515,
        -0.07609903067350388,
        0.05797238647937775,
        0.09233272075653076,
        -0.04154741391539574,
        0.02907736785709858,
        0.0495687760412693,
        -0.0011218253057450056,
        0.019688641652464867,
        0.021190693601965904,
        -0.043837714940309525,
        0.022798793390393257,
        -0.04078717529773712,
        0.03850695863366127,
        0.009738951921463013,
        -0.025893285870552063,
        0.019113415852189064,
        -0.030749762430787086,
        0.03547121211886406,
        -0.0586090125143528,
        0.003690645331516862,
        0.018364250659942627,
        -0.017400752753019333,
        0.004132778849452734,
        0.027440691366791725,
        0.023413896560668945,
        -0.0697927251458168,
        0.010784226469695568,
        -0.03613320738077164,
        -0.011481540277600288,
        0.02255706675350666,
        0.0030479931738227606,
        0.09523613750934601,
        -0.007130651269108057,
        -0.032305289059877396,
        0.07588136941194534,
        0.012313880026340485,
        0.05425960198044777,
        0.03545203432440758,
        -0.11606541275978088,
        -0.08906472474336624,
        -0.012309348210692406,
        -0.11124637722969055,
        -0.0012197726173326373,
        -0.006308776326477528,
        -0.010933401994407177,
        0.027399474754929543,
        0.02692238986492157,
        0.07621556520462036,
        -0.04952503368258476,
        -0.033048003911972046,
        0.027974849566817284,
        0.03568048030138016,
        -0.04773431643843651,
        -0.06560477614402771,
        0.01690342277288437,
        0.03938920423388481,
        0.04067857563495636,
        -0.02022196725010872,
        0.05771760642528534,
        -0.0624333992600441,
        -0.05935552716255188,
        0.03663276508450508,
        0.08352832496166229,
        -0.02130291238427162,
        -0.006151219364255667,
        -0.02296389266848564,
        -0.03219980001449585,
        -0.08517764508724213,
        -0.05848950147628784,
        -0.016819218173623085,
        0.048643626272678375,
        -0.00024202841450460255,
        0.01689726486802101,
        0.06548281759023666,
        -0.010652445256710052,
        0.03548317402601242,
        -0.06843338906764984,
        -0.008515246212482452,
        0.015928247943520546,
        -0.027547772973775864,
        0.015182041563093662,
        0.01904267631471157,
        0.039086759090423584,
        -0.017379265278577805,
        -0.009104596450924873,
        -0.019581781700253487,
        0.039445530623197556,
        -0.0833994597196579,
        0.07478056848049164,
        0.08087702840566635,
        0.03254732862114906,
        0.007623413112014532,
        0.03780427202582359,
        -0.02295071817934513,
        -0.09858069568872452,
        0.009756951592862606,
        0.03890995681285858,
        -0.05570646747946739,
        4.247030232794216e-33,
        0.034462712705135345,
        0.15549834072589874,
        0.004784410819411278,
        0.0017282712506130338,
        -0.023095628246665,
        0.03144194185733795,
        -0.016546454280614853,
        0.051653068512678146,
        -0.06238814443349838,
        0.05046948418021202,
        -0.01677766442298889,
        0.013507338240742683,
        0.0002182986499974504,
        -0.04849570617079735,
        0.025424739345908165,
        -0.04492304474115372,
        -0.002877498045563698,
        -0.03652004525065422,
        -0.05987265706062317,
        -0.02368617057800293,
        -0.010450532659888268,
        0.0008837753557600081,
        0.06052684038877487,
        0.02753457985818386,
        0.06969014555215836,
        0.03361337631940842,
        0.04523428902029991,
        -0.023620642721652985,
        0.04984241724014282,
        0.030415555462241173,
        -0.10360133647918701,
        -0.0016413182020187378,
        -0.0005452377372421324,
        -0.015800120308995247,
        -0.014819388277828693,
        0.02321288362145424,
        -0.061408188194036484,
        -0.07698170095682144,
        -0.01684006303548813,
        -0.0010133320465683937,
        -0.07020317018032074,
        -0.0011238144943490624,
        -0.021680375561118126,
        0.0032297733705490828,
        0.024529559537768364,
        -0.05164114758372307,
        0.024202048778533936,
        0.030190644785761833,
        -0.0375061109662056,
        -0.006885834038257599,
        0.0028442188631743193,
        -0.05784933641552925,
        -0.017809228971600533,
        -0.036898624151945114,
        -0.09232645481824875,
        -0.03598245605826378,
        0.032748498022556305,
        -0.034812409430742264,
        0.041637711226940155,
        0.08473348617553711,
        0.05551380664110184,
        0.011968211270868778,
        -0.07124774158000946,
        0.03828151151537895,
        -0.06083425134420395,
        0.006530689541250467,
        0.03592873364686966,
        -0.010700616985559464,
        -0.10111372917890549,
        0.042940765619277954,
        -0.03036801517009735,
        -0.0042784931138157845,
        0.004530673380941153,
        -0.0009118744637817144,
        0.021533170714974403,
        0.00320104556158185,
        0.0054021780379116535,
        0.02449118159711361,
        0.04865697771310806,
        -0.05605948716402054,
        -0.04161461070179939,
        -0.007119175046682358,
        0.07447431236505508,
        -0.010212601162493229,
        -0.035005517303943634,
        -0.07445093989372253,
        0.017087504267692566,
        -0.09511327743530273,
        0.037359222769737244,
        -0.003421807661652565,
        -0.04762382432818413,
        -0.04919835925102234,
        -0.00642819982022047,
        -0.10138237476348877,
        0.01283284556120634,
        -4.7539030295268014e-33,
        -0.006713490001857281,
        -0.006788472179323435,
        0.0056352936662733555,
        0.008087696507573128,
        0.02828778512775898,
        -0.038230448961257935,
        0.09049332141876221,
        0.08341466635465622,
        -0.0335562638938427,
        -0.10678909718990326,
        -0.007100113667547703,
        0.059086110442876816,
        0.013947785831987858,
        -0.04182925820350647,
        0.053416479378938675,
        -0.0005917110247537494,
        0.002565511967986822,
        -0.09305771440267563,
        0.03208598494529724,
        0.02429363876581192,
        0.07987760007381439,
        0.054434388875961304,
        0.03742276504635811,
        0.07957398146390915,
        0.007384279742836952,
        0.01926477812230587,
        0.056355349719524384,
        -0.0498264841735363,
        0.13580550253391266,
        0.020444409921765327,
        -0.016081970185041428,
        -0.09038995206356049,
        0.016081681475043297,
        0.0701192244887352,
        -0.008796650916337967,
        0.0462767630815506,
        -0.019871188327670097,
        -0.02335328795015812,
        0.059070322662591934,
        -0.08399439603090286,
        -0.006781330797821283,
        0.03277473524212837,
        0.008063141256570816,
        0.0134462621062994,
        0.006175235845148563,
        -0.0812932625412941,
        -0.0524565763771534,
        0.05011189728975296,
        -0.021984467282891273,
        -0.032733380794525146,
        -0.07090546935796738,
        -0.0006319761741906404,
        -0.00583892734721303,
        -0.03760802373290062,
        -0.043226081877946854,
        0.04295344650745392,
        0.02938467636704445,
        -0.09060829132795334,
        0.011030938476324081,
        -0.014445962384343147,
        0.07447702437639236,
        0.020715313032269478,
        0.014169945381581783,
        -0.03452856466174126,
        -0.013361714780330658,
        -0.005803748965263367,
        0.10779742896556854,
        -0.0196329765021801,
        -0.0018690627766773105,
        0.0191586185246706,
        0.004390506073832512,
        -0.030947336927056313,
        0.002650093287229538,
        -0.1093703955411911,
        0.025128047913312912,
        0.08150874823331833,
        -0.10583215206861496,
        -0.017328258603811264,
        0.000931812624912709,
        -0.034938160330057144,
        0.04041420668363571,
        -0.03804060444235802,
        0.030566642060875893,
        0.044511254876852036,
        0.03695202246308327,
        -0.019095510244369507,
        0.03908872231841087,
        0.04361068829894066,
        0.016658665612339973,
        -0.005952985025942326,
        -0.0888032615184784,
        0.006142512895166874,
        -0.015392164699733257,
        0.16506007313728333,
        0.007171300705522299,
        -5.572789163466041e-08,
        0.061035726219415665,
        0.05466143786907196,
        0.017413044348359108,
        -0.010145919397473335,
        -0.007882391102612019,
        -0.052833251655101776,
        0.034289706498384476,
        -0.0812520757317543,
        0.04628213122487068,
        -0.035036128014326096,
        0.004974698647856712,
        -0.0694686621427536,
        -0.04506513848900795,
        0.0777490958571434,
        0.011578233912587166,
        0.0748874768614769,
        -0.05921517312526703,
        0.07477864623069763,
        -0.011799733154475689,
        0.04645581170916557,
        -0.06681955605745316,
        0.0010721968719735742,
        0.03758043423295021,
        -0.058536235243082047,
        0.02559848502278328,
        0.04289410263299942,
        -0.13570451736450195,
        0.021904857829213142,
        0.07374781370162964,
        -0.022267518565058708,
        -0.02343832328915596,
        -0.016013111919164658,
        0.0007004742510616779,
        0.025169506669044495,
        -0.08633913844823837,
        -0.08539372682571411,
        -0.06033683940768242,
        -0.03415908291935921,
        0.09775123000144958,
        0.061124902218580246,
        0.08136115223169327,
        -0.019966287538409233,
        -0.00961262546479702,
        0.07822603732347488,
        -0.06313570588827133,
        -0.09299376606941223,
        0.0676501914858818,
        -0.11773089319467545,
        -0.02965722791850567,
        0.06934043765068054,
        -0.07111417502164841,
        -0.05546819791197777,
        -0.12547007203102112,
        0.0046988800168037415,
        0.02300064079463482,
        0.0705915167927742,
        0.06072317436337471,
        0.02872016467154026,
        -0.026707548648118973,
        0.005806823261082172,
        -0.004650060087442398,
        -0.08879201114177704,
        -0.011708698235452175,
        0.08674395084381104
    ]
}