{
    "id": "rtOT9ueliRs",
    "title": "this is a TV...? - LG StanbyME Go",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-02-10T17:24:30Z",
    "video_url": "https://www.youtube.com/watch?v=rtOT9ueliRs",
    "category": "Science & Technology",
    "tags": [
        "Camping",
        "Van Life Tech",
        "Portable tech",
        "Portable Monitor",
        "Glamping Tech",
        "Weird Tech",
        "Home Theater",
        "Portable Home Theater",
        "Bluetooth Speaker",
        "Portable Gaming",
        "Battery Bank",
        "Van Life"
    ],
    "views": 1081139,
    "likes": 38428,
    "comments_count": 2063,
    "description": "Treat your feet with Vessi! Save 15% with code LinusTechTips at   This suitcase TV from LG is something we havent seen before, and we needed to talk about it. Part portable monitor, part home theater in a box and part bluetooth speaker.  Is it for Van life? Work trips? Glamping? No matter what, its got HDR on-the-go, while youre camping. The LG Stanbyme Go is... something.  Discuss on the forum:   Buy an LG StanbyME Go:  (Canada:  ) Buy a Jackery Portable Power Station:  Buy an ASUS ZenScreen 24\" 1080p Portable USB Monitor:  Buy a JBL Charge 5 Wireless Bluetooth Speaker:  Buy a HP Envy Move 23.8\" All-in-One PC:  Buy a Lenovo ThinkCentre M90 All-in-One PC:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:21 Sponsor Spot 1:32 Trying it out 2:30 Screen Tested 4:36 Speaker Time 5:57 Exploring Other Features 8:25 Playing More Games  10:35 Battery and I/O  12:40 Some Other Options and Thoughts 13:40 Sponsor Spot 14:32 Outro",
    "description_links": [
        "http://vessi.com/LinusTechTips",
        "https://linustechtips.com/topic/1557413-lg-made-a-suitcase-tv-stanbyme-go-review/",
        "https://lmg.gg/6e1u5",
        "https://lmg.gg/LtT2W",
        "https://lmg.gg/zhDY5",
        "https://geni.us/x8Qe8X",
        "https://geni.us/d4mUv",
        "https://lmg.gg/ydjmd",
        "https://geni.us/FOB8u",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "You open up this suitcase, and their eyes light up with wonder, until they ask... It's just a big laptop. No way, man. It's a TV. Ugh, it weighs like 30 pounds. Well, yeah, because it's a home theater in a box! How much is it? How much does it cost? The LG StandbyMe Go, spelt like... I am claiming to have written the hit Eminem song, Now Leave is a briefcase system designed for entertainment on the go. Inside this box is everything you need for movie night... in the woods. A bright 27-inch smart display, four speakers in stereo configuration, and a battery to power the whole thing. But none of that is what made us want to talk about it. It's rare that a device splits our team's opinions this cleanly. On the one hand, we've got the pragmatists, who expect the most performance for their dollar. They aren't thrilled with this thing. But then we've got the gadget geeks, who are always excited to see cool new ideas. And the Stand by Me Go is certainly that. It's eye-catching, it's different, it's kind of cool, but is it good? Let's find out after this quick message from our sponsor. Vessi. Protect your feet from precipitation and perspiration with Vessi and their Dymatex technology. Check them out at the link below and use code LINUSTECHTIPS to get 15% off. For fun, this is my first actual hands-on with this thing. And the real question is, is it cool to have my own little home theater in the woods? I gotta say, I kind of thought it was gonna be stupid, but immediately I'm looking at it going, this would have come in handy so many times. I mean, it's more luggable than portable, but the colors pop, the anti-glare performs way better than I expected. Immediate impressions, kind of like it. It's a little cold today. Thankfully, I got my 3D down jacket, lttstore.com. But if I wanted to watch TV outside or play games, there's probably dumber solutions. Got little rubber corners on it for ruggedness. Oh, whoa, hi. Oh yeah, it does that. Oh yeah, it does. Just in case you want that to happen. Given how close you're seemingly intended to sit to it, 1080p does feel like a bit of a compromise. But overall, there's gotta be dumber ways to solve this problem. We were pleasantly surprised to find that the display has pretty good color accuracy. This is in spite of a bit of overemphasis on the reds and a color temperature that pushed cool by default for a little boost in luminance. Bit more on that later. We measured an average delta E of just 2.68. And in this vivid mode and plugged in, we also measured around 500 nits peak brightness, which is not amazing, but certainly usable. But wait, it says 250 when plugged in. 250? When you're on the beach, you get 250 nits? 450. Oh, okay. A portable power station. That kind of defeats the purpose of this thing, don't you think? So even though it's Dolby Vision and HDR10 compatible, it's on battery performance, 250 nits peak with no local dimming means that the highest thing about your high dynamic range is probably going to be that fungus that you found behind a tree. Or who knows? Maybe I'll be pleasantly surprised. All right, Madrigals. How are you going to look on this? Oh my god. It switched into Dolby Vision mode and immediately it's like... Dim. It switches out of the vivid mode, so you can switch it back for a little color. Or we can plug you in. It's not even broad daylight, guys. It's freaking overcast and foggy. And this looks like I have my laptop screen in power saving mode. This is on battery right now? It's on battery. Let's plug it in. Shoot, man. That's not good. I can't see s*** right now. Swipe from the top, see if the brightness is at max. It should be. Swipe? Is this a touchscreen? It's a touchscreen. Well, there's good news and bad news. Good news is the touchscreen works. The bad news is... That's it, boss. This is not HDR. That's not a flame. That's white. This is not fire or lava or whatever the crap it's supposed to be. It's yellow circles. And that's what the low peak brightness is going to do to you. What are these speakers going to do to you? What a disappointment. They had this entire enclosure here and they put the speakers behind the screen. Hold on. The speakers are in here? Yes. Why? All they had to do was put some angled drivers in here so that they would actually hit you instead of bouncing off the back of the monitor. Not trying to be a jerk about it or anything, but that's not how you do this. Nope. If I do this and I sit here, it sounds way better. Yeah, you're right. It's not impeded. Yeah, you're not wrong. You don't build a speaker and then put a thing in front of it. Here's a thought though. Maybe that Dolby Atmos label is less about clear dialogue in your movies and more about pounding that bass when you're around the campfire. Let's see how she fares. Wow. It doesn't sound good from back here either. Dude, they had all this room in it and they didn't put in a sub. Yeah. The next thing I've been asked to try is the ambient wallpaper. So I like healing. Why don't we fire up a cozy fireplace? Now my next challenge is to turn off the screen while my background music or audio plays in order to preserve battery life. Oh, wow. WebOS is a little laggy on this thing. Click. Okay, I give up. The only way is to use the voice controls that are disabled by default. Seriously? I see. On a normal LG TV remote, they have a button so that you can just talk at it when you want it to be listening. But on this one, I guess they cheaped out on the remote. It doesn't have a button. So it just has an always on threshold. So it has to be disabled by default. I see. Hi, LG. Turn off the display. Okay, I'll turn off the screen. Thanks, TikTok. Wow. Well, there it is. You can also use your LG phone app because you definitely have that installed. Video and music are just part of the pitch for the StandbyMe Go, though. It's got some basic onboard processing, a touch display. And it can rotate, as I showed you guys before, to portrait mode. So you can mirror your phone's display to it. As long as you twist it this way. And it should be noted that we had somewhat mixed results with that. But what you can also do is load in some of the apps that are built into LG's webOS or download new ones, including games. I'm going to play Billion Marble. Oh, it's Monopoly. How about a Philippine City? Purchase. Uh, okay. How do I not this game? It occurs to me now that I had asked for a particular game on Android because I forgot. Oh, right. WebOS. They don't have Android games, necessarily. Okay, can I can I dodge or? You can move. What is this game? A tank battle, dude. Come on. Uh, okay. Ah, my notes say that we experienced some responsiveness issues. Take that, Anakin. I have the high ground. Even at its best, the webOS game library is going to make you wish you had anything else attached to this thing. The good news is you can. All right, all right, all right, fine. We'll go home. Go to HDMI. Oh, oh, it fell through the table. Oh, that's not good. I mean, look, if it couldn't survive that, then it's not really suitable for camping anyway. But how's the motion clarity for you? Being completely honest, I wasn't even paying attention to the motion clarity of this display. Not because it's good. It's really bad. But I just didn't really feel like that was the point of it. Here's a question. What if I just unplugged the ally and handed it to you? Which one do you think is going to be better? Oh, wow. Is this ever a better display? What's really embarrassing from my point of view is LG literally are the guys when it comes to IPS. Why is this the cheapest, worst IPS panel? Why do you even still make these ones? The thing is, a lot of what I've said so far is evaluating it as a television, but it's unique. So why don't we try something unique? Let's play a two-player game. Let's play the chess. The chess. I'm a big fan of the chess. Do you chess? Not really. Because I don't really chess. I think we're both about to embarrass ourselves then. It's okay. I'm going to bring out my rook right away. I'm going to be a pro. Bring out my king. What? Okay. I don't think pro works the way you think it works. I'm going to bring out both rooks. It's the two rook defense. A country is only as strong as its king. A country is only as powerful as its pawns. Its loyal servants. Check. No! You can kill it. No, I don't want to. You don't want to kill it. I believe in peace. If you guys want to see the whole chess game, lmg.gg slash floatplane. We're going to have it up there. Why you run away, b****? You're falling for one of the classic blunders. What? What? That, I have no idea what happened. In all seriousness though, there are other aspects of the device that we should talk about. Battery life is advertised at around three hours. We got four to five, and that was streaming Disney Plus and YouTube. The IO is both limited and good enough. You've got a power in, a battery on and off button, an IR blaster port, just in case you want to set up a relay. A USB port, which I could definitely see people using. You bring along your little collection of videos to watch in the tent or whatever the case may be. And a single HDMI port. One thing that does feel a little conspicuously absent, given that it's a smart TV, is any kind of connectivity. There's Wi-Fi, obviously, but there's no ethernet jack. And maybe more importantly, there's nowhere to put a SIM in it or anything like that. So you're pretty much tethering to a phone if you want a connection. And you'll need a connection because there's no internal accessible storage. Realistically though, in spite of all of my complaints, if you're the kind of person who wants a StandByMe Go, whether it's for van life or giving presentations on the road, you already know who you are. And I'm honestly not here to argue that. It's utterly unique. So why don't we focus then on the ways that I feel LG could improve this experience for the people who need something like this. Losing almost half of our brightness when we're away from power is a huge downer. When the whole point of this thing is to be away from power. On top of that, once the external juice is cut, we saw some 240 Hertz flickering. Remember, this is a 60 Hertz display, meaning that there were duplication artifacts in high motion scenes. It's not a huge deal in most slow moving video content, but it's definitely distracting if you've got your PS5 hooked up and you want to game. Or wait, okay. That's a bit of a problem too. The StandByMe Go doesn't share power with external devices. It's like Sauron, okay? So you're going to need a power station for anything that is beefier than a USB drive with your MP4s on it. And at that point, compact portable monitors go up to 24 inches now and pair very nicely with stereo ready Bluetooth speakers from the likes of JBL or Soundcore. None of that is my biggest issue though. My biggest problem is the cost. You could buy a whole ass all-in-one computer with a built-in battery like the HP Envy Move for much less than the StandByMe Go. And then you end up with a full fat Windows PC instead of this weak webOS machine. We're going to have links to some alternative suggestions in the video description. If this thing was 400, 500 bucks, it's a winner. And even at six, 700, I still think it has a place. But at $1,200, look, if you like it, you like it. It's not awful. It's just, it's hard not to compare it to existing less expensive solutions, even if they are a little less elegant. Like this inelegant segue. Oh no, to our sponsor. Vessi. Dreaming of long summer walks during the cold winter months? Well, don't let the rain fall down and disrupt your dreams. Walk free with Vessi. They claim their shoes are 100% waterproof thanks to their Dymatex technology. Even the most torrential downpours don't stand a chance. The Chelsea and Stormburst shoes are fantastic companions for the winter weather with the comfort of a sneaker and the warmth and higher top of a boot. So you can treat your toes while laughing at mother nature's futile attempts to dampen your spirits and feet. And when the skies clear up, their weekend and everyday classic sneakers are great for just wearing about while still offering enough protection from the wet outdoors. When you come home from your journey, you will come in clean. So head to Vessi.com slash LinusTechTips and get 15% off your first purchase with code LinusTechTips. If you enjoyed this video because you like unique tech for on the go, why don't you check out our video on the Maccase B21 briefcase PC? It's somehow less sleek than this thing, but it's definitely more powerful.",
    "transcript_keywords": [
        "thing",
        "good",
        "eyes light",
        "battery",
        "display",
        "power",
        "game",
        "yeah",
        "kind",
        "chess",
        "speakers",
        "mode",
        "Dolby Vision",
        "Video",
        "put",
        "StandbyMe",
        "WebOS",
        "Vessi",
        "cool",
        "Dolby"
    ],
    "transcript_entity_values": [
        "250",
        "LinusTechTips",
        "lmg.gg slash floatplane",
        "700",
        "one",
        "IO",
        "Eminem",
        "Sauron",
        "Vessi.com",
        "the HP Envy Move",
        "JBL",
        "four",
        "around three hours",
        "Windows",
        "Vessi",
        "first",
        "LG",
        "Chelsea",
        "24 inches",
        "500 bucks",
        "Maccase B21",
        "Hertz",
        "2.68",
        "One",
        "IR",
        "winter",
        "Dolby Vision",
        "webOS",
        "winter months",
        "four to five",
        "WebOS",
        "today",
        "Madrigals",
        "Anakin",
        "TikTok",
        "IPS",
        "almost half",
        "PS5",
        "450",
        "100%",
        "Dolby Atmos",
        "30 pounds",
        "Shoot",
        "Disney Plus",
        "LINUSTECHTIPS",
        "max",
        "YouTube",
        "27-inch",
        "Dymatex technology",
        "USB",
        "15%",
        "Billion Marble",
        "six",
        "1,200",
        "Stormburst",
        "60",
        "Wi-Fi",
        "around 500",
        "two",
        "400",
        "Philippine",
        "Android"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG"
    ],
    "vector": [
        -0.0834159329533577,
        -0.059270065277814865,
        0.0338091142475605,
        -0.0881151556968689,
        0.12141620367765427,
        0.08457870781421661,
        0.015295655466616154,
        0.07526712864637375,
        -0.009073867462575436,
        -0.014414986595511436,
        0.01063818484544754,
        0.054725904017686844,
        -0.0035327968653291464,
        0.020494814962148666,
        -0.014722403138875961,
        -0.03150034695863724,
        0.08952651172876358,
        -0.1281898021697998,
        0.006555494852364063,
        0.024602122604846954,
        0.07877416163682938,
        0.0038421882782131433,
        -0.00025012806872837245,
        -0.027539676055312157,
        0.07094715535640717,
        -0.05232362076640129,
        0.06383392959833145,
        -0.051494382321834564,
        -0.02368798293173313,
        -0.04017677903175354,
        0.01101986225694418,
        0.04287312552332878,
        -0.02526029571890831,
        0.005036523099988699,
        -0.06387415528297424,
        -0.07132172584533691,
        0.04030822589993477,
        -0.0944322720170021,
        -0.07696344703435898,
        -0.02816835045814514,
        -0.0414949469268322,
        -0.06616532057523727,
        0.028025047853589058,
        -0.04431096836924553,
        -0.012504231184720993,
        -0.055363599210977554,
        -0.00020033134205732495,
        -0.07663388550281525,
        -0.0149990851059556,
        -0.023064570501446724,
        0.037717681378126144,
        -0.030665792524814606,
        0.014899063855409622,
        0.00744285061955452,
        -0.04257495328783989,
        0.04238762706518173,
        -0.016197480261325836,
        0.010287501849234104,
        0.06324739009141922,
        -0.014251838438212872,
        0.051198892295360565,
        -0.00887927133589983,
        -0.02399677038192749,
        0.021459093317389488,
        -0.030525796115398407,
        -0.05541994795203209,
        0.021879510954022408,
        0.04069292172789574,
        0.0040460010059177876,
        -0.022291602566838264,
        -0.09815682470798492,
        -0.0035473068710416555,
        0.0182202085852623,
        0.04402683675289154,
        -0.003949636593461037,
        0.04063586890697479,
        0.06336978077888489,
        -0.05788544565439224,
        0.0556124746799469,
        0.059400029480457306,
        -0.001761256018653512,
        0.04178362712264061,
        -0.012237530201673508,
        -0.02914941869676113,
        0.01599467732012272,
        -0.050704192370176315,
        0.03755573928356171,
        0.09093566983938217,
        -0.039731256663799286,
        -0.09322772920131683,
        -0.062038738280534744,
        0.06580977886915207,
        -0.03608175367116928,
        0.0543782114982605,
        -0.013844989240169525,
        -0.014732012525200844,
        0.01091283280402422,
        -0.07262620329856873,
        0.002461484167724848,
        0.07154571264982224,
        0.06472674757242203,
        0.04538419470191002,
        0.08731010556221008,
        -0.058387964963912964,
        -0.05855250731110573,
        -0.0915956199169159,
        -0.0014442030806094408,
        0.035531189292669296,
        0.036359287798404694,
        -0.03271401673555374,
        -0.05018166825175285,
        0.030897151678800583,
        -0.020230982452630997,
        0.004971169866621494,
        -0.007398993242532015,
        -0.0009079082519747317,
        -0.015260090120136738,
        0.03645811229944229,
        0.0534309484064579,
        -0.0517565980553627,
        0.018008418381214142,
        -0.04747738316655159,
        0.017300890758633614,
        0.028017302975058556,
        0.05396940931677818,
        0.03880814090371132,
        -0.007454589940607548,
        6.314253128782352e-33,
        0.02366841398179531,
        0.07799218595027924,
        -0.0642733946442604,
        -0.03233032673597336,
        -0.042287081480026245,
        0.08416572213172913,
        -0.04544888064265251,
        0.09711581468582153,
        0.04435180127620697,
        0.04135090857744217,
        0.005590113345533609,
        0.011318947188556194,
        -0.08843284100294113,
        -0.028995387256145477,
        -0.02277047373354435,
        -0.04629367217421532,
        -0.08558695018291473,
        0.0529925674200058,
        -0.04446977376937866,
        -0.017004555091261864,
        0.009983773343265057,
        -0.008554956875741482,
        0.016033144667744637,
        -0.05305071175098419,
        0.07364658266305923,
        -0.0034427158534526825,
        0.03615653142333031,
        -0.05786359682679176,
        0.06878793984651566,
        0.018966468051075935,
        -0.04377910494804382,
        -0.031677473336458206,
        -0.007205641362816095,
        -0.027103479951620102,
        -0.0607769675552845,
        -0.09286244213581085,
        -0.0783354789018631,
        -0.09290119260549545,
        -0.0014013292966410518,
        -0.0660218745470047,
        0.024648349732160568,
        0.025753987953066826,
        -0.08738142997026443,
        0.00927823781967163,
        -0.02240918017923832,
        -0.0011744756484404206,
        0.05436203256249428,
        0.023600628599524498,
        -0.009319156408309937,
        0.05374958738684654,
        -0.08044333755970001,
        -0.05082995444536209,
        -0.0646991953253746,
        -0.053128432482481,
        0.022291360422968864,
        0.002790255006402731,
        -0.01920919306576252,
        0.05178074166178703,
        0.11246487498283386,
        -0.01742376573383808,
        0.07330193370580673,
        0.04974549263715744,
        0.09560716152191162,
        -0.05111763998866081,
        -0.027515612542629242,
        -0.02719947323203087,
        0.02220800518989563,
        0.030366046354174614,
        -0.0424313023686409,
        -0.07380479574203491,
        0.04873323813080788,
        -0.03371390327811241,
        0.10132919251918793,
        -0.08179792016744614,
        0.02285001240670681,
        -0.0017992353532463312,
        -0.02249653823673725,
        0.05217979848384857,
        -0.07528640329837799,
        -0.05856945738196373,
        -0.024064430966973305,
        -0.024324260652065277,
        0.06076815351843834,
        0.04756706580519676,
        0.034375764429569244,
        -0.0056016757152974606,
        -0.02453513629734516,
        -0.11335873603820801,
        -0.06337857991456985,
        -0.00476677855476737,
        -0.01085787545889616,
        -0.050385572016239166,
        -0.04577524587512016,
        -0.013379531912505627,
        -0.02814496122300625,
        -5.117626328268157e-33,
        0.0077175963670015335,
        0.008561096154153347,
        -0.013797007501125336,
        -0.04218330606818199,
        0.09601294994354248,
        -0.10597717016935349,
        0.09196367859840393,
        -0.009379375725984573,
        -0.011669039726257324,
        -0.04011989012360573,
        -0.012227115221321583,
        -0.022507676854729652,
        -0.011192791163921356,
        -0.015476712957024574,
        0.05851099267601967,
        -0.058893147855997086,
        0.0697416439652443,
        -0.08670885115861893,
        -0.0072785294614732265,
        0.02534140646457672,
        0.04337380826473236,
        0.003647839417681098,
        0.00947563350200653,
        0.05080317705869675,
        0.0270281583070755,
        0.040050748735666275,
        0.014306948520243168,
        0.03260353207588196,
        -0.028123747557401657,
        0.0877537727355957,
        0.06331230700016022,
        0.019956236705183983,
        -0.002908222610130906,
        -0.025243321433663368,
        0.07193664461374283,
        -0.013103580102324486,
        0.10446090251207352,
        0.052537702023983,
        -0.03105703368782997,
        -0.07151880115270615,
        0.07162871956825256,
        0.056360021233558655,
        0.01844138279557228,
        0.013223100453615189,
        0.0286472886800766,
        -0.07841677218675613,
        -0.05331147462129593,
        -0.09064347296953201,
        0.03185563161969185,
        -0.013348446227610111,
        -0.010149144567549229,
        -0.043991297483444214,
        -0.006164432968944311,
        -0.04844953492283821,
        -0.03264375403523445,
        -0.018504880368709564,
        -0.042672183364629745,
        0.04950777068734169,
        -0.021584490314126015,
        0.014951454475522041,
        0.04628118872642517,
        -0.033775899559259415,
        -0.0635278970003128,
        -0.03050965815782547,
        -0.023040147498250008,
        0.03203417733311653,
        0.05689983069896698,
        0.07274545729160309,
        0.058022111654281616,
        0.022396981716156006,
        -0.0054558040574193,
        -0.012373806908726692,
        0.06139368936419487,
        -0.033088088035583496,
        0.030248574912548065,
        0.08172199875116348,
        0.07064016163349152,
        -0.06214987859129906,
        0.024583574384450912,
        -0.06876972317695618,
        -0.03621254488825798,
        -0.0726083442568779,
        0.06992636620998383,
        -0.03526195138692856,
        0.06897124648094177,
        -0.0739215686917305,
        -0.002291555516421795,
        0.032680243253707886,
        0.010273088701069355,
        0.007830269634723663,
        -0.03527894988656044,
        0.02897372841835022,
        -0.05908293277025223,
        0.055687375366687775,
        0.09161921590566635,
        -6.05157239874643e-08,
        -0.014693408273160458,
        0.018887724727392197,
        0.02452293410897255,
        0.012242959812283516,
        -0.042417339980602264,
        -0.1510743498802185,
        0.052505042403936386,
        -0.0641784742474556,
        0.06648456305265427,
        -0.016262341290712357,
        0.007217996288090944,
        -0.11677968502044678,
        0.007248665206134319,
        0.053047001361846924,
        0.07660319656133652,
        0.05614830553531647,
        -0.06960130482912064,
        0.11013977229595184,
        -0.04869070276618004,
        0.04537101462483406,
        0.004414529539644718,
        -0.011988898739218712,
        0.06332388520240784,
        0.0007034075679257512,
        0.09759977459907532,
        0.03935551270842552,
        -0.0036093241069465876,
        0.040196165442466736,
        0.1480778306722641,
        -0.08493915945291519,
        -0.019340423867106438,
        0.062472421675920486,
        -0.061864785850048065,
        0.01723979227244854,
        0.019539808854460716,
        -0.007148486562073231,
        -0.02668703906238079,
        0.04760098084807396,
        0.06483756005764008,
        0.0811464712023735,
        -0.007566483691334724,
        -0.08138026297092438,
        -0.07453715801239014,
        0.02493651956319809,
        0.0013305037282407284,
        -0.027660910040140152,
        -0.01935706101357937,
        -0.061050381511449814,
        -0.009113632142543793,
        0.047916900366544724,
        -0.01986912451684475,
        0.01270299032330513,
        -0.031113551929593086,
        -0.054816242307424545,
        0.10865592211484909,
        -0.03662658855319023,
        0.05856183171272278,
        0.09382593631744385,
        0.0213653314858675,
        0.019549719989299774,
        -0.050740644335746765,
        -0.02950594760477543,
        -0.013471259735524654,
        0.08833211660385132
    ]
}