{
    "id": "RvkWB1NLJFQ",
    "title": "We stole the Brakes from a Tesla! - Totally Silent Electric Hummer?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-09-22T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=RvkWB1NLJFQ",
    "category": "Howto & Style",
    "tags": [
        "Electric Hummer",
        "Electric Humvee",
        "Electric HMMWV",
        "EV conversion",
        "ibooster",
        "tesla",
        "tesla model S",
        "cybertruck",
        "rivian",
        "Ford lightning",
        "electric brake booster",
        "electric truck",
        "diy electric truck",
        "oshcut",
        "laser",
        "tesla truck"
    ],
    "views": 1186899,
    "likes": 67231,
    "comments_count": 3853,
    "description": "Its time to install our Quiet brakes. Permanently borrowed from a Tesla Model S. HUGE thanks to OshCut for laser cutting my brake adapter:  If you want your own laser cut Unofficial Model of a CyberTruck: The FREE download can be found HERE  Then drag and drop the .dxf files onto OshCuts website here:  make sure you select the right gauge of stainless steel (its in the file name). To get the final price of around 20 bucks for the small one, and 60 bucks for the large one, add the code 'JERRYRIG1' (all capitals) to get rid of the setup fees. If you're still confused after all that just watch this video for a walkthrough:   Watch all the EV Humvee build videos in order HERE:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.OshCut.com",
        "https://www.thingiverse.com/thing:4934326",
        "https://www.Oshcut.com",
        "https://youtu.be/6WRsA91If4M",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "*high pitched annoying background noise* We have a bit of a problem....noise. If you remember, we installed the brakes and power steering, but we're using hydraulics. And the noise you hear behind me, which I'm sure you're loving at this point, is a pump that needs to be running constantly. It is applying about a thousand pounds per square inch to the brakes and the power steering, which is what we need in order to control the vehicle more easily when it's electrically powered. But this noise is going to drive me insane especially when the Humvee's name is Whisper... because it's nota Hummer anymore... but I think we found a more silent solution. This is called an iBooster and it comes out of, like, a Chevy Bolt, the Tesla Model S, the Honda CRV's. A lot of vehicles use this for their power braking. So once we install this bad boy into the system, the noise you hear will be gone, hopefully permanently. We have a solution for the power steering as well, but let's get started. [Intro] *high pitched noise still happening* *High pitched noise stops* Finally. Alright, so down there we have the hydraulic pump which is pushing hydraulic fluid up here into this guy, which is called a hydroboost. And it fits very comfortably inside of this little compartment going through to the brake pedal underneath the dash. What's super convenient though is that this machine fits very perfectly right inside of here. I mean there's different bolt holes and stuff, but for the most part all we have to do is tap into the brake lines here, connect to the new iBooster, and the iBooster will only apply brakes and sound as we need them. They won't be running constantly in the background. For me the sound alone was enough to switch to this new system, but there's also the power aspect we have to consider. Having a pump running constantly in the background at I think around 20 amps, would actually have a significant impact on our range. And even though we're shaped like a brick, range is still rather important. And this iBooster will draw significantly less power. Let's put it in. There we go. Thanks Jacob! Sorry, Brian, all our hard work is coming out. So in the original Humvee, this is the hydroboost I was talking about earlier. And this is the brake master cylinder which, if we pop these off and take a look inside, we can see all the brake fluid. Apparently there's a compartment for the rear brakes, as well as the front brakes....which we don't need anymore because this has everything built into it. But as we can see, this is what connects to the brake pedal and pushes in for the hydraulics. This right here is what we need to connect to the brake pedal for our electronic situation. All of that going through into the cabin right there. So I just peeled off this gasket. Check out that paint job. So this is what color the Humvee used to be. You can tell that it used to be green as well underneath the bonnet, but at some point they painted it tan, which, I mean, looks pretty good. Here, underneath the dashboard we have the brake pedal. We will clean up the rats nest of wires later. But obviously the brake pedal has a knob right here which is what the iBooster is going to attach to, coming out of that hole in the firewall. Surprisingly this setup is not exactly plug and play. They are very similar in size but the bolt patterns are different. And we discovered that if we take the bolt pattern for the iBooster, we run into some of the structural supports on the firewall which we don't want to mess with. So what we're going to do is we're going to create an adapter plate using lasers. Once again using OSHcut.com. Just taking my design, throwing it on the website and having it laser cut and shipped to me the next day. Their industrial laser is crazy fast and usually finishes cutting my parts before I'm able to finish talking about the parts that I'm cutting. Anyone can upload their designs and use oshcut.com. This video isn't sponsored, they just let me come hang out with their machines and I think it's pretty cool. Once I have the parts we can take the bracket that goes onto the iBooster end and put it inside of a pipe. The pipe acts as a spacer between the two adapter plates. The first one obviously connects to the iBooster. The other one connects to the firewall where the previous hydroboost bolt patterns were sitting. That way we can mount our new unit with this adapter plate without cutting any new holes in the firewall. It's also angled slightly so that the iBooster kind of angles down towards that little niblet on the brake pedal, so as the brake pedal gets compressed, it'll be able to hold this rod and push it up into the iBooster like it was designed for. Beautiful. So once again underneath the dashboard, don't judge my wiring job, this is the brake pedal. We have the iBooster sticking through, but we need to put a stud up here instead of down here so it fits better. Which means now that we've marked it, we need to remove this bolt up top so we have this wrench connected. And in order to get more leverage, we can crank it like this, and spin that nut. There's a big bolt. Since the iBooster wasn't technically made for Humvee applications, we do have to do some modifications to the brake pedal. One, we have to transfer the lug stud up a couple inches because the iBooster sits a little higher underneath the hood than the original brake contraption did. You can see the two coats of paint that has been on here. The green paint that was from earlier and the tan paint that's from now. Kind of the same thing that we're seeing over here in the engine bay as well. It used to be green, then it was tan. Still not sure what color it's going to be next. Let me know what you think down in the comments. Pretty sure I have something on this lens. And with the bolt head ground down it fits perfectly in our newly drilled holes and will become the new stud that we attach the brake booster to. We also have to extend the iBooster just slightly, but that's pretty easy since we have a laser. Lasering out the teardrop shaped piece of metal, we can press a brass bushing into the opening. This is what's going to sit on that lug stud and rotate as we're pushing the brake pedal inward. And to get the teardrop shaped piece of metal to connect to the iBooster, we'll just drill a hole and use the original connection that would have fit perfectly if this was a 2015 Tesla Model S. Finally, lining everything up underneath the hood, and underneath the dashboard. It's kind of hard to see it up in there, but we have that spacer attached to the iBooster and when we press the brake pedal you can see it compressing. It looks like everything works. I imagine that there might be a little bit of concern for people wondering why we put a car brake booster inside of this massive truck. But keep in mind that the Tesla Model S in 2015 still weighs about 5,000 pounds, as well as a top speed of 155 miles an hour. So if it can slow down a car that heavy at those speeds, it'll be able to slow down my truck which weighs about the same, between 5-6,000 pounds. But our top speed is 80. I'm not an expert in physics, but the brake booster should be able to get the job done. These are the new brake lines for the iBooster sitting right here. The brake lines will plug in from this side in those two little holes, and then go into the existing setup down here. And those brake lines will be able to take the brake fluid and bring them down to the calipers. It is connected. One interesting thing is that one of the hoses is bigger than the other, or one of the connectors at least, because the front wheels have more stopping power than the rear wheels. You want them to start slowing down the vehicle first. So this one is the front, and then back here is the rear tires. We will still have to bleed the brakes down by the calipers just to make sure there's no air in the lines. The calipers are up here inside, and not down by the tires, which is kind of fun. Powering the iBooster gets a little more difficult. So on the iBooster itself it has a large plug down at the bottom and then another plug right over there. And those are both proprietary. So what we had to do is buy a Tesla Model S harness from 2015 so we can just take the plugs off that we need. Luckily these are pretty easy to find on EBay. The only two plugs that we need on this whole contraption is this guy right here which plugs into the brains of the iBooster, and this guy right here which is the brake position sensor. And we only need three of the wires. The yellow with the gray stripe, the red, and the red with a white stripe, and of course like always, the ground wire. And we can snip off the rest. The rest of the wires are probably for the self-driving, you know, Tesla's autopilot. The iBooster has the ability to slow down the vehicle without input from the driver. Kind of like we saw with mobilized self-driving taxis. And maybe at some point I can rewire my Humvee so it'll do some self driving stuff as well, but that's not today. Wiring it up is actually relatively simple since we have that Tesla wiring harness. I can use the same 12 volt control board that you saw in a previous video just using my relays and fuse panel to control the iBooster. The iBooster needs to be on a 40 amp fuse, which conveniently there's one located in the Tesla wiring harness so I'm going to steal that and just use it in our system. The fuses are called maxi fuses and are pretty common. You can get a whole kit on Amazon for about $10. The power is going from the battery, through the fuse, then to the relay, all the way to the iBooster, along with a signal wire running up to the fuse box. Joining the harness we cut, along with these fresh wires I just ran, and we should be ready to test it out. At some point I am going to clean up all these wires with a wire loom, it's just hard to put the loom on when I'm not sure how many more wires I need to add to the system. Let's test the brakes. I'm like 90% sure they're on and it's totally silent. I'm going to flip the key the second time. Yeah, you can hear it engage. It is super easy to press this brake pedal. So I think we know it's working because when the car is off...and by car I mean military Humvee turned electric...it's really difficult to press the brake pedal. Once we turn it back on it is super easy. I consider that a complete success. It is currently on right now which is much better than how it sounded at the beginning of this video. We are one step closer to this being a completely silent electric vehicle. I have a pretty good idea of how we're going to do the power steering, but I'm going to save that for the next video. OSHcut's discount code for the laser cut cybertruck is still active. I'll leave that information also in the video description. Feel free to leave any questions you have down in the comments below. Hit that subscribe button if you haven't already. Turn on notifications, and come hang out with me on Instagram and Twitter. Sometimes there's a few sneak peeks over there. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "brake pedal",
        "brake",
        "iBooster",
        "pedal",
        "Tesla Model",
        "brakes",
        "brake lines",
        "Tesla",
        "power",
        "noise",
        "brake pedal underneath",
        "Humvee",
        "Bolt",
        "high pitched noise",
        "power steering",
        "brake booster",
        "underneath",
        "pretty",
        "wires",
        "brake fluid"
    ],
    "transcript_entity_values": [
        "Honda",
        "CRV",
        "iBooster",
        "a couple inches",
        "the next day",
        "Hummer",
        "155 miles an hour",
        "2015",
        "between 5-6,000 pounds",
        "Instagram",
        "two",
        "20",
        "about a thousand pounds",
        "three",
        "iBooster",
        "Humvee",
        "Brian",
        "OSHcut",
        "Tesla Model S. Finally",
        "about 5,000 pounds",
        "Amazon",
        "iBooster",
        "90%",
        "12 volt",
        "80",
        "EBay",
        "Tesla",
        "first",
        "Chevy Bolt",
        "control board",
        "second",
        "today",
        "40",
        "Jacob",
        "only two",
        "about $10",
        "One",
        "cybertruck",
        "one",
        "Tesla Model S",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "ORG",
        "PERSON",
        "ORG",
        "EVENT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.13849227130413055,
        0.035389821976423264,
        0.04728197678923607,
        -0.02019554004073143,
        -0.034980110824108124,
        -0.02353164367377758,
        0.025716714560985565,
        0.0535195954144001,
        -0.044109586626291275,
        -0.005395819898694754,
        0.052655283361673355,
        -0.023421358317136765,
        0.04478943720459938,
        -0.02048385702073574,
        -0.08679955452680588,
        -0.023732295259833336,
        0.028299648314714432,
        -0.020231204107403755,
        0.006617133039981127,
        0.04681781306862831,
        -0.009570416063070297,
        0.017012296244502068,
        0.04880639165639877,
        -0.017567237839102745,
        0.014601651579141617,
        0.07676135748624802,
        -0.030857017263770103,
        0.07235191017389297,
        -0.03424474596977234,
        -0.05570412799715996,
        0.0688338354229927,
        -0.0023373637814074755,
        0.032157838344573975,
        -0.014534457586705685,
        0.07238154858350754,
        -0.05939311534166336,
        0.04602302983403206,
        0.03860871121287346,
        -0.022555533796548843,
        -0.07131780683994293,
        0.0013175471685826778,
        -0.09186168015003204,
        -0.005190100055187941,
        -0.06524471938610077,
        0.030917182564735413,
        -0.006799248978495598,
        0.01881473883986473,
        -0.1295228898525238,
        0.0519363135099411,
        -0.003856765804812312,
        -0.03640108183026314,
        -0.031286515295505524,
        0.08647375553846359,
        -0.029995962977409363,
        -0.00457423971965909,
        -0.07502645254135132,
        0.05131087824702263,
        -0.010081443004310131,
        0.03465668857097626,
        -0.010748129338026047,
        0.030531154945492744,
        -0.04195411503314972,
        -0.04054541885852814,
        0.042342159897089005,
        0.07607677578926086,
        -0.07479001581668854,
        0.0037706547882407904,
        -0.11432622373104095,
        -0.0925438404083252,
        -0.004734827671200037,
        -0.07587209343910217,
        -0.01097879558801651,
        -0.029627934098243713,
        0.0001645370793994516,
        -0.005446349736303091,
        -0.03125617280602455,
        0.0785173773765564,
        0.024273980408906937,
        -0.0494820736348629,
        0.032868821173906326,
        -0.016379956156015396,
        -0.021812990307807922,
        -0.03207109495997429,
        0.0026013273745775223,
        -0.052408307790756226,
        0.025138135999441147,
        0.042469222098588943,
        0.015082461759448051,
        0.07496224343776703,
        -0.03820238262414932,
        -0.016489868983626366,
        0.005952265579253435,
        0.0015897293342277408,
        -0.03803938254714012,
        -0.06683991104364395,
        0.03337085619568825,
        -0.025731435045599937,
        0.01465407945215702,
        -0.014840246178209782,
        0.05357133224606514,
        -0.0034054312855005264,
        0.028628535568714142,
        0.029787005856633186,
        -0.09315057843923569,
        -0.02138885296881199,
        -0.00702942069619894,
        -0.10270242393016815,
        0.08025787770748138,
        0.015788784250617027,
        -0.01874101161956787,
        0.01620095781981945,
        0.017049089074134827,
        -0.10990510880947113,
        -0.013945081271231174,
        0.02631470561027527,
        0.01631051115691662,
        -0.0826234295964241,
        0.023642495274543762,
        0.14097489416599274,
        -0.009009924717247486,
        0.03369034454226494,
        -0.0031532985158264637,
        -0.024961166083812714,
        0.08875559270381927,
        0.07576623558998108,
        0.02466416172683239,
        -0.10170814394950867,
        1.5868113954475218e-33,
        -0.012989066541194916,
        0.11303447932004929,
        -0.0024874687660485506,
        -0.04064438119530678,
        -0.00033327002893202007,
        -0.0014431450981646776,
        -0.004685587249696255,
        0.1062660962343216,
        -0.04102111607789993,
        0.07452243566513062,
        0.04219697043299675,
        -0.0009614271111786366,
        -0.011676608584821224,
        -0.00920258928090334,
        0.026288775727152824,
        -0.10009510815143585,
        -0.05215633660554886,
        -0.07961654663085938,
        -0.05230225622653961,
        -0.04623200371861458,
        0.015092211775481701,
        0.029363051056861877,
        0.1087101399898529,
        0.147775337100029,
        0.06378184258937836,
        0.027164803817868233,
        0.02404053881764412,
        -0.03867780417203903,
        0.05703600496053696,
        0.037333160638809204,
        -0.10951974242925644,
        0.057729270309209824,
        0.053569626063108444,
        0.01113782450556755,
        0.04475666582584381,
        -0.02320224978029728,
        -0.07329253852367401,
        -0.0834071934223175,
        -0.0374155230820179,
        -0.025173021480441093,
        0.04202963039278984,
        -0.04325299710035324,
        -0.06849810481071472,
        -0.04944469407200813,
        0.02980291284620762,
        -0.040767017751932144,
        0.0012659856583923101,
        0.005297313444316387,
        0.10961701720952988,
        0.018082641065120697,
        -0.04553829878568649,
        -0.008745252154767513,
        0.04897147789597511,
        0.011142067611217499,
        -0.14118297398090363,
        -0.016713634133338928,
        0.060934025794267654,
        -0.013465006835758686,
        0.026377297937870026,
        0.010813923552632332,
        -0.05189314857125282,
        0.014254127629101276,
        0.06772778928279877,
        0.01831938698887825,
        -0.03887118771672249,
        0.050221651792526245,
        0.024910058826208115,
        0.04651444032788277,
        -0.041982654482126236,
        0.02692471817135811,
        -0.07229733467102051,
        -0.0065987310372292995,
        0.03507285192608833,
        -0.023877272382378578,
        0.01784682273864746,
        -0.023817557841539383,
        -0.04661702737212181,
        0.10169067233800888,
        0.04572198539972305,
        -0.05085271596908569,
        -0.06967153400182724,
        0.03736355900764465,
        -0.017114633694291115,
        -0.008884962648153305,
        0.052014127373695374,
        -0.02708415314555168,
        0.039459485560655594,
        0.009075453504920006,
        0.0027172467671334743,
        -0.04265669360756874,
        -0.0427059605717659,
        -0.04424483701586723,
        -0.08891119062900543,
        -0.002849631942808628,
        0.03446732833981514,
        -5.407642825135093e-33,
        0.02038544788956642,
        0.03290228918194771,
        0.05919770151376724,
        0.02368876151740551,
        0.044555503875017166,
        -0.025961454957723618,
        0.0021992367692291737,
        0.05931895598769188,
        -0.00852004811167717,
        -0.014280588366091251,
        0.004295081831514835,
        0.042383309453725815,
        -0.04342975094914436,
        -0.01674089953303337,
        0.007389970123767853,
        0.03323134779930115,
        0.003177194856107235,
        -0.03223305195569992,
        0.01637747511267662,
        0.012799576856195927,
        -0.020302588120102882,
        0.10889969766139984,
        0.0645744800567627,
        0.02039153128862381,
        -0.03040686435997486,
        0.011541343294084072,
        -0.000357223441824317,
        0.013173838146030903,
        -0.002381263067945838,
        0.06043708324432373,
        -0.13681043684482574,
        -0.011627147905528545,
        -0.01082678698003292,
        0.030716504901647568,
        -0.06886276602745056,
        0.0166628435254097,
        -0.020196206867694855,
        0.0487162284553051,
        -0.0071116299368441105,
        -0.054928965866565704,
        -0.026736758649349213,
        -0.011743073351681232,
        -0.0036646868102252483,
        0.032203514128923416,
        -0.059995751827955246,
        -0.05300608277320862,
        -0.03915025293827057,
        -0.023045307025313377,
        -0.028797658160328865,
        0.09897647053003311,
        0.04849178344011307,
        0.03616705909371376,
        0.051068779081106186,
        0.048369862139225006,
        -0.0751878023147583,
        -0.04618758708238602,
        0.07206448912620544,
        -0.02606588788330555,
        -0.020783478394150734,
        0.044079892337322235,
        0.0014031835598871112,
        0.06668297201395035,
        0.05481405183672905,
        -0.006802144460380077,
        0.020414825528860092,
        -0.08596924692392349,
        0.019789274781942368,
        0.019014861434698105,
        -0.04846445471048355,
        -0.02896881103515625,
        0.02128201350569725,
        0.032790664583444595,
        0.05998396500945091,
        -0.09796054661273956,
        -0.01594281941652298,
        0.025366058573126793,
        -0.01938888616859913,
        -0.0358080230653286,
        -0.024400904774665833,
        -0.021845495328307152,
        0.012035070918500423,
        -0.016860799863934517,
        0.01742599904537201,
        0.09186522662639618,
        0.018636267632246017,
        -0.012431487441062927,
        -0.012032434344291687,
        0.03649168089032173,
        -0.010567267425358295,
        -0.0027683693915605545,
        -0.05110379308462143,
        0.04944296181201935,
        0.10311247408390045,
        0.0603550523519516,
        -0.10181677341461182,
        -6.116325579341719e-08,
        0.007364840246737003,
        0.02904730848968029,
        -0.05170295014977455,
        0.024456260725855827,
        0.15774594247341156,
        -0.029553953558206558,
        -0.03389924019575119,
        -0.009984513744711876,
        -0.07004354894161224,
        0.026992442086338997,
        0.08068296313285828,
        -0.034602515399456024,
        0.03305297717452049,
        0.06194515898823738,
        -0.10096918046474457,
        -0.05112002417445183,
        -0.007416851352900267,
        0.10894225537776947,
        -0.06514906883239746,
        -0.02833067812025547,
        -0.053328029811382294,
        -0.06230253726243973,
        0.039939045906066895,
        -0.009480596520006657,
        0.01845388673245907,
        -0.00310413702391088,
        -0.05564078688621521,
        0.006498937029391527,
        0.019378850236535072,
        0.008727097883820534,
        -0.08218517154455185,
        -0.024347810074687004,
        0.0220328401774168,
        0.008851541206240654,
        0.025546126067638397,
        -0.07440956681966782,
        -0.1120428591966629,
        -0.028243595734238625,
        0.043737176805734634,
        -0.011447860859334469,
        0.0427885428071022,
        -0.033515237271785736,
        -0.03477330505847931,
        0.020648974925279617,
        -0.06196194887161255,
        0.05857306718826294,
        -0.12337121367454529,
        -0.18195997178554535,
        0.03736279159784317,
        0.11569146811962128,
        -0.0006397426477633417,
        0.02304665930569172,
        -0.04855119436979294,
        7.81450726208277e-05,
        0.007687869481742382,
        0.04451752454042435,
        -0.02298654057085514,
        0.026481276378035545,
        0.011248589493334293,
        -0.011067692190408707,
        0.02755051665008068,
        -0.09174752235412598,
        0.0487329363822937,
        0.03739972040057182
    ]
}