{
    "id": "RyeRBwVK3tM",
    "title": "I was too poor to afford this",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-05-19T16:07:48Z",
    "video_url": "https://www.youtube.com/watch?v=RyeRBwVK3tM",
    "category": "Science & Technology",
    "tags": [
        "Retro",
        "Gaming Pc",
        "Gaming magazine",
        "Retro PC",
        "Retro Gaming",
        "Gaming Rig",
        "Vintage Tech",
        "vintage PC",
        "Windows",
        "Microsoft",
        "Worst",
        "Best",
        "Dream",
        "Logitech",
        "Dream PC",
        "Magazine Feature",
        "Lost PC"
    ],
    "views": 1646229,
    "likes": 57110,
    "comments_count": 3082,
    "description": "Treat your feet with Vessi! Save 15% on your first order at   Check out Ridges Fathers Day sale at  and enjoy up to 40% off!  Sometimes PC DREAMS DO become reality! Weve assembled high-end gaming parts of years past to build our top tier fantasy retro desktop rig. But there are a more than a few hiccups, and maybe our Dreams will transform into nightmares. Y2K more like WHY-2K? Either way, the 2001 Dream Machine from Maximum PC is here.  Discuss on the forum:    Check out Victor Bart and RETRO Machines here:    Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro  CPU 1:00 Motherboard  1:58 RAM 3:08 Case  4:08 Why dont they do this anymore? 5:06 The Deathstar 6:57 The Disk Drives 8:23 Power Supplies can be NICE too 9:21 GPU 10:00 Does it turn on? and also other Add-in Cards  11:40 This Monitor is SICK 12:11 This Mouse and Keyboard are NOT 13:21 This Audio Setup still holds up today. 16:47 Playing Games  this thing can push THAT much?",
    "description_links": [
        "http://vessi.com/LinusTechTips",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1570820-i-was-too-poor-to-afford-this/",
        "https://www.youtube.com/@victorbart",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "This CPU is ancient technology by today's standards. One measly core clocked at just 1.8 gigahertz, but when I was in grade 9, this Pentium 4 processor was crowned the Benchmark Destroyer by Maximum PC Magazine. It ran Quake 3 at a blistering 226 frames per second. That... is 18% faster than the very best that AMD could muster at the time, though it would have cost you an extra 450 today dollars for the privilege. Now, at that point in my life, my only source of income was the shiny loonie that my parents would give me for each wheelbarrow of manure that I hauled to the garden. So, to say that this would have been out of reach for me would be a gross understatement. And even if I could afford the CPU... There is no way that I would have been able to obtain the supporting cast, starting with this premium Asus P4T motherboard with both software and hardware overclocking controls. One day, I told myself, one day, the price of all of this will come down and I will build a dream machine of my very own. Well, guess what, folks? It's one's day, and the pile around me might not look it. But in September of 2001, this was Maximum PC's dream gaming machine build. \"Dream\" being an excellent choice of words, since the total cost was about $5,700 US dollars. That is almost three Vision Pros in today's money. It was a lot cheaper today, but eBay fees are still a trip, and I could use some help paying for all this from our sponsor, Ridge. It's almost Father's Day and Ridge is here to help you be the favorite child. Get something nice for your dad at their Father's Day sale with some items up to 40% off. Check it out using the link in the description. Now, I showed you guys the CPU and motherboard, but what about our eye-watering 256 megabytes of 800 megatransfer per second RDRAM from Samsung. That's right, it wasn't always DDR. RAM this memory was chosen for this build because of its smarter bandwidth utilization compared to DDR. In hindsight, it was not a great standard. It ran hot, was power-hungry and generally performed worse per dollar and went out of style just around the time this build was specced. But hey, sucks to be us, I guess. Like modern DDR memory controllers, you could run RDRAM in dual channel for increased bandwidth. But it was just dumber. That is to say that if you only had two sticks, you had to install these dummy modules in the empty ones in order for it to operate properly. It was a pretty good system. Here's a bizarre one. At this stage in the game, aftermarket CPU cooling was more of an afterthought, with Maximum PC opting for the box cooler from Intel. Which isn't to say that PC cooling didn't matter, it was just more about case selection. This is, in my humble opinion, one of the big highlights of this build, the Cooler Master ATC-201. We had to reach out to fellow YouTuber Retro Machines, who made a video covering this case 10 years ago, in order to get our hands on one. That is how rare these things have become. Thank goodness he still had his kicking around. It supports up to 10 drives, including four internal hard drives. It's got support for four fans, two in the front, one in the back, one in the top. And it's even got two front USB ports, which, guys, was not a given back then, okay? Of course, none of that is what's turned it into an absolutely timeless piece of gaming history. That is the aesthetic. Snake oil marketing about convective cooling aside, as Maximum PC put it, \"Nothing says swank better than brushed aluminum.\" And that is so brushing true. Also, can we take a moment to appreciate this build quality? Damn, they don't build them like that anymore. Speaking of ludicrous overbuild, here's a cool feature that we used to see on high-end cases. Removable motherboard trays. And the idea was that, oh yeah, you can build the whole platform outside of the case and then slide the whole thing in when you're good to go. So convenient. Now all I need to do is slide this into the case. Do most of the build and cable tie everything into place, effectively locking the motherboard in. Yes, you can see why these didn't last. Archaic oddities aside though, it's fascinating to see how little the ATX standard has actually changed. Aside from maybe making some extra room for a power supply and adding some speed holes for more cooling, you could absolutely build a modern system in this thing. Of course, that isn't the exercise today. It's been a while since I've installed Spinning Rust as a boot drive in a gaming PC, but today we've got not one, but two identical IBM Deskstar 60GXP hard drives. At least, that's what we ordered. Then one of them showed up as, uh, not one of those. Which is kind of an issue, since Maximum PC calls for a very fast striped RAID 0 boot config. Except that they didn't know that Desk Stars, especially the 75 GXP family, would earn the nickname Death Stars for their exceptionally high failure rates and would contribute to IBM divesting of its entire hard drive business to Hitachi just one year after the publication of this issue. So from my point of view, we should just appreciate the one in a million shot that one of these showed up in working order. Run the system off that and then our promised fast track 100 TX2 raid card can just be for decoration. Now as Maximum PC put it, rounded IDE cables provide no better performance, but they elicit oohs and ahhs whenever we show off the machine and they felt this was well worth their hefty price tag. Now this one's a little bit more ooh and ahh, but Hey, at least we also have some black wire loom to cover it up Speaking of cable management you guys should check out our sick new cable management arches at LTTstore.comm Just keep the more powerful magnets away from your hard drives now We just got to figure out how to get the games onto the hard drive It sure isn't gonna be with the network port on our motherboard Don't worry guys. We are gonna add a network card, but that isn't gonna be how we install games for that We're gonna need the TDK the law CD You show me better branding and I will show you a liar. That is hilarious It offers up 24x write speeds 10x rewrites 40x read speeds and they claimed burst reads of up to 16.6 megabytes per second, which hilariously is just about the average worldwide broadband internet speed today So good job TDK and it had even more going for it. One of its killer features was its proprietary burn-proof technology, which allowed you to safely write or burn a disc while using your PC for other applications without worrying about buffer under run errors. With other drives, doing so much as interacting with your computer at all, depending on the overall speed of your system, would often lead to shiny but useless coasters. Back then, by the way, it was also common to have a secondary optical drive to make the creation of backup media easier. You could burn straight from disc to disc or so you could just leave your favorite game installed on the drive while you created an mp3 mix CD. So that's why we also threw in this Toshiba SDM1217 DVD drive. Rounding out our drive selections, the most exciting thing I can say about this Samsung floppy disk drive is that it's silver and sort of matches the color of her case. Thankfully things get a little more electric when we move on to power. We've got the PC power and cooling Silencer 420. Okay, it's not quite the same as the 400 watt unit that the magazine suggests, but come on guys. Finding exact part number matches for e-waste from 23 years ago is hard, and this one is definitely nicer. In any case, this line of Seasonic manufactured units had a good reputation for both reliability and for quiet operation. I gotta say, it's kinda wild to me that 420 watts was enough to power an entire top-end gaming machine when we've got consumer CPUs that will draw nearly that much today alone. I guess this is the part in the build where we give up on the cable management and take a leaf out of Maximum PC's book. Yes, split loom wire covers. They were awful then, and they're awful now. On the subject of things with very different power requirements today, it's finally time for the pice de rsistance, this ASUS NVIDIA V8200 Deluxe. A GeForce 3 card with an AGP 4x interface, 64 megabytes, that's right, 64 million bytes of video memory, and a rated 200 megahertz clock speed that, by the way, this variant, juices all the way to 270 megahertz. As if you guys weren't drooling already, it has four pixel shaders, one vertex shader, support for DirectX 8.1, and OpenGL, which brings us to all the other fun cards we get to install. I already talked about our IDE RAID card, but we've got two more devices, our 3Com 100 megabit per second network card, and this one's cool, our Hercules Game Theater XP, which we're gonna dive into a little bit more as we set up our audio. First, we need to see if this thing even works. Oh, that's a good sign. No, no, it's on. It's on. Yeah, give it a sec. Give it a sec. It's got this beep is good That means I wire up the speaker correctly. Let's go. Hey, there we go Manual frequency let's overclock. No, let's not overclock yet. Let's just make sure we've got the right boot device selected We may want to pull up the IDE raid card Okay, I know, I know. The Death Star recommendation wasn't the only one that wouldn't age well. Windows ME, the last DOS-based Windows, is widely considered to be the worst version of Windows ever released, largely because it was a reliability nightmare. But unfortunately, when this system was published in Maximum PC, Windows XP had been released to OEMs, but was still about a month away from retail. So... This is what we got. Oh, I guess we could start talking about peripherals though for our monitor We ended up looking over a few pages to the dream content creation guide and found the Sony FW 900 Arguably the best consumer CRT ever made. This thing is so legendary We made a dedicated video about it and it is one of the only three parts of the setup that are actually worth more today Than they were at launch. It's around $3,000 for one in good condition, but at up to 1440p at 60 Hertz and up to 160 Hertz at lower resolutions with near-perfect blacks and motion clarity. It's a pretty incredible display even now Can I make a comment about this mouse? Yeah, I hate it was this really their recommendation Yeah, it vibrates every time you hover over an icon Yeah, that's awful neat the Logitech. I feel Why would you point and click when you can feel and click here? I'm going to try and get my mic close to this thing Can you hear that? Making matters worse it is heavy as all get out which doesn't even appear to be all the vibration motor It looks like it has a big metal plate in it. I guess that was a feature Thankfully the keyboard choice was a little less polarizing. This is from Keytronics lifetime series and it uses Keytronics designer rubber dome switches supported with springs. These were not favored by keyboard enthusiasts and honestly feels pretty cheap but maybe it was good bang for the buck. This is wild. They claim it's similar in performance to a Topper Realforce. You know what? It's not that bad to type on. It's mushy though. It's not great. It's not great. What is gonna be great is our audio experience, starting with the other half of the Hercules Game Theater XP that I showed you guys before. You see the card only has two ports on it, an aux-in and a DB44 connector. What goes at the other end of this thick two meter cable? This awesome external module. I'm talking analog 5.1 for surround sound speakers, every input under the sun, quarter-inch jack, RCA, MIDI, coax, and SPDIF. It's got built-in volume controls, a game port for your joystick, and did I even mention it's got a four-port integrated USB hub? This module makes connecting everything much easier, not just our audio. Sound card, like everything card. Of course, that is what we're going to use it for first, though. I remember these. I had a set of these, the Klipsch ProMedia Ultra 5.1s. These would continue to be the dream speaker setup for PCs for years to come. CNET called the subwoofer \"the best of any multimedia speaker system we've tested.\" And they were right. Long story short, I made the mistake of selling mine for a fraction of what I paid for it back in the day, makes the price we paid to replace it so much more painful. That's right, my friends. This is one more item that regularly goes from about the same today than it did back when it was new. And that's even if you can find the all-important control pod and subwoofer with bash. Oh, are we crab raving right away? Yes. Man, I miss my Premier Ultra 5.1s. Oh, yeah. No, no, these things were legitimately awesome. Also, are my surrounds my primaries? I think it might be a little confused by the MP3 encoding. But the sub works. David did you check this out? The center channel has a cute little stick so you can change the height depending on what works best for your angle. But can you have it point up? Uh, no. Hold on, you gotta stand in the sweet spot though, you gotta come stand in the sweet spot with me. Hold on, you're a little close, you're a little close. Oh yeah. Is the sub working? Is it ever? With bash technology. I would be so happy to have this set up. Man, dude, when I was like 16 and I had this, I was in heaven. What went wrong? Maximum PC acknowledges though, that not everyone has a living situation that's conducive to a giant bulky 5.1 setup. So that is where these come in. Now I never really needed headphones living in my mom's basement at the time, literally. But if it's on the list, we got to buy it, them's the rules, and the Sennheiser HD 580s actually still hold up very well today. Plastic construction compared to newer Sennheisers means they don't really feel as premium, but it also means they're super light, and they have a nice neutral sound profile that makes some feel that they are worthy of being called \"end game\" headphones. Oh, look at this, Andrew! They're made in Ireland, just like you! Now, I've made one critical error in our configuration for return to Castle Wolfenstein I set it to my desktop resolution of 1600 by 1200 forgetting that Yeah, in those days, it's really more like 800 by 600 if you want Hey, or maybe I could just run it at 1600 by 1200 Damn, I guess that's what having a top-of-the-line gaming PC did for you. This like unironically works So this game gets capped at 90 FPS Which I'm surprised we had a surprise we're getting anything close to that dude neither I nor anyone I knew had anything like this Anything even close to this if I saw this I'd be like What that's a thing that's possible in 2001 people were gaming like this No, man in 2001 like what was I playing Warcraft 2? Anno 1602 What about a racing game though? Yeah, I could get into that kind of busy playing return to Castle Wolfenstein right now But like yeah, sure I guess The rest of us are busy making videos Linus All right, let's talk about something else with force feedback. This time it's the Logitech Wingman Formula Force GP. Oh man, this feels pretty basic compared to a modern high-end racing wheel. Compared to a modern low-end racing wheel. Yeah, that's true. I feel like I'm in 2001 sitting in my dad's lap operating the car. Okay, hold on, 2001. No, I wouldn't have needed to sit in my dad's lap. You're like a 16 year old. No, no, no, I was, no, in 2001 I was 13. It's still a little old for the dad's lap, yep. Here we go. Driving the Lotus Elise. Whoa. Oh, is this opposite day? You know what? I can deal with this. No, I can do this. I can do this. I got this. I got this brother. This beautiful like what? 25 frames 30 frames a second. That's more than that. You know what? This is very playable, but you're not wrong. It's probably in the, ow. Zero Points, zero points for my shortcut. Why is it opposite? How dare you tell me I'm going backwards? I will tell you when I'm backwards. Oh Come on copper You're in the way, buddy Let me race Brother is that a missile is it firing things? Yep, you did I never played this game back in the day Look, I didn't have a computer that could play this game back in the day. It looks not bad. It looks fine I would play this right now. But what about second peripherals this is freaking awesome Meet the Microsoft Sidewinder Force Feedback 2. Now with more force feedback than ever before not to mention Handle twist for immediate rudder control a redesigned trigger. Man, this thing's freaking heavy Oh, wow, and it even has an internal AC to DC power supply This thing actually feels pretty good. It's pretty nice. I like it Wow that feels pretty good. Destroy all enemy fighters to win. Fire the guns. Oh no way! Oh wait I have no throttle. Okay that's going to be a problem. Come on get over here. Oh my god that is so cool! Oh it's so visceral! Got him! See you later Kestrel! That'll learn ya! That's 70 mil gun. Look at this buddy. See you later! Oh, oh, where's the shoot? Where's the shoot? No, no, he's dead. He's dead. Get over here. Whoa, whoa, whoa Can you shoot down his parachute? I don't think you can. So I think you just changed We got him boys! See you later, buddy! You're a friggin' pro. Hold on, hold on, here's this parachute. We could also play this game with this controller. I would suggest against it because that D-pad is special. That is the worst thing I've ever seen. It's off-axis. That's terrible. Sidewinder GamePad Pro? More like Sidewinder GamePad No. That's the sickest burner. That was so good. Bottom line, I might not agree with every single choice that Maximum PC made here, but The thing is, hindsight's 2020, and realistically, if you traded your kidney for one of these back in 2001, you'd be feeling pretty darn good about it for a solid... six months? Until something better came out? Obviously, at the pace technology moves, it is rarely a good investment, but I am blown away by how many of these components do still hold up reasonably well today, and the fact that any of them are still worth more than they were back when Maximum PC configured this thing. I'm also blown away by this segue to our sponsor. Vessi. Here in Vancouver, the weather can be unpredictable, but thankfully Vessi makes it easy to prepare for unpredictability. They claim their shoes are fully waterproof thanks to their DymaTax technology, so even the heaviest of rainfalls don't stand a chance. Their storm burst lows give you the protection of a boot while maintaining the style and comfort of a sneaker. If you enjoy walking through nature, the Outsole provides extra grip to help you climb over those mossy logs. Don't flip. You won't. But even for city tricks, you don't need to worry about slippery sidewalks. So stop checking the weather report before checking your shoe shelf. Head over to Vessi.com/LinusTechTips and get 15% off your first purchase. If you guys enjoyed this video, how about checking out the one where we built my personal rig from my teenage years? It wasn't as good as this one. But it was what I could afford.",
    "transcript_keywords": [
        "Maximum",
        "good",
        "thing",
        "today",
        "yeah",
        "game",
        "build",
        "day",
        "drive",
        "Benchmark Destroyer",
        "card",
        "back",
        "feels pretty good",
        "guys",
        "IDE RAID card",
        "Hercules Game Theater",
        "pretty",
        "pretty good",
        "feels pretty",
        "things"
    ],
    "transcript_entity_values": [
        "the Cooler Master ATC-201",
        "one",
        "270 megahertz",
        "420 watts",
        "100",
        "eBay",
        "GXP",
        "Seasonic",
        "Vessi",
        "9",
        "One",
        "around $3,000",
        "CNET",
        "DC",
        "zero",
        "Warcraft 2",
        "800",
        "OpenGL",
        "Sidewinder GamePad Pro",
        "ASUS NVIDIA V8200 Deluxe",
        "Sidewinder GamePad No",
        "13",
        "Maximum",
        "Death Star",
        "Logitech",
        "AMD",
        "One measly",
        "MIDI",
        "Spinning Rust",
        "Linus",
        "the day",
        "XP",
        "half",
        "years",
        "1200",
        "256 megabytes",
        "quarter-inch",
        "Sennheisers",
        "Hitachi",
        "CRT",
        "first",
        "Hertz",
        "Andrew",
        "First",
        "2001",
        "one day",
        "Vision Pros",
        "TDK",
        "Silencer 420",
        "25",
        "90 FPS",
        "18%",
        "just 1.8 gigahertz",
        "4",
        "only three",
        "64 million",
        "CPU",
        "400 watt",
        "64 megabytes",
        "Castle Wolfenstein",
        "sec",
        "one's day",
        "Vancouver",
        "40x",
        "60",
        "Intel",
        "Samsung",
        "about $5,700 US dollars",
        "Sony",
        "ATX",
        "RCA",
        "1600",
        "GeForce",
        "four",
        "Windows",
        "Ridge",
        "Keytronics",
        "AC",
        "up to 10",
        "Deskstar",
        "23 years ago",
        "16.6 megabytes",
        "David",
        "16",
        "AGP",
        "Desk Stars",
        "Pentium",
        "30",
        "3",
        "226",
        "Ireland",
        "RDRAM",
        "Hercules Game Theater XP",
        "70 mil",
        "YouTuber Retro Machines",
        "DirectX 8.1",
        "15%",
        "Meet the Microsoft Sidewinder Force Feedback 2",
        "DDR",
        "two",
        "one year",
        "almost three",
        "Kestrel",
        "2020",
        "IBM",
        "16 year old",
        "second",
        "up to 40%",
        "60GXP",
        "600",
        "the Hercules Game Theater XP",
        "about a month",
        "Asus",
        "4x",
        "September of 2001",
        "Outsole",
        "3Com 100 megabit",
        "DymaTax",
        "75",
        "today",
        "IDE",
        "24x",
        "TX2",
        "RAM",
        "5.1",
        "those days",
        "RDRAM",
        "six months",
        "up to 160",
        "One day",
        "a Topper Realforce",
        "two meter",
        "USB",
        "200 megahertz",
        "10 years ago",
        "Maximum PC Magazine"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.06876333057880402,
        -0.038606807589530945,
        0.061306096613407135,
        -0.08310706168413162,
        0.04581234231591225,
        -0.031181447207927704,
        -0.08566989004611969,
        0.06448282301425934,
        -0.007848135195672512,
        -0.02765306644141674,
        -0.049890752881765366,
        0.06704792380332947,
        -0.016710588708519936,
        -0.09632731229066849,
        0.0233901459723711,
        0.03803744167089462,
        0.07143551856279373,
        -0.06900616735219955,
        0.04375538229942322,
        0.023139486089348793,
        0.021601250395178795,
        -0.07583524286746979,
        -0.012639567255973816,
        -0.01865827664732933,
        0.016718370839953423,
        -0.021159037947654724,
        0.00986519455909729,
        -0.0006262339884415269,
        0.010716406628489494,
        -0.04059556499123573,
        -0.0350063294172287,
        0.07958543300628662,
        -0.03975064307451248,
        -0.023529531434178352,
        0.02998325042426586,
        -0.06713388115167618,
        0.06508100777864456,
        -0.07443812489509583,
        -0.14976821839809418,
        -0.06234099715948105,
        0.033588431775569916,
        -0.05293992534279823,
        -0.0201687291264534,
        0.008657273836433887,
        0.0421932078897953,
        -0.011143260635435581,
        0.005547486711293459,
        -0.07864166051149368,
        0.03535657748579979,
        0.04894844442605972,
        0.0029559466056525707,
        -0.08867336809635162,
        0.08736445009708405,
        -0.024428486824035645,
        -0.08712625503540039,
        0.04155691713094711,
        -0.003410014323890209,
        -0.0046045598573982716,
        0.06297339498996735,
        -6.775951624149457e-05,
        0.05295649170875549,
        -0.03337238356471062,
        -0.036420319229364395,
        0.025843745097517967,
        0.054782453924417496,
        -0.07323086261749268,
        -0.014026599936187267,
        0.02790149115025997,
        0.018974216654896736,
        -0.036080777645111084,
        -0.03378846123814583,
        -0.014538530260324478,
        0.0309029221534729,
        0.06726234406232834,
        -0.005075564607977867,
        -0.008504414930939674,
        0.05986892804503441,
        -0.061879392713308334,
        0.0577293336391449,
        -0.0030883755534887314,
        0.03759589046239853,
        -0.016579486429691315,
        0.02884524129331112,
        -0.0394725576043129,
        -0.03605840355157852,
        0.0070665511302649975,
        -0.006969898473471403,
        0.026762403547763824,
        -0.03618231043219566,
        -0.05016496032476425,
        -0.009572718292474747,
        -0.026758799329400063,
        0.07674950361251831,
        0.034886155277490616,
        0.020903604105114937,
        0.0633653998374939,
        -0.03398454189300537,
        -0.0579971969127655,
        -0.06806369125843048,
        0.04761293902993202,
        -0.006308697164058685,
        0.013708801008760929,
        0.08273670077323914,
        -0.03666466102004051,
        -0.05250388756394386,
        -0.030033372342586517,
        0.002894381294026971,
        0.0428055077791214,
        0.006638755090534687,
        -0.05091932415962219,
        -0.1036420464515686,
        0.015536709688603878,
        -0.06553656607866287,
        0.029189713299274445,
        0.006537565961480141,
        -0.06290123611688614,
        -0.0662703663110733,
        0.031031053513288498,
        0.005105809308588505,
        -0.048175886273384094,
        -0.015356408432126045,
        -0.0038971733301877975,
        0.03139277920126915,
        -0.012638715095818043,
        0.008051651529967785,
        -0.008560328744351864,
        -0.019543809816241264,
        4.797027141812671e-33,
        0.04220937564969063,
        0.0831318348646164,
        -0.022712694481015205,
        -0.016708247363567352,
        0.029870718717575073,
        -0.03468398377299309,
        0.021176619455218315,
        -0.003292548004537821,
        0.007940730080008507,
        0.05789870023727417,
        -0.04843169450759888,
        0.05187812075018883,
        -0.05917558819055557,
        0.0579788014292717,
        0.05237136781215668,
        -0.06732337921857834,
        -0.013008554466068745,
        0.05492575839161873,
        0.01514187827706337,
        -0.05750925838947296,
        -0.012215311639010906,
        -0.004372377414256334,
        0.08448916673660278,
        -0.07172470539808273,
        0.0681309774518013,
        -0.0044335112906992435,
        -0.012612405233085155,
        -0.025423359125852585,
        0.04135967418551445,
        0.03925217688083649,
        -0.007671609986573458,
        -0.02246204763650894,
        -0.0053165690042078495,
        -0.06924116611480713,
        0.016856981441378593,
        0.005228418856859207,
        -0.025470100343227386,
        -0.0948597639799118,
        -0.011298553086817265,
        0.006038885563611984,
        -0.013900035992264748,
        0.06066788733005524,
        -0.04569690302014351,
        -0.08073214441537857,
        -0.07073257118463516,
        -0.0038009434938430786,
        0.10611157864332199,
        0.06682031601667404,
        0.038658831268548965,
        0.008069279603660107,
        -0.03543911874294281,
        0.02320512942969799,
        -0.12000083178281784,
        -0.020486079156398773,
        -0.007056897971779108,
        -0.0881667509675026,
        0.09127062559127808,
        -0.03797963261604309,
        0.14353598654270172,
        0.06409531086683273,
        0.019509712234139442,
        -0.01596890017390251,
        0.056538939476013184,
        -0.05155085027217865,
        -0.07105927914381027,
        0.04408753290772438,
        0.07733960449695587,
        -0.020571572706103325,
        -0.09715859591960907,
        0.0014298782916739583,
        -0.0391944944858551,
        -0.10710587352514267,
        0.044810011982917786,
        -0.04130592569708824,
        0.06378892809152603,
        -0.010920226573944092,
        -0.10123688727617264,
        -0.04120448976755142,
        -0.04899442195892334,
        0.01925581507384777,
        -0.053341343998909,
        0.04112381488084793,
        -0.02181251347064972,
        0.007314471527934074,
        0.11375215649604797,
        0.03155120089650154,
        -0.00573638966307044,
        -0.04740086570382118,
        -0.05350033938884735,
        0.03730812668800354,
        -0.04501096159219742,
        -0.03394519165158272,
        -0.011837867088615894,
        0.04668617993593216,
        -0.03683304786682129,
        -5.851176680167512e-33,
        -0.0533955954015255,
        0.015058680437505245,
        -0.040992945432662964,
        0.02667163498699665,
        0.0763595849275589,
        -0.053497280925512314,
        0.07496146857738495,
        0.01877817139029503,
        0.016485746949911118,
        0.01822863705456257,
        0.023815879598259926,
        0.04199298098683357,
        -0.007995765656232834,
        -0.0025405162014067173,
        0.02608737349510193,
        -0.09863825142383575,
        -0.001575027359649539,
        -0.020828727632761,
        0.026073956862092018,
        -0.06612444669008255,
        0.1501835137605667,
        0.006710515823215246,
        0.008121366612613201,
        -0.0055270628072321415,
        0.027635473757982254,
        0.029196549206972122,
        -0.008404368534684181,
        0.057361360639333725,
        -0.05209256708621979,
        0.03973471373319626,
        -0.005769471637904644,
        -0.02199799381196499,
        -0.008019148372113705,
        -0.0013265875168144703,
        0.10026807337999344,
        -0.002537389751523733,
        0.024349553510546684,
        0.032482851296663284,
        -0.0221023578196764,
        -0.07730292528867722,
        0.03863567113876343,
        -0.009112645871937275,
        -0.053987082093954086,
        0.0009249834110960364,
        0.02433306723833084,
        -0.11253343522548676,
        -0.08388171344995499,
        -0.0794353261590004,
        0.07454492151737213,
        -0.013665280304849148,
        0.05806553736329079,
        -0.020459627732634544,
        0.09108781814575195,
        0.018753904849290848,
        -0.027676604688167572,
        -0.07595771551132202,
        -0.06385225802659988,
        0.04977115988731384,
        0.021946247667074203,
        0.013709837570786476,
        0.04704813286662102,
        0.01500184927135706,
        -0.08233609795570374,
        -0.03397918492555618,
        0.06437061727046967,
        0.045693863183259964,
        0.06238256022334099,
        0.03920985385775566,
        -0.08385684341192245,
        0.00392683083191514,
        0.026011522859334946,
        0.012380799278616905,
        0.01118407677859068,
        0.010750818066298962,
        -0.07289736717939377,
        -0.009109576232731342,
        0.005793496500700712,
        -0.04978253319859505,
        0.09595412760972977,
        -0.03220523148775101,
        -0.07702998071908951,
        0.0020993982907384634,
        0.07802081108093262,
        0.06160441413521767,
        0.04016166552901268,
        0.03697682172060013,
        0.04752138629555702,
        0.009997071698307991,
        -0.013318698853254318,
        -0.04782376065850258,
        0.006249592173844576,
        0.016545215621590614,
        -0.058001771569252014,
        0.09369678050279617,
        0.06762918084859848,
        -6.926183004907216e-08,
        -0.07089997082948685,
        0.01896919682621956,
        0.03864840790629387,
        0.03347645327448845,
        0.014119082130491734,
        -0.09254010021686554,
        -0.003017223672941327,
        0.04332577809691429,
        0.022992193698883057,
        -0.01619405299425125,
        0.073117695748806,
        -0.05744647979736328,
        0.03583286702632904,
        0.00897595752030611,
        0.07866141200065613,
        0.02744738943874836,
        -0.029528077691793442,
        0.10419576615095139,
        -0.08911620080471039,
        -0.10169486701488495,
        0.04464418813586235,
        0.028800247237086296,
        0.1500934213399887,
        -0.03748886659741402,
        0.04882858693599701,
        -0.01197831891477108,
        -0.024631304666399956,
        0.04497711732983589,
        0.06836497783660889,
        -0.0019787203054875135,
        -0.03454534336924553,
        -0.04538789018988609,
        0.005994046106934547,
        -0.03151725232601166,
        0.012565060518682003,
        -0.02678658254444599,
        -0.08762668818235397,
        0.09869054704904556,
        0.03639207035303116,
        0.02952970564365387,
        -0.02494722604751587,
        -0.02294752560555935,
        0.007333356887102127,
        0.02184622548520565,
        0.05742674320936203,
        0.0001915826869662851,
        -0.08167358487844467,
        -0.07060354202985764,
        -0.04582744836807251,
        0.00384076707996428,
        -0.000277780374744907,
        -0.025253120809793472,
        0.010275882668793201,
        0.06648062914609909,
        0.03343595191836357,
        -0.10231924057006836,
        -0.11118131875991821,
        0.0726107582449913,
        -0.03864230215549469,
        0.05469391122460365,
        0.0550907626748085,
        -0.05213131755590439,
        -0.07723984122276306,
        0.09012985974550247
    ]
}