{
    "id": "Rz0F0he3Gu4",
    "title": "Unboxing a Pokémon Mini!",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2017-09-12T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=Rz0F0he3Gu4",
    "category": "Science & Technology",
    "tags": [
        "Nintendo",
        "Pokemon",
        "Pokemon Mini",
        "Game Boy",
        "video games",
        "gaming",
        "retro gaming",
        "Super Potato",
        "unbox",
        "This Does Not Compute"
    ],
    "views": 57746,
    "likes": 1220,
    "comments_count": 98,
    "description": "I picked up a complete-in-box Nintendo Pokmon Mini. Let's check it out!  A great Pokmon Mini site is   For those curious about Super Potato, here's a cool video that gives a quick tour of one of the stores:   Super Potato store photos:    -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Lakey Inspired ( Intro music by BoxCat Games (",
    "description_links": [
        "http://www.pokemon-mini.net.",
        "https://www.youtube.com/watch?v=FQAvB0z3FbM",
        "https://upload.wikimedia.org/wikipedia/commons/c/c2/Akihabara_-_Super_Potato_Retro_Game_Shop.jpg",
        "https://ssl.superpotato.com/free_html.php?html=about_shop.html",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "https://www.soundcloud.com/lakeyinspired).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? I've got a complete in box Pokmon Mini. Let's crack it open. [ Music - Intro ] It's been a while since I've done kind of a top-down setup like this. Anyway, this is the Pokmon Mini. At this point, you've *probably* seen the episode, previous to this one, where I take one of these apart and install a backlight in it. If you haven't, please go check that one out. I'll include a card up there so you can do so. This one came to me relatively recently. A friend of mine spent a month in Japan and he's really cool. And if there's any little stuff that I want him to try and pick up for me while he's there I'll have him do it. I've gotten like a Super Famicom and stuff like that in the past the same way. But, when he was there, I asked him, \"Can you try and find me a Pokmon Mini?\" because these are actually not that common here in the US. They were sold for a short period of time, but th- unfortunately, the platform just never really took off. There's not actually a whole lot of information... out there about the Pokmon Mini from like a business perspective. Apparently, Nintendo never really released any sort of sales numbers or anything like that. But, the whole premise behind the console was... it was a small handheld gaming device like a Game Boy, it included interchangeable cartridges, but they were all themed around Pokmon. There were maybe a dozen of them or so made available. Um, there has actually been a surprisingly robust um, homebrew kind of community for this, believe it or not. People have actually come up with flash carts and card readers and stuff like that for this series. And people have written homebrew games for them. But, the purpose of today's video is... to crack this guy open. Now, I don't believe this unit is brand-new. Um, looking at some of like the corners of the box, that sort of thing, I can see a little bit of wear. Furthermore, this plastic wrap is definitely not original because it's simply taped on, it would have been, you know, heat-shrunk on there if it was brand new, um, from the factory. This one was purchased at a store called Super Potato. Um, I've never been there myself, but... I know it's pretty legendary when it comes to... retro gaming. It is like, the best... place you could ever go anywhere on planet Earth to find retro games, and it's a Japanese chain. They've got, I believe, a few stores. One wonders how they even end up with complete in box units like this, considering... this item is from 2001. I dunno, I guess who owned this previously just happened to be really good about keeping boxes and that sort of stuff, but, anyway... Here it is. The other thing I should note, is that Pokmon Minis in the US can tend to go for a decent amount of money. There's a store near me here in Minneapolis that has a loose one of these consoles... for sale for $50 and they've got a brand new in box one going for $100. This unit, albeit used, but complete box, console, *and* game... that number, 3,980 yen, is the equivalent of about $40 US. Blew my mind when my friend found this for this price. I was expecting to maybe get a loose console for that kind of money. Anyway... let's tear into it and see what you get. Of course, this is the Japanese version of the Pokmon Mini. Uh, as you can tell because everything in it is written in Japanese. Uh, this thing did see a worldwide release, so it was also available over in Europe. Um... with, again like about a- a dozen or so games, although not all of them were available everywhere. Um, the majority of games were available in the Japanese market, but the US and European markets... My memory is a little foggy, but I'd like to say we only saw about six games... total? Um, you know, between the two. Um, there actually is an excellent site \"pokemon-mini.net,\" I believe it is? I'll include a link to that down in the description if you want to check it out. It's got a lot of good information about this console and how it works, and the homebrew community, that sort of thing. And they include a list of all the games and what they were about. But, as you can tell, this one is the Japanese release. Uh, like I said, it includes both the console *and* the game, this is like that Pokmon Party type of title. Uh, like you saw in the previous video where I put a backlight in one of these. I should also note the console was available in *three colors*. Um, you could get it in this Blue, which- They all- the colors all have like kinda names to them, um, which is a escaping my memory right now... um, but it was available in blue, green, and purple. That previous one that I cracked open was a purple one. I don't know if there was... you know, colors that were more common than others. or if they were all produced in equal numbers and sold equally well, I'm not sure. But... I'm- I'm actually happy to have seen a blue one. Very well packed, I should say. This bag fits tightly around this box. You can... tell, again, they're very serious when they sell used stuff. So yeah, a little bit of wear, just shelf wear, across the top of the box here, it's in *really good* shape otherwise, but what clued me into this one being used is that I'm seeing a little bit of dirt on the D-Pad. which we'll uh, check out in just a moment. So... top of the box... and this whole thing slides out... Oop. Yep, this is definitely complete in box 'cause there's... Your documentation, this is gonna be for the console itself, um... The whole thing, yep, is in Japanese. Um, this console is actually really interesting in that not only... you know, does it play these cartridge games and its got A and B buttons, uh, let me pull the unit itself out and I'll show you... excellent condition. Just a tiny little bit of wear, but yeah, it's certainly uh... It's certainly been well-kept. These are- are really interesting so, you know, obviously, familiar controls: D-pad, A and B buttons... There's this shoulder C button on the side, which is also useful. Um, it's an 8-bit console, it only has a black and white display on it. Which, I think is fine, because of how small the display is. These game cartridges are absolutely tiny as well. It's just a flash chip on there. Um, they fit in there and what's also interesting is that they lock in place, you have to slide that slider to get the cartridge out. Not sure why they needed to do that. It's just a single triple A battery that... is held in with a thumbscrew kind of thing, you stick a coin in there. Um, as I understand, battery life was really quite good on these. They do have sound. Um, it's just a single speaker on the back, kind of a square wave boops and beeps types of deal. Uh, nothing high quality enough to warrant a headphone jack, which is why they don't have one. But, there's also variable contrast, of course, for the display. They didn't come with a backlight... out of the- you know, out of the factory, of course. Um, but you could change the volume on 'em. What's also really interesting is not only does it include... It's not really an accelerometer, but kind of a shock sensor, and some of the games took advantage of that, where you physically shake the unit to register like a hit, so... that's an additional interesting feature. There's an infrared transceiver on top so you can do multiplayer with these, which was also very interesting. Um, but, it's also got a built-in vibration motor, which is something that I never realized until I played one of these for the first time. There's actually quite a bit of technology packed into this teeny little console. And maybe someday I'll do a teardown and we can kind of evaluate the parts inside it, see if there's anything that was commodity from back in the day or not. But, I'm actually really really impressed by the Pokmon Mini, just... what Nintendo was able to pack into this thing. You know, based on its size and shape, you would think it was one of those Tamagotchi things. You know, from the '90s, the- the virtual pet, you know, where it's... very limited in terms of what you can do, but... For all intents and purposes, this thing is basically just a teeny tiny little 8-bit Game Boy. So, if you ever have the chance to pick up a Pokmon Mini for a decent price, I would definitely encourage you to consider it because these are actually really really cool. And while the games are all Pokmon-themed, they aren't necessarily Pokmon titles; you're not just sitting here playing Pokmon over and over on this. It's really a whole variety of games that simply have Pokmon characters in them. Uh, I know one of the more rare titles is actually Tetris, they came out with a Pokmon-themed Tetris for this, and if I ever get a chance to pick one of those up, I probably will, you all know I'm a bit of a Tetris fan. But... if you're wondering why I decided to do this video, it was actually due to my Instagram followers. I posted up a picture of this box on Instagram, and asked if anyone wanted to see an unboxing and an overwhelming response (I'm very surprised by it) of people saying, \"Yeah, let's unbox it,\" so... That's why this video came into being. If you wanna see more stuff like this, be sure to shout that out down in the comments below and I'll take that all into consideration, so. If you like this one, I would appreciate a thumbs-up, be sure to subscribe if you haven't already. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Pokmon Mini",
        "Pokmon",
        "box Pokmon Mini",
        "games",
        "Mini",
        "box",
        "console",
        "thing",
        "Japanese",
        "kind",
        "Game",
        "Colin",
        "stuff",
        "bit",
        "interesting",
        "Game Boy",
        "box Pokmon",
        "Pokmon Party",
        "unit",
        "include"
    ],
    "transcript_entity_values": [
        "the Pokmon Mini",
        "a month",
        "about six",
        "Pokmon Mini",
        "Tamagotchi",
        "Pokmon Minis",
        "3,980 yen",
        "Nintendo",
        "a dozen",
        "Tetris",
        "Tetris",
        "Nintendo",
        "Super Famicom",
        "a Pokmon Mini",
        "two",
        "Minneapolis",
        "Instagram",
        "Pokmon",
        "8",
        "100",
        "European",
        "Europe",
        "Pokmon",
        "Japanese",
        "today",
        "Japan",
        "the Pokmon Mini",
        "about $40 US",
        "jack",
        "US",
        "first",
        "one",
        "Earth",
        "Pokmon Party",
        "2001",
        "One",
        "Colin",
        "Twitter",
        "the '90s",
        "50",
        "Super Potato",
        "three",
        "Pokmon Mini",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "NORP",
        "LOC",
        "ORG",
        "NORP",
        "DATE",
        "GPE",
        "FAC",
        "MONEY",
        "PERSON",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.08795906603336334,
        0.048077575862407684,
        -0.01764499396085739,
        -0.036423299461603165,
        0.04956868290901184,
        -0.016070790588855743,
        -0.018919961526989937,
        -0.0428064800798893,
        -0.05271574482321739,
        -0.027044877409934998,
        0.0707467570900917,
        0.009777801111340523,
        -0.009483212605118752,
        -0.034841813147068024,
        -0.006152494344860315,
        -0.007973411120474339,
        0.03848925605416298,
        -0.00020885186677332968,
        0.01361171156167984,
        -0.011660721153020859,
        -0.013194022700190544,
        -0.07875940948724747,
        0.007774239405989647,
        0.003941911738365889,
        -0.014994466677308083,
        0.04169723764061928,
        -0.07241851836442947,
        0.03886198252439499,
        -0.055552009493112564,
        -0.11047828942537308,
        -0.01594254933297634,
        0.0843556746840477,
        0.0067300619557499886,
        0.04392030090093613,
        0.033462658524513245,
        0.02505573071539402,
        0.022252678871154785,
        -0.03714781627058983,
        0.03954671323299408,
        -0.04091702774167061,
        -0.02103523351252079,
        -0.10490355640649796,
        -0.08176690340042114,
        0.03955648094415665,
        -0.0014523628633469343,
        0.039705630391836166,
        -0.014696362428367138,
        -0.017961163073778152,
        -0.016259973868727684,
        -0.02432302013039589,
        0.011722907423973083,
        -0.04900474101305008,
        0.07801797986030579,
        0.019650593400001526,
        -0.022417699918150902,
        -0.008405248634517193,
        0.0023346540983766317,
        -0.03509409725666046,
        0.04956374689936638,
        0.003913087770342827,
        0.04401635378599167,
        -0.021868092939257622,
        -0.07200997322797775,
        0.011622743681073189,
        0.04703279212117195,
        -0.04799973592162132,
        -0.1143898144364357,
        0.019979912787675858,
        -0.04441532492637634,
        -0.05976470559835434,
        0.12688149511814117,
        0.03536229953169823,
        -0.006755627691745758,
        0.07169154286384583,
        -0.02677365019917488,
        0.05598239228129387,
        -0.002099950797855854,
        -0.019803272560238838,
        -0.004622614476829767,
        0.09036416560411453,
        -0.02381524257361889,
        -0.06322071701288223,
        -0.024385955184698105,
        0.056216124445199966,
        -0.04100358486175537,
        0.06045448035001755,
        -0.010411213152110577,
        0.052999161183834076,
        -0.03156905621290207,
        -0.02653544582426548,
        -0.024319365620613098,
        0.08873774111270905,
        0.05374252423644066,
        0.017241574823856354,
        -0.07430964708328247,
        -0.04560082405805588,
        -0.047994714230298996,
        -0.027252869680523872,
        -0.10132867842912674,
        0.08382180333137512,
        0.025898732244968414,
        0.07800835371017456,
        0.01132587343454361,
        0.0004811286926269531,
        0.05097543075680733,
        -0.11525806784629822,
        -0.0290499459952116,
        0.02050614170730114,
        0.06608325988054276,
        0.09720303863286972,
        -0.04781677946448326,
        0.024702975526452065,
        -0.05602573603391647,
        0.029234979301691055,
        -0.053661126643419266,
        0.04388255253434181,
        -0.007790876552462578,
        0.05931900814175606,
        0.05508345738053322,
        -0.03141408786177635,
        0.01154889352619648,
        0.038738712668418884,
        -0.05411515757441521,
        -0.003994357772171497,
        -0.01897640898823738,
        -0.013440320268273354,
        -0.005745414178818464,
        -3.7139769268991617e-34,
        0.01636478677392006,
        0.07932422310113907,
        0.0031753622461110353,
        -0.0214662104845047,
        0.10527236759662628,
        -0.014739574864506721,
        -0.020760325714945793,
        -0.025131424888968468,
        0.014251844957470894,
        0.02767602726817131,
        -0.10510312020778656,
        -0.006669876631349325,
        -0.054759517312049866,
        0.049106113612651825,
        0.0188080295920372,
        -0.08322378247976303,
        0.0047812736593186855,
        -0.02511456049978733,
        0.03971260040998459,
        0.012926536612212658,
        0.02940940670669079,
        -0.03543310612440109,
        -0.04116746038198471,
        0.005567116662859917,
        -0.028972353786230087,
        0.07142636924982071,
        0.01049467921257019,
        -0.04039036110043526,
        0.04200279712677002,
        0.0339607410132885,
        0.04735974222421646,
        -0.06264378130435944,
        0.020756592974066734,
        0.08528267592191696,
        -0.03655064478516579,
        -0.11157505959272385,
        0.0005951925413683057,
        -0.0908963605761528,
        -0.017345402389764786,
        0.05332860350608826,
        0.03605599328875542,
        -0.03232938423752785,
        -0.03180758282542229,
        0.026035849004983902,
        -0.03145907446742058,
        0.0021284818649291992,
        0.1639152318239212,
        0.04484848305583,
        0.011630425229668617,
        -0.04990308731794357,
        -0.03772438317537308,
        -0.004576749633997679,
        -0.08258827030658722,
        -0.06168945133686066,
        -0.062300194054841995,
        -0.1269851177930832,
        -0.01092291995882988,
        -0.08283282071352005,
        0.04476632550358772,
        -0.051142752170562744,
        0.0942595899105072,
        0.06726839393377304,
        0.06764407455921173,
        0.0014544569421559572,
        -0.04802769795060158,
        0.0086899995803833,
        -0.10129474848508835,
        -0.05586424469947815,
        -0.014854838140308857,
        0.0395129919052124,
        0.05325254797935486,
        -0.017040668055415154,
        0.08445486426353455,
        -0.09305356442928314,
        0.06332047283649445,
        0.04953589290380478,
        0.007848897948861122,
        0.04102671891450882,
        0.002854153048247099,
        -0.060424305498600006,
        0.02529778517782688,
        0.0011715878499671817,
        -0.03511994332075119,
        0.028744954615831375,
        -0.004716187249869108,
        -0.03255261480808258,
        0.03800098970532417,
        -0.011746997013688087,
        -0.05304975062608719,
        0.061763785779476166,
        -0.03922295942902565,
        -0.016629280522465706,
        -0.023342672735452652,
        -0.045432962477207184,
        -0.044515661895275116,
        -2.2920867001057857e-33,
        -0.005815936718136072,
        -0.029995417222380638,
        0.01664843037724495,
        -0.015469898469746113,
        0.03313635289669037,
        0.01227185782045126,
        0.0037812390364706516,
        0.017919596284627914,
        0.0382935032248497,
        0.06152525916695595,
        -0.1022028997540474,
        0.03221413493156433,
        -0.03837065398693085,
        -0.05410006269812584,
        -0.004239315632730722,
        0.06639241427183151,
        0.05528842657804489,
        0.0863845944404602,
        -0.05690716207027435,
        -0.023627638816833496,
        -0.06273730844259262,
        0.08045157790184021,
        -0.062555231153965,
        0.08156635612249374,
        -0.0353628471493721,
        0.01083675678819418,
        0.12613260746002197,
        -0.017476441338658333,
        -0.02403990365564823,
        -0.02556714229285717,
        -0.020898347720503807,
        -0.10743162035942078,
        0.023013519123196602,
        0.12594878673553467,
        -0.039159588515758514,
        0.034053731709718704,
        0.007135240826755762,
        0.02626142092049122,
        0.06502038240432739,
        -0.04011904448270798,
        -0.011230208911001682,
        -0.03753923252224922,
        -0.10100981593132019,
        0.07225657999515533,
        -0.021208766847848892,
        -0.12447861582040787,
        -0.10065270215272903,
        -0.026843756437301636,
        -0.002088639885187149,
        0.034608036279678345,
        -0.0025150617584586143,
        0.060975220054388046,
        -0.010805312544107437,
        -0.07513158768415451,
        -0.0869249776005745,
        0.04534200206398964,
        -0.016229882836341858,
        -0.0038730560336261988,
        0.01600213721394539,
        -0.02798955887556076,
        -0.01551349088549614,
        -0.054059550166130066,
        -0.058827660977840424,
        0.06661169230937958,
        0.008172975853085518,
        -0.0513373464345932,
        0.04641313850879669,
        0.05664869397878647,
        -0.04693225398659706,
        -0.0336267352104187,
        -0.04385244846343994,
        0.04610845074057579,
        0.06527388840913773,
        -0.061403997242450714,
        -0.01120114978402853,
        -0.009625718928873539,
        0.03921535983681679,
        0.055477432906627655,
        0.073947474360466,
        -0.04143655300140381,
        -0.0972590520977974,
        8.07895848993212e-05,
        -0.0007673887303099036,
        -0.0318169929087162,
        0.12895889580249786,
        -0.03911988064646721,
        -0.024345219135284424,
        0.07030080258846283,
        -0.0506562739610672,
        0.04322727024555206,
        0.021531183272600174,
        0.1357715129852295,
        0.07000225782394409,
        0.05360419675707817,
        0.053929124027490616,
        -6.102270333485649e-08,
        0.09259337186813354,
        -0.05349210277199745,
        0.0006195927853696048,
        0.1129513680934906,
        0.06413401663303375,
        -0.06058751046657562,
        0.014741946011781693,
        -0.01500991266220808,
        0.034034427255392075,
        -0.002462083473801613,
        -0.060295313596725464,
        0.002133382484316826,
        -0.12322093546390533,
        0.018888236954808235,
        0.02477758750319481,
        -0.007735764142125845,
        0.013571887277066708,
        0.018281854689121246,
        -0.040557265281677246,
        0.030200902372598648,
        -0.06105212867259979,
        0.015996666625142097,
        0.034664496779441833,
        -0.031152812764048576,
        -0.04706325754523277,
        0.006879481486976147,
        -0.012387562543153763,
        0.0014897965593263507,
        0.03660314157605171,
        -0.006669627036899328,
        -0.010432225652039051,
        0.011777078732848167,
        -0.0525624118745327,
        -0.024535613134503365,
        -0.02414342202246189,
        -0.043758053332567215,
        -0.015666749328374863,
        -0.012481379322707653,
        -0.018944405019283295,
        0.004580002743750811,
        -0.016407867893576622,
        -0.09609027206897736,
        -0.04411135986447334,
        0.03678733482956886,
        0.0013139107031747699,
        -0.01753842458128929,
        -0.034219253808259964,
        -0.11107871681451797,
        0.003195342607796192,
        0.08278121799230576,
        0.008325539529323578,
        -0.029108010232448578,
        0.04421700909733772,
        0.019925806671380997,
        0.03202179819345474,
        0.015122946351766586,
        -0.0129747549071908,
        -0.046420905739068985,
        0.04047828167676926,
        0.10728079825639725,
        0.06899301707744598,
        -0.01752563752233982,
        -0.06642061471939087,
        0.028119627386331558
    ]
}