{
    "id": "s0mXMTjZy5M",
    "title": "Top 5 - $1000 Gaming Laptops (Mid 2016)",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2016-03-25T20:33:36Z",
    "video_url": "https://www.youtube.com/watch?v=s0mXMTjZy5M",
    "category": "Science & Technology",
    "tags": [
        "Top 5 Gaming Laptop",
        "Top 5 Laptop",
        "Gaming Laptop",
        "MSI GE62",
        "Razer",
        "Razer Blade",
        "Dell Inspiron 7559",
        "Clevo",
        "Sager",
        "Cheap Gaming Laptop",
        "Cheapest Gaming Laptop",
        "Best Gaming Laptop",
        "Budget Laptop",
        "Budget Gaming",
        "Inexpenisve"
    ],
    "views": 856325,
    "likes": 13757,
    "comments_count": 1968,
    "description": "Dave2D review of the the best cheap 15\" gaming laptops of 2016. Comparing build quality, gaming performance, speakers, keyboard, trackpad, battery life. MSI GE62 -  Dell 7559 -  ASUS GL552-  Acer V15 Nitro -  Lenovo Y700 -   Individual Reviews: ASUS GL552 -  Acer V15 -  Dell Inspiron 7559 -    Music Credits:  Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: FILI - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/1RBoC9N",
        "http://amzn.to/1T9NQBy",
        "http://amzn.to/1RBoFCe",
        "http://amzn.to/21KXhYh",
        "http://amzn.to/1RBoM0R",
        "https://youtu.be/uWUztGO5puE",
        "https://youtu.be/xyGnAMxhXGA",
        "https://youtu.be/r_8yFIYxP4s",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going guys, this is Dave 2D. So a few weeks ago, I did a video comparing some ultrabooks. This week's video is the same concept, but we're comparing 15\" gaming laptops. And these are all budget options, so they are all around $1000. And yes, there are cheaper options out there, but these are the ones that I picked for (like) best overall value in a gaming laptop. Another thing to keep in mind, they're all running a GTX 960M. And there are cards that are cheaper and weaker that can still play games. But to me, the 960M is (like) the minimum card that a new laptop can have right now for me to classify it as a \"true gaming laptop\". All right! Let's do this. Ok, first up is the MSI GE62, it weighs 2.4 kilograms, has a metal top surface, but has plastic paneling on the bottom. Next, we have the Lenovo Y700, 2.6 kilograms. It's the only device with metal top and bottom panels and has a cool pattern on those panels. The Dell Inspiron 7559, 2.7 kilos, it's a pretty heavy laptop, but it has a beefy battery pack in there and it's got a soft touch finish on the surface. Next up is the Asus GL 552. So it's 2.5 kilograms, metal top surface and a plastic finish everywhere else. It's like a smooth plastic not soft touch. Lastly the Acer V 15 Nitro comes in at 2.3 kilograms. It's the lightest and thinnest of the group and it's the only one that doesn't have red accent colors. So, like last time, I'm going to go through some categories and then give you my top pick and a runner upper or two. Alright, even if you're buying a relatively inexpensive laptop, it has to last. So if it's in case in (like) really poor quality materials it's going to bug me, like, there's a 15-inch laptop from Clevo I wanted to include it, because it's got great specs for the price, but because of overall build quality, it didn't make the cut. The Lenovo Y700 has a metal body, but I don't love that hinge design, it's had issues in the past, so the best build quality I'd say is the Asus GL 552. It's a mix of metal and plastic for the casing, but the hinge construction and the finish is really good. The MSI GE62 is also built really well, but again all the devices here have really great build quality for the price. Now all of these are upgradable, they all have upgradeable RAM, m.2 storage and a 2.5 inch storage. The easiest to upgrade is the Dell 7559: single screw and it's easy to open. The rest are also really easy to open but with a couple more screws. The MSI has the sticker that makes you think twice about opening it up, but YOLO, right? Now, I've actually heard that MSI should be cool with people opening it up for upgrades, but I'm not a 100%. The hardest to upgrade is the Acer V15 Nitro, so it's a little bit of a delicate process to get to the RAM, but it can still be done. None of these have amazing displays, but they all have very respectable 1080p panels for the price. For playing games I actually like the Y700 panel the most. So the color accuracy is kind of poor but the contrast and black levels are fantastic with no visible light bleed. And when I'm playing games, that's what's most important to me, I don't really care for a perfect color rendition, I just want to be able to see my enemies in the dark as clearly as possible. Lenovo has this anti-glare film that you can remove. I've removed one before I actually prefer leaving it on. The second best screen goes to the MSI. Great color accuracy, also with good contrast and black levels, but there's a hint of light bleed in the top corners. The best sounding speakers are on the Y700. Clear speakers, well positioned and it has a sub that gives some nice bass. I also like the Acer V15, there's no sub on that one, but they get loud and they remains clear even at loud volumes. The Asus GL 552 also sounds really nice and they're well positioned. So, all of these keyboards have number pads, which will shift your sense of positioning, but you'll get used to it. They all have backlighting to some degree and they're all decent keyboards, like none of them feel super mushy or anything, but the MSI keyboard is a clear winner for me. Good keystroke, nice and responsive. I just wish the layout was a little better, like the arrow keys feel a little off, but the typing experience is the best of the bunch. Also the backlighting on this is RGB, so you can choose your color in three different zones. Runner-up the ASUS GL552 is also a really good keyboard. Alright, I don't love any of these track pads, they don't have particularly smooth tracking, they all have plastic surfaces and the button mechanics aren't great. I wasted a lot of time trying to choose a winner here but really they're all like great bee trackpads. They're usable in a pinch, but we play games with my straight, so it's cool. The Dell 7559 has a quad core i5, while the other four have quad core i7, that can hyperthread. If you're just playing games, I mean depending on the game, you'll likely be good with just the i5, but if you plan on doing things like video editing or CAD work or running VMs, then that's a different story: get the i7. And they're all running a GTX 960M, so gaming performance is very similar amongst them. You'll comfortably hit 60 frames per second on high graphics for moderate and light titles, but really demanding titles will need reduced graphics settings to hit 60 frames per second. Bottom line these all perform well and they're very capable of playing modern games. They also put out similar noise levels at idle, they are nice and quiet, but when they're under load or playing games, the ASUS GL552 was a little quieter than the rest, but there's no real runner-up, the rest of them put out similar noise levels and they aren't annoyingly loud or anything. Now, it's really important for a gaming laptop to be cooled properly and after a full hour of Prime 95, the fans are all spinning and the room was pretty warm but none of them had throttled down much, which is really nice to see. These laptops do a great job on cooling their components. In regards to value, the runner-up prize goes to Lenovo Y700, it's packed with a lot of tech, and since Lenovo has some big sales once in a while, you can bag it for a good price. But the best value crown goes to the Dell 7559. At $800 it's spec'd with a quad core i5 and an SSD. So, the i5 can be upgraded to an i7 for a hundred bucks if you want to, but the reason why I give Dell the value award is the fact that you can upgrade it if you want, but if you have a tighter budget you can still get a really strong gaming platform for $800. Every other manufacturer starts their base model at a higher configuration and a higher price, but it may have components you may not need for your games like 16 gigs of RAM. Battery life for gaming laptops tend to be really short, there's just a lot of juice being used by the components, the longest battery award goes to the Dell 7559. It's a big battery 74 watt hours and it's a core i5 so power draw is a little less. You'll get around five to six hours of regular use and two hours of playing games. In second place is the Lenovo Y700. 60 Wh battery and you'll get around 3 to 4 hours of regular use and around one and a half hours of playing games. Now, battery life is one of those things that some gamers don't care about at all, but it's definitely something that I take into consideration. As for my top pick amongst these five, keep in mind that none of these were engineered to be like the best gaming laptop. They weren't even engineered to be like the best amongst their competitors. They were made to get gamers into mobile gaming setups at an affordable price and they all do a really good job at that. But because of their pricing, they all have their weaknesses. So, when you're choosing one, it basically boils down to what feature you're comfortable letting slide. So, for me personally I love the screen on the Y700, but if I had to choose one for like just my personal gaming laptop, it either be the Dell 7559 because of the bigger battery life or the MSI GE62 because of the keyboard and the overall build, but seriously you can't go wrong with any of these, they're really great laptops for their price. That's the end of this video. I hope you guys liked it. Thumbs if you liked it, subs if you loved it. It's been nice. I'll see you guys next time.",
    "transcript_keywords": [
        "gaming laptop",
        "playing games",
        "laptop",
        "MSI",
        "games",
        "Dell",
        "gaming",
        "Lenovo",
        "playing",
        "good",
        "great",
        "price",
        "battery",
        "Dave",
        "top",
        "Asus",
        "laptops",
        "metal top",
        "nice",
        "metal top surface"
    ],
    "transcript_entity_values": [
        "YOLO",
        "a half hours",
        "VMs",
        "Dell",
        "three",
        "800",
        "week",
        "Lenovo",
        "2.5 inch",
        "60",
        "Dave 2D.",
        "960M.",
        "2.7 kilos",
        "two hours",
        "Asus",
        "Acer",
        "ASUS GL552",
        "2.3 kilograms",
        "2.6 kilograms",
        "60 Wh",
        "second",
        "15-inch",
        "RGB",
        "a few weeks ago",
        "around $1000",
        "16",
        "Clevo",
        "GTX",
        "Y700",
        "74 watt hours",
        "GTX 960M",
        "two",
        "100%",
        "552",
        "the Acer V15",
        "first",
        "a full hour",
        "3 to 4 hours",
        "five",
        "four",
        "the 960M",
        "a hundred bucks",
        "CAD",
        "RAM",
        "around five to",
        "the Acer V15 Nitro",
        "15",
        "2.5 kilograms",
        "MSI",
        "2.4 kilograms",
        "1080p"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "EVENT",
        "ORDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.01493711769580841,
        -0.011566804721951485,
        -0.04421476647257805,
        -0.037155505269765854,
        0.040293626487255096,
        0.00891207717359066,
        -0.020052094012498856,
        0.04233996197581291,
        0.024258481338620186,
        0.03863535448908806,
        -0.01575739122927189,
        -0.005114665254950523,
        0.016637254506349564,
        0.014765307307243347,
        0.07569640129804611,
        0.02532540261745453,
        0.16587133705615997,
        -0.08443108946084976,
        -0.027805982157588005,
        -0.04724099487066269,
        -0.028224365785717964,
        -0.04995495080947876,
        -0.005798502825200558,
        -0.02391219325363636,
        0.050943367183208466,
        0.019665013998746872,
        0.02627680078148842,
        0.012438938021659851,
        -0.10165895521640778,
        -0.008506874553859234,
        0.012804770842194557,
        0.07578489929437637,
        -0.05369216948747635,
        -0.028097093105316162,
        0.018413390964269638,
        -0.09693234413862228,
        -0.011093820445239544,
        -0.0524536557495594,
        -0.004068676382303238,
        -0.0777515098452568,
        -0.061849337071180344,
        -0.0005978532135486603,
        -0.006134691648185253,
        0.0032316753640770912,
        -0.0025002097245305777,
        -0.007676953449845314,
        -0.015597092919051647,
        0.013529366813600063,
        0.047618646174669266,
        -0.0036165376659482718,
        -0.02782650850713253,
        -0.04099323973059654,
        0.04971764609217644,
        -0.027885017916560173,
        -0.054665833711624146,
        0.057260312139987946,
        -0.040573641657829285,
        -0.04182492569088936,
        0.03761029243469238,
        -0.04512624070048332,
        0.07313165813684464,
        -0.11447405070066452,
        -0.015214279294013977,
        0.016484038904309273,
        -0.044409703463315964,
        -0.04193379357457161,
        0.058452509343624115,
        -0.020261507481336594,
        -0.04539893567562103,
        0.040730271488428116,
        -0.026319565251469612,
        0.08226930350065231,
        0.0304317157715559,
        -0.018405279144644737,
        0.03774912282824516,
        -0.006806983612477779,
        0.0635208785533905,
        -0.04190142825245857,
        0.03361287713050842,
        0.04708481580018997,
        -0.00479036383330822,
        -0.027998164296150208,
        -0.004633183125406504,
        -0.07279335707426071,
        0.0004359329759608954,
        0.018562965095043182,
        0.015854883939027786,
        -0.017321789637207985,
        -0.0751459077000618,
        -0.04472522437572479,
        -0.025481518357992172,
        0.047557931393384933,
        0.010746454820036888,
        0.002938960213214159,
        -0.02108977921307087,
        0.003692799713462591,
        0.014178059995174408,
        -0.07147795706987381,
        -0.013020599260926247,
        0.03439677134156227,
        0.03707185760140419,
        0.025907007977366447,
        0.11731228232383728,
        -0.07589026540517807,
        -0.0005587611813098192,
        -0.08057468384504318,
        0.036265961825847626,
        0.05064495652914047,
        0.04762038588523865,
        0.011800052598118782,
        -0.07457321882247925,
        0.033344611525535583,
        -0.0650586411356926,
        0.0006154659204185009,
        0.034250032156705856,
        0.10439007729291916,
        0.00442648446187377,
        0.06140102818608284,
        0.09305015206336975,
        0.07492189854383469,
        0.02891739271581173,
        -0.05808410421013832,
        0.027522919699549675,
        0.05952678620815277,
        -0.009520521387457848,
        -0.01553685124963522,
        -0.07991369813680649,
        5.076619575181706e-33,
        0.022962091490626335,
        0.07345709949731827,
        -0.0648263543844223,
        -0.07672739028930664,
        0.01766686886548996,
        -0.01890278421342373,
        0.0320262610912323,
        -0.01157008670270443,
        -0.003021908923983574,
        0.010448763146996498,
        -0.09742919355630875,
        -0.01319588627666235,
        -0.09388352185487747,
        0.027545185759663582,
        0.08170345425605774,
        -0.05172838643193245,
        -0.07739603519439697,
        -0.017755500972270966,
        -0.04760760813951492,
        0.008711755275726318,
        0.04023260250687599,
        0.003909394145011902,
        0.02616574615240097,
        -0.025797761976718903,
        0.04100679233670235,
        -0.04505014792084694,
        -0.04279138147830963,
        0.00031419110018759966,
        0.08419867604970932,
        0.01607530005276203,
        -0.06733899563550949,
        -0.09541373699903488,
        0.003969273064285517,
        -0.08104802668094635,
        -0.00899416022002697,
        -0.007859906181693077,
        -0.03037182427942753,
        -0.07093383371829987,
        0.03481350466609001,
        -0.07636725902557373,
        -0.026965603232383728,
        0.10544269531965256,
        -0.07510178536176682,
        -0.03913594409823418,
        -0.012501077726483345,
        0.035362157970666885,
        -0.0041555180214345455,
        0.019988780841231346,
        -0.013669287785887718,
        0.0006564297364093363,
        -0.13650697469711304,
        0.07433856278657913,
        -0.019798973575234413,
        -0.04810621216893196,
        -0.07874105870723724,
        -0.08131241053342819,
        0.09335250407457352,
        0.032414283603429794,
        0.10270863026380539,
        0.0932571068406105,
        0.00254912325181067,
        -0.02212395891547203,
        -0.0011758190812543035,
        0.0030255913734436035,
        -0.08209149539470673,
        0.06245148554444313,
        0.12112950533628464,
        0.037092722952365875,
        -0.051565855741500854,
        0.03640402480959892,
        0.012644100934267044,
        -0.016373969614505768,
        0.12381022423505783,
        -0.06391970813274384,
        0.05743836238980293,
        -0.020391445606946945,
        -0.05543886497616768,
        -0.049804311245679855,
        0.009197418577969074,
        0.012412430718541145,
        0.013415087945759296,
        0.02569607086479664,
        -0.046149399131536484,
        0.034768830984830856,
        -0.01882498897612095,
        0.059154801070690155,
        -0.005167441442608833,
        -0.06432220339775085,
        -0.022422106936573982,
        -0.004402868449687958,
        -0.053739067167043686,
        0.04783721640706062,
        0.002566318027675152,
        -0.006467332597821951,
        0.06736543774604797,
        -5.794764338929566e-33,
        0.031512532383203506,
        0.016669897362589836,
        0.06575417518615723,
        0.07329800724983215,
        0.06559120118618011,
        0.020224958658218384,
        -0.040437884628772736,
        -0.010633117519319057,
        0.03441302850842476,
        -0.027616919949650764,
        -0.01642046496272087,
        0.06538999825716019,
        -0.051385484635829926,
        0.06103247031569481,
        0.008000833913683891,
        -0.06640342622995377,
        -0.03792642429471016,
        -0.07510973513126373,
        0.07205148786306381,
        -0.0513368584215641,
        0.04221876338124275,
        0.05579336732625961,
        -0.018109915778040886,
        -0.04403424263000488,
        -0.0007867654203437269,
        -0.012836656533181667,
        -0.03197546303272247,
        0.026730651035904884,
        -0.012214405462145805,
        0.032120127230882645,
        0.007704281248152256,
        -0.024992117658257484,
        0.01009958703070879,
        0.0019238307140767574,
        0.07168211042881012,
        -0.0113328006118536,
        0.07429008185863495,
        0.030597815290093422,
        -0.03899805247783661,
        0.02093074657022953,
        0.057564519345760345,
        0.08132115751504898,
        0.016304070129990578,
        -0.010022292844951153,
        0.0762346163392067,
        0.006916165351867676,
        -0.08328257501125336,
        -0.1125703975558281,
        0.015471904538571835,
        -0.060842931270599365,
        -0.028427576646208763,
        0.02740888111293316,
        0.017064552754163742,
        -0.017918750643730164,
        -0.05036646127700806,
        -0.08274165540933609,
        -0.07894820719957352,
        0.09861123561859131,
        0.05132061988115311,
        -0.04928909242153168,
        -0.04280797019600868,
        0.01782694272696972,
        -0.05215603858232498,
        0.011018468998372555,
        0.022844839841127396,
        0.01622086763381958,
        0.0759824812412262,
        0.028032489120960236,
        0.040148328989744186,
        -0.015508594922721386,
        -0.16460515558719635,
        -0.09065622836351395,
        0.01828927733004093,
        -0.02827167510986328,
        -0.09811659157276154,
        0.061821822077035904,
        0.03194591403007507,
        -0.008021991699934006,
        0.05158313363790512,
        0.0132368179038167,
        -0.015309461392462254,
        -4.959629222867079e-05,
        0.02142481319606304,
        -0.016646074131131172,
        0.023877063766121864,
        -0.01824479177594185,
        0.04398363083600998,
        0.019378764554858208,
        -0.08304636925458908,
        0.018460894003510475,
        0.07177162915468216,
        0.02201537787914276,
        0.01045145746320486,
        0.021947616711258888,
        0.004551867954432964,
        -5.288577753503887e-08,
        0.010172935202717781,
        -0.04190721735358238,
        0.03112053871154785,
        0.07581058144569397,
        0.016201956197619438,
        -0.0711689442396164,
        0.05597487464547157,
        0.022457808256149292,
        0.11052638292312622,
        0.037849169224500656,
        0.048010703176259995,
        -0.08331619948148727,
        -0.021842550486326218,
        -0.02354968525469303,
        -0.006557262968271971,
        0.022565007209777832,
        -0.06335459649562836,
        0.08829865604639053,
        0.014264586381614208,
        0.03942389786243439,
        0.0009236466721631587,
        0.0611720085144043,
        0.10878976434469223,
        -0.07178588211536407,
        0.030036255717277527,
        0.04051142930984497,
        -0.04038192704319954,
        0.03467842563986778,
        0.00484812306240201,
        0.0022150890436023474,
        -0.06260333955287933,
        0.0053579057566821575,
        0.014448298141360283,
        -0.09167420864105225,
        0.018694961443543434,
        -0.13286136090755463,
        -0.04847138747572899,
        0.025534583255648613,
        0.06635948270559311,
        0.07017738372087479,
        -0.019929219037294388,
        -0.10716959089040756,
        -0.03407176584005356,
        -0.022937247529625893,
        0.06661568582057953,
        -0.014664887450635433,
        -0.05103673040866852,
        -0.0814540758728981,
        0.01345556415617466,
        0.03896314278244972,
        -0.02806992456316948,
        -0.011254770681262016,
        0.04196017608046532,
        -0.023475898429751396,
        0.03175611048936844,
        0.027423368766903877,
        -0.045539651066064835,
        0.10617566108703613,
        -0.014613310806453228,
        0.009342240169644356,
        0.0701720342040062,
        -0.09603344649076462,
        -0.08981329947710037,
        0.06756778806447983
    ]
}