{
    "id": "s0XXiDtR83s",
    "title": "DJI Osmo Pocket 3: my favorite gadget of the year",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-12-23T15:00:49Z",
    "video_url": "https://www.youtube.com/watch?v=s0XXiDtR83s",
    "category": "Science & Technology",
    "tags": [
        "dji osmo pocket 3",
        "osmo pocket 3",
        "dji",
        "dji osmo pocket",
        "dji pocket 3",
        "pocket 3",
        "osmo pocket",
        "dji osmo",
        "vlogging camera",
        "best vlogging camera",
        "vlog camera",
        "dji osmo pocket 3 review",
        "dji pocket 3 review",
        "osmo pocket 3 review",
        "dji pocket 3 footage",
        "pocket camera",
        "dji pocket",
        "best travel camera",
        "tech",
        "the verge"
    ],
    "views": 328648,
    "likes": 4773,
    "comments_count": 230,
    "description": "The Osmo Pocket 3, a small handheld gimbal with a camera from DJI, comes with a larger 1-inch CMOS sensor, longer battery, and plenty of new tricks. After more than 2 months of testing and over 600 video clips later, the Osmo Pocket 3 slowly became one of my favorite gadgets this year. #Technology #Camera #Videography   0:00 Introduction  0:59 Image quality and performance  1:40 Who is this for? Vloggers? Videographers?  2:07 Low light mode  2:33 Glamour mode filters (Demo) 3:20 Screen quality and UX 3:53 Vertical mode 4:26 Photos with Osmo Pocket 3 5:00 Creators Bundle,  5:27 Battery life 5:45 Active Track  6:21 Mimo App  6:39 Osmo Pocket 3 as webcam  6:58 Software updates (120fps) 7:18 Boot up time, Digital Zoom  7:46 Why do I love it so much?   You can get the Osmo Pocket 3 here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://bit.ly/3RTvGIB",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "(calm bright electronic music) - The idea of owning an Osmo Pocket, a tiny camera on a gimbal, always intrigued me, but it was always sort of on a nice-to-have list, and it was kind of hard to justify spending money on it. Between my drones and GoPros, and personal cameras and work cameras, the Pocket line felt unnecessary, and I was never really impressed with the image quality of the Pocket 1 or 2, but with a larger one-inch sensor, I thought I would give the Pocket 3 a go. (bright energetic music) I took it with me on all my recent trips. (wind blowing) I brought it skiing, (wind blowing) on everyday walks, I brought it to the beach, (dog barking) filmed my friends, - Do, ro, ro, ro. - and yep, that is Becca with Emmy. So if you have not congratulated her yet, please do so. - I won an Emmy! - And I even filmed the former President with it. And to my surprise, the Osmo Pocket 3 became my favorite gadget of the year. (bright upbeat music) This tiny little camera kept surprising me with some of the clips I was able to get. The videos look rich in detail without being over-sharpened. D-Log M gives you enough dynamic range, while also being flexible to edit and post, and it is a tiny little camera on a gimbal. You can get shots that you normally wouldn't get with a different camera. Quick disclaimer, I did not have ND filters for it, so don't judge too hard if you see some of these clips do look a little stuttery. And these are on their way and the best part of it is they all attach magnetically to the camera just like this wide-angle adapter. That's also the reason why most of the clips you'll see here are at 60 frames per second. So before I get too deep into pixel peeping, we have to take a second to talk about who this product is for. (edgy music) I'm reviewing this as a photographer, videographer, content-creator type. I'm prioritizing performance, or image quality, versatility, and reliability. The other use cases for it are one, as a treble camera and two, as a vlogging camera. In that case, you're probably prioritizing simplicity, and the Pocket 3 nails all of those use cases. Okay, back to image quality. The low-light performance is also really solid, but it's nothing to scream about. There is a dedicated low-light mode which is helped by the larger F2 aperture. That F2 aperture also allows for some nice background separation and this camera does have some AI features, so I wouldn't be surprised if DJI is sort of exaggerating that one a little bit. Take it as a compliment. So the AI feature that I mentioned, it's called glamour mode, and it can basically just beautify your skin. So let's go through a list of things you can do with it. (fingers snapping) You can smoothen out your skin. (fingers snapping) You can slim down your cheeks, your whole face which makes it kind of pointy. (fingers snapping) You can change the size of your eyes as well. (fingers snapping) Change your nose appearance. It can be a little bit slimmer if you want that too. (fingers snapping) And some more weird ones like lipstick, and eyebrows, and blush, and things like that. You get the point. And also, here's what happens if you turn on all those things to 100%. You're welcome. Okay, I can't believe I'm only getting to this now, but the screen is fantastic. (screen snapping) (screen snapping) For one, it is OLED and it looks great. I mean, it is a tiny, two-inch screen, but it is large enough, so you can frame your shots better and change your settings on the fly, yet, it's small enough not to be cumbersome. For the most part, I kept my settings on auto, but for some of the shots where I wanted to dial in settings, getting to the menu is just a few more swipes away that I would've liked. But more importantly, flipping the screens or turn the device on or off, or changing filming orientation is such a clever way of interacting with this device that it just made it fun to use. So considering this as a gimbal, my hope was that the camera itself would just flip on its side for true vertical filming. Sort of like what DJI drones do specifically, the Mavic 3 Pro and the Mavic 4 Mini, instead the Pocket crops the sides. Nevertheless, you still get a decently wide field of view and footage looks good, but not all modes of work in vertical. So there's no dedicated night mode which that's okay, but there's also no 120 frames per second, and it is limited to 3K resolution. Kind of bummed out about those two. Let's talk photos. So I really didn't use the Pocket 3 for still photos as much. They look fine, nothing wrong with them, and it's nice that you can capture them, but I'd still rather reach for a more versatile phone with multiple lenses or my dedicated camera. With the Pocket 3, you can shoot square photos, 16 x 9 photos, or panorama photos, and that's about it. The default photos look nice, but the panoramic ones, they kind of tweaked the color a little bit. They're just not consistent throughout, as you can see right here. Okay, here's a long list of other things I've noticed using this device. So the build quality and the accessory system is great here. The bundle costs 120 bucks more, but it is worth it. You get a tripod mount, tripod legs, external battery which is great. And this handy DJI Mic 2 microphone and the carrying case. The cover for the gimbal is well-built and has a dedicated spot for storing your wide-angle or mist filters which is also magnetic. I love that touch. The battery life could be better. It won't last you for a full day. I kept charging it a lot. But what I will say is that it performed way better in cold weather than I expected it to, unlike some other cameras, (clears throat) GoPro. And it also charges surprisingly quickly, little over half an hour and you're good from zero to full. So if you use gimbals, you know that sometimes they do capture a swaying motion, especially going up and down, and you can notice that in the corners of the image. But I found that using DJI's Active Track really helps to keep things extra stable and minimize that sway. It's still there, but it gets better. And Active Track itself is really great, not perfect, but my success rate with it locking onto people or things, or buildings has been very solid. Distortion on the main lens is handled very nicely, but not so much with the wide-angle adapter. The DJI Mimo app is really good, and you can apply Rec.709 LUT right then and there. The only thing I wish DJI had is cloud storage solution like GoPro does. I think it would be beneficial both here and especially for drone pilots. It's fun to use the webcam, too, if you've seen webcams with gimbals, well, this one works exactly like those and follows your face around, except it kept turning off for me when I was connected to my Mac. Although, it worked okay for Sean on his Windows. Hopefully, it's a software fix, might be a user error. We'll see. And good job on DJI for giving us software updates here as well. Initially, slow motion at 120 frames per second, wasn't available in D-Log M, just normal color. But as of last updates, you can now shoot 120 frames per second in D-Log M, so keep those coming. Lastly, the boot-up speed of this device is quite impressive. From the moment you flip the screen to being able to record is less than three seconds. It's such a reliable little device, which won't make your friends wait on you. - Come with us! (man laughing) - [Woman] You're in. - [Man] Low-key filming. - Digital Zoom is here and I did not use it at all because I don't think it looks good. If DJI wants to make a Pocket Pro with optical zoom or two lenses, I'm all ears. Above all, I enjoy the Pocket 3 so much because of how simple and plain fun it is to use. It turns on quickly. It is easy to carry around. It has great image quality and has great sound quality. I didn't even mention that, but this thing has like three microphones all over the body. It has noticeable depth-to-field, and I can get clips I normally couldn't get with my phones without a dedicated gimbal. It is a very versatile camera. DJI cramped in so much into this for so many different use cases. Typically, I associated the Pocket Series as just for vloggers, but now, it can be used for a lot more. Even if you wanna use it just as a webcam, I would recommend it. I hate myself for even going down this road, but the old adage says that, \"The best camera is the one that you have on you.\" And I felt myself taking this one everywhere. (image shuffling)",
    "transcript_keywords": [
        "justify spending money",
        "Pocket",
        "camera",
        "DJI",
        "Osmo Pocket",
        "idea of owning",
        "justify spending",
        "spending money",
        "image quality",
        "quality",
        "things",
        "great",
        "DJI Active Track",
        "photos",
        "image",
        "gimbal",
        "cameras",
        "dedicated",
        "device",
        "good"
    ],
    "transcript_entity_values": [
        "zero",
        "Becca with Emmy",
        "120 bucks",
        "GoPros",
        "Active Track",
        "DJI Mic 2",
        "F2",
        "the Pocket Series",
        "one",
        "The DJI Mimo",
        "GoPro",
        "16 x 9",
        "a full day",
        "three",
        "Windows",
        "AI",
        "one-inch",
        "less than three seconds",
        "2",
        "little over half",
        "60",
        "120",
        "DJI",
        "3",
        "100%",
        "two-inch",
        "a second",
        "two",
        "Emmy",
        "Mavic 3 Pro",
        "Sean",
        "second",
        "Mac",
        "ND",
        "the year",
        "1",
        "D-Log M"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "EVENT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.07997850328683853,
        0.010559337213635445,
        -0.021230917423963547,
        -0.08310772478580475,
        0.06550130993127823,
        -0.08691851794719696,
        0.025435494258999825,
        0.034966547042131424,
        0.023081274703145027,
        0.02614310197532177,
        0.027996528893709183,
        0.004419926553964615,
        0.01221099216490984,
        -0.021005036309361458,
        0.10861317813396454,
        -0.00979411881417036,
        0.10973269492387772,
        5.3741347073810175e-05,
        -0.0024086851626634598,
        0.05074474588036537,
        0.02362019196152687,
        -0.07442030310630798,
        0.053024038672447205,
        -0.0055981785990297794,
        0.01575310342013836,
        0.0399029366672039,
        -0.025701066479086876,
        0.03211035951972008,
        -0.032577283680438995,
        -0.022244155406951904,
        -0.045145608484745026,
        0.1434490829706192,
        0.06855045258998871,
        -0.03863435238599777,
        -0.031249383464455605,
        -0.08941540867090225,
        0.056951988488435745,
        -0.04116472601890564,
        -0.10557375848293304,
        0.008513861335814,
        -0.05037306249141693,
        -0.007675254251807928,
        0.04677983745932579,
        0.03278679400682449,
        -0.012820410542190075,
        -0.08513487875461578,
        0.02457497827708721,
        -0.06964869052171707,
        0.06238614022731781,
        -0.013505111448466778,
        -0.02186226099729538,
        -0.11433114856481552,
        0.05242042988538742,
        0.031601063907146454,
        0.0007229966577142477,
        -0.022818461060523987,
        -0.07593052089214325,
        -0.001959690824151039,
        0.019924411550164223,
        -0.06420045346021652,
        0.029362967237830162,
        0.011704720556735992,
        -0.06387163698673248,
        0.032785773277282715,
        0.040428921580314636,
        -0.029576869681477547,
        0.03345252946019173,
        -0.04810033738613129,
        0.0213368721306324,
        -0.03338922932744026,
        -0.061447106301784515,
        -0.010206175036728382,
        0.0005273372516967356,
        0.008089837618172169,
        -0.053142331540584564,
        -0.021778654307127,
        0.059225521981716156,
        -0.020296137779951096,
        -0.01839604787528515,
        -0.05055234208703041,
        0.11095896363258362,
        -0.03298607096076012,
        -0.04964468628168106,
        0.05314044654369354,
        0.00796939991414547,
        -0.06806842237710953,
        -0.031818509101867676,
        0.061617083847522736,
        -0.03659096360206604,
        0.0013058632612228394,
        -0.048719946295022964,
        0.12012839317321777,
        -0.04325619712471962,
        -0.08100968599319458,
        0.014182998798787594,
        -0.05127967894077301,
        -0.03516034781932831,
        -0.052622102200984955,
        -0.028479212895035744,
        0.0650501400232315,
        0.08105923235416412,
        -0.016970932483673096,
        0.07564104348421097,
        0.03413679078221321,
        0.04983866214752197,
        -0.02812928706407547,
        0.017406446859240532,
        0.06610418111085892,
        0.021304450929164886,
        0.07780424505472183,
        -0.05801535025238991,
        -0.0065064518712460995,
        -0.04335116222500801,
        -0.056169502437114716,
        -0.013779830187559128,
        0.08494178205728531,
        -0.05231070518493652,
        0.12460916489362717,
        0.08208596706390381,
        0.05031036585569382,
        0.025342246517539024,
        -0.027404937893152237,
        -0.07769834250211716,
        -0.05262821912765503,
        0.08952122926712036,
        0.021048154681921005,
        -0.04906103014945984,
        7.846028797079336e-33,
        0.007887512445449829,
        0.07873129844665527,
        -0.014500253833830357,
        0.04534657299518585,
        0.0016891553532332182,
        0.044749487191438675,
        -0.05191683769226074,
        -0.02845601551234722,
        -0.07036752998828888,
        -0.011811161413788795,
        0.0012822201242670417,
        0.03416306897997856,
        -0.09630610048770905,
        0.1174466460943222,
        0.11903636902570724,
        -0.08737444877624512,
        -0.08057005703449249,
        -0.020719127729535103,
        -0.04338401183485985,
        0.021692173555493355,
        0.032857831567525864,
        -0.08399908989667892,
        -0.015610365197062492,
        0.030609823763370514,
        0.05155929550528526,
        0.05211418867111206,
        0.07660719752311707,
        0.010956131853163242,
        0.056710757315158844,
        0.03832915052771568,
        -0.06439068913459778,
        -0.03063213638961315,
        -0.007816552184522152,
        -0.091938816010952,
        -0.019912468269467354,
        -0.02572542615234852,
        -0.04042612016201019,
        -0.1354607343673706,
        -0.0010967227863147855,
        -0.06184341385960579,
        -0.03231669217348099,
        0.02447027713060379,
        -0.06661131978034973,
        -0.03511873260140419,
        -0.035175371915102005,
        -0.0004780846938956529,
        0.04469497129321098,
        0.0484958216547966,
        0.00933768879622221,
        0.019558599218726158,
        0.02014564350247383,
        -0.035527460277080536,
        -0.04679982364177704,
        0.013827100396156311,
        -0.09037566930055618,
        -0.04646211490035057,
        0.036499012261629105,
        -0.02495882846415043,
        0.007725846022367477,
        0.029128463938832283,
        -0.04873266443610191,
        -0.0361027717590332,
        0.021098986268043518,
        0.028740260750055313,
        -0.03633621707558632,
        0.08555477857589722,
        0.04633282497525215,
        0.02959306351840496,
        -0.039118692278862,
        0.126519575715065,
        -0.06300240755081177,
        0.03108801320195198,
        -0.0036105576436966658,
        -0.03699655085802078,
        0.05317935720086098,
        0.03157265484333038,
        -0.0508950836956501,
        -0.0043859719298779964,
        -0.11979859322309494,
        0.04898972436785698,
        -0.04471001774072647,
        0.025777500122785568,
        0.04256467521190643,
        0.07476437091827393,
        0.0018418988911435008,
        -0.02442844957113266,
        0.06098242476582527,
        -0.04563851282000542,
        -0.08577438443899155,
        -0.014861714094877243,
        -0.002805490745231509,
        0.02082723379135132,
        0.042546745389699936,
        0.015878373757004738,
        -0.08251117169857025,
        -7.560856071621757e-33,
        0.019376100972294807,
        0.03626897186040878,
        0.04881136491894722,
        -0.006964816711843014,
        -0.006262447685003281,
        -0.0646146759390831,
        0.05955948680639267,
        0.041494160890579224,
        0.029317034408450127,
        -0.04480962082743645,
        6.497462163679302e-05,
        -0.021284669637680054,
        0.0028853414114564657,
        0.010436827316880226,
        0.032000135630369186,
        0.048347797244787216,
        -0.03682839497923851,
        -0.1401713341474533,
        -0.0015069219516590238,
        -0.07899479568004608,
        0.10508643090724945,
        0.02199305035173893,
        0.06175488233566284,
        -0.014484986662864685,
        -0.08116564154624939,
        0.024385150521993637,
        -0.005377735942602158,
        0.028338691219687462,
        0.023992564529180527,
        0.002443529199808836,
        0.02991081401705742,
        -0.06429281830787659,
        0.014700488187372684,
        -0.03197934851050377,
        0.08658003062009811,
        0.06706450879573822,
        0.041171472519636154,
        0.0631985142827034,
        -0.033160530030727386,
        0.025174114853143692,
        0.011804632842540741,
        0.008726228028535843,
        0.06869177520275116,
        -0.01203920878469944,
        -0.009395170025527477,
        -0.005176827777177095,
        -0.006693112663924694,
        0.022679084911942482,
        -0.07107599824666977,
        -0.028231894597411156,
        -0.001148901996202767,
        0.048450689762830734,
        -0.02561386302113533,
        0.04602527618408203,
        -0.02348632737994194,
        -0.023549025878310204,
        -0.05105064436793327,
        0.04263927415013313,
        -0.010627539828419685,
        0.02981366403400898,
        0.05086392164230347,
        0.06319881230592728,
        -0.07532340288162231,
        -0.03220466524362564,
        -0.00014760294288862497,
        0.02546512894332409,
        0.059081338346004486,
        0.02416674792766571,
        -0.025770897045731544,
        0.02628607116639614,
        0.03548659384250641,
        -0.034172262996435165,
        0.01555707585066557,
        -0.049918774515390396,
        -0.005133867729455233,
        0.07635115832090378,
        -0.011488480493426323,
        0.030262980610132217,
        0.01564323529601097,
        0.005178718827664852,
        -0.019548656418919563,
        -0.014154241420328617,
        0.028664480894804,
        0.056842222809791565,
        -0.008188625797629356,
        0.0591980405151844,
        0.01853703148663044,
        0.03024553321301937,
        -0.02703016810119152,
        0.002973648253828287,
        -0.025270922109484673,
        0.02460612542927265,
        -0.0711674913764,
        0.12763625383377075,
        -0.012352869845926762,
        -4.9470763485715e-08,
        -0.058690331876277924,
        0.0058556292206048965,
        -0.028091879561543465,
        -0.023135116323828697,
        0.002237136708572507,
        -0.051327336579561234,
        0.02109556831419468,
        0.04097049683332443,
        0.09321124106645584,
        0.015856347978115082,
        0.07942193001508713,
        -0.08603741973638535,
        -0.07008352875709534,
        -0.007218416314572096,
        0.09563688188791275,
        0.02318919636309147,
        -0.035797517746686935,
        0.027013136073946953,
        -0.0213791411370039,
        -0.03744875267148018,
        0.016768690198659897,
        -0.017313489690423012,
        0.016218680888414383,
        -0.08856759965419769,
        -0.007061864249408245,
        0.018305985257029533,
        -0.07687889039516449,
        0.005581964738667011,
        0.06519093364477158,
        -0.015294739976525307,
        0.004482191521674395,
        0.017450949177145958,
        -0.011380316689610481,
        -0.04794296249747276,
        -0.05102857947349548,
        -0.05477336794137955,
        -0.12562254071235657,
        -0.03219308331608772,
        0.11103727668523788,
        0.014180653728544712,
        0.022825678810477257,
        -0.15555493533611298,
        -0.029773445799946785,
        0.03084370866417885,
        -0.08497948944568634,
        -0.04166774824261665,
        0.03079511784017086,
        -0.07756737619638443,
        -0.04581540450453758,
        0.0032508426811546087,
        -0.011455370113253593,
        -0.022151540964841843,
        0.029833447188138962,
        0.044840965420007706,
        0.03996529057621956,
        0.004725392442196608,
        0.041969556361436844,
        -0.016611142084002495,
        -0.002416146919131279,
        0.02448224276304245,
        0.006058071739971638,
        -0.11456603556871414,
        -0.07681909203529358,
        0.08206263929605484
    ]
}