{
    "id": "S24TDRxEna4",
    "title": "REAL iMessage on Android - No Apple ID Needed!",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2023-12-05T15:01:00Z",
    "video_url": "https://www.youtube.com/watch?v=S24TDRxEna4",
    "category": "Science & Technology",
    "tags": [
        "iMessage",
        "Android",
        "Beeper Mini",
        "Eric Migicovsky",
        "Pebble",
        "cross-platform",
        "secure messaging",
        "Apple ID",
        "pypush",
        "open-source",
        "Carl Pei",
        "Nothing Chats",
        "Sunbird",
        "AirMessage",
        "APNs",
        "blue-bubble",
        "SMS",
        "subscription",
        "encryption",
        "hackintosh",
        "Apple",
        "RCS",
        "iCloud",
        "DMCA",
        "unified messaging",
        "group chat",
        "FaceTime",
        "privacy",
        "E2EE",
        "Silicon Valley",
        "authentication",
        "iOS",
        "tech innovation",
        "communication",
        "app development.",
        "imesage on android",
        "green vs blue bubbles"
    ],
    "views": 267890,
    "likes": 12654,
    "comments_count": 1607,
    "description": "Goodbye, green bubbles... iMessage has been completely reverse engineered bringing _native_ support to Android! This isn't like Nothing Chats or AirMessage, it's the first truly *real* iMessage experiencewithout compromise.  Download Beeper Mini -  Try pypush -  iMessage, explained -  How Beeper Mini works -  Buy the OnePlus 11 (affiliated) -  Buy the Galaxy Fold5 (affiliated) -  Purchase anything Apple -    Follow Snazzy Labs on Twitter -  Follow me on Instagram -   A new app called Beeper Mini claims to seamlessly integrate iMessage functionality on Android devices, potentially revolutionizing cross-platform messaging. Developed from the open-source project pypush by a high school student and supported by Pebble founder Eric Migicovsky, this app promises secure and direct messaging without requiring user's Apple ID credentials. However, it raises questions about its legitimacy and compliance with Apple's policies, especially considering the controversies surrounding previous attempts like Sunbird and Nothing Chats. As Beeper Mini enters the market, it remains to be seen whether this ambitious endeavor will truly deliver a reliable iMessage experience for Android users or encounter resistance from Apple.  0:00 iMessage has been reverse-engineered 1:12 \"Beeper Mini\" does everything client-side 2:51 A high-school student outsmarted Apple 3:40 How does iMessage actually work? 4:55 WTF is a \"validation data blob?\" 5:38 Apple isn't likely to patch this \"exploit\" 7:13 Using iMessage on Linux 7:51 Registering Android phone numbers directly 8:30 Handling notifications... 9:47 It's pretty much just like the real iMessage! 11:28 Today, it's iMessage-only 11:53 Uh... is this legal? 12:37 Hot take: this is good for Apple users! 13:32 RCS is coming to iOSdoesn't matter 14:05 A word of caution... 14:41 Idgaf about WhatsApp",
    "description_links": [
        "https://snazzy.fm/cS",
        "https://snazzy.fm/xQ",
        "https://snazzy.fm/TK",
        "https://snazzy.fm/Lb",
        "https://snazzy.fm/Of",
        "https://snazzy.fm/ic",
        "https://snazzy.fm/MA",
        "http://twitter.com/snazzylabs",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "Every attempt at iMessage on Android has been awfulat best the implementation is complicated and unreliableand at worst, it's a downright security disaster. But there's a new appavailable starting todaythat is vastly different from every attempt before it: you don't need to hand over your Apple ID credentials to anybody because this isn't some sketchy relay running on a macOS virtual machine in a data center somewhere... it's a complete reverse engineering of the entire iMessage tech stack registering your Android's phone number for native blue-bubble support; with no middle-man in between. Here's how it works once you download and open the app: 1. Sign in to your Google account to verify subscription status through the Play Store 2. Enable notifications 3. Sign upif you haven'tfor the $2/mo subscription following a 7-day trial 4. Enable on-device permissions to import your previous SMS conversations and your contacts list 5. Start using iMessage. That's it. If this sounds too good to be true, I don't blame you, but let me explain everything you need to know... This new app, Beeper Mini, will be the future replacement for Beeper Cloudformerly known as Beeperan app that has integrated a bevy of chat services into one, centralized place. Started by Pebble founder and CEO, Eric Migicovsky, Beeper is open-source and supports end-to-end encryption, but has been mostly cloud-basedrequiring you to host your own bridges, or, utilize Beeper's. Until today, just like Sunbird, Nothing Chats, AirMessage, and others... Beeper would (1) ask for your Apple ID, (2) create a new macOS virtual machine on a real Apple computer in a data center, (3) login to that Mac using your Apple ID, (4) and then relay the messages through that Mac to your Android phone to \"pretend as though you were an iPhone.\" Now, Beeper did this a lot more securely than Carl Pei's disastrous, negligent, no-good-very-bad Nothing Chats app that allegedly stored iMessages in plain text on the internet (what the hell, Carl), but users were ultimately still trusting that Eric and the folks at Beeper weren't going to abuse that access. Not a great system. Beeper Mini flips that idea on its head doing everything client-side; inside of the Android appno third party! Your messages, sent directly through Apple, to the recipient, and backas if you were a literal iPhone. So what team of geniuses figured out how to do the impossible? A single high school studentnicknamed JJTech. Back in August, they published the open-source proof-of-concept, pypush, that Migicovsky purchased in order to create the foundation of the all new Beeper. There's really no better demo than pypush to show you how Beeper Mini and frankly, iMessage itself works. I will run this demo on my System76 Linux machine to prove it has nothing to do with Apple hardware. After a git request and an installation of needed dependencies, I can open pypush in a command line window and I'm immediately shown as being connected to Apple's Push Notification Service or APNs. If you're an iOS or macOS developer, you know this well... iMessage uses the same service to receive notifications as apps found on the App Store. But what's lesser known is that APNs are bidirectional. This will come in handy once we request an authentication token from Apple by entering our Apple ID, password, and 2-factor code which shows my real location because my laptop is logging innot some data center. This token is immediately exchanged for a longer-term certificate that allows our device to request registration with Apple's identity service. Encryption and signing keys from our device are uploaded to Apple's keyserver along with something super important: a \"validation data\" blob that Apple uses tosurprise, validate Apple hardwareaka, to make sure you're not... oh, I don't know, running this on an Android phone. The pypush Github repo comes with a file that includes a serial number and hardware UUID already that's bundled up into that needed \"validation data\" blob to tell Apple, falsely, \"hey, we're legit.\" Now you may be thinking \"well, couldn't Apple just ban that specific serial and UUID server-side and break pypush in like 2 minutes? Yes, they could. BUT, they aren't likely to. There are a lot of legitimate reasons for many Apple IDs to use the same hardware keysfrom enterprise deployments to white hat bounty programs. In fact, Apple uses a bunch of unknown variables, weighted differently, to determine the legitimacy of you as a user beyond just the serial numberup to and including your Apple ID, phone number, and history as an Apple customer. Hackintosh users know this well because they use completely BS, fake serials all the time and Apple goes \"okay,\" cool, thanks! And in the event your Apple ID is brand new, they don't put any value into you as a customer yet, and your heavily weighted serial turns up bogus and is rejected, there are tools that will just generate new serial after new serial after new serial until you find one that's actually tied to a legit Mac that exists in the worldit doesn't take as long as you'd think. And then, Apple has no way of knowing if you own the computer or not. At least not currently. Needless to say, this doesn't appear to be some easy thing Apple can just turn offit will require a complete re-design of their entire authentication and delivery strategy for not just iMessage but Apple ID account access as a whole. Back to pypush. Once our session is setup, we can now look up the public keys of someone via phone or email to see if they have iMessage. Once its determined they do... we can send them a message, and they can respond in kind! Again, this is using keys and certificates on-device. On this computer. And that's the foundation of Beeper Mini. But Beeper Mini is a lot more than just a command-line tool. For starters, as mentioned previously, turning over your Apple ID is not required. The Beeper team figured out how to register Android phone numbers with iMessageno Apple hardware requiredat all. Instant green-to-blue bubble conversion. That said, you can login to your Apple ID if you'd like to use an email instead of phone number, or, to send and receive using other Apple devices like iPad or Mac. Just with pypush, Beeper states your credentials are sent directly to Apple for enrollment and then the certificate and keys are stored strictly on-device. The only involvement Beeper has outside of what a normal iPhone might is handling notifications. Because Apple's APNs require a persistent connection (and that they can because they're built into the literal operating system), Beeper couldn't be a reliable messaging app without running in the background 24/7. To continue supporting push even when the app is closed, Beeper built an APN to BPN (Beeper Push Notification) bridge for use when Beeper Mini isn't running. They connect to Apple's servers on your behalf to listen for notifications and then push them through Android's FCM notification system. Beeper states they can do this while maintaining complete privacy because they only receive push credentials that don't give access to message content; but do allow them to nudge the Beeper Mini Android app to (1) open in the background, (2) have your phone send the keys to Apple, and (3) download, decrypt, and process incoming messages. Though they explain this in their documentation and state its security, they do also let you disable them entirely if you're not comfortable with the idea. \"OK that's great and all, but I'm not a nerd... what can the app actually do?\" I've been using a pre-release version of Beeper Mini for several days now and it's surprisingly polished. Given that it's actually iMessage it does the stuff you'd expect iMessage to actually do. It supports not just one-on-one messaging, but also group chatswith group chat titles and participant lists. High resolution images and video can be sent and received. You can edit messages and you can also unsend them. Read receipts are sent and received, typing indicators are supported, as are tapback reactions. You can reply to threads, there's native support for sending and receiving voice messages. Stickers and GIFs work, and more. Now there are a few small things missingit'll suggest you share your contact info like on iOS, but instead of doing what an iPhone would do, it just sends your contact vcard. It works, but it's... not quite as elegant. There's no live location sharing (yet, says Beeper), there are no message effects, and obviously, there's no support for FaceTime audio and video (though, perhaps Beeper could integrate a web-view or something cause it kinda is supported by Apple on Android. Really, the only thing the Beeper doesn't think will ever be supported is iMessage games and well, duh, that makes sensebecause that's all facilitated though the iOS App Store. It's a very, very reliable 1.0, but it's clearly a 1.0. Beyond the features I listed, you can mark messages as unread and mute threads, but that's basically it. There's no support for standard SMS or RCSyou'll still need Google Messenger or an alternative app for that, but it is coming apparently. Eric tells me Beeper will be working on moving the rest of their 15 messaging services from their original app into Beeper Mini's new architecture over time and when the transition is complete, Beeper Mini will be renamed to Beeper and the Beeper of yesterdaywhich is now called Beeper Cloudwill disappear. I had some more questions for Eric like... is this legal? I mean, surely harvesting macOS hardware keys in order to circumvent Apple's entire authentication system violates some sort of EULA, no? And while they might turn a blind eye at some high schooler doing it for fun, they might not be so forgiving if its a well-known Silicon Valley entrepreneur monetizing the workaround. While I suppose Eric can't be sure Apple won't bully him with a civil case, he feels pretty confident in the protections afforded by DMCA section 1201 F which states reverse engineering for the purposes of interoperability is protected. And I don't know if there's a better example of that than Beeper Mini. Frankly, one of the things Eric mentioned that really struck a cord is that this isn't just a way to bring blue-bubbles to broke boy Android usersit's a way to improve the messaging experience and security for Apple's own users. Apple has intentionally made messaging Android users a horrible, insecure experienceit's why the green bubble thing is a thing. Apple execs talked over 10-years-ago about bringing iMessage to competing platforms but many feel Apple avoided it for fear of losing customers to Android. If Apple did feel that way, it was irrational and stupid; it was then and it continues to be because iOS has oodles of amazing features worth staying for. And if iMessage really is the only thing keeping users on this side of the aisle, boy, Apple's screwed cause this won't continue on forever. Now yes, Apple is bringing RCS to iOS next year, but they're not implementing Google's flavor of RCS with E2EE. They're adopting the older, dated version supported by the GSMA and Apple will be working with them over the coming years to bring E2EE to the standard as a whole. I think that'll be a good thing when it happens but that's not going to happen tomorrow, next month, or probably even next year. You can get a better experience than next year's RCS, todayand I think that's wicked cool. Now, a word of disclosure... while Eric has a stellar reputation, has open-sourced Beeper Cloud and will maintain pypush as an open source project, the Beeper Mini client is not open source and while they invite security researchers to verify their claims and published an internal red-team analysis, there's always a potential risk when it comes to using third party apps like this to login to services without open authorization like iCloud. If you're interested, you can check out Beeper Mini using links in the description below. It's available now, doesn't have any sign up limits, and doesn't have any ads or tracking but does require a paid subscription. This video hasn't been sponsored, no money has or will change hands, but I just think it's really cool and I'm excited for a more unified future. Thanks so much for watchingI don't care if you think WhatsApp is betterand as always, stay snazzy.",
    "transcript_keywords": [
        "Beeper Mini",
        "Apple",
        "Beeper",
        "Beeper Mini Android",
        "Mini",
        "Android",
        "Mini Android app",
        "app",
        "Android phone",
        "iMessage",
        "Eric",
        "Beeper Mini flips",
        "Apple hardware",
        "Beeper Mini client",
        "Mini Android",
        "phone",
        "pypush",
        "Beeper states",
        "Apple Push Notification",
        "serial"
    ],
    "transcript_entity_values": [
        "DMCA",
        "2 minutes",
        "third",
        "GSMA",
        "iMessageno Apple",
        "JJTech",
        "APN",
        "Sunbird",
        "RCS",
        "Android",
        "Beeper Mini",
        "1",
        "chatswith group",
        "next year",
        "Beeper Mini",
        "the App Store",
        "iMessage on Android",
        "Apple",
        "iMessages",
        "Carl",
        "3",
        "UUID",
        "tomorrow",
        "Beeper Mini's",
        "iMessage",
        "2",
        "Mac",
        "Beeper Cloudformerly",
        "Carl Pei's",
        "iPad",
        "Beeper Cloudwill",
        "Mac",
        "today",
        "Google Messenger",
        "Silicon Valley",
        "the Play Store 2",
        "Google",
        "Pebble",
        "7-day",
        "the coming years",
        "FCM",
        "SMS",
        "4",
        "one",
        "Eric Migicovsky",
        "Eric",
        "Migicovsky",
        "Hackintosh",
        "several days",
        "AirMessage",
        "Beeper Mini",
        "5",
        "Push Notification Service",
        "FaceTime",
        "next year's",
        "System76 Linux",
        "iPhone",
        "August",
        "15",
        "iCloud",
        "next month",
        "Beeper Cloud",
        "Beeper's",
        "WhatsApp",
        "1.0",
        "Beeperan",
        "iOS",
        "the Beeper Mini Android",
        "10-years-ago"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "DATE",
        "PERSON",
        "LOC",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "FAC",
        "DATE"
    ],
    "vector": [
        -0.0845155417919159,
        -0.027530532330274582,
        0.089586541056633,
        -0.09732799232006073,
        0.012757684104144573,
        -0.0838121846318245,
        0.04723602905869484,
        -0.009996330365538597,
        -0.0007299324497580528,
        0.023562410846352577,
        0.039515186101198196,
        0.018727965652942657,
        0.026585735380649567,
        0.008071527816355228,
        0.05489485710859299,
        0.03365364298224449,
        0.09997014701366425,
        -0.09793413430452347,
        -0.04813329875469208,
        -0.012421635910868645,
        -0.0410933718085289,
        -0.023599108681082726,
        0.09771950542926788,
        0.025430765002965927,
        0.025918925181031227,
        -0.03172028437256813,
        -0.02518203854560852,
        0.038098011165857315,
        -0.06057031825184822,
        -0.004789730999618769,
        0.060135696083307266,
        0.05638366565108299,
        0.06882397085428238,
        0.006064397748559713,
        -0.04218524694442749,
        -0.03591145575046539,
        0.05370829999446869,
        0.032198164612054825,
        -0.05901516228914261,
        -0.016939954832196236,
        -0.10577414184808731,
        -0.09117784351110458,
        -0.09615001827478409,
        0.07117848843336105,
        0.004499200265854597,
        -0.023320356383919716,
        0.003389302408322692,
        0.033975571393966675,
        -0.038438066840171814,
        0.023012671619653702,
        0.04657633602619171,
        -0.01679917611181736,
        0.04267492517828941,
        0.043237343430519104,
        -0.08040665090084076,
        0.03471196070313454,
        -0.10783646255731583,
        0.021786678582429886,
        0.09123583883047104,
        0.09233058989048004,
        0.04261428490281105,
        -0.04306934401392937,
        0.061875324696302414,
        0.042888201773166656,
        -0.03581542521715164,
        -0.018837958574295044,
        0.009770243428647518,
        -0.04751206561923027,
        0.05740537494421005,
        -0.07080763578414917,
        -0.041992127895355225,
        -0.023997455835342407,
        -0.0043202415108680725,
        0.08521252125501633,
        -0.0046517434529960155,
        0.05750223994255066,
        0.07647567242383957,
        -0.03931190073490143,
        -0.04269831255078316,
        0.04444871470332146,
        -0.04203961417078972,
        -0.029857249930500984,
        -0.026701657101511955,
        -0.011744309216737747,
        0.004543139599263668,
        -0.04104508087038994,
        -0.011255464516580105,
        0.05888541042804718,
        -0.025279544293880463,
        0.05267869308590889,
        -0.03196226805448532,
        0.009320495650172234,
        0.013515399768948555,
        0.030011631548404694,
        0.00567228440195322,
        0.003625694429501891,
        -0.0700184777379036,
        -0.03236062824726105,
        -0.08546251803636551,
        0.03832980990409851,
        -0.05967086926102638,
        0.03796471655368805,
        0.018239427357912064,
        -0.08539064228534698,
        0.05160008743405342,
        -0.06865033507347107,
        -0.014092031866312027,
        -0.08309779316186905,
        0.12548699975013733,
        0.07823096215724945,
        -0.029401464387774467,
        -0.08763919770717621,
        0.018466444686055183,
        0.03489374369382858,
        0.04265096038579941,
        0.05586269125342369,
        -0.02185141295194626,
        0.08298658579587936,
        0.13353051245212555,
        -0.0008985318127088249,
        0.05193719267845154,
        -0.031346291303634644,
        -0.035271428525447845,
        -0.02906806208193302,
        0.0008232680847868323,
        0.0709071084856987,
        -0.0949721559882164,
        4.792077208569755e-33,
        0.027732305228710175,
        0.1378503292798996,
        0.05554746091365814,
        0.07731635868549347,
        -0.01617879793047905,
        -0.022355549037456512,
        -0.047040026634931564,
        0.012773689813911915,
        -0.004653192590922117,
        -0.044087473303079605,
        -0.045081768184900284,
        0.00018848050967790186,
        0.015636175870895386,
        0.0009616584866307676,
        0.0751412883400917,
        -0.037505775690078735,
        -0.060426127165555954,
        0.0005289276014082134,
        0.07600662857294083,
        0.002694276859983802,
        -0.05043826997280121,
        -0.047036681324243546,
        0.01639518514275551,
        -0.021365901455283165,
        0.07463095337152481,
        0.09185459464788437,
        0.1014484241604805,
        -0.06261046975851059,
        0.1182783842086792,
        0.0052147493697702885,
        -0.06037463620305061,
        -0.046273551881313324,
        -0.004078947938978672,
        0.0036941603757441044,
        0.027073370292782784,
        -0.010442337952554226,
        0.005815827753394842,
        -0.07951921224594116,
        -0.00016686829621903598,
        -0.020498644560575485,
        -0.1094045639038086,
        -0.009408303536474705,
        -0.049754027277231216,
        -0.04197118431329727,
        0.0008553366642445326,
        -0.021556243300437927,
        -0.0740780308842659,
        0.01624167710542679,
        0.017630796879529953,
        -0.037254448980093,
        -0.0641152560710907,
        0.006110352464020252,
        -0.012035965919494629,
        0.010361849330365658,
        -0.0646747574210167,
        -0.044235143810510635,
        -0.015309274196624756,
        -0.044960323721170425,
        -0.06246687471866608,
        -0.001014264184050262,
        -0.01713552698493004,
        -0.0030554209370166063,
        -0.018227791413664818,
        0.005434386432170868,
        0.00993964821100235,
        0.03439129889011383,
        0.020003003999590874,
        -0.05811849609017372,
        -0.060006558895111084,
        0.0031428413931280375,
        0.0005528306937776506,
        0.0025521754287183285,
        0.01752167008817196,
        -0.0028942576609551907,
        -0.07533947378396988,
        0.051163069903850555,
        0.04939402639865875,
        0.05284634232521057,
        -0.0161652322858572,
        0.004350739065557718,
        0.02428312972187996,
        -0.015329785645008087,
        0.02825750783085823,
        -0.02238975279033184,
        -0.016678418964147568,
        -0.006018879357725382,
        0.0012176204472780228,
        -0.040793851017951965,
        -0.024146419018507004,
        0.07552909106016159,
        -0.09037552773952484,
        0.03935389965772629,
        0.030046498402953148,
        0.0907905176281929,
        -0.0670611560344696,
        -4.0594172936411476e-33,
        -0.10414797067642212,
        -0.04754271358251572,
        -0.05528255179524422,
        0.011260121129453182,
        0.04709981381893158,
        -0.002502580638974905,
        0.07276541739702225,
        0.026049086824059486,
        -0.0499611496925354,
        -0.028973106294870377,
        -0.08178766071796417,
        0.0017156768590211868,
        0.05436694994568825,
        -0.03835788741707802,
        0.004755226895213127,
        0.033920954912900925,
        0.07460367679595947,
        -0.017623158171772957,
        -0.055691909044981,
        0.011955326423048973,
        -0.03231879696249962,
        0.08128228783607483,
        -0.031788479536771774,
        0.015240040607750416,
        0.009183154441416264,
        0.010823006741702557,
        0.030946748331189156,
        -0.023937605321407318,
        0.02256672829389572,
        -0.04395231977105141,
        0.031950272619724274,
        0.022546976804733276,
        -0.001698842621408403,
        -0.006092553958296776,
        0.03344206139445305,
        0.011472905054688454,
        -0.00951856654137373,
        0.007826046086847782,
        -0.001063204719685018,
        -0.046928998082876205,
        0.11968925595283508,
        0.04788826406002045,
        -0.059238001704216,
        -0.06408694386482239,
        -0.017085885629057884,
        0.017933137714862823,
        -0.07679268717765808,
        0.03551832586526871,
        -0.07714066654443741,
        0.020959481596946716,
        0.0761750265955925,
        -0.01911700703203678,
        0.06333648413419724,
        0.0023448134306818247,
        -0.045689087361097336,
        0.02117719128727913,
        0.030064599588513374,
        0.029734935611486435,
        -0.01080923993140459,
        -0.030375026166439056,
        0.04561038315296173,
        -0.07157976925373077,
        0.02852734550833702,
        -0.02790127322077751,
        -0.025949306786060333,
        0.017293278127908707,
        0.06506644934415817,
        0.03373308479785919,
        -0.022630909457802773,
        -0.020965633913874626,
        0.06249087303876877,
        -0.10656188428401947,
        -0.004865344613790512,
        -0.013411286287009716,
        0.07272910326719284,
        0.102645143866539,
        -0.015232188627123833,
        -0.07147675007581711,
        -0.13131512701511383,
        -0.06194060668349266,
        0.0342206209897995,
        0.08345819264650345,
        0.04203777387738228,
        0.032203324139118195,
        0.1195148453116417,
        -0.04814165458083153,
        0.04893069714307785,
        0.022255538031458855,
        -0.002200793009251356,
        0.0277444738894701,
        -0.028980392962694168,
        0.10969918966293335,
        -0.031172674149274826,
        0.07888159900903702,
        0.007949980907142162,
        -4.695932176446149e-08,
        0.05934224650263786,
        -0.08633488416671753,
        0.02248583734035492,
        -0.007689940743148327,
        0.04880642518401146,
        0.019615205004811287,
        -0.017176570370793343,
        -0.08165392279624939,
        0.09106379002332687,
        0.009038141928613186,
        -0.07853524386882782,
        -0.07863599807024002,
        -0.021286016330122948,
        0.027659635990858078,
        0.030755531042814255,
        -0.0013438721653074026,
        0.009544932283461094,
        -0.012939978390932083,
        -0.02487916871905327,
        0.00024421504349447787,
        -0.03754878044128418,
        0.09277132898569107,
        -0.08625500649213791,
        -0.011430846527218819,
        -0.012742088176310062,
        -0.010678553953766823,
        0.04860175773501396,
        0.0018947739154100418,
        0.023622192442417145,
        -0.05538201332092285,
        -0.0858742818236351,
        0.029090024530887604,
        0.045704297721385956,
        -0.04663417115807533,
        -0.060332562774419785,
        0.04685156047344208,
        0.0051434957422316074,
        -0.05936024338006973,
        0.005560322664678097,
        0.023087946698069572,
        -0.026138678193092346,
        -0.009889759123325348,
        0.036462001502513885,
        -0.029064007103443146,
        -0.049399957060813904,
        -0.06281132996082306,
        -0.05538998171687126,
        -0.14430256187915802,
        0.011214076541364193,
        0.1472930610179901,
        -0.0043444824405014515,
        0.03731900826096535,
        0.05484876409173012,
        -0.012586281634867191,
        0.04093937203288078,
        0.002406976418569684,
        -0.006436704657971859,
        -0.022599639371037483,
        0.0277564600110054,
        0.0682331770658493,
        0.108584925532341,
        0.005828476510941982,
        0.009933797642588615,
        0.004633883014321327
    ]
}