{
    "id": "s2F_Ur7-M7U",
    "title": "Chevy Volt 2017 Review: An Electric Car With A Gas Assistant",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-09-29T01:09:17Z",
    "video_url": "https://www.youtube.com/watch?v=s2F_Ur7-M7U",
    "category": "People & Blogs",
    "tags": [
        "chevy volt review",
        "chevy volt 2017",
        "chevy volt 2017 review",
        "chevy volt 2017 features",
        "chevy volt review 2017",
        "chevy volt review 2016",
        "chevy volt 2016",
        "chevrolet",
        "best hybrid car",
        "best electric car",
        "michael fisher",
        "mrmobile",
        "tesla central"
    ],
    "views": 240908,
    "likes": 5913,
    "comments_count": 473,
    "description": "The Chevy Volt is unlike any car I've ever driven. For the first 50 miles it's an all-electric sedan with zero tailpipe emissions that you can recharge at home. Once the battery runs dry, though, the Volt keeps going on a four-cylinder gas generator that takes you the rest of the car's 420-mile range. So the Volt 2017 (which is nearly identical to the Volt 2016) exists somewhere between yesterday's world of internal combustion engines and tomorrow's world of full electrics  and whether you call that an E-REV or a PHEV, it's a pretty exciting place to be. Hop behind the wheel with Michael Fisher for MrMobile's Chevy Volt 2017 Review!   [ABOUT THIS REVIEW]  The Chevy Volt 2017 Review was produced after seven days with a Chevy Volt 2017 review vehicle on loan from Chevrolet. The car was principally driven in the Greater Boston area in September 2016, with a 500-mile round trip to New York City via Newport, RI.    [SUBSCRIBE]     [THANKS]  Additional cinematography for the Chevy Volt 2017 Review was provided by Mark Guim and Mike Jandreau.    [ADDITIONAL READING]  Chevy Volt 2017 at Chevrolet:   Chevy Volt 2017 at Car and Driver:   Chevy Volt 2017 Review at Slashgear:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Dubday\" by Cymatix, available at Premium Beat:   \"Fashionista\" by Olive Musique, available at Premium Beat:   \"Protofunk\" by Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 3.0 License    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/2f",
        "http://www.caranddriver.com/chevrolet/volt",
        "http://www.slashgear.com/2017-chevrolet-volt-review-the-secret-hybrid-22452812/",
        "http://www.premiumbeat.com/royalty_free_music/songs/dubday",
        "http://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "http://creativecommons.org/licenses/by/3.0/",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] When I test drove the Tesla Model S and Model X electric cars earlier this year, I said driving them was like sitting inside the future. Well, the 2017 Chevy Volt feels more like sitting inside the present, but it turns out the present is a lot cooler than I thought it was. I'm Michael Fisher, and this is the Mr. Mobile Review. (exciting music) Chevy's electric car branding can be a little confusing. First of all, this is the Volt, not the similar sounding Chevy Bolt. The difference is that Bolt is an electric only car while the Volt is what's called an extended range electric vehicle, or if you prefer, a plug in hybrid, but unlike a typical hybrid, the Volt is designed to operate primarily on electricity alone. That's the mode it wakes up in when you press the power button, and whether you're tooling around the city, cruising the 'burbs, or speeding down the highway, all of you motive power is coming from the electric motors and the onboard battery. Chevy says the Volt will give you up to 53 miles of range just on electric power, and you can recharge it directly, either at home or at a public charging station. If you forget to recharge it, or you can't get to a charge point, or you just need to take a longer trip, that's where the hybrid part comes in. The Volt also packs a gas powered generator and a nine gallon fuel tank that extends the range almost tenfold. Unlike previous generations, this Volt takes regular unleaded instead of demanding premium. For all the innovation in the power train, and there's a lot, the new Volt's design blends in more than it stands out. That's not a strike against it, necessarily. While I tend to prefer something a little more ostentatious, I came to love the new Volt's aerodynamic lines, especially in the kinetic blue paint job. It's got a few surprises too. I didn't know it was a hatchback when I first took delivery, but I sure was glad for it when it came time to tote around a bunch of camera equipment. Fold down the seats, you get even more room. That somewhat makes up for Chevy calling this a five-seater. Try putting anyone but the smallest child in that middle seat and you'll see what I mean. Also, big and tall folks may have trouble fitting in even the full sized rear seats. At least they get seat warmers and USB charging ports though. Up front, the interior strikes a nice balance between modern features and straightforward design. The physical controls are pleasantly tactile with big buttons and easy to find knobs while the virtual stuff is more straightforward than most car software I've used, though it's still a bit laggy at times. The Volt's onboard navigation suite works well enough, and so does its OnStar system, and the car can also produce its own WiFi hotspot using a built in AT&T cellular connection. I didn't make much use of these though, since you can also just plug your phone in and use Apple CarPlay or Android Auto. If your phone has Qi wireless charging, there's a place for that too. On the whole, the cabin exudes a sense of quality, even if it doesn't approach glitz. My review vehicle had a problem with the entertainment system frequently rebooting, but this isn't an issues I've seen widely reported yet. So for now, I'm calling it a fluke. How does it feel to drive? Pretty sporty. I had a Volt 2017 for a full week, and I used it for everything from quick jaunts to the studio to a 500-mile round trip to New York City. It's a speedy little thing. While it doesn't pack the pep of a Tesla, its 2.6 second zero to 30 time is great for quick little launches into neighborhood traffic. To a kid who grew up accustomed to mid-tier gas guzzlers, the instant acceleration when your foot hits the go pedal is still intoxicating. When you come down on the other pedal, the Volt is smart about it. It applies regenerative braking first to convert some of your kinetic energy into current and to bolster your battery charge. Only if you need to stop fast does it blend in some friction with the brake pads, which should mean they last longer. You can also choose to exclusively use regen with a dedicated paddle on the steering wheel or switch to L on the gear shifter for a bit of one pedal driving. You get direct control over energy consumption too. The hold option is basically the opposite of normal mode. It lets you drive primarily on the gas generator and keeps the battery charged at or close to full so you can save that power for later. The Volt I reviewed is the premier trim, which packs a lot of built in conveniences I quickly came to appreciate. The proximity sensors around the car's perimeter give it an awareness of its surroundings. While driving slowly on a city street, it can search for available parking spaces and then, with a little help from the driver in braking and shifting, the Volt can park itself. It was impressive, and it worked three out of the four times I tried it. The same sensors give you proximity warnings when you're creeping up on obstacles or they're creeping up on you. My favorite feature they enable is the warning light on each side mirror that lights up when someone's in your blind spot. The blind spots on the Volt are huge, so I really appreciated the help, especially driving in a city where bicyclists abound. There's also a front facing camera here alongside the rear view mirror. Among other things, it theoretically makes it possible for the car to keep itself in its own lane, but it's better as a lane departure warning system than any kind of auto pilot. The Volt will also warn you with lights and sounds if you're approaching a car ahead at an unsafe speed, and of course, Chevy offers a smart phone app so you can remotely unlock and start your Volt or just see where it is. How far you can drive on a charge depends on many factors, traffic, outside temperature, how liberal you are with the steering wheel heater, you name it. Plus, driving efficiency has a lot to do with it. I'm not a very efficient driver so I tended to go through the Volt's battery in more like 45 miles. Again, this doesn't mean my trip ended. Even at highway speeds, the car seamlessly transitions from the battery to the gas sustainer. Aside from the slight added noise, I hardly noticed it. Even with a lot of gas driving, thanks to my road trip, I inked out an average efficiency of 52 miles per gallon during the week I had with the car. If I had stuck around town, I'd have gotten much closer to what the EPA says it's capable of. What fuel I did burn was regular unleaded, not the premium stuff that older Volts demanded. I still hated falling back on fossil fuels in such a futuristic car, so I tried my best to find charge points instead. There are more of these across New England than I expected, and the charge point app is super handy for navigating you to them, telling you how much the charge will cost, and it'll even let you know whether a particular charger is being used at the moment. Some of the charge points I found were free and some weren't, but all were much less expensive than a gas pump. The downside is because the Volt lacks an onboard high speed charger, it doesn't fill up fast at all. A full charge takes between four and five hours at a level two station. You also have the option of charging via level one, which is literally plugging the car into a household outlet, but as you might expect, that's even slower. As a guy who lives in an apartment building without a charger, the Volt obviously isn't meant for me. So who is it meant for? For folks who can juice it up every night in their garage and wake up with a full battery. If you're one of those people, and your round trip to work is less than 50 miles, you could be one of the proud Volt owners who only go to the gas station a few times a year. That, plus the fact that the car can take gas when it needs it, makes it easy to understand why the Volt has accrued such a passionate fan base. Again, keep in mind that I reviewed the high end $40,000 configuration. The least expensive one I could build online was $34,000 and it skimps on some of the tricks. That's pricey, but it's in line with competitors. You've gotta keep in mind two things. First, as of today, the Volt still qualifies for the full $7,500 tax credit for electric vehicles, and second, the cost savings over time with a car you almost never take to a gas station is significant. While I'm not canceling my Tesla Model 3 pre-order because it won't be delivered for a few years, if I were shopping for a new car right now, there's a good chance I would. Whereas the all electric Teslas and Chevy's own Bolt may be the cars of tomorrow, the infrastructure of tomorrow isn't here yet. So the Volt is an excellent car for today. If you wanna know more about those Teslas, check out my Model 3 preview featuring test drives of both Model S and Model X. If you're watching on YouTube, please subscribe to the Mr. Mobile so you don't miss more videos dropping twice a week. Until next time, thanks for watching, and stay mobile, my friends. (upbeat music)",
    "transcript_keywords": [
        "Volt",
        "car",
        "Chevy electric car",
        "Chevy Volt feels",
        "electric cars earlier",
        "Chevy Volt",
        "Chevy",
        "electric",
        "sitting inside",
        "gas",
        "Model",
        "sounding Chevy Bolt",
        "charge",
        "Tesla Model",
        "Chevy Bolt",
        "Chevy electric",
        "Volt battery",
        "inside the future",
        "cars earlier",
        "Michael Fisher"
    ],
    "transcript_entity_values": [
        "7,500",
        "between four and five hours",
        "Tesla Model S",
        "First",
        "the week",
        "2017",
        "Bolt",
        "EPA",
        "Tesla",
        "Android Auto",
        "Volt",
        "Tesla Model 3",
        "500-mile",
        "tomorrow",
        "AT&T",
        "New York City",
        "less than 50 miles",
        "YouTube",
        "earlier this year",
        "53 miles",
        "four",
        "USB",
        "2.6 second",
        "three",
        "Mobile",
        "a full week",
        "30",
        "today",
        "first",
        "five",
        "two",
        "Chevy",
        "34,000",
        "40,000",
        "a few years",
        "Chevy Bolt",
        "Apple CarPlay",
        "second",
        "more like 45 miles",
        "OnStar",
        "Model S",
        "New England",
        "Model X",
        "every night",
        "Teslas",
        "Michael Fisher",
        "Model 3",
        "one",
        "nine gallon",
        "52 miles per gallon"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "LOC",
        "NORP",
        "TIME",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY"
    ],
    "vector": [
        -0.0684724897146225,
        0.08467037230730057,
        0.05860798805952072,
        -0.012480475939810276,
        0.04872198402881622,
        -0.01459517702460289,
        -0.060100048780441284,
        0.05663974955677986,
        -0.016522131860256195,
        0.027545319870114326,
        0.021167613565921783,
        0.02143291011452675,
        -0.10549987107515335,
        0.01975283958017826,
        -0.042956870049238205,
        0.008479992859065533,
        0.11451668292284012,
        -0.032881055027246475,
        0.024480391293764114,
        -0.03843114525079727,
        0.04443179443478584,
        0.03049490600824356,
        0.03779497370123863,
        0.017832307144999504,
        0.07564699649810791,
        0.04841219261288643,
        -0.035300787538290024,
        0.06330535560846329,
        -0.0772840604186058,
        -0.07720140367746353,
        -0.04468430206179619,
        -0.05569186806678772,
        -0.03817471116781235,
        -0.05087381228804588,
        -0.03287951275706291,
        -0.041330259293317795,
        0.0037004149053245783,
        0.0235593281686306,
        0.04186103865504265,
        -0.000994647154584527,
        -0.013164970092475414,
        -0.04634632170200348,
        0.0409557968378067,
        -0.002629935974255204,
        -0.001552529283799231,
        -0.02428647130727768,
        -0.015823252499103546,
        -0.054590269923210144,
        0.05783728137612343,
        -0.08642024546861649,
        0.006981436628848314,
        -0.021274657920002937,
        0.014578495174646378,
        0.01906609907746315,
        -0.10880795121192932,
        0.025188932195305824,
        -0.012868053279817104,
        -0.000640053185634315,
        0.028231140226125717,
        -0.1257666051387787,
        0.002835826948285103,
        -0.009926368482410908,
        -0.024293087422847748,
        -0.010141462087631226,
        -0.09024941176176071,
        -0.016157882288098335,
        0.04595067724585533,
        -0.07999616861343384,
        0.008718214929103851,
        -0.061325591057538986,
        -0.0022266372106969357,
        0.010158400051295757,
        -0.057625118643045425,
        0.004413759335875511,
        -0.006734529044479132,
        0.043060559779405594,
        0.0656127855181694,
        0.01612008363008499,
        0.006966063752770424,
        0.025362573564052582,
        0.048417359590530396,
        0.06862203776836395,
        -0.11077634990215302,
        -0.038200680166482925,
        -0.01922404021024704,
        0.027672259137034416,
        -0.043860167264938354,
        0.07754436880350113,
        0.007267555687576532,
        0.05197249352931976,
        -0.03147430345416069,
        0.039469800889492035,
        0.050805967301130295,
        -0.0026902067475020885,
        -0.01141579169780016,
        0.01900734379887581,
        -0.0005218698643147945,
        -0.027912545949220657,
        0.08330770581960678,
        -0.014151496812701225,
        0.01687891222536564,
        0.06835048645734787,
        -0.02772953175008297,
        -0.03265297785401344,
        -0.01978454925119877,
        0.040361370891332626,
        0.05070413276553154,
        0.020441019907593727,
        0.024526726454496384,
        -0.05967332795262337,
        0.022438831627368927,
        -0.01145170908421278,
        0.013635537587106228,
        -0.07469726353883743,
        -0.04480423778295517,
        -0.01037286315113306,
        -0.06662141531705856,
        0.03912176191806793,
        0.04685569182038307,
        0.09973745793104172,
        0.022536354139447212,
        -0.023323697969317436,
        0.05323881283402443,
        0.004374785348773003,
        0.07189381867647171,
        -0.015341105870902538,
        0.06795310229063034,
        1.0116005917814093e-33,
        -0.045158181339502335,
        -0.030914748087525368,
        0.0475362204015255,
        0.03527086600661278,
        0.01904168911278248,
        0.147881418466568,
        -0.020708464086055756,
        0.03887450695037842,
        -0.04601452499628067,
        -0.018648669123649597,
        -0.01937294937670231,
        -0.07592494785785675,
        -0.006163938902318478,
        -0.007036216091364622,
        -0.0464249812066555,
        -0.006598817650228739,
        -0.06269846111536026,
        -0.08519565314054489,
        -0.0939033105969429,
        -0.04461972787976265,
        -0.011503389105200768,
        -0.01209409348666668,
        0.027270860970020294,
        0.0470661036670208,
        0.03840788081288338,
        -0.037718988955020905,
        0.004772222135215998,
        -0.012440920807421207,
        -0.021749498322606087,
        0.03350295126438141,
        -0.07866761833429337,
        0.11060270667076111,
        0.007972520776093006,
        -0.007294818293303251,
        -0.04558124393224716,
        0.024809598922729492,
        -0.0101318946108222,
        -0.04166792705655098,
        0.0447663851082325,
        0.0027237702161073685,
        -0.006294793449342251,
        0.03300456330180168,
        -0.0788760706782341,
        -0.01942495070397854,
        -0.009724875912070274,
        -0.0030309089925140142,
        0.009006956592202187,
        0.07031866908073425,
        0.05750451609492302,
        0.03782104328274727,
        -0.03382560983300209,
        -0.022020643576979637,
        -0.05014738067984581,
        0.024153873324394226,
        -0.0486474335193634,
        0.09907489269971848,
        0.015454508364200592,
        -0.041611429303884506,
        0.022112997248768806,
        0.016525108367204666,
        -0.002306239679455757,
        0.20418541133403778,
        0.007395836990326643,
        -0.05818155035376549,
        -0.03803861141204834,
        -0.013754512183368206,
        -0.02072138339281082,
        -0.033060379326343536,
        0.015069682151079178,
        0.07662690430879593,
        0.046504516154527664,
        -0.13125479221343994,
        -0.04561123251914978,
        -0.0859052911400795,
        0.09003537148237228,
        -0.0578547939658165,
        0.0010517665650695562,
        0.04309642314910889,
        0.029442157596349716,
        -0.029257042333483696,
        -0.04288258031010628,
        -0.041809696704149246,
        -0.024203112348914146,
        -0.03864379599690437,
        0.10625291615724564,
        -0.01393565908074379,
        -0.06707692891359329,
        0.01409151405096054,
        0.057707466185092926,
        0.036436859518289566,
        0.012296196073293686,
        0.01334906741976738,
        -0.037751778960227966,
        0.012805246748030186,
        0.05041182413697243,
        -3.638666723179572e-33,
        0.058516256511211395,
        0.06866507232189178,
        0.0019663660787045956,
        0.10116617381572723,
        -0.01705966517329216,
        -0.006114250514656305,
        -0.030252134427428246,
        0.07235751301050186,
        0.009826223365962505,
        -0.014297808520495892,
        0.009361824952065945,
        -0.028319474309682846,
        -0.0290111992508173,
        0.03821210563182831,
        0.12328358739614487,
        0.006122505757957697,
        -0.032412730157375336,
        -0.09596475958824158,
        0.007149867247790098,
        0.066019207239151,
        0.05269736424088478,
        0.0005311478744260967,
        -0.023072756826877594,
        0.017491212114691734,
        0.04038059711456299,
        -0.04138976335525513,
        0.0033892483916133642,
        0.0712626725435257,
        -0.009487091563642025,
        -0.047559477388858795,
        -0.02897740714251995,
        0.043309926986694336,
        0.0038040734361857176,
        -0.04302627220749855,
        -0.04080303758382797,
        0.01144427340477705,
        0.07803820818662643,
        0.006122463848441839,
        0.019819660112261772,
        -0.011162002570927143,
        0.04798460751771927,
        -0.046558234840631485,
        0.041664715856313705,
        0.008393458090722561,
        -0.05457783862948418,
        -0.01980872079730034,
        -0.012442837469279766,
        -0.018719367682933807,
        0.06511572003364563,
        0.046248145401477814,
        -0.015516470186412334,
        -0.005010444670915604,
        -0.060091711580753326,
        0.11016296595335007,
        -0.015644988045096397,
        -0.07679644972085953,
        0.019421972334384918,
        0.07649846374988556,
        -0.016373518854379654,
        -0.009885725565254688,
        0.017637742683291435,
        0.015125240199267864,
        0.047953780740499496,
        -0.05379709601402283,
        -0.033914871513843536,
        -0.12836110591888428,
        0.019862648099660873,
        -0.057968657463788986,
        0.10480062663555145,
        -0.029388003051280975,
        -0.09128369390964508,
        -0.021506432443857193,
        0.00755171338096261,
        -0.14130912721157074,
        -0.06238063424825668,
        0.02592547982931137,
        0.016161881387233734,
        -0.09894411265850067,
        0.054765067994594574,
        -0.08199050277471542,
        0.010228235274553299,
        0.026323728263378143,
        0.006057057995349169,
        -0.06807944923639297,
        0.012563946656882763,
        -0.014879734255373478,
        -0.07168316096067429,
        0.016069889068603516,
        0.00811321847140789,
        0.12239790707826614,
        0.030986053869128227,
        0.008147839456796646,
        -0.07858577370643616,
        0.01721307449042797,
        -0.04282408207654953,
        -5.4347367495211074e-08,
        0.06839849799871445,
        0.139835387468338,
        0.05614340677857399,
        0.037151824682950974,
        0.055333610624074936,
        -0.007069398183375597,
        0.03886569291353226,
        0.04820116609334946,
        -0.007953834719955921,
        0.06296338886022568,
        0.13529667258262634,
        -0.045805685222148895,
        0.08743320405483246,
        0.007351103704422712,
        0.029563618823885918,
        0.043599482625722885,
        -0.06862495094537735,
        0.06954880058765411,
        -0.02764318883419037,
        0.03842165693640709,
        -0.047683991491794586,
        -0.010437826626002789,
        -0.06318946927785873,
        0.014843204990029335,
        0.06955653429031372,
        -0.018047625198960304,
        -0.008172974921762943,
        -0.010289893485605717,
        0.018743233755230904,
        -0.07655372470617294,
        -0.022684961557388306,
        0.05946405604481697,
        0.050022855401039124,
        -0.028351934626698494,
        -0.045573409646749496,
        -0.08132688701152802,
        -0.056692421436309814,
        -0.034703329205513,
        0.02613324113190174,
        -0.11605514585971832,
        0.003951710648834705,
        -0.07619240134954453,
        -0.03164304420351982,
        -0.009238570928573608,
        -0.09453193843364716,
        -0.050515949726104736,
        -0.009838961996138096,
        -0.05773446336388588,
        -0.08014684170484543,
        0.04412606731057167,
        -0.022702794522047043,
        -0.07971645891666412,
        -0.009211554192006588,
        0.026845049113035202,
        0.07956381142139435,
        0.014994903467595577,
        -0.03293045982718468,
        -0.018075378611683846,
        -0.024455787613987923,
        -0.05310703441500664,
        0.05640517547726631,
        -0.06339103728532791,
        -0.029197337105870247,
        0.03637229651212692
    ]
}