{
    "id": "s2lCkVHQYus",
    "title": "AirPods Pro Unboxing and Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-10-29T12:04:33Z",
    "video_url": "https://www.youtube.com/watch?v=s2lCkVHQYus",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Airpods pro",
        "review",
        "unboxing",
        "compairison"
    ],
    "views": 4639286,
    "likes": 106488,
    "comments_count": 9651,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- And here they are, the new AirPods Pro. (relaxed electronic music) (video tape whirring) Today we are checking out the new AirPods Pro. These were just announced by Apple and I'm so excited to check them out. These are the newest line of Pro products to join the Apple lineup. You may be wondering what's the difference between these and the regular AirPods? Let's unbox and find out. (relaxed electronic music) And here they are. The first thing that you're gonna notice is the case is slightly larger. But it's weird because it's kind of just like squished the other way. New AirPods, old AirPods. At checkout you also have the option of engraving your AirPods, much like I did with previous gen, which I'm so happy I did because I get these confused with people's all the time. But guess what? Not anymore because my name is on it. So the case kind of just looks like it got squished a little bit because the size isn't really that much different, it's just a little bit larger. All right, let's open them up. So the main highlight of the brand new AirPods Pro is the fact that they have noise cancellation. And it has active noise cancellation, but it also has a Transparency mode. And with this Transparency mode you're able to hear the outside world. So to make all of that possible they had to redesign what the actual AirPod looks like. These now have a little in-ear silicon tip on them. And also inside the box are two other size options, in case the one that comes with it doesn't fit. There's a little microphone and each one of these, inside of your ear so. The AirPod is actually able to hear what you're hearing. And with that they're able to make adjustments to outside sound, to really make the active noise cancellation work. This also comes with something else that I'm excited about, which I feel like this is moving us closer and closer to USB-C, this comes with a USB-C to a Lightning cable. Let's get these paired to my phone, immediately. One of the things that's so great about AirPods is you basically just have to get it close to your phone and it will automatically start pairing. And they're connecting, connecting. \"Media Control,\" so this is showing you how to use them. So what's different with these ones is they have this little button right here, so there's different presses that you can press to activate different things. Like changing tracks, switching from Transparency mode to noise canceling. Also pretty cool because you can do all of these things inside of the Control Center. Before you you should do their little fit test that they have. So you go into your Bluetooth settings, and this is one of the places that you control the Transparency or you can turn both off, just to have nothing, normal AirPods. And you can also activate the noise cancellation. This can also be activated by swiping down and doing a long press on the volume. Noise cancellation, off, Transparency. This option is also available on the Apple Watch. And, if that's not enough, if you do a long press that will also switch between the different options as well. So right now I'm in Transparency, and it's so weird. I've used so many headsets that have this kind of setting, that lets the outside noises in. What's so wild about this, I don't even know how to explain it, 'cause if you ever use these types of things before, it seems to make your voice super, super loud. So you just sound extra loud inside of your head and then the whole world around you also sounds really loud. But it's kind of like this heightened sense and it's very strange. But with this, I honestly feel like I forget that I even have them on. So before I get into testing these out I need to do my fit test. So I have to make sure that these fit well in my ear. And I feel like this, I think it might be a little bit too big. So I'm going to switch these to the smaller option, and these are really so easy to just take off of here. You just, and you do the same thing on here. And it's weird because I feel like I'm gonna break it, but it has a really snug little seal and you just pop it right off, and you pop the new one right on. And you can also keep this to house those previous ones. Okay, so now that these feel like they're fitting pretty snug. Let's go back into Justine's AirPods Pro. And this here is the Ear Tip Fit Test. So using those internal microphones, it's able to hear what you're hearing to make sure that there's actually a good seal between your ear and the inner ear silicon tip. So let's test the fit of your ear tips. Here we go. It's playing a little song for me. And here it is these are my ear tip fit results. It says I have a pretty good seal, okay. So I feel like this is one of those things that you're just gonna have to test out and see what works best for you. So crazy, 'cause I'm using the Transparency mode, so does even feel like I have these in my ears at all. Now I wanna play some music, these also have Siri integration, so if I wanna to listen to something I just have to say, play the new Tool album. Okay, so I'm still using the Transparency mode and if I wanna switch to noise cancellation, I'm just gonna hold this in. Okay, now it's. Oh gosh, this is so crazy. It's real, I just! You guys are sitting there just watching me do weird things and make weird expressions, so without actually being able to try this. So what I'm doing is I'm pressing on here. One press to skip tracks, play or answer a call. Two presses to skip tracks, three presses to go back a track and the long press, that's which is between the noise cancellation and the Transparency mode. So there's so many different options and ways for you to switch into these different modes. So it's kind of crazy that that's just another way to do it. You could also do this. You can even ask Siri to turn it on and off for you. Turn on noise cancellation. Turn off noise cancellation. And just like that, Siri turned it off. So far I'm really liking these a lot. When I first saw the rumors of these types of headphones from Apple I got a little bit nervous because a lot of times these don't work with my ears. I have very sensitive ears. So I am beyond excited to report that my sensitive ears are not bothered by these at all. And it's kind of crazy because a lot of times noise canceling headphones like this release some sort of weird pressure. But this also has a little thing, it's got like this little airflow vent that they've included. So that allows for air flow to kind of go in your ear, so it makes a much more natural feel. So let me give you a side-by-side comparison over the old and the new AirPods. Because it's crazy the size difference. I mean look at this. (relaxed music) New AirPod, old AirPod. Old AirPod, new AirPod. So even looking straight on, you can already instantly tell the difference. The little antenna is way shorter on the new ones. So I had to go somewhere outside of my office to really test these out. The sun is about to set so I thought I wanna to go to my favorite coffee shop, get myself a latte, so I can stay up all night editing this video for you guys. And, it's crazy, because right now I'm using the Transparency on the new AirPods. And there's traffic, there's people, but I can hear all of it until I tell Siri to turn on noise cancellation. Turn on noise cancellation. I hear a slight rush of traffic. I don't wanna talk to loud, 'cause I'll sound like I'm yelling. Play the new Tool album. So let's go into the setting. You can see the like noise cancellation is on, and then we're gonna turn the volume up. So that I have the volume turned up a little more, I actually can't hear anything else. Turn off the noise cancellation. The Transparency is on, I can hear the traffic, I can hear my music. And now I'm gonna turn the noise cancellation back on. Oh man. This is so great, I'm so excited for you guys to actually experience this, if you do get these. (gasps) I can still hear a slight bit of traffic. With the mix of music and the noise cancellation, this sounds amazing. I don't even really know how to do this demo for you guys because you can't experience what I'm hearing, so I can only sort of explain it. Let's put a noise cancellation back on. (laughs) Surprise, I don't hear anything. We seem to be losing light now. So the sun is setting. So I'm gonna actually go back home and I'm gonna edit this entire video using the new AirPods. So back to my unboxing room. This case is also a wireless charging case, much like the new case that just came out in the last version of the AirPods. I did get a chance to try these on a flight and I was really impressed. Mostly because you kind of just always consistently hear this, just, airplane sound. It's just like a shh. (airplane whirring) It's just in your head. So even when I wasn't even listening to music, just turning on the active noise cancellation, just put me at peace. And then, while playing music, and with the active noise cancellation on, it really did drown out pretty much everything. So with the AirPods Pro you'll get five hours of listening time, but if you have active noise cancellation or Transparency on, you'll get about 4.5. And about 3.5 hours of talk time, but with a five minute charge that will give you an extra hour of listening time. And this entire case will provide you with about 24 hours of listening time. So if that's not enough time to get you through your day, I'm not sure what is. Something else that I'm excited to try out is the audio sharing. So if I'm listening to some music or watching a movie and my friend wants to also listen or watch my movie, over my shoulder, on a flight, we can do audio sharing. So all your friend has to do is bring their AirPods close to yours. I can temporarily share my audio. Since these are my AirPods, I guess I'm temporarily sharing them with myself. But that's pretty great. So when I clicked, it to connect, it's just giving me this option to temporarily connect. \"You can now listen to music, watch video \"or play games together.\" Holy moly, done! Okay, so I'm gonna act like these are in someone else's ear right now. Play a Macklemore & Ryan Lewis, \"Thrift Shop\". Justine's AirPods #2 are connected. And here you'll see you have the volume options for both AirPod sets. This is so great. And, obviously, since I have the Pro version, I can click in and I can change my noise cancellation Text Jenna Ezarik and ask her if she likes candy. So I have this set up so that it'll read text messages, and then you couldn't automatically respond from there, as well, using Hey Siri. So she just read the message to me that said, \"OMG, yeah, sad crying face.\" Me too, I'm making a video and thinking about Halloween candy. It has a little notification that it says that it was sent with Siri. I really like that because a lot of times, I mean, it's no secret that sometimes Siri thinks that you're saying something and you're not saying the correct thing. So this will at least give context. I know there's definitely some times that I have written some very lengthy things to Jenna and it's very obvious that it is a voice to text. So this is really great because this will actually let them know that you're not typing it and you're hands-free. So if you do get the new AirPods make sure you're updated to the latest iOS on your phone, so that you'll be able to use all of the features. I really love the audio sharing. I think that's probably one of my favorite things so far. Especially for traveling and different flights and playing games together. My first impressions, I am actually way more impressed than I thought I was gonna be. I love the case, I love the design, I love the fit. I am in love with the Transparency mode. I would love to know what you guys think of these. What is your first impressions, having not even seen them yet? I'll be making it follow-up video, probably within a week or so after I've really got a chance to try these out, test them in the wild, edit with them and listen to music and probably play a lot of \"Call of Duty: Mobile\". Has anybody else been playing \"Call of Duty: Mobile\"? Because it is so incredibly fun. I know that the new \"Call of Duty: Modern Warfare\" just came out, I've been playing that a lot on Xbox as well. But the mobile version is so much better than I thought it was gonna be and I'm really good at it. I don't know if I'm just good or if everybody else is terrible, maybe a combination of both? But that's a whole nother story. Anyway, AirPods. Don't forget to subscribe so you'll be able to see all of my future videos. And be sure to hit the bell, so you'll be notified when I do post new videos. I've got a bunch of great content coming up for you guys. We're just continuing this month of incredible tech gadgets. So I'll see you guys in my next video, bye. (upbeat music)",
    "transcript_keywords": [
        "noise cancellation",
        "noise",
        "AirPods",
        "Transparency",
        "AirPods Pro",
        "cancellation",
        "Transparency mode",
        "active noise cancellation",
        "Pro",
        "hear",
        "ear",
        "Siri",
        "AirPod",
        "active noise",
        "turn",
        "things",
        "noise cancellation back",
        "fit",
        "make",
        "feel"
    ],
    "transcript_entity_values": [
        "AirPods",
        "Thrift Shop",
        "Call of Duty: Mobile",
        "One",
        "an extra hour",
        "a week or so",
        "USB-C",
        "AirPods Pro",
        "the Ear Tip Fit Test",
        "Apple",
        "the Control Center",
        "Justine",
        "Call of Duty: Modern Warfare",
        "Two",
        "Siri",
        "Today",
        "three",
        "this month",
        "Media Control",
        "about 24 hours",
        "New AirPods",
        "Xbox",
        "AirPod",
        "Siri",
        "about 4.5",
        "Halloween",
        "five hours",
        "all night",
        "Jenna Ezarik",
        "two",
        "Justine's AirPods Pro",
        "about 3.5 hours",
        "first",
        "the AirPods Pro",
        "five minute",
        "Jenna",
        "Macklemore & Ryan Lewis",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "LOC",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "TIME",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "TIME",
        "PERSON",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.03698836639523506,
        -0.05849423632025719,
        -0.03980356082320213,
        -0.05853305384516716,
        0.045727841556072235,
        0.02758748084306717,
        0.04238641634583473,
        0.003451218828558922,
        -0.04056558758020401,
        0.06173480674624443,
        0.030400758609175682,
        0.026763681322336197,
        -0.02657484821975231,
        -0.020469266921281815,
        -0.014561846852302551,
        0.059801965951919556,
        0.03339970484375954,
        -0.04366416111588478,
        -0.041828740388154984,
        0.0613076351583004,
        -0.03743696212768555,
        -0.05257232487201691,
        0.03547709807753563,
        0.013717585243284702,
        -0.004897660110145807,
        0.0307401642203331,
        0.006844190880656242,
        0.002995893592014909,
        -0.10120609402656555,
        -0.0783577486872673,
        0.001599850133061409,
        0.03408816456794739,
        0.09273602813482285,
        -0.003574733855202794,
        0.03616444766521454,
        -0.050544414669275284,
        0.034748625010252,
        -0.01658613048493862,
        -0.012436704710125923,
        -0.021830787882208824,
        -0.018222061917185783,
        -0.05365098640322685,
        -0.02899596467614174,
        -0.02391677536070347,
        -0.05792874097824097,
        -0.053840331733226776,
        -0.03561680391430855,
        -0.07005821913480759,
        0.049201831221580505,
        0.06493120640516281,
        -0.04499901086091995,
        -0.015637347474694252,
        0.08372776210308075,
        0.042386651039123535,
        -0.08017998933792114,
        -0.008105945773422718,
        -0.07981985062360764,
        0.008426692336797714,
        0.005443467292934656,
        -0.1086045429110527,
        0.03427080810070038,
        -0.029299696907401085,
        0.0157498549669981,
        0.006163774989545345,
        -0.025393491610884666,
        -0.04137147217988968,
        -0.0009231964941136539,
        -0.005558077711611986,
        0.03385365009307861,
        0.03319020941853523,
        -0.10964285582304001,
        0.07559596002101898,
        -0.04190784692764282,
        -0.0024225476663559675,
        0.01557912863790989,
        0.06182079017162323,
        0.010920302011072636,
        -0.06837604939937592,
        -0.0053757550194859505,
        0.10690130293369293,
        0.05989505350589752,
        -0.022766508162021637,
        -0.04754137992858887,
        -0.04850625619292259,
        0.012718264944851398,
        0.019709747284650803,
        -0.008905802853405476,
        0.007949279621243477,
        -0.08195663243532181,
        -0.06044227257370949,
        -0.0755014568567276,
        0.004914405755698681,
        0.03186176344752312,
        -0.012308379635214806,
        0.025900481268763542,
        -0.0870978906750679,
        -0.04290009289979935,
        -0.008816924877464771,
        -0.04050259292125702,
        0.03478167578577995,
        0.0522722452878952,
        -0.036110348999500275,
        -0.008255662396550179,
        -0.06394179165363312,
        0.00031795434188097715,
        -0.12398773431777954,
        -0.07654311507940292,
        -0.025882985442876816,
        0.03661759942770004,
        0.04371786117553711,
        -0.062171466648578644,
        -0.023108890280127525,
        -0.07054822891950607,
        -0.026242488995194435,
        -0.022147130221128464,
        0.14455580711364746,
        -0.03764159977436066,
        0.0736900046467781,
        0.030501533299684525,
        0.0061880131252110004,
        -0.019669977948069572,
        -0.08475394546985626,
        0.01620016247034073,
        0.04163089767098427,
        -0.05827833712100983,
        0.025103004649281502,
        -0.07694754749536514,
        1.322461560591401e-32,
        -0.01882513426244259,
        0.0177124235779047,
        -0.015908896923065186,
        0.06033684313297272,
        0.0003232437593396753,
        -0.03187097981572151,
        -0.01671171374619007,
        0.07804732024669647,
        0.0007419346366077662,
        0.027369091287255287,
        -0.043942805379629135,
        0.06489358097314835,
        -0.019533682614564896,
        0.01138332299888134,
        0.018022041767835617,
        -0.06922400742769241,
        -0.03162863105535507,
        -0.010487711057066917,
        -0.057464055716991425,
        0.011892341077327728,
        0.003214420983567834,
        0.008631043136119843,
        -0.023574966937303543,
        0.11487989127635956,
        0.10934273898601532,
        0.058830901980400085,
        0.02531375177204609,
        -0.008372102864086628,
        0.03629281371831894,
        0.005297935102134943,
        -0.05571542680263519,
        -0.04147711396217346,
        -0.0060951560735702515,
        -0.04418808966875076,
        0.009964839555323124,
        0.0029855621978640556,
        -0.05119381844997406,
        0.027507787570357323,
        -0.013368731364607811,
        -0.054585933685302734,
        0.018450608476996422,
        -0.029336698353290558,
        -0.02470700815320015,
        -0.07061794400215149,
        0.09109742939472198,
        0.030301542952656746,
        0.015988074243068695,
        0.05651358887553215,
        -0.008407014422118664,
        -0.020247064530849457,
        -0.006681328639388084,
        -0.001240443903952837,
        -0.05687679722905159,
        0.003996934741735458,
        -0.022095412015914917,
        -0.12154902517795563,
        -0.043241940438747406,
        0.07390045374631882,
        0.045362796634435654,
        0.014605243690311909,
        0.011115305125713348,
        -0.020221568644046783,
        -0.013306393288075924,
        -0.06361448764801025,
        -0.08432361483573914,
        0.11678332835435867,
        0.013701461255550385,
        -0.019925570115447044,
        0.01545595470815897,
        0.06039166823029518,
        0.03303872421383858,
        0.06988143920898438,
        0.03540940582752228,
        -0.0008021187386475503,
        0.02285621501505375,
        0.06343258172273636,
        -0.04599234089255333,
        -0.04028807953000069,
        0.0022096128668636084,
        -0.016725290566682816,
        -0.02102915570139885,
        0.11263150721788406,
        -0.006498688366264105,
        0.09732237458229065,
        -0.055478669703006744,
        -0.09729370474815369,
        0.013282256200909615,
        -0.02395595610141754,
        -0.05066254362463951,
        0.026274554431438446,
        0.020247044041752815,
        0.08475338667631149,
        -0.10868959873914719,
        -0.04787607491016388,
        -0.00789512600749731,
        -1.2917231180013674e-32,
        0.07268062233924866,
        0.029702531173825264,
        0.0018628761172294617,
        -0.021405450999736786,
        0.05451463535428047,
        0.017575901001691818,
        0.054664310067892075,
        0.09744536876678467,
        0.08001065254211426,
        -0.08348004519939423,
        0.027702530845999718,
        -0.07839983701705933,
        -0.0908840000629425,
        0.0263899527490139,
        -0.024713097140192986,
        -0.04176708310842514,
        -0.0851077288389206,
        -0.06834755837917328,
        0.06761685013771057,
        -0.007771261967718601,
        0.0816042348742485,
        0.10552524030208588,
        0.1146264597773552,
        0.011067676357924938,
        -0.05414069816470146,
        -0.015978310257196426,
        0.01803024858236313,
        0.022793203592300415,
        0.05442487820982933,
        0.04024523124098778,
        0.02958938479423523,
        -0.02174333855509758,
        -0.010996419936418533,
        0.028004128485918045,
        0.028798317536711693,
        0.016437185928225517,
        -0.03536441922187805,
        0.06162705272436142,
        0.037515051662921906,
        -0.08568673580884933,
        -0.007855146192014217,
        0.02659868635237217,
        -0.020738529041409492,
        -0.04306579381227493,
        0.039523061364889145,
        -0.11898557096719742,
        -0.06003580614924431,
        0.03558853268623352,
        0.025693941861391068,
        -0.03577705845236778,
        -0.06799399852752686,
        -0.04146605730056763,
        -0.03776603192090988,
        -0.019823791459202766,
        -0.04160449281334877,
        0.03808775916695595,
        -0.06386677175760269,
        -0.030512094497680664,
        0.05881480500102043,
        0.0197254940867424,
        0.05742458254098892,
        -0.003244316903874278,
        -0.04786282777786255,
        -0.05999312549829483,
        -0.03461102396249771,
        -0.06308896839618683,
        0.07690069824457169,
        0.05299478769302368,
        0.005934545770287514,
        0.009445696137845516,
        -0.01717020571231842,
        0.026269318535923958,
        0.04845941439270973,
        0.02514978125691414,
        0.0771578848361969,
        0.008374164812266827,
        -0.09154535830020905,
        -0.0036569973453879356,
        0.11521632969379425,
        -0.024111224338412285,
        -0.09399938583374023,
        -0.025517620146274567,
        0.03399326652288437,
        0.07943380624055862,
        0.10907451063394547,
        0.08490820229053497,
        0.08437596261501312,
        -0.055225685238838196,
        -0.04624202474951744,
        0.07721337676048279,
        0.033664483577013016,
        0.024667033925652504,
        0.05769394338130951,
        0.115659698843956,
        -0.041152503341436386,
        -6.354841275424405e-08,
        0.08558664470911026,
        0.023530809208750725,
        0.007265583612024784,
        0.01053319126367569,
        -0.004680401645600796,
        -0.08585600554943085,
        -0.01414536777883768,
        0.05583507567644119,
        0.05571755766868591,
        -0.059655603021383286,
        0.05589798465371132,
        -0.02417653426527977,
        -0.06983698159456253,
        0.09429021924734116,
        0.040393415838479996,
        0.015829291194677353,
        -0.08914807438850403,
        0.1006133183836937,
        -0.020000042393803596,
        -0.046723347157239914,
        -0.044359683990478516,
        0.03549046069383621,
        0.04767956584692001,
        -0.001909951213747263,
        0.020459748804569244,
        0.03358832001686096,
        0.0037095092702656984,
        -0.01525279600173235,
        0.033459678292274475,
        0.008389786817133427,
        -0.10105825215578079,
        -0.01352346409112215,
        -0.0029705336783081293,
        -0.006113934330642223,
        -0.06341158598661423,
        -0.02686864510178566,
        -0.04232190176844597,
        -0.0329204723238945,
        -0.025828512385487556,
        0.019887812435626984,
        0.029128719121217728,
        -0.11413507163524628,
        -0.05041856691241264,
        -0.018772084265947342,
        0.021410051733255386,
        -0.0803917646408081,
        0.09346368908882141,
        -0.07268134504556656,
        -0.07139287143945694,
        0.0010857748566195369,
        -0.023554712533950806,
        0.05607272684574127,
        0.023115111514925957,
        -0.0010256586829200387,
        0.07241225987672806,
        0.0018201898783445358,
        0.0038086483255028725,
        0.0628497526049614,
        -0.02008967660367489,
        0.01840974949300289,
        0.008559701964259148,
        0.03803151100873947,
        -0.055294521152973175,
        0.04230113700032234
    ]
}