{
    "id": "s9tbjXTth5s",
    "title": "This Mystery Tech Has a Secret...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2023-09-17T16:01:37Z",
    "video_url": "https://www.youtube.com/watch?v=s9tbjXTth5s",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "tech",
        "unboxing",
        "robo and kala",
        "robo",
        "kala",
        "robo & kala",
        "laptop",
        "surface",
        "mcdonalds",
        "tetris",
        "mcdonalds tetris",
        "chicken nugget",
        "nugget tetris",
        "amazon",
        "gold pc",
        "dell",
        "switch",
        "nintendo",
        "switch keyboard",
        "keyboard switch",
        "glassouse",
        "glass mouse",
        "shortlife",
        "short life",
        "ragnok",
        "eufy",
        "smartdrop",
        "smart drop",
        "austin",
        "austin evans"
    ],
    "views": 470003,
    "likes": 14455,
    "comments_count": 356,
    "description": "Use coupon HEYGUYS in my livestream to get $25 off your first purchase! I'll be live on September 21st at 3PM PT, come hang out!   Robo & Kala Laptop on Amazon:  Gold Dell PC on Amazon:  GlassOuse Mouse on Amazon:  Dries Depoorter Shortlife:  Ragnok Vertical FPS Mouse:  Eufy Security SmartDrop on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 The Instagram Laptop 3:28 Whatnot 4:29 McTetris 5:53 All That Glitters Isn't Gold 6:45 Not Nintendo Approved 7:49 Glassouse 10:54 The \"Gold\" PC 11:56 Keyboard \"Switch\" 12:23 I'm Counting Down 13:58 What a Device 16:13 Porch Pirates Beware",
    "description_links": [
        "https://www.whatnot.com/invite/austinnotduncan",
        "https://austin.tech/robokala",
        "https://austin.tech/goldpc",
        "https://austin.tech/glassouse",
        "https://driesdepoorter.be/product/shortlife-v2/",
        "https://www.ragnok.net/ragnok-2-vertical-gaming-mouse-for-fps-and-tps-games/",
        "https://austin.tech/smartdrop",
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- Mystery Tech. This video is brought to you by the subscribe button. S-U-B-S-C-R-I-B-E. The ring a ling. Why is there so many pieces of tape on that box? Is there something nefarious in this box? (box thuds) Something heavy in that box, I'll tell you that, all right. Robo & Kala. 2-in-1 laptop, a revolutionary design with ultimate productivity. - [Matt] So, this was originally gonna be on \"This Is\"- - Okay. - [Matt] With Instagram made me buy it. - Instagram made you buy a laptop, okay? - [Matt] Well, it's, I mean, it's an Instagram laptop. - Oh God, it's gonna be really bad? I've never heard of Robo & Kala. We've got a screen protector for a tablet, which I guess is this. We've got the keyboard, so, yep. Revolutionary Surface style tablet. And we've also got a lightweight, shock absorption, portable water repellent computer bag. So, we've got ourselves the tablet, well, quite light. I will say it's actually surprisingly light. Wow! - [Matt] Like, it's gorgeous looking. - It is very thin. How is the kickstand? I mean, fine. A little, oh! (tablet rattling) That's maybe not a great sign. - [Ken] Sounds like my knees. - Okay, well that's maybe not super impressive. So, it does have a lot of antenna lines. I'm wondering, does this have 4G or 5G or something? 'Cause it looks like it's got a lot of antenna lines. - [Ken] I'll tell you that, just like first impression that bezel looks really thin. - It is quite a thin bezel. So, we've got ourselves USB-C, so it does have a smart connector on the bottom and then dual USB-Cs on the side. Any signs of, oh, it's firing up. All right, well that'll be the first step. So, it is definitely a color matched keyboard, decent sized track pad. I don't like the fact, and this is really minor nitpick, they didn't capitalize the L in lock. So, it's caps lock or caps lock! Look I'll admit, you put this all together, it looks nice, right? Like that looks like a Surface style tablet. Is it an OLED? - [Matt] It is. - [Ken] AMOLED. - [Matt] AMOLED. - Windows 11 pre-installed. I've got a pen, which actually does feel much more like a pencil because it's got like flat edges on each side, which I kinda like. - So, it's a Snapdragon 8CX Gen 3. - Oh, it's 8CX, oh, so the actual, the good one? - [Matt] Yeah. With 16 gigs of RAM, 512 NVMe, and the SSD is user upgradeable through a little hatch in the back. - Basically what we're working with here is a pretty powerful processor, but the downside is, is that most apps have to run through a compatibility layer, which sort of saps some of the performance, which then makes this pretty decent chip feel a little bit slow. So, if I wanna spec out a Surface Pro 9, which is quite similar to this in a lot of ways, we're talking about $2,179. That's a little bit of a tough pill to swallow. - [Matt] How much do you think I got this one for? - From a brand I've never heard of before, 1300 bucks. - [Matt] I've got the entire bundle for $850. - Wait, I've gone through this whole segment thing is a, like an overpriced piece of garbage, and it's actually like less than half the price of the Surface, wait, really? - [Matt] This is a lesson on not judging a book by its cover. - Do we actually find, is this actually good? - [Matt] What is this we? - Did Matt actually find something good? - You were ready to throw this in the trash as as a write off, as a piece of E-garbage. - Next up we've got a word from our sponsor, Whatnot. Whatnot is the newest way to get your hands on collectibles, electronics, and a whole lot more. Now for me, I know it's a huge thing in the collectible community especially when it comes to Pokemon, where I may or may not have partaken, but I'll be listing my own stream on Whatnot on September 21st at 3:00 PM Pacific. I'll have some other time zone conversions down here, but come hang out with me, I'll be selling a ton of stuff from previous videos including maybe some Roboraptor clones, some mystery boxes, as well as a couple of bigger ticket items including an Xbox Series S, Steam Deck, all kinds of really cool stuff. Listings with photos only tell part of the story. What's great about Whatnot is that you can interact live with the sellers, think about it like eBay meets Twitch. Joining is really simple. Check out the link of the description to get yourself $10 off your first purchase, create an account, download the app, and on September 21st I will see you over at Whatnot for all kinds of shenanigans, randomness, and importantly, some sweet deals. Thank you very much to Whatnot for sponsoring this episode of Mystery Tech. (upbeat music) - I do wanna tell a story for this. - Okay, go ahead, what's up? - I ordered this a while ago. - [Austin] Okay. - It showed up, it was in my hand. - [Austin] Yes. - I left it on Alex's desk. - Okay. - Somehow it disappeared from Alex's desk. - Okay. - And we never saw it again. - Okay. - Two months later. - [Austin] Yeah. - It arrived in the mail, again. - This sounds a little too spooky, Matt. I don't know what to say about it except that, oh, is this the chicken nuggie? This is the chicken nuggie controller? - [Matt] Yes. - All right. So, there was a limited time deal in McDonald's, I believe just only in China, where they sold you quite literally a chicken nuggie Tetris game. I saw this all over Twitter, and I was like, I want, oh, it's a boot, it's a boot. - [Matt] You know that the chicken nuggets have, have shapes, right? I just thought you were associating shapes. - It's a circle. All right, so we've also got a large number of little stickers. So, this was, if I am correct, was this given away in kids meals? Or as you could buy it with dollars? - [Matt] I wanna say it was like $4. - Oh, wow, okay, got it, I see. So wait, can you rotate the pieces here? - Look at his power stance. - [Austin] What's wrong with my power stance? - (laughs) Look, look, look. He's twerking, oh my... - I'm choking under the pressure. No! Get it over, get it over, get it over, no! No! No! No! No! What in the actual (indistinct) This is one gold ass PC. I know a little bit about this, but essentially, on Amazon there are hundreds of sellers who will try to sell you an old desktop from Dell or HP and they'll do whatever they can to get you to buy it because a lot of these things are essentially E-waste now, and instead of actually E-wasting them, what they'll do is they'll maybe swap out for like an SSD, maybe throw in a very low in graphics card. And in this case, fill it with gold grip tape and call it a day. Doio? Oh sorry, I had upside. - [Matt] Now, the gold is, before you open it- - [Austin] Doio! - [Matt] The gold is nice. - Yeah, it's nice. - [Matt] But you know, I, I think it's kind of boring to go with just one theme. - [Ken] I think it's time to switch it up. - Oh good Lord! What's? (mischievous laugh) Oh my goodness! What in the actual? Mhm, okay, all right. - [Ken] We switched it up. - It is an immensely heavy keyboard, can you hear this? (loud thump) Look it is heavy. It weighs about as much as the PC. So, we've got ourselves a couple of sticks. Oh, okay, immediate problem here, when you move this, I can literally put my finger inside and like pull it out, like- - [Matt] Okay, stop putting your finger in things. - [Austin] I will continue to do that. - It only comes with the board, so we provide- - We need to provide the switch. - Yeah. - Yeah. We need to provide the switches, we need to provide the key caps. - Wait, so who built it? - [Matt] Kinsey. - I will say... (clicking sound) Feels quite nice. - [Matt] The real star here is the Joy-Con. - [Ken] I think it's more just for the Nintendo fanatic. I would consider those more of an aesthetic choice. - I would agree with that. This would look great on your Nintendo themed desk, struggle a little bit with the practicality of this, but you know what? Who am I to question fun? - So, what are you missing? - [Austin] A mouse, a PlayStation themed mouse. - But what are you gonna be doing? Because your hands are gonna be full with that with those Joy-Cons. - I'm going to be looking for an explanation into this one. Glass hole, what? Oh, GlassOuse. - [Ken] Oh god. - [Matt] It is not Glass hole, it's Glassouse. - [Austin] Glassouse, I knew that. - [Ken] Glass hole is a different thing. - [Austin] Well, it used to be. And this, this is an assistive device. A Glassouse. What an eclectic mix of accessories and items for this segment. - [Matt] Okay, it's really boring to be on one theme all the time. - Great. That's why I switch it up all the time. We'll see the Glassouse, Glassouse. - [Ken] Threw a little bit of a German in there. - [Matt] Yeah. - [Ken] Like a little, little, little spice in there. (mumbling) - Threw some sauerkraut on that one, eh? - Let's take a look. Ooh, what? This is not what I thought it was going to be. - [Ken] Oh wow. - Aah. This is not the glouse that I was looking for. - There's plenty of receding forehead there too. - Okay, no. It's not receding? - We could've gotten you four more of these things. - [Ken] Your hairline is just like up retreating. - [Matt] I'm not so sure the mouse is gonna know where to go - [Ken] Yeah, I didn't know your hairline was French. (laughs) - Welcome my friends to our gaming future. So, we've got a lot of items to talk about. Let's do it one at a time. Starting out with my glouse. The way this works is that it is going to connect to your device via Bluetooth. Now it works on a wide variety of different devices including iOS and Android. I'm using it on Windows. And while I'm not entirely sure the mechanism of how it's tracking, it's actually fairly straightforward. So as you can see I am using my gaze to move the mouse cursor around. The downside to this device is that it is not actually really fully self-contained even though it does have a battery. You actually have a little 3.5 mil connector on one of the sides that's actually meant to be used with an additional accessory to be able to enable clicking. So as far as I can tell without an additional device, you actually can't click which is why I have the mouse here. But depending on how you want to use this if say it's easier for you to use some adaptive controller to use audio or to move your cheek or however you want to do it. You could theoretically plug that into here and that would pass the actual click through. - [Matt] So the glouse was $580 without the attachments. - Uhm, sorry, can we just pause for one second? This is $580. - [Ken] Yeah, we didn't spend our money. - [Matt] $580 and you can't click it. (laughs) - [Ken] You can't put a price on accessibility though. - You can. It's $580. I look, I'm gonna try to be reasonable here. If you need this, you need this. And if this is what allows me to use a computer, then great. $580 before any attachments feels borderline egregious. How about our Gold PC? Can you make me feel better? How much was our gold PC? 152 bucks. All right, let's settle down a little bit. Let's talk about our PC. So this is clearly just some Dell OptiPlex that someone has artfully redesigned. Now I'll say, this one's a little newer than I expected. So this is a Core i5-4570, which is Haswell which would be 2013. So still roughly a 10 year old system, maybe nine years old depending on when it came out. But I will say a fairly competent system at that. And on top of that, we've got ourselves 16 gigs of RAM and a 500 gig KingFast SSD. The downside though is that it is using integrated graphics which means that while this might look neat it is going to be very limited, like it is a office PC. And the also, the problem is, is that because it is such a small form factor, you're actually kind of limited in that you only can put in a half height graphics card that certainly would need to be able to pull just PCI power. So you're buying this for the aesthetic, you're not really buying it for the performance. Keyboard, I'm a little bit more positive on. Now, it's a little hard to justify this keyboard just because it does come in a bare bones kind of state. - [Matt] So, this was $250. - Yeah. - Bare bones. - And then probably another a hundred bucks in switches and key caps. - Yeah. - Let's see how I can type on this keyboard. (clicking sound) Woo! 94 words per minute. Dude, this keyboard, or at least the switches that have been chosen here are actually really quite nice. Dries depo-orter. What is Dries depoorter? Or is that just, okay. Short life. Name, Austin Evans. So the fact that the product name is short life doesn't make me feel great. I'll admit. So basically you went to this short life company. You gave them all my info and said, \"Hey\"- - [Matt] I gave them a shocking amount of information on you. - Really? - Yeah. - Okay. This is morbid and slightly spooky town for this episode of Mystery Tech, but sure, why not? A clock to remind you the life is short. So we've got a micro USB- Oh my God, micro USB kill me now. - [Ken] Life, (laughs) okay, life is short. - So right now, as we recording this video, I am 30 years old. How long do you think it's gonna give me? - 80. - I didn't say early 80. - I'll say 87. - 87, I ain't no, no. - We're morbidly obese, how are we- - I am, you guys aren't like we have erectile. - What? - What? - That you keep people erect- - That's, that's, that's a different problem. - Why do you think we have the pillows guys? (laughs) - From Pat. I like how the guys always sit on the chairs with pillows on their laps, kindly blocking their tech boners As they watch Austin open boxes of amazing technological advancements. There's a lot of pillow talk over here. Ooh. - Oh my God, USB-C. - Oh my God, yeah. - VGA. - VGA? - It's got wireless charging. - [Ken] Ah, Windows XP. (laughs) - [Joanna] Can I go home? (beep sound) - Oh my God. I'm 40.3% done with my life. This can also help. - With the, oh, this is the device. Wait. Wait, you guys know about my device. - [Matt] We got you the clock. We also got you the Glock. (clapping) - Have you ever wanted to really get into a FPS. A first person... - Deviser. - Deviser? Yeah. When you're divising people - That's a, that's a different, that's a- - That's a different website my friends. (laughs) Oh no. (laughs) All right, see... Ragnok. Born for FPS. Look at this. It's a handle for your device. So Ragnok have created... (laughs) A, it's a handle, right? So, if you're playing a game and you want the real experience, you can go... (clicking) Which I'm, YouTube for the record this is a self-contained plastic game controller which has got a little, got a wheel and it's got a... (clicking sound) - You can say mouse. - I can use this like a regular vertical mouse which I'm not personally a huge fan of normally but I know a lot of people do like using them. So we have a couple of switches on the bottom. Power On/Power Off and vibrator. - What? - What? Every time you pull the trigger of your device it vibrates in your hand. Can you hear this? (buzzing sound) This is an interesting device. So how much is the Ragnok device? - [Matt] $69. - (laughs) Nice. How much is the, Austin Evans has a short life clock? - [Alex] 165 euros, which is roughly $180. - The Ragnok, I kind of get it's not great, but it's, it's decent. It's, it's all right. I, I, I, I can kind of get behind it. I wish it's a little bit better. This feels like a novelty that I could almost get behind but I can't. The fact that there's no battery is really, really annoying. I wanna set this thing on a shelf and watch it and go, \"Ha-ha\", every once in a while. The thing is this aesthetically looks nice until you realize that this cable's always plugged into the side of it. Like, look, look. That's like the best I could do. I'm gonna use my Ragnok on it. Oh good lord. What? It's been a while since an item hit the desk that was quite this big. This is a 44 pound SmartDrop secure delivery box. I'm not gonna lie. My first thought with this is if someone cares about their packages so much that they've got a giant safe on their front door, I would just want the safe. Not that I would be a filthy porch pirate plundering people's personal packages. Oh no. This is my assembly guide. I regret my decision. - Oh, it doesn't come assembled? - No. You have to build the box. - Oh. - It is... A... 11 step process to build your box. Wait, how much is this stupid thing? - [Matt] It normally is $400. Which I'm assuming is what we paid for it. - Uh-huh. - [Matt] But it's on Amazon now for $200. - People could steal like five or six of my packages and I would still be net negative compared to this package. Look at it. Look at it. Also, the pin is 1, 2, 3, 4, that there's only four numbers. So you could probably just sit there and go 1, 2, 3, 4, 2, 1. - [Ken] Well, you'd be on someone's porch for a long time though. - [Matt] It's roughly 64 combinations. - Who wants to help me build this thing? - Oh, we're actually. - Oh, well we have a thing. - Yeah, I have to. - We're- - Meet. - We're gonna go see the Jonas Brothers. - Oh wow. So much fun. - Got any packages? So I will say, even though it's annoying that you have to build this, it actually wasn't too bad. It took two of us, what? 15 minutes to build it. It's very straightforward. I have now gone through the process of pairing it with the app. You do need to pair it with the Eufy app. It currently is connecting. And theoretically what this will do is allow me to remotely control it, set the password, all that kinda stuff. But also it does have a camera, so it will kind of double as like a doorbell camera. I find it to be a little bit cumbersome just because look at how big this thing is. Like imagine putting that on your porch like that's gonna take up the whole thing. - But it advertises that it can fit 99% of packages. - But you know what it won't fit? Your, the HOA's tolerance for it being on your porch. Okay. Huh? Oh, this looks surprisingly easy actually. Mm. I No. Oh. Oh, we did it boys. Okay - I see. - We can go home. - I see some like blinking light in here, that's not good. - Wait, is there really a light in there? - Yeah, there's a blinking blue light because it's trying to sync right now. - Oh, that's funny. - It's very dark. - I gotcha, hold on. There you go. Surprise! - It's me! Your Amazon delivery driver! Forgot me! I don't think this is it. (alarming sound) Apparently has an alarm. - So do you wanna change your tone a little bit? Who's stealing a thing now? - Let's just steal the box. Let's steal the box, let's steal, let's go, let's go. They'll never see us coming. Alright, we're gonna steal the box. - Now, we stealing packages. - Oh, no. - Go, go, go, go, go, go, go. - Go, go, go, go, go, go, go. (upbeat music) - And don't forget that I'll be going live on Whatnot on September 21st at 3:00 PM Pacific Time. See you there, my friends.",
    "transcript_keywords": [
        "Yeah",
        "thing",
        "bit",
        "Whatnot",
        "box",
        "device",
        "kind",
        "lot",
        "time",
        "God",
        "Wait",
        "life",
        "nice",
        "mouse",
        "keyboard",
        "Mystery Tech",
        "Short life",
        "gold",
        "Ragnok",
        "GlassOuse"
    ],
    "transcript_entity_values": [
        "Ken] Ah",
        "Joy-Cons",
        "5",
        "half",
        "the Joy-Con",
        "Ken] AMOLED",
        "10 year old",
        "first",
        "China",
        "Twitter",
        "one second",
        "1",
        "two",
        "Matt",
        "four",
        "Surface",
        "94",
        "one",
        "1300 bucks",
        "a ton",
        "Dell",
        "Two months later",
        "30 years old",
        "69",
        "3",
        "87",
        "hundreds",
        "40.3%",
        "Tetris",
        "six",
        "3:00 PM Pacific",
        "2",
        "152 bucks",
        "Ragnok",
        "September 21st",
        "German",
        "Austin Evans",
        "250",
        "Robo & Kala",
        "PlayStation",
        "Ken",
        "OptiPlex",
        "USB",
        "Austin",
        "Pat",
        "Instagram",
        "99%",
        "SmartDrop",
        "McDonald's",
        "roughly 64",
        "Joanna",
        "16",
        "500",
        "HOA",
        "SSD",
        "PCI",
        "Twitch",
        "about $2,179",
        "Glassouse",
        "2",
        "Android",
        "15 minutes",
        "roughly $180",
        "nine years old",
        "10",
        "850",
        "Amazon",
        "400",
        "4",
        "Glass",
        "Glock",
        "Mm",
        "French",
        "YouTube",
        "580",
        "Haswell",
        "the Jonas Brothers",
        "HP",
        "Revolutionary Surface",
        "11",
        "44 pound",
        "200",
        "Ken] Glass",
        "eBay",
        "GlassOuse",
        "Mystery Tech",
        "Alex",
        "Xbox Series S",
        "only four",
        "Matt] Kinsey",
        "Austin] Glassouse",
        "USB-C",
        "USB-C. - Oh",
        "Roboraptor",
        "RAM",
        "4",
        "Ragnok",
        "Eufy",
        "Nintendo",
        "Windows",
        "Doio",
        "USB-Cs",
        "512",
        "4",
        "Pokemon",
        "Power On/Power Off",
        "five",
        "VGA",
        "2013",
        "less than half",
        "3:00 PM Pacific Time",
        "early 80"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "ORDINAL",
        "GPE",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "NORP",
        "PERSON",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "MONEY",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "FAC",
        "PERSON",
        "LANGUAGE",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "DATE"
    ],
    "vector": [
        -0.1251491755247116,
        0.007425383664667606,
        0.019619224593043327,
        -0.09218905866146088,
        0.11525110900402069,
        -0.004956131801009178,
        0.169572114944458,
        0.013539987616240978,
        0.08436936885118484,
        0.015113827772438526,
        0.07466744631528854,
        0.02726942114531994,
        0.016894971951842308,
        -0.01315625011920929,
        -0.0072573027573525906,
        -0.017281996086239815,
        0.009688698686659336,
        -0.07962118834257126,
        -0.0463288389146328,
        -0.023557409644126892,
        0.07174336165189743,
        -0.05073901265859604,
        -0.01028179470449686,
        0.039204973727464676,
        -0.08397756516933441,
        0.039321038872003555,
        -0.004129662178456783,
        -0.009025468491017818,
        -0.07291754335165024,
        -0.06017608568072319,
        -0.03149193525314331,
        0.08332520723342896,
        0.007486959919333458,
        -0.0071892524138092995,
        -0.05057775229215622,
        -0.08585859090089798,
        0.004804981406778097,
        0.0028837674763053656,
        -0.010889598168432713,
        -0.07780825346708298,
        0.006037220824509859,
        -0.04675346612930298,
        0.035461489111185074,
        0.06040215492248535,
        -0.057534780353307724,
        -0.01920175924897194,
        -0.02081955224275589,
        -0.006618485786020756,
        0.022370945662260056,
        0.010331820696592331,
        -0.011762717738747597,
        0.05071176216006279,
        0.00315107312053442,
        -0.0013891746057197452,
        -0.009580021724104881,
        -0.009702158160507679,
        0.04575324058532715,
        0.012972350232303143,
        0.11104146391153336,
        -0.022640487179160118,
        0.06429287791252136,
        -0.07012484967708588,
        -0.024296600371599197,
        0.030329331755638123,
        -0.018773816525936127,
        -0.021811772137880325,
        0.004888501018285751,
        0.07326128333806992,
        -0.01554345153272152,
        -0.0359356515109539,
        0.05178479850292206,
        -0.006323185749351978,
        -0.019348811358213425,
        0.08235285431146622,
        0.08134450018405914,
        0.002399517223238945,
        0.023722779005765915,
        -0.01917944848537445,
        -0.035257063806056976,
        0.014093010686337948,
        -0.052406929433345795,
        -0.05585658550262451,
        0.020920701324939728,
        0.057307567447423935,
        0.010643845424056053,
        0.042896077036857605,
        0.02454414963722229,
        -0.05531429126858711,
        -0.05844031646847725,
        -0.07119273394346237,
        -0.007675438653677702,
        0.016772394999861717,
        -0.03246058151125908,
        -0.007192780263721943,
        -0.012701635248959064,
        -0.08537023514509201,
        0.0007883993675932288,
        -0.0435979999601841,
        -0.048115283250808716,
        0.06342928111553192,
        0.07236390560865402,
        -0.01982213743031025,
        0.06478647142648697,
        -0.06384006142616272,
        0.01580236107110977,
        -0.1173509806394577,
        -0.04640624299645424,
        0.014528846368193626,
        0.08858444541692734,
        0.011311312206089497,
        -0.05230436101555824,
        -0.024816017597913742,
        -0.04598264768719673,
        -0.034664638340473175,
        -0.028576694428920746,
        0.032774750143289566,
        -0.09961966425180435,
        0.06384412944316864,
        0.039256032556295395,
        0.009815841913223267,
        0.06472717970609665,
        0.06421378999948502,
        -0.09486611187458038,
        -0.05485115200281143,
        0.046396784484386444,
        0.0027228204999119043,
        0.033425189554691315,
        1.0367190877156576e-32,
        0.01200922578573227,
        0.03190375491976738,
        -0.0818263441324234,
        -0.08169994503259659,
        0.05139574781060219,
        -0.02486313320696354,
        -0.028631703928112984,
        0.03232606127858162,
        -0.005908762104809284,
        0.06355785578489304,
        -0.03377662971615791,
        -0.036049455404281616,
        -0.06372382491827011,
        0.06714317202568054,
        0.03265867382287979,
        -0.031475361436605453,
        0.01052344124764204,
        -0.03919374942779541,
        -0.04247945919632912,
        -0.018658893182873726,
        0.005865908693522215,
        0.021283671259880066,
        0.048903197050094604,
        -0.061082690954208374,
        0.015352149493992329,
        0.056700948625802994,
        -0.06898607313632965,
        0.02174554206430912,
        0.11508675664663315,
        0.07968925684690475,
        -0.08085787296295166,
        0.04067855700850487,
        0.0306867603212595,
        -0.050668928772211075,
        -0.03070153295993805,
        -0.011531583033502102,
        -0.03873506933450699,
        -0.19132421910762787,
        0.03097361885011196,
        -0.044317591935396194,
        0.0248264130204916,
        -0.04660983011126518,
        -0.08365163952112198,
        -0.034639615565538406,
        -0.019136328250169754,
        0.012489843182265759,
        0.033145129680633545,
        0.00509594427421689,
        -0.017240889370441437,
        0.08467070013284683,
        -0.00871517788618803,
        -0.0039482698775827885,
        0.04467514902353287,
        -0.07569645345211029,
        -0.019728558138012886,
        -0.03176315873861313,
        0.009573317132890224,
        -0.05309378728270531,
        0.09777798503637314,
        0.02576819434762001,
        0.034829672425985336,
        0.012929514050483704,
        0.06304680556058884,
        0.027551906183362007,
        -0.04792288318276405,
        0.036247748881578445,
        0.11530081182718277,
        0.06074608862400055,
        0.006672366987913847,
        0.026536576449871063,
        -0.03755183517932892,
        0.007340149488300085,
        0.029415268450975418,
        -0.04942269250750542,
        -0.040429290384054184,
        0.03232744708657265,
        -0.08273176848888397,
        -0.0468464121222496,
        0.05202152207493782,
        0.007582532241940498,
        -0.03815104067325592,
        -0.0006364388391375542,
        0.051908038556575775,
        -0.0346248634159565,
        -0.02065187878906727,
        -0.004154524300247431,
        0.004269195254892111,
        -0.06950657069683075,
        -0.008652244694530964,
        0.009092343039810658,
        0.020720886066555977,
        -0.024625208228826523,
        -0.04360324144363403,
        0.0035818035248667,
        -0.027602067217230797,
        -1.0868703052307428e-32,
        -0.053776439279317856,
        -0.025604326277971268,
        -0.022273002192378044,
        -0.00031661754474043846,
        -0.005913515109568834,
        -0.004489887971431017,
        0.024486569687724113,
        0.010937548242509365,
        0.028754284605383873,
        0.029658058658242226,
        -0.00689780805259943,
        0.022476255893707275,
        -0.11535376310348511,
        -0.049816928803920746,
        0.05961097404360771,
        0.008009863086044788,
        0.045513302087783813,
        0.0569496788084507,
        0.03741156682372093,
        -0.029294686391949654,
        0.029890967532992363,
        -0.04605142027139664,
        -0.07989750802516937,
        0.006937594618648291,
        -0.006781565956771374,
        0.019556734710931778,
        0.04333200305700302,
        0.01303658913820982,
        0.05795393884181976,
        0.05115743726491928,
        0.050137367099523544,
        0.007886500097811222,
        -0.03928014636039734,
        0.028042884543538094,
        0.0244634710252285,
        -0.019617974758148193,
        0.08177479356527328,
        0.05296270176768303,
        -0.00022131323930807412,
        -0.10473759472370148,
        0.029559273272752762,
        0.007143298164010048,
        0.022770140320062637,
        0.002950635738670826,
        -0.047164879739284515,
        -0.056007105857133865,
        -0.030007781460881233,
        0.04709826409816742,
        -0.046345531940460205,
        0.038243263959884644,
        0.026021046563982964,
        0.0025165388360619545,
        0.06966103613376617,
        -0.023161906749010086,
        -0.12171153724193573,
        0.015051196329295635,
        -0.06827693432569504,
        0.05640562251210213,
        0.09703279286623001,
        0.0020481236279010773,
        0.03766506910324097,
        0.004303578287363052,
        -0.0733373612165451,
        -0.02320387028157711,
        0.02680521458387375,
        0.056551460176706314,
        0.08383005857467651,
        0.04286679998040199,
        -0.039779338985681534,
        -0.03828450292348862,
        0.03608730435371399,
        -0.0007711212383583188,
        -0.014419269748032093,
        -0.1125423014163971,
        -0.016107145696878433,
        0.03709305822849274,
        -0.04780605807900429,
        -0.0788935199379921,
        -0.09063272178173065,
        -0.04692661762237549,
        0.012732255272567272,
        -0.043158914893865585,
        0.060777485370635986,
        0.03761526569724083,
        -0.0035646979231387377,
        -0.007380003109574318,
        -0.01314094103872776,
        0.06118461489677429,
        -0.04667774215340614,
        0.002273711608722806,
        0.012545277364552021,
        -0.014958512037992477,
        -0.08450596779584885,
        0.15125524997711182,
        0.016815103590488434,
        -7.284533154461315e-08,
        -0.0007942056399770081,
        0.0189716424793005,
        -0.014182886108756065,
        -0.056739311665296555,
        0.06748365610837936,
        -0.020475341007113457,
        0.01675914227962494,
        0.05392727255821228,
        0.05203083157539368,
        -0.043026357889175415,
        0.04104049876332283,
        -0.08126717060804367,
        -0.09586253017187119,
        -0.009073120541870594,
        0.07758868485689163,
        0.05189577862620354,
        -0.0838271975517273,
        -0.02130221202969551,
        -0.05121297761797905,
        -0.04055532440543175,
        0.03644052520394325,
        -0.023801317438483238,
        0.08763936907052994,
        -0.09748006612062454,
        -0.07024773955345154,
        0.03145435452461243,
        -0.01945626363158226,
        0.1412104070186615,
        0.07140140235424042,
        -0.010004348121583462,
        -0.010034357197582722,
        -0.048345159739255905,
        -0.022796904668211937,
        0.023512456566095352,
        0.011036240495741367,
        -0.05941694974899292,
        -0.04328533262014389,
        -0.0031630350276827812,
        0.09391448646783829,
        0.014698419719934464,
        -0.01525172870606184,
        -0.1568072885274887,
        -0.04200996831059456,
        0.04311852529644966,
        -0.034745100885629654,
        -0.029828879982233047,
        -0.06889398396015167,
        -0.0570201575756073,
        -0.02316460944712162,
        0.03419017046689987,
        -0.043598733842372894,
        -0.04186054319143295,
        0.047680772840976715,
        0.07736383378505707,
        0.07311095297336578,
        -0.025414682924747467,
        0.09082330763339996,
        -0.016443835571408272,
        -0.0013706038007512689,
        0.048301469534635544,
        0.030952192842960358,
        -0.04865597188472748,
        0.02989824488759041,
        0.054375309497117996
    ]
}