{
    "id": "Sa1faKn7yUY",
    "title": "The 6.5 inch iPhone X Plus?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-12-02T18:12:00Z",
    "video_url": "https://www.youtube.com/watch?v=Sa1faKn7yUY",
    "category": "Science & Technology",
    "tags": [
        "iPhone X",
        "iPhone X plus",
        "iPhone X 2018",
        "iPhone XI",
        "iPhone Ten",
        "iPhone Eleven",
        "iphone 10",
        "iphone x review",
        "iphone x unboxing",
        "apple",
        "apple iphone x",
        "iphone notch",
        "notch",
        "iphone x hands on",
        "iphone",
        "face id",
        "review",
        "iphone x camera",
        "unboxing",
        "iphone 10 review",
        "ios 11",
        "tech",
        "apple iphone",
        "gadgets",
        "apple iphone x review"
    ],
    "views": 515013,
    "likes": 13913,
    "comments_count": 904,
    "description": "Demonetized Shirt!  Is the 5.8 inch iPhone X enough or do we need a 6.5 iPhone X Plus?  Heres what I use for my hair -    Whats in my Tech Bag! What's in my Tech Bag! v5.0  Sigma 18-35 Lens!   Acer Aspire 5 Laptop:  Dave2D!   Austin Evans -   Background music via Epidemic Sound:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "http://teespring.com/demonetized-shirt",
        "http://amzn.to/2kfaD5L",
        "https://youtu.be/MLVDWiVDF7Y",
        "http://amzn.to/2jGiKV9",
        "http://amzn.to/2kh2PAK",
        "http://bit.ly/2h6598R",
        "https://www.youtube.com/austinevans",
        "https://goo.gl/rMbhQL",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- So, guys, Jonathan here, back with a Q and A. This time, we're doing a mix up of Snapchat and Twitter, so if you're not following me there, definitely make sure you do so so you have a chance to be featured in the next video. Also, huge shout out in the theme of demonetization. Got a limited run of this shirt available now. It's up for a couple days. If you wanna scoop it up, I will drop a link down below. Let's go. \"How many phones have you broken?\" Honestly, the answer is way too many. A couple recent ones that stand out is one while filming my iPhone X review, I was getting slow motion footage, balanced the phone on a tripod without any kind of mount and of course, it fell and cracked. Probably the craziest one, though, was going all the way back to I think the iPhone 4 or 4S, because I remember that glass back. I was at Sea World on a roller coaster, remember it going (exclaims) right by my head. I remember getting off the ride, having that panicked feeling of holy crap, where is my phone in my pocket? Of course it was gone, but somehow, someway someone found it on the floor, returned it, and it was hilarious, because I remember the lady up front was trying to ask me to log in or kinda get into it to verify it was my phone, but there was no freaking way that was happening, because the phone was completely obliterated. \"What would be the ideal screen size for a 2018 plus sized iPhone XL?\" Oh, if we could edit tweets by now (laughs). I am sorry, Marques. I've seen rumors that we're gonna see three iPhones next year, a 6.5 inch model, the 5.8, which is the same as we see with the iPhone X, and a 6.1, which would be an LCD screen. That really doesn't make sense for me. I think 5.8 is solid with the iPhone X, but there still is room for a bigger screen. Potentially, we've seen 6.3 inches on the Galaxy Note 8, that feels really good, so somewhere in that ball park of 6.3 to 6.5 inches would be amazing for the iPhone X Plus or whatever the hell they're gonna call it. \"How skinny are those skinny jeans?\" Come on, man, they are not that skinny. I think what's happening here is I've always had a problem finding jeans that fit because I kinda share the same problem with Rich, we got them thick legs. - Are you gonna buy the Tesla Roadster? - Tesla Roadster looks amazing. Honestly, I think it's a little too sporty for me. I'm not sure what it was, I'm kinda missing that Tim the Tool Man Taylor gene in my body where I just get crazy over cars. I like them, I can appreciate the tech, but for me, I would probably still stick with something like a Model S. Austin Evans, I just found a famous YouTuber, Austin Evans. Got an important question for you. \"If Spongebob had a phone, what would it be?\" - [Girl] Sponge phone. - There's your answer. - Is this a documentary? - Yeah. - A YouTube channel? - About Austin Evans. Go harass him, go harass him. Just go yell and scream, scream, scream, scream. - [Guy] Is that Austin Evans? - It was Austin Evans. \"Hey Jon, Yeezy's or Ultraboosts?\" Rich, what's your thought? - [Rich] Yeezy's all day. - Yeezy's all day? I mean, I feel like Yeezy's are something that you don't wear all the time. If you were gonna pick like, an everyday shoe, I would go with Ultraboosts. They're comfortable as hell, they look good, and they're not as flashy as Yeezy's. Yeezy's have their place and their time, unless you're rich. \"What is your favorite position... To hold your phone, perv.\" Well played, sir, well played. \"Favorite show on Netflix?\" I think most people are probably gonna say Stranger Things, but I'm gonna go with Team Master of None. I freaking love Aziz Ansari and if you have not watched it yet, not only the story line, but the cinematography is incredible. Honestly, yeah, if I would recommend any show out there right now, it's gotta be that. Go watch it now. - Hey Jon, so what are your favorite kicks right now? - As far as this year, I gotta say the new Pharrel NMD's, definitely the Oreo out of that bunch. In terms of my favorite shoe that I've picked up this year, also a Pharrel release, the blue Original Human Race, which to me, is probably my favorite shoe that I own period. \"Should I get an XBOX OneS now or what for the X to get cheap?\" Honestly, with the X just being released and the holidays here, I think it's gonna be awhile before we see that drop in price, so it's probably the best time to buy an XBOX OneS. I've seen it drop as low as like 189 recently. They're doing bundles, tons of deals, so I'll make sure to drop the best possible price down below. - I need a new gadget bag for Christmas, any recommendations? - So, as far as a gadget bag, if you haven't done so, make sure you check out my latest what's in my tech bag video. I featured the Hershel Apex Lawson, which to me, is my favorite bag of 2017. It's unique, it's different, it's got what they're calling Apex knit, which is very similar to a prime knit or a fly knit, so if you like that material, it is amazing. You got room for a laptop, all sorts of gadgets, and I believe it's still on sale right now, so I'll drop a link down below. \"What's your favorite animoji?\" I'm gonna say the dog, because dogs are awesome. - Hey Jonathan, do you think they'll ever get rid of the notch on the iPhone X or the upcoming rumored X Plus? - As far as the notch goes, I think it is here to stay. So, we gots to embrace it or look elsewhere, especially down the road with something like the iPhone X Plus, that is definitely gonna have the notch. Maybe like way, way in the future, they'll come up with an alternative, but for now, that notch ain't going nowhere. \"What kind of hair product do you use?\" I believe the last time I answered this question, it was Suavacito, that is still correct, but I've converted over to the matte version. It's not sponsored, but it's what I use all the time. It smells amazing, works amazing, and yeah, I'd go get some. \"According to you, what's the future of wireless charging?\" Honestly, I still think it's gonna be where it's that like, wireless charging vicinity where you can just set your phone or watch or headphones down like in this five, 10 foot radius and not worry about placing it on a mat or some sort. That, to me, would be amazing. - Hey Jonathan, what is your favorite camera lens? - So, I assume you're referring to something like a DSLR or how you can capture photos or video, and honestly, even though I've had a chance to mess with some higher end lenses, the ZEISS Otus is some great and amazing stuff. I still find myself reaching for the classic Sigma 1835, it's what you're watching this video being recorded with right now. If you're looking for an upgrade, that is the way to go. \"What are some of your favorite non-tech related YouTube channels?\" Hands down, H3H3, Philly D, Pewdiepie, it's gonna sound weird, I'm not the biggest fan of his gaming videos, not because I don't like them, I'm just not a huge gamer myself, Boogie. As far as the fitness world, definitely gots to be the Hodge Twins and I do watch a lot of Christian Guzman. I'm sure most of you have heard of all those guys. If you haven't, I will definitely link them all below. - Hey Jonathan, I was just wondering what your best budget Windows 10 laptops would be, like under 500 dollars and tell Rich, keep it uncensored. - [Dave] What's up? - Hey, this is random, I'm doing a Q and A, I got a question, someone was asking for the best budget Windows laptop under 500 bucks, off the head, go. - Uh, Acer Aspire Five. - There you have it. - It's 500 bucks on the nose, I think. - 500 bucks on the nose. Anything like, slightly cheaper maybe, or is that like, the way to go? - That's the way to go, man. - Alright. - That stands out. That's the one plus five of the laptop world. - Acer Aspire Five, straight from the man, Dave 2D himself. Taking the time, he's probably with his family right now. Check him out, huge shout out, links below. I love you, Dave. - Hey, I really like cookies, what kind of cookie technology do you think's gonna be developed soon?",
    "transcript_keywords": [
        "Austin Evans",
        "favorite",
        "iPhone",
        "Snapchat and Twitter",
        "phone",
        "Hey Jonathan",
        "Hey",
        "Evans",
        "Austin",
        "Yeezy",
        "time",
        "amazing",
        "kind",
        "Honestly",
        "Jonathan",
        "Hey Jon",
        "Rich",
        "drop",
        "remember",
        "man"
    ],
    "transcript_entity_values": [
        "6.3 inches",
        "2017",
        "this five",
        "all day",
        "DSLR",
        "iPhone",
        "Yeezy",
        "a couple days",
        "Team Master of None",
        "Windows 10",
        "XL",
        "Marques",
        "five",
        "Twitter",
        "Acer Aspire",
        "189",
        "2018",
        "Philly",
        "Taylor",
        "Five",
        "Acer",
        "Ultraboosts",
        "iPhones",
        "Windows",
        "6.3",
        "YouTube",
        "Jon",
        "500 dollars",
        "Netflix",
        "Tim",
        "Yeezy's",
        "Aziz Ansari",
        "Pewdiepie",
        "the Galaxy Note 8",
        "Oreo",
        "Rich",
        "Hershel Apex Lawson",
        "Snapchat",
        "6.5 inch",
        "three",
        "next year",
        "Aspire Five",
        "6.1",
        "one plus",
        "XBOX",
        "X Plus",
        "iPhone X",
        "Austin Evans",
        "Boogie",
        "500 bucks",
        "Spongebob",
        "Pharrel NMD's",
        "Apex",
        "6.5 inches",
        "the ZEISS Otus",
        "Christmas",
        "LCD",
        "the Hodge Twins",
        "Dave",
        "Suavacito",
        "this year",
        "5.8",
        "Pharrel",
        "Jonathan",
        "YouTuber",
        "10 foot",
        "the iPhone X Plus",
        "4S",
        "Christian"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "NORP"
    ],
    "vector": [
        -0.09849059581756592,
        -0.018195047974586487,
        0.14579865336418152,
        -0.05781698226928711,
        0.07488138973712921,
        -0.009816047735512257,
        0.06832636147737503,
        0.055509235709905624,
        -0.010536747984588146,
        0.013228785246610641,
        0.06364819407463074,
        0.002765218261629343,
        -0.008922850713133812,
        -0.031191028654575348,
        0.011243411339819431,
        0.04396901652216911,
        0.01105993427336216,
        -0.06223081424832344,
        -0.1283031851053238,
        0.04626190662384033,
        -0.0008984000887721777,
        -0.019303472712635994,
        0.060977235436439514,
        0.0568867027759552,
        0.048589278012514114,
        -0.02498771622776985,
        -0.04128418490290642,
        -0.0498446449637413,
        -0.08026629686355591,
        -0.017009271308779716,
        0.013002225197851658,
        0.112532839179039,
        0.000653028953820467,
        0.036881864070892334,
        -0.027926044538617134,
        -0.09366658329963684,
        0.05614042282104492,
        0.018645400181412697,
        0.03293601796030998,
        -0.011054346337914467,
        -0.02490386925637722,
        -0.09004586935043335,
        0.018440933898091316,
        0.026088198646903038,
        -0.02172166481614113,
        -0.033475931733846664,
        0.012098441831767559,
        0.03520524501800537,
        -0.00452406145632267,
        -0.010553058236837387,
        -0.002738199196755886,
        -0.00955507718026638,
        -0.010348592884838581,
        0.06681469082832336,
        -0.05771947652101517,
        0.005894607398658991,
        -0.0104035260155797,
        0.02218506671488285,
        0.09951449185609818,
        0.020193781703710556,
        0.05316136032342911,
        0.011523084715008736,
        0.014206119813024998,
        0.07586798071861267,
        0.05140175670385361,
        -0.0416073352098465,
        -0.06437364965677261,
        -0.006261380389332771,
        -0.036213696002960205,
        0.10396208614110947,
        -0.050642047077417374,
        0.014142405241727829,
        0.012055538594722748,
        0.09509780257940292,
        -0.003294037887826562,
        -0.005702016409486532,
        0.046575162559747696,
        -0.11651003360748291,
        -0.04716532304883003,
        0.04833881929516792,
        0.011576189659535885,
        -0.004922295920550823,
        0.03256814926862717,
        -0.03743338584899902,
        0.012047131545841694,
        -0.010999025776982307,
        -0.00606159633025527,
        0.03245886042714119,
        -0.08256106078624725,
        -0.06844047456979752,
        -0.07473620027303696,
        0.09940516948699951,
        0.02278578281402588,
        -0.024423090741038322,
        0.02524838224053383,
        0.00472874054685235,
        -0.11850619316101074,
        -0.06760279089212418,
        -0.09177906811237335,
        0.04867198318243027,
        0.022156231105327606,
        -0.01910734549164772,
        0.05429976433515549,
        -0.0015235347673296928,
        0.04421372711658478,
        -0.10248556733131409,
        -0.08438903838396072,
        0.02064375765621662,
        0.0258781798183918,
        0.04258325323462486,
        -0.0012853906955569983,
        -0.00923184584826231,
        -0.08559586107730865,
        -0.038614001125097275,
        0.07122772932052612,
        0.006597077939659357,
        0.03890985995531082,
        0.09724722057580948,
        0.0850004032254219,
        -0.039286624640226364,
        0.007860216312110424,
        0.04213739186525345,
        -0.06823230534791946,
        -0.026813238859176636,
        -0.02431207336485386,
        0.028393518179655075,
        -0.03323456645011902,
        4.316885821301753e-33,
        0.008036060258746147,
        0.13268673419952393,
        0.014410028234124184,
        0.0655566081404686,
        0.0433078296482563,
        -0.017216132953763008,
        -0.0008690817630849779,
        0.0012482950696721673,
        -0.034997113049030304,
        0.07038167864084244,
        -0.043470803648233414,
        0.031414423137903214,
        -0.00899471715092659,
        0.0374876968562603,
        0.08039417862892151,
        -0.006061807740479708,
        -0.01687503419816494,
        -0.047770947217941284,
        -0.020421352237462997,
        -0.01679200865328312,
        0.012181396596133709,
        -0.09654294699430466,
        -0.03349916264414787,
        0.020867567509412766,
        0.023309050127863884,
        0.007179144769906998,
        0.08264600485563278,
        -0.02742360159754753,
        0.024728447198867798,
        -0.01750509813427925,
        -0.13635015487670898,
        0.038335539400577545,
        0.047158706933259964,
        -0.053429000079631805,
        0.0131071787327528,
        -0.023925360292196274,
        -0.024312743917107582,
        -0.03821650147438049,
        0.01633063331246376,
        -0.021187882870435715,
        -0.03282613679766655,
        0.07725677639245987,
        -0.0728527307510376,
        -0.025007810443639755,
        -0.008535483852028847,
        0.054671984165906906,
        0.007285203319042921,
        -0.041698865592479706,
        0.009933392517268658,
        -0.0021185935474932194,
        0.002378997625783086,
        -0.04677025228738785,
        0.010212250053882599,
        -0.01379812229424715,
        -0.060781046748161316,
        -0.0500638410449028,
        -0.007756886538118124,
        -0.022623112425208092,
        0.08600245416164398,
        0.008853056468069553,
        0.03245009109377861,
        -0.03926233574748039,
        0.034012723714113235,
        -0.0033315459731966257,
        -0.013310118578374386,
        0.019269932061433792,
        0.0079044783487916,
        -0.002959471894428134,
        -0.0015616887249052525,
        0.07124915719032288,
        -0.06476939469575882,
        -0.0027684562373906374,
        0.0007361694588325918,
        -0.0136653371155262,
        0.05338822305202484,
        -0.0003019117866642773,
        -0.044066403061151505,
        -0.02624713070690632,
        -0.036923762410879135,
        0.028758257627487183,
        0.0419725738465786,
        -0.03433896601200104,
        0.055690519511699677,
        0.01709221489727497,
        0.02882959321141243,
        -0.002398349577561021,
        -0.01994764432311058,
        -0.08426924049854279,
        0.024590464308857918,
        0.085877925157547,
        -0.07088034600019455,
        -0.031169168651103973,
        -0.03280328959226608,
        0.02351093478500843,
        -0.052193332463502884,
        -5.0315551625330104e-33,
        0.029276950284838676,
        -0.005939363036304712,
        0.017109718173742294,
        -0.0042818165384233,
        0.0826636403799057,
        0.001457027974538505,
        0.0662393867969513,
        0.08124859631061554,
        -0.031589072197675705,
        -0.0660649836063385,
        0.009621085599064827,
        0.030745841562747955,
        -0.05987872555851936,
        0.015326363034546375,
        -0.025890322402119637,
        -0.020551772788167,
        0.010152306407690048,
        -0.10556536167860031,
        -0.012288179248571396,
        0.02596576139330864,
        -0.015325873158872128,
        -0.03932502493262291,
        -0.019694607704877853,
        0.02058640867471695,
        -0.03999864310026169,
        0.052284542471170425,
        0.043616972863674164,
        -0.0040472219698131084,
        0.05475873872637749,
        -0.10653139650821686,
        -0.06301624327898026,
        -0.06834644824266434,
        0.04567565768957138,
        0.040104132145643234,
        0.08672919124364853,
        0.014120623469352722,
        0.023802606388926506,
        0.044942643493413925,
        -0.007481337524950504,
        -0.04920363426208496,
        0.04822412133216858,
        0.02547193318605423,
        0.03149827942252159,
        -0.0046998923644423485,
        -0.007369483821094036,
        -0.08300857245922089,
        -0.008137764409184456,
        0.05219801515340805,
        -0.1199348121881485,
        0.058280058205127716,
        0.056721147149801254,
        -0.03593814745545387,
        -0.008282185532152653,
        0.056810908019542694,
        -0.0879632830619812,
        -0.0012598722241818905,
        -0.015948381274938583,
        0.011956422589719296,
        0.012156940996646881,
        0.01398402638733387,
        -0.02068476937711239,
        0.04493837058544159,
        -0.046817846596241,
        -0.05156085267663002,
        -0.027403712272644043,
        -0.07989028096199036,
        0.042452018707990646,
        0.02866077609360218,
        -0.07208169996738434,
        -0.02483178675174713,
        -0.05188878998160362,
        -0.04874588921666145,
        0.037744082510471344,
        -0.1018439307808876,
        -0.019857920706272125,
        -0.028793150559067726,
        0.03317224234342575,
        0.014683234505355358,
        0.025834305211901665,
        0.012905006296932697,
        -0.008984075859189034,
        0.05133027583360672,
        0.011344981379806995,
        0.04148988798260689,
        0.12929709255695343,
        0.0516953244805336,
        0.09140084683895111,
        0.0915365144610405,
        -0.03288273885846138,
        0.031403858214616776,
        -0.00017808101256377995,
        0.06304722279310226,
        -0.0829983577132225,
        0.00038641426363028586,
        0.05812838673591614,
        -6.112529860047289e-08,
        0.08640900254249573,
        -0.022392993792891502,
        -0.028676625341176987,
        -0.03386240452528,
        0.07762353867292404,
        0.0572759211063385,
        -0.05134158954024315,
        -0.028919775038957596,
        0.1086120679974556,
        0.015073505230247974,
        0.0772683173418045,
        -0.008582284674048424,
        -0.06518395245075226,
        0.10739266127347946,
        -0.10342573374509811,
        -0.032748471945524216,
        -0.11116752028465271,
        0.01401304267346859,
        -0.03379352018237114,
        -0.009176339022815228,
        -0.04913247004151344,
        0.07885196059942245,
        0.0015630099223926663,
        -0.023895803838968277,
        0.07580271363258362,
        0.005532344337552786,
        -0.018972234800457954,
        0.028372380882501602,
        -0.015675049275159836,
        -0.021271707490086555,
        -0.03887495771050453,
        0.010657631792128086,
        -0.1067112386226654,
        -0.02859284169971943,
        -0.003328232327476144,
        -0.005674995016306639,
        -0.04077259451150894,
        -0.08511849492788315,
        0.062127407640218735,
        -0.03478316590189934,
        0.0022378219291567802,
        -0.09646717458963394,
        0.0815235823392868,
        -0.001626927638426423,
        0.004173337947577238,
        -0.0865464061498642,
        -0.007562009617686272,
        -0.10073663294315338,
        -0.007520065177232027,
        0.032077353447675705,
        -0.10330982506275177,
        -0.08929955214262009,
        0.033645980060100555,
        0.011442964896559715,
        0.0554506815969944,
        -0.014825085178017616,
        0.03311057761311531,
        0.008228903636336327,
        -0.023606084287166595,
        0.05608180910348892,
        0.09340590238571167,
        -0.13088254630565643,
        -0.08965971320867538,
        0.042403120547533035
    ]
}