{
    "id": "sBXGUmV3F64",
    "title": "I can't believe this is a computer - Apple iMac 2021",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-28T00:58:06Z",
    "video_url": "https://www.youtube.com/watch?v=sBXGUmV3F64",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "iMac",
        "2021",
        "Thin",
        "M1",
        "computer",
        "MacOS",
        "4.5K",
        "Processor",
        "performance",
        "small",
        "compact",
        "PC",
        "Unboxing",
        "Linus"
    ],
    "views": 1797475,
    "likes": 54952,
    "comments_count": 3642,
    "description": "Get a new skin for your new iMac or iPad at   The new 2021 Apple iMac is here, and well, it's extremely thin. It doesn't even feel or look like a computer anymore! Let's unbox it and see what it's like.   Buy 2021 Apple iMac  On Amazon (PAID LINK):  On B&H (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://geni.us/XVG6Wa",
        "https://geni.us/AmgMS46",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Words cannot express my excitement to check out the new 24-inch M1 iMac. Why? Because honestly guys, I've been doing a lot of soul searching, and deep down, I just really don't think I'm that into PC anymore. I mean, who wants all those choices for motherboards and displays and graphics cards, when I could just have one choice, the color. Actually there's a little and more to it than that. There's three main tiers of the M1 iMac. (groans) Hold on. Got it. Just gotta open the box. Oh! Just trying to get the, you open the thing and it moves the thing. You know what, let's talk about the performance differences between the tiers a little bit later, because first, I just wanna get hands-on with this thing. It, (screaming) Aw! Is really thin. You know what it kind of reminds me of in terms of proportions? A gigantic iPad. But with a huge chin on it. Wow! I am like blown away by how light this thing is. Meanwhile, over on the PC side, the concept of a thin client is like a little nook or something that you bolt to the back of the VESA mount on your monitor. But then apple goes, well, I mean, why don't you just put the whole computer in a gigantic chin bar? This is the top tier model. So it comes with some things that the base ones and even the mid tier one don't. Starting with four Type-C ports on the back. Now, every model gets two Thunderbolt/USB4 ones, but only the mid tier and upper tier ones get an additional two USB3 ports. Other than that, we've got the same 500 nit peak brightness, 4.5K display, the same 1080P web cam, which I am extremely excited about. I mean, we're getting A, Apple's mobile processing on it, and B, finally decent freaking hardware for a change. And the same microphone array that apple claims gives us this thing best in class performance, both from an audio input perspective and actually, oh, yes, there's our, I mean, sort of like a downward firing soundbar. There's all the internal speakers along the bottom. You get the same headphone jack, power button and all that good stuff. But where they differ, is in the accessories and actually in the internal. Starting of course, with the magic keyboard. If you go with the base model, you do not get touch ID on the top right of your magic keyboard. For my part, I think that's honestly already a deal breaker for me for the base model. Touch ID is freaking awesome, always has been and always will be, in my perspective. USB-C to Lightning charging cable. We can put that away for now. Presumably there'll be enough charge to get started, then we... Yes, good old magic mouse. Who needs to be able to use it while you're charging it, if it can be used for hours after only a few minutes of charge? That's the kind of interruption to my work day that I need in my life. They have made a conscious decision not to fix it. This puppy right here, this is the optional upgraded power brick that has Apple's new MagSafe connector. So we just go ahead and... I mean, does it just grab on? Look at that. Wow! It really grabs, doesn't it? And Gigabit Ethernet, and I was really curious how they were doing the data, right? Because obviously this can't just be, you know, 12 volts and ground, right? So there has to be data lines in here. And it turns out that they've got a really clever little kind of triangle shaped guide on two sides of the center of the MagSafe connector, which means it can only go in two ways. So you've got what is essentially a reversible connector that's got 12 conductors, which would be enough for USB3? What if it's just Lightning? But is that... I know Lightning is not quite standard USB2 cause I'm trying to think if that's even fast enough for Gigabit. Imagine being apple and just being able to like invent your own standards for things. For those of you wondering about the graphic that I've got on here by the way. This is from dbrand, who sent over this iPad, and sponsored this video. And they have... This is gonna be a big launch for them. I can already tell because this thing looks fantastic. This is the black color wave for it. But you can see that the overall pattern is gonna have a common theme. And that's that it has this kind of folded steel look, like damascus steel, which also happens to bear a lot of similarities to the top prestige skin in Call Of Duty. They've got their hollow green one, which I've seen already. I think they have a couple of other ones coming and man, on pretty much anything, this is going to look absolutely sick. As always with dbrand skins, they are perfection fitted, they've got great guides online that you can use to make sure that your application is absolutely perfect. And their configurator is fantastic. It allows you to see exactly whatever your device will look like with whatever combination of skins and on whatever combination of surfaces you prefer. So go check them out. We're gonna have them at the link in the video description. Again, they said they really didn't like the look of a black one on this. I think it looks great. So maybe I'm just tasteless, but maybe check out some of their other skins for your iMac, if this doesn't do it for you. Well, we're not quite done with the differences yet. There's two more that apple tells you about. One, is that the mid and higher tier are available in three additional colors. So you get it in yellow, orange or purple, in addition to blue, green, pink, and silver. And they both come with an 8-Core GPU, rather than a 7-Core GPU. The last difference that I'm aware of anyway, is that the mid and upper tier one, both come with two cooling fans instead of one. So it is possible that that second cooling fan is only necessary because of the eighth GPU Core. But it's also possible that there could be slight performance differences between the base and mid and upper tier. We don't know, we haven't tested it yet, this is the first time on opening it. I guess if I spent the extra, I might as well get a, plug an ethernet cable in, right? I'm gonna sound a little spoiled here, but I have to confess I had kind of forgotten how small 24 inches is. It does not feel like a $1,300 starting at computer size anymore. That's interesting. Now I mean, I can see why they have a product in this size class, you know, dental offices or whatever, like they need computers too. But yeah, that is not a big display anymore. Look at that. Got my verification code on my apple watch. It just works, okay? There's the map of... Not where I am. I'm actually over here somewhere, but don't worry about it. (indistinct) That's what she said. If people can't find their mouse cursor, they just go like this and then it gets big and then they can find it. Sorry, it's just going through Apple's new secure data storage facility in China. They like built it in collaboration with a Chinese government-run entity. Set up Pace here? Sure, why not. Hey Siri, open the documents folder. Wow, that was so much faster than just clicking on it. One really nice thing about the Apple ecosystem is, that default encryption. Look at that. Do you want to use FileVault to encrypt the disc on your Mac? Heck yeah, I do. And whoa, we can set up touch ID. God, touch ID is so amazing. Just pre-pack touch ID on the iPhone. Just make the Apple logo on the back a touch center. Everyone wants it. Whoa! Dark mode. Nice. Neat. Okay, just gonna have to do the first thing that I do, which is turn off True Tone, because, don't understand why it exists. Now, let's talk about the difference going from this one to the high tier model, cause on their website, they've kind of got good, better, best. It is pre upgraded from 256 gigs of storage to 512. And then you can just take the mid tier one and upgrade to 512 gigs of storage if you want. And then it will be exactly the same thing. So really there's only two tiers. And just like any M1 based machine, so Mac mini, MacBook Air, MacBook Pro, you're going to be limited to a maximum of two terabytes of storage and 16 gigs of Ram. Which again, back to, dental offices and the kind of places that you'd be able to fit a machine like this, is honestly probably fine. Cause you're running Safari, right? You're on a Mac. Not running Chrome or anything. Boy, that really is a clever idea for cable management. Having the network cable just like run somewhere else, and then they go and ruin it by not putting the USB-C on the bottom of the stand or something like that. God, that'd be awesome. But then you wouldn't be able to put it on a monitor arm which we all know many of these are destined to end up on. So all that's left now then is to prompt you guys to make sure you're subscribed to Linus Tech Tips because the one and only Anthony Young will be putting this thing through its paces. Subscribe to ShortCircuit.",
    "transcript_keywords": [
        "apple",
        "thing",
        "tier",
        "Words cannot express",
        "express my excitement",
        "mid tier",
        "kind",
        "mid",
        "touch",
        "upper tier",
        "tier model",
        "model",
        "tiers",
        "base",
        "Lightning",
        "GPU",
        "back",
        "Mac",
        "iMac",
        "storage"
    ],
    "transcript_entity_values": [
        "only a few minutes",
        "iPad",
        "USB3",
        "Thunderbolt",
        "three",
        "One",
        "GPU Core",
        "8",
        "one",
        "FileVault",
        "Ram",
        "Call Of Duty",
        "24-inch",
        "12 volts",
        "iPhone",
        "iMac",
        "Linus Tech Tips",
        "Mac",
        "Siri",
        "iMac",
        "second",
        "eighth",
        "1,300",
        "Safari",
        "Gigabit Ethernet",
        "Chrome",
        "4.5",
        "China",
        "256",
        "the M1 iMac",
        "24 inches",
        "first",
        "Chinese",
        "M1",
        "7",
        "16",
        "two",
        "True Tone",
        "four",
        "500",
        "hours",
        "an additional two",
        "damascus steel",
        "Mac",
        "Gigabit",
        "512",
        "MacBook Pro",
        "only two",
        "USB-C",
        "12",
        "ShortCircuit",
        "VESA",
        "MacBook Air",
        "1080P",
        "Apple",
        "two terabytes",
        "Anthony Young"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON"
    ],
    "vector": [
        -0.06204727292060852,
        0.024479717016220093,
        0.1137588620185852,
        -0.02304999530315399,
        0.08591852337121964,
        -0.04169261083006859,
        0.038087766617536545,
        -0.007783437613397837,
        0.031942714005708694,
        0.10184058547019958,
        0.09474020451307297,
        -0.020467819646000862,
        0.012067622505128384,
        0.026084808632731438,
        0.053793229162693024,
        -0.058281995356082916,
        0.0013993269531056285,
        -0.09650524705648422,
        -0.07581298053264618,
        -0.020162586122751236,
        -0.026637734845280647,
        -0.04801139608025551,
        -0.05022852122783661,
        -0.001480374252423644,
        -0.03910509869456291,
        0.012895478866994381,
        0.014502985402941704,
        -0.05368915945291519,
        -0.06177579611539841,
        -0.061967093497514725,
        -0.039707787334918976,
        -0.029988141730427742,
        -0.03275885060429573,
        -0.007686688099056482,
        0.008841860108077526,
        -0.04744812846183777,
        0.07215768843889236,
        -0.036295462399721146,
        -0.09335823357105255,
        -0.07844473421573639,
        -0.05964529514312744,
        -0.032552916556596756,
        0.03666150942444801,
        0.11572560667991638,
        0.08556586503982544,
        -0.03613178804516792,
        -0.013465005904436111,
        -0.07651787251234055,
        0.05888982117176056,
        0.04911966994404793,
        0.007282345090061426,
        -0.02606927789747715,
        0.04530370235443115,
        -0.034188348799943924,
        -0.043305374681949615,
        0.0032250212971121073,
        0.036931972950696945,
        -0.016004463657736778,
        0.06140918284654617,
        0.0018023771699517965,
        0.041952479630708694,
        -0.09656950831413269,
        0.040166523307561874,
        0.02311575412750244,
        0.0012124076019972563,
        0.003109280951321125,
        0.022183634340763092,
        -0.015558252111077309,
        -0.042753253132104874,
        -0.10544955730438232,
        0.054612841457128525,
        -0.058927983045578,
        0.050592437386512756,
        0.07785797864198685,
        0.01998087950050831,
        -0.044262487441301346,
        0.03922399505972862,
        -0.08833342790603638,
        0.022190621122717857,
        0.10404209792613983,
        -0.015106584876775742,
        -0.0022661646362394094,
        -0.05135864019393921,
        0.015521121211349964,
        -0.03154860436916351,
        -0.012908064760267735,
        0.01844608597457409,
        -0.06295838207006454,
        0.02058500237762928,
        -0.026525985449552536,
        -0.024821680039167404,
        0.09250687807798386,
        -0.0019250279292464256,
        0.08637534081935883,
        0.021599281579256058,
        -0.020344285294413567,
        -0.011194474063813686,
        -0.022972717881202698,
        -0.09142422676086426,
        0.09259213507175446,
        -0.0033232998102903366,
        0.03489468991756439,
        0.10062194615602493,
        -0.02630159631371498,
        -0.07931432127952576,
        -0.08060144633054733,
        0.0113498130813241,
        -0.008001149632036686,
        0.018234631046652794,
        0.030512234196066856,
        -0.01863487809896469,
        -0.04357510805130005,
        -0.12422896176576614,
        0.06362351775169373,
        0.0652734637260437,
        0.014316307380795479,
        -0.06310483068227768,
        0.03048180788755417,
        0.14818061888217926,
        -0.03120184876024723,
        0.010783899575471878,
        0.02262355200946331,
        -0.07562413066625595,
        -0.033398110419511795,
        0.024711336940526962,
        0.05553475022315979,
        -0.04250655323266983,
        1.2859822790984398e-33,
        -0.10638140887022018,
        0.06381362676620483,
        -0.04503798484802246,
        0.014172995463013649,
        0.04664168134331703,
        -0.019334586337208748,
        0.051333680748939514,
        0.005624249577522278,
        -0.11336766183376312,
        0.010610904544591904,
        -0.055735304951667786,
        0.032496657222509384,
        -0.08583661168813705,
        0.06734983623027802,
        0.030516941100358963,
        -0.08390262722969055,
        -0.004228469915688038,
        0.013453594408929348,
        -0.005263819824904203,
        0.04118248447775841,
        -0.0004921043291687965,
        0.06404794752597809,
        0.036590155214071274,
        -0.08092964440584183,
        0.00852897483855486,
        -0.03368312492966652,
        -0.04530322924256325,
        -0.022634118795394897,
        0.06821935623884201,
        0.022653188556432724,
        -0.0662587434053421,
        0.024757515639066696,
        0.053567565977573395,
        -0.10160727798938751,
        -0.0492686852812767,
        -0.03589199483394623,
        -0.05188314989209175,
        -0.005835291929543018,
        0.021263593807816505,
        0.04064401611685753,
        -0.08196032047271729,
        0.04489099979400635,
        -0.02071254327893257,
        -0.055921684950590134,
        0.019784770905971527,
        0.027495287358760834,
        0.06310484558343887,
        0.029182152822613716,
        -0.019863037392497063,
        0.05175220966339111,
        -0.04187217727303505,
        -0.008525757119059563,
        -0.004862988833338022,
        -0.012057899497449398,
        -0.017699236050248146,
        -0.046969566494226456,
        -0.022887933999300003,
        -0.027312150225043297,
        0.051574066281318665,
        0.06037367507815361,
        0.07057752460241318,
        0.08070606738328934,
        0.014958154410123825,
        -0.017578987404704094,
        -0.03838391602039337,
        0.03340638056397438,
        -0.02090938203036785,
        0.024790266528725624,
        -0.03772934526205063,
        0.019924990832805634,
        0.014262323267757893,
        -0.025741754099726677,
        0.044266559183597565,
        0.0022110668942332268,
        0.003016436006873846,
        -0.059946756809949875,
        -0.06487346440553665,
        -0.05118057504296303,
        -0.07062799483537674,
        -0.028145119547843933,
        -0.043038591742515564,
        0.07825285196304321,
        0.059163082391023636,
        0.07093897461891174,
        -0.042520325630903244,
        0.05669107288122177,
        0.007433904800564051,
        -0.00663765287026763,
        0.007816452533006668,
        0.0043845409527421,
        0.004552596248686314,
        -0.020901422947645187,
        -0.0014494976494461298,
        0.012724434956908226,
        -0.060047805309295654,
        -3.2742230668063535e-33,
        -0.02120143547654152,
        -0.09954268485307693,
        -0.04926125705242157,
        -0.01004903856664896,
        0.005395269952714443,
        -0.0102513637393713,
        0.046628255397081375,
        0.09977836161851883,
        -0.008721454069018364,
        -0.06948407739400864,
        0.07770740240812302,
        0.07505396753549576,
        -0.013679820112884045,
        -0.015624084509909153,
        -0.008707292377948761,
        -0.002210222417488694,
        0.043256066739559174,
        -0.040529556572437286,
        0.009805808775126934,
        -0.06096136197447777,
        0.007050452753901482,
        -0.028189988806843758,
        0.041780754923820496,
        0.05248970538377762,
        0.0424119271337986,
        -0.007458403240889311,
        0.06650121510028839,
        -0.019375020638108253,
        0.037870779633522034,
        0.02128063142299652,
        -0.05442190170288086,
        -0.004429757595062256,
        0.009877447038888931,
        -0.025664793327450752,
        0.09459222853183746,
        0.011066083796322346,
        0.019893687218427658,
        -0.0500432625412941,
        0.005944793112576008,
        -0.10900450497865677,
        -0.0045683979988098145,
        0.07152751088142395,
        -0.002055536722764373,
        0.04401781037449837,
        -0.0022711153142154217,
        0.036191243678331375,
        -0.048491206020116806,
        0.006420105695724487,
        0.050053808838129044,
        0.052032310515642166,
        0.013943647965788841,
        -0.04711934179067612,
        0.037465184926986694,
        -0.014087303541600704,
        -0.07319433242082596,
        -0.030208848416805267,
        -0.06317197531461716,
        0.10931973159313202,
        0.011535398662090302,
        0.004009926225990057,
        0.015382022596895695,
        -0.02177993580698967,
        -0.03815480321645737,
        -0.0616798922419548,
        0.053916238248348236,
        -0.031007589772343636,
        0.010439460165798664,
        0.04210599884390831,
        -0.03222779184579849,
        0.03613487258553505,
        -0.02126634307205677,
        0.04259592294692993,
        -0.06790955364704132,
        -0.08429237455129623,
        0.01575220376253128,
        0.02355504222214222,
        0.07497870177030563,
        0.0008327765972353518,
        0.00990865845233202,
        0.010054037906229496,
        0.02120046876370907,
        0.06784364581108093,
        0.014709237962961197,
        0.009005391970276833,
        0.06723029911518097,
        0.023972615599632263,
        -0.04628349468111992,
        -0.016559232026338577,
        -0.07139039784669876,
        0.08423969149589539,
        -0.08485761284828186,
        -0.03479598090052605,
        -0.07891961187124252,
        0.054650239646434784,
        -0.05016116797924042,
        -5.836274041826073e-08,
        -0.018157167360186577,
        -0.006036873906850815,
        0.05138802528381348,
        -0.022863978520035744,
        0.0039216806180775166,
        -0.008549780584871769,
        0.02864287607371807,
        -0.05188169702887535,
        0.11797893047332764,
        0.006341194733977318,
        -0.023920370265841484,
        -0.05920477211475372,
        -0.03253614529967308,
        0.0513400062918663,
        -0.026413418352603912,
        0.07571351528167725,
        -0.12190043926239014,
        0.14274132251739502,
        -0.01065739430487156,
        -0.08265315741300583,
        -0.060941874980926514,
        0.011415872722864151,
        0.011583288200199604,
        -0.01585569605231285,
        -0.010810420848429203,
        -0.007169520948082209,
        0.015404174104332924,
        0.06367693841457367,
        0.050789736211299896,
        -0.0459514781832695,
        -0.09960158169269562,
        -0.05985012650489807,
        0.02519465610384941,
        -0.0287812240421772,
        0.02474922686815262,
        -0.03689897805452347,
        -0.06688381731510162,
        0.06813959032297134,
        0.005525817163288593,
        0.005604563280940056,
        -0.025258639827370644,
        -0.07145591825246811,
        -0.011394248344004154,
        -0.024909518659114838,
        0.04824928194284439,
        -0.09885356575250626,
        -0.031189024448394775,
        -0.005372437182813883,
        -0.04634309187531471,
        0.02832058072090149,
        0.03496672958135605,
        -0.022982338443398476,
        0.011893526650965214,
        0.07188364863395691,
        0.055479902774095535,
        -0.051194772124290466,
        0.00933574978262186,
        -0.001908961683511734,
        0.04545768350362778,
        0.1378757357597351,
        0.08069813996553421,
        -0.12549185752868652,
        -0.05723728984594345,
        0.1043127253651619
    ]
}