{
    "id": "sdFtMRko2GU",
    "title": "How 3D Printing Changed This Dog's Life!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-08-22T16:01:14Z",
    "video_url": "https://www.youtube.com/watch?v=sdFtMRko2GU",
    "category": "Science & Technology",
    "tags": [
        "3d printing",
        "3d printed",
        "prosthetics",
        "dog prosthetics",
        "3d printed prosthetics",
        "MKBHD",
        "3d pets",
        "3dpets"
    ],
    "views": 1642378,
    "likes": 91017,
    "comments_count": 2557,
    "description": "This company uses an iPhone to scan, fit and 3D print prosthetics for pets of all shapes and sizes, and it's awesome   3DPets:   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://www.3dpetsprosthetics.com/",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- So this is Cleo and as you can probably immediately tell, Cleo is an awesome dog. She's one of the nicest dogs I've ever met. She loves people, anyone that'll give her any food. She's pretty classic dog stuff and she also happens to be missing her right leg. She was found on Petfinder after she spent some time as a stray in Oklahoma with injuries from unknown causes. Now hanging out with Cleo and just playing with her, like you'd almost forget, like you wouldn't even know that she's missing a leg 'cause she's just running around, chasing stuff, playing fetch, she loves being outdoors, all that classic dog stuff. But although she appears super healthy now, dogs that are missing limbs and any pets that are missing limbs are actually more likely to have things like arthritis and joint problems in their other limbs later in life 'cause they're compensating for the missing limb. So she's running around being awesome now, but it would be ideal for her long term to be supported so that's where this company called 3D Pets comes in. So they reached out and they were telling me they have a particularly high tech solution to the problem and asked if I basically want to go see it and it turns out it is pretty sick. I mean, I've already talked about this before, but there's tech in everything. Like every story, every angle, everything I see on the news nowadays, it has some tech in it, but even this story surprised me at just how much tech was involved in helping dogs like Cleo. So it's this multi-step process. First up is this scan. So the pet comes into their studio, which is actually in New Jersey, pretty close to our video studio and they actually use a smartphone to 3D scan the animal. So the idea is to take a few scans, they actually use the iPhone's LIDAR scanner or use the true depth camera system or both. This isn't exactly what they were designed for, but with apps like combed and hedges, it is a pretty clever solution for just basic measuring. So basically once you get Cleo to hold still for long enough, you can get a pretty decently accurate scan of her dimensions. How high off the ground she is, how far around, the shape of the prosthesis, what that needs to be, et cetera and all of this is to be used in the next step, which is 3D printing the prosthesis, it's crazy. Now you might be thinking like I was at the beginning of this, wait a second, why is there so much tech being used in this process? Like why is it 3D scanning the animal and then 3D printing the prosthesis? What's going on here? And the real answer as they explained it to me basically is because every single animal's situation is a little bit different. No two are exactly the same whether it's the reason that they lost the limb or part of the limb, but then just like the size of the animal, how big are they? How far off the ground does the limb end? How much weight are they gonna be able to put on it? All these different things are slightly different for every single animal, it's kind of like a fingerprint. So clearly you can't just mass produce like one size fits all prosthetic. Obviously even with humans, you know this is is already true, but the idea is you want it to be as custom and bespoke and comfortable for every single animal as possible so this 3D printing process allows for rapid reiteration and making a couple different versions till you get it exactly right and so this is why they're doing it this way. 3D pets in particular, they've worked with over 300 different animals so far at their studio. They actually start with a candidacy form on their website. But then once they get going, they have a ton of options. To date, they've done many dogs as pets, but also some ducks, a tortoise, a pig. They had a goat recently that was missing part of its skull that didn't form properly and goats like to use their heads for stuff obviously so they made a helmet for him and one elephant leg recently. So anyway, Cleo's scan pretty straightforward and within five minutes they have a couple decently accurate models to work with and then they import it into the computer to move to step two. So how do you get the scan off the phone? - Well that's the easy part. We get the scan off the phone onto our web portal, which we're able to bring into a custom design software here where that's really where the magic happens, where we're able to take a design and really mold it to the 3D scan of each pet so that we can make sure everything's fitting perfect. - So this is Cleo's scan, and the appropriate fit as it would be built on the scan? - Right, so you can see the scan overlaid and we can patch things up as needed. It's almost like 3D Photoshop in a way, but then we're able to control the lattice, the hardware mounts, where the straps go, we can really position everything perfect to each pet. And then once we're happy, once it's set, then we bring it into another software where this is where we optimize it for printing. So we have to be able to basically give the printer instruction on what to make. So this is where we really fine tune the intricacies and the detail of each layer 'cause again, we want some areas to be nice and rigid where hardware mounts, for example. But like around the rib cage, around the lungs, we want the flexibility so you can see we don't have that thick lattice there. This over here, these wings we can really easily bend even if the dog fluctuates in weight, we want it to accommodate those changes. But where the mount is, where the hardware is on this end, this we want to be really sturdy and strong 'cause that's where the impact is. So once we're happy with this, once it's ready to go, we'll take it over to one of the 3D printers and we have a whole bunch of different sizes depending on the case, depending on the animal, but they're all pretty similar in how they work. - So 3D printing, to be perfectly honest, I never really cared that much about 3D printing. This is like a confession. Like I never... There was a ton of hype about it and obviously a lot of people care a lot about it, but every time I was brought up to me, I couldn't really find a reason to care and we got a 3D printer at the studio and we've printed a couple random trinkets here and there, mostly things that are just like useless stuff just to see if it'll work. Whatever, neat, but this is the first time I've seen a situation where 3D printing clearly makes the most sense for a manufacturing process. Obviously you can't do one single mold, you can't do one size fits all so like I said, it just made the most sense for once. They have a couple different size printers in here ranging from something like an Anker M5, something you might buy on Amazon all the way up to an industrial sized one, the size of a refrigerator, basically to work on different sized pieces for different animals. So once they were happy with Cleo's design of the prosthesis in the software, it hits the printer and about literally 24 hours later, it's done, it's printed, the whole thing. Now this isn't the final step for hers. There is still a sanding down process to soften the corners and make it as comfortable as possible and also in 3D printing, there's commonly these support pieces that you get when you print oddly shaped objects that need to be cut off and they're actually working on ways to melt that down and use it in other things like wheels or feet so they can actually be resourceful about that as well, but they've showed me a bunch of examples of various shapes and sizes of things they've printed for animals in the past. - So this one is just about ready to ship out. This dog has a residual limb. So we have this build out here and we do it like this so that we can keep the weight bearing load right below where the limb used to be. If we have it in any other place, they just won't be able to walk correctly. - And this is also now softened down and it is just sanded, basically? - We do a sand and torch. So we'll basically burn the material back like what the machine is doing, heating it up to a melting temperature, it smooths it out. And something that we're very well known for with our devices are our feet. And so one of the biggest things is when the dogs are taking steps, you want that foot to be able to compress to absorb that. I'll trade you. I think this is version like five or six of the foot and we're on version like 10 or 12 of the harness so they're constantly changing and adapting. If somebody reaches out to us and they say, I burned through a foot, here are the reasons why, we're gonna make the changes to the foot so that stops happening. And so that's why we go through our variations. We're actually working on the next version of the foot, which has rounder edges so more of a radius on these edges. - Like a tire maybe? - Yeah, yeah, exactly like a tire because dogs tend to lean on one side or the other and we'll typically have the owners flip it around once they start to wear on one side so it wears evenly. - A tire rotation? - Exactly, a foot rotation. And then behind you, we have some of our carts that are in process too. So this is one going down to a dog in Texas. She's got two deformed limbs. In fact one is really not formed at all, but she's got one deformed here on the left hand side. So we make provisions for that so that the shoulders can still move around. So this'll get three six inch wheels on each corner. And then this, this is another good example. This is for a dachshund that has one full remaining leg and had a partial amputation. And so the owners didn't want something extremely bulky, but they wanted that front leg to have support 'cause dachshunds have a lot of back problems. So we designed this specifically for this case where the dachshund can put its legs and move it and still have the support on the outer edges and we still have our flexible harness here. And the wheels can change camber as well too so depending on-- - Sport mode. - And we'll go up to eight or 10 inch wheels. I think you saw this one. - That Escalade dogs. - We should do spinners on one of these rooms one of these days honestly. I haven't put it past people. The woman that we did our original dachshund cart for, she saw our black wheels and she was like, I'd like silver rims, please, and I thought she was joking. I totally thought she was joking and I was like, oh, that's a cool idea. She was like, no, really I want silver wheels. - Would you paint it or would you-- - We ended up painting it. Yeah, yeah, yeah. - So, Cleo's scan was pretty good. Then they designed her prosthesis around that scan, that went great. Then they printed it, sanded it, and torched it down and matched it with the leg for her height. The only step left now is to see how it works. So what I kind of didn't realize is it's not just like you attach the prosthesis to the dog and then they just magically start running around perfectly like they've had it their whole life. But no, like anyone who's had crutches knows this, there's actually an adjustment process as you get more and more used to it. So I got to watch Cleo sort of learn in real time even in just these few minutes, go from hovering it off the ground to eventually starting to trust it. And the process of them getting used to it depending on the pet is basically to introduce them to more and more time per day with it so that they eventually get used to totally living with it. Maybe 20 minutes a day at the beginning, then it's an hour a day, then two hours a day and you slowly see them start to remap their muscle memory and unlearn walking without the limb and really trust it and depend on it by the end. So at the end of the day, I thought this was super cool and basically it's a huge win for pets like Cleo and it's also super cool that it's enabled by tech that feels relatively accessible, like a phone in our pocket, a computer app, one or two pieces of software and then 3D printers like all things that we can get started with, that's how they got started with building this studio in New Jersey and actually helping so many pets and they actually now will continue to evolve this. There's other places around the country in the world doing the same sort of thing, but they potentially can do remote creations for pets that don't come to the studio but they get to like send a mold in and then build a prosthesis for other animals they don't even get to see. I'm not even gonna pretend to be an expert on 3D printing or prosthesis, but like hopefully this helps more animals sort of extend their lives and live more freely I think is the right word. These pieces are typically priced from a couple 100 bucks to up to 1,000 or $2,000 and ideally will last a lifetime at least if they've stopped growing. So thanks to 3D Pets for letting me pull back the curtain a little bit into how they use tech to do what they do. Thanks to Cleo for letting me hang out all day and thanks to you for watching. See you in the next one, peace.",
    "transcript_keywords": [
        "Cleo",
        "Cleo scan",
        "scan",
        "Cleo scan pretty",
        "pets",
        "printing",
        "basically",
        "dog",
        "dogs",
        "pretty",
        "animal",
        "things",
        "limb",
        "process",
        "prosthesis",
        "tech",
        "missing",
        "animals",
        "single animal",
        "pet"
    ],
    "transcript_entity_values": [
        "up to eight",
        "LIDAR",
        "one",
        "a couple 100 bucks",
        "10 inch",
        "24 hours later",
        "just these few minutes",
        "Texas",
        "Escalade",
        "10",
        "12",
        "Anker M5",
        "five",
        "New Jersey",
        "Oklahoma",
        "first",
        "Petfinder",
        "First",
        "1,000 or $2,000",
        "3D",
        "iPhone",
        "Maybe 20 minutes",
        "an hour",
        "five minutes",
        "two hours",
        "Amazon",
        "a second",
        "three six inch",
        "over 300",
        "two",
        "a ton",
        "the end of the day",
        "Cleo"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "TIME",
        "TIME",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "GPE",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "TIME",
        "TIME",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON"
    ],
    "vector": [
        -0.027031460776925087,
        -0.05949155613780022,
        0.10009118914604187,
        0.028949454426765442,
        -0.03852494806051254,
        -0.005384339950978756,
        0.0015248501440510154,
        0.010379545390605927,
        -0.03294529765844345,
        0.007951741106808186,
        0.021806126460433006,
        0.01821191981434822,
        -0.0002465308643877506,
        0.01387313473969698,
        -0.0008074862416833639,
        -0.0009443687158636749,
        0.0037217100616544485,
        -0.008732163347303867,
        -0.023513145744800568,
        0.0871133878827095,
        -0.0864717960357666,
        -0.018432816490530968,
        0.03291413187980652,
        0.04498749226331711,
        -0.05945869907736778,
        0.03771982342004776,
        0.029727516695857048,
        -0.07815434783697128,
        0.0012173743452876806,
        -0.03126123547554016,
        -0.07560242712497711,
        0.11322400718927383,
        -0.0812908187508583,
        0.0016649021999910474,
        0.09842724353075027,
        -0.02727782167494297,
        0.03215005621314049,
        0.0031270908657461405,
        -0.09378687292337418,
        0.004750177264213562,
        -0.0004960406804457307,
        0.0022102368529886007,
        -0.03660982847213745,
        -0.02606016770005226,
        -0.10898832976818085,
        -0.01916564255952835,
        -0.0754408910870552,
        -0.11679770052433014,
        0.011307301931083202,
        -0.05983766168355942,
        -0.07467582076787949,
        -0.05271819233894348,
        0.0443919338285923,
        -0.032129593193531036,
        -0.027846453711390495,
        -0.05139154940843582,
        -0.06544160842895508,
        -0.0015589112881571054,
        0.01592973619699478,
        -0.0031574470922350883,
        0.06390412151813507,
        0.060864534229040146,
        0.03353192284703255,
        -0.014090592041611671,
        0.05679530277848244,
        -0.024103961884975433,
        -0.023662174120545387,
        -0.0359310545027256,
        -0.005956904962658882,
        -0.014495381154119968,
        0.04763330519199371,
        0.015992291271686554,
        0.0012430475326254964,
        -0.018156936392188072,
        0.06590115278959274,
        -0.002414186717942357,
        0.09265977144241333,
        -0.022945931181311607,
        0.0940493494272232,
        0.027839448302984238,
        -0.04545443877577782,
        0.06572532653808594,
        -0.00797281600534916,
        0.08744260668754578,
        0.03549578785896301,
        0.035011034458875656,
        -0.07645788788795471,
        0.017858823761343956,
        -0.08373971283435822,
        -0.07392570376396179,
        -0.020210815593600273,
        0.011873695068061352,
        -0.06096735969185829,
        -0.07031812518835068,
        0.02553216926753521,
        0.06759492307901382,
        0.0021550545934587717,
        -0.06869128346443176,
        0.0022679418325424194,
        0.021231433376669884,
        -0.027940280735492706,
        0.06737327575683594,
        0.11029010266065598,
        -0.002320274943485856,
        0.03939928486943245,
        -0.03427649661898613,
        0.04941796883940697,
        -0.0031990711577236652,
        -0.03211308270692825,
        0.061201322823762894,
        0.02065660059452057,
        -0.009783335961401463,
        0.034620217978954315,
        0.04669874161481857,
        0.06413128226995468,
        0.06120055541396141,
        -0.11873744428157806,
        -0.06340448558330536,
        0.10476794838905334,
        -0.0688609853386879,
        -0.010979332029819489,
        -0.007611692883074284,
        -0.030192380771040916,
        0.014387570321559906,
        -0.001931510167196393,
        0.03018513135612011,
        0.005264351610094309,
        3.385025164314862e-33,
        0.02445140667259693,
        0.007948917336761951,
        -0.019538555294275284,
        -0.03668806329369545,
        0.006097023840993643,
        0.023850278928875923,
        -0.009708506986498833,
        -0.009333030320703983,
        -0.045305490493774414,
        0.00977026391774416,
        -0.06994621455669403,
        0.03153728321194649,
        0.05547880753874779,
        -0.02503477968275547,
        0.006471218075603247,
        -0.010588990524411201,
        -0.043582551181316376,
        0.05312742665410042,
        0.06054375693202019,
        0.08458635956048965,
        0.05039425194263458,
        -0.004486636258661747,
        0.07429173588752747,
        0.03895895555615425,
        -0.022258825600147247,
        0.005619535222649574,
        -0.039471499621868134,
        -0.0022593773901462555,
        0.010288137011229992,
        0.012087574228644371,
        -0.0340445414185524,
        0.04290365055203438,
        0.06635715812444687,
        -0.08302733302116394,
        -0.16333366930484772,
        -0.037069883197546005,
        -0.04654666781425476,
        -0.09433268755674362,
        -0.10863493382930756,
        0.10845876485109329,
        0.04154743254184723,
        -0.012121039442718029,
        0.0563567578792572,
        0.005102927330881357,
        -0.0724668800830841,
        -0.012577525340020657,
        0.0754924863576889,
        -0.0036775649059563875,
        -0.03438814729452133,
        0.0034441908355802298,
        -0.02377302758395672,
        0.08955290913581848,
        0.04943998530507088,
        -0.07380251586437225,
        -0.04232921451330185,
        0.0015237433835864067,
        0.021141495555639267,
        -0.10638074576854706,
        0.051246222108602524,
        0.06422731280326843,
        0.09610138833522797,
        0.08259446918964386,
        0.027631891891360283,
        -0.014110852032899857,
        0.08571529388427734,
        -0.03196527808904648,
        -0.005800833459943533,
        -0.01458805613219738,
        -0.07855410873889923,
        0.059499457478523254,
        -0.008872482925653458,
        -0.023942962288856506,
        -0.001511848415248096,
        -0.03325306251645088,
        0.055640093982219696,
        -0.030219588428735733,
        0.025155164301395416,
        0.001251969370059669,
        0.01740114390850067,
        -0.056516896933317184,
        0.026232566684484482,
        0.07760016620159149,
        0.0047987280413508415,
        0.08147593587636948,
        -0.007149712182581425,
        -0.04953472688794136,
        0.004227966070175171,
        -0.02054859697818756,
        -0.06705841422080994,
        0.0254536010324955,
        -0.00953544583171606,
        -0.07231806218624115,
        -0.04779642075300217,
        -0.030112484470009804,
        -0.02754301205277443,
        -5.2056653450149766e-33,
        0.0013503922382369637,
        -0.0422884039580822,
        0.01855485327541828,
        -0.036885108798742294,
        -0.056869760155677795,
        -0.022068079560995102,
        -0.017111418768763542,
        0.04125507175922394,
        0.05347086489200592,
        -0.045236736536026,
        0.04194404557347298,
        -0.014802442863583565,
        -0.015185662545263767,
        -0.03219910338521004,
        -0.02073366753757,
        0.08962558209896088,
        -0.05370057374238968,
        -0.042263709008693695,
        0.0149087430909276,
        -0.08656799048185349,
        0.022951718419790268,
        0.07396822422742844,
        0.040200065821409225,
        0.10789031535387039,
        -0.00984948966652155,
        0.06444580852985382,
        0.015122251585125923,
        0.002584240399301052,
        -0.07148654758930206,
        -0.09068706631660461,
        0.05458258092403412,
        -0.05364067107439041,
        0.014619914814829826,
        -0.01577701047062874,
        0.006457493640482426,
        -0.004984140396118164,
        -0.05049612745642662,
        -0.05216512084007263,
        0.008913099765777588,
        -0.021545862779021263,
        0.0842626765370369,
        -0.017956819385290146,
        -0.06288236379623413,
        0.054158736020326614,
        0.054325468838214874,
        0.05421473830938339,
        -0.010712014511227608,
        -0.029837708920240402,
        0.10384073108434677,
        0.04110642150044441,
        0.015586196444928646,
        -0.023024074733257294,
        0.03269175440073013,
        -0.05565330386161804,
        0.034014876931905746,
        -0.019155753776431084,
        -0.05516384541988373,
        -0.050363264977931976,
        -0.006523856893181801,
        0.014902859926223755,
        -0.012339132837951183,
        -0.011903813108801842,
        -0.004174722358584404,
        0.043023914098739624,
        -0.024310342967510223,
        -0.05397384241223335,
        -0.02367161400616169,
        -0.07779020071029663,
        0.02523774467408657,
        -0.05085130035877228,
        -0.06353632360696793,
        0.11486603319644928,
        -0.04832101985812187,
        -0.05810144171118736,
        0.051343705505132675,
        0.1057647094130516,
        0.005130018573254347,
        -0.02664523757994175,
        0.05263553559780121,
        -0.010704456828534603,
        -0.008636455051600933,
        -0.08640401065349579,
        0.07368392497301102,
        0.0424940325319767,
        0.0565381683409214,
        0.08007737249135971,
        -0.11270559579133987,
        0.04568677395582199,
        -0.009009437635540962,
        -0.022875167429447174,
        -0.009689967148005962,
        0.05058033764362335,
        -0.018390599638223648,
        0.019700495526194572,
        -0.01229415275156498,
        -4.820631360757943e-08,
        0.009499986656010151,
        -0.0011176799889653921,
        -0.03699468821287155,
        -0.02097102627158165,
        -0.014517811127007008,
        -0.012034723535180092,
        -0.016064295545220375,
        -0.06258227676153183,
        -0.03810623288154602,
        0.05082937702536583,
        -0.03723946213722229,
        -0.10447732359170914,
        -0.05757179483771324,
        -0.002898754319176078,
        0.0649726614356041,
        0.0696447566151619,
        0.07652300596237183,
        0.07989452034235,
        -0.007846808061003685,
        0.042991891503334045,
        -0.06056245043873787,
        -0.02983921393752098,
        0.11106963455677032,
        -0.04952993243932724,
        -0.04058661684393883,
        -0.0657089352607727,
        -0.02645384892821312,
        -0.029780622571706772,
        -0.049232110381126404,
        0.005302061792463064,
        -0.014007830992341042,
        -0.02246515266597271,
        0.038835830986499786,
        0.10264269262552261,
        0.048590634018182755,
        -0.10900763422250748,
        0.06233922392129898,
        -0.055919576436281204,
        -0.11370482295751572,
        0.05727478861808777,
        0.011973218992352486,
        0.09817959368228912,
        -0.08234819769859314,
        -0.03209193795919418,
        0.033250126987695694,
        -0.08401258289813995,
        0.0501585379242897,
        -0.03541519492864609,
        0.04196503013372421,
        -0.03657405450940132,
        -0.0804411917924881,
        -0.017927493900060654,
        0.023624684661626816,
        0.04290645942091942,
        0.010531996376812458,
        0.008954482153058052,
        -0.009862248785793781,
        -0.08895459771156311,
        0.0400262288749218,
        0.09428799152374268,
        -0.005693858955055475,
        2.1436269889818504e-05,
        0.03035205788910389,
        0.056401029229164124
    ]
}