{
    "id": "se5PS2AjKY0",
    "title": "Is It Time to DITCH Chrome?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-08-30T19:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=se5PS2AjKY0",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "google chrome",
        "microsoft edge",
        "internet explorer",
        "chromium",
        "browser",
        "edge chromium",
        "new edge",
        "firefox",
        "chrome",
        "microsoft edge chromium",
        "new microsoft edge",
        "web browser",
        "chromium edge",
        "new edge browser",
        "mosaic",
        "netscape navigator",
        "aol",
        "best web browser",
        "internet",
        "internet browser",
        "edge browser",
        "microsoft",
        "safari",
        "mozilla",
        "microsoft edge vs google chrome",
        "mozilla firefox",
        "netscape",
        "chromium browser",
        "google chromium",
        "chrome vs chromium",
        "best browsers",
        "tech"
    ],
    "views": 693601,
    "likes": 25020,
    "comments_count": 3018,
    "description": "Is it just me, or is Microsoft Edge looking kinda good?  Video Games Getting WAY More Expensive?!:  Twitch Is KILLING Twitch:  The END of Loot Boxes?!:  Fortnite is BEATING Minecraft:  Why Minecraft is BIGGER Than Ever:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/3cQJiQ0AkW8",
        "https://youtu.be/734b1TdKR90",
        "https://youtu.be/WLtG2Ed5uP4",
        "https://youtu.be/zckuX8NFoxM",
        "https://youtu.be/Lx6K35Acm-w",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "Hey guys and welcome to This is Now. Google Chrome absolutely dominates the internet today with over 70% market share on the PC and a version of Chrome available on everything from android to MAC to IOS it's not hard to see why. Now, back in 2008 the internet was a very, very different place. It was ruled by Internet Explorer, or more specifically, Internet Explorer 6. In the early 2000s IE 6 had a ridiculous 95% market share, it's hard to even sort of fathom that today. When the internet first came out, a sentence which I don't think I've said ever before, it was mainly reserved for researchers or agencies, not so much for the general public. Web pages were just text based and if you were lucky you might have a picture which sounds like the internet back in Matt's day. However, the first web browser Mosaic looked way more like something like Microsoft Word then any kind of browser that you would recognize today. When Netscape Navigator was released in 1995 it was the first browser to include a proper graphical interface that was much more accessible to the average person. Now at the time IE didn't even exist yet, in fact, Microsoft didn't think that internet access was something people would want. However, they were proven wrong as Netscape became massively popular, and that really forced Microsoft to introduce Internet Explorer. Ultimately, IE beat out Netscape for one simple reason, people had to buy Netscape which cost somewhere between 50 to $90 where as Internet Explorer was built into Windows 95. You would think it was insane today to ever purchase a browser, back in the day Internet Explorer being not only free, but also included with your Windows 95 install, was a huge, huge deal. AOL bought Netscape which just is a very 90 sense, but ultimately it was shutdown in 2008. Although, fun fact, Netscape did become the better opt for Mozilla Firefox, a pretty well known browser today. So things were great for Microsoft, right? Why exactly did Internet Explorer fail and where does Chrome come in in all of this? Well, the problem with Internet Explorer 6 wasn't that it was a terrible browser, after all, it did come out all the way back in 2001 for everything from Windows 98 to XP. The issue was that Microsoft aggressively pushed everyone out of the market and then proceed to, well, not really do anything for about five years. When we had virtually no competition in the market, there is very little incentive to innovate or improve a product. Here's the thing, even if they wanted to Microsoft was limited in to what they actually even prove on in the first place. Because they were the defacto industry standard practically every piece of web based software had to be compatible with Internet Explorer, specifically, 6. Huge companies and organizations built there entire IT infrastructure around Windows XP and Internet Explorer 6. We're talking banks, hospitals, government agencies, hundreds of thousands of PC's that all made to be compatible with Internet Explorer 6. In China and South Korea, for example, a lot of banks built their entire online banking architecture on the ActiveX framework, something that is not natively active in Chrome, and that's because, well, ActiveX was great in 1996, it is super, super insecure now which is why a lot of browser's have dropped support for it. Instead of these banks and these companies spending billions of dollars to rewrite the software for the newer browsers, they decided to just build off the original code. Which means that they have limited support in a lot of current browsers today. All these problems piled up quickly. Internet Explorer was slow, it didn't support newer web standards which meant that lots of sights we're coded only to really work on Internet Explorer, and it was massively, massively insecure. Enter Goggle Chrome. Now, when it first came out it was a real revolution. Sure, Mozilla's Firefox was sort of the first big step forward, but it really was Chrome that made everyone sit up and realize those times start investing in making the internet a better place. Fun fact, I remember testing Chrome two all the way back in June of 2009. Yeah, that's a video that's still online. Hey guys what is up, it's Duncan - [Matt] I remember hating Chrome. You didn't like Chrome at the beginning? - [Matt] No. I used it pretty much as soon as it came out, it was such a big jump forward. I mean, think about it, right, there was tab browsing which had kind of existed, but it really was sort of the first time the tabs were put on the top. And there's other things like you didn't really have to deal with all the separate windows, especially, Internet Explorer had. I mean, who wants to deal with different window for every web tab you have open. - [Matt] See, that's the thing. Me! Matt over here, he's so old that he still thinks tab's were a bad idea. Google also stepped up security in a big way by building in a sandbox which kept each tab from accessing anymore data then it needed. And importantly, it made everything far, far more stable because essentially back in the older days if a single tab went down, your entire browser would be crashing. However, with Chrome that tab might crash, but the rest of the browser would still stay up. I know all of this sounds so old school, but this was legitimately so, so cool. Chrome even has a built in ad blocker, but I use the words ad blocker pretty lightly. Now, yes, Chrome does block the most egregious ads on the internet, but after all Google does make about... How much money does Google make? June 2018 reported $38.9 billion in revenue, so that's a lot of money. They don't want to not make that much money. - [Matt] I mean, that's how much 'This Is' makes. As a Google product Chrome will really, really want you to use Google services, and of course, view those the sweet, sweet Google adds. And to give them some credit, they do a lot of proper ad blockers on the browser, but by default what's the search engine? Oh yeah, it's Google. Chrome also sends the URLs of the site's you visit to Google. It ever so helpfully logs you into Google site's, it allows you to pay for things easily with your credit cards saved in Google Wallet, I mean the list goes on and on. Now, honestly this is all okay. Not only can you turn off, basically, all these things, but at the end of the day, it's a free browser, and privacy is very much something that you might feel okay making some trade-offs for. The issue though is that there are other options out there which are actually really, really good. Today the dark ages of Internet Explorer are over, and there are lots of solid options. Opera has migrated to a Chrome base, but still has lots of useful features. Firefox has been majorly overhauled. And Safari offers some of the best anti-tracking protection period. What's the most exciting to me, though? I can't believe I'm about to say this, is Microsoft Edge. - [Matt] What?! Yes, not in the Explorer even though everyone thinks that the icons exactly the same, Edge. And hear me out, seriously, the new version of Edge is now based on Chromium which is, of course, the open source version of Chrome. So, it's a little bit more light weight then full Chrome, and it does support way more systems then the current version of Edge does. Including going all they way back to Windows 7, and you can even get now Chrome as well as Edge for MAC and IOS, in fact, Chrome was already on those, but now Edge is also on MAC which is interesting. Because, fun fact, another fun fact, did you know that Internet Explorer used to be the default web browser on MAC OS. - [Matt] Yes, I did know that. Okay, well, it's not such a fun fact anymore. With support for extensions, dark mode, and the obviously integration with Microsoft and Windows accounts and features, I mean, honestly the biggest upside here is the lack of Google ickiness. Over on the main channel, I did a video discussing why Apple is actually right about privacy. And you should definitely go check it out for the full explanation, but essentially it boils down to this. Are you the customer or are you the products? With companies like Apple and even Microsoft you're pretty clearly the customer. Microsoft makes the vast majority of their money selling licenses for Windows and Office which gives them a better incentive to protect your privacy. Now while Google does a better job then say Facebook, personally I feel better relying on Microsoft and Apple for my data. With incentives for keeping my privacy intact are much, much clearer. In fact, I actually recently switched over to the beta of Edge which I really don't have any complaints about. It works exactly as well as Chrome for everything I need it for. And the out coming inclusion of a privacy dashboard to allow you to customize just how hardcore your tracking protection is, for example, is really awesome. Not to mention that all those companies that were still relying on Internet Explorer 6 can now use Edge because it will have a compatibility mode built in. It literally be able to open up like Internet Explorer tab inside of Edge which is great for South Korean banks which I use many of. Try to ask me about my South Korean banking habits, Matt. - [Matt] I feel like the less I know, the better in this scenario. Good answer. Look, I love Google and use their stuff all the time, but it makes me uncomfortable that the world largely relies on the same browser made for one of the worlds largest add company's. Sort of like that thing, what's the phrase like you live long enough to see yourself become the villain or wait, no actually, is that it? Matt, villian expert, help me. - [Matt] Why am I a villain expert? Because you do lots of weird research on villians, it's fine. - [Matt] What? Whether you want to consider Edge, Firefox or any number of offshoots of Chrome is up to you. But for me, I think it's actually time to escape Chrome, or at least to try too. Thank you so much for watching. You can check out some of our other super rad awesome videos here. Why is it super rad awesome? I don't even know why he made me say that. And make sure to subscribe and ring that notification bell because if you don't we'll make Matt switch to Internet Explorer, 6 to be specific. - [Matt] A least I'll be compatible.",
    "transcript_keywords": [
        "Internet Explorer",
        "internet",
        "Explorer",
        "Chrome",
        "Internet Explorer tab",
        "Google",
        "day Internet Explorer",
        "Microsoft",
        "Edge",
        "introduce Internet Explorer",
        "browser",
        "Internet Explorer fail",
        "Windows",
        "Google Chrome absolutely",
        "Netscape",
        "Google product Chrome",
        "Google Chrome",
        "Microsoft Edge",
        "fact",
        "back"
    ],
    "transcript_entity_values": [
        "Firefox",
        "South Korea",
        "Windows and Office",
        "1996",
        "90",
        "Windows 95",
        "Today",
        "Windows",
        "one",
        "the older days",
        "Apple",
        "June of 2009",
        "MAC",
        "2001",
        "hundreds of thousands",
        "Mozilla",
        "95%",
        "Netscape Navigator",
        "the day",
        "today",
        "Duncan",
        "Explorer",
        "AOL",
        "Mosaic",
        "Internet Explorer",
        "Google",
        "June 2018",
        "the end of the day",
        "Matt",
        "Google Wallet",
        "Safari",
        "70%",
        "Edge",
        "Netscape",
        "2008",
        "two",
        "Chromium",
        "between 50 to $90",
        "Mozilla Firefox",
        "Chrome",
        "6",
        "ActiveX",
        "Facebook",
        "South Korean",
        "Netscape",
        "billions of dollars",
        "China",
        "$38.9 billion",
        "Internet Explorer 6",
        "about five years",
        "XP",
        "Edge",
        "Windows 7",
        "the early 2000s IE 6",
        "Microsoft",
        "first",
        "1995",
        "Microsoft Edge",
        "Windows 98",
        "Google Chrome",
        "Enter Goggle Chrome",
        "IOS"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PRODUCT",
        "MONEY",
        "GPE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.05385418236255646,
        -0.06921356171369553,
        0.1035398319363594,
        -0.0322505459189415,
        0.05455296114087105,
        -0.02079945057630539,
        -0.04725436493754387,
        0.03373764455318451,
        -0.04523518308997154,
        -0.03462488204240799,
        -0.0003586257225833833,
        0.06125125661492348,
        -0.042539071291685104,
        -0.0030668925028294325,
        0.09766432642936707,
        0.003117976477369666,
        0.050212353467941284,
        -0.09998292475938797,
        -0.025973783805966377,
        0.03149693086743355,
        -0.09977453947067261,
        -0.053034503012895584,
        -0.026972176507115364,
        -0.03351500630378723,
        0.06411440670490265,
        0.08612322807312012,
        -0.08386082202196121,
        -0.02163500338792801,
        0.025999173521995544,
        -0.07125250995159149,
        -0.025199390947818756,
        -0.033558644354343414,
        0.01690804585814476,
        0.010335620492696762,
        -0.03382735326886177,
        -0.04648769646883011,
        -0.014599201269447803,
        0.023329613730311394,
        -0.10702791810035706,
        -0.008151358924806118,
        0.01878373697400093,
        0.005681086331605911,
        -0.004229478072375059,
        -0.020491136237978935,
        0.00470511382445693,
        -0.04303961247205734,
        0.01057090051472187,
        -0.00400135712698102,
        -0.030982714146375656,
        0.029468700289726257,
        -0.008273573592305183,
        -0.030350126326084137,
        -0.0010879099136218429,
        -0.08615420013666153,
        -0.07250496000051498,
        -0.028706293553113937,
        -0.05228071287274361,
        0.006962032988667488,
        0.05400504544377327,
        0.05683012679219246,
        -0.0021640269551426172,
        -0.03561662882566452,
        0.027349786832928658,
        0.052327483892440796,
        0.015743058174848557,
        0.04889814183115959,
        0.04596840217709541,
        -0.0073570795357227325,
        -0.024967173114418983,
        -0.003013135166838765,
        -0.06347429752349854,
        0.02206392027437687,
        -0.0008761645294725895,
        0.04493135213851929,
        0.0013619394740089774,
        -0.0498795211315155,
        0.05288469418883324,
        0.020780492573976517,
        -0.026607869192957878,
        0.04671400040388107,
        0.05047433078289032,
        -0.04677407443523407,
        0.018440045416355133,
        0.033830493688583374,
        -0.01301055122166872,
        -0.0014818572672083974,
        -0.007381521165370941,
        -0.0701155811548233,
        -0.0012070562224835157,
        -0.04927327111363411,
        -0.037617217749357224,
        0.0376637727022171,
        0.08029668033123016,
        0.06794056296348572,
        0.08279845863580704,
        0.02325749769806862,
        0.005877465475350618,
        -0.02581639774143696,
        0.010533682070672512,
        0.0678594782948494,
        0.04593943804502487,
        0.006508241407573223,
        0.033284611999988556,
        -0.049181751906871796,
        0.008478663861751556,
        0.016383349895477295,
        0.0007970483275130391,
        0.16162559390068054,
        0.05789800360798836,
        0.024534136056900024,
        -0.04212594032287598,
        0.014039994217455387,
        -0.0490034818649292,
        -0.06391138583421707,
        -0.05258451774716377,
        -0.07602773606777191,
        -0.0603264681994915,
        -0.007877388969063759,
        0.18336167931556702,
        0.10748958587646484,
        0.03307092562317848,
        0.09467530250549316,
        -0.0374927744269371,
        -0.023210491985082626,
        0.06350035965442657,
        -0.0023710799869149923,
        -0.010367639362812042,
        4.4267354010441114e-33,
        0.007996573112905025,
        0.017691807821393013,
        -0.031020814552903175,
        -0.02740073762834072,
        0.054930783808231354,
        0.04432301968336105,
        0.025380324572324753,
        0.021199991926550865,
        -0.05781807750463486,
        -0.07472559064626694,
        0.04662111774086952,
        0.07552926242351532,
        -0.0659763365983963,
        0.019230123609304428,
        0.13180698454380035,
        0.026170063763856888,
        -0.03402476757764816,
        -0.01571935974061489,
        0.0702885091304779,
        -0.07660074532032013,
        -0.0038761284667998552,
        -0.03631099313497543,
        0.0008666572975926101,
        -0.032451074570417404,
        -0.08630580455064774,
        -0.010231835767626762,
        -0.07351113855838776,
        0.031150469556450844,
        -0.01893530786037445,
        0.0201470497995615,
        -0.02686496078968048,
        -0.061035484075546265,
        -0.018255572766065598,
        -0.03054191917181015,
        0.04571524262428284,
        -0.0008794872555881739,
        0.03566731885075569,
        -0.09990377724170685,
        -0.004096104763448238,
        0.0333472415804863,
        -0.0719066634774208,
        0.02625405788421631,
        -0.04251883551478386,
        -0.030283529311418533,
        -0.04753391817212105,
        -0.06185978278517723,
        -0.004419891629368067,
        -0.07739254087209702,
        -0.057819947600364685,
        -0.0025422105100005865,
        -0.0044717248529195786,
        0.019426360726356506,
        0.03620624169707298,
        0.05289417877793312,
        -0.05079576000571251,
        0.016200555488467216,
        -0.014122100546956062,
        0.039055995643138885,
        -0.0034710040781646967,
        0.010642707347869873,
        0.03570374473929405,
        -0.0031646150164306164,
        -0.014405770227313042,
        0.0008492193883284926,
        -0.060702476650476456,
        -0.013608393259346485,
        0.08936168253421783,
        0.07511921972036362,
        -0.1057533323764801,
        -0.0009248252608813345,
        -0.0038920885417610407,
        -0.004697008989751339,
        -0.0362260602414608,
        -0.01749829761683941,
        -0.0662982240319252,
        -0.006989964749664068,
        -0.04050135985016823,
        -0.035386256873607635,
        -0.007493400014936924,
        0.014315448701381683,
        0.06516502797603607,
        0.038806211203336716,
        0.037640947848558426,
        -0.04845517873764038,
        -0.04624160751700401,
        -0.031044036149978638,
        0.09739759564399719,
        -0.053769372403621674,
        0.03919198364019394,
        0.053036950528621674,
        -0.06570158153772354,
        0.03755483031272888,
        -0.017160555347800255,
        0.048762764781713486,
        -0.0060451882891356945,
        -5.084793301681752e-33,
        -0.10065304487943649,
        0.027793223038315773,
        -0.006322316359728575,
        0.0911639854311943,
        -0.078549325466156,
        0.017444288358092308,
        0.09085611999034882,
        -0.016046687960624695,
        0.03608429431915283,
        -0.012454860843718052,
        0.012879547663033009,
        0.014319909736514091,
        0.006054155994206667,
        0.06055445224046707,
        -0.025831177830696106,
        0.0066088424064219,
        0.008294639177620411,
        -0.1130346730351448,
        0.03908570110797882,
        -0.06286313384771347,
        -0.0005379579961299896,
        -0.03233719244599342,
        -0.09758146852254868,
        0.055112697184085846,
        0.09300487488508224,
        0.010255513712763786,
        -0.05733760818839073,
        -0.05028214305639267,
        -0.008023320697247982,
        0.0446491613984108,
        0.0042940424755215645,
        0.05135394260287285,
        0.04645788297057152,
        -0.0025424198247492313,
        0.03855932503938675,
        0.07821705937385559,
        0.011746583506464958,
        -0.04022405296564102,
        0.04268565773963928,
        -0.02046094834804535,
        -0.025825556367635727,
        -0.011192635633051395,
        0.04731142148375511,
        0.035138197243213654,
        0.08043795824050903,
        0.11756604164838791,
        -0.017311235889792442,
        0.03605369105935097,
        -0.01105684693902731,
        0.025340450927615166,
        0.07153750956058502,
        0.016414713114500046,
        -0.011171862483024597,
        -0.0456373430788517,
        -0.09149373322725296,
        -0.07613976299762726,
        -0.04773706570267677,
        -0.0036090684588998556,
        -0.0643039345741272,
        0.023041056469082832,
        -0.027821136638522148,
        0.0037027287762612104,
        -0.1381518393754959,
        -0.011352608911693096,
        0.020834170281887054,
        0.05589480698108673,
        0.026201726868748665,
        0.005268467590212822,
        -0.07799637317657471,
        -0.05170948803424835,
        0.008325407281517982,
        -0.012086912989616394,
        -0.05614905804395676,
        -0.08052951097488403,
        -0.06151347979903221,
        0.06320444494485855,
        0.15369553864002228,
        0.07876625657081604,
        -0.06531406193971634,
        -0.0009931080276146531,
        0.015107009559869766,
        0.10017336905002594,
        0.05214715749025345,
        -0.10023869574069977,
        0.028868623077869415,
        0.02847161889076233,
        0.007160165812820196,
        0.0008893173653632402,
        -0.10762927681207657,
        -0.04382483661174774,
        -0.030427727848291397,
        -0.03654447942972183,
        -0.10270439833402634,
        0.045727215707302094,
        0.02227763459086418,
        -5.799617142088209e-08,
        0.009794706478714943,
        0.0025072419084608555,
        -0.08629515022039413,
        0.04931933432817459,
        0.07839999347925186,
        0.026241471990942955,
        0.06389448046684265,
        0.02514914609491825,
        0.05256570875644684,
        -0.01147803757339716,
        -0.016501344740390778,
        -0.004113735631108284,
        -0.10416197776794434,
        0.050110410898923874,
        0.05096101388335228,
        0.061049722135066986,
        -0.12450937181711197,
        -0.03957398608326912,
        0.014341248199343681,
        0.0247842725366354,
        0.034970473498106,
        0.015234794467687607,
        0.026700671762228012,
        -0.03227244317531586,
        0.040021635591983795,
        0.05610588937997818,
        0.01735980249941349,
        0.03448540344834328,
        0.0032052143942564726,
        0.071485735476017,
        -0.08916445076465607,
        -0.029730716720223427,
        -0.07144684344530106,
        -0.036948684602975845,
        0.020056845620274544,
        -0.05885741487145424,
        -0.0006499103619717062,
        0.024994857609272003,
        -0.005035265814512968,
        0.002967089880257845,
        0.03656334802508354,
        0.029563704505562782,
        0.023110071197152138,
        -0.01805746927857399,
        0.03590547665953636,
        0.06510891020298004,
        -0.08119264245033264,
        0.039091091603040695,
        0.06290547549724579,
        -0.0987519919872284,
        -0.06083109974861145,
        -0.052629563957452774,
        0.06646349281072617,
        -0.0008286535739898682,
        0.042397283017635345,
        -0.07297622412443161,
        0.07504269480705261,
        -0.06038633733987808,
        -0.0632895827293396,
        0.020873449742794037,
        0.057581644505262375,
        -0.027211841195821762,
        -0.017662731930613518,
        0.04075045883655548
    ]
}