{
    "id": "seoaDLWuHtU",
    "title": "I Need a Home Theater PC... NOW! - NVIDIA RTX HDR",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-03-28T17:32:52Z",
    "video_url": "https://www.youtube.com/watch?v=seoaDLWuHtU",
    "category": "Science & Technology",
    "tags": [
        "NVIDIA",
        "RTX Video HDR",
        "HDR",
        "scRGB",
        "sRGB",
        "Super Resolution",
        "Windows 11 Auto HDR",
        "Xbox Series X Auto HDR",
        "Color",
        "Contrast",
        "Brightness"
    ],
    "views": 1233312,
    "likes": 37519,
    "comments_count": 1959,
    "description": "Thanks to MANSCAPED for sponsoring today's video. Get 20% Off + Free International Shipping with promo code TECHTIPS or visit   Try Pulseway FREE today, and make IT monitoring simple at:   NVIDIA's latest feature allows you to watch SDR content in HDR, like old movies and shows that never got remastered. But upmapping isn't always easy, so have they gotten it right? Come check out RTX Video HDR and see for yourself.  Discuss on the forum:   Buy an NVIDIA GeForce RTX 2060 on eBay:  Buy an Alienware AW3225QF 32\" QD-OLED 4K 240Hz Gaming Monitor:  Buy a Fractal Terra Mini-ITX PC Case:  Buy an AMD Ryzen 5 3600X CPU:  Buy a Gigabyte X570 Aorus Pro WiFi Motherboard:  Buy Crucial Ballistix 3200MT/S CL16 DDR4 16GBx2 RAM:  Buy a Noctua NH-L9A CPU Cooler:  Buy a Cooler Master V850 80+ Gold PSU:  Buy a Kinston NV2 NVMe M.2 1TB SSD:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:20 SDR Movies 4:45 Live Action 8:45 HDR vs RTX Video HDR 11:50 How? 14:00 Alternatives 15:14 Doom Eternal 18:10 Crysis 19:18 Conclusion 22:00 Outro",
    "description_links": [
        "http://manscaped.com/techtips",
        "https://lmg.gg/LTT23",
        "https://linustechtips.com/topic/1564595-i-need-a-home-theater-pc-now-nvidia-rtx-hdr/",
        "https://ebay.us/kpF2cr",
        "https://lmg.gg/u3Sd6",
        "https://geni.us/1anRr",
        "https://geni.us/1BA41",
        "https://geni.us/cl8m",
        "https://geni.us/dXjaz",
        "https://geni.us/lZA7F2",
        "https://geni.us/1kSgdJy",
        "https://geni.us/CPCb3",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "It sucks when you buy into the latest technology only to wait years for the content to catch up and if you have an HDR display you know exactly what that feels like. Obscure anime, old tv shows, cult classics, great movies the studio just didn't love enough. Forget about it. Now, there are solutions to convert SDR to HDR, like this one from AJA, but $2,000? I could get an RTX 2060 for a tenth of that price on eBay, and according to NVIDIA, it can do the same thing, which means they finally did it. What Intel and Microsoft failed to do 20 years ago. NVIDIA has given the home theater PC its killer app, but there's got to be some kind of catch. Okay, but does it spike power consumption like RTX Super Resolution? It's got to look awful, right? Is it full of artifacts like when DLSS first came out? You're just gonna have to wait to find out, Linus. Uh, fine. Can I at least tell them about our sponsor? Okay. Pulseway. Make remote monitoring and managing your IT systems easy with instant alerts, auto remediation, and real-time updates, all from one platform, anytime, anyplace, on any device. Start your free trial today with the link down below. When Nvidia recently announced their new Nvidia app, we assumed that they would move the RTX video HDR toggle into that alongside the beta that now works with games. But instead, no, it is still buried in the old Nvidia control panel. But the good news is that toggling it is as simple as click on, click off. Plouffe suggested we start with Wicked City, an anime from 1987 that looks like it's from 1987. This is pretty a little bit right, dude. Anyway, that's not what we're here for. We wanna see how our HDR toggle is going to impact the... Oh. Well, that really is something, isn't it? That flatness in the clouds in the sky. Yeah, it just gives it so much more depth, kind of brightens up the whole image, which I think looks good here. Yeah, it looks really flat without HDR, and all of a sudden... It's like you see more detail too, right? This won't be the last time we touch on this, but... That may not be the artist's intent. That may be the artist's intent, but as a viewer, I know which one I would choose. Even I like this one better too. And I tend to stick with artist's intent. Right, just like kind of a purist. This is even better. Okay, hold on a second. I haven't even toggled it yet, but yeah. Oh, the way that the night lights pop. Just looks kind of brighter and bluer here. It's lifting up some of the low lights, which has the benefit of allowing us to see more details. But honestly, in the bar scene, I feel like it's taking away from the mood a little bit. Yes, and that's kind of my issue with doing up mapping, especially with some of these dark scenes. The original grade is smoky and hazy and kind of gloomy, whereas this is bright. It's very colorful. Yes. Poppy. Next up, we've got Phil Tippett's \"Mad God,\" a stop motion film from 2022 that suffers from the long night syndrome and doesn't have an HDR version at the moment. Whoa, okay. That is, wow, those lightning flashes though with the HDR toggle on, huge difference. First lightning flash, eh, eh. Okay, it's on. Whoa, that's lightning. Now the color changed a lot here. Yeah, the background went to like a blood red. On, off, on. That's changing the colors a lot. Yeah, see, I don't like that over-saturation. It changes the mood of that scene, right? It really does. However, the effects, boy, does it ever make them pop. Oh yeah, that looks good. So you can see, you can really see when it toggles. You don't even have to check. It's like, oh yeah, yeah, yeah, yeah. I just need every movie to have a proper HDR grade because it's clear, even with this faux HDR, how it could look. Without HDR, the specular highlights on a slimy monster, they don't look like slime. They just look like, I don't know, smooth. Yeah. Tell me this though. Okay, you've never seen the original grade. How pleasing is this to the eye? It's colorful. I like it. Do you like it? Well, I don't know what the heck's going on in the scene. I like the colors. Oh, the highlight's so much better. Just look at that. You can really make out that detail right in the center of those specular reflections. It looks like a shining light. We're off to a really great start. Aside from some minor quibbles about color saturation and the mood, there's no question that I would choose RTX video HDR over vanilla for everything we've seen so far. Except, everything we've seen is two pieces of content and none of it included live- action. Here's the thing. A compelling use case for this tech, like with their RTX Super Resolution upscaling, is streaming. So whether you're watching someone game or drop expensive technology on your screen, now you can make just about everything pop a bit more. And as you're about to see, it's not all sunshine and rainbows. Here's a recent video that we didn't upload in HDR. Or did we? Ah, the sunlight glinting off the garage door back there. Oh, wow, it really messes up some things. Like white texts. I mean, oh, wow, oh, wow. Some of this is okay. I mean, these are people that I know, obviously. This is Maria and Olamide. It actually adds a little bit more lifelikeness to them. Like, look at Maria, particularly. Oh, yeah, yeah. Like, you can kind of make out the . Shape of her face a bit better, right? Once it's turned on. You know, we were supposed to observe that with lighter skin tones, it gives a bit of a shiny, greasy look, but I guess I'm maybe not affected as much as some others. Looks all right. I think it really just depends on how greasy your skin is, to be honest. Everyone is going a bit rosy and orange, but it's not like absurd. It just looks a bit warmer. Dude, overall, I think I just generally prefer it for this. Oh my God, look at her necklace. That's yellow. That's metal. You can just see like the specular reflections off of it. Like Olamide's ring pops more. Okay, here, here, here, look, I'm right here. Yeah. So not HDR. Okay. HDR. Go again. Go again. Ooh. It's honestly not that different. Like I think your actual skin tone is right in between the two of them. I think you look slightly paler in SDR and then slightly too. Oversaturated in HDR. So if we're gonna be inaccurate anyway, which of these images would you take? Oh, definitely the HDR. All right, let's find some sweaty, greasy looking people here. You know what? In this case, yeah, you're definitely getting a little bit more glisten. It just gives it a bit more depth. It doesn't feel in an unnatural way. Yeah. I mean, he's sweaty as hell. And there's a ton of lights in that. Ooh, those lights just kind of. Yeah, I like it. It's a weird fall off, 'cause you're going from like pure white to like the shine around it. That's what the court lines look like, I'll tell you that much. Look at his towel. They don't look like that. Okay, the towel's a bit much. Yeah. That's a shiny towel. Yeah, the court lines. That's a bit much, actually. They look unnatural. Yeah, that's clearly not right. If we weren't toggling back and forth and we weren't thinking about it, I would feel like those court lines have almost a reflective element to them. Yeah. In person, they don't. Honestly, the only thing that's standing out to me is that towel in the left corner. That towel's like unnaturally bright. Yeah, God's towel. I like it. I just don't wanna have to use the Plex web interface in order to enjoy it with my media library. So if this worked with the app or was built into the Shield or something, like, I'm ready right now. I'm mixed. I think watching it now, I've kind of grown into it, but I don't know. I still have to look at more things for me to like decide. And it's going to be the same for you. But what I will say is aside from some quirks, it works pretty well. However, we haven't compared it to proper HDR mastering yet. Are reptile brains just being tricked by more brightness and color? Just like if we were shopping at a Best Buy. To find out we're going to use some of our own footage from my giant TV video. I've been told that one of these files is HDR and the other is SDR masquerading as HDR using Nvidia's tool. That's fake. Oh they're not going to tell me yet. It's good. But it's fake. You're right. I know I'm right. Yeah. In some ways the image is a little more pleasing but look at this. I'm pink. Whoops. It's too bad. I wanted it to be perfect but obviously a properly graded piece of content is gonna pop where it's supposed to. Like this content behind me looks almost identical but is also going to retain the natural look of someone who is backlit and not forelit whereas I'm just, I'm just lit. Why am I so flushed? Is it like drinking? James looks better here though. And that's interesting. Is Nvidia making assumptions through the selection of their training data about properly lit people? So is this kind of like, you know, taking the studio mode of your selfie camera and applying it to any content that you watch? In fact, Now that I'm lit properly, it's far less noticeable. See, in this dark shot, I look more lifelike, whereas this is more reflective of the fact that I have no light on me. Damn, that is really close. This is a very impressive example. If I didn't know that that's a bit too much brown for my couches, I would probably take that image. You're right, it's very close. Like, the display is basically the exact same here. I actually think that the pinpoints on our light sources in the room look a little more convincing in the NVIDIA version. Of course, we're not using exactly the same display, so there is a little bit of variation there, but. There's some banding here. It's like very little banding there. Oh, you're right. Well spotted. I didn't see that. That's ugly. Oh, wow, interesting. Now that I know what I'm looking for. This is a much more egregious example of what Brandon just pointed out, where that brighter object was clearly manipulated in a way that lost some of its original quality. Look at this compared to this. There's a subtle difference in glow on the track from maybe the headlights? What the F* is this? I'm still very torn. Looks pretty good. Handled this white background actually really well. Yeah, I noticed in the video they do a good job for the most part at recognizing when something's like a white screen and not like blowing it up. Some of these look more lifelike on the Fake one, which is very interesting. So, how the heck are they doing this? The first step is they expand the color gamut from sRGB to sCRGB using a transformation matrix. I can practically hear you saying, \"sCRGB?\" I wasn't familiar with it either. Kind of a weird color space, but their use of it here makes a lot of sense. Just like it makes sense to go with a Honeywell PTM 7950 thermal pad for your next build, now available for a reasonable price from a reliable source, lttstore.com. sCRGB is compatible with regular sRGB, but uses 16-bit floating point to calculate a massive dynamic range compared to 8-bit integer on sRGB, all while using the same white and black points. So in total you end up with 281 trillion possible colors compared to the 16.7 million of sRGB. Now when I say possible colors, that's because we can't actually see a lot of them, making sRGB completely overkill for actually displaying anything. Modern panels don't have 16-bit control over their pixels, let alone the ability to reproduce trillions of colors. But what it's great for is internal rendering and mathematical computation. So with that background in mind, RTX HDR kind of works like DLSS upscaling, where NVIDIA is taking an image, blowing it up, then using machine learning to fill in the gaps. It's the same idea here, just with color and light. So to train their model, they analyze a ton of content, ideally in both HDR and SDR, then they take that converted SCRGB frame, they apply their denoising algorithm, and then they convert it to BT2100 HDR using that AI model to output a finished frame that brightens or dims specific spots in a scene, or saturates colors to help them appear more vivid, ideally without it looking like a Best Buy demo. It's really cool. It also isn't really new. Windows 11 Auto HDR has been doing something kind of like this for SDR games for quite a while now, often with decent results as long as you've completed Microsoft's calibration process. It's also been a thing on the Xbox Series X for a few years and it can really make those older games pop. All of a sudden, bright flashes are hitting about a thousand nits and they actually flash instead of just waiting at you. Of course. All of this assumes that the display that you're using can reach that luminance level and display it accurately. I've complained a lot on this channel about the HDR displays that are more like HDR-ent because while their base is certified and they can interpret an HDR signal, their backlight and panel technology just aren't good enough to make much of a difference compared to watching something in an SDR. With all of that out of the way then, what about Games, where the competition is tighter for Nvidia's new hotness. To investigate, we've grabbed a couple of the latest QD OLED panels and we've upgraded our modest home theater PC with a second near identical computer for our second monitor. By the way, we'll have links to all of this stuff down below if you're looking for PC parts or maybe a new monitor. Ooh, look at that green, that saturation on the green. Okay, here, let's look at shiny boy here. Oh yeah, yours looks so much better. Okay, hold on, let me just go. Okay, or we can shoot the shine. Oh, okay, yeah. Well, the shine still looks good, even without. Oh, come on. It still looks pretty decent. Yeah, it's all relative. I know. Decency is relative. These fireballs. Oh, the flashes on the fireballs from the imps? Not even close. What we're comparing right now is real HDR to SDR, but that's not what we're supposed to be comparing. Why don't you go ahead and turn on RTX HDR? Yeah. I can actually see the appeal. Of the RTX HDR version of this. Yeah. If you're into a really poppy, contrasty look, it's great. And guess what most people tend to prefer, whether it's correct or not. I know. They want brightness, they want contrast, they want color. And that's kind of what we're getting here. I honestly, I'd probably turn it on. Even here, I think it looks a little better than the actual native Doom HDR. Setting. I mean, the native Doom HDR is pretty good though. It's pretty good. Man, that is really poppy though. It's fun, you know? Yeah. There isn't a major impact on the visibility of dark regions or anything like that. Okay, what's next? Windows Auto HDR versus RTX HDR. Oh, okay. This does not look very good. No. No, I agree. No? It just doesn't have that poppy contrast. It doesn't even look as good as the HDR implementation. Yeah, it doesn't. Like the Nvidia one is taking it even further. Yeah. This one is like not taking it as far. It's very dull. Like look at the candy that pops out of the enemies is not glowy. No. Like this stuff looks okay, the flashing, but that looks decent in SDR anyway. Yeah, this does not look a lot better than SDR to me, if at all. Right? I don't think I would turn this on in this game anyway. It does make a lot of non-HDR games pop a little more. Especially games who never got, like, they're older, like, 2010 and earlier than that. For example, I play a lot of Dota with Windows HDR turned on, and not much, you know, but when you, like, get the big match-accepted screen, there's, like, all these flashes of light, and it looks pretty good, but I'm gonna probably turn RTX HDR on at home. What's inconvenient is that every game's implementation is going to either be best with... Auto HDR, or best with RTX HDR, or best with the game's native HDR, and switching between those is sort of a pain in the butt. Oh yeah, this took a while to get working perfectly. Right, like some games, for example, don't allow you to calibrate the brightest point according to the capabilities of your display. You're gonna end up with all these blown out clipped messes. So RTX HDR might be way better. Whoa, that sun! Oh man. It's such a small part of the scene, but it makes such a difference. It really does. Interesting. Okay, okay, it's catching these lights on the little dish tower here. Oh shoot, the balls. Forgot this game is really hard. Yes. The muzzle flash is wild. Yeah, those muzzle flashes almost look like stormtrooper shots. Yeah. Like they're so bright. Okay, not gonna lie, pretty cool. It's actually really not that overdone either, though. No. Man, that glint off the water, too. Bleh, bleh, bleh, what's the, I can't remember. I can't remember. I haven't played Crysis in 15 years. Bleh, bleh, bleh, bleh, bleh. I keep expecting to slide if I sprint and crouch. No, no, man. Pre-slide era. There's the old game. Just like Super Resolution, this is pretty cool tech, but it comes at a cost. It doesn't use up nearly as much power as the upscaling tool, but it does consume a not insignificant amount, and it's still in beta, so there are some bugbears. For example, the video HDR doesn't work on DRM-protected content. At least not yet. And the game HDR doesn't work if you have dual monitors. At least not yet. I have a wild theory that Nvidia is basically waiting for Nintendo to launch the Switch 2 before they will launch the Shield Pro 2. And all of this software development is happening very rapidly right now because they're gearing up for the release of the Shield Pro 2. I mean, think about it. The original Switch and the original Shield Pro, which will be very similar in terms of hardware, and Nvidia has seemingly been due to release a successor to that damn thing for years! And man, with some of the recent advancements we've seen, RTX HDR, Super Resolution, I can see the Shield Pro 2 being a killer box. Not just for watching video, right? I mean, you know, obviously this is great for that. But think about it for streaming. Games, man, de-blocking all those compression artifacts, just converting to HDR on the local side so that they don't have to send all that additional information over your internet connection. I'm excited. And I'm also excited to see more solutions for using HDR displays with content that doesn't necessarily natively support it, even if it's not perfect today. And hey, back to what we were talking about before. If I'm wrong about the Shield Pro 2, maybe at long last, the home theater PC will be a thing again, and you will all rue the day you mocked me for keeping my Windows Media Center Edition remote. Rue it, I say! Just like you'll rue asking me about our sponsor. Manscaped. If you're feeling a little overgrown, trim your hedges the manly way with Manscaped's Lawn Mower 5.0 Ultra. Its trimmer blade and foil blade are interchangeable, letting you choose from 5 o'clock shadow bald to... Oh, what? You need a mirror? Here's my head instead, bald. And to navigate through those more voluminous spots, the Lawn Mower 5.0 Ultra even comes with an LED light, so you can see right through the shrubbery. It's also portable and charges conveniently with a USB-C cable, meaning you can whack the weeds anywhere you might be. With a charger you probably already have. Check out the Lawn Mower 5.0 Ultra at manscaped.com slash tech tips, and use code tech tips for 20% off and free shipping. And yeah, it comes with its own charger. Didn't want to imply the opposite. If you guys enjoyed this video, make sure to check out the one about Nvidia's upscaling technology, RTX Super Resolution. It's also really cool.",
    "transcript_keywords": [
        "HDR",
        "RTX HDR",
        "Yeah",
        "RTX video HDR",
        "RTX HDR kind",
        "RTX Super Resolution",
        "RTX",
        "NVIDIA",
        "Auto HDR",
        "video HDR",
        "turn RTX HDR",
        "bit",
        "RTX HDR version",
        "HDR toggle",
        "kind",
        "Shield Pro",
        "RTX Super",
        "SDR",
        "good",
        "Super Resolution"
    ],
    "transcript_entity_values": [
        "about a thousand",
        "Bleh",
        "one",
        "Crysis",
        "second",
        "Shield",
        "Phil Tippett's",
        "Honeywell",
        "Windows",
        "Windows 11 Auto HDR",
        "first",
        "eBay",
        "20 years ago",
        "Brandon",
        "2010",
        "2022",
        "2,000",
        "USB-C",
        "2060",
        "trillions",
        "First",
        "AJA",
        "1987",
        "Olamide",
        "Manscaped",
        "RTX Super Resolution",
        "DRM",
        "Windows Auto",
        "281 trillion",
        "DLSS",
        "PTM 7950",
        "SDR",
        "today",
        "NVIDIA",
        "16",
        "the Switch 2",
        "16.7 million",
        "Plouffe",
        "5 o'clock",
        "Shield Pro",
        "the Shield Pro 2",
        "the Xbox Series X",
        "Plex",
        "the Lawn Mower",
        "James",
        "years",
        "a ton",
        "Maria",
        "8",
        "AI",
        "Lawn Mower",
        "a tenth",
        "15 years",
        "20%",
        "Switch",
        "Super Resolution",
        "5.0",
        "Nvidia",
        "Nintendo",
        "Linus",
        "Mad God",
        "a few years",
        "the Lawn Mower",
        "Microsoft",
        "the long night",
        "Intel",
        "two",
        "the Shield Pro 2",
        "Wicked City"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "LAW",
        "EVENT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "FAC",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "GPE"
    ],
    "vector": [
        -0.0038816893938928843,
        -0.03273409232497215,
        0.03599449247121811,
        -0.06571665406227112,
        0.033652957528829575,
        0.04001094028353691,
        -0.09496630728244781,
        -0.03126753494143486,
        -0.035890087485313416,
        0.00869337935000658,
        -0.07427484542131424,
        0.014732538722455502,
        -0.008300453424453735,
        0.001810495276004076,
        -0.005386208649724722,
        -0.0114418501034379,
        0.08831192553043365,
        -0.11384464800357819,
        -0.004205170553177595,
        -0.04145266115665436,
        -0.06223045662045479,
        -0.07217897474765778,
        -0.042883504182100296,
        -0.0446389764547348,
        0.029885265976190567,
        -0.02524086833000183,
        0.06449438631534576,
        0.014434659853577614,
        0.004573474638164043,
        -0.018460923805832863,
        0.06378445029258728,
        0.035893503576517105,
        -0.009391127154231071,
        -0.0028188424184918404,
        -0.05147942900657654,
        -0.07516215741634369,
        0.06916780024766922,
        -0.0886051207780838,
        -0.025446748360991478,
        -0.07002642750740051,
        0.018972361460328102,
        -0.03725654259324074,
        -0.06229603290557861,
        0.07330171018838882,
        -0.017734505236148834,
        -0.06423915177583694,
        0.015198890119791031,
        -0.03654259070754051,
        0.040455132722854614,
        0.01906302571296692,
        -0.04541600123047829,
        -0.044860634952783585,
        0.05444392189383507,
        -0.025916926562786102,
        -0.06034470722079277,
        0.09424343705177307,
        -0.047796498984098434,
        -0.11119291186332703,
        0.028026405721902847,
        -0.05533312261104584,
        0.0718851312994957,
        -0.15812310576438904,
        0.03776862472295761,
        0.03287557512521744,
        -0.014112360775470734,
        -0.03982263803482056,
        0.005848943721503019,
        0.016403861343860626,
        0.07125373184680939,
        0.04111986234784126,
        -0.08421019464731216,
        0.03302454203367233,
        0.03951962664723396,
        0.0009450846700929105,
        -0.0075396765023469925,
        -0.048340413719415665,
        0.017227597534656525,
        -0.10719595849514008,
        0.022848889231681824,
        0.031046025454998016,
        -0.009798451326787472,
        0.024324795231223106,
        -0.03377138450741768,
        -0.0018551683751866221,
        0.022502616047859192,
        0.01813565008342266,
        0.08012087643146515,
        0.017214428633451462,
        0.03681815043091774,
        -0.08240704238414764,
        0.033556073904037476,
        0.04730053246021271,
        0.08943609893321991,
        -0.0010647703893482685,
        0.0008197143324650824,
        -0.013593603856861591,
        0.005473824683576822,
        -0.022617405280470848,
        0.04560421407222748,
        0.006352560594677925,
        0.038382869213819504,
        -0.023226073011755943,
        0.0404835045337677,
        0.005918340291827917,
        -0.1081366240978241,
        -0.04447703808546066,
        -0.05887525528669357,
        0.13418850302696228,
        -0.06447783857584,
        0.009906267747282982,
        -0.07198341935873032,
        0.07474217563867569,
        -0.0022227505687624216,
        0.055371444672346115,
        0.0010586243588477373,
        0.03452405706048012,
        -0.03809089958667755,
        -0.008682051673531532,
        0.04702422022819519,
        -0.03995557129383087,
        0.03855785354971886,
        -0.11371364444494247,
        -0.01465595792979002,
        0.00566951185464859,
        0.13282561302185059,
        -0.015835965052247047,
        -0.03210720419883728,
        1.3747031744042328e-32,
        -0.012462248094379902,
        0.09433605521917343,
        -0.07987586408853531,
        -0.04653215408325195,
        -0.007985633797943592,
        0.09530254453420639,
        0.04919412359595299,
        0.05899106711149216,
        -0.0023882966488599777,
        0.040323272347450256,
        0.01845879666507244,
        -0.008077014237642288,
        -0.05129814147949219,
        0.01399001944810152,
        -0.005401537287980318,
        -0.052513569593429565,
        -0.0595170333981514,
        0.05399731546640396,
        -0.06592242419719696,
        0.02314208634197712,
        0.02223115600645542,
        0.012557589448988438,
        -0.028499092906713486,
        -0.03220795840024948,
        -0.08268272876739502,
        -0.01634962297976017,
        0.02268175594508648,
        -0.0022423744667321444,
        0.10226341336965561,
        -0.03200777620077133,
        0.007424516603350639,
        -0.09806063026189804,
        0.004593623802065849,
        -0.01752534508705139,
        0.06581998616456985,
        0.014852185733616352,
        -0.04795031249523163,
        0.0007483210065402091,
        -0.06840900331735611,
        -0.0054438766092062,
        0.002482517622411251,
        0.11717715114355087,
        -0.0632588341832161,
        -0.04015325382351875,
        -0.03622014448046684,
        0.028120890259742737,
        0.03811228647828102,
        0.01089626457542181,
        -0.039931826293468475,
        0.059670209884643555,
        -0.031222978606820107,
        0.0695914477109909,
        -0.03531143069267273,
        -0.029440617188811302,
        0.028550071641802788,
        0.01689937897026539,
        0.01666526310145855,
        0.015841476619243622,
        0.08101502060890198,
        0.06028539314866066,
        -0.03753366693854332,
        -0.07189060747623444,
        0.0004948364803567529,
        -0.004467746242880821,
        -0.0513092465698719,
        0.04208347573876381,
        0.126440167427063,
        -0.01688491553068161,
        -0.07975514978170395,
        0.06750539690256119,
        0.07219918817281723,
        0.013429710641503334,
        0.05277176946401596,
        -0.00957683939486742,
        0.09629346430301666,
        0.029423773288726807,
        -0.09181368350982666,
        -0.025593256577849388,
        -0.018785949796438217,
        -0.07534376531839371,
        -0.04107514023780823,
        -0.0003973701095674187,
        0.03277633711695671,
        0.08997906744480133,
        0.019570982083678246,
        0.007193456869572401,
        -0.04163007810711861,
        0.045184649527072906,
        0.011238529346883297,
        0.009140310809016228,
        -0.035276859998703,
        -0.03830448538064957,
        0.008090893737971783,
        0.05470758303999901,
        -0.010637243278324604,
        -1.0437080628468685e-32,
        0.06180405616760254,
        -0.07775591313838959,
        -0.017558107152581215,
        0.039195988327264786,
        0.02156396023929119,
        -0.016515495255589485,
        0.012378707528114319,
        0.05043167248368263,
        0.09329970926046371,
        -0.08683683723211288,
        0.08121771365404129,
        0.03746272996068001,
        -0.024270525202155113,
        0.08858241885900497,
        -0.03029032051563263,
        -0.04113131761550903,
        0.061489447951316833,
        -0.08565906435251236,
        -0.009349199943244457,
        -0.01714480295777321,
        0.018229680135846138,
        0.033334795385599136,
        -0.026294870302081108,
        -0.020705509930849075,
        0.0053308866918087006,
        0.07259631901979446,
        0.0523800291121006,
        0.055741820484399796,
        -0.006047654431313276,
        0.01917276345193386,
        -0.020025646314024925,
        -0.06053457781672478,
        0.0023718499578535557,
        0.011828569695353508,
        0.07136750966310501,
        -0.0013303238665685058,
        0.11983388662338257,
        0.0079813152551651,
        -0.040631528943777084,
        -0.0016822112957015634,
        0.025310246273875237,
        0.09321760386228561,
        0.0033205202780663967,
        -0.008452711626887321,
        0.01134556531906128,
        0.00403272220864892,
        -0.025646792724728584,
        -0.048601873219013214,
        0.03425164520740509,
        0.05520095303654671,
        -0.040666598826646805,
        -0.0107190553098917,
        0.06569843739271164,
        -0.04904533922672272,
        -0.008717377670109272,
        -0.06188978627324104,
        -0.001090241246856749,
        0.04680357873439789,
        0.04341442137956619,
        0.01869906485080719,
        0.011239568702876568,
        0.08299347013235092,
        -0.06588072329759598,
        -0.01204688474535942,
        -0.0007832598057575524,
        -0.031040716916322708,
        0.006384206935763359,
        0.05390610173344612,
        -0.014281746931374073,
        0.036283981055021286,
        -0.07443362474441528,
        -0.02669849433004856,
        -0.01283878181129694,
        -0.04108119755983353,
        0.017699258401989937,
        0.016809891909360886,
        0.0308357086032629,
        -0.006485560908913612,
        0.08808929473161697,
        -0.010609910823404789,
        -0.07159274071455002,
        -0.056011028587818146,
        0.02542932704091072,
        -0.002083170460537076,
        0.08988699316978455,
        0.017220400273799896,
        0.020231060683727264,
        -0.032618314027786255,
        0.035770319402217865,
        -0.028286274522542953,
        -0.013663227669894695,
        0.024311989545822144,
        -0.041415974497795105,
        0.015047334134578705,
        0.05435521528124809,
        -5.593713581220072e-08,
        0.016040492802858353,
        -0.04687589406967163,
        -0.04197071120142937,
        0.06096551939845085,
        -0.05363607034087181,
        -0.10114677250385284,
        0.031204694882035255,
        -0.023769307881593704,
        0.05726682394742966,
        -0.04394853115081787,
        0.06054987758398056,
        -0.09025228768587112,
        -0.027588119730353355,
        0.01652265340089798,
        -0.018150420859456062,
        -0.03572436794638634,
        0.029101338237524033,
        0.06316659599542618,
        -0.047303456813097,
        -0.04838976636528969,
        -0.022206684574484825,
        0.032859884202480316,
        0.10803186148405075,
        -0.01244511641561985,
        0.012063036672770977,
        0.09710290282964706,
        0.042250845581293106,
        -0.02788747102022171,
        0.07437211275100708,
        -0.07116475701332092,
        -0.07550841569900513,
        0.04883068799972534,
        0.037809066474437714,
        -0.00045310816494747996,
        0.0863313376903534,
        -0.036076031625270844,
        -0.00426100566983223,
        0.08921035379171371,
        0.11406924575567245,
        0.026952126994729042,
        -0.002364291111007333,
        -0.060368482023477554,
        -0.13479115068912506,
        -0.05536724254488945,
        0.026631329208612442,
        -0.03811432048678398,
        -0.062143485993146896,
        -0.1206786185503006,
        -0.008556950837373734,
        -0.005151345394551754,
        -0.0087320227175951,
        -0.012909915298223495,
        -0.03181065246462822,
        -0.04950409010052681,
        0.07038403302431107,
        -0.0005405072006396949,
        0.015447842888534069,
        0.08298282325267792,
        -0.017858272418379784,
        0.09311563521623611,
        0.05578940734267235,
        -0.06003879755735397,
        -0.09043612331151962,
        0.038229964673519135
    ]
}