{
    "id": "shpK1Gjvnuo",
    "title": "HUGE Microsoft Flight Simulator Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-08-20T18:58:02Z",
    "video_url": "https://www.youtube.com/watch?v=shpK1Gjvnuo",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Microsoft flight simulator",
        "gaming",
        "pilot",
        "training",
        "los angeles"
    ],
    "views": 760118,
    "likes": 25584,
    "comments_count": 3068,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- So Microsoft sent me an email and said, \"Hey, we have a Flight Simulator kit for you. Would you like to receive it?\" and I could not type \"yes\" fast enough. The kit arrived. I have absolutely no idea what's in here so we're gonna just open it up. This feels like one of those old school unboxings where I actually have absolutely no idea what is in this. (box rustles) Oh my god. Oh god. This is so (box thuds) much bigger than I thought it was gonna be! Am I even in the frame?! Hello?! Do I need to zoom out on this? Oh my god! It's ridiculous. Okay, well I guess we are zooming out. All right, I guess I just start from the top. I love that they have little stickers all over the place of different destinations. (knife scrapes cardboard) (Justine sighs) (knife scrapes tape) You should never cut towards yourself. (tape tears) Can you see that? It says, \"Flight Simulator.\" How do I even show you what I'm doing?! We have a Logitech Throttle. You guys! (bubble wrap crackles) There's a Thrustmaster in here. I don't even know what that is. (box scrapes) Oh god it's so heavy. It's so heavy! Here's the first thing. It's a Flight Throttle Quadrant. \"Hey Justine, what did you do in quarantine?\" \"Learned to fly a plane. What did you do?\" The heck is this? (bubble wrap crackles) (box scrapes) (Justine exhales) (box thuds) Is this the black box that will record all of my flight data? Has anybody seen Lost? This is the Alpha Flight Controls; it's the Yoke and Switch Panel. (plastic rustles) What's in here? (plastic rustles) Are these flight sunglasses? Oh, they definitely are. \"We are so excited to have you in the Microsoft Flight Simulator community.\" (Justine gasps) The Flight Sim team has worked with our partners Logitech, and Honeycomb, and Thrustmaster to provide a few peripherals to improve your Microsoft Flight Simulator experience. Please reach out to your local rep with any questions with setup or otherwise.\" I think I can figure it out. This is incredible. So these are to help block blue light. I've actually been looking into getting a pair of these because the amount of time that I do spend on screens is just absurd. It's really not good. But these are kinda cute. Check this out. These look like my dad's, that he used to wear when I was younger. I'm definitely getting a real dad flashback here. My dad's gonna watch this and be like, \"Yeah, I had those.\" There's still something else in this box behind me that is awkwardly stabbing me in the back. All right. This is the Thrustmaster. (box rustles) (box thuds) Thrustmaster has been (box thuds) removed. (playful music) These glasses are so cool. I'm very much into them. I think the first thing that I will unbox... Are there directions or there is literally just... Any... Huh, interesting. The Yoke and Switch Panel is very important (box scrapes) when flying a plane. (box scrapes) I think I could wear this. (box rustles) If this isn't a definition of quarantine then I don't know what is. (box thuds) Honeycomb Aeronautical Flight Controls. So this is all extremely professional grade stuff. I think that this, this will make me a pilot. We're already here. We're already up! I gotta land this plane. Yoke should be preconfigured and ready to go. We have several new products in development, starting with (Justine mumbles inaudibly) (whispering) This is so exciting. This is so exciting. This is so exciting. We have instructions. (plastic rustles) So this looks like it's got a little sticky something so that doesn't move around when I'm flying my plane. (packaging rustles) Southwest is gonna be calling and saying, \"Hey...\" Oh my gosh! Oh! (plastic rustles) This is seriously, honestly, I can't even tell you. This is not what I expected. (plastic rustles) Oh! (clicks buttons) (dog barks in distance) Matty agrees. I have to set up a whole separate desk for this because this does not seem like... (box clatters) this doesn't seem like something that is gonna fit (Matty barks) in my current streaming area. This is so much more stuff than I thought! I have to figure out how to put all this together. (packaging rustles) I definitely opened it the wrong way, I think. (plastic rustles) Honestly, most planes, I feel like, potentially just fly themselves so at least I'll have the basics down. (plastic rustles) (controllers clunk) (plastic rustles) (plastic piece clatters) We've got one last thing to open. All right, Thrustmaster. Directions. Put you right here. (styrofoam squeaks) (box clatters) (styrofoam rips) Oh god! (mumbling) Have we fall, we've fall, I've fall, this fallen. (styrofoam scrapes) (box clatters) (styrofoam rustles) (whispers) Oh god. (styrofoam rustles) Thrustmaster's 'bout to thrust me into a new dimension unboxing this thing. I have not fallen. I'm just visualizing myself right now playing this. Okay! Guess I'll leave your Airspace ya pig! And how terrible I'm gonna be at it. (styrofoam clatters) (plastic rustles) (whispers) What? I'm gonna start hosting flight school. There we go. (plastic piece rattles) Okay, so we did that. Guess I have to figure out the rest of it now. (playful music continues) No problem! The Flight Sim is finally set up. I've done a few little livestreams. I also did a livestream where I put the webcam on my head so that you guys could see my point of view. (simulator engine whirs) Oh geez! Oh my god! - [in-game Announcer] Your speed's picking up again as the nose pitches down. Let's see what happens when you cut all the power. (simulator engine sputters) [in-game Announcer] Surprise, surprise. Your altitude is decreasing. - My engine! (engine sputters) Could I...? [in-game Announcer] This might be a good time for a piloting PSA. - What's that? [in-game Announcer] Always keep an eye on your surroundings because nobody likes a low-flying duck. - Is there a duck somewhere? Do a barrel roll? - [in-game Announcer] All right, let's go ahead and throttle back up. - All right. Bye! Bye! - [in-game Announcer] As long as we maintain attitude, our altitude will keep climbing too. (engine speeds up) - I know, I'm talented. Honestly - [in-game Announcer] You're really getting the hang of your control. - Yes, I am. (Justine laughs) (lighthearted guitar music) It was a little awkward. The webcam indented into my forehead and then I had a headache for two days. But that's okay! We're back. I've done some tutorials. I feel like I'm still not a good pilot but I appreciate all of the pilots out there who have been giving me some solid advice. This game is so much fun and it really adds a whole nother dynamic and another level to it when you have an actual setup like this. This is so crazy. So right now I'm gonna go through and we're gonna play! (sweeping inspirational music) So the problem is I've only done tutorials learning how to fly on a Cessna and then yesterday when I decided I wanted to do a flight in Pittsburgh, I don't even know what plane it put me in but it was huge. The instruments were all digital. I was overwhelmed. I'm still learning (giggling) but I'm confident, one day, if there's ever an emergency onboard a flight, I'm ready for it! I'm up to the challenge! Okay, so here's the Sydney Airport. Oh my god. This is a big boy! This is an Airbus A320neo! I've never flown one of these before! You can't just up and put me in a big boy! Okay, hold on a second. I gotta get my map up. (engine whirs) Okay, there's my map. I don't know where the airport is. - [in-game Announcer] Over speed. Over speed. Over speed. Over speed. (engine slows) Over speed. Over speed. - It's saying, \"Over speed.\" I don't know what that means. - [in-game Announcer] Over speed. Over speed. - Should I start going down? Okay, I see... - [in-game Announcer] Over speed. (engine slows) I can't even see any of my things. I am nowhere near. I'm gonna hit these houses. Oh my gosh! I'm not doing well. No! I've never flown one of these big boys before! (in-game beeping) We're takin'... We gotta go up. We gotta go up. Do we wanna...? - [in-game Announcer] 500. - Shoot! No! I did not do a good job. It's not good. It's not good. - [in-game Announcer] 200. - But I'll tell you what... - [in-game Announcer] 100. 60, 50, 40, 30, 20, arrived. (Justine inhales) (simulated plane thuds) - Shoot! Oh god! Okay. I'll tell you what, it was not a good landing, but any landing that you can walk away from, that's a good landing. (sweeping music) They also said that a fantastic landing would be if you can fly the plane. Here's the thing, I didn't know which runway I was supposed to go on. Does it tell me? So this is the rudders. This gives us some turn on the flight. This is the break. (engine whirs) Oh gosh, we're already here! We're already up! I gotta land this plane. It's pretty stressful. - (in-game Announcer) 400. - I'm not ready. I'm not ready. I'm nowhere near where I need to be. (Justine sighs) Uh-uh. I think I'm too close. - (in-game Announcer) 100. - I'm a little too close. I hope this is the right runway. (engine slows) No, no, no, no, no, no. God, oh god, oh god. - (in-game Announcer) 60, 50, 40, 30. - (whispers) Shoot. - (in-game Announcer) 20, retry. - Gah! (chuckles) (simulated plane rumbles) Ugh! (somber music) I failed again. This game is really fun but it feels like so much more than a game because it actually is teaching you to fly a plane. I'm gonna just leave it at this. I've been doing some livestreams of this if you guys wanna check it out. Check out my Twitch channel, twitch.com/ijustine and we're gonna play some more of this. I need tips to become a better pilot. I would appreciate those. Leave 'em in the comments below. (Justine giggles) Okay, bye. (lighthearted guitar music)",
    "transcript_keywords": [
        "Flight",
        "Microsoft Flight Simulator",
        "Flight Simulator",
        "god",
        "Flight Simulator kit",
        "speed",
        "Microsoft Flight",
        "Flight Controls",
        "plane",
        "Flight Sim",
        "Thrustmaster",
        "good",
        "Flight Throttle Quadrant",
        "Alpha Flight Controls",
        "Aeronautical Flight Controls",
        "Simulator",
        "Flight Simulator community",
        "Flight Simulator experience",
        "Flight Throttle",
        "Honeycomb Aeronautical Flight"
    ],
    "transcript_entity_values": [
        "500",
        "Logitech",
        "Alpha Flight Controls",
        "Thrustmaster",
        "Matty",
        "second",
        "Justine",
        "Honeycomb",
        "50",
        "30",
        "20",
        "Justine mumbles",
        "Airbus",
        "Switch Panel",
        "100",
        "The Yoke and Switch Panel",
        "the Sydney Airport",
        "one day",
        "The Flight Sim",
        "200",
        "PSA",
        "Cessna",
        "Pittsburgh",
        "Thrustmaster",
        "Microsoft",
        "60",
        "Southwest",
        "first",
        "Honeycomb Aeronautical Flight Controls",
        "40",
        "400",
        "two days",
        "yesterday"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE"
    ],
    "vector": [
        0.021385619416832924,
        -0.06919418275356293,
        -0.06314527243375778,
        -0.1050005778670311,
        0.03298041224479675,
        0.03432047739624977,
        -0.010828868485987186,
        -0.014750715345144272,
        -0.03889993578195572,
        0.07952553778886795,
        -0.0026296391151845455,
        0.009974165819585323,
        -0.03602838143706322,
        -0.03356221318244934,
        -0.013836572878062725,
        0.07222530990839005,
        0.01606256514787674,
        -0.05332183837890625,
        -0.04539376124739647,
        0.053964681923389435,
        -0.008886137045919895,
        -0.06672170758247375,
        -0.018513336777687073,
        0.009280749596655369,
        -0.0023338226601481438,
        0.08271178603172302,
        0.0034307825844734907,
        0.053180526942014694,
        -0.07384487241506577,
        -0.07327385991811752,
        -0.0041602118872106075,
        -0.0026450245641171932,
        0.08223704248666763,
        0.012428702786564827,
        0.057331301271915436,
        -0.05339351296424866,
        0.019848644733428955,
        -0.02128477767109871,
        -0.05022047087550163,
        -0.06334057450294495,
        -0.032506976276636124,
        0.005772669333964586,
        0.00327573181129992,
        0.007077878341078758,
        -0.03548579290509224,
        -0.06570758670568466,
        -0.009258865378797054,
        -0.06806998699903488,
        0.06804811954498291,
        0.0717581957578659,
        -0.08197947591543198,
        -0.05092369765043259,
        0.036002494394779205,
        0.0004041646025143564,
        -0.04707777500152588,
        -0.026429444551467896,
        -0.050607603043317795,
        0.008705493994057178,
        0.002350466325879097,
        -0.10065800696611404,
        0.009425437077879906,
        -0.02371307462453842,
        0.017875544726848602,
        0.04051654040813446,
        -0.07302737981081009,
        -0.02801482006907463,
        0.003652876242995262,
        0.023288555443286896,
        0.024907749146223068,
        -0.02708626352250576,
        -0.10147897154092789,
        0.07636737823486328,
        -0.02074088156223297,
        0.01858566887676716,
        0.021649200469255447,
        0.045187171548604965,
        -0.013476790860295296,
        -0.07087905704975128,
        0.012013562954962254,
        0.07762409001588821,
        0.0702124685049057,
        -0.04468582943081856,
        -0.09615476429462433,
        -0.017077423632144928,
        -0.004336463287472725,
        0.02927776612341404,
        -0.0054331328719854355,
        0.03621115908026695,
        -0.05133860930800438,
        -0.05053701624274254,
        -0.09228043258190155,
        -0.03886795416474342,
        0.03182037174701691,
        0.040124066174030304,
        -0.024274520576000214,
        -0.09754988551139832,
        -0.05026225000619888,
        -0.07595163583755493,
        -0.0404914952814579,
        0.03397880867123604,
        0.03706025704741478,
        -0.05836574360728264,
        0.05735288932919502,
        -0.005814084317535162,
        -0.029681092128157616,
        -0.10460078716278076,
        0.007162891793996096,
        -0.01454949751496315,
        0.023475339636206627,
        -0.027552632614970207,
        -0.082504503428936,
        0.0408700630068779,
        -0.0669199526309967,
        -0.021227356046438217,
        0.014848087914288044,
        0.1290450096130371,
        -0.019766928628087044,
        0.05925833061337471,
        -0.00425728177651763,
        0.018799664452672005,
        0.0015004118904471397,
        -0.09777290374040604,
        0.025498507544398308,
        0.030368132516741753,
        0.017123445868492126,
        0.038376934826374054,
        -0.048070427030324936,
        1.1786133046770037e-32,
        -0.03534944728016853,
        0.03248405456542969,
        -0.01802016794681549,
        0.10688356310129166,
        0.06294816732406616,
        -0.038567740470170975,
        0.0277871023863554,
        0.07974372804164886,
        -0.002519225934520364,
        0.030290458351373672,
        -0.02228435128927231,
        0.05004912614822388,
        -0.026410570368170738,
        0.058477990329265594,
        0.05166297405958176,
        -0.06824663281440735,
        0.006140637211501598,
        -0.014040563255548477,
        -0.0733654648065567,
        -0.019127674400806427,
        0.0022399923764169216,
        -0.0397813580930233,
        -0.027603548020124435,
        0.05347951129078865,
        0.0862060934305191,
        0.12171749770641327,
        0.05206447094678879,
        0.013041213154792786,
        0.08809765428304672,
        0.010670037940144539,
        -0.05710634961724281,
        -0.0383358970284462,
        -0.038708798587322235,
        -0.05965622887015343,
        0.011150025762617588,
        0.009635460563004017,
        -0.051229286938905716,
        -0.004862443543970585,
        0.0027318496722728014,
        0.04476659744977951,
        -0.011082838289439678,
        -0.04152470827102661,
        -0.0473610945045948,
        -0.053306303918361664,
        0.07448452711105347,
        -0.02182745561003685,
        0.028540344908833504,
        0.06308601796627045,
        -0.018946537747979164,
        0.005374929867684841,
        0.003944833297282457,
        0.02986621856689453,
        -0.030410774052143097,
        -0.0430317297577858,
        -0.02539338916540146,
        -0.11142178624868393,
        0.016131216660141945,
        0.08322860300540924,
        0.06338228285312653,
        0.07011726498603821,
        -0.007642903830856085,
        -0.045611560344696045,
        -0.03438761085271835,
        -0.011450441554188728,
        -0.035136763006448746,
        0.10460247099399567,
        0.03797854855656624,
        -0.06660835444927216,
        0.019706731662154198,
        0.06458347290754318,
        -0.0015745583223178983,
        -0.00013849088281858712,
        0.04770996794104576,
        -0.009156446903944016,
        0.0389569066464901,
        0.04739055782556534,
        -0.08381526917219162,
        -0.03001771681010723,
        -0.022624420002102852,
        -0.011001714505255222,
        -0.0779641643166542,
        0.09880624711513519,
        0.012582052499055862,
        0.06270763278007507,
        -0.02333850972354412,
        -0.1012798324227333,
        0.0036134987603873014,
        -0.0328153595328331,
        -0.061417754739522934,
        0.007297338917851448,
        -0.037322837859392166,
        0.07096478343009949,
        -0.06943225115537643,
        -0.02658511884510517,
        0.0064610145054757595,
        -1.1339699394110933e-32,
        0.015220962464809418,
        0.02391529455780983,
        -0.02103274129331112,
        -0.01831604167819023,
        0.03513135761022568,
        -0.002864625072106719,
        0.04219133406877518,
        0.07804106175899506,
        0.046769879758358,
        -0.08341355621814728,
        0.004211351275444031,
        -0.06830614805221558,
        -0.08083639293909073,
        0.038025736808776855,
        -0.003564586164429784,
        -0.030275261029601097,
        -0.010916815139353275,
        -0.05364961549639702,
        0.09602432698011398,
        0.0023209541104733944,
        0.0693918764591217,
        0.10139284282922745,
        0.07107456028461456,
        0.0038408725522458553,
        -0.023106040433049202,
        0.009064402431249619,
        0.024180801585316658,
        0.04435012862086296,
        0.07520756125450134,
        0.03803212195634842,
        -0.00014691207616124302,
        -0.03468142822384834,
        -0.014569238759577274,
        -0.02191155217587948,
        0.03677982836961746,
        0.0668383538722992,
        0.03578488156199455,
        0.021166590973734856,
        0.007196790538728237,
        -0.06579616665840149,
        0.002497517503798008,
        -0.004519224166870117,
        -0.038051482290029526,
        -0.026863431558012962,
        0.05332913249731064,
        -0.08128686249256134,
        -0.0816163495182991,
        0.00046222962555475533,
        0.024040136486291885,
        0.006525822449475527,
        -0.06373217701911926,
        -0.051688265055418015,
        -0.02713356353342533,
        -0.01345270499587059,
        -0.00015767343575134873,
        0.004355183802545071,
        -0.06701559573411942,
        -0.02658969908952713,
        0.08338623493909836,
        -0.03181418403983116,
        0.03339259698987007,
        -0.03357284143567085,
        -0.09820801764726639,
        -0.07630950957536697,
        0.013347078114748001,
        -0.019929222762584686,
        0.10077735781669617,
        0.029273435473442078,
        -0.02622777782380581,
        0.004310611169785261,
        -0.05091542750597,
        0.04811391979455948,
        0.05008436739444733,
        0.01652895100414753,
        0.02048846147954464,
        0.002946134191006422,
        -0.0773359015583992,
        0.013438197784125805,
        0.11572875082492828,
        -0.02583494782447815,
        -0.04210424795746803,
        -0.03741511330008507,
        0.05849064886569977,
        0.04440467804670334,
        0.09102658182382584,
        0.10016614943742752,
        0.0908077284693718,
        -0.013180559501051903,
        -0.0704425647854805,
        0.0351518914103508,
        0.026188446208834648,
        0.0498349703848362,
        0.12728609144687653,
        0.11982610076665878,
        -0.09983980655670166,
        -6.088519910463219e-08,
        0.025645490735769272,
        0.038114987313747406,
        -0.008506298065185547,
        -0.013396946713328362,
        -0.01985093764960766,
        -0.07824321836233139,
        -0.020715821534395218,
        0.046028804033994675,
        0.04995626211166382,
        -0.07983864098787308,
        0.0779745951294899,
        -0.038759224116802216,
        -0.03130922093987465,
        0.13308052718639374,
        0.04557928070425987,
        0.027721239253878593,
        -0.10852988064289093,
        0.06337779760360718,
        -0.02038503997027874,
        -0.02945546992123127,
        -0.03256256878376007,
        0.07924359291791916,
        0.052476875483989716,
        -0.01724027283489704,
        0.05326036363840103,
        0.03992142900824547,
        -0.014131003059446812,
        -0.02402826026082039,
        0.06413894891738892,
        0.02565186098217964,
        -0.09333644062280655,
        -0.0014469720190390944,
        0.009881007485091686,
        -0.006464852020144463,
        -0.06971599906682968,
        -0.04113943502306938,
        0.0019555161707103252,
        0.005374975968152285,
        0.04143861308693886,
        -0.01784530282020569,
        0.026701847091317177,
        -0.12138614803552628,
        -0.06509342044591904,
        -0.030731244012713432,
        0.06267242133617401,
        -0.06604321300983429,
        0.0016278732800856233,
        -0.10544194281101227,
        -0.04252542182803154,
        -0.02826697751879692,
        -0.026932816952466965,
        0.046686381101608276,
        0.012143295258283615,
        0.03016192652285099,
        0.08488531410694122,
        -0.00154280592687428,
        0.026682110503315926,
        0.03441751003265381,
        0.026549356058239937,
        0.018653128296136856,
        -0.003181733889505267,
        0.042714763432741165,
        -0.1055002212524414,
        0.043267954140901566
    ]
}