{
    "id": "slNe6z9gFv0",
    "title": "It's DNS again 😢 Did you know this Malware Hack?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-05-26T14:00:41Z",
    "video_url": "https://www.youtube.com/watch?v=slNe6z9gFv0",
    "category": "People & Blogs",
    "tags": [
        "malware",
        "wireshark",
        "dns",
        "dns hack",
        "dns malware",
        "dns txt",
        "base64",
        "wireshark malware",
        "hack",
        "hacker",
        "hacking",
        "information security",
        "nmap",
        "wifi",
        "cyber",
        "cybersecurity",
        "threat",
        "threat hunting",
        "wifi analysis",
        "scanner",
        "wifi scanner",
        "hackers",
        "ethical hacker",
        "ethical hacking",
        "hacking tutorial",
        "learn hacking",
        "how to hack",
        "wifi cracking",
        "nmap switches",
        "infosec",
        "attack",
        "cyber security",
        "wifi hack",
        "nmap scan",
        "nmap port scan",
        "nmap scripts",
        "nmap vulnerability scan"
    ],
    "views": 90700,
    "likes": 3892,
    "comments_count": 271,
    "description": "Chris Greer is back to show us Malware that Hackers could use to attack you (in this case using DNS). Chris is the man I talk to about Wireshark! Did you learn something new in this video? Big thanks to Brilliant for sponsoring this video! Get started with a free 30 day trial and 20% discount:   // Chris SOCIAL // YouTube:  Wireshark course:  Nmap course:  LinkedIn:  Twitter:   // David SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    Chris Greer Playlist:   // MENU // 00:00 Coming Up 00:27 Thanks Brilliant! 01:58 Did you know this? 02:41 DNS Misconceptions 03:16 DNS Example 04:38 Cloudflare / What Is DNS? 05:38 Virustotal 07:01 DNS String 08:52 Base-64 Decode 10:24 T Shark 12:25 Cyberchef 14:30 How Does The Hack Start? 14:54 Phishing Attacks 15:59 How DNS Attacks Started  16:57 Packets 17:53 Outro  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #malware #hack #wireshark",
    "description_links": [
        "https://brilliant.org/DavidBombal",
        "https://www.youtube.com/c/ChrisGreer",
        "https://davidbombal.wiki/chriswireshark",
        "https://davidbombal.wiki/chrisnmap",
        "https://www.linkedin.com/in/cgreer/",
        "https://twitter.com/packetpioneer",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKO8522T1OAhR5Bb2mD6Qy_l"
    ],
    "transcript": "- That's why packets, to me, are so important to learn how to capture and understand. It will make you better at troubleshooting, and it will also help you with exercises like this, in threat hunting or when we have been compromised, help to back up and piece together what happened. The idea here is that this could walk right by, that it's buried in plain sight, right? So that's what makes this example so interesting. What do you think, David? Are we dealing with malware or not? - It looks like it, doesn't it? (graphics warbling) I really wanna thank Brilliant for their fantastic partnership and for sponsoring this video. It doesn't matter if you wanna learn cybersecurity, ethical hacking, networking, artificial intelligence, programming. You need to learn about numbering systems. In this example, I've captured some network traffic. I'm capturing traffic sent to and from this router. Notice the format of this number, fe80 sending traffic to ff02. What numbering system is this? This is IP version 6, and these are hexadecimal numbers. Hexadecimal has only one numbering system that you need to learn. Another one is binary. Do you understand this joke? There are two types of people in this world, those that understand binary and those that don't. You need to understand binary. You need to understand hexadecimal. You need to understand decimal. It's important that you understand numbering systems. Again, doesn't matter if you wanna be a network engineer, doesn't matter if you want to do programming, artificial intelligence, et cetera. You need to learn this. And there's no better place to learn math and computer science than Brilliant. Brilliant gives you some history of how numbers were used by different cultures, and then moves onto modern applications of decimal, binary, and hexadecimal. Brilliant goes beyond the basics when it comes to teaching you numbering systems in binary, and helps you develop a more well-rounded understanding and intuition surrounding numbering systems. If you want an easy interactive way to learn, then Brilliant is the answer for you. Brilliant now offers a 30-day trial with a 20% discount if you sign up using my link brilliant.org/davidbombal. I really wanna thank Brilliant, again, for the partnership and for sponsoring this video. For everyone who's watching, Chris is gonna show us something really cool with DNS. Please put in the comments below. Did you know this? So when you've finished watching this video or part of the video, put in the comments below, did you actually know that this was possible to do with DNS, and that DNS could be used as a way to attack your clients. As they commonly say, it's always DNS' fault. And here's another example of where DNS could be used by a malicious actor to attack your network. - Yeah, David. And this one gets a little bit scary. And, really, the intent here is that this would if we don't have a properly configured IDS, IPS system. The idea here is that this could walk right by, that it's buried in plain sight, right? So that's what makes this example so interesting. - I think a lot of people are under the misconception that DNS is just used to resolve a domain name like Packet Pioneer to IP address. But actually, you're gonna show us that it can do a lot more than that, right? - Yes, exactly. So that's exactly what many people just think DNS only does. Here's an IP address, what's a name or here's a name, what's an IP address? But DNS can do a whole lot more. And let's take a look. Now, as you mentioned before, this is an example, and this is actually taken from a course that I've been teaching on threat hunting with Wireshark, and we'll talk a bit more about that course later. But this specific example, can you see my screen okay? - Yeah. - So if we just take a walk through it, just take a breeze through it real quick, we can see that a lot of it is DNS, okay? So if I just go up to the top, I can see that the one that is sending the DNS requests is this 101.121 device. So we're gonna call that our client, okay? So this client is initially talking to this, allegedly, 8.8.8.8 server. (David chuckles) Now we know from that, a lot of us use that as Google DNS. However, in this case, there's something interesting that happens, and that's why we know that we might not be directly talking out to that server itself. So I wanna show you something. So we send this request for a reverse record for 8.8.8.8. We're just asking who is the name that's associated with this IP. If I come down to the response, here, I can see, if I go down to DNS, here's their answer. And blah, blah, blah. Coming down here to the lower left, you can see dns.google. Okay, if I take a look at the next query. This time, so here, we can see that the client is requesting a TXT record, all right? So, l.ns.ostrykebs.pl. Okay, so what does that mean? Well, let's just take a look at at this request a little bit closer. So with DNS, DNS is more than just IP addresses and names. DNS has the ability to do different types of requests. So the query type in this case is a TXT string. Just a note about that, David, real quick, I'm just bringing in my browser here. There's a really nice description on Cloudflare. This is a quick one that I was able to find, but just what is that DNS TXT record? Well, if we take a look at Cloudflare, I thought this was a really good description of what it is. And basically, what it does is it allows us... Originally, it was intended as a place for human-readable notes to be in records. However, now it's possible to put some machine-readable data into TXT records, and that's where things get interesting. So basically, it's a way of putting TXT in a DNS reply. Okay? So a bit more detail in there if you want to go dig in through that. However, I'd rather demo this for you. So, let me come back to my PCAP. Now we're asking for a TXT record, and we're also asking for this interesting-looking site. Something that I like to do and like to teach others to do is when you see a a site that you're not quite sure about, one thing that we can do is always use VirusTotal to take a closer look at it. Okay, so what I'm gonna do, I'm just gonna right-click and I'm just gonna do Copy, Value, so I can pull that right out of the packet. And I'm just gonna peek into VirusTotal, this is something that I like to encourage people to do when you see a DNS record or anything, really, that just looks funny, okay? So I just put this into the search and I'm gonna say, \"Okay, let's go get it.\" And what this does is it looks up that DNS name, and it goes to some common vendors and checks to see if it's okay. Well, what do you think, David? Are we dealing with malware or not? - It looks like it, doesn't it? - It sure does. Yeah. Doesn't look too happy. Okay, so let's go back into our packet capture. All right, so we go and we ask for a TXT record from this server. So let's see what happens, or rather in this record. Let's see what happens. So this alleged 8.8.8.8 address, which may or may not be true. We come down. Let's take a look at the TXT record that's returned for this lookup. And this is where we get this TXT record. Now, David, we don't have to be super amazing coders and scripters, and all the things. Does this look like a good, nice, happy DNS record to you? - [David] (chuckles) Yeah, right. But a code, right? - Yeah, this is code. So let's do this. I'm just gonna take a look. - [David] There's a while loop or something in there. It's matching something. - Excellent. Exactly. So, right away, we can see this isn't happy. In fact, this is what I'm gonna do. I'm just gonna take and I'm just going to copy this as well. Or you know what I could do real quick? Let me just do this. Let me just right-click and I'm just gonna do Show Packet Bytes. Now this is where I can see this full string, and that's just basically typed out for me. And without going too deep into the weeds on the string itself. Basically, what this is doing is it's giving an instruction to the client to continually come back and ask more questions for more pieces of this code. And then when it's finished, it will then execute that code. All right. So, let's actually see how that works. So this is just the initial request, okay? So this just came in from this server, but now, check this out. So now we're gonna go to a local box, which has absolutely been compromised. And if I come down here, now this is basically in a demo environment this was run, but let's go ahead and start to take a look at some more of these DNS records. So now, this client, this client is now starting to do the bidding of the attacker. It's going to 100.2 DNS, hitting us on 53. And let's take a look at what's happening. So first, here we have this first request, it's going to l.1.ns. Okay, give me your TXT. This server comes back, or alleged server comes back and says, \"Oh, great. Thank you. Here's your first instruction, .1\" Now, truncated. So this TXT record, it's keeping it small, basically, so to speak. So what we're trying to do here is we're trying not to do this massive script in one DNS packet, because that might trigger an IDS system, an IPS system, and say, \"Whoa, whoa, whoa. Wait a second. You have a huge DNS record or a very large DNS packet. That can't be good.\" 'Cause usually DNS requests and responses are smaller packets, you know, 200 bytes-ish or so. Here's 254 bytes. This TXT record comes back. Check it out. Does that look dangerous to you necessarily? - [David] Yeah, it's encoded in a weird way, but- - Yeah. On it on its own, it doesn't look too crazy. But if we go back to that original request, we notice that there was actually Base64 in the previous request. And you come down here, you can see in Wireshark, I can do a Decode as, and I'm gonna say Base64. Now when I decode it as Base64, what's our thought here, David? Do you think we're starting to see some safe things? - [David] Yeah, it looks extreme. More and more dodgy, right? - Yeah, right? This probably isn't something I wanna see just in a TXT value coming back from DNS. Okay, so let's just remember that. Okay, there's that one. And if I close this, I'm gonna come back to my packets. We do another query, but this time it's for l.2. So the first one was .1, this is .2. Okay, we do a TXT query. Same thing. Let's kick back. Let's see what it sends us. Now another 254, gonna come down here, going to right-click, Show Packet Bytes. I'm gonna come up here, and this is where I can decode as Base64. Uh-oh. - Oh. - This looks like the next chunk of that script. Okay, so what's happening is we're requesting, basically, this script and we're getting sent this chunk, one chunk at a time. 254 bytes at a time. So you can see request. This is 1, 2, 3, 4, 5, right? So six, all of these different ones. So all these different pieces. Well, what happens when the client gets all those pieces, extracts that TXT, and puts it all together? That's what we wanna find out. So the next thing I'm gonna do, David, is I wanna show you something super cool that we can do on the command line with Terminal Shark. All right, so I just showed you, in Wireshark, we can see that we have these obfuscated or encoded pieces of a script that are being sent over DNS. All right, so here I am on the command line, and one reason why I do this is because I can take TShark, and I can throw a packet capture at it, and I can extract certain fields from those packets using TShark, and put them all in one place. You can do this with other tools. For me, it's just something I like to do with TShark. So, Terminal Shark. So this is what I'm gonna do. I'm gonna say tshark, all right, that calls that utility, which by the way, David, if you install Wireshark by default, TShark will get installed as well. So you already have this in your machine if you've installed Wireshark. All right, so the first thing I need to do is just tell it to read. So, I'm gonna read in. And as I recall, I'm just gonna look... C2 analysis, that was the name of our file. So, C2Analysis.pcapng. All right, and so now I'm gonna throw a filter at it. I'm gonna do .y or -y. That's how I set a filter. And what I wanna do is I just want to filter for all packets coming back. Basically, these 347s. And I want to... If I click on this string down here, if I go down to the lower left I can see that this is showing me that this string value, or this location rather, in DNS, is dns.txt. All right, so if I just set a filter for this, so let's just do that, dns.txt, enter. What I see is I'm getting all of the responses from that server, right? Because they actually have a dns.txt value in them. So that's gonna be a good filter for me. So let's just do this, dns.txt. Great. Now what I wanna do is I wanna extract that field out. So I'm just gonna do this, I'm gonna do, it's called -T, and then what I do is I'd say \"fields.\" So that tells me go into whatever field I specify and print that out to my command line for me. Now, which field do I want? -e, I'm gonna do dns.txt. All right, now if I execute this, do we see what we're doing here? TShark, hey, go read this PCAP, use this filter, and pull out this field. Now I have all of those strings in one place for me. So, David, I'm going to introduce you to another buddy of mine, and that is CyberChef. So it allows us to take different strings and whatever's been encoded, decoded, and tinker around with it. So I'm gonna go ahead and input that string here. So here's all the messy code, but let's go ahead and say From Base64. So, this will decode it. And now, we have the full string, or the full script rather. So you and I can now begin to look through this and see, \"Hey, if this was sent to a victim machine and it ran this script, what would it do?\" Well, here, I'm not the best person in the universe with scripting. Maybe together we can help sort out some of this. So basically, what we're doing is we're saying, \"Hey, go look for or get a TXT value from that server, and I want you to pull out that TXT information, and I want you to loop and do this until you get a full string.\" Once you get this full script back, if we come down here, this is the type of stuff that my eye looks for, what are you gonna do? Well, you're gonna reassemble it. And then this guy, IEX. So, what is that? Well, pop that in Google and just IEX, right there in a PowerShell script. This is Invoke-Expression. Okay. Well, that can't be good. So that means that I'm sending you pieces of a script and as soon as you get all the pieces, invoke it, do it. Okay? And we can see sendResult. So, what starts to happen here is after the victim machine gets all of these pieces of the script and invokes it, the next aspect of this attack is it's now starts sending instructions back. Now we actually start to see a callback conversation. That can be heavily encoded between the attacker and the victim machine. Using DNS TXT fields is the way that that first instruction gets sent, and it's sent in pieces to try to float below the radar of an IDS or IPS. Once it's actually all pulled out and executed, now that invoke-expression makes that machine call back to our server and we can begin to control it. - Yeah, like how does the very first step happen? Is it something to do with the DNS, so that machine is compromised somehow to go to the wrong DNS server, or how does the initial thing kickoff to actually request that TXT file? 'Cause you've shown us the DNS and then it's requesting the TXT file, but how does it actually start that process? - David, that's a great question. So I would imagine a few ways that this could happen. One, standard good old phishing, sending a user a link, and then redirecting them to a malicious device that then further runs a script. Spoofing a DNS server, (chuckles) acting like we're the one, the authority. - I'm the captain now. - And initially, we're going out to an allegedly known address, and we're doing this lookup for what looks like to be a good DNS record. But then that record gets implanted and the TXT is what actually starts the script. So initially, this client is just going out and asking this question. But in order to ask that question, how did that get to them, how did they begin that? Probably from some type of phishing attack. - But it's amazing. I mean the fact that, you, doing a DNS query like what you're showing on the screen there, and then the answer is he has a TXT file. - Exactly. (David chuckles) - And the DNS server can just control that client to pull down some crazy TXT. - Yeah, so it's interesting how this malware could be implanted using the TXT string of a DNS query. I think this is just crazy. - As they always say, Chris, it's always DNS. - (chuckles) Right. That is true. And this is also why modern IDS systems are gonna be taking a much closer look at inspecting DNS, right? It used to be that this kind of thing, probably, would just walk right by. But now, if you have a string like this or if I come back down to one of the previous records we were looking at, even a Base64 encoded string isn't as complicated to decode for our detection systems. Because this was so prevalent, and it was about about 2017, '18, was where we started seeing this. Basically, the malware is called DNSMessenger, and it was really designed to illustrate how this could happen, how we could bury C2 traffic in DNS calls. Thankfully, now, many systems are tuned to be able to detect this better than at that time. However, it's still something we wanna be aware of and how we could deliver that using DNS. - Chris, that's amazing. So, thanks so much for showing us this example. What I really love about what you do is you always take it down to the wire where you can actually see stuff. I think you've said it before, and correct me, 'cause I'm probably gonna say it wrong, something along the lines that packets don't lie. - Absolutely. Packets don't lie. This is the traffic that's actually on the Wire, which is another reason why I'm so passionate about anybody, not just network engineers but cybersecurity professionals. If you're just getting started with cybersecurity, studying for your Sec+ or even Net+, or any entry-level certification. That's why packets, to me, are so important to learn how to capture and understand. It will make you better at troubleshooting, and it will also help you with exercises like this, in threat hunting or when we have been compromised, help to back up and piece together what happened. - For everyone who's watching, Chris does this stuff day in and day out. And Chris, we can't say names 'cause of NDAs and the like, but I know that you're doing some work with government agencies and banks, and big institutions to try and help them with their capturing malware and other stuff. Just basically teach people how to use Wireshark like you do. So I really appreciate you sharing all of this knowledge with us. - Oh, no problem, David. I love coming on and and chatting with you, and we always find some interesting things. So, until next time. I think I'm gonna go back and and hit my books. - So for everyone who's watching, please put in the comments below what you want Chris to talk about, perhaps, in future videos. We've also got a whole bunch of videos which I've linked below where Chris teaches us Wireshark, teaches us a whole bunch of other things. Chris, all the very best. - Thanks, David. (logo chiming) - I'm David Bombal. I wish you all the very best.",
    "transcript_keywords": [
        "DNS",
        "TXT",
        "TXT record",
        "DNS TXT record",
        "DNS TXT",
        "DNS record",
        "DNS TXT fields",
        "David",
        "back",
        "DNS server",
        "DNS packet",
        "record",
        "DNS requests",
        "server",
        "script",
        "Yeah",
        "string",
        "good DNS record",
        "DNS query",
        "TXT string"
    ],
    "transcript_entity_values": [
        "first",
        "ff02",
        "IDS",
        "six",
        "IEX",
        "6",
        "30-day",
        "Cloudflare",
        "fe80",
        "200",
        "TShark",
        "One",
        "two",
        "100.2",
        "Terminal Shark",
        "Packet Pioneer",
        "Wireshark",
        "Wireshark",
        "only one",
        "PCAP",
        "5",
        "8.8.8.8",
        "DNSMessenger",
        "2017",
        "Google",
        "David",
        "VirusTotal",
        "101.121",
        "IP",
        "Chris",
        "347s",
        "'18",
        "one",
        "53",
        "Copy, Value",
        "Wire",
        "C2",
        "4",
        "DNS",
        "PowerShell",
        "20%",
        "Wireshark",
        "1",
        "C2Analysis.pcapng",
        "8.8.8.8",
        "2",
        "David Bombal",
        "254",
        "3"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        -0.12141510844230652,
        -0.016735360026359558,
        0.017050493508577347,
        -0.07980913668870926,
        -0.01770039275288582,
        -0.023331688717007637,
        0.04270374774932861,
        -0.07156277447938919,
        0.04160318151116371,
        0.04521873593330383,
        -0.017695840448141098,
        0.06036371737718582,
        -0.007104832213371992,
        -0.03105231188237667,
        -0.054856445640325546,
        -0.040209606289863586,
        -0.07130423188209534,
        -0.04771101474761963,
        -0.044376470148563385,
        -0.03363192081451416,
        0.034336578100919724,
        0.09129989892244339,
        -0.03702421858906746,
        -0.046489614993333817,
        -0.03097544051706791,
        0.06856842339038849,
        -0.016708461567759514,
        0.08410412073135376,
        -0.02476433850824833,
        -0.052689079195261,
        0.07584571093320847,
        0.0259883850812912,
        -0.011916684918105602,
        0.04538482427597046,
        0.0036586422938853502,
        -0.03361417353153229,
        0.04059066250920296,
        0.05869881436228752,
        -0.045185837894678116,
        -0.0045057861134409904,
        0.06739730387926102,
        -0.04661734774708748,
        0.07273437082767487,
        0.04195238649845123,
        -0.04193855822086334,
        0.11160136014223099,
        -0.019439591094851494,
        0.041537534445524216,
        0.03459051996469498,
        -0.057843297719955444,
        -0.0017972833011299372,
        -0.005533402785658836,
        0.08089177310466766,
        0.02440730854868889,
        0.03197881951928139,
        -0.03853057324886322,
        -0.07656083256006241,
        -0.015816330909729004,
        0.040315382182598114,
        0.03064175508916378,
        -0.018793020397424698,
        -0.0014381423825398088,
        0.061523959040641785,
        0.009635966271162033,
        0.02927508018910885,
        -0.014871090650558472,
        -0.03755389153957367,
        0.059769634157419205,
        0.019923504441976547,
        -0.01418545376509428,
        0.012104189954698086,
        0.04856045916676521,
        -0.040161263197660446,
        0.045778609812259674,
        0.04651537165045738,
        0.013966637663543224,
        0.008091618306934834,
        -0.04078172147274017,
        -0.06011213734745979,
        -0.09396913647651672,
        0.14459215104579926,
        0.03391170874238014,
        0.04980086535215378,
        0.08028120547533035,
        -0.07113007456064224,
        0.04837812855839729,
        0.020083550363779068,
        -0.06506966054439545,
        0.04155370965600014,
        0.04460509493947029,
        -0.04894692450761795,
        0.0331072136759758,
        0.035546205937862396,
        0.04161546006798744,
        0.028897099196910858,
        0.03380589932203293,
        -0.0063944412395358086,
        0.01966898888349533,
        -0.04614269733428955,
        0.058274466544389725,
        -0.00686253048479557,
        0.025835631415247917,
        -0.003373684361577034,
        -0.13485358655452728,
        -0.008770231157541275,
        -0.003011473920196295,
        0.009138467721641064,
        0.06307204812765121,
        0.12068257480859756,
        0.020320473238825798,
        -0.04623524844646454,
        -0.001092788064852357,
        0.025430915877223015,
        -0.08914870023727417,
        -0.026141952723264694,
        -0.027218326926231384,
        -0.018484346568584442,
        0.039881639182567596,
        0.009635314345359802,
        -0.053610678762197495,
        0.021671386435627937,
        0.002225840464234352,
        -0.007951417937874794,
        -0.020817356184124947,
        -0.04545009881258011,
        0.04315109923481941,
        -0.024646282196044922,
        6.0847088367675144e-33,
        0.06010676175355911,
        0.05849236622452736,
        -0.0792178139090538,
        -0.02838057465851307,
        0.025109507143497467,
        -0.09387794137001038,
        -0.003032179083675146,
        0.1126110851764679,
        -0.09171963483095169,
        0.020571431145071983,
        -0.06873106211423874,
        -0.09687958657741547,
        0.011923803016543388,
        0.006164140999317169,
        0.005460587330162525,
        0.017532138153910637,
        0.04246972128748894,
        -0.01552128978073597,
        -0.009876537136733532,
        0.05889482423663139,
        0.04780833050608635,
        0.015376521274447441,
        0.017653977498412132,
        -0.030314190313220024,
        0.043571680784225464,
        0.017562173306941986,
        -0.03752469643950462,
        0.017513299360871315,
        0.14481958746910095,
        -0.020676158368587494,
        -0.050002895295619965,
        -0.011788948439061642,
        -0.03482257202267647,
        0.01596669666469097,
        0.11000718921422958,
        -0.009639502502977848,
        0.021208515390753746,
        -0.0503583587706089,
        -0.06997193396091461,
        -0.034921057522296906,
        0.032141830772161484,
        0.0011499340180307627,
        -0.12627007067203522,
        0.027295837178826332,
        -0.017417682334780693,
        -0.010783839039504528,
        -0.0482071153819561,
        -0.03849530220031738,
        0.01293930970132351,
        0.03195195645093918,
        0.01390746794641018,
        -0.011734559200704098,
        0.055605001747608185,
        -0.014819475822150707,
        -0.02084868773818016,
        0.054337069392204285,
        -0.0056196521036326885,
        -0.04720984026789665,
        0.03470256179571152,
        0.08536341786384583,
        0.03448572754859924,
        -0.007560542318969965,
        -0.03441844508051872,
        -0.024601103737950325,
        -0.004234397318214178,
        -0.09040255844593048,
        0.09720585495233536,
        0.07501623779535294,
        -0.027027156203985214,
        0.014706998132169247,
        -0.06034102663397789,
        0.03714952990412712,
        0.01888468489050865,
        0.006428344175219536,
        -0.05579129606485367,
        -0.0016837279545143247,
        -0.06022002547979355,
        -0.01399476919323206,
        0.017432207241654396,
        0.004369867034256458,
        0.019631197676062584,
        -0.04835345223546028,
        0.05790568143129349,
        -0.021646132692694664,
        -0.09562388807535172,
        0.03786291927099228,
        0.017228925600647926,
        -0.08192290365695953,
        -0.011673587374389172,
        0.0478241853415966,
        -0.06324177235364914,
        -0.06316009163856506,
        -0.02931678481400013,
        0.01125338301062584,
        0.00031663276604376733,
        -7.752546139462255e-33,
        -0.07843971252441406,
        0.029138484969735146,
        -0.11205741763114929,
        0.031219346448779106,
        -0.027560066431760788,
        -0.049765296280384064,
        0.026799434795975685,
        0.1154947429895401,
        0.02259146422147751,
        0.00986024271696806,
        0.030604664236307144,
        -0.015519190579652786,
        0.011794953607022762,
        -0.11160865426063538,
        0.06441665440797806,
        0.020594190806150436,
        0.0244654081761837,
        -0.023462587967514992,
        -0.09144130349159241,
        -0.0246512982994318,
        -0.009589454159140587,
        0.04138573631644249,
        -0.10345100611448288,
        -0.04200983792543411,
        -0.028251294046640396,
        0.021197479218244553,
        0.043327245861291885,
        0.13444477319717407,
        0.06611940264701843,
        0.043712351471185684,
        0.06747275590896606,
        0.04092180356383324,
        0.017893167212605476,
        0.05839226022362709,
        -0.018042823299765587,
        0.08906009793281555,
        0.06875747442245483,
        -0.007230134680867195,
        0.025681568309664726,
        -0.11918612569570541,
        -0.010257234796881676,
        0.034206684678792953,
        -0.06335277855396271,
        0.01891041360795498,
        -0.0232198778539896,
        0.04011315107345581,
        -0.05995231494307518,
        0.07719430327415466,
        -0.09087791293859482,
        -0.013902226462960243,
        0.08874193578958511,
        -0.017499972134828568,
        0.005665597040206194,
        -0.019668349996209145,
        0.01560946274548769,
        0.03433958441019058,
        0.013448521494865417,
        0.003274040063843131,
        0.0345311276614666,
        0.018219400197267532,
        0.06851127743721008,
        -0.11596887558698654,
        -0.11314113438129425,
        0.07664474099874496,
        0.0556369423866272,
        0.038040049374103546,
        -0.0360088124871254,
        0.0043863472528755665,
        -0.009244856424629688,
        -0.024786481633782387,
        0.027583474293351173,
        -0.01456457283347845,
        -0.08377507328987122,
        -0.06363844126462936,
        0.024908725172281265,
        -0.06500834226608276,
        0.016857704147696495,
        0.029965469613671303,
        -0.11784865707159042,
        0.05285908654332161,
        -0.012260457500815392,
        -0.0315280556678772,
        -0.04679497703909874,
        -0.005771405529230833,
        0.04756556823849678,
        0.028678445145487785,
        0.11770664155483246,
        0.04559597373008728,
        -0.0473020039498806,
        0.02102281153202057,
        -0.017296092584729195,
        -0.038764018565416336,
        -0.060434453189373016,
        0.0933581218123436,
        -0.010922481305897236,
        -5.46779581611645e-08,
        -0.04212010279297829,
        0.0057383510284125805,
        -0.07036029547452927,
        0.05593826621770859,
        0.08906976878643036,
        0.06473183631896973,
        -0.0017598828999325633,
        0.015190607868134975,
        -0.04881289601325989,
        -0.03472301363945007,
        0.01124807819724083,
        -0.005503835156559944,
        -0.048557572066783905,
        -0.08555449545383453,
        0.022976795211434364,
        -0.028363628312945366,
        -0.01877904310822487,
        0.0026967222802340984,
        -0.040244605392217636,
        -0.046393681317567825,
        0.010641644708812237,
        0.009229765273630619,
        -0.09024635702371597,
        -0.07649891078472137,
        -0.06018711254000664,
        -0.04058381915092468,
        0.04362860694527626,
        0.053311076015233994,
        -0.016159988939762115,
        -0.009435717947781086,
        -0.054486826062202454,
        -0.037041474133729935,
        -0.024900183081626892,
        -0.02916189841926098,
        -0.04343646019697189,
        0.09979578852653503,
        -0.08788113296031952,
        -0.07318290323019028,
        0.0293075330555439,
        -0.015888910740613937,
        -0.04177216812968254,
        -0.049271345138549805,
        0.03681565076112747,
        0.023663625121116638,
        -0.07435327768325806,
        -0.0017287824302911758,
        -0.05162211135029793,
        0.0018778027733787894,
        0.09257031977176666,
        -0.07659992575645447,
        0.0036861393600702286,
        0.004796992056071758,
        0.00897789467126131,
        0.05887752026319504,
        0.00991805549710989,
        0.00493241660296917,
        -0.017192037776112556,
        -0.08666832000017166,
        -0.07444574683904648,
        0.05383571237325668,
        0.02046331949532032,
        -0.031054560095071793,
        -0.037674419581890106,
        0.07211195677518845
    ]
}