{
    "id": "sPW4Jm3Br5Q",
    "title": "Apple Fitness+ Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-12-14T14:00:26Z",
    "video_url": "https://www.youtube.com/watch?v=sPW4Jm3Br5Q",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 420796,
    "likes": 13955,
    "comments_count": 993,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we're gonna be talking about the new Fitness+ service that just launched by Apple. This is something that they've been talking about for a while and it is now officially here and it is out. So basically, if you have an Apple Watch, you'll be able to have access to this service. If you recently bought an Apple Watch, you can get three month free subscription. I'm so excited about this service because right now more than ever, people are looking for ways to stay active, especially when we're being told to stay in our homes, we can't go to gyms and we can't kinda resume the daily activities that we normally were doing before the whole world basically shut down. So here we have Apple Fitness all set up. I have it on my iPad, I also have it on my iPhone here. So if you guys check this out, the Fitness app will now transform in the latest update. You'll be able to see all of your activity, but then this little middle button, that will bring you to the Apple Fitness app. If you've ever used any type of online fitness service, this is very similar to that, but what they have done is really outfitted this incredible studio, so all of these classes are so incredible, so high quality. And one of the coolest things is it does integrate with Apple Music, so you're able to see all of the playlists and then you can save those playlists if you enjoy the music so you can listen to it later. So not only are you able to use your iPhone or your iPad but it is also accessible on Apple TV. You just bring your Apple Watch close to the television, it'll automatically detect who you are and you'll be able to start training right away. You could go and use someone else's Apple TV, so if you're at home with your family or a friend's house, you can just get close to their Apple TV, it'll automatically detect, log you in using all of your settings. Even if they're not a Fitness+ subscriber, you'll still be able to work out and have all of the data and stats synced to your account. You can filter all of the classes by the type of class that you want, HIIT, yoga, strength, dance. You better believe I'm gonna take a dance class. One of the things that they're really stressing is there are so many workouts here that you can do if you're a beginner, if you've never done any type of activity. They actually have an entire beginner playlist, so you can just add all of those classes and take all of those one by one, and then from there, you can progress on in your fitness journey. So one of the cool things about Apple Fitness+ is they have so many different classes, and if you do have some equipment at home, like a rower or a bike or a treadmill, you can also integrate that into your Apple Fitness workout. Now I do have a Peloton, so I've been doing Peloton for the past, I guess, almost two years at this point, so it's really exciting to kind of get some new trainers and to start doing some new treadmill workouts. So we are about ready to go. Treadmill with Scott, 10 minutes, let's do it. (energetic music) - Hi y'all, it's Scott, coming to you - Hey Scott! - The focus of this workout is to really push yourself on the four all-out speed intervals. Use the recoveries to help you push harder. We only have 10 minutes. Let's get right to work. - It's also really cool because they are taking into account some hearing impaired people that might be doing this and they have learned all of their intros so that people will be able to know when to actually start, so cool! Let's go. (chill music) - [Scott] Nice rhythm here. - There it is, there's the burn bar! I'm at the front of the pack! (chill music) I love that. They put up a nice little countdown so you're really knowing when you can stop doing an activity, that's great. (chill music) That was really fun. It's cool because it shows me all of my stats, it shows me the class that I did and if I wanna go into a mindful cool down, I can just hop into one of those classes right away. I'm out of breath. I like that the activity summary has a thumbnail of the class that you just took, so your friends will actually be seeing the same result on their Apple Watch, so they'll be able to see the class that you took, and if they wanna do the same one, they can just click into it and take it as well. So far my favorite thing is how well this integrates with the Apple Watch. You're able to have your heart rate data always on screen, and when they call attention to your heart rate, whether you want it to be lower or if you're starting a cool down, that is the only thing that will pop up on the screen, so you're not distracted by any other metrics, it's just what the instructor is talking about. I also love that up in the top right corner is your activity rings, so you're able to see how much further you have to go for the rest of the day to continue to close your rings. Another thing that I love is the burn bar. This is really neat because it allows you to see where you're at with other people that have taken this class. You do have the option of turning the burn bar off if you don't wanna feel competitive and you just wanna relax and work out at your own pace. Most of my running records or goals that I've achieved is because of the leaderboard. I will see that somebody is in front of me and I just have to push a little bit harder to get past them, but a lot of times, most of the goals that I am looking to achieve are to be better than myself. So that's always the most exciting thing, is to see that progress and to see that you're actually making change. Let's do a strength workout. This time, I'm gonna choose my class by what I wanna listen to. So I would like to do 10 minute workout and what about pure dance? What do you got for me? Strength with Greg. All right, strength with Greg, here we go! Starting it on the Watch! - Hey, what's up? It's Greg here at the Fitness+ Studio in beautiful Santa Monica, California. - Santa Monica? - Squat down, arms in, up, out and around. Make it big. Sit down, approaching the floor. Range of motion is important for today. (upbeat music) - Oh man, we did it. One of the things that I noticed that I really like is they have two other people in the studio and each person is doing a variety of different types of modifications, so if the main instructor is doing something that's too difficult, they have an easier modification. So if you have an injury or if you're not at the level of the main instructor, I'm out of breath. There's a wide variety of options. I just really like that it gives you this really nice panel that shows you everything that you did, your average heart rate, your total calories, your active calories and your total time, and it shows you your activity rings. I feel like we now need to go test this out on the Apple TV. (upbeat music) I'll be doing a modification of this. Love a good modification. So for this one, I did some modifications so I'm kind of in the middle of the pack. I didn't work to the hardest of my abilities, but I kept it kind of very centered. So this is kinda cool 'cause it does give you that nice range. Not gonna lie, working out on this massive TV was a really cool experience. Another thing that's awesome is if you happen to go to somebody's house who has an Apple TV and they might not have a Fitness+ subscription, all you need to do is get your Apple Watch close to it, and then you can connect your Apple Watch and you can do all of your classes and all of your data will be synced to your account, so this is awesome. I'm exhausted from all this working out that I've been doing today. I feel like a nice yoga session or a nice mindful cool down is in order. Let me grab the iPad and go outside. Welcome to my practice. I'm going to practice practicing, practicing, practicing. I'd like to do a 10 minute yoga class today, so I'm gonna go into the filter, let's click 10 minutes and some chill vibes. Let's see how this music looks. Oh yeah, Khalid's in the playlist. Khalid was my top played artist of 2020. I'm so glad to have some new yoga workouts because before the whole pandemic thing happened, I used to go to yoga at six o'clock in the morning every single day, and now I haven't really been practicing as much as I used to, so let's do this. (calm music) - [Instructor] Thank you for joining me and sharing your time and energy. Stay active, close your rings, see you next time. - That was my first yoga class. Wow, awesome. The thing that I love the most about this is they have so many classes that are 10, 20 minutes, so if you just have time to do something very quick or very simple, you can just go do this before you even start your day. I feel very relaxed. Now I'm gonna take all of my items back inside and I'd like to look at my stats for the day and check out what I accomplished. I did a lot of working out in 10 minute increments today. I'm exhausted. So I'm back from my first day working out with Fitness+ and I'm so excited to see what some of my data looks like from the day. Now I didn't do that many intensive workouts for the sake of just making this video. I do plan on sharing some more of my results on Twitter and Instagram, so be sure to follow me @iJustine. So let's take a look at what we did today. When you go into the fitness app, you're greeted with your entire summary of everything that you did. I have not quite met my move goal of burning 500 calories yet. So when I click into a workout, it'll show you everything that you did and I also love that it does integrate so well with the Apple Watch, so you'll be able to see all of your heart rate data right there. So I managed to run a mile. It shows your average heart rate, your average pace and where you are on the burn bar. Oh, my heart rate recovery as well. This is a class that I did last night that was actually a little bit more of a workout, so I did three miles in 30 minutes and I had to pause right there to go get a camera 'cause after halfway through, I was like, \"Wait a minute, I should be filming this.\" So I paused the workout and then picked it up and continued on. So the account that I'm using right now is not my actual personal account, so this is just one for the sake of testing this. So this is not representative of all of my awards. I'm obsessed. Yeah, I don't mess around when it comes to awards. Also, some of my competitions. I really love the Apple Watch. I really love having all of this information, all of this data basically in the palm of my hand. I'm able to take my heart rate, I'm able to now test my blood oxygen level and I'm able to track all of my progress, especially since I started running earlier this year. It's been really cool to be able to see those changes, not only in my pace but in my heart rate. So I'd say my first impressions of the classes, they're really really good. I love that the trainers focus on fitness. They basically are there to show you the way to do things. In other fitness classes, they tend to talk a lot about other things and they sometimes forget that they're teaching a fitness class, and it kinda drives me crazy because I'm like, \"Okay wait, you need to be focusing on making sure \"that you're verbally telling us the things \"that we need to do if we're not actually looking, \"not telling us about the party \"that you went to last weekend.\" And another thing that I like is they integrated all of the trainers in all of the classes. So you'll see some of the trainers, from the yoga classes to the strength to the HIIT to the dance workouts, all training and working together, and it kinda makes it feel like a really collaborative, fun, team based experience. This is so cool! Scott is in here, he's not even on a treadmill anymore! That's awesome that all of the trainers kind of train with each other in all of the classes. So far, I'm very impressed and I'm looking forward to seeing what other people think of the service. I think fitness is such an important part of people's lives and if it isn't something that is important in your life right now, I highly encourage you to maybe consider somehow getting involved in some sort of activity, even if it's just walking five, 10, 15, 20 minutes a day. Add on a little bit of time each day, and you'll be surprised how much better it can make you feel. I appreciate you guys taking the time and watching this video, and I hope that if you do try out Apple Fitness, that you will enjoy it as much as I did, and hopefully you'll find some trainers that you resonate with and will help you meet your fitness goals. In the meantime, I am gonna go eat dinner because I'm exhausted from all of my working out. (light music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Fitness",
        "Apple",
        "Apple Watch close",
        "Fitness",
        "Apple Fitness workout",
        "Apple Fitness app",
        "Watch",
        "classes",
        "class",
        "cool",
        "heart rate",
        "thing",
        "Fitness app",
        "love",
        "things",
        "heart",
        "kind",
        "workout",
        "rate"
    ],
    "transcript_entity_values": [
        "earlier this year",
        "every single day",
        "500",
        "a minute",
        "30 minutes",
        "Fitness",
        "10 minutes",
        "the Apple Watch",
        "iPad",
        "one",
        "the Apple Watch",
        "the Fitness+ Studio",
        "20 minutes",
        "almost two years",
        "their Apple Watch",
        "Apple",
        "Justine",
        "my first day",
        "10, 20 minutes",
        "iPhone",
        "Instagram",
        "Peloton",
        "2020",
        "Scott",
        "the day",
        "Greg",
        "six o'clock in the morning",
        "Twitter",
        "10 minute increments",
        "four",
        "a mile",
        "HIIT",
        "Khalid",
        "five",
        "daily",
        "10 minute",
        "Apple Fitness",
        "today",
        "three month",
        "last weekend",
        "California",
        "two",
        "Scott",
        "an Apple Watch",
        "three miles",
        "each day",
        "10",
        "first",
        "Santa Monica",
        "Apple Music",
        "last night",
        "Apple Watch",
        "15",
        "Apple TV",
        "the new Fitness+ service",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "FAC",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORDINAL",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.04430326819419861,
        -0.0811580941081047,
        -0.06046419218182564,
        -0.08841056376695633,
        0.013160448521375656,
        0.04070490971207619,
        0.05375983566045761,
        0.03914078325033188,
        -0.028742501512169838,
        0.04525911062955856,
        0.05020523816347122,
        -0.021409615874290466,
        -0.014497585594654083,
        0.006089129485189915,
        0.013419871218502522,
        0.053054310381412506,
        0.030752504244446754,
        -0.012518693692982197,
        -0.014373358339071274,
        0.04312361404299736,
        -0.030514592304825783,
        -0.049486540257930756,
        0.06113476678729057,
        0.03751632198691368,
        -0.03823723644018173,
        0.09163577109575272,
        0.032492704689502716,
        0.038782987743616104,
        -0.10455840826034546,
        -0.058936674147844315,
        -0.018596576526761055,
        0.013082695193588734,
        0.1172279566526413,
        0.007982657290995121,
        -0.0036547151394188404,
        -0.04531211778521538,
        0.05090221017599106,
        -0.010410496965050697,
        -0.07098951935768127,
        -0.03884958103299141,
        -0.042291782796382904,
        -0.028521979227662086,
        0.035236507654190063,
        0.025469716638326645,
        -0.06575166434049606,
        -0.06687449663877487,
        0.0055312649346888065,
        -0.04978375509381294,
        0.060968127101659775,
        0.0755760446190834,
        -0.09169802814722061,
        -0.04946121945977211,
        0.06215386837720871,
        0.024982377886772156,
        -0.050317905843257904,
        0.013395130634307861,
        -0.1048014909029007,
        0.0026494076009839773,
        0.04375985637307167,
        -0.08072296530008316,
        0.0659150704741478,
        -0.05934111401438713,
        0.01835622824728489,
        0.05881735682487488,
        -0.0575484037399292,
        -0.07783329486846924,
        -0.0015103875193744898,
        0.0012522381730377674,
        0.01321310643106699,
        -0.0025757509283721447,
        -0.08941839635372162,
        0.026599422097206116,
        -0.007992553524672985,
        0.026357347145676613,
        -0.0018748417496681213,
        0.08859270811080933,
        0.02318946272134781,
        -0.060446951538324356,
        -0.02140064164996147,
        0.04446088895201683,
        -0.0065649631433188915,
        -0.043674204498529434,
        -0.06039515137672424,
        0.005180547945201397,
        0.040392354130744934,
        0.022818727418780327,
        0.004172259476035833,
        0.010186446830630302,
        -0.048084571957588196,
        -0.021156974136829376,
        -0.07994021475315094,
        0.019348833709955215,
        -0.029299702495336533,
        -0.03501581400632858,
        -0.009476792998611927,
        -0.024575326591730118,
        -0.05516795068979263,
        -0.06481973081827164,
        -0.05547654628753662,
        0.06281944364309311,
        0.034336790442466736,
        -0.023527702316641808,
        0.017806779593229294,
        0.01535114087164402,
        -0.019551627337932587,
        -0.13282166421413422,
        -0.056809376925230026,
        0.037589672952890396,
        0.05103996396064758,
        0.05960993096232414,
        -0.010780944488942623,
        0.027525292709469795,
        -0.04726319760084152,
        -0.00944063812494278,
        0.031878210604190826,
        0.14051778614521027,
        -0.029754342511296272,
        0.07664599269628525,
        0.02161693200469017,
        0.03339290991425514,
        -0.020452745258808136,
        -0.06763799488544464,
        -0.023971473798155785,
        0.025545338168740273,
        -0.02288249507546425,
        0.006763003300875425,
        -0.08094557374715805,
        1.2668518615898756e-32,
        -0.03943995386362076,
        0.05136331915855408,
        0.03264185041189194,
        0.05421052873134613,
        -0.02736997790634632,
        -0.10519580543041229,
        -0.019166462123394012,
        0.08854763954877853,
        0.007804523222148418,
        0.025240721181035042,
        -0.014703232795000076,
        0.04670844227075577,
        -0.029951175674796104,
        0.05888047814369202,
        0.025839313864707947,
        -0.060521241277456284,
        -0.026315946131944656,
        -0.043663814663887024,
        -0.04505933076143265,
        0.02136911451816559,
        0.02348491922020912,
        -0.037991445511579514,
        0.017199281603097916,
        0.07741952687501907,
        0.08266875147819519,
        0.09237624704837799,
        0.07719559967517853,
        0.019952768459916115,
        0.08023498207330704,
        0.00987963005900383,
        -0.04677138105034828,
        -0.06042378023266792,
        -0.019675826653838158,
        -0.1358713060617447,
        -0.010994432494044304,
        -0.012582309544086456,
        -0.03907553106546402,
        0.015052534639835358,
        -0.025633595883846283,
        -0.019462108612060547,
        -0.04672551900148392,
        0.0064968750812113285,
        -0.046274203807115555,
        -0.07228334248065948,
        0.08831048011779785,
        0.04148326814174652,
        0.05246267840266228,
        0.06715567409992218,
        -0.04043860360980034,
        0.023136748000979424,
        -0.04371248558163643,
        -0.04438371583819389,
        -0.01685502752661705,
        -0.023561349138617516,
        -0.027743598446249962,
        -0.06034320592880249,
        -0.02587277442216873,
        0.06532377004623413,
        0.012332404032349586,
        0.06667307019233704,
        0.024987908080220222,
        -0.016846949234604836,
        -0.010195745155215263,
        -0.037856701761484146,
        -0.07929637283086777,
        0.10116104781627655,
        0.048336803913116455,
        -0.0698181614279747,
        0.0037751353811472654,
        0.09659410268068314,
        0.012834668159484863,
        0.039741482585668564,
        0.027882782742381096,
        0.0032311961986124516,
        0.04798516258597374,
        0.04115306958556175,
        -0.08851668238639832,
        -0.03730344772338867,
        -0.024039581418037415,
        -0.02652381919324398,
        -0.09122414141893387,
        0.06703222543001175,
        -0.029758257791399956,
        0.12633246183395386,
        -0.055369824171066284,
        -0.04655001685023308,
        0.016319483518600464,
        -0.023095915094017982,
        -0.017764143645763397,
        0.030925555154681206,
        -0.01108501572161913,
        0.0909917950630188,
        -0.08540428429841995,
        -0.03159720078110695,
        -0.05177943781018257,
        -1.1845069394784389e-32,
        0.03237862512469292,
        0.005725913681089878,
        0.007722684647887945,
        -0.041630201041698456,
        0.06756730377674103,
        -0.003639348316937685,
        0.03944495692849159,
        0.09489698708057404,
        0.060664571821689606,
        -0.08725659549236298,
        0.04701889678835869,
        -0.07879168540239334,
        -0.1111631840467453,
        -0.0016233341302722692,
        -0.03587089106440544,
        -0.021114032715559006,
        -0.08020101487636566,
        -0.05634007230401039,
        0.05470340698957443,
        -0.0078023504465818405,
        0.08131580054759979,
        0.1370145082473755,
        0.09683158993721008,
        -0.007437598891556263,
        0.021062564104795456,
        0.00411181477829814,
        0.03560957312583923,
        0.07577349990606308,
        0.05580281838774681,
        0.033617764711380005,
        0.0005014388007111847,
        -0.05443344637751579,
        -0.031769100576639175,
        -0.023040061816573143,
        0.03863739222288132,
        0.05187200754880905,
        -0.00377938081510365,
        0.05109025537967682,
        0.011623374186456203,
        -0.06451845169067383,
        0.04767508804798126,
        0.009425756521522999,
        -0.01697722263634205,
        -0.011846687644720078,
        0.02217966318130493,
        -0.08459287136793137,
        -0.027964383363723755,
        0.05741916596889496,
        0.004820931237190962,
        -0.014358005486428738,
        -0.048558611422777176,
        -0.06323571503162384,
        -0.03346360847353935,
        -0.004647960886359215,
        -0.012408294714987278,
        0.010896327905356884,
        -0.053027860820293427,
        -0.01771492324769497,
        0.015408150851726532,
        -0.029233040288090706,
        -0.011862026527523994,
        -0.028658540919423103,
        -0.05860145390033722,
        -0.08550628274679184,
        0.0005025382270105183,
        -0.05207088217139244,
        0.061904143542051315,
        0.0325612910091877,
        -0.02753787487745285,
        0.03675669804215431,
        -0.01845889911055565,
        0.016012534499168396,
        0.06376858055591583,
        0.027574796229600906,
        0.04395480081439018,
        -0.019794482737779617,
        -0.0524815209209919,
        -0.019583849236369133,
        0.05106912553310394,
        -0.050387363880872726,
        -0.043684229254722595,
        0.023233909159898758,
        0.041443392634391785,
        0.0765802189707756,
        0.11762300878763199,
        0.1288311779499054,
        0.08200421929359436,
        -0.01599239371716976,
        -0.01772630400955677,
        0.06444504112005234,
        0.021078338846564293,
        0.0501755028963089,
        0.059379395097494125,
        0.10793475806713104,
        -0.1392926275730133,
        -6.101095095800702e-08,
        0.01678583025932312,
        0.015803838148713112,
        -0.020575890317559242,
        -0.010785977356135845,
        0.023225536569952965,
        -0.05017397925257683,
        -0.04265710338950157,
        0.01563951000571251,
        0.07695537060499191,
        -0.03782098740339279,
        0.08478204905986786,
        0.014959943480789661,
        0.0033562155440449715,
        0.11847784370183945,
        -0.0028603195678442717,
        0.006954845041036606,
        -0.09976533055305481,
        0.10335301607847214,
        -0.03300400450825691,
        -0.07996954023838043,
        -0.06139758974313736,
        0.05273498222231865,
        0.006585488095879555,
        -0.013369116000831127,
        0.05696745589375496,
        -0.011430528946220875,
        -0.03837916627526283,
        -0.03632134571671486,
        0.028313426300883293,
        0.0035195527598261833,
        -0.07058275490999222,
        0.016610031947493553,
        0.01240247767418623,
        -0.01169663481414318,
        -0.06703423708677292,
        -0.04579252749681473,
        -0.040080443024635315,
        -0.008127979934215546,
        0.008633135817945004,
        0.02377045527100563,
        -0.025771258398890495,
        -0.10949486494064331,
        -0.05481778830289841,
        -0.005262273363769054,
        0.02718975581228733,
        -0.07843443006277084,
        0.03101324662566185,
        -0.08875961601734161,
        -0.04783374071121216,
        -0.006267643999308348,
        -0.021555699408054352,
        0.016244418919086456,
        0.056418243795633316,
        -0.01691424287855625,
        0.03173118457198143,
        0.00991208478808403,
        0.01982036605477333,
        -0.002972519723698497,
        -0.03219647333025932,
        -0.01023795548826456,
        0.04459600895643234,
        -0.014684605412185192,
        -0.030957456678152084,
        0.02213466539978981
    ]
}