{
    "id": "SsNM05JYOs0",
    "title": "The SMARTEST Watercooling I Have Ever Seen - iBUYPOWER Element CL",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-08-28T19:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=SsNM05JYOs0",
    "category": "Science & Technology",
    "tags": [
        "ibuypower",
        "cyberpower",
        "dell",
        "alienware",
        "system",
        "review",
        "showcase",
        "watercooling",
        "roundup",
        "buyers",
        "guide",
        "prebuilt",
        "pc",
        "gaming",
        "how",
        "to",
        "linus",
        "hardline"
    ],
    "views": 513629,
    "likes": 23684,
    "comments_count": 928,
    "description": "Thanks to iBUYPOWER for sponsoring todays video! Check out the new Element CL Plus and the full line of Element CL hard-line liquid-cooled gaming PCs at   iBUYPOWER is a leader in cost-effective pre-built PC's. The Element CL provides the beauty of hard-line custom cooling without the high price.  Buy: Intel i9-10900K On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy: Nvidia RTX 2080 Super On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy: GSkill Trident Z 32gb On Amazon (PAID LINK):  On Newegg (PAID LINK):   Buy: XPG NVME SSD 1tb On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://ibp.gg/scecl",
        "https://geni.us/oTm4jG",
        "https://geni.us/GqCBA",
        "https://geni.us/j6uJ1",
        "https://geni.us/jLOT",
        "https://geni.us/5mKAK",
        "https://geni.us/IMYA3A",
        "https://geni.us/maUKwM",
        "https://geni.us/5HjYo",
        "https://geni.us/0ruFV",
        "https://geni.us/eA8TFAh",
        "https://geni.us/jCnve",
        "https://geni.us/sORlg",
        "https://geni.us/TTiEj8f",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh, this is, this is gonna be fun. This is sponsored by iBUYPOWER. And when I heard that they have a brand new water-cooled gaming system, I assumed that it was gonna be astronomically expensive. Like they're kind of known for, you know, shipping you a gaming PC that's about the same price, sometimes even tiny bit less than what you would get for just buying all the components and building it yourself. So I kind of assumed when I heard that they had a water cooling thing, that they were going to just like, this was the emerging PC, but, turns out not really. It starts at 1600 bucks and goes up to 2200 and that's for like pretty much the fastest gaming computer you can buy. So it's pretty sweet, let's get into it. Oh, it's a box in a box, unboxing number two, coming right up. Oh, cool, okay. So normally when you're shipping someone like a hard line water cooled PC, it's an absolute nightmare for kind of everyone involved, because like, if it moves a little bit in shipping, then maybe one of the tubes will kind of come out a bit, and then it'll start leaking and then you turn your computer on, pssh! You're just dead, no good. So we have this presumably acrylic tube, maybe P, I'm not sure. And these fittings here that are kind of like, it's like what you'd find in your house or just general industrial quick disconnect sort of stuff. That's definitely not coming out, that's like most of my weight. I don't wanna do more 'cause I'm afraid that this handle's going to pop off. So let's see what else we have in here. We've got a power cord, can't take those for granted, several seda connectors for if you wanna upgrade your storage down the line. You've got your standard motherboard standoffs hard drive screws, that sort of stuff. Great for if you need to upgrade in the future. Driver CD, no one's gonna use that. Oh, this is like my favorite, but also the most stressful thing to do. Oh yes. iBUYPOWER Zeus E2. As for the keyboard though, it's fine. It's an membrane keyboard, it does the job. Onto the main show here though. Actually let's turn it around and see. There we go. So this is the iBUYPOWER Elements CL. Let's take a look. We clearly need to take some foam out before we start it up. So the average, you know, hard line water cooled PC that they said takes about four, five hours to build. And they wanted to get that time down to one hour. We have the exact same tubes, for every single different layout. How they've been able to do that, is by actually having adjustments in here for height up at the distribution block over here, and also like the exact socket placement on the motherboard right here. You're able to move the whole CPU block, now sort of in this direction about half, maybe three quarters of an inch. Up here, you have a little bit of adjustment to go up and down, say they're able to use the exact same tubes for all of their different layouts. It does look like though that they'd be using the same tubes and the same placement for all of their GPU's. So presumably they're able to overcome that with just using the same block placement right here, (paper peeling) I'm just gonna peel this off. So normally what you'd see is like CNC acrylic, so probably one piece that's cut and another one that's flat and you smash them together with an O ring. All of that's really expensive. So what they've done here instead, they have cast nylon. So they do plan, if there's interest, they will do a full acrylic version for probably about $100 premium. But this seems like a pretty good compromise to me. Biggest compromise of all though, this is an aluminum water cooling loop. So radiator, CPU block, GPU block, all made out of aluminum. This allows for them to greatly reduce the cost of the whole thing. It's not a perfect solution, but again, when I've said like the $100 premium edition that would also have copper blocks in it. So that would be kind of your maximum performance. Great one, let's open the back. Well, if you ever want to add something that has Molex or say that they certainly have you covered there. This though is not a modular power supply. I believe that this one's 700 Watts, so more than enough power for your whole system, but you are going to be a bit constrained by power if you want to upgrade in the future. So if you look in here, there's these little tabs and I should press those in, so presumably start coming off. So there's the temper glass panel. And then is there an acrylic panel below it? Wait, is that glass? I have a bad idea. Don't tell them, but, okay, yeah. Confirmed. If that was acrylic, it would now have a Mark on it, but it's tempered glass. So they've made, I'm guessing some sort of a gasket that goes all the way around on a tempered glass panel for the reservoir. That's actually really cool. And now we're able to see the fill and drain ports. So fill ports, just bring it up here, if you wanna top her up, then there's just a little drain port here on the front. So right here, final water cooling thing. We have a D5 pump and you're gonna want to pump a lot of water in here because this thing's gonna output some heat. So we've got an Intel i9-10900K, Nvidia RTX 2080 Super, and two G.SKILL Trident Z, I think it's 32 gigabytes, and finally a one terabyte SSD. Losing all of my screws. Candy, let's just, sh! We didn't lose that screw, no one knows. Warning, please read instructions on removing the foam insert before turning on this computer. I hadn't read the instructions, but we did take up the foam. So I think we're fine. Turn out that they actually chose a motherboard that doesn't have onboard wifi as far as I can tell, but they included a little wifi adapter for you, which is nice. It's that magnetic. Oh, that's fun. You can just magnet it where it rolls. The whole front isn't magnetic. Oh ha ha. Screw saga finally comes to an end. I hope it's super RGB. I really like super RGB things. Cause like, you can always turn the RGB off, but if you don't have RGB, you can't turn it on. (upbeat music) Oh, it's RGB. There's just a tiny bit of RGB where the water flows so you're able to see all the bubbles, It kind of hits those. (paper peeling) Not my best peel ever, but that one was pretty good. Oh actually there's more, nice. Oh, double nice. (upbeat music) The risky peel down here. (paper peeling) So here, in DOOM Eternal on 4K ultra nightmare settings. And, we're getting what, a 100, 120 FPS somewhere around there. Overall, I would say this looks fantastic. Again, it's one of those things where it's like, wow, whoever would have thought that a $2,200 gaming computer would work well. But at the same time, that's a lot cheaper than most of the stuff that we have around here. We do need to check to see just how well the thermals are doing, so wow. Not bad. The CPU maximum temps so far is 52 degrees. GPU, let's go down here, maximum temp on the GPU is also 55 degrees. Now it is going to get hotter, like I've only been gaming for a couple minutes. If you leave it for half an hour, it's going to get hotter. But at the same time, even if it like gets 20 degrees hotter, you're still in really good shape. You can purchase the Elements CL plus as a prebuilt, or you can completely custom configure it at ibuypower.com. Check them out and get all the information at the link below in the video description. Hope you guys have an awesome day. Thank you to iBUYPOWER for sponsoring and yeah. Get subscribed to this Linus tech tips and so long. I'm gonna keep on playing some DOOM here. Oh, it is. Oh balls. This is bad. (guns firing) It's fine. It's fine.",
    "transcript_keywords": [
        "kind",
        "RGB",
        "water",
        "gaming",
        "bit",
        "GPU",
        "turn",
        "thing",
        "block",
        "super RGB",
        "acrylic",
        "CPU block",
        "water cooling",
        "water cooling thing",
        "tubes",
        "gaming computer",
        "CPU",
        "sort",
        "pretty",
        "super RGB things"
    ],
    "transcript_entity_values": [
        "700",
        "2,200",
        "seda connectors",
        "Elements CL",
        "Intel",
        "4",
        "one",
        "120 FPS",
        "100",
        "the iBUYPOWER Elements CL",
        "55 degrees",
        "D5",
        "half an hour",
        "52 degrees",
        "2200",
        "32 gigabytes",
        "20 degrees",
        "100",
        "about $100",
        "about four",
        "Nvidia",
        "Candy",
        "iBUYPOWER.",
        "two",
        "iBUYPOWER Zeus E2",
        "three quarters",
        "GPU",
        "about half",
        "five hours",
        "1600 bucks",
        "a couple minutes",
        "CNC",
        "RGB",
        "one hour",
        "Linus",
        "CPU",
        "10900",
        "G.SKILL Trident Z",
        "Molex"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.1304241269826889,
        -0.008091703988611698,
        0.02983609400689602,
        0.04285506159067154,
        0.06742355227470398,
        -0.054660458117723465,
        0.059782836586236954,
        0.06646732985973358,
        -0.06365703046321869,
        -0.024183757603168488,
        -0.011189266107976437,
        -0.013307265006005764,
        0.039067819714546204,
        -0.038778532296419144,
        0.043750274926424026,
        0.0297330804169178,
        0.048985518515110016,
        -0.042388271540403366,
        -0.05231546238064766,
        -0.08902698755264282,
        -0.005081284325569868,
        -0.0849694311618805,
        -0.0016844789497554302,
        -0.009214197285473347,
        0.004224234726279974,
        0.07076797634363174,
        0.04310460761189461,
        0.0060218931175768375,
        0.01946357637643814,
        -0.04345012083649635,
        -0.05806153640151024,
        0.014499957673251629,
        0.046529579907655716,
        -0.057039275765419006,
        0.01802852191030979,
        -0.07978413999080658,
        0.06224207580089569,
        -0.08785728365182877,
        -0.125046506524086,
        -0.1044999212026596,
        -0.06886614859104156,
        -0.044773317873477936,
        -0.009959750808775425,
        0.09709906578063965,
        0.028293708339333534,
        0.0464077852666378,
        -0.0011674051638692617,
        -0.018071556463837624,
        -0.07059872895479202,
        0.016035202890634537,
        -0.025016872212290764,
        -0.10239294171333313,
        0.02362745627760887,
        0.058838311582803726,
        -0.04369940608739853,
        0.037349823862314224,
        -0.0014427268179133534,
        -0.052822500467300415,
        0.05909062176942825,
        0.0029538616072386503,
        0.07662449032068253,
        -0.12761573493480682,
        -0.044707074761390686,
        0.06136775016784668,
        0.04200788959860802,
        0.006607984192669392,
        -0.032261624932289124,
        0.012668696232140064,
        -0.04356943815946579,
        -0.017926683649420738,
        0.022590266540646553,
        -0.014385920949280262,
        0.04677474498748779,
        0.025283457711338997,
        -0.03366387262940407,
        0.02878694050014019,
        0.0993681475520134,
        -0.09008432179689407,
        0.0015562111511826515,
        0.0011954196961596608,
        -0.05139816179871559,
        -0.02926471456885338,
        -0.0007827029330655932,
        -0.020154302939772606,
        0.06259205937385559,
        -0.005979862064123154,
        0.06303264200687408,
        -0.03842379152774811,
        0.04460511356592178,
        -0.0726458802819252,
        0.06695892661809921,
        0.07264236360788345,
        0.027826176956295967,
        0.009555271826684475,
        0.023424625396728516,
        0.07290078699588776,
        -0.036649398505687714,
        -0.04846108332276344,
        -0.03530336916446686,
        -0.0007056448375806212,
        0.03570794686675072,
        0.051491785794496536,
        0.07441763579845428,
        0.02815563790500164,
        -0.012920290231704712,
        -0.027994249016046524,
        -0.031889136880636215,
        0.07248765230178833,
        0.026796575635671616,
        -0.018038595095276833,
        -0.10252263396978378,
        -0.0101126404479146,
        -0.03294288367033005,
        -0.006782724522054195,
        -0.027235660701990128,
        -0.03205924853682518,
        -0.07000555843114853,
        0.039882540702819824,
        0.11171547323465347,
        -0.018872210755944252,
        0.02566927671432495,
        -0.01319095864892006,
        -0.053758539259433746,
        -0.0008701789192855358,
        0.044035058468580246,
        0.051544614136219025,
        0.005570755340158939,
        8.274353959264022e-33,
        -0.029348043724894524,
        0.02274658903479576,
        -0.07828880101442337,
        -0.04846825823187828,
        -0.04184464365243912,
        0.03184010833501816,
        0.028881752863526344,
        0.0029432151932269335,
        -0.0530569814145565,
        0.08467051386833191,
        -0.00962359830737114,
        -0.009443039074540138,
        -0.08695679157972336,
        0.08648734539747238,
        0.034883465617895126,
        -0.11640549451112747,
        -0.013968650251626968,
        -0.0007131402962841094,
        0.018917910754680634,
        0.05679412931203842,
        0.017696918919682503,
        0.04896274209022522,
        0.026903783902525902,
        -0.0490456260740757,
        -0.01318946573883295,
        -0.004492325242608786,
        0.021460358053445816,
        -0.014407021924853325,
        0.07344309240579605,
        0.01075090654194355,
        -0.006196160800755024,
        -0.056066203862428665,
        0.010850878432393074,
        0.04325813055038452,
        -0.033285755664110184,
        -0.005149275995790958,
        -0.03912150114774704,
        -0.09213957190513611,
        0.01031158585101366,
        0.025203760713338852,
        -0.0031955118756741285,
        0.07393749803304672,
        -0.061392851173877716,
        -0.06931676715612411,
        0.027329592034220695,
        -0.04900096729397774,
        -0.05402912572026253,
        -0.02895340882241726,
        0.023638414219021797,
        -0.006532358471304178,
        -0.10117510706186295,
        0.036051660776138306,
        -0.061174966394901276,
        0.03753764554858208,
        -0.024835173040628433,
        -0.02237400971353054,
        0.03278452530503273,
        0.030192676931619644,
        0.07346699386835098,
        0.05545640364289284,
        -0.04630599543452263,
        0.025404255837202072,
        -0.013782870955765247,
        -0.041659049689769745,
        -0.06481614708900452,
        0.05827256664633751,
        0.08898676186800003,
        0.004764026030898094,
        -0.10424342751502991,
        -0.004264889284968376,
        -0.047262467443943024,
        -0.029598241671919823,
        0.0372907854616642,
        0.016942119225859642,
        0.06638634949922562,
        -0.04803238436579704,
        -0.08690305054187775,
        -0.04645255208015442,
        -0.0463266484439373,
        -0.04892033711075783,
        -0.05555987358093262,
        0.07804621011018753,
        0.0378536581993103,
        0.12456373870372772,
        0.011410236358642578,
        -0.025895224884152412,
        -0.052414294332265854,
        0.014127162285149097,
        0.007377776317298412,
        -0.047382842749357224,
        -0.02635076455771923,
        -0.02461838163435459,
        0.03393400460481644,
        -0.01036474946886301,
        0.01219792291522026,
        -8.075626353681945e-33,
        -0.019411591812968254,
        -0.08561244606971741,
        0.018998147919774055,
        0.11939961463212967,
        0.02466229721903801,
        -0.009801177307963371,
        0.007494238205254078,
        -0.047753430902957916,
        0.055736709386110306,
        -0.030492516234517097,
        0.03672066703438759,
        0.0809246227145195,
        -0.0395965576171875,
        -0.03585570305585861,
        0.04647492617368698,
        -0.02380579710006714,
        -0.026316408067941666,
        -0.0911649614572525,
        0.06718692183494568,
        -0.03167260065674782,
        0.0626310333609581,
        0.013087788596749306,
        0.05507879704236984,
        0.012578582391142845,
        -0.027415918186306953,
        0.01833554543554783,
        0.05076306685805321,
        0.030510133132338524,
        0.06752607971429825,
        0.04101262986660004,
        -0.046448126435279846,
        0.06285898387432098,
        0.019784921780228615,
        0.043890874832868576,
        -0.0012280212249606848,
        0.001626059878617525,
        0.062225304543972015,
        0.032445549964904785,
        -0.017523864284157753,
        0.016161203384399414,
        0.03712644800543785,
        -0.029239512979984283,
        0.02573990449309349,
        -0.029403559863567352,
        -0.020286455750465393,
        0.03487948328256607,
        -0.017910853028297424,
        -0.13800494372844696,
        0.03322434052824974,
        -0.012703088112175465,
        -0.011346305720508099,
        -0.021836092695593834,
        -0.054708752781152725,
        0.05146518349647522,
        -0.0037341597490012646,
        -0.08576392382383347,
        -0.004913481418043375,
        0.03441055864095688,
        -0.03378406539559364,
        -0.09318941831588745,
        0.08064641803503036,
        0.06330735981464386,
        -0.003296733135357499,
        -0.0176805779337883,
        0.02467976324260235,
        0.081992968916893,
        0.063777394592762,
        0.03195874020457268,
        -0.015953240916132927,
        -0.04059788957238197,
        -0.04632306471467018,
        -0.018572328612208366,
        -0.009663294069468975,
        -0.11389907449483871,
        -0.03109094873070717,
        0.012445051223039627,
        0.01816100813448429,
        -0.0029265745542943478,
        0.0015187924727797508,
        -0.03480251505970955,
        -0.011901361867785454,
        0.07386373728513718,
        0.002800180111080408,
        0.0068502845242619514,
        0.05582144111394882,
        -0.059499673545360565,
        -0.02014082297682762,
        -0.022154968231916428,
        0.015855668112635612,
        0.026526587083935738,
        -0.05212322995066643,
        -0.034653086215257645,
        -0.0633254274725914,
        0.08921150118112564,
        -0.030596107244491577,
        -5.3858517645721804e-08,
        0.012295628897845745,
        -0.03034650720655918,
        0.046888984739780426,
        0.07391270995140076,
        0.05582985281944275,
        -0.09565360099077225,
        0.010424263775348663,
        0.09654465317726135,
        0.012613102793693542,
        0.030462516471743584,
        0.059129416942596436,
        -0.050331853330135345,
        -0.03648494929075241,
        -0.006154365837574005,
        0.024371150881052017,
        0.027421148493885994,
        -0.015687821432948112,
        0.046050120145082474,
        -0.014961017295718193,
        -0.06217994913458824,
        4.087821071152575e-05,
        0.040741730481386185,
        0.05721857026219368,
        -0.03815726563334465,
        -0.005266229622066021,
        0.05051887035369873,
        0.056022677570581436,
        -0.05724514275789261,
        0.12653568387031555,
        -0.03624707832932472,
        -0.0425419807434082,
        -0.03303723782300949,
        0.10227788239717484,
        -0.0632350891828537,
        0.12142323702573776,
        -0.020542731508612633,
        -0.010874920524656773,
        0.06624128669500351,
        0.06857717782258987,
        0.04073425382375717,
        -0.03262905403971672,
        -0.06571120768785477,
        -0.05499054864048958,
        -0.004113561939448118,
        0.08405561745166779,
        -0.012200704775750637,
        -0.1996711641550064,
        -0.08919035643339157,
        0.0003830722998827696,
        0.07591340690851212,
        -0.004885131027549505,
        -0.021381206810474396,
        -0.0039921351708471775,
        0.01646566390991211,
        0.008337870240211487,
        0.044269148260354996,
        -0.02853430062532425,
        -0.020004604011774063,
        -0.0024323053658008575,
        0.07232057303190231,
        0.034881819039583206,
        -0.12277201563119888,
        0.004622796084731817,
        0.024601668119430542
    ]
}