{
    "id": "stnmzdc13Fs",
    "title": "This Kills Your Computer - USB Kill",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-03-03T16:01:24Z",
    "video_url": "https://www.youtube.com/watch?v=stnmzdc13Fs",
    "category": "Science & Technology",
    "tags": [
        "usb",
        "usb kill",
        "usb killer",
        "apple",
        "macbook",
        "iphone",
        "samsung",
        "usb-c",
        "usb-a",
        "usb c",
        "usb a",
        "sony",
        "ps5",
        "gadget",
        "test",
        "austin",
        "austin evans"
    ],
    "views": 642461,
    "likes": 25413,
    "comments_count": 1533,
    "description": "Hey. Do NOT try this at home.  Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 What is USB Kill? 2:09 Gateway Laptop 3:26 Dell Rugged Laptop 4:52 Anker USB Charger 6:26 Nintendo Switch Lite 7:33 Samsung Galaxy Z Flip 3 9:35 Sony PS5 10:59 iPhone SE 12:31 MacBook Pro 13:45 MacBook Air M2",
    "description_links": [
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- This is USB Kill, and it is the most dangerous piece of tech that I own. Let me show you how it works. All right, I'm just gonna plug this thing in, we're gonna go for it. Simple as that. Super, super duper dead. So these may look like innocuous USB sticks, but inside they are filled with capacitors. So this is the V1 that we did a video on all the way back in 2017. The way this works is that it has a bunch of little capacitors so when you plug it in it charges those capacitors via power from the USB port, and then turns around and sends all that power directly back into the device, in many cases straight up killing it. Now before you get any bright ideas about how this would be a hilarious prank to play on your friends, keep in mind that this can actually be illegal if you use it to destroy other people's technology. Someone tried this at a school, and killed a bunch of school computers. Guess what? He went to jail, and had to pay like a $50,000 fine. Now the reason that a device like this exists is purely for defensive purposes. So theoretically if you are a manufacturer of any number of devices that have a USB port, you would buy one of these things to make sure that whatever shielding you've done, whatever grounding you've done on your USB is actually sufficient to support protecting against a device like this. What I really wanna do is use this newest version of the USB Kill on an unfortunate number of devices to see exactly how far we've come over the last eight years with devices that have USB-C, that have theoretically better shielding, and how many are going to succumb to the most basic looking USB stick you've ever seen. So while I hope that most of these devices survive, I will be making a donation for the value of any devices destroyed to The Electronic Frontier Foundation, which is a great organization that does a lot of work around the internet, computers, devices. But if I can say anything before I get started it is this. Do not try this at home. I am doing this testing so that you do not have to. And hopefully this video serves as a warning not only to you who maybe want to be a little bit suspicious of your friend walking around with that black USB stick. And for manufacturers who watch this video, and hopefully decide to put a little bit more effort into defending their devices against such a simple basic attack. Let's give it a try, shall we? So our first proper test is going to be with a Gateway Windows laptop. Now this is significantly newer than the Chromebook that we just killed, and I will say that while I have low expectations to this I'm gonna try something that's a little bit different compared to the first generation USB Kill. The normal mode you plug it in, it charges capacitors and sends it back. Because this has a built in battery, theoretically I can just trigger it, and it would just send that power in even to a completely offline device. So let's see what happens. Here goes nothing. So now that it is plugged in I'm going to trigger USB Kill. (USB Killer clicks) There it went. Hear it? All right, I'm gonna stop it. It will send power for as long as I want via the app. So what you just heard, that click, that was all that power coming through, and likely blowing something on this system. So I'm gonna disconnect USB Kill, and I am going to try to fire this up. Nothing. Nothing at all. (cash register dings) I mean that's extra scary, if I'm honest with you because theoretically you could come back to your computer that is completely dead, and have no idea what went wrong. There's no signs of anything. I smelt something for a split second, and now it's kind of gone. Okay, let's move on to some devices that hopefully are a little bit more robust than this very affordable Windows device. Yikes. Next up we have one of the most durable laptops I have ever seen. I would hope that Dell have put in the engineering resources to prevent against an attack like this, but just because it is physically tough has no bearing on whether or not they actually did the work to properly ground and shield USB ports. So let's give it a try. So I'm gonna use this in classic mode, which means that because the laptop is on it should kill it within two seconds, or Dell have done a good job of defending it. All right, here we go. (USB Killer clicks) Ooh. And that is dead. So that one was extra. I heard two cracks. It's almost like it pushed through one side, and then it went all the way through on the other. Wow. I mean I can try to get this thing to boot up, but that looked... Oh no, hell no, dude. Extra fried. Wow. I thought this one actually might have a shot. If you wanna see a followup video to this, let me know. I might actually try to open some of these up, or find someone who can help me actually kind of get to the bottom of exactly what is dying on these systems. But, wow, that is one rugged laptop that absolutely no match for the USB Kill. That is legitimately terrifying. Oh man, this video's gonna get expensive real quick. I thought some of these were gonna survive. - [Alex] It's for a good cause. - It is for a good cause. It's all for a good cause. The more things that die the more money I'm gonna donate. But wow, that is okay. All right, well let's just keep it on rolling. So next I'm gonna do something that's very unorthodox. I'm gonna try a USB-C charger. Now, general word of advice, don't trust USB sticks you find, and also don't trust random USB ports. But I wanna see what happens when we connect the USBq Kill to a charger. Can someone find the fire extinguisher? Why are you the firefighter? I don't like this. - Well, I like starting the fires. - No. Okay. Again, I will just give you a fair warning, do not try this at home, we are doing this purely for educational purposes, and I mean that. I wanna know what happens here. Hopefully nothing because there is a lot of electronics in something like this which is a little GaN charger, but let's find out. Okay. Three, two, one. Interesting. So what I assume is that if it doesn't detect a signal it won't work by default. So I'm gonna try manually triggering this now. So I'm gonna plug it in again, and we're gonna send it. Ready? (USB Killer clicks) Okay, I heard a click. Nothing's on fire. So we're gonna unplug that. Now I guess let's plug a normal USB into this, and see if the charger still functions. Absolutely nothing. It killed the charger too. Oh my God. So that's the power of this latest USB Kill because previously it only worked when you plugged it directly into a device, where it would take the power and send it back. But because this can be manually triggered, and there's also other stuff I didn't get into. There's a little magnetic ring that you can wipe over this thing. You can set programs. This thing is ridiculously dangerous. It has killed every single thing we've tried. Oh my God. This one, this one's gonna hurt. This is a Nintendo Switch Lite. As we all know, the best version of the Switch. I have modified this one. I did not do a great job with the modifications which is why it has been selected for this particular excursion. Boy, considering that we have killed a whole bunch of devices right now, my odds of a Nintendo Switch Lite surviving are incredibly low. So I'm gonna try it in regular mode, I think it should just work, but if not I will manually trigger it. All right, here we go. Switch Lite. Let's see what we got. - [Ken] No. - That was the loudest snap. Oh my God. - [Joanna] That made me sad. - That made me sad too. I spent a lot of hours on this. I, maybe naively hoped, that some companies had actually built in some protections to try to help defend against this kind of stuff. I'm not seeing it at all. We have much more expensive items coming up. And now I'm like \"Do they even have a chance?\" - [Alex] If you thought that was bad, we're gonna have to sacrifice a flippy boy. - Oh God. This is the part of the video that makes me deeply uncomfortable. This is a Samsung Galaxy Z Flip 3. Now because the USB Kill 4 has been absolutely destroying everything we've got, I actually wanna try, before we do that one, to go with the original USB Kill. So in our first video, this one was very dangerous. It did actually not kill the USB-C devices. At least one of the USB-C devices survived. Here goes nothing. The USB Kill 1.0, let's give it a try. Oh, word. Yeah, totally fine, unaffected at all. Okay. Now let's try with USB Kill 4. (laughs) I'm not ready. My heart is pounding right now. Okay. USB Kill 4. Let's go. Three, (dramatic music) two, (dramatic music) one. (dramatic music) Okay. That is very promising. This is good. At least it won't automatically die. I'm gonna hit the button, I'm gonna see what happens. Everyone ready? Three, two, one. No. Oh, it restarted. It restarted. Oh my God. Yes, yes. - I love how you just threw it at me. Like get away from my Z Flip. You like hit me in the face. Jesus. - Wait, but wait, no. Wait, we might have... - [Alex] Oh, oh. - It did start to boot up, and it now is not. Come on, come on, come on little Z Flip, you can do it. Oh my God. Okay, okay, okay. We're in here. So screen is functional. Okay, now let me try to see if power works though 'cause that would obviously be a massive, massive deal if the power no longer works. Plug it in. Oh my God. - [Alex] Wow. - I am legitimately impressed. - Suck it Jerry Rig Everything. - Zach, we love you. - Not durable phone my ass. (everyone laughs) - Let's move on to a device that boy oh boy I hope survives, a PS5. Now, you might see this, and think \"Austin, you lost your marbles.\" And to that I would say \"Probably if this video \"keeps going on for much longer.\" So for reference this is a PS5 1100. I highly doubt that there's any difference between the PS5 models, but just so you know PS5 1100. So let's plug it into this front USB port, and hope, cross your fingers, cross your toes, cross your eyes. I don't know. (laughs) Three, two, one. - [Ken] No. - Oh my God. This one hurts so much. I like to remind everyone that I will be making a substantial donation to the EFF after this video. A much more substantial donation than I thought. Let's give it a shot. Hold on, it might not be dead, dead. I'm gonna unplug it for a second. Let's see if we can get any signs of life out of this guy. All right, so let's plug it back in and... Oh, it's dead. It is dead. - [Ken] Oh, oh, oh. (gentle music) - Okay, I see lights. No, it turned off. Okay, wait, hold on. But that was something. No other device has given us a sign of life after it completely died. Z Flip restarted, but this tried for a second. Hold on. It's probably mortally wounded. There are signs of life with this, but yikes. This is an iPhone SE, which is, of course, outfitted with a Lightning port, which has traditionally been fairly resistant to these kind of attacks. And in our original video Apple products were fairly durable, right? So my hope is that this will survive, but theoretically this device was designed specially with Lightning in mind. Here goes nothing. Again, I'll show you it's fully functional. In fact, you know what we'll do, we'll do something real sad. We're gonna record front facing video. Okay, let's just really hope that this does not work. I don't want this to work. Three, two, one. Ooh. Ooh, I heard a click and it didn't do anything. Let me unplug it right now. Whoa, whoa, whoa. Oh, well... Well hang on. Wait, that's good, that's good. That's what happened with the Z Flip. It triggered and is restarting. This looks fine. Touch screen is functional. Let's see, is our video on there? Probably not. No, the video didn't save. That's fine. Let's just make sure that it still accepts power. Oh wow, okay. So what we have here is a still functional device, but a Lightning port which no longer works. All right, so I'm gonna put this on, my Z Flip is a wireless charger. Let's see if it works. Okay, it does work. So the fact that we have no longer any support for our Lightning port to function at all is probably gonna be a very expensive repair, and yes you can work around with wireless charging, but that's still a pretty major downside for the device. But technically at least it is not completely dead. So we'll give that a, not a thumb's down, a thumb's wiggle. A wiggle thumbs. So now we're down to MacBooks. Plural MacBooks unfortunately. This is 2011, I think. A 2011 15-inch MacBook Pro. So we're just gonna go straight USB-A into it, and see what happens. I don't think this one's gonna make it. Plug it into our MacBook in three, two, one. (USB Killer clicks) Oh, okay. That's very good. Very, very good. So we heard the click, so it discharged. Now, does the system actually work? It does. So I'm gonna plug it into a functioning port so you can see that the whole keyboard lights up. So at least one of our USB ports still work. So I can go... That works. Now let me plug it into the port that we just USB Killed. And nothing. Okay. So I'm not gonna give that a complete pass, because that USB port is dead. But unlike something like an iPhone, in which if you kill the Lightning port on an iPhone it is not useless but in deep, deep trouble. A single dead USB port on a device is actually kind of something you can work around, right? This has two USB-As. We'll give this a mostly pass. I will say Apple devices and Samsung devices, the only ones that have had any shot against this thing. Last but certainly not least, we're gonna try a brand new M2 MacBook Air. You might ask, \"Austin, that doesn't look very brand new.\" Well, it's a midnight one, so I touched it once, and it now looks like this. So there's a few things going for this. Not only is it a brand new device, but it's also using, of course USB-C, which we've seen is a little bit more resilient across the board. But certainly Apple's implementation based on our last video was quite robust. The last one survived, right? It should be fine, right? Someone make me feel better right now. It should be fine, right? - [Ken] Midnight? More like good night. - Ok. - [Ken] Is that what you're looking for? - No, that's actually the opposite of what I'm looking for but thank you. All right, let's plug this in to a USB-C port in three, two, one. (USB Killer clicks) Okay. I'm gonna unplug it. Very good sign. MacBook is still functional. Okay. So at a bare, bare minimum it is gonna be hopefully like the other MacBook in that maybe the port could be damaged, but the system didn't blink an eye. So we're gonna first start by plugging into a USB port that I did not use. Oh snap, no charge. Okay, let me try the other USB-C. Oh, that's bad. Both USB-C ports are not accepting a charge. Now, I'm gonna try USB, but also before that I wanna try connecting via MagSafe to see if that works since that is a physically different connector. Ready and... Ooh, that looks good. Ooh, no, it's not. So the MagSafe cable thinks that the device is fully charged and good to go, which seems normal, but here's the thing, the system says it is not charging right now. So none of the USB-C ports or the MagSafe work. So even though on the surface this is fine, this is no big deal, the MacBook's still working, it didn't skip a beat, but as soon as this runs out of charge it's dead forever. So I'm gonna use a USB-C dongle. I'm gonna try with the keyboard. I'm also gonna try to plug it in a different way and restart it. I wanna give this a fair shot before we totally call it dead, but wow. Wow. This video has been a roller coaster. Nothing. No. So there's no data to these ports either. So out of all the devices we've tested today, the winner, and the only one that survived unscathed, is a Z Flip 3? Who would have guessed that? Thank you very much for watching this video. Do not try this at home. This has hopefully been enlightening for you to understand that something as innocuous as a little USB stick that you find on the ground could be incredibly, incredibly dangerous. And this is a plea to manufacturers who watch this video, do you make a product that has a USB port? You should test it with the USB Killer, and do whatever you can to defend against it. I, of course, will be donating a very large sum to the EFF to make up for some of the devices that we have killed here. I gotta sit down after this one, man. This was the most stressful video I've shot in a long, long time. Whatever you do, don't trust the USB stick, it's not safe.",
    "transcript_keywords": [
        "USB Kill",
        "USB",
        "USB port",
        "Kill",
        "USB ports",
        "USB stick",
        "devices",
        "video",
        "device",
        "port",
        "USBC",
        "trigger USB Kill",
        "plug",
        "God",
        "work",
        "good",
        "original USB Kill",
        "dead USB port",
        "dead",
        "generation USB Kill"
    ],
    "transcript_entity_values": [
        "USB Killer",
        "MacBooks",
        "2017",
        "EFF",
        "The Electronic Frontier Foundation",
        "USB-C. Oh",
        "three",
        "iPhone",
        "Switch Lite",
        "MacBook",
        "USB-C",
        "MacBook",
        "Three",
        "a PS5 1100",
        "first",
        "2011",
        "at least one",
        "MagSafe",
        "1.0",
        "USB",
        "Samsung",
        "Ken",
        "Samsung Galaxy Z Flip 3",
        "Austin",
        "two",
        "Apple",
        "two seconds",
        "Nintendo Switch Lite",
        "Switch",
        "4",
        "one",
        "second",
        "the last eight years",
        "MacBook Pro",
        "GaN",
        "50,000",
        "Joanna",
        "Jesus",
        "Dell",
        "M2 MacBook Air",
        "Ken] Midnight",
        "Chromebook",
        "Flip",
        "2011 15-inch",
        "the USB Killer",
        "Gateway Windows",
        "midnight",
        "At least one",
        "today",
        "hours",
        "PS5",
        "MagSafe"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.06247394159436226,
        0.012410759925842285,
        0.018130160868167877,
        -0.0017095432849600911,
        0.10671765357255936,
        -0.021911021322011948,
        0.012336492538452148,
        0.05069262161850929,
        -0.037812866270542145,
        0.04412630572915077,
        0.11422686278820038,
        0.013342173770070076,
        0.015299997292459011,
        0.009268952533602715,
        -0.07229415327310562,
        0.061347633600234985,
        -0.009007886052131653,
        -0.017793959006667137,
        -0.02481612004339695,
        0.06894069164991379,
        0.0779656171798706,
        -0.06918980926275253,
        -0.007787779439240694,
        -0.051494184881448746,
        -0.032638583332300186,
        0.05608721822500229,
        0.09508640319108963,
        -0.0628817155957222,
        -0.07772842794656754,
        -0.05070842429995537,
        -0.03246724605560303,
        -0.04459068924188614,
        -0.09017941355705261,
        -0.008356940001249313,
        -0.016994118690490723,
        -0.08514656126499176,
        0.02455100044608116,
        -0.01782996580004692,
        -0.03640434145927429,
        -0.10334894061088562,
        -0.005780347157269716,
        -0.041914794594049454,
        0.06909683346748352,
        0.012526354752480984,
        -0.016852324828505516,
        0.02142757549881935,
        -0.03415282443165779,
        0.02077597752213478,
        0.014915301464498043,
        -0.07204940170049667,
        0.0094658387824893,
        -0.05054683983325958,
        -0.039434581995010376,
        0.07428495585918427,
        0.018757669255137444,
        -0.0038614908698946238,
        0.009517950937151909,
        -0.04856625571846962,
        0.06034790351986885,
        -0.05337373539805412,
        0.021698320284485817,
        -0.034186188131570816,
        -0.009012558497488499,
        -0.001193133182823658,
        0.00360250030644238,
        -0.059807855635881424,
        0.012538916431367397,
        0.0033262670040130615,
        -0.008252846077084541,
        0.0736209824681282,
        -0.018438834697008133,
        -0.04112691432237625,
        -0.031052997335791588,
        0.01236000657081604,
        0.012856421060860157,
        0.009044098667800426,
        -0.08186697959899902,
        -0.011673204600811005,
        -0.03419281542301178,
        0.06330955773591995,
        0.019294170662760735,
        -0.05038021132349968,
        0.008156443946063519,
        0.012488985434174538,
        0.0573076531291008,
        0.023457037284970284,
        0.0010023450013250113,
        0.002251271391287446,
        0.0004895430174656212,
        -0.01983778364956379,
        -0.05387870594859123,
        0.08769582957029343,
        0.07183937728404999,
        -0.010326779447495937,
        -0.07393434643745422,
        -0.002926797140389681,
        0.004341424908488989,
        -0.008297327905893326,
        -0.04335412755608559,
        0.03598553687334061,
        0.02900826185941696,
        0.00121979508548975,
        -0.03116314671933651,
        -0.15623454749584198,
        0.03006688877940178,
        -0.08348045498132706,
        -0.08078727126121521,
        0.006214462220668793,
        0.0333443358540535,
        0.03598567470908165,
        -0.02497398667037487,
        -0.021120917052030563,
        -0.1235002875328064,
        -0.021206384524703026,
        0.01651838608086109,
        0.052734795957803726,
        -0.010412367060780525,
        0.05797915160655975,
        0.011485794559121132,
        -0.053288768976926804,
        0.05213382840156555,
        0.060450538992881775,
        -0.021466579288244247,
        -0.05983138456940651,
        0.05261196941137314,
        0.02344597317278385,
        -0.00461997278034687,
        9.028949333462943e-33,
        0.04548081383109093,
        -0.034275949001312256,
        -0.025849157944321632,
        0.025803862139582634,
        -0.010972527787089348,
        -0.06213531643152237,
        0.035890355706214905,
        0.08954102545976639,
        0.046841900795698166,
        0.0953228622674942,
        -0.023051636293530464,
        -0.03884795308113098,
        -0.03605951741337776,
        0.07910925894975662,
        -0.016125330701470375,
        -0.08363473415374756,
        0.002035262994468212,
        -0.06566830724477768,
        -0.026955606415867805,
        -0.034062281250953674,
        0.08320799469947815,
        0.0069111427292227745,
        0.03930027037858963,
        -0.06641388684511185,
        0.03483949601650238,
        0.07072536647319794,
        -0.018456459045410156,
        0.04864569380879402,
        0.08855213224887848,
        0.018541784957051277,
        -0.10704413056373596,
        -0.016403330489993095,
        -0.0631183385848999,
        -0.044928766787052155,
        -0.04441346973180771,
        0.026717249304056168,
        -0.042625609785318375,
        -0.058297112584114075,
        0.0496000237762928,
        0.049903012812137604,
        -0.004666782449930906,
        -0.042891401797533035,
        -0.0958399623632431,
        0.012505559250712395,
        0.026855329051613808,
        -0.025106631219387054,
        0.03657414764165878,
        0.02546251378953457,
        -0.002340705832466483,
        -0.0007286992040462792,
        -0.03344558924436569,
        -0.12269367277622223,
        0.026556413620710373,
        0.037236690521240234,
        -0.01378250028938055,
        0.04875919222831726,
        -0.01139809936285019,
        0.013044466264545918,
        0.06487905234098434,
        -0.017367785796523094,
        0.13869747519493103,
        -0.0044693294912576675,
        -0.0034359353594481945,
        0.04592425003647804,
        -0.13088276982307434,
        -0.0013464578660205007,
        0.04796001687645912,
        0.012678485363721848,
        0.012927000410854816,
        -0.008402355015277863,
        -0.005640916991978884,
        0.0838504508137703,
        0.007251729257404804,
        -0.16954779624938965,
        -0.0032069047447293997,
        0.05563892051577568,
        -0.022022582590579987,
        0.0215305183082819,
        -0.0385684110224247,
        -0.019029460847377777,
        0.031709108501672745,
        -0.054806262254714966,
        0.036366526037454605,
        0.009937690570950508,
        -0.011975926347076893,
        0.026876427233219147,
        -0.03400861844420433,
        -0.0489351749420166,
        -0.013252104632556438,
        -0.008649065159261227,
        0.007101082243025303,
        -0.004513903055340052,
        -0.03782841935753822,
        -0.041576359421014786,
        -0.010685710236430168,
        -8.910758519275547e-33,
        0.04093191400170326,
        -0.06661524623632431,
        0.04265923053026199,
        0.034237492829561234,
        -0.008062879554927349,
        -0.034084971994161606,
        -0.03861453756690025,
        0.0019338055280968547,
        -0.02125645987689495,
        -0.10746289789676666,
        -0.021719852462410927,
        0.0372302271425724,
        0.005696707405149937,
        -0.03760760277509689,
        0.07169260829687119,
        -0.060934942215681076,
        0.006530541926622391,
        -0.023946618661284447,
        -0.03296762332320213,
        -0.015992794185876846,
        0.017029253765940666,
        0.0561806783080101,
        0.04476207122206688,
        0.035657066851854324,
        -0.00820066872984171,
        0.013692120090126991,
        0.028092842549085617,
        -0.0195502620190382,
        0.08285904675722122,
        0.13245272636413574,
        0.07322812080383301,
        -0.044675812125205994,
        0.06778144836425781,
        0.039141763001680374,
        0.009052107110619545,
        0.03459485247731209,
        0.04160409793257713,
        0.023322690278291702,
        0.024325242266058922,
        -0.11076023429632187,
        0.06919372081756592,
        0.05404863879084587,
        -0.050884947180747986,
        -0.006838622037321329,
        -0.014797926880419254,
        -0.06333796679973602,
        -0.0762069895863533,
        0.04423750191926956,
        0.027392568066716194,
        0.012661631219089031,
        -0.044459279626607895,
        -0.06926655024290085,
        -0.10660675913095474,
        0.05570775270462036,
        0.006051489617675543,
        -0.08452074974775314,
        0.020147092640399933,
        0.024014392867684364,
        0.052725061774253845,
        -0.03353019803762436,
        0.07042202353477478,
        -0.001710723154246807,
        -0.007980230264365673,
        -0.02258644998073578,
        -0.007118742913007736,
        -0.04580391198396683,
        0.05064583569765091,
        0.029792143031954765,
        -0.012042747810482979,
        0.0525912269949913,
        0.06223061680793762,
        0.08849533647298813,
        -0.01893356256186962,
        -0.015696076676249504,
        0.05018770694732666,
        0.03796984255313873,
        0.025387510657310486,
        -0.0275031179189682,
        -0.07000330835580826,
        -0.04965069890022278,
        -0.021144602447748184,
        -0.08287393301725388,
        0.007705554831773043,
        0.0033866893500089645,
        0.0056198760867118835,
        -0.009917383082211018,
        -0.0007093317108228803,
        0.06639483571052551,
        0.039400629699230194,
        0.002413747599348426,
        -0.08736947923898697,
        -0.045707687735557556,
        -0.015457343310117722,
        0.07977301627397537,
        -0.04969592019915581,
        -5.655465074028143e-08,
        0.026452768594026566,
        0.05657088756561279,
        -0.025441011413931847,
        0.05276995897293091,
        -0.08002578467130661,
        -0.054610755294561386,
        0.0006922315224073827,
        0.0005050807376392186,
        0.07906389981508255,
        -0.01047523133456707,
        -0.0003561773628462106,
        0.009981023147702217,
        0.038325823843479156,
        0.03924204036593437,
        0.004366305191069841,
        0.10865102708339691,
        0.012346379458904266,
        0.09963889420032501,
        -0.015690408647060394,
        -0.03258524090051651,
        -0.05009876564145088,
        -0.020723171532154083,
        0.010701124556362629,
        -0.04267720878124237,
        0.07589796185493469,
        0.03494805097579956,
        -0.009981712326407433,
        0.11101824045181274,
        0.019793972373008728,
        -0.11362496018409729,
        -0.12003456056118011,
        -0.011939097195863724,
        -0.02869241312146187,
        0.053879525512456894,
        0.02891375496983528,
        0.01989811845123768,
        -0.0060353404842317104,
        0.012288413010537624,
        0.040934257209300995,
        0.052721090614795685,
        -0.015625208616256714,
        -0.15396535396575928,
        -0.11218902468681335,
        -0.02240920066833496,
        -0.05963810533285141,
        -0.034931253641843796,
        0.037811279296875,
        -0.012558632530272007,
        -0.07451052218675613,
        0.17589478194713593,
        -0.004388370085507631,
        0.010505635291337967,
        -0.018302736803889275,
        0.03710033372044563,
        0.05464233085513115,
        0.02160794474184513,
        0.0058637564070522785,
        0.07757500559091568,
        -0.040539827197790146,
        -0.0064620100893080235,
        0.11191176623106003,
        0.00551292859017849,
        0.03650863096117973,
        0.08720733225345612
    ]
}