{
    "id": "SV1EEJMYvBg",
    "title": "Can ANYONE Keep Up With Sony? - a7 IV Camera",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-10-22T19:53:58Z",
    "video_url": "https://www.youtube.com/watch?v=SV1EEJMYvBg",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "A7IV",
        "A74",
        "Camera",
        "FPS",
        "Full Sensor",
        "Performance",
        "Colour",
        "Soft Skin",
        "DSLR",
        "4K",
        "High FPS",
        "60 FPS"
    ],
    "views": 341523,
    "likes": 13782,
    "comments_count": 585,
    "description": "Get 20% OFF + Free Shipping @Manscaped at    Sony does it again, they released the Sony A7 IV camera and well it's something that might make you want to convert to Sony OR get you into photography. Brandon unboxes it and you might want to stay awhile and listen!  Buy Sony A7IV Camera On Amazon (Paid Link):  On Best Buy (Paid Link):  On BHPhoto (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS --------------------------------------------------- 0:00 - Intro 0:40 - Unboxing 1:40 - Exterior impressions 4:10 - Attaching the lens 4:48 - Sponsor - Manscaped! 5:13 - Features overview 9:35 - Test Footage 10:05 - Conclusion",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://geni.us/2PFaI4K",
        "https://geni.us/Wb7ml",
        "https://geni.us/AanZsAv",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(upbeat music) - It's going to be another good day but they did it again. Guys, I can't keep up either. Sony has so many cameras and they just keep releasing them and they just keep being interesting enough to make videos about. But I have another one for you today, if you want to hear about it. We're talking about the Sony a7 IV. And for those of you who have used the a7 III, you might already know that the a7 series in the middle, the a7 III and now this the a7 IV, they're the mid range, like, do it all cameras. And I think they actually managed to improve it a decent amount. Let's see what's in the box. (box ruffling) So they included a 24-70 G Master for me to try which is nice. Smartphone clap; I assume that this is for their Xperia phone, if you want to use it like as a monitor. A smaller cage, that's kind of nice. We have the typical included camera strap. There is an included Sony charger. Pretty standard, this is the same charger that they've had for a while on other cameras. A Type-C cable. We have the Sony FZ100 battery which we've used for our a7S IIIs and any Sony camera in the offices at this point. It is a much improved battery from the last generation. I bet you guys can't guess what this camera looks like. You'll have no idea that it looks absolutely exactly similar to all the other (indistinct) But it does say a7 on the body, not a7S III, not a7R IV. The highest resolution photo camera in the alpha series line is the a7R IV, which is 60.2 megapixels. Then we have the a7S III, which is 12.1 megapixels. So this camera is 33 megapixels, so it sits right in between the a7R IV and the a7S III. Might be the best solution for people who shoot hybrid. We've got shutter speed right here, that dial. Your aperture is on the front. And then on the top, they've simplified the mode dials to manual, shutter priority, aperture priority, program, auto and then you have three custom profiles, which is nice. And my favorite new thing on this top dial is that there's new, new locking wheel here that allows you to go from photo to video to slow and quick, all on one dial. It is... So they kind of replaced the locking mechanism. This now has a lock on the front here for this dial. And then the top dial doesn't actually have a lock at all, but it is pretty like sturdy to turn. So I don't know that you'd accidentally bump this very easily. And I/O is very similar to the a7S III. We've got a full-size HDMI, a mic port, a headphone Jack, Type-C and then a Multiport, which is like remote trigger, plug it into a computer. You're Type-C can also do FTP transfer, just like the a7S III. And you can use it like a webcam, just like most of some of these cameras at this point. So the back of the camera is identical to the a7S III. Custom buttons are in the same place, many buttons in the same place. They both have the flippy screen, which again, these were all great changes. And then the grip in the right of the camera, there are slight differences. So with this camera, you get two SD card slots, but only one of the slots is a CFexpress Type A whereas on the a7S III, both of the slots can be used with the CFexpress Type A. And then on the bottom, you've got the 1/4\"-20 and battery door for the FZ100. I almost forgot the best part. Guys, let's take a look at the sensor. It's never bad to look at a full frame bare Sony sensor because it's just, it's just engineering marvel. It's beautiful. Look at that shine. Well, since I have the sensor exposed, I may as well put a lens on it. Sony sent over the 24-70 G Master but this box says 16-35. I was pretty sure this was going to be 24-70. Holy crap. I don't know if I've used the G Master version of this lens in a while. I forgot how big it was. Well, so they did send me a 24-70. Let's put it on. (clicks) Feels front heavy because this lens is heavy but I mean, this is a wedding photographer set up. I think a lot of wedding photographers would use this lens. If they're not using a prime or if they're using a second body with this lens, then another body with a prime makes sense. You can get away with a lot with this, with the, all the features we're going to get into. But before we get into it and turn the camera on, I have to tell you about our sponsor, \"Manscaped\". Manscaped's Performance Package 4.0 is designed to contain everything you need to make grooming below the waist, easy. Includes the updated Lawnmower 4.0 with its wireless charging. Weed Whacker nose trimmer for the tricky areas. Plus, some other goodies like Crop Preserver and the Crop Reviver sprays for deodorizing and toning. Get 20% off and free international shipping at the link in the video description. In the video mode, you will notice that there is the APS-C/Super 35mm shooting mode, which just allows you to do 4K at 60 FPS. So in order to do 60 FPS which is the highest frame rate at 4K, you do have to shoot in the Super 35mm, which is over sampled, 4.6k over sampled, but you do have to crop in. So for people who shoot weddings, I know that's not ideal for you because you want to be able to have as much of the frame as you, you can possibly get, but in certain situations, it actually might be nice to have the Super 35mm mode just to punch in for a little bit tighter shot if you're kind of further back. It has also adapted the new color profiles that are in the a7S III. You've got S-Cenitone, SLOG3 and the new color science that is in the a7S IIIs, also in this camera. And yes, 60 FPS at Super 35mm on a full frame camera might be disappointing to some, but honestly, I'm sure there are many, many situations where it will still be very useful. And this camera is 10-bit 4:2:2, just like the a7S III. So along with 4K video at 60 FPS and Super 35mm mode, this camera has 15 stops of dynamic range, 5.5 stops of embody image civilization. And you also have 10 FPS shooting. (camera clicking) That sounds pretty good. So this is the a7S III. (camera clicking) (laughs) One thing before I forget that I need to test is the rolling shutter on this camera because the a7S III improved on the rolling shutters so significantly from its predecessor. And this camera runs the same processor as the a7S III and the a7R III was never the best with rolling shutter. It could, it had a lot that it could improve on. I just wanna see how this does in a quick and dirty handheld like whipping test. Okay, so the a7 IV, not great so far as I'm watching this clip, you can clearly see the metal frame is bending quite a bit as I go back and forth. And that's not really ideal. For comparison, let's take a quick look at the a7S III. And honestly, that is a lot better. You can see that the metal frame isn't going to the side to side as much as I go back and forth and Yoda's head is also not doing that. And just in general, when you, when being handheld, whipping it back and forth, you don't feel the, like vibration as much. They were using the same lens. All that I changed was the camera. So, one thing I'm kind of curious about, because we've seen this ON by default in other Sony cameras in the past, is if the soft skin filter is ON by default. So if we go over to color/tone and go down, okay! The soft skin effect that has been on like the ZV-1, the ZV-10 is not ON by default. Thank you, Sony. That's what it looks like with the soft skin filter ON. So here's the same shot with the soft skin filter OFF. Can you tell the difference? Is it super obvious? I'm actually not sure, let's have a look at this footage. But you will have seen this already. So, Sony actually included a feature that I was very interested to hear, 'cause I've never seen a camera do this before, but it has a feature called \"Breathing compensation\". And for those of you who don't know what breathing is, breathing is basically the phenomenon where when you're changing only the focus on your lens and it is zooming in or zooming out on your frame, depending on if you're focusing from foreground to background, which is an undesired effect, because you don't want to change your frame when you change your focus. You want to only change your frame when you're zooming in or moving closer to your camera. So what Sony has done is they've actually added this feature where it zooms in and zooms out for you in compensation of that breathing in the lens. And so, because they've designed the lens and the camera, they understand what they need and the amount that needs to compensate for. So when the lens is properly communicating with your camera, it can actually compensate for the breathing. So I'm going to turn that feature ON and let's give that a shot. I'm going to turn it OFF for now to show you guys what it would look like on a 35mm G Master, which is Andy's lens. So here's Andy. And I'm going to focus on the Yoda here. And you can see the frame moving as I did that. Yeah, see that? So this is what the breathing comp OFF. (upbeat music) It's gone. The camera is no longer looking like it's zooming when I'm changing. That is so cool guys. Guys, what that means is if you're using a Sony lens, which I'm sure many of you are, especially if you're shooting on a hybrid camera like this, you don't have to worry about breathing in video anymore. You can just change your focus and it not be a big deal. I'm really impressed with the breathing feature. So if you own Sony lenses, you just got an extra adder with this camera just by having their lenses. Sony is really trying to sell you on their glass because the way it communicates with the camera, excellent! Here are a couple of test photos of this day, 7-4. To show you guys, kind of what the color and sharpness is by default. I know you can't fully tell in video, and then here's some slow motion shots of what the 60 FPS at 4K looks like on this camera. (upbeat music) So Sony has taken everything they've learned, making all the other cameras that they've made in the last couple of years, auto focus, performance, color, dynamic range improvements, physical body dial improvements. All of it is brought to this camera. This camera is going to be priced at about $2,500 to $2,800. Price is not quite final as of the shooting of this video. I'm sure when you guys actually watch this video, that the pricing will be up. I have to say it's a pretty good value. Main competitor being one of Canon's cameras, the Canon EOS R6, they're giving Cannon a run for their money, honestly. If you shoot Sony or you have Sony glass for video and you want a hybrid camera, you really can't go wrong with this. So if you're a hybrid shooter and you already own Sony glass or you've been thinking about it, but waiting for that price point to be kind of correct on this camera, this camera is an excellent value. So tell me what you guys think. Would you buy this camera? Let me know what you guys think of the footage and the stills. Subscribe to ShortCircuit. See you guys later.",
    "transcript_keywords": [
        "camera",
        "III",
        "Sony",
        "cameras",
        "lens",
        "Guys",
        "frame",
        "FPS",
        "video",
        "Sony camera",
        "Super",
        "Breathing",
        "dial",
        "IIIs",
        "Master",
        "Sony glass",
        "kind",
        "hybrid camera",
        "Sony lens",
        "feature"
    ],
    "transcript_entity_values": [
        "24",
        "35mm",
        "FPS",
        "Multiport",
        "7-4",
        "15",
        "Xperia",
        "three",
        "One",
        "4",
        "one",
        "20%",
        "CFexpress Type A",
        "60",
        "Cannon",
        "this day",
        "24-70",
        "12.1 megapixels",
        "Jack",
        "60 FPS",
        "4.6k",
        "Canon EOS R6",
        "Andy",
        "S-Cenitone",
        "second",
        "1/4\"-20",
        "Yoda",
        "IV",
        "ZV-10",
        "10",
        "about $2,500 to $2,800",
        "Sony",
        "16",
        "two",
        "Canon",
        "the last couple of years",
        "33 megapixels",
        "60 FPS",
        "5.5",
        "only one",
        "ShortCircuit",
        "SD",
        "SLOG3",
        "10-bit",
        "FZ100",
        "today",
        "60.2 megapixels"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY"
    ],
    "vector": [
        -0.07679702341556549,
        -0.05192035436630249,
        -0.0014614313840866089,
        -0.0510510690510273,
        0.10948639363050461,
        0.039348047226667404,
        0.05708565562963486,
        0.059813350439071655,
        -0.014748807065188885,
        0.12229109555482864,
        -0.019702252000570297,
        -0.02140142023563385,
        -0.00882323645055294,
        0.05563800409436226,
        0.08969687670469284,
        -0.03810824081301689,
        0.017238454893231392,
        -0.01629180833697319,
        -0.025652296841144562,
        0.026951808482408524,
        -0.04172400012612343,
        -0.09613876044750214,
        0.051723022013902664,
        -0.020757896825671196,
        0.004299741704016924,
        -0.050655998289585114,
        -0.013383868150413036,
        -0.013262990862131119,
        -0.04592110961675644,
        -0.07145710289478302,
        -0.06287942826747894,
        0.04851500317454338,
        0.03886677324771881,
        -0.03442051634192467,
        -0.012811718508601189,
        -0.05140932276844978,
        0.06510774791240692,
        -0.03358267620205879,
        -0.07459390163421631,
        0.028372740373015404,
        -0.021358802914619446,
        0.028129564598202705,
        0.011911612935364246,
        0.0169263556599617,
        -0.002039100043475628,
        -0.04985414072871208,
        0.02608872391283512,
        -0.0253728199750185,
        0.05711254104971886,
        0.10769787430763245,
        -0.07043605297803879,
        -0.02504231594502926,
        0.0646325945854187,
        0.048546016216278076,
        -0.05958202853798866,
        -0.008514360524713993,
        -0.06526587903499603,
        -0.070778489112854,
        0.00974593497812748,
        -0.06788523495197296,
        0.028419779613614082,
        -0.08973164856433868,
        -0.027281951159238815,
        0.07349997013807297,
        -0.029013635590672493,
        0.018275849521160126,
        0.029790105298161507,
        0.06284438818693161,
        -0.02107059396803379,
        -0.07385040819644928,
        -0.07704199850559235,
        0.057692017406225204,
        0.06328407675027847,
        0.028831297531723976,
        -0.03235701844096184,
        0.04962123930454254,
        0.06735707819461823,
        -0.041568905115127563,
        0.03170039877295494,
        0.02965683303773403,
        0.09093409776687622,
        -0.003708450822159648,
        -0.11621071398258209,
        -0.024542657658457756,
        0.03670825436711311,
        -0.022762689739465714,
        0.04902470111846924,
        0.07368233054876328,
        -0.03399614989757538,
        -0.03531702980399132,
        -0.07187644392251968,
        0.04588043689727783,
        0.026930440217256546,
        -0.028802284970879555,
        -0.038791440427303314,
        -0.03251143917441368,
        0.00762454979121685,
        -0.03776099905371666,
        -0.06961745023727417,
        0.06694106012582779,
        0.036298517137765884,
        0.034694112837314606,
        -0.009874715469777584,
        -0.041333653032779694,
        -0.06134661287069321,
        -0.07556377351284027,
        -0.04510262981057167,
        0.09942102432250977,
        0.08270478993654251,
        0.0014759342884644866,
        -0.09240548312664032,
        0.06881553679704666,
        -0.039989158511161804,
        -0.05749937519431114,
        0.004323431756347418,
        0.12408964335918427,
        -0.04748742654919624,
        -0.0012264040997251868,
        0.09751579910516739,
        -0.022762075066566467,
        0.018685482442378998,
        -0.02445799484848976,
        -0.04004023224115372,
        0.0957546979188919,
        0.03907689079642296,
        -0.016245849430561066,
        -0.020991310477256775,
        1.670002783694146e-33,
        -0.05476202443242073,
        0.08781619369983673,
        0.021472293883562088,
        -0.03652152791619301,
        -0.0028879616875201464,
        0.009173828177154064,
        0.015270387753844261,
        0.044601306319236755,
        -0.10452340543270111,
        -0.028267739340662956,
        -0.050964005291461945,
        0.025206731632351875,
        -0.0573127344250679,
        0.02814386412501335,
        0.02554362453520298,
        -0.03238576278090477,
        0.023492664098739624,
        -0.03386099264025688,
        -0.009803012944757938,
        0.07331166416406631,
        0.026588061824440956,
        -0.04187152162194252,
        -0.01588289439678192,
        0.0922173410654068,
        0.06435903161764145,
        0.06578420102596283,
        0.02609548158943653,
        0.020149528980255127,
        0.09617629647254944,
        0.003918859641999006,
        -0.09820939600467682,
        0.012149189598858356,
        0.012676769867539406,
        -0.050373006612062454,
        0.017486900091171265,
        -0.07030691206455231,
        -0.15277481079101562,
        -0.026015182957053185,
        -0.00422601168975234,
        -0.0004601860127877444,
        -0.0731850117444992,
        0.08587711304426193,
        -0.11531014740467072,
        -0.036883801221847534,
        0.02622235007584095,
        0.02424652688205242,
        0.02422407455742359,
        0.07160035520792007,
        -0.009487796574831009,
        0.014381219632923603,
        -0.02277017943561077,
        0.032300058752298355,
        -0.12815037369728088,
        -0.04998275637626648,
        0.0018189246766269207,
        -0.030331041663885117,
        -0.02916865609586239,
        0.021827315911650658,
        0.004888015333563089,
        -0.02598813734948635,
        0.12269910424947739,
        0.007814649492502213,
        -0.028153005987405777,
        -0.0433369055390358,
        -0.12879754602909088,
        0.05432355776429176,
        0.019877655431628227,
        0.0005852371687069535,
        -0.05009745433926582,
        -0.002374697243794799,
        -0.004339966922998428,
        -0.006797118112444878,
        0.04385840892791748,
        -0.005891361739486456,
        0.05962591618299484,
        0.06033271551132202,
        -0.08885698020458221,
        -0.0926060751080513,
        0.022823555395007133,
        0.04244605451822281,
        -0.10290533304214478,
        0.05042145401239395,
        0.021402575075626373,
        0.0790194645524025,
        -0.005545398220419884,
        -0.007836719043552876,
        0.004557445179671049,
        -0.01309516467154026,
        -0.05087348818778992,
        -0.03082377277314663,
        0.01179441437125206,
        -0.003950327169150114,
        -0.05272112041711807,
        -0.0277351513504982,
        -0.030192283913493156,
        -3.0235202438186994e-33,
        -0.03199169784784317,
        0.0033112310338765383,
        -0.07651672512292862,
        -0.04327525198459625,
        -0.014773872680962086,
        -0.011715076863765717,
        0.02896786667406559,
        0.09106915444135666,
        0.03992963954806328,
        -0.09547549486160278,
        -0.0007815157296136022,
        0.0013201185502111912,
        -0.05045274272561073,
        0.01573491096496582,
        0.00030616982257924974,
        -0.08407925814390182,
        0.04897720366716385,
        -0.03372052311897278,
        0.0182382520288229,
        -0.05210978537797928,
        0.09814909100532532,
        0.04189809784293175,
        0.04219212010502815,
        0.09630659967660904,
        0.023744110018014908,
        0.025438852608203888,
        0.06819962710142136,
        0.0936911553144455,
        0.047686439007520676,
        0.029910137876868248,
        -0.024167543277144432,
        -0.034178297966718674,
        -0.030405884608626366,
        -0.02925168350338936,
        -0.00293081090785563,
        0.044219229370355606,
        0.01745729148387909,
        0.03972546011209488,
        -0.009430322796106339,
        0.02527759037911892,
        -0.01979425735771656,
        -0.028312714770436287,
        0.03275217115879059,
        -0.03509659692645073,
        0.016795309260487556,
        -0.0474388413131237,
        -0.017766697332262993,
        0.023203887045383453,
        0.06520984321832657,
        0.02399136871099472,
        -0.040405213832855225,
        0.01272099744528532,
        0.010797957889735699,
        -0.042752187699079514,
        -0.050523869693279266,
        -0.023421354591846466,
        -0.09466283768415451,
        0.02289735898375511,
        0.05472797900438309,
        -0.03692180663347244,
        0.031360797584056854,
        -0.028884364292025566,
        -0.0740777924656868,
        -0.019307808950543404,
        -0.035538285970687866,
        -0.028033200651407242,
        0.07271871715784073,
        0.05502324923872948,
        -0.027255486696958542,
        0.0034525319933891296,
        -0.024295853450894356,
        0.004249755293130875,
        0.013303461484611034,
        0.05207587406039238,
        0.05088048055768013,
        -0.05014128237962723,
        -0.002511751838028431,
        0.03445954620838165,
        0.035557858645915985,
        -0.03418993204832077,
        -0.041162144392728806,
        -0.004846398252993822,
        0.07529643177986145,
        0.027831831946969032,
        0.13713406026363373,
        0.0992051437497139,
        0.03438404202461243,
        -0.07928163558244705,
        -0.020084332674741745,
        0.022282183170318604,
        -0.02791505865752697,
        0.01946783810853958,
        -0.08717992901802063,
        0.03720882534980774,
        -0.011461288668215275,
        -5.863684293672122e-08,
        0.036443307995796204,
        -0.05367867276072502,
        0.06849630922079086,
        -0.02787160873413086,
        0.0060486639849841595,
        -0.0708458423614502,
        -0.012103940360248089,
        -0.016659321263432503,
        0.09604363888502121,
        -0.04361838102340698,
        0.04757995903491974,
        -0.013535252772271633,
        0.01345925871282816,
        0.04816214367747307,
        -0.03591754287481308,
        0.04541413113474846,
        0.03734096139669418,
        0.04788133129477501,
        -0.033803004771471024,
        -0.05089433863759041,
        -0.05859518423676491,
        -0.02703692950308323,
        0.029168447479605675,
        -0.043368030339479446,
        0.02804206870496273,
        -0.012365590780973434,
        -0.06043323874473572,
        -0.008470381610095501,
        0.11732533574104309,
        -0.10971581190824509,
        -0.046612463891506195,
        -0.0011020201491191983,
        0.0664939358830452,
        -0.06252235174179077,
        -0.02253374643623829,
        -0.060255035758018494,
        -0.016161510720849037,
        0.024418333545327187,
        0.03707592189311981,
        0.002383078681305051,
        -0.017096247524023056,
        -0.028472375124692917,
        0.014540266245603561,
        0.020928550511598587,
        0.03790631517767906,
        0.005088246893137693,
        0.024266546592116356,
        -0.06377758085727692,
        0.010470631532371044,
        0.03277526795864105,
        0.015150456689298153,
        -0.0001491102739237249,
        -0.007292498368769884,
        0.019511891528964043,
        0.06644979864358902,
        -0.01807001605629921,
        0.04027130827307701,
        0.02974388375878334,
        0.001776374876499176,
        0.08348920196294785,
        0.042709432542324066,
        -0.12982575595378876,
        -0.09801942855119705,
        0.08882772922515869
    ]
}