{
    "id": "sV7f2-KO7F4",
    "title": "Sony Xperia 1ii Review: The Need For Speed",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-06-25T17:47:13Z",
    "video_url": "https://www.youtube.com/watch?v=sV7f2-KO7F4",
    "category": "Science & Technology",
    "tags": [
        "sony xperia 1 2 review",
        "sony xperia 1 mark 2 review",
        "sony xperia 2020",
        "sony xperia 1 mark ii",
        "best camera phone 2020"
    ],
    "views": 561505,
    "likes": 19369,
    "comments_count": 1637,
    "description": "Sponsored by Surfshark. Get Surfshark VPN at   Enter promo code MRMOBILE for 85% off and 3 FREE additional months!   [SONY XPERIA 1ii REVIEW]  Sony. Its the company that builds the sensors for almost half the worlds smartphones, and it makes nearly half of all mirrorless cameras sold  including the camera I use to shoot every MrMobile video. Its also the company that for years has failed to capitalize on these strengths in its mobile division. In preparing for this video I went back and watched seven years of my own Sony smartphone reviews, from my days at Pocketnow to last years Xperia 1 video. They all say pretty much the same thing: Sonys phones are very good, even great at points, but theyre too expensive, and not always for the right reasons.   Flash forward to 2020, and the price tag on the Xperia 1ii (pronounced \"Xperia 1 Mark II\") reads like a cruel joke. At a penny shy of $1200 unlocked, this sequel is a full 26% pricier than its predecessor, and a cursory glance at its familiar form factor (now drained of all its fun color, at least in the US) fails to reveal why. The answer lies mainly beneath its three camera lenses, which encapsulate a camera system thats focused almost exclusively on a very specific type of professional photographer: the type with the need for speed.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SONY XPERIA 1II REVIEW]  MrMobile's Sony Xperia 1ii Review / Sony Xperia 1 Mark II review was produced following eight days with a Sony Xperia 1ii review sample provided by Sony. The device was tested on T-Mobile and Verizon in and around Brooklyn, NY. Preproduction sample running prerelease software. The lone sponsor of this video is Surfshark; neither Sony nor any other company paid a fee or otherwise offered compensation in exchange for this coverage.   [PRODUCTS IN THIS VIDEO]  Benro BK10 Mini Tripod [B&H]:    [LINKS]  Sony Xperia 1ii [Amazon]:   Sony Xperia 1ii Review: A Surprise Hit [WIRED]:   This Is Why Sony Got 42.5% of the Mirrorless Camera Market in 2018 [The Phoblographer]:   Sony Xperia 1 Review [MrMobile]:   Sony Xperia Z1 Compact Review [Pocketnow]:   RC Boats In Super Slow Mo! [RapidNadion]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #sonyxperia #xperia1ii #xperia1mark2 #xperia #smartphones #tech",
    "description_links": [
        "https://surfshark.deals/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1RL",
        "http://mrmobile.tech/1RM",
        "https://www.wired.com/review/sony-xperia-1-ii/",
        "https://www.thephoblographer.com/2019/11/21/this-is-why-sony-got-42-5-of-the-mirrorless-camera-market-in-2018",
        "https://www.youtube.com/watch?v=fjSX1j4WBRo",
        "https://www.youtube.com/watch?v=gXo0sJmib1k",
        "https://www.youtube.com/watch?v=ta7i3RRsbIQ",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- Sony, it's the company that builds the sensors for almost half the world's smartphones. It makes nearly half of all mirrorless cameras sold, we're including the camera I use to shoot every MrMobile video. And it's also the company that for years has failed to capitalize on the strengths in its mobile division. In preparing for this video, I went back and watched seven years of my own Sony smartphone reviews, from my days at Pocketnow to last year's Xperia 1 video. They all say pretty much the same thing, Sony's phones are good, even great at points, but they're too expensive and not always for the right reasons. Flash forward to 2020 and the price tag on the Xperia 1 II reads like a cruel joke. At $1200 unlocked, this sequel is a full 26% pricier than its predecessor, and a cursory glance at its familiar form factor now drained of all its fun color, at least in the U.S, fails to reveal why? Well, the answer lies mainly beneath these three lenses, which encapsulate a camera system that's focused almost exclusively on a professional photographer. (gentle music) And you'll notice I didn't say photographers plural, and that was no accident. Now as many features as Sony did built into this camera system, it was really made for one very specific kind of photographer, the one with the need for speed. The word speed shows up 19 times on the product page for Sony's a9 Mirrorless Camera alongside ice dusted shots of hockey goalies and sweat-shinned athletes mid pole vault. So the a9 was designed for rapid fire sports and wildlife photography. And the Xperia 1 II shines most brightly, where it brings those features over wholesale. You fire up Photo Pro, you select burst mode, you have to press the shutter button to get focus and you push it all the way to start shooting. The phone can take as many as 20 frames each second, with an autofocus system that calculates focus three times per picture. The whole time it's using face and eye detection. So if you're shooting a person or an animal, the subject stays in focus. Yes, you heard me right, eye autofocus even works on animals. Probably the best showcase of this is my buddy Julian's review for Wired. He shot a burst of photos of his approaching dog, Tobu and each frame is perfectly in focus. His review is excellent by the way, I'll link it below. (upbeat music) The hardware that allows for this is elaborate but not extravagant. Rather than joining the race for ever higher resolutions, Sony limited each of its three camera sensors to 12 megapixels, so it could deliver on those very fast focus speeds and also to combat problems like rolling shutter distortion with fast moving subjects. The primary 24 millimeter camera is flanked by a 70 millimeter telephoto for zoom shots, and a 16 millimeter ultra wide with 124 degree field of view. (camera snaps) That 124 degree figure is important, we've still got manufacturers out here playing fast and loose with the term ultrawide with 107 degree lenses and so on. No, no, no such tomfoolery on this device. All three cameras use ZEISS T star coding to help keep reflections down. And sandwiched between them is a depth sensor that assists with autofocus if the subject is within 15 feet or so. It's all controlled by the app you got a peek at before. And if you had any doubts that this was a specialty smartphone, Photo Pro will erase it. This is kind of an amalgam of the interface found on the Sony a-series and it's higher end Venice line of cinema cameras, and it pulls absolutely no punches. Whereas camera-centric phones from say Huawei and Nokia have tried to make professional photography accessible for newcomers, Sony's only priority seemed to be making existing owners of Sony equipment feel at home. Which would be great if the interface was better. But over my past seven or eight years of shooting on Sony equipment, I've always found the interface clunky. It's something that I put up with in exchange for the awesome image quality the hardware gives me. I got pretty down on this app in a recent episode of the Android Central Podcast. And over the course of the week, I had my review device, I did get better at shooting with it. That goes for Cinema Pro too. But I never came to really like it. Personally, I wish the company had gone the opposite route like Red was gonna do, release a modular accessory that would let me use my Sony lenses, which I really do love with my Sony smartphone. I'd buy that in a heartbeat. Back to the topic, of course, you don't have to use the Pro Photo app, even if that is the whole point of the thing. The stock Sony camera app is here too. And pro tip, you can map a double click of the power button to the stock app while mapping a long press of the shutter button to pro camera. So you have a shortcut for each use case which is nice. While these photo samples aren't necessarily representative of what buyers will receive when the phone ships on July 24th, because of a pending software update, they're exactly what I've come to expect from Xperias. Crisp with nicely balanced color and the kind of restraint that comes from a philosophy of in Sony's words, \"getting it right in the camera.\" Now, that's a contrasting philosophy to Google's, which uses extensive AI processing to make up for the more conventional optics in its pixel phones and for the lack of a better phrase, fix its photos in post. I shot side by side with the Pixel 4 in auto mode for these comparisons. And you might say that using the Xperia in auto mode as I did for most of these samples, defeats the whole purpose of the product, because again, it's built for professionals who will want to control every variable. The folks even pros occasionally need to take a quick reaction shot, which doesn't allow time for all the dial twisting. On the bright side, the phone's hardware helps it out even in the stock app. These burst mode photos on the boat came out great. And for reasons I can't fully quantify, I absolutely adore this picture of a hanging plant I snapped at one of my local coffee shops. But on the flip side, Sony still suffers from familiar shortfalls when put up against the Pixel. Overexposure of highlights, less dynamic range and poorer performance in low light. Look at this in order to get this shot of the city skyline with the Xperia, I had to mess with the Pro Photo settings for like a minute and use a portable tripod to keep the phone steady for a long exposure. To get the same shot with the Pixel 4, it took one try and it was handheld. There's a whole other side of this camera of course, in the video mode, along with that Cinema Pro app to go with it. But I'm gonna save my observations on that video stuff for when I review the Xperia Pro with this phone's sibling coming later in the year. With one quick aside just to give a shout out to this genuinely slick rack focus feature. You set your start point, you set your endpoint, boom. The phone will smoothly rack from background to foreground or vice versa, all on its own. Sadly, Sony's super high frame rate slow motion feature that I've adored for years is not present on my review sample. It's not clear if that'll be added for the production version. I've reached out to Sony for clarification, and will leave the answer in the comments, if I get it. Now while the camera is the main reason to buy the Xperia 1 II, but there's a whole smartphone surrounding that camera that you might want to know something about as well. By and large the news is good. But before we jump into it, let's keep the lights on with a quick word from my sponsor. (upbeat music) It's rare that I get to say this about a sponsor, so listen up. I haven't stopped using Surfshark since the first time we partnered. There are plenty of great VPNs out there, but Surfshark is the only one with this combination. One, traditional VPN features like browsing safely from public Wi-Fi or watching geo restricted movies or TV shows. Let's be honest, you've probably got a lot of time on your hands right now. Two, privacy beyond a simple VPN. HackLock scans the web and gives you a heads up if your email address or passwords are compromised. So the first person to take action is you. And three, consistent and reliable security without crushing my speeds like so many VPNs. Try Surfshark now at the link below and use promo code MRMOBILE. You'll get 83% off, a two year subscription and three additional months for free. Thanks to Surfshark for sponsoring this video. (upbeat music) A good sequel should always build on its forerunners successes while taking the edge off its missteps. And the Xperia 1 II is a good sequel. The six and a half inch 21 by nine OLED screen features 10 bit color that's just as vibrant as last year's. And it's 4K resolution is just as sharp, but frankly unnecessarily so. I'd have gladly sacrificed resolution for increased brightness, so I could actually see it in the sun. But a nice consolation prize is the new motion interpolation, which makes this 60 hertz refresh rate look more like 90 hertz. And Sony uses that screen smartly, even when it's sleeping. The ambient display doesn't just wake up when you get an alert. If you have several notifications waiting, it pulses the icon for the app that's actually alerting you, so you know which is the newest. And even here Sony doesn't miss the chance to remind you about its other projects. You can set an image of Aibo as a permanent companion, I missed my robot dog. Unfortunately, the ambient display consumes a lot of power up to an insane 20% of my total daily usage. That's offset by the larger 4000 milliamp hour battery but it only just barely gets me to the end of a 15 hour day. When I do need to charge, I can do that with Qi wireless charging, and for those who don't want to buy a smartphone but once every few years, Sony provides its usual smart charging options to preserve the long term health of the battery. Elsewhere the Mark II restores both the venerable 3.5 millimeter headphone jack and dual front firing speakers. So audio lovers have something to look forward to. And it's all packaged up in a newly squared off chassis made of Gorilla Glass six with Sony's usual IP 65 and IP 68 dust and water resistance. Operated by software, that's just what you expect from Android 10 with a few Sony tweaks. Smooth, smart and mostly restrained. The side-mounted fingerprint sensor is the most reliable I've used. The tall aspect ratio makes phone calls comfortable. But the only complaint I could find was excessive skin smoothing when using the selfie camera for video calls. I'd love to be able to say that I look this young, but I do not. As I mentioned before, the Xperia 1 II won't launch for another month. So in addition to adding features like raw capture, I fully expect the camera processing to be tweaked when Sony drops that pre-release update. But you know my rule, if you can put money down for the phone today, which you can and review devices are in the hands of reviewers, which they are, then it needs to be ready to be reviewed. And may be you can say it with me, It's a good phone, even a great phone at points. But $1200 is just too expensive for anyone but the photographer who truly needs the best in class burst mode, and for some reason doesn't already own a camera for that purpose. Now if you order before June 28th, the bundled noise canceling earbuds come included, and those normally cost about 180 bucks on sale, so it takes some of the sting out. Oh, and if you're purchasing for US use, be aware that you'll be limited to 4G due to the fact that this phone is meant primarily for other markets. For me, the Xperia 1 II is most appealing when seen as a preview of the Xperia Pro, which looks so genuinely useful to those of us who shoot video on the go, that I might actually buy it. And taken together, this generation of Xperia represents proof that Sony is finally serious about using its optical expertise to target very specific types of buyers Instead of casting that wide net, that's pretty much always failed to move the needle for the company in the past. So while I can't recommend this phone to all but the tiniest sliver of photography centric users, I'm at least optimistic about Sony's smartphone future and I haven't been able to say that with confidence for a long time. This review was made possible by a pre-production review sample on loan from Sony running pre-release software. MrMobile doesn't accept compensation from manufacturers for reviews, though, Sony did not pay a fee for this coverage, nor was it offered copy approval rights or any early preview of this video. That means they're seeing it for the first time right alongside you. Please subscribe to the MrMobile on YouTube if that's the kind of review you'd like to see more of. And be sure to check out SuperSaf's review which includes a longer conversation with me about the camera system. I'll link that below when it drops. Until next time, thanks for watching. And if you can't stay home, then at least stay safe and keep wearing those masks while you stay mobile, my friends.",
    "transcript_keywords": [
        "Sony",
        "Xperia",
        "camera",
        "Sony camera app",
        "Sony smartphone",
        "Xperia Pro",
        "Pro",
        "phone",
        "stock Sony camera",
        "Sony smartphone reviews",
        "Sony camera",
        "review",
        "Pro Photo app",
        "Photo Pro",
        "Pro Photo",
        "Sony phones",
        "camera system",
        "video",
        "app",
        "Sony equipment"
    ],
    "transcript_entity_values": [
        "last year's",
        "about 180 bucks",
        "three additional months",
        "Xperias",
        "HackLock",
        "seven years",
        "Xperia 1",
        "ZEISS",
        "Xperia 1 II",
        "15 feet",
        "26%",
        "4",
        "Surfshark",
        "Nokia",
        "six",
        "Qi",
        "107 degree",
        "MrMobile",
        "68",
        "Two",
        "one",
        "the week",
        "16 millimeter",
        "Xperia",
        "24 millimeter",
        "3.5 millimeter",
        "10",
        "a9",
        "124 degree",
        "YouTube",
        "Google",
        "a9 Mirrorless Camera",
        "years",
        "VPN",
        "nine",
        "Aibo",
        "geo",
        "Sony",
        "MrMobile",
        "Huawei",
        "65",
        "every few years",
        "20%",
        "Venice",
        "12 megapixels",
        "Wi-Fi",
        "July 24th",
        "another month",
        "my days",
        "six and a",
        "83%",
        "two year",
        "second",
        "70 millimeter",
        "three",
        "4000 milliamp hour",
        "nearly half",
        "2020",
        "June 28th",
        "hertz",
        "my past seven or eight years",
        "Pocketnow",
        "Xperia",
        "as many as 20",
        "60",
        "Photo Pro",
        "Cinema Pro",
        "almost half",
        "today",
        "US",
        "U.S",
        "first",
        "One",
        "jack",
        "the Xperia Pro",
        "SuperSaf",
        "1200",
        "Julian",
        "the Xperia Pro",
        "MRMOBILE",
        "the Android Central Podcast",
        "19"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "FAC",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "GPE",
        "QUANTITY",
        "LOC",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL"
    ],
    "vector": [
        -0.06591270118951797,
        -0.017804831266403198,
        0.038005150854587555,
        -0.053101908415555954,
        0.020373215898871422,
        -0.06350508332252502,
        -0.016010209918022156,
        0.07550524175167084,
        0.02517663687467575,
        0.03168252110481262,
        0.07036130130290985,
        0.03801044076681137,
        0.025152666494250298,
        0.010866813361644745,
        0.03150349110364914,
        0.008908274583518505,
        0.09510752558708191,
        -0.03569202497601509,
        -0.024959756061434746,
        0.08354327827692032,
        0.012667793780565262,
        -0.12868839502334595,
        0.038708239793777466,
        -0.03308095782995224,
        0.017009960487484932,
        0.03865481913089752,
        -0.04336948320269585,
        0.01047950517386198,
        -0.031366072595119476,
        0.010024907998740673,
        -0.09114600718021393,
        0.05410430580377579,
        0.05867964029312134,
        0.042490214109420776,
        -0.02432815544307232,
        -0.15591490268707275,
        0.07064634561538696,
        0.003087397199124098,
        -0.04045524448156357,
        0.012368018738925457,
        -0.041656721383333206,
        -0.00959513895213604,
        0.006039852742105722,
        0.019705556333065033,
        0.039451830089092255,
        -0.03892786428332329,
        0.09164731949567795,
        0.02210860699415207,
        -0.007280188146978617,
        0.02553720772266388,
        -0.039430487900972366,
        0.015258977189660072,
        0.08801282942295074,
        -0.037983305752277374,
        -0.09569332003593445,
        0.026580004021525383,
        -0.043458711355924606,
        0.027088219299912453,
        0.04479612782597542,
        0.005367285571992397,
        0.05750875174999237,
        -0.023206466808915138,
        -0.016570141538977623,
        0.030935265123844147,
        0.030867990106344223,
        -0.017178568989038467,
        -0.0500313825905323,
        -0.07445580512285233,
        0.01954084262251854,
        0.029468443244695663,
        -0.04819208011031151,
        0.025790194049477577,
        0.02236969955265522,
        0.04958108440041542,
        -0.06975487619638443,
        0.060694076120853424,
        0.07874751836061478,
        -0.039733901619911194,
        -0.04652237147092819,
        0.022827232256531715,
        0.06381010264158249,
        -0.10932347178459167,
        -0.11515426635742188,
        -0.07409746199846268,
        0.03885243088006973,
        -0.03457184508442879,
        0.031576283276081085,
        0.06686509400606155,
        -0.05248064547777176,
        -0.04017378389835358,
        -0.05540166795253754,
        0.06677144020795822,
        -0.05234760791063309,
        -0.03676881268620491,
        -0.0585373155772686,
        0.008744234219193459,
        -0.02300243079662323,
        0.004640765488147736,
        -0.040959760546684265,
        -0.0006530444952659309,
        0.023308783769607544,
        0.043374206870794296,
        0.01604343205690384,
        0.032342202961444855,
        -0.00959928147494793,
        -0.0544438511133194,
        -0.005677561275660992,
        0.02391464076936245,
        0.03164370730519295,
        0.03825879842042923,
        -0.06775408983230591,
        -0.015214473940432072,
        -0.03794096037745476,
        -0.06914984434843063,
        -0.08938895165920258,
        0.03117302991449833,
        -0.028278697282075882,
        0.08534891903400421,
        0.11855936795473099,
        0.027762996032834053,
        0.014817707240581512,
        -0.06399122625589371,
        -0.08603358268737793,
        -0.05039375275373459,
        0.06888897716999054,
        -0.09422170370817184,
        -0.009264861233532429,
        4.9572991843915665e-33,
        -0.11363591998815536,
        0.10960905998945236,
        -0.06799085438251495,
        0.005506070330739021,
        -0.031150050461292267,
        0.017044294625520706,
        0.02925095707178116,
        0.054587651044130325,
        -0.028722276911139488,
        0.00027416457305662334,
        -0.016967764124274254,
        -0.02330286242067814,
        -0.052319932729005814,
        0.035096168518066406,
        0.02701198309659958,
        -0.03408635035157204,
        0.01233255211263895,
        -0.08234228193759918,
        0.0675315335392952,
        -0.013463475741446018,
        0.04413715749979019,
        -0.03063778765499592,
        0.035121381282806396,
        -0.04247976467013359,
        0.03242229297757149,
        0.025610722601413727,
        0.0867355465888977,
        -0.00702331168577075,
        0.06783575564622879,
        0.005444538779556751,
        -0.0848076194524765,
        0.011574583128094673,
        -0.012729132547974586,
        -0.04987553507089615,
        0.027097022160887718,
        0.01779862679541111,
        -0.023308375850319862,
        -0.09912983328104019,
        0.059305932372808456,
        -0.059105511754751205,
        -0.11322479695081711,
        0.07427293807268143,
        -0.09565355628728867,
        -0.01193943340331316,
        -6.96177885401994e-05,
        -0.036504801362752914,
        -0.06368490308523178,
        0.06067385524511337,
        -0.09764678031206131,
        -0.07140135020017624,
        0.0038325118366628885,
        0.04152125120162964,
        -0.07786978781223297,
        0.02516958862543106,
        -0.04657577723264694,
        -0.037666838616132736,
        0.026295501738786697,
        0.0008226826321333647,
        -0.02848753333091736,
        0.05329138785600662,
        0.04486817494034767,
        -0.025538375601172447,
        -0.06470311433076859,
        0.021390320733189583,
        -0.048879511654376984,
        0.08696319162845612,
        0.02392561547458172,
        0.04407206177711487,
        0.035144511610269547,
        0.08069368451833725,
        0.035583797842264175,
        -0.0207174401730299,
        0.04822571948170662,
        -0.05442501977086067,
        0.0501142293214798,
        0.05497957393527031,
        -0.012416122481226921,
        -0.019425692036747932,
        -0.011332334019243717,
        0.06445877999067307,
        -0.08808287978172302,
        0.044433705508708954,
        0.06178772822022438,
        0.012462287209928036,
        -0.03681304678320885,
        0.00897284410893917,
        -0.023560943081974983,
        -0.0513608418405056,
        -0.008174973540008068,
        0.04773425683379173,
        0.04784727469086647,
        0.0011550133349373937,
        -0.037256691604852676,
        0.0410790741443634,
        0.008761254139244556,
        -5.74124114240075e-33,
        -0.04783632233738899,
        -0.038407646119594574,
        0.03749968484044075,
        -0.03061732091009617,
        -0.045247580856084824,
        -0.050391897559165955,
        -0.08374178409576416,
        0.05409908667206764,
        -0.006249271333217621,
        -0.022707432508468628,
        -0.011968079023063183,
        -0.0048592970706522465,
        -0.04954594746232033,
        0.01587262935936451,
        -0.009528128430247307,
        -0.048264503479003906,
        0.04169168695807457,
        -0.11558373272418976,
        0.050269726663827896,
        -0.048340652137994766,
        0.05736032500863075,
        0.1100141778588295,
        0.03572285175323486,
        0.06397199630737305,
        -0.038553740829229355,
        -0.025888411328196526,
        -0.010233757086098194,
        0.01881435140967369,
        0.020850008353590965,
        -0.07090550661087036,
        -0.03321428596973419,
        0.014279010705649853,
        0.05718540772795677,
        -0.06499777734279633,
        0.04274185001850128,
        0.10318361222743988,
        -0.012254307977855206,
        -0.025489842519164085,
        0.07408972084522247,
        0.08491046726703644,
        0.025244688615202904,
        0.005777743179351091,
        -0.028927069157361984,
        -0.07684848457574844,
        0.08383961766958237,
        -0.05526793375611305,
        0.02632387913763523,
        -0.026940610259771347,
        0.056701283901929855,
        0.027606988325715065,
        0.06805893033742905,
        0.05478224158287048,
        -0.07559850811958313,
        0.007393768988549709,
        0.052450209856033325,
        -0.05377916619181633,
        -0.057905424386262894,
        -0.06984880566596985,
        0.024396924301981926,
        -0.038501396775245667,
        0.0722486823797226,
        0.0274936705827713,
        -0.09209047257900238,
        0.04589910805225372,
        -0.04360002651810646,
        0.023699365556240082,
        0.08725189417600632,
        -0.035847313702106476,
        0.03550654277205467,
        0.007455858401954174,
        -0.03632819652557373,
        0.007308477070182562,
        0.007876735180616379,
        0.023515086621046066,
        0.015444453805685043,
        0.04095112904906273,
        -0.08259940147399902,
        0.025591816753149033,
        0.02935498207807541,
        -0.0305419210344553,
        -0.02995341457426548,
        -0.007407534867525101,
        0.01793798804283142,
        0.03992125391960144,
        0.08048959076404572,
        -0.034334249794483185,
        0.0223440770059824,
        -0.04466673731803894,
        -0.11916893720626831,
        0.01546117477118969,
        0.014111570082604885,
        0.0027256240136921406,
        -0.045380327850580215,
        0.043498001992702484,
        -0.0706477090716362,
        -4.987292001601418e-08,
        0.07474514096975327,
        -0.04905501753091812,
        0.05057397484779358,
        -0.021502060815691948,
        0.02436746098101139,
        -0.033097103238105774,
        -0.08391645550727844,
        0.04891153797507286,
        0.14230594038963318,
        0.0051819393411278725,
        0.01844099722802639,
        -0.006937458645552397,
        -0.03192517161369324,
        0.018382759764790535,
        -0.005088868550956249,
        0.0918223112821579,
        0.009803656488656998,
        0.012884911149740219,
        0.004677622579038143,
        0.08082989603281021,
        0.04154092073440552,
        0.07100646197795868,
        -0.0229375958442688,
        -0.05644139647483826,
        0.0679812878370285,
        -0.002604184439405799,
        -0.10144943743944168,
        0.0006843307637609541,
        0.06916200369596481,
        -0.045116126537323,
        -0.030859582126140594,
        -0.0374269112944603,
        0.07611125707626343,
        -0.028107307851314545,
        0.015645818784832954,
        -0.025178104639053345,
        0.022820530459284782,
        -0.0326106958091259,
        0.06931933015584946,
        -0.06141176074743271,
        0.07640878111124039,
        -0.061385784298181534,
        -0.056208934634923935,
        0.04928066208958626,
        0.03461622819304466,
        -0.028922878205776215,
        -0.048763636499643326,
        -0.08420301228761673,
        -0.05945267528295517,
        -0.033556487411260605,
        -0.02403772622346878,
        0.001299970201216638,
        0.0067343697883188725,
        -0.030496660619974136,
        0.04798991605639458,
        -0.025024816393852234,
        0.03184467926621437,
        0.017878055572509766,
        -0.05379052087664604,
        0.06835775077342987,
        0.06504407525062561,
        -0.06541649252176285,
        -0.03621603921055794,
        0.0763692632317543
    ]
}