{
    "id": "SYc922ntnKM",
    "title": "I invested $225K in Framework Laptop - 1 Year Update and 12th Gen Upgrade",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-01T18:44:58Z",
    "video_url": "https://www.youtube.com/watch?v=SYc922ntnKM",
    "category": "Science & Technology",
    "tags": [],
    "views": 3442386,
    "likes": 131342,
    "comments_count": 6308,
    "description": "Visit  and use offer code LTT for 10% off  Save 10% and Free Worldwide Shipping at Ridge Wallet by using offer code LINUS at   A year after investing, has Framework upheld their end of the bargain? We take a look at how the company has grown over the past year, and how the repairable, upgradable laptop manufacturer is fairing. We also upgrade Linus' personal laptop with a brand new 12th-Gen Intel Processor.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:38 Motherboard Upgrade 2:58 Growing Pains 5:54 Back Panel & Hinge Upgrade 8:17 Hopes for the Future 9:20 Reassembly 10:27 The Framework \"Desktop\" 15:06 Finishing the Upgrade 16:43 Environmentalism and RTR 18:21 What's Next? 20:22 Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1446885-should-i-take-back-my-225000/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I spent nearly a quarter million dollars investing in Framework, a laptop company with a mission to change the game by providing full user upgradeability and serviceability in the name of right to repair environmentalism. And I promise them and you that my role as an investor in their company would be to keep an eye on things, even going so far as to publicly call them out and dump them if they dared betray my trust, no matter how much it ended up costing me. Well, guess what, it's been a year and a lot has changed? So how is Framework holding up? Has it been smooth sailing or are they on stormy seas, like a pirate looking for a segue to his sponsor? - Ridge, Ridge wallet has redefined the traditional wallet with its compact frame and RFID blocking plates. The bulge in your pants, shouldn't be from your wallet. Use offer code Linus to save 10% and get free worldwide shipping. Australians, huh? - Let's start with the good. Since we last covered them, Framework has populated their store with replacement parts for pretty much every component of their laptop, including drop in replacement motherboards with 12th Gen Intel CPUs. To see how easy this migration process is then, I will be upgrading my Framework to a new motherboard. But, of course, we aren't gonna be tossing this perfectly good 11th Gen motherboard. That would be a waste. We're going to use it to make a whole other mini PC using components from Frameworks marketplace. I'm gonna start by pulling out my SSD wireless card, so the memory modules, and I guess that's it. I start pulling out the board. - [Adam] Unplug the battery. - Unplug the battery, you say. No, that doesn't really seem like a good idea. Let's just start ripping it open, right? Wait, I actually stopped using my Framework laptop for a little while. And the short version of the story is that we were gonna do a video where we spilled Coke, right across the keyboard of five different laptops, including my daily driver. And then went through the process of repairing all of them to compare parts and service manual availability and costs, and then we didn't get around to it. So my personal machine, this one, has actually been sitting on the pending-project shelf for three months. And just because I'm invested in Framework doesn't mean I don't still love test driving other devices. I've been playing around with the new Ryzen 6000 version of the Flow X13 from Asus, and it is mostly pretty amazing. Is that really all there was to it, we've got the board out already. Which one's which. - [Adam] They can make it repairable but they can't make it idiot proof. - It shouldn't surprise me 'cause I've already built one of these things, but this is shockingly painless. I think if you were experienced, if you were upgrading a whole fleet of these things you could probably perform this operation in five minutes. As with any startup, Framework has not been perfect. According to the community, the most common issues with their 11th Gen model, where'd it go? Here it is, are battery drain during sleep, failing track pads, and a weak hinge for the screen. Now that last one can be easily addressed with Frameworks hinge upgrade that now ships with all new laptops and, hello. Ah, there it is, we also got one to upgrade my old machine. As for the track pads, once again, those can easily be repaired by the user. So you don't need to send your laptop away and be completely computerless just to get a replacement track pad. However, \"Well, you can just fix it yourself,\" isn't an excuse for bad quality assurance because that wastes both time and money for Framework and for you. Also, the more parts that fail, the more e-waste gets created which is against their goal. Framework acknowledges this on their blog though, and says that they are focused on ironing out the kinks. By the way, we have finally ironed out the kinks on the LTT screwdriver. Make sure to sign up for in stock notification because it's coming real soon. As for the battery drain, well, that one is a bit more complicated. An ultra portable laptop, isn't really portable if you need to have a charger with you all the time. And other publications have seen similarly specced and sized options from Dell and Acer, getting anywhere from 50 to 100% more battery life per charge. The problem seems to be due to the expansion cards. And while Framework has issued some beta bios updates, hoping to remedy the issue, it remains not completely resolved as we're filming. Exacerbating the problem on Linux, Intel doesn't have proper support for their deepest S3 sleep states on the Penguin flavored operating system, putting an ugly stain on Frameworks, otherwise, excellent support record with the open source community. An AMD variant might be a way around this, but in spite of me making introductions nearly a year ago I haven't received any update from either side. So consider this a public call out, AMD and Framework. If you guys want to be seen as companies that care about consumer choice, you've gotta walk the walk. Get your collective acts together so that we can have Ryzen in our Frameworks, please. Seriously, don't you wanna be part of this AMD. Compared to my early unit, not only has the hinge been upgraded, but there's also a reinforced back panel. So I'll be upgrading mine as we go here. And this is really cool because even Framework benefits from their own modularity. They don't actually have to re-engineer a whole laptop chassis to improve their build quality. They can just swap the parts that they send to the assembly line and make these kinds of upgrades on the fly. Do they really need a stronger back panel? I guess there were other benefits as well though. I've never actually had the back panel part. So this is kind of cool. I wonder how hard this is to do. I'm extremely frustrated that I do not know where these screws came from. This is really, really bothering me a lot. Here's a spot where one of these screws is, there's some here. Okay, so it's definitely a Framework screw, but I have absolutely no idea where it came from. - [David] Do you wanna parts tray? - That seems unnecessary, doesn't it? - [David] Yeah. I'll just remember these are all screen screws. I will need my old camera module then. (spring connector clicks) Whoa, what just happened? (Spring connector clicking) This ribbon cable stays. There we go, like that, sure. Shoot, how was this in here? Oh, I would strongly recommend paying attention to how it was assembled. I genuinely cannot figure out how to get this ribbon cable in here. Hold on. Ah, yes, there we go. I can put the new hinges on this as well, great, okay. I guess part of that is gonna be removing the old hinges. No, no, the display. Yeah, the display cables here, so that can come out also. Oh, darn it, I cable managed in the WiFi antennas, and they need to come off now. Be really careful with these super fragile little connectors. You can rip them off the board of the WiFi module, and then good luck repairing that. If we just kind of go like this. Was this really so bad? Is the new one better? Wow, that that's pretty stiff. This boy goes here. I didn't keep track of screws again. That seems right. Ah, crap, I forgot about the WiFi things. I would say that the back panel upgrade is a little finickier than the motherboard upgrade. For the benefit that I'm getting, which is an increase in stiffness and more recycled aluminum. Remember how I said, I definitely don't need a parts tray. Where are all the screws? Okay, hold on, hold on. Display cable here we go, right? No, wait, what is this? What the hell is this cable? Oh no, which ones are the screws for the display now? Whatever it is, I need four of them. I hope that a third-party-accessory ecosystem can develop further. Dbrand, shout up by the way, does offer their protective skins, and there are generic carry cases that fit the Framework pretty well. But what owners really want is more variety in the modules. There is a small community of people creating custom designs. Thanks to Framework's open documentation, but their official lineup, kinda lacking. No full SD card reader, no powered amplifier, not even a dual USB-C card, and worst of all, no ethernet port. - [Adam] Oh actually they're making one. - Wait, oh, do we have one? Oh, shut up. Wait, what all's in here? Ooh, sometimes it's good to be a backer. An idea diary, thanks Framework. This was definitely a good use of time. This, on the other hand, was good use of time. Oh, wow. - [David] It's transparent. - How is this gonna work? One moment please. You want me to use the orange bezel? It really does look like a toy. I'm sorry Framework, I'm not into the orange bezel, but I'm sure someone is. That one's good, that one's good. Ah, yes, my bezels now on, there's the new hinge. Right, right, I should put the keyboard back on. How many extra screws do I have? Good God, that's a lot. These are all from that, so I'm sure it's fine. They're not. - Framework laptop might have a percussive rattle. (laptop clucking) - Oh no, what did I do? The keyboard's not installed yet. That should fix that. And let's get this battery connected. For such a simple operation, this has been very scattered. I'm sorry, that goes in there. Oh yes, assembled. - They launched recovery. Did I set the BitLocker on this damn thing? Come on! (men laughing) - [Adam] So BitLocker's gonna ask you for your key which is on your old motherboard. So we need to set this up right now. - This is a perfect opportunity to talk about what I'm going to be doing with my old Framework motherboard. Woo, this right here is a 3D printed case for the Framework motherboard that they provide the schematics for. There are also community designed ones so that you can take your old system, and turn it into a slim desktop. I would say that threading a tiny little laptop screw into 3D printed plastic, not the best. I mean, it's working to its credit. Like motherboards not coming out. Here we go, yes. How do you access the power switch? - [Adam] I don't know, chopstick. - Give me that HDMI. I want that HDMI, okay. Hey, WiFi thingamajigs. Maybe I'll use this for the temporary setup for the LAN center at home. We haven't got the PCs for the rack yet. So I've just got some laptops and stuff in there but I could totally see myself just using one of these for the time being. I'm gonna do a little tour of it as an exclusive behind the scenes for Floatplane, by the way, it's not worth a full video, but you can go see it at floatplane.com if you're subscribed. This is a 2070, and I like this one because it's super compact. This is actually the one that I used to use for travel. Oh, maybe there's a chassis intrusion thing that you have to disable. Yeah, this continues to not... Wait, did it need a bios update to support this mode? Shoot, I just spit on it, dammit. It looks like I'm running an older version of the 11th Gen motherboard firmware that doesn't allow it to boot without a battery installed. So our devious plan is to gently connect the battery from the Framework laptop here that is fully assembled. I mean, at this point, you know what, it might actually be easier to just pull the battery out of the chassis because it's like three screws? Okay, come on baby. Okay, there's just a little bit of lip there. Yeah, ooh, there we go. And then they have a chassis intrusion detection thing here and then maybe the switch will work. Look at that. Let's take things one step further and maybe grab the built-in display cable. I am gonna power it down. - [David] Whoa, whoa, whoa, whoa. - What, what? - [Adam] It's on? - Oh God. Sorry, there's so much glare on the screen from that light. I couldn't see that. So I needed to not hold down that thing then. - [David] Oh, oh. - That might have been... - Woo, all right. - That might have been the hinge detection. - Sure, wait, wait! Shut up! This is two and a half gig. No way! Yep, it's two and a half gig LAN. Okay, do you have any idea where to get the firmware or did you just not prepare for this video? - I had no idea that there would be more firmware to get. - So I need to go get my BitLocker recovery key before I update my bios, and before I put my drive into the new motherboard. Here we go, starting our firmware update. We rebooted, and we're back to the red lights flashing. When I hold this thing, it goes green and blue over here, which is interesting. The problem is that it specifically says, \"Hey, don't like power off your computer or anything 'cause I'm flashing the firmware.\" So I have no idea how long to leave this thing like this. - How many blinks though? - Oh boy, this is a big list. The code will blink white, then 12 blinks that are red or green or orange. This is not what we've been seeing. (David laughing) - I mean, it kind of taken that long to update the firmware, so I'm going for it. - Before we go for anything, let me read. - And it's off. - Oh (beep) Through the danger zone. - It fired up without me holding down the thing this time which might indicate that we have the new firmware on it. - Sure. - Well, I don't know. - [David] Oh, oh, oh, oh. - Whoa, hey. Okay. Okay, it's doing the update. All right. Good, success. I still don't know how you're supposed to power it on. Are you really supposed to just like take off the cover and freaking press this button? - [David] Is that circle thing the power button? Does it have a little rod sticking out of it? - Nope. Nope, not even a little. Oh, wait, it totally does. [David] I'm so smart. - Nice David. This is freaking awesome. And because it's a Framework and they've got all their modules, things that you might not have needed when you were using it as a mobile device, like say a full size display port connection, can be added once you're using it as a desktop. Now, that we've got everything resolved with the old board then, we can go ahead and get the new one fired up. I wouldn't actually recommend this for a thin and late notebook. Not because the performance isn't great but because it doesn't exactly sip power, but I just want to get the thing fired up. And I haven't gotten around to transferring the other SSD back over here yet. Closes up like that. Held in place by magnets. This is actually legitimately super cool. Yes, the main board upgrade was pretty expensive. It was over $1,000, but it's also a 1280P Core i7, that's a fricking expensive CPU. And, of course, it has all of the other components on it as well. If I were to buy a full on brand new laptop with that level of hardware, I'd be spending a lot more than that, and I wouldn't have been able to repurpose my old laptop like this. Obviously, I could sell it, but this is way more flexible. I'm able to just buy only the things I need to bring my machine up to date and reuse everything that I already have. Touchpad, keyboard, screen, webcam, my modules. Subject of modules, I'm actually gonna swap out this HDMI module for a display port module right now. Oh wait, no, that's not actually what I want do, I'm dumb What I want to do is plug the display port into this. - [David] Hey. - Hey, look at that. Obviously, not many people have these external Thunderbolt GPU enclosures, but I said way back when they came out, \"Over the long term they're expensive, but they might not actually be a completely stupid investment.\" This is cool. Is this not cool? - It's pretty damn cool. - We got a little sidetracked having fun with the desktop build, but let's put the product aside and talk about what Framework has done to improve their efforts around environmentalism and right to repair. First up, they've launched an option to pay $100 to make your order carbon-neutral through donations to carbon sequestration efforts. I'm not entirely convinced that buying carbon credits is a true path towards the greener future, but they also continue to find ways to introduce more post-consumer materials in the construction of their laptops. Their new back plate, for example, is made of 75% recycled aluminum, while also being stronger, compared to 50% from the old one. That's the kind of effort that you only make if you actually care, so thanks guys. There's still room to do better. So why don't we call this progress. As for right to repair, well, it's one thing to offer replacement components but it's quite another to allow end users and independent repair shops to repair the components themselves. Friend of the channel and right to repair advocate, Louis Rossmann, has spoken at length about the importance of making schematics available, and thanks to his advocacy and others, schematics are available to repair shops, fully available, which no company has ever done for Louis' repair shop. Most companies avoid providing schematics to maintain an influence over their products by making deeper repairs too difficult to be economically viable. This behavior is present across all major PC manufacturers and getting those chip giants to change would take a massive legislative action that is well beyond Frameworks capabilities at this point in time. So I guess we'll call this one a work in progress as well. What is the future of the company? Well, in February they secured 18 million Series A funding led by a company called Spark Capital, and Framework is using the funds for development of upcoming product categories and the long roadmap of new modules and geographic expansion for the Framework laptop. So, given that I don't know anything other than what that says there, I would say, I guess we'll see what's next. All I know for now is that I'm still happy with what Framework's doing, and I'm pretty happy with my upgrade here. We started with a pedestrian Quad Core CPU and upgraded all the way to a 14-Core in the same chassis. I don't think that's ever happened in a mobile device like this. Unlike Apple who, believe it or not, intentionally, even though they changed almost nothing about the mainboard design or the chassis, prevents motherboard swaps between their nearly identical M1 and M2 laptop shells. Framework, on the other hand, allowed me to spend hundreds of dollars less than what a brand new top-spec machine would've cost with all of their newer, more robust components. And I still have these leftovers at the end that I can turn into a 3D printed mini PC running an 11th Gen CPU. It's a pretty sick little setup. Sick like the segue to our sponsor. - Squarespace, if you're building your brand online in 2022 you should absolutely have a website. And if you need a tool to help build that brand look no further than Squarespace. Squarespace is the all-in-one platform to help expand your brand online. You can make a beautiful website, engage with your audience, and sell anything and everything from products to content. We love Squarespace so much, we use it here at LMG. It's custom templates make it easy to stand out, with a beautiful website that fits your needs. You can maximize your visibility, thanks to a suite of integrated SEO features, and their analytic insights help you optimize for performance so you can see what's going well and what needs a little work. So get started today and head to squarespace.com/ltt and get 10% off your first purchase. - Thanks for watching. If you wanna learn more about why I invested in Framework, check out that video because a lot of your questions will be answered there rather than here. This is just about the product. You already had your hand down when you said- - Yep. - Ow. (everyone laughing)",
    "transcript_keywords": [
        "Framework",
        "Framework laptop",
        "laptop",
        "Frameworks",
        "Framework motherboard",
        "thing",
        "good",
        "Frameworks hinge upgrade",
        "battery",
        "motherboard",
        "Wait",
        "things",
        "back",
        "make",
        "screws",
        "display",
        "repair",
        "Framework screw",
        "Gen",
        "pretty"
    ],
    "transcript_entity_values": [
        "webcam",
        "Ryzen 6000",
        "one",
        "Frameworks",
        "14",
        "Acer",
        "hundreds of dollars",
        "Thunderbolt GPU",
        "Louis'",
        "a year",
        "five minutes",
        "Ridge",
        "12th",
        "four",
        "LAN",
        "Apple",
        "SSD",
        "Dbrand",
        "2022",
        "first",
        "nearly a",
        "Penguin",
        "One",
        "SD",
        "Floatplane",
        "Quad Core CPU",
        "M2",
        "M1",
        "First",
        "Asus",
        "Spark Capital",
        "10%",
        "daily",
        "18 million",
        "Gen Intel",
        "Framework",
        "David",
        "today",
        "BitLocker",
        "Framework",
        "the Flow X13",
        "five",
        "Dell",
        "Framework",
        "S3",
        "February",
        "50 to 100%",
        "three months",
        "Louis Rossmann",
        "AMD",
        "over $1,000",
        "LMG",
        "LTT",
        "three",
        "AMD",
        "Squarespace",
        "CPU",
        "Ryzen",
        "RFID",
        "100",
        "12",
        "1280P",
        "HDMI",
        "11th",
        "Linus",
        "Australians",
        "Coke",
        "nearly a year ago",
        "third",
        "two and a half",
        "75%",
        "Linux",
        "50%",
        "Intel",
        "Core",
        "2070"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "ORDINAL",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "NORP",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.09803327918052673,
        -0.05070171505212784,
        -0.02341480366885662,
        -0.0860416367650032,
        0.1385067254304886,
        0.029903432354331017,
        0.01942535862326622,
        0.043496180325746536,
        -0.05643082782626152,
        0.010884557850658894,
        0.08534389734268188,
        0.10098028928041458,
        0.013801432214677334,
        -0.08242369443178177,
        0.06369352340698242,
        -0.01230159867554903,
        0.02002796344459057,
        -0.11756191402673721,
        -0.0892825722694397,
        -0.03279901295900345,
        -0.04211670905351639,
        -0.024378500878810883,
        0.012520934455096722,
        -0.0015642880462110043,
        0.057714298367500305,
        -0.07214950770139694,
        -0.002968951128423214,
        -0.1147475317120552,
        0.006674495525658131,
        -0.0044825151562690735,
        0.00864960066974163,
        0.0670236349105835,
        -0.01707565039396286,
        -0.016249345615506172,
        0.057048097252845764,
        -0.01566724292933941,
        0.026161301881074905,
        -0.10538862645626068,
        -0.06903242319822311,
        -0.07781362533569336,
        -0.04603589326143265,
        -0.04943295940756798,
        -0.003597122384235263,
        -0.03517590090632439,
        0.04736243933439255,
        -0.055369533598423004,
        0.02781868353486061,
        -0.04298048093914986,
        -0.022885553538799286,
        0.01951920986175537,
        0.022930556908249855,
        -0.0480923093855381,
        0.020002225413918495,
        -0.10316777229309082,
        -0.09286700934171677,
        0.05758794769644737,
        0.01908155158162117,
        -0.043053217232227325,
        0.010149151086807251,
        0.009225071407854557,
        0.07203850150108337,
        -0.10195019841194153,
        -0.03078685700893402,
        0.1109437420964241,
        0.016594942659139633,
        -0.04233701154589653,
        0.032715942710638046,
        -0.02623087167739868,
        -0.03710512816905975,
        -0.025402601808309555,
        0.05824880674481392,
        -0.07851079851388931,
        0.052402712404727936,
        0.08852169662714005,
        -0.0330796055495739,
        0.024371299892663956,
        0.07465160638093948,
        0.010048446245491505,
        0.08480150252580643,
        0.005198545288294554,
        -0.013760803267359734,
        0.010447192937135696,
        0.00524328276515007,
        -0.020246190950274467,
        -0.02740810066461563,
        -0.0253913477063179,
        0.03644333407282829,
        0.01291022077202797,
        0.01590682379901409,
        -0.07505693286657333,
        0.09305331110954285,
        0.03041822463274002,
        0.09046818315982819,
        0.0583733394742012,
        -0.055510614067316055,
        0.005920125637203455,
        -0.0031093915458768606,
        -0.023877721279859543,
        -0.055849019438028336,
        0.048431821167469025,
        -0.005572322756052017,
        0.04751105606555939,
        0.03679712861776352,
        -0.10011609643697739,
        -0.07984374463558197,
        -0.05623048543930054,
        0.025148095563054085,
        0.09396274387836456,
        0.016333792358636856,
        -0.018211781978607178,
        -0.07371817529201508,
        0.06068319082260132,
        -0.027024319395422935,
        -0.002890076022595167,
        0.019854199141263962,
        0.002234706887975335,
        -0.025450311601161957,
        -0.026610596105456352,
        0.08661311864852905,
        -0.0022811105009168386,
        0.012745562009513378,
        0.03339722752571106,
        -0.051400989294052124,
        -0.03229842707514763,
        -0.11647961288690567,
        0.03243356943130493,
        -0.03474631533026695,
        -6.861073080646718e-34,
        -0.011990364640951157,
        0.016287440434098244,
        -0.04096955060958862,
        -0.07463567703962326,
        0.01049070991575718,
        -0.010350960306823254,
        0.0288946945220232,
        -0.018588682636618614,
        -0.02255505509674549,
        0.006391425151377916,
        -0.06027223542332649,
        0.0038941705133765936,
        -0.05921798199415207,
        0.05294562131166458,
        0.022442074492573738,
        -0.05826578661799431,
        -0.059058696031570435,
        0.04910600930452347,
        0.07257373631000519,
        0.007122935727238655,
        0.027789654210209846,
        -0.0030561082530766726,
        0.017027102410793304,
        -0.05063684284687042,
        0.07749070972204208,
        -0.02835274115204811,
        -0.00705933989956975,
        0.01089003961533308,
        0.04684508219361305,
        0.043650511652231216,
        -0.003164836671203375,
        -0.023729583248496056,
        -0.04840230941772461,
        -0.05721239745616913,
        -0.07615882158279419,
        0.0173686221241951,
        0.013628640212118626,
        -0.09536522626876831,
        0.06250238418579102,
        -0.047154203057289124,
        -0.03705592826008797,
        0.08003351837396622,
        -0.094169020652771,
        -0.08776766806840897,
        0.008253715001046658,
        0.016073862090706825,
        0.027989843860268593,
        0.04795822873711586,
        -0.004228162579238415,
        0.006916409824043512,
        -0.12814876437187195,
        0.015924474224448204,
        -0.059728868305683136,
        -0.011649107560515404,
        -0.008450580760836601,
        0.02101820334792137,
        0.02775455452501774,
        -0.0670178234577179,
        0.09067779034376144,
        0.05725637450814247,
        0.04902699589729309,
        -0.058568842709064484,
        0.03775007277727127,
        -0.036281853914260864,
        -0.05228448659181595,
        0.0543631948530674,
        0.04857685789465904,
        -0.0447150394320488,
        -0.05817131698131561,
        -0.004584279377013445,
        -0.01641063764691353,
        -0.056518640369176865,
        -0.024286923930048943,
        -0.0048576113767921925,
        0.04788375273346901,
        -0.04288136586546898,
        -0.07761754095554352,
        0.04912980645895004,
        0.03746126592159271,
        -0.0012915389379486442,
        -0.00045311159919947386,
        0.05127101019024849,
        0.04675813391804695,
        0.015512815676629543,
        0.024561066180467606,
        0.056235261261463165,
        -0.006194337736815214,
        -0.006685234140604734,
        0.006576306652277708,
        0.011318339966237545,
        0.00040904575143940747,
        -0.028955483809113503,
        0.03700565546751022,
        0.008647001348435879,
        -0.01561784092336893,
        -3.0769214828086174e-33,
        -0.03651757910847664,
        0.013099316507577896,
        -0.04041038826107979,
        0.01484739501029253,
        0.00020995529484935105,
        -0.01432045828551054,
        -0.026710914447903633,
        0.024005502462387085,
        -0.01622777432203293,
        0.01831645704805851,
        0.008487640880048275,
        0.025945626199245453,
        -0.05152719467878342,
        -0.02953280322253704,
        0.015824956819415092,
        -0.09377127885818481,
        0.0059449984692037106,
        -0.09192516654729843,
        0.06935364753007889,
        -0.04859483242034912,
        0.07370080053806305,
        -0.0014909905148670077,
        -0.004886690527200699,
        0.006333533674478531,
        -0.005638032220304012,
        0.009534991346299648,
        -0.08942963927984238,
        0.044184476137161255,
        -0.007586794439703226,
        0.014329339377582073,
        0.03794800862669945,
        -0.053015999495983124,
        -0.04477331414818764,
        0.018365448340773582,
        0.09552668780088425,
        -0.0569271519780159,
        0.07376761734485626,
        0.043580036610364914,
        -0.00624588318169117,
        0.014309067279100418,
        0.05341857671737671,
        -0.017513848841190338,
        0.03764500096440315,
        0.001311432453803718,
        0.06263011693954468,
        -0.0647997260093689,
        -0.020406408235430717,
        -0.13430967926979065,
        0.07205495983362198,
        -0.07013793289661407,
        0.0007728705531917512,
        -0.05373920872807503,
        0.13360801339149475,
        0.025754673406481743,
        -0.08540761470794678,
        0.038277022540569305,
        0.061539873480796814,
        0.044372282922267914,
        -0.03418426960706711,
        -0.03545127063989639,
        0.016199227422475815,
        0.04382476955652237,
        -0.001647070748731494,
        -0.011820361949503422,
        0.036279354244470596,
        0.0034133773297071457,
        0.01145964115858078,
        -0.008152133785188198,
        -0.02850106731057167,
        -0.06569857150316238,
        -0.013912304304540157,
        -0.08852500468492508,
        -0.016334081068634987,
        -0.08716126531362534,
        -0.07947875559329987,
        0.04008321464061737,
        0.016460545361042023,
        -0.053074151277542114,
        -0.011379417032003403,
        -0.0456051379442215,
        0.014674385078251362,
        0.005806121975183487,
        0.05392483249306679,
        -0.013650694862008095,
        0.011253353208303452,
        -0.04022456705570221,
        0.0718482956290245,
        -0.08148697763681412,
        -0.0388435535132885,
        -0.006085398606956005,
        -0.07857819646596909,
        -0.021757015958428383,
        -0.046991921961307526,
        0.01838025450706482,
        0.046393074095249176,
        -5.708600170351019e-08,
        -0.03916563093662262,
        0.054563648998737335,
        -0.009384204633533955,
        0.06771475076675415,
        0.01462129782885313,
        -0.05258778855204582,
        -0.012640470638871193,
        -0.0044569531455636024,
        0.06213713437318802,
        0.037477683275938034,
        0.03726157546043396,
        -0.0436154380440712,
        -0.05989743396639824,
        0.0242446456104517,
        -0.037293750792741776,
        0.041962750256061554,
        -0.0944509506225586,
        0.06460912525653839,
        -0.009497423656284809,
        -0.022274360060691833,
        0.0536457858979702,
        0.08013705164194107,
        0.10131281614303589,
        -0.033591125160455704,
        -0.021762419492006302,
        0.052933696657419205,
        0.06767463684082031,
        0.07124529778957367,
        0.14381097257137299,
        0.031158166006207466,
        -0.10618309676647186,
        0.0171526987105608,
        0.019679326564073563,
        -0.004028462339192629,
        0.008701982907950878,
        -0.07885913550853729,
        -0.02670867182314396,
        0.03373907506465912,
        0.09095100313425064,
        0.0600375235080719,
        -0.023970771580934525,
        0.0063348086550831795,
        0.004996154457330704,
        0.0020249190274626017,
        0.0854286253452301,
        -0.005802905652672052,
        -0.05259257182478905,
        -0.054507773369550705,
        -0.007967091165482998,
        0.02397792972624302,
        -0.007299625314772129,
        0.007111764512956142,
        -0.04244203492999077,
        0.06574409455060959,
        -0.008927912451326847,
        -0.04808264598250389,
        -0.08082988113164902,
        0.03843670338392258,
        -0.03913756459951401,
        0.07166188210248947,
        0.009182997979223728,
        -0.17791302502155304,
        0.017093617469072342,
        0.06346988677978516
    ]
}