{
    "id": "T1ZnAwUg9CU",
    "title": "You’re cooling your PC wrong. - PC in a Grow Tent",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-09T17:10:47Z",
    "video_url": "https://www.youtube.com/watch?v=T1ZnAwUg9CU",
    "category": "Science & Technology",
    "tags": [
        "Grow tent",
        "PC",
        "Summer",
        "Heat"
    ],
    "views": 1692161,
    "likes": 66218,
    "comments_count": 4220,
    "description": "Get 10% off your purchase with code LinusTechTips at   Get 50% off (up to $200) your annual subscription when you sign up with Zoho Desk at:   Get a workshop jacket:   PCs create a lot of heat, so if you have a small gaming room it can get uncomfortably warm in the summer. Luckily we have a solution - a grow tent.  Discuss on the forum:   CAD files coming on Monday, apologies.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 0:30 - Why this idea isn't all that dumb 2:03 - Tent assembly 4:22 - Window adapter machining 7:54 - Shop jacket 8:19 - A little burn 8:50 - Window adapter install 11:38 - Fan! 12:30 - Tent install 14:20 - The moment of truth 15:26 - Moonside! 16:06 - Outro",
    "description_links": [
        "https://bit.ly/3xOugDT",
        "https://lmg.gg/zohodeskltt",
        "https://www.lttstore.com/products/workshop-jacket",
        "https://linustechtips.com/topic/1442130-you%E2%80%99re-cooling-your-pc-wrong/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- You can't cool a computer with hot air, and heat from a computer in a small confined space equals well, a whole lot of swass. Fortunately, I have a solution. By encasing my computer and this here grow tent. I wanna be cool as a cucumber. Cool just like our sponsor. - Zoho Desk. Over 50,000 businesses worldwide trust Zoho's context-aware help desk to improve productivity and ensure their customers are kept happy. Get 50% off your annual subscription with code ZDESK50 at the link down below. - To start, I'd like to thank the mining community for the glut of cheap GPUs that they just flooded the market with, and also the idea to encase your computer in a plant grow tent. Now, with gaming computers just drawing so many watts these days, it might make sense to do this with a single gaming computer instead of a whole mining rack. Before we get to it though, I wanna just describe why this idea actually isn't all that dumb. There are a number of ways to try and cool down in the summer. You could just point a fan at your face. But that doesn't fix the fact that your room is still super hot. Cracking a window can also work when it's cool outside. But on the days when you need it the most, the air from the outside's probably hotter than the air inside your house. Another option would be to install an air conditioner. But that comes with its own whole set of problems. If you only have a single circuit in your room, there's a good chance that running an air conditioner and a gaming PC at the same time will result in tripping your breaker. Second, cost. Our grow tent cost us only $65, while an okay-ish air conditioner starts at 10 times that. Also I'm sure your friends on Discord won't be super stoked when you're running a compressor right next to your mic. And it doesn't get to the root problem that we have. You're creating a bunch of heat in a small little room. I have air conditioning that's in my apartment, but that does not help me when I'm sealed in this room just poaching in my own sweat, which brings us to the final option. Just open the door, maybe? Well, if you live alone, then sure. But yelling at your useless teammate in Rocket League can be rather disturbing for the others in your house, and unfortunately the doors here have to stay closed. So all right then, grow tent it is. Let's go and build it. All right, let's see what we're working with here. I got this grow tent from Amazon for $65. The reviews for it were fine, but at the same time, no one was using it to cool a PC, so. I also saw this one's two feet by two feet. But some reviews of grow tents, not this one specifically, they were like, oh, it says it was two feet by two feet, but it was actually more like one and a half. If that's the case, we're screwed.. Oh my God, that's a that's green right there. I can already tell this is not going to be a girlfriend-approved setup. There it is. Look at the instructions. Step one, frame. Step two, put the thing on. They're not wrong, but that's not the most helpful. In fairness to VIVOSUN, this seems pretty self-explanatory. I don't think we're gonna have any trouble putting this together. One slightly unfortunate thing about doing it this way is that this is a lot bigger than my computer. In one direction, two feet is about perfect to fit a normal desktop. The problem is my desktop's definitely not two feet wide and it's definitely, definitely not 36 inches tall. This is going to be way bigger than it needs to be. But at the same time, it's the smallest one I could get. Wait, David. - [David] Yo. - What do you think these are for? - [David] Horizontal reinforcement? - It did not improve the structural rigidity at all. We can worry about those later. Yeah, why is this what's holding it together? Okay. Feels not too bad now. I can dig this. I am slightly confused about all the other stuff we have. I wonder if we'd get better performance with or without the intakes covered. Find that out later. Oh, here. It's one of those things where they said that it was adjustable, but never mentioned how adjustable it was or like what the sizes were or anything like that. I don't know if our tubing's gonna fit in there. Okay, well, this is pretty unfortunate. I asked for insulated tubing, specifically because it was black on the outside. We did not get the right one. This is so weird. Okay, is it gonna work though? Can we just chuck it in like that? Duct tape it up and call it a day? It'll need some work, but that's gonna be just fine. Here's the basic plan. I have terrible, terrible, awful casement windows. Need to make a big old adapter for it. That's what this is going to be. So we have this right here, hose adapter, also a big acrylic pane so hopefully I don't block too much light. My favorite thing about this design though, that I had Sarah go ahead and draw me an elephant. This right here when the hose comes out, it should look like the elephant's trunk. I'm very stoked. Okay, let's do it. Before we try cutting the big elephant, which is gonna take about half an hour, I wanna just try etching a couple small ones, get the settings dialed in and then we can do the full thing and know that it's gonna turn out great. I'm super glad we tested out the etching of the elephant first, 'cause we had a little bit of a problem. The laser, you know, it travels fast but when it has to do a tight corner, it slows down and then accelerates back up. Normally what you do in that situation is lower the amount of power that it's putting out. Problem is we're already pretty much as low as our laser will go. It's too powerful for what we're doing today. Instead, what I've done is defocused it. So, you know, we have a nice large beam, it disperses way more heat and hopefully we won't just have an elephant fall out of our piece at the end. As a bonus with these settings, it's only gonna take like 10 minutes. To attach your big sheet of acrylic to the window, I'm going to make a bunch of little clamps out of HDPE. The material is a little bit of overkill, but it also is the absolute perfect piece of material for the job, and I had a big piece of it laying around. I actually made this right here, the little extractor thingy. What the (beep) is this called, David? - [David] I don't know! - Dust collector. There we go, got it. - [David] Yeah. - I love this. We have such high utilization of the shop right now. We're gonna be doing this at the same time the laser's cutting our stuff out. And if you come over here, our 3D prints have just started. This is going to take us 14 hours. I really wish we had the Pantheon at this point in time, but we don't. So we're running two of them, 'cause if one of them fails, we are completely screwed when they arrive here tomorrow. To cut our HDPE, we're using this absolutely beautiful single flute. We can send it through this stuff at like 160 inches per minute. Freaking crazy. Actually, it's gonna take half a while 'cause I need to swap out the tools for every single one. I'm trying some new scalloping stuff. Should of just set it up on the Tormach but whatever. Oh, it looks like our elephant's done. I am excited. Let's see here. Oops. Look at that. We need to take the backing off, but heck yeah. All right, first clamp. Hope this goes well. We need to get a tool changer for this thing. Avid CNC, make one. I would love it. Everyone would love it. (machine whirring) Okay, I do need to slow it down a little bit. Got kind of wavy there on the side. But overall, part's good. Just need to make seven more of them and I'll see you tomorrow when that's done. Instead of yesterday taking the time to make all of them, I took the time to optimize the G-code for it so no more tool change. Look at that, David. - Oh, that's lookin' pretty good. - And it was all done with this flat end mill. One of these only takes one minute and 30 seconds now. It's wonderful. We'll have a bunch of them just in case something goes wrong. Anyway, let's go over here. I don't know why I was ever concerned that these might fail. Both of them turned out perfectly. Only problem is that it's blue. It's very blue. So while the rotor makes us a couple more of those parts, I'm gonna paint this black. Unfortunately, Nicholas who actually knows how to paint things is way too busy today, so I had to do it. Just don't look too closely at it, David, pretty please. A wonderful thing though, this shop jacket, we're finally releasing it. Holy frig. Come on over here. So as you've probably seen in a bunch of our videos, I have absolutely tortured this poor prototype and it's held up very well. We took a lot of inspiration from Savage apron. If you're doing things like grinding, welding, that sort of crap, this will keep you nice and safe. Go and grab it. You can put pens here. I was slightly concerned about the acrylic. It's just kind of a brittle material. So if we're getting halfway through the day and it explodes, we're just completely screwed. So I made this one right here out of wood as well. It is gonna block the light coming through the window, but at the same time, I know it's not going to explode. Now, we do have a little bit of a problem. It got a little bit burned and I'm having trouble cleaning it off. Instead of screwing around, getting all the charcoal off for a while, I think I'm just gonna give it a little bit of a burn and then it'll look consistent, hopefully. All right, I think it's about time to pack her up and take it all to my house and we can see if this actually works. What do you wanna do first David? Encase the computer or figure out the window? - [David] Figure out the window! - Figure out the window, yeah, I was thinking that too. All right, let's do it. I think the easiest way to go about this is to just remove this whole desk. It's gonna be a pain. Thank you. Nice. It could also just go kind of- - [David] Over? - Yeah, over. Now, I did do the math. It should take only about two and a half minutes to heat that room up by five degrees using my computer. IRL, there's so many more factors, like how warm your walls are. They're going to suck in a bunch of heat. How much heat's coming in or believing through your windows, like where the sun is, is going to make a huge difference, depending on if it's coming in through the window. So calculating is a bit difficult. We did run a test though. In 45 minutes, that room increased in temperature by three degrees, which is a lot when you think about it. The difference between 25 and 28 degrees is the difference between me personally being comfortable and not. Not to mention that typically we'll have a gaming session that lasts for longer than 45 minutes, and you can see why it ends up pretty unpleasant after a little while. - [David] It ended up getting gray. - Yes. - [David] Perfect. Hell yeah. - The best parts tray. In hindsight, this is a bit overkill. Eight quarter 20 bolts like these, especially high strength ones, probably good for most deep sea pressure vessels. Definitely gonna hold this together though. I don't know if this is gonna work. The kerf of the laser was a little bit too much and it means that some of our holes aren't quite large enough. Now, I did try drilling it out, but it's just gonna blow it right off. Like. Also try the deburring tool. It's not working. I think we need to swap over the wood. We're gonna wanna protect it a little bit. Just got some simple mineral oil here. It's not perfect for this situation, but it's way better than nothing. Okay, this is working. I do think I will swap to the acrylic later because this side plus a grow tent, neighbors might not be too happy. Pretty please. We did it. Where did my hammer go? - [David] You got fists, bro. - Oh, it's taking me outta 105 for just a little bit and it's suddenly William Osman vibes all over the place. But I have an iFixit kit and multiple sets of hex keys. Guess which size I don't have? All right, this is really solid. I'll put the CAD files down below, so if you guys wanna, you know, do something like this with your casement windows, you can. To move the air from our grow tent out the window, we are going to be using this Ruck six inch fan. Does that show it off at all, David? Okay, perfect. The good news is also, it has a low setting if you don't want to have it be quite that loud. Oops. Where do you think we want this fan, David? Maybe just down here on the floor. It seems like a not too bad spot. - [David] I concur. - Okay, cool. Fiberglass dust. - Don't breathe this. - (beep) One thing that's very unfortunate about this is that the tent is pretty fricking big. So this monitor, I feel like it's just gonna have to go. Funny story by the way. I got this as an upgrade for my main monitor. It is in every single way a better monitor, except the OSD is so bad that I don't use it. Okay, what's the best way to do this? Because if we go like that, all the cords can come up in over there, and this goes this way. Oh, I really wish they had a smaller one. Yeah, I guess it's gonna have to be how it goes. Yeah, there's all the cords. I was excited for like a little bit there when I was like oh this is probably actually gonna work. Now I'm not. What do you think? Out the side or out the top? - [David] Heat goes out he top, right? - Yeah, out the top. It's one of those rare times that duct tape is actually getting used for its intended purpose. I watched a bunch of Red Green last night. Can you tell? Should we dry run it, see how she goes? - [David] Heck yeah! - That was kind of underwhelming if I'm honest. Like, it is working really well. It's sucking lots of air. This isn't the best zipper in the world. Might have to crack this. Seems to work though. - [David] Heck yeah! - [Alexander] Way quieter than I expected. There's so much airflow coming in under this door. All right, let's put a PC in there. Plugging in peripherals is not the easiest. Have to remember to turn on the PC before we close her up. There we go. All of our air's going to be intaked right beside where our computer's bringing in air, and then hopefully all of it just gets yeeted out. Oh, this isn't great. It's a bit intrusive. It's- - [David] What do you mean? I can't even see it! - Maybe up on the desk? That's good. I'm sure the missus will really like that this is her office space now. In fairness, the missus does way more work here than I ever do at mine, so this'll probably get way more use now. I think we've done it. Let's turn it on. Barely can hear it, barely. Okay, I can hear it. The temperature of this room has started dropping. It's just pulling in air from the rest of the apartment that is a little bit cooler right now. Moment of truth. Oh, Prime95. FurMark. It's currently 26.6 degrees in here. So if it's what, 30.6 when we come back, we failed. In the last 45 minutes, we have dropped 0.4 degrees in this room. 0.3 right now actually. So it does look like our CPU got three degrees hotter than our original run. But that said, if we just simply played games for another 45 minutes with it before, the ambient air would be hotter, the CPU would be hotter, you know. The speeds are exactly the same. It got a tiny bit hotter in here. But this room is absolute night and day, and what's extra impressive by this time normally, even without a computer on, this room is getting pretty hot, and now it's so cold. This was a huge win, David. - [David] Yeah! - I love it. Plant grow tent. Stick your PC in one in the summer. Works great, just like this sponsor. Moonside. Moonside's Neon Lighthouse is a smart lamp that produces endless dynamic lighting effects through 90 individually addressable full color range RGB LEDs. Combining modern smart lighting technology and inspiration from lighthouse architecture, this light fixture shines in people's home. With the Moonside app and multiple color zone technologies, you can control the color and brightness of every single pixel on your light. Download the Moonside app for your iOS or Android device to integrate it with your favorite smart home services, including Google Home, Amazon Alexa, If This Then That, and more. Get 10% off your purchase with code LinusTechTips at the link below. So if you guys liked this video, maybe check out my Intel extreme upgrade. A bit more of an overhaul than we had today, but I'm still impressed with our results now.",
    "transcript_keywords": [
        "grow tent",
        "bit",
        "air",
        "Yeah",
        "David",
        "computer",
        "time",
        "tent",
        "grow",
        "room",
        "pretty",
        "window",
        "cool",
        "thing",
        "work",
        "make",
        "heat",
        "air conditioner",
        "confined space equals",
        "problem"
    ],
    "transcript_entity_values": [
        "LinusTechTips",
        "10 minutes",
        "three degrees",
        "one",
        "iFixit",
        "six inch",
        "Savage",
        "David] Yo",
        "Neon Lighthouse",
        "OSD",
        "like 160 inches",
        "first",
        "Intel",
        "Over 50,000",
        "HDPE",
        "Google Home",
        "another 45 minutes",
        "One",
        "two feet",
        "VIVOSUN",
        "Discord",
        "Second",
        "RGB",
        "28 degrees",
        "Zoho",
        "only $65",
        "about half an hour",
        "10%",
        "longer than 45 minutes",
        "chuck",
        "Eight quarter 20",
        "0.4 degrees",
        "Pantheon",
        "seven",
        "David",
        "today",
        "0.3",
        "the days",
        "annual",
        "the last 45 minutes",
        "Alexa",
        "Sarah",
        "45 minutes",
        "Amazon",
        "105",
        "10",
        "hose adapter",
        "Red Green",
        "William Osman",
        "14 hours",
        "26.6 degrees",
        "Moonside",
        "David] Heat",
        "36 inches",
        "30.6",
        "one minute and 30 seconds",
        "five degrees",
        "90",
        "CPU",
        "last night",
        "Tormach",
        "only about two",
        "65",
        "Avid CNC",
        "50%",
        "the day",
        "IRL",
        "CAD",
        "the summer",
        "Rocket League",
        "Nicholas",
        "two",
        "yesterday",
        "half",
        "tomorrow",
        "these days"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "TIME",
        "PERCENT",
        "TIME",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.04806794226169586,
        0.04534509778022766,
        0.02841974049806595,
        0.041386496275663376,
        0.11226585507392883,
        -0.08003167808055878,
        0.018330788239836693,
        -0.0051894038915634155,
        -0.02820533700287342,
        0.053538259118795395,
        -0.018128111958503723,
        -0.04154188558459282,
        -0.030410410836338997,
        -0.01777738891541958,
        0.05416921153664589,
        0.03807152062654495,
        0.035652659833431244,
        -0.06426813453435898,
        -0.07947976887226105,
        -0.006344765890389681,
        -0.038660235702991486,
        -0.09358841180801392,
        -0.031315576285123825,
        0.019487660378217697,
        0.05281883850693703,
        -0.03177288919687271,
        0.010712305083870888,
        0.031297944486141205,
        -0.005457805935293436,
        0.0414029136300087,
        -0.017217688262462616,
        0.11846290528774261,
        -0.030437849462032318,
        -0.025521166622638702,
        0.12251786142587662,
        0.015892399474978447,
        0.0032646406907588243,
        -0.07802148908376694,
        -0.18773247301578522,
        0.00505699822679162,
        -0.0034476839937269688,
        -0.00905422493815422,
        0.02312302589416504,
        -0.01600402593612671,
        0.046147819608449936,
        0.0244852714240551,
        -0.012485244311392307,
        -0.03506731986999512,
        0.04766860604286194,
        0.0028531758580356836,
        -0.0151156485080719,
        -0.06979074329137802,
        0.022759705781936646,
        -0.04128315672278404,
        -0.11216434091329575,
        0.05072204768657684,
        0.00995203759521246,
        -0.024725520983338356,
        0.01232084445655346,
        -0.051297176629304886,
        0.02848736383020878,
        -0.03975377231836319,
        -0.09041357785463333,
        0.036987584084272385,
        0.038717418909072876,
        -0.03358140215277672,
        -0.06511680036783218,
        0.12174195796251297,
        -0.027928432449698448,
        0.004983890801668167,
        0.022319890558719635,
        0.026985758915543556,
        0.05240647867321968,
        0.014431333169341087,
        0.04531603679060936,
        -0.05037491023540497,
        0.004018045030534267,
        -0.07521884143352509,
        0.10277573019266129,
        0.015227721072733402,
        0.008096331730484962,
        0.0012690088478848338,
        0.011660403572022915,
        -0.03335203975439072,
        -0.04446668177843094,
        0.010670870542526245,
        0.1395912915468216,
        0.0016951042925938964,
        -0.021054932847619057,
        -0.052740298211574554,
        0.007720636203885078,
        0.08957935124635696,
        -0.03941202163696289,
        0.07862206548452377,
        -0.05550568178296089,
        0.04241204634308815,
        0.020385295152664185,
        -0.07035238295793533,
        -0.03502712398767471,
        0.04527714103460312,
        0.023606568574905396,
        0.01666777953505516,
        0.09556896239519119,
        0.025215858593583107,
        -0.04939796403050423,
        -0.033034905791282654,
        0.036430638283491135,
        0.04716239124536514,
        0.016329646110534668,
        0.01720316708087921,
        -0.11909374594688416,
        0.00893737655133009,
        -0.06060297042131424,
        -0.019576000049710274,
        0.01610320433974266,
        -0.020181477069854736,
        0.014618010260164738,
        0.05259261280298233,
        0.061502911150455475,
        0.05925646796822548,
        0.026624241843819618,
        0.0743873342871666,
        0.009611503221094608,
        0.057685259729623795,
        0.038843508809804916,
        -0.03407464176416397,
        -0.010623275302350521,
        -9.662115406537952e-34,
        -0.022280793637037277,
        0.01711716689169407,
        -0.05082344263792038,
        0.04403816536068916,
        0.1301952749490738,
        -0.0802212804555893,
        0.018744638189673424,
        0.0060211592353880405,
        -0.07046882808208466,
        0.05442588031291962,
        -0.008155034855008125,
        -0.008098670281469822,
        -0.08543399721384048,
        0.054209571331739426,
        0.056719645857810974,
        -0.08100460469722748,
        -0.006866758689284325,
        0.04317198321223259,
        -0.08476309478282928,
        0.0005367834819480777,
        -0.09022686630487442,
        -0.09310007095336914,
        0.021581675857305527,
        -0.02235117368400097,
        0.09157004952430725,
        0.029953747987747192,
        0.040948692709207535,
        -0.03654913231730461,
        -0.013682476244866848,
        0.032547518610954285,
        0.02275501936674118,
        -0.029235882684588432,
        -0.05317918211221695,
        -0.08820211887359619,
        -0.06471844017505646,
        0.05852644145488739,
        -0.053462330251932144,
        -0.019762830808758736,
        0.04631926864385605,
        -0.005762128625065088,
        -0.07101482152938843,
        0.006445494946092367,
        0.006126691587269306,
        -0.0941796526312828,
        0.017842214554548264,
        0.06380877643823624,
        0.09126994013786316,
        -0.004117615055292845,
        -0.021653302013874054,
        -0.027674145996570587,
        -0.013222889974713326,
        0.03016187995672226,
        -0.08421963453292847,
        0.015921538695693016,
        -0.030756482854485512,
        -0.10234580934047699,
        0.05982835218310356,
        -0.050161074846982956,
        0.08015108853578568,
        -0.002606875728815794,
        -0.025091709569096565,
        0.03994600474834442,
        -0.01923331804573536,
        -0.06905733048915863,
        -0.05360475182533264,
        6.831654900452122e-05,
        0.06152863800525665,
        0.04031461477279663,
        -0.07190564274787903,
        -0.04600130766630173,
        -0.010116199031472206,
        -0.03465299308300018,
        0.06814059615135193,
        -0.012054521590471268,
        0.0017396531766280532,
        -0.0024533169344067574,
        -0.07026928663253784,
        -0.07239697873592377,
        -0.07704836875200272,
        0.009352898225188255,
        -0.03510453924536705,
        -0.004823352210223675,
        0.023780914023518562,
        -0.028849877417087555,
        -0.006418887060135603,
        -0.08225684612989426,
        0.022949352860450745,
        0.0788215696811676,
        -0.029275748878717422,
        0.04252483695745468,
        -0.0640968531370163,
        -0.027263116091489792,
        0.06391864269971848,
        -0.023696988821029663,
        -0.05932537466287613,
        -2.1645782564781997e-33,
        -0.00036734266905114055,
        -0.00922872219234705,
        -0.006781742442399263,
        0.014314096421003342,
        0.017015673220157623,
        0.03689585626125336,
        -0.0021906255278736353,
        -0.045625317841768265,
        0.016152555122971535,
        -0.012972962111234665,
        -0.023224005475640297,
        -0.006351272575557232,
        -0.0732497125864029,
        -0.031177259981632233,
        0.04446239396929741,
        -0.027428125962615013,
        -0.02925788052380085,
        0.024470748379826546,
        0.05507822334766388,
        0.005814781878143549,
        -0.004180070478469133,
        0.009138776920735836,
        -0.046042200177907944,
        0.060527872294187546,
        0.01639462634921074,
        -0.0024108700454235077,
        0.02238769456744194,
        0.04926556721329689,
        0.03190375864505768,
        0.017485536634922028,
        -0.06755171716213226,
        -0.026337847113609314,
        -0.06767447292804718,
        -0.001047678291797638,
        0.1119556576013565,
        -0.01152100507169962,
        0.026718927547335625,
        0.019223816692829132,
        -0.06711743026971817,
        -0.02689734846353531,
        0.03147435560822487,
        -0.03759729117155075,
        -0.020082447677850723,
        -0.011377634480595589,
        0.021954769268631935,
        -0.051692716777324677,
        -0.04244469478726387,
        -0.07736499607563019,
        -0.001614141627214849,
        0.020482836291193962,
        0.08244581520557404,
        -0.05652065947651863,
        0.02273065596818924,
        -0.021950066089630127,
        -0.036282770335674286,
        -0.022770415991544724,
        -0.01697351038455963,
        0.0764133408665657,
        -0.08313405513763428,
        -0.10959147661924362,
        0.05622052401304245,
        -0.05099588632583618,
        -0.08528291434049606,
        -0.03371439874172211,
        0.03068678453564644,
        0.01939002238214016,
        0.029936088249087334,
        0.02545671910047531,
        0.0030275098979473114,
        -0.00011510868353070691,
        0.0024417764507234097,
        0.03364304453134537,
        -0.0038650776259601116,
        -0.06041140481829643,
        -0.08574016392230988,
        0.0137770501896739,
        0.10823097825050354,
        -0.01971040852367878,
        0.06660225242376328,
        -0.05410757660865784,
        -0.03829467296600342,
        -0.006851767189800739,
        0.06858526915311813,
        0.009916565380990505,
        0.04956268519163132,
        -0.04265241697430611,
        -0.00166430848184973,
        -0.06407272070646286,
        -0.08020098507404327,
        0.02581472508609295,
        -0.01910264790058136,
        -0.003378715133294463,
        0.005067106336355209,
        0.08789841830730438,
        -0.0014614408137276769,
        -6.606378377682631e-08,
        -0.047450434416532516,
        -0.016161300241947174,
        0.013545838184654713,
        0.03905864804983139,
        -0.010073363780975342,
        -0.07492850720882416,
        0.0537138357758522,
        -0.02555561065673828,
        0.020472779870033264,
        0.017910856753587723,
        0.045600682497024536,
        -0.04630893096327782,
        0.09037090837955475,
        0.06372226029634476,
        0.01853260211646557,
        -0.004337760154157877,
        -0.07112887501716614,
        0.06739705055952072,
        -0.045319996774196625,
        -0.1156359538435936,
        -0.010807013139128685,
        0.0720098689198494,
        0.07724606245756149,
        0.003914901055395603,
        0.012858642265200615,
        0.00803259015083313,
        0.05781643092632294,
        0.0858071893453598,
        0.14076940715312958,
        -0.037806782871484756,
        -0.10091525316238403,
        -0.032441988587379456,
        0.026533348485827446,
        -0.02732355147600174,
        0.039510127156972885,
        -0.03325732797384262,
        -0.01957745850086212,
        0.04762612655758858,
        0.07270680367946625,
        -0.03147682175040245,
        -0.05027303472161293,
        -0.014795143157243729,
        0.027445510029792786,
        -0.025558017194271088,
        -0.009053416550159454,
        -0.07613297551870346,
        -0.038975782692432404,
        -0.07572036981582642,
        0.006689292844384909,
        0.05103876069188118,
        0.04450938478112221,
        -0.007440837565809488,
        -0.006043076515197754,
        0.05859548971056938,
        0.023624880239367485,
        -0.004992008209228516,
        -0.1110413447022438,
        0.07996533811092377,
        0.014453377574682236,
        0.04635347053408623,
        -0.0885283499956131,
        -0.061158861964941025,
        -0.12197582423686981,
        0.07240113615989685
    ]
}