{
    "id": "t3WNV-il1k4",
    "title": "iPhone 15 - Two weeks later!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-09-29T21:47:50Z",
    "video_url": "https://www.youtube.com/watch?v=t3WNV-il1k4",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 227484,
    "likes": 7770,
    "comments_count": 606,
    "description": "Thank you to Pulseway for sponsoring a portion of this video! Try Pulseway today for free here:    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://www.pulseway.com/land/ijustine",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(smacks lips) - Yummy, yummy, yummy in my tummy, tummy, tummy. (upbeat joyful music) Hello friends. It has been several weeks now with the brand new iPhone 15 Pro Max, and I'm obsessed. The thing that I noticed the most, is how fast it is. Granted, I did only upgrade from the iPhone 14, but immediately I noticed just swiping through, opening apps, everything just felt faster. And even in past iPhone upgrades, I don't really remember having that feeling. So I'm not sure what's going on here with the A17 Pro, but it does feel noticeably faster. The other thing that I was quite surprised about, is I don't really think they did any huge upgrades to the front facing camera, but it feels like they did. Now, I take a lot of photos sitting here at this desk, and for whatever reason, sometimes the photos don't really look that great, especially using the front facing camera. The iPhone really thrives in those everyday situations. So the lighting that I have here, is set more specifically for these cameras. But these pictures that I took of me and Maddie, like they just looked so crisp. The lighting was very even. Like everything about it, I was so surprised how great this turned out, which made me kind of excited to start using the front facing camera more. Like even this looks better. I don't know if it's some sort of new algorithm or something, it feels much better. I also like that you can easily switch between the raw 12 megapixel front facing, you can turn it on or turn it off. Right there. When I was working on my review, the thing that I was most excited about was the ProRes Raw shooting. Now in everyday scenarios, it's like I'm not gonna be shooting in ProRes Raw, but just going through and editing that footage, was so much fun because I really got to take advantage of coloring that all completely myself. But since then, I haven't really done anything that I've really needed to film in ProRes Raw, so I feel like on a day-to-day basis, it's not gonna be something that I'm using daily, but when I do really wanna get some awesome shots, the fact that this has so much power in this camera is so awesome. Here's an example of a night photo that I took while I was in New York. This was at 5:00 AM. And thankfully the streets were completely empty, so I was able to get the shot in the middle of the street. I love taking night photos, and I feel like this is the perfect combination between low lights, but just a little bit of street lights kind of lighting up the scene, and some light from behind to kind of light up the sky. So it really gives you this awesome, super crisp shot. Before we continue, a huge thank you to PulseWay for partnering with me on this video. Let's head to IT Justine, to tell us more about it. (phone alert beeps) (keyboard clicks) SuperCoolDude85 wants to know \"What's the best IT management app?\" Well, SuperCoolDude85, there are a lot of options out there, but I would definitely recommend Pulseway. Pulseway is built to help reduce downtime, and set new standards for efficiency through automation. They offer a full IT stack of software and services to help you look after all of your IT needs. Plus, they have a very handy mobile app that puts the entire IT infrastructure in the palm of your hand. So, you can manage from anywhere. You can get real time alerts, auto remediate IT problems, and take action instantly from any device, thanks to Pulseway native mobile apps. Pulseway helps keep your systems running smoothly, so you can focus on what matters the most. Don't let issues slow you down, and take control of every system. Experience the power of Pulseway at your fingertips, with a free trial and special offer using the link below in the description. Check it out. I hope that answers your question, SuperCoolDude85. So moving on, a lot of the big updates that I feel like people mostly notice is the fact that you do have a new iOS software update. And of course I did make a whole video on talking about some of all of the iOS 17 updates, but again, I freaking love the stickers. Like I can't get over it. I just keep like making other people's accidental live photos into stickers, and it's really funny. Now, name drop and airdrop by like, you know, touching the phones together, it has been working most of the time. I'm not sure if I've completely figured out how it actually works. Because there's been a few times where I've thought that I was airdropping somebody something, and then it didn't work, or at least I didn't think it worked. And then I went to airdrop it again, and it wasn't working, but then I went and airdropped it again, and then they proceeded to get three versions of everything that I just sent them. So I've accidentally airdropped three times. So I'm not really sure if that's just user error, or I'm not sure. Sometimes there's these little notifications that'll keep popping up over and over. That's like airdrop, accept, accept, and then it disappears. So this happened to me the other day, and it just kept happening, and I was like, \"What's going on?\" I've also really been enjoying all of the updated sounds. (whimsical chime phone alert) Like it's very slight, but it's like they added a few more little tiny chimes. And I really like it a lot. Now, another little sound that I like. (whimsical chime phone alert) That's not new. (whimsical chime phone alert) Where's it at? (phone alerts beeping) There's a sound that I'm trying to find, but I can't find it. Can you like my photo or something on Instagram? 'Cause on Instagram sound or send me an Instagram message. Isn't that new? (Instagram message alert) Send me more than another. (Instagram message alert) Is that just Instagram? Send me something on TikTok now. (TikTok notification alert) Okay. It must be the notifications. I've never heard it before until now, and I love it. (notification alert) That's one of my favorite new things is that little notification sound. I love it so much. Now, when I was doing my review originally I was super hyped about action mode and changing it and customizing it, and I just realized that most of the time I just picked the camera right from here. So I have changed my action mode button. Wait for it. Sit down. I don't know if you're ready for this. I changed it to silence my iPhone. That's great. That's great. Out of all the things that I could have done that's what I have it doing now. Silencing my iPhone. Maybe I'll change it later. Maybe I'll make some big elaborate shortcut that does something really cool, but for now it's silencing my phone and I'm gonna continue to use my camera from the home screen. The other thing that I have been loving so much is the 5X telephoto camera. It is so crisp and so clear. I know this is kind of ironic that I went to a Microsoft event right after the Apple event, so here's a few photos that I took while they were on stage presenting the new Surface Laptop Go and the new Surface Studio 2. And I was so impressed, like this looks like I was using some sort of telephoto camera on like a big, you know, mirror less camera. But no, just shot on iPhone. And actually, this photo that my sister took I'm gonna steal this from her. We were, I don't know where we were going. I'm not sure what we're doing. We were in the car passing the airport and she took this really cool photo of a plane. Like she just went like this, boop took it. And then I looked at the picture, I was like, \"Oh my gosh this is like some sort of, well, not National Geographic I don't know, something that would be award-winning.\" It was an award-winning photo. Good job, Jenna. The other thing that I've been loving is you guys may have seen the video that I posted diving with the new iPhone 15, taking this thing out diving was so much fun and especially being able to use this dive housing by Oceanic Plus, it was such a great experience. And just looking back at some of this footage, it looks so crisp and so clear and I'm so excited to go diving again. So I can't wait to do that. The other thing is when I ordered my phone, I was freaking out because I didn't know which case I wanted. So here's a few of the cases that I got. My favorite combination though I think is this black, fine woven case, and I kind of wish I would've got a fine woven black wallet. But I do have the purple one here, and I think this combination looks pretty good. Another thing that took me by surprise is the slickness of the fine woven cases. I pretty much wear yoga pants with pockets. I mean that's basically all I wear. Maybe, you know, once a quarter I'll put on a pair of jeans and I'm very unhappy about it. But I was going for a run the other day, and I had my phone and the fine woven case in my pocket, and I had my AirPods on, so I couldn't really hear anything. I had the, you know, the noise cancellation on, and all of a sudden my pocket felt empty and I look down and I feel for my phone, it's gone, completely just not even here. And I turn around and it's like, I don't know, like 20, 30 feet back on the trail. I was like, I did not even hear it fall. And because my pants are so slick, I didn't even feel it leaving my pocket. This actually happened back at camera camp. Yes, first camera camp. So iPhone 12, Sarah and I, she was chasing me or something. I don't remember what we were doing, but I didn't have a case on my phone and it was in my pocket and it slipped out. Very similar to that. So pretty much all in all I've been loving the new phone and it really does feel like much more of an upgrade than I thought. I was initially thinking like, \"Oh, I'm not gonna be able to tell a difference in the photos.\" No, I mean, I can tell a difference in the front facing camera and they didn't even change that. Like something is different. I don't know what they did, but it looks so much better. The titanium is also very pretty. I'm very, very happy that I ended up going with the natural. It is more of a white color than I thought it was gonna be because even when we were looking at this at the Apple event, like it seemed like it had more of a like brownish, kind of a yellowish hue. But I think it was just the lighting in the building because now here having it in the studio, having it out and about, it really kind of just looks like a silverish color and it matches the Apple Watch Ultra perfectly. The other thing is how light this is. It's so wild. Like it just feels so light, and it is a noticeable difference, especially coming from the 14 where the edges are really, they're sharp. Like they're, I just, I would be scared like that could be used as a weapon on the streets but now they're a little bit more rounded and does feel much comfier in your hand. And I've seen so many people who are going caseless and I just, I wanna do that so bad, but knowing how many times I've already dropped this phone and I've only had it for two weeks, I'm really not proud of myself. So those are some of my initial thoughts and how I'm feeling about the new iPhone 15 Pro Max. I'd love to hear from you guys. Did you guys get your phones? I've been enjoying seeing everyone's reactions and unboxings, like that's all I've watched now that mine are all done. It's been so fun seeing how excited everybody is and all of the unique ways that they have been using their phones and shooting such incredible videos. So I've loved seeing them. And if you've made any videos, please send them to me on Twitter, X, I will not I, whatever, you know what I mean. Send them to me there. And I look forward to checking those out. If you wanna watch any more videos that I have posted here from Apple season, check them out here on the end. Or you can find more on my YouTube channel, youtube.com/ijustine. See you in the next video. Peace.",
    "transcript_keywords": [
        "front facing camera",
        "camera",
        "Yummy",
        "tummy",
        "thing",
        "iPhone",
        "feel",
        "facing camera",
        "front facing",
        "phone",
        "PulseWay",
        "photos",
        "kind",
        "Pro Max",
        "photo",
        "ProRes Raw",
        "raw",
        "front",
        "facing",
        "Pro"
    ],
    "transcript_entity_values": [
        "Oceanic Plus",
        "ProRes Raw",
        "the Apple Watch",
        "New York",
        "Apple",
        "Justine",
        "20, 30 feet",
        "14",
        "5:00 AM",
        "Surface Laptop Go",
        "iPhone",
        "Instagram",
        "three",
        "Pro Max",
        "two weeks",
        "YouTube",
        "National Geographic",
        "the other day",
        "Sarah",
        "Maddie",
        "several weeks",
        "12 megapixel",
        "Twitter, X",
        "Pulseway",
        "Microsoft",
        "the A17 Pro",
        "Pulseway",
        "Jenna",
        "TikTok",
        "15"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.05450603365898132,
        -0.05688655003905296,
        -0.013113644905388355,
        -0.1217304989695549,
        0.026302305981516838,
        0.006707970518618822,
        0.015258973464369774,
        -0.0009392044157721102,
        0.002425750019028783,
        0.045806169509887695,
        0.06805390119552612,
        -0.023145396262407303,
        -0.025796933099627495,
        0.03311843425035477,
        -0.01362504344433546,
        0.0708174780011177,
        0.0196871068328619,
        -0.01757405698299408,
        -0.028941381722688675,
        0.008052591234445572,
        -0.036917585879564285,
        -0.057377781718969345,
        0.05345582589507103,
        0.023094788193702698,
        -0.006183537654578686,
        0.07830993831157684,
        -0.022265303879976273,
        0.022330155596137047,
        -0.10160593688488007,
        -0.08659190684556961,
        -0.0017495775828137994,
        -0.0011236437130719423,
        0.08871062844991684,
        0.005930745042860508,
        0.01904880814254284,
        -0.044944729655981064,
        0.03701632097363472,
        0.005629371851682663,
        -0.010090586729347706,
        -0.016536319628357887,
        0.013010162860155106,
        -0.03654789179563522,
        0.005903552286326885,
        -0.0006993829738348722,
        -0.05382131040096283,
        -0.06949712336063385,
        0.022533031180500984,
        -0.040671177208423615,
        0.039062682539224625,
        0.0486186258494854,
        -0.09821125119924545,
        -0.016407450661063194,
        0.003023710800334811,
        0.036433372646570206,
        -0.08323287218809128,
        0.03273849934339523,
        -0.07133956998586655,
        0.017562581226229668,
        0.08066324144601822,
        -0.06062442436814308,
        0.01956094428896904,
        -0.025375422090291977,
        -0.035427261143922806,
        0.032728128135204315,
        -0.07570384442806244,
        -0.05282558500766754,
        0.0054319617338478565,
        -0.010316041298210621,
        -0.005536763928830624,
        0.04730594903230667,
        -0.09144681692123413,
        0.03156275302171707,
        0.013881506398320198,
        -0.01292261853814125,
        -0.0267635490745306,
        0.04948171600699425,
        0.030620545148849487,
        -0.04300161451101303,
        -0.05354974418878555,
        0.03402954339981079,
        0.05220699682831764,
        -0.038024839013814926,
        -0.07770737260580063,
        -0.018022391945123672,
        0.02421310544013977,
        0.04385952651500702,
        0.00903109647333622,
        0.030496571213006973,
        -0.04159433767199516,
        -0.06831967085599899,
        -0.10722750425338745,
        0.021551450714468956,
        0.004801541101187468,
        -0.007014122325927019,
        -0.009238865226507187,
        -0.04350557550787926,
        -0.02271605283021927,
        -0.07820636034011841,
        -0.05369887501001358,
        0.0614435188472271,
        0.0505322702229023,
        -0.0957551896572113,
        -0.0013304599560797215,
        -0.04751524701714516,
        -0.0370996817946434,
        -0.11615841090679169,
        -0.05374787002801895,
        0.014638563618063927,
        0.015266590751707554,
        0.06315179914236069,
        -0.0008438513032160699,
        0.0596834197640419,
        -0.04978739097714424,
        -0.06066039204597473,
        0.04622733220458031,
        0.13305547833442688,
        -0.06240621209144592,
        0.08212832361459732,
        0.03628439083695412,
        0.005604424513876438,
        0.01213589683175087,
        -0.07207373529672623,
        -0.043299805372953415,
        0.00521914241835475,
        -0.012996191158890724,
        -0.021472910419106483,
        -0.05684154853224754,
        1.259604057296293e-32,
        -0.006624084431678057,
        0.058895595371723175,
        0.015100978314876556,
        0.04840709641575813,
        0.005143789574503899,
        -0.045612089335918427,
        0.01680813357234001,
        0.0977502092719078,
        -0.03215485438704491,
        0.019172092899680138,
        -0.007700189482420683,
        -0.00867436733096838,
        -0.05087875574827194,
        0.014825274236500263,
        -0.009435934945940971,
        -0.04667248949408531,
        -0.011298760771751404,
        -0.05459889397025108,
        -0.06237215921282768,
        -0.015117788687348366,
        -0.01830454170703888,
        -0.030729124322533607,
        -0.01644562929868698,
        0.08016523718833923,
        0.0667959526181221,
        0.0818057581782341,
        0.07210932672023773,
        -0.003692063270136714,
        0.08320943266153336,
        0.0036296271719038486,
        -0.06850308179855347,
        -0.019917700439691544,
        -0.021331436932086945,
        -0.08879540115594864,
        -0.011223806999623775,
        0.019399430602788925,
        -0.014150846749544144,
        -0.002642520470544696,
        -0.005425541196018457,
        -0.02849801443517208,
        -0.015924597159028053,
        0.0014338522450998425,
        -0.055659689009189606,
        -0.040493909269571304,
        0.09187398850917816,
        0.07303112000226974,
        0.006293467711657286,
        0.08707526326179504,
        -0.027271106839179993,
        0.017794957384467125,
        -0.011785538867115974,
        -0.008087917231023312,
        -0.056286804378032684,
        -0.019068947061896324,
        -0.05883342772722244,
        -0.021943099796772003,
        -0.03212559595704079,
        0.04601702094078064,
        0.03089386224746704,
        0.044556111097335815,
        0.048294950276613235,
        -0.007087854202836752,
        -0.029470082372426987,
        -0.02472815103828907,
        -0.09152910858392715,
        0.10187684744596481,
        0.03256595507264137,
        -0.04131871461868286,
        0.06226511299610138,
        0.09895964711904526,
        -0.0010067668044939637,
        0.02665405347943306,
        0.06673918664455414,
        0.020500868558883667,
        0.04904092103242874,
        0.04671317711472511,
        -0.07818629592657089,
        -0.04330013319849968,
        0.04497946426272392,
        0.007092054467648268,
        -0.11487432569265366,
        0.048654705286026,
        -0.014322242699563503,
        0.06452673673629761,
        0.01757786050438881,
        -0.08119802922010422,
        0.0008412076276727021,
        -0.03627900034189224,
        -0.03562824800610542,
        0.05149262398481369,
        -0.04844460263848305,
        0.055763937532901764,
        -0.08590319007635117,
        -0.01702159084379673,
        -0.045330218970775604,
        -1.3159512320661656e-32,
        0.04288286715745926,
        0.02914373390376568,
        -0.018199998885393143,
        -0.037365637719631195,
        0.05675327032804489,
        -0.025073863565921783,
        0.010415341705083847,
        0.12963995337486267,
        0.06512906402349472,
        -0.06075277179479599,
        0.06507537513971329,
        -0.05695220082998276,
        -0.09567558020353317,
        0.01684010773897171,
        -0.049830395728349686,
        -0.041960131376981735,
        -0.050054144114255905,
        -0.08963789790868759,
        0.03364744409918785,
        0.005582672543823719,
        0.06953561305999756,
        0.09276047348976135,
        0.0603656992316246,
        0.043812841176986694,
        -0.004169118124991655,
        0.01715916208922863,
        0.047716621309518814,
        0.0592585988342762,
        0.07872283458709717,
        0.014927435666322708,
        0.0011689065722748637,
        -0.07658122479915619,
        -0.06305927783250809,
        -0.02759709767997265,
        0.04313161224126816,
        0.06643345952033997,
        0.015556740574538708,
        0.031483493745326996,
        -0.005003736354410648,
        -0.09075212478637695,
        0.04365748167037964,
        0.01472997386008501,
        0.02025653049349785,
        0.021009866148233414,
        -0.012880983762443066,
        -0.07173242419958115,
        -0.04342130199074745,
        0.04582774639129639,
        -0.014315524138510227,
        -0.0073087019845843315,
        -0.04421250894665718,
        -0.026158126071095467,
        -0.042882442474365234,
        -0.0038846165407449007,
        -0.03547129034996033,
        0.017729902639985085,
        -0.048026345670223236,
        -0.03038804605603218,
        0.0727343037724495,
        0.003750715171918273,
        0.03799932450056076,
        -0.024083929136395454,
        -0.07166632264852524,
        -0.09548156708478928,
        0.0022747316397726536,
        -0.07095436751842499,
        0.0713215246796608,
        -0.016989754512906075,
        -0.003984269220381975,
        0.074545718729496,
        -0.012102250009775162,
        0.01862264797091484,
        0.0333285816013813,
        0.010338027030229568,
        0.027399512007832527,
        0.007141760550439358,
        -0.07719963788986206,
        0.011853397823870182,
        0.06822467595338821,
        -0.037805672734975815,
        0.014763545244932175,
        0.03046996146440506,
        0.02570723183453083,
        0.05896269530057907,
        0.11413013190031052,
        0.12537655234336853,
        0.11386574804782867,
        0.0002631531679071486,
        0.015237962827086449,
        0.1082027405500412,
        0.029629813507199287,
        0.07453390955924988,
        0.05237419903278351,
        0.11266839504241943,
        -0.0885826051235199,
        -6.116885487017498e-08,
        0.048158325254917145,
        0.03897213935852051,
        -0.03758756443858147,
        -0.016753673553466797,
        -0.008225880563259125,
        -0.08464862406253815,
        -0.017415033653378487,
        0.020253924652934074,
        0.11507630348205566,
        -0.07294244319200516,
        0.06149487569928169,
        -0.027316072955727577,
        -0.01210895273834467,
        0.1483495682477951,
        -0.0023860028013587,
        -0.018689066171646118,
        -0.07938925921916962,
        0.08189498633146286,
        -0.01627175137400627,
        -0.10000288486480713,
        -0.06539452821016312,
        0.060769662261009216,
        0.03551372140645981,
        -0.023806864395737648,
        0.040801554918289185,
        0.004382963292300701,
        -0.021400418132543564,
        -0.009899354539811611,
        0.015525242313742638,
        0.0025089422706514597,
        -0.06138557940721512,
        0.01564737968146801,
        0.010424355044960976,
        -0.032008036971092224,
        -0.08489315956830978,
        -0.04380473867058754,
        -0.08172549307346344,
        -0.03550975024700165,
        0.033436890691518784,
        -0.03920760750770569,
        -0.005223745014518499,
        -0.10144351422786713,
        -0.015059980563819408,
        -0.0063108461908996105,
        0.001592573942616582,
        -0.0911630317568779,
        0.05540848895907402,
        -0.08575756847858429,
        -0.015388308092951775,
        -0.019670387730002403,
        -0.09420657902956009,
        -0.003461717162281275,
        0.023592544719576836,
        -0.05735759064555168,
        0.09167089313268661,
        -0.011845828033983707,
        0.0361604169011116,
        0.03468237817287445,
        -0.036008257418870926,
        -0.024406371638178825,
        0.05955761671066284,
        -0.02646745927631855,
        -0.05518681928515434,
        0.03544597700238228
    ]
}