{
    "id": "TAd-mvg0HmY",
    "title": "Cell Tower In A Suitcase: How Sonim's \"Rapid Deployment Kit\" Saves Lives",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-10-03T16:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=TAd-mvg0HmY",
    "category": "Science & Technology",
    "tags": [
        "rapid deployment kit 3 review",
        "rdk3 review",
        "sonim rapid deployment kit",
        "rapid deployable kit",
        "sonim xp8 review",
        "at&t firstnet",
        "firstnet review",
        "satellite phone"
    ],
    "views": 111517,
    "likes": 7789,
    "comments_count": 379,
    "description": "Sponsored by Surfshark. Get Surfshark VPN at  and enter promo code MRMOBILE for 83% off and 3 FREE months!   [CELL SITE IN A SUITCASE: SONIM RDK WITH FIRSTNET HANDS-ON]  Cell towers. Over the last thirty years theyve become so commonplace that you probably dont even notice them anymore  but without them, your smartphone would be nothing but a WiFi tablet. In past videos Ive shown you how cell sites can be hidden in plain sight in places like church steeples, or built to withstand the worst weather in North America at the top of a mountain. Today, Im gonna show you how a cell tower can be packed into a suitcase  and how doing so can help save lives.  Join me for another MrMobile \"hands-on\" (that's really more of a trunkload) as I take the Sonim Rapid Deployment Kit-3 out to the end of Long Island in search of cellular coverage thin enough to justify using a satellite 22,500 miles away. The RDK3 is a cell site in a suitcase, and today's video is all about how it joins forces with a BGAN from Cobham and service from AT&T FirstNet to keep first responders connected in the worst of times.   [SUBSCRIBE TO MRMOBILE]     [ABOUT CELL TOWER IN A SUITCASE]  MrMobile's Cell Tower In A Suitcase / Rapid Deployment Kit Hands-On was produced following several days with a Sonim RDK-3, Cobham Explorer 710 BGAN and Inmarsat service provided by AT&T FirstNet / Sonim / Inmarsat Government. Production devices running production software.   MrMobile does not produce paid or sponsored reviews; no compensation was provided and no manufacturer or carrier was afforded a preview or copy approval rights concerning this content. The lone sponsor of this video is SurfShark.  Special thanks to David Cogen and David Imel.   [LINKS]  AT&T FirstNet:   Sonim Rapid Deployment Kit RDK-3:   Sonim XP8:   FirstNet Authority:   Inmarsat: About Our Satellites:   Cobham Explorer 710 Info [PDF]:   Cobham Explorer 710 [Satellite Phone Store]:   All 50 states vote yes on AT&Ts $40 billion emergency response network FirstNet:   FirstNet Launches Ruthless Preemption for First Responders:   Boston Marathon Explosions [ABC News]:   Boston Marathon Bombing Aftermath: Cellphone Use Heavy and Operating    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #firstnet #att #disaster #rdk #rdk3 #sonim #inmarsat #cobham #rapiddeploymentkit",
    "description_links": [
        "https://surfshark.deals/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.firstnet.com/",
        "https://www.sonimtech.com/products/rdk/",
        "https://www.sonimtech.com/products/devices/xp8/",
        "https://www.firstnet.gov/about/history",
        "https://www.inmarsat.com/about-us/our-technology/our-satellites/",
        "https://www.cobhamsatcom.com/land-mobile-satcom-systems/ultra-portable-bgan/explorer-710/explorer-710-data-sheet/docview/",
        "https://satellitephonestore.com/catalog/sale/details/cobham-explorer-710-bgan-terminal-346",
        "https://techcrunch.com/2017/12/29/all-50-states-vote-yes-on-atts-40-billion-emergency-response-network-firstnet/",
        "https://about.att.com/story/preemption_for_first_responders.html",
        "https://www.youtube.com/watch?v=dupw2pH3oes",
        "https://youtu.be/0IcMBTPSeeM",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- A portion of this video is sponsored by Surfshark. Cell towers, over the past 30 years, they've become so commonplace, you probably don't even see them anymore, but without them, your smartphone is basically just a glorified wifi tablet. In past videos, I've shown you how cell sites can be hidden in plain sight, in places like church steeples, or built to withstand the worst weather in North America, at the top of a mountain. Today, I'm gonna show you how a cell tower can be packed into a suitcase, and how doing so can help save lives. (mellow electronic music) Okay, to understand why the Sonim Rapid Deployment Kit exists, you first need to understand why FirstNet was formed. And the clearest way to do that is to revisit one of the darkest days in the history of the city of Boston. In the immediate aftermath of the Boston Marathon bombing of 2013, it was nearly impossible to make a phone call, in downtown Boston. Speculation ran rampant that the police, or the wireless carriers, had turned off the networks, to foil any additional phone triggered bombs themselves, but that's not what happened. The cellular networks were just overloaded by the sheer number of people trying to connect all at once. The resulting loss of communications made life harder, not just for ordinary folks, but for emergency workers as well. This problem, and problems like it, facing emergency communications, were recognized well before the marathon bombing of course. In fact, the FirstNet Authority had been established the year before, but it took until 2017 for that agency to finalize a partnership with AT&T to build a nationwide network, in the 700 megahertz band, dedicated to first responders. In exchange for the $40 billion, 25 year job of deploying and maintaining the network, AT&T gets to offer that same 700 megahertz spectrum to its regular customers. But here's the key, when an emergency arises, and first responders need to communicate during a capacity crunch, those regular customers can be removed from the network, to make room for those emergency communications. FirstNet calls this ruthless preemption, which is coincidentally the name of the band I'm gonna form when I finally get tired of this YouTube thing. Now, all that's well and good for situations where the networks are overloaded. But what happens when it's not just a capacity problem? The September 11th terrorist attacks, Gulf Coast hurricanes, wildfires in the Western U.S., tornadoes, sometimes this cellular network is disabled, destroyed, or just plain absent. That's where the Rapid Deployment Kit comes in. And to see how it works, I wanted to travel to an area with no cellular reception. So I picked up an RDK-3 loaner unit from my FirstNet friends in New York City, picked up a couple of YouTuber friends in the process, and then drove 112 miles to the very end of Long Island, to see if I could make a connection, without a cellular network. The results, after a quick word from my sponsor. I'm not traveling as much as I have in years past, but I'm still using today's sponsor, just as often. While Surfshark VPN is great for safely browsing on a public hotspot, it's also a powerful tool for preserving your privacy at home. Look, I make my living, thanks to the advertising that goes alongside my content. But some ads come with an uninvited guest, malicious software. Surfshark helps fight that malware, and it also hides your IP address, which makes it tougher for bad actors to target you. If you think your internet service provider might be throttling your speeds, based on usage, Surfshark can help level the playing field. And it works on your computer, tablet, and your phone. Try Surfshark now, at the link below, and use promo code, MRMOBILE. You'll get 83% off a year subscription, and three extra months free. Thanks to Surfshark for sponsoring this video. Montauk Point, home to one of the nation's oldest lighthouses, a thoroughly creepy abandoned Air Force station, and very limited cellular coverage. If you're thinking this place seems eerily familiar, it's not just the \"Stranger Things\" vibes. It's also the setting I used to test the Samsung Galaxy Note 20s camera, with my two David friends, a few weeks back. Thanks for watching. With the Davids assistance, I freed the Rapid Deployment Kit from its Zipcar confines, and immediately realized I needed to work on my first responder muscle mass. I now fully understand the weight of my responsibility. Yeah, the RDK is a heavy piece of kit, at 27 pounds, which really should be no surprise, given everything packed inside its dust and water resistant casing. A 205 watt hour power reserve, that's about two good sized laptop batteries, powers the whole thing for a worst case endurance of four hours of very heavy use. And you can parcel that power out to other devices, and these built-in charging cradles. They're custom designed for the four Sonim XP8 smartphones that live in their own dedicated locker, within the RDK. Now, these aren't gonna win any awards for software updates. I think these devices were still running Android 8.1, albeit with a May 2020 security patch. But they're made for durability, not cutting edge features. And what's more, you don't have to use them to use FirstNet. Tons of devices are compatible. You just need a special SIM to make most of them work. And the RDK is even more universal. You can connect any device with a wifi radio to it, up to a maximum of 56. Now, of course, that wifi link is useless, without a connection to the internet. But remember, we're assuming the cellular network is as dead as this decrepit radar dish. So I'm connecting the RDK to this other piece of gear, called a BGAN terminal, in this case, the Cobham Explorer 710. Think of this as a more compact version of the satellite dishes you see on some rooftops. There's a SIM card in this. - Cool. - Only nerds will understand. In a place like Montauk, you deploy it at about a 45 degree angle, and point it toward the southeastern sky, until that intermittent beeping you hear becomes a solid tone. It's kind of like \"Top Gun.\" Hold on. That tone means the Explorer has a connection to one of Inmarsat's geostationary satellites, about 22,000 miles above the Earth's surface. And once that connection is live, the Explorer itself will kick out a wifi network that you can connect to directly. Or, you can use an ethernet cable to connect it to the RDK, so you can share that signal across a wider area. Now, how wide an area? See how far we can take it. Just a com check there, Alpha Two. I'm taking a little walk away from the RDK. So I wanted to make sure I still had a connection to ya. - [Alpha Two] You're loud and clear. We're actually almost back to the parking lot. - Well, that's good news, 'cause I guess someone should be watching our (beep). Okay, that was 173 paces, which a quick Google informs me a pace is 2.5 feet about, so about 430 feet, call it 400 feet to loss of signal. Not too bad, considering it's happening over wifi. As for speeds, well, remember, this is for emergency situations, and dire circumstances, not for playing \"Star Wars Squadrons,\" while camping. I was told to expect speeds a little shy of 500 Kbps. And while that makes loading heavy websites pretty pokey, it's plenty for the kind of voice communication that's most critical in emergency situations. If you're thinking a 430 foot bubble, with half a megabit data speeds, doesn't seem very far or very fast, especially for the $20,000 or so of equipment we've got here, well, I said the same thing. And the FirstNet folks reminded me that the RDK is just one piece of a larger puzzle. If you need a mobile command center, in the wake of a tornado, or wildfire, this could be a good solution. But if you need to cast a wider net, a better fit would be what's called a cell on wheels, COW, or a cell on light truck, COLT, literally trucks with extendable cell towers, a fleet of which AT&T makes available to public safety. AT&T is even building drone cell sites, to provide coverage to even less accessible areas. Technically they're called cells on wings, but I prefer their nickname, flying COWS. I've barely scratched the surface of FirstNet broadly, and the RDK specifically, but in a year as full of challenges as 2020 has been, I'm glad I got to spend a small slice of Techtober talking about technology, that's designed to keep people connected, in the worst of times. This video was made possible by equipment loans from FirstNet, Sonim Technologies, and Cobham, with in-depth briefings from Sonim, Inmarsat, and AT&T. No compensation was provided for this content though, and no company was given copy approval, or an early look at this video. Please subscribe to theMrMobile, if you'd like to see more videos like this on YouTube, and leave a comment below, if you'd like me to check out a flying COW, if I get the opportunity. Until next time, thanks for watching, and please stay safe, and mask up, while you stay mobile, my friends.",
    "transcript_keywords": [
        "Rapid Deployment Kit",
        "RDK",
        "Rapid Deployment",
        "Deployment Kit",
        "cellular network",
        "network",
        "Sonim Rapid Deployment",
        "Surfshark",
        "FirstNet",
        "Cell",
        "make",
        "emergency",
        "cellular",
        "North America",
        "Cell towers",
        "Sonim",
        "Boston Marathon bombing",
        "Boston",
        "Kit",
        "emergency communications"
    ],
    "transcript_entity_values": [
        "20,000",
        "2013",
        "Gulf Coast",
        "four hours",
        "Boston",
        "RDK",
        "North America",
        "$40 billion",
        "two",
        "about 22,000 miles",
        "Surfshark",
        "Two",
        "the FirstNet Authority",
        "one",
        "27 pounds",
        "the Samsung Galaxy Note",
        "Long Island",
        "2017",
        "half",
        "May 2020",
        "COLT",
        "700 megahertz",
        "about two",
        "Google",
        "Cobham Explorer 710",
        "Tons",
        "8.1",
        "45 degree",
        "years past",
        "three extra months",
        "2.5 feet",
        "Zipcar",
        "the darkest days",
        "Air Force",
        "Explorer",
        "430 foot",
        "the year before",
        "400 feet",
        "AT&T",
        "Techtober",
        "YouTube",
        "four",
        "the past 30 years",
        "the Rapid Deployment Kit",
        "173",
        "500 Kbps",
        "YouTuber",
        "205 watt hour",
        "Inmarsat",
        "83%",
        "Alpha Two",
        "Sonim Technologies",
        "56",
        "Cobham",
        "Top Gun",
        "Star Wars Squadrons",
        "September 11th",
        "about 430 feet",
        "112 miles",
        "YouTube",
        "Today",
        "2020",
        "the Boston Marathon",
        "the Sonim Rapid Deployment Kit",
        "a few weeks",
        "Sonim",
        "SIM",
        "New York City",
        "25 year",
        "a year",
        "today",
        "first",
        "Montauk Point",
        "Earth",
        "MRMOBILE",
        "power reserve",
        "Montauk",
        "David",
        "COW",
        "Davids",
        "FirstNet"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "LOC",
        "TIME",
        "GPE",
        "ORG",
        "LOC",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "GPE",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "TIME",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "EVENT",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "DATE",
        "DATE",
        "EVENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.08033070713281631,
        0.04096236824989319,
        -0.008500896394252777,
        -0.0788407102227211,
        0.042666248977184296,
        -0.035243891179561615,
        -0.03557593747973442,
        0.03950536623597145,
        0.01268894225358963,
        0.052708256989717484,
        0.07071047276258469,
        0.05010072886943817,
        0.06473515182733536,
        0.020854223519563675,
        0.06719129532575607,
        -0.006074228789657354,
        0.04878965765237808,
        -0.019444258883595467,
        -0.11292598396539688,
        -0.006042590830475092,
        0.07008031010627747,
        -0.05005519464612007,
        0.020501643419265747,
        -0.04980362206697464,
        0.08511695265769958,
        -0.036353643983602524,
        -0.016084905713796616,
        0.06024892255663872,
        -0.003447062335908413,
        -0.02482219599187374,
        -0.015208163298666477,
        0.08389290422201157,
        -0.0462002158164978,
        0.05667940527200699,
        -0.006391626317054033,
        0.0010835558641701937,
        -0.01751682348549366,
        0.0061638811603188515,
        -0.05569141358137131,
        -0.014125769026577473,
        -0.01997634768486023,
        -0.02732057124376297,
        0.0416308157145977,
        0.0739755854010582,
        0.033862803131341934,
        -0.010408037342131138,
        0.0024898932315409184,
        0.028860919177532196,
        0.05713265389204025,
        -0.08763150870800018,
        0.007856950163841248,
        -0.031237060204148293,
        0.027475550770759583,
        0.03792446851730347,
        -0.12959258258342743,
        -0.0035914417821913958,
        -0.030983539298176765,
        0.02919873781502247,
        0.08476274460554123,
        0.0070709241554141045,
        0.13993431627750397,
        -0.007460158783942461,
        -0.034770216792821884,
        -0.0157424658536911,
        0.05893140286207199,
        -0.03813111037015915,
        -0.007723342627286911,
        -0.017471641302108765,
        0.04335758462548256,
        0.008572611957788467,
        0.0187839288264513,
        0.03595488518476486,
        -0.03990284726023674,
        0.05129552632570267,
        0.011412981897592545,
        0.017035361379384995,
        0.04505781829357147,
        0.003733291756361723,
        -0.0016555713955312967,
        0.02085805870592594,
        0.052038926631212234,
        0.052176546305418015,
        0.04458707571029663,
        0.045228902250528336,
        -0.04308205097913742,
        -0.028242439031600952,
        -0.04218068718910217,
        0.07254266738891602,
        -0.06978534907102585,
        -0.08185799419879913,
        -0.035394687205553055,
        0.028162354603409767,
        -0.04218479245901108,
        0.09308777749538422,
        -0.07888797670602798,
        -0.007264371495693922,
        -0.05060247331857681,
        -0.03236076235771179,
        -0.08980540186166763,
        -0.0017652397509664297,
        0.08220218122005463,
        0.03549950569868088,
        0.06024598702788353,
        0.048200760036706924,
        -8.666428766446188e-05,
        -0.04510725289583206,
        -0.011331354267895222,
        0.0358087383210659,
        0.05005072429776192,
        0.04845092445611954,
        -0.10818449407815933,
        0.02556070312857628,
        -0.024847302585840225,
        -0.0009063332108780742,
        -0.1512865126132965,
        0.04381886497139931,
        -0.01735442504286766,
        0.0673108622431755,
        0.09824293851852417,
        0.04188764467835426,
        0.01509738340973854,
        -0.026491614058613777,
        0.03594842925667763,
        -0.038009144365787506,
        0.07697013765573502,
        -0.023252137005329132,
        0.014706318266689777,
        7.056418384905296e-33,
        -0.027529187500476837,
        0.11189616471529007,
        -0.06562400609254837,
        0.09417708963155746,
        0.016776729375123978,
        -0.03112327866256237,
        -0.04588938504457474,
        -0.04954114928841591,
        0.06244267523288727,
        0.08131056278944016,
        -0.0903838500380516,
        0.03591588884592056,
        -0.054259270429611206,
        0.040693920105695724,
        0.052869606763124466,
        -0.1268942952156067,
        -0.03466171771287918,
        -0.10003573447465897,
        0.008226240053772926,
        0.012288416735827923,
        -0.04408774897456169,
        -0.111566461622715,
        0.03883536159992218,
        -0.105142742395401,
        0.10559253394603729,
        0.009687271900475025,
        0.03881816938519478,
        -0.009364227764308453,
        0.0659259557723999,
        0.03985711187124252,
        -0.05655866861343384,
        0.0014114846708253026,
        -0.0077269356697797775,
        -0.02879539132118225,
        0.00015576044097542763,
        -0.003636893816292286,
        -0.03809881582856178,
        -0.09181390702724457,
        0.00572672113776207,
        0.0008298265747725964,
        -0.08737153559923172,
        -0.015338349156081676,
        -0.08034498989582062,
        -0.009784160181879997,
        0.022485459223389626,
        -0.04860607162117958,
        0.010914268903434277,
        0.003963149152696133,
        -0.023612141609191895,
        -0.03387739136815071,
        0.026141054928302765,
        0.04011506959795952,
        -0.07953492552042007,
        -0.0963694304227829,
        -0.030346335843205452,
        0.029565727338194847,
        0.02918069250881672,
        -0.005887643434107304,
        0.06624940782785416,
        0.07607264816761017,
        -0.00662751030176878,
        -0.05197393521666527,
        -0.008183053694665432,
        0.11404275894165039,
        -0.0357317179441452,
        -0.04171552136540413,
        -0.05032755061984062,
        0.03228071704506874,
        0.01821894757449627,
        0.05183574557304382,
        0.0478568859398365,
        -0.0046299234963953495,
        0.10847526043653488,
        -0.0634433776140213,
        -0.00455693481490016,
        -0.001076877466402948,
        -0.04444708302617073,
        0.0651240348815918,
        -0.04178471863269806,
        -0.029062658548355103,
        -0.030922716483473778,
        -0.030507490038871765,
        0.011234213598072529,
        0.01371045783162117,
        -0.01145144458860159,
        -0.04134995862841606,
        0.021689889952540398,
        -0.13709436357021332,
        -0.0491773895919323,
        0.04691484943032265,
        -0.03488202020525932,
        -0.009583068080246449,
        0.0031962990760803223,
        -0.045367345213890076,
        0.04720531031489372,
        -6.768981363454446e-33,
        -0.001987529220059514,
        0.024779895320534706,
        0.0006058713188394904,
        -0.09567330777645111,
        -0.003394173923879862,
        -0.0071226912550628185,
        0.0819755345582962,
        0.01602809876203537,
        -0.04559233784675598,
        0.023174289613962173,
        -0.06286148726940155,
        0.009884516708552837,
        -0.03331528976559639,
        -0.027440302073955536,
        0.004085954278707504,
        0.013033874332904816,
        0.0612931028008461,
        -0.06893288344144821,
        -0.06519830226898193,
        0.030044695362448692,
        0.02355967089533806,
        0.0018547208746895194,
        -0.06273000687360764,
        0.08571147918701172,
        0.021138830110430717,
        -0.015002671629190445,
        -0.047183532267808914,
        0.04719126597046852,
        0.017801843583583832,
        0.004484672099351883,
        -0.02710796892642975,
        -0.06807171553373337,
        0.007745660375803709,
        0.0748455673456192,
        -0.001669256598688662,
        0.06865555047988892,
        0.020549079403281212,
        0.02304951846599579,
        0.022944772616028786,
        -0.11788807809352875,
        0.07105313241481781,
        -0.014511908404529095,
        -0.06522271037101746,
        -0.08104952424764633,
        -0.0035924483090639114,
        0.008131996728479862,
        0.004717846866697073,
        0.04929479584097862,
        -0.08248310536146164,
        -0.03322269767522812,
        0.033467959612607956,
        0.01743273250758648,
        -0.05667100474238396,
        0.023742949590086937,
        0.035228222608566284,
        0.054389093071222305,
        0.01806868426501751,
        -0.08306901156902313,
        -0.00540331844240427,
        -0.0596725158393383,
        0.042605262249708176,
        -0.03213877975940704,
        -0.05666916072368622,
        0.045211147516965866,
        -0.040698856115341187,
        -0.0010426478693261743,
        0.03860753774642944,
        0.02955162711441517,
        -8.54803147376515e-05,
        0.1067805290222168,
        -0.05681424215435982,
        0.002104757120832801,
        0.043970100581645966,
        -0.07878607511520386,
        0.012319101952016354,
        0.024793338030576706,
        -0.016164308413863182,
        0.04743249714374542,
        -0.028965767472982407,
        -0.12434295564889908,
        -0.020768992602825165,
        -0.024262115359306335,
        -0.04577065631747246,
        -0.05952181667089462,
        0.10621184855699539,
        -0.025031771510839462,
        0.036766067147254944,
        0.022507375106215477,
        -0.04354621097445488,
        0.04778625816106796,
        0.0063127013854682446,
        0.008184053003787994,
        -0.09746061265468597,
        0.0730670690536499,
        0.01637355051934719,
        -5.360671195830946e-08,
        0.0481918640434742,
        0.07337721437215805,
        -0.012319819070398808,
        -0.08042100816965103,
        -0.059846628457307816,
        -0.06956899166107178,
        0.0757049173116684,
        0.058389902114868164,
        0.06535923480987549,
        -0.012077128514647484,
        -0.015535755082964897,
        0.010573619976639748,
        -0.08786876499652863,
        0.08019716292619705,
        -0.01564851962029934,
        0.08356248587369919,
        -0.03129405155777931,
        0.001671900157816708,
        -0.022364690899848938,
        0.026346692815423012,
        -0.025186913087964058,
        0.04542388394474983,
        0.02887866087257862,
        0.057439595460891724,
        0.059010252356529236,
        0.12213827669620514,
        -0.08040980249643326,
        0.026724986732006073,
        0.09900595992803574,
        0.023365795612335205,
        -0.034648556262254715,
        -0.02241271547973156,
        -0.02583514340221882,
        -0.00723999971523881,
        -0.0005638148286379874,
        0.03974490612745285,
        0.05518968775868416,
        -0.00879269652068615,
        0.03096848726272583,
        0.03257448226213455,
        0.01943647675216198,
        -0.09363868832588196,
        -0.014622250571846962,
        0.03813887760043144,
        0.0067941551096737385,
        -0.050456106662750244,
        -0.07427378743886948,
        -0.01363079808652401,
        -0.0203618835657835,
        0.013749567791819572,
        -0.023391427472233772,
        -0.05887797102332115,
        -0.050094977021217346,
        -0.04336939752101898,
        0.06045502796769142,
        0.024118617177009583,
        -0.02171209268271923,
        -0.04679713770747185,
        0.011166607961058617,
        0.08250990509986877,
        -0.02595456689596176,
        0.0006583455251529813,
        -0.057547543197870255,
        0.005744281690567732
    ]
}