{
    "id": "TagRfu4kXMY",
    "title": "ROG Phone 5 Ultimate Review: Changing The Game",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-03-10T11:15:05Z",
    "video_url": "https://www.youtube.com/watch?v=TagRfu4kXMY",
    "category": "Science & Technology",
    "tags": [
        "rog phone 5 review",
        "rog phone 5 pro review",
        "rog 5 review",
        "rog phone 2021",
        "gaming phone 2021",
        "best gaming phone",
        "best gaming smartphone",
        "mrmobile",
        "michael fisher",
        "asus",
        "legion phone",
        "razer phone"
    ],
    "views": 304549,
    "likes": 14096,
    "comments_count": 985,
    "description": "Sponsored by SellCell.com. Get the best price for your old tech here:    [ROG PHONE 5 ULTIMATE REVIEW]  Just like it says on the exquisitely crafted box, the ROG Phone 5 Ultimate from ASUS is indeed the ultimate gaming smartphone of 2021. And not just by default, after the exit of Razer from the gaming phone space and the paucity of gaming-centric competitors in the North American market. No, the ROG Phone 5 Ultimate is the king of gaming phones because of a potent combination of perks, polish  and panache. Its a gaming phone that even filthy casuals like MrMobile can love and love it, I do.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILES ASUS ROG PHONE 5 ULTIMATE REVIEW]  MrMobile's ROG Phone 5 Ultimate Review / ROG Phone 5 Review was produced following ten days with an ROG Phone 5 and ROG Phone 5 Ultimate review sample, both provided by ASUS. Preproduction samples running pre-release software, tested on AT&T in Brooklyn NY and Princeton, NJ.  MrMobile does not accept compensation from the manufacturers of the products he reviews; no payment was provided and no manufacturer or carrier was afforded a preview or copy approval rights concerning this content. The lone sponsor of the ROG Phone 5 Review is SellCell.com.   [LINKS]  ROG Phone 5 Review [Booredatwork]:   (Additional reviews pending)   [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford Future plc a commission should you make a purchase. This does not affect MrMobiles editorial content. See Future's disclosure policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #rogphone5 #rogphone5ultimate #rogphone5pro #asus #republicofgamers #rog #gaming #gamer #gamingphone #tech #smartphone",
    "description_links": [
        "https://www.sellcell.com",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.youtube.com/watch?v=RpercXhgNXM",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.futureplc.com/terms-conditions/",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- This video is sponsored by sellcell.com. I don't know about you, but as I look back over the past year of rolling lockdowns, I realized that a big part of what has kept me sane all this time, is gaming. Yeah, the virtual cockpits of Microsoft Flight Simulator and Star Wars Squadrons have given me escape from isolation to destinations, terrestrial and galactic. Wild titles like The Long Dark have let me explore a different kind of isolation in a post-apocalyptic wasteland. As a new spring approaches, along with the hope that we'll soon be able to ditch this new normal for a newer and better one, Asus is ready to greet that new world with a new smartphone. One that lets us take the escapist weensy of gaming on the go. And, you know, even though I'm not really a gamer, I am really taken with the ROG Phone 5. (upbeat music) Now, if your first reaction upon hearing that there was another Republic of Gamers phone coming out was wait a minute, do gaming phones even make sense? It's a good question. But I find it's often asked for the wrong reasons. I'm talking about specs, and yes, the fact is that RAM bonuses not withstanding, the ROG phone essentially duplicates the important components of many mainstream flagships. That means that your Galaxy S21 Ultra is just as capable as this specialty smartphone at running most mobile games. But as I often say about the spec sheet, it's not even half the story. For me, a gaming phone lives or dies on two points. One, it has to make the experience of mobile gaming more enjoyable than other phones do, and two, if possible it should transmute the feeling I get while gaming into something physical. I know that's a little woo woo, but let me show you how the ROG Phone 5 starts doing that exact thing right out of the box. Of the three models in this generation, Asus sent me two for review and I chose to focus on one, the Ultimate edition. Pop open the magnetic clamshell box and you're treated to what I thought was just a beautiful Akira themed wallpaper, but launch the setup process, and you'll find it's actually an augmented reality graphic novel that welcomes you into the phone with an animated story. That's followed by a registration session that makes the process of creating a user account a lot more fun by giving you a choice of several heads up displays which you can map to your profile picture. In the entire time there's a bit of music playing under everything. It recalls the loading songs of Flight Simulator or the atmospheric tunes that used to play when setting up older versions of Windows. On any other phone, I'd be looking for the skip button, but here, these little touches are absolutely perfect for setting the tone. The big part of selling that are the best speakers I've heard on a smartphone. On all versions of the ROG Phone 5, the speakers use symmetrical front firing drivers that are incredibly loud and clear. And there's also a little bit of noise cancellation on each channel, which has the effect of adding tremendous space to the sound. You get a very clear delineation between left and right channels here. It's honestly so effective, it's a little bit disorienting. All this means that while Asus has brought back the headphone jack, two of them actually, if you prefer to play out loud, you're gonna love it. That second three and a half millimeter jack is located on an accessory that's been with the ROG Phone from the beginning. Yep, it's a clip on fan. This comes in the box with the Pro and Ultimate versions of the phone and promises to preserve your high frame rates during extended gameplay by literally blowing cool air onto the portion of the Gorilla Glass 3 backplate directly over the processor. At speeds, you can control manually or leave to the phone to decide. I can't say how effective it is. I mean, the phone didn't show any signs of struggling with the games I chose to test it. Call of Duty Mobile, Genshin Impact and World of Worship Blitz. But I did prefer to play with the cooler attached because it did cool off my fingers. The phone casing definitely does get hot. And more importantly, along with the fan comes a handy kickstand and two physical triggers that you can map to any onscreen control you want. Those extra controls are crucial for me. And I think for a lot of people who grew up gaming before touchscreens were a thing. It's just so much more satisfying to play with physical controls. And even if you don't clip on the cooler, you've got extra buttons anyway. Ultrasonic touch sensors called air triggers on the top edge can now be divided into two buttons a piece, and the Ultimate and Pro editions get an extra set of touch strips on the back for your middle fingers to feel out. Remember, there's no game compatibility needed for any of this. It's literally just assigning those fingertips to virtual buttons that you can put anywhere on the screen in any game. So without adding any accessories at all, you have six offscreen buttons to use for whatever you want. And, they can tell the difference between taps and swipes for even more granular control. They also work for a few non-gaming functions, like bringing back the squeeze gesture for Google Assistant. And if that's still not enough inputs for you, and you're willing to drop some extra dough, you can snap up the Kunai 3 game pad, which gives you big, satisfying buttons D-pads and joysticks on a set of controllers that can be used in several modes, many of which recall the Nintendo Switch, which is a good thing. And all of this is controlled through a piece of software called Game Genie, which is available during gameplay with a simple swipe from the left. Speaking of accessories, you do get a charger in the box. In this case, a 65 watt brick whose cable plugs into the bottom or the side of the phone where an extra USB C port doubles as HDMI out, so you can game on bigger screens. That charger took my review device from dead to 47% in 15 minutes, and it filled the battery completely in 54 minutes. That's quite a feat given the monster 6,000 mAh power pack in here. And because fast charging tends to be tough on battery chemistry, there are special charging modes to allow you to replenish more slowly overnight while you're sleeping, so you can prolong the batteries overall life. Now huge though it is, if you're doing any gaming at all, the phone needs every bit of that power reserve to keep you chugging. I found it surprisingly easy to blow through the power reserve with my test games, which I played at maxed out settings and with the AMOLED screen more often than not cranked to its full 144 Hertz refresh rate and brightness that tops out between 800 and 1,200 nits, depending on mode. In plain English, that means this is one of the brightest and one of the fastest screens around, covered by Gorilla Glass Victus, which should also make it pretty sturdy. All of which helps make up for a rare aesthetic compromise in the form of these somewhat stocky bezels. But you know what they say, if you can't make one perfect screen, just add another. Yeah, on the stock ROG Phone 5, you get a simple stippled RGB logo, but the Pro and Ultimate, pack an OLED display called ROG Vision, complete with animations for things like incoming calls, battery charging status or custom text banners and logos that you upload yourself. Just like everything else on this phone, it's pure overkill. An extravagance with no real utility other than to look cool. And even though its placement means the phone lacks wireless charging, I'm fully here for it. Just be aware that unlike the color panel on the Pro, the Ultimate's vision display is monochrome to keep in line with the phone's aesthetics, which I understand, but I still think is kind of a bummer. Also I do wish Asus offered a way to preview messages or other notifications on this screen. As it stands now, it doesn't illuminate at all, unless the main display is on, which seems like a missed opportunity. Still to come, camera, pricing, special perks and my final thoughts after a quick word from a sponsor who might just be able to help you afford this thing. - If you're thinking of trading in your old phone to help finance the ROG Phone 5, well here's a company that can help you do that. This video is sponsored by sellcell.com, which isn't just another used phone marketplace. See when you punch in your old devices details at sellcell.com, it compares buyback prices from over 40 mobile tech trade-in companies. That means two things. One, you save a lot of time you'd otherwise have spent cross shopping and two, you're guaranteed to always get the most cash for your old electronics. In fact, they're so serious about that promise that if find a higher price anywhere else, sellcell.com we'll pay you double the difference. Don't settle for less than your old devices are truly worth. Hit the link in the description and get the most for your trade-in today. Thanks to sellcell.com for sponsoring this video. Now Asus says that camera performance was not a big focus for ROG Phone 5 and it shows. Not in a terrible way, the photos are fine, the video is stable, you get what you expect from a high-end phone. But these optics are essentially the same ones from the last ROG Phone. That means a 64 megapixel primary, 13 megapixel ultra wide with 125 degree field of view and a five megapixel macro. All well and good, but there's none of the telephoto magic we're starting to see on other flagship phones, and certainly, none of the crazy camera experimentation I'm gonna show you in my next video, stay tuned. The pictures are competent if a bit blown out, passable, unless you're shooting side-by-side with a Pixel 5, especially at night. Again, they'll probably serve most people fine, but I do wish Asus had taken these cameras to the next level. And this is probably my one true disappointment with the device. The ROG Phone 5 will begin its launch in March, with the 5 Pro following in April, and the Ultimate completing the offering in May. Region specific pricing will vary, but the figures on screen should offer a rough idea of what you'll have to pay for the privilege. And maybe it's just because I've gotten used to foldable sticker shock, but I have to say I think 1,199 Euro for the Pro and 1,299 for the ultimate are absolutely fair. I mean, think about everything you get here. And in some markets, consumers will get even more in the form of a Republic of Gamers swag bag that I showed off on Instagram a while back. It doesn't check all the boxes that militant phone fans might like, such as a micro SD slot or a giant telephoto camera, and I may not be anywhere near the gamer that the target customer is, but folks, I know a masterpiece when I see one. Asus has blended its technical acumen with a clear sense of what its customers want and a heaping helping of fun to make what could have easily been worthless gimmicks into compelling features. And it's packaged and presented with the kind of confidence that comes from having also produced some of the most compelling computing hardware I've seen in the past year as well. It's all a far cry from the company I lambasted for its iPhone rip offs, just a few short years ago. To Asus, I say bravo on a brilliant product. And to those who buy it, I say, good luck, have fun. I know I did. (bright music) This review was produced following nine days with an ROG Phone 5 Ultimate review sample provided by Asus, which had no editorial input into this content, provided no compensation for it and was given no early look at it. The opinions contained here in are mine and mine alone. But, this phone is way too involved for just one review and there are plenty of things I missed. So I've linked to some of my friends reviews below. Check them out to learn more. Until next time, thanks for watching and remember to stay safe and mask up when you're around others, as you stay mobile, my friends.",
    "transcript_keywords": [
        "ROG Phone",
        "Phone",
        "ROG",
        "Star Wars Squadrons",
        "Asus",
        "ROG phone essentially",
        "Ultimate",
        "stock ROG Phone",
        "gaming",
        "Microsoft Flight Simulator",
        "Pro",
        "phones",
        "gaming phones",
        "gaming phone lives",
        "Flight Simulator",
        "make",
        "game",
        "Gamers phone",
        "Star Wars",
        "Wars Squadrons"
    ],
    "transcript_entity_values": [
        "1,299",
        "6,000",
        "Instagram",
        "a Republic of Gamers",
        "half",
        "144",
        "Microsoft Flight Simulator",
        "between 800 and 1,200",
        "65 watt",
        "nine days",
        "15 minutes",
        "1,199 Euro",
        "ROG Phone 5",
        "RGB",
        "the Nintendo Switch",
        "Kunai 3",
        "Call of Duty Mobile",
        "Gorilla Glass Victus",
        "13 megapixel",
        "March",
        "64",
        "three and a half millimeter",
        "3",
        "April",
        "54 minutes",
        "Hertz",
        "today",
        "USB C",
        "RAM",
        "One",
        "first",
        "AMOLED",
        "the power reserve",
        "jack",
        "Asus",
        "Google",
        "five",
        "two",
        "The Long Dark",
        "the past year",
        "ROG Vision",
        "ROG",
        "Game Genie",
        "iPhone",
        "ROG Phone 5 Ultimate",
        "six",
        "second",
        "5",
        "47%",
        "Asus",
        "over 40",
        "a minute",
        "Akira",
        "Ultimate",
        "Windows",
        "English",
        "May",
        "SD",
        "three",
        "one",
        "125 degree",
        "Galaxy S21 Ultra"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "PRODUCT",
        "LANGUAGE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT"
    ],
    "vector": [
        -0.10125284641981125,
        -0.002564717549830675,
        0.0323873870074749,
        0.004066528286784887,
        0.05632570758461952,
        -0.07411456108093262,
        -0.061222344636917114,
        0.03977018594741821,
        -0.011610079556703568,
        0.038393620401620865,
        -0.046711526811122894,
        0.12599770724773407,
        -0.00511004775762558,
        -0.00964728370308876,
        0.02301081269979477,
        0.02491137571632862,
        0.10095350444316864,
        -0.0744737833738327,
        -0.05400235950946808,
        0.0037896123249083757,
        0.060791581869125366,
        -0.07923375070095062,
        0.013517874293029308,
        -0.03135225921869278,
        0.08033794164657593,
        -0.04157739132642746,
        -0.06322129815816879,
        0.053040456026792526,
        -0.0020439375657588243,
        -0.060786809772253036,
        0.019579440355300903,
        0.12557023763656616,
        0.03812084719538689,
        0.00639649061486125,
        -0.09924306720495224,
        -0.09550479799509048,
        0.0038187559694051743,
        -0.023417668417096138,
        -0.018527919426560402,
        -0.038136184215545654,
        -0.05901249125599861,
        -0.008289721794426441,
        -0.023815017193555832,
        0.060349803417921066,
        0.0625765398144722,
        -0.06789936870336533,
        -0.0437130406498909,
        -0.03858570009469986,
        -0.0038018282502889633,
        -0.014521325938403606,
        0.022229047492146492,
        -0.031650591641664505,
        -0.023876875638961792,
        -0.05613843724131584,
        -0.16582925617694855,
        0.05201505124568939,
        -0.07295871526002884,
        -0.032366588711738586,
        0.08930753916501999,
        -0.007953135296702385,
        0.04134703800082207,
        -0.032928239554166794,
        -0.0561772920191288,
        0.027497291564941406,
        -0.045595843344926834,
        0.013309610076248646,
        -0.029354646801948547,
        -0.0744900181889534,
        0.02189146913588047,
        0.0263698510825634,
        -0.011600715108215809,
        -0.030885236337780952,
        0.044511567801237106,
        0.07007376849651337,
        -0.02927814982831478,
        0.09158402681350708,
        0.03841163590550423,
        -0.009139543399214745,
        0.015093157067894936,
        0.03660076856613159,
        0.015173619613051414,
        -0.039546918123960495,
        0.027950720861554146,
        -0.10744649171829224,
        0.06945223361253738,
        -0.013337434269487858,
        -0.026981113478541374,
        0.08427784591913223,
        -0.02614249475300312,
        -0.05302521213889122,
        -0.05828538537025452,
        0.11017152667045593,
        -0.02375163696706295,
        -0.0005325375823304057,
        -0.06268896162509918,
        -0.0002276884624734521,
        -0.050358228385448456,
        -0.06602548807859421,
        -0.04560476168990135,
        -0.015278440900146961,
        0.010460348799824715,
        0.029822226613759995,
        0.03691169619560242,
        0.03102709725499153,
        0.06235247850418091,
        -0.03138192743062973,
        0.00028068869141861796,
        -0.0016910580452531576,
        -0.04904937744140625,
        -0.01691254787147045,
        -0.08056598156690598,
        -0.0016585468547418714,
        -0.02336816117167473,
        -0.05609118193387985,
        -0.0017564701847732067,
        0.020160607993602753,
        -0.06976668536663055,
        0.037729762494564056,
        0.062081847339868546,
        -0.024911856278777122,
        -0.02168782614171505,
        0.004803311545401812,
        -0.07134000211954117,
        -0.06224382668733597,
        0.08094354718923569,
        0.026963789016008377,
        -0.010027457028627396,
        7.171339120745499e-33,
        -0.0976623073220253,
        0.06911345571279526,
        0.009675628505647182,
        -0.0011393418535590172,
        -0.0592346116900444,
        0.02831423468887806,
        0.05441431328654289,
        -0.0014326621312648058,
        0.03237450122833252,
        0.0813634917140007,
        -0.03941361606121063,
        0.057960622012615204,
        -0.03259382024407387,
        0.01018799003213644,
        0.07594596594572067,
        -0.01652352698147297,
        -0.02051846869289875,
        -0.0492330864071846,
        -0.015536043792963028,
        0.02142110839486122,
        0.025971950963139534,
        0.015840845182538033,
        -0.0007491327705793083,
        -0.025458844378590584,
        0.01925572007894516,
        0.05981152504682541,
        0.03798611834645271,
        -0.062070272862911224,
        0.06773710995912552,
        0.014341081492602825,
        -0.06241460517048836,
        -0.019049279391765594,
        0.005303290206938982,
        0.0076037440448999405,
        -0.03693746402859688,
        0.03759617730975151,
        -0.07846531271934509,
        -0.06632698327302933,
        -0.016428673639893532,
        -0.017764149233698845,
        0.02214125543832779,
        0.007019358221441507,
        -0.1334993988275528,
        0.04909582436084747,
        0.0023098564706742764,
        -0.037781961262226105,
        -0.0428394079208374,
        0.016492493450641632,
        -0.022916430607438087,
        -0.0004569438751786947,
        -0.09040069580078125,
        0.0217788964509964,
        -0.01493442989885807,
        0.030135462060570717,
        -0.01627236232161522,
        -0.042306605726480484,
        0.054940447211265564,
        0.05386499688029289,
        0.05138898268342018,
        0.09510249644517899,
        0.039977990090847015,
        -0.049904778599739075,
        -0.05007029324769974,
        0.04938958212733269,
        -0.004769027233123779,
        0.03771042451262474,
        0.04985123872756958,
        -0.05506220459938049,
        -0.03427938371896744,
        0.07619187235832214,
        0.08777057379484177,
        -0.014044005423784256,
        0.06516680121421814,
        0.016598423942923546,
        0.01938319206237793,
        0.01481026504188776,
        0.05646263062953949,
        0.016101762652397156,
        -0.034823376685380936,
        -0.0005402573151513934,
        -0.07565421611070633,
        0.04402781277894974,
        -0.02946704439818859,
        0.01701219007372856,
        0.02975723147392273,
        0.025107162073254585,
        0.010852289386093616,
        -0.08745291829109192,
        0.030622707679867744,
        0.08334958553314209,
        -0.018384626135230064,
        -0.07050016522407532,
        0.020860012620687485,
        0.1016317680478096,
        0.027887538075447083,
        -6.508038515303191e-33,
        -0.06572140753269196,
        -0.07291568070650101,
        0.009794226847589016,
        0.06265826523303986,
        -0.04663044586777687,
        0.00981701910495758,
        0.04608688876032829,
        0.01613597385585308,
        -0.027939051389694214,
        -0.06326289474964142,
        0.027757961302995682,
        0.07810818403959274,
        0.062265973538160324,
        0.047074105590581894,
        0.02289721556007862,
        -0.056564994156360626,
        0.009182866662740707,
        -0.08344125002622604,
        0.09652497619390488,
        0.05076763033866882,
        0.03487338498234749,
        0.11633620411157608,
        0.03937801346182823,
        0.10887404531240463,
        0.06917402148246765,
        -0.008646972477436066,
        0.021642575040459633,
        -0.06340408325195312,
        0.011442954652011395,
        -0.001111347577534616,
        0.051675405353307724,
        0.023864049464464188,
        0.05597268417477608,
        0.003659721463918686,
        0.056604739278554916,
        0.011105036363005638,
        0.05036778375506401,
        0.06087632104754448,
        -0.0008522798889316618,
        -0.0015461071161553264,
        0.030063951388001442,
        0.03228504955768585,
        -0.006075811106711626,
        -0.023641260340809822,
        0.0374331995844841,
        -0.042278047651052475,
        -0.0229132492095232,
        -0.040909260511398315,
        0.028999021276831627,
        -0.02600874751806259,
        0.08102834969758987,
        -0.04713861644268036,
        -0.04775497317314148,
        -0.04220731928944588,
        -0.04930039122700691,
        -0.02724096179008484,
        0.024393752217292786,
        -0.08552433550357819,
        0.031100941821932793,
        0.0004704891180153936,
        0.0728161558508873,
        0.041841473430395126,
        -0.007370352279394865,
        -0.0544573999941349,
        -0.010412848554551601,
        0.06169235333800316,
        0.09449010342359543,
        0.0016744622262194753,
        0.014728554524481297,
        -0.009889577515423298,
        -0.1464424878358841,
        0.01266493834555149,
        -0.02453787624835968,
        0.000248671363806352,
        0.04461655393242836,
        0.09631893038749695,
        -0.04549773037433624,
        0.04054037854075432,
        -0.015845509245991707,
        -0.06834407895803452,
        -0.03069760836660862,
        0.003681209636852145,
        -0.00914293248206377,
        0.04081609472632408,
        -0.007852762937545776,
        -0.057899314910173416,
        -0.03226245194673538,
        -0.006648016162216663,
        0.028893321752548218,
        0.015779489651322365,
        0.00560977216809988,
        0.011336161755025387,
        -0.10407526791095734,
        0.042687129229307175,
        -0.013509740121662617,
        -5.232593380810613e-08,
        0.10334289819002151,
        0.029529225081205368,
        0.08117738366127014,
        -0.02899044379591942,
        0.047572892159223557,
        -0.051556047052145004,
        -0.03080155700445175,
        -0.1020224541425705,
        0.0898546352982521,
        0.05699877440929413,
        -0.01616418920457363,
        -0.05997447669506073,
        -0.02127726748585701,
        -0.0006693877512589097,
        -0.01749839447438717,
        0.07960008829832077,
        -0.02353697270154953,
        0.07349144667387009,
        0.04237845912575722,
        0.06301744282245636,
        0.021504603326320648,
        0.02741258405148983,
        0.014560648240149021,
        -0.06196940317749977,
        0.12055833637714386,
        -0.05926451459527016,
        -0.047543466091156006,
        -0.034176286309957504,
        0.07702511548995972,
        -0.0417543426156044,
        0.048323843628168106,
        -0.018974728882312775,
        0.07644589245319366,
        -0.0036518455017358065,
        0.0005755218444392085,
        -0.019938291981816292,
        0.055347245186567307,
        -0.009681531228125095,
        0.03828395530581474,
        0.004231756553053856,
        0.0012299895752221346,
        -0.06871300935745239,
        -0.029278598725795746,
        -0.02620008774101734,
        -0.11926374584436417,
        -0.06698552519083023,
        -0.06257994472980499,
        -0.15752677619457245,
        -0.0018571480177342892,
        -0.028121531009674072,
        -0.06376656144857407,
        -0.025639602914452553,
        -0.034770846366882324,
        -0.08229625970125198,
        0.05288403108716011,
        -0.0217102263122797,
        0.050649963319301605,
        -0.06440363079309464,
        0.035177432000637054,
        0.0045796846970915794,
        0.008099253289401531,
        -0.04368826001882553,
        0.0025519595947116613,
        0.05658607929944992
    ]
}