{
    "id": "tbFixmOdBy0",
    "title": "Apple's M1 Mac is not what you think...",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2020-11-11T14:45:08Z",
    "video_url": "https://www.youtube.com/watch?v=tbFixmOdBy0",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "m1",
        "apple m1",
        "apple silicon",
        "apple arm",
        "arm transition",
        "m1 mac",
        "m1 macs",
        "m1 mac mini",
        "m1 macbook air",
        "m1 macbook pro",
        "2020 mac mini",
        "2020 macbook pro",
        "2020 macbook air",
        "new macbook air",
        "apple event",
        "apple keynote",
        "big sur",
        "macos",
        "big sur release",
        "big sur review",
        "apple explained",
        "mac news",
        "apple news",
        "apple rumors",
        "a14",
        "apple a14",
        "iphone 12",
        "iphone 12 mini",
        "iphone 12 pro max",
        "ipad air"
    ],
    "views": 703382,
    "likes": 26685,
    "comments_count": 3414,
    "description": "The first Apple Silicon Macs are here sporting the new M1 SoC. What does it mean for Macs today and into the future? Let's find out! Sign up for Setapp today!   Check out my gear/suggestions! -   Subscribe to my podcast Flashback! -  Follow Snazzy Labs on Twitter -  Follow me on Instagram -   At long last, Apple has finally announced and will soon be releasing Arm-based Macs based on Apple's new \"Apple Silicon\" family. This new chip, the M1, is based on the A14 and makes its way to the MacBook Air, 13\" MacBook Pro with Touch Bar, and Mac mini. Specs are vague and performance is yet to be determined, but if Apple's slides are to be believed, this chip design and these machines are just the beginning of a hugely important transition for Apple and computing in general. But let's go beyond what Apple said in the keynote and dive into some of the nuance behind this new Apple Silicon M1 chip.",
    "description_links": [
        "https://setapp.com/?utm_source=snazzylabs",
        "http://amazon.com/shop/snazzylabs",
        "http://relay.fm/flashback",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "I am often wrong and many of you like to point that out. For example, I initially poo-pooed the iPhone Xs abandonment of the home button in favor of gesture-based navigationand while most of my complaints in that video were actually solved by Apple in firmware updatesI admit to being mostly wrong. I initially disputed the idea that a haptic touchpad could be any good. I was wrong. But guess what? When Im right, Im really right. Ive been prophesying the development of in-house silicon Macs since 2016I even got the window of the eventual chips release correct. When questioned what benefits would come from such a transition, I mentioned security, battery, and efficiency. Today, more than 4 years later, Apple stated these exact benefits from moving to their new M1 processorthe first Apple Silicon system-on-chip for the Mac. Youre welcome. Setapp is like Netflix, but for Mac apps. With hundreds of apps to choose from, Setapp helps make you your most productive selfon both the Mac and on iOS. Sign up today with the link below or stay tuned until later in the video to find out more. In all seriousness, I dont claim to be a bastion of knowledge and my guess that ARM Macs would become a thing wasnt prophetic even though very few people agreed Apple would be capable of that back in 2016. It doesnt modify how massively important this transition is. Not just for Apple but for computing in general. Save for smartphones and integrated Linux systems, the rest of the computing world runs on x86 chips made by Intel and AMD. For Apple to abandon ship is bold, but its uniquely within their capabilities as theyre now designing the chips for their machines running their OS. They have complete vertical control of the entire experience which literally no other computer maker can do. This will either prove to be a breakthrough or a disappointment, but based on what we saw today, I tend to believe itll be the former. So, before we get to the three Mac models, lets start with the chip because theres only one thatll be in all three of the new computers. Its called the M1 and while Apple didnt explicitly state it in the keynote, its based on the A14 found in this years iPhones and iPad Air but it is not the same chip as many rumors indicated. Apple mentioned a 16B transistor count which is about 35% more than the A14. This also means that like the A14, its built on a 5nm process and manufactured by Taiwan Semiconductorthe same company that makes AMDs Ryzen chips. The most unusual thing about this move is that it uses whats called a POP or package-on-package method. This isnt unusual for a smartphone but it is for a computer. You see, on the average laptop, youve got your CPU/iGPU, your system memory, an I/O chip, and in the case of Macs, youve got the T2 security chip and Thunderbolt controller separate. The M1 chip absorbs all of those chips and their functions into one packages by stacking the smaller packages on top of and beside each other to make one super package system on a chip. Why do this? Well, there are several advantages. Cost and size are all part of it, but the thing that matters the most to us as consumers is speed and efficiency. When all of these pieces are separate, signals that go back and forth between these chips need to be routed through a substrate like a PCB. The signals will travel faster and more efficiently through a contained microchip. Of course, this makes manufacturing such a chip significantly more difficult, though Apple seems confident they can pull it off. Another unique and interesting design decision is a unified memory pool. Unlike more traditional setups that have individual memory stores per component, this new unified memory architecture will allow the components of the SoC to share memory on the fly without having to copy data between separate pools and has the side benefit of being easier to program for. In short, Apple says this should make things should feel faster. Unfortunately, we dont know what type or clockspeed of memory Apple is using and frankly, we may never know. This chip has an 8-core CPU with 4-high power cores and 4-low power cores. While Apple didnt provide any useful graphslike what the hell is thisnot only does it have no chart markers to determine scale, but Latest PC laptop chip? What does that even mean?! This graph (and all others) are worthless marketing fodder but lets just pretend for a minute that it is even remotely to scale. Thatd put the Latest PC laptop chip at about 35-40W which would be characteristic of a multi-threaded AMD Renoir or Intel Tiger Lake SKU under full-chip load. Anandtech sang praises of the A14 found in iPad Air and its best-in-class memory management, 8-wide decode block, and crazy number of execution units. They state: The fact that the A14 currently competes with the very best top-performance designs that the x86 vendors have on the market today is just an astonishing feat and the fact that Apple is able to achieve this in a total device power consumption of 5W including the SoC, DRAM, and regulators against AMDs 21W and Intels 49W package power figures without DRAM or regulation is absolutely mind-blowing. Okay, so operating on the assumption that this is a 35-40W high-end X86 chip which seems very reasonable, the M1 is getting about a 40% performance improvement over this X86 chip all while drawing just 40% of the power10W. Thats bananas, and Apples claim that the M1 has the fastest CPU core in the world may actually be plausible. Especially after Apple showed off the eye-brow raising faster than 98% of PC laptops slide. Of course, there are also dissenters like ex-Intel VP Francois Piednoel who told me Anandtech was off its rocker. The long and short of it is, we dont really have any idea how the M1 will perform and we wont until the machines start shipping next week. And get subscribed so you dont miss our coverage on that. What we are certain of, however, is that in most instances, the M1 seems to outperform the Intel chips Apple was using in prior models while drawing significantly less power. This may may not make it the most powerful laptop chip in the world, but will likely make it amongst the best option for most peoples use cases. macOS Big Sur is a huge catalysthah, get it?in this transition. The synergy of hardware and software that Apple is known for is only getting more tightly woven and the APIs and codecs that Apple releases, if adopted, will be ever more important. With Metal, macOS will be able to provide more graphics memory than ever allowing FCPX to be up to 6x faster they said in the keynote. Compared to what?! Well, if we look at the fine print, baby, we can see they were talking about a pre-production Mac mini compared to the 3.6GHz quad-core i3 Mac miniboth with 16GB of RAM and 2GB SSD. That two-year-old i3 is hardly a heavyweight in performance, but 6x improvement is significant. Especially considering the performance difference between the old i3 Mac mini and the old i7 Mac mini were not even double. 6x is a lot; even with a low-end baseline. Advanced power management in macOS will allow the CPU to use the efficient low-power cores when needed for maximum battery life, and only ramp up when performance is requested. Rosettathe X86 to ARM translation layer that will allow us to run our old apps until theyre updated seamlessly. In some edge cases, Apple says that the performance under Rosetta is even better than on previous Macs running the code natively. Impressive. Oh, and last, you can now run any iPhone or iPad app on your Mac without any translation layernativelyfor free. Thats amazing. The Macs software catalog just catapulted in both quality and quantity. As I mentioned earlier, Setapp is a subscription service for the Mac and I had been a paying customer long before they offered to use the channel. Even though Setapp has more than 200 of the best Mac apps available for one cheap monthly price, the service goes beyond a simple list of apps. It makes you more productive. The app is very cleverly designed making it easy to find apps you didnt even know existed and with personalized recommendations, youll find yourself improving your workflow subconsciously without having to figure out how to complete every small task. Not only is Setapp an exceptional value (one of the best Setapp apps I use literally costs more by itself than it does as part of the 200+ apps Setapp suite), but with fixed pricing you dont have to worry about license keys, wasting time researching if an app is worth its high cost, and more. With iOS apps as part of the Setapp suite now, everyone can get in on the fun. Try Setapp today with my link belowI know youll love it cause I do! So, lets finally talk about the new machines, shall we? First up is the MacBook Air. The form factor is unchanged except for the keyboard has interestingly ditched Launchpad and Keyboard Backlight hotkeys in favor of Spotlight, Dictation, and Do Not Disturb. In addition to the M1, the laptop gains USB 4 support (which is based off of Thunderbolt 3), WiFi 6, and ditches the fan in the process that by the way, was never actually connected to any heat pipes so who knows how useful it actually was (go back and watch my hilarious discovery of that a couple years ago. Starting at the same $999 price, Apple stated that it could edit multiple streams of 4K ProRes video in Final Cut without dropping frames. Pretty handy. And a hat tip to the unified memory pool. Next up, we have the 13 MacBook Pro. Keeping its same $1,299 price point, it ditches Intel in favor of the M1, retains the same battery capacity and Touch Bar but unlike MacBook Air, has an active fan and heat pipe system. The implication here, obviously, is that (a) the CPU is higher-binned, (b) will be able to have a higher base clock thanks to active cooling, and/or (c) will be able to maintain sustained loads for a longer period of time without temperature concerns. As a consequence, itd be nice if Apple had provided actual performance metrics from the Pro to the Air, but they didnt. All we know is that they have the M1. The same M1? I dunno? The same performance? Probably not, but by how much? I dunno. Benchmarks performed by people like yours truly will finally settle things, but it may be time for Apple to come up with a new scale for system performance. I actually agree with Jonathan Morrison in that clock-speed is and has always been a poor metric of performance and with this new system leveraging macOS Big Surs software optimization and non-standard hardware like the on-board neural engine, traditional specs dont matter. This is a weird SoC that cant be measured spec-by-spec with anything else, but at least us give us SOMETHING so that I can know this Mac is better than this Mac and by this much. The only thing we do know? Apple said it can edit 8K ProRes footage in DaVinci resolve without dropping a single frame which lemme tell you, is insanely impressive. We had a bit of trouble getting solid playback in Resolve editing an 8K file in DNxHR (a video codec with similar compression to ProRes) on a desktop computer with a Ryzen 9 3950X 16-core CPU and GTX 1080 Ti GPU. Last, we have the Mac mini that not only adopted the M1 chip, but lost $100 in price at the same time and Apple claims it to be 1/10th the size and 5x faster than the best selling PC in its price rangea massively bold claim. Disappointingly, none of these devices have 4 USB-4/TB3 ports. The previous Mac mini did. As did the previous MacBook Pro. My guess is that the M1 only has a single Thunderbolt controller because of space and cost limitations where the previous machines had two. Disappointing to be sure; however, this is still more than enough throughput for most people. Oh, also, no 10Gig on the Mac mininot even as an optionwhich is really frustrating. For a couple hundred bucks you can get a 10Gig NIC that attaches via TB3 but thatll cut into your throughput thats already halved from the prior Mac mini. All in all, these machines are still a big mystery. I think well find things are disappointing, but I also think the majority of us will be blown away at these systems and capabilities. If Apple is to believed, all of these machines are increasing in performance anywhere from 2.5-5x. Thats insane considering most generation-over-generation improvements are about 0.2x. All while increasing battery life, decreasing heat output, and maintaining (or in the case of Mac mini), lowering price. Considering these are the weakest Apple Silicon Macs Apple will ever make, its super exciting to think what the future holds over this upcoming 2-year transitionespecially for high-TDP, high-performance Pro Macs. Did you order an Apple Silicon Mac today? If so, let me know which one below. If not, why? Would love to hear your thoughts and would love a like if you liked this video. If you disliked it, share it with someone you dislike. Thanks so much for watching and as always, stay snazzy.",
    "transcript_keywords": [
        "Apple",
        "Mac",
        "Apple Silicon Macs",
        "Silicon Macs Apple",
        "Mac mini",
        "Intel chips Apple",
        "chip",
        "Apple Silicon",
        "Macs Apple",
        "Macs",
        "silicon Macs",
        "Mac apps",
        "Silicon Mac today",
        "chips",
        "chips Apple",
        "performance",
        "Setapp",
        "laptop chip",
        "CPU",
        "memory"
    ],
    "transcript_entity_values": [
        "5W",
        "the MacBook Air",
        "a minute",
        "Spotlight, Dictation",
        "A14",
        "Taiwan Semiconductorthe",
        "two",
        "6x",
        "this years",
        "2",
        "2.5-5x",
        "40%",
        "about 35%",
        "two-year-old",
        "USB 4",
        "Anandtech",
        "Francois Piednoel",
        "Apple Silicon Macs Apple",
        "one",
        "MacBook Pro",
        "5",
        "Apples",
        "macOS",
        "3.6GHz",
        "10Gig",
        "35-40W",
        "13",
        "Apple Silicon Mac",
        "Ryzen",
        "98%",
        "Pro Macs",
        "Apple",
        "5x",
        "8",
        "100",
        "SoC",
        "DaVinci",
        "Intel Tiger Lake SKU",
        "NIC",
        "1/10th",
        "Mac",
        "iPhones",
        "Apple Silicon",
        "first",
        "4",
        "AMD",
        "16",
        "MacBook Air",
        "Linux",
        "2-year",
        "iPad Air",
        "monthly",
        "three",
        "Macs",
        "Launchpad",
        "just 40%",
        "ProRes",
        "1,299",
        "Touch Bar",
        "hundreds",
        "iPad",
        "PCB",
        "today",
        "Jonathan Morrison",
        "21W",
        "Today",
        "CPU",
        "about 35-40W",
        "Rosetta",
        "16B",
        "iPhone Xs",
        "2016",
        "Intels",
        "iPhone",
        "macOS Big Sur",
        "a couple years ago",
        "about 0.2x",
        "K ProRes",
        "200",
        "macOS Big Surs",
        "Thunderbolt",
        "more than 200",
        "next week",
        "FCPX",
        "Netflix",
        "Air",
        "Mac",
        "a couple hundred bucks",
        "Setapp",
        "999",
        "T2",
        "Final Cut",
        "more than 4 years later",
        "Metal",
        "RAM",
        "DRAM",
        "Anandtech",
        "i3 Mac",
        "Thunderbolt 3",
        "2016I",
        "M1",
        "AMD Renoir",
        "GTX 1080 Ti GPU",
        "First",
        "Intel",
        "iPad Air",
        "16GB",
        "Setapp",
        "ex-Intel"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "NORP",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "ORG"
    ],
    "vector": [
        -0.02777383103966713,
        0.03409668430685997,
        0.0928000807762146,
        -0.02363876812160015,
        0.004040950909256935,
        -0.054015085101127625,
        0.04848313704133034,
        0.028276845812797546,
        -0.0231548510491848,
        0.009078687988221645,
        0.10290951281785965,
        0.0734604001045227,
        0.004611705895513296,
        -0.029820231720805168,
        -0.036858681589365005,
        0.03579343110322952,
        0.08357439190149307,
        -0.07241072505712509,
        0.02528410218656063,
        0.08205726742744446,
        0.006034271791577339,
        -0.026276638731360435,
        -0.012089347466826439,
        0.019747961312532425,
        -0.04269952327013016,
        0.04611317813396454,
        0.05509401857852936,
        -0.03832632303237915,
        -0.08570145070552826,
        -0.04923886060714722,
        -0.023264622315764427,
        0.081468865275383,
        0.09345810860395432,
        -0.007088691461831331,
        0.05074973404407501,
        -0.059319157153367996,
        0.10087743401527405,
        -0.07114212214946747,
        -0.022547047585248947,
        -0.13309043645858765,
        -0.04666440561413765,
        -0.058144982904195786,
        0.09632556885480881,
        0.04512269049882889,
        0.0819314569234848,
        0.009150600992143154,
        0.09547214210033417,
        -0.07876680791378021,
        -0.0300909411162138,
        0.013455532491207123,
        0.03856400027871132,
        -0.07945718616247177,
        0.03564246743917465,
        0.0008473605266772211,
        -0.003776379395276308,
        0.0342390276491642,
        0.0003722245164681226,
        -0.017059262841939926,
        0.03132380172610283,
        0.03745032474398613,
        0.018121693283319473,
        -0.07853039354085922,
        -0.02680947072803974,
        0.042489297688007355,
        0.08373201638460159,
        -0.07188206911087036,
        0.09356126934289932,
        -0.07867559045553207,
        -0.02524224855005741,
        0.04255492612719536,
        0.05803795903921127,
        -0.04479648917913437,
        0.04537522792816162,
        0.0878077819943428,
        -0.040903471410274506,
        0.017192116007208824,
        0.02585737034678459,
        0.046078965067863464,
        0.03766833245754242,
        0.045997727662324905,
        0.007465229369699955,
        0.04208121448755264,
        -0.06933372467756271,
        -0.0015062883030623198,
        -0.027419453486800194,
        -0.037701744586229324,
        -0.0702705979347229,
        -0.007820919156074524,
        -0.005552042741328478,
        -0.034995999187231064,
        -0.035642873495817184,
        0.017016040161252022,
        0.003150162985548377,
        0.014266230165958405,
        0.08096597343683243,
        -0.05189761891961098,
        -0.0547274686396122,
        0.009437520056962967,
        -0.005218685604631901,
        0.01123511977493763,
        0.08350273966789246,
        0.1262868195772171,
        0.052604496479034424,
        -0.040085069835186005,
        0.0304322000592947,
        -0.040483471006155014,
        -0.039904698729515076,
        0.020224828273057938,
        0.005271101836115122,
        0.06629204750061035,
        0.04186413064599037,
        -0.013525708578526974,
        -0.016416342929005623,
        0.003049402264878154,
        0.008023307658731937,
        -0.06289558112621307,
        0.0025966065004467964,
        0.029290229082107544,
        0.09004759788513184,
        0.03170068562030792,
        -0.04093654081225395,
        0.017204085364937782,
        -0.083529993891716,
        -0.05138057842850685,
        -0.0494413860142231,
        0.04132833331823349,
        -0.11827834695577621,
        3.8767002884592544e-33,
        0.049622394144535065,
        0.024272944778203964,
        -0.00464613875374198,
        -0.024328386411070824,
        -0.041287630796432495,
        -0.08799782395362854,
        0.05164023116230965,
        -0.027411404997110367,
        0.045882098376750946,
        0.015345601364970207,
        -0.053136490285396576,
        -0.06841393560171127,
        -0.0511476993560791,
        0.06026862561702728,
        0.05819451063871384,
        -0.07403691858053207,
        -0.0289576668292284,
        -0.0395040437579155,
        0.021766122430562973,
        0.013163105584681034,
        -0.01589958183467388,
        0.045858629047870636,
        0.0027047516778111458,
        -0.08946430683135986,
        0.05871075019240379,
        0.09424534440040588,
        0.02231026068329811,
        -0.0260333139449358,
        -0.022814413532614708,
        0.029521139338612556,
        -0.08132341504096985,
        0.027851715683937073,
        -0.006628029048442841,
        -0.11957715451717377,
        -0.01827111281454563,
        -0.03857967257499695,
        0.007404339965432882,
        -0.1140696257352829,
        0.04227099567651749,
        -0.049063827842473984,
        -0.057924479246139526,
        0.010582397691905499,
        -0.04991371929645538,
        -0.01300609577447176,
        0.055384308099746704,
        0.03061460517346859,
        -0.04397391900420189,
        0.01921195536851883,
        -0.008459348231554031,
        -0.06023648381233215,
        -0.044171225279569626,
        0.005701422691345215,
        0.059722211211919785,
        0.023701533675193787,
        -0.043158937245607376,
        -0.014989620074629784,
        -0.00482735363766551,
        -0.04725190997123718,
        0.0454532653093338,
        0.07316525280475616,
        0.004297928418964148,
        0.03139302879571915,
        -0.012542403303086758,
        0.1104041337966919,
        -0.06896724551916122,
        0.10540258884429932,
        0.06351763755083084,
        0.07877544313669205,
        -0.05198408290743828,
        0.07390022277832031,
        -0.015108308754861355,
        -0.034534793347120285,
        -0.006360969971865416,
        -0.06944149732589722,
        0.005619723349809647,
        -0.04770177602767944,
        -0.050453249365091324,
        -0.010167575441300869,
        -0.044009286910295486,
        -0.009180130437016487,
        0.0471029058098793,
        0.004395640455186367,
        -0.028756262734532356,
        0.03832350671291351,
        -0.07927516102790833,
        0.04929455369710922,
        0.09410344809293747,
        -0.006808769423514605,
        -0.011330385692417622,
        0.047071803361177444,
        0.0005237568402662873,
        -0.02633492834866047,
        -0.016311123967170715,
        0.012605120427906513,
        -0.05788096785545349,
        -6.0721813730656105e-33,
        0.028466269373893738,
        -0.009101120755076408,
        -0.02712543122470379,
        0.019579576328396797,
        -0.08126794546842575,
        -0.05438712239265442,
        0.009965142235159874,
        0.010066036134958267,
        -0.14055860042572021,
        -0.03601176291704178,
        -0.03530874848365784,
        0.026894154027104378,
        -0.03454127907752991,
        -0.03945193812251091,
        -0.05223909765481949,
        0.03974931314587593,
        -0.029024479910731316,
        -0.10247877985239029,
        0.056135088205337524,
        -0.028762657195329666,
        0.11889087408781052,
        0.01698453538119793,
        0.014012769795954227,
        -0.013758677989244461,
        -0.023343835026025772,
        -0.05229925364255905,
        0.00017035359633155167,
        0.0007432400598190725,
        -0.011333141475915909,
        -0.0313199982047081,
        -0.011914954520761967,
        -0.023399071767926216,
        0.06604529917240143,
        0.04204656556248665,
        0.03244110196828842,
        0.012046224437654018,
        -0.021569065749645233,
        -0.025463446974754333,
        0.06427332013845444,
        -0.012396895326673985,
        0.0593184269964695,
        -0.004270400386303663,
        -0.01802622154355049,
        -0.028705863282084465,
        0.02463984675705433,
        0.03146728500723839,
        -0.015040216036140919,
        0.0138195576146245,
        0.0659199059009552,
        -0.08152557909488678,
        -0.05248695984482765,
        0.008278497494757175,
        0.012606133706867695,
        -0.03668740764260292,
        -0.01052627433091402,
        -0.10071990638971329,
        -0.03693663701415062,
        -0.038070909678936005,
        -0.050736796110868454,
        0.03660693019628525,
        0.053341858088970184,
        -0.013777155429124832,
        0.056336212903261185,
        -0.06458359956741333,
        -0.02253328077495098,
        -0.01782275177538395,
        -0.0002590283693280071,
        -0.013959439471364021,
        -0.04316479340195656,
        0.019045457243919373,
        -0.01594908908009529,
        -0.001197495381347835,
        0.006113253999501467,
        -0.06179413944482803,
        -0.016070887446403503,
        0.04251082241535187,
        -0.0042292154394090176,
        -0.07559376209974289,
        -0.05296932905912399,
        -0.04605593904852867,
        -0.019804086536169052,
        0.03692828491330147,
        0.035229504108428955,
        0.08816119283437729,
        -0.0005098316469229758,
        0.014129449613392353,
        0.02225159853696823,
        -0.009587062522768974,
        -0.05586596578359604,
        0.05887448787689209,
        -0.03895528241991997,
        -0.0003285138518549502,
        -0.049120884388685226,
        0.030075030401349068,
        -0.1678181141614914,
        -5.54270620511943e-08,
        0.05841817706823349,
        -0.03608914464712143,
        0.05060891807079315,
        0.043571796268224716,
        -0.02206619456410408,
        0.036544088274240494,
        -0.02689160406589508,
        0.002364058280363679,
        0.10772742331027985,
        -0.008940652012825012,
        0.029291227459907532,
        -0.08011351525783539,
        -0.05300217866897583,
        0.019066672772169113,
        0.0544024221599102,
        0.09122925996780396,
        -0.045425835996866226,
        -0.03901957720518112,
        -0.019105616956949234,
        -0.042661771178245544,
        -0.009865297935903072,
        0.06813909858465195,
        0.04554501175880432,
        0.003587656654417515,
        0.018805501982569695,
        0.025562504306435585,
        -0.09998641163110733,
        0.054041363298892975,
        -0.012805650010704994,
        0.04126143828034401,
        -0.07140535861253738,
        -0.025853199884295464,
        -0.00044450981658883393,
        0.03700336068868637,
        0.008502010256052017,
        -0.06868856400251389,
        0.009980150498449802,
        0.03793957829475403,
        0.12720757722854614,
        -0.043092843145132065,
        -0.04020409286022186,
        -0.08512940257787704,
        -0.053775567561388016,
        0.011102504096925259,
        -0.06002426892518997,
        -0.04779801890254021,
        -0.08082325756549835,
        -0.04329374432563782,
        -0.0663541853427887,
        0.12309402227401733,
        0.04957731440663338,
        0.025201255455613136,
        0.02183244563639164,
        0.0481950044631958,
        0.025050964206457138,
        0.0572381429374218,
        -0.0024658702313899994,
        -0.05618608742952347,
        -0.014769366011023521,
        0.03479298576712608,
        0.136541947722435,
        -0.05808928236365318,
        -0.024752676486968994,
        0.09384425729513168
    ]
}