{
    "id": "TClRRMFZ7Sw",
    "title": "Laserdisc's Failure: What Went Wrong",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-02-06T19:06:58Z",
    "video_url": "https://www.youtube.com/watch?v=TClRRMFZ7Sw",
    "category": "Science & Technology",
    "tags": [
        "laserdisc",
        "laservision",
        "magnavision",
        "LD",
        "pioneer",
        "videodisc",
        "CED",
        "selectavision",
        "videocassette recorder",
        "VCR",
        "why did laserdisc fail"
    ],
    "views": 2599669,
    "likes": 54618,
    "comments_count": 5330,
    "description": "You can support this channel on Patreon!  Link below Laserdisc didn't have an easy start.  In this video, we take a look at the first few years of Laserdisc's existence.  Though many articles or videos talking about Laserdisc will blame the high cost of discs and the inability to record, those problems are only partially to blame.  Here's a link to the entire playlist on Laerdisc:   The ad mentioned in the video:   Link to the previous video:   You can support this channel on Patreon!  Patrons of the channel are what keep these videos coming.  If you're interested in helping out, please check out the link below.  Thanks for your consideration!   And thank you to the following patrons! Charlie Quigley, Tommi Hares, Tomas, Dakota Williams, Chuck Floyd, Eitan Tal, Callum Brieske, Paul Fisher, Stephen Vrazel, Applied Science, peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Howard Longden, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, twiglet, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Sam Hodge, Matthew Rossi, Paul Craigie, Paul Williams, Tyler, Gerald Monaco, Kelly Rose, Tab Patterson, Jason Weathered, Sergey Kiselev, h.drew foy, Roger Beal, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Tiago Pereira dos Santos silva From Porto, Portugal, Techmoan, Mike Mason, Clara Latter, Elijah Reeds, Christopher Jett, Justin Talbot, Francisco Vogliotti, Steven Metcalf, Verysofisticated, Lolucoca, Matt Standish, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, rn Arnarson, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Boris, Bill Basch, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kiera Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, Bjrn Vegar Torseth, Yaniv, Andr, Andres Plaza, Charlie Hankin, Craig Leverenz, Casey Kikendall, Sebi Jecklin, Tianyu Ge, Daniel J Schless, Justin Smith, The8TrackKid",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLv0jwu7G_DFUoByWSHHoSTlUIxY7VkJLi",
        "http://farm9.staticflickr.com/8125/8657012304_b8ed63f3f8_o.jpg",
        "https://youtu.be/Eg8tK1LpLS8",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "In the last video, we took a look at the early history of Laserdisc. If you havent seen that, you can find a link down below or up there. In short, Laserdisc was the first optical storage format, storing analog video on 12 inch reflective discs, and it was released at the end of the 1970s. Featuring many of the noteworthy features of DVD, it may seem surprising that it didnt become that popular. Its market adoption barely reached 2 percent of videocassette recorder sales in North America, and was even worse in Europe. Its most successful market was in Asia, but even that wasnt fantastic. Only 10% of Japanese households had a laserdisc player, and Japan was considered the healthiest market. In this video, well find out why Laserdisc just sorta stayed in the background its entire life. Let me begin by saying that the problem is more nuanced than simply, they cost too much. Because initially, laserdiscs were far cheaper than videocassettes. And its also more nuanced than laserdiscs inability to record. I began the previous video with --A product with an unknown purpose that was both a few years too late and way too far ahead of its time-- Those statements are interrelated, but lets start with the first one - an unknown purpose. To understand that, you need to put yourself in the mindset of a consumer in the mid 1970s. At that time, there were essentially two types of media you could purchase to consume at home. Print media--thats books, newspapers, etc,--and music. For nearly a century you could purchase music to play on a phonograph, and indeed this was the first way we could listen to music at home. (Static, buzzing, and tuning sounds) (through the radio) Radio came later, providing a source of free, nearly continuous programming. But radio was a fleeting thing, and unless you had the patience to record a broadcast with a tape recorder, go back and find the songs you actually want, dub them onto another tape (which requires a second tape recorder), and then finally enjoy music uninterrupted, you would just buy the album from your favorite artist on disc to play at home. Indeed radio was pretty much how new artists were discovered and albums were sold. Some of that still happens today, but we all seem to use streaming services or other, ehem, means of getting our music on-demand. Anyway, due to the short nature of musical radio content--generally only three minutes or so for a song--the programming on a radio station wasnt usually organized beyond an hour of such-and-such music. Maybe youd have a host for the afternoon drive, but the content being broadcast would repeat multiple times during the day, as after all whats popular is popular. This created little incentive for a radio listener to record the broadcast, which again made the sale of music in record stores a logical, convenient thing. This was especially true for less popular genres of music, where it would be rare to hear it on the radio anyway. For all these reasons, the consumer of 1975 was used to buying record albums to play at home, and indeed wanted to. Now if someone wanted to watch moving pictures, and Im being deliberately vague here, they had two options. For long-form content, you would go to the the-a-ter to watch the newest releases. Movies were obviously not a new thing in 1975, and the way you watched them had been the same for many years. A film was a thing you went to go see once, maybe twice, and wasnt something you would expect to see at home over and over again. Only the wealthy and eccentric would shell out the cash necessary to purchase a 16 millimeter film projector and prints to go with it, with a true 35 millimeter projector and films being the unobtanium of home entertainment. Television was another story, though. By 1975, more than 70 percent of households in the US had a color television. But unlike music, which could be heard for free through the radio or as desired when purchased on disc or tape, television was only a broadcast technology. The viewer of a television had no control over what was being shown. All you could control was what channel to tune into. Movies were often broadcast on TV too, with a generous amount of commercial breaks peppered in, but you still had no direct control over what to watch. You were limited to what was offered. But that was about to change. By 1975, the public had been teased many times about a videodisc system which would revolutionize the television experience. RCA had been developing their videodisc since 1964, and Phillips had demonstrated an early laserdisc prototype in 1969. These companies along with others were trying to adapt the familiar concept of a record player into a video player. And they werent shy about it. Youll be able to buy video records, with movies, cooking classes, and all sorts of new programming. Imagine, television when you want it! Keyword: Imagine. While this certainly was a neat idea, it likely didnt resonate with many people. To compel a consumer to purchase a videodisc player required you to convince them to buy into a new kind of media. Its not as simple as a new format, were talking about something foreign. Its an entirely different kind of content, all together! (In unison) Its an entirely different kind of content. No one had yet experienced what would come to be called home video. It simply wasnt a thing. The videodisc was a classic case of a solution in search of a problem. Which brings us to the second issue. It was too late. Though the concept had been around for more than a decade, it took until 1978 for it to be introduced, and it wasnt available nationwide for a couple of years. But three years before Discovision came onto the scene, we got our hands on a different technology which actually had a problem to solve. Unlike radio programming, television shows took up a large chunk of your time, and were far more immersive. They were also scheduled, occurring on a known channel at a known time. Generally, these shows were broadcast once a week, with over a dozen episodes produced in a year. The continuity, character development, and other serial aspects of the shows compelled the viewer to watch every week, and missing your favorite television program was a severe disappointment. If only there were a device that could keep that from happening Enter the videocassette recorder. In 1975, Sony released the Betamax system, and JVC followed with VHS a year later. Im not going to cover the format war between those two formats because I have already in previous videos, but at this stage in the timeline, the format war was irrelevant. And yes, there were earlier, unsuccessful systems, and I know about Video 2000, but the existence of a VCR of any kind is what matters. These machines promised to change how we watch TV. If you were gone, you could tape your favorite shows using a built-in timer. And if there were two shows you liked that were on at the same time, you could tape one and watch the other. The videocassette recorder had a problem to solve. And it was perfect for the way television programming worked. You knew when your show would be on thanks to the TV Guide, and there was an incentive to not miss any episode of your favorite shows. It sounds silly because TV is after all unimportant in the grand scheme of things, but the VCR was seen by many people as a potential way to free up their schedule. The act of recording a show to be watched later was called timeshifting, and that was what sold VCRs. If you had a VCR, it took the limitations of a format you were used to, thats television, and removed them. It solved a problem. Now, heres where many discussions on the failure of Laserdisc get hung up, Im looking at you Simon Whistler. When you look back to the beginning of the two formats, youll see that they were meant to be used completely differently. Take a look at early advertisements for these machines, and youll see that Laserdisc wasnt really ever competing with VHS or Betamax. This ad for this machine describes it as a turntable. A VIDEO turntable. And an excellent one at that, making pictures better than TV itself! But you have to buy your video records, and the ad from 1981 shows that there are a whopping 120 to choose from! Ah, thats so many! Look at an ad for any VCR in the late 70s or early 80s, and youll see it takes a different approach. This add for the RCA machines 4-hour brother talks about television shows you want to put on tape, and touts how easy it is to program it so you wont miss a thing. You dont find anything about pre recorded tapes you can buy. Thats because the VCRs of this time period essentially predated modern home video. The videocassette recorder wasnt being marketed as a device to play a pre-recorded tape. Content distribution of that kind wasnt a thing yet, in large part due to the high cost of producing video cassettes. Thats right, heres another thing in the saga on Laserdisc that gets overlooked. The idea behind videodiscs in general was that they could be mass-produced quickly and cheaply. Since they are stamped like vinyl records, with RCAs ill-fated CED system literally being a vinyl record, the discs could be made pretty easily. From an ad linked in the description, the original cost of Discovision titles was intended to be $5.95 or $9.95 for half-hour and hour long titles, respectively, with new feature films priced at $15.95. Adjusted for inflation that may seem pricey, but considering the price chart from Popular Mechanics shows the cheapest one-hour BLANK VHS tape --thats blank, with nothing on it-- going for $16.95, you get a sense of why the disc was considered better for content distribution. The tape used in videocassettes was a brand new, very specialized fine particle tape. It was expensive to produce well over 200 meters of the stuff for each cassette. And to mass produce pre-recorded video tapes in a meaningful quantity would require hundreds of separate videocassette recorders, each spending the entire runtime of the program being recorded to actually produce a duplicate tape. One machine could make dozens of laserdiscs per hour, whereas one video tape duplicator would take more than an hour per tape. And the laserdisc players were cheaper, too! That same chart shows the cheapest VCR costing $995. This magnavision player started at $699. And it doesnt seem as though that cost was subsidized by potential profit from selling discs, as Philips/Magnavox and Discovision were separate entities. So then, say youre a consumer in 1980 deciding between these two machines. The Magnavision is touted as having stereo sound and an incredible picture, and there are exciting interactive possibilities to go along with it. But theres not a lot of content you can watch. Youd save a few hundred dollars buying it, but once youve purchased 20 or so movies, youll have spent all that anyway. The long-term cost of ownership doesnt really add up. The VCR, though, is a somewhat mature technology. You know people who use them, and they love them! And while this machine is more expensive, and so are the tapes, you cant see yourself needing more than one tape. You still arent sure you need to save a TV program after youve seen it, after all thats not been possible before, so after youve watched the shows you missed that week, you can re-use the same tape. Who cares if its more expensive so long as its reusable? If you buy the Magnavision machine, how often will you really use it? Youd have to be buying a disc every day to get serious use out of it, and thatll get expensive fast. Sure the frame-by-frame and slow-motion features are a neat gimmick, and the possibilitiy of an art encyclopedia is kinda cool, but that will only occupy a few hours of time. Youre pretty sure youd get bored with it, and need to buy another disc. You know youd use the VCR at least once a week; M*A*S*H and Mork and Mindy are on at the same time, and youve always wanted to watch both. Plus, you can never stay up late enough to watch Johnny Carson. Maybe youll use it daily. Sure its kinda ugly and clunky, but who cares if it does its job? Do you really need the better picture of this machine? You only have a 19 inch television at home, who knows if you could even see the difference? And who really needs stereo sound for TV? Nothing on TVs in stereo anyway. And I doubt youll rearrange the living room just to have this machine play through your hi-fi. See the problem? A Laserdisc player was a technological marvel with some neat tricks up its sleeves, but its lengthy development time caused it to be released after videocassette recorders. If Laserdisc had been available, say, in 1970, I dont think it would have struggled like it did. Without the existence of a videocassette recorder, the idea of buying content to watch on your schedule might be more appealing. After all, youve been doing the same thing with music for decades, and there would be nothing else to allow you that sort of flexibility on your TV. But with the VCR already on the market, suddenly the Laserdisc has to convince buyers to forgo timeshifting capabilities for cheap-to-own movies. Which again, was an odd proposition to many consumers of the time, having never been able to own a movie before. The idea of owning movies was also a foreign idea to movie studios. They had never before needed to think about how to sell their content for mass home consumption. Laserdisc was trying to start an entirely new market category: that of home video. With MCA backing the Discovision format, their catalogue of content could easily be licensed. But Discovision would face challenges when trying to license other content. Movie studios were understandably reluctant to sell their catalogues of movies to a company like Discovision. Before home video, it wasnt uncommon for older movies to be released in theaters again. The movie studios were used to charging essentially per-view, and a home video solution goes entirely against that. The issue of licensing was further complicated in the disc realm by competing standards and confusing branding. With the development of their CED system, RCA was hard at work convincing movie studios that they should license their content to RCA. This might have limited the content available to Discovision if any exclusivity clauses were added to the contracts signed. It was also frustrating to consumers, as they didnt know which disc system would be better supported with content down the road. And even among Laserdisc players, Magnavox continued to refer to this as Magnavision, even though the discs you could buy were called Discovision and the format had been christened Laservision by this time. This fear and confusion probably kept a good number of videodisc players on store shelves. Thus began a chicken-and-egg problem. Buying a laserdisc player in the early years meant buying into a system with limited content. This kept sales low. Which meant there werent a lot of people with players. Which meant the movie studios couldnt make much money selling discs. Which meant there wasnt much content, which kept the sales of players low, and the cycle continued. But videocassette recorders didnt have that problem in the slightest. Going back to our ad, youll remember that pre-recorded content isnt mentioned at all. Thats because, this wasnt their primary purpose. Time-shifting was what you did with a VCR. It didnt have anything to do with buying a movie to watch over and over again. Who would want that? But plenty of people would want to record their TV shows while they werent at home. That was an idea you could get behind. As more and more people purchased a VCR, suddenly there was a large installed base of devices that could play a pre-recorded tape. And now there was a place for home video. Tapes needed to get cheaper to manufacture, and duplication facilities needed to mature. But once those things happened, it became easier for movie studios to get behind the idea of selling their movies for watching at home. Especially their older and classic films which wouldnt make too much money with a new screening, but might turn a decent profit on home video. Now that home video was an established business, buying a laserdisc player made even less sense to the average consumer. What was the point of buying another machine when I already have a VCR, now that the big movie studios are all releasing their movies on VHS and Beta? And to be honest, Laserdisc was an inconvenient format. Pretty much every single movie is longer than an hour, so youre guaranteed to have to flip the disc over. And if you push into 2 hours, youll need another disc. VHS and Beta were largely immune to this, though very long titles would push onto a second cassette. And then there was the rental market. Videocassettes may have cost more to make than laserdiscs, but many people werent buying them, they were renting them. A rental store owner would make the cost of the tape back many times over, so the high cost of the purchase wasnt that impactful. And cassettes made more sense for rental, as their design is inherently less fragile. The tape does wear out over time which Laserdisc was (at least they thought) immune to --it wasnt!-- but any surface scratches on the surface of a Laserdisc would immediately harm the image quality. And the smaller, chunky nature of a videocassette was easier to transport than the flat, large size of the laserdisc. As years passed, the videocassette received the benefits of economies of scale much more than Laserdisc did. Though it should be noted that the price disparity between laserdisc and tapes continued for some time. Theres a clip on YouTube of Siskel and Ebert and the Movies, and in it they discuss how the film Running on Empty, released in theaters in 1988-- \"that came out at 89.95 on tape, but 24.98 on disc\" --But they also noted that at this time, movie studios were beginning to sell cheap tapes. Paramount had been releasing some films on tape for $14.95 with some bargain tapes going for $9.95. The trend of tapes continuing to get cheaper would go on, and Laserdiscs wouldnt get to join in on that. At this point, it might seem that Laserdisc would be doomed. Being beaten to market by a device which could record really hurt its chances, and once the movie studios had started offering their content on VHS and Beta, buying a second device just for watching movies didnt make tons of sense. But Laserdisc didnt die. It clinged to life until 2000, co-existing with DVD for 4 years. It was the collectors market, and to a lesser extent the education market, that saved them from a complete death. Those who bought Laserdisc from the mid 1980s onward largely did so for reasons of quality and exclusive content. In the next video, well look at how Laserdisc evolved over the years into the pinnacle of home entertainment, and well also look more closely at the features--and follies--of the format itself. Thanks for watching. If this is your first time coming across the channel, please consider subscribing. This channel is made possible by supporters on Patreon. Patrons of the channel are what keeps these videos coming, and each of you deserves thanks. If youre interested in supporting the channel as well, please check out my Patreon page through the link on your screen, or down below in the description. Thanks for your consideration, and Ill see you next time! ...ability to record. I began the previous video with (in a quick, snarky, nasal voice) A product with an unknown purpose that was both a few years too late and way too far ahead of its time",
    "transcript_keywords": [
        "Laserdisc",
        "video",
        "home video",
        "tape",
        "home",
        "content",
        "laserdisc player",
        "movie studios",
        "time",
        "VCR",
        "Movies",
        "movie",
        "shows",
        "Television",
        "laserdiscs",
        "Discovision",
        "tapes",
        "record",
        "watch",
        "disc"
    ],
    "transcript_entity_values": [
        "dozens",
        "2 hours",
        "1988",
        "YouTube of Siskel",
        "a couple of years",
        "14.95",
        "24.98",
        "laserdiscs per hour",
        "North America",
        "12 inch",
        "the early years",
        "Running on Empty",
        "two",
        "Laserdisc",
        "CED",
        "more than a decade",
        "Laserdisc",
        "one",
        "4 years",
        "Mork",
        "three years",
        "Mindy",
        "a year",
        "nearly a century",
        "15.95",
        "the mid 1980s",
        "the mid 1970s",
        "more than 70 percent",
        "only three minutes",
        "BLANK VHS",
        "Sony",
        "years",
        "Laservision",
        "more than one",
        "Ebert",
        "Phillips",
        "a few hundred dollars",
        "RCA",
        "Japan",
        "Philips/Magnavox",
        "995",
        "VHS",
        "first",
        "1964",
        "2000",
        "Asia",
        "200 meters",
        "20 or so",
        "19 inch",
        "4-hour",
        "9.95",
        "Only 10%",
        "Johnny Carson",
        "MCA",
        "a year later",
        "JVC",
        "every day",
        "the late 70s or early 80s",
        "over a dozen",
        "decades",
        "hundreds",
        "Patreon",
        "today",
        "89.95",
        "one-hour",
        "Laserdisc",
        "Magnavision",
        "1975",
        "more than an hour",
        "16 millimeter",
        "that week",
        "1969",
        "the end of the 1970s",
        "1978",
        "699",
        "1970",
        "Popular Mechanics",
        "the years",
        "every week",
        "afternoon",
        "35 millimeter",
        "daily",
        "5.95",
        "1980",
        "Europe",
        "Betamax",
        "1981",
        "Laserdiscs",
        "Japanese",
        "US",
        "a few years",
        "half-hour",
        "a few hours",
        "Magnavox",
        "Paramount",
        "2 percent",
        "One",
        "16.95",
        "an hour",
        "Discovision",
        "120",
        "second",
        "longer than an hour",
        "VIDEO",
        "Simon Whistler",
        "the day"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL",
        "TIME",
        "LOC",
        "QUANTITY",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "PERCENT",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "MONEY",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "MONEY",
        "DATE",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "GPE",
        "DATE",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "DATE"
    ],
    "vector": [
        -0.08112828433513641,
        -0.15417669713497162,
        -0.00939591322094202,
        -0.039237264543771744,
        -0.034825511276721954,
        -0.052512768656015396,
        -0.035997424274683,
        -0.00830448791384697,
        -0.07616247236728668,
        -0.02606060542166233,
        -0.017902838066220284,
        0.04610287770628929,
        -0.03450737148523331,
        -0.006016467232257128,
        -0.06308935582637787,
        -0.043176598846912384,
        -0.00012807284656446427,
        -0.0953737124800682,
        -0.010560447350144386,
        0.02491770312190056,
        -0.05893344432115555,
        -0.006029852665960789,
        -0.01464059203863144,
        0.05194196477532387,
        -0.050037700682878494,
        0.004089375492185354,
        -0.021660123020410538,
        -0.030561422929167747,
        -0.03455866500735283,
        -0.004298986401408911,
        0.06677880138158798,
        0.0648839920759201,
        -0.049142204225063324,
        0.010227134451270103,
        0.04816499352455139,
        -0.0701667070388794,
        0.029954588040709496,
        -0.04333212971687317,
        -0.055411774665117264,
        -0.019241562113165855,
        0.03858523815870285,
        -0.08352145552635193,
        0.01703573390841484,
        0.05761640518903732,
        -0.07601643353700638,
        -0.03756917640566826,
        -0.010940296575427055,
        -0.14803427457809448,
        -0.024547336623072624,
        0.012001748196780682,
        -0.0693492516875267,
        0.011626523919403553,
        0.047976233065128326,
        -0.00694723054766655,
        -0.04307712987065315,
        -0.0399593859910965,
        0.05970359966158867,
        0.054626379162073135,
        0.0672469511628151,
        0.02527400106191635,
        0.05810580775141716,
        -0.047576144337654114,
        -0.09518000483512878,
        0.0065706344321370125,
        0.05509890615940094,
        0.005328172817826271,
        0.03125568479299545,
        -0.012661895714700222,
        0.003457601647824049,
        -0.006369240116328001,
        -0.042595669627189636,
        0.07137030363082886,
        0.012821443378925323,
        0.015096889808773994,
        0.10378635674715042,
        -0.03124321438372135,
        0.027879947796463966,
        0.013229073956608772,
        0.028810592368245125,
        -0.030785461887717247,
        0.10863557457923889,
        -0.03214465454220772,
        -0.04655171185731888,
        0.03656807914376259,
        -0.05068075656890869,
        0.004075684119015932,
        -0.007307994645088911,
        -0.019013334065675735,
        -0.01622871682047844,
        -0.02098323218524456,
        -0.03660328686237335,
        0.0557708740234375,
        0.0337163470685482,
        -0.06455940008163452,
        -0.016607806086540222,
        0.009580662474036217,
        0.016347136348485947,
        -0.09317149221897125,
        -0.01824137754738331,
        0.027420779690146446,
        -0.020755400881171227,
        0.023781606927514076,
        0.013931680470705032,
        -0.049433633685112,
        -0.13043154776096344,
        -0.07859918475151062,
        -0.00050967070274055,
        0.07336010783910751,
        -0.011740178801119328,
        0.04876921325922012,
        0.005071581806987524,
        0.026316111907362938,
        -0.04189314320683479,
        -0.02628648467361927,
        0.03156905248761177,
        0.013066575862467289,
        -0.009870008565485477,
        0.04920697212219238,
        -0.004299665801227093,
        -0.033920492976903915,
        -0.04058609530329704,
        -0.028757736086845398,
        0.007745327427983284,
        0.0012889185454696417,
        0.06220714747905731,
        -0.034459345042705536,
        0.027111615985631943,
        4.001115712576239e-33,
        0.050693634897470474,
        0.03960662707686424,
        -0.01383189857006073,
        -0.012917154468595982,
        0.0009789677569642663,
        -0.0012702764943242073,
        -0.0169347133487463,
        0.018731337040662766,
        -0.04863322526216507,
        -0.05723493546247482,
        0.07663621008396149,
        -0.01904108002781868,
        -0.0717296302318573,
        -0.0061600967310369015,
        0.005031804088503122,
        -0.0275126863270998,
        -0.08797840029001236,
        0.015739379450678825,
        -0.09424219280481339,
        0.02760063111782074,
        0.013497864827513695,
        0.03933440521359444,
        0.05279608815908432,
        0.020859353244304657,
        -0.054799776524305344,
        0.07546036690473557,
        -0.04581623151898384,
        0.02882012538611889,
        0.11398834735155106,
        0.03255700320005417,
        -0.04772289842367172,
        0.0805605947971344,
        0.007566170766949654,
        -0.06605643033981323,
        0.12449739128351212,
        0.0658017247915268,
        -0.022669125348329544,
        -0.04990280419588089,
        -0.014464800246059895,
        -0.004792746156454086,
        0.01463666558265686,
        0.02662684954702854,
        0.036142900586128235,
        -0.04762722924351692,
        -0.007143048103898764,
        -0.0528709776699543,
        0.03313599154353142,
        0.028238406404852867,
        -0.032541047781705856,
        0.03925751894712448,
        -0.04976780340075493,
        0.060361940413713455,
        -0.08465326577425003,
        -0.005850865505635738,
        0.05557502061128616,
        0.015162506140768528,
        0.029779408127069473,
        -0.002673245267942548,
        0.02385646291077137,
        -0.00937647745013237,
        0.11975091695785522,
        0.04015102609992027,
        0.06041479855775833,
        -0.037632815539836884,
        -0.0825670138001442,
        0.01964041031897068,
        0.0064434390515089035,
        -0.01203997153788805,
        0.011297238990664482,
        0.03330836072564125,
        -0.07113950699567795,
        -0.03321826085448265,
        0.018123768270015717,
        -0.1279904544353485,
        0.11174634099006653,
        -0.0009291763417422771,
        -0.04695617035031319,
        0.055798307061195374,
        -0.00821361318230629,
        0.02607935108244419,
        -0.04369422793388367,
        -0.07570399343967438,
        -0.027590345591306686,
        -0.02140629105269909,
        -0.005516490899026394,
        -0.028003860265016556,
        0.0022444536443799734,
        0.06195647269487381,
        -0.09338411688804626,
        -0.013414805755019188,
        0.009321662597358227,
        -0.06630310416221619,
        0.03360342979431152,
        0.04452023655176163,
        0.03121144510805607,
        -5.613962654855544e-33,
        -0.02466633729636669,
        -0.015282618813216686,
        0.02274094894528389,
        0.010932200588285923,
        -0.008589223958551884,
        -0.060425497591495514,
        0.008596993051469326,
        0.02989259362220764,
        0.05480578541755676,
        -0.013520656153559685,
        -0.0011544200824573636,
        0.023846665397286415,
        -0.08345542103052139,
        -0.042580749839544296,
        -0.11525470018386841,
        -0.06621555984020233,
        -0.008071916177868843,
        -0.028725693002343178,
        0.04441634938120842,
        -0.012106282636523247,
        0.09926807135343552,
        0.07956655323505402,
        -0.06256259977817535,
        0.041568342596292496,
        0.0168798565864563,
        0.01868176832795143,
        0.05344618484377861,
        0.038618627935647964,
        0.0056088510900735855,
        -0.031862497329711914,
        0.03021693043410778,
        -0.01709531806409359,
        -0.025403954088687897,
        0.005528481677174568,
        -0.0019772204104810953,
        0.031008103862404823,
        0.08211307227611542,
        0.039327241480350494,
        -0.10645616799592972,
        -0.13877008855342865,
        0.04282528907060623,
        0.015131744556128979,
        -0.09399212151765823,
        -0.037006109952926636,
        0.002986344275996089,
        -0.05450540408492088,
        -0.03622453287243843,
        0.027537107467651367,
        -0.019020993262529373,
        0.0926642194390297,
        -0.008845658972859383,
        0.025102341547608376,
        0.02391374669969082,
        -0.03701819106936455,
        0.018203051760792732,
        0.016250086948275566,
        0.02908569946885109,
        0.048773232847452164,
        0.0407438799738884,
        0.061105962842702866,
        -0.09190399944782257,
        0.03756478428840637,
        0.014839637093245983,
        -0.006974814925342798,
        0.037333302199840546,
        0.026236573234200478,
        0.0896168127655983,
        0.09957285225391388,
        0.011569198220968246,
        -0.0068383836187422276,
        0.008119146339595318,
        0.04985368624329567,
        0.018677514046430588,
        -0.036213237792253494,
        0.01842484250664711,
        0.03756565600633621,
        -0.07645361870527267,
        0.01021185889840126,
        -0.05056850612163544,
        0.07368242740631104,
        -0.05521369352936745,
        -0.04377032443881035,
        -0.0004040721687488258,
        0.0987287238240242,
        0.11719702184200287,
        0.06765104830265045,
        0.09812268614768982,
        -0.037519361823797226,
        -0.08200002461671829,
        -0.049447834491729736,
        0.025907428935170174,
        0.015831636264920235,
        0.0449620857834816,
        0.03238855302333832,
        0.06529972702264786,
        -5.734380081889867e-08,
        -0.07013736665248871,
        0.030480127781629562,
        -0.05997684225440025,
        -0.0002677802985999733,
        0.09490634500980377,
        -0.10474997758865356,
        0.0659419521689415,
        0.09871987253427505,
        -0.09101052582263947,
        0.0007696070824749768,
        0.012939351610839367,
        -0.01890050619840622,
        0.011985184624791145,
        0.07003727555274963,
        0.09610068798065186,
        0.013321904465556145,
        0.024231594055891037,
        0.04376646876335144,
        -0.09815814346075058,
        -0.006144544575363398,
        0.014269034378230572,
        -0.06220482662320137,
        0.12694348394870758,
        -0.031092306599020958,
        -0.06401490420103073,
        0.022949328646063805,
        0.01686573214828968,
        0.01506428699940443,
        -0.04225471243262291,
        -0.008341227658092976,
        -0.004138405900448561,
        -0.05051743984222412,
        -0.04025154560804367,
        -0.03182738274335861,
        0.008773839101195335,
        -0.07717924565076828,
        -0.020548254251480103,
        0.013593376614153385,
        0.03632637858390808,
        0.05007690191268921,
        -0.022191505879163742,
        0.10565763711929321,
        -0.02476726658642292,
        0.07021381705999374,
        0.038495972752571106,
        0.09080593287944794,
        -0.09679260849952698,
        -0.005634611938148737,
        -0.04467994347214699,
        0.0842813029885292,
        -0.005336508620530367,
        0.0464007742702961,
        -0.06307153403759003,
        -0.040193360298871994,
        0.040241584181785583,
        0.022250276058912277,
        0.03413155674934387,
        0.03586507961153984,
        -0.058419134467840195,
        0.09280672669410706,
        0.061104170978069305,
        -0.0007572754402644932,
        -0.01091661024838686,
        0.09633597731590271
    ]
}