{
    "id": "tES9EAl5_yE",
    "title": "Testing an Android Watch!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-09T18:25:07Z",
    "video_url": "https://www.youtube.com/watch?v=tES9EAl5_yE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "android",
        "michael kors",
        "sophie",
        "watch",
        "review",
        "travel",
        "vlog",
        "grand canyon",
        "technology",
        "fashion",
        "accessory",
        "timepiece",
        "rosegold",
        "tech",
        "lifestyle",
        "band",
        "customize",
        "MK"
    ],
    "views": 795619,
    "likes": 15625,
    "comments_count": 1750,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys! I am so excited because me and my sister are heading to the Grand Canyon and I've never been to the Grand Canyon before, I've always wanted to go, we've talked about going for years, ever since I first moved to California. The Grand Canyon has been on our to-do list. Well today is the day before so I've gotta go do some prepping, a little bit of shopping, because it's apparently very, very, very very, very cold at the Grand Canyon right now and that is something that we were not expecting. Probably should have checked the weather before we booked this trip, but this is the only time that we could go so we kind of crammed all of these things in, in basically two days. One thing that I'm doing right now in preparation for my trip, this is actually really exciting, because I have always been a huge Michael Kors fan, watches, purses, all of those camo purses that I have that you guys have seen me use over the past years, all Michael Kors. Most of the watches that I wore prior to the Apple watch, Michael Kors. And I've been really interested in testing out their smartwatches. So I've got one right here that I just got was so excited that I set it up and I didn't even film it, and now I'm thinking, \"Shoot! I should of showed you guys the set-up process\", because it was super simple. I've really never tried any of the Android watches before and what better way to do it, than celebrating my first Android watch, than with a Michael Kors watch. But it's a little bit big, so I'm going to head down to the nearest Michael Kors store to get this thing sized before I head off on my trip. Okay Google, where's the nearest Micheal Kors store? I gotta go get this things sized. This is one of the new rose gold Sophie watches and I'm a huge rose gold fan, as you guys know from all of my videos. Plus this beautiful matching case, oh my goodness. One of the other things that I do like is you can also customize it using Instagram or Facebook, or any of the photos that you already have or your friends send you, you can set them as your watch faces. A common misconception with smartwatches, especially Android ones, is it's not gonna work with your iPhone, well, that's not true. This is the Android Wear app and this allows you to connect to your watch to use this to set it up, customize watch faces, you can also customize all the watch faces and stuff on your watch as well, you don't need your phone. So in here, I'm going to go to my Instagram, it's either me and Ro or Matty man. You can choose from digital or analog. Yes, set it as my background. And there he is, little Matty on my watch. Okay Google, set an alarm for 5 AM tomorrow morning. Oh, that's not fun. I know I can probably size this myself, but I'm not because I'm also wanting dinner. And there is dinner right next to the Michael Kors store. I love that this is a little touchscreen too. You guys want a fish. Let's go get this thing sized. So I made it down to 3rd street to Michael Kors. - [Store Employee] Hi how are you? - Hi, good, I just need to get this watch sized. Okay we're inside and she just took my watch and she's sizing it up for me. So maybe I'll do a little bit of shopping first, while I wait. Rose Gold. Rose Gold. Mmmmmm. Oh wow these are cool. - [Store Employee] How is that? Ooh, it's still a little big. - Yes, shoot. What do you think? I have very tiny wrists. Yes, its beautiful and it fits perfect! All sized up and ready. Okay Google, what time is my alarm set for tomorrow morning? (alarm clock) Oh my gosh, this is too early. No, I can't do that right now. Guys I don't wanna wake up yet. Oh my, oh what a mess. Well I'm definitely not awake, that's for sure. Well I'm gonna pack and stop vlogging so that I can actually be ready on time so Jenna won't yell at me. See ya soon. Sorry I'm late. - That's alright. - You expected it. - Yeah ... - Okay it is, what time is it, oh my gosh- - Doesn't matter- go get the coffee, - It's 8:28- - I'm illegally parked! - Okay I'll go get the coffee. - Hurry, hurry! - What else did we get? What's everything we got? - Two spinach wraps, your sandwich, and egg white bites. - Okay. Alright, oh boy. - Be there in seven and half hours, ish, maybe. - Okay Google, get directions to the Grand Canyon. So its 9:45, Jenna hasn't got pulled over yet, so that's really a plus. Thanks Jen. - Well we have six hours, still so. - Six hours still. When did-what-really!? - Well what do you- - well what - Wow! - do you think we're doing? - I've already have a yerba mate, a coffee, half a bottle of water, and it's not even 10 AM and I haven't peed ... in a long time so its probably gonna, wow, I don't know, I'm good so far. - I give it 10 minutes. - 10 minutes? - Yeah, until your bladders like \"I gotta go to the bathroom!\" - Now that I'm thinking about it, oh no! - Stop thinking about it! - Ah! So it's 10:24, how many more miles until you run out of gas? - 137, but we have like 350 to our destination, so ... - You're also coming upon something here that may look like a dust storm. No, that's not a cloud. Look at that- - Yeah - Look over there. - I'm looking at the road Justine. - Is this a dust storm? - Its just developing. - Its developing, its windy, Jenna let us know that its windy. - Its very windy. - Still haven't peed yet. Look at that! Look at what we're coming up upon! Do you remember that movie Tremors? - No. - Oh. - What's it about? - Its about- (laughing) how do I explain this? Its about- - Tell me about it. - Its about a big worm ... - Huh? - A big worm and they go under the ground and they come up. - Oh did you ever see the movie The Hills Have Eyes? - No. - (laughs) - You haven't seem Tremors, don't talk to me. - That's how they get ya, they're under the ground. (screaming) (screaming) - Why is this such a bouncy ride? Like my cameras bouncing around. - Well I don't know! - Look at the dust! - Why is your brain so bouncy? (laughing) - I didn't sleep last night. How will we survive, good thing I brought the first aid kit. - We have so many snacks and so many things of water and like a blanket, that if we have to survive, we can probably survive for at least five hours. - First stop. The first pee. The first- never mind I'm not going to sing that song. - No - That's just something I don't wanna sing. Well look at that huge sign that says gas! - Or does it say Saab. You're blind (indistinct) - Uh, no. This looks like the tree oasis that we saw in Joshua Tree. - It does, yeah, I was thinking that too. - [GPS] Head south towards county route 66. - Oh there's flamingos over there and like a pond. We need to investigate this area- - Yeah, go pee, investigate. - after we pee. Its a lot colder than I thought it was going to be. Wow I'm chilly! There's a dog standing right in the middle of the parking lot. What are you doing bud? Keep dog on leash. Snacks, suitcases, the time is 11:36, we've made our first stop. Look at all the snacks! Do you want a soda? Even the music is excellent here! - Gas is six dollars a gallon here! - We need- really!? - I'm shook! - Look at this, this will unshake you. - I like it, do you think we should get one for the car? Ow! - There's more stuff over here! Yellow sweatshirt. Hey there's a sale on yellow sweatshirts. Wine to go Jen. - I know, I'm driving, but ... - I've been really into ginger ale lately, usually I drink it in the car, 'cause I get carsick, but I'm feeling pretty good right now. I think I'm gonna get a snack too. I'm getting a Nutter Butter. - [Jenna] What do you want to investigate? - I just gotta go see this pond over here! Man, it is super chilly. I can't believe it! I met some random viewers in this gas station, so hello girls, it was lovely to meet you. Now I'm going to investigate this pond. Look at this, this is so cool! Yeah, I think that's it. Oh, gosh, wow, okay. That is snow, its pretty cold. What's the temperature Jen? - 34 and dropping. - I'm getting very tired and I'm not even driving. I'm like not doing anything except eating. Sellegman! - Selleg- maybe the g is silent? - We are a hundred and some miles from the Grand Canyon. - Oh! There's free coffee here. Where are we? I'm not sure, there's a lot of stuff going on, there's really cool old cars, little vintage looks. That sign definitely said free coffee, I think it have just been like a sign, but not actually a sign that is true. Now what do we do. Oh ... Women ... (mumbles) - That's how I came in. - I was like, we gotta go to the next one. Why is the, the one where, go, go, go! Snow! It is very chilly. Historic, route, sixty- Jenna you're gonna get pulled over! - I can outrun that one. I mean I would never- - Hi kitty! Is this open? This is not open. - I don't think so, I don't know, I'm cold. - Okay well the stores not open. I guess let's get in the car. We now officially have snow. Uh, there's snow. We have snow. There's snow. It's official. - Wasn't official before. - All I've got to say. - I have a feature on my car, if I press it over it will put it into snow, gravel, and uh, some other mode. - Two days. Three people. We got a lot of stuff. Good girl Jenna drove the whole way! - Time for sleep. - What room are we? Please let me in. Glorious! What was the total hours Jen? Like eight hours or so? - [Friend] I think it was not eight hours. - Yeah, around eight hours, that's with three stops. - You drove the whole time. - Yeah I got real sleepy. - We just took naps and now we're gonna head to dinner and then we're gonna go to bed. Okay Google, what is the weather in the Grand Canyon. (gasp) 19 degrees! - Tomorrow, oh tomorrow low of three, today low of seven. - (gasp) We're gonna get dinner now, so let's go, let's go eat. I just brushed my hair, so it looks really fantastic, if you were wondering. Why do I look like a mess? I'm tired. Oh, no! Come here little guy! I think I'll take the small guy to dinner. We've decided that we're gonna have dinner here at the arcade. They're playing Foo Fighters, they've got some of my, well, can't really say that's one of my favorite games, there's really not a good game selection, but they have Stacker. No! Beautiful! - [Restaurant Worker] There you go. - [Justine] Thank you! - [Jenna] Oh, thank you! - [Restaurant Worker] You guys enjoy! I don't know if you guys have ever been to Chuck 'E Cheese, but this looks like Chuck 'E Cheese pizza and it looks- - [Jenna] So beautiful! - [Justine] So I'm prepping the gear. - [Jenna] You're just showing your feet! They're gross! - We can wear this over top of these over top of yoga pants. So we've got these fleece pants, its very cold out guys, like its so super cold. - [Jenna] Those are tight fleece. - Okay let me try these on to see if these will go on my body. - [Jenna] You can't put two pair of pants on. - Don't tell me what I can and cannot do. - [Jenna] You- - Oh what? - [Jenna] You can't, I'm telling you. - Oh boy! This is so tight! This fits because I got these extra big. So I've got three pairs of pants on, I got this jacket in Iceland. - [Jenna] You're going to be so cold, you're gonna freeze. - Here we go. And then I'll put this over top of my head. So, really, we're ready for tomorrow. The mule adventure- I can't hear anything. I have so many layers. We'll see you on the mules tomorrow! You ready? - Yes I must rest. - Oh, I'm breathing heavy. (laughing) - [Jenna] You can't wear all that. - I'm puffy!",
    "transcript_keywords": [
        "Michael Kors",
        "Grand Canyon",
        "Michael Kors store",
        "Michael Kors watch",
        "Kors",
        "huge Michael Kors",
        "Michael",
        "Michael Kors fan",
        "watch",
        "nearest Michael Kors",
        "Grand",
        "Kors store",
        "Canyon",
        "guys",
        "Yeah",
        "time",
        "Google",
        "hours",
        "Kors watch",
        "Micheal Kors store"
    ],
    "transcript_entity_values": [
        "around eight hours",
        "Joshua Tree",
        "Sellegman",
        "Matty",
        "Tomorrow",
        "10 minutes",
        "Foo Fighters",
        "one",
        "10 AM",
        "a hundred",
        "Stacker",
        "eight hours",
        "the past years",
        "Apple",
        "10:24",
        "137",
        "Justine",
        "Chuck",
        "Ro",
        "Two",
        "9:45",
        "Instagram",
        "iPhone",
        "years",
        "Sophie",
        "the Android Wear",
        "Micheal Kors",
        "Six hours",
        "Michael Kors",
        "Saab",
        "Snow",
        "three",
        "morning",
        "the day before",
        "Two days",
        "seven and half hours",
        "Google",
        "six hours",
        "66",
        "half",
        "19 degrees",
        "Jen",
        "a Nutter Butter",
        "at least five hours",
        "5 AM tomorrow morning",
        "today",
        "Rose Gold",
        "California",
        "the Grand Canyon",
        "Three",
        "seven",
        "two",
        "Shoot",
        "Facebook",
        "The Grand Canyon",
        "Android",
        "six dollars",
        "The Hills Have Eyes",
        "first",
        "tomorrow",
        "last night",
        "Like eight hours",
        "Iceland",
        "Jenna",
        "11:36",
        "two days",
        "3rd",
        "like 350",
        "One"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "GPE",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "LOC",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "ORDINAL",
        "DATE",
        "TIME",
        "TIME",
        "GPE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.0336812287569046,
        -0.07552076131105423,
        -0.043670956045389175,
        -0.1297903060913086,
        0.021235421299934387,
        0.03209330886602402,
        0.0387343093752861,
        0.028331074863672256,
        0.0056226663291454315,
        0.045758944004774094,
        0.0020950338803231716,
        -0.016312144696712494,
        -0.007210317999124527,
        0.0031157806515693665,
        -0.023582128807902336,
        -0.006311582867056131,
        0.05888109281659126,
        -0.035301972180604935,
        -0.0075432960875332355,
        0.06216644123196602,
        -0.009508642368018627,
        -0.08332226425409317,
        0.06309883296489716,
        0.022087158635258675,
        -0.01627761498093605,
        0.047997090965509415,
        0.00928077008575201,
        0.02593659795820713,
        -0.06949662417173386,
        -0.04474544897675514,
        -0.01326593104749918,
        0.020459890365600586,
        0.09973590821027756,
        0.011885667219758034,
        -0.0028397368732839823,
        -0.06365174800157547,
        0.02611573599278927,
        -0.010606740601360798,
        -0.0501851923763752,
        -0.023131899535655975,
        0.02064700424671173,
        -0.03352641314268112,
        0.026197604835033417,
        -0.013969101943075657,
        -0.06972234696149826,
        -0.07488178461790085,
        0.021411607041954994,
        -0.031733330339193344,
        0.02730088122189045,
        0.06701069325208664,
        -0.10500927269458771,
        0.009132041595876217,
        0.03637085109949112,
        -0.014231556095182896,
        -0.09661450237035751,
        -0.00616363575682044,
        -0.07843297719955444,
        0.02627965807914734,
        0.051648370921611786,
        -0.05317723751068115,
        0.043324392288923264,
        -0.05433680862188339,
        -0.030466388911008835,
        0.07657589018344879,
        -0.08598391711711884,
        -0.031445037573575974,
        0.032122474163770676,
        0.0037466716021299362,
        0.02835676446557045,
        -0.02353823557496071,
        -0.12555555999279022,
        0.0742480456829071,
        -0.004731977358460426,
        0.018062446266412735,
        -0.013141521252691746,
        0.06581270694732666,
        0.039534371346235275,
        -0.07480163872241974,
        -0.015675639733672142,
        0.01124259177595377,
        -0.02284797467291355,
        -0.08230021595954895,
        -0.09954187273979187,
        0.01668739505112171,
        0.047237444669008255,
        0.038069359958171844,
        0.05286553502082825,
        0.01078064925968647,
        -0.026361655443906784,
        -0.06399581581354141,
        -0.04963984340429306,
        0.017619896680116653,
        -0.03978530690073967,
        -0.028069913387298584,
        -0.011422203853726387,
        0.005610049236565828,
        -0.0338008888065815,
        -0.012052035890519619,
        -0.040952399373054504,
        0.06575044989585876,
        0.054380156099796295,
        -0.038968607783317566,
        -0.00830791424959898,
        -0.005731475073844194,
        -0.03139648959040642,
        -0.12679652869701385,
        -0.03921496868133545,
        0.02593151107430458,
        0.021597014740109444,
        0.05888586491346359,
        -0.02891724742949009,
        0.04761986806988716,
        -0.04425297677516937,
        -0.037001147866249084,
        0.01323837973177433,
        0.146145299077034,
        -0.06624877452850342,
        0.07142426818609238,
        0.03431015834212303,
        0.06519865989685059,
        0.02408747747540474,
        -0.07725091278553009,
        -0.03349645435810089,
        0.02087424509227276,
        0.03210993856191635,
        0.04358864203095436,
        -0.05539314076304436,
        1.2374495152663454e-32,
        -0.0014235684648156166,
        0.031159888952970505,
        0.03699268773198128,
        0.04879460111260414,
        -0.054190561175346375,
        -0.022306114435195923,
        -0.03594103083014488,
        0.11694519966840744,
        -0.0030025416053831577,
        0.02437756583094597,
        0.02661275677382946,
        0.03702392801642418,
        -0.04236876219511032,
        0.05402235686779022,
        0.05044059455394745,
        -0.025964977219700813,
        -0.021756445989012718,
        -0.06665075570344925,
        -0.050301868468523026,
        -0.002561356872320175,
        -0.010845521464943886,
        -0.058888670057058334,
        0.0004134554765187204,
        0.044772759079933167,
        0.06097612902522087,
        0.08106625825166702,
        0.0726046934723854,
        0.028638828545808792,
        0.08037027716636658,
        0.018630843609571457,
        -0.027594933286309242,
        -0.10734829306602478,
        -0.010716073215007782,
        -0.06528410315513611,
        -0.02747262455523014,
        -0.010703254491090775,
        -0.07617756724357605,
        0.01782957650721073,
        -0.023662468418478966,
        -0.04482292756438255,
        -0.05928141251206398,
        0.004342017695307732,
        -0.05678851157426834,
        -0.08879315108060837,
        0.061930254101753235,
        0.008873555809259415,
        0.0721137523651123,
        0.08474370092153549,
        -0.04101865366101265,
        0.019961614161729813,
        0.007304553408175707,
        -0.011131423525512218,
        -0.038767844438552856,
        -0.04843869432806969,
        -0.023548973724246025,
        -0.04576471447944641,
        -0.02300601452589035,
        0.05302641913294792,
        0.006002605427056551,
        0.05196318030357361,
        0.002809281926602125,
        -0.009758545085787773,
        0.022031402215361595,
        0.010626127943396568,
        -0.05497787520289421,
        0.09776850044727325,
        0.07866060733795166,
        -0.0695660412311554,
        0.03550396114587784,
        0.05343439429998398,
        0.001221582293510437,
        -0.015830162912607193,
        0.05675056204199791,
        0.02993866056203842,
        0.029132459312677383,
        0.06579826027154922,
        -0.056358128786087036,
        -0.05291924625635147,
        0.02943786047399044,
        -0.03882372006773949,
        -0.09367310255765915,
        0.03444922715425491,
        0.02625867910683155,
        0.09446083009243011,
        -0.06879216432571411,
        -0.05922819674015045,
        -0.0009714299812912941,
        -0.07009191811084747,
        -0.024733999744057655,
        -0.0316285640001297,
        0.018137741833925247,
        0.07672528922557831,
        -0.04509342089295387,
        -0.0595083087682724,
        -0.03202509135007858,
        -1.2342467339707363e-32,
        -0.012437645345926285,
        0.01589394360780716,
        0.027868522331118584,
        -0.06703069806098938,
        0.06577231734991074,
        -0.04796554520726204,
        0.024881774559617043,
        0.07299548387527466,
        0.06730280071496964,
        -0.04818095266819,
        0.042967431247234344,
        -0.10502563416957855,
        -0.12643426656723022,
        0.02041536383330822,
        -0.031215744093060493,
        -0.025034567341208458,
        -0.0028160512447357178,
        -0.05552162975072861,
        0.07109717279672623,
        -0.04951827600598335,
        0.0602438785135746,
        0.13905887305736542,
        0.12581804394721985,
        0.012740644626319408,
        0.04632670059800148,
        0.0007217978709377348,
        0.028538675978779793,
        0.04509609565138817,
        0.044350747019052505,
        -0.002113504335284233,
        0.0069338977336883545,
        -0.0453430637717247,
        -0.032702598720788956,
        0.03269486501812935,
        0.04673617705702782,
        0.043287113308906555,
        0.04293692484498024,
        0.009590193629264832,
        0.01797180064022541,
        -0.062166810035705566,
        0.039095133543014526,
        0.028275540098547935,
        0.05280478298664093,
        -0.01694204844534397,
        0.029623176902532578,
        -0.11872735619544983,
        -0.057888589799404144,
        0.06887323409318924,
        -0.018750935792922974,
        -0.018038220703601837,
        -0.061605364084243774,
        -0.03742046654224396,
        -0.011254663579165936,
        -0.050972700119018555,
        -0.02820243313908577,
        0.0385308600962162,
        -0.04843232408165932,
        -0.026180684566497803,
        0.040484294295310974,
        -0.027534130960702896,
        0.04379785805940628,
        -0.05251346528530121,
        -0.09404364973306656,
        -0.025137286633253098,
        -0.010157137177884579,
        -0.02889045514166355,
        0.10719961673021317,
        0.014991282485425472,
        -0.0262297373265028,
        0.021720947697758675,
        0.0010680847335606813,
        0.024812262505292892,
        0.005810787435621023,
        0.00013649486936628819,
        0.06665042787790298,
        0.006079925689846277,
        -0.0856856182217598,
        -0.015188673511147499,
        0.006802456919103861,
        -0.06584081053733826,
        -0.029875947162508965,
        -0.0036660393234342337,
        0.0284346304833889,
        0.0409892238676548,
        0.08364930003881454,
        0.08922548592090607,
        0.07575255632400513,
        -0.008677516132593155,
        -0.004350029863417149,
        0.06831569969654083,
        -0.013527189381420612,
        0.07760780304670334,
        0.04728194326162338,
        0.1370323747396469,
        -0.08690305799245834,
        -6.300037824757965e-08,
        0.05665658786892891,
        0.008408982306718826,
        -0.03672892600297928,
        -0.007637105882167816,
        0.010514778085052967,
        -0.07156161963939667,
        -0.05602925270795822,
        -0.0385582409799099,
        0.0557648204267025,
        -0.06421332061290741,
        0.06758546084165573,
        -0.045072149485349655,
        -0.02505004033446312,
        0.12530820071697235,
        0.04815509170293808,
        -0.035894837230443954,
        -0.07719984650611877,
        0.0716361328959465,
        -0.06276047229766846,
        -0.04386245831847191,
        -0.01052407082170248,
        0.06205350160598755,
        0.007467768155038357,
        -0.0043229288421571255,
        0.06220317259430885,
        0.020146677270531654,
        -0.011486590839922428,
        -0.013431133702397346,
        0.05592130869626999,
        0.02784181386232376,
        -0.022603103891015053,
        0.031231503933668137,
        0.02134302444756031,
        -0.054721277207136154,
        -0.07971657812595367,
        -0.033692747354507446,
        -0.037598688155412674,
        -0.0352163091301918,
        0.03959732875227928,
        0.06394537538290024,
        -0.008247772231698036,
        -0.10091284662485123,
        -0.03059767372906208,
        0.010111268609762192,
        0.01093572098761797,
        -0.11169113218784332,
        0.047995831817388535,
        -0.10111275315284729,
        -0.002702397294342518,
        -0.02967117726802826,
        -0.03453714773058891,
        0.026709450408816338,
        0.01809501089155674,
        -0.07110495120286942,
        0.05445867031812668,
        -0.017001688480377197,
        0.04224592074751854,
        0.03471828252077103,
        -0.044224753975868225,
        -0.04374227300286293,
        0.07772993296384811,
        0.04244961589574814,
        -0.06900369375944138,
        0.027812212705612183
    ]
}