{
    "id": "TF-7Q-pO01o",
    "title": "2023 YouTube Studio Makeover!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-06-20T18:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=TF-7Q-pO01o",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 214476,
    "likes": 8452,
    "comments_count": 451,
    "description": "Here's the latest tour of my studio! You've probably seen it for awhile in my latest videos.. but how did we get HERE?!  PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Ooh, this is a little too moody for my taste. Let's spice it up a little. It looks so good! Oh man, this is great. Now, I have gone through many studio setups over the course of my YouTube career, which is about 17 years. Like that's a really long time to be making content so my studio setups have gone through many, many changes. The one that you're currently looking at right now, I got this space about a year and a half ago and everything happened so quickly. Like, this place was basically completely empty. Ghey were actually still building it so I was able to make some changes as I needed. When I moved in, it was actually iPhone season so I was in a panic. We basically had to outfit this entire studio, get everything together, get everything ready for shooting the new iPhone. Everything in here was supposed to be temporary. We just kind of were mixing and matching and making things work. I had overflow storage of equipment. I had so much stuff in here that I couldn't actually move or really work. So there's been so much that has been going on behind the scenes that I'm so hyped, because a few weeks ago I got some packages from Aperture and this really was kind of what stemmed all of this and the fact that I really couldn't even move around in here anymore because there was no space. And also, Tyler came back in town, so with his help and with these new Aperture lights, we were able to just really focus and hone in on what we wanted to do. Hello, friends. So we have got something really fun in today. Oh boy. I need a knife. Yeah, you bet. Yeah. Back up. (gentle upbeat music) Now, once we got our new lights, we decided to completely start from scratch. So we moved all of the lights out, we rearranged everything, and then put them back slowly, one by one. And that actually took a lot longer than I thought it was going to. Okay, it's been a couple of days. I ordered some new things. We've got some new light stands, some sandbags. We've got some of the modifiers for our new lights. Did I say we got sandbags? Did I say yes? We have sandbags. This studio has been basically kind of the same for the past year and a half. I've got a few ideas for some things. Tyler over here on the floor also has some ideas for some things. So we're gonna kind of just do a little refresh, redo the lighting, redo our cameras, and we're gonna take you guys along for the ride. There's one roll in the studio, and that is do not touch anything here. Don't touch the lighting, don't touch the tripod, don't touch this. Don't touch the overhead cam because it's all set up perfectly so that if nobody else is here, I only have to push a few buttons. Everything is set up lit and it's perfect. But today-- - [Tyler] It's getting touched - It's getting touched. Jenna is probably gonna be just like having like some sort of panic attack and not know why, because I've yelled at her so many times for touching and she just knows she's not even here. She's in Mexico. She's gonna have no idea what's happening but she's gonna know. So where do you think we should start? - We pull everything off the rugs. - Okay. - Like, over here. - Yes. - Rearrange the desks and the rugs. And then start from scratch on this. (gentle upbeat music) (gentle upbeat music) - Oh, we'll address that. (gentle upbeat music) (gentle upbeat music) - We're gonna do our first little lighting test. So Tyler has this all set up. So he moved this back, but use this arm so that we would still have room to be able to go out onto the patio here. And this is gonna be our first little test. And see what, oh my God, that that light is so bright. (gentle upbeat music) We did a lot of testing over the course of several days. Got to me like eating my salad. (playful music) (playful music) We're gonna get rid of the shelf. (playful music) It's a look. It's a vibe. (playful music) Oh, that looks good. (playful music) Hmm. (playful music) Yeah. (playful music) It looks so good. I've been eating a salad for two hours. Like the background is still dark enough that you can see all the lights. This record player was actually a Christmas gift from YouTube. It looks so good there. I got my like little YouTube button there. Some of my awards over here. I love it. I love it. Also, the chair, which you guys saw the unboxing of Steelcase actually set my sister a chair. I sat in that chair and about lost my mind. So I connected with them and they have made me a custom pink one. They didn't make it specifically for me. Like you can actually go on the website and customize any of the colors that you want. They have available. I obviously had to choose the pink. Oh my God, it's beautiful. It's so beautiful. I can already see it. Oh, here it is. Oh my gosh. - [Speaker 1] It's very customized. - Oh my goodness. Maddie, come here. Come experience. It's so comfortable. I can't believe it. My butt's moving forward. - [Speaker 1] Yeah, you can move it forward. - Look. - [Speaker 1] You have more like, I know. So if you adjust it, it moves, it scooch it forward. - How do we adjust the tension? Oh, this one. I don't know what I'm doing. Oh yeah, check that out. I mean, this is game changing. Like look at this like I can lounge. I can move these little arms up. I can move them in, which is perfect for gaming. I feel like everything is coming together. Everything's looking good. Top-down camera on point. So I have these little monitors right in front below the camera. So I'm able to basically film by myself. I just hit record on the top down, hit record on the front camera as time to roll. We're in business. We actually made a lot more room. Like I can actually walk around here like before, I could not do that. We also got a new teleprompter set up here. So sometimes I do use a teleprompter if I have a lot of notes or a lot of scripts that I need to hit. But what I mostly use this for is doing conference calls. So I'm able to transport to the person that I'm talking to onto the iPad, which then reflects into the camera. So it looks like I am making, you know perfect eye contact with them, which is pretty incredible. But by far, one of the best parts of the studio makeover was setting up all of the aperture lights inside of the Situs Link app. It's so easy. You just connect each light over Bluetooth and then from there you can control all of the lights individually or you can even create different scenes for different setups. And it's just super easy to make adjustments right on the fly from your phone. This is such a game changer that I just can't believe we didn't do this sooner. So we ended up with two main sets. But we do actually have a third which is my real life editing desk. Like this is where I work, this is where I edit. This is where I do everything. I have just been using the speakers that were built into the studio monitor. Well, Jonathan Morrison was like, \"Hey, I wanna send you something and I'm not gonna tell you what it is.\" I was like, oh, okay, cool. Like I thought it would be maybe like an iPhone case or something. Oh, no, no, no, no, no. It was this. Hi. So Jonathan Morrison sent me something. I don't know what it is, but he said to fill my reaction. So I'm gonna unbox it. I'm about to open it. I got my knife Jenna's over there for moral support. I have no idea what is inside of here, but this box is very heavy. Oh, oh, oh, a note. Okay. This is the symphony desktop, which looks amazing. Sounds amazing. And has Mac Os keyboard volume integration. Get it paired with, oh my goodness, this is a gold mine. Okay, I think these might be speakers. Oh, whoa. Look at this. This is such a cool unboxing experience. Maybe I bring back my DJ career. - [Jenna] Oh no. - Wow, this is so exciting. I cannot wait to try this out. Look at all of these goodies. So this is everything that Jonathan sent. So I think for this particular setup I really just wanna get these speaker setup. So for that, I'm gonna use the symphony desktop. This thing looks so awesome. I even bought some speaker stands. Now I'm a little concerned about them 'cause I don't know what they're gonna look like, how they're gonna be. I got them on Amazon and they had like decent ratings. Click buy and this box is so heavy. (upbeat music) I'm into it so far. We're gonna put these together and we'll be right back. You notice I said we? - [Jenna] Yeah. - Okay. So it looks good. But I definitely thought that these stands were gonna be taller. I mean, I guess that sometimes happens when you see things online and you're like mm. Yeah, not quite matching up. But overall, like I really like the look of them and I think it's gonna work out great because I'm gonna be sitting here. I feel like the angle I probably would like it to be a little bit higher, but I think this is gonna work. I love Apogee stuff. So I am so hyped about this. I'm gonna get this all updated and set up and download the software and then we're gonna test it out. We've got the controller happening. You don't actually need to use the dial to adjust the volume. You can still use the keyboard controls and it syncs with the symphony. So this is pretty exciting. So first I want to let you guys hear what it sounds like on the studio monitor. And this is actually a pretty good speaker system. I think on here. I edit all of my videos directly with this. Using these speakers built in. Pretty good. It's good. I mean like, I like editing on that because I feel like it gives me a good general base of like what audio is gonna sound like on most people's devices. Now, oh my God. (gentle music) I have goosebumps. Like I actually, oh my goodness, that just hit me to the freaking core. That's not even all the way up. We're only at two. (gentle music) Oh my gosh. (gentle upbeat music) Holy. I've never-- I've literally never heard speaker. Like I've never heard sound so good. Oh my. This has ruined my life. Let's listen to Jonathan's MagSafe song. I'm laid back, but I don't front Dopamine up and the MagSafe plugged I'm laid back, but I don't front Wow, this is such an incredible addition to my desk. Like I didn't ever think that I really needed some good studio speakers and these are beyond anything that I could have ever wished for. Thank you Jonathan and Apogee. As you can see this is my editing setup and it is such a dream. I love having a vertical monitor seeing what I might want to use in my main timeline. And then over here I have a output of the entire video. So if I just want to, you know, relax and just see my work of art. But the cool thing about this little area is this is our third set. So I can just kind of set a camera up right here. And here you go. It's still a part of this set, but I can do demos here. I can test things out. And all of this is actually being run off of my 14-inch M2 MacBook Pro which is kind of shocking to think about. This is sort of my powered by OWC station. And honestly OWC has been pretty much my storage solution for the past couple of years. I've got the Thunderbolt flex here which I'm using for all of my backup. I also have this OWC stack and this Thunderbolt dock. It's a little crazy. The fact that this is all being powered off the little MacBook, powering my entire workflow. I know I could probably be using the Mac studio for all of this, but there is just something about being able to just unplug my MacBook and everything that I was working on. I can take the with me on the go. Another thing that was really important to me in the studio is to make sure our cable management was kept as tidy as possible because I run into things all the time. Oh, so we needed to make it as safe as possible. Now it might not be super pretty, but everything is taped down and it's been a while since I've tripped or run into anything, which is really that's definitely the key factor here. Overall, everything is so much more tidy. There's actually a lot more space because we did move some of the lights back and something else that's really exciting. We have a trash can now. I know it's been a year and a half and I haven't had a trash can. It's so ridiculous. We also reorganized my gear closet and this is actually something that I had started doing months ago. This is where we've kind of got some overflow gear. We've got some tripods, we've got lights we've got a ton of bags. This definitely needs to be reorganized, but trust me, this is way better than it was. I don't even wanna show you a photo cause I'm embarrassed. We also reorganized our little audio and charging stations. We've got extra microphones, logs, Sony batteries and this is those little MC lights, which is so cool 'cause it's this little carrying case, but it's also a charger. We've got a label maker, which is very important to me. This is one of my favorite pieces of decks. Extra camera bodies, lenses, ND filters, lens caps some extra monitors, batteries. Tyler, you got me this for my birthday a couple years ago. We still have six pictures left. Let's take one. We do have a dedicated podcast room but that is currently under construction. If you've watched the podcast or listened to it, you already know this. Spooky. It's a work in progress. We have some big plans, big ideas. Hopefully we can execute. Probably one of my favorite parts of my new studio is my gaming room. (upbeat music) This is the vibe room. I've got this excessively large as Asus monitor which I'm so obsessed with, but like my desk is too small to fit all of this stuff. Road caster here. And that's obviously connected to this microphone. Actually, I love this Insta 360 webcam. Like I've been using that to stream. Now originally this was going to be editing and gaming in one room, but I loved having my editing out here in the studio. It just felt so much more open. I also love this room because I don't really do much work in here. I kind of just come in. It's super zen. Oh shoot, sorry. Oh god. And it's just like, I don't know, it's just a vibe. It's like my toy room. I just go in there and play. I actually, it's more like a child's playroom but like an adult version. I'm into it. (gentle upbeat music) So that's the current studio setup up. I'm so happy with it. Everything just feels clean and neat and there's room to move around. So I'm hyped. Thank you guys so much for coming along on this journey over the past like 17 years. Many of you have been here since the beginning. Some of you are new. Hello. Hi. Maybe you don't even know who I am. Welcome. I'm glad you're here either way. And with that I'm going to turn off the lights. 3, 2, 1. Oh, I look like I'm getting interrogated. (upbeat music) (upbeat music)",
    "transcript_keywords": [
        "studio",
        "lights",
        "good",
        "set",
        "back",
        "room",
        "kind",
        "work",
        "things",
        "move",
        "Yeah",
        "Aperture lights",
        "Jonathan",
        "camera",
        "lot",
        "love",
        "pretty",
        "good studio speakers",
        "touch",
        "God"
    ],
    "transcript_entity_values": [
        "Aperture",
        "MacBook",
        "14-inch",
        "about 17 years",
        "Jonathan",
        "one",
        "iPad",
        "Amazon",
        "MacBook",
        "2",
        "a couple of days",
        "Mexico",
        "Sony",
        "OWC",
        "iPhone",
        "the past couple of years",
        "a year and a half",
        "Jonathan Morrison",
        "YouTube",
        "ND",
        "about a year and a half ago",
        "Steelcase",
        "several days",
        "a couple years ago",
        "Maddie",
        "the past like 17 years",
        "M2 MacBook Pro",
        "two hours",
        "3",
        "months ago",
        "six",
        "today",
        "the past year",
        "third",
        "two",
        "a few weeks ago",
        "YouTube",
        "Tyler",
        "Situs",
        "first",
        "Christmas",
        "Mac",
        "Asus",
        "1",
        "Jenna",
        "Apogee"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.05867627635598183,
        -0.11579743027687073,
        -0.013198086991906166,
        -0.11920488625764847,
        0.04554476588964462,
        0.040772393345832825,
        0.03282961621880531,
        0.002404238795861602,
        -0.02372792176902294,
        0.06724321842193604,
        -0.0037645457778126,
        0.014651252888143063,
        -0.02381621114909649,
        0.0035106977447867393,
        0.014158318750560284,
        0.04440145939588547,
        0.016760166734457016,
        -0.053251784294843674,
        -0.01384726818650961,
        -0.0029031806625425816,
        -0.01748950593173504,
        -0.05274181813001633,
        0.03613635525107384,
        0.015533306635916233,
        -0.03761909902095795,
        0.08133271336555481,
        -0.019199388101696968,
        0.043782077729701996,
        -0.058563727885484695,
        -0.0739021897315979,
        -0.037454843521118164,
        0.016868799924850464,
        0.07827024161815643,
        -0.010583888739347458,
        -0.021364610642194748,
        -0.06597261875867844,
        0.03582431748509407,
        0.001396728097461164,
        -0.031933367252349854,
        -0.022689808160066605,
        -0.001992475939914584,
        -0.03956593945622444,
        0.01872607320547104,
        -0.03225046023726463,
        -0.06356664001941681,
        -0.09271609783172607,
        -0.005165223032236099,
        -0.07756730169057846,
        0.06782171875238419,
        0.05785071477293968,
        -0.10109291970729828,
        -0.0774083137512207,
        0.034137193113565445,
        0.009696991182863712,
        -0.07346273213624954,
        0.033131107687950134,
        -0.06983575969934464,
        -0.002335841068997979,
        0.0460473857820034,
        -0.06650836765766144,
        0.03942742571234703,
        -0.06936821341514587,
        -0.002245960058644414,
        0.0428767167031765,
        -0.04828840494155884,
        -0.05806785449385643,
        0.04021138697862625,
        0.02617003209888935,
        -0.01245281845331192,
        0.005862112157046795,
        -0.12945061922073364,
        0.049328841269016266,
        -0.04325760155916214,
        0.007525817956775427,
        0.004693666938692331,
        0.05611134693026543,
        0.03757715970277786,
        -0.04942668229341507,
        -0.0240201223641634,
        0.03195694833993912,
        0.06033693999052048,
        -0.058406390249729156,
        -0.06450516730546951,
        -0.007847261615097523,
        -0.019094690680503845,
        0.054988835006952286,
        0.03980007395148277,
        -0.010531525127589703,
        -0.027829628437757492,
        -0.04134878143668175,
        -0.12328151613473892,
        0.018781455233693123,
        -0.009221167303621769,
        -0.00630689924582839,
        -0.0370480902493,
        -0.014765940606594086,
        -0.02964775264263153,
        -0.06673788279294968,
        -0.01561941672116518,
        0.08205214142799377,
        0.015667201951146126,
        -0.07229268550872803,
        0.02445356920361519,
        -0.0616714246571064,
        -0.03154315799474716,
        -0.07809322327375412,
        -0.04725540056824684,
        0.0430217869579792,
        0.02121610753238201,
        0.004042390268296003,
        -0.03625505417585373,
        0.0403430312871933,
        -0.04966067150235176,
        -0.03626937046647072,
        0.014291930943727493,
        0.10202030837535858,
        -0.027321623638272285,
        0.07240591198205948,
        0.04584832862019539,
        -0.0007378191221505404,
        0.03871253505349159,
        -0.056938089430332184,
        -0.010956935584545135,
        0.0412178710103035,
        0.01515078917145729,
        -0.0008463996928185225,
        -0.07275676727294922,
        1.080496187113409e-32,
        0.019358621910214424,
        0.054647646844387054,
        -0.0030740106012672186,
        0.0688256099820137,
        0.01959352195262909,
        0.009048783220350742,
        -0.019046999514102936,
        0.12148131430149078,
        -0.056770209223032,
        0.003648048499599099,
        0.010893174447119236,
        -0.0011663400800898671,
        -0.060313280671834946,
        0.055915724486112595,
        0.04031311720609665,
        -0.023851698264479637,
        0.00492202490568161,
        -0.06303039938211441,
        -0.07937376946210861,
        -0.006083276588469744,
        0.01584167405962944,
        0.0046928878873586655,
        0.021853115409612656,
        0.07306821644306183,
        0.09037837386131287,
        0.09175018966197968,
        0.07321092486381531,
        0.0031666147988289595,
        0.0514959916472435,
        0.003045629942789674,
        -0.07637140899896622,
        -0.03858848288655281,
        -0.017572054639458656,
        -0.05544518306851387,
        -0.006486288737505674,
        -0.005452178884297609,
        -0.08389898389577866,
        -0.01289276871830225,
        -0.022804906591773033,
        0.011577094905078411,
        -0.004591843578964472,
        0.0005013530026189983,
        -0.08728857338428497,
        -0.05374448373913765,
        0.06102839484810829,
        0.05719345808029175,
        0.09120408445596695,
        0.0961780846118927,
        0.012855100445449352,
        0.04477497190237045,
        -0.016630200669169426,
        0.02432175539433956,
        -0.04401066526770592,
        0.013554330915212631,
        -0.027569569647312164,
        -0.06816092878580093,
        -0.014645369723439217,
        0.025877252221107483,
        0.05777178704738617,
        0.03215605020523071,
        0.020059820264577866,
        0.03157423064112663,
        -0.021272331476211548,
        -0.004670379683375359,
        -0.05715858191251755,
        0.09376921504735947,
        0.08753073215484619,
        -0.006108216010034084,
        0.08458171039819717,
        0.041910916566848755,
        -0.005969038233160973,
        -0.021541187539696693,
        0.04613577947020531,
        0.04751439392566681,
        0.052883245050907135,
        0.029337337240576744,
        -0.12550659477710724,
        -0.054657164961099625,
        0.051911816000938416,
        -0.008858876302838326,
        -0.11564482003450394,
        0.0705844983458519,
        0.004869356751441956,
        0.0936262235045433,
        0.007521530147641897,
        -0.075336754322052,
        0.03687923401594162,
        -0.032190464437007904,
        -0.008411784656345844,
        -0.005411127116531134,
        -0.020166300237178802,
        0.038242731243371964,
        -0.04449719563126564,
        -0.018792197108268738,
        -0.02857213467359543,
        -1.1341290719588358e-32,
        0.042337626218795776,
        0.04825787618756294,
        -0.02641155943274498,
        -0.029540959745645523,
        0.05318828299641609,
        -0.015347309410572052,
        0.01343503501266241,
        0.09277256578207016,
        0.08628106862306595,
        -0.05731040984392166,
        0.05025123432278633,
        -0.0455469973385334,
        -0.11264949291944504,
        -0.010588239878416061,
        -0.04353904724121094,
        -0.049984175711870193,
        -0.026027904823422432,
        -0.08680083602666855,
        0.03489897772669792,
        -0.05160629004240036,
        0.09056059271097183,
        0.10414878278970718,
        0.07957491278648376,
        0.030675973743200302,
        -0.002808163408190012,
        -0.009999722242355347,
        0.06226712837815285,
        0.0672365128993988,
        0.07207975536584854,
        0.07258312404155731,
        -0.04590803384780884,
        -0.05325015261769295,
        -0.03138350695371628,
        -0.009154057130217552,
        0.051397666335105896,
        0.040841590613126755,
        0.03685782477259636,
        0.021720116958022118,
        0.011395885609090328,
        -0.06553695350885391,
        0.024143025279045105,
        0.005319544114172459,
        -0.01460651122033596,
        -0.004354258067905903,
        -0.00489534018561244,
        -0.07798048108816147,
        -0.05546077713370323,
        0.03335736691951752,
        -0.011119331233203411,
        -0.008387318812310696,
        -0.03289489820599556,
        -0.047542449086904526,
        -0.0316649004817009,
        -0.035937853157520294,
        -0.00711118383333087,
        -0.04566514119505882,
        -0.0584787093102932,
        -0.00429215794429183,
        0.06779263913631439,
        0.019360218197107315,
        0.009161313064396381,
        -0.046871837228536606,
        -0.056489940732717514,
        -0.07874758541584015,
        -0.0038879222702234983,
        -0.04847089573740959,
        0.08178994059562683,
        0.04771912842988968,
        -4.976230411557481e-05,
        0.025492440909147263,
        -0.00124956457875669,
        0.022701771929860115,
        0.020437778905034065,
        -0.009289599023759365,
        0.04176386818289757,
        -0.01950990967452526,
        -0.04690822586417198,
        0.0023497934453189373,
        0.0835040807723999,
        -0.047995589673519135,
        -0.02824077010154724,
        -0.019650254398584366,
        0.010357227176427841,
        0.07060840725898743,
        0.11848968267440796,
        0.12059134244918823,
        0.08156312257051468,
        0.031221048906445503,
        0.005299353040754795,
        0.05817084759473801,
        0.0313580147922039,
        0.09415237605571747,
        0.034945711493492126,
        0.1235695481300354,
        -0.048776134848594666,
        -6.125772955556386e-08,
        0.061548035591840744,
        0.04839704930782318,
        -0.042948197573423386,
        0.02349209040403366,
        0.010807091370224953,
        -0.08799230307340622,
        -0.022792350500822067,
        0.026188122108578682,
        0.0651823952794075,
        -0.06256239116191864,
        0.060016777366399765,
        -0.0010035572340711951,
        0.021764278411865234,
        0.1296597719192505,
        0.0012956648133695126,
        0.00886395201086998,
        -0.12984706461429596,
        0.11711693555116653,
        -0.05648509040474892,
        -0.07314462214708328,
        -0.06541557610034943,
        0.01851610653102398,
        0.05867363139986992,
        -0.033335328102111816,
        0.03950386866927147,
        -0.037575919181108475,
        -0.04064274579286575,
        -0.03132375702261925,
        0.007186370436102152,
        0.009359433315694332,
        -0.07935810089111328,
        0.004235931672155857,
        -0.0374382846057415,
        -0.023852797225117683,
        -0.04341445118188858,
        -0.06498505920171738,
        -0.0664849802851677,
        -0.01033856999129057,
        0.028888437896966934,
        -0.02861623466014862,
        -0.001507687964476645,
        -0.12164369970560074,
        -0.020110808312892914,
        0.016345009207725525,
        0.004936404526233673,
        -0.06629462540149689,
        0.023123616352677345,
        -0.0787132978439331,
        -0.03976117819547653,
        -0.09202320128679276,
        -0.06264326721429825,
        0.034591786563396454,
        0.020658157765865326,
        -0.02661909908056259,
        0.08467637002468109,
        -0.001866546692326665,
        0.027233272790908813,
        0.0637718066573143,
        -0.027894651517271996,
        -0.02011425606906414,
        0.04739200323820114,
        -0.014246251434087753,
        -0.043897826224565506,
        0.027602074667811394
    ]
}