{
    "id": "TFE9wfAfudE",
    "title": "This Ugly PC will BLOW YOUR MIND - All Noctua Gaming PC",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-13T20:55:44Z",
    "video_url": "https://www.youtube.com/watch?v=TFE9wfAfudE",
    "category": "Science & Technology",
    "tags": [
        "all noctua gaming pc",
        "gaming pc",
        "Linus Tech",
        "Noctua",
        "RTX 3080",
        "Silent PC",
        "Quiet PC",
        "Brown",
        "LTT"
    ],
    "views": 4809653,
    "likes": 143243,
    "comments_count": 9713,
    "description": "Thanks to Mine for sponsoring this video! Discover where your data is, and take it back at   PDQ.com: Start your FREE trial now! At   Asus teamed up with Noctua to release the best and brownest 30 series cards  and to celebrate, we stuffed as many of their fans as possible in one PC build!   Discuss on the forum:   Buy a Cooler Master H500 ARGB:  Buy a Noctua NF-A20 PWM:  Buy a Noctua NH-D15 Chromax:  Buy a Noctua NF-A12x25 PWM:  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:34 Case and fan install 6:16 Motherboard and PSU  9:20 CPU and RAM 10:34 Linus Paint Tips 11:02 Noctua story time 12:04 PC comes together 13:06 Big GPU! 15:13 1st boot and peripherals 16:34 Play some games 17:58 Outro",
    "description_links": [
        "https://bit.ly/saymineLTT",
        "https://lmg.gg/PDQJuly",
        "https://linustechtips.com/topic/1443009-this-ugly-pc-will-blow-your-mind/",
        "https://geni.us/p2yEkS9",
        "https://geni.us/e0lB",
        "https://geni.us/AlETc4",
        "https://geni.us/YxMDv5S",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- [Linus] OMG, a two fan GPU? (upbeat harmony) - Oh, finally! (screams over heartbeat) (beeping) - GPU makers, what are you doing? It's the same thing every generation. Massive, carefully designed heat sinks. And then you go and ruin it by slapping these dinky $3 fans on them to try and keep everything cool. You might not realize it, but those fans are one of the most common points of failure on a graphics card. And with most of them, either too difficult to take apart, or impossible to find replacements for. A lot of the time your only options are to throw the graphics card away or rip the whole shroud off and Zip Tie on whatever fans you've got lying around. Well, Noctua must have been paying attention because they did basically that. With the help of ASUS, they came together to create the ultimate RTX 30 series cards and they're glorious. So what better way to celebrate them than by building the all Noctua gaming PC. So hop on board, baby. Next up brown town! (imitates train whistle) Wait, next up, this message from our sponsor. PDQ! Take patch management off your plate by automating it. PDQ can keep your machines patched and up to date automatically, giving you time to do more important things, like watching LTT. Start your free trial at pdq.com/linus. (upbeat techno) It's no secret that here at LTT we are giant enthusiasts of Noctua products. You'll find them in just about every machine we build here at the office. And if our staff aren't going for an RGB look at home, you can bet that they're using Noctua products for their zero compromises approach to performance and reliability. And it's with zero compromises in mind that we began our Noctua PC by finding an excuse to use the biggest fan they officially offer. This 200 millimeter absolute unit of a cooling fan. There aren't actually a ton of cases out there that support this size. Even then you have to be careful because this fan is 30 millimeters thick. That is five more millimeters than the standard 25. We're gonna have this and everything that we've used linked in the video description below. So just because a case comes with 200 millimeter fan support from the factory, does not mean that it will support Noctua's as replacements. Looking at you, Lian Li. Now obviously a plain black case on its own wasn't good enough for a machine like this. So we had our resident DaVinci work his magic with the paint booth and wow! Does this ever look amazing? Shout out Nicholas for really pushing this build to the next level. Look at this. We've even got Noctua themed back PCI covers. I just realized I never actually named the case we selected. It's the master box H500 ARGB from Cooler Master. And the reason we chose it, aside from it fitting our 200 millimeter fans, is that this build is all about performance and airflow. And it certainly has that. With a full mesh front panel that supports not just one, but two of our 200 millimeter fans. Look at that. Isn't that incredible? And a large top vent, complete with magnetic fan filter, that supports another 2, 140 millimeter fans and finally a single 120 millimeter exhaust at the back. (yells) The process for installing these is a little fun. You gotta pop the, (startled noises) pop the front panel off just like that. You got this nice little mesh dome. I actually love this from an airflow perspective. And then this bad boy is gonna be an intake for us. And it's gonna go a little something like fan cable through, oh my God, how are we gonna get this fan table through here? I guess like that. Wow. Yep. That's gonna take up the whole space all right. We're gonna use Noctua's cool little silicone vibration isolators to install our fans. So you just pop one of these bad boys through, little something like this. A little tedious, but does that look freaking amazing or what? It's a giant wall of cooling performance. You simply cannot put anything in here that is not getting a blast of fresh air. My one regret is not enough Noctua fans. Thankfully we have more. Oh, that's not an NFA 14, but that's okay. 'Cause this is a 120 mil for the back. Oh my God, it's been so long since I've used these I forgot how you're supposed to install them. You put the silicone things in the fan first. Oh shoot, I need another one. Oh, so dumb. Yeah. They're all in wrong. Oh my God. I had a brain brown fart moment here. I totally installed these wrong. It's been so long since I've used these. I normally just use screws. You put the long side into the fan, like I did, but you don't do it through the case. That's what this little notch right here is for that's where the case sits. So for those of you who were head-desking up until this point in the video, I'm sorry, I'm sorry, I'm fixing it. So then you, oh wow, these holes are really tight. Okay, it went, it went, boy, was that ever a tight fit? Look at that vibration isolating goodness. Look at all that play. It's a good thing. Maybe there were people out there screeching that it's supposed to go case side first when I did it the last time. I don't know guys, I just use screws so that I can talk about our screwdriver lttstore.com. Not yet soon. Yes. Got it. All right, now I have to line up four things at once instead of one at a time. And they're all floopsy. It's like getting a flacid thing into a tight thing, you know? Ay, Noctua cable extensions. All right, let's put this back fan in. Yeah, with properly sized holes this is a fair bit easier. Boom. Done. Look at that. Installed. This is glorious. I don't even wanna cut off the little nubbins. I say we keep them. Yeah, you can't even see them. Our case wasn't the only piece that needed the Noctua treatment though. And our motherboard gave us plenty of opportunities to add color accents. X570 boards in general, and our TUF series from ASUS is no exception, often include active cooling for the chip set, giving us a perfect opportunity to replace that generic little whiny fan with one from Noctua. So to begin our operation, we put our baby little 40 by 10 millimeter Noctua under the knife, removing everything but the impeller and the fan blades themselves. Unfortunately the heat sink shroud around the stock fan didn't really accommodate our thicker Noctua replacement, which necessitated some overly precise Tormach action to make it fit. But you can see how well it turned out. Enjoy it while you can though, because by the time the build is done you won't be able to see it anymore. Oh boy, well that's not gonna help. Turns out they do still need me for something. Oh, I guess we went with a one terabyte WD blue because it didn't matter what we chose because it's under a heat sink. If I was to choose an M.2 for this build based on the overall theme of reliability I would probably go with something from Samsung. We don't have any experience with WD blues dying in particular, but based on the numbers out of Puget, Samsung makes shockingly reliable SSDs. So there's just a degree of trust there that I don't necessarily have for this particular drive. On the subject of things you won't be able to see when we're done, there was no way we were gonna be satisfied with any old power supply. So, knowing that Alex had already taken apart this AX1600I from Corsair we thought it would be the perfect candidate for a little Noctua operation. Little snip of the cables, followed by some solder action And the end result looks pretty darn near factory under this painted fan grill. Not bad, right? I think we could have gone the, well, okay, there's some, there's some problems, but they're cosmetic. They're cosmetic, okay? It's a good thing we replaced it, too, because this fan ends up spinning up to its highest RPM during boot and the factory Corsair unit, in my opinion, unacceptably loud. Easily the most noticeable one in the system. Though, in fairness to Corsair, it would've immediately spun down to like zero. Okay, one thumb screw later, power supply shroud comes off. It's actually a very easy case to work in, very standard. Oh, this feels so wrong. I guess it doesn't really matter 'cause we wouldn't see the fan anyway. It's covered in this shroud, but, okay, we'll know it's there. Brandon, this is what I was thinking when I lost my train of thought. Corsair used to include, and apparently still does, little magnetic replacements for the labels. Look at that, ha! Clean now. We are still gonna cover it though. Little pro building tip. If you wanna save yourself some hassle later, you can pre-install your modular cables on the motherboard board, (yelps) and then run these as you're installing the board, rather than once you've already put heat sinks and everything on here and it's real difficult to get at them. Couple other things we should probably install on the motherboard before going any further. We've got an AMD Ryzen seven 5800X3D. It may only have eight cores, but, dammit, it uses their 3D V-Cache and is the fastest gaming CPU in their lineup. We'll get that boy popped in there. And we've actually got a second SSD. This is the one you guys are meant to believe we're booting off of, but it's mostly just for show. This is a Corsair MP600 SSD. So not even like top of the line anymore. But we just liked it because we could put it here and put a little Noctua fan on it and plug it in like there. Unfortunately, there's nothing Noctua about our 64 gig kit of 3,600 mega transfer per second crucial Ballistix memory. We can't even put a Noctua cooler on it. Unless we make our own by 3D printing it, yes! Oh Lordy, it's not the most elegant thing in the world. We're using motherboard screw holes, see that? Standard ATX screw holes to get this bad boy on here. But boy is that RAM ever gonna be silent. Silent RAM. It's all like, (imitates sheep) but not muted. Unfortunately, I managed to scuff our totally awesome professional rattle can paint job a little bit here, but that's okay because I've got a little paint tip for you guys. Spray some of your paint onto a plastic surface like this, get a little stick or something like that. Poke that in there. You can get some little touch ups going on in here. Come check this out, Brandon. How's that? (mumbles) It won't have quite a perfect finish from six inches, but from six feet, you'd never notice it. So many things about this build feel out of water, but we've finally gotten to the CPU heat sink, and oh, come on. We gotta go with the classic, ladies and gentlemen. That's right. We actually obtained a black Noctua fan and then replaced it with a brown and tan one. Because Noctua PC. Wait, CRYORIG thermal compound? Get this outta my face. Can't do the whole Noctua PC without using Noctua thermal compound. Geez, I guess that's what I get for asking stupid questions. Like where's the thermal compound? Gee, I don't know, Linus, maybe in the box for the cooler? You know, it was actually a very Noctua inspired process by which we brought our screwdriver to life. I remember having a conversation with their CEO where I said, \"Well, to make the best fans, you guys must have the best engineers.\" And he kind of laughed, and he goes, \"Well, no, we have good engineers, but it's more about giving them the time to do their best work.\" And that's why it's taken two and a half years to make a screwdriver. Oh my goodness, there you go. All right, one CPU cable, ah, ah, ah, two CPU cable, ah, ah, ah, come on, where is the other one? Of course there has these, these heat shrink tubes on their cables that, there we go. We had wanted to have cable mod cables for this matching our Noctua color scheme. But unfortunately, there was a shipping delay and they weren't here in time. Those eight pins would not go in if they were not pre-installed, at all. For our first screw, we're going top right. Which means we're gonna be using a custom length motherboard screw. This is because it's gotta go through that 3D printed RAM cooler. Oh yeah, it's threaded. Nice. We're glossing over a lot of the cabling, but the summary is lots of extensions, lots of Y splitters. We've got all of these fans plugged into the motherboard headers. Now all we gotta do is get some LTT store cable ties. Now available in so many fun colors. Though unfortunately not brown. Now it's time for the centerpiece of our build. The collab you did not know you needed. The ASUS X Noctua RTX3070. Wait, what are we putting a 3070 in here for? GPU prices are way better now! Let's go for the newer 3080 edition, shall we? It looks exactly the same, but that's not a bad thing. Everything about this design is performance first. From the back plate to the massive 120 millimeter cooling fans to the 4.3 slot thickness. Though I do have to say, I wonder how much of the performance of it is Noctua fan engineering and how much is just that it has a massive, massive heat sink with a (indistinct) extra clearance here for the heat sink so that the airflow could kind of blow out around the card better. - [Brandon] I wonder how many of them they've sold? - Probably a lot, I'd buy this one, a hundred percent. Brandon, you don't get it. You don't buy Noctua components for the looks. You buy them for the performance. That's their whole shtick. No one will care what it looks like if the performance is outstanding. Wow, even the M.2 way down here on the board is, I would say, barely accessible. I think I could probably swap it out but it wouldn't be easy. We do get one expansion slot. We've got this one PCIE by one down here. So that's good. Otherwise this GPU is taking up the whole thing. As for cable management for our power connectors here, rather than come down to the power supply like this, we're gonna go up and over and we're gonna strap it in really tight at the back to try to relieve some of the strain on our poor PCIE slot here, so bear with me. I wouldn't really recommend this, but I am doing it. So make of that what you will. Okay. Let's see. Is it more level? Actually, not bad. Well, bad but not unattractive. All that's left now is to fire it up. Time for the big moment. Yeah, you can hear it a little. You can hear it a little, the all Noctua PC does make a little bit of noise. But give it a second. I suspect that's just the GPU ramping up. Oh, it's the power supply. Wow, is that ever quiet? That is amazing. My mic is right here. I am literally whispering right now and I am inside this computer man. Man, you can feel the suck, too. Not that it sucks, It's just, airflow. While we apply our memory overclock profile, I can share with you some fun things about our peripherals. This may be our GB up the butt, but what's that? Brown switches from Gateron. And, well, this is more just story time than anything else. This was the one gaming mouse we could find with a fan in it. We really wanted to put a Noctua fan in there but they don't make one that small. So it is now the loudest part of this built. Oh, wow, what is this, Windows 95? What is happening? Allow me to just paint. Finish up my desktop wallpaper here. We're obviously gonna have to get in game for a while, but guys, I've got the panel closed. Still so quiet. Wow, our GPU is at 330 watts running at 64 degrees and I can barely hear the bloody thing. That is wild. How's our CPU doing? Oh, I don't know. Maybe 67 degrees while drawing, oh, okay, that's only 62 watts, I guess that fan just hasn't even ramped up. I swear, I can hear a computer over on the short circuit set better than I can hear this one. It is so quiet. This is in game now. This is legitimately in game. The one thing the PC can't cool though is me. Thankfully though I have this. (keyboard clicking) Let's see if we can do a little better here. - [Brandon] Is this an actual benchmark? - Yeah, I mean you gotta test it in the real world, Brandon. I don't know why the FPS counters not working, that's extremely frustrating. Pretty quiet, eh? - This fan at the back has got some toast though. It's hot. - [Linus] Is it hot in there? - Oh, here, let me help you with that. Well that one's pretty quiet, too. - No, this one's pretty loud. (laughs) Yeah, this is not an actual Noctua product and it's not very quiet. The rig though is. The only awkward part of the conversation is the price. We've got somewhere in the neighborhood of $400 worth of fans in here. Well outside the budget of most people when it comes to configuring a gaming rig. But hey, you can't fault the performance. Or, in my humble opinion, the look. 'Cause this may be one of the most ironically gorgeous builds we've ever done. And this may be one of the most gorgeous segues I've ever done to our sponsor. Mine! Thanks Mine for sponsoring this video. Your digital footprint is valuable and you have the right to know where it's being used. Mine is the smart data assistant that helps you discover where your personal information is and helps keep it where you want it. With breaches being commonplace these days, and brokers looking to use your information as a product, it's important to know who is holding your data. Sign up and Mine will let you know how many companies are holding your information. Mine will also help you exercise your data rights and reclaim your right to be forgotten by asking services you no longer use to delete your info. We ran our email and over 300 companies are holding our information including many services with our financial data that our team hasn't used in years. Mine helps us send an official data deletion request through our inbox so that the company can delete the personal data that they have stored. They also help companies with their ultimate goal of simplifying and improving consumers online privacy experience. So sign up at saymine.com using the link down below to regain ownership of your data. - [Linus] If you guys enjoyed this video maybe you'll enjoy the closer look we took at the ASUS X Noctua GPU. It turns out that the performance they've squeezed out of this thing and the silence is not just as simple as slapping big fans on any old cooler.",
    "transcript_keywords": [
        "Noctua",
        "Noctua fan",
        "fan",
        "fans",
        "thing",
        "millimeter fans",
        "black Noctua fan",
        "put",
        "time",
        "GPU",
        "Noctua fan engineering",
        "Noctua GPU",
        "things",
        "millimeter",
        "Noctua products",
        "performance",
        "case",
        "heat",
        "millimeter Noctua",
        "cable"
    ],
    "transcript_entity_values": [
        "3070",
        "one",
        "CRYORIG",
        "Brandon",
        "Windows 95",
        "eight",
        "RGB",
        "zero",
        "Corsair",
        "only 62 watts",
        "GPU",
        "WD",
        "five more millimeters",
        "DaVinci",
        "64",
        "FPS",
        "400",
        "Lian Li",
        "LTT",
        "Cooler",
        "This 200 millimeter",
        "Linus",
        "Silent RAM",
        "Tormach",
        "Linus",
        "330",
        "years",
        "ASUS",
        "3080",
        "first",
        "ASUS X Noctua RTX3070",
        "GB",
        "120 mil",
        "Ballistix",
        "Corsair MP600 SSD",
        "25",
        "67 degrees",
        "NFA",
        "TUF",
        "six feet",
        "over 300",
        "Puget",
        "4.3",
        "64 degrees",
        "CPU",
        "120 millimeter",
        "Samsung",
        "ATX",
        "four",
        "Alex",
        "a ton",
        "30",
        "Brown",
        "a hundred percent",
        "ASUS X Noctua GPU",
        "Nicholas",
        "two",
        "PDQ",
        "these days",
        "AMD Ryzen",
        "six inches",
        "second",
        "PCIE",
        "two and a half years",
        "3",
        "3,600",
        "PCI",
        "Y",
        "RAM",
        "30 millimeters",
        "140 millimeter",
        "Mine",
        "200 millimeter",
        "2",
        "Gateron",
        "10 millimeter",
        "Noctua"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG"
    ],
    "vector": [
        -0.03144076094031334,
        -0.007381037343293428,
        -0.05627158284187317,
        -0.015067235566675663,
        0.06292672455310822,
        -0.0218452550470829,
        -0.009079205803573132,
        -0.06282443553209305,
        -0.022618459537625313,
        -0.004756436217576265,
        0.0025987287517637014,
        0.010200981982052326,
        -0.05621965602040291,
        -0.03735191747546196,
        0.012829731218516827,
        0.07330936938524246,
        0.023760268464684486,
        -0.08345752209424973,
        -0.0259528998285532,
        -0.026812558993697166,
        -0.009224546141922474,
        -0.057973649352788925,
        -0.03538832440972328,
        -0.001999431289732456,
        -0.04360778257250786,
        -0.010080227628350258,
        0.014627831988036633,
        -0.02900630608201027,
        -0.03285356983542442,
        -0.13190698623657227,
        0.02505638264119625,
        0.0841381847858429,
        0.010247396305203438,
        -0.02249814011156559,
        0.054173603653907776,
        -0.13105864822864532,
        0.005679059773683548,
        -0.09170225262641907,
        -0.10447639971971512,
        -0.064301997423172,
        -0.004702706355601549,
        -0.0190897099673748,
        -0.014241401106119156,
        0.03657696768641472,
        0.0026499521918594837,
        0.032568495720624924,
        0.005380355287343264,
        -0.01773051545023918,
        0.07853193581104279,
        -0.014098749496042728,
        -0.010665089823305607,
        -0.06482170522212982,
        0.028979508206248283,
        -0.08162298053503036,
        -0.07578144967556,
        0.04594113305211067,
        -0.06337875872850418,
        -0.10528961569070816,
        0.047246020287275314,
        -0.07660465687513351,
        0.10537268221378326,
        -0.0645473301410675,
        -0.05778568983078003,
        0.061820339411497116,
        0.03129567950963974,
        0.0023564035072922707,
        0.018799230456352234,
        0.033352456986904144,
        -0.04860428720712662,
        0.02527536079287529,
        0.005289415363222361,
        0.016766129061579704,
        0.06506213545799255,
        -0.00491844629868865,
        0.001446371665224433,
        0.05216499790549278,
        0.03303632512688637,
        -0.06719767302274704,
        0.06979485601186752,
        0.0859549269080162,
        -0.009653691202402115,
        0.0444725900888443,
        0.005818807054311037,
        -0.023423420265316963,
        0.02827482484281063,
        -0.021531926468014717,
        0.06806231290102005,
        0.0072213695384562016,
        0.0006424977909773588,
        -0.12214147299528122,
        -0.05368470400571823,
        0.022943155840039253,
        0.12041588872671127,
        0.02565177157521248,
        -0.032448701560497284,
        0.042988792061805725,
        0.05632342770695686,
        -0.05962120741605759,
        -0.06110576167702675,
        0.08454129844903946,
        0.02886906825006008,
        0.01253855973482132,
        0.03652229160070419,
        0.02330603450536728,
        -0.08340290188789368,
        0.027613483369350433,
        -0.05328020080924034,
        0.03565359115600586,
        0.045617248862981796,
        0.023452583700418472,
        -0.09423474967479706,
        0.0695742592215538,
        -0.0822458490729332,
        -0.015299956314265728,
        0.029791127890348434,
        -0.0311642624437809,
        -0.05751947686076164,
        0.022895313799381256,
        0.036451034247875214,
        -0.0031559159979224205,
        -3.5205232506996254e-06,
        -0.07788878679275513,
        -0.028313197195529938,
        0.04656458646059036,
        0.030239302664995193,
        0.07459163665771484,
        -0.07732413709163666,
        5.309062930139259e-33,
        0.05918927490711212,
        0.07351589947938919,
        -0.020524315536022186,
        0.007230856921523809,
        0.04313794523477554,
        -0.02420184575021267,
        0.03596094995737076,
        -0.04483973979949951,
        0.0009341083932667971,
        0.021441200748085976,
        -0.0038708902429789305,
        0.02842714637517929,
        -0.08623867481946945,
        0.05120723694562912,
        0.048431266099214554,
        -0.07895586639642715,
        -0.004626104608178139,
        0.029038719832897186,
        0.007978783920407295,
        0.03444737195968628,
        -0.0014798870543017983,
        0.030949782580137253,
        0.0019386466592550278,
        -0.02854754962027073,
        0.06574957817792892,
        -0.03929274156689644,
        -0.03179871290922165,
        -0.030586950480937958,
        0.07528076320886612,
        0.032520048320293427,
        0.0059377821162343025,
        -0.11591017991304398,
        -0.019205579534173012,
        -0.03595589101314545,
        -0.04476054757833481,
        -0.03221331536769867,
        -0.12169165909290314,
        -0.05926622077822685,
        0.05101397633552551,
        -0.00814056396484375,
        -0.015529091469943523,
        0.06498569250106812,
        -0.0784415453672409,
        -0.12196914851665497,
        -0.06915763765573502,
        0.032896410673856735,
        0.053938381373882294,
        0.03705461323261261,
        -0.036443762481212616,
        0.03596963733434677,
        -0.11326944082975388,
        0.01817459613084793,
        -0.088150754570961,
        -0.0009860432473942637,
        0.010269573889672756,
        -0.09674204140901566,
        0.029535653069615364,
        -0.037478502839803696,
        0.08970477432012558,
        0.02296927571296692,
        -0.005629442632198334,
        -0.034907266497612,
        0.03305010125041008,
        -0.07145415246486664,
        -0.04407140612602234,
        0.030283302068710327,
        0.10155836492776871,
        -0.0023086846340447664,
        -0.06770199537277222,
        -0.04852436110377312,
        -0.035373132675886154,
        -0.0064258030615746975,
        0.028757406398653984,
        -0.00980621948838234,
        0.046329315751791,
        0.006145413964986801,
        -0.06278569996356964,
        -0.030614329501986504,
        -0.006273101083934307,
        -0.012844382785260677,
        -0.008069559000432491,
        0.04971444979310036,
        -0.03017866611480713,
        0.002386445878073573,
        0.0073386807925999165,
        -0.0016805956838652492,
        0.010458867065608501,
        0.016359705477952957,
        -0.03597147762775421,
        -0.029710564762353897,
        -0.019307462498545647,
        -0.03134269267320633,
        0.032770074903964996,
        -0.016852429136633873,
        0.004946697503328323,
        -6.069213249829784e-33,
        -0.012132741510868073,
        -0.07427074015140533,
        0.0029518473893404007,
        0.04491492733359337,
        0.015570120885968208,
        -0.01478505413979292,
        0.07227800786495209,
        0.032052330672740936,
        0.05780221149325371,
        -0.03155208006501198,
        0.01939312368631363,
        0.04835372790694237,
        -0.030205896124243736,
        -0.025935126468539238,
        0.06318259984254837,
        -0.07123460620641708,
        0.0548458993434906,
        -0.00038719020085409284,
        0.019820524379611015,
        -0.020221898332238197,
        0.10066891461610794,
        0.021503495052456856,
        -0.022449607029557228,
        -0.03019612468779087,
        -0.025388892740011215,
        0.05025680363178253,
        0.009603189304471016,
        -0.01212340034544468,
        -0.0146681759506464,
        0.057246312499046326,
        0.002026932779699564,
        0.023330053314566612,
        0.00525229936465621,
        0.009092931635677814,
        0.08624113351106644,
        -0.023375924676656723,
        0.07509622722864151,
        0.0934695303440094,
        -0.03828214854001999,
        -0.06931278854608536,
        0.03183228522539139,
        0.062018152326345444,
        0.06439416855573654,
        -0.0002728653489612043,
        -0.022742362692952156,
        -0.039319418370723724,
        -0.05427565798163414,
        -0.09579828381538391,
        0.0917278379201889,
        0.006002277601510286,
        -0.005072509404271841,
        -0.055265720933675766,
        0.06272223591804504,
        0.03282451629638672,
        0.002881269669160247,
        -0.05859348177909851,
        0.030445663258433342,
        0.05215251073241234,
        -0.04508205130696297,
        -0.03243262693285942,
        0.018186554312705994,
        -0.006129283923655748,
        -0.056959379464387894,
        -0.046218398958444595,
        0.02586405724287033,
        -0.021604498848319054,
        -0.0039050111081451178,
        0.006716118659824133,
        -0.02140193060040474,
        0.014856280758976936,
        -0.09087008982896805,
        0.010868939571082592,
        -0.004360311198979616,
        -0.046113576740026474,
        -0.047129422426223755,
        0.0026243834290653467,
        0.021913113072514534,
        -0.008294301107525826,
        0.07352322340011597,
        -0.017840242013335228,
        -0.10552368313074112,
        -0.015164732933044434,
        0.0095641715452075,
        -0.029918374493718147,
        0.09546306729316711,
        -0.009240337647497654,
        0.08495490998029709,
        -0.05750371888279915,
        0.0306966882199049,
        -0.012241233140230179,
        0.01257974375039339,
        0.019231533631682396,
        -0.005976483691483736,
        0.05911410227417946,
        -0.01249096728861332,
        -6.047096690053877e-08,
        -0.03734118118882179,
        -0.05116311088204384,
        0.0074548074044287205,
        0.06568332761526108,
        -0.007353900466114283,
        -0.06357423961162567,
        0.003128100885078311,
        -0.03342442587018013,
        0.06782654672861099,
        -0.028819745406508446,
        0.1602998971939087,
        -0.05798973888158798,
        0.004172434564679861,
        -0.0181324053555727,
        0.018626796081662178,
        0.031595081090927124,
        -0.03638092800974846,
        0.07583903521299362,
        -0.005085722077637911,
        -0.07636389881372452,
        -0.020479438826441765,
        0.04528070613741875,
        0.1035689190030098,
        -0.012250701896846294,
        0.03537445515394211,
        0.04126302897930145,
        0.10501941293478012,
        -0.00789891928434372,
        0.1579010933637619,
        -0.024187343195080757,
        -0.11082416772842407,
        -0.026517705991864204,
        0.052352964878082275,
        -0.04570383578538895,
        0.0860859602689743,
        -0.0364791639149189,
        0.006643795408308506,
        0.1367330402135849,
        0.08209843188524246,
        0.019621044397354126,
        -0.008906316012144089,
        -0.017917515709996223,
        -0.054544296115636826,
        0.01940954476594925,
        0.04823150113224983,
        -0.04577239602804184,
        -0.07758871465921402,
        -0.05631372705101967,
        -0.04005824029445648,
        0.007789302617311478,
        -0.027240373194217682,
        0.03426922857761383,
        -0.01901240274310112,
        0.07132995873689651,
        0.01208567712455988,
        -0.026363911107182503,
        -0.053303275257349014,
        0.07659987360239029,
        -0.00874619372189045,
        0.057381756603717804,
        0.03020245023071766,
        -0.10996652394533157,
        -0.0980890616774559,
        0.09186623245477676
    ]
}