{
    "id": "Tfg38JJA3oE",
    "title": "What is Apple Silicon (M1 Chip)? - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-06-26T23:12:30Z",
    "video_url": "https://www.youtube.com/watch?v=Tfg38JJA3oE",
    "category": "Science & Technology",
    "tags": [
        "What is Apple Silicon (M1 Chip)? - Krazy Ken's Tech Talk",
        "Apple Silicon",
        "Macintosh",
        "Apple",
        "Mac",
        "ARM-Based Mac",
        "ARM Mac",
        "macOS",
        "macOS Big Sur",
        "macOS 11",
        "Apple Worldwide Developers Conference",
        "WWDC",
        "Metal (Software)",
        "iOS",
        "iPadOS",
        "Intel",
        "PowerPC",
        "68K",
        "Steve Jobs",
        "SoC",
        "System on a Chip",
        "Xcode",
        "Rosetta 2",
        "Universal 2",
        "Universal App",
        "x86_64",
        "Windows",
        "Boot Camp",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Tech",
        "Computer Clan",
        "Apple M1 chip",
        "M1"
    ],
    "views": 108269,
    "likes": 4461,
    "comments_count": 815,
    "description": "What is the M1 chip and Apple silicon? In short, it's an ARM-based, custom-made, SoC (system on a chip) that Apple will use in their Macs, instead of Intel CPUs. But why is Apple doing this? What about application compatibility? Those questions, and more, are answered in this episode. P.S. enjoy the tragic love story in the beginning.  Join our channel and get cool stuff!   Watch more videos like this!   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - What is Apple Silicon? (Apple Macs Ditch Intel)  NOTE: This episode was published in June 2020. Apple silicon, and its related features, are subject to change upon release.  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Rene Ritchies Apple Silicon Video   Jonathan's Apple Silicon Video    Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program. *not all Patreon tiers qualify for all rewards #WWDC20 #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan2JGWYhz",
        "http://bit.ly/clan2UrG7G5",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "https://youtu.be/Zw1E4zHkHjc",
        "https://youtu.be/VgpBUx9v838",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(mouse click, computer chime) (upbeat music) - So what do you wanna do now? - Let's slip into something more virtual. - I like the sound of that. - Honey, I'm home. You'll never guess who I ran into at the, what the (beeping) is this? - It's not what you think. - Are you cheating on me with another processor? - But please I can explain. - What, why am I not hot enough for you? - No, no, no, actually, you're kind of too hot for me. Plus, you're not the most punctual. You're not helping. - Why? Why? Why? (Basso) (upbeat music) - Hey, guys, how are you all doing? Really, that's just great. You know, I'm doing pretty great today too, because Apple announced they are moving away from Intel and instead they're switching to ARM based custom Apple silicon for future Macs, which means we'll get better performance, better power management and a bunch of other features that we'll talk about later today. Now Apple silicon is an SoC which is system on a chip. So basically, traditional components in a computer architecture are all crammed into single chip. That's a high-level overview. This is a big transition in Mac history. (upbeat music) And with a big transition comes some uncertainty. So I know there's some questions out there that need answering, and I'm gonna do my best to address those today. So sit back and let me drop some knowledge on your A55. (air whooshing) Rest assured, Apple has been through transitions before, so they are prepared. Apple switched from 68K processors to PowerPC and released the first PowerPC Mac in 1994. Then they rewrote the Mac OS and released Mac OS X in 2001. Then they transition from power PC Macs to Intel Macs, and released the first MacBook Pro and early 2006 iMac. They've also worked with arm chips dating back to the Newton, all previous iPhones used ARM-based processors, and so did all iPads. In fact, the A-series chips we're familiar with today, debuted with the first iPad in 2010. So what's one more transition, right? I think we'll be okay. But there are a few factors to consider and we will go over those very soon, but first let's take a look at the timeline for this transition. (air whooshing) Tim Cook announced that the apple silicon transition will be completed in two years. And the first Apple silicon Mac will be released before the end of 2020. He also said more Intel Macs will be released, (air whooshing) but we don't have a solid timeline on how long Apple plans to release Intel machines. Additionally, Intel versions of macOS will still be released for, \"years to come\". So why bother? Why is Apple doing this apple silicon transition? What's the point? The simple point is they just want to make better products. But that's kind of a vague answer. A key component to making that goal happen is to have higher performance but more importantly, higher performance per watt. Which means theoretically, with an apple chip, you can compute just as much information as with an Intel system, but you would be using less power in doing so which gives you plenty of room to crank up that power and boost your performance significantly. This is similar to the main reason as to why Apple ditched power PC processors back in the day. They released the iMac with the G3, G4, and G5 processors. They did the same thing with the Power Mac line. But when you look at their notebooks, you'll see a G3 and a G4 but not a G5. Why did Apple not release a PowerBook G5? Well, performance per watt, they could not match the thermal conditions and battery life that they wanted among probably many other factors we don't even know of with the G5 processor. When they looked at Intel, they could tell that that roadmap would let them build the products they wanted to build. And that's kind of what we're doing today now with Intel, the apple silicon, but honestly, performance per watt is just the beginning. (air whooshing) Apple silicon will offer unique features to the Mac, Apple silicon will help make Mac's more secure. (air whooshing) Apple has been using their custom silicon for security features in iOS devices for years. In fact, Apple has implemented some of these security features in select max with their custom T1 and T2 chips, which work alongside the Intel processor. (air whooshing) With Apple silicon, there's no need for a separate T2 chip. It's all built into one SoC, which will allow for more security features that I'm not even aware of yet. Okay, so we have faster performance, better power management and better security features. But what else is there? Well, for starters, the neural engine is now coming to the Mac, which will accelerate machine learning tasks. Also, a high performance GPU architecture will accelerate pro apps and games, which is combined with a unified memory architecture, which allows the GPU to access memory insanely fast. In short, this chip can do a lot of stuff. And even better, Apple won't be tied down to Intel's product release scheduling anymore, nor will they be restricted by the thermal output of those chips. It's all in Apple's control. To me the most exciting part of this transition is the scalability. We've seen A series chips come so far in 10 years, this is the first iPad with an A4 in it. This is nowhere near as fast as what we have 10 years later on the iPad Pro. The iPad pros GPU is about 1000 times faster than what's in here in just 10 years, 1000 times the performance. So imagine what we can do inside a Mac, which has a much larger enclosure. Now I've had quite a few people ask me, why is Apple using a mobile architecture for their Macs? And to that, I simply say they're not. Yes, ARM works great for mobile, but it scales. The Fugaku supercomputer, it's all ARM based yet it clocked in at 415 petaflops. So for some quick math, that's 400, over 400 quadrillion floating point operations per second, all on ARM based processors. So I think the Mac will be fine. So now the big question, will my software work? What about app compatibility? Well, arm 64 is the instruction set for Apple silicon. That's what it's based on. And the Intel Macs are based on x86_64. They're different. Those Intel Mac apps won't understand arm64 out of box, simply they won't work. But Apple has a plan to help fix that. (air whooshing) There's two tiers of Intel compatibility, Rosetta 2 and Universal 2. Rosetta 2 provides compatibility for Intel Mac apps, as is without developer intervention. This won't work for everything, but it should be okay in most cases, two restrictions are you cannot translate kernel extensions or virtual machine software which virtualizes x86_64 computer platforms like windows, that aside Rosetta achieves this compatibility by translating the application upon installation via Mac OS package and App Store installed. Applications that don't use these installation methods are translated on first lunch. I mean launch. Can someone bring me a sandwich? (air whooshing) The second tier is Universal 2. Universal apps contain code for Apple silicon and Intel processors. And macOS automatically knows which code to run. For many apps, all the developer has to do to make a universal application is open up their Xcode project in the new version of Xcode, and bill. That will work in many cases. But there will be instances where a few days of work has to be done. But after that, the developer can now release the universal application, which will run natively on Apple silicon, but also on Intel Macs. Apple already has their productivity apps, their pro apps and their built in system apps all running on Apple silicon, and they're working closely with Microsoft and Adobe to make sure office and Creative Cloud also runs on Apple silicon. Apple also launched a quickstart program and when you apply to it, one of the things you could potentially get if you're accepted is a prototype Mac Mini. It looks like a Mac Mini but it has an A12Z Bionic chip in it. Yes, the same chip that's in the new iPad Pro. And this is pretty nice because the Mac Mini is a lot smaller than the giant 40 pound cheese grater tower that Apple gave you for the Intel transition. - Yoh, son of a (container banging) - So what about hackintosh? I get that question a lot. Well, for now, you don't really have to worry because Apple is still gonna be releasing Intel versions of macOS. macOS Big Sur signifies the beginning of this shift to Apple silicon, but it still runs on Intel, and future versions. I'm not sure how many future versions, but I would say at least one future version will also run on Intel too. So you have a little bit of time to figure out how to hackintosh an exclusive Apple silicon based Mac OS, if you wish. What about Boot Camp and Windows? So I wanna current until Mac you can run the Boot Camp Assistant, and boom, you can install Windows on your Mac. Heck, you can even install Windows on some of these really old PowerPC Mac's if you have a DOS Card, (whispering) which this one does have installed, It's really cool. Anyway, that's great and all but you cannot do this on Apple silicon max. In short, the traditional windows x86_64 software will not run. Now Microsoft does have windows on ARM , yes, but that's only for PC makers. They don't just sell that at the store, you can't just buy that off the shelf. Plus, it's not gonna run all the programs, you'd probably want to run anyway because it's ARM based. Maybe Apple and Microsoft can work out an agreement where you can buy a copy of Windows on ARM for your Apple, silicon Mac, if you really need it. So that future is a little bit uncertain. But in short, unfortunately, x86_64 Windows will not run on Apple silicon max. However, we might see some future virtualization software that can run Windows. Yes, you can't run Windows inside a virtualization program under Rosetta, but that's just Rosetta, there could be a future more native solution that could come down the pike and it might work. But we don't know that just yet. Just another note, (upbeat music) since Apple silicon is a common platform for iOS, iPadOS and macOS going forward, you can actually run iOS apps and iPad OS apps natively without modification on your Mac. As for boot Options, you can install multiple versions of Apple silicon-compatible macOS, you can boot internally you can boot externally as well. And you can even install versions of Mac OS that Apple stops signing, you can even set startup volumes to boot with full security mode or reduce security mode. Target disk mode is also being deprecated. And it's being replaced with a feature called max sharing mode, which essentially turns your Mac into an SMB volume that you can access files on over the network. I'm not really sure how this is different from just enabling SMB sharing inside the system. But perhaps it's useful because you can use it without the system being in a functioning bootable state. I'm not sure about all the details in regards to this because during the presentation in the WWDC session, they really just glossed over this feature. So, to be continued on that one. Okay, so I know that was a lot, but I do wanna know your thoughts about this whole transition, so feel free to leave a comment down below and if you have any questions about this, feel free to ask and I will do my best to answer. Also Rene Richie and Jonathan Morrison also did good videos about this topic, so feel free to check those out as well. (upbeat music) And if you liked the video, you know what to do. (computer chiming) Thanks for sticking with me, catch the crazy and pass it on. (upbeat music) (air whooshing)",
    "transcript_keywords": [
        "Apple silicon",
        "Apple",
        "Mac",
        "Intel Macs",
        "Intel",
        "Intel Mac apps",
        "Apple silicon Mac",
        "silicon",
        "Intel Mac",
        "apple silicon transition",
        "Macs",
        "Mac Mini",
        "windows",
        "ARM",
        "silicon Mac",
        "run",
        "Mac apps",
        "apps",
        "transition",
        "performance"
    ],
    "transcript_entity_values": [
        "Rosetta",
        "the Mac Mini",
        "two",
        "68",
        "2006",
        "2",
        "GPU",
        "G4",
        "one",
        "two years",
        "Newton",
        "macOS",
        "about 1000",
        "400 quadrillion",
        "a DOS Card",
        "iPads",
        "Apple silicon Mac",
        "years",
        "Apple",
        "Power Mac",
        "max",
        "10 years",
        "Boot Camp",
        "SoC",
        "Mac OS X",
        "Rene Richie",
        "Mac",
        "at least one",
        "the Boot Camp Assistant",
        "1994",
        "first",
        "Microsoft",
        "iMac",
        "G3",
        "Rosetta 2",
        "Basso",
        "40 pound",
        "WWDC",
        "415 petaflops",
        "iPhones",
        "Creative Cloud",
        "Macs",
        "Adobe",
        "App Store",
        "Bionic",
        "10 years later",
        "PowerBook",
        "iPad Pro",
        "Tim Cook",
        "iPad",
        "today",
        "T1",
        "Jonathan Morrison",
        "mouse click",
        "the iPad Pro",
        "Mac Mini",
        "Xcode",
        "Rosetta",
        "Windows",
        "just 10 years",
        "Universal 2",
        "2010",
        "the end of 2020",
        "Intel Mac",
        "Mac OS",
        "1000",
        "G5",
        "400",
        "Mac",
        "T2",
        "64",
        "Rosetta",
        "G4",
        "2001",
        "iMac",
        "MacBook Pro",
        "A4",
        "Fugaku",
        "a few days",
        "Intel Macs",
        "Intel",
        "second",
        "the day"
    ],
    "transcript_entity_types": [
        "NORP",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "EVENT",
        "QUANTITY",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE"
    ],
    "vector": [
        -0.042122628539800644,
        0.010496765375137329,
        0.06743256747722626,
        -0.0493050254881382,
        0.036728352308273315,
        -0.06428109109401703,
        0.06709855794906616,
        0.010502374731004238,
        -0.01604343205690384,
        -0.002290106378495693,
        0.05371876806020737,
        0.004534021019935608,
        -0.002669865731149912,
        -0.02423187531530857,
        -0.011623737402260303,
        -0.01521483063697815,
        0.10762674361467361,
        -0.03944065049290657,
        -0.014833847060799599,
        0.026228507980704308,
        0.039805732667446136,
        -0.05158574506640434,
        -0.00849243439733982,
        0.02751278690993786,
        0.011792439967393875,
        0.054689645767211914,
        0.0982576534152031,
        -0.03834426403045654,
        -0.06901711225509644,
        -0.014225351624190807,
        -0.03057415410876274,
        0.04231591522693634,
        0.07553564012050629,
        0.005505389999598265,
        0.06542390584945679,
        -0.06299017369747162,
        0.05889108404517174,
        -0.07070252299308777,
        -0.0875856950879097,
        -0.11119797825813293,
        -0.07188988476991653,
        -0.03978550806641579,
        0.10526806861162186,
        0.06201448664069176,
        0.05891704931855202,
        0.02272208407521248,
        0.0795837864279747,
        -0.1200672909617424,
        -0.03699709475040436,
        0.025882262736558914,
        -0.014180712401866913,
        -0.07613403350114822,
        0.023764122277498245,
        0.0560639314353466,
        -0.02600923366844654,
        0.009233596734702587,
        0.037691518664360046,
        0.013050953857600689,
        0.04016333445906639,
        0.06941807270050049,
        0.025388693436980247,
        -0.1081099584698677,
        -0.00833936408162117,
        0.057333432137966156,
        0.01047532632946968,
        -0.027481650933623314,
        0.06415794044733047,
        -0.040773600339889526,
        0.013979512266814709,
        -0.06525164097547531,
        0.06096559017896652,
        -0.0868154913187027,
        0.01867777854204178,
        0.06731075048446655,
        -0.02458101697266102,
        -0.027266306802630424,
        0.0572497732937336,
        -0.04757880046963692,
        0.04953755438327789,
        -0.05024192854762077,
        -0.003477297956123948,
        0.01261481735855341,
        -0.035941313952207565,
        -0.018416285514831543,
        0.0673602968454361,
        -0.006013642530888319,
        -0.05943121761083603,
        -0.0097109479829669,
        -0.027707509696483612,
        -0.05348575487732887,
        -0.04823413863778114,
        0.07890131324529648,
        0.01580986939370632,
        -0.03309847414493561,
        0.09371969848871231,
        -0.033893898129463196,
        -0.042204976081848145,
        -0.03316231817007065,
        -0.01206640899181366,
        0.038567475974559784,
        0.03313324227929115,
        0.0910973772406578,
        0.019338835030794144,
        0.007544853258877993,
        -0.006079013459384441,
        -0.015043752267956734,
        -0.02838793769478798,
        0.08048424869775772,
        0.005236256867647171,
        0.07437807321548462,
        0.005654742009937763,
        0.042348556220531464,
        -0.008411374874413013,
        0.01141748484224081,
        0.07080280780792236,
        -0.04604704678058624,
        7.717042171861976e-05,
        0.036915700882673264,
        0.076960489153862,
        0.019313011318445206,
        -0.04998494312167168,
        -0.015491465106606483,
        -0.0952763557434082,
        -0.029494909569621086,
        -0.015700843185186386,
        0.06374602019786835,
        -0.10931678116321564,
        -8.242237616889634e-34,
        0.001238904194906354,
        0.04828144609928131,
        -0.042877014726400375,
        -0.05138140916824341,
        -0.06697758287191391,
        -0.057792846113443375,
        0.05027345195412636,
        0.0010610087774693966,
        0.025135967880487442,
        0.008709924295544624,
        -0.03380157798528671,
        -0.05523885414004326,
        -0.043626535683870316,
        0.08938176184892654,
        0.040593765676021576,
        -0.08240433037281036,
        -0.0024941726587712765,
        -0.06186414510011673,
        0.034613173454999924,
        0.01968412473797798,
        -0.014668215997517109,
        0.034871906042099,
        0.012926378287374973,
        -0.04486678168177605,
        0.033577173948287964,
        0.02709394134581089,
        0.006379456724971533,
        -0.020871290937066078,
        0.03147513046860695,
        0.031048523262143135,
        -0.08068794757127762,
        0.02545989863574505,
        0.0018295220797881484,
        -0.10236137360334396,
        0.011367189697921276,
        -0.012847904115915298,
        -0.031418327242136,
        -0.09187819808721542,
        0.019518395885825157,
        0.02213074080646038,
        -0.04221303388476372,
        0.05432260408997536,
        -0.02522912807762623,
        -0.054585397243499756,
        0.02849297970533371,
        0.014514491893351078,
        -0.03297528997063637,
        0.02124526910483837,
        -0.01071234606206417,
        -0.06236514449119568,
        -0.025098873302340508,
        0.03128476068377495,
        0.06090256944298744,
        -0.027643153443932533,
        0.019553009420633316,
        0.0054672895930707455,
        0.04439406841993332,
        -0.059049706906080246,
        0.03864504024386406,
        0.09293203800916672,
        -0.018419310450553894,
        0.019961941987276077,
        0.0003379050176590681,
        0.09094402939081192,
        -0.07873746752738953,
        0.0740131288766861,
        0.0794125348329544,
        0.08785191923379898,
        -0.10515555739402771,
        0.08637940138578415,
        -0.02369842492043972,
        -0.04469911754131317,
        -0.011122292838990688,
        -0.06237804889678955,
        -0.032834336161613464,
        -0.02691769041121006,
        -0.0735766738653183,
        0.003792964853346348,
        -0.06188509240746498,
        0.04399056360125542,
        0.0038864861708134413,
        -0.01350736990571022,
        -0.045819468796253204,
        0.007627695798873901,
        -0.042727287858724594,
        0.065955750644207,
        0.04078417643904686,
        -0.036692339926958084,
        0.03716879338026047,
        -0.023878352716565132,
        0.016037829220294952,
        -0.037153854966163635,
        0.006326273549348116,
        0.05155321955680847,
        -0.06515277922153473,
        -1.8954475391604908e-33,
        0.022682569921016693,
        -0.02297862246632576,
        -0.06085389479994774,
        0.03314674273133278,
        -0.07203560322523117,
        -0.056255925446748734,
        0.006779457442462444,
        -0.03049752674996853,
        -0.05162457004189491,
        -0.046625278890132904,
        0.00236479751765728,
        -0.030113380402326584,
        -0.028660302981734276,
        -0.032377131283283234,
        -0.02051232010126114,
        -0.014066222123801708,
        -0.07786861062049866,
        -0.07359667867422104,
        0.07715989649295807,
        0.015451171435415745,
        0.12678484618663788,
        0.013194898143410683,
        0.008837033994495869,
        -0.0026113507337868214,
        0.012598576955497265,
        -0.08081243932247162,
        -0.051842913031578064,
        0.09120195358991623,
        0.046140771359205246,
        -0.0222450140863657,
        -0.008666018955409527,
        -0.07698146253824234,
        0.05317588895559311,
        0.004005815368145704,
        0.07762952893972397,
        0.02658829279243946,
        0.010026885196566582,
        -0.04656112939119339,
        0.00747434189543128,
        -0.015013772994279861,
        0.05708387494087219,
        -0.00018592790002003312,
        -0.026494093239307404,
        0.026859870180487633,
        0.00746724009513855,
        0.05427343770861626,
        -0.03187856823205948,
        0.00022963579976931214,
        0.05083668977022171,
        -0.12895368039608002,
        -0.02586115524172783,
        -0.03664158284664154,
        0.012670312076807022,
        0.006045800633728504,
        -0.032379377633333206,
        -0.05178927257657051,
        -0.02457365021109581,
        0.11498451232910156,
        -0.033115554600954056,
        -0.01053741853684187,
        0.08212597668170929,
        -0.028734520077705383,
        0.08094780892133713,
        -0.08420874923467636,
        -0.005975472275167704,
        -0.020068008452653885,
        0.03225080296397209,
        0.0021045533940196037,
        -0.03078320249915123,
        0.0004273475497029722,
        0.041321009397506714,
        -0.017046606168150902,
        0.037766896188259125,
        -0.0522906668484211,
        -0.04544226452708244,
        0.02361096255481243,
        -0.00932848360389471,
        -0.05782617628574371,
        -0.05268487706780434,
        -0.02076813392341137,
        0.026596764102578163,
        0.06392613798379898,
        0.03070175088942051,
        0.10002991557121277,
        0.021801717579364777,
        0.03984062001109123,
        0.039597541093826294,
        0.04046463593840599,
        -0.06757020950317383,
        -0.0008667775546200573,
        -0.07861088961362839,
        -0.046010226011276245,
        -0.04881826043128967,
        0.04288502782583237,
        -0.17772936820983887,
        -5.164189786910356e-08,
        0.0486016683280468,
        -0.05119938775897026,
        0.017379071563482285,
        -0.018899718299508095,
        -0.018444538116455078,
        -0.024426080286502838,
        0.0031129266135394573,
        -0.034039705991744995,
        0.1297408789396286,
        0.00010999718506354839,
        0.03592430427670479,
        -0.05676783248782158,
        -0.062000811100006104,
        -0.00032682917662896216,
        0.08073519170284271,
        0.06538289785385132,
        -0.06799373030662537,
        0.0487811341881752,
        0.026504896581172943,
        -0.0678521990776062,
        -0.012907841242849827,
        0.029231075197458267,
        0.06069355085492134,
        -0.04734015092253685,
        -0.017909826710820198,
        0.05621182918548584,
        -0.027129776775836945,
        0.06976884603500366,
        0.04176781326532364,
        0.036941397935152054,
        -0.11885306239128113,
        -0.036841314285993576,
        0.04951116815209389,
        0.02731497399508953,
        0.04994675889611244,
        -0.02774112857878208,
        0.026602406054735184,
        0.04680787771940231,
        0.13808701932430267,
        -0.03509165346622467,
        -0.07278361916542053,
        -0.12024711817502975,
        -0.03339399769902229,
        -0.012946981005370617,
        -0.027664005756378174,
        -0.014331496320664883,
        -0.09008791297674179,
        -0.033128514885902405,
        -0.04582710564136505,
        0.10391473025083542,
        0.022629816085100174,
        -0.007276556920260191,
        0.02559475228190422,
        0.07419856637716293,
        -0.014105028472840786,
        0.027905693277716637,
        0.010012335143983364,
        -0.08374229818582535,
        -0.003988522104918957,
        0.037493444979190826,
        0.10479632019996643,
        -0.06659463793039322,
        0.03374464437365532,
        0.01988845318555832
    ]
}