{
    "id": "tg9Pk2omqPs",
    "title": "Polaroid Originals OneStep+ Camera! Buying things from Instagram Ads!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-04-23T15:22:09Z",
    "video_url": "https://www.youtube.com/watch?v=tg9Pk2omqPs",
    "category": "Science & Technology",
    "tags": [
        "buying things from instagram ads",
        "facebook ads",
        "targeting",
        "polaroid camera review",
        "polaroid originals camera",
        "unboxing",
        "review",
        "test photos",
        "photography"
    ],
    "views": 732743,
    "likes": 16150,
    "comments_count": 862,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine, and today we are going to be talking about this. This is the newish Polaroid camera. This is the OneStep Plus. They have two different versions they came out with. This one has Bluetooth and it also has a couple other features, but it still is like those vintage Polaroid cameras that you guys have seen in the past. Like this develops film, like on the back here it says that it will develop within 10 to 15 minutes. That's a lot of minutes, but I'm excited to try this out. But here's the thing, Facebook and Instagram have been targeting me, and they have been targeting me hardcore because every time I see a freakin' ad pop up (gasp) it is something that I've either talked about or I've wanted or I've thought in my mind. Long story short, this was an ad, and I'm curious. We're gonna unbox this and then we're gonna take it out. I also have some film here that I got. I probably should've got a little bit more because this will only take eight photos. Eight! So now with this guy, this will also connect to Bluetooth like I said, but what's cool about it is you can do different things when you connect it to Bluetooth, so you can control the camera, you can do remote, manual mode, self timer, double exposure, light painting, noise trigger. I'm not sure what that is but we will find out. So let's open it up. Mmmmm. Shake it like a Polaroid picture It's got directions, eh. Oh stickers. Wow. Cool, okay. Okay. Oh, jeez! You can't be doing things like that! (laughing) Oh! I think it's ready to go, I'm gonna do a portrait. Neutral, a lighter image, or darker image. So you can adjust exposure here. You've got your focus here. You've got your on and off here. And this is, I guess for flash. Whoopsies, I just took a picture. That's gonna be my best work. That was a complete accident. Okay, I'm gonna try and take a selfie. What if I don't want the flash on? Blinking blue, camera is in pairing mode. Oh, it's ready to connect to Bluetooth. We are not ready for that yet, or are we? Oh it's already, it's already here! That's my camera! Set timer, double exposure, this is something that I'm excited about. Light painting! (gasp) So I'm gonna take a picture of myself. (click) I thought the flash.. (camera whirring) Was gonna be off, must not. Okay. Alright, well I guess I'll let those develop. I'm gonna charge this up and then we're gonna take it outside and take some photos. See what we can capture. (upbeat music) So we're down here in Santa Monica now and I've got the camera and it should be charged up. I charged it for quite a while. And we're gonna take some pictures, I'm gonna also pair it to the app so that I can do some cool things. So I want to take a double exposure. So I'm gonna take a picture of myself first. Okay, am I ready? I don't know. Okay. Now, a little tip that we found out is there's a button back here, this will force the flash to not fire. So, we will take a picture over here. Oh I gotta look through here! (camera whirring) Here's my photo. There's Jenna, a wild Jenna. - Wild Jenna today. - Show me your shirt. Show me that shirt. Yeah you look good. Oh my god, I can only take four more pictures. Ready. (camera whirring) I feel like I'm from 1984. I do want to do a test of, kind of showing which each one these exposures kinda would look like. - Okay. - This is Tyler, Tyler Whoa. So what we're gonna do is, we're gonna do the low exposure, the middle one, and then the high. - Yes. - And see what the difference is. - Yes. - Okay, here you go. - Okay, so right now we're on the darker mode, I believe. Here we go. Three, two one. (camera whirring) Wow, that's satisfying. - [Justine] I know. - [Tyler] That's very satisfying. Okay so now let's test the neutral exposure setting. - [Justine] Yeah. I'll smile, maybe I'll give them another little. - Yeah, oh yeah. (camera whirring) - [Justine] Here it is. - [Tyler] Fun. - [Justine] Cool. - [Tyler] And now we're doing the bright setting. - Bright and shinning like my super shinning personality. (camera whirring) I will never make that pose again. - [Jenna] I was wondering why you were doing that. Oh you look beautiful. Oh, oh you blinked. - [Tyler] You look so good. - [Justine] Oh, did I? (laughing) - [Tyler] Here you go. - Thank you. - [Tyler] Oh, I think you need to put more film in there now. - Oh my god, oh my gosh, should I put the rose gold film in? (gasp) Oh! - We're gonna try the landscape setting, so we're gonna be a little further away from our subject, so we're gonna use that. I'm backing way up here, okay. (camera whirring) That's gonna be cool. - I blinked. No, I'm just kidding, I don't know if I did. Okay, look at this rose gold frame though. Oh shake it, shake. Don't shake it. - [Tyler] Something like that. - So you have to use the app to do double exposure so you put the camera where you want it. - Or, how do you do it? - You just push the button. - Can I do it? - Yeah you can do it. - Okay, cool. Okay, so we're gonna do a portrait, we're back on the portrait setting here, as the first photo. Oh god, okay, we can do this. Cool. And, then the second photo, I'm just gonna shoot straight up at this tree for like a weird texture. (camera whirring) - Huh. We should try this, the noise trigger. - [Tyler] Oh yeah, yeah, yeah. - Okay, so once it's turned on, the noise trigger will automatically take a picture when the volume is high enough. I'm gonna click okay. - Yeah, right, yeah right there. - Tur peh tur! (laughing) So you can set the noise trigger so if you want it to be super loud. Okay so I'm gonna try to do a jump and I'm gonna try have it capture my jump. A tur peh tur! Ha ur ur! (laughing) Okay. A tur peh tur! (laughing) I think it worked. - [Jenna] That man was shaking his head out there on the balcony. - He should. Okay we've got some black and white that we're gonna try now. So the first thing I'm gonna try with the black and white is do a double exposure. I think the double exposure is probably one of my favorite features in this thing. It's so easy to do. Let's do it. Okay, there's my first picture. And now, I'm gonna get super close up. (camera whirring) Yeah, that's my new profile pic. Jenna come here, I wanna take a picture of you. - Oh I moved. You didn't give me a countdown. - There's no time for that. I'm sure it'll be just fine. Now I'll just take a picture of, I don't know. I'll just take some pictures. (camera whirring) These are gonna be going in the museum. Let me get a picture of all of our feet. Let's all get our feet in here. Okay, okay, this is cool. This is gonna be in the museum. (camera whirring) Okay, I'm gonna get a selfie. (camera whirring) Two pictures left. Okay Tyler, look super cool. (camera whirring) That's nice, that's nice. That's very nice. How about, I'll just take another one of these. (camera whirring) That's nice. These seem to start developing faster than the color. Okay I'll add these to the collection. We are back from our adventure. Now it's time to see what we got. These rose gold frames are really, really pretty. So the focal length of the selfie is actually really good. This one looks so cool, it's like a vintage grilled cheese. This was the one where I was using the sound activated. It's not my best face but. Tyler look at that, look at you. (gasp) This is so great. The double exposure, it's so awesome. What else do we have. Oh my gosh, this was the noise activated one where I jumped up in the air and said, \"tur peh tur.\" I feel like if you're trying to decided between which one to get, I would kind of recommend this one because this will allow you to connect to the app and you can do all kinds of things like the double exposure and you can use your phone to control it. It also has this thing that I saw while we were driving in the car on our way to shoot. It has this little setting where you can actually scan the photos, so you can archive them into your phone, which it's basically just taking a picture of the Polaroid. So I don't know if it does anything special. Let's try it out. Oh, it just took the picture by itself. - [Tyler] Whoa. - Whoa. Okay I wasn't even, like I didn't even do anything, it just did it by itself. This is a really cool idea. So it does allow you to sort of save your pictures into the camera roll. Look at that. Thank you guys so much for watching, this was really fun. Let me know if there's anything else you guys would like me to check out. Also, let me know if there's any Instagram ads, take screenshots of them and send them to me because I'd love to see what you guys are getting served. And if it's something cool, maybe I'll buy it, check it out and I'll give you guys credit for sending me in that image. Anyway, that's it, these are my photos, I'm excited to play with this a little bit more. Also, go check out Tyler's Instagram. He's the one helping me film this video and he took some of these photos and his photos are so good and they're incredible. Look he's got a little smile on his face. - [Tyler] Grrrr. - Grrr. They're really cool so go check it out and I will see you guys in my next video. Peace. (upbeat music) A tur peh tur!",
    "transcript_keywords": [
        "picture",
        "double exposure",
        "cool",
        "exposure",
        "Tur peh tur",
        "Yeah",
        "Tur",
        "double",
        "Tur peh",
        "peh tur",
        "camera",
        "Justine",
        "Polaroid",
        "pictures",
        "Bluetooth",
        "guys",
        "Tyler",
        "photos",
        "Jenna",
        "ready"
    ],
    "transcript_entity_values": [
        "second",
        "one",
        "Eight",
        "Justine",
        "Justine] Cool",
        "Two",
        "the OneStep Plus",
        "Instagram",
        "tur peh tur",
        "Bluetooth",
        "minutes",
        "four",
        "eight",
        "today",
        "two",
        "Three",
        "1984",
        "Polaroid",
        "Tyler] Fun",
        "Facebook",
        "Tyler",
        "first",
        "Santa Monica",
        "10 to 15 minutes",
        "Jenna"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "EVENT",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "GPE",
        "TIME",
        "PERSON"
    ],
    "vector": [
        -0.06637296825647354,
        -0.07508224248886108,
        -0.015444686636328697,
        -0.11786776036024094,
        0.056602369993925095,
        0.04218484088778496,
        0.07539337128400803,
        0.05806541070342064,
        -0.008109181188046932,
        0.07933338731527328,
        0.03673824667930603,
        0.023660289123654366,
        0.0035102772526443005,
        0.021427039057016373,
        0.033430345356464386,
        0.046521447598934174,
        0.04747667536139488,
        -0.019772687926888466,
        0.024769598618149757,
        0.030126171186566353,
        -0.044234246015548706,
        -0.062071964144706726,
        0.04640170931816101,
        -0.0025947175454348326,
        0.001622318523004651,
        0.07411246746778488,
        -0.0009922640165314078,
        0.06630346179008484,
        -0.06876032054424286,
        -0.050911515951156616,
        -0.0046990918926894665,
        0.04950062930583954,
        0.0830138623714447,
        0.019780753180384636,
        -0.0015912536764517426,
        -0.05060635507106781,
        0.07798981666564941,
        -0.015228000469505787,
        -0.06539633125066757,
        0.012135043740272522,
        0.030384868383407593,
        -0.018712546676397324,
        -0.006129348650574684,
        -0.055822841823101044,
        -0.059555161744356155,
        -0.07234173268079758,
        -0.011387714184820652,
        -0.022494325414299965,
        0.058184120804071426,
        0.028193535283207893,
        -0.06462254375219345,
        -0.024488631635904312,
        0.03665564954280853,
        0.014070122502744198,
        -0.07290241122245789,
        -0.008354505524039268,
        -0.11414070427417755,
        -0.031131811439990997,
        0.025874638929963112,
        -0.08858320862054825,
        0.00803073775023222,
        -0.0422373041510582,
        0.001309251063503325,
        0.05386332795023918,
        -0.04586471617221832,
        -0.020548898726701736,
        -0.002888489281758666,
        -0.010824725031852722,
        0.012930425815284252,
        0.0195106603205204,
        -0.11620119959115982,
        0.0720052644610405,
        -0.037134766578674316,
        0.05746924504637718,
        -0.06382905691862106,
        0.05559210851788521,
        0.04578366130590439,
        -0.0342307947576046,
        -0.023143058642745018,
        0.00593043677508831,
        0.03991201892495155,
        -0.07131822407245636,
        -0.09504704177379608,
        0.008204302750527859,
        0.029416922479867935,
        0.0341012068092823,
        0.05757864564657211,
        0.02357921376824379,
        -0.033252302557229996,
        -0.05251844599843025,
        -0.12962566316127777,
        0.028500521555542946,
        -0.011277920566499233,
        -0.047781988978385925,
        -0.03207629919052124,
        -0.039014555513858795,
        -0.035977061837911606,
        -0.01934649795293808,
        -0.041835181415081024,
        0.04763607308268547,
        0.047673579305410385,
        -0.05682811141014099,
        0.0029320779722183943,
        -0.04506395012140274,
        -0.0634412169456482,
        -0.091082863509655,
        -0.04588161036372185,
        0.007064017001539469,
        0.07201121002435684,
        0.040061742067337036,
        -0.05640985816717148,
        0.01791420765221119,
        -0.060700539499521255,
        -0.057168588042259216,
        -0.009461196139454842,
        0.09196341037750244,
        -0.05209313705563545,
        0.07741629332304001,
        0.04668698459863663,
        0.03508599475026131,
        0.0029397241305559874,
        -0.08167953044176102,
        -0.007999805733561516,
        0.08106617629528046,
        -0.024188682436943054,
        0.002919859951362014,
        -0.05608674883842468,
        1.308565747996743e-32,
        0.0012454070383682847,
        0.14345517754554749,
        0.031001033261418343,
        0.023627137765288353,
        -0.053942371159791946,
        0.022434083744883537,
        -0.00980420783162117,
        0.11257124692201614,
        -0.03724425658583641,
        0.019532008096575737,
        -0.04726235941052437,
        0.055974751710891724,
        -0.036310795694589615,
        0.0508854053914547,
        0.03287035971879959,
        -0.05371960997581482,
        -0.007165777496993542,
        -0.043212663382291794,
        -0.014508168213069439,
        -0.015393510460853577,
        -0.031060930341482162,
        0.007768617942929268,
        0.006290195509791374,
        0.08190925419330597,
        0.09017746895551682,
        0.046940878033638,
        0.06589175760746002,
        0.0005837783101014793,
        0.06903256475925446,
        -0.003796686651185155,
        -0.02822229638695717,
        -0.01789068430662155,
        -0.04940928518772125,
        -0.018460500985383987,
        -0.013991939835250378,
        0.007271758746355772,
        -0.053490493446588516,
        -0.03358679637312889,
        0.02050027623772621,
        -0.03564901649951935,
        -0.00062962417723611,
        0.02182423695921898,
        -0.06376345455646515,
        -0.02548365853726864,
        0.0699697956442833,
        0.033424366265535355,
        0.016850139945745468,
        0.046054039150476456,
        0.006405223626643419,
        0.015278846956789494,
        -0.03214697167277336,
        0.022380903363227844,
        -0.07511064410209656,
        -0.03114686906337738,
        -0.04936199262738228,
        -0.07716679573059082,
        -0.04565814882516861,
        0.05059598386287689,
        0.030665656551718712,
        0.02108011208474636,
        0.0032749450765550137,
        0.005617554299533367,
        -0.02536236122250557,
        -0.05321667343378067,
        -0.06791217625141144,
        0.1312260925769806,
        0.08509267121553421,
        -0.0717167779803276,
        0.028375282883644104,
        0.020733298733830452,
        0.01825694926083088,
        -0.023829644545912743,
        0.05791270732879639,
        0.033979661762714386,
        0.05062307417392731,
        0.06704007834196091,
        -0.07364357262849808,
        -0.06189008057117462,
        0.03951616212725639,
        -0.009774426929652691,
        -0.14984643459320068,
        0.027838969603180885,
        0.02185964211821556,
        0.10402689129114151,
        -0.030543128028512,
        -0.04483572393655777,
        0.048109784722328186,
        -0.011296250857412815,
        -0.023081012070178986,
        0.04771895706653595,
        -0.0013869794784113765,
        0.06834544986486435,
        -0.06822775304317474,
        -0.020293155685067177,
        -0.04033922031521797,
        -1.2776139531820352e-32,
        -0.052249517291784286,
        0.030285324901342392,
        -0.07766278833150864,
        -0.037354517728090286,
        0.033044785261154175,
        -0.014050955884158611,
        0.008099362254142761,
        0.10757238417863846,
        0.08501362800598145,
        -0.05381550267338753,
        0.041683029383420944,
        -0.09343992918729782,
        -0.07545636594295502,
        -0.020498692989349365,
        -0.06496815383434296,
        -0.03170935437083244,
        -0.029935788363218307,
        -0.052565205842256546,
        0.054129891097545624,
        -0.03733350336551666,
        0.054723065346479416,
        0.11846961826086044,
        0.08209586888551712,
        0.07352633029222488,
        0.015270319767296314,
        0.0478273406624794,
        0.0718613862991333,
        0.04830335080623627,
        0.07586520910263062,
        0.038468752056360245,
        0.005384610965847969,
        -0.03282111510634422,
        -0.030823316425085068,
        -0.0012755945790559053,
        0.06702698767185211,
        0.0635284036397934,
        0.012620021589100361,
        0.01723184436559677,
        0.043583523482084274,
        -0.06294533610343933,
        -0.01645013876259327,
        -0.02208644710481167,
        0.03442978858947754,
        0.0011413560714572668,
        0.0015034914249554276,
        -0.14783048629760742,
        -0.05867772921919823,
        0.057564280927181244,
        -0.012998038902878761,
        -0.015180164948105812,
        -0.08978713303804398,
        -0.020642053335905075,
        -0.04178624227643013,
        -0.022796761244535446,
        -0.052652981132268906,
        -0.018045857548713684,
        -0.026853295043110847,
        -0.050616662949323654,
        0.035517361015081406,
        -0.003112209727987647,
        0.03856872767210007,
        -0.016325034201145172,
        -0.060247503221035004,
        -0.034457042813301086,
        -0.044032853096723557,
        -0.07246217876672745,
        0.09500593692064285,
        -0.00016044134099502116,
        -0.03455289080739021,
        0.025842398405075073,
        -0.020493000745773315,
        0.0213291235268116,
        0.018239842727780342,
        -0.02129095233976841,
        0.02789977379143238,
        0.005144602619111538,
        -0.05453285202383995,
        0.02175353839993477,
        0.059906039386987686,
        -0.06184951961040497,
        -0.05175874009728432,
        0.034058958292007446,
        -0.0007217066595330834,
        0.07412508875131607,
        0.1160208061337471,
        0.08065632730722427,
        0.07805898785591125,
        -0.019610518589615822,
        -0.011345935985445976,
        0.07890564948320389,
        0.06407628953456879,
        0.06767305731773376,
        0.002527777571231127,
        0.13094764947891235,
        -0.05180845037102699,
        -6.073894809333069e-08,
        0.07651237398386002,
        0.006312187295407057,
        0.006479569710791111,
        0.02514352835714817,
        0.03155633434653282,
        -0.09676279872655869,
        -0.0325080081820488,
        -0.017674719914793968,
        0.08743572235107422,
        -0.08925176411867142,
        0.052849870175123215,
        0.004335716832429171,
        -0.008037745952606201,
        0.08279073238372803,
        0.03734318166971207,
        0.008809284307062626,
        -0.061372317373752594,
        0.0691540390253067,
        -0.02556540071964264,
        -0.03487804904580116,
        -0.032778896391391754,
        0.009247899986803532,
        0.018913215026259422,
        -0.0444786362349987,
        0.05916716530919075,
        -0.002223987365141511,
        -0.034806251525878906,
        -0.07551506906747818,
        0.04159354418516159,
        0.03383980318903923,
        -0.05815510451793671,
        -0.009226693771779537,
        -0.012007382698357105,
        0.006818041205406189,
        -0.022404521703720093,
        -0.0348474346101284,
        -0.03907649219036102,
        -0.041261281818151474,
        0.010408753529191017,
        -0.022943949326872826,
        0.008774332702159882,
        -0.10761989653110504,
        -0.04425695911049843,
        0.002745564328506589,
        0.013478390872478485,
        -0.061136890202760696,
        0.04046297445893288,
        -0.1244671419262886,
        -0.04649544134736061,
        -0.02808983065187931,
        -0.08002179861068726,
        0.011663149110972881,
        0.015180358663201332,
        -0.06348906457424164,
        0.04116562381386757,
        0.0047560506500303745,
        0.02743171714246273,
        0.034053921699523926,
        -0.002748655853793025,
        0.02190522290766239,
        0.03163842856884003,
        0.0015829637413844466,
        -0.06269854307174683,
        0.0460643395781517
    ]
}