{
    "id": "TgU7mQz92Vo",
    "title": "iPhone 7 Review: Beyond The Boring",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-09-21T23:08:26Z",
    "video_url": "https://www.youtube.com/watch?v=TgU7mQz92Vo",
    "category": "People & Blogs",
    "tags": [
        "iphone 7 review",
        "iphone 7 unboxing",
        "iphone 7 headphones",
        "iphone 7 vs samsung galaxy s7",
        "iphone 7 vs 7 plus",
        "iphone 7 vs iphone 7 plus",
        "mrmobile",
        "pocketnow",
        "imore",
        "michael fisher",
        "apple",
        "iphone 7",
        "iphone 7 jet black",
        "iphone 7 black"
    ],
    "views": 1091763,
    "likes": 21769,
    "comments_count": 2091,
    "description": "For another year running, the new iPhone is a lot like the old iPhone. In looks, in functionality, in its very essence, the iPhone 7 is a device of old ideas, repackaged: the water resistance, the little conveniences, even the assassination of the noble headphone jack ... none of it is truly *new* to the smartphone world. But Apple (as always) is less about novelty than about presenting existing technology in a new and interesting way. The iPhone 7 lives up to that legacy -- but you need to be able to see beyond the boring bits to realize it. Join Michael Fisher for MrMobile's iPhone 7 review, and stay tuned for the iPhone 7 Plus review coming soon!    [SUBSCRIBE]     [ABOUT THIS VIDEO]  MrMobile's iPhone 7 Review was published after six days with a retail iPhone 7 handset (32GB, Black) purchased from Apple and used on T-Mobile US in New York City and Greater Boston. The device was paired to an Apple Watch Series 2 on the final day of testing.   [PRODUCTS IN THIS VIDEO]  Apple iPhone 7 in Black   Apple iPhone 7 Plus in Black   FIIL Diva Pro at Kickstarter:   Bose QuietComfort 35:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Dubday\" by Cymatix, available at Premium Beat:   \"Financial District\" by Olive Musique, available at Premium Beat:   \"Hit The Floor\" by Gyom, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/23",
        "http://mrmobile.tech/1w",
        "http://mrmobile.tech/1j",
        "http://mrmobile.tech/1k",
        "http://www.premiumbeat.com/royalty_free_music/songs/dubday",
        "http://www.premiumbeat.com/royalty_free_music/songs/financial-district",
        "http://www.premiumbeat.com/royalty_free_music/songs/hit-the-floor",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] The new iPhone is a lot like the old iPhone. This is a phone of old ideas repackaged. The water resistance, the little conveniences, even the assassination of the noble headphone jack, none of it is truly new. But Apple, as always, is less about novelty than about repackaging what already exists in a new and interesting way. The iPhone 7 lives up to that legacy, you just need to be able to see past the boring bits to realize it. I'm Michael Fisher, and this is the iPhone 7 review from Mr. Mobile. (enthusiastic instrumental music) (moves into energetic instrumental music) Let me lay something out here. In the past few months I've criticized a great many Android manufacturers for derivative industrial design, and by no means does Apple get a pass. In the hand the iPhone 7 feels nearly identical to the two generations of iPhone that came before it. Unless you get the incredibly scratch-prone, jet-black version instead of the matte-black finish on my review device. Yes, the minimized antenna inlays are welcome, and the new casting around the camera lens is impressive, but these are details that only the discerning eye can appreciate. And upfront, you've got a display whose resolution hasn't changed since 2014. Stuff like this is part of the reason phone nerds get up in arms about people spending so much money on iPhones. On the surface Apple seems to be selling yesterday's leftovers to a gullible populace. But that's not true. The truth is you don't need crazy high resolution on a display this small, and what is lacks in pixel density, it makes up for in color balance. While the 7 is just as thin as and slightly lighter than last-year's iPhone, it is water and dust resistant. This is something I've confirmed with the help of several fountains and several stupid shower selfies. And the single speaker has been split into two, now placed above and below the display for more immersive sound than any iPhone to date. Where the hell my phone, hey Where the hell my phone Where the hell my, where the hell my phone, huh (iPhone music continues) Speaking of sound, let's talk about that headphone jack for a second. Yes, it's gone. And, no, I don't really miss it. Bluetooth headphones have become a big part of my life since using the Moto Z earlier this year, which also didn't offer a headphone jack. If you're an audiophile and use the kind of fidelity only an analog wired connection can deliver, or if your car doesn't have Bluetooth, obviously, this isn't the phone for you. Everyone else will either learn to live with the Lightning EarPods in the box, or use their existing headphones with Apple's included adapter, or use Bluetooth. The point is, you've got options. The space Apple saved by axing the headphone jack it filled back up with an improved Taptic Engine, the linear motor that gives the iPhone its good vibrations. Taptic response is everywhere on the iPhone 7. From the little bump when the notification shade bounces off the bottom of the screen, to the subtle clicks that tick off bearing marks in the compass and slots on click wheels to the artificial buzz of 3D touch. The iPhone feels more alive in the hand than ever before. And Taptic response is more important than ever to sell the illusion of the new Home button, which is actually a capacitive touch pad whose click is produced entirely by the Taptic engine. It feels so futuristic that the spring loaded buttons on older iPhones already feel clunky and dated to me. If your hands are wet or gloved, the button won't work, but Apple borrowed a page from Motorola and Nokia here with Raised Wake. The iPhone 7 will turn on its screen when you pull it from a pocket or pluck it from a tabletop. And it works pretty well in practice. From there it's just a firm press on the fingerprint scanner to jump into iOS 10. Now, personally, I still hate being locked into Apple's idea of a home screen. This astatic grid of icons that I only have the barest control over. And some of the precedence iOS established with the first iPhone are now woefully out of date. Like putting the back button in the least accessible corner of the screen. That said, I do like the new coat of paint on iOS 10. The Control Center keeps a lot of handy toggles within a thumb's reach. Widgets and frequently used apps have been broken out into a separate panel off to the left. Swiping down still lets you search for pretty much anything right from the home screen. And when you just don't want to be bothered, the palm inspired mute switch is still the simplest way to silence a phone. In other words, iOS 10 on the iPhone 7 is a really nice mix of old and new. Phone calls on the iPhone 7 are outstanding. I tested it on T-Mobile, and whenever I was talking to another T-Mobile customer with HD Voice, or doing a VoIP call over Wi-Fi, the sound quality was tremendous. Apple uses active noise cancellation in the ear piece which makes me feel...well tell them, Wesley. - I feel strange but also good. - What I mean is, it's a little disorienting in a loud room because it's actively removing noise from only one side of your head. But it does a phenomenal job of isolating the caller's voice so you can hear him or her. Back on software, day-to-day responsiveness is Apple's typical slick and quick. Though I found a few more minor hiccups than I expected in gaming. I also had one instance where the phone refused to unlock despite recognizing my thumb print. I figure these are teething issues with either the new A-10 Processor or iOS 10, but I mention them mainly to remind folks that, yes, even the iPhone is susceptible to the occasional bug. Finally, there's the camera which has seen almost every major component upgraded this year. By far the most notable of these is optical stabilization which smooths video in walking shots and allows for clearer long exposures in low light. Thanks to this, and probably thanks to the new larger aperture as well, the new iPhone delivered well in dim conditions. And photos taken everywhere else were fine. I say fine because while in a vacuum they're excellent, when you put them up against the closest competition from Samsung, the Galaxy S7, I actually tend to prefer the S7's pictures. Part of that is because I like Samsung's slightly larger-than-life saturation. But the S7's photos are also crisper, sharper in most conditions. The iPhone has a tendency to go soft. The iPhone 7 is still one of the fastest, most forgiving cameras out there. And while you're taking in a few more samples, let's talk endurance. You'll probably get through a day of moderate use with the iPhone 7. But step it up to heavy with even a little streaming radio or tethering and you should expect a low-battery warning before dinnertime. The nerdy side of me wants to lash out at the iPhone 7, to whine about the familiar design, to join the chorus of voices who say, \"This phone is too expensive.\" But the people buying iPhones don't need me to tell them that Apple's an expensive company. You should know that by now. And, more importantly, Apple doesn't deserve to be beaten down just for making an excellent product that's only marginally more excellent than last year's. Because, make no mistake, the iPhone 7 is an excellent smartphone, one of the best you can buy in 2016. Even if it's not the head turner it once was. Don't forget the iPhone 7's bigger sibling, folks. I'll be reviewing the 7 Plus shortly and the Apple Watch Series 2 as well. So make sure you're subscribed to Mr. Mobile on YouTube, so you don't miss it. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "phone",
        "headphone jack",
        "iPhones",
        "Taptic",
        "Apple Watch Series",
        "iPhone feels",
        "screen",
        "iOS",
        "Taptic Engine",
        "headphone",
        "Apple Watch",
        "hell",
        "jack",
        "Bluetooth",
        "Apple idea",
        "excellent",
        "Taptic response",
        "feels"
    ],
    "transcript_entity_values": [
        "the iPhone 7",
        "Taptic Engine",
        "iPhones",
        "the iPhone 7",
        "last year's",
        "a day",
        "7",
        "The Control Center",
        "Raised Wake",
        "T-Mobile",
        "Wi-Fi",
        "Samsung",
        "HD Voice",
        "Apple",
        "2016",
        "the 7 Plus",
        "YouTube",
        "earlier this year",
        "Bluetooth",
        "iOS 10",
        "Mobile",
        "this year",
        "Motorola",
        "Moto Z",
        "iPhone",
        "first",
        "VoIP",
        "jack",
        "the Apple Watch Series 2",
        "the Lightning EarPods",
        "2014",
        "two",
        "iOS 10",
        "S7",
        "iOS 10",
        "Nokia",
        "Wesley",
        "second",
        "A-10 Processor",
        "yesterday",
        "the past few months",
        "the spring",
        "Taptic",
        "iPhones",
        "The iPhone 7",
        "last-year's",
        "the Galaxy S7",
        "only one",
        "Michael Fisher",
        "one",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "NORP",
        "EVENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "FAC",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "LOC",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG"
    ],
    "vector": [
        -0.08855058252811432,
        0.0017972105415537953,
        0.11968407034873962,
        0.01164170540869236,
        -0.014275330118834972,
        -0.012159589678049088,
        -0.00865702610462904,
        0.04565281793475151,
        -0.02598932757973671,
        0.02675495110452175,
        0.026835711672902107,
        0.030364707112312317,
        -0.02608121745288372,
        0.047264136373996735,
        -0.024749422445893288,
        -0.02729690633714199,
        0.06028332933783531,
        -0.07382209599018097,
        -0.009784171357750893,
        0.010162925347685814,
        0.027423938736319542,
        0.007017099764198065,
        0.06139485538005829,
        0.020667755976319313,
        0.024609575048089027,
        0.03234569728374481,
        -0.06402182579040527,
        0.013901065103709698,
        0.005338091868907213,
        -0.03721342980861664,
        -0.06183895841240883,
        0.08822979032993317,
        0.07218077778816223,
        0.034014422446489334,
        -0.07326865196228027,
        -0.14933298528194427,
        0.06125738471746445,
        0.06112430617213249,
        -0.02554505504667759,
        -0.06407719850540161,
        -0.051193270832300186,
        -0.04442919045686722,
        0.00883155781775713,
        0.051554664969444275,
        0.01628072001039982,
        -0.0074596465565264225,
        0.06893333047628403,
        -0.04912925139069557,
        -0.013085732236504555,
        -0.04544638842344284,
        0.001344927935861051,
        -0.06076134741306305,
        -0.013684750534594059,
        0.02991924248635769,
        -0.060874875634908676,
        -0.043364692479372025,
        -0.04224199429154396,
        0.00524922925978899,
        0.07645739614963531,
        0.030380573123693466,
        0.05869884788990021,
        -0.0162483062595129,
        -0.008493059314787388,
        0.024556757882237434,
        -0.001144894165918231,
        -0.054335497319698334,
        -0.09945507347583771,
        -0.014626234769821167,
        0.029202623292803764,
        -0.022825105115771294,
        0.019997471943497658,
        0.026298101991415024,
        0.09506051242351532,
        -0.00292568514123559,
        0.029683910310268402,
        0.07608769834041595,
        0.006976351607590914,
        -0.03336535766720772,
        -0.07825168967247009,
        0.01040535420179367,
        0.05713425949215889,
        -0.054978203028440475,
        0.035512734204530716,
        -0.007874401286244392,
        0.06607109308242798,
        -0.00138628960121423,
        -0.03301554173231125,
        0.05756859481334686,
        -0.10225410759449005,
        -0.12390225380659103,
        -0.04189542680978775,
        0.1552453339099884,
        -0.06060988828539848,
        -0.07787344604730606,
        -0.003687055315822363,
        0.015289302915334702,
        -0.06204769387841225,
        -0.03716326504945755,
        -0.05005188286304474,
        0.06130431219935417,
        0.07994763553142548,
        0.060020606964826584,
        -0.015846343711018562,
        0.020224066451191902,
        0.09705262631177902,
        -0.08245071023702621,
        -0.05211538448929787,
        -0.00526328245177865,
        0.023005958646535873,
        0.0065638115629553795,
        -0.003628771984949708,
        -0.01848013512790203,
        -0.03533412143588066,
        0.013364877551794052,
        -0.038951799273490906,
        -0.02783399075269699,
        -0.03151705116033554,
        0.11168760061264038,
        0.11401642113924026,
        0.03255534917116165,
        -0.027058349922299385,
        0.017739633098244667,
        -0.05124906823039055,
        -0.048579033464193344,
        -0.004070647992193699,
        -0.014172563329339027,
        0.011788910254836082,
        2.5162183916480635e-33,
        -0.03528072312474251,
        0.047205835580825806,
        -0.013329902663826942,
        0.04810524731874466,
        -0.014219068922102451,
        -0.0545034259557724,
        -0.003940782975405455,
        -0.010779558680951595,
        0.028171630576252937,
        0.06128953769803047,
        -0.008688529953360558,
        0.002681007608771324,
        -0.04910954460501671,
        0.02078489027917385,
        0.07934317737817764,
        -0.08707010000944138,
        -0.07042167335748672,
        -0.07849565148353577,
        -0.02333919331431389,
        -0.04834819585084915,
        0.022755036130547523,
        -0.04908119514584541,
        -0.03975614160299301,
        -0.018573613837361336,
        0.025915423408150673,
        0.05948188155889511,
        0.08156158775091171,
        0.01506438571959734,
        0.07859228551387787,
        -0.020343948155641556,
        -0.1051855981349945,
        0.06144324317574501,
        0.056654758751392365,
        -0.04976719245314598,
        -0.0032599251717329025,
        -0.0008116575772874057,
        0.004737749695777893,
        -0.08230770379304886,
        0.016867564991116524,
        0.024577196687459946,
        -0.07776232808828354,
        -0.026845727115869522,
        -0.06541462987661362,
        -0.014004181139171124,
        0.030655808746814728,
        0.011877859942615032,
        0.030717696994543076,
        0.025005582720041275,
        -0.0024209702387452126,
        -0.032048340886831284,
        0.031646013259887695,
        -0.08432841300964355,
        -0.056050579994916916,
        0.0016934527084231377,
        -0.02481307089328766,
        0.018914902582764626,
        0.037603482604026794,
        -0.020350249484181404,
        0.06475827842950821,
        0.05308368429541588,
        0.0037149207200855017,
        -0.016170956194400787,
        -0.0820850282907486,
        0.03330885246396065,
        -0.0593782402575016,
        0.07326880097389221,
        -0.0018569841049611568,
        -0.003453358542174101,
        -0.06976764649152756,
        0.08367738127708435,
        0.02509143576025963,
        -0.011350377462804317,
        0.011719862930476665,
        -0.031701333820819855,
        0.008305324241518974,
        0.03467591106891632,
        0.033215586096048355,
        -0.0378338061273098,
        -0.021034937351942062,
        -0.03902410715818405,
        -0.003985088784247637,
        0.004795369226485491,
        0.014555416069924831,
        0.09615951031446457,
        -0.003025845857337117,
        -0.07487837970256805,
        -0.05805055797100067,
        -0.11192292720079422,
        0.02465278096497059,
        0.06799482554197311,
        -0.051502618938684464,
        -0.0028834864497184753,
        -0.06549876928329468,
        0.009904148057103157,
        0.008814151398837566,
        -4.552801660040032e-33,
        -0.062200840562582016,
        -0.0743318721652031,
        -0.006493719760328531,
        1.8895698303822428e-05,
        -0.003561383578926325,
        -0.036139603704214096,
        0.012994368560612202,
        0.06548703461885452,
        -0.03987943008542061,
        -0.05196772888302803,
        0.01044830959290266,
        0.04138045385479927,
        0.05872843787074089,
        0.06737522035837173,
        -0.028694825246930122,
        0.017045844346284866,
        -0.029349954798817635,
        -0.049373626708984375,
        0.08201799541711807,
        0.05753893032670021,
        0.06326641887426376,
        0.039910707622766495,
        -0.0033819936215877533,
        0.07556163519620895,
        0.0019944983068853617,
        -0.003710378659889102,
        -0.01859997771680355,
        0.026022769510746002,
        0.06254681199789047,
        -0.02879822440445423,
        -0.0009563770145177841,
        -0.09175792336463928,
        0.009600285440683365,
        0.04011443257331848,
        0.011927428655326366,
        0.08208748698234558,
        0.0041524628177285194,
        -0.021454093977808952,
        0.0047827246598899364,
        -0.02902601845562458,
        0.013414737768471241,
        -0.018958337604999542,
        0.06204228475689888,
        -0.09649484604597092,
        0.04264459386467934,
        -0.014276916161179543,
        0.01286145020276308,
        -0.002047993941232562,
        0.01126058865338564,
        0.004923196509480476,
        0.046601418405771255,
        0.026972798630595207,
        -0.06450820714235306,
        -0.004576224833726883,
        -0.11728505045175552,
        0.01697932928800583,
        0.07480107992887497,
        -0.07752718776464462,
        0.06655202805995941,
        0.03980829566717148,
        0.13354270160198212,
        -0.01914346031844616,
        -0.02725946344435215,
        -0.05325922742486,
        -0.07027388364076614,
        0.020107267424464226,
        0.05187937989830971,
        0.025811709463596344,
        0.0054374090395867825,
        -0.04258283972740173,
        -0.05843691527843475,
        -0.06240513175725937,
        -0.01124512031674385,
        -0.06684593856334686,
        0.06741946935653687,
        -0.016330210492014885,
        -0.07750260829925537,
        0.02941172569990158,
        -0.08525887876749039,
        -0.0410490520298481,
        0.06460094451904297,
        0.08715479075908661,
        -0.0020142036955803633,
        -0.00952595379203558,
        0.1039210632443428,
        0.07853420078754425,
        0.06555020064115524,
        -0.015906937420368195,
        -0.006733801681548357,
        0.05091823637485504,
        -0.007949380204081535,
        0.04643935710191727,
        -0.12915334105491638,
        0.06941797584295273,
        -0.06701276451349258,
        -5.5051419423080006e-08,
        0.0378703735768795,
        -0.03312712162733078,
        0.09727669507265091,
        -0.1021944135427475,
        0.04473387077450752,
        -0.052667126059532166,
        -0.023863784968852997,
        0.013796228915452957,
        0.05650171637535095,
        -0.019990796223282814,
        -0.029032910242676735,
        -0.0830586850643158,
        -0.043135691434144974,
        0.12405028194189072,
        0.01816549152135849,
        0.09334203600883484,
        0.044790755957365036,
        -0.05865933373570442,
        0.006548022851347923,
        0.024360282346606255,
        -0.013551085256040096,
        0.009807392954826355,
        0.023261601105332375,
        -0.046880681067705154,
        0.03764459863305092,
        -0.008447212167084217,
        -0.061969589442014694,
        0.024270297959446907,
        0.04369904473423958,
        -0.08937618881464005,
        0.02801445685327053,
        0.047086555510759354,
        -0.009442583657801151,
        -0.028642944991588593,
        -0.05376115068793297,
        -0.02465459704399109,
        0.019874176010489464,
        -0.02432771772146225,
        0.007544068153947592,
        -0.038219451904296875,
        -0.024622395634651184,
        -0.04066728428006172,
        -0.028860704973340034,
        0.03950173780322075,
        0.02375471405684948,
        -0.09796766191720963,
        -0.007928754203021526,
        -0.09175720810890198,
        -0.00031426080386154354,
        0.07126122713088989,
        0.0019166544079780579,
        -0.02236969955265522,
        0.0187420304864645,
        -0.06666687875986099,
        0.1148071214556694,
        -0.061429791152477264,
        0.043269604444503784,
        0.0015656546456739306,
        -0.018907321617007256,
        0.019312633201479912,
        0.07585001736879349,
        -0.10618472844362259,
        0.00330664636567235,
        0.08074816316366196
    ]
}