{
    "id": "TI9Rcny1DM0",
    "title": "I *FINALLY* bought a New Electric Truck!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-04-02T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=TI9Rcny1DM0",
    "category": "Howto & Style",
    "tags": [
        "Electric Truck",
        "Rivian",
        "Rivian R1t",
        "Rivian R1s",
        "Rivian Review",
        "Electric vehicle",
        "EV",
        "Hummer",
        "Cybertruck",
        "Tesla",
        "Lightning",
        "Battery",
        "Charging",
        "Rivian truck",
        "battery truck",
        "electric pickup truck",
        "electric car"
    ],
    "views": 1303102,
    "likes": 68691,
    "comments_count": 3866,
    "description": "I have been waiting YEARS for today. Get a new Rivian and 6 months of free charging on the Rivian Adventure Network HERE:  The time has finally come for me to accept delivery of my new electric truck. Usually buying a brand new vehicle is a terrible financial decision. And it still is. For sure. But Ill walk you through a bit of my logic behind the purchase of this new Rivian R1T. I also review a lot of electric vehicles on my channel, so while it does make sense for me to have one - that might not be true for everyone. Luckily there are a lot of options to choose from!   Rivian Vs Ford Rapter HERE:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.rivian.com/configurations/list?reprCode=ZACK1594426",
        "https://youtu.be/acSdPy38XKU",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Three years ago at the end of 2018 I pre-ordered an electric truck the Rivian R1T. I've previously said on my channel that the anticipation of getting a new vehicle is sometimes more fun than the getting of the new vehicle. And that's still true, but three years is a lot of anticipation. It's been so long that I've had enough time to build my own electric vehicle like this EV Humvee behind me. And you might be like, 'Hey Jerry, if you already have an electric vehicle why buy another one?' And you're right, but a production EV has a few things that this doesn't...like air conditioning. One thing that added to the anticipation of getting my new truck is that last summer my uncle asked if he could buy my Tacoma, and I said yes thinking that the Rivians were right around the corner. That was 8 months ago. The Rivians did get delayed and I've been sharing a vehicle with my wife ever since. Don't trust delivery dates during a pandemic. Today though, Rivian says my truck is ready for pickup which means today might be a very good day. Let's get started. [Intro] Normally Rivian brings the truck to your house to drop it off, but I live really close to a service center so we're just going to drive over there. My mom is my chauffeur today - Cambry's a little busy. Now normally I would say that buying a vehicle right off the lot is a terrible financial decision and I still 100% agree with that, but I'm going to do it anyway and I'll explain why a little bit later in the video. As we're driving, let me tell you what's happened so far. So about two weeks ago I got an email from a Rivian guide, which is the person in charge of making sure my truck is the exact specification that I want. We solidified the design, and then about a week later I got another email which allowed me to pay for the truck, put insurance on it. And after it was paid for and had insurance, I got to pick a delivery date. And that delivery date is today and I should be seeing my truck for the first time in just a few minutes. That might be my truck....and no, it has different rims. We're getting close though I can feel it. Look at all those. This is Rivian heaven. Right there. That one's mine with the black rims. Yes! Oh that looks good. So many trucks. We got the Rivian Blue and then we have mine right here. We have the white. It's charging up. We have the black rims. I splurged a little extra. We got the cover. This is the Founder's Edition so there are a couple little extras here and there. So I think they want to go over a couple things with me inside. So I'll let them do that and I will let you know afterwards what they say. I'm excited. I'll walk you through all of my interior design decisions and everything that I chose for this truck. But first, let's do some driving. Now I've already driven quite a bit. I've made a video with Rivian in Colorado where we took these trucks off roading. Now Rivian has never paid me, and they also did not give me a discount on this truck, unfortunately, but I'm a big fan. [Music playing] So obviously I've only had this truck for a couple hours now and so this is not going to be a full review, but I'm going to do a walk around in a minute. I want to talk a second about why I think it's okay financially to buy this truck. Now anyone who buys a brand new vehicle obviously has their own justification for buying it, but I'm going to tell you a few of mine. One, electric vehicles are just so powerful. I saw a video literally two days ago that showed a drag race between a Rivian, this truck, and a Ford Raptor. Obviously the Rivian won with a 0-60 of three seconds. But the cool part is, is that after the race, they loaded the Rivian up with 6,000 pounds on a trailer and it still beat the Ford Raptor. The power of electricity is just insane. Plus there is virtually no maintenance on this truck. Rivian has an 8 year, 175,000 mile warranty on their battery and drive train, which is insane. There is not a single gas vehicle on the market that has a similar warranty. Even Tesla, who has made more electric vehicles than anyone says that their battery pack is still at 90% capacity even after 200,000 miles. So the longevity of electric vehicles is not even in question. So in my mind, while the Rivian is a little bit more expensive up front, it makes up for it with longevity and just how fun it is to drive. The Rivian can tow 11,000 pounds, has 15 inches of ground clearance, 908 pound feet of torque, with 835 horsepower. Plus if you want to get nitty-gritty, electric vehicles are sold out everywhere for like the next year or two. So I could turn around right now and sell this truck for more than I bought it for, which in my mind makes it a pretty good financial decision. Plus something that people might not realize is that right there is a federal tax credit of $7500 if you buy an EV from a company who's made less than 200,000, so Tesla's don't qualify anymore, which is a pretty solid discount off the price of a Rivian. I think this Rivian right now is number 160,013 so they're still pretty new. And if you think it's crazy that the government is offering so much money for electric vehicles, wait till you find out how much they've given the oil companies. Woo! Made it. So it's a little windy up here on the mountain but we're on a mountain and it's time for the walk through. Obviously the most important thing of any truck is the flashlight hidden in the door, but let's talk about some other things. We have heated and cooled seats, heated steering wheel, big screen in the center, smaller screen up here for how fast we're going. I chose the black interior and the white exterior as you probably noticed from the rest of the video. And right here is where we find the air conditioning. When it's parked, the handles pop open like this so we can grab them, and then they close in so they're flush with the side panel for aerodynamics. One cool thing about aerodynamics, which I've only seen in electric vehicles so far, is this little slot right here. When you're going fast, like let's say above 30 or 40 miles an hour, air resistance is one of the biggest obstacles to range. So what this does right here, air comes in through the bumper and creates a curtain around the tire so that the tire doesn't cause any turbulence or drag. That, combined with the recessed door handles and that it can lower down when it's driving fast on the freeway or something like that, makes it so that it is more aerodynamic and increases the range. We do have 314 miles of range which is quite a lot. Now if we are towing, it usually decreases that range by about half, or at least that's what I've found when we tow with my wife's Model X. We'll have to do some towing tests with this a little later on, since it is a truck and I do plan on using it as a truck. Speaking of which, we can drop the tailgate down. It automatically lowers but you do have to lift it up into place. And since you probably remember from my Colorado video, I made sure to pay a little extra for the spare tire. Coming over here to this side, we do have the gear tunnel, which is kind of like a cavity that goes all the way through the truck. We can store stuff in there. We have 5 seats. Storage compartment here, here, as well as, I mean there are so many things going on I almost forgot. We have the air compressor right back here. So when you're off roading or need to air down the tires we have an onboard compressor which is also used to raise and lower the suspension. 15 inches of ground clearance. And once again over here we have the aerodynamic curtain over the tires, and a front trunk. And inside of here we have a storage cable, the gearguard, and some child seat brackets. There are 4 wall outlets as well two in the truck bed and two in the gear tunnel that you can use to charge up things off of that massive 130 kilowatt battery. As you can tell, I am super excited for this truck. I have been waiting 3 years for it. I do plan on making a full review video and putting it through some tests later on. Let me know when you want that review video though, like after 10,000 miles? 50,000 miles? Make sure you hit the subscribe button so you don't miss those. Turn on notifications. And come hang out with me on Instagram and Twitter. As always, thanks a ton for watching. I'll see you around. [Music playing]",
    "transcript_keywords": [
        "Rivian",
        "truck",
        "electric vehicles",
        "vehicle",
        "electric",
        "vehicles",
        "video",
        "air",
        "Rivians",
        "things",
        "Rivian Blue",
        "miles",
        "made",
        "Ford Raptor",
        "ago",
        "anticipation",
        "Today",
        "Hey Jerry",
        "buy",
        "trucks"
    ],
    "transcript_entity_values": [
        "0-60",
        "the end of 2018",
        "7500",
        "6,000 pounds",
        "Colorado",
        "Rivian",
        "just a few minutes",
        "15 inches",
        "Cambry",
        "Instagram",
        "the next year",
        "100%",
        "two",
        "908 pound feet",
        "130 kilowatt",
        "Humvee",
        "Jerry",
        "8 year",
        "about half",
        "Ford Raptor",
        "175,000 mile",
        "11,000 pounds",
        "30 or 40 miles an hour",
        "last summer",
        "10,000 miles",
        "less than 200,000",
        "three years",
        "4",
        "Model X.",
        "EV",
        "314 miles",
        "a very good day",
        "two days ago",
        "90%",
        "200,000 miles",
        "5",
        "about a week later",
        "3 years",
        "Tesla",
        "first",
        "second",
        "835",
        "the Rivian Blue",
        "Edition",
        "today",
        "about two weeks ago",
        "50,000 miles",
        "a couple hours",
        "Today",
        "One",
        "8 months ago",
        "160,013",
        "Three years ago",
        "Tacoma",
        "Rivians",
        "Twitter",
        "around in a minute"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "GPE",
        "NORP",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "QUANTITY",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "NORP",
        "ORG",
        "TIME"
    ],
    "vector": [
        -0.09073123335838318,
        -0.007494501769542694,
        -0.012766608968377113,
        -0.058458901941776276,
        0.1310691386461258,
        -0.03049483150243759,
        0.024417107924818993,
        0.06598877906799316,
        -0.024579085409641266,
        0.03728898987174034,
        0.04552299156785011,
        -0.0131652457639575,
        0.029300643131136894,
        -0.001708345953375101,
        0.051147881895303726,
        -0.04234097898006439,
        0.05070400983095169,
        -0.04221358522772789,
        0.031818363815546036,
        0.04557335004210472,
        -0.022760801017284393,
        -0.02161594107747078,
        0.023976007476449013,
        -0.05251001939177513,
        0.0057029337622225285,
        0.05360206961631775,
        0.03194310516119003,
        0.03460611402988434,
        -0.09353112429380417,
        -0.15415509045124054,
        0.0400739423930645,
        0.01441576424986124,
        -0.08461591601371765,
        -0.05914749950170517,
        -0.03015635721385479,
        0.019636599346995354,
        0.012563887052237988,
        -0.00023151381174102426,
        -0.016262901946902275,
        -0.0049821799620985985,
        -0.016887716948986053,
        -0.06094135716557503,
        -0.009115967899560928,
        -0.04803930222988129,
        -0.036700669676065445,
        -0.0485566109418869,
        0.06291981041431427,
        -0.014509875327348709,
        0.10378128290176392,
        -0.033650875091552734,
        -0.004256080370396376,
        -0.04640297591686249,
        0.024466698989272118,
        -0.07703498005867004,
        -0.031332626938819885,
        -0.010830365121364594,
        -0.0839305967092514,
        -0.07900113612413406,
        -0.005751100834459066,
        -0.07328277826309204,
        0.017434004694223404,
        -0.011020326055586338,
        -0.000381593155907467,
        0.028444426134228706,
        -0.05899399518966675,
        -0.041294362396001816,
        0.025922149419784546,
        -0.012609888799488544,
        -0.044518839567899704,
        -0.021545127034187317,
        -0.0020539809484034777,
        -0.003670030040666461,
        -0.01604057475924492,
        0.008299200795590878,
        -0.014037403278052807,
        0.023918380960822105,
        0.14705628156661987,
        0.06406102329492569,
        -0.00044421415077522397,
        0.02507547289133072,
        0.012989012524485588,
        0.032682206481695175,
        -0.00919108372181654,
        -0.060631658881902695,
        -0.013299010694026947,
        0.04947923496365547,
        0.06930364668369293,
        0.006402407307177782,
        -0.03385327756404877,
        -0.04168142005801201,
        0.05213828757405281,
        0.031147891655564308,
        0.06187308952212334,
        -0.06184417009353638,
        -0.04439430311322212,
        0.012498829513788223,
        -0.0983172282576561,
        -0.04303348809480667,
        -0.04011901095509529,
        0.05634452402591705,
        -0.008671669289469719,
        0.014025675132870674,
        -0.0031346853356808424,
        -0.0426986888051033,
        -0.032333195209503174,
        0.00448817852884531,
        -0.049578551203012466,
        0.0390901155769825,
        0.03247687965631485,
        -0.016642319038510323,
        0.04519160836935043,
        0.0002947410102933645,
        -0.09501315653324127,
        0.03688083216547966,
        -0.036365263164043427,
        0.05305023863911629,
        -0.08310805261135101,
        0.051390308886766434,
        0.13159610331058502,
        0.020743703469634056,
        0.019764984026551247,
        0.0063878195360302925,
        -0.008065689355134964,
        0.01527991984039545,
        0.05124048516154289,
        0.07690048217773438,
        -0.033735308796167374,
        4.570097222702459e-33,
        -0.12176556140184402,
        0.10489107668399811,
        -0.03183810040354729,
        -0.0279864352196455,
        -0.020773524418473244,
        0.0640258640050888,
        -0.024413954466581345,
        0.08927815407514572,
        0.0062279230915009975,
        0.015617487952113152,
        -0.01462679635733366,
        0.03788836672902107,
        -0.02573293261229992,
        0.011599447578191757,
        -0.026754509657621384,
        -0.05294203758239746,
        -0.07094922661781311,
        -0.06551115214824677,
        -0.04912843927741051,
        -0.056579843163490295,
        -0.06282217055559158,
        0.07598952203989029,
        0.08487202972173691,
        0.08195170015096664,
        0.07391037791967392,
        -0.06335167586803436,
        0.08338763564825058,
        -0.048502326011657715,
        0.03258226811885834,
        0.03765704482793808,
        -0.07458238303661346,
        0.03359667956829071,
        0.0744815543293953,
        0.056962333619594574,
        -0.11011780053377151,
        0.007303450256586075,
        -0.07282587885856628,
        -0.12559886276721954,
        -0.07136811316013336,
        -0.05849049985408783,
        -0.03341653570532799,
        0.035309799015522,
        -0.11072122305631638,
        -0.030737213790416718,
        -0.029029877856373787,
        -0.004420720040798187,
        0.0285932756960392,
        0.00015075696865096688,
        -0.028794366866350174,
        0.027951916679739952,
        -0.10498562455177307,
        -0.00031823664903640747,
        0.024112649261951447,
        0.003604590194299817,
        -0.08039543032646179,
        -0.011955633759498596,
        -0.005405311938375235,
        -0.05750301852822304,
        0.03580598160624504,
        -0.0299918781965971,
        0.013711340725421906,
        0.02584521844983101,
        0.010830314829945564,
        -0.027485474944114685,
        -0.04144923388957977,
        0.08336225897073746,
        0.026084210723638535,
        -0.01834183558821678,
        -0.06406897306442261,
        0.021382860839366913,
        0.01413809135556221,
        -0.0759255513548851,
        0.04326425865292549,
        -0.022379737347364426,
        0.052810072898864746,
        0.0422489270567894,
        -0.050389088690280914,
        0.013006621971726418,
        0.08323539048433304,
        -0.02638970874249935,
        -0.10683425515890121,
        0.0517226941883564,
        0.013900035992264748,
        0.009013484232127666,
        0.11306730657815933,
        -0.0417749360203743,
        -0.011155335232615471,
        -0.030726542696356773,
        0.08466796576976776,
        0.030330641195178032,
        0.006676030810922384,
        0.054888732731342316,
        -0.02062961645424366,
        0.007367756683379412,
        0.02767152525484562,
        -5.935437951944377e-33,
        0.030646616593003273,
        0.013446986675262451,
        0.04005078226327896,
        0.0482863150537014,
        0.04201450198888779,
        -0.02398933656513691,
        0.02211044169962406,
        0.02150711975991726,
        0.038522958755493164,
        -0.06503687053918839,
        -0.04514878988265991,
        0.045108992606401443,
        -0.08034548163414001,
        -0.04321516677737236,
        0.1271325647830963,
        -0.064175546169281,
        0.02598036453127861,
        -0.07118304073810577,
        0.03219303861260414,
        0.029048332944512367,
        0.07676496356725693,
        0.0680512934923172,
        -0.018972521647810936,
        0.006220996845513582,
        0.025133000686764717,
        -0.004026809707283974,
        0.015858961269259453,
        0.020906344056129456,
        -0.012441250495612621,
        -0.05805305764079094,
        -0.06688215583562851,
        -0.035481419414281845,
        0.0387820266187191,
        0.011717142537236214,
        -0.003210880560800433,
        0.044514115899801254,
        0.07382730394601822,
        0.025779996067285538,
        -0.022374005988240242,
        -0.0031797827687114477,
        0.0040150051936507225,
        -0.05844300240278244,
        -0.011031738482415676,
        0.05428380146622658,
        -0.05172865465283394,
        -0.11746364831924438,
        -0.05420156940817833,
        -0.008779232390224934,
        0.018670648336410522,
        0.012452171184122562,
        -0.07307790219783783,
        0.016607319936156273,
        0.025581717491149902,
        0.009608414024114609,
        -0.10758429020643234,
        -0.015439809300005436,
        0.10517715662717819,
        0.03754018619656563,
        -0.05234438553452492,
        0.10450398176908493,
        -0.022525470703840256,
        0.012144867330789566,
        0.0030656177550554276,
        0.027211278676986694,
        0.01261293888092041,
        -0.08911971002817154,
        0.07779504358768463,
        -0.005019902717322111,
        0.010528101585805416,
        -0.01102122850716114,
        -0.016383934766054153,
        -0.02635078690946102,
        -0.011549295857548714,
        -0.082341268658638,
        -0.05716947466135025,
        0.021041281521320343,
        0.017859430983662605,
        -0.05299966037273407,
        0.03636723384261131,
        -0.04030877724289894,
        0.02147412672638893,
        0.00010775764530990273,
        -0.010735835880041122,
        0.07403697073459625,
        0.042108871042728424,
        0.10329630225896835,
        0.038803424686193466,
        -0.028354337438941002,
        0.04986930266022682,
        0.02405410259962082,
        0.04375460743904114,
        0.001870614243671298,
        -0.0013837997103109956,
        0.10925407707691193,
        -0.012818788178265095,
        -6.354974146915993e-08,
        0.03894292935729027,
        0.04450129345059395,
        -0.00015676037583034486,
        -0.013172237202525139,
        0.10318198055028915,
        -0.0022611080203205347,
        -0.026590891182422638,
        0.009111778810620308,
        -0.09557424485683441,
        0.06790546327829361,
        0.056280702352523804,
        0.04035795480012894,
        0.02350364439189434,
        0.010952054522931576,
        -0.01947943866252899,
        0.06936798989772797,
        0.04850687086582184,
        0.09855811297893524,
        -0.04367012530565262,
        0.04908948019146919,
        -0.05757734552025795,
        0.01493928674608469,
        0.026326579973101616,
        -0.01564011164009571,
        0.016130300238728523,
        -0.008034704253077507,
        -0.03419448435306549,
        0.004525435157120228,
        0.03064439818263054,
        0.011998790316283703,
        -0.0906536877155304,
        -0.0006638989434577525,
        0.022440237924456596,
        0.050080835819244385,
        -0.03313082084059715,
        -0.15281769633293152,
        -0.0269631315022707,
        0.03658029064536095,
        0.04108789190649986,
        -0.014550412073731422,
        0.02877034805715084,
        0.008541039191186428,
        -0.03782080486416817,
        -0.00937754288315773,
        -0.084508515894413,
        -0.01084598433226347,
        -0.056230612099170685,
        -0.13001206517219543,
        -0.04541703313589096,
        0.008580834604799747,
        -0.04088643938302994,
        -0.04653645679354668,
        -0.036137331277132034,
        0.06086065620183945,
        0.02394111640751362,
        0.03554500266909599,
        -0.10909564048051834,
        0.016384711489081383,
        0.003382632974535227,
        0.03992315009236336,
        0.09413763135671616,
        -0.07262762635946274,
        0.009119455702602863,
        0.05013413354754448
    ]
}