{
    "id": "tiCc6eez7FA",
    "title": "This Beautiful PC has an UGLY Secret…",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-27T17:01:15Z",
    "video_url": "https://www.youtube.com/watch?v=tiCc6eez7FA",
    "category": "Science & Technology",
    "tags": [
        "Linus Tech Tips",
        "LTT",
        "Linus",
        "Gaming",
        "Computer",
        "Motherboard",
        "billibilli",
        "DIYAPE",
        "DIY",
        "APE",
        "Gaming Computer",
        "Technology",
        "Tech",
        "NexiGo",
        "Iris",
        "4K",
        "webcam"
    ],
    "views": 1383059,
    "likes": 44319,
    "comments_count": 2137,
    "description": "Thanks to NexiGo for sponsoring this video! Get $50 off the NexiGo Iris at: Website: - Discount code:LTTxNexiGo Amazon:  Weve got our hands on a motherboard developed as a collaboration between bilibili creator APE and MSI. With a novel approach to cable management, is this the standard of the future?  Discuss on the forum:   Check out the MSI B650M DIY-APE Motherboard on Taobao:  Buy an AMD Ryzen 5 7600X CPU:  Buy G.Skill Flare X5 6000MHz CL30 2x16GB DDR5 RAM:  Buy a Corsair MP600 Pro 2TB NVMe M.2 SSD:  Buy a Fractal POP Mini Air mATX Case:  Buy a Seasonic SnowSilent 1050W 80 Plus Platinum PSU:  Buy a Gigabyte GeForce RTX 4070 AERO Graphics Card:  Buy a Noctua NH-L12S CPU Cooler:  Buy a ASRock AMD Radeon RX 6950XT Graphics Card:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:14 NexiGo Iris! 1:33 The MSI B650M DIY-APE 3:05 CPU Installation 3:33 RAM Installation 3:52 SSD Installation 4:23 CPU Cooler Installation 6:43 The Case 8:11 RIP Fractal Pop Mini Air  11:05 PSU Installation 13:00 Cable Management 15:15 GPU Installation 17:18 Will it post? 18:30 Benchmarking 20:55 NexiGo! 21:57 Outro",
    "description_links": [
        "https://viraln.link/NexiGoIris",
        "https://viraln.link/NexiGoIrisAM",
        "https://linustechtips.com/topic/1515920-this-beautiful-pc-has-an-ugly-secret%E2%80%A6/",
        "https://lmg.gg/CywjR",
        "https://geni.us/XyQgu",
        "https://geni.us/ISAwLs",
        "https://geni.us/7ODsao",
        "https://geni.us/TtXP0uE",
        "https://geni.us/GAny",
        "https://geni.us/qSiQ6K",
        "https://geni.us/L1KzIw5",
        "https://geni.us/160ck9D",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "How could something be so beautiful? And yet, a total hot mess. I don't know, you'll have to ask my ex-wife. Hey-o! Disclaimer. It's part of a growing trend in PC hardware to take the icky, messy cables that have cluttered our gaming rigs for my entire life and hide them away by moving all the connectors to the back of the motherboard. And I mean, sounds pretty good to me. It's not like we were using this space for anything else, but not everyone's happy with this trend. Paul's Hardware just posted a video criticizing rear-mounted power connectors, and he makes some pretty good points. Computers don't run on magic, so you still have to run cables from your power supply anyway. There's no cooling benefit to this, whatever the marketing might tell you, and this could turn out to be a compatibility nightmare if every vendor goes down their own proprietary path, kind of like what's happened with RGB. And that last one is my biggest concern about the future of zero-cable solutions. I mean, I don't wanna buy a new case every time I upgrade my motherboard. Fortunately, I don't have to. And the janky adventure that you're about to watch is brought to you by Nexigo. Their Iris 4K AI webcam features a large Sony Starvis sensor for incredible low-light performance and wide dynamic range. It's also got a 90-degree field of view and AI-powered framing and tracking, which automatically keeps you in the shot, all without installing any software on your computer. More about the Iris later. Development of the MSI B650M Ape Wi-Fi motherboard began as a collaboration between motherboard manufacturer MSI and the Bilibili video creator Ape, who has spent over half of the last decade lobbying for cable-free PCs, and who, if this is anything to go by, is finally seeing his vision come to life. Look at this. No 24-pin, no 8-pin, no front connectors at all. They're all on the back. And if all goes according to his plans, this AM5 board is just the start of the DIY Ape revolution that will extend to many more components, including redesigned GPUs and power supplies. Only time will tell if this is going to ultimately catch on or if we'll end up seeing any of it outside of China, but it's definitely something to keep an eye on. I gotta say, if I was looking for a starting point, this is pretty much where I'd wanna be. I would describe this as a premium mid-tier board. It obviously uses a B650 chipset, but it's got really robust IO, including 20 gigabit per second USB-C, Wi-Fi 6E, two and a half gig LAN, and even a clear CMOS button, super convenient. It's got a robust VRM design and cooling. So as long as MSI engineered the BIOS correctly, any AM5 CPU should run its best in here. Of course, the star of the show is the rear-mounted connectors, which should give our finished build an extraordinarily clean look. Given the price of our board, we're gonna have links in the video description, what we're aiming for today is a great, pretty high-end, but also not overkill build. So we've gone with the AMD Ryzen 5 7600X. It's only $20 more than the base 7600 now, and I consider that a fair price for the nearly one gigahertz increase in base clock speed and it's just a great gaming chip with six super fast cores and support for the latest technologies, including PCIe Gen 5 and DDR5 memory. Speaking of which, we've gone with a G.Skill Flare X5 DDR5 kit at 6,000 megatransfers per second. We had actually planned to stick with just 16 gigs, but at $100, this 32 gig kit was less than $20 more than a 16 gig kit at the same speed. Lordy, has RAM ever gotten cheap lately. And so has storage. This two terabyte Corsair MP600 Pro would have been more than $200 at the start of the year. Now, it's available for just 140 bucks, or at least the not stupid air-cooled one is. That's the one we're using. It didn't matter because we were gonna strip the heat sink off it anyway. To be clear, there are a lot of good options out there for M.2 drives right now, but we like this one's mix of price and performance, along with Corsair's solid reputation for being a trustworthy bro for their users. With our NVMe safely tucked away, we can install our CPU cooler. We've gone with the Noctua NH-L12S, but instead of the normal low profile fan, ha ha, ha, we've gone with this. You might've seen this in our recent Computex coverage. This is the Alphacool Apex Stealth metal fan. It uses a patented decoupled design with separate housings, O-rings, and a plastic shroud that results in, according to them anyway, I haven't heard it yet, a very low noise level. They're totally modular, and the zinc housing, gosh, is this thing ever heavy, is available in black, white, this gorgeous chrome that's gonna look great with our build. Ah, how awesome is that? And you heard it here first, a special edition gold finish that they just told us about this morning. These aren't out yet, but they're coming soon, and Alphacool expects them to retail for $30 each. That's a lot for a bang for the buck gaming PC, but we're also trying to achieve a certain look here, and that is just, oh, here's something that didn't really occur to me. We need an extension to plug in this fan, which is fine, but why would you have the connector for the CPU fan on the back? Then you just have to run it around to the back. Actually, you know what, Ape? I still think this might be better. Yeah, I like it. Having the connectors on the back of the motherboard definitely introduces some risk of stabbing. Now we know. Also, I really wanna rip off this daisy chain thing. Tuck it in, tuck it in. No, no, no, tuck it in. No. There's a cable right beside it. No, I'm taking it off. No! I'll do it properly though, okay? All right. All right, goodbye. Alphacool, sorry. Goodbye, daisy chain. There we go. Hey, nice and clean now. Oh yeah, that's more like it. Not gonna have that daisy chain cable hanging off my CPU fan that looks this freaking awesome. All of that brings us to our case. The Fractal Pop Mini Air at $90 is a well-built, attractive Micro ATX case. But that's not why we chose it. See, the thing is, only a handful of cases are designed for the DIY ape connector scheme, like this one behind me from Asus. Look at all those cutouts. That's amazing. So realistically then, I would have taken just about any case that has ample space behind the motherboard tray where we're gonna have all those connectors coming out, which raises a question. Linus, you absolute madman. You just showed us that you already have the perfect case for this build right there. Why aren't you using it? Ah, the thing is, that case, like the other DIY ape ready models, is China exclusive, meaning that if you're watching this video on YouTube, you aren't going to be able to get one. So the way that I see it, it's only fair that I should share that same experience. Plus, I've already got the dremel out. Jordan, you're the one who mapped out approximately where the connectors need to come through. Is that right? That's right. Do you really intend for me to remove all of this? All of that. There's gonna be like nothing left. Just a little sliver of metal holding the motherboard tray into place. That's why you want a case specifically designed for this generally. Yeah. You ever have second thoughts? Yeah. Yeah. Yeah. I'll take that face shield. Spitting a lot of steel into my face. It's not very white anymore, is it? You can fit so much clean build in this bad boy. Let's try blowing it out. Man, just carrying it over here. I got a nasty... Oh. Huh. Maybe there's hope for this yet. That's how we do peels in the big time. Something. Yeah. It's white again. Uh-oh. The motherboard tray. Surely there are no metal shards left in here that could short out our sensitive electronics and cut open our sensitive hands. Is there a plan for that? Yeah, we got some gasket material to put around those holes so you're not gonna cut yourself off. This is not perfect. Might be better than nothing though. It's just this little kinda U-channel grommety stuff here. It definitely looks better than the heat destroyed raw edges. Screw it. Let's just put the motherboard in, okay? Yeah. Sure. Oh, you know what? That totally worked. Yeah, I didn't really like the sound of that either. Oh, could be related to my fan cable here. Hold on. No, no, no, no. Wait, wait, wait, wait. Oh, it's in. This hole doesn't really line up, which got me thinking. You know, gee, what's up with the tolerances on this case? Cause all these back ones do. I think when we cut it, it might've affected how it sits a little. So we're gonna have, these are gonna be structural screws attached to a structural motherboard and almost nothing else needs to go in here except the big GPU that's gonna ruin everything. Of course, what we haven't addressed is the situation at the back. Looks like we almost have enough clearance to plug fan connectors in here, almost. We need to do some finagling there. Everything else though, looks like we almost nailed it. Oh, uh-oh. What's JFP2 here? Because it's covered. Covered in a way that has a rubber grommet and won't short out. That might also explain why the, um, this screw was hard to screw in. It'll probably work, right? Yeah. The only way to know for sure is to plug in our power supply and see how it goes. Now, before you rush to the comments and tell us about how this thing is overkill, we ran into some logistical challenges for this video. Okay, so we're using a Seasonic Snow Silent 1050 watt power supply, which pairs perfectly with these custom length cable mod cables that we happen to have kicking around in the warehouse. If you were to recreate this build for yourself, I would strongly recommend something more in the range of 750 to 850 watts. And I would also recommend picking up something that is compatible with custom length cables, because otherwise you're gonna take your cable management problem in the front of the case and you're just gonna move a cable management problem to the back of the case. We wanna have something that's not so long that we've got a whole bunch of extra to hide back here. And this is actually looking like it might close. How sure are we that this backside panel is going to close, Jordan? 80% from here. That is very low. I feel like... Oh. Uh-oh. What was that? That was a motherboard tray that is not very strong anymore. Letting go, I think. Wait, what? What just happened? Oh, this screw came out. Like just totally came out. Maybe one of them somehow is 632. This isn't a brand new case. It's been used before. So maybe somebody screwed up and put the wrong stand off there. That's what I'm hoping for. And that is in fact what it was. Oh, good. Okay. Ha, ha, ha, ha. Sign up for a notification for when we get the Noctua color scheme screwdriver. Okay, this isn't the Noctua one, but you guys get the point. Editor, cleverly replace this with the Noctua one in my hand. Hey, that one. Two different color schemes. You know what though? This is great for making videos. I was just standing here thinking, now I have to turn the case around and do this and then do that. No, now I have to just stand here and plug in all the connectors. This is awesome. That is a, wow. That is a very high profile connector. Yes, they do make right angle adapters for that. Whoa, no way. No way. No way. Past Linus or realistically past Alex probably. Bought this. Nice. No way. This way. No, no, no, no, no, no, no. That's okay, that's okay, that's okay. That's okay. See, we're gonna come down like this. Oh yeah. Not bad at all. That just saved the day. I mean, how uncool would that be? Like, oh, nice cable-free system. Too bad none of the ports work. Not gonna lie, this is tripping me out a little bit though. I just don't know which way is up and which way is right and I'm in topsy-turvy land. My front panel audio thing is here because that makes perfect sense. Yeah, in mirror reality. Man, I don't know, Paul. I think I might kind of like it. How's the underside of that bus, Paul? Wow, that is so clean. And I didn't even have to do that much work on the cable management back here. Okay, I mean, we needed this special adapter. Other than that, pretty easy. Okay, wish me luck, everyone. How about good luck? You didn't specify. No, it needs to be good luck. You don't wish people bad luck. I just wish you luck. Luck of any form. Okay. Hey, that is sick. And other than getting your hands on the motherboard, all you need to recreate this build is a few dollars in Dremel cutting disks. Oh, and you'll probably wanna change the power supply to a more reasonable one. And you'll probably wanna change the GPU. See, the thing is we wanted to use a Radeon 6950 XT. That thing is a flippin' awesome value right now. But again, our choices were dictated a little bit by aesthetics. This gigabyte Aero RTX 4070 looks flippin' awesome. And that is the only real justification that we have for choosing this over the 6950 XT. Truth is that it's kinda hard to justify any Nvidia card right now, at least unless you're spending over $1,000, which we are not. Oh, actually, before we put this in, this is another really cool idea from ape. Instead of having the 16-pin connector out here where it's gonna stick out and look all gross, he had the idea of hiding it in between the fins here. So it just kinda like, I don't know, it's hidden. Kinda ingenius. Because of the ease of this build, we haven't gotten as much overhead footage from our Nexigo camera up here as we otherwise might have, but this is a pretty good opportunity. The M.2 cover had to come off. And the order of operations here is very important. So that's gonna go there. Then this is gonna go back on with this removed. Whoops, this is gonna go here. Nice. Oh yeah, oh yeah, yeah, yeah, yeah, yeah. I mean, as far as ugly cable messes go, that's pretty acceptable, eh? That is not bad. Okay, all right, I'm okay with it. If that's all the cable that I have to look at in my system, forget about it. Check this out. Look how heavy that freaking fan is. Just hitting the table. It's like, whoa! It's as quiet as they say it is, though. I'm looking forward to hearing it, or not hearing it. What do you think, Colin, is it gonna post? Oh, that's a good sign. Wait, what? Security violation. But, okay, all our memory is detected. CPU turboing over five gigahertz comfortably. There is something we need to adjust. We need to make sure that we have our XMP profile enabled, but otherwise, a successful build, and man, that looks so good. That big security error was just because we had this plugged in and TPMs enabled, so it got really unhappy that we were trying to boot from this USB drive. I don't love the amount of work it was, but I love this computer. Like, wow. I just wanna do a quick Cinebench here to see if we're gonna get, oh, did it just freeze? See, that's the thing. I wanted to do just a couple quick benchmarks and see if this thing performs as normal, works as normal, because small brand motherboards, sometimes they don't turbo properly and stuff like that. Then again, the whole BIOS was all MSI branded and everything, and oh, oh, it looks like it actually, oh, it might have just been Cinebench that crashed. Okay, it's running again. There is some weirdness. Hardware info's not reporting core temperatures for some reason, but it's turboing just fine. We're running at 4.8 gigahertz, and performance here looks totally in line with what I'd expect for a 7600X. Maybe I just don't overthink it for now. How about games? I don't know what's more impressive, the fact that this thing just immediately worked exactly as expected, or the fact that it is so flipping quiet right now. We are turboing to five gigahertz right now, our GPU's at nearly three gigahertz, and this whole computer is nearly silent. My microphone's right here. Just whoosh. You know what I'm really curious about, though? How much of it is the metal fan? Oh, wow. That does not sound like a fan that is spinning that fast. Man, this is really impressive. The frequency makes it really easy to block out. Even with a glass panel, I can barely hear it. I really want to do something about the power connector on the GPU, whether it's an additional slot at the back of a card, like we've seen from Apple and Asus in the past, or whether it's just hiding the connector better, like ape suggested. But overall, this is a pretty clever idea that does make a clean build a lot easier. Well, easier, at least it's properly adapted case design. Ultimately then, with the combination of a new motherboard standard that requires new case designs from case manufacturers and piling on the potential additional innovations in GPU power supply and cooler design, ape still has a long road ahead of him in getting this adopted, but I wish him luck because Paul's ultimately right that not everyone wants to mod their case, and we need someone, anyone who has a clear vision to push this thing forward rather than leaving motherboard manufacturers to just pursue their own independent paths. I mean, that's why we still have front panel connectors that aren't standardized, just like we have this segue that isn't standardized to our sponsor, Nexigo. The Nexigo Iris 4K AI webcam features a large one over 1.8 inch Sony Starvis sensor that delivers crystal clear image quality for streaming, video conferencing, and content creation, even in challenging light conditions. The on-screen display and remote control mean that no software installation is required, while the onboard flash memory saves all your presets right in the camera. The Iris boasts an aperture of F2.2 and a 4.2 millimeter focal length, and with the 90 degree field of view and 10X digital zoom, you won't miss even the smallest details. The dual noise canceling mics also make sure that you're easily understood, while the high speed HDMI port delivers uncompressed 4K video direct to a recorder or capture card. All the top footage you guys saw in this video went straight from our Nexigo Iris into our capture system on set over here. So if you like what you've seen, go ahead and check it out. The regular price is $249.99, and right now you can get it for $30 off. Check out the details in the video description. If you like this build, check out our recent video where we got our hands on a beautiful custom PC that was built by another Bilibili creator around one of APE's other motherboard designs.",
    "transcript_keywords": [
        "Yeah",
        "case",
        "motherboard",
        "back",
        "connectors",
        "Ape",
        "thing",
        "build",
        "video",
        "cable",
        "fan",
        "DIY Ape",
        "good",
        "connector",
        "DIY ape connector",
        "pretty",
        "power",
        "motherboard tray",
        "CPU",
        "power supply"
    ],
    "transcript_entity_values": [
        "one",
        "LAN",
        "90-degree",
        "less than $20",
        "4070",
        "five gigahertz",
        "USB-C",
        "RGB",
        "zero",
        "Corsair",
        "GPU",
        "The Nexigo Iris 4K AI",
        "90 degree",
        "249.99",
        "The Fractal Pop Mini Air",
        "Paul's Hardware",
        "Iris",
        "Cinebench",
        "6,000",
        "over half",
        "just 140 bucks",
        "Linus",
        "the day",
        "one over 1.8 inch",
        "24",
        "the start of the year",
        "20 gigabit per",
        "CMOS",
        "Corsair MP600 Pro",
        "B650",
        "Noctua NH-L12S",
        "Apple",
        "first",
        "4.2 millimeter",
        "32",
        "Radeon 6950 XT",
        "Cinebench",
        "Computex",
        "XMP",
        "MSI",
        "over $1,000",
        "4",
        "YouTube",
        "1050 watt",
        "CPU",
        "Wi-Fi 6E",
        "6950",
        "six",
        "Aero",
        "DIY",
        "Nexigo",
        "PCIe Gen 5",
        "Sony",
        "IO",
        "China",
        "only $20",
        "30",
        "Alphacool Apex Stealth",
        "Paul",
        "Alex",
        "XT",
        "16",
        "M.2",
        "Bilibili",
        "632",
        "two and a half",
        "80%",
        "AM5",
        "Jordan",
        "Alphacool",
        "second",
        "750 to 850 watts",
        "7600",
        "two terabyte",
        "APE",
        "more than $200",
        "Two",
        "4.8 gigahertz",
        "Dremel",
        "about this morning",
        "Asus",
        "Nexigo Iris",
        "90",
        "today",
        "a few dollars",
        "RAM",
        "8",
        "Micro ATX",
        "Nvidia",
        "100",
        "USB",
        "DDR5",
        "Jordan",
        "Noctua",
        "Colin"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON"
    ],
    "vector": [
        -0.09496087580919266,
        0.022332975640892982,
        0.010325864888727665,
        0.007061687298119068,
        0.02684611827135086,
        -0.0035252280067652464,
        -0.03512398898601532,
        0.008650792762637138,
        -0.09903931617736816,
        0.015343560837209225,
        -0.01087113842368126,
        0.011655455455183983,
        -0.018502041697502136,
        -0.02726595476269722,
        -0.014552721753716469,
        0.10001178830862045,
        0.0754377692937851,
        -0.10110463201999664,
        -0.01942848227918148,
        0.04602282866835594,
        0.04767428711056709,
        -0.09440892934799194,
        -0.04568903520703316,
        -0.014188245870172977,
        -0.02061314508318901,
        -0.03002404421567917,
        0.08381662517786026,
        -0.00277895899489522,
        0.06015435606241226,
        -0.048235923051834106,
        -0.0032155278604477644,
        0.06181725487112999,
        0.004434414207935333,
        -0.009857581928372383,
        -0.020116042345762253,
        -0.08207273483276367,
        0.12426657974720001,
        -0.0691944882273674,
        -0.039670027792453766,
        -0.08298331499099731,
        0.024992458522319794,
        -0.0171415563672781,
        -0.03882450610399246,
        0.02474263496696949,
        0.03999463468790054,
        0.005244043655693531,
        0.004760195501148701,
        -0.053323522210121155,
        0.012141622602939606,
        -0.058690812438726425,
        -0.04957285523414612,
        -0.03560343384742737,
        -0.04657987132668495,
        -0.016380801796913147,
        -0.07898802310228348,
        0.09440493583679199,
        -0.03908742591738701,
        -0.16415219008922577,
        0.0482541024684906,
        -0.048340052366256714,
        0.049786604940891266,
        -0.1149882823228836,
        -0.003416287712752819,
        0.0881589874625206,
        0.05382765829563141,
        -0.0036323335953056812,
        -0.02144463174045086,
        -0.045052967965602875,
        0.044979795813560486,
        -0.03353513404726982,
        -0.04285181686282158,
        -0.0038186677265912294,
        0.03785673901438713,
        0.04225493222475052,
        -0.03546785190701485,
        0.07276339828968048,
        0.04145290330052376,
        -0.03346562385559082,
        0.03240537643432617,
        0.0010324628092348576,
        -0.033750370144844055,
        -0.016004925593733788,
        0.05494040250778198,
        -0.02070661634206772,
        0.060638196766376495,
        -0.013844683766365051,
        0.008864994160830975,
        -0.013016271404922009,
        0.06666066497564316,
        -0.12612472474575043,
        0.029485808685421944,
        0.01835155487060547,
        0.08018699288368225,
        -0.016841355711221695,
        -0.008105196990072727,
        0.019753361120820045,
        -0.01309697050601244,
        -0.05424870550632477,
        -0.028776099905371666,
        0.03508317470550537,
        0.03396725654602051,
        0.035338081419467926,
        0.041355833411216736,
        -0.008590596728026867,
        -0.020641053095459938,
        0.03792112320661545,
        0.0016865975921973586,
        0.03310932591557503,
        -0.018427854403853416,
        0.008211437612771988,
        -0.09913220256567001,
        0.08611945807933807,
        -0.026520803570747375,
        0.004240801557898521,
        0.015809541568160057,
        0.004286716692149639,
        -0.07225722819566727,
        0.02722269669175148,
        0.08970094472169876,
        -0.003407273208722472,
        0.04428652673959732,
        -0.015168365091085434,
        -0.028627367690205574,
        0.03397241607308388,
        0.0185212641954422,
        0.011624326929450035,
        -0.05085883289575577,
        1.2096235803356649e-32,
        0.024983834475278854,
        0.09426449239253998,
        -0.05258193612098694,
        -0.035906508564949036,
        0.01585402525961399,
        0.048208363354206085,
        0.021578392013907433,
        -0.04734089598059654,
        -0.018720125779509544,
        0.02388003095984459,
        -0.0939144715666771,
        -0.02009698376059532,
        -0.05778101831674576,
        0.07421321421861649,
        0.031138820573687553,
        -0.04541754350066185,
        -0.014071692712605,
        0.012425316497683525,
        0.029547475278377533,
        0.013018027879297733,
        0.06650671362876892,
        0.06577467918395996,
        0.058282963931560516,
        -0.08891492336988449,
        0.054290082305669785,
        0.038496196269989014,
        0.014029443264007568,
        -0.018374742940068245,
        0.022948654368519783,
        0.021630555391311646,
        -0.009621779434382915,
        -0.08180534094572067,
        -0.013134343549609184,
        0.023251429200172424,
        -0.03988340124487877,
        0.012924294918775558,
        -0.05317189171910286,
        -0.10888952016830444,
        0.013655109331011772,
        0.037289831787347794,
        0.021819576621055603,
        0.07594704627990723,
        -0.08664259314537048,
        -0.048888903111219406,
        -0.0680258721113205,
        0.0364793986082077,
        0.06377123296260834,
        -0.007862376980483532,
        -0.0022266407031565905,
        0.029470518231391907,
        -0.0946502760052681,
        0.01313810981810093,
        -0.026106704026460648,
        0.0021421511191874743,
        0.04185078665614128,
        -0.046562377363443375,
        0.06149766594171524,
        0.0019344330066815019,
        0.10798311978578568,
        0.09670890867710114,
        -0.03648568317294121,
        -0.061656467616558075,
        -0.033840157091617584,
        0.020582590252161026,
        -0.03757472336292267,
        0.08473174273967743,
        0.08275806158781052,
        0.02533934824168682,
        -0.10374650359153748,
        -0.03420490771532059,
        -0.0664421021938324,
        0.03712501376867294,
        0.06049806624650955,
        -0.002032893244177103,
        -0.01242309994995594,
        0.005661735776811838,
        -0.038283757865428925,
        -0.04703768342733383,
        -0.03499478101730347,
        -0.0414150133728981,
        -0.06790853291749954,
        0.02476688101887703,
        -0.012519987300038338,
        0.07585526257753372,
        0.002922611078247428,
        0.033720068633556366,
        0.04038337618112564,
        0.05611013248562813,
        -0.02364162914454937,
        -0.02656979113817215,
        0.005194525234401226,
        -0.043470609933137894,
        0.018561864271759987,
        0.06377258151769638,
        -0.004328039009124041,
        -1.0541496852916351e-32,
        -0.038890935480594635,
        -0.0500737689435482,
        0.006349617149680853,
        0.042967841029167175,
        -0.022364158183336258,
        -0.02461989037692547,
        0.08056758344173431,
        -0.0016985571710392833,
        0.03512578457593918,
        -0.05369386076927185,
        0.03281428664922714,
        0.03094484657049179,
        0.01296182256191969,
        0.05541335791349411,
        0.010813473723828793,
        -0.005084131844341755,
        0.025962747633457184,
        -0.09791858494281769,
        0.06901495903730392,
        -0.07201753556728363,
        0.013469202443957329,
        0.06317202746868134,
        -0.05391379073262215,
        -0.05186590179800987,
        0.008979057893157005,
        0.09568633139133453,
        0.012160207144916058,
        -0.04254584386944771,
        0.0022245007567107677,
        0.04885675013065338,
        -0.0319666862487793,
        0.03241457790136337,
        -0.018251512199640274,
        -0.009293608367443085,
        0.08283211290836334,
        0.027790771797299385,
        0.042026273906230927,
        0.05139116570353508,
        0.03466803580522537,
        -0.050471026450395584,
        0.021624110639095306,
        0.10889799892902374,
        7.525745604652911e-05,
        -0.05598542466759682,
        0.03766486421227455,
        -0.004840080626308918,
        -0.044659942388534546,
        -0.16125501692295074,
        0.03943915292620659,
        -0.010591140948235989,
        -0.08172710239887238,
        -0.05814826861023903,
        0.05608423426747322,
        0.021477751433849335,
        -0.033352795988321304,
        -0.1099264994263649,
        -0.0358368344604969,
        0.03502410277724266,
        0.0024446118623018265,
        -0.055892523378133774,
        0.09764238446950912,
        0.03183577582240105,
        -0.10037168860435486,
        -0.07960234582424164,
        0.04192177206277847,
        0.059215717017650604,
        0.05677900090813637,
        0.008632260374724865,
        -0.0005641664611175656,
        -0.03261988237500191,
        -0.045638035982847214,
        -0.036075349897146225,
        -0.012806590646505356,
        -0.06890194118022919,
        -0.017638523131608963,
        0.09287545830011368,
        0.03166763857007027,
        -0.03655577078461647,
        0.02892056480050087,
        0.008145530708134174,
        -0.0759853944182396,
        -0.023972710594534874,
        0.013573873788118362,
        0.03233844041824341,
        0.030675411224365234,
        -0.03704347088932991,
        0.02281891740858555,
        0.011374091729521751,
        0.06455589085817337,
        -0.06870303303003311,
        -0.06418594717979431,
        -0.005011714529246092,
        -0.048254769295454025,
        0.0543522946536541,
        0.026043541729450226,
        -6.089444326562443e-08,
        -0.0028018972370773554,
        -0.039024218916893005,
        0.013553124852478504,
        0.0562361404299736,
        0.08260858058929443,
        -0.03947751596570015,
        -0.06841181218624115,
        -0.09861116856336594,
        -0.0160115547478199,
        0.018896784633398056,
        0.08624015748500824,
        -0.057274043560028076,
        0.0010025902884081006,
        0.026898371055722237,
        -0.011043533682823181,
        0.041011642664670944,
        -0.05858214199542999,
        0.06804928928613663,
        -0.0014295456930994987,
        -0.060053396970033646,
        0.019390253350138664,
        0.0023479568772017956,
        0.09977686405181885,
        -0.015879981219768524,
        0.01776811294257641,
        0.007210778538137674,
        0.011860319413244724,
        0.010171225294470787,
        0.08279402554035187,
        0.017352188006043434,
        -0.11130794882774353,
        0.013904759660363197,
        0.09821057319641113,
        0.0034088166430592537,
        0.09311644732952118,
        -0.007763180416077375,
        0.007089700549840927,
        0.1092556044459343,
        0.13318118453025818,
        -0.012994627468287945,
        0.0054100253619253635,
        -0.10271259397268295,
        -0.03085201233625412,
        0.006779426708817482,
        0.08259809017181396,
        -0.0027303164824843407,
        -0.05727730691432953,
        -0.11155383288860321,
        -0.012217397801578045,
        0.002874980680644512,
        -0.01172504760324955,
        0.01422080397605896,
        -0.00885813683271408,
        0.03927169740200043,
        0.031203031539916992,
        -0.062120549380779266,
        -0.05595790967345238,
        0.06370552629232407,
        0.022446703165769577,
        0.00537928706035018,
        0.011758306995034218,
        -0.0927722379565239,
        -0.04562324658036232,
        0.00425935722887516
    ]
}