{
    "id": "TjW7yCqsHr8",
    "title": "Binary IP Conversions  | Free CCNA 200-301 Course | Video #14",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-09-06T14:43:22Z",
    "video_url": "https://www.youtube.com/watch?v=TjW7yCqsHr8",
    "category": "Science & Technology",
    "tags": [
        "binary",
        "binary options",
        "computer science",
        "decimal",
        "binary to decimal",
        "binary to decimal conversion",
        "computers",
        "numbers",
        "binary decimal",
        "binary numbers",
        "ccna",
        "packet tracer",
        "cisco packet tracer",
        "ccna 200-301",
        "networking",
        "ccna training",
        "cisco ccna",
        "free ccna",
        "ccna study",
        "ccna certification",
        "ccna exam",
        "new ccna",
        "ccna full course",
        "ccna tutorial",
        "ccna 2020",
        "200-301",
        "cisco training",
        "binary option",
        "number system",
        "binary conversion",
        "how to convert decimal to binary",
        "binary converter"
    ],
    "views": 28719,
    "likes": 817,
    "comments_count": 72,
    "description": "Can you convert IPv4 addresses to binary? Join my Discord here:  Buy the full course here for $10:  Or support the mission, join thisisIT:  Binary Slides:   This is video #14 of my FREE CCNA Course 200-301 - a complete CCNA course for the new Cisco CCNA exam. I am going to be covering all the topics in the exam blueprint in this course.   I want to make this content practical and it will include a lots of labs and demonstrations to help you better understand topics on the exam.  The course will contain: - Videos - Labs using Cisco Packet Tracer - Quiz Questions - And more!  Menu:  Overview: 0:00 Binary Joke: 0:13 Decimal to Binary Example 1: 1:11 Decimal to Binary Example 2: 1:53 Decimal to Binary Example 3: 3:00 Free Quizzes: 4:33 IPv4 address, subnet mask, gateway example: 5:56 Mac IP address settings example: 8:49 What is an IPv4 address: 9:30 IP address conversion to binary: 10:51 Free unlimited quizzes: 14:44 Thank you to my supporters: 15:12  Previous Binary Video:   CCNA 200-301 Playlist:   Support me via thisisIT: support the mission, join thisisIT:   Or, buy the CCNA course and support me: DavidBombal.com: CCNA ($10):  Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   Get Packet Tracer here:   ====================== Special Offers: ====================== Cisco Press: Up to 50% discount Save every day on Cisco Press learning products! Use discount code BOMBAL during checkout to save 35% on print books (plus free shipping in the U.S.), 45% on eBooks, and 50% on video courses and simulator software. Offer expires December 31, 2020. Shop now.  Link: bit.ly/ciscopress50  ITPro.TV:  30% discount off all plans Code: DAVIDBOMBAL   Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  binary binary numbers CCNA Free CCNA 200-301 ccna 200-301 free ccna course network networking thisisit osi model tcp/ip model  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #binary #decimal #ccna",
    "description_links": [
        "http://discord.davidbombal.com",
        "https://bit.ly/ccnafor10",
        "https://bit.ly/thisisitccna",
        "http://bit.ly/binarypdf1",
        "https://youtu.be/Toa5-1i4wRE",
        "https://bit.ly/freedbccna",
        "https://bit.ly/thisisitccna",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10",
        "https://www.netacad.com/courses/packet-tracer",
        "https://itpro.tv/davidbombal"
    ],
    "transcript": "- In this video I'm gonna continue discussing binary. In a previous video, which I've linked here and below, I introduced the basic concepts of binary. So I explained how we get a number such as 1-0 to actually mean two. I spoke about this well-known joke where 1-0 actually means two. So there are only two types of people in this world. Those that understand binary and those that don't. If you don't understand the joke, please make sure that you go back and watch that video. In this video, I'm gonna continue the discussion and I'm gonna show you how to convert a dotted decimal IP version four address to binary. We're going to take numbers within an IP address and convert them to binary. You need to know how to convert decimal numbers to binary. You also need to learn how to convert hexadecimal numbers to binary, or hexadecimal numbers to decimal. We'll cover hexadecimal in a separate video. In this video we're gonna concentrate on the conversion of decimal IP version four addresses to binary. Okay, let's get started. (upbeat music) What is the binary equivalent of one in decimal? So it's not this because that would be 128. It's not this, 'cause that would be 64. It's not this, 'cause that would be 32, same there, same here and so forth. We wouldn't use any of those. The only bit that we would set on is that, so that in binary equals that in decimal, so there you go. But we typically write it this way. Because an IP version four address consists of four groupings or four octets as it's called. So four groupings of eight bits or four octets. So again, one in decimal, we would write like this in binary. Okay, so let's see if you can answer this question. Pause the video if you need more time, I'm gonna go through the question and then I'll answer it. What is the binary equivalent of 192 in decimal? So what is 192 equal to which binary bits here would you set on to get 192? Now pause the video at this point if you need more time, otherwise I'm gonna explain the answer. Now the easiest way to work this out is look at 192. Does 192 minus 128 equal a positive or negative value? In this case, it's gonna equal 64. So we know that we need to set this value on, because that plus, and it's quite easy here, 64 equals 192. So those two bits need to be on, the rest are set off, because 192 minus 128 minus 64 equals zero or that plus that equals this. So in other words, one one followed by six binary zeroes equals 192 in decimal. Hopefully that makes sense, but here's another example in case it doesn't. I'm gonna teach you a trick in this example as well, we've got 253 here. What is the binary equivalent of 253. Hint, think about working backwards. If you need more time, pause the video now, otherwise I'm gonna tell you the answer. Okay, so 253, we could do the method where we minus 128 to make sure that it's not less than zero or we could work backwards and say, 255 minus 253 equals two. So we wanna remove two out of the equation and leave all the other values on. So in other words, we could just state immediately turn this off and leave everything else on. So in other words, 128 plus 64 plus 32 plus 16 plus eight plus four plus one equals 253. So you could either try and work it out by saying 255 minus 128, gives me a value and then subtract 64 from that, and then subtract 32 from that, subtract 16 from that and so forth until you get to zero, or you could just say, 255 minus 253 equals two. I know that two should be removed. Everything else should be on. So that equals 253 or to write it in binary, it looks like that. Now, before we go any further, I've created some quizzes on my website, which gives you unlimited examples of converting binary to decimal and decimal to binary. So if you go to Davidbombal.com/freequiz, you can get access to these quizzes or simply look under free, free quiz to get access to all of these free quizzes. So as an example, here we've got a quiz asking you to convert decimal to binary. So I know that that is the answer. So I'm gonna click check answer, and I'm told that that is correct. Here's another example, what is the binary equivalent? Let's put a incorrect number in, so something like that, check answer, I'm told that that is wrong, try again. You can keep on trying or you can click give up if you wanna get the answer. So the software keeps track, telling you how many you got correct, and how many you gave up on. So you can do that quiz as an example, or you can go to the opposite, which is binary to decimal. So I'll just put in one two three, check the answer and you can see it's wrong, try again, or click give up and it'll tell you what the correct answer is. So those are free quizzes on Davidbombal.com that you can use if you wanna practice. I'm gonna talk about IP addresses in a lot of detail later, but let's look at an example on this phone and you'll be able to do something similar on an Android device or a windows PC and so forth. I'm gonna go to settings. I'm gonna look at the information about my wireless network and what I can see here is that my IP address was configured automatically. Basically a server allocated an IP address to my phone. That's very typical of networks using what's called DHCP or dynamic host configuration protocol, a server allocates an IP address to your device. In this example, my IP address on the phone is 192.168.1.72, now that is a full octet IP address. IP version four octet eight binary values. Hopefully it makes a bit more sense now, 192 in decimal equates to 1100 followed by four zeros. So one one and six binary zeros is the equivalent of 192 in decimal. So we've got an eight bit binary number, 192, followed by a dot, followed by another eight bit binary number. In this example, 168, followed by another number one, followed by the last number 72. Four octets or four binary eights gives us an IP version four address with the length of 32 bits, eight plus eight plus eight plus eight 32 bits in binary. So 192 is an eight bit binary number, which equates to one, one followed by six zeros. We could do something similar for 168. We could work out what that is in binary. One is fairly simple. It's seven binary zeros followed by a binary one, gives me decimal one and then we've got 72. We've also got a subnet mask. Subnet masks become very important to determine if a host is on the same subnet as you. We'll talk about that in more detail in the subnetting section, but hopefully now you can recognize 255. 255 is eight binary ones. So you've got eight binary ones, 255, another eight binary one's, 255. Third 255 is equivalent to eight binary ones. And then we've got eight binary zeros. 32 bit subnet mask once again, so four octets or four groupings if you'd like of binary ones and zeros, which are eight bits in size. Then we've got a default gateway, 192.168.1.249. That is an example of an IP version four address with its subnet mask and default gateway. In this example, on my phone, you could do something similar on a computer. So in my example, I could go to my wireless connection on my PC, open network preferences. And what I can see here is my Wi-Fi connection on this laptop or Macbook in this case has an IP address of 10.0.0.2. If I go to advanced, TCP/IP. TCP/IP is the protocol that we're using. IP version four is the IP version that we're using here. We can see IP addresses, 10.0.0.2, subnet mask 255.255.255. Router is 10.0.0.1. An IP version four address is an address used to uniquely identify a device on an IP version four network. We have what are called IP version four addresses, which would look something like this. And then we have the IP version six addresses, don't worry about this at the moment, but we could have an IP version six address that looks something like this. So we won't worry about IPV six for the moment. IP version four is four octets. In other words, four times eight bits in an IP version four address. So each value in the octet is eight bits or as an analogy once again, eight cables in the range zero to 255. So if we looked at 10 as an IP address, 10 looks like this, and I'll explain that in more detail in a moment, 129 looks like this. 16 looks like this. And 123 looks like this. We can write the IP address as a decimal IP address, a dotted decimal, that's the most common way to write it. But devices use binary. When you create an access list or do something where you need to permit or deny traffic, you're going to wanna think in binary, have a look at the binary to understand what's going on. Devices such as routers and firewalls use binary to determine what's permitted or denied. Okay, so here's our example. We've got 10, are you able to work out why it equals this? Again, pause the video if you want more time to work it out for yourself, but here's the answer. Using our table, this is what the binary number looks like, for zeros followed by one, followed by binary zero, followed by one, followed by binary zero. Now to get to 10, 10 minus 128 would be a negative number. So it wouldn't be this. Minus 64 is a negative number, wouldn't be that, wouldn't be that, wouldn't be that. But 10 minus eight gives us two, so eight plus two, like that equals 10, which means we set this bit on and this bit on. Remember this is equal to two to the power of three. So two states, three cables equals eight. Here we've got two states, one cable, decimal equivalent is two, so this in binary is equal to 10 in decimal. Now I'm hoping that makes sense. I'm gonna do a few more examples now. So we're gonna look at 129 as an example. If you want a whole bunch of examples, have a look at those quiz questions that I have on my website, but feel free to ask questions if you struggling, or if you need me to explain this a different way. So looking at 129, 129 minus 128 gives us a one. So this slide is actually wrong. This should be a zero because 129 minus 128 gives us one. It doesn't allow us to minus 64 and still have a positive number. So 128 plus one equals 129. So this slide is actually wrong. Let me update it right now because that should be one followed by six zeros and a one. And this should be one followed by six zeros and a one, 128 plus one equals 129, definitely not plus 64. Okay, so that looks better. 128 plus one equals 129. So that's the binary equivalent of 129. You could always use a calculator once again to check your work. So 129 in decimal equals that in binary. In the exam, once again, you don't have access to a calculator. So you'll need to know this stuff. 16 is fairly easy. 16 is just this binary bit, so that's what 16 looks like in binary. That's what it looks like in decimal. And then we've got 123. Now 123 minus 128 would be less than zero, so it's not equal to that, but 123 minus 64 equals 59. So in other words, we'll set this value on 59 minus 32 equals 27. So that bit will be set on. 27 is greater than 16, so we'll set this bit on. 27 minus 16 gives us 11, that's greater than eight, so we'll set this bit on. 11 minus eight gives us three, three minus four is a negative number, so that bit is set off, but three minus two equals one, so that bit is set on. And so is this bit to give us zero. So 123 looks like that in binary. It's 64 plus 32 plus 16 plus eight plus two plus one equals 123 binary value, a decimal value. I don't know how easy you found that. A lot of this depends on how good your basic arithmetic is. That's obviously a lot easier and that's a lot easier than working out 123, but the principle applies, same principle applies. Okay, so if you want some unlimited tests, you can go to Davidbombal.com and go to free quizzes. There's binary to decimal quiz, as well as a decimal to binary quiz. These are unlimited quizzes. They'll just ask you over and over again, what the values are. It's important that you know how to work with binary. It can be quite boring, but it's a fundamental building block that you need to know to be able to work in the real world, as well as pass the CCNA exam. (upbeat music)",
    "transcript_keywords": [
        "binary",
        "decimal",
        "equals",
        "minus",
        "address",
        "bit",
        "version",
        "number",
        "bit binary number",
        "video",
        "binary equivalent",
        "binary number",
        "answer",
        "set",
        "bits",
        "bit binary",
        "work",
        "equal",
        "equivalent",
        "quizzes"
    ],
    "transcript_entity_values": [
        "eight plus eight plus eight plus",
        "59",
        "six",
        "zeros",
        "Minus 64",
        "123",
        "three",
        "only two",
        "one one",
        "253",
        "32",
        "Android",
        "four octets or",
        "minus 253",
        "TCP/IP",
        "seven",
        "11",
        "Router",
        "64",
        "four",
        "two",
        "One",
        "11 minus eight",
        "10 minus eight",
        "eight",
        "less than zero",
        "zero",
        "27",
        "six zeros",
        "192",
        "16 plus eight",
        "72",
        "IP",
        "four octet eight",
        "255.255.255",
        "minus 128",
        "three minus two",
        "32",
        "Four",
        "one",
        "192.168.1.72",
        "three minus four",
        "192.168.1.249",
        "Third 255",
        "10 minus 128",
        "greater than eight",
        "168",
        "1100",
        "one two three",
        "Davidbombal.com",
        "27 minus 16",
        "64",
        "128",
        "minus 64",
        "CCNA",
        "Macbook",
        "1",
        "DHCP",
        "129",
        "123 minus 128",
        "another eight",
        "16",
        "four zeros",
        "10",
        "255",
        "72"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ],
    "vector": [
        0.03639359399676323,
        0.008121388964354992,
        -0.005053946282714605,
        -0.04613207280635834,
        -0.033623479306697845,
        0.0008281889604404569,
        -0.004261209163814783,
        -0.04573522135615349,
        -0.09349416196346283,
        -0.0073912180960178375,
        -0.016888143494725227,
        -0.09623994678258896,
        -0.006078037433326244,
        -0.04735343158245087,
        -0.0008911106269806623,
        0.039094313979148865,
        -0.02558733895421028,
        -0.002978236647322774,
        -0.0016692965291440487,
        -0.017027834430336952,
        0.004602085333317518,
        0.011437025852501392,
        -0.016691099852323532,
        -0.051578741520643234,
        -0.09513719379901886,
        0.026922954246401787,
        0.02921142429113388,
        0.01232257578521967,
        -0.025127362459897995,
        -0.08832316100597382,
        -0.008152556605637074,
        0.04901141673326492,
        0.07041667401790619,
        0.0496409647166729,
        0.008727356791496277,
        -0.0460909865796566,
        0.059083472937345505,
        0.04374731704592705,
        -0.027135487645864487,
        0.05931984260678291,
        0.0042451536282896996,
        -0.031729117035865784,
        0.02158670499920845,
        0.0036112612579017878,
        0.025068843737244606,
        -0.01859978213906288,
        0.026318304240703583,
        -0.004537766333669424,
        0.08771715313196182,
        -0.05465936288237572,
        0.005407675635069609,
        0.019019633531570435,
        -0.029556049033999443,
        0.009550678543746471,
        0.003941464703530073,
        0.004765743389725685,
        -0.038556769490242004,
        -0.03419903665781021,
        0.018875673413276672,
        0.017306862398982048,
        -0.0541703999042511,
        -0.020147640258073807,
        -0.02358420006930828,
        0.026638088747859,
        -0.003302739467471838,
        -0.03784454986453056,
        -0.05354619398713112,
        0.07229302078485489,
        0.03128884732723236,
        -0.029137345030903816,
        -0.09816916286945343,
        -0.00311072263866663,
        -0.039678096771240234,
        0.09408369660377502,
        -0.03006092831492424,
        0.05362092703580856,
        0.03587533161044121,
        -0.049411941319704056,
        0.0031730777118355036,
        -0.005449836142361164,
        0.02065751887857914,
        0.007276599295437336,
        0.05303385108709335,
        -0.004835858941078186,
        0.0315033383667469,
        -0.011608623899519444,
        -0.013119873590767384,
        0.007835987024009228,
        -0.02829013764858246,
        -0.0022257103119045496,
        -0.029249629005789757,
        0.016918418928980827,
        0.018060879781842232,
        0.031480368226766586,
        0.1408206671476364,
        0.0223749540746212,
        0.06773100048303604,
        -0.12125114351511002,
        0.012362970039248466,
        0.07746216654777527,
        0.03590605780482292,
        -0.00368011393584311,
        -0.10048814117908478,
        -0.052860651165246964,
        -0.03292237967252731,
        0.04004734009504318,
        0.04088670760393143,
        0.04861890524625778,
        0.03130999207496643,
        0.026132874190807343,
        -0.041459646075963974,
        0.01829766109585762,
        -0.03947136178612709,
        -0.12360339611768723,
        0.044843655079603195,
        0.04275999590754509,
        -0.006179779302328825,
        0.058423515409231186,
        0.013927614316344261,
        0.0032030667643994093,
        -0.0932803675532341,
        0.03578457981348038,
        -0.00538385845720768,
        -0.008312113583087921,
        0.0047088973224163055,
        -0.08449771255254745,
        0.04048869386315346,
        8.115832668583883e-33,
        -0.05131993815302849,
        -0.01185002364218235,
        -0.06846410036087036,
        0.029223939403891563,
        0.07740019261837006,
        0.005239971913397312,
        0.05510851368308067,
        0.09092141687870026,
        -0.12465070188045502,
        0.025647584348917007,
        0.0005810190923511982,
        -0.07662525773048401,
        0.013577978126704693,
        0.05878114327788353,
        -0.019824320450425148,
        -0.0349823497235775,
        -0.007782683242112398,
        0.004003914538770914,
        0.06422926485538483,
        0.010668500326573849,
        -0.033660437911748886,
        0.017715919762849808,
        0.051627736538648605,
        0.024780945852398872,
        0.11174534261226654,
        0.023563968017697334,
        -0.013321291655302048,
        -0.05895664170384407,
        0.1004435196518898,
        -0.0006857449188828468,
        -0.05780963599681854,
        0.01617387682199478,
        -0.0784958004951477,
        -0.06879870593547821,
        0.03227189555764198,
        -0.017040247097611427,
        0.02926449663937092,
        -0.02228928543627262,
        -0.08135098218917847,
        -0.014063036069273949,
        -0.03540552780032158,
        -0.028991546481847763,
        -0.038126420229673386,
        -0.07482153177261353,
        -0.05375986546278,
        0.011952193453907967,
        0.003162151901051402,
        0.04095136374235153,
        0.03936126083135605,
        0.030285188928246498,
        -0.0007225355366244912,
        0.08248525112867355,
        -0.08570064604282379,
        -0.0677010640501976,
        -0.003313954919576645,
        -0.07125326991081238,
        0.041811469942331314,
        0.035168327391147614,
        0.011811261996626854,
        0.0764814168214798,
        0.001611101790331304,
        0.08185692131519318,
        -0.05121593922376633,
        0.05416092649102211,
        0.004171822685748339,
        0.015439932234585285,
        -0.056649185717105865,
        -0.06403777003288269,
        0.012567124329507351,
        0.00926690548658371,
        -0.04166586324572563,
        0.0014907836448401213,
        0.04294240102171898,
        0.005173369776457548,
        0.030162915587425232,
        0.05593783035874367,
        -0.08459316194057465,
        -0.047399360686540604,
        0.0055361660197377205,
        -0.02816437929868698,
        -0.015028639696538448,
        0.05316758528351784,
        0.04429136589169502,
        -0.0421968437731266,
        -0.05340222641825676,
        -0.03018755093216896,
        0.06954047828912735,
        -0.059747375547885895,
        0.005105886142700911,
        0.03442300483584404,
        0.04592207819223404,
        -0.04390954598784447,
        -0.051574282348155975,
        0.01441478356719017,
        -0.012053282000124454,
        -8.772445445853981e-33,
        -0.020881295204162598,
        0.09442050009965897,
        -0.15823988616466522,
        0.008314778096973896,
        -0.06464896351099014,
        -0.043253086507320404,
        0.12118460237979889,
        -0.021204765886068344,
        0.03478536009788513,
        -0.003936050459742546,
        -0.004525613971054554,
        0.03245871141552925,
        0.026271792128682137,
        -0.042034149169921875,
        -0.046789951622486115,
        -0.06885391473770142,
        -0.11869104951620102,
        -0.006967039778828621,
        -0.03341333195567131,
        0.0016744332388043404,
        0.008024425245821476,
        0.14210815727710724,
        -0.03708203509449959,
        -0.1271500140428543,
        -0.0034799387212842703,
        0.039010003209114075,
        0.09921395033597946,
        0.10418295860290527,
        0.07964355498552322,
        0.019684424623847008,
        -0.05344848334789276,
        0.032750390470027924,
        0.012454712763428688,
        -0.01249754149466753,
        -0.005872644018381834,
        0.03182747960090637,
        0.05859265848994255,
        0.08012114465236664,
        0.022827066481113434,
        0.011173848062753677,
        0.03653661534190178,
        0.01114550232887268,
        -0.088919997215271,
        -0.03648184984922409,
        0.036031607538461685,
        0.04638465866446495,
        0.004416672047227621,
        0.07432470470666885,
        -0.010608498007059097,
        -0.015129229985177517,
        0.01321891788393259,
        -0.010714119300246239,
        -0.020903492346405983,
        0.017154483124613762,
        0.04366377368569374,
        0.04587993398308754,
        -0.08941604942083359,
        0.011093887500464916,
        0.09728098660707474,
        -0.014082425273954868,
        -0.01680431328713894,
        -0.10960504412651062,
        0.04550044238567352,
        0.05539276823401451,
        0.06021072715520859,
        -0.047291334718465805,
        -0.06129531189799309,
        -0.05960702896118164,
        -0.0529436431825161,
        0.002875540405511856,
        -0.05435697361826897,
        0.008017057552933693,
        0.07577072829008102,
        -0.0371646024286747,
        0.029968462884426117,
        -0.04186622425913811,
        0.04446889087557793,
        -0.0027102946769446135,
        -0.0594145692884922,
        -0.008435904048383236,
        -0.07292330265045166,
        0.03403545543551445,
        -0.010049060918390751,
        0.04559407755732536,
        0.03647823631763458,
        0.03865498676896095,
        0.06463523209095001,
        0.08799762278795242,
        0.0371398851275444,
        0.09319380670785904,
        -0.03630972281098366,
        0.08293401449918747,
        0.029987545683979988,
        0.002645320724695921,
        -0.0016786763444542885,
        -5.7595368474494535e-08,
        -0.02449297159910202,
        0.022683074697852135,
        -0.053983960300683975,
        0.028644779697060585,
        -0.010969039052724838,
        0.09504437446594238,
        -0.04728436842560768,
        -0.055890873074531555,
        0.03354250639677048,
        0.025718607008457184,
        -0.00531662767753005,
        0.00944780558347702,
        -0.0827784463763237,
        0.005525853484869003,
        -0.016178429126739502,
        0.06986496597528458,
        0.010206318460404873,
        -0.1045454740524292,
        0.011535737663507462,
        -0.06582333147525787,
        -0.026896292343735695,
        -0.008782430551946163,
        -0.06621580570936203,
        0.06203721836209297,
        -0.09757238626480103,
        0.020573126152157784,
        -0.013415202498435974,
        0.05768106132745743,
        -0.029337100684642792,
        -0.032334379851818085,
        0.006106603890657425,
        0.03339646756649017,
        0.03411271423101425,
        -0.0412336066365242,
        0.023343198001384735,
        0.015255479142069817,
        -0.09990096092224121,
        0.03908868506550789,
        0.04452703148126602,
        0.015346799977123737,
        -0.08587577193975449,
        -0.13719679415225983,
        -0.0801926925778389,
        -0.016436275094747543,
        0.01417422667145729,
        -0.07295404374599457,
        -0.17079053819179535,
        0.040509652346372604,
        0.014989540912210941,
        -0.029946662485599518,
        -0.0019308897899463773,
        0.03464452922344208,
        -0.02295037731528282,
        0.012126009911298752,
        0.10495269298553467,
        0.04545681178569794,
        -0.06368478387594223,
        -0.07566380500793457,
        -0.05049703270196915,
        0.11582217365503311,
        0.024363577365875244,
        0.03027331456542015,
        -0.06482189148664474,
        -0.06642960757017136
    ]
}