{
    "id": "tkzuipvp4t8",
    "title": "Self-Cleaning Earbuds??  - LG Tone Free FN6",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-20T19:31:29Z",
    "video_url": "https://www.youtube.com/watch?v=tkzuipvp4t8",
    "category": "Science & Technology",
    "tags": [
        "LG",
        "LGToneFree",
        "BestEarBuds",
        "Wirelessearphone",
        "headphones",
        "wiressheadphone",
        "headset",
        "bluetoothheadphone",
        "earphone",
        "earbuds",
        "wirelessearbuds",
        "bluetoothearphone",
        "bluetoothearbuds",
        "uvc",
        "UVNano",
        "Meridian",
        "ToneFree",
        "Bluetooth",
        "Quality",
        "Speakers",
        "UV",
        "Germs",
        "Bacteria",
        "Cleaning"
    ],
    "views": 419200,
    "likes": 20245,
    "comments_count": 1257,
    "description": "Thanks to LG for sponsoring this video!  TONE Free FN6 (UK):  TONE Free FN6 (US):   These are surprisingly really good with an awesome twist using UV technology.  DISCLAIMER: UVnano charging case kills 99.9% of bacteria limiting only to the speaker mesh part of the earbud not the entire earbud. The blue lighting shown when the charging case is opened is not the UV light, but it is a blue mood lighting for aesthetic purposes. The UVnano light kills 99.9% of E. Coli & S. aureus bacteria on the speaker mesh part of the earbuds. It does not clean or disinfect the earbuds. It takes approximately 5~10 minutes for the bacteria to be killed while it is in the charging cradle, it does not kill the bacteria instantly. UVnano feature was tested and verified by the UL but it is not UL-certified. UVnano charging case does not protect consumers from the disease caused by COVID-19.  Buy Apple AirPods On Amazon (Paid Link):  On NewEgg (Paid Link):  On BHPhoto (Paid Link):  On StockX (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  #LGTONEFree #wirelessearbuds#UVnano  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://bit.ly/ShortCircuit_LGTONEFree_FN6_UK",
        "https://bit.ly/ShortCircuit_LGTONEFree_FN6_US",
        "https://geni.us/CEIbFgC",
        "https://geni.us/UE5NSI",
        "https://geni.us/VBBQTV",
        "https://shop-links.co/1725432036120106031",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- This video is sponsored by LG but guys, I still gotta call a spade a spade here. This is LG's Tone Free HBS-FN6, or as I'm gonna be calling it the AirPods competitor. I've actually got both variants of them in white and black. And the most exciting thing about them is the feature that doesn't immediately disqualify them for everyday use for me, the size of the charging case. Yes, my friends, the most important thing to me when it comes to wireless earphones is whether it passes, the does it fit in this pocket test. And not only does it fit really nicely in that totally otherwise useless pocket, but because of the glossy finish, it actually slides in and out really, really nicely. In fact, compared to an AirPods Pro case, it's a little bit on the thicker side, but it's actually smaller in the X dimension and not much different in the Y dimension. Not bad. Not bad at all, especially considering that one of the big features according to the front of the box anyway, is their UV nano, which is a disinfecting light that is included in the case. You see, yeah, actually, you can see it in there to kill apparently 99.9% of the bacteria that are gonna end up on the ear tips of your earbuds when you put them in your case to charge. They were very specific about this. I am to inform you that the Tone Free FN6 is the only one that has been approved by official organizations such as TUV. Actually kind of a big deal. It charges via USB type C. They rated for six hours of music playback from the earbuds themselves, and then the case is rated for another 12. So while the case only has two extra charges for the earphones in it, the earbuds themselves actually run for quite a long time and part of the reason they're able to squeeze better battery life out of these is that while they are noise isolating, they do not have active noise cancellation. Which is a feature that can suck up quite a lot of battery life. They really wanna sit at quite an aggressive forward facing angle. Honestly the form factor of them reminds me more of the AirPods Pros and less of the regular AirPods due to the short stem. Why am I even putting in the white ones? I was so excited about those BatsPods AirPods clones a little while ago just because I wanted black AirPods Pros. So why don't I just open up the ones that have got a little nice little Short Circuit thing on it and everything here? Wow would you look at that? They wrote me a handwritten note. I actually know people over at LG who are big enough nerds to write a message like that. Oh wow. I'm impressed. I was gonna say I bet they send the same note to everyone but it's totally not. This one's to me and this one's to Colton. Dear Colton, hope you are smiling, reading our little surprise to show our gratitude. Little do they know that he's not allowed to keep their samples. Colton is never getting it. You got more ear tips although I actually found the medium ones out of the box sufficient for me. I often switch to small but I don't think I'll be doing this with these. USB cable, no wall wart and just like a little (indistinct). Now as with a lot of their audio products one of the big headline features for LG is their collaboration with Meridian Audio. Oh wow, look at that. Just got a notification everything in spite of the fact that this is not an LG phone. I got the same auto magical pairing process that you would expect out of something like AirPods or Pixel Buds, and they're connected. I didn't have to press a pairing button or do anything although it does have a manual pairing button if you do end up needing that down the line. If I understood the product packaging correctly, it also features wireless charging. How do I tell if it's working? Yeah, look at that. Awesome. The Meridian Audio collaboration is a funny one for me because it's at the point now where I honestly can't tell who's paying who 'cause on the one hand, LG wants Meridian's expertise. So they created some EQ profiles that are supposed to kind of simulate the natural crosstalk between the right and left to give it a more open soundstage. Like if you were listening to actual stereo speakers, and that kind of tuning obviously has a value. But on the other hand, LG spends so much of their product page basically talking about Meridian's expertise when it comes to building speakers and digital sound processors and all this kind of stuff. Look at this, it's ridiculous. I don't know who's getting the most out of that relationship there. The Tone Free app is surprisingly well rated for like a Bluetooth speaker included app, 4.2 stars. Device is currently using the latest software. Nice. So controls are handled with tapping. I don't have the music app open so I guess that's not gonna do anything. Apparently you can long press as well. Where's the button? I think I activated it there. Okay. While they don't have active noise cancellation, they are quite noise isolating. I'm not hearing any of the regular, you know, AC hum or anything here in the office. But they still include an ambient sound mode. So, it'll pass through some of the external audio. There we go. It's working now. First time, I think it wasn't actually on. I wouldn't describe it as natural sounding as the AirPods Pros, for sure. But if the idea is just like, hey, I'm crossing the street right now. I need to make sure that nothing hits me. You can definitely hear the things around you better. I can hear my own voice better. It's the kind of thing I would normally leave off if I'm not using active noise canceling headphones. I wonder if part of the problem is that I was in immersive mode. Hey, Brandon, can you talk to me for a sec? - [Brandon] (clears throat) I'm talking to you while you're wearing those headphones. - Yeah, it's definitely less natural sounding. That's fine. I don't need you to. Interesting. You can actually you can tune it though. So you can have a little bit of ambient sound and a lot. Find my earbuds. This is cool. So, some vendors lock their find my earbuds feature depending on what kind of phone you're using. But LG maybe because they are realistic about how much mobile phone market share they have. Seems to allow the feature to work with the app regardless of which phone you have. So, theoretically whoops allow. What just happened? So it's not for when they're in the case. It's for actually finding the individual earbuds. Okay, so left. It's pretty quiet. It gets a little louder, actually. Yeah, it keeps getting louder. Okay, that's not bad, that's usable. Like obviously, you'd have to walk around your house to find the thing. One thing LG points out is that these ear tips rather than actually feels a little stickier than the regular silicone ones. It's apparently made from a medical grade ear gel. In terms of the fit, I would describe them as very similar to the AirPods Pros, which are my everyday carry. So, I consider that to be pretty high praise. Although I guess it's kind of easy to have a similar fit if you also have a very similar design. Time for some Laszlo \"Supernova.\" The song I'm allowed to play definitely for sure. You know, I gotta say not every audio company partnership has ended up turning into products that legitimately sound better. But LG is clearly benefiting from Meridian's expertise. There's clearly defined bass, but it's not overpowering. It's tight. I'm probably talking really loud right now 'cause yeah, sorry, Brandon between the fact that I'm actually listening to music, although not at an unreasonable volume combined with how their noise isolating means that it's kind of hard to hear what I'm saying. I kind of wanna play around with the different profiles though. So I automatically went to natural because that tends to be what I prefer, but let's see what bass boost sounds like. Still reasonable. Fuller for sure, but not overpowering and not muddy. Thank goodness. Brandon, did you ever watch the video on the Sennheiser MOMENTUM True Wireless two's. Their EQ control app was unusable. Thank you LG or Meridian or whoever is responsible for this being the EQ control. This is exactly how EQ control should work. One thing that I wish they would improve actually is that it'd be nice if it gives you a live preview of what it's gonna sound like as you're moving it around. As it is right now you have to actually click Save to hear your amped up bass. As someone who actually likes the sound like that inside your skull sound of in ears, the immersive profile doesn't really do anything for me. But the good news is that both natural and bass boost are actually really nice (indistinct) EQs and I think a lot of people aren't gonna end up playing around with the custom ones, although it's really cool that they let you have two of them. I probably end up with bass boosts. It actually really clean sounding. I definitely like the black one more. I think it's too bad that they decided to go with a glossy finish on the white. 'Cause this matte black looks and feels in the hand a lot better even though surprisingly, the glossy white so far is less of a fingerprint magnet. I think this one actually I'd expect to look kind of nicer on a day to day basis but when it's clean. This is like that's pretty sleek. You know, I'm surprised. It automatically detects taking your earbuds out. One thing that I hope is not unavoidable is that it looks like it stopped playing when I took one out. Okay, it looks like you can start playback again with just one in your ear 'cause it is supposed to know if it's in your ear or not and automatically pause playback. Yeah, and it paused it again. So that's something you will have to restart if you just pop out one earbud at a time. Man, see I don't know if there's a 100% right answer for everyone when it comes to that. That's another thing that might be kind of cool to add to the app is a do you want that behavior or not? One thing that I just noticed is that it doesn't disable the touchpad when you're holding the earbud in your hands so it doesn't seem to be clever enough to know if it's right up against an ear from the sensor here or if it's just like kind of casually rolling around in your hand. That's another thing that's probably quite tunable in a software updating given what a nice bass they're starting with here. So solid battery life, good features, the wireless charging and all that good stuff, good sound quality right out of the box and an easily tunable EQ. This is a great start. It's sponsored by LG but I don't know if you guys are familiar with the FTC guidelines. I'm not allowed to say anything that I don't actually think. These are really solid, just like the idea of subscribing to Short Circuit. Make sure you do that so you don't miss any of our videos over here.",
    "transcript_keywords": [
        "AirPods Pros",
        "kind",
        "thing",
        "Tone Free",
        "call a spade",
        "AirPods",
        "AirPods Pro case",
        "Meridian",
        "case",
        "spade a spade",
        "sound",
        "earbuds",
        "ear",
        "Meridian Audio",
        "Tone Free app",
        "Pros",
        "Meridian expertise",
        "spade",
        "yeah",
        "noise"
    ],
    "transcript_entity_values": [
        "AirPods",
        "100%",
        "the AirPods Pros",
        "One",
        "a day to day",
        "one",
        "Laszlo",
        "USB",
        "six hours",
        "sec",
        "Supernova",
        "TUV",
        "FTC",
        "4.2",
        "AC",
        "99.9%",
        "Meridian Audio",
        "the Sennheiser MOMENTUM",
        "BatsPods AirPods",
        "LG",
        "Brandon",
        "black AirPods Pros",
        "AirPods or Pixel Buds",
        "two",
        "Fuller",
        "Dear Colton",
        "EQ",
        "The Meridian Audio",
        "Short Circuit",
        "12",
        "First",
        "Meridian",
        "Colton"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.06324268132448196,
        0.006226188503205776,
        0.04098137095570564,
        -0.017335528507828712,
        0.06921578198671341,
        -0.04192350059747696,
        0.05360987037420273,
        0.05289369821548462,
        -0.07344750314950943,
        0.0500359907746315,
        0.1057441309094429,
        -0.0009022407466545701,
        0.0127896498888731,
        0.12376704812049866,
        0.006839475128799677,
        0.03354721888899803,
        0.03900314122438431,
        -0.048729583621025085,
        -0.023210955783724785,
        0.05520661920309067,
        0.01041566114872694,
        0.06404467672109604,
        0.059570688754320145,
        -0.050440941005945206,
        -0.02660505846142769,
        -0.029861586168408394,
        0.0760473981499672,
        -0.039772480726242065,
        -0.05685343220829964,
        -0.02525942772626877,
        0.03343025594949722,
        0.029714128002524376,
        0.04235571250319481,
        -0.02836390770971775,
        -0.01216861978173256,
        0.013539326377213001,
        0.02725357562303543,
        -0.04830756038427353,
        0.006093467120081186,
        0.03496144339442253,
        -0.027086568996310234,
        0.0021911542862653732,
        9.263931860914454e-05,
        -0.036591410636901855,
        0.06228160485625267,
        -0.014411421492695808,
        -0.02264278568327427,
        0.01686261221766472,
        0.02987554483115673,
        0.018086157739162445,
        0.08308295160531998,
        -0.061386145651340485,
        0.05185959115624428,
        0.04828788712620735,
        -0.06734757870435715,
        -0.012882881797850132,
        -0.05379914119839668,
        -0.015327876433730125,
        0.0055686235427856445,
        0.01585819199681282,
        0.014996135607361794,
        -0.05404267460107803,
        0.03944709151983261,
        -0.0004987808060832322,
        0.008599169552326202,
        0.048002999275922775,
        0.05756021663546562,
        0.023677192628383636,
        0.031863223761320114,
        0.04474897310137749,
        -0.04424422234296799,
        0.00386412744410336,
        0.011655752547085285,
        0.02699795737862587,
        0.03715445101261139,
        0.12985765933990479,
        0.06497345864772797,
        -0.09614009410142899,
        -0.07040859758853912,
        0.06814137101173401,
        -0.005591299384832382,
        -0.042371444404125214,
        0.04013310745358467,
        -0.004103108774870634,
        0.07074405252933502,
        0.0063128178007900715,
        0.01964004710316658,
        -0.04493026062846184,
        -0.06955991685390472,
        0.03531453385949135,
        0.0025783758610486984,
        0.11525151133537292,
        0.0004952371818944812,
        -0.06524787843227386,
        0.010359788313508034,
        -0.022159487009048462,
        -0.013133333995938301,
        0.047738391906023026,
        0.010156756266951561,
        -0.00040208481368608773,
        -0.013113233260810375,
        -0.06252315640449524,
        -0.0792740061879158,
        -0.042953960597515106,
        0.04358713701367378,
        -0.12302469462156296,
        -0.04363114386796951,
        -0.0012971742544323206,
        -0.011945530772209167,
        0.02946661412715912,
        0.014040600508451462,
        0.03766287490725517,
        -0.003955289255827665,
        -0.004636834841221571,
        -0.021895209327340126,
        0.06617095321416855,
        0.006786966696381569,
        0.027144309133291245,
        0.0013788254000246525,
        0.03806160017848015,
        0.033233240246772766,
        -0.014538703486323357,
        0.027148405089974403,
        -0.04804270341992378,
        -0.04989643767476082,
        -0.04638519510626793,
        -0.007551898248493671,
        4.3755099286291685e-33,
        -0.012413404881954193,
        0.0013410990359261632,
        -0.01333620771765709,
        -0.12114333361387253,
        0.04814160242676735,
        0.007620477583259344,
        -0.07703005522489548,
        0.045669786632061005,
        0.00014100887347012758,
        0.028602808713912964,
        -0.09120690822601318,
        0.0375613272190094,
        -0.027690794318914413,
        0.005958374124020338,
        0.02647130750119686,
        -0.009617026895284653,
        -0.06912388652563095,
        0.00950308796018362,
        -0.10328032821416855,
        0.010908171534538269,
        0.019056858494877815,
        -0.018970808014273643,
        0.046695299446582794,
        0.041218165308237076,
        0.03365655243396759,
        0.040481336414813995,
        0.027054378762841225,
        0.011209125630557537,
        -0.007367533631622791,
        -0.006955333985388279,
        -0.06101956218481064,
        0.011033561080694199,
        0.024286052212119102,
        0.029303185641765594,
        -0.030667303130030632,
        0.056527670472860336,
        -0.05849688500165939,
        0.03196508809924126,
        0.001025781617499888,
        -0.06740647554397583,
        -0.01111986581236124,
        0.07618497312068939,
        0.021882854402065277,
        0.03552709147334099,
        0.02544301189482212,
        -0.016580063849687576,
        -0.14350029826164246,
        -0.0032961328979581594,
        -0.006867395713925362,
        -0.007189953234046698,
        -0.040771353989839554,
        -0.017977187409996986,
        -0.05457272753119469,
        -0.00458541652187705,
        0.039403025060892105,
        -0.024584732949733734,
        0.03024325706064701,
        -0.03409575670957565,
        -0.009081609547138214,
        -0.011549741961061954,
        0.028919635340571404,
        0.033302851021289825,
        -0.013940910808742046,
        -0.04379844292998314,
        -0.0925297886133194,
        0.017195207998156548,
        0.03348265215754509,
        0.022432349622249603,
        -0.04307877644896507,
        -0.16236795485019684,
        0.003344158874824643,
        0.060240380465984344,
        -4.886745955445804e-05,
        -0.04520308971405029,
        -0.04681338369846344,
        -0.015223531052470207,
        0.04124550148844719,
        0.037228383123874664,
        0.0006453287787735462,
        -0.08005461096763611,
        0.014722640626132488,
        0.04684557020664215,
        0.06987646967172623,
        -0.027049720287322998,
        -0.018042581155896187,
        0.017763487994670868,
        -0.046003952622413635,
        0.00337040307931602,
        -0.0010288406629115343,
        -0.04429560899734497,
        0.10453474521636963,
        0.03392687439918518,
        -0.07748545706272125,
        -0.046304281800985336,
        -0.002566433511674404,
        -4.222418319823874e-33,
        0.07429134100675583,
        -0.08033706992864609,
        0.028099065646529198,
        0.013921581208705902,
        0.024270640686154366,
        0.04768792912364006,
        0.05470078065991402,
        0.09398607909679413,
        0.018571283668279648,
        -0.07177078723907471,
        0.01538120023906231,
        0.049503933638334274,
        -0.029224704951047897,
        0.007158501073718071,
        0.026963291689753532,
        0.017436323687434196,
        -0.004402625374495983,
        -0.020494483411312103,
        -0.025354117155075073,
        -0.00832994095981121,
        0.0005456056096591055,
        0.06122327595949173,
        0.039261139929294586,
        0.0012664571404457092,
        -0.0725552886724472,
        -0.015733925625681877,
        -0.010447829961776733,
        -0.04614520072937012,
        0.04859214276075363,
        0.03574362397193909,
        -0.03157104179263115,
        0.012765547260642052,
        -0.030058380216360092,
        0.020631609484553337,
        0.0636310800909996,
        -0.04088073596358299,
        0.05200835317373276,
        -0.005833282135426998,
        0.007314044516533613,
        -0.06428086012601852,
        0.0761953666806221,
        -0.0009383579599671066,
        -0.10133398324251175,
        -0.05943800508975983,
        -0.0377018041908741,
        0.06985791027545929,
        -0.06544865667819977,
        -0.07558315247297287,
        -0.06396296620368958,
        0.00861285999417305,
        0.028071900829672813,
        -0.04673264920711517,
        -0.028818106278777122,
        0.01850900985300541,
        -0.07551071792840958,
        0.00043123820796608925,
        0.08307298272848129,
        0.004801404196768999,
        -0.019803890958428383,
        0.04620739445090294,
        0.07260075211524963,
        -0.001947590266354382,
        -0.00020964715804439038,
        -0.051335472613573074,
        -0.05317891761660576,
        0.061262208968400955,
        0.06883691251277924,
        0.15485477447509766,
        0.10026809573173523,
        -0.07565932720899582,
        0.06261223554611206,
        0.023444654420018196,
        -0.012717753648757935,
        -0.10392200201749802,
        -0.0356888473033905,
        -0.02533688023686409,
        -0.06518073379993439,
        -0.05472423508763313,
        -0.04556264355778694,
        -0.014728563837707043,
        -0.008951466530561447,
        0.03340712562203407,
        -0.06157076731324196,
        0.04352625086903572,
        0.04693642631173134,
        -0.0441141203045845,
        0.06143224611878395,
        -0.049108169972896576,
        -0.13715000450611115,
        0.03095562756061554,
        -0.04189085587859154,
        0.04790983721613884,
        0.00834642443805933,
        0.08508022129535675,
        0.034964077174663544,
        -4.5824492644896964e-08,
        0.026086285710334778,
        0.016659101471304893,
        0.06168947368860245,
        -0.014896655455231667,
        0.0024609242100268602,
        -0.028267432004213333,
        -0.031764209270477295,
        0.07672084122896194,
        0.006603418383747339,
        -0.022940993309020996,
        -0.005668750032782555,
        0.059079624712467194,
        -0.054043348878622055,
        0.013226058334112167,
        -0.031708698719739914,
        0.025093812495470047,
        -0.09143342822790146,
        0.06356362253427505,
        -0.03284342959523201,
        -0.10790031403303146,
        -0.12991668283939362,
        0.07058094441890717,
        -0.00954514555633068,
        -0.0057561034336686134,
        -0.031098566949367523,
        0.05810705944895744,
        0.07982207834720612,
        0.08620741963386536,
        0.04893086478114128,
        -0.050923462957143784,
        -0.07202068716287613,
        0.006205314304679632,
        -0.050521370023489,
        0.009238870814442635,
        -0.08982549607753754,
        -0.011306533589959145,
        -0.03102465160191059,
        -0.07715912163257599,
        -0.016014326363801956,
        0.07384420186281204,
        -0.05442195013165474,
        -0.04373471066355705,
        -0.051696762442588806,
        0.037452664226293564,
        -0.020835233852267265,
        -0.09209473431110382,
        0.12188632041215897,
        0.007379827555269003,
        -0.05310336872935295,
        0.13279549777507782,
        0.04506755620241165,
        0.019704818725585938,
        -0.009497974067926407,
        -0.041352178901433945,
        -0.0885705053806305,
        0.03824232146143913,
        0.09358815848827362,
        -0.08244916051626205,
        0.007089714985340834,
        0.011544526554644108,
        0.01222717110067606,
        -0.1607690304517746,
        0.12742343544960022,
        0.07513567060232162
    ]
}