{
    "id": "TLQkoZX9Mog",
    "title": "Real Thoughts on Tech Leaks!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-09-13T18:42:40Z",
    "video_url": "https://www.youtube.com/watch?v=TLQkoZX9Mog",
    "category": "Science & Technology",
    "tags": [
        "Apple leaks",
        "iPhone leaks",
        "iPhone 13",
        "iPhone 14",
        "MKBHD",
        "iPhone 13 leaks",
        "iPhone 14 leaks",
        "iPhone 4 leaks",
        "Google Pixel leaks",
        "Pixel 6 leaks",
        "smartphone leaks",
        "tech leaks"
    ],
    "views": 2299049,
    "likes": 98596,
    "comments_count": 4817,
    "description": "iPhone 14 was trending on Twitter last week.  MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat synthesized music) - [Marques] The day was March 18th, 2010. An Apple engineer goes out to the bar on his birthday with an unreleased iPhone 4 in his pocket three months before it was supposed to come out. Now, this isn't actually unusual, you know, in the final months leading up to a launch. They've gotta do their testing and finalizing things in the real world sometimes to iron out any bugs and find any last second fixes. So he's probably using it maybe even as a daily, but it's in a case that actually disguises it as an iPhone 3GS. Now, unfortunately, maybe too many drinks, maybe a bit distracted on his birthday, He forgets that phone at the bar and leaves without it. From there, somebody else picks it up, realizes it's a top secret unreleased, iPhone 4, not a 3GS, so that person tries to return it to Apple who actually refuses it because the customer service rep doesn't believe that anyone would have an iPhone 4 to return. Must be a knockoff or something. From there, that person realizes what they have. So they go to sell this unreleased iPhone to try to get some money for it, and it's bought by Gizmodo. (ominous music) At this point, Apple's realized the phone is missing. They remotely wiped it, but Gizmodo goes on to publish a hands-on, which as you can imagine, went absolutely nuts because not only is this an unreleased iPhone in the flesh, but it's also now stolen property. So Gizmodo details all the new features and takes tons of pictures, tears it apart, compares it to old iPhones and basically details everything Apple's been working on three months before Apple is planning on showing it themselves. Now, Apple, meanwhile is trying everything in their power to get this phone back. They send letters from lawyers. Steve Jobs calls the Gizmodo executive editor. And eventually a few days later, California police raid Gizmodo editor Jason Chen's home, and seize four computers, two servers, three hard drives and other gadgets while he was out to dinner. They broke down his front door. So the iPhone four was eventually unveiled onstage like three months later in June. And that was kinda the end of that messy story. But the point is that was one of the biggest tech leaks of all time. It had everything. It had stolen property, it had tear downs, it had pre-released top secret hardware, all that, but the thing that really made it such a big leak, wasn't just the fact that we got this aesthetic stuff early. It was really the industry secret. They tore down the phone. They showed unreleased parts inside the phone to the entire world, including Apple's competitors. And that's the type of leaks that really hurt companies like Apple the most. And a lot of the serious leaks we see nowadays are supply chain related. There'll be such a big company that there's no way they can lock down every single little bit of this supply chain. And that's where little squeaks of leaks will get out. Like just a couple of months ago, we heard about hackers targeting, not Apple, but one of their suppliers and claiming to have stolen blueprints of future Apple products that they would publish unless they got $50 million of ransom. But the thing is, leak culture, if you wanna call it that, has evolved a lot. Like there's of course, lots of that serious stuff still going on, and lots of reporting on that serious stuff. But also leaks have sort of turned into this version of casual entertainment as well, to the point where the iPhone 14 was trending on Twitter last week before we even have seen the iPhone 13. So yeah, I figured this would be the perfect time to share my thoughts on leaks and leak culture. So my personal philosophy, the way I've seen leaks in tech over the years, there's kinda two types of leaks: one, the serious type that we've illustrated with the first example and those that get reported a lot with industry secrets and competitive advantage at stake. And the other is a more casual, not super important, mostly aesthetic, and generally for entertainment. And I pay attention of course, to the first type of leak. But that second type is usually not always worth paying a whole lot of attention to, or at least expending a lot of energy keeping up with. For example, today on the internet, there's plenty of places you can go to just follow leaks for entertainment. There are YouTube channels you can subscribe to. There's people you can follow on Twitter for constant leaks where that's all they do. There's even sites dedicated to it. And then also sort of accompanying it, there's also a whole genre of artists who will make incredible CG renders of gadgets based on the leaks to help us visualize what the future gadgets could look like. But some of these leaks, like I said, not really worth paying a whole lot of attention to. I would say, like an example. I think there was a John Prosser leak probably a couple months ago where I think he confirmed, he leaked the exact date and time that a product announcement would happen or that an embargo would drop or something like that. And then hours later, it was right, it was confirmed, and you know, shout out to John, much props to him, funny guy, great channel, but I don't care. (laughing) I just don't care. That's the type of stuff that's purely for entertainment and has almost no effect on people who aren't following it hardcore. And I just feel like there's little entertainment leaks like this all the time, confirming that a product isn't canceled or a leak confirming a product's name or the leak of an announcement date or stuff like that, leaks that are just confirming the existence of products being developed. So of course, you know, naturally, all those little bits of information that leak out can and will be turned into content 'cause that's what we do. But generally, I think it's safe to ignore or at least pay a passing attention to a lotta that stuff. But most of the leaks now, that you'll see, that are actually really entertaining are completely aesthetic, all visual, just because the question of how will the product look turns out to be one of the most important things that people wonder about an upcoming future product. Now I could talk for hours about how there are companies out there who definitely intentionally leak products, or just intentionally leak little things. Because if you were a company who saw all this hype being generated about products, of course you wanna get in on it, assert some level of control over the narrative and jump in and generate even more hype for your own benefit, so I get that. You also see the OnePluses of the world where their literal pre-launch strategy before dropping a new flagship phone is once every few days release a new little nugget of information for the nerds. You know, hey, this is the processor we're gonna be using, or this is how fast the phone's gonna charge, confirmed, or, hey, this is how much RAM the thing will have. It's kind of annoying, but it's actually very smart because people pay attention to that thing. People care about each one of these things. So the slow drip of information acts the same way a leak would in that it generates hype. It gets people talking about it, the press keeps going. But really at the end of the day, what most people wanna see when the product does finally get to the announcement date, what they wanna see unveiled is the design, the features and the price, just to keep it simple. And since the price is the last thing to get finalized and probably the hardest thing to leak and get right, we all focus on the aesthetics. We just wanna know the design, how it's gonna look, what the choices were made in that outside. And so the iPhone 14 trending on Twitter was mostly from a John Prosser video on some claimed leaks and some renders of that phone that's still over a year away, all aesthetic. They claim the iPhone 14 may look a lot like the iPhone 4, you know, round volume buttons, hole punch camera cutout at the top too, full flat glass and chamfers with the new antenna placement, flat camera bump on the back, still a lightning port at the bottom. This is 100% aesthetics. This is just speculating on how the thing will look. And there's almost no actual technical speculation about features or anything like that, mostly because there was a whole year before the thing's supposed to come out. It's probably not finalized anyway. And there's a whole year of hype to be generated before anything can be proven wrong. So it's entertaining, fun speculation, for sure. That is definitely entertainment value. But I think the real question at the end of the day for you guys would be, do leaks ruin launch events? Does following the leaks and the little bit of information that comes out before the launch event ruin the fun or the surprise of the actual launch moment? And my answer might not be exactly what you're expecting. It might be a little bit cynical, but I do think that leaks are following them. It takes a little bit of the air out of that big surprise moment, but those announcements are just more of the hype anyway. Okay, it turns out there are many, many people out there that don't follow the leaks at all. They don't read any articles or watch any videos or think about the new phone at all before the announcement. And so, that announcement event is a genuinely new thing and a surprise to them. And that's almost a sweet level of innocence that I kind of miss a little bit, to be honest, but also there's some of those people out there that are probably buying fresh, brand new iPhone 12s right now as the iPhone 13's about to come out. So maybe if you have a friend like that, let 'em know, just warn them, maybe you shouldn't make that purchase right now, but if you are one of those people, sure, the announcement event will be way more fun for you because everything there will be brand new and surprising and shock and awe sweet. But just know that that announcement event, isn't just a speck rollout, that's up presentation. It's a whole show. It's a high budget, highly refined and planned presentation designed to show off and get you to wanna buy the new product that they've been working on that they're finally unveiling. Now, on the other hand, if you do follow every single leak, like a lot of us do, then it almost feels like the announcement is a guaranteed letdown because now you've been building this hype up for much, much longer behind the scenes and then the announcement happens, and it's either not what the leaks suggested, which is a bit of a letdown, or it's exactly what the leaks suggested, which is a bit of a letdown because there were no surprises. And so, that's just setting yourself up for disappointment. So anyway, I think my point is, it's basically impossible to generate the correct level of hype. It's probably going to be over-hyped no matter how much leak following or announcement hype that happens. It's just all a big show and it's fun and it's entertaining. But I think this leak culture is clearly here to stay. This entertainment, it's a new dimension of being able to follow what looks like these companies duking it out and fighting each other in front of us, which is sort of a rich new thing to feel like you're a part of. People pick teams and they see leaks and they can switch. And it's just a new, fun little thing. So yeah, it's entertainment, definitely entertaining. But I think as long as we all know that these leaks or this entertainment is just that, it's just entertainment, these little bits of information, are just to feel like we have a little bit more information and it's just kinda fun to follow, and that it also feeds into the consumerism that it's all a part of, then that's fine. Have your fun. Have our entertainment. I'll catch you on the other side though, when the product actually comes out. That's my side. Anyway, thanks for watching. Catch ya in the next one, peace. (upbeat electronic music)",
    "transcript_keywords": [
        "leaks",
        "leak",
        "Apple",
        "iPhone",
        "thing",
        "people",
        "entertainment",
        "announcement",
        "bit",
        "phone",
        "lot",
        "product",
        "Gizmodo",
        "unreleased iPhone",
        "hype",
        "March",
        "leak culture",
        "John Prosser leak",
        "fun",
        "months"
    ],
    "transcript_entity_values": [
        "today",
        "Apple",
        "the final months",
        "three",
        "John",
        "iPhones",
        "Steve Jobs",
        "one",
        "hours",
        "four",
        "Gizmodo",
        "California",
        "a year",
        "Catch ya",
        "iPhone 4",
        "a couple of months ago",
        "the years",
        "daily",
        "first",
        "iPhone 4",
        "iPhone",
        "14",
        "three months",
        "a few days later",
        "every few days",
        "second",
        "YouTube",
        "Twitter",
        "$50 million",
        "John Prosser",
        "OnePluses",
        "three months later in June",
        "two",
        "100%",
        "the end of the day",
        "a couple months ago",
        "The day was March 18th, 2010",
        "Jason Chen's",
        "last week",
        "12s"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.07535817474126816,
        0.07257094234228134,
        0.10622356832027435,
        -0.04383120313286781,
        0.04153019189834595,
        -0.00657855998724699,
        0.09573386609554291,
        0.004127813968807459,
        0.04233143851161003,
        -0.046795476227998734,
        0.03759334236383438,
        0.03650057315826416,
        -0.011434034444391727,
        -0.03387042507529259,
        0.010455741547048092,
        -0.04106329381465912,
        -0.0014735959703102708,
        -0.06384307891130447,
        -0.08013305813074112,
        -0.055053189396858215,
        -0.03553413599729538,
        0.00974839273840189,
        0.045774657279253006,
        0.016631310805678368,
        0.03414522111415863,
        0.04748515039682388,
        0.01772409863770008,
        -0.10444226861000061,
        -0.05038296803832054,
        -0.0011617339914664626,
        0.046331025660037994,
        0.11825690418481827,
        0.0017339145997539163,
        -0.039363037794828415,
        -0.012849231250584126,
        -0.11041287332773209,
        -0.014181317761540413,
        0.08117625117301941,
        -0.006339255254715681,
        -0.030005669221282005,
        -0.004804775584489107,
        -0.04067778214812279,
        0.01812674105167389,
        0.11880292743444443,
        -0.004298723302781582,
        0.04736841470003128,
        0.04155854135751724,
        -0.04370296001434326,
        0.0007258551195263863,
        -0.046225275844335556,
        -0.022849522531032562,
        -0.040220942348241806,
        0.042196936905384064,
        0.008194025605916977,
        -0.041512079536914825,
        -0.018267124891281128,
        0.0773300901055336,
        0.08849968016147614,
        0.09511881321668625,
        0.12329895794391632,
        0.07590345293283463,
        -0.06429267674684525,
        -0.038599271327257156,
        -0.04582776129245758,
        0.08377411961555481,
        0.03348249942064285,
        -0.03732728213071823,
        0.00805828720331192,
        0.05192854627966881,
        0.03889088332653046,
        0.09008585661649704,
        -0.009049993008375168,
        0.03983110189437866,
        0.0006343983695842326,
        0.05076460540294647,
        0.04147874936461449,
        -0.014045724645256996,
        0.01739022694528103,
        -0.015744023025035858,
        0.0075639523565769196,
        0.03986218944191933,
        -0.057290416210889816,
        0.016599105671048164,
        -0.06149637699127197,
        0.01415930688381195,
        0.005065763369202614,
        -0.0035741205792874098,
        -0.02345353551208973,
        -0.05616123974323273,
        -0.06058837100863457,
        -0.06401995569467545,
        0.07111869752407074,
        -0.00773556949570775,
        -0.03523724526166916,
        -0.021937265992164612,
        0.027886949479579926,
        -0.057170312851667404,
        -0.05680864304304123,
        -0.04250316321849823,
        0.04893035069108009,
        0.029644398018717766,
        0.10634639859199524,
        0.012017939239740372,
        -0.008957261219620705,
        0.03411279246211052,
        -0.07128294557332993,
        -0.029325177893042564,
        0.048075463622808456,
        0.05414978042244911,
        0.06656397879123688,
        0.009981616400182247,
        -0.009918623603880405,
        -0.01233985461294651,
        0.024971837177872658,
        0.03831501677632332,
        0.04602432996034622,
        -0.030079441145062447,
        0.10766774415969849,
        0.044722482562065125,
        0.012062812224030495,
        -0.05866410583257675,
        0.08981862664222717,
        0.02420608513057232,
        -0.033708252012729645,
        -0.08327586203813553,
        0.03693424165248871,
        -0.018981633707880974,
        1.3655577365193392e-33,
        -0.004069759976118803,
        0.043951891362667084,
        -0.05836448818445206,
        0.08421074599027634,
        0.052725568413734436,
        -0.10245083272457123,
        0.00948243122547865,
        -0.007642983924597502,
        0.0396290197968483,
        0.06013883650302887,
        0.02347969263792038,
        -0.022249676287174225,
        -0.013982895761728287,
        0.023567387834191322,
        0.02410111017525196,
        -0.019232584163546562,
        -0.09243409335613251,
        -0.01213366724550724,
        0.0016035311855375767,
        -0.04048367589712143,
        0.01577899418771267,
        -0.06628056615591049,
        -0.01384633406996727,
        -0.008944167755544186,
        0.046905867755413055,
        0.026341963559389114,
        0.04384414851665497,
        0.01092083752155304,
        0.13441681861877441,
        0.010969632305204868,
        -0.12153682112693787,
        0.0952194482088089,
        0.06665091961622238,
        -0.04384303838014603,
        -0.03721713647246361,
        0.006002754904329777,
        0.004023556597530842,
        -0.05702372267842293,
        0.02522227168083191,
        -0.007947366684675217,
        -0.03470610827207565,
        -0.0005703425267711282,
        -0.04407105594873428,
        0.001655807252973318,
        -0.0572604164481163,
        -0.023271754384040833,
        -0.019670924171805382,
        -0.02306247688829899,
        0.04573424533009529,
        -0.039482709020376205,
        -0.03754748776555061,
        0.02014944702386856,
        0.03630964830517769,
        -0.04296448081731796,
        -0.0897233784198761,
        -0.0025791397783905268,
        0.031686678528785706,
        -0.07803869992494583,
        0.13350975513458252,
        0.022507740184664726,
        0.09752275794744492,
        0.06172047182917595,
        -0.06493686139583588,
        0.060619696974754333,
        -0.05000514164566994,
        0.023567765951156616,
        0.00642207870259881,
        -0.03519796207547188,
        -0.049668654799461365,
        0.057471536099910736,
        -0.02921959199011326,
        0.0021381990518420935,
        -0.029199862852692604,
        -0.10867397487163544,
        -0.005461869761347771,
        -0.017303261905908585,
        -0.010504229925572872,
        -0.0019664049614220858,
        -0.010371950455009937,
        -0.0633738562464714,
        0.05933456867933273,
        -0.05183730646967888,
        0.07524705678224564,
        0.06293415278196335,
        -0.08048536628484726,
        -0.04402533546090126,
        -0.056508325040340424,
        -0.039526015520095825,
        -0.0056142546236515045,
        0.1454225480556488,
        -0.09562940895557404,
        -0.0207349956035614,
        -0.10131671279668808,
        0.0586392879486084,
        0.012059732340276241,
        -3.1180138265774875e-33,
        -0.03991665318608284,
        -0.05847960710525513,
        -0.03408562391996384,
        -0.011708891950547695,
        0.08063223212957382,
        -0.07705449312925339,
        -0.03481157496571541,
        0.10509102791547775,
        0.00589487049728632,
        -0.03798694536089897,
        0.011326570995151997,
        0.052860185503959656,
        -0.0242110975086689,
        -0.007375572808086872,
        -0.008202160708606243,
        -0.0008096903911791742,
        0.020388998091220856,
        -0.08994276821613312,
        -0.005501064006239176,
        0.06789128482341766,
        0.05533334240317345,
        -0.0217018760740757,
        0.0033278579358011484,
        0.0452021062374115,
        -0.052612606436014175,
        -0.018011054024100304,
        0.033887941390275955,
        0.032005827873945236,
        0.019516123458743095,
        -0.03463296219706535,
        -0.02234402485191822,
        -0.08400367200374603,
        -0.011543664149940014,
        -0.0029809167608618736,
        -0.0012474741088226438,
        -0.023342080414295197,
        -0.020949427038431168,
        -0.02331828884780407,
        -0.020983243361115456,
        0.0008704164065420628,
        0.054060887545347214,
        0.10124324262142181,
        -0.05439245328307152,
        0.01145869493484497,
        0.03950647637248039,
        0.01532051246613264,
        -0.002680704463273287,
        0.02142413891851902,
        0.027676332741975784,
        0.03671328350901604,
        0.11686459928750992,
        -0.0398322232067585,
        0.011221315711736679,
        -0.007477440405637026,
        -0.10323519259691238,
        0.0069890134036540985,
        -0.017270702868700027,
        -0.015315309166908264,
        -0.013176161795854568,
        0.050937507301568985,
        0.08756225556135178,
        0.002147336956113577,
        0.01664833165705204,
        -0.1058717891573906,
        -0.06376688927412033,
        -0.02249205857515335,
        0.02249196730554104,
        0.024028969928622246,
        0.02976752258837223,
        0.04749773070216179,
        0.02437341772019863,
        -0.03791604936122894,
        -0.025127161294221878,
        -0.07937100529670715,
        0.01513509452342987,
        0.02139490842819214,
        -0.11645177006721497,
        -0.0414268895983696,
        -0.10666818171739578,
        -0.06540770083665848,
        0.06020330265164375,
        0.08902764320373535,
        0.04595450684428215,
        0.008835718035697937,
        0.06702679395675659,
        -0.0084329042583704,
        0.049339741468429565,
        -0.0032527854200452566,
        -0.03762394189834595,
        0.025616854429244995,
        0.0030111034866422415,
        -0.02594721131026745,
        -0.1417575180530548,
        0.09863337874412537,
        -0.006971110124140978,
        -5.076648790236504e-08,
        0.030315229669213295,
        -0.007706854026764631,
        0.03448628634214401,
        -0.051783353090286255,
        0.03432749584317207,
        -0.035368841141462326,
        -0.016837602481245995,
        -0.005469964351505041,
        0.0702861025929451,
        -0.023130184039473534,
        -0.011932325549423695,
        -0.07150007039308548,
        -0.08259855210781097,
        0.05358440428972244,
        -0.00042952506919391453,
        0.015373020432889462,
        -0.046448711305856705,
        -0.01280076801776886,
        -0.045893680304288864,
        -0.03040393255650997,
        -0.038557954132556915,
        0.047504790127277374,
        0.08712119609117508,
        -0.057382065802812576,
        0.05630699172616005,
        -0.006491607520729303,
        0.010551271960139275,
        0.03596007451415062,
        0.048189762979745865,
        -0.01381576620042324,
        0.008991205133497715,
        -0.02010035701096058,
        -0.013188844546675682,
        -0.0044571515172719955,
        -0.055932044982910156,
        -0.04038025066256523,
        0.015494165010750294,
        -0.06259048730134964,
        0.045771997421979904,
        0.01739620789885521,
        -0.0400761142373085,
        -0.06346376985311508,
        -0.038338594138622284,
        0.060961127281188965,
        -0.05638027563691139,
        -0.10140874236822128,
        -0.009744437411427498,
        -0.06275851279497147,
        -0.017644599080085754,
        0.04636070504784584,
        -0.05076072737574577,
        -0.05951323360204697,
        -0.006840921938419342,
        0.02794208750128746,
        0.13993200659751892,
        -0.018192801624536514,
        -0.009998153895139694,
        0.009924832731485367,
        -0.06055227294564247,
        -0.05551869422197342,
        0.02462589181959629,
        -0.06544850021600723,
        0.021326009184122086,
        0.0423659086227417
    ]
}