{
    "id": "tMD0IZEGccM",
    "title": "CES ROADTRIP!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-01-09T17:34:03Z",
    "video_url": "https://www.youtube.com/watch?v=tMD0IZEGccM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "ces 201",
        "CES",
        "road trip",
        "las vegas",
        "tech",
        "vlog",
        "vlogger",
        "review",
        "unboxing"
    ],
    "views": 203746,
    "likes": 7274,
    "comments_count": 662,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Good morning! It is very early. It's probably about 6:30 a.m., I'm waiting for my sister and my friend Nick who is helping me film. We are heading to CES. We're driving, because we have so much equipment, most of which I haven't packed yet, so I have 30 minutes to pack, wait for my friends, and then we leave. I only slept for probably two hours and now we have to drive four hours. It's also raining, there's supposed to be flash floods. What a great time to drive to Vegas! But the problem is usually if you fly, there's delays, so by the time you end up packing, driving, and getting to Vegas, you end up saving time! So, let's see if we'll save time. Let's finish packing. Do you think this is all gonna fit? - Yeah, I think we'll be good! We have tons of room! - Do you know what else I have? - Yes! The Vegas tokens! - I've had these for over a year. - You're illegally parked, are you staying in the car? - [Justine] I guess so. - Okay. - [Justine] Okay, well I'm gonna have to pass the vlog off to you. - What am I doing? - [Justine] You're vlogging right now. - Hi, I'm vlogging. - You gotta get a close up of her getting the coffee. - [Nick] Oh. - And you know, like B-roll shots. - [Nick] Okay, got it. - You can do this. - Prepping Nick for vlogging. - Oh, gosh. - Alright, it's honestly gonna take two seconds, Did you mobile order? - Yes. - [Nick] Okay, I'm gonna vlog. - [Beggar] You got five or ten dollars, twenty dollars? Do you want to give up the camera? - [Nick] Sorry buddy, no. (laughs) I'm a vlogger, I'm vlogging. So wait you just pick it up, what are you doing? - Oh wait, yeah here! - Oh you guys live in the future. - Well that was not smart. - [Nick] Been workin' it. Here, let me help. - You can have this one. - [Nick] Want me carry the bag? Vlog door opened. Mam? - How's the vlog. - [Nick] Hey, I crushed it. - I ripped the bag in half. - I have a lot of drinks. - Yeah, you're really making a lot of stops. This is super heavy. - [Justine] Play top hits. - [Phone Voice] Here are the latest top songs. - I bet these are all going to be trash. - [Jenna] Yep, let's go guys. - To Vegas we go. four hours 21 minutes, it is what time? 7:49, let's see how long it takes us to go for our first pee. - [Jenna] I'm going to guess 45 minutes. - Ew! Why is my turn signal still on? - [Jenna] Oh, boy. - Whoops! We have two hours 11 minutes left. We obviously are making, are we making good time? What do you think? You guys gotta pee? Who wants to pee? - [Nick] That's me. - You gotta pee? - [Jenna] Well, we can't pee at the LMO. - There's gotta be something over here, right? - [Jenna] But there's no coffee at the LMO. - [[Justine] Then Google a Starbucks. - [Jenna] There's Denny's. - [Justine] We're going to find-- - [Jenna] LensCrafter! - [Nick] I could go for a Moons Over My Hammy. - I love LensCraft-- There's a Starbucks, there's a Starbucks! We should definitely stop over. - [Jenna] You have a red light, just so you know. - [Nick] In and out, just joking. - Did you? - It's 10. - Did you wanna snack? - I'm sorry? - Did you wanna burger? - Aw! - Let's just go in. - [Jenna] That's compact. - This is the second time I've parked illegally today. - [Justine] Wide vehicle. - Nothing can see us. - [Jenna] Pretty much. - Mam. - [Justine] Hi, thank you so much! - Hi mam. - I need my pack. So this is what I'm vlogging with. I decided to vlog with the a7S Mark II, because I'm going to CES, so I really want my videos to be the best quality that they can be. Are you actually getting something? I don't think I want anything. Let's just go. So we basically just came in here to pee and that's it. - Oh! Speak sister. - Well, we're listening to Third Eye Blind, I have to pee very, very badly. We will be there in 12 minutes, and we made pretty good time. - [Jenna] Yeah, we did. - Honestly. Trivia? - [Jenna] Triv's. - Use my code: Ijustine. I only have 13,000 lives. - [Jenna] They should use our dad's, Ezasteve. - Use my dad's code: Ezasteve, if you guys sign up for HQ Trivia. - [Jenna] Okay, hold on, I'm trying at-- - EZA Steve, is the official-- - [Jenna] Look at this. - [Justine] Oh, Steak 'n' Shake? I'm hungry actually. I'm going off the road, oops. - [Jenna] Is there a theme here with the driving? - I'm not a good driver. - [Jenna] Why is that truck? Is that the one that has naked ladies on it? - [Justine] Let's see. - [Jenna] Oh God. (car pings) - I know! I know. - [Jenna] Okay, are there naked ladies? - Ew, I don't know, take a peak! No. Potential. - [Jenna] Are you going to put nudes on that nude truck? - Hey guys! We made it to Vegas and we spent, how long in line? Oh, about an hour and a half in line for FedEx. I was waiting for a package. I ordered a hard drive because I wanted to back up all of my footage onto one drive before the whole CES trip. I also ordered some things from Bloomingdale's, which was supposed to get shipped to my house, but it was delayed because of the weather. So I just rerouted it to Vegas, thought it'd be no big deal. After waiting for an hour and a half for what I thought was a hard drive, the only thing that I got was this black basic sweat shirt, that I'm wearing right now. It was crazy. It was like-- I probably should have turned this TV off while I was vlogging, because it's right by the microphone, so it's almost like, have I've ever vlogged before? Don't know. We're heading off to dinner, so I'm going to be switching to my smaller camera, and leave this big guy behind. How did we already destroy this hotel room? Every time we get ready, it's like, a hotel room just gets destroyed with like clothes everywhere. - [Jenna] I don't know, I kind of organized mine. - Okay, then maybe it's all mine. - I hung them up. I have my different little piles here of organization. - Well I tried to hang things up-- - You destroyed it. - But you took all the hangers. - There are hangers, there's four hangers left. See, I didn't think you were going to use them, because you never hang anything ever. - Slob, slob, slob, slob. - [Jenna] Hello. - [Justine] Guess what we're doin'? We're going to dinner. Oh, why are we singing so loud. - I know. - I don't know, I'm going to be quiet. - [Justine's sister] We're going to go to dinner. - Sh! The Palazzo Casino got new lighting since the last time we were here, which was for Matt's birthday, so since August. They got all new lighting, and something that we always do when we are here, is go to Lavo. What do you think you're going to get tonight, Jen? - Oh my God, I don't know. ' Cause they have like the ravioli, but then they have this other type of pasta. - [Nick] I'm so excited. - Okay, so we just got done with dinner. We had some very extra special guests today. Guys if you want to know why Scott is not posting HQ Trivia, it's because you're in Vegas. - I'm straight up vlogging, yo! What up, vloggers! - How does it feel to vlog? - My vlogs, it feels like doing HQ except-- - You hate it. - Except I hate every aspect of it, yeah. That's the difference. - Well, this is exciting, so is this your first CES? - My first CES? Yeah. I thought this was the AVN awards. - No, didn't they move it? 'Cause it used to be the same week. Don't look it up, but we're here. This is so exciting. So how has HQ been? I mean, it's a pretty small little app, that I'm a huge fan of. Thank you guys so much for signing up. - Hey, I have a question for you, Justine. What do you think HQ stands for? What does HQ stand for? - Head quarters? - Head quarters? - Wait, what does it-- - Geoff Keighley of the game awards. - High Quality Trivia. - Please, what does it stand for? Do you know? - Hard questions, maybe? - Ew, I like that. That's actually good. - I honestly thought it was High Quality Trivia. - I honestly never even thought about it. - Scott] High quality, hard questions. - Is that a problem? I don't know. - Hebrew Queens. - Well, I hope you have a really good first trip to CES. - It's my first vlog. It's my first vlog, everybody. - Really? Am I supposed to look there, or there? - [Justine] Wait, here, do you want to hold it? You want to try it? Okay, so this is Scott vlogging. - This is Scott vlogging. - You just use-- - I should look down the barrel. - You look here. - Yeah, this is my impression of a vlogger. What's up, y'all? That's my impression of vlogging. - That's basically it. That's it. I had a waffle, chicken and waffle sandwich, it was so bomb. It had like this chili honey sauce. It was like oh my God, so bomb. - Wait, we have another special guest. - I'm getting video bombed. - We have another Scott. - I video bombed you. - Drew Scott, can you believe this? - Yeah, you know there was a Scott convention in Vegas at the same time. So weird! - It's the Scott-ery brothers. - I'm lookin' to replace my brother with someone with a better beard. - Yes! - So, hired! I'm actually your new HQ host. - I need stilts next to this guy. - [Justine] Are you an HQ D? - You know, I kind of am. I got put onto it, and I am a little addicted, but that's why, when you feel under the weather, I'll just, see that right there, hold on. - [Justine] Wait, okay. And then if he's under the weather, Look it, perfect fit. It's a perfect fit. - Even my hands. - Yeah. - This is incredible. I want to host one day. Hopefully I can. Do you think they would let me? - Justine, when you grow up, you can host HQ. - Okay, I'll be-- - When you answer all the questions, that's the prize, you get to host. - I can't even get past question five, and I have 10 thousand extra lives, like that's sad. - 10 extra lives, it's crazy! - It's pretty crazy. And Geoff's here. Hello. - What's up guys? - And we got Nick and Jenna. - Hey guys! - What's up? - Hello everybody. - So full. - So this is the end of basically our day one vlog, traveling here. I don't even know what happened, but there's going to be a lot of stuff happening. So I'm super excited. Let me know, if you guys know if there is anything that you want me to check out. Leave it in the comments below. And maybe you will see my friends. - Oh yeah, here's my other impression of a vlogger. Leave a comment below. Let me know how you feel. Check it out. Like it, share it, subscribe. - See, he's making fun, but like next week, Scott's like, hey guys, check out my new YouTube channel. Make sure you subscribe. Well, thanks for being in my video. I'll see you guys later. - Sorry for making fun of vloggers. - Bye. - Bye. - It's okay, I make fun of myself. This is the life that we live.",
    "transcript_keywords": [
        "guys",
        "Vegas",
        "time",
        "Scott",
        "vlogging",
        "Yeah",
        "vlog",
        "CES",
        "Good",
        "Trivia",
        "wait",
        "High Quality Trivia",
        "Scott vlogging",
        "pee",
        "Hey guys",
        "High Quality",
        "Quality Trivia",
        "minutes",
        "Hey",
        "drive"
    ],
    "transcript_entity_values": [
        "30 minutes",
        "second",
        "HQ Trivia",
        "one",
        "two hours 11 minutes",
        "next week",
        "Justine",
        "tonight",
        "CES",
        "Moons Over My",
        "10 thousand",
        "four hours",
        "Bloomingdale's",
        "Steak",
        "Geoff Keighley",
        "Mam",
        "The Palazzo Casino",
        "Ijustine",
        "HQ",
        "the same week",
        "7:49",
        "four hours 21 minutes",
        "about 6:30 a.m.",
        "12 minutes",
        "an hour and a half",
        "YouTube",
        "August",
        "Google",
        "four",
        "LMO",
        "45 minutes",
        "half",
        "Ezasteve",
        "Lavo",
        "Justine] Wait",
        "one day",
        "Hebrew",
        "twenty dollars",
        "13,000",
        "Jen",
        "five",
        "Starbucks",
        "two seconds",
        "two hours",
        "AVN",
        "today",
        "Justine] Hi",
        "Geoff",
        "Jenna",
        "FedEx",
        "Nick",
        "Scott",
        "Justine] Play",
        "10",
        "Vegas",
        "five or ten dollars",
        "first",
        "about an hour and a half",
        "Drew Scott",
        "Matt",
        "at-- - EZA Steve",
        "Denny"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "TIME",
        "TIME",
        "TIME",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "LAW",
        "TIME",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "NORP",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "GPE",
        "MONEY",
        "ORDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.04093097895383835,
        -0.0853433683514595,
        -0.05707314610481262,
        -0.13910706341266632,
        0.028585392981767654,
        0.029814831912517548,
        0.0497669018805027,
        0.060620930045843124,
        -0.004946370143443346,
        0.06641443073749542,
        0.019570838660001755,
        -0.023422500118613243,
        -0.014664062298834324,
        0.011978551745414734,
        -0.009024500846862793,
        0.018483841791749,
        0.01558961533010006,
        -0.019465897232294083,
        0.005920598283410072,
        0.034218598157167435,
        -0.02842082269489765,
        -0.056214090436697006,
        0.009524792432785034,
        0.006856830790638924,
        -0.046930547803640366,
        0.08683671057224274,
        0.004456070717424154,
        0.05465526133775711,
        -0.09451700747013092,
        -0.09067792445421219,
        -0.015579420141875744,
        0.03722100704908371,
        0.1113690510392189,
        -0.006062740925699472,
        0.0120004341006279,
        -0.04632722586393356,
        0.05366334319114685,
        -0.029895324259996414,
        -0.02702455408871174,
        -0.035810910165309906,
        0.006563853472471237,
        -0.05805680900812149,
        0.02017103135585785,
        -0.02693793550133705,
        -0.051656708121299744,
        -0.09435245394706726,
        -0.00023582851281389594,
        -0.060835085809230804,
        0.06821583211421967,
        0.05128335580229759,
        -0.0772956982254982,
        -0.0315861701965332,
        0.02850501239299774,
        0.021199185401201248,
        -0.08778224885463715,
        0.006095403805375099,
        -0.09371614456176758,
        0.02245640568435192,
        0.052766211330890656,
        -0.07353096455335617,
        0.015492217615246773,
        -0.05759437009692192,
        0.009880813769996166,
        0.07902383804321289,
        -0.05715140700340271,
        -0.061003368347883224,
        0.008998610079288483,
        0.007016324903815985,
        0.0018427235772833228,
        0.006416608113795519,
        -0.15026907622814178,
        0.05080242455005646,
        -0.02289666421711445,
        0.043487947434186935,
        -0.003946660086512566,
        0.06238451227545738,
        0.056149087846279144,
        -0.06520497053861618,
        0.008460090495646,
        0.022472241893410683,
        0.03483741730451584,
        -0.043832071125507355,
        -0.08891100436449051,
        -0.01695284992456436,
        0.003723760833963752,
        0.034325096756219864,
        0.03148816525936127,
        0.010838833637535572,
        -0.004001615568995476,
        -0.0823802798986435,
        -0.08860885351896286,
        -0.010305522009730339,
        -0.02289515547454357,
        -0.010224523022770882,
        -0.04898325726389885,
        -0.04675600305199623,
        -0.01185860950499773,
        -0.06500488519668579,
        -0.039508163928985596,
        0.07742530852556229,
        0.03860428184270859,
        -0.03944302350282669,
        -0.004973370116204023,
        -0.05019770935177803,
        -0.03952426463365555,
        -0.10292675346136093,
        -0.050055138766765594,
        0.04965420812368393,
        0.015045084059238434,
        0.001845782739110291,
        -0.053636953234672546,
        0.05194195359945297,
        -0.07522646337747574,
        -0.0879143476486206,
        0.028449609875679016,
        0.11218079924583435,
        -0.03311815485358238,
        0.07264664769172668,
        0.058640267699956894,
        0.004668460693210363,
        -0.02572742849588394,
        -0.08553901314735413,
        -0.030882354825735092,
        0.04479765519499779,
        0.005074723158031702,
        0.010686024092137814,
        -0.05555019900202751,
        1.3514771692735106e-32,
        -0.03308487683534622,
        0.07089754939079285,
        0.013590422458946705,
        0.06313442438840866,
        0.0009585587540641427,
        -0.03303909674286842,
        -0.027538718655705452,
        0.11212313175201416,
        -0.035227175801992416,
        0.0023815869353711605,
        0.0245029516518116,
        0.05119204893708229,
        -0.03710538521409035,
        0.04203875735402107,
        0.050308484584093094,
        -0.04409784451127052,
        -0.018195366486907005,
        -0.06561171263456345,
        -0.06758549064397812,
        -0.02085919678211212,
        0.007299566641449928,
        -0.04160945862531662,
        0.03501749411225319,
        0.08436108380556107,
        0.1323930025100708,
        0.06942760944366455,
        0.053332243114709854,
        0.011460072360932827,
        0.08546770364046097,
        0.011888728477060795,
        -0.051907069981098175,
        -0.051815155893564224,
        -0.0007142435060814023,
        -0.0821230486035347,
        0.0044321841560304165,
        0.031222166493535042,
        -0.06001759693026543,
        -0.010223450139164925,
        -0.030331740155816078,
        -0.026851950213313103,
        -0.02881757542490959,
        0.022038470953702927,
        -0.06478251516819,
        -0.05258515104651451,
        0.07347627729177475,
        0.03924170881509781,
        0.03969552367925644,
        0.059604573994874954,
        -0.0068040951155126095,
        0.01978055015206337,
        -0.0225529745221138,
        -0.007917081005871296,
        -0.052694108337163925,
        -0.004419848322868347,
        -0.0025734181981533766,
        -0.0698968693614006,
        -0.04790777713060379,
        0.0295291505753994,
        0.04131287708878517,
        0.05017026141285896,
        0.005197725724428892,
        -0.00811948161572218,
        -0.04407814145088196,
        -0.034910693764686584,
        -0.05668061226606369,
        0.09969651699066162,
        0.06792549043893814,
        -0.02547251619398594,
        0.03517640382051468,
        0.044592928141355515,
        -0.008949519135057926,
        -0.008727583102881908,
        0.0656246468424797,
        0.021242057904601097,
        0.053134769201278687,
        0.07680875808000565,
        -0.09770593047142029,
        -0.04564736410975456,
        0.035267945379018784,
        -0.019726870581507683,
        -0.13295267522335052,
        0.06642650067806244,
        -0.03100873902440071,
        0.09339185804128647,
        0.017427591606974602,
        -0.05506942421197891,
        0.01513616181910038,
        -0.036802228540182114,
        -0.028416426852345467,
        -0.010823138058185577,
        -0.016091540455818176,
        0.07161414623260498,
        -0.06248560547828674,
        -0.035087767988443375,
        -0.05251717567443848,
        -1.3199514393420138e-32,
        0.03355345129966736,
        0.037660714238882065,
        -0.009767604060471058,
        -0.012815605849027634,
        0.0557241253554821,
        -0.031154874712228775,
        0.03247463330626488,
        0.09174059331417084,
        0.07770057022571564,
        -0.07352198660373688,
        0.03306184336543083,
        -0.07003878057003021,
        -0.09608825296163559,
        -0.005214097443968058,
        -0.03178304433822632,
        -0.044392433017492294,
        -0.052263159304857254,
        -0.04803013801574707,
        0.043308962136507034,
        -0.00039056851528584957,
        0.08856331557035446,
        0.13644321262836456,
        0.06416159123182297,
        0.010930292308330536,
        0.0092627527192235,
        0.023700319230556488,
        0.02088037319481373,
        0.06140991300344467,
        0.04491022601723671,
        0.038839250802993774,
        -0.032504141330718994,
        -0.058289989829063416,
        -0.03028489276766777,
        0.0054476275108754635,
        0.04846471920609474,
        0.0408635139465332,
        0.022435961291193962,
        0.053707949817180634,
        0.008221297524869442,
        -0.0632752925157547,
        0.026829760521650314,
        0.004487466998398304,
        -0.003555028000846505,
        -0.0010905569652095437,
        0.011156698688864708,
        -0.11002710461616516,
        -0.04443720728158951,
        0.035518914461135864,
        0.010325548239052296,
        0.01717020757496357,
        -0.05512409284710884,
        -0.06338559091091156,
        -0.018622986972332,
        -0.015021157450973988,
        -0.011484718881547451,
        -0.007812031079083681,
        -0.06376045197248459,
        -0.010815754532814026,
        0.03669299557805061,
        0.005473176017403603,
        0.043392766267061234,
        -0.03363015502691269,
        -0.08038239926099777,
        -0.06813901662826538,
        0.02777438797056675,
        -0.05878526344895363,
        0.06842465698719025,
        0.04836029186844826,
        -0.015369425527751446,
        0.009071072563529015,
        -8.877563959686086e-05,
        0.016164371743798256,
        0.022506101056933403,
        -0.025713389739394188,
        0.03352125361561775,
        -0.008550763130187988,
        -0.057963982224464417,
        -0.004498444031924009,
        0.08820869028568268,
        -0.028245048597455025,
        -0.04968219995498657,
        -0.011025415733456612,
        0.03381097689270973,
        0.0814051702618599,
        0.10962661355733871,
        0.11924554407596588,
        0.07012462615966797,
        -0.056688811630010605,
        -0.00162491702940315,
        0.04958749935030937,
        0.01697562076151371,
        0.07380926609039307,
        0.0822073370218277,
        0.11310836672782898,
        -0.08175554871559143,
        -6.652961559439063e-08,
        0.026300758123397827,
        0.0500296875834465,
        -0.05055520683526993,
        0.0046902913600206375,
        0.04301510006189346,
        -0.07934101670980453,
        -0.028351182118058205,
        -0.0014811069704592228,
        0.07134202122688293,
        -0.054013896733522415,
        0.08559030294418335,
        -0.010975141078233719,
        0.0003048909711651504,
        0.11581746488809586,
        0.027146531268954277,
        0.025880925357341766,
        -0.10522967576980591,
        0.08356563746929169,
        -0.04927758127450943,
        -0.05271074175834656,
        -0.05609961226582527,
        0.053372181951999664,
        0.03008498251438141,
        -0.00047401594929397106,
        0.04773343354463577,
        -0.0052846577018499374,
        -0.009986838325858116,
        -0.025349613279104233,
        0.04279075562953949,
        0.006267789751291275,
        -0.0906825065612793,
        0.007971973158419132,
        -0.0004015974991489202,
        -0.004317787010222673,
        -0.027882585301995277,
        -0.0509955994784832,
        -0.06330381333827972,
        -0.027524493634700775,
        0.032350897789001465,
        0.029208026826381683,
        0.020314954221248627,
        -0.11911386996507645,
        -0.042915720492601395,
        0.00805650930851698,
        0.0176701620221138,
        -0.045249927788972855,
        0.025192782282829285,
        -0.06854403018951416,
        -0.06113472580909729,
        -0.03778751939535141,
        -0.0608467161655426,
        0.03357621654868126,
        0.017289938405156136,
        -0.041020717471838,
        0.05351812392473221,
        0.0010045812232419848,
        0.042997971177101135,
        0.0637841448187828,
        -0.015597321093082428,
        -0.010098119266331196,
        0.046906400471925735,
        0.0033476785756647587,
        -0.040147993713617325,
        0.04130788892507553
    ]
}