{
    "id": "TMHhNXagQqk",
    "title": "Is the 2019 iPad Worth It?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-10-04T18:01:22Z",
    "video_url": "https://www.youtube.com/watch?v=TMHhNXagQqk",
    "category": "Science & Technology",
    "tags": [
        "ipad",
        "2019 ipad",
        "ipad 7th generation",
        "new ipad",
        "ipad 7th gen",
        "ipad 2019",
        "ipad 10.2",
        "ipados",
        "ipad os",
        "apple",
        "apple ipad",
        "ipad 10.2 review",
        "ipad air",
        "new ipad 2019",
        "ios 13",
        "apple pencil",
        "tech",
        "tablet",
        "review",
        "is it worth it",
        "this is",
        "austin evans",
        "fortnite",
        "ipad fortnite",
        "xbox controller"
    ],
    "views": 470983,
    "likes": 14694,
    "comments_count": 1014,
    "description": "The cheapest iPad is not only worth it, it's a downright steal. 2019 7th gen iPad on Amazon:  Does the PS5 even matter?   By using our Amazon affiliate links we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://austin.tech/ipad2019",
        "https://www.youtube.com/watch?v=3Mcw9MX1MJI",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. This is the brand new base iPad and at $330 it might be the best value Apple product that you can buy. For 2019 the base iPad sees a few upgrades, including some more RAM as well as a slightly larger screen. But for me, there are two major highlights. First of all is the addition of the Smart Connector. Now this is something which has slowly been trickling its way through the iPad lineup over the last few years, and it makes a big difference. As far as I'm concerned an iPad without a keyboard is a great content consumption device. But if I wanna get any real work done, I need a keyboard. And as ludicrously expensive as a Smart Connector keyboard is, it does make a big difference. Now I'm not exactly sure what Apple's smoking, charging you a $160 price tag for a keyboard for a $330 iPad. I started out this video I'm like hey, this is the best value product that Apple sells. Look how great it is and then they charge you the $160 for the keyboard. I'm like well, don't worry about that part. So something else that the base iPads still uses is the standard old school Apple Pencil, which means if you wanna charge it, you have to plug it into the Lightning port like this. I can't believe they still charge $100 for this. Look, I don't wanna beat a dead horse here, the pencil's nice, the keyboard's nice. And when you use them together the iPad, the base model really actually does feel surprisingly close to a full iPad Pro. So what I've been doing the last few days is exactly that. This has been my main laptop replacement. And yes, I just said the words iPad and laptop replacement in the same sentence with a completely straight face. - Bull(beep) - No, for real. Now yes, I'm sure you're probably rolling your eyes right now the idea of an iPad, a base iPad, no less being a laptop replacement. But hear me out here, over the last few days of using this as my main system, I've been surprised exactly how usable it really is. I'm not saying like oh, it's usable if you deal with this compromise, or with that compromise. I mean like I've been able to do pretty much everything I need to including Google Docs and YouTube and keeping up with spreadsheets and everything which all sounds really boring. But the thing is, is that this is just as good of an iPad for most situations as the iPad Pro, and it costs like one third the price. A huge part of this comes down to the second major upgrade, and arguably the most important one, iPadOS. Holy (Roblox oof). This makes it so much better. - Wow. - Dude, it is not even close. So in the past when I was using the beta of the iPadOS on my iPad Pro, it was pretty solid. But now the final version is out. And of course it is supported on a wide range of iPads, including the new base model, it makes a world of difference. Probably the number one feature that I really appreciate in this, is a desktop version of Safari. Now ever since the first iPad Pros came out with the keyboard I'm like, oh you know what, I could use this as a laptop. And I've tried and tried, and I've tried, but now that we have a full proper desktop browser, I actually can kind of make it work. Now yes, there's still some small caveats. Safari is certainly not perfect, but it is so much better than before. Things like Google Docs actually works. So does Gmail, so does well, 95% of any web apps I've tried unless they need some sort of plugin. Gone are the days of dealing with terrible mobile apps like Drive or Docs, which were just not good. I mean, using the full versions make a huge difference. I mean literally, this is a full Google Doc, wants to load, I can do everything I'd want. And with the pencil, I can easily select text. I can easily select text. I mean, it makes a big difference. Now, there's certainly other advantages. So the Files have seen major update, which means that you can now download files on the iPad, you have access to a full file structure. So I can set up folders, move files around, it's getting better to sort of share files between apps. And there is some support for external devices such as USB. And it's a little bit more difficult because this is still using Lightning. So you do need to use an adapter or use one of those little USB dongles that has a Lightning port on it. But generally speaking, this has come a long way toward being honestly even more useful than something like a Chromebook. Whereas in the past, it was like Windows, Mac, Chrome OS, iPad. But now it's like iPad, Chrome OS. We can make a 3D chart to show that so as I move my hands, it's all nicely animated. - [Ken] No. - We do have the budget for that. - [Ken] No. - No it is certainly not perfect. Even though the upgrade from two to three gigs of RAM, I still do run into some issues in Safari where I'll have five or six tabs open, and we'll start reloading them in the background although to be fair it's fairly fast on that front. And there's some other things like yes, I wish I did have a little bit more performance, the A10 is decent, and it's actually surprisingly usable. But of course, having the A12, the A12X would be a little bit quicker, a little bit more snappy. But generally speaking, all the things that are major differences between the base iPad and the Pro are nice to have, not need to have, I can get the same things done on this. It's maybe just a touch slower, it's maybe not quite so smooth. You don't have the higher refresh rate display or quite as nice of audio but the general experience is nearly identical, which is incredibly impressive. I mean, we look at a lot of very cheap $200, $300 laptops, and honestly with iPadOS being as good as it is, I think I'm gonna have to stop recommending some of them. I mean sure, if you specifically need Windows by all means go for it. But for a lot of people, you're getting a better experience with the iPad. And that's something I've never been able to say before. The better comparison is with the iPad Air, which also came out earlier this year. Now we put it side by side with the base iPad, you'll see that the Air is a little bit thinner, but beyond that they're actually surprisingly similar. So the Air does have a slightly larger 10.5 inch display compared to 10.2 inch on the base iPad. And the laminated glass does look a little bit better. There's no screen gap unlike that base iPad, but in real world use, I really can't tell a huge difference. They're both very vibrant, they're both both very bright, resolutions are nearly the same. Honestly, the Air is a, it's a decent iPad, it's a good choice but over $170 more expensive, it's kind of hard to justify. Now the design is certainly been around for a while. However, there are some good sides to that. Touch ID is well, still here, not quite as fast as Face ID but it's fine. And you of course do have the headphone jack. Now camera-wise well, that's a little bit of a downgrade. This is what the video looks like coming out of the iPad base model. It is the very old school 720p camera and well, it works for FaceTime I guess, but not really that well, to be totally honest. It's a little bit of a downgrade. Probably the biggest differences is in the specs. So the base model iPad sticks with the same Apple A10 from last year's iPad, whereas the iPad Air has the A12, but in my few days of using this base iPad, it hasn't really bothered me. I mean yeah, it's a little bit slower but beyond that, I mean, it's surprising at how much the iPhone 7 processor can really handle here. This is not blisteringly fast, you know what, it's actually kind of fine even for some gaming. Now with iPadOS now supporting PS4 and Xbox One controllers, this actually isn't a bad little portable console. So first up, we have Fortnite and there's actually some interesting things about Fortnite. So not only do we actually have proper resolution scalers, we can change it to 20, 30 or 60 as our FPS cap. We also can change the resolution, change the quality. And as far as I've tested, this actually looks better and runs smoother than on the Switch. - [Gamer] Yeah, don't kill Austin. (gun fires) (laughs loudly) Yoh kill, no, no, don't kill him, don't kill him. - Ever since the first iPad Pro came out, I've really wanted to use an iPad as my everyday laptop. I mean between the form factor which you just can't beat, the all day battery life, the great screen. And of course there are inherent advantages to going with iOS and things like security and app compatibility. But there's always been something to hold me back. I'm not gonna sit here and pretend that I'm ready to throw my laptop in the garbage just yet. There's still cases like editing that I prefer to use a laptop for. However, for the most part, this is really enough to replace most of what I do. And specifically with the $330 base model, it is hard to argue that this is not the best value Apple product that you can buy today. Sure, the higher end iPads are nice. But this really is all you need.",
    "transcript_keywords": [
        "iPad",
        "base iPad",
        "iPad Pro",
        "base",
        "Apple",
        "iPad Air",
        "bit",
        "base model",
        "Pro",
        "keyboard",
        "full iPad Pro",
        "Smart Connector keyboard",
        "Smart Connector",
        "laptop",
        "Air",
        "difference",
        "iPad Pros",
        "Apple product",
        "iPad base model",
        "base model iPad"
    ],
    "transcript_entity_values": [
        "six",
        "Safari",
        "last year's",
        "Lightning",
        "Chrome",
        "Apple A10",
        "First",
        "2019",
        "Gmail",
        "Yoh",
        "30",
        "iPad",
        "first",
        "A12",
        "RAM",
        "Docs",
        "95%",
        "Windows, Mac",
        "USB",
        "330",
        "the last few days",
        "iPad Pro",
        "Austin",
        "170",
        "160",
        "Air",
        "two",
        "300",
        "Apple",
        "$330",
        "Windows",
        "PS4",
        "the Smart Connector",
        "the iPad Pro",
        "Google Docs",
        "Xbox One",
        "Switch",
        "A12",
        "Austin",
        "YouTube",
        "60",
        "second",
        "iPads",
        "Chrome OS",
        "my few days",
        "the iPad Air",
        "200",
        "Chromebook",
        "10.5 inch",
        "five",
        "Fortnite",
        "10.2 inch",
        "Smart Connector",
        "the last few years",
        "iPads",
        "two to three",
        "iPad Pros",
        "A10",
        "FaceTime",
        "100",
        "Roblox oof",
        "today",
        "Apple Pencil",
        "earlier this year",
        "one third",
        "20"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.03587765619158745,
        -0.05468784272670746,
        0.04202365502715111,
        -0.05455221235752106,
        0.04039202630519867,
        0.034806832671165466,
        -0.012560916133224964,
        0.028446370735764503,
        0.09284526854753494,
        0.07452221214771271,
        0.07485038042068481,
        0.08076175302267075,
        -0.024181600660085678,
        -0.010358848609030247,
        0.050068553537130356,
        0.03428655490279198,
        0.038496047258377075,
        -0.04573199525475502,
        -0.06188749149441719,
        -0.01583164371550083,
        -0.10953215509653091,
        -0.004527502693235874,
        0.021948527544736862,
        -0.021046768873929977,
        0.016480280086398125,
        0.02360760048031807,
        -0.02861691825091839,
        -0.0800379067659378,
        -0.03980694338679314,
        0.056678153574466705,
        -0.01374763809144497,
        0.019043026491999626,
        -0.02891782857477665,
        0.06164093315601349,
        -0.08671854436397552,
        -0.05170947313308716,
        0.0796082392334938,
        0.027913598343729973,
        -0.042344287037849426,
        -0.06250840425491333,
        0.00815802626311779,
        -0.10790279507637024,
        -0.05220017209649086,
        0.04664129018783569,
        0.03786009922623634,
        0.046289268881082535,
        -0.038117699325084686,
        -0.034202802926301956,
        0.029564043506979942,
        0.008221211843192577,
        -0.03234683349728584,
        -0.030881477519869804,
        0.03332090750336647,
        -0.08234903961420059,
        -0.0006411090726032853,
        -0.0004889037809334695,
        0.04605201631784439,
        -0.03155118227005005,
        0.10536843538284302,
        0.037620048969984055,
        0.04136885702610016,
        -0.050389230251312256,
        0.04547220468521118,
        -0.015205897390842438,
        0.07916323840618134,
        -0.05243745818734169,
        0.06673510372638702,
        -0.07761590927839279,
        0.06653396040201187,
        -0.013896701857447624,
        -0.033593062311410904,
        -0.0021130070090293884,
        0.0469113364815712,
        -0.04743223264813423,
        -0.019021034240722656,
        0.03454654663801193,
        -0.0033195456489920616,
        -0.04125616326928139,
        0.037103619426488876,
        0.02381565235555172,
        0.018964555114507675,
        0.03598988801240921,
        0.01042660977691412,
        -0.021147767081856728,
        0.014009831473231316,
        0.00852020364254713,
        0.021763714030385017,
        0.0013243373250588775,
        -0.013660275377333164,
        -0.0056072729639709,
        0.06749182939529419,
        0.029629340395331383,
        0.015682145953178406,
        0.004889481235295534,
        -0.0041852910071611404,
        0.06614618003368378,
        0.011015520431101322,
        -0.030820084735751152,
        -0.08284226804971695,
        -0.04835226386785507,
        0.04352620616555214,
        0.09641939401626587,
        0.042738717049360275,
        -0.052210595458745956,
        0.04003776237368584,
        -0.03999072313308716,
        0.013033249415457249,
        0.00884560588747263,
        0.010244011878967285,
        0.005667472258210182,
        0.041720591485500336,
        -0.025935444980859756,
        -0.05844739079475403,
        0.023026272654533386,
        0.0524957999587059,
        0.013718570582568645,
        -0.010892928577959538,
        0.027525397017598152,
        0.12419541925191879,
        0.07513046264648438,
        -0.000325881817843765,
        0.05298278480768204,
        -0.023419300094246864,
        0.006601233035326004,
        -0.0847126692533493,
        -0.029784424230456352,
        -0.05531560257077217,
        2.8065561290805604e-33,
        -0.0943751186132431,
        0.1625726968050003,
        -0.044392120093107224,
        -0.0662984848022461,
        -0.030519070103764534,
        -0.06786516308784485,
        0.02761675976216793,
        0.08749455213546753,
        0.009116966277360916,
        0.015231565572321415,
        -0.0603732094168663,
        -0.027400383725762367,
        -0.06884532421827316,
        -0.008091973140835762,
        0.10142744332551956,
        -0.035801928490400314,
        -0.06827849894762039,
        -0.01959274150431156,
        -0.020353876054286957,
        0.03746023401618004,
        -0.013074221089482307,
        -0.06925391405820847,
        0.02626303769648075,
        -0.005579238757491112,
        -0.004801357164978981,
        -0.08007314801216125,
        0.016483480110764503,
        -0.0007114969776012003,
        -0.02406008169054985,
        -0.015893088653683662,
        -0.13617905974388123,
        -0.0046980720944702625,
        -0.013206320814788342,
        -0.09676450490951538,
        -0.04542049765586853,
        -0.09308946877717972,
        0.04277706518769264,
        -0.07828053086996078,
        0.03747371956706047,
        -0.009955566376447678,
        -0.10318262875080109,
        0.03778448328375816,
        -0.0340178981423378,
        0.025515226647257805,
        0.0879545509815216,
        0.03977341577410698,
        0.02932240255177021,
        0.04814493656158447,
        -0.023703444749116898,
        -0.0668865293264389,
        -0.133551225066185,
        -0.0071321153081953526,
        -0.004879425745457411,
        -0.032222311943769455,
        -0.03101188689470291,
        -0.07455451041460037,
        -0.027978837490081787,
        -0.013038253411650658,
        0.11902125924825668,
        0.043874066323041916,
        -0.04794013872742653,
        -0.018787270411849022,
        -0.039262086153030396,
        0.05375448241829872,
        -0.03245403990149498,
        0.031219344586133957,
        0.06367693841457367,
        0.06797682493925095,
        -0.0060862344689667225,
        0.010476779192686081,
        0.055932484567165375,
        -0.008824863471090794,
        -0.020021146163344383,
        -0.03934367373585701,
        -0.005994022823870182,
        0.020473776385188103,
        0.04929184913635254,
        -0.05013075843453407,
        -0.020066488534212112,
        -0.013574414886534214,
        0.023881040513515472,
        0.07140055298805237,
        0.06730379909276962,
        0.049756087362766266,
        -0.011493644677102566,
        0.05924835801124573,
        0.010986796580255032,
        -0.07736129313707352,
        0.0018880445277318358,
        -0.015513124875724316,
        0.036590855568647385,
        -0.012919113971292973,
        -0.06288199871778488,
        0.010062910616397858,
        0.019134268164634705,
        -2.116056972083125e-33,
        0.054097291082143784,
        0.01933862827718258,
        -0.043117303401231766,
        0.013842995278537273,
        -0.025354402139782906,
        -0.011790159158408642,
        0.0018356142099946737,
        0.010509018786251545,
        0.00896418560296297,
        -0.04910998046398163,
        -0.02270808257162571,
        0.059059880673885345,
        0.03018559329211712,
        -0.035879649221897125,
        0.028155317530035973,
        0.010660736821591854,
        -0.07749329507350922,
        -0.10980058461427689,
        0.0881710797548294,
        -0.04144398495554924,
        0.045310329645872116,
        0.04765801131725311,
        -0.024983450770378113,
        -0.023511989042162895,
        -0.039507925510406494,
        0.02849886193871498,
        -0.08601109683513641,
        0.012728872708976269,
        -0.04061302915215492,
        0.04095378890633583,
        0.05673957243561745,
        -0.03317544236779213,
        0.05015118792653084,
        0.019448919221758842,
        0.010291323997080326,
        0.04085848480463028,
        0.09796794503927231,
        -0.008010370656847954,
        -0.019445011392235756,
        0.04885423183441162,
        0.06059129163622856,
        0.053626783192157745,
        0.0239967480301857,
        -0.03919040411710739,
        0.035813841968774796,
        0.05773991718888283,
        0.02605150081217289,
        0.0049983421340584755,
        0.056377775967121124,
        0.0059388168156147,
        0.056591372936964035,
        0.0786600336432457,
        -0.10004522651433945,
        0.00117238808888942,
        -0.10888320952653885,
        -0.027570536360144615,
        0.005080517381429672,
        0.03221825882792473,
        -0.058807652443647385,
        -0.03560067340731621,
        -0.01446207519620657,
        0.03910677880048752,
        0.04026106372475624,
        -0.04399861767888069,
        -0.0004604917485266924,
        -0.04305346682667732,
        0.03105371631681919,
        0.013833996839821339,
        0.04487650468945503,
        3.487977301119827e-05,
        -0.024432122707366943,
        -0.03613226115703583,
        -0.01590817980468273,
        -0.0653894767165184,
        -0.00319917150773108,
        0.16061058640480042,
        0.11423102766275406,
        -0.039991892874240875,
        -0.008190518245100975,
        0.023823030292987823,
        0.002104156883433461,
        0.09256664663553238,
        -0.012847750447690487,
        -0.056104812771081924,
        0.035156480967998505,
        0.044997911900281906,
        0.028471531346440315,
        -0.03469742462038994,
        -0.12307902425527573,
        0.05133257061243057,
        -0.01931215263903141,
        -0.08046231418848038,
        -0.12093323469161987,
        0.017112595960497856,
        0.0703599825501442,
        -4.5206387966345574e-08,
        0.0908614918589592,
        0.04637909308075905,
        0.04727761447429657,
        -0.0344349667429924,
        0.027996337041258812,
        -0.08139249682426453,
        0.02510991506278515,
        0.046215496957302094,
        0.0633901059627533,
        0.04878563433885574,
        -0.016139350831508636,
        -0.10325384885072708,
        -0.05274271219968796,
        0.05030551552772522,
        0.01244948711246252,
        0.08982469886541367,
        -0.02641030214726925,
        0.007166941184550524,
        -0.028179949149489403,
        -0.06516698002815247,
        0.04473646357655525,
        0.012866479344666004,
        -0.03737225756049156,
        -0.03467186167836189,
        -0.04432598873972893,
        0.007272929884493351,
        -0.0598200224339962,
        0.023264681920409203,
        -0.015118234790861607,
        -0.05039762333035469,
        -0.003743167035281658,
        -0.08592508733272552,
        0.05811428651213646,
        0.009459632448852062,
        0.060570117086172104,
        -0.10810869187116623,
        -0.04579414427280426,
        -0.02395535819232464,
        -0.027185611426830292,
        0.0060139731504023075,
        0.01605776883661747,
        -0.0811803936958313,
        -0.081712506711483,
        0.0038737645372748375,
        0.018663205206394196,
        0.0017209660727530718,
        -0.04994131252169609,
        -0.0509088970720768,
        -0.03218459337949753,
        0.15005405247211456,
        0.03420832380652428,
        -0.012309659272432327,
        0.05997147411108017,
        0.0028006513603031635,
        0.0343855582177639,
        0.017343726009130478,
        0.05434245988726616,
        0.022148678079247475,
        -0.0014756997115910053,
        0.03470125049352646,
        0.1048184335231781,
        -0.09788232296705246,
        -0.013226696290075779,
        0.0485742948949337
    ]
}