{
    "id": "TNZk-xnxIYE",
    "title": "I Can’t Believe How Much I Paid For This… - Sony Vidimagic FP-60",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-03-09T17:54:30Z",
    "video_url": "https://www.youtube.com/watch?v=TNZk-xnxIYE",
    "category": "Science & Technology",
    "tags": [
        "CRT",
        "Projector",
        "TV",
        "Display",
        "Sony",
        "Vidimagic",
        "FP-60",
        "FP-62",
        "Indextron",
        "Beam Index Tube",
        "Avon",
        "Reel to Reel"
    ],
    "views": 1428993,
    "likes": 48018,
    "comments_count": 2653,
    "description": "Visit  and use offer code LTT for 10% off  Create your build at   Sony has made a lot of cool products over the last few decades, and while the Vidimagic FP-60 CRT projector might not be impressive today, it had a lot going for it back in 1984.   Discuss on the forum:   Sony Vidimagic FP 60 Indextron Video Projector repair:   The Sony VidiMagic VCR - Video Projector Original Dealer Training Video 1984:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:03 Vidimagic FP-60 4:05 SMB3 6:08 Brightness 7:05 Beam Index Tube 9:58 Blade Runner 11:50 Conclusion 14:17 Outro",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1561763-i-can%E2%80%99t-believe-how-much-i-paid-for-this%E2%80%A6/",
        "https://www.youtube.com/watch?v=4ApuK6YAzuM",
        "https://www.youtube.com/watch?v=KKPv2kC-_rQ",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "You've seen a portable projector, you've seen a CRT, but have you seen a portable CRT projector? Okay, portable might be a little generous, but the Vitamagic FP60 from Sony came with its own carrying bag, has a microphone input for projecting your voice, and did I mention there's a built-in Betamax player? No? How about the fact that it uses a single tube to produce a color image, rather than three tubes, like most other CRT projectors? In this episode of Linus Overpays for Ancient Hardware That You've Probably Never Heard Of, we'll be cosplaying as a traveling salesman from the 1980s. I can't wait to play with this thing, just like I can't wait to tell you about our sponsor. Build Redux. Sometimes computers are hard, but all the time, Build Redux is easy. They'll get a custom PC built and delivered directly to your doorstep. Just check them out at the link down below. According to radiomuseum.org, the introductory price for the Vidimagic FP60 was $3,000 US dollars. That's not that bad for a portable projector, except that was in 1984, meaning it would be closer to $9,000 today. That's high enough that just about nobody was going to be buying these for home theater use, but businesses, well, that's another story. And cosmetics giant Avon even went as far as to co-brand the FP60 and deploy it to company representatives across the United States. Hence my world's largest makeup bag here. At 35 pounds, she's more luggable than really portable. But when you compare it to other mid eighties options for boardroom presentations, for example, like what? A CRT on an AV cart or a reel-to-reel projector? The FP60 had major advantages in terms of screen size and in terms of durability and convenience. So we're gonna get to that whole presentation use case, but first, I have a burning question. Can it game? Oh yeah. Fun fact, by the way, the NES wouldn't come out in America for another year. We just felt like being gamers, it would be a great choice for us to evaluate the latency. Not gonna lie, brother. I can see it's on, but... Wow, barely. I mean, is that supposed to be curtains at the top or is that just... There's a reason everyone had blacked out media rooms, right? Okay, we're gonna have to lose some lights. Yeah. Get the lamp. There we go. Yeah, the lamp doesn't do much. No, we need that one. Hold on, I gotcha, I gotcha. It's still horrible! Okay, hold on, I got this one, I got this one. Get the soft box. What? That's the only light we have left and that's all we got? Turn it off. Dude, this is terrible! Well, you know, it's a CRT. Yeah, but-- It didn't get very bright to begin with. Okay, hold on, hold on. That's markedly better. We're getting somewhere. I mean, that's about as far as we're gonna get, but that's not bad. Okay, that lamp's gotta go. That lamp was throwing so much more light than the CRT projector. With that said, looking into this thing, that's about the brightest CRT I've ever seen. Right, that Index Tron. Wow, there's like hairs in there. Oh yeah. It'd probably be fun to try to play with the focus if you want to. Basically, that's the cross. Oh, it's probably slightly out of focus. There's also a manual focus on the very front that you can use. But you shouldn't, don't touch them together or you can break the whole focus system. Yeah, it's definitely still got some blurry spots. Do we have any idea what that is? No, Elijah tried cleaning the lens. So like it's been wiped down. So basically Elijah touched it. Yeah, Elijah touched it. It was bad before he touched it. I'm not blaming him in this scenario. Mm. Maybe some of the phosphors are worn out or something. Or like some of the, 'cause you can see it looks like burn in when you've got it on a single like color here. Oh my God. What? This is perfect. Right? There's no latency. There's none. 'Cause it's a CRT. It's a projector. Yeah. But it's- A CRT. A CRT. Wow! It's like so easy. This is like freaking easy street. And it looks pretty good, eh? Like those blacks actually look pretty black. It's pretty colorful too. Like this is not bad. No, it's not bad at all. I mean, it's not good. But in a dark environment though, this is like totally fine. Pow pow! Pow pow pow pow pow pow! Pow pow pow pow pow pow! Oh no! Wow, you did so well. Let's see you do better. I probably won't. Another thing that's not included with ours is a working speaker, unfortunately. Yeah, it's just not working. And theoretically, we could use our technical manual, service manual to repair it. Or we could just not do that. Oh my god. You're wasting the pow! There's no pow! We don't need it. I thought you were too good. You don't need the pow. Did you die? Yeah. Again? I hit a blue shell while it was flipped over. We've already realized that when it comes to old games, you'll usually win. New games, I don't know. Okay, well that was you dying on purpose. I actually did not. Okay, alright, this is it. For all the marbles. Here we go. Um, it killed me. Yeah. Yeah, they kill you if they're, um, moving. Yeah. This feels too good. I know, right? Like, it feels like you're playing on a CRT. Yeah, because the only additional latency compared to looking directly into a CRT is the speed of light to the screen. That's it. So just the slightly increased, like, distance the light has to travel. Like, this is awesome. The blue, we're getting about 2.2 nits. 2.2 nits! The .2 matters! Let's stop it for now, because I want to talk about brightness. In fairness, most projectors don't get that bright compared to direct-view displays. But this is clearly way behind the experience that Sony showed off in this, by the way, amazing promotional video that was recently re-uploaded by Retro TV Film & Video. And if we look closely, yep, composited, got 'em. Now, it was probably brighter when it was new. CRTs do decay over time, but they show this thing being usable in a literally sunlit room when realistically, it would have needed pitch darkness even then. With that said, how cool would a LAN party have been if someone showed up with one of these bad boys? Oh, it'd be sick with like a giant, even, not even a hundred, 80. 50, 60 inches, that'd be unheard of as a kid. Unheard of. A regular CRT tube TV works by coating the front glass with a phosphor material that lights up when it gets zapped by one of three electron guns. One for red, one for green, and one for blue. With our CRT projector, we're not looking at a lit up phosphor screen. So, what is going on here? it turns out it's surprisingly simple. They're still using a cathode ray tube to generate the image, and we can see that if we look directly down the barrel but it's upside down and backwards so that once it goes through the lens which is basically functioning as a giant magnifying glass it'll be the right way around now i alluded to this before but one of the big innovations for the vidimagic was that most CRT projectors in those days were using three separate tubes and lenses for R, G and B. Kind of like this. They were reliable but they were extremely heavy and inconvenient to set up supposedly it took quite some time to get them all lined up correctly and something as small as a swift kick to the table it was resting on could put the whole thing out of whack again. Another major hurdle they faced was well you could probably guess from what we've seen so far brightness. CRTs by modern standards are pretty dim to begin with and projecting that light across a much larger area exacerbates the issue. How do you fix all that? Okay, the fp60 is no regular CRT, it uses a single electron gun with a beam index tube so to get the right colors from a single gun they would modulate the beam strength then there was a fourth phosphor stripe and when that lit up the result was captured by a photo multiplier tube, and that signal was then amplified and sent to a decoder circuit which would basically check if the colors were correct and then adjust the modulation of the beam on the fly. If you open this thing up the number of boards involved to properly index and to decode the signals is pretty wild. By the way shoutout to 12 volt vids for this amazing footage from his repair video a few years ago that gives us a great look by the way at the water cooling that was built into this projector. Now this design did have drawbacks like inferior contrast, but the benefits were brighter images, no convergence problems and lower sensitivity to magnetic interference, which is why they saw some military use. Sony commercialized a couple of versions of this technology including the index Tron tube Which was used in our fp60 as well as in the highly sought-after KVX 370 watch cube. A super cute four inch bedside TV that came out in 1989. Realistically, nobody was buying this thing for gaming. So why don't we try a movie? This definitely makes these 1980s special effects not look out of place. Yeah. I mean, they look pretty good at this resolution. Yeah. At this brightness. Gotta love those four textures, not 4K, just four. This looks about how I remember watching TV. In the '90s. No. We had more color than that. Ah. The contrast is terrible. Fine, yeah. Terrible. So I guess what we wanna know is how much of what we're looking at is limitations of the Betamax format and/or degradation of the tape, versus how much of it is limitations of the performance of our projector. So do we wanna throw our DVD on? Yeah, let's put our DVD in. I think it's already in the player. Okay. I love how delightfully easy to operate this thing is. Yeah, it's pretty simple. Switches for different modes. Yep. This looks better. I think that other than getting 16 by 9. Which we can actually kind of take advantage of with this projector. That's true. Because the image isn't so small that you are basically just like, \"Well, I gave up 30% of my whole screen.\" I don't think this is a whole ton better though, like a little bit. I think it's a little better. A little bit. Looking into the lens, this is as bright a CRT as I have ever seen. How small does it get to be CRT bright off the projection screen? I'm gonna move it. Okay, move it forward. Careful, this is like 60, 80 pounds worth of stuff. I got you, I got you. Oh yeah, I got it. You're good, you nailed it. Hang on, yeah. Wow, that's still really dim. Okay, more. I think that's as much as it goes. Oh boy. So we can't go any smaller than this. All right, so it's not great for watching movies either, but there were advantages to using a CRT projector, even when LCD and DLP options started hitting the market. Better black levels and better flesh tones. No pixelation, and exceptionally long tube life. Most CRT projectors were rated for around 10,000 hours, while the bulbs in LCD and DLP projectors were only good for one or two thousand. They'd also gotten pretty cheap on the used market by then, so you could go with the used CRT projector and still have money left over to spend on the new Noctua screwdriver from lttstore.com to take it apart when you need to change the tube. By the way guys, we've got a full service manual for this thing and a second projector, let us know in the comments if you want to see Dan try to fix it. With all of that said, these benefits were not enough to keep CRT projectors in fashion. Like their TV set brethren, they were replaced by lighter, brighter models, even if it meant sacrificing a little bit of image quality for, actually, years to come. And the last CRT projector came out in 2001, the Pro 1200X from Zenith. It retailed for about $30,000 and weighed around 155 pounds. By contrast, the high-end Christie Mirage 2000 DLP projector launched in the same year for 55 grand, but weighed almost half of what the Zenith did and was roughly seven times brighter. Modern projectors have obviously gotten a lot better by the way, and we'll have some decent options linked down below. Back to our FP60 though. The only thing we haven't done yet is give a presentation. About our sponsor. Squarespace. Need a website, but don't have the know-how? Squarespace's all-in-one platform makes it easy to design your dream website and get it up and running quickly. You can choose from a wide selection of award-winning templates that are optimized for both desktop and mobile devices, and you can grow your business online through their marketing features, like support for search engine optimization, email campaigns, and social tools. Once you've sold customers on your brand, Squarespace can also help you sell your product. Their commerce platform comes with everything you need from merchandising to checkout. You'll even get analytic insights on your site so that you can see what's working well and what needs a tweak or two. If you need help, Squarespace offers help guides and a 24/7 support team. So don't wait, head to squarespace.com/ltt and get 10% off today. Thanks for watching. If you guys liked this video, make sure to check out our Laserdisc exploration. That was a ton of fun. They really do look like records, except... shiny like a CD. Oh no. We're gonna do VideoDisc next? Okay, I don't know. We'll see.",
    "transcript_keywords": [
        "Pow pow pow",
        "Pow pow",
        "CRT",
        "CRT projector",
        "yeah",
        "Pow",
        "projector",
        "portable CRT projector",
        "thing",
        "projectors",
        "tube",
        "pretty",
        "portable CRT",
        "regular CRT",
        "good",
        "portable projector",
        "portable",
        "Build Redux",
        "CRT tube",
        "CRTs"
    ],
    "transcript_entity_values": [
        "Sony",
        "9,000",
        "35 pounds",
        "one",
        "Retro TV Film & Video",
        "second",
        "four",
        "VideoDisc",
        "first",
        "CRT",
        "LAN",
        "a hundred, 80",
        "Tron",
        "roughly seven",
        "fp60",
        "America",
        "mid eighties",
        "One",
        "9",
        "55",
        "about 2.2",
        "a few years ago",
        "another year",
        "2001",
        "10%",
        "1989",
        "today",
        "16",
        "30%",
        "these 1980s",
        "2.2",
        "about $30,000",
        "Vidimagic",
        "12 volt",
        "those days",
        "around 155 pounds",
        "almost half",
        "a ton",
        "four inch",
        "1984",
        "60 inches",
        "4",
        "$3,000 US dollars",
        "80 pounds",
        "NES",
        "the '90s",
        "CRT tube TV",
        "two thousand",
        "three",
        "Elijah",
        "Build Redux",
        "Zenith",
        "Avon",
        "around 10,000 hours",
        "Squarespace",
        "the same year",
        "DLP",
        "370",
        "Betamax",
        "50",
        "LCD",
        "AV",
        "Linus Overpays",
        "Vitamagic",
        "fourth",
        "Mm",
        "60",
        "the 1980s",
        "Christie Mirage 2000",
        "Dan",
        "two",
        "the United States",
        "Noctua",
        "years"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE"
    ],
    "vector": [
        -0.10394159704446793,
        -0.007727641146630049,
        0.002465942408889532,
        -0.10863058269023895,
        0.09025169909000397,
        0.04673834890127182,
        -0.04526413232088089,
        0.11918257921934128,
        0.010099411942064762,
        -0.010182824917137623,
        0.0024649109691381454,
        -0.019900763407349586,
        -0.00935098621994257,
        0.010965446941554546,
        -0.026211271062493324,
        -0.03209394961595535,
        -0.021624960005283356,
        -0.022582799196243286,
        0.013591499999165535,
        -0.018915930762887,
        -0.010571816004812717,
        -0.030025504529476166,
        0.0043286834843456745,
        -0.02193312905728817,
        0.06527265906333923,
        -0.011412822641432285,
        -0.009665490128099918,
        -0.009374069981276989,
        0.014578384347259998,
        -0.011277292855083942,
        -0.10202929377555847,
        0.11482801288366318,
        0.011160418391227722,
        0.01660209521651268,
        0.01045304536819458,
        -0.061728335916996,
        0.006483238656073809,
        -0.0490475632250309,
        -0.09735055267810822,
        -0.03970244526863098,
        -0.07452137768268585,
        -0.002086876891553402,
        -0.03229851648211479,
        -0.05079686641693115,
        -0.039420317858457565,
        -0.03657502308487892,
        0.09304842352867126,
        -0.05976136028766632,
        0.007154489401727915,
        0.010200557298958302,
        -0.004565896466374397,
        0.002020562067627907,
        0.025684231892228127,
        -0.00788650568574667,
        -0.04165162146091461,
        0.03025144711136818,
        0.013679671101272106,
        -0.03695191442966461,
        0.04324927181005478,
        0.006002493668347597,
        0.020973602309823036,
        -0.024125555530190468,
        -0.012295883148908615,
        0.002442707773298025,
        -0.0001780923194019124,
        -0.06262142211198807,
        0.033937498927116394,
        0.027474062517285347,
        -0.013992585241794586,
        -0.0573994480073452,
        -0.1024533361196518,
        0.019958555698394775,
        0.002903833519667387,
        0.04162978380918503,
        0.02038976363837719,
        0.027163514867424965,
        0.034421052783727646,
        -0.046146467328071594,
        0.04079551622271538,
        -0.007183894515037537,
        0.06886862963438034,
        -0.015720175579190254,
        -0.027980083599686623,
        0.022823380306363106,
        0.0626680850982666,
        0.005755397491157055,
        0.07830211520195007,
        0.06338050961494446,
        0.08123157918453217,
        -0.03612939640879631,
        -0.06495189666748047,
        0.024819599464535713,
        -0.008087786845862865,
        0.0110914446413517,
        -0.04646937549114227,
        -0.05685894563794136,
        -0.05255688726902008,
        -0.046673890203237534,
        0.009198220446705818,
        0.07069488614797592,
        -0.04195084422826767,
        -0.07900630682706833,
        0.03989823907613754,
        -0.06105480715632439,
        -0.122648224234581,
        -0.029388543218374252,
        0.019466763362288475,
        0.16269835829734802,
        -0.020047010853886604,
        -0.01865519769489765,
        -0.08202632516622543,
        0.08415214717388153,
        -0.0588793009519577,
        -0.06951428204774857,
        0.06193755194544792,
        0.025009015575051308,
        -0.10010666400194168,
        0.016550159081816673,
        0.052272018045186996,
        -0.06883907318115234,
        -0.00625437730923295,
        -0.06871329993009567,
        -0.04712527245283127,
        0.0009138904861174524,
        -0.028789911419153214,
        -0.026852687820792198,
        0.008263109251856804,
        5.408260694353244e-33,
        -0.01539663877338171,
        0.08276384323835373,
        -0.013280447572469711,
        0.0005396690685302019,
        -0.059923384338617325,
        0.060996949672698975,
        0.09514938294887543,
        0.10496211796998978,
        -0.005966744851320982,
        -0.0738641545176506,
        0.028048919513821602,
        -0.06345903873443604,
        -0.06614096462726593,
        -0.001218440243974328,
        -0.030603758990764618,
        -0.05808519199490547,
        -0.02086140401661396,
        0.02157997339963913,
        -0.04150458425283432,
        -0.01906946301460266,
        0.005956941284239292,
        0.02073845826089382,
        0.05507558584213257,
        0.01734580285847187,
        0.040181927382946014,
        -0.02107864059507847,
        0.005826979409903288,
        0.015472711995244026,
        0.05845633149147034,
        0.014260003343224525,
        -0.039729222655296326,
        0.07097280025482178,
        0.07586752623319626,
        -0.03595977649092674,
        -0.002280399203300476,
        0.04009814187884331,
        -0.0983918309211731,
        -0.1005726307630539,
        -0.05713598057627678,
        0.02650543488562107,
        0.0662345141172409,
        0.125173419713974,
        -0.07012191414833069,
        -0.05191228538751602,
        0.013197619467973709,
        0.0523291639983654,
        0.03488520532846451,
        0.07930289953947067,
        0.007518549915403128,
        0.02714046649634838,
        -0.040424879640340805,
        0.10368809849023819,
        -0.14967195689678192,
        -0.03943898528814316,
        0.02794765681028366,
        -0.007695813197642565,
        0.0014724001521244645,
        -0.013197259977459908,
        0.022524038329720497,
        0.035744376480579376,
        0.06162211298942566,
        0.011814724653959274,
        0.012262683361768723,
        0.016878074035048485,
        -0.04143122583627701,
        0.056924425065517426,
        0.051257506012916565,
        -0.07004334032535553,
        -0.027065366506576538,
        0.03328760340809822,
        -0.07008083909749985,
        0.011131810024380684,
        -0.014452731236815453,
        -0.09481851756572723,
        0.051971159875392914,
        -0.007856872864067554,
        -0.1314760148525238,
        -0.027017712593078613,
        -0.012330589815974236,
        -0.01076736580580473,
        -0.09493593126535416,
        0.016334233805537224,
        0.08293191343545914,
        -0.036888692528009415,
        0.0546199232339859,
        -0.04732209071516991,
        -0.0012987209483981133,
        -0.03373702988028526,
        -0.031763456761837006,
        -0.022394385188817978,
        0.036328136920928955,
        -0.07401257753372192,
        -0.02421620488166809,
        0.02585563063621521,
        -0.01586577668786049,
        -6.370642327475266e-33,
        -0.009933828376233578,
        -0.027865061536431313,
        -0.0016506529645994306,
        0.015486041083931923,
        0.028194842860102654,
        -0.05802368372678757,
        0.005582150537520647,
        -0.010079510509967804,
        0.024640848860144615,
        -0.051039956510066986,
        0.01590205915272236,
        -0.06676878035068512,
        -0.12506748735904694,
        -0.024211281910538673,
        -0.032830849289894104,
        -0.037800464779138565,
        0.05285763740539551,
        -0.09647167474031448,
        0.022211583331227303,
        -0.01820056326687336,
        0.12862442433834076,
        0.03388338163495064,
        0.06169615685939789,
        0.03495549038052559,
        -0.030292769894003868,
        -0.005442060995846987,
        0.04077286273241043,
        0.01566898077726364,
        0.029139038175344467,
        0.03536250814795494,
        0.022604284808039665,
        -0.04809214547276497,
        -0.02895340882241726,
        0.030811991542577744,
        0.0199588630348444,
        -0.0150216743350029,
        0.08327006548643112,
        -0.009703656658530235,
        -0.012616835534572601,
        -0.03504911810159683,
        0.018271932378411293,
        0.07431811094284058,
        -0.01084399688988924,
        -0.029592692852020264,
        -0.043295830488204956,
        -0.08890262246131897,
        0.023389486595988274,
        -0.0384288989007473,
        0.027225513011217117,
        -0.05680817365646362,
        -0.0037944228388369083,
        -0.02313929982483387,
        0.04378057271242142,
        -0.05237230658531189,
        0.0023896361235529184,
        0.003909044433385134,
        -0.06091739237308502,
        0.033911045640707016,
        0.026282675564289093,
        0.0007839948520995677,
        0.04319844767451286,
        -0.0023290389217436314,
        -0.07901030778884888,
        -0.010306989774107933,
        0.02333715185523033,
        0.02692457102239132,
        0.14135853946208954,
        0.05545560270547867,
        -0.01435620803385973,
        0.02380451001226902,
        0.06857915967702866,
        0.01572602614760399,
        0.041405029594898224,
        -0.021994315087795258,
        0.001420572749339044,
        -0.04287417605519295,
        0.008504671044647694,
        0.024428831413388252,
        0.05721519514918327,
        -0.03760628402233124,
        -0.027012543752789497,
        -0.0452934205532074,
        0.07122281938791275,
        0.05031049996614456,
        0.0444454662501812,
        0.062341202050447464,
        0.051032740622758865,
        -0.04205376282334328,
        0.025080811232328415,
        0.06405225396156311,
        -0.045743465423583984,
        -0.006633780896663666,
        0.0378214456140995,
        0.038712359964847565,
        0.08147141337394714,
        -5.969265259864187e-08,
        0.014817897230386734,
        0.05034828186035156,
        -0.09081904590129852,
        -0.01619006134569645,
        0.030941566452383995,
        -0.14162182807922363,
        -0.039823200553655624,
        0.07538579404354095,
        0.04126887023448944,
        -0.006040798965841532,
        0.00791109073907137,
        -0.04411686584353447,
        0.023903168737888336,
        0.02868306264281273,
        0.01568245142698288,
        -0.05534479394555092,
        -0.003761939238756895,
        0.12520505487918854,
        -0.048952482640743256,
        0.022866906598210335,
        -0.03214722499251366,
        0.012102515436708927,
        0.11998270452022552,
        -0.039489977061748505,
        -0.016516471281647682,
        0.05885150656104088,
        -0.014446907676756382,
        0.04582168161869049,
        0.12146957218647003,
        -0.022982358932495117,
        -0.05745510011911392,
        0.03553282842040062,
        -0.018472786992788315,
        -0.03633170574903488,
        0.04337218031287193,
        -0.04608118161559105,
        -0.05653718113899231,
        -0.013208509422838688,
        -0.007942761294543743,
        0.036816734820604324,
        0.05034548416733742,
        -0.02326839603483677,
        0.010707586072385311,
        0.022286877036094666,
        0.11402349174022675,
        0.051359597593545914,
        -0.06312163919210434,
        -0.0960458368062973,
        -0.0912327766418457,
        -0.046891819685697556,
        -0.00030255611636675894,
        0.09549684822559357,
        -0.08982706815004349,
        0.06185448169708252,
        0.01288270391523838,
        -0.03372975438833237,
        0.046452347189188004,
        -0.018429910764098167,
        -0.07100338488817215,
        -0.0036653915885835886,
        0.017736732959747314,
        -0.07263623923063278,
        -0.010023578070104122,
        0.07371683418750763
    ]
}