{
    "id": "Toa5-1i4wRE",
    "title": "Binary? How does that work?  | Free CCNA 200-301 Course | Video #13",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-08-30T14:30:04Z",
    "video_url": "https://www.youtube.com/watch?v=Toa5-1i4wRE",
    "category": "Science & Technology",
    "tags": [
        "binary",
        "binary options",
        "computer science",
        "decimal",
        "binary to decimal",
        "binary to decimal conversion",
        "computers",
        "numbers",
        "binary decimal",
        "binary numbers",
        "ccna",
        "packet tracer",
        "cisco packet tracer",
        "ccna 200-301",
        "networking",
        "ccna training",
        "cisco ccna",
        "free ccna",
        "ccna study",
        "ccna certification",
        "ccna exam",
        "new ccna",
        "ccna full course",
        "ccna tutorial",
        "ccna 2020",
        "200-301",
        "cisco training",
        "binary option",
        "number system",
        "binary conversion",
        "how to convert decimal to binary",
        "binary converter"
    ],
    "views": 30215,
    "likes": 942,
    "comments_count": 95,
    "description": "How do binary numbers work? How do you convert Decimal numbers to Binary; and Binary numbers to Decimal numbers? Join my Discord here:  Buy the full course here for $10:  Or support the mission, join thisisIT:  Binary Slides:   This is video #13 of my FREE CCNA Course 200-301 - a complete CCNA course for the new Cisco CCNA exam. I am going to be covering all the topics in the exam blueprint in this course.   I want to make this content practical and it will include a lots of labs and demonstrations to help you better understand topics on the exam.  The course will contain: - Videos - Labs using Cisco Packet Tracer - Quiz Questions - And more!  Menu: Binary Joke: 0:00 Analogy 0:35 Computer systems: 1:48 Binary examples: 2:20 Three cables: 4:40 Four cables: 5:22 Binary powers: 6:54 Binary table: 8:34 Decimal to Binary example: 10:26 Thank you to my supporters: 12:10  CCNA 200-301 Playlist:   Support me via thisisIT: support the mission, join thisisIT:   Or, buy the CCNA course and support me: DavidBombal.com: CCNA ($10):  Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   Get Packet Tracer here:   ====================== Special Offers: ====================== Cisco Press: Up to 50% discount Save every day on Cisco Press learning products! Use discount code BOMBAL during checkout to save 35% on print books (plus free shipping in the U.S.), 45% on eBooks, and 50% on video courses and simulator software. Offer expires December 31, 2020. Shop now.  Link: bit.ly/ciscopress50  Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  binary binary numbers CCNA Free CCNA 200-301 ccna 200-301 free ccna course network networking thisisit osi model tcp/ip model  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #binary #decimal #ccna",
    "description_links": [
        "http://discord.davidbombal.com",
        "https://bit.ly/ccnafor10",
        "https://bit.ly/thisisitccna",
        "http://bit.ly/binarypdf1",
        "https://bit.ly/freedbccna",
        "https://bit.ly/thisisitccna",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10",
        "https://www.netacad.com/courses/packet-tracer"
    ],
    "transcript": "- There are only 10 types of people in the world. Those that understand binary and those that don't. How would you read that? Would you read that number as one zero, as in 10, or would you read it as two? If you're not sure what I'm talking about, you don't understand this joke, don't worry. That 10 means two in binary. So the joke is there are only two types of people in the world, those that understand binary and those that don't. If you didn't get the joke, don't worry, by the end of this video, you'll understand this joke and understand where the 10 comes from. As an analogy, to help us understand binary, let's use the analogy of electricity. Because computers, let's be honest, they have chips in them. Routers and switches have specific types of chips known as ASICs or Application Specific Integrated Circuits. It's basically a circuit. So computers have circuits and they run on electricity. In electricity, we either have two states, something is on, as in this current or power to the device, or it's off. So as an analogy, notice that bigger light there, that's an old antique lamp, but I've put a huge bowl in that lamp. So that's on. That's off, no power. On, there's power. That's off, no power. That's on, on means current is applied. Off means current is removed. So a computer basically only has two states, current or no current on a circuit. That however, let me turn that back on again. That however, gives us two states. So one cable gives us two states. So remember this, all computers function by using a system of switches that can either be on or off. Off equals zero, on equals one. Our binary values are either zero or one. So once again, our analogy, that's one, that's zero. One, zero. I won't bore you too much doing that. The moral of the story is, make sure you understand that binary consists of two states or two values, zero or one. That becomes really important now, as we scale this analogy. Here we have a cable, it's turned off, no current is flowing, binary value is zero. I'll turn that on. So current is now flowing, binary value is one. We have two states, either current or no current, two binary values, zero or one. So one cable, two states, either current or no current. If we extend that now and we've got two cables, binary value is currently 00. There's no current on either cable. If I put current on the one, binary value is now 01. Change that current on the left, no current on the right, binary value is now 10. Turn them both on, we've got current on two cables, binary value is now 11. So we either have no current on both binary value 00 or 01, or 10, and lastly, 11. We have two states, either on or off, we have two cables, two to the power of two is four. At the moment, current is applied, the bulb is on, that indicates one. I can turn that off, that indicates zero. That's how a computer can send information to another computer. Or that's how programs are written. We might write a program in a high level programming language like Python, but as it goes down, we end up doing assembly language. We end up writing zeros and ones to tell the computer what it needs to do. Now the important lesson here, is we have two states, either on or off. If we have one cable, we have two states, on, off on one cable. But if we've got two cables, we end up having four states. We've either got 00, no current on both cables, or 01, or 10, or 11, current on both cables. So two states, two cables means that we end up having four values. You can write that as two times two equals four, or two to the power of two equals four. Two states, two cables equals four. Now I don't wanna spend too much time on this analogy, but let's assume we've got three cables. In this example, we have three cables, we've got two states, current state is off. So the binary value is 000. Once again, and I won't go through all the combinations, we could have 001, or as an example 101 or 111. So we have two states either on or off. We have three cables. So two times two times two is eight, or two to the power of three is eight. There are eight different combinations or options here. Now, I won't bore you extending that too much, but we could do something very similar. You tell me, what binary value do we have here if we've got four cables? On (indistinct), 0111. How many combinations do we have? We have two states, four cables, two times two times two times two equals 16, or two to the power of four equals 16. 16 different combinations. In this example, they are all on. We have two states, four cables, 16 combinations. So we've either got no current on the first cable, no current on the second, none on the third, none on the fourth. Or as an example, no current, no current, no current, current. Or no current, no current, current, no current. And if we go through all the possible combinations, we're gonna end up having 16 binary values. So two states, as shown over here, four cables, means two to the power of four, 16 possible combinations. Again, two states, four cables, gives us 16. If we've got two states and we've got five cables, that would give us 32. Or if we have two states and six cables, that gives us 64 combinations. Now, you could manually work this out, you could manually go through every combination, but we're not gonna do that. But if you wanted to test this and verify that I'm talking the truth, then you could do that. So just to summarize, if we've got two states and one cable, two to the power of one is two. So two possible combinations. If we've got two states and two cables, that gives us four combinations, or four possible states. Two to the three is eight, two to the four is 16. Now this is one that causes confusion. In decimal, we don't start at one, we start at zero. And then we count zero, one, two, three. Ignoring negative numbers, obviously, but let's assume positive integer numbers, we start at zero, and then we count up. Now in binary, we've got two to the power of zero. So two to no cables as an analogy equals one. So we don't start with one cable, we start with zero cables. Now this is once again, just an analogy. So if the analogy doesn't work too well for you, then just stick with the math. Just work with the math or maths if you prefer. So, what I need you to remember, is two to the power of zero is one. Two to the power of one is two. Two to the power of two is four. Two to the power of three is eight. Two to the power of four is 16. And if we continue, two to the power of five is 32. Two to the power of six is 64. Two to the power of seven is 128. Two to the power of eight is 256. But in an IP version four address, we've got what's called an octet, which is eight binary values. So we've got eight values, but we start counting at zero. So we've got zero, one, two, three, four, five, six, seven. And let's formalize that by showing you a really important table. Now, if you're ever gonna learn a table, then this is the table that I suggest that you learn. It's really important for the CCNA exam. Make sure that you know this table before you go and take your exam. Notice we have at the top here, two to the power of zero. Two to the power of one. Two to the power of two. Two to the power of three, four, five, six and seven. Notice we counting from zero to seven, but that's one, two, three, four, five, six, seven, eight. If we set this value to one in binary, in decimal that equates to one. If we set this value to one in binary, it equates to two. This value equates to four. This equates to eight, this to 16, this to 32, this to 64, this to 128. Remember that two to the power of seven is 128. And these are seven. Two to the power of six equals 64. Or if you like two to the power of two equals four. So when this part is set on, it means four in decimal. Now, in the real world, you're gonna use a calculator, but you need to understand the basics before you use calculators. So we're gonna do a lot of this manually first. So in this table, we have what's called the base exponent. So we've got, starting on the right hand side, two to the power of zero. Two to the power of one. Two to the power of two. Two to the power of three, four, five, six and seven. And then we've got a binary equivalent. So if we set this to binary one, then the decimal equivalent is 128. If I set this to binary one, decimal equivalent is two. So to help you understand that, let's do an example. Let's say I gave you a number of 255. 255, if we take the decimal equivalent is equal to 128. In other words, this part is set on. 64, in other words, this part is set on. 32, 16, eight, four, two and one. In other words, if I add 128 plus 64 plus 32 plus 16 plus eight plus four plus two plus one, I get 255 in decimal. That is represented as this in binary. So in binary, eight binary ones equates to 255 because this equals binary one. This equals 128 in decimal. But to prove this, let's use a calculator. Here's the calculator on my Mac. If I type 255, notice in binary, that's eight binary ones. That's not very clear. So let me use a windows calculator. So here's my windows calculator. I'm gonna specify binary, one, two, three, four, five, six, seven, eight. Notice the windows calculator puts a gap between the four binary values. Makes it easier to read, but in a IP address, there is no gap like that, but I often write it that way just to make it easier to read. Notice the value is 255 in decimal, but in binary, it's eight binary ones. Now we'll talk about hexadecimal later. That's FF in hexadecimal. But 255 in decimal equates to eight binary ones. We both deserve it all",
    "transcript_keywords": [
        "binary",
        "power",
        "current",
        "states",
        "cables",
        "equals",
        "cable",
        "understand",
        "decimal",
        "combinations",
        "analogy",
        "understand binary",
        "set",
        "read",
        "times",
        "end",
        "start",
        "calculator",
        "notice",
        "equates"
    ],
    "transcript_entity_values": [
        "first",
        "six",
        "zeros",
        "01",
        "three",
        "255",
        "only two",
        "32",
        "000",
        "001",
        "only 10",
        "seven",
        "third",
        "11",
        "five",
        "One",
        "two",
        "four",
        "64",
        "256",
        "eight",
        "zero",
        "second",
        "ASICs",
        "16 plus eight",
        "16",
        "IP",
        "00 or 01",
        "Python",
        "Mac",
        "101",
        "32",
        "one",
        "Application Specific Integrated Circuits",
        "11",
        "FF",
        "CCNA",
        "Two",
        "five",
        "64",
        "eight",
        "111",
        "fourth",
        "0111",
        "16",
        "10",
        "128"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        0.01517435535788536,
        0.01773262768983841,
        -0.051763489842414856,
        -0.04610203951597214,
        -0.059671130031347275,
        -0.04161076620221138,
        0.005184978246688843,
        0.027216169983148575,
        -0.09103656560182571,
        0.02583284117281437,
        -0.04773383587598801,
        -0.10362740606069565,
        0.04230877757072449,
        0.0067212763242423534,
        -0.017017146572470665,
        0.011141292750835419,
        -0.03881686180830002,
        -0.0041022831574082375,
        0.007638768758624792,
        0.033130306750535965,
        0.03852356597781181,
        -0.03870275244116783,
        -0.040307335555553436,
        -0.0010154659394174814,
        -0.06956019252538681,
        0.01674630492925644,
        -0.018215512856841087,
        -0.03131154179573059,
        -0.015516365878283978,
        -0.08376596868038177,
        -0.055238332599401474,
        0.0636497437953949,
        0.09179814159870148,
        0.03436829149723053,
        0.01586594618856907,
        -0.003582159522920847,
        0.09832647442817688,
        -0.03246934711933136,
        -0.05488311126828194,
        0.05544153228402138,
        -0.028270069509744644,
        -0.03651398420333862,
        0.03815056011080742,
        0.011175905354321003,
        -0.0017061562975868583,
        -0.03021114505827427,
        0.00014991048374213278,
        0.018164122477173805,
        0.012864501215517521,
        -0.02392958104610443,
        -0.041693441569805145,
        0.037685688585042953,
        -0.025522883981466293,
        0.049417946487665176,
        -0.03778469190001488,
        0.013833628036081791,
        -0.0039977990090847015,
        -0.009232321754097939,
        0.018833182752132416,
        -0.03850644454360008,
        -0.056000154465436935,
        -0.015874449163675308,
        -0.042122982442379,
        -0.010934699326753616,
        0.029819542542099953,
        -0.014224865473806858,
        -0.05087033659219742,
        -0.006711392197757959,
        0.06659458577632904,
        -0.03505745902657509,
        -0.0332212969660759,
        -0.0662192702293396,
        -0.002108304761350155,
        0.061387065798044205,
        -0.014369693584740162,
        -0.0064608328975737095,
        0.054325323551893234,
        0.011511614546179771,
        -0.023485807701945305,
        0.029010001569986343,
        -0.037728216499090195,
        -0.006934986915439367,
        0.0855633094906807,
        0.01563633419573307,
        0.04035266488790512,
        0.029444264248013496,
        0.058701999485492706,
        0.057054053992033005,
        -0.09147375077009201,
        -0.017207100987434387,
        -0.030453534796833992,
        0.02061063051223755,
        0.02839566580951214,
        0.029585910961031914,
        0.09418274462223053,
        -0.02126431278884411,
        0.06579592078924179,
        -0.052080169320106506,
        0.02631833404302597,
        0.06779827177524567,
        0.0619916096329689,
        -0.00496312603354454,
        -0.04770105332136154,
        -0.0575837567448616,
        -0.06858883798122406,
        -0.010895511135458946,
        0.03941170126199722,
        0.05644996464252472,
        0.023314345628023148,
        -0.046028874814510345,
        0.005508296191692352,
        0.04421483725309372,
        -0.0703568160533905,
        -0.11257251352071762,
        0.03835359960794449,
        0.006921575870364904,
        -0.04633541777729988,
        0.06020402908325195,
        0.03608213737607002,
        0.01720375567674637,
        -0.01107051782310009,
        0.00888932216912508,
        -0.023752486333251,
        0.029852841049432755,
        0.023912448436021805,
        -0.05479669198393822,
        0.02454204671084881,
        6.176795962184979e-33,
        -0.0901426300406456,
        -0.021760400384664536,
        -0.02809011936187744,
        0.036423344165086746,
        0.055727019906044006,
        -0.0028093731962144375,
        -0.009784819558262825,
        0.12225081771612167,
        -0.05670304223895073,
        0.03436637297272682,
        0.0018261873628944159,
        0.030631989240646362,
        0.042353399097919464,
        0.08505233377218246,
        0.002977547701448202,
        -0.05132328346371651,
        -0.02710004709661007,
        -0.021747203543782234,
        0.028891010209918022,
        -0.036411769688129425,
        -0.03729476034641266,
        0.0295484010130167,
        0.05513651296496391,
        0.01638212986290455,
        0.11116622388362885,
        0.052283983677625656,
        -0.0026296579744666815,
        -0.04675399884581566,
        0.08527948707342148,
        0.00851498730480671,
        -0.059583667665719986,
        -0.012643045745790005,
        -0.03401954844594002,
        -0.033177051693201065,
        0.014756720513105392,
        0.02691209316253662,
        0.041060708463191986,
        -0.0273323692381382,
        -0.026315348222851753,
        -0.022717610001564026,
        0.013217787258327007,
        -0.013698785565793514,
        -0.005339160095900297,
        -0.05424545332789421,
        -0.032507602125406265,
        0.0023109447211027145,
        0.09421789646148682,
        0.015662580728530884,
        -0.0035660029388964176,
        -0.027634870260953903,
        0.02593056485056877,
        0.06786041706800461,
        -0.04164623096585274,
        -0.060493193566799164,
        0.00036922391154803336,
        -0.07304227352142334,
        0.07754934579133987,
        -0.009546028450131416,
        -0.031020650640130043,
        0.0845363587141037,
        0.05258085951209068,
        0.07176262140274048,
        0.03859333693981171,
        0.020181352272629738,
        -0.07588253170251846,
        0.05831184610724449,
        -0.06819872558116913,
        -0.04875016212463379,
        0.040652062743902206,
        0.0015145250363275409,
        -0.18728430569171906,
        0.05132006108760834,
        0.05578916519880295,
        -0.025427483022212982,
        0.017127472907304764,
        0.043514151126146317,
        -0.025869881734251976,
        -0.11208468675613403,
        0.013766784220933914,
        0.0005838614306412637,
        0.018220778554677963,
        -0.03985150530934334,
        0.032183267176151276,
        -0.03761240467429161,
        -0.03948753699660301,
        0.02204183302819729,
        0.041034162044525146,
        -0.10609966516494751,
        -0.06466811150312424,
        -0.04966549575328827,
        0.06752103567123413,
        -0.058051589876413345,
        -0.01220100000500679,
        0.0397057868540287,
        0.027822345495224,
        -8.134607517418423e-33,
        -0.005891398526728153,
        0.034691162407398224,
        -0.087685726583004,
        0.029830122366547585,
        -0.05820088088512421,
        -0.03576396778225899,
        0.04711988940834999,
        -0.09946054965257645,
        0.06087464466691017,
        0.002508331323042512,
        0.012391723692417145,
        0.02863895893096924,
        -0.022806795313954353,
        -0.018455155193805695,
        -0.053365521132946014,
        -0.0715123787522316,
        -0.09777986258268356,
        0.02842320129275322,
        -0.0068275947123765945,
        -0.0027505892794579268,
        0.043289508670568466,
        0.13968101143836975,
        -0.06063529849052429,
        -0.0886794924736023,
        0.003432698082178831,
        0.07036799937486649,
        0.045890145003795624,
        0.0019190380116924644,
        0.18480999767780304,
        0.028861461207270622,
        -0.030412087216973305,
        -0.022974474355578423,
        0.060547489672899246,
        -0.045749686658382416,
        -0.011622311547398567,
        0.017593247815966606,
        0.05249228700995445,
        0.06931989639997482,
        0.018385864794254303,
        -0.04866534471511841,
        0.03320801258087158,
        -0.014868750236928463,
        -0.0365532748401165,
        -0.03962790220975876,
        0.045637693256139755,
        0.0572037398815155,
        0.0009387034806422889,
        0.041012637317180634,
        -0.04501015320420265,
        0.01378739532083273,
        0.0587313137948513,
        0.038238249719142914,
        -0.0245504230260849,
        -0.012789104133844376,
        0.0056089842692017555,
        -0.0002889357565436512,
        -0.14343954622745514,
        0.03515385836362839,
        0.05891711264848709,
        -0.008232874795794487,
        -0.0483124740421772,
        -0.046750105917453766,
        0.07642386108636856,
        -0.016633277758955956,
        0.022539982572197914,
        -0.03717765584588051,
        -0.06521835923194885,
        -0.06664308905601501,
        -0.06108389049768448,
        0.041389524936676025,
        -0.07201658934354782,
        0.052231524139642715,
        0.033191390335559845,
        -0.04781132936477661,
        -0.003905044635757804,
        -0.048516515642404556,
        -0.030139418318867683,
        -0.036712270230054855,
        -0.04263652116060257,
        0.03038248047232628,
        -0.027531076222658157,
        0.05890744552016258,
        0.037109363824129105,
        0.048017848283052444,
        -0.030631760135293007,
        0.04463627189397812,
        0.10951545834541321,
        0.07937658578157425,
        -0.009402632713317871,
        0.0672655776143074,
        -0.024173414334654808,
        0.07010535150766373,
        0.04957093298435211,
        -4.9634327297098935e-05,
        -0.024929234758019447,
        -5.8647202649808605e-08,
        0.01205867063254118,
        -0.016357483342289925,
        -0.07276352494955063,
        -0.021804269403219223,
        0.0019485189113765955,
        0.0709417462348938,
        -0.06370614469051361,
        -0.05590209737420082,
        0.02027873694896698,
        -0.014370731078088284,
        0.01854657381772995,
        0.013530652970075607,
        -0.042923059314489365,
        0.004007707349956036,
        0.034831348806619644,
        0.08426792919635773,
        0.035930853337049484,
        -0.10265302658081055,
        0.0009069288498722017,
        -0.04291779175400734,
        -0.03411656245589256,
        -0.011379729025065899,
        -0.024801306426525116,
        0.057837117463350296,
        -0.07366181910037994,
        0.030085284262895584,
        -0.020199624821543694,
        0.14968235790729523,
        -0.011655173264443874,
        -0.03973255306482315,
        -0.010523805394768715,
        -0.013662666082382202,
        -0.02786719612777233,
        0.009627677500247955,
        -0.005252103786915541,
        0.003524351865053177,
        -0.06637659668922424,
        0.06699627637863159,
        0.0992521420121193,
        -0.02989228442311287,
        -0.06416298449039459,
        -0.1390504688024521,
        -0.1221388503909111,
        0.01429144386202097,
        -0.031416017562150955,
        -0.07954824715852737,
        -0.13455034792423248,
        0.024048885330557823,
        -0.07125885784626007,
        0.01842491142451763,
        -0.00471715210005641,
        0.03063393011689186,
        -0.058632295578718185,
        -0.005132783204317093,
        0.05164084956049919,
        0.055837757885456085,
        -0.08269982039928436,
        -0.08173699676990509,
        -0.07888702303171158,
        0.14083081483840942,
        0.005076754372566938,
        0.00036766091943718493,
        -0.05462717264890671,
        -0.05827248468995094
    ]
}