{
    "id": "TOyazdH2b-U",
    "title": "How To Waste $507.69 on Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-04-01T16:57:39Z",
    "video_url": "https://www.youtube.com/watch?v=TOyazdH2b-U",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "how to waste",
        "how to waste on amazon",
        "roboraptor",
        "cat ear headphones",
        "ariana grande headphones",
        "headphones",
        "laptop",
        "asus",
        "vivobook w202",
        "vivobook",
        "ken",
        "amazon",
        "tech",
        "unboxing",
        "mystery box",
        "shoes",
        "toys",
        "april fools",
        "wasting money on amazon",
        "this is",
        "austin evans"
    ],
    "views": 2517863,
    "likes": 58829,
    "comments_count": 2703,
    "description": "That's it. Ken has officially gone too far in his final episode of Mystery Tech. The Ariana Grande Cat Ear headphones on Amazon:  The embarrassing little cousin of Roboraptor on Amazon:  RGB shoes on Amazon:  Water RESISTANT Asus VivoBook W202-NA laptop on Amazon:  Use this coloring book to fire Ken on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/ariheadphones",
        "http://austin.tech/dumbraptor",
        "http://austin.tech/rgbshoes",
        "http://austin.tech/vivobookw202",
        "http://austin.tech/yourefired",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey what's going on guys? This is Ken. What? (flute music) Jesus Christ, okay. Um, well, this is very clearly a special episode of Mystery Tech. It is the April Fools' edition, so that means that mister boss man over here is the one that's manning the camera. So if the shot's out of focus, like his thumb was, blame him not me. I brought some knickknacks to - [Austin] That's how Mystery Tech works. - I brought my own knickknacks to make myself a little more home and comfortable while these guys try to ruin my life. Got myself a hat, also I got a, gotta prep the desk. - [Matt] Is that your daughter? - Got a second one, there we go. - [Austin] Oh my god, dude, dude, dude. - There we go. Cool, we're good now. What? Oh! What? Oh! (laughs) Wow you guys could not be any more on point. Actually this was already a Mystery Tech for Austin. So these are Ariana Grande themed cat ear headphones. I didn't even know that she made themed ones. Let's see here. Oh wow, okay. Think I'm gonna move you a bit. I've actually seen these a lot at conventions and always wondered who buys this crap. And why, but I guess I know now. Oh wow! That's actually pretty cool. I mean I can hide the fact that I'm an Ariana Grande fan by just turning off the lights, no one will ever see. Okay, so lemme guess, did you spend like 150 dollars on these? - [Austin] 180. - 180? - [Austin] I can waste money too. - Yeah, well it's funnier when I waste your money, not when you waste your money (laughs) Feels like you gypped yourself. That's pretty much as I would expect it. It sounds muddy as hell, there's like no treble at all, kind of a little bass heavy. These do have a speaker function, right? I wanna blast these. Oh wow. (upbeat music) What's this? Ahhh! Ahhhhhh! You guys got Roboraptor a son? Come here, okay. - [Matt] That looks like if Roboraptor and Thicc Thanos had a baby. - Thicc Thanos. Gotta show it now, because I pointed it out. (quiet roaring) There's like no life in this, it's a robot. Roboraptor is an actual living being. There we go. (quiet roaring) We're two items in and I'm still disappointed. Okay, whatta we got here? Oh! Yes, wait. Okay now you're just being really cheap. We did a Palm Pixi video, what was it, like two and a half years ago, three years ago, or something like that? And we ended up with two of these, and we were like, yeah. We're gonna do a giveaway. We just forgot about it and now it's a Mystery Tech. So I guess technically I won a giveaway, maybe. - [Austin] This is a new Palm Pixi, I totally forgot about that last thing. - You bought another one, why? (laughs) Well, look, I like the Palm Pixi. Oh my god, not enough to care about the unboxing experience. So this was running Palm OS, so it had some weird Gestures thing to navigate the phone. So I guess, let's open up a couple of apps and just have multitasking going. It's actually kind of cool, like, just like with the iPhone X and newer, when you swipe up from the bottom, you have your multitasking screen. This predates that by like 10 years, I mean shout out to Apple for stealing technology I guess. Does it actually have a connection? Let's find out. - [Austin] Yeah, I'm just gonna stop, it's not gonna work. The reason is, this is before SIM cards, this is the old network, so it has embedded SIMs. That's why the date is correct, 'cause it's actually on the network. - Oh! - [Austin] There's no service. - But it does work for 911 though, right? - [Austin] You're committing a felony on camera, right? Wait, that's illegal. As he accidentally hits send. - You made me look. (laughs) Yeah, let me go to YouTube and see what works. Or maybe it just won't. - Well we definitely won't find it in the most viewed section, would we? - [All] (laughing) - [Austin] Also, for the record, we had 35 minutes, and we made it through two products. - (laughing) Great! Alright, you know, this phone actually belongs in the garbage, 'cause nothing works on it. So we can move on now. She's like three feet tall, it's like she's like an actual child. (crowd awws) - Whoa! - [Austin] You still have a knife in your hand? (laughs) - I don't know what this is. But we will find out. I know what that is. - [Matt] For the record, this is my contribution. - Matt, I love you. Did I ever tell you that? - [Matt] I know! - He got me some kicks, man. I mean, they're not of any real name brand or anything, but I'm not shallow or bitter about it. I will say, it's got some really suspicious-looking bomb parts, which... - [Austin] What, what is this? - Bomb parts. Oh, these are to charge. Okay that makes way more sense. So to turn on, locate switch inside of the hem of the shoe. So it's this thing. Oh look at that. They light up. But they have like the Yeezy bottom, which is, that's a look, I guess. Let me put these on. These are actually surprisingly comfortable, not gonna lie. Ehh! Also, don't turn 'em on yet. (energetic music) Oh, they do change colors, look at that! Oh, whoa! Matt, are you epileptic? Come over here, I need to try these out. If I had to guess, these shoes right here, 20 bucks. - [Austin] No. - Okay, 30. - [Austin] 33. - 33? That's not bad, 'cause Yeezys cost like 220 bucks, and these light up, the real ones don't. I mean. - [Austin] Take that, Kanye. - So, what else we got? Oh no. Oh boy! Austin's finally taking me seriously. Here we go. I better take this a little more. Okay, we're good now. So this is the ASUS VivoBook W202N. It's a very, very unnecessarily confusing name for something like this. What's in here? - [Austin] Just hold on, hold on figure it out later. - I was trying to make it serious. - [Matt Yeah that was your first mistake. - So, yeah, looks like a pretty standard laptop. Nothing super crazy. Is this a Chromebook? No? This looks like their Chromebook, this looks like the one that we destroyed a couple months ago. Like, the one with the rubber corners. - [Austin] You're getting warmer. - Is this a waterproof laptop? - [Austin] Ding ding ding! - Oh, see I know our content. What do you want me to spill on it today? This video is sponsored by Intel. Right? No? - Okay, well that's a shame. This is actually interesting, I mean, I don't know how much this is and I'm gonna guess you're gonna tell me in a second, but I mean the trackpad's not bad, obviously it could be better. But at the price, you can't really complain. How much is this thing? - That's not terrible though, right? Like, all things considered? - [Austin] You pay an extra 50 bucks for the waterproofing and the durable design. - Yeah, which, I mean I don't know who's actually buying these, but I'm gonna guess probably schools. I mean with this rugged design you're probably gonna give this to a kid, and if they say, I don't know, like, oops I dropped it, it's gonna to be totally fine. Ooh, that's cool, the screen goes flat. I can't see anything from here, the viewing angles are garbage. (Thomas the Tank Engine and Biggie Smalls remix) Let's pour some water on this. This feels so weird, this feels so weird. - [Matt] Doo it. - What the hell was that voice? My towel system is working. No! Stay. Oh no! Oh, that's bad. Oh, there's a bunch of electrical cords there, oh no. (laughs) - [Austin] (laughing) You're paralyzed with fear. No, nobody needs more, that's not what we need is more now. The screen is not waterproof, the screen is not waterproof. - (laughs) It's not? Why? - [Austin] Did you do your research? - What? You gave me this thing, I don't know anything about it. - [Austin] Okay no stop, stop! That's enough, that's enough. That's not waterproof. It's not. - Oh god, oh. Okay, here. - [Matt] Why are you drying off the knife? There's totally power outlets that are wet right now. - Should I dry that off too? - [Austin and Matt] Yes! - Okay. - No, this! - [Matt] Dry paper towel! - [Austin] Unplug it, what are you doing? - [Ken] Oh, yeah, okay. - Oh, it stopped working literally as I tapped it. - [Austin] Well yeah, 'cause you poured a whole bottle of water on it. Wait, flip it upside down. - [Matt] There's like a giant puddle. - [Austin] So you killed a laptop and you almost killed yourself. Most importantly, you almost killed Matt. - That's okay, expendable. It's fine. - Okay, Austin has one more item. Let me put this laptop, or what was a laptop, out of the way. Let's see. You got me an art set? Crayola art, wait, what really? They have a signature brand. Oh that's nice, that's thoughtful of you. What else, what else we got? - You're fired. - Oh, that's a way, that's a way to tell me. (light applause) (melancholy piano music)",
    "transcript_keywords": [
        "Mystery Tech",
        "guess",
        "Mystery Tech works",
        "Palm Pixi",
        "Yeah",
        "Mystery",
        "Tech",
        "Palm",
        "Ariana Grande",
        "thing",
        "guys",
        "Wow",
        "wait",
        "Pixi",
        "Cool",
        "screen",
        "waterproof",
        "Thicc Thanos",
        "April Fools' edition",
        "Roboraptor"
    ],
    "transcript_entity_values": [
        "Jesus Christ",
        "35 minutes",
        "like 150 dollars",
        "Ding ding ding",
        "Matt]",
        "220 bucks",
        "20 bucks",
        "Palm OS",
        "Roboraptor",
        "30",
        "33",
        "Yeezys",
        "first",
        "Crayola",
        "Kanye",
        "two and a half years ago",
        "Ken",
        "Austin",
        "ASUS",
        "two",
        "Apple",
        "Matt",
        "three feet",
        "an extra 50 bucks",
        "Austin",
        "one",
        "YouTube",
        "second",
        "three years ago",
        "the Palm Pixi",
        "911",
        "Thomas the Tank Engine",
        "10 years",
        "Intel",
        "Chromebook",
        "Ariana Grande",
        "Palm Pixi",
        "180",
        "Mystery Tech",
        "Biggie Smalls",
        "Thicc Thanos",
        "today",
        "a couple months ago"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "MONEY",
        "PERSON",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE"
    ],
    "vector": [
        -0.08484377712011337,
        0.00610797805711627,
        0.08455359190702438,
        -0.04944250360131264,
        0.0926283523440361,
        -0.02069639042019844,
        0.1521117389202118,
        -0.014376522041857243,
        0.023876287043094635,
        -0.030067427083849907,
        -0.010563299991190434,
        0.0010748003842309117,
        0.06619029492139816,
        -0.054114654660224915,
        -0.08440771698951721,
        -0.06974849104881287,
        0.0020104104187339544,
        -0.026895564049482346,
        -0.10129114240407944,
        0.032989680767059326,
        0.026678187772631645,
        -0.01867854967713356,
        0.0504172258079052,
        9.304322156822309e-05,
        -0.04202321544289589,
        0.10378693044185638,
        0.04771604761481285,
        -0.1399695724248886,
        -0.108645960688591,
        -0.07522772252559662,
        -0.014038949273526669,
        0.03832612186670303,
        -0.03379883989691734,
        -0.07023823261260986,
        -0.003937252331525087,
        -0.0865693911910057,
        -0.015485456213355064,
        0.06523812562227249,
        -0.02177516371011734,
        0.018259551376104355,
        -0.03204619511961937,
        -0.056356512010097504,
        -0.02271074242889881,
        0.010703938081860542,
        -0.02644370310008526,
        -0.012466219253838062,
        0.032718658447265625,
        -0.07387107610702515,
        0.08093710243701935,
        -0.009597943164408207,
        -0.06108817830681801,
        -0.037514712661504745,
        0.03781303018331528,
        -0.017795074731111526,
        0.014664312824606895,
        -0.027252057567238808,
        0.01591281034052372,
        0.029188105836510658,
        0.07645002007484436,
        0.028438596054911613,
        0.09150303900241852,
        -0.07933660596609116,
        -0.03280455246567726,
        0.05024496465921402,
        0.07736735790967941,
        -0.01860949955880642,
        -0.011605803854763508,
        -0.011524055153131485,
        0.03728027269244194,
        -0.0183345265686512,
        0.03816459700465202,
        0.06441885977983475,
        0.07829556614160538,
        0.052784159779548645,
        0.07107627391815186,
        0.027608437463641167,
        0.05735013633966446,
        -0.0681072473526001,
        0.020464088767766953,
        0.035938769578933716,
        -0.03399384394288063,
        -0.09896624088287354,
        -0.009952832013368607,
        -0.005387720186263323,
        0.02395407296717167,
        0.044800881296396255,
        0.023107625544071198,
        -0.004180614836513996,
        -0.016679614782333374,
        -0.011549830436706543,
        -0.04093090817332268,
        -0.0485801137983799,
        0.03295126184821129,
        -0.019750190898776054,
        0.031376637518405914,
        -0.02989557571709156,
        -0.02939177118241787,
        0.00043741121771745384,
        -0.03512312099337578,
        0.08762646466493607,
        0.061013106256723404,
        -0.018517574295401573,
        0.025514589622616768,
        -0.08358626067638397,
        0.05478627607226372,
        -0.07369539886713028,
        -0.039063960313797,
        0.004350260831415653,
        0.05288146808743477,
        0.00826104823499918,
        0.009024301543831825,
        -0.027107352390885353,
        -0.008171988651156425,
        0.023125236853957176,
        0.028572598472237587,
        0.052315279841423035,
        -0.026677856221795082,
        0.02668880484998226,
        0.03742830082774162,
        -0.033928342163562775,
        0.07553672790527344,
        0.02963908575475216,
        -0.060237739235162735,
        0.05324443057179451,
        0.04524649307131767,
        0.007231749594211578,
        -0.014551443047821522,
        4.993702775068594e-33,
        0.03028101474046707,
        0.07743439078330994,
        -0.01659947820007801,
        -0.09159544855356216,
        0.06766242533922195,
        -0.10044699907302856,
        -0.06967867165803909,
        0.03569012135267258,
        -0.005770742893218994,
        0.05063547194004059,
        -0.04275187849998474,
        0.06801243871450424,
        -0.12432517856359482,
        -0.025998873636126518,
        -0.04704762622714043,
        0.0014598973793908954,
        -0.08151016384363174,
        0.0016618422232568264,
        -0.020689794793725014,
        0.02181566320359707,
        0.06271965801715851,
        0.007891732268035412,
        0.004769022576510906,
        -0.003612214233726263,
        -0.0322161465883255,
        0.03145649656653404,
        -0.024037837982177734,
        0.021470926702022552,
        0.06344014406204224,
        0.03302548825740814,
        -0.1324676275253296,
        0.02793353796005249,
        0.03879467770457268,
        -0.00465310038998723,
        -0.11629865318536758,
        -0.05154268071055412,
        -0.02174363285303116,
        -0.07690834254026413,
        0.010782654397189617,
        -0.00037390695069916546,
        -0.06741717457771301,
        0.035512473434209824,
        -0.06661973148584366,
        -0.008907070383429527,
        -0.020772935822606087,
        0.024897253140807152,
        0.0651308074593544,
        0.09328751266002655,
        0.0011339576449245214,
        0.044942185282707214,
        -0.015106245875358582,
        -0.008194993250072002,
        0.06427864730358124,
        -0.04696586728096008,
        -0.022010117769241333,
        0.0011051951441913843,
        0.02087893709540367,
        -0.08823403716087341,
        0.1225443184375763,
        0.07426158338785172,
        0.13100706040859222,
        0.06669727712869644,
        0.0944913923740387,
        0.02019822783768177,
        -0.05472516641020775,
        -0.011404912918806076,
        0.06098208948969841,
        0.04076892137527466,
        0.024761589244008064,
        -0.02035370282828808,
        -0.07076728343963623,
        0.036130111664533615,
        0.021281307563185692,
        -0.062116075307130814,
        0.017697500064969063,
        -0.020090967416763306,
        -0.07429412752389908,
        -0.005117968190461397,
        -0.05599263310432434,
        -0.01272820495069027,
        0.006992440205067396,
        -0.014949341304600239,
        -0.001287212478928268,
        0.0365133211016655,
        -0.04925595596432686,
        0.025252386927604675,
        0.02950587496161461,
        -0.0631941482424736,
        -0.07377774268388748,
        0.039200443774461746,
        -0.02079915814101696,
        0.0006494980189017951,
        -0.08605008572340012,
        -0.065531425178051,
        -0.007831653580069542,
        -6.346262574639212e-33,
        0.010722802951931953,
        -0.06317060440778732,
        -0.02871790900826454,
        0.07374008744955063,
        0.01437706220895052,
        0.008708400651812553,
        0.022004036232829094,
        0.05084271728992462,
        0.02803463116288185,
        -0.028793787583708763,
        -0.01971699856221676,
        0.03581630066037178,
        -0.030819255858659744,
        -0.0407218262553215,
        -0.023280832916498184,
        -0.08474242687225342,
        -0.004349017050117254,
        0.04173211753368378,
        -0.0393659882247448,
        -0.05635605379939079,
        0.009862524457275867,
        0.03160109743475914,
        -0.04070108011364937,
        0.016945911571383476,
        -0.016193203628063202,
        0.04700571671128273,
        0.030560094863176346,
        0.05856950953602791,
        -0.07961534708738327,
        0.0129436319693923,
        -0.009373120032250881,
        0.019826676696538925,
        -0.028279844671487808,
        0.004581177607178688,
        -0.006734425667673349,
        0.01647697389125824,
        0.00813678465783596,
        -0.03455499932169914,
        -0.03128533437848091,
        -0.06470461934804916,
        0.04551263153553009,
        0.04061279818415642,
        -0.011531953699886799,
        -0.01606716774404049,
        -0.026536347344517708,
        -0.09346482902765274,
        -0.041834354400634766,
        0.025370638817548752,
        0.038351502269506454,
        -0.014054127037525177,
        0.051368776708841324,
        -0.03844572603702545,
        0.00590586056932807,
        -0.0462673045694828,
        -0.07599001377820969,
        0.07245606184005737,
        0.000353286653989926,
        0.024500632658600807,
        0.07980552315711975,
        0.07230118662118912,
        -0.04927941784262657,
        -0.054113034158945084,
        -0.057965368032455444,
        -0.011170734651386738,
        -0.0679694190621376,
        0.03594963625073433,
        0.0708237960934639,
        0.037436388432979584,
        0.03874894231557846,
        0.03135450929403305,
        0.021579373627901077,
        0.04622180014848709,
        0.030756445601582527,
        -0.09258951246738434,
        0.017132200300693512,
        0.10280489921569824,
        -0.023696502670645714,
        -0.0312354639172554,
        -0.06012057512998581,
        -0.04595399647951126,
        0.047914862632751465,
        -0.04544059559702873,
        0.07147526741027832,
        0.042729828506708145,
        0.06224919110536575,
        0.09735305607318878,
        0.0016411625547334552,
        0.01596873253583908,
        -0.09974689781665802,
        0.047091782093048096,
        -0.014583943411707878,
        0.0044431122951209545,
        -0.016362231224775314,
        0.07569138705730438,
        0.02687898278236389,
        -7.377856547918782e-08,
        -0.0019901518244296312,
        0.09219741076231003,
        -0.010063963942229748,
        -0.023513365536928177,
        0.10230110585689545,
        -0.048982761800289154,
        -0.022562462836503983,
        0.039944179356098175,
        -0.025972943753004074,
        -0.02052435837686062,
        0.05031508207321167,
        -0.07251626253128052,
        0.022307945415377617,
        0.06035257503390312,
        0.06163354963064194,
        0.05366502329707146,
        0.004169933497905731,
        0.050343107432127,
        -0.09350486099720001,
        -0.053142379969358444,
        -0.01430448703467846,
        -0.0048323567025363445,
        0.020415905863046646,
        -0.09327210485935211,
        0.047458406537771225,
        0.02765241079032421,
        0.009954521432518959,
        0.1043381616473198,
        0.07503210753202438,
        0.022511865943670273,
        -0.03757575526833534,
        -0.03755272179841995,
        -0.11823967844247818,
        -0.030579375103116035,
        0.016976581886410713,
        -0.07948774844408035,
        -0.050592340528964996,
        0.02361944131553173,
        0.019300399348139763,
        -0.002882991684600711,
        -0.09447402507066727,
        -0.10748576372861862,
        -0.008290059864521027,
        0.02445496991276741,
        -0.0782528817653656,
        -0.08004996925592422,
        0.002205292694270611,
        -0.0779300183057785,
        -0.03198826313018799,
        0.04627573490142822,
        0.00901840254664421,
        -0.026455027982592583,
        -0.008500841446220875,
        0.036603592336177826,
        0.08819323033094406,
        -0.012273071333765984,
        -0.005614893045276403,
        0.01889922097325325,
        -0.12163018435239792,
        0.045848701149225235,
        0.02015778236091137,
        -0.018266117200255394,
        -0.04208063334226608,
        0.032828185707330704
    ]
}