{
    "id": "tQpANfiaU-s",
    "title": "Cool Tech You'll Actually Want!",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2023-11-23T16:37:27Z",
    "video_url": "https://www.youtube.com/watch?v=tQpANfiaU-s",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "gift guide",
        "geek gifts",
        "Black Friday",
        "geek",
        "computer deals",
        "tech deals",
        "gifts",
        "cyber Monday",
        "holiday",
        "christmas",
        "shopping",
        "tech gifts",
        "kitchen tech",
        "engineer",
        "roborock",
        "usb-c",
        "robot vacuum",
        "tech",
        "time capsule",
        "apple",
        "wera",
        "tools",
        "knipex",
        "pepper mill",
        "multimeter",
        "oscilloscope",
        "playdate",
        "play date console",
        "magsafe",
        "moft",
        "wrench",
        "questyle",
        "hifi",
        "headphones",
        "power station",
        "flipslide",
        "edc",
        "flashlight",
        "gear",
        "rovyvon aurora a8",
        "kwumsy k3",
        "mech keys",
        "mechanical keyboard"
    ],
    "views": 815487,
    "likes": 30035,
    "comments_count": 756,
    "description": "These are the holiday gifts and gadgets you'll actually want this year! Shop Roborock Black Friday deals (ends 11/30)! -   *Links preceded with \"\" are affiliated and Snazzy Labs may earn a commission:*  Kwumsy K3 keyboard/display/dock -   RovyVon Aurora A8 flashlight -   Flipslide game -   ISDT 200X power station -   Questyle M15 DAC/amp -   711L mini wrench w/ bit handle -   711L mini wrench w/ Leatherman handle -   Moft MagSafe tripod stand -  Pinecil soldering iron (official site/price) -   Pinecil soldering iron (more $, but faster) -  Apple Time Capsule - look on Facebook Marketplace, eBay, and more!  2TB SSD for Time Capsule -   Dreamfarm Garject (Prime shipped) -  Dreamfarm Garject (direct, cheaper) -   WERA Kraftform Turbo screwdriver -   WERA Kraftform Turbo screwdriver (with bits) -  Nomad Slim 35W/65W GaN chargers -  Playdate game console -   Pokit Pro multimeter/oscilloscope/logger -   Pokit Meter (cheaper, but similar features) -   Unicorn Magnum 9\" pepper mill -   Unicorn Magnum 6\" pepper mill -   Unicorn Tablestick s/p mills -   KNIPEX Cobra XS pliers -   Follow Snazzy Labs on Twitter -  Follow me on Instagram -   It's the holiday season yet again. All too many gift guides are filled to the brim with sponsored crap and/or product that everybody already knows about. In this video, we discuss nearly 20 products that are affordable, high quality, cool, and genuinely fun that you can ask Santa for (or get for others as Santa!). From portable game consoles, to DIY gear like soldering equipment and tools, to goofy accessories for your iPhone, Mac, and more, this video's got it all for Black Friday, Cyber Monday, Christmas, and more!  0:00 Actually good gifts! 0:16 A keyboard, screen, laptop dock, and more! 1:41 A tiny but mighty multifunction flashlight! 2:42 Bop-It! Well, kinda... 3:15 Roborock Dyad Pro (sponsored) 4:26 Roborock S8 Pro Ultra (sponsored) 6:06 The best, most CHUNGUS USB charger 7:25 Insanely small HiFi DAC/amp 8:12 Itty bitty wrench-y 8:55 The only tolerable MagSafe accessory 9:33 The definitive starter soldering iron 10:48 The only useful $30 Apple product 12:19 The only Mrs. Snazzy approved gadget 13:13 The most over-engineered screwdriver ever 14:08 A GaN travel charger without compromise 14:45 I wish I didn't LOVE this thing 16:53 A multimeter, oscilloscope, and loggerall-in-one! 18:33 AN ABSOLUTELY SPICY HOG! 19:30 Pliers for... ants?! 20:40 Buy all, some, or none of thisidc",
    "description_links": [
        "https://amzn.to/3utCfIs",
        "https://snazzy.fm/rh",
        "https://snazzy.fm/xd",
        "https://snazzy.fm/ZJ",
        "https://snazzy.fm/pt",
        "https://snazzy.fm/xO",
        "https://snazzy.fm/tL",
        "https://snazzy.fm/MX",
        "https://snazzy.fm/xG",
        "https://snazzy.fm/PX",
        "https://snazzy.fm/iT",
        "https://snazzy.fm/ix",
        "https://snazzy.fm/Rw",
        "https://snazzy.fm/Ox",
        "https://snazzy.fm/HT",
        "https://snazzy.fm/oS",
        "https://snazzy.fm/SE",
        "https://snazzy.fm/aa",
        "https://snazzy.fm/QF",
        "https://snazzy.fm/RU",
        "https://snazzy.fm/yr",
        "https://snazzy.fm/Qn",
        "https://snazzy.fm/Pk",
        "https://snazzy.fm/xz",
        "http://twitter.com/snazzylabs",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "Another year, another gift guidewithout the expensive, sponsored crap you'll see everywhere else. Gather round for legitimately cool gadgets you probably haven't heard ofsome of my favorites, and some of yours too. Oh, and save for one product, none of these are sponsored. I hate the multi-monitor lifestyle, but I do find myself wanting to place a static window on a smaller displaywith the hilariously named Kwumsy K3, I can! This thing is an RGB mechanical keyboard, laptop I/O hub, SSD enclosure, and 13\" touchscreenall in one. Supply it power, data, and video from your laptop or desktop and you're off to the races. You've got access to the fairly bandwith-limited but still capable 5Gbps throughput for other USB devices, SD cards, and even an M.2-sized SSD. The keyboard is nice with surprisingly fancy double-shot PBT caps and less fancy generic yellow MX-style switches. That said, the switches are solderless so you can use the included tool to pop them right out and substitute your preferred combo. Neato. The screen is 1920x720 and has a luminance of 300 nits. Its not fantasticviewing angles are less than superbbut when angled right, looks better than the specs may suggest and having the ability to use it at any angle makes it the perfect 10-point multitouch sketch pad for Windows, a suitable social feed for macOS, and even a cyberdeck console for Raspberry Pi. All of us carry a flashlight around with us every day, but a smartphone is a pretty lousy onethis is the Aurora A8. It's a teeny-tiny LED flashlight that brightens to an insane 650 lumens. Don't know how bright that is? Well, here's an iPhone 15 Pro, and here's this little flashlight. Yeah, not only does the single button toggle through brightness settings, but it also has a UV light onboard to inspect currency and sketchy hotel rooms, it has a red light great for use when dark without losing night vision, it can flash if you have it attached to a backpack to alert cars of your presence, and it has a flood light to illuminate an area like a tent. It runs for hours on its internal battery, charges via USB-C, and comes with a clip, keyring, and magnetic base to attach to basically anything. It's amazing. If you're a 90s kid that grew up on Bop-It like I did, you'll love Flipslide. This cheap puzzle game has you flip and slide colored tiles to match those displayed on-screen. What sounds simple gets really intense with a variety of game modes from a simon-says-style mode to level mode which gives you increasingly less time as you progress and even multiplayer mode that had my wife and I laughing hysterically. It's perfect to play alone or with friends and priced the way it is, it's impossible to say no to. Get it. You should also get the Dyad Pro and S8 Pro Ultra from today's sponsor, Roborock. You may recall Roborock sponsored last year's gift guideI personally sought them out to sponsor again this year because I love their products so much. The Dyad Pro is a cordless wet-dry vacuum that handles basically anything you can throw at it. Multiple brush rollers underneath the device wet and scrub your floor free of sticky, stainy grime within 1mm of walls and the powerful 17,000 pascal motor sucks up all of the wasteboth wet and dry. The onboard DirTech smart sensor analyzes grime concentration on the rollers and adjusts water flow and suction accordingly to handle all tasks. Most wet-dry vacs are more hassle than they're worth, but not the Dyad Pro because upon returning it to its dock it self-cleans and hot-air dries the entire system making it ready day after day, week after week. There's even an onboard cleaning concentrate dispenser for scrubbing with surfactants, so you really only have to add clean waterand empty the dirty tankwhen you feel like it. And the only thing better than a gadget that lessens work is one that removes it entirelythat's where the Roborock S8 Pro Ultra comes in. This vacuum is exceptional at its primary jobpicking up debristhanks to its dual-roller brush design and class-leading 6,000 pascal suction. This thing will get hair, crumbs, food, and morefrom both hardwood and carpet. When the latter is detected, suction is boosted and the mop is raised so as to not touch rug and carpet fibers. Oh yeah, this thing mops too with its VibraRise system that scrubs the floor pretty aggressively removing a surprising amount of floor grime. When its finished its task, the bot returns to its all-in-one dock that empties the dust bin, washes the mop pad, hot-air dries said pad and station to avoid mildew, refills the on-board water tank, and charges the bot for its next journey. It's a great vacuum and mop, but the reason I've continued to use Roborock vacuums exclusively on the main floor of my home the past 4 years is the excellent, class-leading app and navigation system. Not only is it easy to issue commands and set schedules, but most importantly, my S8 Pro Ultra has vacuumed for nearly 200 hours since I got it earlier this year, and in the past month, it hasn't failed a route even once. It almost never gets stuck avoiding any obstacles placed before it, requires essentially zero maintenance, and keeps my floor clean for weeks before I have to think about lifting a finger. It's seriously one of the best tech gadgets I've ever ownedperiod. I love it and know you will toobe sure to check out the S8 Pro Ultra and Dyad Pro while their Black Friday deals are ongoing using the links below. ISDT is a brand known to anyone that pilots drones or RC cars as they make some of the best LiPo battery chargers on the market. What I didn't know until recently is that they also make an absolute chungus 200W USB charger. This thing has 3 type-C PD ports that can deliver 65/65/and a highly unusual, but amazing 140Wmaxing out even the 16\" M3 Max MacBook Pro under full load while fast charging. Furthermore, the lone USB-A port supports up to 24W with support for all protocols like Qualcomm QuickCharge. A handsome LCD display reads out the wattage being pushed to each device including to the wireless charging pad which uses an MFi-certified MagSafe puck that pushes the full 15W of wireless power the iPhone is capable of. Given that making chargers is literally ISDT's bread-and-butter, I was unsurprised but pleased to see quiet active cooling and overheat protection triggers. Theres even an appif you want such a thingand it comes with 2 high-quality 240W-capable Type-C cables. For the price theyre asking, its a steal. Wired headphones are back in amongst the youth, I hear, and the Questyle M15 is a must-have HiFi accessory for any wired headphones-listener. It's a USB-C powered DAC and headphone amp in an insanely tiny package. In years past, this small size would suggest lousy amplification capabilities, but no... this thing is nuts: it can power my super inefficient Audeze LCD-3 just as well as larger headphone amps I've seen in the sub-$300 price range. Sound quality is fantastic, there's insanely low noise floor to boot, it works with iOS and macOS, supports lossless audio of course, and is just... awesomely tiny. Moving to tiny things my wife loves... this micro ratchet wrenchI love it too! This thing is just 2\" longlike my pinkie. Any 1/4\" bit slips inside and can be ratcheted both left and right. It's so small, it can basically be used as a screwdriver and in instances where you just don't have clearance, well, stick the 1/4 bit in the opposite end and now you've got a stubby screwdriver. I've been keeping this with some bits in an Altoids tin in my backpack and it's fabulously handy. I don't like things on my phone so when Moft's tripod stand was suggested to me by Joel, I knew I'd hate it. Well folks, I knew wrongthis thing is sweet. It snaps onto the back of your phone and unfolds in a cascading origami structure. You can set it up in a variety of different ways making it useful for vlogging, for video calls when using Continuity Camera, when watching movies, as a tripod for group photos and more. It's light, way thinner than you'd think given its capabilities, and I love iteven if the price is a bit tough to swallow. Last year I mentioned Omnifixo, the perfect helping-hands companion for soldering. Many asked what iron I'd recommend for those new to soldering but I didn't have an answerat least not until I ordered a Pinecil earlier this year. This $26 soldering iron is incredible and punches way above its price tag. For starters, its entirely open-source and runs a risc-five CPU. Why on earth would you need this? Well, it gives you precise temperature control on the OLED display between 100 and 450 degrees celsius, it can reach said temperature in just 6 seconds, and automatically enters standby as soon as the on-board accelerometer stops detecting motion. You can use Pinecil's shorty-tips or any standardized TS-100 tip to get more precisiondependent on your soldering application, and while you've seen me using it thus far with a DC barrel jack, the Pinecil even supports USB-C PD! This thing is amazing and blows the door off of any other sub-$75 soldering iron. For literally 26 bucks. Buying one is basically legal theft. Ya know, not every gift has to be new and if you're running a Mac without a versioned or restorable backup, shame on youespecially since you can get an old Apple Time Capsule on eBay for less than $30. I got mine for $20 with a dead hard drive, and I was able to easily swap out the cheapo stock drive with a 2TB SATA SSD I bought from Amazon for $70. It's amazing how cheap SSDs have become. Now, the Time Capsule when released acted as a router and WiFi access point but I don't want either of those enabled because this thing is old... So, to make this a NAS, we're going to use an Ethernet cable from our router or switch and plug it into the WAN port on the Time Capsule. Then, we open AirPort Utility on our Mac or iPhone, select our Time Capsule, go to Wireless and turn it off. Then, we go into the network tab and set it to off or bridge mode so it doesn't try to create its own subnet and give us double NAT issues. We can still use the Time Capsule as a switch for other devices, but more importantly, we can now setup Time Machine and have all Macs on our network create versioned backups. We can even use it as a shared file or media server. I'm taking this 2TB all-flash NAS homeI mean, for less than $100, how could I say no? Meghan is better with a kitchen knife than I am so she naturally hates single-use kitchen gadgets and when she saw I got the Dreamfarm Garject, she rolled her eyes; but then, I used it, and she said \"okay, that's actually really sick.\" Take a garlic clove, or multiplepapery peels and alland load it into the Garject. Then, close the handle and see the garlic pressed through the holes with ease to a minced consistencyjust like a regular garlic press. But now watch... upon opening the handles back up, the built-in scraper flicks all of the gooey garlic into your dish. Then, hitting the eject button removes the paper from the press and its ready for the dishwasher. It's a brilliantly quick way to get through the stickiest, stinkiest part of your meal prep. Trust in the Germans to over-engineer the simplest hand-tool ever madethe screwdriverwith the WERA Kraftform Turbo. In its standard state, it's just a screwdriver with a really sloppy shaft, but press the button at the back of the screwdriver, and you'll enable turbo modea purely mechanical gear train that turns one rotation of the hand into 4 rotations of the shank. You can do this two handed or single-handed, but the end result is a lot less twisting while getting screws in and out a lot faster. Personally, I find this more effective than a ratcheting driver when I've got a lot of screws to burn through, though it doesn't have a ton of torque, so for tightening or loosening past a few pound feet, you'll want to push the button to re-enable standard driver mode. It's absurdly unnecessary and I love it. I travel light and while I love the tiny 30W bricks that exist nowadays, they scratch the heck out of everything in my bag, so I've defaulted to Nomad's Slim lineup of gallium nitride chargers. They've got a single-port 35W and two-port 65W modelboth tiny and lightweight, but more importantly, flat. Not only does this help avoid the scratchy-scratchy, but it also pushes the weight of the charger inwards so it doesn't droop or fall out from loose, worn hotel outlets. I've owned my Playdate for a year-and-a-half, and they're now just finally finishing their pre-order shipments to the point where you can buy one and actually get it soon. It's a cute, little, yellow game console with a one-bit transflective LCDthere's no backlight hereso it's best viewed in the sun. I've never owned a literal one-bit screen before but I love it. Seeing the art style choices required to create the perception of \"white and black\" is super beautiful. In addition to USB-C, on-board WiFi, a rather decent speaker, and face buttons, it has a crankwhich is silly but a fun mechanic in several of games that use it. So here's the thing... Playdate is very expensive at $199. Now, much of that cost goes towards software because it does include 24 games that are unlocked once per week, every week, for 12 weeks; and, nearly all of the games are built by famous devs. Many of them are amazing, a few are just fine, some are long and several are short. Even taking the included games library into account, $200 is still nuts. My brain and wallet commands me to hate thing, but I just can't. It's absolutely whimsical, the games are innovative, it's superb for quick 3-minute game sessions, and it's so tiny you can take it with you everywhere. The community behind it is passionate and there's an enormous catalog of really great additional games that have been released for cheap and even oftentimes freethrough both the Playdate Catalog store and Itch.io. It's the antithesis of cutting edge to the point of being obnoxiously hipster, but I don't careit's so much fun, I adore it, and have for the nearly 2 years I've owned it. I love my Fluke 115 multimeterit has saved me from getting electrocuted a bunch of times. But for $225, it doesn't really DO that much. The Australian-developed Pokit Pro on the other hand, very much does. It's a tiny little multimeter pen that uses a smartphone as a display screen. If this sounds dumb to you, I agree, but here's the thing... it's not just a multimeter. It's also an oscilloscope and data logger. And this isn't just a dumb-bum oscilloscope eitheryou can use functions to check frequency, RMS, period, average, duty, and more. You can even establish triggers to choose when and how a signal is captured. With wireless multi-channel support through a single app, you're off to the races for multiple-probe support and the built-in data logger is also sweet... you can take electrical or even temperature measurements using the onboard thermistor or and external NTC probe over an extended period of timeup to 6 monthsall logged on-device and synced to the mobile app at a later date. You can now even setup range testing wherein you can establish measurement thresholds to quickly and easily identify passing spec by LED color and buzzer without needing to use a phone or display at all. If Pokit Pro is a bit pricey for you, most of the features are available on the even smaller Pokit Meter that you can get for less than $100. I don't think anything in this price comes even close to feature-set or sizeand it more than makes up for having to awkwardly use a phone to see the data. If your significant other told you they bought a 9\" Unicorn Magnum Plus, what would you believe that to be? If you guessed a pepper mill, wow, you're weirdbut also, correct. The market is being flooded with nonsense $150+ salt and pepper mills made from machined aluminum and lemme tell you what: they suck compared to this ugly, plastic USA-made treasure. Compare the Magnum to my cheap but dependable OXO radial grinder or bougie Cole and Mason mill, and it disgraces their very existence. The Magnum can crack out a teaspoon of pepper with just 6 rotations. It makes so much pepper that it almost makes too much pepper. There isn't much in the way of fine granular control, but it doesn't matter because you can't expect to tame 9\" hog. The Magnum sprays its love everywhere and you'd be lucky to own one. Seriously... they're almost always sold out. When I first saw the Kinipex Cobra xtra-small pliers, I thought they were joke pliers. Like... seriously... these are tiny. What on earth could they be useful for? Dude... so many things. Despite being a mere 4\", there are 11 adjustment positions that open past 1 and 1/8ths inchor... 28mm if you're scared of fractions and freedom. Now, the shorter handles don't give you insane leverage, but you get more than you need for most applications and the crazy number of adjustment positions in addition to the long jaw-tip length lets them often pull double-duty as an adjustable wrench. While you lack cutters, the pipe grips are sharp as all get out and bite into anything. These are Germanand we already established they don't mess around. I think the perfect gift is something that's just pricey enough you probably wouldn't buy it on your own volition but something you'd use all the time if receivedat $30, these weirdo little pliers are that. End of story. And end of videoif you enjoyed this, please do give it a like. If you wanna pick something up, use the links in the description to send a small affiliate kick-back to Snazzy Labs if you don't mindif you do mind and don't want to, that's okay too. I'm just grateful we were able to hang outthanks for watching, and stay snazzy.",
    "transcript_keywords": [
        "Dyad Pro",
        "Pro Ultra",
        "Pro",
        "Time Capsule",
        "thing",
        "love",
        "time",
        "Pokit Pro",
        "Australiandeveloped Pokit Pro",
        "tiny",
        "onboard",
        "Apple Time Capsule",
        "year",
        "games",
        "Capsule",
        "floor",
        "sponsored crap",
        "Dyad",
        "Roborock",
        "Ultra"
    ],
    "transcript_entity_values": [
        "Cole",
        "WAN",
        "the past month",
        "Fluke",
        "Meghan",
        "OXO",
        "90s",
        "a few pound feet",
        "Kinipex Cobra xtra-",
        "two",
        "MX",
        "Dyad Pro",
        "3",
        "28mm",
        "Snazzy Labs",
        "2",
        "ISDT",
        "Black Friday",
        "450 degrees celsius",
        "Pinecil",
        "Apple Time Capsule",
        "jack",
        "less than $30",
        "less than $100",
        "Unicorn Magnum Plus",
        "one",
        "26",
        "USA",
        "MagSafe",
        "15W",
        "Raspberry Pi",
        "the Roborock S8 Pro Ultra",
        "LCDthere",
        "macOS",
        "5Gbps",
        "pascal motor",
        "Altoids",
        "just 6 seconds",
        "13",
        "Pinecil",
        "Joel",
        "6,000",
        "Mason",
        "RGB",
        "Germanand",
        "1mm",
        "weeks",
        "a later date",
        "TB SATA SSD",
        "1/8ths",
        "Mac",
        "Last year",
        "M3",
        "Another year",
        "225",
        "nearly 200 hours",
        "11",
        "650 lumens",
        "Moft",
        "Flipslide",
        "the Dreamfarm Garject",
        "Pokit Meter",
        "first",
        "4",
        "30",
        "16",
        "Qualcomm",
        "Macs",
        "USB",
        "zero",
        "NAT",
        "$150+",
        "30W",
        "every day",
        "1920x720",
        "9",
        "1",
        "the Time Capsule",
        "HiFi",
        "24",
        "the past 4 years",
        "Audeze",
        "Time Capsule",
        "between 100",
        "the S8 Pro Ultra",
        "VibraRise",
        "300",
        "today",
        "the Aurora A8",
        "Germans",
        "CPU",
        "200",
        "1/4",
        "Windows",
        "the nearly 2 years",
        "10",
        "12 weeks",
        "RC",
        "Garject",
        "Magnum",
        "DC",
        "iPhone",
        "Nomad",
        "hours",
        "a ton",
        "years past",
        "26 bucks",
        "TB",
        "NTC",
        "70",
        "DirTech",
        "3-minute",
        "Wireless",
        "Continuity Camera",
        "every week",
        "Pokit Pro",
        "Kwumsy K3",
        "eBay",
        "35W",
        "Australian",
        "Roborock",
        "6",
        "17,000",
        "Omnifixo",
        "Mac",
        "199",
        "LCD",
        "NAS",
        "Slim",
        "a pepper mill",
        "Time Machine",
        "the Questyle M15",
        "SD",
        "earlier this year",
        "this year",
        "240W",
        "the Time Capsule",
        "Amazon",
        "USB-C PD",
        "last year's",
        "USB-C",
        "65W",
        "24W",
        "S8 Pro Ultra",
        "20"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "FAC",
        "DATE",
        "LANGUAGE",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "NORP",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY"
    ],
    "vector": [
        -0.11437349021434784,
        -0.015851479023694992,
        0.01460349466651678,
        -0.004159067757427692,
        -0.022999830543994904,
        -0.02672603167593479,
        0.03824060037732124,
        0.018261702731251717,
        -0.08339053392410278,
        0.03674802556633949,
        0.028392821550369263,
        0.00031137975747697055,
        0.003913955297321081,
        0.022120384499430656,
        -0.0025168312713503838,
        -0.010441958904266357,
        0.022951709106564522,
        -0.0043218196369707584,
        0.053827058523893356,
        -0.032094232738018036,
        -0.0328960083425045,
        -0.0023850740399211645,
        0.06453386694192886,
        0.03288578987121582,
        0.01931699365377426,
        0.09141882508993149,
        -0.023848583921790123,
        -0.035704124718904495,
        -0.06631921231746674,
        -0.031094104051589966,
        -0.058588411659002304,
        -0.019594009965658188,
        -0.030996428802609444,
        -0.017600396648049355,
        0.009857578203082085,
        -0.001777058932930231,
        0.062491290271282196,
        0.010196101851761341,
        -0.01631723903119564,
        -0.030556518584489822,
        -0.08664406836032867,
        -0.09658244252204895,
        -0.019681626930832863,
        0.029201941564679146,
        0.032235320657491684,
        -0.010837504640221596,
        0.10972636193037033,
        -0.06477990001440048,
        -0.0028507851529866457,
        0.09292957186698914,
        -0.02602565847337246,
        -0.1249985620379448,
        -0.03127240389585495,
        0.011677117086946964,
        0.014780486933887005,
        0.01645246148109436,
        -0.029211590066552162,
        -0.041178613901138306,
        0.056873664259910583,
        -0.06148689612746239,
        0.018134906888008118,
        -0.09994983673095703,
        -0.06670982390642166,
        0.0129680335521698,
        -0.021586740389466286,
        0.0025606921408325434,
        -0.0028616427443921566,
        -0.008721272461116314,
        0.0001723943860270083,
        -0.046663183718919754,
        -0.00017921807011589408,
        0.0030596270225942135,
        -0.0028128342237323523,
        0.07746909558773041,
        -0.020019225776195526,
        0.016652626916766167,
        0.1340116262435913,
        -0.06821226328611374,
        0.04836608096957207,
        0.03914330527186394,
        -0.036611080169677734,
        -0.0001893065928015858,
        -0.04973423853516579,
        0.013832411728799343,
        -0.00992828793823719,
        0.04521099850535393,
        0.01850089617073536,
        0.09236206114292145,
        -0.02239493653178215,
        -0.03593488037586212,
        -0.015506738796830177,
        0.024163560941815376,
        -0.01667427085340023,
        -0.04526294395327568,
        -0.05133131146430969,
        -0.04488253593444824,
        0.00023572274949401617,
        0.018433284014463425,
        -0.06387439370155334,
        0.013325603678822517,
        0.015220754779875278,
        0.025296684354543686,
        0.07362042367458344,
        -0.0950683206319809,
        -0.04390599951148033,
        -0.028606342151761055,
        -0.09015362709760666,
        0.00820416584610939,
        0.07501243054866791,
        0.04815558344125748,
        -0.058815691620111465,
        -0.0056436131708323956,
        -0.11104801297187805,
        -0.009906436316668987,
        0.0026983025018125772,
        -0.014030270278453827,
        -0.01370601262897253,
        0.059560369700193405,
        0.07050033658742905,
        0.02127930521965027,
        0.05245298147201538,
        0.050890520215034485,
        0.006593366153538227,
        -0.005609054584056139,
        0.022668898105621338,
        0.023530345410108566,
        -0.00039200560422614217,
        8.716574199359398e-33,
        0.020637821406126022,
        0.06603264808654785,
        -0.058018919080495834,
        0.017542604357004166,
        0.031276293098926544,
        0.04796825349330902,
        0.03454837575554848,
        0.03791872784495354,
        -0.023622946813702583,
        0.10410943627357483,
        -0.048982053995132446,
        0.12842072546482086,
        -0.08753662556409836,
        0.09399959444999695,
        0.028311895206570625,
        -0.11959780007600784,
        0.03509340435266495,
        -0.030095819383859634,
        0.059071846306324005,
        -0.031463321298360825,
        -0.058440275490283966,
        0.0021752112079411745,
        -0.017993422225117683,
        0.1131257489323616,
        0.05061065033078194,
        -0.009848807007074356,
        0.013730640523135662,
        -0.0024801772087812424,
        0.05913393199443817,
        -0.003053039778023958,
        -0.04913225769996643,
        0.020334698259830475,
        0.005385929252952337,
        -0.05241987109184265,
        -0.051319558173418045,
        -0.06224675104022026,
        -0.086107037961483,
        -0.1040799543261528,
        0.018536759540438652,
        -0.026032421737909317,
        -0.024262597784399986,
        0.040720343589782715,
        -0.06273306161165237,
        -0.011588801629841328,
        0.05122438818216324,
        -0.021674029529094696,
        0.0013824478955939412,
        0.09030318260192871,
        0.04538217931985855,
        0.011916658841073513,
        -0.12267811596393585,
        0.006488648243248463,
        0.040274713188409805,
        0.024346286430954933,
        -0.052800994366407394,
        -0.025716861709952354,
        0.030857060104608536,
        0.0023149552289396524,
        0.06762786954641342,
        0.09140583127737045,
        -0.0390671081840992,
        0.08729203045368195,
        0.03832358866930008,
        -0.021308107301592827,
        -0.07413897663354874,
        0.03355177119374275,
        0.05614401772618294,
        0.02014297805726528,
        -0.06859994679689407,
        0.01926281489431858,
        0.008873882703483105,
        0.0034889273811131716,
        0.07090245932340622,
        -0.04563228040933609,
        0.014851181767880917,
        0.03972460702061653,
        0.01816587895154953,
        -0.06226596608757973,
        -0.029546067118644714,
        -0.0952148586511612,
        -0.04766596481204033,
        -0.011372150853276253,
        0.039020437747240067,
        0.04236188158392906,
        -0.013675306923687458,
        0.023189686238765717,
        0.022462651133537292,
        -0.003874341258779168,
        -0.004117507953196764,
        -0.08965687453746796,
        -0.05410449951887131,
        -0.026989644393324852,
        -0.03242196515202522,
        -0.0007492303266189992,
        -0.029247762635350227,
        -8.557832503488479e-33,
        0.036313578486442566,
        -0.07915674149990082,
        -0.011631867848336697,
        0.09105769544839859,
        0.04398522153496742,
        0.0137577960267663,
        0.011439248919487,
        -0.07785272598266602,
        0.03722545504570007,
        0.00019151724700350314,
        0.012245537713170052,
        0.025514263659715652,
        0.00957704521715641,
        -0.02387821674346924,
        0.018123753368854523,
        0.004872060380876064,
        -0.06134030967950821,
        -0.0404338613152504,
        0.0971885621547699,
        -0.05838227644562721,
        0.03913724794983864,
        0.13247716426849365,
        -0.037549179047346115,
        0.00012982761836610734,
        0.015147082507610321,
        -0.014315616339445114,
        0.0052871196530759335,
        -0.028754061087965965,
        0.02805706299841404,
        0.06381087750196457,
        -0.018415315076708794,
        -0.07446067780256271,
        0.0940496101975441,
        0.02243170328438282,
        0.02810928411781788,
        -0.028766877949237823,
        0.09312279522418976,
        0.019737830385565758,
        0.07027558982372284,
        0.0035401075147092342,
        0.08493497967720032,
        -0.0003638892085291445,
        0.05035284161567688,
        0.05615779384970665,
        -0.03962605819106102,
        -0.012326686643064022,
        -0.08836685121059418,
        -0.014326821081340313,
        0.052037082612514496,
        0.027828600257635117,
        0.012328124605119228,
        -0.007215674500912428,
        -0.017113178968429565,
        -0.02552141062915325,
        -0.041800692677497864,
        -0.02986031025648117,
        -0.026812123134732246,
        -0.03273523598909378,
        -0.005242571234703064,
        -0.01608847640454769,
        -0.02821502648293972,
        -0.03808273747563362,
        0.043724074959754944,
        0.05333881825208664,
        -0.0009691378218121827,
        -0.059049833565950394,
        0.07096057385206223,
        0.013583706691861153,
        -0.02225686050951481,
        -0.04714873060584068,
        0.028710173442959785,
        0.03965825214982033,
        0.05732155591249466,
        -0.08887891471385956,
        -0.016708575189113617,
        -0.005171468015760183,
        0.044010911136865616,
        -0.009446392767131329,
        0.04188930615782738,
        -0.015270018018782139,
        0.023886285722255707,
        0.057180069386959076,
        0.0598740316927433,
        0.05148771032691002,
        -0.044924262911081314,
        0.006777919363230467,
        0.011606653220951557,
        0.041003502905368805,
        -0.0425352118909359,
        0.034129079431295395,
        -0.020248714834451675,
        0.005441006273031235,
        0.05880880728363991,
        0.10449712723493576,
        -0.004452226683497429,
        -5.425034288464303e-08,
        0.04595241695642471,
        0.07806599140167236,
        -0.009539445862174034,
        -0.00855187140405178,
        0.053584445267915726,
        -0.05186901241540909,
        0.0476880818605423,
        0.05833897367119789,
        0.02861521579325199,
        -0.006842086091637611,
        0.03559895604848862,
        -0.06033091992139816,
        -0.0071845888160169125,
        0.011544560082256794,
        0.03205035999417305,
        0.05570501089096069,
        -0.01701364479959011,
        0.09392479807138443,
        0.006376660894602537,
        -0.07636420428752899,
        0.015958242118358612,
        -0.007511277683079243,
        0.10828538984060287,
        -0.04454607889056206,
        -0.05503154173493385,
        0.009073184803128242,
        -0.08198860287666321,
        0.0436357781291008,
        0.05792195349931717,
        0.03299256041646004,
        -0.044966090470552444,
        -0.045911528170108795,
        0.07042880356311798,
        -0.08312433958053589,
        0.0613284595310688,
        -0.13290107250213623,
        -0.08824249356985092,
        0.011775043793022633,
        0.001572861336171627,
        0.09236621111631393,
        -0.048987146466970444,
        -0.15265195071697235,
        -0.0830310583114624,
        0.00921512208878994,
        -0.11379945278167725,
        -0.07997778803110123,
        -0.11001671105623245,
        -0.06862432509660721,
        -0.03287339583039284,
        0.09319871664047241,
        0.013905956409871578,
        0.009947333484888077,
        0.019087089225649834,
        -0.06418383866548538,
        0.01671990379691124,
        0.1543024182319641,
        -0.01492089219391346,
        -0.050927165895700455,
        0.009903923608362675,
        0.030331283807754517,
        0.009680909104645252,
        -0.08092733472585678,
        -0.08461712300777435,
        -0.0054681445471942425
    ]
}