{
    "id": "tY0CyLQINag",
    "title": "*NEW* M2 MacBook Air! iOS 16, iPad OS 16 and more at #WWDC",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-06-07T21:19:45Z",
    "video_url": "https://www.youtube.com/watch?v=tY0CyLQINag",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 250230,
    "likes": 9971,
    "comments_count": 438,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys. It's Justine. And you might notice that I am- Well, I'm not in a field. I'm actually in front of the Steve Jobs Theater. I am in Cupertino right now, and WWDC just finished. And I'm so excited because they decided to do it in person this year. It was a limited invite. There still were a bunch of people here, and it's been so incredible to get to see all of my friends and just so many smiling, happy Apple people. It's a dream come true. WWDC is the Worldwide Developers Conference, and this is where we kind of find out what we have to look forward to in the upcoming year of software development. A bunch of developers are here, and they get access to the beta software, like iOS 16, which I can't believe iOS 16 is the next release. So I'm gonna go through some of the things that they announced and talked about in the keynote today. And it was so much fun to actually be here in person and get to experience this again. And, of course, a lot of you guys at home got a chance to also watch it live. First things first. Can we just talk about the M2 chip? I think this is something that a lot of us have been waiting for because obviously the M1 was so revolutionary. And when they announced the M1 chip about two years ago, they said there was gonna be a two year transition out of Intel chips into Apple Silicon. And since that, we're coming up on the two-year mark, I would say, in a couple of months perhaps. The Apple Silicon chip, the M1, the M1 Ultra, the M1- I mean, it has by far exceeded all of my expectations more than I ever thought that it would. So I'm very excited to check out the M2 chip. And they did announce some hardware here at WWDC. They announced the new 13-inch MacBook Pro and the new MacBook Air. Now, what's exciting about the MacBook Air is it's an all new unibody design, so it's no longer kind of that little slanted design. It basically looks like a mini MacBook Pro. It's just super, super squished. The new MacBook Air M2 comes in four colors. There's a silver, space gray, starlight, and midnight. And this is an all new aluminum unibody, 20% reduction in volume, it's a half-an-inch, and they have MagSafe, which is so exciting because before, if you'd want to charge your MacBook Air, that would then take away one of your ports. So this still has the two Thunderbolt ports, and you won't have to take one of those away to charge. It also has the 3.5-millimeter headphone jack that will support high-impedance headphones, which is very exciting, especially if you're doing a lot of audio work or video. This will make everything sound, mm, just right. So it has a 13.6-inch liquid Retina display. It's 500 nits, which is 25% brighter than the previous model. It also has a 1080p FaceTime camera, which has 2X the resolution and low light performance. It has all day battery life, up to about 18 hours, and a starting price at 1,199. (upbeat music) Now, that wasn't the only MacBook that they announced. The 13-inch MacBook Pro also got a little upgrade with the M2 chip. That 13-inch MacBook was something that completely changed my life and really showed me the power of the M1 chip. So that is now also getting an update to the M2 chip. The 13-inch MacBook Pro M2 has an 8-core CPU, 10-core GPU, 40% faster gaming performance. This will give you about 20 hours of video playback, 24 gigs of unified memory, up to a two terabytes solid state drive, and a starting price at 1,299. I can't wait to test out both of these MacBooks because I just can't even stress enough how impressed I've been with the M1, so the M2 can only go up from here, which it does. So that was some of the hardware that was announced. Now, let's go into the software, which is really what WWDC is all about. iOS 16, my friends. I love iOS updates because it basically gives you a brand new phone without having to get a brand new phone. So one of my favorite features that they announced in iOS 16 is in iMessages. And I feel like iMessage is where I shine. I'm not gonna lie to you, I don't really look at my email as much as I should. Most of the time, most of my communication happens in iMessages. So something that they finally announced, I think a lot of people are either excited about this or kind of on the fence about it, is message undo. You can also go back and make an edit. And this is something that I am very excited about is message unread. For me, when I'm going through my messages, if there's a conversation that I need to get back to, I would love to be able to mark that as unread, just as a note to myself to go back and make sure I respond. They also announced a new lock screen. This is something that we did see in the rumors. So you'll be able to customize it, much like you're able to customize the Apple Watch faces. And it's kind of cool 'cause it is basically that same tech but now on your lock screen. You could change colors. You could change fonts. You could change the photos. And they even have kind of a lock screen gallery with different backgrounds and different kind of templates that you can use. So I can't wait to try that out. They also showed some notifications that will now kind of roll up from the bottom, which I thought was kind of interesting. And I also feel like if I'm holding my phone, that would be the perfect place to actually click on the notifications 'cause that's where your thumb placement is. There were some talks of the new updated SharePlay, which you can now actually do in iMessages. So if you guys are watching a movie together, you don't have to actually do it on FaceTime. You can do that through iMessage. They also made some updates to Apple Wallet. I know, for me, I am so obsessed with digital identification. So this is slowly rolling out state by state. So it's not everywhere yet. It's not in California, which I cannot wait because you'll be able to share your ID with various apps. So if I ordered some alcohol from Uber Eats or something like that, I would be able to share that I was over 21. I wouldn't actually have to share how old I am. Thank God. So they would just know that, yes, she is old enough. She can receive this alcohol. So things like that I think are really, really interesting. They also have for Apple Pay, they set it up so that now if you are to purchase something and you don't want to pay the full amount now, you can pay it over time in four equal payments, which I think is really cool if you're making some big purchases and you don't wanna have to pay for it all at once. They're calling this Apple Pay Later, which I don't think that you could have come up with a better name 'cause it's actually literally what you're doing. You're paying later. Another thing that I thought was awesome is live text. I love live text. I have used this in so many random scenarios. If I'm watching TV and I sometimes see something that I can't actually see, I will take a picture of it, pause the show, zoom in on my phone, and it basically will give you all of that text that you can then copy and paste. And they were even talking about how they're gonna have new translations. And you'll be able to touch and lift an image from a photo. They did this little demo where they took a picture of this dog and then lifted the dog off and then pasted it into iMessages. Can't wait to also try that out. Just assume if I say something, I'm excited to try it out. Apple Maps, of course, is also getting an update. They've expanded to 11 more countries. They've improved the animations and detailed graphics of city landscapes. And they have multi-stop routing. This is incredible. I think they said that you can go up to 15 different stops. So you could basically plan your whole trip across the United States in one sitting. Okay. Okay. Okay. Now onto Apple Watch. Because you all know that I absolutely love this thing. One of the things that I was really excited about is they mentioned that they have some new running features. And as a- I'm not a professional runner, like a subpar runner- I'm kind of excited about this because this is giving you all new ways to train and push yourself, but also keep yourself accountable. You're able to measure stride length, ground contact time, and vertical oscillation. Plus, they have some new workout options that will let you focus on speed, endurance, or time intervals. I also like that they have a feature that will let you track your progress on a route that you frequently run. So you'll be able to actually see if you're making progress in your training. There's also four new watch faces, there's the new Siri UI, and there's new banner notifications because if you'll notice, if you ever use your Apple Watch, that it takes up the entire watch face screen. So now it'll kind of just pop right down like a banner notification on your iPhone. You guys know I love tracking metrics, and this has some new sleep stages updates, as well. So the Apple Watch will now be able to detect which sleep stage you're in. It also has an A-fib update, so the watch can detect signs of your A-fib rhythm in medication tracking. This is something that I never thought that I would be interested in until I found myself having to take blood thinners twice a day. And just knowing that now I'm able to track that on my Apple Watch and with my iPhone is really awesome. You'll be able to get a notification of the time that you have to take it, which medication you have to take. And it's so easy to set up. It's so easy that you can just scan the prescription bottle, and it'll automatically import it into your phone. This is also pretty cool because it'll give you drug interactions. So if you're taking multiple medications, it can give you a heads up to say, \"Hey, you're taking this and this. Those two drugs do not go well together. So you might wanna talk to your doctor.\" We've also got some updates to iPad with iPadOS 16. One of the things that I'm really excited about is they mentioned that they have a new iPhoto iCloud storage. So basically you can set up an iCloud storage that you can invite people to. So your friends, your family, your partner. Whatever it is that you guys wanna share, you can have access to that so you can all have one storage place to share all of your content. Also, there's a weather app on the iPad. I know. The crowd is going wild. Actually, the crowd did go wild. People were cheering, I think, way harder than I thought that they would for the weather app on the iPad. There's some new collaboration features, so documents can be connected to the conversation. And you can even collab working over FaceTime. Especially when you're using Freeform, this is like a FaceTime live collaboration element, which is kind of interesting. And I love that they're bringing this up 'cause I feel like people still are working from home, and to be able to kind of have this one shared space, you'll be able to see your coworkers and you'll be able to see what they're working on. iPad gaming. They showed some examples of Metal 3 on the iPad. They're also trying to make the iPad a little more desktop friendly. So adding things like different types of tools, undo, redo, and making those feel more macOS-like and a little less iPadOS. This especially comes in handy when you plug the iPad into an external display. Stage Manager is also really cool, and this is kind of giving you another way to multitask on the iPad. They also talked about this in some of the new macOS Ventura features, and they're kind of bringing all of these together on the iPad and macOS. But still, the iPad is still an iPad. One of the fun things that happens every year is we're like, \"What is the new macOS gonna be called?\" Well, my friends, drum roll. It is called macOS Ventura. Now, we've had Big Sur, we've had Catalina, we've had all kinds of California landmarks. And I definitely was thinking it was gonna be Mammoth. But it's not. We've got Ventura. This is also kind of cool, Handoff with FaceTime. There'll be times that I'm on my phone with a FaceTime call, and then I go to my computer and I'd like to just continue that call. Well, now with FaceTime Handoff, we can do that. Continuity camera. This is awesome. They showed this little Belkin attachment that you can attach your phone to your laptop and wirelessly use your iPhone cameras to do FaceTime calls, to record video. And they also have this really cool thing which was so mind blowing. You can use the ultra wide camera while you're doing your call and see your hands typing. You can see the desk view. I don't know how this happens. It looked like magic, but it looked like it worked perfectly. Of course, Safari also got a little update. We have increased battery life, higher quality playback, they have shared tab groups. So you can actually be sharing tabs and see if your friends are looking at what you're actually looking at. That's kind of neat. They also announced something called Passkeys, which is using a cryptographic technique using touch ID or face ID. And it will only work for a site that it was created for. It can't be leaked or phished, and it never leaves your device. And finally, the public version will be released in the fall, and we all know what that means. New iPhones. Well, thank you guys so much for watching. I had so much fun getting a chance to check out WWDC here in person. I look forward to seeing what you guys think. Leave me some comments below, and I'll see you in the next video. Bye. (upbeat lo-fi music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple",
        "kind",
        "MacBook Air",
        "MacBook Pro",
        "MacBook",
        "watch",
        "iPad",
        "Steve Jobs Theater",
        "announced",
        "Apple Silicon",
        "Apple Silicon chip",
        "excited",
        "chip",
        "WWDC",
        "Apple Pay",
        "things",
        "FaceTime",
        "Apple Watch faces",
        "phone"
    ],
    "transcript_entity_values": [
        "iMessage",
        "500",
        "MacBook",
        "Safari",
        "all day",
        "iOS 16",
        "the Apple Watch",
        "one",
        "Catalina",
        "CPU",
        "Metal 3",
        "16",
        "the United States",
        "the fall",
        "the Worldwide Developers Conference",
        "FaceTime",
        "MacBook Pro M2",
        "20%",
        "3.5-millimeter",
        "MacBooks",
        "25%",
        "11",
        "first",
        "1,299",
        "MacBook Pro",
        "15",
        "a couple of months",
        "WWDC",
        "two terabytes",
        "Belkin",
        "iPad",
        "Apple Pay",
        "24",
        "Ventura",
        "MagSafe",
        "M1",
        "the M1 Ultra",
        "midnight",
        "1,199",
        "mm",
        "every year",
        "about two years ago",
        "today",
        "iCloud",
        "SharePlay",
        "MacBook Air",
        "FaceTime",
        "First",
        "WWDC",
        "MacBook Air M2",
        "M2",
        "Apple Silicon",
        "Justine",
        "Handoff",
        "iOS 16",
        "iPhone",
        "Cupertino",
        "jack",
        "13-inch",
        "8",
        "1080p",
        "about 18 hours",
        "this year",
        "California",
        "40%",
        "10",
        "Siri UI",
        "Apple Watch",
        "21",
        "two-year mark",
        "Intel",
        "GPU",
        "the Steve Jobs Theater",
        "Apple",
        "Passkeys",
        "Big Sur",
        "MacBook Pro",
        "13.6-inch",
        "the MacBook Air",
        "2X",
        "four",
        "two year",
        "this Apple Pay Later",
        "about 20 hours",
        "Apple Maps",
        "Apple Wallet",
        "two",
        "iPhoto",
        "iMessages",
        "the upcoming year",
        "Freeform",
        "Mammoth",
        "macOS",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "GPE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "LAW",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.013756648637354374,
        -0.08685196191072464,
        -0.03799853101372719,
        -0.11461970955133438,
        0.05211992561817169,
        0.006941840518265963,
        0.018058082088828087,
        0.017208121716976166,
        -0.029405822977423668,
        0.0790642723441124,
        0.06917691975831985,
        -0.035229578614234924,
        -0.04151090979576111,
        0.01667926460504532,
        0.008753503672778606,
        0.08654559403657913,
        0.0318961963057518,
        -0.024137981235980988,
        0.0014001657254993916,
        0.04361665993928909,
        -0.023362651467323303,
        -0.039123982191085815,
        0.03020244464278221,
        -0.009419086389243603,
        -0.0052842977456748486,
        0.06845135241746902,
        0.03945876285433769,
        0.03403536602854729,
        -0.08861707150936127,
        -0.05679352208971977,
        -0.007475883234292269,
        0.021857503801584244,
        0.10104934126138687,
        0.02742907591164112,
        0.039905086159706116,
        -0.08466586470603943,
        0.06329648941755295,
        -0.01979825831949711,
        -0.06357762962579727,
        -0.057238295674324036,
        -0.01377874705940485,
        -0.0012073884718120098,
        0.03556787222623825,
        -0.009429431520402431,
        -0.0642339438199997,
        -0.06312444061040878,
        0.008672346360981464,
        -0.05411728844046593,
        0.08859464526176453,
        0.06571009010076523,
        -0.07232323288917542,
        -0.04333106055855751,
        -0.023515338078141212,
        0.044707443565130234,
        -0.037290796637535095,
        0.01213042438030243,
        -0.1147652119398117,
        -0.00933219213038683,
        0.08030721545219421,
        -0.05886450782418251,
        0.006618035025894642,
        -0.05615066736936569,
        -0.004533255007117987,
        0.05860314890742302,
        -0.06656549870967865,
        -0.058281950652599335,
        0.04353674501180649,
        0.002835117047652602,
        -0.025767356157302856,
        0.03575531393289566,
        -0.07640063017606735,
        0.04038657993078232,
        -0.003886382794007659,
        0.03507168963551521,
        -0.04519733414053917,
        0.06584138423204422,
        0.0236237570643425,
        -0.06597420573234558,
        -0.02323046326637268,
        0.039600931107997894,
        0.027244804427027702,
        -0.016919245943427086,
        -0.06441400200128555,
        -0.016879383474588394,
        0.011998353525996208,
        0.012872985564172268,
        -0.016977807506918907,
        -0.026775583624839783,
        -0.051593661308288574,
        -0.016552943736314774,
        -0.1005440354347229,
        -0.020331043750047684,
        0.005999971181154251,
        -0.007841227576136589,
        -0.001667635515332222,
        -0.0688553974032402,
        0.03004351258277893,
        -0.038694508373737335,
        -0.038385145366191864,
        0.0656917542219162,
        0.010663305409252644,
        -0.04117981716990471,
        0.020873714238405228,
        -0.049194108694791794,
        -0.03792070969939232,
        -0.1085878312587738,
        -0.03618612512946129,
        0.010023471899330616,
        0.006593651603907347,
        0.05889912322163582,
        -0.004452993627637625,
        0.039853714406490326,
        -0.07354394346475601,
        -0.07207971066236496,
        0.04954878240823746,
        0.08597026020288467,
        -0.014607233926653862,
        0.04820633679628372,
        0.011686144396662712,
        0.03952544555068016,
        -0.013203022070229053,
        -0.04952434077858925,
        -0.014985552988946438,
        0.02995181456208229,
        0.00486846175044775,
        1.8116625142283738e-05,
        -0.046673767268657684,
        1.34565274170198e-32,
        -0.013196337968111038,
        0.04613744467496872,
        0.020281821489334106,
        0.038930393755435944,
        0.005058180540800095,
        -0.07608535140752792,
        0.004468915052711964,
        0.11729909479618073,
        -0.02356628328561783,
        0.030651645734906197,
        -0.0356188602745533,
        0.011318592354655266,
        -0.07213893532752991,
        0.028957875445485115,
        0.03613835200667381,
        -0.04946250468492508,
        0.004222156014293432,
        -0.06247411295771599,
        -0.062025874853134155,
        0.033225953578948975,
        -0.00669995928183198,
        -6.735787610523403e-05,
        0.02906632050871849,
        0.060177065432071686,
        0.07517901808023453,
        0.08372914046049118,
        0.06672787666320801,
        0.00012698580394499004,
        0.07542263716459274,
        0.014509434811770916,
        -0.0651058778166771,
        -0.03120695985853672,
        -0.04187330976128578,
        -0.12125754356384277,
        -0.0394381582736969,
        0.004729362670332193,
        -0.04289210960268974,
        -0.018348129466176033,
        0.005183061584830284,
        -0.04247187077999115,
        -0.0429813526570797,
        0.0018152137054130435,
        -0.0842382088303566,
        -0.055428870022296906,
        0.09886445850133896,
        0.059606436640024185,
        0.012325490824878216,
        0.07616987824440002,
        -0.015711640939116478,
        0.009002351202070713,
        -0.036247603595256805,
        -0.015929782763123512,
        -0.037240076810121536,
        -0.011038551107048988,
        -0.034112561494112015,
        -0.06234040483832359,
        -0.047483187168836594,
        0.03784611076116562,
        0.039737917482852936,
        0.030112363398075104,
        0.024924786761403084,
        0.011767727322876453,
        -0.011184938251972198,
        -0.008956760168075562,
        -0.07896431535482407,
        0.09139002114534378,
        0.07103243470191956,
        -0.05873020738363266,
        0.015667779371142387,
        0.04435008764266968,
        -0.011249824427068233,
        0.010976547375321388,
        0.060250721871852875,
        -0.006667375564575195,
        0.04338388890028,
        0.04534269869327545,
        -0.09162034094333649,
        -0.05283569172024727,
        -0.0029052060563117266,
        0.0025489581748843193,
        -0.09115033596754074,
        0.05251668393611908,
        -0.006943392567336559,
        0.0981963500380516,
        -0.03309965133666992,
        -0.04002710059285164,
        0.05078382045030594,
        -0.03489161655306816,
        -0.03904479742050171,
        0.04259664937853813,
        -0.04320669174194336,
        0.08068080246448517,
        -0.07270446419715881,
        -0.047335412353277206,
        -0.06383910775184631,
        -1.3437108250344216e-32,
        0.0649624839425087,
        0.00868964847177267,
        -0.016719812527298927,
        -0.03378032520413399,
        0.034051477909088135,
        0.0016724799061194062,
        0.02065032720565796,
        0.09130851179361343,
        0.033915016800165176,
        -0.0913323387503624,
        0.05304858461022377,
        -0.07630430161952972,
        -0.10122954100370407,
        -0.02489469014108181,
        -0.024269303306937218,
        -0.031480930745601654,
        -0.08837523311376572,
        -0.04553509131073952,
        0.039719998836517334,
        -0.0471407026052475,
        0.06408175081014633,
        0.11511696130037308,
        0.11639655381441116,
        0.01628042943775654,
        0.018492424860596657,
        -0.01565171778202057,
        0.038785260170698166,
        0.057591501623392105,
        0.05347955971956253,
        0.04868625849485397,
        0.011880320496857166,
        -0.03483748808503151,
        -0.019571006298065186,
        0.004330023191869259,
        0.04307311028242111,
        0.05909491702914238,
        0.015100558288395405,
        0.0486578531563282,
        0.01156295370310545,
        -0.04565370827913284,
        0.04870855435729027,
        0.0033080975990742445,
        0.004012135788798332,
        -0.03616199269890785,
        -0.007054056506603956,
        -0.08248573541641235,
        -0.041050247848033905,
        0.056880731135606766,
        0.014624067582190037,
        -0.07328945398330688,
        -0.0440220832824707,
        -0.03909345343708992,
        -0.048385363072156906,
        -0.023142168298363686,
        0.008182942867279053,
        0.006545018404722214,
        -0.05758558213710785,
        -0.04215772822499275,
        0.06145233288407326,
        -0.0034322331193834543,
        0.038474202156066895,
        -0.0647684708237648,
        -0.06741374731063843,
        -0.11402139812707901,
        0.012406894937157631,
        -0.06009327992796898,
        0.043926410377025604,
        0.017076099291443825,
        -0.011404349468648434,
        0.06554039567708969,
        -0.019898753613233566,
        0.024791359901428223,
        0.05080472677946091,
        0.009019780904054642,
        0.042677607387304306,
        0.020254233852028847,
        -0.043530575931072235,
        -0.013743889518082142,
        0.07294505834579468,
        -0.03819803148508072,
        -0.02593361772596836,
        0.0394049696624279,
        0.03471341356635094,
        0.1177591010928154,
        0.07370923459529877,
        0.11815804988145828,
        0.09554252028465271,
        -0.03351757675409317,
        -0.0057104588486254215,
        0.09166241437196732,
        0.0019178623333573341,
        0.03197462856769562,
        0.06783000379800797,
        0.09717462956905365,
        -0.1267516165971756,
        -6.081447168071463e-08,
        0.012570854276418686,
        0.04578104987740517,
        -0.009742352180182934,
        0.016255641356110573,
        -0.011136212386190891,
        -0.07594698667526245,
        -0.02525637112557888,
        0.003552371170371771,
        0.11170618236064911,
        -0.04951050505042076,
        0.10609868913888931,
        -0.0313592255115509,
        -0.010700983926653862,
        0.13201904296875,
        0.015177099965512753,
        -0.005395469255745411,
        -0.10148743540048599,
        0.0975552573800087,
        -0.017031829804182053,
        -0.07726109027862549,
        -0.03054046630859375,
        0.0635635033249855,
        0.016303788870573044,
        -0.0034674019552767277,
        0.0388924777507782,
        0.008431489579379559,
        -0.03676576167345047,
        -0.020597189664840698,
        0.017699813470244408,
        0.04398186132311821,
        -0.09070643037557602,
        -0.005973700899630785,
        -0.029264317825436592,
        0.0012192943831905723,
        -0.05423157289624214,
        -0.07606184482574463,
        -0.08602117002010345,
        -0.004317131824791431,
        0.023489749059081078,
        -0.025593675673007965,
        -0.017001623287796974,
        -0.12140427529811859,
        -0.055899232625961304,
        -0.0029267012141644955,
        0.008470721542835236,
        -0.052824173122644424,
        0.05093812197446823,
        -0.048155415803194046,
        -0.0685308501124382,
        -0.014008864760398865,
        -0.008250021375715733,
        0.0436306968331337,
        0.06959418952465057,
        -0.026979297399520874,
        0.05314907059073448,
        0.010048288851976395,
        0.052515074610710144,
        0.02010830119252205,
        -0.03497007489204407,
        -0.04107588902115822,
        0.06788036227226257,
        -0.018292251974344254,
        -0.08069024235010147,
        0.057292163372039795
    ]
}