{
    "id": "tYnjMiTTdms",
    "title": "Kali Linux TP-Link TP-WN722N",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-04-08T14:28:48Z",
    "video_url": "https://www.youtube.com/watch?v=tYnjMiTTdms",
    "category": "Science & Technology",
    "tags": [
        "wifi",
        "kali linux",
        "tp-link tl-wn722n",
        "tl-wn722n",
        "kali linux tp link",
        "kali linux tp-link tl-wn722n",
        "tp link ac600 kali linux",
        "tp-link tl-wn722n kali linux 2021",
        "tp link kali linux",
        "kali wifi",
        "kali linux wifi not working",
        "kali wifi adapter",
        "kali wifi monitor mode",
        "kali linux wifi adapter",
        "kali linux wifi problem",
        "kali linux 2021.1",
        "best wifi adapter",
        "best wifi adapter for kali linux",
        "best wifi adapter for hacking",
        "kali tp link",
        "tp-link tl-wn722n kali linux 2020"
    ],
    "views": 311300,
    "likes": 9227,
    "comments_count": 1450,
    "description": "NOTE: This has changed. Watch this video:   Fix the TP-Link TL-WN722N WiFi Adapter in Kali Linux so you can use it for monitoring WiFi networks. You can get the adapter to inject packets and set monitor mode once you update the drivers as I demonstrate in this video.  Menu: TP-Link TL-WN722N Adapter differences: 0:00 Why do we care? 0:26 What I'm going to show you: 1:09 Menu Timestamps: 1:30 My experience: 1:53 Would I recommend these adapters: 2:36 Lab setup: 3:02 Version 1 chipset: 3:53 Version 2/3 chipset: 4:21 lsbusb -D information: 5:03 Version 2/3 adapter issue test: 6:28 Version 1 adapter test: 7:35 Compare results: 9:04 sudo apt update: 9:45 sudo apt upgrade -y: 10:08 sudo apt install bc: 10:31 Restart Kali Linux: 10:39 sudo apt-get install build-essential: 11:05 sudo apt-get install libelf-dev: 11:12 sudo apt-get install linux-headers-`uname -r`: 11:23 sudo apt install dkms: 11:37 sudo rmmod r8188eu.ko: 11:48 git clone  11:58 cd rtl8188eus: 12:10 sudo -i: 12:15 echo \"blacklist r8188eu\" to  \"/etc/modprobe.d/realtek.conf\": 12:20 exit: 12:24 sudo reboot: 12:26 sudo apt update: 12:50 cd rtl8188eus: 12:28 sudo make: 13:02 sudo make install: 13:18 sudo modprobe 8188eu: 13:22 Verify that adapter works: 13:29 sudo ifconfig wlan0 down: 13:43 sudo airmon-ng check kill: 13:50 sudo iwconfig wlan0 mode monitor: 14:05 iwconfig to verify monitor mode: 14:10 sudo ifconfig wlan0 up: 14:21 iwconfig: 14:30   Inject packets: 14:36 V1 interface: 15:00 V2/V3 interface: 15:08  ========== Commands: ========== YouTube doesn't allow the commands in the video description. Go to my github page using one of these links for the commands: Short link for commands:  Direct link:   ==================== Recommended Adapters: ==================== Alfa AWUS036NHA:  Alfa AWUS036ACM:  Alfa AWUS036ACH:  or   Others: Alfa AWUS1900:  Alfa Long-Range Dual-Band AC1200:  Alfa AWUS036NEH:  Panda PAU05:  Panda PAU06:  Panda PAU09:  WiFi Nation 802.11ac AC600:  WiFi Nation Atheros AR9271:   See Aircrack FAQ for more:   ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    ================ Links: ================ ITProTV Free Training:  My ITProTV affiliate link:  OSCP:  SANS:  Hack the box:  Try Hack Me:  CTF Time:  CEH:   TP-Link TP-WN722N TP-WN722N wifi wifi kali linux best wifi adapter for kali linux kali linux wifi wifi kali kali wifi tp-link tl-wn722n kali linux 2021 tp-link tl-wn722n parrot os  parrot os wifi hacking best wifi adapters best cybersecurity certs cybersecurity cybersecurity careers ceh oscp itprotv ine ejpt elearn security oscp certification ctf for beginners kali linux 2021.1  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #wifi #kalilinux #tplink",
    "description_links": [
        "https://youtu.be/tYnjMiTTdms",
        "https://github.com/aircrack-ng/rtl8188eus:",
        "https://bit.ly/tp-link-tl-wn722n",
        "https://github.com/davidbombal/Kali-Linux/blob/main/TP-Link%20TL-WN722N%20adapter",
        "https://amzn.to/3wnyVen",
        "https://amzn.to/3fCL4WT",
        "https://amzn.to/3rLAjny",
        "https://amzn.to/2PxkkMV",
        "https://amzn.to/31E0AtH",
        "https://amzn.to/34UUCEL",
        "https://amzn.to/3sK2iW8",
        "https://amzn.to/3ue23Da",
        "https://amzn.to/3wwqRZ8",
        "https://amzn.to/3wosx6X",
        "https://amzn.to/3cLQddm",
        "https://amzn.to/3u8JUqm",
        "https://bit.ly/39AtWNZ",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://www.itpro.tv/plans/personal/",
        "https://go.itpro.tv/davidbombal",
        "https://www.offensive-security.com/courses-and-certifications/",
        "https://www.sans.org/",
        "https://www.hackthebox.eu/",
        "https://tryhackme.com/",
        "https://ctftime.org/ctf-wtf/",
        "https://www.eccouncil.org/programs/certified-ethical-hacker-ceh/"
    ],
    "transcript": "- In this video, I'm going to show you the differences between a TP-link TL-WN722N version 1 wifi adapter, and a version two version three, wifi adapter. I recently ran a poll on my YouTube channel and it looks like most of you are using TP link wifi adapters. Now, there is a difference between a version one and a version two or three wifi adapter. The chip set within these adapters changed. Why do you care? Because by default this wifi adapters supports packet injection and monitoring mode. But this one doesn't on the documentation on the aircraft website, which I read. I was led to believe that you cannot do packet monitoring and packet injection using a version two or version three wifi adapter because the chip set changed. However, when I mentioned that on my previous video where I discussed a whole bunch of wifi adapters many of you commented and said that you got this to support packet injection and monitoring mode by changing the drivers on the wifi adapter. So thanks very much for sharing that. I went and did some research and for everyone's benefit I'm not going to show you the differences between these two wifi adapters. What happens by default? When you use this with in Kali Linux, in my example it's going to be 2021.1 And how that compares to say this wifi adapter. And then I'm going to show you how to get a version two version three TP link wifi adapter to work with in Kali so that it supports packet monitoring and packet injection. So in other words I'm going to cover a whole bunch of stuff in this video. Use the timestamps here or below to jump to the relevant part of the video. If you're only interested in getting this wifi adapter to work. So installing the correct drivers I've put the commands below this video. So you can simply copy the commands below. If you've got a version two version three adapter and you need to make this work. I did some research found some examples online but they didn't work for me. So I've now put together a list of commands that worked for me with Kali 2021.1 Let me know if it works for you. You've got to upgrade your operating system as an example and install various software packages to make it work. But before we get started, I want to ask you a favor. One of my goals this year is to reach a million subscribers on YouTube. I want to ask you to help me reach that goal. So if you enjoyed this video if you enjoy this type of content please consider subscribing to my YouTube channel. Please like this video and click on the bell to get notifications. Okay, let's get started. Now personally. I wouldn't recommend these adapters. If you can buy an alpha adapter or something else but I know for a lot of you it's very difficult to purchase alpha adapters. They're too expensive and you can't buy them in the country that you're in. A lot of people from India, as an example have told me that this is the best adapter for them. So that's why I'm going to go through the details of this adapter. I know a lot of you use this adapter. Now what I've got in this example is Kali running within a virtual machine on my Mac. I've also got it running within a virtual machine on a windows laptop. So I've got Kali within VMware fusion as well as a VM-ware player. I'll plug in this version one adapter to into the windows computer, and this version three adapter into the Mac so that we can compare the differences. So on windows I'm going to connect the version one adapter to Kali. Notice the chip set used and I'll now connect the version three adapter to my Mac. And on my Mac, I'm asked whether I want to connect this to Linux or my Mac. I'm going to connect it to Linux. Okay? So I'm going to be jumping between Kali windows and Kali my Mac. And I'll show you the differences between the two network adapters. Okay? So on windows, I'll open up a terminal. IWU config shows me that I've got a wlan wifi connection at the moment it's in managed mode. LSE USB shows me the chip set used by this wifi adapter. Now, if yours shows auto here, that's fine on a version one adapter I'll show you how to set this into monitor mode. Okay? So this is my Mac running Kali within VMware fusion. This is a version two adapter iwconfig shows me the nickname for the wifi adapter its mode is in managed mode at the moment. Yours may come up as auto once again, and I'll show you that Tronick change this to monitor mode, causes problems. LSUSB. We can see that this is a version two version three adapter. You can see that it's got a real tech chip set. That's different to the Atheros or theros chip set in the version one adapter. So version one, version two. Now, if you want to get more details you can use lsusb-D/dev/bus/usb/ and then specify the adapter. So this is bus to device two. So scrolling up, we can see the device ID information. We can see the vendor code. We can see the chip set used real tech chip set 802.11n NIC on this chip set that's once again different to the one running in windows. So lsusb-D/dev/bus/usb/002/003 Scrolling up. We can see the device ID information. We can see the vendor. We can see the product ID. We can see manufacturer USB version to WLAN serial number and other information is displayed here. Okay? So that just shows me technical differences between the two adapters. What's nice about this command is either using that or just to this you can see a lot of information about the chip set used. So if you got a wifi adapter and you weren't sure what chip said he was using this shows you that information very nicely. Okay. But let's have a look at the problem on a version two adapter. If I type sudo airmont -ng kill check this will kill any conflicting processes. Put my password in. So those processes were killed. I'll try and set this adapted to monitor mode. So using sudo airmon -ng start WLAN zero iwconfig has the mode changed? Mode, notice it stole managed mode sudo airmon -ng notice WLAN0 We don't have it as WLAN0 mon IWU config. Once again shows us that this adapters in managed a mode it's not going to work. So if I try and inject packets at this point notice I get device failure. Now, missed top the name let's try wlan0. Notice we get the error that we cannot set monitor mode on this wifi adapter. That's different to version one adapter. So on the version one adapt to on my windows computer. So first thing is kill processes. Processes have been killed. Sudo airmon -ng wlan0. I want to set this into monitor mode. Notice we see here, monitor mode has started. Iwconfig notice the name has changed. That's different to what we had previously previously on the version two adapter. It didn't say monitor mode. It stayed in managed mode. If I simply use airmon - ng. So just sudo airmon - ng, you can see that the interface name is wlan0mon. Interfaces once again, changed to monitor mode. So we've proven that monitoring works. Let's try packet injection. So sudo aireplay -ng --test wlan0mon notice packet injection is working. So packet injection works on a version, one adapter. So you don't have to do anything with the version one adapter. It works out of the box, plug it in. You can change it to monitor mode. You can do packet injection. With a version two adapter that doesn't work. However, so once again if I try and test that interface, it doesn't work. If I try and use wlan0, rather than wlan0mon notice we get the error that we cannot set monitor mode on this wifi adapter. So again, with the version two version three adapter so TP link version two, version three using the real tech chip set. I cannot set this to monitor mode. I can not run packet injection without updating the driver. So now I'm going to show you how to update the driver to get this to work. It's a long process. So once again, I've put the commands below. Okay? So once again, this is a version two or version three adapter, real tech using this chip set. Let's get it to work so that we can put this interface into monitoring mode and inject packets. First command. Sudo apt update to update references in Kali. Okay. Next step sudo apt upgrade to upgrade the operating system. Now this is going to take a while. So I'm going to speed up the video. At this point, you have to upgrade the operating system in my tests, letting me know if you didn't have to do that. But I had to upgrade the operating system to make this work in 2021.1. Okay. So the upgrade has completed. What I'm going to do now is install BC. We'll clear the screen. Now you don't have to do this right now, but I found that it helps I'm going to restart my Kali installation. You may want to do that directly after the upgrade Prompted to log in again, notice the gooey has changed. So after the upgrade did the installation changed, okay I'm going to install some additional software. So install Boldy central. That's already there. Just want to make sure that the software is in place And I'm going to use this command, but in the comments I've given you two options in case one of the commands doesn't work, but that's working for me. So that's good. I'm going to make sure that DKMS is installed. Okay. So that's done. I'm going to remove this from the Colonel. I don't want to use the older driver. I want to use the new driver with a TP link adapter. So I'm going to download this adapter from the air crack, get hub page. That's the new driver that I want to use. Ls shows me my directories. I'm going to go into that directory clear the screen, move to route, Echo that into the real tech configuration file exit out of route. And in my example, I found that it worked better. If I rebooted at this point, let me know in the comments if you found a quicker way of making this work, but sort of in my tests and the amount of time that I've had this is the process that worked best for me. Okay. Log back into Kali, Open up a command prompt once again, sudo apt update to make sure all my references are up to date. Okay? So you have to go back into the directory that we created. And now this is where you hope things work because we going to compile the software. So sudo make, looking good software is being compiled. Okay. Sudo make installed, to install the new driver and sudo modprobe 8188eu. Okay. So hopefully at this point our software is going to work properly. So I'll go do my home directory. Iwconfig shows me my wifi adapter mode is order at the moment on a top sudo Ifconfig wlan0 down clear the screen airmon - ng I'm gonna kill the processes again so sudo airmon - ng check kill and now let's check if we can set this adapter to monitor mode just before I do that, I'll clear the screen iwconfig. Notice the mode is auto, but when I set that again and type iwconfig, notice the mode has now changed to monitor mode that wasn't possible with the previous drivers, but now it works. Sudo ifconfig wlan0 up bring the interface up, iwconfig again everything looks good. We're in monitor mode. So let's test whether we can inject packets which we weren't able to do before. And then you go pack it Injection is now working. One important note is We are using wlan0 rather than wland0mon which is what we saw on the version one adapter. So on the windows, computer iwconfig shows me that the interface is wlan0mon. Whereas on the Mac iwconfig shows me that the interface is wlan0. This interface is in monitor mode. There is a difference between that and the monitoring interface on the windows computer. It's in monitor mode but the name changes. So when you use commands, you have to remember that with a version two version three adapter, you're just going to use wlan0, but with a version one adapter you're going to use wlan0mon. That affects the commands that you use. Okay. That was a long video, but hopefully it helps many of you. Hopefully it solves the problem about getting a version two of version, three adapter to use monitor mode. I personally wouldn't recommend this adapter. If you can buy a alpha adapter, I would use that, but I know for many of you, this is the best solution or the most cost effective solution. So hopefully this helps you. If you enjoyed this video, please like it. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I'm David Bumble. I want to wish you all the very best",
    "transcript_keywords": [
        "version",
        "adapter",
        "wifi adapter",
        "mode",
        "monitor mode",
        "wifi",
        "Kali",
        "set",
        "chip set",
        "monitor",
        "adapters",
        "work",
        "sudo",
        "Mac",
        "chip",
        "shows",
        "packet injection",
        "Notice",
        "packet",
        "version one adapter"
    ],
    "transcript_entity_values": [
        "first",
        "2021.1",
        "three",
        "USB",
        "Mac",
        "NIC",
        "BC",
        "One",
        "two",
        "India",
        "TL",
        "Atheros",
        "airmon - ng",
        "this year",
        "YouTube",
        "IWU",
        "Kali",
        "Mac",
        "802.11n",
        "one",
        "Boldy",
        "DKMS",
        "Linux",
        "VMware",
        "Echo",
        "Tronick",
        "Kali Linux",
        "WLAN",
        "million",
        "First",
        "airmon - ng",
        "1",
        "VM",
        "LSUSB",
        "David Bumble",
        "WLAN0"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG"
    ],
    "vector": [
        -0.0459858775138855,
        0.028556976467370987,
        0.005555134732276201,
        0.04078073799610138,
        0.03280073404312134,
        0.008719353936612606,
        0.006702417507767677,
        -0.0048945024609565735,
        -0.0316375233232975,
        -0.014615283347666264,
        0.07537630200386047,
        -0.042693011462688446,
        -0.07428644597530365,
        0.05101313814520836,
        -0.08627587556838989,
        -0.006199176423251629,
        0.09287728369235992,
        -0.09790842235088348,
        0.054253604263067245,
        -0.10075410455465317,
        -0.026898734271526337,
        -0.015501963905990124,
        0.11143280565738678,
        0.025421278551220894,
        -0.0009043376776389778,
        -0.01099521853029728,
        0.05649794265627861,
        0.05102048069238663,
        0.01933039166033268,
        -0.04125720635056496,
        -0.02367410995066166,
        0.055834777653217316,
        -0.048966679722070694,
        -0.03523097559809685,
        -0.08951009064912796,
        -0.10225042700767517,
        0.02686847373843193,
        0.024649806320667267,
        -0.00506677245721221,
        -0.040770839899778366,
        0.02071547508239746,
        -0.09540577977895737,
        0.01701865717768669,
        0.0677487701177597,
        -0.01611625961959362,
        -0.008317391388118267,
        -0.036953091621398926,
        -0.0023318191524595022,
        -0.044670555740594864,
        -0.023803384974598885,
        0.006677843164652586,
        -0.01859491504728794,
        0.01899142377078533,
        -0.040347158908843994,
        0.025554196909070015,
        -0.016388654708862305,
        -0.05299634858965874,
        0.04609617963433266,
        0.06856058537960052,
        -0.010998704470694065,
        0.050155844539403915,
        -0.023954354226589203,
        -0.011695878580212593,
        -0.008914252743124962,
        0.05219091847538948,
        -0.0010260395938530564,
        -0.00045266133383847773,
        0.0022665916476398706,
        -0.036526087671518326,
        -0.011147642508149147,
        -0.08493035286664963,
        0.07747536897659302,
        0.08111752569675446,
        -0.060166094452142715,
        -0.0417376272380352,
        0.03668207675218582,
        -0.0053084129467606544,
        -0.0391714870929718,
        -0.030392607674002647,
        -0.01722724922001362,
        0.0477156862616539,
        0.02597842924296856,
        0.012372499331831932,
        0.011513697914779186,
        0.05263962224125862,
        -0.06923872232437134,
        -0.06734030693769455,
        0.0639789029955864,
        -0.007397923618555069,
        -0.07067763060331345,
        0.05823112279176712,
        0.07448775321245193,
        0.0016993001336231828,
        0.01483836118131876,
        0.06002137437462807,
        0.07894022017717361,
        -0.049743808805942535,
        0.05783417820930481,
        -0.005035178270190954,
        0.07264342904090881,
        -0.061215952038764954,
        0.0073529938235878944,
        0.015886293724179268,
        0.10337228327989578,
        -0.01710859313607216,
        0.021706392988562584,
        -0.04100530594587326,
        0.013175232335925102,
        0.008410194888710976,
        -0.004043390043079853,
        0.02475781738758087,
        0.03378290683031082,
        0.0013241933193057775,
        -0.07818739116191864,
        0.03129539638757706,
        0.023456625640392303,
        -0.08537628501653671,
        0.06189422309398651,
        0.06044888123869896,
        -0.011127783916890621,
        -0.012883338145911694,
        -0.00837833620607853,
        -0.015552637167274952,
        -0.018717193976044655,
        0.05355918034911156,
        0.060848671942949295,
        0.058552928268909454,
        8.128716086668895e-33,
        0.11852393299341202,
        0.007797396741807461,
        -0.08476047962903976,
        0.02192249335348606,
        0.031177138909697533,
        -0.029760781675577164,
        -0.0005325321108102798,
        -0.02963942475616932,
        -0.003363343421369791,
        0.0070026107132434845,
        -0.11008011549711227,
        -0.10230647772550583,
        -0.09265460073947906,
        -0.02237548679113388,
        0.06335316598415375,
        0.009016379714012146,
        -0.005587197374552488,
        0.0906161442399025,
        -0.02941698580980301,
        0.08105152100324631,
        0.05505618080496788,
        -0.09161358326673508,
        -0.07912737131118774,
        -0.023354429751634598,
        0.140645369887352,
        0.08182723075151443,
        -0.014065481722354889,
        0.07319261878728867,
        -0.022411584854125977,
        -0.032391708344221115,
        -0.0009647606057114899,
        0.0012616972671821713,
        -0.041528865694999695,
        -0.03400542959570885,
        0.001840948243625462,
        -0.07622060924768448,
        -0.11435393989086151,
        0.0635191947221756,
        -0.024607667699456215,
        -0.06302535533905029,
        0.07240240275859833,
        -0.003978968132287264,
        -0.036903299391269684,
        0.018530098721385002,
        0.0893482193350792,
        -0.06298164278268814,
        0.01392277516424656,
        0.017644518986344337,
        0.030567318201065063,
        0.09047526121139526,
        0.0019372723763808608,
        -0.011118429712951183,
        -0.016305919736623764,
        -0.06264142692089081,
        0.03762185201048851,
        0.02576543018221855,
        0.08376353234052658,
        0.028734687715768814,
        0.012936543673276901,
        0.024976961314678192,
        -0.0532030425965786,
        -0.046301450580358505,
        0.0208883099257946,
        -0.07042793929576874,
        0.049940478056669235,
        0.028949350118637085,
        -0.021998975425958633,
        0.03433198481798172,
        -0.04401380196213722,
        -0.014396298676729202,
        -0.022898798808455467,
        0.013792064972221851,
        0.004755943547934294,
        0.02887343056499958,
        -0.02991262450814247,
        -0.03252509608864784,
        -0.009797229431569576,
        0.011634182184934616,
        -0.042848940938711166,
        -0.07204743474721909,
        0.09355209022760391,
        -0.045801520347595215,
        0.05233149603009224,
        -0.004972484428435564,
        0.016792085021734238,
        -0.04088220000267029,
        -0.00104401761200279,
        -0.0660434365272522,
        0.034017741680145264,
        -0.011381826363503933,
        -0.004880104213953018,
        0.0937233492732048,
        -0.011265335604548454,
        -0.002117817522957921,
        -0.008806075900793076,
        -8.356191141284301e-33,
        0.06783541291952133,
        0.01928301900625229,
        0.052507054060697556,
        0.033580005168914795,
        -0.06625399738550186,
        -0.04965406283736229,
        -0.01410179678350687,
        0.038192879408597946,
        0.0568697452545166,
        -0.02194303646683693,
        0.0472748801112175,
        -0.06294269114732742,
        -0.03741052746772766,
        -0.09632495790719986,
        0.031161991879343987,
        -0.0079633304849267,
        -0.020907295867800713,
        -0.07413586229085922,
        0.008816183544695377,
        -0.027829250320792198,
        0.018718160688877106,
        0.08895358443260193,
        0.02764672040939331,
        -0.0747450515627861,
        -0.027263110503554344,
        -0.02214428037405014,
        0.08972659707069397,
        0.04154345020651817,
        0.035978108644485474,
        0.06424965709447861,
        -0.023851433768868446,
        -0.055903539061546326,
        0.05306128412485123,
        0.0718262568116188,
        0.08841605484485626,
        0.04147183895111084,
        0.0281293373554945,
        0.025187898427248,
        0.05120021104812622,
        0.06864286959171295,
        0.11203934252262115,
        0.07009535282850266,
        -0.03441018983721733,
        -0.009551153518259525,
        -0.007147616241127253,
        -0.014579996466636658,
        0.013166672550141811,
        -0.06962455809116364,
        -0.10899672657251358,
        -0.0831209197640419,
        0.0123304333537817,
        0.06000954285264015,
        -0.012190799228847027,
        -0.01966698281466961,
        -0.003668406745418906,
        0.03961760923266411,
        0.015949824824929237,
        -0.03432377055287361,
        0.0006194958696141839,
        0.006326230242848396,
        0.08715062588453293,
        -0.07248781621456146,
        -0.002230163896456361,
        0.0230434387922287,
        -0.00583962956443429,
        0.017698194831609726,
        -0.02684328332543373,
        -0.014173357747495174,
        0.05561268702149391,
        -0.032645225524902344,
        -0.02370220609009266,
        -0.10683570057153702,
        -0.03621231019496918,
        -0.025832248851656914,
        0.10865594446659088,
        -0.07167933136224747,
        0.01652948558330536,
        0.10765127092599869,
        -0.03608265891671181,
        -0.029651660472154617,
        -0.09344358742237091,
        -0.0025912791024893522,
        0.02438809908926487,
        -0.062388889491558075,
        -0.014112663455307484,
        0.038751762360334396,
        0.030456742271780968,
        -0.0137783233076334,
        0.1024765744805336,
        -0.033126100897789,
        -0.03462928161025047,
        0.050739407539367676,
        -0.07074549794197083,
        0.05709545686841011,
        0.03764278069138527,
        -5.456075768961455e-08,
        -0.03122493252158165,
        -0.03103318065404892,
        -0.04964016005396843,
        0.04871107637882233,
        -0.0016939733177423477,
        -0.050997260957956314,
        -0.015016069635748863,
        -0.07325849682092667,
        -0.0002888723975047469,
        0.04344619810581207,
        0.0013918369077146053,
        0.018398985266685486,
        -0.10601618140935898,
        0.05804702267050743,
        0.0674859806895256,
        -0.06158951297402382,
        -0.05382409319281578,
        -0.0959506556391716,
        -0.045185770839452744,
        0.020442752167582512,
        0.056391987949609756,
        0.03254443779587746,
        0.08272148668766022,
        -0.051891401410102844,
        0.007582642138004303,
        0.02552175521850586,
        -0.02646097168326378,
        0.06324239075183868,
        -0.01804879494011402,
        -0.052666161209344864,
        -0.007850952446460724,
        0.0455034039914608,
        -0.04508689418435097,
        -0.0026757260784506798,
        0.04204791411757469,
        0.03946502134203911,
        -0.07184737175703049,
        0.027118219062685966,
        0.06318343430757523,
        0.07909737527370453,
        -0.11587002873420715,
        -0.0883951336145401,
        -0.059573717415332794,
        0.018067287281155586,
        -0.06309354305267334,
        -0.0376477874815464,
        -0.023870371282100677,
        0.04770626872777939,
        -0.01309784222394228,
        -0.010834614746272564,
        0.003233711700886488,
        0.005309866741299629,
        -0.04600987955927849,
        -0.14212404191493988,
        -0.02898695319890976,
        -0.016339346766471863,
        0.08478553593158722,
        0.032016295939683914,
        0.0021859859116375446,
        -0.03992471843957901,
        0.0392017662525177,
        -0.08615101873874664,
        -0.07763469219207764,
        -0.08580832928419113
    ]
}