{
    "id": "u0V3_r6ReOA",
    "title": "Why did Porsche MAKE this laptop??? - Acer Porsche Design Book RS",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-27T20:59:31Z",
    "video_url": "https://www.youtube.com/watch?v=u0V3_r6ReOA",
    "category": "Science & Technology",
    "tags": [
        "Porsche",
        "Porsche Design",
        "Laptop",
        "Acer",
        "Notebook",
        "Intel",
        "Evo",
        "Performance",
        "Lightweight",
        "Carbon Fibre",
        "Carbon Fiber",
        "PC",
        "Windows",
        "Microsoft",
        "Alex",
        "Unboxing"
    ],
    "views": 715122,
    "likes": 28782,
    "comments_count": 2405,
    "description": "Govee RGBIC strip light:  Govee Black Friday & Cyber Monday: (US)  (CA)   GIVEAWAY sponsored by Govee! Rules to enter: 1. Follow Govee on Facebook at @Govee.smarthome ( or Instagram at @govee_official ( 2. Comment \"ShortCircuit x Govee\" on Govee Facebook's or Instagram's latest post. 3. Govee will randomly select 3 winners on December 4.  So Porsche made a laptop with Acer, well technically it's Porsche Design. Our only question is who did they exactly make this laptop for and why? Alex might be able to figure it out.  Check out the Acer Porsche Design Book RS at   Buy Acer Swift 3 On Amazon (PAID LINK):  On Newegg (PAID LINK):   Buy Acer Swift 5 On Amazon (PAID LINK):  On Newegg (PAID LINK):   Buy Acer Spin 3 On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Buy Acer Spin 5 On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy Dell XPS 15 9500 On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy iFixit Pro Tech Toolkit On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://amzn.to/2HEeiGA",
        "https://bit.ly/ShortCircuitCM,",
        "https://bit.ly/SCBlackfridayCA",
        "https://bit.ly/GoveeFB)",
        "https://bit.ly/GoveeIG).",
        "https://lmg.gg/7hFrR",
        "https://geni.us/vq8qp5c",
        "https://geni.us/Hbaj",
        "https://geni.us/e5tF5",
        "https://geni.us/uSfdg",
        "https://geni.us/gCFoA6E",
        "https://geni.us/JUAyh",
        "https://geni.us/1tXxOA",
        "https://geni.us/WumckL",
        "https://geni.us/mDEgB",
        "https://geni.us/RJlDJ9X",
        "https://geni.us/BJg4J",
        "https://geni.us/qTMV",
        "https://geni.us/lVbvF",
        "https://geni.us/OtRzFz",
        "https://geni.us/0r94kv",
        "https://geni.us/42qO7UV",
        "https://geni.us/EQnRi",
        "https://geni.us/6tX38",
        "https://geni.us/KmpV",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- This right here is the Acer Porsche Design Book RS. And if you haven't heard of Porsche Design, they're like a subsidiary sort of like spin-off company of Porsche. And they sort of do things like sell $7,000 watches or one of the things that they did was, in Orlando, they made a high-rise where you could park your car like in the elevator and it takes you and your car up to your apartment. Anyway, it's ridiculous, rich people's stuff. Just stupid stuff that I never want to do. But, we can look at this laptop. It's you know, it's not as much as their watches, it comes at $1,400. So, maybe it's actually not that bad. Let's get into it. Oh, this isn't it. This right here is the optional accessories for the Porsche Design Book RS. And it's a $330 option for what you get, a mouse, we get this. Yeah, I don't know what this is for. It feels good. I'm guessing it's so that you can chuck your mouse and whatever else you want in there. And then, down here we get the carrying case. Hey, Andy. - [Andy] Yeah? - Would you spend $330 to get this leather-folio thing? This computer cover and... - [Andy] The mouse? - A kind of bad feeling mouse? - [Andy] I'll save up to get a real Porsche. - I was honestly hoping that this thing would be like made out of aluminum or something, given how freaking expensive it is, - [Jono] Is it plastic? - Yeah, it's just plastic. - [Jono] What? - Like listen to this. It's just like, it's... You can tell when something, you know, when you drop it, it sounds like a (mumbles), instead of like a (mumbles). Yeah, I haven't used this mouse yet, but I think it's pretty safe to say, the accessory bag is not worth what you're paying for it. This right here, it looks like it's a Bluetooth mouse, so I imagine the tracking and, oh, this just feels bad. I don't know who thought that this edge right here would be comfortable on your hand but it's not. Okay. Oh, you got another little card. - [Jono] Haha, in case it gets lost. - And, Porsche Design. I'm gonna keep on going. I wanna see what else is in the box. This is a lot of box for a little laptop already being out. - [Jono] Well you paid for it? - Yeah, you're definitely paying for the box here. 65W charger of a Type C, that's pretty good. And then over here we get, International Travelers Warranty passport. What? What's in here. What? (soft music) Okay, I'm confused. - [Jono] Are there two chargers? - So we also have a 65W barrel charger for some reason. Okay, well that's it. A lot of companies have been you know, moving towards much more biodegradable and generally earth-friendly packaging. I think it's pretty safe to say that given pretty much all of this is just foam that smells like it came straight from the refinery. This right here, is not great for the environment. Whoa. (soft music) Interesting. Okay, wow. It's 2.65 pounds and it actually feels really light. Definitely just chuck this in your backpack. I'm surprised how light it feels actually. Okay, so I just looked it up and it turns out this actually is a real carbon fiber panel on the back here, so it's a 3K carbon fiber. The whole like chassis is made out of 60, 65 aluminum, and then it has a micro-arc finish which apparently gives it a ceramic-like coating. It's kind of similar to (mumbles), like in feel. Apparently it has really great scratch resistance. It also has a gorilla glass screen. So, you know, it should last quite a long time and look pretty good. Well, subjectively, I don't know. What are your thoughts on how it looks so far, Jono? - [Jono] Not bad, it looks light. - It feels light. It is actually really light. I don't know, for me personally, it's kinda trying too hard. It's got those real like, almost (mumbles) vibes, instead of like you know... - [Jono] Change your hood, bro. - Like you know, like real Porsche, they would just do like more subtle things instead of just being like, ah, carbon fiber, we put a sheet on the back, good for us. We lost the plot here (mumbles). So, you get a full sized HDMI, type A and Thunderbolt, Thunderbolt 4 actually, on the side. You also have barrel charging, which you're just gonna throw in the garbage 'cause why the heck? Why? I'm still so confused, but anyway. And then on the other side you get headphone combo and another Type A. So, given its size and weight, that's actually pretty good. Oh, yeah, those can go. - [Jono] That's weird. - It is weird, I just don't get it. - [Andy] Put one at home, the other one in your leather pouch. - I guess that's probably what this is for. - [Jono] $300 babeyyyy. - Yeah, that's $330 well spent right there. Actually, this one fits better, so maybe you'd take it. Yeah, bang it, it attaches there, sort of. Okay, so is the laptop actually good? We'll find out, oh, one finger lift. Is it gonna (mumbles), come on, no. - [Jono] Gotta warm it up. - Two finger lift. Not really, one second. I like this mouse pad but we can't stiffness test on it. Okay, okay, our table is not flat. I thought that something was wrong with the laptop for a second there. So, we get this vajazzled fingerprint reader and a pretty small touch pad. It's a bit wonk. Do other touch pads do that? Nope, this one doesn't. The chassis overall though, is very stiff. You can definitely tell that the whole thing is made out of aluminum. Screen, same thing, like the feel of the laptop is great. Oh, and it is it's Evo certified which just made it haste things like, I think fast charging, you need to be able to get like 15 hours of battery life or something, super good standby and it needs to be able to turn on in like a second or something like that. I guess it's time to get into it. Who's our sponsor, Jono? - [Jono] Govee. - Govee. Govee offers high quality smart lights for any room or Christmas tree in your home. They're currently having a Black Friday promotion with up to 35% off the lights, as well as a cyber Monday sale with their prices as low as $6.99. The sale includes RGBIC light strips that allows for this cool chasing color effect. Normal RGB LED lights with Alexa and Google Assistant support, and a TV backlight that allows for different scenes. Head to the link in the description and check out Govee's Black Friday sale today. (soft upbeat music) - [Jono] That's pretty good. - Okay, I guess the first thing that I noticed here, is this touch? Okay, so it's a touch screen, it's a 1080P touch screen, that's 16 by 9. In this price range, you could also be looking at like the XPS 13 which has the 16 by 10 display, and I guess it also has a carbon fiber wrist rest if you like that and it kinda just looks more premium (laughs). So it's a 14 inch display with a maximum brightness of 340 nits, which is underwhelming. What do we have for power? (mumbles) I think there's only one config, but there might be a couple. But the one that we have though is the $1,400 model, which gets you... How much RAM do you think it does have, Jono? - [Jono] 16? - It has 8 gigabytes of RAM. - [Jono] What? - With an i5-1135G7, and a 512 gigabyte hard drive. So, it's not fast. - [Jono] The graphics card? - Well, there's no graphics card Jono. It's got the Iris Xe graphics which in fairness are actually pretty good for something of this size. But, you're not games on this (laughs). Well, one thing that is good about the i5 though, is that we have a 56 watt hour battery in here, and I imagine you actually do get like all workday plus a fair bit battery life with that. Then again, that's basically the same size battery as what you get in an XPS 13, you know, an HP Spectre. You're not getting a lot of laptop for $1,400 here. - [Jono] You get a Porsche laptop. - You getting carbon fiber on the back (laughs). Oh, one thing that you do get, it does that thing where it slightly angles up, when you open it. That allows for more air to get in the bottom, so it runs cooler and it also kinda like tilts it just a tiny bit, which is nice for typing. So, let's see how the keyboard actually feels. (keyboard clicking) This keyboard feels like fine, but it kind of gets to the whole problem that I have with this laptop. This doesn't feel like a keyboard that belongs on a $1,400 laptop. So, let's see the other laptop that's Acer, you know, unveiled at the same time as this one is the Spin 3 which has a 16 by 10 display, and starts at 850 bucks. There's also have the Spin 5, which is $1,000 and has a 3 by 2 display, the Swift 3X has 17 hours of battery life and is $900. So, I think it's safe to say that any of those options are much better than this, as you get a better and bigger screen. You get basically the same computer, but you're spending less money so that you don't have carbon fiber on the back. I don't know who this laptop's for. Actually, I'm gonna look it up. I remember seeing a slide about it. Okay, target audience. So first of all (laughs), those guys. The Porsche Design Acer Book RS, is designed for trend-conscious mobile professionals, looking for convenience and style while they work. The new notebook will appeal to their solid sense of style and desire for a super lightweight laptop, that provides spectacular visuals and effortless computing. For fancy people, fancy people with heaps of cash. You can see the whole deck just kind of flexes, I guess not a lot, and the switches actually are quite good. But it's the sort of thing that you just don't see on laptops that are this expensive with an i5. And same with like this track pads, just, it's just not quite there. It just doesn't quite offer like, you know, that premium experience that you would expect from Porsche, I guess. And so, we do have a fingerprint reader, but it does not have Windows Hello facial recognition, which is a bit of a bummer. Is it even a laptop review on short circuit, if you don't like (mumbles). Who wants to bet money that this will be underwhelming? The clarity is actually not bad, and there's no balls (laughs). (upbeat music) I would say that this is like perfectly acceptable for like conference calls, that sort of stuff. You'll be able to hear the other people just fine. It is in fairness to them, a very clear sound. (upbeat music) This is the Porsche Design, and that's the XPS 15. So, in fairness to Acer, this is a 15 inch laptop, but also in fairness to Acer not being that great, you know, the MacBook Air is still the same or better than the XPS 15. So, it is possible to have amazing sound in something of this size. - [Jono] And at that price too. - Yeah, and at this price too (laughs). MacBook Air is cheaper than this thing, and it's better in basically every way. Oh, let's open it up, let's do that. I like opening laptops. Wow, that's a really small motherboard. Look at this, it's only this big, it's just a little guy, and you're definitely not upgrading the RAM in this thing, which you kind of do expect in a laptop like this but it's pretty unfortunate that like eight gigs is your option. You can replace the SSD though, so that's nice. Oh, this big old 56 watt hour battery and you know, just a nice little pretty standard cooling system, but I imagine it's gonna be more than fine. We've got two heat pipes that lead over to here. Heaps of space to intake air, kind of quite a bit of wasted space here and here and kind of around here (laughs). So I guess my thoughts on this laptop, they probably made this laptop so people like me would review it, and then tell you to wait around for next thing that you should actually do, like get a Swift 3 or a Swift 5, or a Spin 3 or a Spin 5. Those actually look really good. I'm excited for those. So good job, Acer. You have laptops that I'm excited about, and I was really excited about this one 'cause I thought it would be stupid and it really was (laughs). So yeah, if you wanna see more laptops from Acer that are actually sensible, get subscribed, hit like and I don't know, just have a fantastical day. See you later.",
    "transcript_keywords": [
        "Porsche Design",
        "Porsche Design Book",
        "Porsche",
        "laptop",
        "Porsche Design Acer",
        "Acer Porsche Design",
        "thing",
        "Design Acer Book",
        "good",
        "Design Book",
        "Design",
        "pretty",
        "kind",
        "Yeah",
        "Acer",
        "pretty good",
        "feels",
        "mouse",
        "carbon fiber",
        "Acer Porsche"
    ],
    "transcript_entity_values": [
        "3",
        "65",
        "the Spin 3",
        "The Porsche Design Acer Book RS",
        "7,000",
        "330",
        "340",
        "850 bucks",
        "65W",
        "Orlando",
        "XPS 13",
        "RAM",
        "the Porsche Design Book RS",
        "chuck",
        "60",
        "one",
        "65W",
        "Evo",
        "15 inch",
        "the Spin 5",
        "1,400",
        "Google",
        "9",
        "900",
        "Porsche",
        "Andy",
        "Thunderbolt, Thunderbolt 4",
        "15 hours",
        "one second",
        "second",
        "Iris Xe",
        "14 inch",
        "Acer",
        "Alexa",
        "Porsche Design",
        "Govee",
        "SSD",
        "International Travelers Warranty",
        "8 gigabytes",
        "Friday",
        "56 watt hour",
        "512 gigabyte",
        "Jono",
        "Windows",
        "1,000",
        "up to 35%",
        "10",
        "Bluetooth",
        "first",
        "the Porsche Design",
        "16",
        "two",
        "the Acer Porsche Design Book RS",
        "Monday",
        "Black Friday",
        "the MacBook Air",
        "Two",
        "300",
        "RGB",
        "only one",
        "17 hours",
        "MacBook Air",
        "2",
        "2.65 pounds",
        "eight",
        "today",
        "RGBIC",
        "as low as $6.99"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "EVENT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "TIME",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "TIME",
        "QUANTITY",
        "PERSON",
        "NORP",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY"
    ],
    "vector": [
        -0.13730473816394806,
        0.019372548907995224,
        -0.018350141122937202,
        -0.013521557673811913,
        0.03870842605829239,
        0.025176864117383957,
        -0.013236199505627155,
        0.018574507907032967,
        0.05571150407195091,
        0.0008553147199563682,
        0.04867209494113922,
        0.012837206944823265,
        -0.001083077979274094,
        -0.08471647650003433,
        -0.04873233288526535,
        0.00958140566945076,
        0.028580747544765472,
        -0.04610826447606087,
        -0.04447897523641586,
        -0.08211943507194519,
        0.0071634091436862946,
        -0.0905124619603157,
        -0.011502598412334919,
        -0.011994161643087864,
        0.04662708938121796,
        0.005783529486507177,
        0.04056116193532944,
        -0.028523290529847145,
        -0.012799808755517006,
        -0.05549164488911629,
        0.04131918027997017,
        0.01860949769616127,
        -0.022539936006069183,
        0.06495358049869537,
        -0.05948220193386078,
        -0.13349978625774384,
        0.04675739258527756,
        -0.0224143099039793,
        -0.007630081381648779,
        -0.07531055063009262,
        -0.06426051259040833,
        -0.04710102826356888,
        0.011085273697972298,
        0.046427153050899506,
        0.06638709455728531,
        0.006728607229888439,
        0.01457072701305151,
        -0.02084861695766449,
        -0.0026221410371363163,
        -0.062373366206884384,
        0.017464302480220795,
        -0.06121233478188515,
        -0.028282344341278076,
        -0.11442425101995468,
        -0.01340959221124649,
        0.023905061185359955,
        -0.020783081650733948,
        -0.018835125491023064,
        0.03505045175552368,
        -0.005586051847785711,
        0.0956631451845169,
        -0.09605464339256287,
        -0.013284455053508282,
        0.010118373669683933,
        -0.039819322526454926,
        -0.04697361961007118,
        -0.01426022220402956,
        -0.09957323968410492,
        -0.029938871040940285,
        -0.00934990681707859,
        0.04879608377814293,
        -0.04509039595723152,
        0.04748435690999031,
        0.08421696722507477,
        -0.04669751971960068,
        -0.12006068974733353,
        0.06427674740552902,
        0.053423792123794556,
        0.02208758518099785,
        -0.008454781956970692,
        -0.031172221526503563,
        0.047433700412511826,
        -0.03667854145169258,
        0.06115930899977684,
        0.05252833664417267,
        0.030380256474018097,
        -0.004803838673979044,
        -0.015605981461703777,
        -0.0035738078877329826,
        -0.04023420065641403,
        -0.015487912110984325,
        -0.01733965240418911,
        -0.06567584723234177,
        -0.06873437762260437,
        -0.056695904582738876,
        0.001767410896718502,
        0.07179362326860428,
        0.03024669922888279,
        0.02590646967291832,
        0.009236280806362629,
        0.053639285266399384,
        0.06795796751976013,
        0.0814954936504364,
        -0.04861719533801079,
        -0.06647644191980362,
        -0.013514735735952854,
        -0.010626588016748428,
        0.11477679759263992,
        -0.0051092770881950855,
        0.013076645322144032,
        -0.055682916194200516,
        0.03165986388921738,
        -0.03839648514986038,
        -0.006342367734760046,
        -0.044208262115716934,
        0.0036407385487109423,
        -0.10301285237073898,
        0.019182685762643814,
        0.12406515330076218,
        0.06593798846006393,
        0.0007991119637154043,
        0.009943979792296886,
        -0.019385287538170815,
        -0.003988688811659813,
        -0.02252763882279396,
        -0.0019087748369202018,
        -0.04330844059586525,
        4.561929006332183e-33,
        0.019497264176607132,
        0.0524996817111969,
        -0.012180718593299389,
        -0.024983633309602737,
        0.022598279640078545,
        0.0012325238203629851,
        -0.013796999119222164,
        -0.0015504840994253755,
        0.01734340749680996,
        0.07947714626789093,
        -0.03618026524782181,
        -0.10977685451507568,
        -0.12319591641426086,
        -0.0010548564605414867,
        0.08416326344013214,
        -0.01489453949034214,
        -0.14472557604312897,
        -0.08218485862016678,
        -0.0709303691983223,
        -0.02989434450864792,
        0.008231125771999359,
        0.03654871881008148,
        0.0539778433740139,
        -0.015613003633916378,
        0.00038982025580480695,
        0.01832510344684124,
        0.005189428571611643,
        -0.03525179997086525,
        0.039039380848407745,
        0.03658326342701912,
        -0.03581458330154419,
        0.011449241079390049,
        -0.06014252454042435,
        -0.06264559924602509,
        0.002055499004200101,
        -0.038506366312503815,
        0.023754669353365898,
        -0.11663421988487244,
        0.045675087720155716,
        0.0591178759932518,
        0.06628500670194626,
        0.03473604843020439,
        -0.0588095597922802,
        -0.04157157614827156,
        -0.007204596418887377,
        0.05411848425865173,
        -0.0015415161615237594,
        0.06261326372623444,
        0.10035378485918045,
        0.030789656564593315,
        -0.053836639970541,
        -0.011260594241321087,
        0.0873306542634964,
        -0.020148776471614838,
        0.04207591339945793,
        0.04549843445420265,
        -0.0028185073751956224,
        -0.029734140262007713,
        0.08798616379499435,
        0.09016823023557663,
        -0.012768139131367207,
        0.024929655715823174,
        0.0010461410274729133,
        0.04974249750375748,
        -0.14952446520328522,
        0.05700763687491417,
        0.1023724302649498,
        0.04268745332956314,
        -0.03519091382622719,
        0.035121433436870575,
        -0.03143857419490814,
        -0.07616882026195526,
        -0.022990411147475243,
        -0.02919786237180233,
        -0.004546400159597397,
        -0.026242688298225403,
        -0.03794492036104202,
        0.048703648149967194,
        -0.017443498596549034,
        -0.056223031133413315,
        -0.04378135874867439,
        0.055814970284700394,
        0.06208209693431854,
        0.006083553656935692,
        -0.04079738259315491,
        0.07460930943489075,
        -0.04426690563559532,
        -0.060254789888858795,
        0.03137463703751564,
        0.024108044803142548,
        -0.043531011790037155,
        -0.03927823528647423,
        -0.027673806995153427,
        0.007224378641694784,
        0.029580598697066307,
        -7.774822492094307e-33,
        0.02202509343624115,
        -0.10694549232721329,
        0.016553694382309914,
        -0.015445210970938206,
        0.011643311940133572,
        0.03720657899975777,
        -0.09692259132862091,
        -0.013026717118918896,
        0.009101477451622486,
        -0.008001483045518398,
        0.054699480533599854,
        0.07889993488788605,
        -0.02296845056116581,
        0.004272249527275562,
        0.03229580819606781,
        -0.03674302250146866,
        0.005443123634904623,
        -0.07289698719978333,
        -0.003028161358088255,
        -0.013599949888885021,
        0.0938275083899498,
        -0.007482664659619331,
        0.026614898815751076,
        -0.028307752683758736,
        -0.01711958833038807,
        0.022598247975111008,
        -0.04397962614893913,
        0.07920430600643158,
        0.09244120866060257,
        0.004378284327685833,
        -0.009255294688045979,
        -0.08745074272155762,
        0.07372475415468216,
        0.08202309906482697,
        -0.009815391153097153,
        -0.008300337940454483,
        -0.014446109533309937,
        0.02089233323931694,
        -0.0023020373191684484,
        0.03310910239815712,
        0.053453680127859116,
        -0.023306917399168015,
        -0.005852618254721165,
        0.027588536962866783,
        -0.005131935700774193,
        0.015264048241078854,
        -0.01809879019856453,
        -0.07751747220754623,
        0.0720750167965889,
        -0.06817005574703217,
        0.05080777779221535,
        -0.06711063534021378,
        -0.004805812146514654,
        0.041720129549503326,
        -0.12482639402151108,
        -0.04865197464823723,
        -0.017967168241739273,
        0.015871336683630943,
        0.10774350166320801,
        0.06574974954128265,
        0.0004660988342948258,
        0.02444631978869438,
        0.024741308763623238,
        -0.07666590809822083,
        -0.0232139453291893,
        -0.05123528093099594,
        0.009561868384480476,
        0.07070031762123108,
        -0.007403912954032421,
        -0.019586263224482536,
        -0.063119076192379,
        -0.05137301981449127,
        -0.007301179692149162,
        -0.022599659860134125,
        -0.017961064353585243,
        0.018375327810645103,
        -0.022937605157494545,
        -0.03124581091105938,
        -0.010755198076367378,
        -0.015283234417438507,
        -0.026335231959819794,
        -0.008499796502292156,
        -0.00042655301513150334,
        0.04583641141653061,
        0.02853647619485855,
        0.016987022012472153,
        -0.013513977639377117,
        0.02849699929356575,
        -0.016263647004961967,
        0.022888977080583572,
        0.04835641011595726,
        0.04695562273263931,
        -0.06420033425092697,
        0.09300051629543304,
        -0.11581231653690338,
        -5.127128233084477e-08,
        0.0485646054148674,
        0.054050471633672714,
        0.04495880752801895,
        0.05107704922556877,
        -0.008842273615300655,
        -0.07459177076816559,
        0.05216512084007263,
        0.008018722757697105,
        0.02989302948117256,
        0.0062199002131819725,
        -0.04815347492694855,
        -0.059184156358242035,
        -0.003922212868928909,
        0.04134930670261383,
        0.0047093722969293594,
        0.04341834783554077,
        -0.07983630150556564,
        0.11552336812019348,
        0.028297128155827522,
        -0.03448595851659775,
        0.04453438147902489,
        -0.009308024309575558,
        0.08830859512090683,
        -0.06457707285881042,
        -0.019054334610700607,
        0.04816238209605217,
        -0.07723401486873627,
        0.03459431976079941,
        0.05685118958353996,
        0.04580541327595711,
        -0.07804396003484726,
        0.04678408056497574,
        0.0901605486869812,
        -0.014539462514221668,
        0.034932296723127365,
        -0.037659354507923126,
        -0.03483542054891586,
        -0.012873522005975246,
        0.0847424790263176,
        -0.022321559488773346,
        -0.015379693359136581,
        -0.02043169178068638,
        -0.09797879308462143,
        -0.02281923033297062,
        0.04204210638999939,
        0.03605020418763161,
        -0.09328015893697739,
        -0.09454917907714844,
        -0.050018325448036194,
        0.08114408701658249,
        0.03236842527985573,
        -0.011278183199465275,
        0.011469366028904915,
        0.0875856950879097,
        -0.040188807994127274,
        -0.040018338710069656,
        -0.0253435168415308,
        -0.04950334131717682,
        0.006378639489412308,
        -0.0334932915866375,
        0.05826577544212341,
        -0.07967983931303024,
        0.02512417547404766,
        0.13292641937732697
    ]
}