{
    "id": "u1qxJz7biqI",
    "title": "My favorite iPhone 11 Accessories!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-12-20T17:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=u1qxJz7biqI",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 650894,
    "likes": 17510,
    "comments_count": 766,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we're going to be doing an iPhone accessory video. I've been wanting to do this video for a while, so when I decided to finally shoot this I went through and thought of all the things that I have been using most frequently with my iPhone. Some of the things are pretty common, like, obviously, an iPhone charging case, but some are not so common, like another massive satellite phone. I've been such a huge fan of Mophie for so long and a huge thank you to them for sponsoring this video. Check out the link in the description or check out mophie.com. First up, I wanna to talk about Mophie's iPhone charging case. This is their new one, the Juice Pack Access. What I love so much about this case is you can charge it wirelessly or you can also charge it with a USB cable, and this will pass through and also charge your iPhone. And you still have access to the Lightning port, which means you can be charging and still use other accessories at the same time. It's also a pretty slim case, as you can see. I'm such a huge fan of wireless charging, I also hate carrying multiple cables. So to be able to charge my phone not only wirelessly but also by using USB-C is such great news. There's also a power button on the back so you can turn the case on or off and you can also see what your charge is at. And I also have something else to go along with this. This has been one of my favorite charging stands. This thing has been around the country with me, I haven't been traveling international much lately. But this is what I now travel with, so I don't have to ever bring any cords or cables. This is also by Mophie. This charge is not only your Apple Watch but it'll charge your AirPods and your phone at the same time, or anything else that's Qi wireless compatible can also charge it here. You might notice that this is the size of another accessory that we're gonna be talking about here shortly. I cannot stress enough how amazing this is. So these are my old AirPods case that actually happened to be encased in a little Nomad leather skin, this thing is amazing. So I can charge my AirPods, my Apple Watch and my phone and my charging case all in one. This thing has been so great. It'll also charge the new AirPods. While it doesn't have a snug of a fit as the old ones it still charges it. While we're talking about Mophie products. Okay, so I've kind of, sort of destroyed this one because it has been traveling with me everywhere as well. In my gear bag this is a little AC adapter, but what's great about this is it gives you two USB ports and also a USB-C port. And this, itself, is a charger. It also charges wirelessly. So you can set your phone directly on top of it and my phone's charging right now. I like this a lot too because this does give me three of a USB ports, so when I am traveling this also acts as a little USB hub. So this I don't leave home without. I was mentioning this case. So it's like a little leather case that goes over top of your AirPods. (gentle upbeat music) This is made Nomad and it's really cool. It also comes in a brown leather as well. But I like how well it matches all of my accessories. Gonna put my watch back on now because I'm missing out on all this activity. All this moving around. Come on, I should sort of work out! Obviously, another accessory are the new AirPods Pro. I've been using these a lot. I still travel with both my old AirPods and my new AirPods, just mostly because I'm afraid that I'm gonna lose one of them and I need to have a backup. Because I'm always editing so if I don't have some sort of headphones I'm gonna be in trouble. Next up this is a weird accessory but I felt bad that my phone would always see me on my MacBook, so I didn't want it to feel bad anymore so I got it its own MacBook. And I think that it likes it. Siri, do you like the MacBook that I got you? - [Siri] You know what they say, \"Baby got Mac.\" I think that's how it goes. (Justine laughs) Anyway, this is just a little silly mirror that I found. I don't actually use this on a daily basis. Oh gosh, maybe I should. I thought it was cute, I just found it in my drawer. Next up, I showed you guys this in the beginning, but this is a Garmin satellite phone. And you might be wondering how this is an accessory to my iPhone. But when I am hiking or out in places without reception this connects to satellites in the sky. Thank You Garmin. And there's also an app on my phone so I can use the satellite phone to text and communicate with people even if I don't have cell reception. This also has an SOS button so this can alert authorities or rescue people hopefully nearby to come save me somewhere. And I'll also text message a bunch of my emergency contacts in here. So I don't really ever leave home without this. I actually almost did have to use this when my friends and I were in Montana. This woman fell off this cliff and there was no cell reception. Well she didn't fall of a cliff, it wasn't like that far, but it was still like a little ledge and she was bleeding. And she did not seem well, so. Tyler's back there, he was there to witness all of that. It was really scary. And I had my phone, I was ready. Thankfully, she was okay and they had some people there on hand that worked in the park and they were able to bus her and get her the help that she needed. I definitely recommend if you're an avid hiker or somebody who does do a lot of outdoor activities where there is no cell reception. I love it Next up, this is, I can't even call it an iPhone accessory, but it's sort of is an accessory, it's basically its own standalone camera but it works really well with your iPhone. So this is a little tiny Steadicam. You guys have seen the review of the Osmo Mobile before, I've also done videos on this little guy. They also have an entire line of drones, which you guys have also seen me review. But this little thing is so great because it's so small you can get some shots that you never could get before. Because you just plug it right in and you can see everything that you're filming right on the front of your iPhone. You can also edit videos in the app, you can shoot really cool time lapses. It's just really awesome if you do travel a lot. It's probably one of my favorite iPhone accessories. It's not actually an iPhone accessory, but you know what I mean. Look how steady. Wow! If there was an earthquake right now we'd be ready. Actually I wouldn't be ready 'cause I think a lot of my emergency supplies have expired. (Justine sighs) Next up a mobile tripod from JOBY. Now this isn't the version that I wanted to show you because I lost the version that I wanted to show you. (laughs) But I will show you what I wanted to you show but show you 'cause I don't have it anymore. This is a little tripod mount and this can open to various sizes depending upon your phone size. The one that I lost had extra places that you could mount these extra arms on to. And it was awesome because you could put a light, you could put a microphone or, I don't even know, like another phone on top of it. But I lost it and I don't know where it is and I think about it a lot. You wanna to hear another funny story? Anybody that cares to listen. So, (laughs) I have a problem. When I buy things online I don't ever look at the actual measurements, I just look at the picture and then I, in some crazy iJustine fashion, I formulate in my mind besides that I think that is and I think that's what's going to show up. So I once ordered basically a tripod this size. But this is what showed up. (laughing) When I opened up that Amazon box I about lost my mind because I was like what am I ever supposed to do with this? But it's so cute that I just can't bring myself to ever. I don't know, I just couldn't return it 'cause it it just it's like a baby. This is a little iPhone microphone. So it used to vlog a lot more than I do now, so being able to have better audio on your iPhone is really great. So you can just plug this in, just like so. And guess what? It works. (laughs) So if I'm vlogging this way, I wish that it would be able to swing all the way around but it doesn't. They really missed the boat on that one. But you can also just unplug it and then vlog that way. There's also a little light, right there, so you can see if it's working. This is a video test of not having a microphone on it. Wow, this Mac looks so good back there in this front-facing camera. Here's a test using the microphone. And do I need to reiterate how great this new Mac Pro looks back there? Oh my goodness. And these lights too, oh man. So this is a great little microphone. Especially if you're in windy situations, this little added wind ball, (laughs) it's a real savior. All right, I think we have a few more things. This is a stand. This is not $1,000 stand by any means. Much like our Mac Pro Display XDRs. But really there's nothing that special about this stand, but I do love always having a little stand to put either my phone or my iPad on. Feel like this stand particularly, is way better for an iPad because it's really big, but you can put your phone in. I also used to use this to house a picture of my dog that I print it out. So really it's multiple uses. Why I'm mentioning this stand? I'm not sure, it was an accessory that I used quite often. So I just wanted to tell you guys about it. Last but not least, this is a little light from Aputure that I've been using for the past few years. This is so small, so tiny and it's powered by USB. Which is great because if you're traveling the last thing that you wanna do is be lugging around external batteries 'cause then you have to charge the batteries. So anything that can be charged through USB I'm a the fan of. And this thing is extremely bright. It's got some buttons here on the side so you can change the brightness. Is it changing? One's videos that I remember us using this we were at E3. Do you remember? We were at Luigi's Mansion. Yeah, so we use this. It was pretty dark in there, so this actually did a really great job. There's a new version of this if it does RGB colors that Tyler has, and he was showing me how cool it is 'cause it connects to an iPhone app. So you can do all sorts of fun little things. Which model is this one? - [Tyler] The Aputure MC. - MC. Oh man, it's got like a little plastic soft box? So there it is. It's got a little on button here. It also have a little display that will show you the different color temperatures. It also has like an effects mode. Here's the effects. This is the fire effect. Wow. Oh, cop car! Oh wow, I'm shook. This is the party mode. Here's some Lightning, oh wow. This is cool 'cause you can, again, hook this up to your iPhones so you can have access to all of these. You can set different modes. And if you have multiples of these you can sync them all together and have a real freakin' party. I gotta get this but it's back-ordered right now. Also nice because this charges with USB-C. Thank you. But again, this is, I think they're going for like less than $50 right now. And this one's like 100. Look this braided USB-C cable. (gasps) Beauty. So the one that I ordered, that I thought was this one, is actually an upgraded version of this one, it's just a bicolor. I was looking for something that was a little bit bigger than this one so that I'd be able to have a little more light when I'm traveling and I also wanted it to be a USB charge. So I guess I'll open this. This is like a little surprise to me. - [Tyler] I'll grab you a knife. - Okay. Do you know where one is? - Pretty sure, yes. (Justine laughs) - (chuckling) The smallest possible knife. Man, Apurture's pretty great. We also bought this other light that we're using right now. Not an iPhone accessory, but I'm into it. - Oh! Look at this, I love their case. Look at this, this is so thin! And it's got a little clip! I love how flat and thin this case is. Yeah, put all my things in there. We've got some little 3M stickies. It looks like we have a little bit diffusion paper there. Wait a minute! I thought it was gonna be bigger! This has so many more LED lights on it. It also kind of has like this little heat sink here on the back. Wow. Wow. Well this is good because now I can travel with both of them in the same case. I like that it changes color temperature. Colder. Warmer. Oh, there's a little booster too? That will probably, definitely kill through the battery. But if you need a little extra light. Wow. Also a USB-C port here to charge. And I'm so excited that this USB-C because most of the Mophie charging bricks are all now USB-C. So if I need some extra battery I can just plug that directly into one of these Mophies. When I'm traveling this is such a savior. Right, so I fit both of my lights in here. This is such a great travel option, Whether you're using your phone, whether you're vlogging on bigger cameras like this, Both of these lighting options are amazing. I think that's all of the stuff that I wanted to show you guys today. Well that's it. I hope you guys enjoyed some of these accessories that I've been using for my iPhone. I'd love to hear from you guys. What have you been using and if there's anything you'd like or you think that I should try out leave those in the comments below and also feel free to send me a tweet. Again, thank you to Mophie for sponsoring this video. You guys are the best. And if you guys wanna check out anything Mophie related check out the link in the description. And with that, I will see you guys later. Bye.",
    "transcript_keywords": [
        "iPhone",
        "phone",
        "Justine and today",
        "charge",
        "case",
        "iPhone charging case",
        "great",
        "guys",
        "Mophie",
        "iPhone accessory",
        "accessory",
        "USB",
        "USBC",
        "charging",
        "Mophie iPhone charging",
        "charging case",
        "AirPods",
        "Wow",
        "show",
        "things"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "AirPods",
        "MacBook",
        "less than $50",
        "one",
        "Amazon",
        "iPad",
        "USB-C",
        "Garmin",
        "E3",
        "The Aputure MC",
        "AirPods Pro",
        "RGB",
        "some little 3M",
        "Steadicam",
        "Justine",
        "Montana",
        "Luigi's Mansion",
        "AC",
        "Mac",
        "iPhone",
        "Mac Pro",
        "three",
        "Aputure",
        "the Osmo Mobile",
        "JOBY",
        "100",
        "the Juice Pack Access",
        "Nomad",
        "iPhones",
        "Siri",
        "Apurture",
        "daily",
        "today",
        "the past few years",
        "two",
        "Mophies",
        "Tyler",
        "SOS",
        "1,000",
        "Apple Watch",
        "USB",
        "First",
        "Mophie"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "FAC",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "NORP",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG"
    ],
    "vector": [
        -0.08428867161273956,
        -0.023650435730814934,
        -0.034026723355054855,
        -0.11458482593297958,
        0.029064958915114403,
        0.05424526333808899,
        0.062306784093379974,
        0.04856594279408455,
        -0.025219272822141647,
        0.06139673665165901,
        0.046369519084692,
        0.012388803996145725,
        -0.020848583430051804,
        0.04223443195223808,
        -0.002867279574275017,
        0.04111769050359726,
        0.03856469318270683,
        0.03675147145986557,
        -0.034503273665905,
        -0.0028273749630898237,
        -0.04406808689236641,
        -0.005633724853396416,
        0.12557156383991241,
        0.02360389567911625,
        -0.027783768251538277,
        0.07693672925233841,
        -0.04255955293774605,
        -0.009032180532813072,
        -0.07837725430727005,
        -0.06049501150846481,
        -0.02026088908314705,
        -0.013934468850493431,
        0.062377408146858215,
        -0.00545190554112196,
        0.037441421300172806,
        -0.09224003553390503,
        0.05523199588060379,
        0.005535631440579891,
        0.014632565900683403,
        -0.02773749828338623,
        -0.03561393916606903,
        -0.018610823899507523,
        0.0063231587409973145,
        0.02451932057738304,
        -0.046615488827228546,
        -0.06953086704015732,
        0.022877467796206474,
        -0.023661069571971893,
        0.015417326241731644,
        0.061484839767217636,
        -0.015128102153539658,
        0.0034307355526834726,
        -0.022192107513546944,
        0.05891137570142746,
        -0.037732381373643875,
        0.004392933566123247,
        -0.1203010156750679,
        -0.0015113692497834563,
        0.0586506649851799,
        -0.0582829974591732,
        0.03431067243218422,
        -0.0017763477517291903,
        0.009031967259943485,
        0.05882580205798149,
        -0.08090034127235413,
        -0.0868595764040947,
        -0.033636581152677536,
        0.026705149561166763,
        -0.003978521563112736,
        0.022353220731019974,
        -0.073968805372715,
        0.055378127843141556,
        -0.0041435714811086655,
        -0.017065120860934258,
        0.009327461943030357,
        0.07416456937789917,
        0.05300501734018326,
        -0.055850591510534286,
        -0.10770152509212494,
        0.04214872047305107,
        0.03679557889699936,
        -0.004601098597049713,
        -0.05509258434176445,
        -0.02896282821893692,
        0.04636779800057411,
        -0.0012963380431756377,
        -0.022442838177084923,
        0.046361278742551804,
        -0.049786973744630814,
        -0.08068656921386719,
        -0.06928954273462296,
        0.021520370617508888,
        -0.017456423491239548,
        -0.06498505920171738,
        0.0016702617285773158,
        -0.035815026611089706,
        0.002500728005543351,
        -0.08109799772500992,
        -0.08754070848226547,
        0.030175762251019478,
        0.041506074368953705,
        -0.06571377068758011,
        0.0054966299794614315,
        -0.044962771236896515,
        -0.02974621020257473,
        -0.08066324144601822,
        -0.09340038895606995,
        -0.023840827867388725,
        0.05258265137672424,
        0.0607256218791008,
        -0.03766663745045662,
        0.013852941803634167,
        -0.11161722987890244,
        -0.062230631709098816,
        0.05773378908634186,
        0.05860147997736931,
        -0.04203849285840988,
        0.10830579698085785,
        0.07719980180263519,
        -0.007700882386416197,
        -0.054767873138189316,
        -0.049335651099681854,
        -0.030853820964694023,
        0.06645698100328445,
        -0.024396799504756927,
        0.037682272493839264,
        -0.09727645665407181,
        1.0097229783282607e-32,
        0.021342234686017036,
        0.07537916302680969,
        -0.029399974271655083,
        0.08864729106426239,
        -0.03629295527935028,
        -0.01985342428088188,
        -0.02077745459973812,
        0.08897768706083298,
        -0.011638577096164227,
        0.030019519850611687,
        0.00010098114580614492,
        0.08065333962440491,
        -0.05564373359084129,
        0.05064183846116066,
        0.043896790593862534,
        -0.021768419072031975,
        -0.037246424704790115,
        -0.057114701718091965,
        -0.00555774662643671,
        -0.07193130254745483,
        -0.02526985853910446,
        -0.04452425613999367,
        -0.004111924674361944,
        0.12861524522304535,
        0.09036631882190704,
        0.041263092309236526,
        0.09430819004774094,
        0.050198815762996674,
        0.0853596106171608,
        0.0016193888150155544,
        -0.05285072326660156,
        -0.0389016829431057,
        0.0031146241817623377,
        -0.10078580677509308,
        -0.03616504371166229,
        0.018490152433514595,
        -0.032458268105983734,
        -0.013063300400972366,
        0.024083493277430534,
        -0.06106972321867943,
        -0.07073148339986801,
        0.014519264921545982,
        -0.052911750972270966,
        -0.04433165490627289,
        0.07943001389503479,
        0.04185710847377777,
        0.034574054181575775,
        0.031762197613716125,
        -0.009943666867911816,
        -0.007117236033082008,
        -0.051754098385572433,
        -0.07202552258968353,
        -0.01879231072962284,
        0.0017773500876501203,
        -0.0376819483935833,
        -0.09461360424757004,
        -0.004091850481927395,
        0.05482587590813637,
        0.013728572987020016,
        0.051159489899873734,
        -0.00013285118620842695,
        -0.009073733352124691,
        -0.011684990487992764,
        0.016843575984239578,
        -0.06232026219367981,
        0.07235904783010483,
        0.08851312845945358,
        -0.04249550774693489,
        0.0018817195668816566,
        0.08990153670310974,
        -0.05284340679645538,
        0.026861876249313354,
        0.0023736683651804924,
        0.03824114799499512,
        0.03926160931587219,
        0.025031665340065956,
        -0.021093470975756645,
        -0.09821175783872604,
        0.02656291425228119,
        -0.020124003291130066,
        -0.08416716009378433,
        0.05578010901808739,
        0.02487504854798317,
        0.11029241979122162,
        -0.010232933796942234,
        -0.10738573223352432,
        -0.02648249641060829,
        -0.05900266766548157,
        -0.005170552525669336,
        0.032726287841796875,
        -0.0018994812853634357,
        0.0386921651661396,
        -0.04493691399693489,
        -0.004188754595816135,
        -0.045962005853652954,
        -1.0987073864067294e-32,
        0.008002176880836487,
        -0.02176758274435997,
        -0.023239009082317352,
        -0.058547403663396835,
        0.03730396926403046,
        -0.03317144885659218,
        0.025822382420301437,
        0.05495285242795944,
        0.04654988273978233,
        -0.12098746001720428,
        0.010848326608538628,
        -0.02094362862408161,
        -0.09507052600383759,
        0.056260596960783005,
        -0.03745435178279877,
        -0.015037762001156807,
        -0.08218399435281754,
        -0.0700695663690567,
        0.0835578516125679,
        -0.018336277455091476,
        0.07446129620075226,
        0.10307279974222183,
        0.11295893043279648,
        -0.013297672383487225,
        -0.021876739338040352,
        -0.008026020601391792,
        0.029297668486833572,
        0.010725695639848709,
        0.052903465926647186,
        0.01459204126149416,
        0.002376991556957364,
        -0.11564251035451889,
        -0.059368424117565155,
        -0.01002419088035822,
        0.03125599026679993,
        0.0367814265191555,
        -0.0025525311939418316,
        0.02598659321665764,
        0.02661871537566185,
        -0.05658239498734474,
        0.04750754311680794,
        0.002614503027871251,
        0.03037531115114689,
        -0.007543930318206549,
        -0.00037752153002656996,
        -0.06858523190021515,
        -0.04057563096284866,
        0.0664326623082161,
        0.008265894837677479,
        0.05580417066812515,
        -0.057338614016771317,
        -0.02635037712752819,
        -0.02028712071478367,
        0.02018745429813862,
        -0.03363094478845596,
        0.007073463872075081,
        -0.0066791255958378315,
        -0.027756011113524437,
        0.05996985360980034,
        0.010592504404485226,
        0.05781753733754158,
        0.020899076014757156,
        -0.07727911323308945,
        -0.05320487171411514,
        -0.04707513377070427,
        -0.057970862835645676,
        0.07925429195165634,
        -0.0067322710528969765,
        -0.023594385012984276,
        0.03653767704963684,
        0.0248936265707016,
        -0.006824512500315905,
        0.00016606069402769208,
        0.012134362943470478,
        0.0022461451590061188,
        0.002375356387346983,
        -0.06562371551990509,
        0.01591595448553562,
        0.06727119535207748,
        -0.047049522399902344,
        -0.02123444527387619,
        0.06810064613819122,
        0.04094382002949715,
        0.0335761196911335,
        0.11066514253616333,
        0.10635625571012497,
        0.08497445285320282,
        -0.0008557257242500782,
        0.031991492956876755,
        0.09557089954614639,
        0.05867844074964523,
        0.06250079721212387,
        0.04203593730926514,
        0.11939435452222824,
        -0.0960807353258133,
        -5.45717924183009e-08,
        0.03176166117191315,
        0.020524416118860245,
        -0.01344467792659998,
        -0.07110141962766647,
        0.02823604829609394,
        -0.057808585464954376,
        -0.05375783517956734,
        0.04631514847278595,
        0.10022947937250137,
        -0.04719695448875427,
        0.06478045135736465,
        -0.012578400783240795,
        -0.035143379122018814,
        0.1122114360332489,
        0.02938220649957657,
        0.017095061019062996,
        -0.048415396362543106,
        0.0744500532746315,
        -0.0021776044741272926,
        -0.07006644457578659,
        -0.04427224397659302,
        0.08484663814306259,
        0.021481936797499657,
        -0.03307563439011574,
        0.013500003144145012,
        -0.013540640473365784,
        -0.021781034767627716,
        -0.03990691527724266,
        0.04501526057720184,
        0.025086289271712303,
        -0.01336151547729969,
        -0.02129855565726757,
        0.021502060815691948,
        -0.06564956158399582,
        -0.04658132791519165,
        -0.00144940335303545,
        -0.03317832201719284,
        -0.05786032974720001,
        -0.003964598756283522,
        -0.002768373116850853,
        0.0239581149071455,
        -0.08522623032331467,
        -0.04469003155827522,
        -0.0028032108675688505,
        0.009296474047005177,
        -0.09181809425354004,
        0.03149621933698654,
        -0.10719862580299377,
        -0.007321445737034082,
        0.009049157612025738,
        -0.07997354865074158,
        -0.017884787172079086,
        0.01927425153553486,
        -0.054213911294937134,
        0.025816660374403,
        -0.008323295041918755,
        0.048118289560079575,
        0.0050264447927474976,
        -0.009769079275429249,
        0.0028431201353669167,
        0.030183974653482437,
        0.008255047723650932,
        -0.04360606521368027,
        0.043160419911146164
    ]
}