{
    "id": "u2BsHgGuKjA",
    "title": "I'm never going back - HONOR Magic Vs",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-11-23T16:01:56Z",
    "video_url": "https://www.youtube.com/watch?v=u2BsHgGuKjA",
    "category": "Science & Technology",
    "tags": [
        "honor",
        "honor magic",
        "honor magic vs",
        "magic vs",
        "magic",
        "phone",
        "smartphone",
        "foldable",
        "folding",
        "folding phone",
        "tech",
        "review",
        "unboxing",
        "android",
        "samsung",
        "austin",
        "austin evans"
    ],
    "views": 410329,
    "likes": 12921,
    "comments_count": 626,
    "description": "Check out the HONOR Magic Vs!  Today I've got a bit of an old school video: Austin getting amped about future tech.   Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 The Foldable Phone Landscape 1:00 Design 3:01 Screen and Specs 4:36 Why Foldables Matter 7:01 Everyone Needs Competition",
    "description_links": [
        "http://bit.ly/3hWi7bM",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- I am currently at home sick which means that you're gonna get an old-school video today on something which is decidedly not old-school. This, my friends, is the HONOR Magic Vs, and of course, huge shoutout to HONOR for not only sponsoring this video, but more importantly giving me a very early hands-on of this device. Now, if you know anything about me, you know that I am a big fan of foldable devices whether they're small phones that get even smaller or large phones that get even bigger. There is a huge incentive, in my opinion, to try something like a foldable because it does give you so much more potential with the device that you carry around with you every day. Now, if you live in the US, there is exactly one main brand who are selling the vast majority of foldable devices. And let me be very clear, they've been doing a decent job. However, the problem is there's really not been a lot of competition, which means that while things are improving, the better the competition is, I think it always pushes an industry forward. And seeing what HONOR have done with the Magic Vs gives me a lot of hope for what we can expect to see going forward. Not only do we have some real innovations with this hinge tech but we also have some incredibly nice design. Like I'm telling you, this feels absolutely terrific. Not even just the ID and the sort of the rounded edges and the symmetrical design, like that all as important but the thing to me that is the most important when it comes to a larger format foldable display is the weight and the feel in the hand. If something is going to be very large, very chunky and very heavy, I'm not going to carry it. I always like the smallest, the lightest weight, the easiest to carry. And importantly, I don't want something that's gonna be huge and uncomfortable as I'm sort of typing on it all day long. And the Magic Vs is significantly lighter, it's significantly thinner, and importantly, with that whole symmetrical design, it's very comfortable to hold in the hand. You've also gotta make sure they can open and close hundreds of thousands of times without giving out. This one is rated for 400,000 folds, but on top of that, you also just need to think about the thickness and the weight. Now, because this hinge is comprised of only four pieces, yes, you heard me right, four pieces. Actually an individually cast piece which is the primary part of the hinge. It is first of all, lighter weight, which is important. It is also much thinner, but importantly, instead of having to use the gears and the very complicated mechanisms that a traditional foldable would need, it also means that you get an incredibly flat fold. So, you're not getting that extra bulge on the outside which pretty much all other foldables have and that has some major advantages. You can literally put a piece of paper in between the fold of the Magic Vs and it will stay nice and tight. I guarantee you, no other foldable that I've ever tried comes even close to that. What's also impressive about the hinge is that even though it is so simple and it has so many features, you still also do have the ability to use the phone in a folded configuration, which for me, is a huge win because not only can you use this as an impromptu tripod or something, but also if you're sitting in bed watching a video and you just set it down and the phone will stand up by itself, which I think is really nice. If it didn't have that, I'd be sad. 'Cause honestly, that's one of my favorite parts of a foldable device is that you kind of have your sort of a little built-in tripod. Now, when holding the phone like this, it looks like a standard smartphone, and that's for good reason. Unlike some other foldables which have sort of very tall, skinny displays, this is a 21:9 display. You've got yourself a 90% screen-to-body ratio, 1200 nits of brightness, 120 hertz refresh rate. I mean it's pretty much exactly what you expect on a very high-end phone, except that you can open it up and then you get access to the entire inner display. Now, this is where you're getting a 7.9 inch foldable which is going to be running at 90 hertz. And of course, this is what's going to give you that tablet-like experience. Now, outside of that, the specs are, of course, what you would expect with something which is a high-end flagship like this, get yourself the Qualcomm Snapdragon 8+ Gen 1. And on top of that you also have a trio of cameras around the back. You got yourself a 54 megapixel main camera. You also have a 50 megapixel ultra-wide and macro camera. And on top of that you do have a 3x 8 megapixel telephoto. There's also a 16 megapixel front-facing camera, both on the external display as well as on the internal display, which I think is a legitimately useful thing. You never know which posture you're going be using the device in, and that's really nice. Can I just mention for a second, folded this phone is only 12.9 millimeters thick, which is hardly that much thicker than a traditional flagship. And on top of that, they're able to fit a 5,000 milliampere-hour battery inside of the HONOR Vs. Now specifically, when it comes to this device, I've got a very early sample so this is the, essentially, a final hardware. However, the software is far from final, so I'm not gonna be able to talk about that too much although this will be launching in global markets in Q1 where I'll hopefully be able to take a little bit of a closer look. The thing that I have a problem with sometimes with some of the larger foldable devices is that they have a lot of potential. Like there's a lot of things you could do with them but, for me, they often kind of run into this sort of gray area where, yes, I could do this on my phone slash open it up into tablet mode but then a lot of times I feel like there's no point. Like I would rather just grab a laptop or something else that gets, quote unquote, real work done. And I think that is a key to selling someone on a foldable device. It's gotta give you, not only additional functionality, but also it needs to do that in a comfortable way where you don't feel like you're sacrificing. You don't feel like after you've been texting for 45 minutes, your wrists are ready to give up because you've been holding 'em at a weird angle or your palms are digging into the side of the device. And that, I think, is where the hardware, at the very least, has absolutely been a win with the Magic Vs. I don't typically do videos like this, and obviously, if I was not sick, I would be in the studio having a great time joking and laughing and all that kinda stuff, like we normally do. But this felt like a good opportunity for me to kinda make a little bit more of an old-school video. Not only because I've got this phone early, I've got it a few days early, I've gotta make sure this video goes live in time. But also foldables, to me, are something that it's a really important kind of part of phones. Like to me, foldables are where the most interesting phones are right now. And as someone who's been using a foldable phone every day for over three years now, I really care about this stuff, right? It's not something that necessarily seems super interesting to everyone. A lot of people will be like, oh, the durability this or that, or whatever the case is. But believe me when I say that foldables have come a long way over the last few years. Yes, there were some examples of a certain phone that was spectacularly not well designed at the beginning, but things have come a long way. And while, yes, there's still growing pains, yes, there's still things that need to be worked out. And yes, there's still are compromises when it comes to a device such as the Magic Vs. I mean, yes, it is an incredibly thin and lightweight device but also it is still going to be a little bit thicker and a little bit heavier than a traditional smartphone, right? But when you consider the trade-offs, when you consider what you're getting with this, where you get not only the external display, but also, importantly, you've got that massive 7.9 inch inner display, that, I think, is where things become a lot more interesting when it comes to evaluating foldable devices. Looking at this hardware gives me a lot of hope because what we need in the foldable space right now, is competition. We need multiple companies all trying their best to innovate, to improve, and to push the entire space forward. When it's only one company who's getting all the sales, they can kind of do whatever they want. But seeing things like this hinge which is massively simplified and as far as I can tell, simplify without really any downside, it's thinner, it's lighter, it feels like it's better across the board. And importantly, there's no gap in the phone which means that the foldable, which is already thinner by itself, is even thinner because you don't have to deal with that little wedge on the end. I've gotta give huge props to HONOR, and of course, I've gotta give them a huge thank you for not only sponsoring this video but, importantly, giving me an early hands-on of the Magic Vs. Definitely be sure to go check it out, at the link in the description. And let me know, not only what do you think about this old-school style of video that I would maybe make more of in the future but on top of that, let me know what you think about the Magic Vs. Now, if you excuse me, I'm going to go not use any of the non-final software I would never ever do that or anything, but, um, you won't tell if I don't tell, right?",
    "transcript_keywords": [
        "foldable",
        "Magic",
        "foldable devices",
        "phone",
        "device",
        "lot",
        "HONOR",
        "foldables",
        "importantly",
        "display",
        "video",
        "huge",
        "things",
        "give",
        "HONOR Magic",
        "kind",
        "devices",
        "phones",
        "hinge",
        "top"
    ],
    "transcript_entity_values": [
        "21:9",
        "only four",
        "1200",
        "5,000",
        "close hundreds of thousands",
        "first",
        "the Magic Vs",
        "hertz",
        "Qualcomm",
        "400,000",
        "a few days early",
        "only 12.9 millimeters",
        "four",
        "120",
        "50 megapixel",
        "90%",
        "one",
        "second",
        "7.9 inch",
        "90",
        "three years",
        "every day",
        "the Magic Vs",
        "the last few years",
        "only one",
        "54 megapixel",
        "US",
        "3x 8 megapixel",
        "today",
        "45 minutes",
        "Magic Vs",
        "16 megapixel"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "FAC",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "DATE",
        "TIME",
        "PRODUCT",
        "QUANTITY"
    ],
    "vector": [
        -0.10332193970680237,
        -0.01413403544574976,
        0.04132424667477608,
        -0.11259113997220993,
        0.019823690876364708,
        -0.0322243757545948,
        0.009294014424085617,
        0.038357511162757874,
        -0.054311420768499374,
        -0.020670641213655472,
        -0.01154320314526558,
        0.077678382396698,
        -0.012697909958660603,
        0.0004935701726935804,
        0.0200667604804039,
        0.02649517171084881,
        0.0016794443363323808,
        -0.015630224719643593,
        -0.0943082645535469,
        0.09026183187961578,
        0.06662675738334656,
        -0.03854406252503395,
        0.015890900045633316,
        0.03916722536087036,
        -0.024123327806591988,
        0.04164234548807144,
        -0.02426907978951931,
        -0.013877218589186668,
        -0.009091353043913841,
        -0.060638174414634705,
        0.05713609606027603,
        0.07295828312635422,
        0.04312494769692421,
        -0.05282270535826683,
        -0.0210927315056324,
        -0.014171569608151913,
        -0.0006739887758158147,
        0.03489889204502106,
        -0.11717018485069275,
        -0.010295983403921127,
        -0.06359279155731201,
        -0.023705972358584404,
        0.02375408448278904,
        0.051712874323129654,
        -0.011279597878456116,
        -0.06114406883716583,
        0.04685788229107857,
        -0.09717553108930588,
        -0.0019952808506786823,
        -0.035068899393081665,
        0.05508087947964668,
        0.04289299249649048,
        -0.019738316535949707,
        0.0009267106652259827,
        -0.09038260579109192,
        0.04423106089234352,
        -0.03465837612748146,
        0.02748304419219494,
        0.018564099445939064,
        0.04711060971021652,
        0.012620803900063038,
        -0.03198288753628731,
        0.010270362719893456,
        0.029342444613575935,
        -0.03363024443387985,
        -0.0028521548956632614,
        0.009783037938177586,
        0.02794015035033226,
        0.021456798538565636,
        -0.04552001133561134,
        -0.02977772057056427,
        0.010442085564136505,
        -0.05761769786477089,
        0.03842608258128166,
        0.10423620045185089,
        0.0746312364935875,
        0.03519682586193085,
        -0.11125681549310684,
        -0.04810682684183121,
        0.03538648411631584,
        0.01989120990037918,
        -0.0814201757311821,
        -0.017635831609368324,
        0.034318748861551285,
        -0.0026716161519289017,
        -0.048707831650972366,
        0.0066476380452513695,
        0.03157496824860573,
        -0.057728346437215805,
        -0.053532056510448456,
        0.006723502650856972,
        0.13378942012786865,
        -0.023933045566082,
        0.015694675967097282,
        0.006189456209540367,
        -0.04829051345586777,
        -0.043272715061903,
        -0.07585860043764114,
        -0.06024101749062538,
        0.11272978782653809,
        0.016381699591875076,
        0.06513343006372452,
        0.05751190334558487,
        0.11068382859230042,
        0.0470961257815361,
        -0.1054506003856659,
        0.010829833336174488,
        -0.04901356250047684,
        0.015917832031846046,
        -0.006473460700362921,
        0.07503184676170349,
        -0.017411526292562485,
        -0.04765135422348976,
        -0.012285222299396992,
        -0.034647904336452484,
        0.03275958076119423,
        0.014857056550681591,
        0.07859298586845398,
        0.08300676941871643,
        -0.016235018149018288,
        -0.029104357585310936,
        0.04463160037994385,
        0.013142975978553295,
        -0.08229728043079376,
        0.020301969721913338,
        -0.013588164001703262,
        -0.04374922811985016,
        3.7397555639304426e-33,
        -0.0016120719956234097,
        0.12218495458364487,
        -0.02014883980154991,
        0.07153376191854477,
        0.030096130445599556,
        -0.06679947674274445,
        -0.025667835026979446,
        0.016421977430582047,
        -0.030071279034018517,
        0.024292446672916412,
        0.03492762893438339,
        0.09519893676042557,
        0.019488556310534477,
        -0.00035930544254370034,
        0.06891156733036041,
        -0.036237966269254684,
        -0.043787553906440735,
        -0.027111360803246498,
        -0.03740926459431648,
        -0.012557054869830608,
        -0.025271492078900337,
        -0.017631957307457924,
        0.045847903937101364,
        0.0015314773190766573,
        -0.01110257487744093,
        -0.05102050304412842,
        0.0365903340280056,
        -0.007883245125412941,
        0.07300487160682678,
        0.0023048180155456066,
        -0.11138515174388885,
        -0.016437947750091553,
        0.01334073394536972,
        -0.08343338966369629,
        0.03422579914331436,
        0.06543299555778503,
        -0.04882962256669998,
        -0.11873116344213486,
        0.03180966526269913,
        -0.0007730414508841932,
        -0.07641735672950745,
        0.030042536556720734,
        -0.029105737805366516,
        -0.017143918201327324,
        0.05929769575595856,
        -0.012745256535708904,
        0.054116904735565186,
        0.027637196704745293,
        -0.024470049887895584,
        0.02832525596022606,
        0.007970497012138367,
        -0.041249148547649384,
        -0.032667919993400574,
        -0.11440153419971466,
        -0.07446935027837753,
        -0.06397812068462372,
        0.055394697934389114,
        -0.010404481552541256,
        0.07939175516366959,
        -0.02911708503961563,
        0.018244577571749687,
        0.03846585005521774,
        -0.01298297569155693,
        0.0708940178155899,
        -0.09416688978672028,
        0.034579262137413025,
        0.03029199317097664,
        -0.0014438481302931905,
        -0.007071204949170351,
        0.016416052356362343,
        0.0014300288166850805,
        0.044287629425525665,
        -0.0740642249584198,
        -0.06479243189096451,
        0.037075966596603394,
        0.04239392280578613,
        0.029784295707941055,
        -0.01602974161505699,
        0.01611534133553505,
        -0.019158922135829926,
        0.010703818872570992,
        0.006823271978646517,
        -0.014705152250826359,
        0.005896125920116901,
        0.05171108618378639,
        -0.07140126824378967,
        -0.01785619556903839,
        -0.12137819826602936,
        -0.02265326865017414,
        0.06262689083814621,
        -0.03948293626308441,
        0.012571677565574646,
        0.014089693315327168,
        -0.006592105142772198,
        -0.02556902915239334,
        -3.7887222504818835e-33,
        0.032923877239227295,
        -0.04246799275279045,
        0.06575092673301697,
        0.021299878135323524,
        0.11194989085197449,
        -0.05045762285590172,
        0.051450151950120926,
        0.09339182078838348,
        -0.003364545525982976,
        -0.042152345180511475,
        -0.0004924606764689088,
        -0.00040869819349609315,
        0.03359607234597206,
        -0.06009922921657562,
        -0.0046557276509702206,
        -0.04681351035833359,
        0.009126937948167324,
        -0.03498045727610588,
        -0.020299304276704788,
        0.08752308040857315,
        0.057577960193157196,
        0.09516916424036026,
        -0.0399746336042881,
        0.010778139345347881,
        -0.0660771057009697,
        -0.03255072608590126,
        -0.0011450278107076883,
        0.011787567287683487,
        0.09833644330501556,
        -0.06082003191113472,
        0.03309304267168045,
        -0.10205298662185669,
        -0.014384019188582897,
        0.07150136679410934,
        0.00439930334687233,
        0.0747331753373146,
        0.03028707765042782,
        -0.0030195466242730618,
        -0.017514871433377266,
        -0.11276662349700928,
        -0.028714310377836227,
        0.048789944499731064,
        0.012026668526232243,
        -0.06625469028949738,
        0.017540669068694115,
        -0.05618440732359886,
        -0.05252520367503166,
        0.06198927015066147,
        -0.0658469870686531,
        -0.06712844222784042,
        -0.021863726899027824,
        0.016501234844326973,
        -0.028441304340958595,
        -0.04546813666820526,
        -0.057038821280002594,
        0.025414004921913147,
        0.006920205894857645,
        -0.04117714613676071,
        -0.015709348022937775,
        0.07632666081190109,
        0.03997660055756569,
        0.0017271422548219562,
        -0.03798525780439377,
        -0.007723117712885141,
        -0.07708562910556793,
        0.08230875432491302,
        0.09569711983203888,
        -0.0036911179777234793,
        -0.1445818841457367,
        0.04935774579644203,
        -0.009114114567637444,
        0.02094961330294609,
        0.0036578208673745394,
        -0.0551605261862278,
        0.06009954586625099,
        0.09736021608114243,
        -0.0161695946007967,
        0.03003111109137535,
        0.0036516410764306784,
        -0.056926626712083817,
        0.026875311508774757,
        0.01148867979645729,
        -0.00989051815122366,
        -0.010035749524831772,
        0.03538527712225914,
        0.05319821462035179,
        0.0062716989777982235,
        0.01815914548933506,
        -0.03424568846821785,
        0.05719565600156784,
        0.0036811521276831627,
        0.034688834100961685,
        -0.0025917470920830965,
        0.046440403908491135,
        0.056388236582279205,
        -5.824683668720354e-08,
        0.0427296943962574,
        0.07057620584964752,
        0.036697883158922195,
        -0.015392258763313293,
        -0.07025152444839478,
        -0.05096889287233353,
        0.046775754541158676,
        -0.08061175793409348,
        0.0688617005944252,
        -0.030595457181334496,
        0.05976606532931328,
        -0.045165590941905975,
        -0.06764158606529236,
        0.08100120723247528,
        0.03942684084177017,
        0.0855923742055893,
        -0.012895675376057625,
        0.06156395003199577,
        -0.03423387184739113,
        0.05461488291621208,
        -0.03149588406085968,
        -0.008543561212718487,
        0.09276502579450607,
        -0.07604756951332092,
        0.011617005802690983,
        0.024301258847117424,
        -0.07623136788606644,
        0.030047820881009102,
        0.04358728975057602,
        -0.038215748965740204,
        0.027042074128985405,
        -0.002268389333039522,
        -0.02967316098511219,
        0.014878657646477222,
        -0.0197149608284235,
        -0.11437269300222397,
        -0.06382474303245544,
        -0.05026450380682945,
        0.043225061148405075,
        0.04947078973054886,
        0.09584520757198334,
        -0.07610484957695007,
        -0.009756049141287804,
        0.04853861406445503,
        0.03700054809451103,
        -0.029700567945837975,
        0.018170220777392387,
        -0.08049379289150238,
        -0.05892688035964966,
        0.06379500031471252,
        -0.013468206860125065,
        -0.11809646338224411,
        -0.0347258597612381,
        -0.03497472032904625,
        0.07897321879863739,
        0.06889371573925018,
        0.08439964801073074,
        0.038566648960113525,
        -0.062266115099191666,
        0.0036063147708773613,
        0.03267265856266022,
        -0.05987720936536789,
        -0.05660153180360794,
        0.058702874928712845
    ]
}