{
    "id": "U4otE9sE0mQ",
    "title": "iPhone XR Coral Unboxing and Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-10-23T12:45:00Z",
    "video_url": "https://www.youtube.com/watch?v=U4otE9sE0mQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iPhone XR",
        "unboxing",
        "review",
        "iphone xs",
        "iphone",
        "iphone xr",
        "iphone xr unboxing",
        "ijustine unboxing"
    ],
    "views": 2824347,
    "likes": 73343,
    "comments_count": 10198,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(music building up) (beat drops) - [Justine] I'm interrupting this cinematic slow-mo montage because this is so beautiful. It is the most perfect coral color. When I saw this at the apple event I actually freaked out. And now I'm having another freak out because it's here in my hands. And it matches my hibiscus apple watch band. Slow-mo montage, continue. (music playing) Here it is, the iphone XR in coral. This is probably one of my favorite colors, and I was so excited when I was at the actual event and saw these for the first time in real life. This was the color that I gravitated to. It comes in 6 colors total. This is the coral. It also comes in black, blue, white, red, and yellow. This is my favorite. I also really like the color of the yellow. It was so vibrant. But the good news is for myself, but not my credit card. I bought all 6 colors. So stay tuned for the unboxing of all 6 of those. Today we're just going to talk about some of the features, I'm going to be doing an extensive camera test. A lot of my reviews do focus a lot on the camera and video because for me personally, that is what I do most of. That is like my entire life revolves around creating content for you guys. And even when I'm not creating stuff for you, I like capturing these memories for myself. So being able to have a great phone that takes incredible photos and videos with me at all times is such a great thing, and the best part about this - the XR - is it has so many features that it shares with the XS and the XS max, that even after using this for the past couple of days as my main phone, it's almost difficult to tell the difference between the two. My main phone since it came out has been the iphone XS max, and in comparison to the XR you can see that the size isn't really that much smaller then the XS max. Also, slightly bigger then the XS, just by a little bit. The biggest psychical difference is the display. Of course besides from the colors. This is a 6.1 inch liquid retina HD display. Apple says this is the largest LCD they've ever had on an iphone. Now you might be saying Justine, but the XS max is bigger then the XR. Yes, that is because that screen is not an LCD. The iphone XS max is a 6.5 inch super retina OLED. Whereas the Xs is a 5.8 inch super retina OLED. What that means is the displays on the XS and the XS max are a little higher resolution then the XR. So that's one of the way they're able to make this phone way more cost efficient. Another physical difference is the band around this phone is made of aluminum instead of stainless steel. So not are you only cutting some costs there but you're also making this phone so much lighter then the other two. This shares so many similarities with the XS and the XS max that I feel like most people aren't even going to notice the difference. Like I don't even think that you can tell if you're holding it up next to each other. The XR also features face ID, it has the all glass black. It has the durable gloss front. A12 bionic chip. It's water resistant up to 1 meter. It has stereo sound. It also will do wireless charging, has the dual SIM. All of this just like the XS. But one of the other big differences is it only has one camera. So much like it's little friend here the XS, the XR features the same wide angle lens and larger sensor that the XS has. (music) So now we're going to test some portrait mode on both of these phones. I'm really excited because the portrait mode on the XR is surprisingly incredible. And what's different is there's only one lens as apposed to the two that are on the XS, X, and the XS max. So as you can see over here on the XS max it's way more zoomed in because it's using the telephoto for portrait mode, and the XR is not, it's using the one lens it has and that's the wide angle lens. Oh I'm actually super impressed. With only one lens it no longer does the zoom portrait like the XS or the XS max or the X. So this took a few shots to get used to. Let's carry on and take some more pictures. (music) But overall I was super impressed with how well this worked on these shots. (music plays louder) The portrait mode on the iphone XR is only supposed to detect people. Much like the previous phone where it can kind of sense different depths. You can get some pretty decent portrait mode shots of your animals and pets and whatever else is in frame. But because this only has one lens, it uses various algorithms to detect people. No person detected. So portrait mode. So now, let's see if it'll detect me. - Oh it's already detected you. - [Justine] Well yeah, obviously, cause I'm a person - Are you? (music playing) - [Justine] The adjustable aperture has been one of my favorite things in these new phones. It doesn't just blur the background, it accurately trys to replicate the bokeh that a DSLR lens would create when switching up the aperture. I always tend to focus so much on the portrait mode photos because it is what kind of makes these phones unique now. Is being able to take these shots on a phone, that essentially will replicate a shot that you would be getting with a high end expensive camera, with and incredible lens. It's everyone's favorite thing to criticize portrait mode shots. It's kinda zoom in and see where there's artifacts, or where the details are left out or where something should have been blurred, and it shouldn't have been blurred. Whatever it is, no matter what phone it is, I feel like a lot of people do that, and I think it's pretty fair because it is something that is new in the past couple of years. It is great to see that it has been getting so much better. Not just on the iphone but on other phones as well. Even just regular photos on the XS and the XS max and the XR are amazing, obviously because they do share pretty much the same front and back camera. Cause like I said, you've only got one. God this phone looks so good. I just, everytime I look at it, I'm just (gasps) It takes my breath away. (music plays louder) So the smart HDR does a really great job of kind of levelling out photos, whether it's too bright or too dark, it pulls out shadows where they need to be pulled out, the highlights it can bring them down. So it's taking a bunch of photos at the same time and then magically stitching them together to give you one perfect photo. So there was a huge beauty gate controversy where people were saying that the iphone was blurring their skin trying to make you have a flawless complexion. Which a lot of times it may seem that that's what it's doing but because the smart HDR pulls out a lot of the shadows you can tell in this photo specifically, this is shot on the X, and this is shot on the new XR. It is pulling out all of the shadows around my face so yeah it may actually be giving sort of a skin smoothing effect but this photo that was shot on the XR I think looks way better then shot on the X. Maybe the X was over pixelizing our photos and the XR is just normalizing them and making us look fantastic. We've been talking a lot about photos but let's not forget the video. XR also shoots sixty frames a second at 4K. Also 4K30 and it will shoot slow-mo in 240 at 1080p. I shot an entire mini vlog using the XR and it was crazy because I really felt like I was just using the XS when I was editing the footage. Like it looked exactly the same. (music plays) Hey guys today we're at Coalor Ranch, and I am testing out the brand new iphone XR. Why don't you share with the rest of the class? (singing) Brianne - Yo - Are you excited? - I sure am, could we sit by each other on the bus? - I think we can. (music) Another plus side to the XR is the battery life has been increased by an hour and a half. So if you're comparing the XR to the iphone 8 this will get you an extra hour and a half battery and I definitely noticed the battery life on this has been amazing. So I felt that this has been on par with what my XS max has been getting. (music) With the release of AR kit 2 developers have been working on so many more things for the iphone, and with the A12 Bionic chip, you're getting so much more power and everything is so much faster. The ability for AR apps to just be seamlessly integrated into your daily life like shopping. Have you guys experience augmented reality shopping yet. It might be my new favorite thing. When I saw it for the first time at a WWEC demo I was like this is the future. Well the future is now here. So the first one we're going to do is this magnolia bag. So anytime you see this little icon you can click that. Obviously this isn't going to be on every website but if it is something that developers have on a site, you can see what this will look like in real life. Okay so here it is, you can scan around. You can zoom in. But I want to see what it's going to look like on this beautiful couch right here. Yeah I know right, it's freaking cool. And I can move it around but that's not even the coolest part about it. I'm getting so close to this bag I can freaking see the buckle. Oh my gosh, the only time that I tried this out was a demo, and this is the first time that I'm doing this myself. No way man. (chuckle in background) No way, okay, I'm, you're going to think I'm over reacting, but this is so cool. So I can also put it somewhere else. If I say what would it look like over here by Bree's room. This is something that I know you'll be into Jenna. It's a bicycle. (gasps) There it is. What, hey I got to back all the way up so I can see this bike in full view. Hey Bree. - Yeah - Come here and see this bike. - What are you talking about? - [Justine] Don't run into the bike You walked into the bike. - What? Yeah actually stand by it so I can see how big it is. Okay that's nice. - Am I on it? - You're kinda on it Look at the, look how close I can get to the bike. Let me know what you guys think of AR shopping. Is this a huge feature, do you love it, do you think it's crazy? If you do have an iphone with this enabled, definitely go try it out and let me know what you guys think. Another app that I'm really excited to try, that I'll be a video on later on is called HomeCourt. So it helps you track your shots and it will help you train to become a better basketball player and I'm not very good at basketball but I do plan on testing this out so maybe I can find somebody who is actually good at basketball to help me with this. But just this whole concept of using your phone in augmented reality to help you train better for whatever it is that you're training for, I absolutely love yoga and I've been doing that very consistently this year and I think it would be so cool to have an augmented reality yoga app. Maybe there is one, if there isn't somebody please work on this. There are so many other iterations of AR that I think would be so much fun. There's a SIM's game where you can take your SIM and put it in the real world. I had never played SIM's on the iphone and I feel like it is the most perfect game for the iphone. Because you can just zoom in. Why am I zooming in on my virtual hand. I can bring the game up. I have mail. Oh yeah, I'll claim my rewards. You can zoom, you can move around. Everything is touch, so when you're building you just kinda, you can drop things in move them around. I think I found a new fun iphone game that I'm going to play and I am upset with myself because I feel like it's going to suck a lot of my time in, just like previous SIM's games. So all in all my takeaway from using the XR is I think it is the most affordable and most powerful phone that apple has ever created for people. And it is beautiful, it is fast, this thing has been really awesome, and going from the XS max to this for the past couple of days it's been crazy because I thought that I would be able to tell a difference but I really haven't at all. Even when taking photos the portrait mode is really cool. I've been really enjoying the single lens portrait mode. I was kind of impressed with all the photos I was able to achieved with that. So if you are in the market for a new iphone you're probably saying Justine, which phone do I get? I don't know, I can't answer that for you. That is a very personal thing. You now have three models to choose from. You have two sizes in the XS and 3 colors in each, and you have 6 different color options in the XR. So this is kind of overwhelming. I'm overwhelmed just thinking about it and making this video. So honestly if I were to suggest a phone for you to get, if I had to. This XR for the price and for what you're getting. I mean this is, it's, it really is perfect. (music) Thanks for watching, I will see you guys in my next video I have a bunch of fun ones coming up, so if you aren't already subscribed to my channel be sure to do so, and make sure you hit the bell so you'll be alerted when I post new videos. I want to know from you guys, which XR color is your favorite? Also, which phone do you currently have? And lastly please be kind in the comments. I will see you guys soon, bye. (music)",
    "transcript_keywords": [
        "portrait mode",
        "phone",
        "iphone",
        "max",
        "portrait",
        "mode",
        "portrait mode shots",
        "photos",
        "lens",
        "kind",
        "guys",
        "shots",
        "shot",
        "color",
        "colors",
        "lot",
        "SIM",
        "phones",
        "time",
        "interrupting this cinematic"
    ],
    "transcript_entity_values": [
        "Xs",
        "AR kit 2",
        "Bree",
        "sixty",
        "second",
        "Coalor Ranch",
        "an extra hour",
        "one",
        "the past couple of days",
        "SIM",
        "XR",
        "XS, X",
        "Apple",
        "Justine",
        "XS",
        "Bionic",
        "Today",
        "1 meter",
        "6.5 inch",
        "Slow-mo montage",
        "the past couple of years",
        "XS",
        "240",
        "WWEC",
        "up to",
        "three",
        "LCD",
        "6.1 inch",
        "an hour and a half",
        "HomeCourt",
        "8",
        "XR",
        "XS",
        "3",
        "6",
        "XS max",
        "only one",
        "today",
        "this year",
        "two",
        "A12",
        "Brianne - Yo - Are",
        "DSLR",
        "first",
        "5.8 inch",
        "hibiscus apple watch",
        "Jenna",
        "XS max"
    ],
    "transcript_entity_types": [
        "FAC",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "QUANTITY"
    ],
    "vector": [
        -0.02954009734094143,
        -0.058908611536026,
        -0.019431328400969505,
        -0.10162912309169769,
        0.023703202605247498,
        0.019274145364761353,
        0.019122498109936714,
        -0.0032513022888451815,
        -0.026717618107795715,
        0.003935228101909161,
        0.059653788805007935,
        -0.017722349613904953,
        -0.002870870754122734,
        0.023081297054886818,
        -0.026982491835951805,
        0.06585406512022018,
        0.0040764035657048225,
        -0.022521566599607468,
        -0.01279930304735899,
        0.06176595017313957,
        -0.020289165899157524,
        -0.028672004118561745,
        0.01602124609053135,
        0.01269992534071207,
        -0.014177338220179081,
        0.06105270981788635,
        -0.013589986599981785,
        0.010991484858095646,
        -0.0860464870929718,
        -0.08284527063369751,
        0.0008259079186245799,
        0.03861832991242409,
        0.10158823430538177,
        -0.01488642767071724,
        0.023651383817195892,
        -0.05212989076972008,
        0.014097882434725761,
        -0.00885021686553955,
        -0.015897057950496674,
        -0.03159967437386513,
        -0.01265263743698597,
        -0.05176803842186928,
        0.023402899503707886,
        0.017319144681096077,
        -0.07444582134485245,
        -0.045770805329084396,
        0.03525981307029724,
        -0.04441508650779724,
        0.03189833462238312,
        0.019746527075767517,
        -0.036031339317560196,
        0.0006648104172199965,
        0.018005957826972008,
        0.04977840557694435,
        -0.06454382836818695,
        -0.003343765391036868,
        -0.08258473128080368,
        -0.01489770133048296,
        0.0518929585814476,
        -0.12272022664546967,
        0.049230072647333145,
        0.036419063806533813,
        0.028643539175391197,
        0.06200578436255455,
        -0.04833467677235603,
        -0.042379822582006454,
        -0.021529611200094223,
        0.016642142087221146,
        0.0065405466593801975,
        0.0211432296782732,
        -0.09506472945213318,
        0.03900180384516716,
        -0.004732832312583923,
        0.00474508386105299,
        -0.0004366773064248264,
        0.06850001960992813,
        0.02386053092777729,
        -0.05914507433772087,
        -0.02927115187048912,
        0.056196000427007675,
        0.04731004312634468,
        -0.0317523330450058,
        -0.032284993678331375,
        -0.008414204232394695,
        0.05217365548014641,
        0.0192792359739542,
        0.0035153531935065985,
        0.039469555020332336,
        -0.0638376995921135,
        -0.07953329384326935,
        -0.05445101857185364,
        0.02267877571284771,
        -0.0004742704622913152,
        -0.0031369486823678017,
        0.0029082351829856634,
        -0.07383555918931961,
        -0.01620168797671795,
        -0.036395344883203506,
        -0.04959256574511528,
        0.031551167368888855,
        0.08042509853839874,
        -0.07033127546310425,
        0.0012241810327395797,
        -0.055452343076467514,
        -0.01864064298570156,
        -0.1276896446943283,
        -0.054298967123031616,
        0.00895370077341795,
        0.0009035342372953892,
        0.07130515575408936,
        -0.07245989143848419,
        0.029265213757753372,
        -0.07453443109989166,
        -0.03366956114768982,
        -0.0016941470094025135,
        0.13678625226020813,
        -0.028780750930309296,
        0.10317197442054749,
        0.04150037840008736,
        0.004758030641824007,
        -0.024612460285425186,
        -0.1288069188594818,
        -0.036137904971838,
        0.040576644241809845,
        0.01401106733828783,
        0.0004658431571442634,
        -0.0646992102265358,
        1.3356463460406053e-32,
        -0.05026017874479294,
        0.05541665479540825,
        -0.042870037257671356,
        0.04218660295009613,
        0.04099345952272415,
        -0.04222399368882179,
        0.0342707522213459,
        0.08301355689764023,
        -0.01070288848131895,
        0.05937928706407547,
        0.0056890761479735374,
        0.05741078034043312,
        -0.06567321717739105,
        0.02782318741083145,
        0.017684251070022583,
        -0.058008935302495956,
        -0.045684415847063065,
        -0.042921554297208786,
        -0.07434144616127014,
        -0.02208090014755726,
        -0.001512744463980198,
        -0.01337471790611744,
        -0.027350306510925293,
        0.08642081916332245,
        0.07194235175848007,
        0.08706417679786682,
        0.034835875034332275,
        -0.011709065176546574,
        0.0652453601360321,
        -0.0004034718731418252,
        -0.040764085948467255,
        -0.06490664929151535,
        0.01099075935781002,
        -0.07032852619886398,
        -0.009859387762844563,
        0.03250347077846527,
        -0.046351972967386246,
        0.01236354187130928,
        -0.004160003270953894,
        0.0013877986930310726,
        -0.03425418585538864,
        -0.0033639571629464626,
        -0.028470369055867195,
        -0.05764550343155861,
        0.11254975199699402,
        0.03885355964303017,
        0.006012678146362305,
        0.05716792494058609,
        -0.04052852466702461,
        -0.012785317376255989,
        0.008540739305317402,
        -0.060462839901447296,
        -0.07522518932819366,
        -0.012036156840622425,
        -0.006838910281658173,
        -0.07315529882907867,
        -0.048331234604120255,
        0.06556230038404465,
        -0.011564478278160095,
        0.058590471744537354,
        0.0048270924016833305,
        -0.016823124140501022,
        -0.03221128508448601,
        -0.03818640485405922,
        -0.07795946300029755,
        0.11207707226276398,
        0.037893146276474,
        -0.0790817141532898,
        -0.018647095188498497,
        0.056917931884527206,
        0.003924588207155466,
        -0.00048498951946385205,
        0.06347953528165817,
        -0.0032992505002766848,
        0.037222057580947876,
        0.06908400356769562,
        -0.07639499753713608,
        -0.0719732791185379,
        0.02734217792749405,
        -0.017480703070759773,
        -0.06426995992660522,
        0.1037881150841713,
        0.0027385156136006117,
        0.10658110678195953,
        -0.028199706226587296,
        -0.07674165070056915,
        0.013086399994790554,
        7.859189645387232e-05,
        -0.007681208197027445,
        0.08726517856121063,
        0.023498008027672768,
        0.027268361300230026,
        -0.10647044330835342,
        -0.04685624688863754,
        -0.02984081581234932,
        -1.2729770687784228e-32,
        0.004238275811076164,
        0.019705727696418762,
        0.03680471330881119,
        -0.016053279861807823,
        0.043581899255514145,
        -0.025549257174134254,
        0.04736299440264702,
        0.11518122255802155,
        0.09299325942993164,
        -0.10920300334692001,
        0.03917229175567627,
        -0.03329962491989136,
        -0.1056060642004013,
        0.04706914350390434,
        -0.055968027561903,
        -0.01059802621603012,
        -0.028868507593870163,
        -0.0452517494559288,
        0.02707587741315365,
        0.027661897242069244,
        0.08913259208202362,
        0.11408896744251251,
        0.06999019533395767,
        0.020463166758418083,
        -0.01784847304224968,
        0.019916579127311707,
        0.0454864464700222,
        0.038381483405828476,
        0.08026700466871262,
        0.037226464599370956,
        -0.01621205545961857,
        -0.062089793384075165,
        0.00524476682767272,
        -0.01455268170684576,
        0.02440200373530388,
        0.02166186086833477,
        -0.0037891652900725603,
        0.05262451618909836,
        -0.006492843851447105,
        -0.08755229413509369,
        0.020402446389198303,
        0.021391216665506363,
        -0.03371858596801758,
        0.0003287839354015887,
        0.01427614688873291,
        -0.0757284015417099,
        -0.042710479348897934,
        0.06179273873567581,
        0.04062617942690849,
        0.039392273873090744,
        -0.08149897307157516,
        -0.05246477201581001,
        -0.02304643578827381,
        0.008071484044194221,
        -0.042228635400533676,
        0.045995473861694336,
        -0.047168318182229996,
        -0.019763153046369553,
        0.06289627403020859,
        0.01596846617758274,
        0.05174455791711807,
        0.011963282711803913,
        -0.08858022838830948,
        -0.08890452980995178,
        -0.0019594787154346704,
        -0.0856039896607399,
        0.07493604719638824,
        0.010347864590585232,
        -0.012720054015517235,
        0.03288288414478302,
        -0.02261296659708023,
        0.016917210072278976,
        0.018996726721525192,
        -0.022079231217503548,
        0.04345742240548134,
        0.023008255288004875,
        -0.11930464208126068,
        -0.03657889738678932,
        0.05766616016626358,
        -0.050706230103969574,
        -0.05529557541012764,
        0.04238206520676613,
        0.044806551188230515,
        0.04763229936361313,
        0.11055304110050201,
        0.10122253000736237,
        0.09972796589136124,
        -0.02671922743320465,
        -0.017714111134409904,
        0.004989521577954292,
        0.0429459810256958,
        0.021889861673116684,
        0.07358766347169876,
        0.09820803999900818,
        -0.09229639917612076,
        -6.251608652974028e-08,
        0.040914136916399,
        0.0011178849963471293,
        -0.03122544474899769,
        -0.05113953724503517,
        -0.009166053496301174,
        -0.08057171106338501,
        -0.00893375650048256,
        0.02700146846473217,
        0.07828443497419357,
        -0.05114058777689934,
        0.09027480334043503,
        -0.021438244730234146,
        -0.05891313776373863,
        0.12387342005968094,
        0.03797384351491928,
        0.005494133103638887,
        -0.04475894942879677,
        0.08850091695785522,
        -0.03253081440925598,
        -0.07583215832710266,
        -0.03291179612278938,
        0.06230798363685608,
        0.04504002258181572,
        -0.01809794083237648,
        0.03861718997359276,
        0.03703775256872177,
        -0.000322321749990806,
        -0.009450680576264858,
        0.05584438145160675,
        -0.011393871158361435,
        -0.05725439637899399,
        0.007953561842441559,
        0.028492024168372154,
        0.027877571061253548,
        -0.05725175887346268,
        -0.025599513202905655,
        -0.061568889766931534,
        -0.03990456461906433,
        0.03236781060695648,
        -0.008521148934960365,
        0.03613009676337242,
        -0.13746939599514008,
        -0.05485113710165024,
        0.003632022999227047,
        0.04971796274185181,
        -0.08730830252170563,
        0.05284915119409561,
        -0.1015733927488327,
        -0.03236795589327812,
        -0.026301387697458267,
        -0.021096957847476006,
        -0.0005336268222890794,
        0.009141205810010433,
        -0.07455077022314072,
        0.09506265819072723,
        -0.001929938211105764,
        0.022433513775467873,
        0.08984189480543137,
        -0.03586558997631073,
        0.00410001166164875,
        0.008393638767302036,
        0.005935124587267637,
        -0.04631702974438667,
        0.027364011853933334
    ]
}