{
    "id": "u4RkkjiYu0k",
    "title": "I Bought a Soviet Era Gaming Mouse - MARS UKV-01",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-09-09T17:25:34Z",
    "video_url": "https://www.youtube.com/watch?v=u4RkkjiYu0k",
    "category": "Science & Technology",
    "tags": [
        "mouse",
        "HID",
        "antique mouse",
        "russian mouse",
        "ukv-1",
        "mars mouse",
        "martian mouse",
        "arduino",
        "pico",
        "raspberry pi pico",
        "raspberry pi",
        "ball mouse"
    ],
    "views": 2275337,
    "likes": 93679,
    "comments_count": 4959,
    "description": "Looking for electronic components and equipment? Consult the specialists! Head over to  and save 10% using code LMG  Win a Hennessey Ford Bronco or $75K cash with no purchase necessary with the Ridge Wallet sweepstake! Check out the link below:   Can we make an antique mouse from the Soviet Union work with a moderncomputer? Can we make it work well enough to play games?  Discuss on the forum:   Buy a Raspberry Pi Pico Microcontroller:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:28 They see me rollin' 4:04 Surely this will work 6:12 Pushing my buttons 7:20 That was fast 9:07 Right Turn Only 10:53 What are we doing wrong? 12:50 From downtown! 15:07 Outro",
    "description_links": [
        "https://lmg.gg/CircuitSpecialists",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1530630-i-bought-a-soviet-era-gaming-mouse/",
        "https://geni.us/i0FCKl0",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "How cool is this? Even the box is amazing. The moment I saw this Soviet era mouse on eBay, I couldn't help myself. I had to hit buy it now, or at least the closest thing I have to a buy it now button ever since they took away my eBay login, which is justified because I keep doing things like this, but come on! I mean, I've never seen anything like this before. These things just didn't make their way to the West and I know what you're thinking. Wow, Linus, an old mouse. Maybe it has non-ergonomic buttons and a rubberized ball that, by the way, I get to install myself apparently. Cool, I wonder if it's beige. Actually, Captain Obvious, it's more of a light gray. You probably also think that this is a serial port, don't you? I mean, we certainly did, but as we discovered, in order to fulfill our legal obligation of playing Doom on this thing, now that we have it in our hands, it was gonna take a lot more than just plugging this into a legacy port on a modern computer. Thanks, labs team. Meet the Mars UKV-01 coordinate input device. We are gonna have a lot of fun with you and a lot of fun with our sponsor, The Ridge. Win big with The Ridge's Hennessy sweepstakes. You can get one bonus entry for every dollar spent on Ridge products or up to 1,000 for every dollar spent on custom products from Hennessy Performance. Use the link below for 10 bonus entries to a chance to win a Hennessy 4 Bronco and more. Even before we get beneath the surface, there's so much to love about this thing. I mean, ball mouse, huh? Is this what a Soviet hand was shaped like? Also, the clicks are rather unique. See, one of them is clicky and one of them is mushy. And from what we've seen, that's actually consistent across all of these, I guess. So you could tell which button was which because you're not sure where your fingers are. I mean, if your hand is shaped like this, yeah, maybe you have completely different fingers like I've never seen before. It's BYOB, bring your own ball. Okay, it's included in the box, but you do have to install it yourself. I gotta say the cable, wow, that sucks. In all seriousness though, other than the age, this is a remarkably well-preserved specimen and one of only a handful of mice that was produced in Russia in the late 80s and early 90s as the Soviet Union was collapsing. The UKV-01 was better known as the Martian. And while it could be used with several of the different microcomputers that were available at the time, it's best known as the mouse for the BK-0010, the most widely produced Soviet home computer. The BK series was the product of a government-run computer literacy effort, kind of like the BBC Micro in the UK. It had 32 kilobytes of RAM and a 16-bit PDP-11 compatible CPU running at three megahertz though apparently you could overclock it to a whopping nine megahertz. There was no operating system, just a BIOS and a focal interpreter in a 32 kilobyte ROM, but you could get a basic interpreter as an upgrade module, which was enough for a huge homebrew community to spring up around this machine, creating and sharing both games and other programs. The Martian then was designed to give the BK-0010 and other late Soviet microcomputers more input options, kind of like the older Kolobok did for the Russian IBM PC clones like the EC1841. It was available in multiple colors and three configurations with two including cards to interface with specific computers and the third, so that's the one that we got, which was meant to connect to the UP port of the BK-0010. This would have cost 150 rubles at the time, which according to our seller would work out to about 350 US dollars today, which funnily enough is actually what we paid for it. Of course, we didn't know any of this stuff before we bought the Martian, we just thought it looked cool. Let's take it for a spin or a roll. In theory, all we need to connect to a modern computer is a serial port, which surprisingly is easy enough to find even on modern gaming rigs. The only challenge is that this is obviously not an external serial connector, so we need to access the header somehow, which aha, here we go. And yeah, it was never gonna be that simple. I mean, our first clue should have been that none of the holes on the connector were keyed, but we thought, who knows? Maybe they just wanted to save a penny or a copec as it were on the connector and we could just flip it around, no dice there. And before you ask, yes, we verified that the Windows serial mouse driver is installed. So this is clearly gonna be more complicated, but if at first you don't succeed, hey, there's always the manual. Unfortunately here, my detective skills tell me that this manual is in some kind of foreign language. And while I've got to give them full credit for including not just a nice little drawing of the mouse, but even full electrical schematics, that's so cool, right? This is also in a foreign language. And while a surprising number of folks around here are able to sound out the words from the Cyrillic letters, none of them were sure what any of the words meant, so that doesn't really help us that much. The good news is that the Russian documentation did point us in the right direction though. This part of the schematic right here looks an awful lot like a pinout and this diagram in the manual looks like a conversion between two different types of connectors. So between the two drawings and knowing that Russian uses a B for a V sound, we figured that pin 10 probably wanted plus five volt and pin seven and eight were probably ground. Now, both of the drawings show plus and minus X and plus and minus Y, but we figured motion was gonna be pretty tricky and we decided to ignore those and start with the buttons, thinking those would be more straightforward, which we actually were right. KH1 and KH2 are indeed our buttons, which we were able to verify with a multimeter, reading high when open and low when closed. So armed with that knowledge, all we needed to do was figure out how to get the PC to take in those values, what all the other pins do and how motion is reported. So Jordan from the writing team got as far as grabbing an Arduino from the warehouse before he realized that we have a whole lab full of really smart people who do this kind of thing every day and handed it off to them. It was at that time that we also started having some luck with our Google searches. We found this post on a Russian language FPGA forum that once we ran it through Google translate, gave us a wealth of historical information about Matt Damon, sorry, excuse me, the Martian. For instance, it confirmed what we had already figured out about the pin out and it expanded on that with some additional technical details. We learned for example, that one of the adapter cards for the mouse pulled it around 50 times a second and that there was a reset pin. Though the reason for the reset pin existing took us some time to figure out. Full credit to the writing team for the effort they put into things, but boy does the lab ever get things done fast. You can see we've ditched our Arduino for a Raspberry Pi Pico to translate the Martian input to standard USB HID signals. And they were apparently able to get us to this point in only about half an hour. Here we go. This is my first time getting to click on it. They did all this without me to, okay, left click, right click, ah. Basically what you're looking at here is the Pico reads the voltage on the two pins for the mouse buttons and then it sees if there's a state change. It will either click or unclick the appropriate button and then it loops back to reading the buttons. This is a super compute intensive way of handling input, but it's working. There might not be a lot of games that we can play like this, but there are at least some, ah, oh crap. Okay. Okay, this is really hard. I don't think Flappy Bird was this hard. Look how much he bounces with each click. Oh shoot. Oh, you're very good at Flappy Bird. Of course, we're pretty limited in terms of the kind of games that we can play with only a left and a right mouse click and getting motion working, that's gonna take a lot longer than half an hour. I mean, we know which pins it is. It's the plus minus Y and plus minus X, but what does, for example, plus Y indicate that we moved up in the past, that we are actively moving up right now? Maybe it's not even a simple binary signal and it's a variable voltage that indicates speed or distance traveled or something like that. Oh wow, that would be awful. Good news though. Labs ruled out the variable voltage theory pretty quickly and they came back with a fairly janky version too that did add motion. Oh wow, that is, good job labs team. Oh, okay. I can kind of move right by doing this. It only moves right? Okay. Bah! Oh, I got the shotgun. Oh, now I just have to turn around. Obviously then, while not nothing, our first attempt wasn't the home run that we hoped it would be and we weren't really sure where to go from here. There could be any number of problems at this point. Could we be misinterpreting the signals? Absolutely. Could there be a problem with the hardware? I mean, totally. It's 30 years old, no matter how new it looks. And I mean, why not both of those things? So at this stage, we felt it would be prudent to crack her open and give her a little exam. Stubby screwdriver, now available, lttstore.com. Ooh, wow. While we might look at a design like this today and say, boy, that's pretty rudimentary and simple, you gotta give it full credit for longevity. I mean, it's hard for a trace that thick to spontaneously fail from heating and cooling cycles. Also, these really are two different models of Switch. They intended for them to feel different. Input comes from these rotary encoders here, which, I mean, we gave a light cleaning to, but that did not make any difference whatsoever because, I mean, look at this thing. It's basically immaculate inside. So we're probably misinterpreting the signal, which unfortunately is a much more difficult fix. Of course, with this much invested in the project, what were we gonna do? Give up? No. So the labs poured over the schematics and identified the two integrated circuits at the heart of the mouse as the K561TM2, which, when you track down a data sheet and then translate it, turns out to be a flip flop, which is basically one bit of memory, a zero or a one. And each of our two ICs contains two of these flip flops along with the ability to clear or reset them. And suddenly, that reset pin that we couldn't figure out before becomes the star of the show. As it turns out, the flip flops are telling us which direction or directions that the mouse last moved, positive, negative, or stationary on each axis. Then all we have to do is reset the flip flops to their default state, wait some tiny amount of time, and then check them again to see what's happened, rinse and repeat forever. Our Pico then can take that information and tell our cursor to move slightly in whatever direction we're meant to be moving. Now, we're not sure how often it would have gone through these cycles on a BK series, but through trial and error, we were able to push it to around 4.5 kilohertz or around 4,500 times a second. I mean, that seems pretty solid, right? I should be able to game on, yeah, 4,500 times a second. Maybe. Oh, oh, hey. I mean, there is no question in my mind, this mouse is working. I'm not only able to play, I'm able to enjoy playing the game. Flipping crazy. By the way, did the shotgun take that guy out from here? Little bit. Wow, mouse pointer speed, yes. Let us increase. Wow, that is still not great. I mean, good job, labs team. What I will say though is compared to the cable, the ergonomics are far more bothersome. My wrist is already acting up. I've been using it for like five minutes. This is atrocious. It's like we had plastic molding technology, but we didn't have the technology of what shape is an actual human hand. And that's far from the only problem. While it is usable, it's really slow. I am all over my desk pad here. And these are both things that we could fix, right? Like if we tweak the Pico to move farther, right? On each pole, then yeah, it could be a lot faster, but that would make the jitteriness go up. We could get the jitteriness to go away by making it not move as far, so it's not skipping 10 pixels each time, but then it would be even slower. Oh crap, I'm gonna die. I have eight health, I died. I blame the equipment. In conclusion then, while the Martian is technically a gaming mouse in that I did play games on it, meaning our title is not click bait, realistically, it's more just a cool piece of retro technology that never made it to the West and an excuse to show off how the lab is going to help us continue to make better videos. Even if now this is a $350 mouse plus however many hundreds of dollars of labs time all for something that is so much worse than my G Pro wireless and so much worse than the segue to our sponsor. Circuit specialists. They provide electronic components and tools to the STEM community at competitive prices. We're talking resistors, capacitors, soldering stations, a skill scopes, positronic carbonium reactors, and more stuff that is real. These kinds of tools and parts are often either unavailable or too expensive, but thanks to circuit specialists technological and sourcing expertise, now anyone can access them. Their commitment to quality means you receive reliable and high performance products suited for your needs. Let circuit specialists help you upgrade your electronics toolkit. Check them out at the link below and use code LMG for 10% off. If you enjoyed this video, maybe check out our full retro review, retro, retro, retro view, whatever, of the Razer Boom Slang, which I would say arguably was the last truly high-end gaming ball mouse.",
    "transcript_keywords": [
        "mouse",
        "time",
        "Martian",
        "Soviet",
        "things",
        "Wow",
        "click",
        "lot",
        "pin",
        "labs",
        "thing",
        "kind",
        "Soviet era mouse",
        "full",
        "buttons",
        "labs team",
        "reset pin",
        "ball mouse",
        "Russian",
        "Pico"
    ],
    "transcript_entity_values": [
        "Hennessy Performance",
        "$350 mouse",
        "one",
        "hundreds of dollars",
        "Mars",
        "eBay",
        "eight",
        "zero",
        "West",
        "10%",
        "Flappy Bird",
        "only about half",
        "30 years old",
        "three megahertz",
        "FPGA",
        "three",
        "UK",
        "Linus",
        "Windows",
        "Russia",
        "Pico",
        "first",
        "the BBC Micro",
        "Doom",
        "BYOB",
        "Flappy Bird",
        "KH2",
        "KH1",
        "five volt",
        "UP",
        "seven and eight",
        "Matt Damon",
        "4",
        "CPU",
        "third",
        "between two",
        "like five minutes",
        "Ridge",
        "Google",
        "Hennessy",
        "16",
        "a penny",
        "nine megahertz",
        "32 kilobytes",
        "10",
        "4,500",
        "Soviet",
        "about 350 US dollars",
        "LMG",
        "the late 80s and early 90s",
        "the Soviet Union",
        "Switch",
        "Bronco",
        "Cyrillic",
        "the Razer Boom Slang",
        "two",
        "Jordan",
        "ball mouse",
        "Russian",
        "IBM",
        "second",
        "32 kilobyte",
        "Ridge",
        "Stubby",
        "Kolobok",
        "today",
        "Arduino",
        "up to 1,000",
        "BK-0010",
        "Y",
        "RAM",
        "around 4.5 kilohertz",
        "Martian",
        "BK",
        "USB",
        "50",
        "150 rubles",
        "K561TM2"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "NORP",
        "GPE",
        "NORP",
        "ORDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "FAC",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "MONEY",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PRODUCT",
        "NORP",
        "LAW",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "NORP",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON"
    ],
    "vector": [
        -0.07278697192668915,
        -0.06922400742769241,
        -0.08277516067028046,
        -0.13597026467323303,
        0.02197859436273575,
        0.019270794466137886,
        0.04302123934030533,
        0.017289241775870323,
        -0.10513024777173996,
        0.0906941220164299,
        0.037820179015398026,
        0.06249823793768883,
        0.020293230190873146,
        0.016735898330807686,
        0.03921129181981087,
        0.03666044399142265,
        0.06012849137187004,
        -0.06243709474802017,
        0.019760550931096077,
        0.015465810894966125,
        -0.046029988676309586,
        -0.12385521084070206,
        0.03511962294578552,
        -0.07149602472782135,
        -0.02575930394232273,
        -0.05782393366098404,
        0.029650263488292694,
        0.006854556966573,
        -0.018119536340236664,
        -0.008774932473897934,
        -0.029301313683390617,
        0.05925166979432106,
        0.023871824145317078,
        -0.006411487236618996,
        0.048155080527067184,
        -0.05202421918511391,
        0.03872765973210335,
        -0.11571471393108368,
        -0.08994515985250473,
        -0.095603346824646,
        -0.03582696616649628,
        -0.04901179298758507,
        0.019812675192952156,
        0.03637862950563431,
        -0.0007026831153780222,
        0.02066926844418049,
        -0.01021499838680029,
        -0.015137733891606331,
        0.000927087792661041,
        0.022349318489432335,
        0.0018092289101332426,
        -0.036580223590135574,
        0.04129685461521149,
        -0.008546486496925354,
        -0.06612715870141983,
        0.020595792680978775,
        -0.020964521914720535,
        0.02956508658826351,
        -0.008850681595504284,
        -0.05070504546165466,
        -0.026163281872868538,
        -0.08114983886480331,
        -0.05802484229207039,
        0.03488153591752052,
        -0.03520095348358154,
        -0.07852345705032349,
        0.01304582692682743,
        0.06104185804724693,
        -0.030999349430203438,
        -0.07224904000759125,
        0.031119128689169884,
        -0.042289458215236664,
        -0.07690086960792542,
        0.07825908064842224,
        -0.05532326549291611,
        -0.011938491836190224,
        -6.993857368797762e-06,
        0.025668255984783173,
        0.06626090407371521,
        -0.027912495657801628,
        0.026853229850530624,
        0.034399259835481644,
        -0.044746242463588715,
        -0.060362230986356735,
        0.03507031500339508,
        0.05366169661283493,
        0.01047919038683176,
        0.021361863240599632,
        0.013064787723124027,
        -0.10643612593412399,
        -0.03024148941040039,
        0.07216223329305649,
        0.08499034494161606,
        -0.0031658413354307413,
        0.05827248468995094,
        -0.008695465512573719,
        0.04815671592950821,
        -0.027893681079149246,
        -0.023393534123897552,
        0.06086902692914009,
        -0.021284624934196472,
        0.014076026156544685,
        0.0008554314845241606,
        -0.08373073488473892,
        -0.05235785245895386,
        -0.004509297665208578,
        -0.021007325500249863,
        0.1030987799167633,
        0.013325355015695095,
        -0.02442472241818905,
        -0.11511219292879105,
        0.01779024489223957,
        -0.08995256572961807,
        0.009362938813865185,
        0.07449615746736526,
        -0.044904179871082306,
        -0.038239967077970505,
        0.01845538429915905,
        0.018313532695174217,
        -0.05950389429926872,
        0.024672389030456543,
        -0.03280831128358841,
        -0.06815456598997116,
        0.006446110084652901,
        0.019636403769254684,
        0.025214767083525658,
        0.005440889857709408,
        7.0370634112415265e-34,
        -0.015144017525017262,
        0.03386891260743141,
        -0.07456421852111816,
        -0.06589172035455704,
        -0.07584180682897568,
        0.08166491985321045,
        0.04546906054019928,
        -0.009546635672450066,
        -0.01898813247680664,
        0.030881483107805252,
        -0.0643758624792099,
        -0.0007642658310942352,
        -0.12682203948497772,
        0.06217138469219208,
        0.08524516224861145,
        0.00012723209511023015,
        0.00883556343615055,
        0.007626969832926989,
        0.07619785517454147,
        0.013921140693128109,
        0.0007087726262398064,
        0.03741997107863426,
        0.022797275334596634,
        -0.049387406557798386,
        0.06849077343940735,
        0.02420821227133274,
        -0.07495790719985962,
        -0.0602153018116951,
        0.11857616901397705,
        0.017540019005537033,
        -0.034793004393577576,
        -0.020427722483873367,
        -0.09708602726459503,
        -0.07445470243692398,
        -0.013369166292250156,
        -0.011005681939423084,
        -0.11352063715457916,
        -0.102579265832901,
        0.021220149472355843,
        0.04729267209768295,
        0.04652339220046997,
        -0.005735047627240419,
        -0.0962115228176117,
        -0.07414430379867554,
        -0.03887657821178436,
        0.027967676520347595,
        0.06633776426315308,
        0.010674645192921162,
        0.0002925390435848385,
        0.03404419124126434,
        -0.08604779094457626,
        0.046256788074970245,
        -0.08652576059103012,
        -0.02258804813027382,
        -0.014859511516988277,
        -0.11461768299341202,
        0.030799951404333115,
        -0.017909038811922073,
        0.062097590416669846,
        -0.011948355473577976,
        0.030445411801338196,
        -0.014973103068768978,
        0.08007058501243591,
        -0.02487022429704666,
        -0.020014304667711258,
        0.01039101555943489,
        0.033230192959308624,
        0.006085204426199198,
        -0.06865615397691727,
        0.07044126838445663,
        0.033249299973249435,
        -0.05719051882624626,
        0.02426959201693535,
        -0.04567096009850502,
        0.06305793672800064,
        0.036807410418987274,
        -0.060107793658971786,
        -0.01354540977627039,
        -0.013739298097789288,
        -0.033622924238443375,
        -0.037917040288448334,
        0.0608699768781662,
        -0.027410810813307762,
        0.11844056844711304,
        0.021587347611784935,
        0.05803408846259117,
        0.06894663721323013,
        -0.024436892941594124,
        -0.04938047006726265,
        0.025568224489688873,
        -0.07015404105186462,
        -0.006162584759294987,
        -0.03273659944534302,
        0.014788463711738586,
        -0.025515573099255562,
        -4.34743655213764e-33,
        -0.05081788823008537,
        0.007282720413058996,
        -0.010093805380165577,
        0.06392509490251541,
        -0.007307680789381266,
        0.009700624272227287,
        -0.00603796262294054,
        -0.04815487191081047,
        0.020455623045563698,
        0.039358366280794144,
        0.01817595586180687,
        -0.004626505076885223,
        -0.04854285344481468,
        -0.007103933487087488,
        0.026731565594673157,
        -0.04373910650610924,
        0.007605390157550573,
        0.007880592718720436,
        0.06778467446565628,
        -0.06884612143039703,
        0.04489120468497276,
        -0.013522280380129814,
        0.038281623274087906,
        0.04387113079428673,
        0.04764048382639885,
        -0.008443563245236874,
        0.035026855766773224,
        -0.03863921016454697,
        0.027704965323209763,
        0.031078677624464035,
        0.04048994556069374,
        -0.027983078733086586,
        0.012507391162216663,
        0.022008614614605904,
        0.1081782728433609,
        -0.04042690247297287,
        0.1434188336133957,
        0.0017517133383080363,
        -0.07085970044136047,
        -0.10717449337244034,
        0.09321700036525726,
        -0.01994713582098484,
        -0.014443276450037956,
        0.02802344225347042,
        0.013552732765674591,
        -0.13870638608932495,
        -0.07647974789142609,
        -0.007800634950399399,
        0.023932918906211853,
        0.04748689383268356,
        0.03070552833378315,
        -0.028318824246525764,
        0.06213248893618584,
        -0.07214018702507019,
        -0.05255976319313049,
        -0.008058781735599041,
        0.014108811505138874,
        -0.010068305768072605,
        -0.007613054942339659,
        -0.056599728763103485,
        -0.033407580107450485,
        -0.041946545243263245,
        -0.06569784879684448,
        -0.019131287932395935,
        0.037606485188007355,
        -0.02461666241288185,
        0.1332218050956726,
        0.09033670276403427,
        -0.028086155652999878,
        -0.015910368412733078,
        0.059265151619911194,
        -0.0032653554808348417,
        0.10829173773527145,
        -0.05751127004623413,
        0.010902793146669865,
        0.07035164535045624,
        0.027035141363739967,
        0.038080573081970215,
        0.10559443384408951,
        -0.037679385393857956,
        -0.00910192634910345,
        -0.01711592823266983,
        0.1293463408946991,
        -0.007038729265332222,
        0.043011996895074844,
        0.03139832988381386,
        -0.013194620609283447,
        -0.036965515464544296,
        0.024860240519046783,
        -0.06383784860372543,
        0.005946100223809481,
        -0.03193468600511551,
        0.026425937190651894,
        0.061785683035850525,
        -0.02002621255815029,
        -6.140999175840989e-08,
        0.015905320644378662,
        0.018660830333828926,
        -0.006451116409152746,
        0.04115086793899536,
        -0.034161146730184555,
        -0.06649509817361832,
        -0.0015903912717476487,
        -0.0670449435710907,
        -0.006823807023465633,
        0.029357990249991417,
        0.019277680665254593,
        -0.061874814331531525,
        -0.004139614757150412,
        0.012238692492246628,
        0.03463800996541977,
        0.07336928695440292,
        -0.023226477205753326,
        0.05056018754839897,
        -0.026064252480864525,
        0.04562026634812355,
        0.009165835566818714,
        0.027107736095786095,
        0.02738712914288044,
        -0.014999953098595142,
        -0.06929273903369904,
        0.016462478786706924,
        -0.02928120456635952,
        0.038515496999025345,
        0.07109206914901733,
        -0.04002636671066284,
        0.006815290544182062,
        0.008827568031847477,
        0.030590564012527466,
        0.04274841398000717,
        0.03073830157518387,
        -0.14501355588436127,
        -0.00728629669174552,
        0.02485164999961853,
        -0.0004506133554968983,
        -0.0076703233644366264,
        -0.029283368960022926,
        -0.04108315706253052,
        -0.017801735550165176,
        -0.03414551913738251,
        0.01697302609682083,
        -0.06568531692028046,
        -0.025143789127469063,
        -0.1314929574728012,
        -0.05185474082827568,
        0.06280963122844696,
        -0.04788291081786156,
        0.08664600551128387,
        0.02175208553671837,
        0.04290430247783661,
        0.06539472192525864,
        -0.023353336378932,
        0.01275560911744833,
        0.003088111989200115,
        0.014089453034102917,
        0.022699439898133278,
        -0.025026816874742508,
        -0.06400865316390991,
        0.0016516895266249776,
        0.09852460771799088
    ]
}