{
    "id": "u9HOn2sicSI",
    "title": "AMD Ryzen 7000 Gaming PC Build! You're not ready!",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2022-10-05T16:04:38Z",
    "video_url": "https://www.youtube.com/watch?v=u9HOn2sicSI",
    "category": "Science & Technology",
    "tags": [
        "amd",
        "amd ryzen",
        "ryzen 7000",
        "ryzen 7 7700x",
        "rtx 4090",
        "nvidia",
        "4090",
        "micro center",
        "microcenter",
        "gaming pc",
        "gaming pc build",
        "pc build",
        "austin",
        "austin evans",
        "deck ready",
        "deckready",
        "psready",
        "ps ready",
        "gaming computer",
        "this is",
        "denki"
    ],
    "views": 808207,
    "likes": 20747,
    "comments_count": 673,
    "description": "New Customers Exclusive  Get $25 off your purchase of any AMD and Intel Processor (limit one per customer):  Check out Micro Centers PC Builder:  Submit to Micro Centers Build Showcase:   Shop - AMD Ryzen 7 7700X  Shop - Gigabyte X670 AORUS ELITE AX AMD AM5 ATX Motherboard Shop - EVGA NVIDIA GeForce RTX 3070 -  Shop - Inland Prime 500GB SSD  Shop - Crucial 16GB (2 x 8GB) DDR5-4800  Shop - PowerSpec 750 Watt  Shop - Montech X1 Tempered Glass ATX Mid-Tower Computer Case  Shop - Noctua NH-U14S CPU Cooler   Shoutout to Jim from @DeckReady and @PSReady for giving me a hand!  Subscribe for more!  TikTok:  Instagram:  Twitter:   Chapter Titles: 0:00 Who Needs an RTX 4090? 1:41 Mr Deck Ready AKA Jimmy Champane 2:16 The PC Parts Hunt 6:36 Did We Make a Mistake? Probably. 8:39 AMD Ryzen 7000 + AM5 Motherboard 10:20 This Isn't Going to Work 13:10 No Turning Back 14:29 The PC Build Lives",
    "description_links": [
        "https://micro.center/yoe",
        "https://micro.center/gyk",
        "https://micro.center/8ki",
        "https://micro.center/gfv",
        "https://micro.center/t5y",
        "https://micro.center/qd4",
        "https://micro.center/rv2",
        "https://micro.center/7qm",
        "https://micro.center/uml",
        "https://micro.center/8ru",
        "https://micro.center/sgy",
        "http://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Today is the launch of the brand new Ryzen 7000 series processors. So, I've taken an early trip to our sponsor, Micro Center, to take a look at exactly what kind of PC I can build. The catch, I'm going to build the entire PC for less than the price of an RTX 4090. So, these are the brand new Ryzen 7000 series processors. We have the 7900X right up here, but I think for this build, I'm gonna need to save a little bit more money than that. But if I can squeeze my budget up to a Ryzen 7, I think that's gonna be my best move. Would you be so kind as to allow me to purchase a Ryzen 7700 X? (upbeat music) - Maybe. - Maybe. What do you mean maybe? Oh, (upbeat music) there we go. The idea here is that for a $1,600 budget, I should be able to build something pretty powerful, because first of all, these new Ryzen 7000 chips are obviously a big step forward, but on top of that, graphics card pricing has come down a lot over the last six months. Which means that while there are new cards coming out, the existing like RTX 3000 series cards, have gotten dramatically less expensive. Meaning that I could pick up some legitimately great deals. Woo. Now, that's what I'm talking- Wow. Okay. Do you have any affordably priced options? You know, I wanna make sure I'm getting the maximum bang for the buck. What I think I might end up doing, I might end up going with the Aorus, the X670 Aorus Elite. For this kind of budget, I'm not gonna be using PCIe 5.0, I'm not gonna go for anything that's all that crazy. This is 290 bucks, which means that I'm gonna go into the rest of this build with about $900 to spend. I think that's my move. (upbeat music) Maybe I can find Ken or someone to help me walk around with the camera. This is awkward. (car motor droning) Jim, what are you doing here? - What are you doing here? - I'm making a video. Aren't you supposed to be like playing with a Steam Deck or something? - Yeah, this is a Steam... - Is there a Steam Deck behind here? - Yeah, don't look for it. - Can you help me? I've gotta build a PC. Can you- - [Jim] Yeah. For sure. - Guide me through Micro Center? - Yeah, totally. - It's almost like we planned this or something and that Jim wasn't randomly at the store this morning like, \"Hey, can you be in this video please?\" (laughs) - No one's gonna believe this but I actually was just randomly here. - No, a hundred percent, a hundred percent. We were like walking around the corner and Jim's just like, \"Oh, I'm just here to swap out my power duct.\" I'm like, \"Hey, come help me with my video.\" Let's start out by looking for our GPU. - So, what's the budget on the graphics card? - I think around 500 bucks. - Okay. - We'll cut corner, I mean, we'll make creative decisions for the rest of the build. Who needs a (indistinct) SSD? Pfft. Not us, that's who. - [Jim] Who needs an SSD? Not us. (laughing) - Let's take a look at the NVIDIA cards and then we'll look at Open-Box and we'll decide if we can negotiate our way into a great deal at Micro Center. Huh, what am I saying? Every deal's great at Micro Center. (Jim chuckling) Who do you think would be upset if we get a little creative with our pricing? Do we need 16 gigs of RAM? I figure we could do like four- - Four? - Yeah. Do we need a case? - No, we could just like put it on some cardboard. We could build it on a box. On the graphics card box. - Yeah. Yeah, this is great. If we could look at some of your best deals in Open-Boxes, that'd be great. (laid-back music) Aw, it's fine. You live here but you're not considered an employee. Oh my goodness. This is only one rack. This is all the NVIDIA cards. (trolley rattling) - Very cool. I'm gonna get this budget. Okay, here we go. Here we go. (finger tapping) 425 for a 3060 Ti. Okay, that is- - That's the cheapest by $25. That's what we're looking for. How much is this 37? 512. - 512! That's only 12 over budget. Ha! - I mean realistically 500 bucks is still putting us pretty close to the limit here. - [Austin] Okay, that's way too much money. (laughs) - [Jim] We should probably go with the 3060 Ti but this seems more fun. - 512, hello? We can be creative. (bell pinging) Now that we made our questionable decision, we have our CPU, our motherboard, and our graphics card. We have about 400 left. Technically less, about 400 left. - 400. (cash register pinging) - So, I think let's start, let's be serious. - [Jim] Yes. - Let's cut as many pricing, as many corners as we can. - [Jim] So, we're doing eight gigs of RAM like. - Well, so here's the thing. We gotta go DDR5 'cause this is the new AM5 motherboards and everything. Good Sir, can I have the cheapest possible DDR5 that has ever been inside this cabinet? So, 94 bucks for- - [Jim] Actually, it's not that bad. - [Shop Assistant] I mean it's 16 gigs. - 16 gigs? I mean it's obviously very entry level memory but that's fine. I'm an entry level improviser. (bell pinging) I feel like let's get a relatively affordable like 512 gig. Of course, Inland brand, the only brand I would ever want. Could we swing one terabyte? I'm feeling punchy right now. Could we do it? - We have $305 and that is 80. - We're gonna make the smart decision. We're gonna go with the $45 Inland Prime 500 gigabyte SSD. You know what doesn't have 500 gigs of storage? An RTX 4090. Checkmate on video. (bell pinging) Let's look for a power supply. These all look too nice. Can we get away with 650? No, we probably shouldn't. - We need like those ones that are wrapped in like the thick flea market plastic? You know what I'm saying? (Austin laughing and clapping) - Yeah. Power Speck is probably gonna be our move. So, there's this 750 watt semi modular supply for 80 bucks. That's the smart move. I should buy that. Can we swing 80 bucks? - Yeah, we got that extra $5 we've been hanging on to. - $80. (bell pinging) - [Jim] Yeah, what's our budget right now? - We have one 170. (cash register pinging) Now this is where things can get a little cringe as the kids say. - Yeah. - We're gonna need to find the cheapest case that we can stuff our components into. - Well, they got a lot of options. - I need the most budget of budget. Oh sorry, I'm getting a tip. A hot tip here. You got something spicy for me back here? If you could gimme a $20 case, I'd buy it. So, this is why it pays to come to Micro Center because you can get all the tips and tricks on exactly where to find the deals. He's pumping the deals up right now for me. (laid-back music) Ooh. What you got hiding back here, huh? - [Shop Assistant] Montech cases. - Oh, I've never built one of these before. - [Jim] Yeah, but this one is ATX and it is $50. - $50. Well, that sounds like what I, yeah, there's some fans. That's good. - We just got some breaking intel that the graphics card does fit in this case. - So, your card's 300 millimeters, that's max 305. - You know what's incredible? Is the knowledge of Micro Center employees. I didn't even, I spoke the words out loud and the information just wafted this way. Five millimeters. All right, I'll take it. (bell pinging) Done deal. Does the 14Ss come with AMD mounting brackets? It does. Okay. So we could do a U14S. It has reasonable size for better overall compatibility. That's my motto in life. Reasonable size for better overall compatibility. I think this will work and in fact- - [Jim] We're in the budget. - We're in the budget now. - We're in the budget. - [Jared] How much is that? - [Austin] $90. - [Jared] $90? - Can you do the math on this real quick? - Do you want to know the actual number? 'Cause you're gonna find it insane. - Yes. - If that is $90 - 89.99 just for record. 89.99. (bell pinging) - All your parts together right now are $1,597. (laughing) (cash register pinging) (crowd cheering) - All right, so we've got all of our components here. I'm feeling really good about what we've got here. Should probably double check. This Open-Box item is, well it says \"as is.\" Oh wait, it says incomplete. - [Jared] Does this not have everything? - I mean (box rattling) visual graphics card inside, that's all I need. Aah. - [Jared] Did you check the box before you left? - No, I did not. Okay. So, that's one of the concerns. The other one is going to be on cooling. So, while this is a very powerful processor, AMD have kind of changed the way they do things in that it is really kind of targeting a much higher temperature. That is intended. That is the way they have designed it. But it also means that your cooler is gonna be very important. A U14 is by no means a small cooler, but most people who are building with these are using liquid coolers. Between that and the potentially less than ideal airflow of this case, I may have a slight problem, but here's the thing, I don't care because I got a whole PC for the price of one graphics card. I just realized I've got the YouTuber special. A JerryRigEverything knife and an LTT screwdriver. For $50, the Montech X1 is very lightweight. Look, cases are not important. This has like fans, tempered glass, mounting points. You also have a little bit of that sort of mesh design. You do have also a magnetic dust filter on the top. - [Jared] That's actually really impressive. - I'm feeling good about the case. Let's go ahead and crack open our graphics card. Before we build this pc, I'm just gonna take a minute and make sure that all our components are ready. 'Cause, you know, when you looking for the good deals, sometimes you have to make some hard decisions, some sacrifices if you will. And mine are that I don't know if everything's gonna fit and work. (Austin coughs and titters) Look at this. (plastic crackling) Look at this very large Chungus graphics card. (plastic crackling) Gonna fit, right? (funky music) Okay. (coughing) Ah, just an angle, you know, is fine. (chuckles) I'm gonna put in like this, obviously there's no motherboard. So, if I do this and then there we go. Look how much space there's gonna be here. Tons. Who needs a GPU support when the GPU is touching the entire case at once? Is that cooler gonna fit? Hm. It's a little big, but you know what they say. It's fine. Let's go to the fun part. I'm going to prep my X670 Aorus board. For the very first time, I'm gonna be using Socket AM5. This one is exciting because instead of bending the pins on your CPU, you're now gonna bend the pins on your motherboard. I mean, hypothetically, of course. Woo. Look at those pins. As time goes on, cheaper AMD CPUs will be coming out on Ryzen 7000 as well as more affordable motherboards. But this should give us plenty of stuff to get started. Let's install our CPU. So, this is our Ryzen 7 7700X. I like that AMD have gotten a little bit creative with the design here. It's definitely interesting looking but you're gonna look at your CPU once, throw a cooler on it and never look at it again unless you're Mr. Yeester in which you're gonna make thermal-paste art. Let's go. So, what's great about these new chips and the new Socket is that if you flip it around, unlike pretty much every AMD chip for a very long time, there are no pins here. Now, you should still, of course, be careful but now instead of ruining your expensive CPU, you could ruin your expensive motherboard. Normally when you're installing the CPU you have to look for like little like golden arrows and whatnot but to make it really straightforward because there's a little like line across the metal, which corresponds with the actual Socket, which means that you would have to be a complete moron to think that that lines up vertically. Shout out to AMD for actually putting a little bit of thought into making it very straightforward for a first-time build. Ryzen 7 7700X, they've got AMD Ryzen on the top, AM5 on the bottom. They've definitely gone very like Ryzen, that's all I've got. Let's go ahead and finish building the rest of the component. The challenge here is a hundred percent gonna be in can I get everything to fit in this very small, affordable case? CPU installed, RAM installed, let's throw in our high-quality Inland Prime SSD. I'll be right back after I (coughs) do some test fitting. So, we made some good progress. I will say building in this case, is at the like bare minimum of what I would say is acceptable. We got everything in here, but like it is a tight fit. We had to remove this rear fan just to clear our IO shield to slide the motherboard in. We obviously could not install the CPU cooler yet because we need to put the graphics card in. And because the graphics card fills it up so much, we also had to do basically all of our cabling because once the GPU is in there, there's gonna be zero space. To say that we're maxing this case out I think would be an understatement. Look, it's fine. We're gamers. We don't compromise, we just optimize. Let's install the GPU and hope for the best. So here, yeah. Oh! Look at that. That's gonna line. That's fine. That's totally fine. It actually fit totally fine. What else? There's no question, anyways, so plenty of space. I'm gonna go ahead and screw this in immediately so it doesn't rip out my entire Socket. There might be some tolerance issues enough that one screw fits and the other one does not because they're not lined up at all. With the power of the LTT screwdriver, I'm gonna make my own hole. There we go. Who needs a support bracket when your entire PC is your support bracket? - [Jared] Does that stick? Okay, okay, okay, okay, okay. - There you go. It fits now. - [Jared] That poor GPU. (laughing) - You know what the important thing though? It works. Suck it nerds. Jared? - [Jared] Huh? - Give me a Sharpie. Don't try this at home. Look how much better this is gonna look. Trust me, I'm an expert. You know what? It's just a little bit of extra insulation. The ink from the Sharpie is very beneficial. Gamers don't compromise and neither do I. Look, it's so much better. It's not done yet, but that's so much better. Yeah, you see a little bit of color, you also see a little bit of color through the sleeve too so it's just kind of like darker. It's only when you get really close. See? - [Jared] Oh so, that does hide it. - See? We're just not gonna have a light directly over the top. - [Jared] Except for the RGB fan. (laughs) - What else can I Sharpie out? Should I get rid of the Montech logo? What if I make it Tech? (friend laughing) M Tech for Mystery Tech! Look, I need to install a cooler but I'm having way more fun with the Sharpie. E Mo Tech. (Jared and friend laughing) Let's install a cooler now, friends. Now that the aesthetics are really on point with this system. What if I just shave all of these little things off? What are these? (cross-talking) You know, I think that if I take those off it'll probably gimme better performance anyway. You know, they'll kind of- One of the nice things about the new AM5 Socket and AM5 motherboards is that while the Socket is different, it should theoretically still work with all the AM4 coolers. So, if you've got something like this which has AM4 mounting hardware, it should just go straight on. And because it's Noctua, it's actually designed for human people to use. Our studio is Noctua-themed. (Jared gasps) Noctua, hit us up. We can just call this the Noctua Studio. - [Friend] Noctua. Yeah. - Yeah. It's like, you know, crypto.com Arena. - [Austin] Noctua Studio. - The Noctua Studio. - [Austin] Sponsored by Noctua. - Noctua Clock Media. - Can you draw your emotions on (mumbles). Don't tell us how you feel. Show us how you feel, Jared. - Aw. - [Friend] Aw. - Aw, Jared, is it okay? It'll be fine. (Jared wailing) It'll be fine. I'm sure Linus is hiring. - [Jared] Oh. - Here goes nothing. Once we put this on and if it doesn't fit, we cry. (device clicking) Is that it? Oh, that actually lined up perfectly. Ooh, look at me. - [Jared] Wow. Okay. - I'm successful and creative. - [Jared] I would screw that down as tight as possible. - Look, I want maximum CPU touchage. Maximum connectivity. (hands clapping) I just want it to be like this part just go like... (bomb exploding) Are we done? Did we do it? Okay? Does this fit? It's a lot of things that are right there. Well, you know what? Let's just... (glass plate clicking) Yo, I mean, yes, I am pushing on the fan, but I think we just screw it in. That'll be fine. Okay. So, this is a new patented cooling method. It's the exhaust on the bottom. See, what we've done is we've engineered this gaming PC build, much like NVIDIA designed the 4090 for maximum performance, and for maximum performance, you need ingenuity. And this is ingenuity at its finest because we've got a lot of fans in this system which means that we have to have air to supply to the fans. Which means that we are going to intake air from the bottom and exhaust it out. That's what's gonna happen here. And it's not gonna just be a leaky mess of fans spinning and air being turbulently spun around in the case. This is intentional. (upbeat music) (lid clanking) All right, my friends, it's the moment of truth. The Mo Tech, mo power, best money system is operational. And look at that, immediately comes to life. (laid-back music) (keyboard key clicking) Beautiful. And we are in, we've got our Ryzen 7 7700X, we've got ourselves our 16 gigs of crucial memory. PCI 4.0 SSD. Let's play some games. Well, clearly gamers don't compromise, especially when it comes to the beautiful aesthetics of the Mo Tech system that we've built. We also don't compromise when it comes to performance which is the whole point of this video. How about 4K 60 on ultimate settings on Horizon? Look at this, lock 60 fps, full 4K 60. It's not even breaking a sweat. In fact, I should probably bump this up to like 120 or 144 on this monitor. So, when it comes to this system, I feel really good about this Ryzen processor. There is a ton of performance, especially for gaming. And while for this particular build, the 3070 is a lot of performance for the value as far as that 500-ish dollars that we spend. I do think there's an argument to potentially waiting and keeping an eye out for both the new NVIDIA cards as well as the new AMD graphics cards which is going to be coming out very shortly. But the NVIDIA stuff is gonna be incredibly expensive. At the very least, I am incredibly happy that we were able to get something as powerful as the 3070 in a budget like this. Maybe next time we'll just spend a little bit more time on the aesthetic. But thankfully, our kind sponsors, Micro Center, have you covered with all kinds of wonderful looking cases, RGB and various different components of all shapes and sizes. So, make sure to go check them out in the link in the description. If you'll excuse me, I'm going to go patent my backdraft cooling method. (laid-back music) Backdraft TM.",
    "transcript_keywords": [
        "Micro Center",
        "graphics card",
        "Yeah",
        "Ryzen",
        "card",
        "budget",
        "CPU",
        "build",
        "graphics",
        "fine",
        "case",
        "AMD",
        "Micro",
        "Center",
        "make",
        "Noctua",
        "fit",
        "NVIDIA cards",
        "Socket",
        "GPU"
    ],
    "transcript_entity_values": [
        "5",
        "1,600",
        "about 4",
        "Chungus",
        "1,597",
        "about 400",
        "first",
        "25",
        "650",
        "Montech",
        "about $900",
        "the Montech X1",
        "AMD",
        "80",
        "120",
        "90",
        "one",
        "4090",
        "60",
        "E Mo Tech",
        "290 bucks",
        "425",
        "a ton",
        "ATX",
        "750 watt",
        "500 gigabyte",
        "a minute",
        "only one",
        "Tons",
        "Aorus",
        "U14",
        "89.99",
        "AM5 Socket",
        "GPU",
        "DDR5",
        "Ryzen",
        "7700X",
        "Backdraft TM",
        "Open-Boxes",
        "3060",
        "Mo Tech",
        "YouTuber",
        "X670",
        "the last six months",
        "Ken",
        "Austin",
        "AM4",
        "IO",
        "Inland",
        "Ryzen 7000",
        "500-ish dollars",
        "16",
        "500",
        "7900X",
        "SSD",
        "zero",
        "Yo",
        "80 bucks",
        "5.0",
        "Five millimeters",
        "Austin] Sponsored",
        "Tech",
        "mo power",
        "Sharpie",
        "Power Speck",
        "Horizon",
        "AMD",
        "300 millimeters",
        "eight",
        "around 500 bucks",
        "RGB",
        "this morning",
        "I. Look",
        "The Mo Tech",
        "94 bucks",
        "CPU",
        "3000",
        "AM5",
        "144",
        "Linus",
        "Ryzen",
        "Arena",
        "One",
        "Mystery Tech",
        "Jim",
        "Jared",
        "Austin] Noctua Studio",
        "Noctua",
        "500 bucks",
        "The Noctua Studio",
        "RAM",
        "80",
        "50",
        "512",
        "3070",
        "400",
        "4",
        "Austin",
        "305",
        "Aorus Elite",
        "305",
        "LTT",
        "a hundred percent",
        "45",
        "M Tech",
        "the Noctua Studio",
        "Yeester",
        "14Ss",
        "only 12",
        "NVIDIA",
        "Ryzen 7000",
        "20",
        "Micro Center"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "LOC",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "GPE",
        "ORG",
        "FAC",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "EVENT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG"
    ],
    "vector": [
        -0.06751833856105804,
        0.012263578362762928,
        0.008586324751377106,
        0.012972566299140453,
        0.052479226142168045,
        -0.030423603951931,
        0.04663596674799919,
        0.03216321021318436,
        -0.084780752658844,
        0.0437309555709362,
        -0.04348752647638321,
        -0.013580591417849064,
        -0.04673193395137787,
        0.056430883705616,
        -0.019217267632484436,
        0.012889300473034382,
        0.09357919543981552,
        -0.07808544486761093,
        0.009063235484063625,
        -0.025833679363131523,
        -0.04125309735536575,
        -0.04897050932049751,
        -0.02883017621934414,
        -0.01797007955610752,
        0.01986999250948429,
        0.08145918697118759,
        0.08117369562387466,
        0.031710054725408554,
        0.0028692646883428097,
        -0.009525277651846409,
        0.008099009282886982,
        0.00525449775159359,
        0.023614687845110893,
        -0.010032269172370434,
        0.012278261594474316,
        5.474734280142002e-05,
        0.04344845935702324,
        -0.05584660544991493,
        -0.01790875755250454,
        -0.06670621782541275,
        -0.035782814025878906,
        -0.026460176333785057,
        -0.046870119869709015,
        0.08781706541776657,
        0.027473121881484985,
        -0.019310740754008293,
        0.052847739309072495,
        -0.09724926203489304,
        0.016094442456960678,
        -0.0475754477083683,
        -0.03491326794028282,
        -0.06312674283981323,
        0.026047678664326668,
        -0.042620498687028885,
        -0.1001216322183609,
        0.039752259850502014,
        5.275350849842653e-05,
        -0.11281338334083557,
        0.03663811460137367,
        -0.0663372129201889,
        0.022582076489925385,
        -0.14249169826507568,
        -0.005042810458689928,
        0.04503030329942703,
        0.013480260036885738,
        -0.016789883375167847,
        -0.03246530890464783,
        0.004245147109031677,
        0.030060848221182823,
        0.034865058958530426,
        0.03867677226662636,
        0.025172166526317596,
        0.003907817881554365,
        0.04426363855600357,
        0.019382834434509277,
        0.05402558296918869,
        0.066998690366745,
        -0.13316501677036285,
        0.05499222129583359,
        -0.045924533158540726,
        -0.00653475895524025,
        -0.054711390286684036,
        0.012095782905817032,
        -0.07357429713010788,
        0.03386569768190384,
        -0.003156038001179695,
        0.07940841466188431,
        0.04885275289416313,
        0.04401780292391777,
        -0.10477366298437119,
        0.026206035166978836,
        0.07142005115747452,
        0.07057417929172516,
        -0.0433487705886364,
        0.07583946734666824,
        0.02618325687944889,
        -0.009118208661675453,
        -0.02448650263249874,
        -0.05783842131495476,
        0.0017012855969369411,
        -0.001812237431295216,
        0.056779246777296066,
        0.05956412851810455,
        0.06129304692149162,
        -0.03858637064695358,
        -0.0012598157627508044,
        -0.09034519642591476,
        0.09399828314781189,
        -0.03288256749510765,
        -0.11074252426624298,
        -0.04321149364113808,
        0.06518378108739853,
        -0.00464544165879488,
        -0.010218133218586445,
        0.013799374923110008,
        -0.025899341329932213,
        -0.03928804770112038,
        0.018282780423760414,
        0.09185459464788437,
        0.031909335404634476,
        7.4236755608581e-05,
        -0.008853960782289505,
        -0.05239291116595268,
        0.052102167159318924,
        0.06403777748346329,
        0.01930268108844757,
        -0.11091475188732147,
        1.2547445636499938e-32,
        0.005104497540742159,
        0.1029769629240036,
        -0.058405738323926926,
        -0.018356576561927795,
        -0.006473517045378685,
        -0.013819915242493153,
        0.041052352637052536,
        -0.0401524156332016,
        0.017595870420336723,
        0.051398541778326035,
        -0.04119589552283287,
        -0.044045206159353256,
        -0.023510515689849854,
        0.06939579546451569,
        0.02312912791967392,
        -0.09586497396230698,
        -0.00047344184713438153,
        0.002052361611276865,
        -0.06935251504182816,
        0.034949563443660736,
        0.022927606478333473,
        0.03672175109386444,
        0.0033364794217050076,
        -0.01838385872542858,
        0.0383777841925621,
        0.005486378446221352,
        0.0021986847277730703,
        0.006883709225803614,
        0.04145755246281624,
        0.01079290546476841,
        -0.04462834820151329,
        -0.05506296083331108,
        -0.03880089521408081,
        0.0053799948655068874,
        0.03689584508538246,
        0.009279592894017696,
        -0.03356761112809181,
        -0.0693831741809845,
        0.02513064816594124,
        -0.0207245871424675,
        -0.061412133276462555,
        0.04378298297524452,
        -0.08059539645910263,
        -0.06169326603412628,
        -0.03234617039561272,
        0.015933215618133545,
        -0.04054863378405571,
        -0.012778885662555695,
        -0.010084050707519054,
        -0.008826966397464275,
        -0.057124484330415726,
        0.08643751591444016,
        0.03278406709432602,
        0.017366737127304077,
        0.004935459233820438,
        -0.07469085603952408,
        0.04716549813747406,
        -0.002354695927351713,
        0.14967408776283264,
        0.12090200185775757,
        -0.050274498760700226,
        -0.0697622075676918,
        -0.08343278616666794,
        0.034043703228235245,
        -0.05694199725985527,
        0.0484556220471859,
        0.06294472515583038,
        0.009750304743647575,
        -0.053160082548856735,
        0.053126055747270584,
        0.02103135548532009,
        -0.0528448261320591,
        0.07654585689306259,
        -0.029771609231829643,
        0.07073356211185455,
        0.05920112505555153,
        -0.04532010108232498,
        -0.03009764291346073,
        -0.10611423850059509,
        -0.05144069716334343,
        -0.0707293152809143,
        0.02968193218111992,
        -0.03313719108700752,
        0.0361715592443943,
        0.009723971597850323,
        -0.0289799515157938,
        -0.03753211721777916,
        -0.021153442561626434,
        0.012132699601352215,
        -0.009226092137396336,
        -0.05549832433462143,
        -0.027101268991827965,
        0.06774891912937164,
        0.0473482646048069,
        -0.08041032403707504,
        -1.0817987817909139e-32,
        -0.04227118566632271,
        -0.035478733479976654,
        -0.044395383447408676,
        0.07671578973531723,
        -0.034988999366760254,
        0.003323539160192013,
        0.04435579851269722,
        -0.01710599660873413,
        0.05358339473605156,
        -0.08956889063119888,
        0.026182379573583603,
        0.03442315012216568,
        -0.004646793939173222,
        0.018030516803264618,
        -0.04875359311699867,
        -0.019608624279499054,
        0.02026091143488884,
        -0.056321144104003906,
        0.0683441162109375,
        -0.02987702377140522,
        0.05592437461018562,
        0.058597709983587265,
        -0.035820573568344116,
        0.044081587344408035,
        0.04166935011744499,
        0.07341922074556351,
        -0.01198915857821703,
        -0.03650403767824173,
        0.04079011082649231,
        0.005719347856938839,
        -0.037817567586898804,
        -0.026042498648166656,
        0.0332377627491951,
        0.110712431371212,
        0.06459333002567291,
        0.043722689151763916,
        0.06478120386600494,
        0.013519435189664364,
        0.00022818100114818662,
        0.061891406774520874,
        0.09216547012329102,
        0.018654435873031616,
        -0.0406157448887825,
        0.06243038550019264,
        -0.054205749183893204,
        0.03548690676689148,
        0.027580926194787025,
        -0.05630863830447197,
        0.027767755091190338,
        -0.025736726820468903,
        -0.07784852385520935,
        -0.02485700137913227,
        0.027580546215176582,
        -0.022130848839879036,
        -0.03821680322289467,
        -0.059739723801612854,
        0.007064266595989466,
        0.0393638014793396,
        0.042851269245147705,
        -0.03349456936120987,
        0.07978397607803345,
        0.02571866847574711,
        0.0519302636384964,
        -0.06573239713907242,
        0.032677896320819855,
        -0.04098203405737877,
        0.031436461955308914,
        0.043369945138692856,
        -0.010258295573294163,
        -0.05204262211918831,
        -0.1119769960641861,
        -0.04490423947572708,
        -0.055206071585416794,
        -0.027046596631407738,
        0.0022517526522278786,
        0.028041446581482887,
        0.023343071341514587,
        -0.011203546077013016,
        0.017743796110153198,
        -0.020539987832307816,
        -0.05352766066789627,
        -0.0209784097969532,
        -0.018779117614030838,
        -0.0009821364656090736,
        0.06460225582122803,
        -0.010685620829463005,
        0.0015896488912403584,
        -0.015875931829214096,
        0.004112129099667072,
        -0.0856836810708046,
        -0.0022173835895955563,
        0.034382570534944534,
        -0.012856465764343739,
        0.09498810768127441,
        -0.013397084549069405,
        -5.68875968554039e-08,
        0.07556559890508652,
        -0.03395360708236694,
        0.025449037551879883,
        0.03206481412053108,
        0.07154642790555954,
        -0.10886241495609283,
        0.053025927394628525,
        -0.024571705609560013,
        -0.001243555685505271,
        0.0463741198182106,
        0.09782520681619644,
        -0.07511915266513824,
        -0.025387544184923172,
        -0.005928542464971542,
        0.00877910852432251,
        0.013431582599878311,
        -0.10320350527763367,
        0.06041419133543968,
        -0.01705440692603588,
        -0.1307491660118103,
        0.009090607054531574,
        0.05907933786511421,
        0.06400761753320694,
        -0.0392310805618763,
        -0.030214756727218628,
        0.005329487379640341,
        -0.01085533294826746,
        -0.020926406607031822,
        0.1000266894698143,
        -0.016095975413918495,
        -0.014779745601117611,
        0.02060079202055931,
        0.06521260738372803,
        -0.028851665556430817,
        0.07885108888149261,
        -0.03288628160953522,
        0.049229953438043594,
        0.1351986676454544,
        0.11613988131284714,
        -0.053831975907087326,
        -0.073426254093647,
        -0.08444630354642868,
        -0.021503647789359093,
        0.028534073382616043,
        -0.016599133610725403,
        -0.017033621668815613,
        -0.12677790224552155,
        -0.059670064598321915,
        0.026229489594697952,
        -0.021775981411337852,
        0.008773330599069595,
        0.03807360306382179,
        -0.015590585768222809,
        0.03204170987010002,
        0.0428946316242218,
        -0.010512317530810833,
        -0.0714719370007515,
        0.0377667099237442,
        0.049685537815093994,
        -0.04134858399629593,
        0.05985947698354721,
        -0.1020406112074852,
        -0.08914708346128464,
        -0.029872404411435127
    ]
}