{
    "id": "U_L2LvCvVWE",
    "title": "Electric Vehicle Charging:  It's easier than you think",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2016-04-21T00:49:30Z",
    "video_url": "https://www.youtube.com/watch?v=U_L2LvCvVWE",
    "category": "Education",
    "tags": [
        "electric car",
        "ev",
        "chevy volt",
        "nissan leaf",
        "tesla model s",
        "tesla model 3",
        "tesla",
        "model 3",
        "bmw i3",
        "bmw i8",
        "chevrolet volt",
        "chevrolet bolt",
        "electric car charger",
        "supercharger"
    ],
    "views": 201837,
    "likes": 5770,
    "comments_count": 949,
    "description": "As more and more EV's make it onto our roadways, people start to freak out about how we're going to charge all these things.  The thing is, they shouldn't.  EV's are so much more efficient than their gasoline powered counterparts that they don't consume all that much electricity, in fact the size of the grid only needs to increase about 4.5% to accommodate an entirely electric commuter fleet.  But people still worry about charging them.  In this video, I explain why this shouldn't worry you in the slightest.    With my Chevy Volt, I never charge it with anything other than a standard household outlet, and this provides more than enough electricity to get me through my day.  Granted, the Volt only has a 40 mile range, and I've got the gas engine to keep me going should I need it, but in the summer time I routinely make it home from work with 10 miles of range or more left.  And it only takes 7 hours on my portable charger to get it full for the next day.  A household outlet can provide enough electricity to add 80 miles of range to an EV every day, and if you take a look at how you actually drive, you'll discover that for the vast majority of the time, that's plenty.  1*  120V 16 A charging station:    2* Cost of parking garages:   Average commercial electricity cost:   Just a note:  Level 3 charging, such as the Tesla Superchargers, is seen as a necessity by people looking into electric cars.  There are many people that feel that having charging stations like these spread across the country is the only thing that will make electric cars feasible.  Well, they certainly have their use, as the Superchargers allow Tesla owners to take roadtrips in their EVs.  And it is true that DC fast charging is the only way to make an electric road trip possible.  But road trips represent a tiny fraction of the miles driven by your typical car.  People need access to Supercharger-like infrastructure *only* for road trips, as typical daily driving does not require fast charging.  In fact, with a 200 mile EV, the battery can be completely recharged in 10 hours with 30 amp level 2 charging, the kind a dryer outlet can provide.  People sleep every night, and when you're asleep your car will be charging for the next day of driving.  It really is easier than you think.",
    "description_links": [
        "http://www.clippercreek.com/store/product/charging-station-acs-20-level-1-permanent-install/",
        "http://www.carlwalker.com/wp-content/uploads/2014/04/April-Newsletter-2014.pdf",
        "https://www.eia.gov/electricity/monthly/epm_table_grapher.cfm?t=epmt_5_3"
    ],
    "transcript": "Perhaps the most worrisome thing about electric cars in the eyes of drivers is charging them. With a conventional vehicle, you stop by a fueling station, go to the pump, swipe your card yada yada and youre tank is full again in a few minutes. Many people think we need to have a vast charging infrastructure capable of similar feats for EVs to be viable. Id like to present to you why for 95% of the time, thats not really the case. First, lets discuss the types of EV chargers. There are three so-called levels of charging. Level 1 charging is the slowest, using electricity from a standard household 120V outlet. Im about to make an outlandish statement. For most people most of the time, level 1 is all you need. No, seriously. If you think Im off my rocker just hang tight and Ill explain in a few moments. Level 2 charging is the next step. Level 2 charging equipment supplies 240V, usually between 15 and 40 amps. Most public charging stations are level 2, and these are capable of recharging the exhausted batteries of most EVs in 4 to 10 hours depending on the car. Much effort seems to be spent on getting level 2 charging stations in more places, but except in particular circumstances they might not be needed. Again, more on that later. Level 3 charging is the fastest current charging level. Rather than work with AC electricity, Level 3 equipment supplies high voltage DC right into the vehicles batteries, and they can often charge a depleted battery to 80% full in 30 minutes or less. The Tesla super chargers, CCS, and Chademo are the three most common technologies and theyre usually referred to as DC fast charging. So, you might be asking, where does this guy get off saying this thing is all I need? Ill tell you. Theres an easier way to understand how fast the chargers are: miles per hour. Energy is energy, and since most cars are able to go about 4 miles per kilowatt hour of energy, then its really easy to tell how far it can go for a set period of time being plugged into a charger. Lets take a Nissan Leaf as an example. When on level 2 charging at 30 amps, it adds 20 miles of range per hour its plugged in. Its that simple, you can figure out depending on the size of the charger how fast range is added to the battery, and you can equate that to miles per hour. When plugged into a standard 120v outlet with a portable charger, a leaf gains 4 miles of range for every hour its plugged in. This probably sounds pathetic to you, but it shouldnt. Consider this: The Leaf has an estimated range of 84 miles for 2014 and 2015 models. Lets take a worst case scenario and assume that each day you use 100% of the range. Your trip to work is 42 miles (which by the way statistically is a very long commute), and say it takes an hour each way. 22 hours of the day your car is sitting parked. If it were always able to be plugged in when parked (so, if you could plug in at work), then it would add 88 miles of range each day (which is 4 more than its total range). Even with level one trickle charging, as some people call it, the Leaf would always end up with a fully charged battery at the start of the next day. So heres what Im getting at. So long as you drive less than 80 miles in a day (which is most people most of the time), level 1 charging is sufficient. The catch is that this is so long as you could also charge at work. In fact, if your trip to work is 32 miles or less (which is most of you), then with a standard 120V outlet your car would be fully charged when it was time to go home. And thats what I think we should be focusing on. We need to get more chargers available for people to use at their workplace, and level 1 is a great option. Installing level 1 charging equipment costs less than level 2. A lot of this has to do with wiring. See, a standard 200 amp electrical panel like you have in your house could charge 26 EVs at 15 amp level 1, compared to just 6 with 30 amp level 2. And in a commercial building theres way more than 200 amps at its disposal. Just think of a building like a hotel--each room with its own electric heater has a 20 amp 240 volt circuit (which is equivalent to 2 20 amp 120 volt circuits). So with the wiring for each hotel room, you could charge 2 cars. A 100 room hotel, therefore, has the wiring to support 200 EVs. Now of course, you cant charge an EV and run the heater at the same time, but I want to illustrate how many vehicles could be charged with what is already typical electrical supply for a commercial building. And 200 is just with the circuits for the heaters. And trust me, there are a lot more circuits in a hotel. Heres another thing to consider. Adding 4 miles of range in an hour is with 12 amp charging, which is what portable charging equipment supplies. Level one charging equipment wired to a dedicated 20 amp circuit like in a hotel room could potentially add 5.5 miles of range per hour, meaning that with 22 hours of parked time, the car could add 121 miles of range. Very few people exceed 121 miles of daily driving. And even if you had to go farther one day, you could make up for it later. Say your commute is a 50 mile round trip. Still a good bit longer than average, but a good number for theory. If your electric car had a 200 mile range, then your car would never dip below 75% charged if all you did was commute. But if one day you did have to drive 100 miles doing errands, then youd get home with your battery half full. But with 8 hours of being plugged in before you went to work the next day, youd have 132 miles of range when you started your day. After 24 hours, youd start the next day with 162 miles, and by the third day youd be nearly full again. See, each day you used 50 miles of range, but added 80 miles so youve netted 30 miles of range. All this is not to say that theres no point in installing level 2 or level 3 charging. What I hope to explain here is that the need for those charging levels is atypical. Sure, a workplace might need a few level 2 chargers for those that have very long commutes, but for most people just having level 1 would be fine. Level 2 chargers would be most handy in places like shopping malls, so that someone whose commute pushes past 60 miles or so could get their battery full quickly for a day of shopping or roundabout chores. Level 3 charging is needed exclusively for road trips; or when total travel for the day will greatly exceed the cars range. I think that if we want to make it easier to drive electric, we need to change our focus. We need level 1 chargers in more places. If everyone is able to charge their car at work, even if its only level 1, their daily driving needs would pretty much be taken care of. My trip to work is about 16 miles, and with my Volt that leaves me with about 60% of the battery left, or about 23 miles of range. If I could plug in at work to just a standard outlet, my Volt would have a full battery in about 4 hours, well before the time I ended my 8 hour day. Then when I got home, Id again have 23 miles left for shopping and chores, meaning I would almost never have to rely on the Volts gasoline backup generator. And since the first gen Volt takes 10 hours to charge fully with a 120V outlet, even if I used up all those 23 miles after work, Id have a full battery in the morning (assuming I got home 2 hours before I went to bed). If you dont believe me that level 1 charging is enough, just try this. Every day for the next month, reset the trip meter on your dash before you head out for the day. Write down how many miles you drove in a log. Ill bet that for many of you, you never exceeded 80 miles in a day. And for those that did on a few of those days, the gains you make from your other days would more than make up for the loss. Still think this claim is dubious? Lets make it even simpler. 80 miles a day is equivalent to driving 2,400 miles in a month, or 29,200 miles a year. So with just a standard electrical outlet, your electric car could travel more than double the average annual distance traveled by car today. In short, the problem isnt so much infrastructure. Its access. Most buildings today are loaded with wiring, already enough to support most drivers. The problem is none of that wiring goes to the parking lot or parking garage. And we dont need expensive equipment to get people charged. A level 1 charger costs about 400 dollars. Compare that to the national cost per space of a new parking garage, which is over 18,000 dollars, and you discover itd increase the cost of a parking garage only 2.2 percent for every spot to be capable of charging. Maybe double that for wiring and labor, and youre still at less than a 5% increase. You might ask, who should pay for this? If companies were smart, theyd do it themselves. Providing vehicle charging as a benefit to employees doesnt cost much at all. The electricity costs about a dollar a day with national electric costs and 8 hours of charging. Considering that the minimum wage is more than 7 times that amount per hour, and the average wage many times more, thats pennies. And the cost of installation isnt that high either. At perhaps 1,000 dollars per charger, youre talking a weeks pay for someone making $52,000 a year. New construction should just be done with EV charging in mind. If you want to hire top talent, having free EV charging will certainly be a welcome perk. For fast charging, Id like to see roadside restaurants install level 3 charging. Youre on a road trip, your batterys depleted, and what better place to stop for a half hour than a restaurant. Smart restaurant will subsidize the cost of installation with added revenue from hungry EV drivers, with chains like McDonalds, Wendys, Sonic, or countless others having the opportunity to become the first nationwide public EV charging network. If I were them, Id seize that opportunity. Were so close to having all we need to support mass adoption of electric cars. 200 mile affordable EVs are just around the corner. Now all we need is for people to start doing something. I can tell youre formulating comments to tell me about the things I am glazing over. Im going to try and address some of those now and save you some effort. First, yes, EV range does go down in the winter time. Sometimes as much as 30% or so. Which would mean that the number of miles level one charging could support could potentially drop to as little as 50 in a day. But 80 miles would still be maintained if 20 amp charging became more widespread. There are certainly places where level 2 charging is good. Shopping malls, movie theaters, theme parks, basically places that youd go out of your way to get to. These places would certainly benefit from having level 2 charging so you could get a quick recharge to go home. But, I think youll find that even on the days you go shopping, youll still be driving less than 80 miles. You might ask, if were adding wiring to install level 1 chargers, why not beef up the wiring for level 2? I think I already answered that with the number of cars that can be supported per electrical panel. A finite amount of energy can be pulled through a given transformer and a given electrical panel, so I think that it would make more sense to have more level 1 chargers than fewer level 2. With 6.6 KW level 2 charging you could charge 1 car. But the same 6.6 KW could charge 5 cars at level 1. Its the same number of miles per hour, but by spreading it out amongst more people you can have a greater impact, particularly at a workplace, and it helps alleviate the problem of who should get the charger when. I would argue its better for 5 people to get 32 miles of range added each over their 8 hour day, than for 1 charger to provide 20 miles of range per hour. Youd have to keep switching cars around on that charger, and thats a waste of time and effort. Installing a level 2 charger at home is not without merit, particularly when you can take advantage of lower electricity rates at night, if your utility company offers them. Then with a long-range EV, you can completely charge it overnight when its cheaper to do so. In fact, I would suggest that new construction homes be wired with a couple of dryer outlets in the garage so level 2 charging would just be plug-and-play. But one thing that is often overlooked about EVs is that the amount of time it takes to get a full charge depends on how charged your battery is when you plug in. Its not like it always takes the same amount of time. It doesnt always take 10 hours to charge my Volt, it only takes 10 hours if the battery is depleted. Oftentimes I get home with 10 miles of range left, and then it only takes 7 hours to charge. Its really like I said earlier, the charger provides x miles per hour, so it requires a different mindset than filling up when necessary. If your battery is only down 40 miles, then just like my Volt it will take 10 hours to charge fully with a household outlet, regardless of how big the battery is in your electric car. EV enthusiasts may know that level 1 charging is about 2% less efficient than level 2, so you will waste just a bit of electricity by charging consistently with level 1. But, access to level 1 charging at home is plentiful, and I think sacrificing a little bit of efficiency is worth having more access elsewhere. And lastly, I know there are plenty of people who dont commute, and that there are plenty of reasons to drive besides commuting. But it all boils down to access. If you could plug in whenever youre not driving--which in a cars lifetime is the vast majority of the time--then level 1 charging could very well do more than what you need.",
    "transcript_keywords": [
        "Level",
        "miles",
        "charging",
        "day",
        "range",
        "hour",
        "hours",
        "miles of range",
        "charge",
        "car",
        "battery",
        "charger",
        "time",
        "people",
        "cars",
        "chargers",
        "volt",
        "work",
        "full",
        "electric"
    ],
    "transcript_entity_values": [
        "one day",
        "2 hours",
        "2015",
        "4 to 10 hours",
        "22 hours of the day",
        "3",
        "20",
        "McDonalds",
        "2",
        "Wendys",
        "10 miles",
        "EV",
        "30 minutes",
        "one",
        "over 18,000 dollars",
        "5",
        "perhaps 1,000 dollars",
        "240V",
        "the days",
        "about 4 hours",
        "as much as 30%",
        "40 miles",
        "a month",
        "2014",
        "26",
        "80 miles",
        "132 miles",
        "52,000",
        "weeks",
        "Sonic",
        "about a dollar",
        "100%",
        "5.5 miles",
        "AC",
        "first",
        "4 miles",
        "4",
        "84 miles",
        "the next month",
        "below 75%",
        "100",
        "a few moments",
        "20 miles",
        "42 miles",
        "a half hour",
        "CCS",
        "between 15 and 40",
        "three",
        "about 4 miles per kilowatt hour",
        "200 mile",
        "about 2%",
        "10 hours",
        "6.6",
        "a few of those days",
        "the start of the next day",
        "miles per hour",
        "their 8 hour",
        "1",
        "Leaf",
        "about 23 miles",
        "every hour",
        "7 hours",
        "about 60%",
        "121 miles",
        "80%",
        "each day",
        "today",
        "120 volt",
        "only 2.2 percent",
        "EV",
        "the next day",
        "about 16 miles",
        "as little as 50",
        "100 miles",
        "DC",
        "5%",
        "2 20",
        "Chademo",
        "a few minutes",
        "200",
        "Volt",
        "day",
        "half",
        "23 miles",
        "30",
        "29,200 miles",
        "more than 200",
        "30 miles",
        "daily",
        "2,400 miles",
        "8 hours",
        "120V",
        "50 mile",
        "Tesla",
        "120v",
        "6",
        "24 hours",
        "more than 7",
        "winter",
        "95%",
        "less than 80 miles",
        "22 hours",
        "88 miles",
        "12",
        "a day",
        "about 400 dollars",
        "the third day",
        "50 miles",
        "15",
        "an hour",
        "32 miles",
        "60 miles",
        "First",
        "162 miles",
        "night",
        "the day"
    ],
    "transcript_entity_types": [
        "DATE",
        "TIME",
        "DATE",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "MONEY",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "DATE"
    ],
    "vector": [
        0.036927759647369385,
        0.10122890770435333,
        0.01095274556428194,
        0.024319082498550415,
        0.0768762156367302,
        -0.03772664815187454,
        0.007620836608111858,
        0.0448199063539505,
        -0.0044194431975483894,
        -0.01120645459741354,
        0.0017870832234621048,
        0.01300186850130558,
        0.01852027326822281,
        0.06719622761011124,
        0.037021029740571976,
        -0.013919095508754253,
        0.06437135487794876,
        -0.07482423633337021,
        -0.040485940873622894,
        0.022768255323171616,
        0.012475048191845417,
        -0.02316160872578621,
        0.07829872518777847,
        -0.01923704519867897,
        0.057653751224279404,
        0.04722418636083603,
        -0.03183489665389061,
        0.0021289456635713577,
        -0.04714835062623024,
        -0.025252263993024826,
        -0.011922314763069153,
        -0.05947801470756531,
        -0.0034020033199340105,
        -0.03816789388656616,
        -0.016540421172976494,
        0.006062571424990892,
        -0.022278012707829475,
        0.05084273964166641,
        0.027187077328562737,
        0.03905908018350601,
        0.026287611573934555,
        -0.0868726521730423,
        -0.013306152075529099,
        0.004188154358416796,
        -0.08554141223430634,
        -0.04390007629990578,
        0.049853842705488205,
        -0.029663769528269768,
        0.03549410030245781,
        -0.0922175943851471,
        -0.010204415768384933,
        0.0002002938708756119,
        -0.035623274743556976,
        -0.08067616820335388,
        -0.035792894661426544,
        0.004314527381211519,
        0.018307648599147797,
        0.013240674510598183,
        0.02582627162337303,
        -0.018002290278673172,
        -0.04682323709130287,
        -0.02012726105749607,
        0.043590184301137924,
        0.013082225807011127,
        -0.11004064977169037,
        -0.058677803725004196,
        0.08286948502063751,
        0.06861051917076111,
        -0.08155705034732819,
        -0.01474803313612938,
        -0.006045160349458456,
        0.003151186741888523,
        -0.06262599676847458,
        0.03524686023592949,
        -0.0013291179202497005,
        -0.027993565425276756,
        0.05256299674510956,
        -0.04730985313653946,
        0.0125607680529356,
        0.04938158020377159,
        0.02445198968052864,
        0.039501070976257324,
        -0.041256383061409,
        0.00385170616209507,
        0.018185539171099663,
        0.005133301019668579,
        -0.013451931066811085,
        -0.02833220548927784,
        -0.00815767515450716,
        0.02551821805536747,
        0.08161335438489914,
        0.05054089426994324,
        0.048155393451452255,
        0.01868947222828865,
        0.002159164287149906,
        0.07328090071678162,
        -0.013432605192065239,
        -0.043136052787303925,
        -0.06413884460926056,
        -0.04028522968292236,
        0.04404975101351738,
        0.04111732915043831,
        -0.006322922185063362,
        -0.04626993089914322,
        -0.0002633390249684453,
        -0.0055786967277526855,
        0.02113976888358593,
        -0.014824245125055313,
        0.03439122810959816,
        -0.0391237735748291,
        0.044165968894958496,
        -0.0856722816824913,
        -0.020689524710178375,
        0.01976042427122593,
        -0.06661983579397202,
        0.023075878620147705,
        0.020283961668610573,
        -0.018604876473546028,
        0.09695953875780106,
        0.06544250249862671,
        0.005250324495136738,
        -0.030632244423031807,
        0.05449121817946434,
        0.018122706562280655,
        0.11013655364513397,
        0.055834248661994934,
        0.1082983985543251,
        1.0330485882381158e-33,
        -0.09960601478815079,
        0.04052441939711571,
        0.014671691693365574,
        -0.012369997799396515,
        -0.021896852180361748,
        0.03999095410108566,
        -0.05124587193131447,
        0.15656819939613342,
        0.07431767880916595,
        -0.007229660637676716,
        -0.031185412779450417,
        0.0015294302720576525,
        0.11375966668128967,
        0.06985700130462646,
        0.02190183289349079,
        0.018603073433041573,
        -0.0767645537853241,
        -0.021998370066285133,
        -0.011705069802701473,
        -0.01983802020549774,
        -0.005377793684601784,
        -0.05492458492517471,
        0.03938734903931618,
        -0.0266304612159729,
        -0.027569375932216644,
        -0.08363430947065353,
        0.06175180897116661,
        -0.009807947091758251,
        0.03231670707464218,
        0.0010120050283148885,
        -0.04475725069642067,
        0.061258260160684586,
        0.033453140407800674,
        0.05463128164410591,
        -0.0428624153137207,
        0.02926371991634369,
        0.0362473800778389,
        -0.026668181642889977,
        -0.024675816297531128,
        -0.03841499239206314,
        -0.02124178037047386,
        0.03364284709095955,
        -0.04114088788628578,
        -0.00807051919400692,
        0.006730963010340929,
        0.03771671652793884,
        0.09003717452287674,
        -0.034610118716955185,
        -0.11544111371040344,
        0.033312179148197174,
        -0.043211519718170166,
        0.005883277393877506,
        -0.015052981674671173,
        0.009009995497763157,
        -0.005286738742142916,
        0.08964201807975769,
        -0.04861574247479439,
        -0.0512605644762516,
        0.035616014152765274,
        -0.05263452231884003,
        -0.0848836824297905,
        0.028367137536406517,
        -0.015168813988566399,
        -0.0037942423950880766,
        0.04520042613148689,
        -0.038936175405979156,
        -0.03630485385656357,
        0.016827993094921112,
        0.0036060719285160303,
        0.07169004529714584,
        0.14223696291446686,
        -0.08952021598815918,
        0.01033930666744709,
        -0.09565861523151398,
        0.05568051338195801,
        0.05095597356557846,
        0.034104399383068085,
        0.042058829218149185,
        -0.025075504556298256,
        -0.049520812928676605,
        -0.0614197663962841,
        -0.10491983592510223,
        0.02381112612783909,
        -0.05411956459283829,
        0.14939938485622406,
        -0.03832109645009041,
        -0.01927628554403782,
        0.053394515067338943,
        0.024958936497569084,
        0.04783488065004349,
        0.014990877360105515,
        -0.00785871036350727,
        -0.06675668060779572,
        -0.030067237094044685,
        -0.00048337530461139977,
        -1.6037675341161487e-33,
        0.020876705646514893,
        0.07548583298921585,
        -0.015385391190648079,
        -0.005308334715664387,
        0.026160666719079018,
        -0.023435544222593307,
        -0.028396567329764366,
        0.00523295346647501,
        0.014153368771076202,
        -0.032116662710905075,
        -0.13515819609165192,
        0.026510436087846756,
        0.058752693235874176,
        -0.0293586328625679,
        0.07750522345304489,
        -0.06014972925186157,
        -0.07516979426145554,
        -0.01738099567592144,
        0.0060869683511555195,
        -0.017919687554240227,
        -0.0422142893075943,
        0.027570897713303566,
        0.00913535337895155,
        0.01666019856929779,
        0.09741169214248657,
        -0.007153205573558807,
        -0.09826195985078812,
        -0.0027304920367896557,
        0.05128374323248863,
        0.020518993958830833,
        0.00902761984616518,
        -0.013171806931495667,
        0.014541001990437508,
        -0.022513510659337044,
        -0.027381764724850655,
        0.06903035938739777,
        -0.009492206387221813,
        0.0918307676911354,
        -0.012501101940870285,
        0.030675837770104408,
        0.015354991890490055,
        -0.10843773186206818,
        -0.04242878034710884,
        -0.0643150806427002,
        -0.029913147911429405,
        0.0026454334147274494,
        -0.04909132421016693,
        0.002317750360816717,
        0.033673398196697235,
        0.08656534552574158,
        0.02103632688522339,
        -0.019275493919849396,
        -0.028311777859926224,
        0.03709719702601433,
        -0.01041507814079523,
        -0.08664436638355255,
        0.09147745370864868,
        0.046057894825935364,
        -0.08854946494102478,
        0.022163959220051765,
        0.033256951719522476,
        0.022321337834000587,
        -0.005861175246536732,
        0.0780285894870758,
        -0.04421002417802811,
        -0.07684208452701569,
        -0.02188771776854992,
        -0.013729551807045937,
        0.051092859357595444,
        -0.032630130648612976,
        -0.10764135420322418,
        -0.028366005048155785,
        -0.026373406872153282,
        -0.08421123027801514,
        -0.11806586384773254,
        0.08942954242229462,
        0.05897500738501549,
        -0.028898615390062332,
        -0.0016458715545013547,
        -0.057226378470659256,
        -0.02318047732114792,
        0.020191621035337448,
        0.026795627549290657,
        -0.1465851366519928,
        -0.02063720114529133,
        -0.03396495059132576,
        -0.005101810675114393,
        -0.03536103665828705,
        -0.0007882673526182771,
        0.10117749869823456,
        0.0052556125447154045,
        0.012046278454363346,
        -0.04746580496430397,
        0.03308155760169029,
        -0.06172478571534157,
        -5.328752195055131e-08,
        -0.015326946042478085,
        0.10084869712591171,
        0.06001882255077362,
        -0.056033432483673096,
        0.049203820526599884,
        -0.04200349003076553,
        0.014212081208825111,
        0.022456442937254906,
        -0.015446036122739315,
        0.07220827043056488,
        0.11606984585523605,
        -0.01484593003988266,
        0.09736056625843048,
        0.0351826511323452,
        0.005703892558813095,
        0.05858827754855156,
        0.050967466086149216,
        -0.015679795295000076,
        -0.03927569463849068,
        0.08502047508955002,
        -0.007871865294873714,
        -0.01384893711656332,
        -0.12108834087848663,
        0.02206455171108246,
        0.09552338719367981,
        0.0010039240587502718,
        0.008714726194739342,
        0.06531283259391785,
        0.01477746106684208,
        -0.0939759686589241,
        -0.04204056039452553,
        0.02529609389603138,
        0.008914345875382423,
        0.0608842633664608,
        -0.051464248448610306,
        -0.09311516582965851,
        0.030629988759756088,
        -0.11353845149278641,
        -0.04209183529019356,
        -0.03847524896264076,
        0.029295863583683968,
        -0.11798501014709473,
        -0.02082405611872673,
        -0.0471702516078949,
        -0.028989629819989204,
        -0.03850492462515831,
        -0.017622102051973343,
        -0.015819011256098747,
        -0.0035873698070645332,
        0.09878896921873093,
        -0.049202870577573776,
        -0.08566320687532425,
        0.021562036126852036,
        0.029280366376042366,
        0.09951464831829071,
        -0.016722679138183594,
        -0.04201089218258858,
        0.033169377595186234,
        0.032044101506471634,
        -0.006934277713298798,
        0.02454131469130516,
        0.04186532646417618,
        -0.0007852853159420192,
        0.015748634934425354
    ]
}