{
    "id": "UAGVr3KYvjI",
    "title": "OnePlus 8 Pro Review: Becoming The Villain",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-04-14T18:58:53Z",
    "video_url": "https://www.youtube.com/watch?v=UAGVr3KYvjI",
    "category": "Science & Technology",
    "tags": [
        "oneplus 8 pro review",
        "oneplus 8 review",
        "best smartphone 2020",
        "best android 2020",
        "oneplus 8 vs oneplus 8 pro",
        "oneplus 5g"
    ],
    "views": 535569,
    "likes": 16518,
    "comments_count": 1230,
    "description": "Sponsored by dbrand. Skin your OnePlus 8 Pro here:    [ONEPLUS 8 PRO REVIEW]  Every year since 2014, OnePlus has released a new smartphone, and nearly every year its raised the price. That in turn has caused reviewers like me to ask, is it worth the extra money?  and for the past six years, the answer, time and again, has been yes.   This is different.   To be clear, Im not saying the OnePlus 8 Pro doesnt earn its asking price, which is $899. And we should remember that its not the first OnePlus to hit this threshold either: the McLaren edition of last years 7T Pro was priced the same. But if we ignore special edition phones and directly compare, generation to generation, whats available here in the States  the OnePlus 8 Pro is a $230 jump from last years 7 Pro.   Thats a lot. To some its evidence of OnePlus losing touch with its core values, sacrificing its status as smartphone value hero and finally \"becoming the villain.\" Does this argument hold up, or is OnePlus finally just coming into its own? Find out in the MrMobile OnePlus 8 Pro Review!    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S ONEPLUS 8 PRO REVIEW]  MrMobile's OnePlus 8 Pro Review was produced following 13 days with a OnePlus 8 Pro review device (model IN2025) provided by OnePlus. The device was carried alongside a OnePlus 8 (model IN 2015) in Brooklyn NY and tested on Verizon and T-Mobile. It received a single software update during the review period.  MrMobile does not produce paid reviews; no company paid a fee or otherwise offered compensation in exchange for this coverage, and no company was offered copy approval or an early preview of this content. The lone sponsor of the OnePlus 8 Pro review is dbrand.  MrMobile's parent company Future plc participated in a promotional arrangement with OnePlus to host a Q&A session on Twitter following the OnePlus 8 Pro launch. While Michael Fisher answered some questions during that Q&A, neither he nor the MrMobile division was involved in the advertising or negotiation process, and the MrMobile division received no compensation for that participation.   [LINKS]  OnePlus 8 Review [Android Central]:   OnePlus 8 Pro Review [Android Central]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #oneplus8 #oneplus8pro #oneplus #smartphone #tech",
    "description_links": [
        "http://dbrand.com/mrmobile-op8pro",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.androidcentral.com/oneplus-8-review",
        "https://www.androidcentral.com/oneplus-8-pro-review",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "(Upbeat music) - [Michael] Every year since 2014 One Plus has released a new smartphone and nearly every year it's raised the price. That's meant that reviewers like me have had to ask, is it worth the extra money? and for the past six years the answer time and again has been yes. (whooshing sound) This is different. (Upbeat music) - [Michael] To be clear, I'm not saying the One Plus 8 Pro doesn't earn its asking price, which is $899, and we should remember, that it's not the first One Plus to hit this threshold. The McLaren addition of last year 17 Pro was priced the same. But if we ignore a special edition phones as most buyers do and directly compare generation to generation of what's available here in the States, the One Plus 8 Pro is a $230 jump from last year's seven Pro, that's a lot. To some it's evidence of One Plus losing touch with its core sacrificing its status as smartphone value hero for, something else. I get that, but I don't agree with it and I'll explain why at the end of the video. For now it's enough to say that One Plus, wanted to finally build a phone that would let him sit at the big kid's table. It started by including the typical top shelf components, which means the core of this phone, is the Snapdragon 865 which means, low band 5G is built right out. To explain how significant this isn't, allow me to quote my One Plus 8 review. Folks, by now you should understand three things about 5G, one, it doesn't cause coronavirus so please, stop burning down cell sites. Two, It's the backbone upon which the future of communications is going to be built, so it will someday be very important, but three today is not that day. Yeah, 5G is not something people are clamoring for yet and for the reasons why, I'll link it to my various 5G videos below. Happily though, the 8 Pro does offer two features many of us have wanted out of One Plus for years. IP 68 dust and water resistance and wireless charging. But it's not just any wireless charging, it gets better, while the phone can charge from a standard G pad at five or 10 Watts. One Plus has always said that that's just too slow for them. So the company built a 30 watt charger, the $70 warp charge wireless, that boosted my phone from empty to 56% in a half hour. Now that comes with comPromise, this is the dock is big and bulky , it's because there's a fan inside and that's because wireless charging heats things up. On the whole batteries don't like heat, so if you fast charge a lot, expect your battery to age less gracefully. The good news is they thought about this, you have the option to manually turn down the charging speed, which also turns down the fan noise. And you can also charge accessories on the back of the phone with three watt reverse wireless charger. It's so great to finally see One Plus adopt this tech and push it forward at the same time. I understand if you live overseas and you can get Huawei phones or Xiaomi phones, they're already eclipsing this, but, if you live in the States, this is the fastest refill you can get wired or wireless. So I'm calling the whole charging package a big win. (Upbeat music) - [Michael] Sadly, even with 5G, IP and a WC, the casing design is very 7T. That's a long way of saying this isn't a very exciting look, despite the new soft touch finish on the glass. The clever pop-up camera that allowed this true edge to edge display on the seven Pro, replaced, by this pedestrian hole punch that you can only hide by making it look even more goofy. And the screen is still curved on the sides, which isn't great because One Plus is Palm rejection still isn't very good. If those complaints feel familiar maybe it's because this phone shares a common design basis with the Find X2 Pro by One Plus sister company OPPO. Like OPPO, One Plus has decided that a beautiful display running at 120 Hertz, One ranked visually indistinguishable from perfect by display mate, well, that's just not enough. So to make it even more special there's technology here that up scales 24 frames per second video to 120 frames per second. But as you'll probably agree if you've ever seen motion interpolated video on a modern TV, this is a polarizing so-called feature and what's more, it's turned off by default. So I'm not at all convinced it's worth the added cost of including it. Thankfully, One Plus didn't skimp where the camera's concern, at least on the spec sheet, let's start with the ultra wide. I often come down on manufacturers for treating the ultra wide camera as a second class citizen because sometimes you need to go wide to tell the whole story of a shot. See here, but One Plus backed up that ultra wide lens with a 48 megapixel sensor, same resolution as the primary camera. That's another import from OPPO. Unfortunately, One Plus didn't also bring over the find X Two's crazy Periscope zoom. Instead we're stuck with a three X standard zoom, which you can push past, but you're not gonna wanna. The One Plus 8 Pro kicks out some great stuff. I love being able to go ultra wide without sacrificing detail and I really appreciate the continued focus on macro photography. I'm sorry, I'm petty combat closeups, I'm I right? Softwares faster than ever and so as the focus for the first time maybe ever, i don't feel like I'm waiting for a One Plus camera to keep up with me. Bringing the competition for context though, and you can see there's still room for improvement. Look at the dark shadows in the alleys of the shot. The iPhone 11 Pros at a dynamic range means it doesn't crush those shadows, like the One Plus 8 Pro does and Apple's phone pulls much more detail from the moon in this shot, while the One Plus just kicks out a white disc. (Upbeat music) - [Michael] The V8 Pro also tends to over saturate the sky tones compared to the Google pixel four, though admittedly not nearly as much as Samsung does with the galaxy fold. Switching over to video One Plus earns two more big thank yous one, for bringing its excellent electronic stabilization to 4k and two, for exporting video in a color space that's easier to work with. The new cinematic aspect options and filters are also fun, if little toy like, I have no idea why you'd want a photo to look like this, but you can. As you may have noticed, the image is still fairly noisy in video. Also, despite the improvements of the wide angle camera, you can't use it with either HDR or super stabilization and with filming modes available that'll eat up a gigabyte per minute of shooting. I sure wish this phone came with more than 128 gigs at its base level. For more cameras samples, be sure to check out Android Central's review. My friend Daniel Bader noticed some compositing errors that I wasn't able to reproduce, I'll link it below. Now if there's one thing harder to test on the camera when you're in quarantine, it's the battery life, with light usage I've been able to get two days between charges, whether I'm on wifi or T-Mobile's 5G network. Given the capacity of this battery and the rapid charging options, I don't foresee endurance being a problem for most folks. Those same folks will be happy to hear that fundamentals like voice calls work, just as well as the new haptic vibration motor and the software is as quick and customizable as we've come to expect. Actually it's better now that the One Plus shelf has been replaced by the Google feed, Something I'd wanted for a long time. (Upbeat Music) - [Michael] Speaking of something I've wanted for a long time, a One Plus phone without as many compromises. Folks, this is it, at a buck under $900 to start it's not the totally insane deal that One Plus phones used to be and I understand the frustration of those who see that as a betrayal. As One Plus living long enough to see itself become the villain. But what the company has done here is give us the biggest upgrades we've been asking for, for years and it's still a hundred bucks less than Samsung galaxy S20. If you need a cheaper option, the One Plus 8 is a stripped down version of this model for $700, my review is up now on the channel. But this is for folks who want more and at the end of the day, the One Plus 8 Pro is still a great way to get some of the best of Android for less, just not as much less. It's on sale unlocked April 29th. Sponsored pro tip. If you want to protect your phone without bulking it up and you'd like a more exciting look in the process, not just de-branded it, tear it down. Yeah, I finally got my hands on one of the dbrand tear down skins for this phone and from the ultra matte finish to that red battery accent, Zach and the bots nailed it. Of course, if you want something a little lower profile, dbrand's got you covered there too, details at the link in the description. Disclosure, this video and my One Plus 8 review were produced with review samples provided by One Plus, but MrMobile doesn't make paid reviews. One Plus offered no compensation and was not offered copy approval or an early preview of this content, that means they're seeing it for the first time right alongside you. Please subscribe to the MrMobile, if you'd like to see more reviews like this on YouTube. Until next time, thanks for watching and stay mobile, my friends. (Upbeat music)",
    "transcript_keywords": [
        "Pro",
        "phone",
        "video",
        "camera",
        "ultra wide",
        "wireless charging",
        "time",
        "year",
        "wireless",
        "phones",
        "charging",
        "wide",
        "years",
        "review",
        "ultra",
        "Folks",
        "charge",
        "ultra wide camera",
        "OPPO",
        "big"
    ],
    "transcript_entity_values": [
        "Huawei",
        "2014 One Plus",
        "Watts",
        "more than 128",
        "a hundred bucks",
        "last year's",
        "YouTube",
        "Xiaomi",
        "4k",
        "900",
        "Samsung",
        "Android Central's",
        "April 29th",
        "Upbeat Music",
        "McLaren",
        "the past six years",
        "IP",
        "Apple",
        "States",
        "last year",
        "30 watt",
        "four",
        "17",
        "two days",
        "700",
        "230",
        "WC",
        "today",
        "Hertz",
        "Daniel Bader",
        "One Plus",
        "One Plus 8",
        "first",
        "One",
        "899",
        "five",
        "three watt",
        "One Plus",
        "Michael",
        "Palm",
        "70",
        "two",
        "One Plus",
        "Google",
        "Zach",
        "T-Mobile's",
        "56%",
        "One Plus",
        "years",
        "the Find X2 Pro",
        "MrMobile",
        "second",
        "5",
        "48 megapixel",
        "Softwares",
        "68",
        "Two",
        "seven",
        "24",
        "nearly every year",
        "S20",
        "comPromise",
        "120",
        "three",
        "OPPO",
        "one",
        "Android",
        "8",
        "the end of the day",
        "a half hour"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "LOC",
        "CARDINAL",
        "MONEY",
        "DATE",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "EVENT",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME"
    ],
    "vector": [
        -0.10155735164880753,
        0.05868162214756012,
        0.045280154794454575,
        -0.01648418977856636,
        0.021752774715423584,
        -0.002568600233644247,
        -0.004540964961051941,
        0.18809223175048828,
        0.022599535062909126,
        0.06242447718977928,
        -0.017267536371946335,
        0.05548781156539917,
        0.019820136949419975,
        0.005009809974581003,
        0.03531090170145035,
        -0.01789596863090992,
        0.08111822605133057,
        -0.11268331855535507,
        -0.03150073438882828,
        -0.020813794806599617,
        0.011413336731493473,
        -0.045034389942884445,
        0.06345794349908829,
        0.00732703460380435,
        0.06211579963564873,
        -0.04592243954539299,
        -0.08693087846040726,
        -0.023832952603697777,
        0.0009495088015682995,
        0.002489322330802679,
        0.024823537096381187,
        0.12137848883867264,
        0.004097359254956245,
        0.008481132797896862,
        -2.6276338758179918e-05,
        -0.06047305837273598,
        0.09435699135065079,
        0.021682020276784897,
        -0.05787630006670952,
        -0.023719733580946922,
        0.0033232353162020445,
        -0.008006996475160122,
        -0.07770185172557831,
        0.007551176007837057,
        0.017340313643217087,
        -0.05922138690948486,
        0.07563536614179611,
        0.02363511733710766,
        0.009394640102982521,
        -0.04055522754788399,
        0.059732284396886826,
        0.0004001534543931484,
        0.06375392526388168,
        -0.08835725486278534,
        -0.069462850689888,
        0.02252543903887272,
        -0.008564528077840805,
        0.0014633225509896874,
        0.07400557398796082,
        -0.006512609776109457,
        0.004817405715584755,
        -0.06319133937358856,
        -0.004722725134342909,
        0.04597917199134827,
        0.031390704214572906,
        -0.06251645088195801,
        -0.017697695642709732,
        -0.1272297203540802,
        -0.05300823599100113,
        0.040268026292324066,
        0.029932953417301178,
        0.0032534217461943626,
        0.056476809084415436,
        0.030824366956949234,
        -0.011931756511330605,
        0.10314247757196426,
        0.06480978429317474,
        -0.005750092677772045,
        -0.030026666820049286,
        0.022121289744973183,
        0.09299825131893158,
        -0.0596095472574234,
        -0.04800770431756973,
        -0.06406242400407791,
        0.04068123176693916,
        -0.03114953078329563,
        0.04694163426756859,
        0.032585278153419495,
        0.01043532881885767,
        -0.04979445040225983,
        0.015129106119275093,
        0.05132612958550453,
        0.05351155251264572,
        0.04309868812561035,
        -0.04324054345488548,
        0.029384993016719818,
        -0.10960055887699127,
        -0.06217402592301369,
        -0.05585425719618797,
        0.008495928719639778,
        0.02857860177755356,
        0.001036028377711773,
        0.03171106055378914,
        0.030178699642419815,
        0.048389606177806854,
        -0.001649412326514721,
        -0.0009750592871569097,
        -0.04404092952609062,
        0.053944990038871765,
        0.06171806529164314,
        0.0031490728724747896,
        -0.048580754548311234,
        -0.013121548108756542,
        0.022562826052308083,
        -0.022431273013353348,
        0.019770832732319832,
        -0.08476615697145462,
        0.06167596951127052,
        0.07025346159934998,
        0.03932909667491913,
        0.027352705597877502,
        -0.0541379451751709,
        -0.026962464675307274,
        0.005670047830790281,
        -0.004796414170414209,
        -0.033280059695243835,
        -0.02572002448141575,
        2.0972624704524075e-33,
        -0.04519534111022949,
        0.0775536447763443,
        -0.044076159596443176,
        -0.025338189676404,
        -0.06416488438844681,
        -0.03680338338017464,
        0.008143583312630653,
        0.034354113042354584,
        0.031939443200826645,
        0.01906220242381096,
        -0.09584459662437439,
        0.0018544397316873074,
        -0.05573534220457077,
        0.06302548944950104,
        0.04251297935843468,
        0.0010575578780844808,
        -0.015397462993860245,
        -0.03174098953604698,
        0.009994921274483204,
        0.004671110771596432,
        -0.028553497046232224,
        -0.028350280597805977,
        0.007733293808996677,
        -0.03843710571527481,
        0.04493454098701477,
        0.04565661773085594,
        0.022846713662147522,
        -0.05273609980940819,
        0.07645014673471451,
        -0.0160503126680851,
        -0.10908172279596329,
        -0.02037941664457321,
        -0.011487094685435295,
        0.019946439191699028,
        -0.0008323549409396946,
        -0.00874309055507183,
        0.020531464368104935,
        -0.060761671513319016,
        0.08829045295715332,
        0.009813552722334862,
        -0.11883732676506042,
        0.041532885283231735,
        -0.07429111748933792,
        -0.04607512056827545,
        0.07695042341947556,
        -0.03593159839510918,
        -0.018619351089000702,
        -0.05821482837200165,
        -0.060483068227767944,
        -0.05966264754533768,
        -0.03157985582947731,
        0.025512879714369774,
        -0.037841666489839554,
        0.01129949651658535,
        -0.11343459039926529,
        -0.009491692297160625,
        0.06007842719554901,
        -0.0418146513402462,
        0.1302545815706253,
        0.020598694682121277,
        0.011056740768253803,
        0.014410090632736683,
        -0.06208308786153793,
        0.027602797374129295,
        -0.08369211107492447,
        0.12695753574371338,
        0.080288827419281,
        0.03238709270954132,
        -0.08661305159330368,
        0.06610967963933945,
        0.015409966930747032,
        -0.03958737477660179,
        -0.02104075253009796,
        -0.04014553874731064,
        0.031573157757520676,
        0.03374728560447693,
        0.03318832442164421,
        -0.009786578826606274,
        0.028756828978657722,
        0.005063340067863464,
        -0.02669505961239338,
        0.04663093388080597,
        -0.012736611999571323,
        0.003910277038812637,
        0.059342823922634125,
        0.025085261091589928,
        0.016848957166075706,
        -0.04137646034359932,
        0.06321156024932861,
        0.06477794051170349,
        0.04605148360133171,
        -0.03857799619436264,
        -0.07222089171409607,
        0.043812111020088196,
        0.01689980737864971,
        -3.489883301170041e-33,
        -0.1444285660982132,
        -0.000410044303862378,
        -0.005455631297081709,
        0.011274908669292927,
        0.005799346603453159,
        -0.041384387761354446,
        -0.020564168691635132,
        0.0145758967846632,
        -0.03893355280160904,
        -0.02933838590979576,
        -0.05655581131577492,
        0.031919002532958984,
        -0.035470012575387955,
        0.006844682618975639,
        0.022334011271595955,
        -0.025004057213664055,
        -0.005536006297916174,
        -0.06109781935811043,
        0.0327683687210083,
        -0.032218292355537415,
        0.02786601148545742,
        0.046435803174972534,
        -0.0026379963383078575,
        0.0757654458284378,
        -0.06475570797920227,
        -0.018889177590608597,
        -0.017735276371240616,
        -0.05969132483005524,
        0.03250671923160553,
        -0.006730755791068077,
        0.0019202334806323051,
        -0.013963207602500916,
        -0.006935513112694025,
        0.015453660860657692,
        0.06272507458925247,
        0.058377042412757874,
        -0.00018942284805234522,
        -0.09023153781890869,
        0.04154906049370766,
        0.055938635021448135,
        0.027994727715849876,
        0.005356436595320702,
        0.04664727300405502,
        -0.028441373258829117,
        0.07030142843723297,
        -0.030888153240084648,
        -0.018074121326208115,
        0.030483368784189224,
        0.07078660279512405,
        0.05000532791018486,
        0.07928313314914703,
        0.09203700721263885,
        -0.022341085597872734,
        -0.0492924340069294,
        -0.08038771152496338,
        -0.0905989333987236,
        0.013590213842689991,
        -0.07097770273685455,
        -0.08192465454339981,
        0.011151009239256382,
        0.06736064702272415,
        0.06347398459911346,
        -0.030173661187291145,
        0.0072799380868673325,
        -0.0728614553809166,
        0.06382247805595398,
        0.06742484867572784,
        -0.06460665911436081,
        -0.044706571847200394,
        -0.00958268903195858,
        0.011247968301177025,
        -0.07326048612594604,
        -0.0982070192694664,
        -0.10893283039331436,
        -0.007803638000041246,
        0.1124579906463623,
        -0.07309006154537201,
        -0.01527630165219307,
        0.03311014547944069,
        -0.035177189856767654,
        -0.047989632934331894,
        0.02845580317080021,
        0.05242713540792465,
        -0.06950491666793823,
        0.04263283684849739,
        -0.043190013617277145,
        0.03918538987636566,
        0.011699399910867214,
        -0.00633444357663393,
        0.05992715433239937,
        0.0012237016344442964,
        0.014459650032222271,
        -0.07657577842473984,
        -0.013410698622465134,
        -0.024737006053328514,
        -5.031355243545477e-08,
        0.059073399752378464,
        -0.009314275346696377,
        0.08470623195171356,
        -0.013461906462907791,
        0.02268396131694317,
        -0.08761711418628693,
        -0.017527956515550613,
        -0.028783436864614487,
        0.09343008697032928,
        0.05092766880989075,
        0.031355325132608414,
        -0.06236753612756729,
        -0.07181476801633835,
        0.04092758893966675,
        0.005100488197058439,
        0.09115295112133026,
        0.012481313198804855,
        0.011122648604214191,
        0.0010173871414735913,
        0.050558507442474365,
        0.04005530849099159,
        0.07315248996019363,
        0.012663092464208603,
        -0.11683142930269241,
        0.036069393157958984,
        -0.008950945921242237,
        -0.062369510531425476,
        -0.0010982995154336095,
        0.0384502075612545,
        0.005894426256418228,
        0.011708944104611874,
        -0.007950953207910061,
        -0.06034791097044945,
        -0.0033542411401867867,
        0.0431382954120636,
        -0.09947949647903442,
        0.01876390539109707,
        0.08759685605764389,
        0.03967970609664917,
        -0.02905900962650776,
        0.020987918600440025,
        -0.018267424777150154,
        -0.02657475881278515,
        0.03679604083299637,
        -0.05380185693502426,
        0.03600964695215225,
        -0.05270993709564209,
        -0.07693148404359818,
        -0.04634052515029907,
        -0.0031435329001396894,
        -0.04086096212267876,
        -0.01745261251926422,
        -0.019653890281915665,
        -0.0626293495297432,
        -0.00012096003774786368,
        -0.07349678128957748,
        -0.03266077861189842,
        0.03391072899103165,
        -0.06648716330528259,
        -0.006822408642619848,
        0.05866917967796326,
        -0.1629968285560608,
        0.04911993443965912,
        0.06409116834402084
    ]
}