{
    "id": "udNXMAflbU8",
    "title": "Holey Plugs, Batman! But... what are they for?",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2021-10-09T15:13:18Z",
    "video_url": "https://www.youtube.com/watch?v=udNXMAflbU8",
    "category": "Science & Technology",
    "tags": [],
    "views": 5398248,
    "likes": 142620,
    "comments_count": 16301,
    "description": "The answer may surprise you. Links 'n stuff I've made a playlist of my various electrical shenanigans. You can get to it here:  Technology Connections on Twitter:  The TC Subreddit  This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   Oh, and look at these wonderful patrons! Cody Bittle, Patrick, Andrew Hoddinott, Benjamin Rister, Shay Sandik, Patrick Kennedy, Jesse S, Oswyn Brent, A tall shade of the color red, Colin Gagich, Mike McCaffrey, Mike Olpin, Michael Steinmetz, Andrew Krew, Devedander, Bryan Countryman, David McGrath, Richie Gaiser, Benjamin Albert, Truls Zhong Konstali, Cuervo , Mauve Co, Martin, Eric Graves, Philip Cheek, Alexander Schlickenmaier, Jesse Weaver, Thomas Kula, Ed McCloskey, Harold Godwinson, Jordan DeLong, Keith Hemenway, Aaron Greenberg, Matt Brown, mooncow , Oliver White, Andrew Eslick, Brent Medling, Joel V, John Harris, Mike and Zack, DCBuffalo, Emilio Mendoza, Patricia , Cody, Colin Coyle, Cuddlefisch , nate grover, Martin Smith, Darryl !, bagel mode, DankPods, Ian McDougall, Derek Watson, Marten van Wezel, TJ Zimmerman, Dan Barrett, Kristofer Luck, SingleMaltSloth, Tennavan, Corey W. Anderson, Aaron Teague, Nathaniel Caza, Andrew Chappell, Sammie Mammel, Serge Wroclawski, Matthew Hackbarth, Joel Neatrour, John Zelinka, Jimmy Albin, Jordan Thoms, Bob Leonard, Erik Victory, Andre Alforque, Kevin , Roger Hosey, Paul HW, Anthanasius, Steven gindler, Matt Keaveney, Keegan Carter, TJ , Zengwish, Bennett Colesberry, Ivan Avdeev, Ron Thomas, John Haager, Melody Olvera, Joshua Nahum, Chris Galloway, Sobol, cyberstorm, SHAUN, Keith Chang, Brad Feehan, Mitch Brunner, Eric Rakestraw, Brett Caven, h2g2guy , Charlie Davidson, Noah W., Matthew Abbitt, Thomas & Robert Rhode, Steve McClellan, Nitin Dahyabhai, Dennis Morhardt, Scott Albertine, Jelle De Loecker, Michal Mikernk, Ry Biesemeyer, NobTinker , Devin Edwards, Randy Messinger, Seth Persigehl, Piro606, Nathan Friedly, Robert Hausner, Matthew David Chapin, Bill King, Roadrunner 531, Gareth Brown, Butter Penguin, Maarten De Rocker, John Whitaker, Joo Pedro Francese, Joseph Russell, Mike Richards, ZGryphon , Eric Walter, Andreas Trottmann, Lee Sweet, Justin Zakrzeski, Artem Leshchev, Jared Julien, Max Maguire, Gunnsteinn risson, RandallA, John Heavisides, Rob Newman",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLv0jwu7G_DFU62mIGZNag5vQ0a6tDGBpO",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Oh boy, its TC does something electrical time again! Today were answering the age-old question why do US plugs have holes in them? Thats a great question! And many people have asked that. Especially people who have noticed that plugs have holes in them. Lets ask everyones begrudgingly favorite search engine. Oh! Thats a perfectly logical explanation! Of course, why didnt I think of that? The outlet side must have some sorta squeezy thing to grab the blades of the plug, and putting a little hole in the plug for it to index to sure would be helpful. I bet that makes the plug less likely to fall out of the receptacle! Except it doesnt. And thats not what its for. At least, not intentionally. While the commonly-cited explanation makes logical sense, it seems few people are taking the next step which is of course to test this claim. And no, you dont need to do what Im about to do and rip an outlet apart to see its insides - thats dangerous and you should not do that. But what you absolutely can do, and probably have done several times in your life, is plug something in and pay attention. Now as Ive said many times at this point the NEMA plug design that were stuck with here is objectively terrible and among the worst in the world in terms of safety just a friendly reminder that this pin is live! And yet really easy to touch! uh but weve been over that. What I want you to notice is what it feels like when you insert the plug. Here we have a standard polarized lamp cord. Oh - right, side-note: There is one thing that our plug does to try and make up for its general haphazardness. I havent brought it up because I assumed it was fairly universal across the globe, but much to my surprise it isnt apparently. Our plugs are polarized. Look at practically any outlet and youll see that one of the slots is wider than the other. And on many two-pin plugs like this, one blade is fittingly wider than the other meaning it can only be inserted into the receptacle one way. This is to enforce polarity between live and neutral. Of course this only works if the receptacle was wired correctly but assuming it was the narrow blade is live and the wider blade is neutral. Grounded plugs usually dont bother making the neutral blade wider because the position and presence of the ground pin enforces polarity on its own, similar to how many other countries do it. You might think that since were dealing with AC power here polarity doesnt matter, and yeah everything will work if its wired backwards, but that introduces danger in certain situations. Take, for example, an antique toaster with a single-pole switch. If polarity isnt enforced in the plug, and the switch happens to be on the neutral side when you plug it in, then all of the heating elements and bus bars that are literally right there and in easy reach would be live at 120 volts even when the toaster isnt toasting. Thats shockingly unpleasant! A simpler but no less important use for a polarized plug is in a common lamp with an Edison socket. These are dangerous all the time because child fingers and indeed full-size human fingers can get right in there. But making sure that the outer sleeve is neutral makes it at least marginally safer (and ideally prevents you from getting zapped off a light bulb where a bit of the screw surface is exposed and thats pretty common.) Still need the outlet (and lamp) to be wired correctly, though, so dont go testing that one for yourself. Anyway, not everything needs a polarized plug. Things that are double-insulated, for instance, pose very little risk of leakage current happening and so either blade is free to be whatever it wants to be. As an example, tons of electronics stuff like USB power supplies or other power supplies dont bother with polarization. But most general electrical devices, especially those with a power switch, will use a polarized plug to ensure the switched leg is the hot leg. Its one of the few objectively good ideas in this plug design, and oddly enough we all seem used to it and aren't constantly playing Shcrodingers USB. Of course we could just put a ground pin on everything but wheres the fun in that? Then these things wouldnt just be dangerous, theyd be useless! OK so back to the holes. Ive got a lamp here with a holey plug and you know what Im gonna do? Im gonna plug it in. Slowly. If these holes are used as a point for some sort of mechanical pinchy dude to grab on, surely I should feel the plug sort of give as its fully inserted, right? That would be when the holes would align with whatever this pinchy thing is, at least youd hope so. OK so, here we go. Hmm. There doesnt seem to be any sort of change in resistance here. Its just a firm but smooth push the whole way. Same with removal. But Ive got a bunch of different outlets I can test! Ive got more of these than any other cuz Im fancy but heres a tamper-resistant GFCI outlet. Hmm. Same as before. Alright and another one with a switch built-in. Still no obvious interaction with those holes. Uhh alright heres a more generic one in my garage. Nope, still smooth. Uhhh... the basement! Theres more in the basement. Theres this GFCI receptacle here by the electric panel and nope. Nothing. This one! Over here! Nope. OK but theres these! Theres these! The grey tamper-resistant ones on a switch, by the way, I knew youd want to know. Uh, nothing on the white one ok... OK the grey one. Help me out the grey one. Youre my only hope. Ahh! No! Is there not a purpose for these holes? Has my life been a lie? Oh wait! Theres a 20A GFCI in the garage I forgot about! Here goes at last! At last! The plug gave way after I first encountered resistance, somethings engaged with the holes! But wait, that's not inserted fully. Well thats silly! Indeed it is. So was that whole sequence. Anyway, to see whats going on we need to look at whats inside some receptacles. Luckily, through the magic of buying several and viciously tearing their faces off, we can see. I have four different kinds today. The cheap kind that comes in a big ol' box with like a hundred of them just loosely thrown around. A slightly less-cheap one that purports to be heavy-duty. A so-called commercial grade feller. And this one thats old and I have a bunch of them and I couldnt really tell you why exactly. Theyre off-white. Not my jam. I suppose mayonnaise is an off-white jam So, these are the grabby things. They actually grab onto the plugs blades and make electrical contact with them. And theyre all different! Luckily we can remove these from the plastic to get a closer look at them. Of these designs, there are two that might kind of sort of make use of those holes but lets start with the two that obviously dont. Thats these two. The mystery one and the cheap one. In the cheap one, we have two perfectly flat brass pieces pressing into each other. There isnt any kind of protrusion or bump or anything to even hope to engage with the hole, and indeed the hole will simply glide right on through. In fact the flat surfaces are longer than the holes diameter so theres no possible way for the hole to have any sort of impact. This is purely a friction fit. With the old mystery one we have the same deal, although the construction is a little different. Here the brass is formed into a U-shape and the blade goes in the middle of the U. Now the blade is wider than that gap so there is quite a lot of friction produced here, but it is notable that in the other design the blades actually touch without a plug in place. Its a very different design, here, with the spring tension being delivered from this lower joint and not the U-bend. Perhaps its more durable, but Im not about to sit here for months and find out. So now the heavy-duty one. This is a little strange. We have a somewhat similar arrangement to the cheap one, with two angled tabs meeting to form a pinch point, but the brass pieces arent straight. One is very slightly curved, and the other also deviates slightly from straight to meet it. With a blade between them the resulting deformation gives two not-quite-flat contact areas on either side of the blade. Now, this kink spot here seems to sometimes land in the hole without a plug in place you can see that the two sides actually only touch at the top, almost making a tent-shape. Sadly I did not buy two of thesea terrible oversight on my part so I cant see how the plug fits in here. And its face is too mangled to get an accurate idea. But I have to say that of these designs this one seems to be the absolute worst. The width of a plugs blades isnt enough to deform these into straight, parallel lines theyre simply too far apart. So you dont get a flat contact patch with the blade on either side, instead you get two smallish points. Dont like that. But because of that, depending on how you insert the plug, those points might land where the hole is, and sort of grab onto it. But I sincerely dont think thats intentional. In fact if that happens youd get an even worse electrical connection because thered be less pressure on the blades where the hole is. And so now we are down to the commercial version. This ones got weird-looking sideways blade grabbers because this same design is used in 20A receptacles and likely the even-weirder looking NEMA 6-15 and 6-20R 240V receptacles. Yes, friendly reminder, 240V circuits exist here but theyre weird. I made a video about them. Anyway the actual contacts are able to accept either the normal vertical blade or the less-normal sideways ones and thats why they look like this. Taking a closer look we can see that, once again, theres nothing in there that looks as if its intentionally engaging with the hole in the plug. The inboard contact is completely flat with nothing so much as a bump, and the side contacts well maybe they might drop into the hole a bit, I suppose, but again. Doesnt look to be intentional at all. And if we go back to this here outlet, which undoubtedly has the same internal connections at least on the left-hand side, well remember that while the plug does seem to get caught as its inserted, that happens before its fully-inserted. Which is just silly. The fact of the matter is this is just a friction fit. Thats it. The presence of the hole in the plug, if anything, makes the connection slightly worse. But heres the thing - if a plug is fully inserted? Those holes end up way past the actual point of contact. And you dont even need to look in here to see that, just grab a plug. After a few insertions and removals, there will probably be witness marks left on the blades. And sure enough, they dont stop at the hole. They go well beyond it. One of the other holes in this whole hole argument is that lots of plugs dont even have them! This timer doesnt. [awkward pause] And this is the only thing I could immediately find. But, I can think of at least two other unholey things Ive had - a night light and a lamp. Also Im pretty sure I have a power supply cord somewhere without holes. Also it should be noted this is from IKEA, its not just some weird random timer from the dollar store or whatever. Despite not having holes in its plug blades, it fits just fine into all my outlets and whatever. Nice and snug. So whats the deal with the holes then? Why do so many in fact nearly all plugs have these holes in the exact same places if theyre not actually doing anything useful? Well, the toads over at NEMA actually do tell us what the deal is with the holes. The holes are, and I quote, Optional, and it is intended for manufacturing purposes only. However, if used, it must be located as per dimensions shown above. Interesting. Ya know, manufacturing purposes makes a lot of sense now that I think about it. Take this incredibly common plug design. The leads of the cord are simply soldered or perhaps crimped to the blades and then a big ol glob of plastic is molded around it. These clear ones reveal that quite clearly. Putting holes in the blade would allow for a very simple mold-alignment procedure using nothing but some sort of stick. In fact heres that exact thing happening in a factory which manufactures these. The worker simply has to thread an alignment rod through this holder, place the blades and wires in there while pushing the rod through as they go, give a tug to ensure its aligned, and boom. Plugs made to spec. But why is the location so important? Well, as far as I can tell, the answer appears to be pretty simple. NEMA just wants to be sure that the hole is far forward enough that it wont land where the contacts touch the blade when the plug is fully inserted. We saw from the witness marks that the hole should go past the contacts, and none of these receptacles engage with the hole in any deliberate manner, and those which appear to do it do it badly. Again. This is not fully-inserted. [Voiceover] While editing this video I ran across some mention of old patents which do show using the hole as part of a locating mechanism. I didnt confirm these but another person claimed to have seen some old receptacles in the wild which had a locking lever, presumably utilizing those holes. However it seems pretty clear that these are long-deprecated uses for them. Whether NEMA is honoring these legacy devices in codifying the location of the holes is not known to me, but I guess its possible. However, I think in the end its not a good idea to encourage contact designs which use the holes for indexing because of a problem Im about to bring up. Now I suppose there could be receptacle designs out there which do have some sort of bump on the contacts which indexes the hole but that seems like it would introduce other problems. If that were the case, the pins would have to bend beyond their resting point to allow for plug insertion and theyd wear out more quickly, at least it seems that way to me. Maybe there was an old design that NEMA wants to ensure compatibility with. But that still seems unlikely to me. All signs seem to point to it just needs to be at least this far forward, and also making it too large would affect structural integrity and current-carrying ability if the plug werent fully-seated, so we codified the holes size and position. Whether you want to use it and for what is up to you. Well, I think thats about it! This video has a lot of speculation in it. If you couldnt tell. But Id welcome any of the NEMA toads out there to fill us in on any details I might have missed. Like, for instance, are there historical designs out there that use these holes for something? And why is it so common for devices to have them, even things like these? Is there a factory somewhere that just makes zillions of these blades and they put the holes in not knowing what theyre gonna be used in? Will I ever stop asking questions? Yes. Though I have to wonder if part of their prevalence comes from people feeling that they just need to be there. Ill admit that the rare plugs I find without holes all seem kind of wrong. And so maybe this is just a huge cultural or manufacturing inertia thing weve slipped into somehow. People have seen the holes and so, when speccing out whatever thing they want to manufacture, they just put them there. Or maybe there is a factory that just pumps out these blades day in and day out so its not even easy to get a solid blade. In the end, though, it doesnt really matter. This was a pretty silly video, huh. Oh, but before I go, I want to push back on a very common sentiment that the rest of the world has about our plugs. Ive seen over and over again this notion that they dont stay put - that plugs will just fall out of the wall. I can assure you that I absolutely think our plugs are flawed in myriad ways but this isnt really that common. Sure, receptacles will wear out with time and actually if you have one in your home that barely holds onto a plug you really ought to get that replaced because that can lead to fires by way of poor connections and high resistance. But it typically takes decades for a receptacle to wear to that point. Most outlets require a firm pulling force to unplug things, and big nasty wall warts dont have trouble hanging on. However, not all receptacles are created equal, and I think a big part of this perception can be traced to the worlds of hotels, airplanes, airports travel. And in particular this style of receptacle, the kind that often gets integrated into bedside lamps. I tried looking for something in the hardware store that had this so I could take it apart but I couldnt find one. Thats why this is at the end. But I suspect that these are made to much lower standards than the equipment that actually gets placed in a wall. I myself have encountered plenty of outlets like these that are barely holding onto something Ive plugged in, and many are so damaged they dont even work anymore. But it has been quite rare that a real duplex outlet has this issue, at least not to that extreme. Now, even if this werent a bad design, theres the simple fact that, in a travel-scenario, somethings getting plugged into those outlets far more frequently than is typical. Theres a finite lifespan on any connector, and in a setting where people are going to be using them daily or perhaps more frequently than that theyre gonna wear out quickly. In a home setting many outlets get used maybe weekly? Some have something get plugged into them and then aren't touched for a decade or more. Anyway, Im just bringing this up because this criticism is really quite situational. Every time I hear it Im like no, thats not a thing I deal with but then I remember that, actually, yes in hotels thats quite common in my experience. And so I think a lot of you are experiencing badly-designed worn-out receptacles and then assuming thats the norm. And I feel that I must, on behalf of my fellow NEMA compatriots, inform you that this is incorrect. But yeah its still a pretty bad design all round. The mere fact that this is possible is unforgivable. Just tremendously bad. Oh well, at least its not 240 volts comin out of there. optionally smooth jazz Lets ask everybodys favorite begrudgingly f... ugghhh. Well. We were doin so well. Especially people who have [weird noises] ...meaning it can only be inserted into the recept ebbible I dont like how that went. .this only works if the receptacle is wi yeah Im gonna start over because I misread that and I dont want to faff with that later. The cheap kind that comes in a big box with a hundred or so just lohss oops. NEMA just wants to be sure that the hole is far forward enough that it wont land where the contacts touch. The blade. Sentence wasnt over. like when you insert the plug. Here we have a standard plaaaaaughhh. Here we have once again illustrated the perils of Google deciding what answers are. There's literally no basis in reality for the explanation that popped up. People really need to go a little bit beyond what makes intuitive sense because there are a lot of counter-intuitive realities in this world. Oh well, at least there's Ask Jeeves. Wait, it's not Jeeves anymore? I'm old.",
    "transcript_keywords": [
        "plug",
        "holes",
        "hole",
        "plugs",
        "blade",
        "blades",
        "NEMA",
        "plug design",
        "plugs blades",
        "NEMA plug design",
        "thing",
        "design",
        "polarized plug",
        "receptacle",
        "outlet",
        "sort",
        "NEMA plug",
        "people",
        "makes",
        "Things"
    ],
    "transcript_entity_values": [
        "USB",
        "Shcrodingers USB",
        "20A",
        "240 volts",
        "120 volts",
        "TC",
        "GFCI",
        "daily",
        "two",
        "Edison",
        "a hundred",
        "at least two",
        "decades",
        "6-20R 240V",
        "today",
        "zillions",
        "weekly",
        "months",
        "Google",
        "AC",
        "NEMA",
        "US",
        "Today",
        "first",
        "one",
        "four",
        "Optional",
        "Jeeves",
        "a decade",
        "One",
        "240V",
        "IKEA",
        "wi"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE"
    ],
    "vector": [
        -0.11510331183671951,
        -0.06411413848400116,
        0.023897022008895874,
        -0.028736595064401627,
        -0.037158265709877014,
        0.02104925364255905,
        0.09689347445964813,
        0.025559354573488235,
        -0.016046658158302307,
        -0.005247740540653467,
        -0.024218900129199028,
        0.007830542512238026,
        0.02612934820353985,
        0.005259930156171322,
        0.012338176369667053,
        0.0433674119412899,
        0.00845383107662201,
        -0.102131687104702,
        -0.0323638953268528,
        -0.05748000368475914,
        -0.09466657787561417,
        -0.07691691070795059,
        -0.029200879856944084,
        -0.0538373664021492,
        -0.04844241216778755,
        -0.016282042488455772,
        -0.018410945311188698,
        -0.018651841208338737,
        -0.04961758479475975,
        -0.0591779500246048,
        -0.07534117996692657,
        0.059096191078424454,
        -0.003896023379638791,
        -0.019508328288793564,
        -0.031716298311948776,
        -0.042181674391031265,
        0.042410723865032196,
        0.03256453946232796,
        -0.09473945945501328,
        -0.0010025860974565148,
        0.0084281787276268,
        -0.0917668417096138,
        0.04120863229036331,
        -0.00028833281248807907,
        0.03487979620695114,
        -0.06042586266994476,
        0.042561814188957214,
        -0.07464916259050369,
        -0.05802101269364357,
        -0.04559784755110741,
        0.046143632382154465,
        -0.046682484447956085,
        0.0828259065747261,
        0.03981279954314232,
        0.03235425800085068,
        -0.03477490320801735,
        0.02229149453341961,
        -0.0045618354342877865,
        0.03944102302193642,
        -0.001280289958231151,
        0.05514931306242943,
        -0.06420926004648209,
        -0.08406762033700943,
        0.02271130494773388,
        0.020826054736971855,
        -0.019758284091949463,
        -0.026507560163736343,
        0.0778614729642868,
        0.0429321825504303,
        -0.09780437499284744,
        -0.07757687568664551,
        -0.045328136533498764,
        0.01695113815367222,
        0.008157560601830482,
        0.0748210996389389,
        0.011294600553810596,
        0.10818590968847275,
        -0.004081646911799908,
        0.04718730226159096,
        -0.05690425634384155,
        0.07300298660993576,
        0.010561050847172737,
        -0.00954673532396555,
        0.027702299878001213,
        0.03166472539305687,
        0.04892933741211891,
        -0.015751777216792107,
        -0.04539930820465088,
        -0.0832754597067833,
        -0.02048473432660103,
        -0.033128343522548676,
        0.047725919634103775,
        0.027496131137013435,
        -0.015725338831543922,
        -0.007438724394887686,
        -0.012528736144304276,
        -0.023988517001271248,
        -0.08803759515285492,
        -0.06350716203451157,
        0.11015115678310394,
        0.008045021444559097,
        -0.007536849472671747,
        -0.02362203411757946,
        -0.07791167497634888,
        -0.039751168340444565,
        -0.02648884430527687,
        -0.055711083114147186,
        0.06186326593160629,
        0.09923436492681503,
        0.014214240945875645,
        0.025439826771616936,
        0.036380887031555176,
        -0.04826420545578003,
        -0.028755255043506622,
        0.00794640276581049,
        -0.022329090163111687,
        -0.09097637981176376,
        0.09332764893770218,
        0.10318701714277267,
        0.03180234879255295,
        0.003646126249805093,
        0.0770149677991867,
        -0.044511131942272186,
        -0.04062174633145332,
        0.0696367621421814,
        -0.041830409318208694,
        -0.06339190155267715,
        7.264445620170316e-33,
        -0.002926043700426817,
        0.085393987596035,
        0.005942875053733587,
        0.07911637425422668,
        0.10315617173910141,
        0.005125382449477911,
        -0.056386929005384445,
        0.017292199656367302,
        -0.06376572698354721,
        -0.0066546304151415825,
        0.015942825004458427,
        0.0893436148762703,
        -0.029665838927030563,
        0.07895419746637344,
        0.0047529893927276134,
        -0.10647756606340408,
        -0.04229533672332764,
        -0.040119756013154984,
        -0.032975904643535614,
        -0.031342513859272,
        -0.040623415261507034,
        -0.029824545606970787,
        0.060904789716005325,
        -0.001002411707304418,
        0.07173297554254532,
        -0.017552779987454414,
        -0.03852441906929016,
        0.05663495510816574,
        0.11882417649030685,
        0.027752097696065903,
        -0.04212317615747452,
        0.06499267369508743,
        0.016371605917811394,
        0.014452433213591576,
        -0.01883011683821678,
        0.019007308408617973,
        -0.0024660839699208736,
        -0.18768416345119476,
        0.03285900503396988,
        -0.005705071613192558,
        -0.024792516604065895,
        0.06334882229566574,
        -0.066462442278862,
        0.046112265437841415,
        -0.07130952924489975,
        0.026225879788398743,
        0.06801251322031021,
        -0.027262447401881218,
        0.01137850247323513,
        0.05523305386304855,
        -0.0886947438120842,
        0.018189607188105583,
        -0.06238532066345215,
        -0.02118200808763504,
        0.05255919694900513,
        -0.051927145570516586,
        -0.04035233333706856,
        -0.0021730598527938128,
        0.07811562716960907,
        -0.05982029065489769,
        -0.018784506246447563,
        0.038651011884212494,
        -0.06040775775909424,
        0.018420787528157234,
        -0.05642254278063774,
        0.07189973443746567,
        0.057807017117738724,
        0.002692999318242073,
        -0.0022771754302084446,
        -0.04042106121778488,
        -0.06914425641298294,
        -0.0033917506225407124,
        -0.003665632102638483,
        -0.12344268709421158,
        -0.024006880819797516,
        0.01721302792429924,
        -0.045088496059179306,
        0.04230642318725586,
        0.035938993096351624,
        0.032595254480838776,
        -0.04184739664196968,
        -0.05379434674978256,
        -0.032688677310943604,
        -0.030904849991202354,
        0.01741494983434677,
        -0.02941981703042984,
        0.013291925191879272,
        -0.03144502267241478,
        0.021938059478998184,
        -0.04557088017463684,
        0.022958125919103622,
        -0.01670173369348049,
        0.06140444427728653,
        0.0071345544420182705,
        -0.0597710907459259,
        -6.902961270825293e-33,
        -0.0373445488512516,
        -0.009656191803514957,
        -0.05109282210469246,
        0.005364696960896254,
        0.17352409660816193,
        -0.06954238563776016,
        0.0058036367408931255,
        -0.06366713345050812,
        0.07646703720092773,
        0.012227757833898067,
        0.06447531282901764,
        0.11625402420759201,
        -0.054424989968538284,
        -0.048494603484869,
        0.013745873235166073,
        -0.07125731557607651,
        -0.066775843501091,
        0.0347801148891449,
        0.031512025743722916,
        -0.05443301051855087,
        0.059027574956417084,
        0.025827299803495407,
        -0.08558045327663422,
        -0.006398863159120083,
        -0.02256760001182556,
        0.0627000480890274,
        -0.03543826937675476,
        -0.017496928572654724,
        -0.014196619391441345,
        0.12314443290233612,
        -0.024471992626786232,
        0.0353693813085556,
        -0.06661496311426163,
        0.043342988938093185,
        0.060069505125284195,
        0.07997596263885498,
        0.06281135231256485,
        0.04629676416516304,
        -0.08561605960130692,
        -0.06834135204553604,
        0.05430362746119499,
        -0.003653904888778925,
        -0.03156966716051102,
        0.027350613847374916,
        -0.052497245371341705,
        0.0426241010427475,
        -0.08807729929685593,
        0.012741370126605034,
        -0.08069714903831482,
        0.0035935118794441223,
        0.027605116367340088,
        0.01530647836625576,
        0.03804317116737366,
        -0.014830997213721275,
        -0.051528915762901306,
        0.026136016473174095,
        0.06096242740750313,
        0.02161325141787529,
        0.013724962249398232,
        0.06612354516983032,
        0.006842719856649637,
        -0.013620024546980858,
        0.033631108701229095,
        0.03889553248882294,
        0.039690807461738586,
        -0.013929459266364574,
        0.04682609811425209,
        0.04837730526924133,
        -0.015311740338802338,
        -0.006419461220502853,
        0.01192892249673605,
        -0.0041108643636107445,
        0.0075432732701301575,
        -0.06830685585737228,
        -0.04468727856874466,
        -0.036581434309482574,
        0.009200464002788067,
        -0.03518252074718475,
        -0.10020740330219269,
        0.08382962644100189,
        0.004046875983476639,
        0.052333392202854156,
        0.06305847316980362,
        0.0391344390809536,
        0.10305924713611603,
        0.047425270080566406,
        0.024179844185709953,
        0.06001013517379761,
        -0.014056548476219177,
        0.03855056315660477,
        0.0002672955160960555,
        0.06357245147228241,
        0.052334047853946686,
        0.04453115910291672,
        0.012160103768110275,
        -7.656257849930626e-08,
        -0.0012015552492812276,
        0.008702759630978107,
        -0.0352044403553009,
        -0.05113515630364418,
        0.009832710959017277,
        -0.045095961540937424,
        -0.012456417083740234,
        -0.0130992466583848,
        -0.004922741558402777,
        0.06847567856311798,
        0.00883932039141655,
        -0.021670520305633545,
        -0.005931229796260595,
        0.0421162024140358,
        0.18054693937301636,
        0.05725937709212303,
        -0.08122391253709793,
        -0.011878530494868755,
        -0.0807148665189743,
        0.001617992646060884,
        -0.021821720525622368,
        0.05745771527290344,
        0.02499716356396675,
        0.04171637445688248,
        0.009068237617611885,
        0.05933931842446327,
        0.008673513308167458,
        0.04296637326478958,
        -0.042698148638010025,
        0.07339426875114441,
        -0.06333566457033157,
        0.04409411549568176,
        -0.018121786415576935,
        0.017876101657748222,
        -0.0021787500008940697,
        -0.01349056325852871,
        -0.028833869844675064,
        -0.036345094442367554,
        -0.006554001476615667,
        0.06780416518449783,
        -0.0689292773604393,
        -0.05223492532968521,
        0.014443757012486458,
        0.08702149987220764,
        0.02537105232477188,
        -0.0034738134127110243,
        -0.06279906630516052,
        0.02239328809082508,
        -0.03158121556043625,
        0.009806450456380844,
        -0.04765525087714195,
        0.026622310280799866,
        -0.03254903852939606,
        -0.01886999048292637,
        0.009797901846468449,
        -0.010069260373711586,
        -0.007991167716681957,
        0.09460792690515518,
        -0.00786134134978056,
        0.023012958467006683,
        -0.008997691795229912,
        -0.02348913438618183,
        0.04527199640870094,
        -0.005751133896410465
    ]
}