{
    "id": "UFe9cuyBAy8",
    "title": "New M1 iMac review: slim and stylish",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-05-18T13:00:18Z",
    "video_url": "https://www.youtube.com/watch?v=UFe9cuyBAy8",
    "category": "Science & Technology",
    "tags": [
        "imac",
        "new imac",
        "apple",
        "m1 imac",
        "imac 2021",
        "imac colors",
        "imac review",
        "apple event",
        "2020 imac review",
        "apple imac review",
        "apple tv",
        "apple april event",
        "m1 chip",
        "apple m1 chip",
        "apple m1",
        "imac release date",
        "imac release date and price",
        "new imac release date",
        "apple tv 4k",
        "apple tv app",
        "apple tv plus",
        "ipad",
        "ipad pro",
        "ipad pro 2021",
        "new ipad pro",
        "airpods",
        "apple airpods",
        "airpods pro",
        "airpods 2",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 302498,
    "likes": 7098,
    "comments_count": 487,
    "description": "Apples latest iMac comes with a completely new design and the M1 processor. Its a step up over the old 21.5-inch model in every way except for how many ports are on the back. If youre looking for an all-in-one for home use, the new 24-inch iMac is hard to beat.  0:00 Intro 01:00 Configurations 01:29 Hardware 3:00 Benchmarking / Performance 5:25 Apps 6:30 Differences from 21.5\" iMac 7:18 Display 8:05 Webcam 8:40 Speakers 9:13 What it's not 10:02 Conclusion  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:    You can get the iMac here: Apple:   Best Buy:   Amazon:    Read the full review here:     Watch more:  Apple AirTags: the most Apple:   Apple Spring 2021 event in 11 minutes:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://apple.co/3hx3MAk",
        "https://bit.ly/3tUHT0k",
        "https://amzn.to/3waB2Bu",
        "https://bit.ly/3foux7w",
        "https://bit.ly/3epsL5j",
        "https://bit.ly/2RRtTqY",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- This is an iMac, unlike any iMac we've ever seen before. (gentle music) When we reviewed the MacBook Pro and the MacBook Air earlier this year, we were astonished. They were the first machines powered by Apple's M1 chip and they were faster, longer lasting and just better than any MacBooks we'd ever used before. So, our biggest question coming out of that review process was, \"What's next?\" When is Apple going to put this groundbreaking chip in every product they make? Well, that day is here. The M1 is now in the MacBook Pro, the MacBook Air, the Mac Mini, and even the iPad Pro. And today we're finally seeing it in it's first ever all-in-one desktop form factor, the new 24-inch iMac. Configurations start at $1299 for eight gigabytes of memory and 256 gigabytes of storage. This review unit here has 16 gigs of memory and 512 gigs of storage for $1899. You may pay more depending on the accessories you want. Those may sound like high prices but this iMac is really for people who want to buy an iMac, set it down, and not think about computers again for the next five to 10 years. The most exciting difference is that it comes in seven colors. Blue, green, pink, orange, purple and yellow, as well as boring gray. Though, you can only get four at the base price. So, I'm going to be a bit of a grinch about this. As snazzy as these colors are, I do think most of them would look odd and out of place in many home and office settings unless you have a pretty specific color scheme but I do like that these fun colors exist because if you're in the small group of people who really want a yellow computer, there aren't too many other options for you. The new iMac is also sleeker and thinner than its predecessors. Even though it has a 24-inch screen, it's actually pretty close in size to the 21.5-inch iMac from 2019. But its volume has been reduced by over 50%. Apple was able to squeeze in more screen without increasing the chassis size too much by shrinking the bezels around the sides. So, this device is 11.5 millimeters thick or just under half an inch. That's startlingly thin for a desktop monitor, let alone a whole computer. It's basically a really big tablet on a stance. Mine is a touch screen, of course. The reason apple was able to make the iMac so tiny comes down to the M1 chip. The fact that the M1 chip runs so well, while consuming so little power, means Apple didn't need to pack a super elaborate cooling system into the device. Instead, there are just two small fans inside and they were so silent during my daily workflow that I didn't even know they were there but make no mistake, these small fans are all the M1 needs. On some thin devices, you'll see performance decrease if you're running an intense load for long periods of time but we ran Cinebench R23 three times in a row and the scores didn't decrease at all. In fact, they actually went up by a few points between the first and last runs and I could only barely hear the fans spinning during this 30 minute process. We ran a number of other intense tasks as well, including Geekbench and PugetBench for Premiere Pro. So, it's difficult to label these results as good or bad because the iMac doesn't have a ton of direct competition outside of Apple and we generally don't review desktop CPU's here at The Verge. The useful thing these results tell us are that this iMac is a significant step up from the performance of the most recent 21.5 inch iMac and it's going to be a huge upgrade over anything older than that. The scores we got were very similar to what we saw from the M1 MacBook Pro. Basically, the iMac is a 13-inch MacBook Pro, in desktop form. We also ran the iMac through a real-world 4K video export in Premiere Pro. The iMac completed that faster than the MacBooks did, and it blows Windows laptops, with integrated graphics, out of the water. This isn't a computer that's necessarily designed to specialize in this stuff and it's running Premiere Pro through an emulation layer. So, that's pretty impressive. But the 27-inch iMac is a better choice if you'll be doing long form video work in 4K, or 8K, or anything that's super graphics heavy. Again, rule of thumb, if a 13 inch MacBook Pro isn't powerful enough for you, this won't be either. But if you're just buying the iMac for everyday family stuff like emailing, Netflixing, slacking, that sort of thing, I can't imagine you'll run into any performance issues. I was able to use my test unit for all kinds of daily tasks from email, to YouTube, to amateur photo and video work. I was able to hop around between over 25 Chrome tabs with Cinebench looping in the background with no stutter or slowdown whatsoever. And if you're worried that your favorite apps might not be compatible with the M1 processor, don't be. Intel based apps run just fine thanks to Apple's emulation layer called Rosetta 2. I literally had no idea Rosetta 2 was there. I couldn't see a performance difference between translated apps and apps that were running natively. A big feature of the M1 chip is that it allows you to run iOS and iPadOS apps natively on the iMac. Now, if you've ever read a Chromebook review of mine you'll know that I generally find the utility of phone apps on computers to be limited. It can be confusing to figure out whether you use app or browser versions of things. Sometimes the sizing is weird. Some things just straight up don't work. But on a system that's meant to be shared among a family, I can see the appeal a little bit more. If your kids are used to using iPads for school, or they have an iPhone, it could be helpful for them to have the same apps available on the computer at home for continuity and familiarity sake. The assortment of apps available is still disappointing though. A lot of the stuff I actually use every day. So, Instagram, Tik Tok, Snapchat, still isn't available on the Mac app store. What I could get was mostly games, many of which are designed for a touch interface, and aren't all that fun to play with a mouse or a track pad and they're not really optimized for a screen of this size. So, we've got our new design and we've got a new chip. Here's what else is different from the 21.5inch iMac. The 2021 iMac has a better camera, a better speaker system, a bigger and better screen, and more microphones. It also has touch ID in the keyboard which you can use to sign in and out of the device, approve purchases, and swap between user profiles. And Apple got rid of ports, like, most of them. The base model has just two Thunderbolt USB-4 ports as well as a headphone jack on the left edge of the screen. More expensive models have an additional two USB-3 ports and an ethernet port in the power brick which you can also put in the base model power brick for an extra 30 bucks. Basically, this iMac isn't a good choice if you hate dongles and docks. The upgrades to this IMac's display are more than just its size. The new iMac has a higher resolution 4.5K retina display, which also has Apples true tone technology that automatically adjusts colors and intensity based on the light around you. The screen looks great for article reading and video watching. It's a noticeable upgrade from the 4K retina display on the previous model. That said, it is a step down from the 27-inch iMac, which has a 5K display. So, that is a better choice for professional work. The off-angle viewing isn't very accurate which does not matter to me as someone who doesn't do much color work but it is certainly a problem for many people's workflows. You also can't get the 27-inch models fancy nano texture coating on this iMac. What is a big part of my work is video conferencing and this iMac is great for that. Not only is the 1080p webcam higher resolution than the 720p webcam in the previous iMac but it also has a larger and more efficient sensor for low-light performance, as well as the advanced image signal processor that comes with the M1. It really pays off. In low light, my face looks pretty processed but I am still visible. It certainly loads better than any MacBook webcam that Apple has ever made, including this one on the MacBook Pro. Another boon for video callers is that the audio is superb. So, this iMac has a six speaker sound system with two pairs of force canceling woofers and high performance tweeters. - There are a lot more caveats than I anticipated. So, let's go through them. - Apple says it's the best speaker system we've ever seen in a Mac and honestly, I believe it. The audio I heard was easily on par with a good external speaker, bass is great, and the percussion sounds like it's surrounding you. The key to understanding the 2021 iMac is understanding what it's not. So, it's not a replacement for the 27 inch iMac. That is, it's not a professional workstation. We haven't yet seen the M1 chip in one of these high powered machines. We're still waiting on an arm version of the 16-inch MacBook pro. If you're one of the people who's been waiting for a smaller refreshed iMac, whether for home or work use, your time has come. This is the iMac for you. It significantly outperformed it's Intel predecessor and you're also looking at a better screen and better specs across the board at the cost of some convenient ports. Now, if you're someone who has a bunch of monitors and mice lying around, you will get similar performance out of the significantly cheaper Mac mini but the iMac comes with everything in one and that's valuable to a lot of people. So, this ultimately wasn't a super difficult device to review because it's exactly what it's trying to be. It doesn't exceed expectations or change the category entirely. It just nails the essentials. Between the MacBook Air, the Mac mini, and now the new iMac, Apple's arm computers have really nailed a consumer market. The real question now is, when will we see Apple's silicon in a professional machine? So, my personal favorite iMac color is definitely the purple one but I've heard a lot of people on Tik ToK talking about the yellow iMac. So, which IMac color is your favorite and is there anywhere in your house that would actually look good?",
    "transcript_keywords": [
        "iMac",
        "MacBook Pro",
        "Apple",
        "Pro",
        "Premiere Pro",
        "MacBook",
        "MacBook Air",
        "apps",
        "screen",
        "iMac color",
        "inch MacBook Pro",
        "chip",
        "Mac",
        "performance",
        "MacBook Air earlier",
        "work",
        "inch iMac",
        "Mac Mini",
        "running Premiere Pro",
        "Air"
    ],
    "transcript_entity_values": [
        "1299",
        "that day",
        "Rosetta 2",
        "Premiere Pro",
        "three",
        "over 50%",
        "2",
        "around between over 25",
        "iMac",
        "5",
        "iPads",
        "CPU",
        "MacBook pro",
        "Thunderbolt",
        "jack",
        "27 inch",
        "1080p",
        "1899",
        "YouTube",
        "M1",
        "iMac",
        "eight gigabytes",
        "Geekbench",
        "Chromebook",
        "the M1 MacBook Pro",
        "MacBook Pro",
        "daily",
        "27-inch",
        "the MacBook Pro",
        "MacBook",
        "first",
        "the Mac Mini",
        "the next five to 10 years",
        "Instagram",
        "a ton",
        "earlier this year",
        "24-inch",
        "21.5-inch",
        "11.5 millimeters",
        "256 gigabytes",
        "MacBooks",
        "21.5inch",
        "this 30 minute",
        "8",
        "512",
        "Tik Tok",
        "16-inch",
        "Apples",
        "4",
        "IMac",
        "2019",
        "the MacBook Pro",
        "Netflixing",
        "Rosetta",
        "Intel",
        "IMac",
        "just under half",
        "2021",
        "one",
        "Cinebench R23",
        "Mac",
        "Apple",
        "four",
        "Cinebench",
        "Snapchat",
        "13 inch",
        "today",
        "six",
        "webcam",
        "two",
        "Tik ToK",
        "21.5 inch",
        "13-inch",
        "iPhone",
        "Mac",
        "the MacBook Air",
        "16",
        "seven"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "FAC",
        "FAC",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "NORP",
        "ORG",
        "LAW",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ],
    "vector": [
        -0.023965133354067802,
        -0.0879041850566864,
        0.06868722289800644,
        -0.06239883229136467,
        0.02995913289487362,
        -0.03597196936607361,
        -0.059537045657634735,
        0.03040408343076706,
        -0.006978465244174004,
        0.04712272435426712,
        0.0758180245757103,
        0.07605525106191635,
        0.03203922510147095,
        0.027538785710930824,
        0.049150705337524414,
        -0.02417469583451748,
        0.12875530123710632,
        -0.1275428980588913,
        0.02901444025337696,
        -0.0022674037609249353,
        -0.04126172140240669,
        -0.04309578612446785,
        -0.026110900565981865,
        0.01281934417784214,
        -0.007252542767673731,
        -0.010249591432511806,
        -0.006442167796194553,
        -0.03463253378868103,
        -0.05271678790450096,
        -0.05055003613233566,
        -0.03800937533378601,
        0.04893513768911362,
        0.08801190555095673,
        -0.04743748903274536,
        -0.0008003115653991699,
        -0.10837964713573456,
        0.13628050684928894,
        -0.03942399471998215,
        -0.09864266216754913,
        -0.08035445213317871,
        -0.050042785704135895,
        -0.030085761100053787,
        0.06581231951713562,
        0.05131018906831741,
        0.05810227990150452,
        -0.06394576281309128,
        0.029046375304460526,
        -0.09829706698656082,
        0.011175776831805706,
        0.04405728727579117,
        -0.016129350289702415,
        -0.11330414563417435,
        0.022399066016077995,
        -0.010119774378836155,
        -0.02432248555123806,
        0.0019604554399847984,
        -0.022286517545580864,
        0.029060322791337967,
        0.04935401305556297,
        0.0028296136297285557,
        0.054526686668395996,
        -0.1305774301290512,
        -0.009385955519974232,
        0.013403264805674553,
        0.018244246020913124,
        -0.033766090869903564,
        0.0033724126406013966,
        -0.029700348153710365,
        -0.05984622240066528,
        -0.03984145075082779,
        0.015171355567872524,
        -0.09850434213876724,
        0.05894068256020546,
        0.037881575524806976,
        0.008477573283016682,
        -0.003879886120557785,
        0.06616880744695663,
        -0.10461663454771042,
        -0.02853431925177574,
        -0.026285339146852493,
        0.032379213720560074,
        0.01270061545073986,
        -0.08226247131824493,
        -0.02955111674964428,
        -0.017253665253520012,
        -0.03009851463139057,
        0.00027663231594488025,
        -0.023381303995847702,
        -0.01306235883384943,
        -0.0183588694781065,
        -0.0006870438228361309,
        0.07937826961278915,
        -0.018221676349639893,
        0.010183940641582012,
        0.06821043789386749,
        -0.012756223790347576,
        -0.0770300030708313,
        -0.059333834797143936,
        -0.004569223616272211,
        0.044983040541410446,
        0.043452225625514984,
        0.011520645581185818,
        0.05090618133544922,
        -0.0376012809574604,
        -0.029215442016720772,
        -0.07461293041706085,
        0.02553214132785797,
        0.06106259673833847,
        0.01810518465936184,
        0.06067964807152748,
        0.0019838847219944,
        0.04134805500507355,
        -0.03300178796052933,
        0.039752837270498276,
        0.07859555631875992,
        -0.010209846310317516,
        0.028437389060854912,
        -0.017387056723237038,
        0.17807132005691528,
        0.04923556372523308,
        -0.03270738944411278,
        0.02725558541715145,
        -0.02043013460934162,
        -0.030106639489531517,
        -0.011220309883356094,
        0.02737407386302948,
        -0.09574441611766815,
        5.955448171873234e-33,
        -0.060242801904678345,
        0.09971041977405548,
        -0.06015007942914963,
        -0.036749258637428284,
        0.05668813735246658,
        -0.040621135383844376,
        0.06420433521270752,
        0.020128078758716583,
        -0.015538198873400688,
        0.01067278627306223,
        -0.056969352066516876,
        -0.0008021101821213961,
        -0.08393219858407974,
        0.038477469235658646,
        0.041675299406051636,
        -0.0797252506017685,
        0.012320514768362045,
        0.05852528661489487,
        -0.07160486280918121,
        -0.026435472071170807,
        0.006388652138411999,
        -0.003545338986441493,
        -0.019524002447724342,
        -0.08995988965034485,
        0.058442868292331696,
        0.007526248227804899,
        0.004567376337945461,
        0.012744572013616562,
        0.09602200984954834,
        0.017673535272479057,
        -0.08104892820119858,
        0.019857803359627724,
        0.011300220154225826,
        -0.06054876744747162,
        0.006548440083861351,
        0.004093910101801157,
        -0.09723132103681564,
        -0.04517880454659462,
        0.02736782655119896,
        -0.03642723336815834,
        -0.11524711549282074,
        0.07254397124052048,
        -0.09593360871076584,
        -0.0511775016784668,
        0.013179241679608822,
        0.07231006771326065,
        0.009671071544289589,
        -0.007420253939926624,
        0.008822918869554996,
        0.017397692427039146,
        -0.036768242716789246,
        0.00854006502777338,
        -0.023190218955278397,
        0.05979832261800766,
        -0.03497171774506569,
        -0.0066665951162576675,
        0.025433531031012535,
        -0.0066881608217954636,
        0.05973367393016815,
        0.0088423453271389,
        0.01906377077102661,
        0.04614913463592529,
        -0.033976517617702484,
        0.004685866646468639,
        -0.0943264588713646,
        0.06678931415081024,
        0.01951136253774166,
        0.02988797426223755,
        -0.03775886818766594,
        0.05479801073670387,
        -0.04431769996881485,
        -0.039471037685871124,
        -0.03146607428789139,
        -0.04761891812086105,
        0.010530265979468822,
        -0.04617922008037567,
        -0.1076713278889656,
        0.019640043377876282,
        -0.04413194581866264,
        0.015318064950406551,
        -0.007164303679019213,
        0.03872676566243172,
        0.04478081688284874,
        0.04724488407373428,
        0.03234131634235382,
        0.11766327172517776,
        0.07836883515119553,
        0.010629472322762012,
        0.03712115064263344,
        0.027941036969423294,
        -0.015109485946595669,
        0.006044742185622454,
        0.01096557267010212,
        0.053909074515104294,
        -0.05901715159416199,
        -5.688463650100737e-33,
        -0.04034971818327904,
        -0.028932666406035423,
        -0.015532630495727062,
        0.060387443751096725,
        -0.054401643574237823,
        -0.05364753305912018,
        0.04683098569512367,
        0.0496211014688015,
        -0.008004548959434032,
        -0.030669866129755974,
        0.03192984312772751,
        0.02848118543624878,
        0.02405279129743576,
        0.003752609947696328,
        -0.011766410432755947,
        -0.04218415170907974,
        0.028618432581424713,
        -0.1033102497458458,
        0.0709698423743248,
        -0.007767045870423317,
        0.09016937017440796,
        -0.02110941708087921,
        0.0063462769612669945,
        -0.011247913353145123,
        -0.003028800943866372,
        0.00291368062607944,
        0.054193127900362015,
        0.010945405811071396,
        0.004963705316185951,
        -0.0368453674018383,
        -0.029369622468948364,
        -0.00643323827534914,
        0.02745617739856243,
        -0.01409783773124218,
        0.1017180010676384,
        0.009662453085184097,
        -0.0035580245312303305,
        -0.015746936202049255,
        0.0069609275087714195,
        -0.03386037424206734,
        0.03403151035308838,
        0.028304874897003174,
        0.0312577448785305,
        -0.004766619298607111,
        -0.052053969353437424,
        0.0027332662139087915,
        -0.015641603618860245,
        -0.009343305602669716,
        0.003750069532543421,
        -0.04950135573744774,
        -0.04093810170888901,
        0.007356375455856323,
        0.060025960206985474,
        0.008939770050346851,
        -0.08286738395690918,
        -0.08696289360523224,
        -0.018741650506854057,
        0.09853319078683853,
        0.054084423929452896,
        0.059070393443107605,
        0.026406381279230118,
        0.001954015577211976,
        -0.08174823969602585,
        -0.1245507225394249,
        0.050036218017339706,
        0.019090434536337852,
        0.011300178244709969,
        -0.03306056559085846,
        -0.03206159174442291,
        0.05703648179769516,
        -0.024961872026324272,
        -0.039604879915714264,
        -0.002444691024720669,
        -0.0986299142241478,
        -0.06070312112569809,
        0.040967367589473724,
        0.0788804441690445,
        -0.03406892716884613,
        -0.021140236407518387,
        -0.003978954162448645,
        -0.006362526211887598,
        0.06291772425174713,
        0.018485141918063164,
        0.04319949448108673,
        0.05444572865962982,
        0.020579611882567406,
        -0.008216869086027145,
        -0.0017286479705944657,
        -0.03689028322696686,
        0.07833941280841827,
        -0.05526053532958031,
        -0.03323795646429062,
        -0.01668068766593933,
        0.007154142949730158,
        -0.07801768183708191,
        -5.919358514461237e-08,
        -0.030726704746484756,
        -0.04701201617717743,
        0.056577157229185104,
        0.06564175337553024,
        -0.022094542160630226,
        -0.021827148273587227,
        0.0059270611964166164,
        -0.0008605302427895367,
        0.10423000156879425,
        0.045718830078840256,
        0.07126510143280029,
        -0.11553853750228882,
        -0.08281423896551132,
        0.05415746569633484,
        -0.01121740322560072,
        0.05442364513874054,
        -0.057871248573064804,
        0.045468512922525406,
        0.004143615253269672,
        -0.03868567943572998,
        -0.0167898777872324,
        0.04517979547381401,
        0.035009145736694336,
        -0.006533212959766388,
        0.0002857506915461272,
        0.03603746369481087,
        -0.03283669054508209,
        0.056266527622938156,
        0.027614044025540352,
        0.005806152708828449,
        -0.08358412235975266,
        -0.0001693813974270597,
        0.022754106670618057,
        -0.015136674977838993,
        -0.02633023075759411,
        -0.046238478273153305,
        -0.051977381110191345,
        0.08935307711362839,
        0.04651906341314316,
        -0.008768687024712563,
        0.0142140444368124,
        -0.13212744891643524,
        -0.01646227389574051,
        -0.016370398923754692,
        0.005281489808112383,
        -0.04700864106416702,
        -0.07546357065439224,
        -0.07445693016052246,
        -0.043864477425813675,
        0.08256267011165619,
        0.04987836629152298,
        -0.021967174485325813,
        0.09121982008218765,
        0.042649369686841965,
        0.08873719722032547,
        -0.027361808344721794,
        0.09927031397819519,
        -0.055301517248153687,
        -0.006423073820769787,
        0.1020597442984581,
        0.091847263276577,
        -0.0711946040391922,
        0.003015195718035102,
        0.07809638977050781
    ]
}