{
    "id": "UGYfi06PGJU",
    "title": "Buying the TINIEST Phones on Wish",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-05-01T16:29:18Z",
    "video_url": "https://www.youtube.com/watch?v=UGYfi06PGJU",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "wish.com",
        "wish",
        "mystery tech",
        "wish app",
        "wish unboxing",
        "testing wish products",
        "wish shopping",
        "wish review",
        "wish haul",
        "tech",
        "technology",
        "worlds smallest phone",
        "tiny",
        "small",
        "smartphone",
        "testing items from wish",
        "shop wish",
        "wish electronics",
        "review",
        "nokia",
        "razr",
        "motorola",
        "android",
        "wish tech products",
        "smartphones",
        "gadgets",
        "tiny gadgets",
        "mini",
        "flip phone 2020",
        "flip phone",
        "cell phone",
        "cell",
        "weirdest phone",
        "electronics",
        "z flip",
        "galaxy z flip",
        "samsung",
        "apple",
        "iphone"
    ],
    "views": 253972,
    "likes": 7423,
    "comments_count": 327,
    "description": "Tiny phone, big mood... Trying the $166 iPhone 11 Pro from Wish:  Trying $7 AirPods from WISH  1980's tech was WEIRD  This Tech Is Older than You Think:  110 year old DVD!?   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/P5aEi6WGxOs",
        "https://youtu.be/5ZhmuLeGVoU",
        "https://youtu.be/no7DhJNaE2A",
        "https://youtu.be/TBAp3YFcWBY",
        "https://youtu.be/fElUqZHWpUw",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello! And welcome to This Is! Are you a tiny person like Tiny Austin? Then I've got the phone for you. - Why am I Tiny Austin? - (Matt) We went through Wish.com And found the teeniest, Tiniest, Littlest phones that you can buy. - But Matt? - Do you remember Zoolander? - (Austin) Matt? - I love Zoolander. - Matt? - He had the little phone - Matt? Matt? Why? Why do you need a tiny phone? - Because why not! - Oh, okay. - First off! Everyone's favorite... Was it the..what nokia..the.. - 33 10. - No, this is the (Austin) L-l-l-late star, Uh, it is made in China, It is mini, super, small. But it does have HD voice, Surround where comfortable, Easy operation, And it's ergonomic. - (Matt) Uh, So one of my favorite things about this, The color, It comes in a lot of colors, But it is equipped with a point 66 Uh, ink Old screen. - (Austin laughs) - So this was only 20 dollars on..on..uh, Wish. - This is like a really weird burner phone. Oh, it's so tiny! - (Matt) This is so tiny. - Gimmie that, gimmie that, gimme that Yes! Yes! No! Ah, uh... ..meet at the place, leave the money, and uhhh, don't forget your tiny burner phone that you can swallow if you need to. - (Matt) Wow! - (Austin) It has a baby battery. - (Matt) So that is 300, 80 milliamp hours. - So while we wait for Ken to call, I will say the build is actually not bad on this. I mean, yes, the buttons are absolutely tiny, but considering how small the phone is, it's reasonably okay, I guess. (phone chiming) - I like that ring tone. - Hello? You actually don't sound bad. Wait, hang on. I'm gonna let you talk to the microphone. - Hi, this is ken. How's it going? - (Austin) I will say one thing as I'm talking to you right now, Ken. Ummm, I hear...well actually I did, it's gone away. I heard like a buzzing when you first called, but now it actually, it seemed to clear up. Now, you just sound normal. - I hate to say this, uh, this sounds better than when I'm talking to my parents on their Iphones. - (Austin laughing) - So... - It's got HD voice. - At this point, I don't understand why not just make this as a blue...as a headset. So, instead of having a speaker... - (Austin) Mhmm... - Why not just add a, uh, earloop and have the whole phone like this? - Ohhhh! - Where..so you could dial it and then.. - Put it on. - ..and then you just put it on. You know, if we compare these, like.. - (Austin) That's crazy, man! Look at that! - (Matt) Yeah.. - (Austin) This is a full phone! I'm legitimately impressed for 20 bucks, what you're able to get. It's the worlds tiniest phone or one of the worlds tiniest phones. - (Matt) I don't know..I don't know if that's the worlds tiniest, but it's.. - (Austin) I..but, that's fine... - (Matt) ..It's.. - I am not disappointed with this in any way. It is exactly what it says on the box. Nothing more, nothing less. - (Matt) Smartphone usage aside, - (Austin) Mhmm.. - (Matt) If I just said, \"I need to have a phone,\" I would actually feel comfortable using this as a daily driver. - Yeah. - Which is, absurd to me. - (Austin) All right, so this one is, in fact, a tiny, little flip phone. - (Matt laughing) - (Austin) And uh, the picture.. - (Matt continues laughing) - (Austin) the picture that I saw on Wish was actually that it was more of, uh, like a uh, razor. Like the old school razor. - (Matt) For context, this is what a galaxy Z flip looks like. I mean.. - (Austin) And here is what it looks like closed. (flip phone closing) - But, I have no idea how to open this. - (straining) (package opens) Got it. - Yeah, not so easy is it? - (Austin) Oh no! I'm bleeding! - What did you do? - The Nokia drew blood. I was trying to open it up and it, literally, cut my fingers! - If anyone was questioning how tough Nokia phones actually are... - That's not even a real Nokia, it's a fake one! - Even..even the tiny one. - We'll be right back after some medical attention. (beep) Ohhh, it's right there! It's on the back. - Yeah, so right here, look right there, look right there, you slide the sim card in that way. - So, you're trying to tell me that you're walking around with your tiny pink phone and if you're not paying attention you accidentally can eject your sim card and lose it forever? - (censored language) - Yeah! - So, we actually don't have a sim for this one. So... - Well, hang on. We can at least turn it on though and see. - Yeah, we can. - (Austin) This one is dumb though. - (Matt) Uh, so..when I was playing with this one while you were bleeding - (Austin) Mhmm... - Immediately, I hated it. I don't have particularly big hands, but I mean I got fat hands..but like I can barely do this without hitting both buttons. So, this guy here, for 30 dollars...this ain't it chief. - (Austin) I definitely like the late star that drew blood from me, but I still like it more. - So while we were waiting for these phones to come in, we actually got one from the..our PO box, so this is Zanco Tiny T2. - (Austin) Tiny T2 is a great name. - (Matt) It's the worlds smallest 3G phone. - Wait, is it thought? - Which, yeah..could.. (high pitched voice) it's close. But, I think this one is smaller. - You know what I will say about this one immediately, it's a little bit thicker but it actually makes more sense. So, we have a headphone jack and micro-USB, you have a little flap here, which if you pull it out...god, everything is so small here...we have sim as well as micro-SD. This actually seems like it could be a little more of a usable.. ..like this one is solid, but it's like gimmicky. Right? This actually feels like those buttons are sooo much better. - (Matt) Yeah. And I..so I actually played around with this one a little bit while we were waiting for these guys to come in. A little bit bigger on the Zanco, much better screen. This is not an old screen, like this one. - (Austin) Oh no! - (Matt) Battery low! - (Austin) Matt, you didn't charge it! - (Matt) I didn't charge it. - Well, can we..can we make a quick call before it dies? - Yeah. Hello, this is Matt. - (laughing) - This sounds as good as an Iphone, I think. - (Austin) All right, it boots up incredibly quickly. Menu...oh, dude! This interface is so much better. - It's significantly better. - (Austin) Dude, this thing is really legit though! Oh wait, we're not on 3G. We're on 3.5G. It legitimately says 3.5G, here. Well, I thought the Nokia was pretty cool. This is much better! How much was this one? - This one is..it's uh, kickstarter so it's 60 dollars. But, I do think that.. - It's a little expensive. - ...it's a little expensive for what it is. I don't think I can actually format the card in here. - Um, well can you just describe for us what the camera looks like? - (Matt) It's bad. It is bad. You know...It'd be...it'd be.. - (Austin) Are we talking like Nintendo DS level bad? - (whooshing) It's close. - (Austin) I mean, I'm not gonna lie looking at this on the camera, it looks hilarious. Like one of your fingers is the same size as the entire phone. - (Matt) Yeah, like my thumb is just... - (Austin laughing) It's just...you should cover the whole thing! - (Matt) Yeah. - For 60 bucks... - Uh yeah. - ...this thing is legitimately good. I don't know if it's worth triple the price of that Nokia. But it is a better phone and, oh...oh it's not dead yet. You're getting the best hardware. You're getting a slightly larger touchpad or touchpad...what do you call it? - Keypad. - Keypad. - T9. It can do..it can do text messaging. I wouldn't recommend it, it sucks. - (Austin) But the screen is readable, headphone jack. I mean, honestly, yeah. I'm...I'm down. - (Matt) I'm down with it, um... - If this is what you want. - Yeah, if this is what...if this is.. ..you're looking for this. But what about those who need a smartphone? - I mean, I need a smartphone. - Our last one here, has a tall order. - (Austin) The Melrose MP3... - (Together) Terminator? - (Matt) All right, first of all this is.. ..this actually feels like nice in the hand. I'm not gonna lie. Oh! Oh! Wait! Wait! Wait! (high pitched voice) It even comes with a tiny, little... - (Austin laughing) A screen protector? - A tiny, little screen protector! - (Austin) Android is starting! - (Matt) Android is starting. - (Austin) This is gonna be fun! - (Matt) I'm gonna put the case on. - (Austin) I mean, yeah, of course, We have to keep it safe. What happens if we accidentally drop our phone? - (Matt) This is just tiny, little Android! Wait, so this is the ipho..uh, what is it.. ..the Iphone.. - The Iphone 4! - (Matt) The Iphone for, uh, like the water droplet. - (Austin laughing) - (Matt) Um... - This is not a retina display, my friends. So, how much was this? - So this one was...70 dollars! Technically, it was 60 dollars but then there's 12 dollars worth of shipping. - (Austin) Well, that's about the same price as the Zanco and it's an actual Android phone, which I'm not entirely sure in this scenario is a good or bad thing. - (Matt) I'm not gonna lie, I actually... ...the screen is really nice, for what this.. - (Austin) Define, okay.. - (Matt) For what, like, the size of this..um, it is..it is really nice. So we don't have.. Like, the we have the default browser, whatever, is tiny. It's like, I really don't know how you're supposed to... - (Austin laughing) - (Matt) The keyboard... - (Austin continues laughing) - (Matt) ...is sooo tiny! - See, like the thing is with a tiny phone, the advantage to me is something that you could easily leave, either as an emergency phone or like as a tiny, little device just to call people, so you can kinda detox from your standard smartphones. But having a tiny smartphone seems to defeat the purpose of that. What's the point of tiny smartphone? - I enjoy...I enjoy holding this. - Can you tell me little bit more about how you like the feeling in the hand and you enjoy holding it? - It's got...it's got a heft to it. It's got a heft to it that I really just like to...I could really wrap my, my hand around. (beep) Here we are, rod this is. - All right, let's play a video. - (Matt) Wait, oh! It does! - (Austin) So this is just scaled down. When 144P is the actual best quality you can get. (laughing) Oh wait, that has a headphone jack! - It does have a headphone jack. - That's why it's the MP3 Eliminator...or destroyer. - Terminator. - Terminator, of course! Okay, let's see. Where are the specks? This is obviously a very old version of Android. - (Matt) Yes. - (Austin) Android 6.0, um, Android security patch 2016. So, we might be a few years out of date. - Definitely don't want to be signing into app store...or the play store right now. - But, look at this! It's got a Wifi update or it's got an Android update. Oooo, got it! (camera shutter) We got it boys. - (Matt) How does that look? - (Austin) Now if you can see that on camera right now, ahhhh! It's a thing. I mean, I had like 17 pixels of looking right now. It's fine, I guess. - Let's try the front, do we have a front camera? - There's not a front camera, we have video though. Thank you very much for watching this episode of This is! If you enjoyed this wonderful content, make sure to subscribe to the channel. You can also feel free to let us know in the comments what dumb thing we should buy on Wish next! - We got more, I still got Austin's credit card. So, let us know. I don't know why he's still trying to film with this tiny phone. But, I'm gonna try this out for a little bit. - (Austin) I guess you're gonna switch to this phone? - I wanna try it...I'm not gonna say I'm switching to it...but, I'm gonna try it. If it can play Raid Shadow Legends, not a sponsor, I will totally switch to that phone. - I think Raid Shadow Legends actually is a sponsor. - Not for this video though.",
    "transcript_keywords": [
        "tiny",
        "phone",
        "Yeah",
        "tiny phone",
        "Tiny Austin",
        "Matt",
        "Android",
        "wait",
        "thing",
        "Nokia",
        "phones",
        "Austin",
        "phone Matt",
        "tiny smartphone",
        "bad",
        "screen",
        "tiny burner phone",
        "Smartphone",
        "Nokia phones",
        "bit"
    ],
    "transcript_entity_values": [
        "Tiny Austin",
        "micro-USB",
        "Android",
        "one",
        "only 20 dollars",
        "PO",
        "ken",
        "60 dollars",
        "Nokia",
        "Wish",
        "3.5",
        "Zanco Tiny T2",
        "nokia",
        "Austin) L-l-l-late",
        "Iphones",
        "a few years",
        "Matt",
        "Austin",
        "Raid Shadow Legends",
        "17",
        "Zanco",
        "daily",
        "60 bucks",
        "3",
        "12 dollars",
        "6.0",
        "2016",
        "Austin",
        "80 milliamp hours",
        "Austin) Android",
        "jack",
        "Iphone",
        "micro-SD",
        "Nintendo",
        "300",
        "China",
        "Wish.com",
        "30 dollars",
        "first",
        "Ken",
        "20 bucks",
        "70 dollars",
        "Raid Shadow Legends",
        "144P"
    ],
    "transcript_entity_types": [
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERSON",
        "CARDINAL"
    ],
    "vector": [
        -0.031075822189450264,
        0.03498075157403946,
        0.1028507649898529,
        -0.03678976371884346,
        0.00465106638148427,
        -0.02554510347545147,
        0.07086298614740372,
        0.05519086867570877,
        0.016743436455726624,
        0.027360277250409126,
        0.0740252286195755,
        0.008521554991602898,
        0.07413722574710846,
        -0.0033696468453854322,
        0.021493026986718178,
        -0.04428244009613991,
        0.11301853507757187,
        -0.07955630868673325,
        -0.026352040469646454,
        0.04843413084745407,
        -0.0006201507640071213,
        0.02958749607205391,
        0.007325888145714998,
        0.04767395928502083,
        0.0701635479927063,
        0.04725288599729538,
        -0.062385670840740204,
        -0.013523116707801819,
        -0.03670024871826172,
        -0.017105072736740112,
        -0.013353902846574783,
        0.21280241012573242,
        0.10393519699573517,
        -0.01039667148143053,
        0.004529868718236685,
        -0.060106582939624786,
        -0.014627567492425442,
        -0.014605767093598843,
        -0.042136549949645996,
        0.010569355450570583,
        -0.00989280641078949,
        -0.02217031456530094,
        0.031047115102410316,
        0.024507049471139908,
        -0.08104811608791351,
        -0.1177835464477539,
        0.030843082815408707,
        -0.09065417945384979,
        -0.02261212468147278,
        -0.026026329025626183,
        -0.00898081436753273,
        0.013661881908774376,
        0.01677960902452469,
        -0.001136124599725008,
        -0.06024288758635521,
        0.013702579773962498,
        -0.04220358282327652,
        0.015380109660327435,
        0.052706632763147354,
        0.09512007236480713,
        -0.031237522140145302,
        -0.0015575336292386055,
        0.010784710757434368,
        0.016888096928596497,
        -0.03162601217627525,
        -0.017457174137234688,
        -0.08512212336063385,
        -0.07832302898168564,
        -0.017469771206378937,
        -0.04167361557483673,
        0.01541382446885109,
        0.03157190978527069,
        0.028397783637046814,
        0.08745698630809784,
        0.004461252596229315,
        0.024014141410589218,
        0.1146005317568779,
        -0.07073584198951721,
        -0.07004588097333908,
        0.04137884080410004,
        0.02384456992149353,
        -0.015791740268468857,
        -0.08123072981834412,
        -0.0464802160859108,
        -0.00562299694865942,
        -0.03354800119996071,
        0.06441843509674072,
        0.061769165098667145,
        -0.11504054814577103,
        -0.09604023396968842,
        -0.06008806824684143,
        0.1141757145524025,
        -0.10389060527086258,
        0.021871574223041534,
        0.024618057534098625,
        -0.06983334571123123,
        0.016886431723833084,
        -0.04011223092675209,
        -0.043986864387989044,
        0.026803268119692802,
        0.09906402230262756,
        -0.014747513458132744,
        0.06358357518911362,
        0.07626960426568985,
        0.03404824435710907,
        -0.08586796373128891,
        -0.03075343556702137,
        0.001313959714025259,
        0.013684393838047981,
        0.009409066289663315,
        -0.051729947328567505,
        -0.07185766100883484,
        -0.03262185677886009,
        -0.00501889456063509,
        -0.07182753831148148,
        -0.06417924910783768,
        -0.012267343699932098,
        0.009154838509857655,
        0.03543815016746521,
        -0.04158392921090126,
        -0.004526645410805941,
        0.041626036167144775,
        -0.010752098634839058,
        -0.07066181302070618,
        0.02099575847387314,
        0.03628695383667946,
        -0.05735904350876808,
        -2.187311215197149e-33,
        0.028864528983831406,
        0.10292302817106247,
        -0.042235035449266434,
        0.05363288149237633,
        0.006783601362258196,
        -0.002776971086859703,
        -0.03758299723267555,
        0.031239649280905724,
        -0.08786594122648239,
        -0.033982183784246445,
        -0.0547495074570179,
        -0.006794068031013012,
        -0.06465445458889008,
        -0.03706037625670433,
        0.09355302155017853,
        0.014031586237251759,
        -0.1330982893705368,
        -0.050818901509046555,
        -0.0012106813956052065,
        -0.014807102270424366,
        -0.03536512702703476,
        0.058379169553518295,
        0.005499538965523243,
        0.004964071325957775,
        0.043859273195266724,
        -0.020475460216403008,
        0.13243930041790009,
        -0.06497472524642944,
        0.03582717850804329,
        0.006144592072814703,
        -0.08563119918107986,
        -0.019039710983633995,
        0.06861639767885208,
        -0.02133132331073284,
        -0.005406066309660673,
        0.028205247595906258,
        0.025546876713633537,
        -0.08882981538772583,
        -0.0321604385972023,
        -0.07083811610937119,
        -0.0013260230189189315,
        0.07647089660167694,
        -0.08222979307174683,
        0.02893012948334217,
        -0.011903115548193455,
        0.05677012354135513,
        0.03482014313340187,
        0.042696744203567505,
        0.016567226499319077,
        -0.011175896972417831,
        0.023301180452108383,
        -0.03471171855926514,
        -0.03542545437812805,
        -0.017414899542927742,
        -0.029032764956355095,
        -0.019333193078637123,
        0.022100143134593964,
        0.012243817560374737,
        0.019717207178473473,
        -0.022569291293621063,
        0.057256124913692474,
        -0.019198313355445862,
        0.004539084155112505,
        0.03808187320828438,
        0.029313160106539726,
        0.10018361359834671,
        0.04144768416881561,
        -0.009359853342175484,
        0.014015624299645424,
        0.05682918429374695,
        -0.005046509671956301,
        0.012171872891485691,
        0.06681671738624573,
        -0.04031099006533623,
        0.07644036412239075,
        0.05603121221065521,
        -0.018175018951296806,
        -0.03372817486524582,
        -0.011949285864830017,
        -0.031635209918022156,
        0.039529088884592056,
        0.027397222816944122,
        -0.03222328796982765,
        0.04524915665388107,
        0.006043039727956057,
        -0.09411890804767609,
        0.00971075426787138,
        -0.04537370800971985,
        0.005829148925840855,
        0.0598265565931797,
        -0.025484498590230942,
        -0.07285706698894501,
        0.001122104818932712,
        -0.01617199182510376,
        -0.05480959638953209,
        -4.493036955850335e-34,
        -0.038786739110946655,
        -0.06420572847127914,
        0.029872333630919456,
        0.026399778202176094,
        0.032223716378211975,
        -0.08322765678167343,
        0.05698394775390625,
        0.07826565951108932,
        -0.011625386774539948,
        -0.011010445654392242,
        0.027861010283231735,
        -0.03490033000707626,
        0.034909047186374664,
        -0.08063041418790817,
        0.018033113330602646,
        0.00711426418274641,
        0.008137074299156666,
        -0.03246690332889557,
        0.0015313558978959918,
        0.026347095146775246,
        0.033312685787677765,
        0.03449097275733948,
        -0.06150186434388161,
        0.06298137456178665,
        -0.07271313667297363,
        -0.017407860606908798,
        -0.044801827520132065,
        -0.014173021540045738,
        -0.03369401767849922,
        -0.04852816462516785,
        -0.05862598866224289,
        -0.06426561623811722,
        -0.00034716559457592666,
        0.07305390387773514,
        0.017078809440135956,
        0.01906491629779339,
        -0.045646924525499344,
        -0.035321928560733795,
        -0.0004676039097830653,
        -0.04309578984975815,
        -0.023940211161971092,
        -0.05605560913681984,
        0.01714296266436577,
        -0.01959466002881527,
        0.01945456862449646,
        -0.10866854339838028,
        -0.01657918468117714,
        0.0015482236631214619,
        -0.015635715797543526,
        0.019807685166597366,
        0.061487432569265366,
        -0.02281489036977291,
        -0.0004567955038510263,
        0.022052239626646042,
        -0.12157952785491943,
        -0.007613769732415676,
        0.04483046755194664,
        0.0038776134606450796,
        0.0753081664443016,
        0.03240542486310005,
        0.06602057069540024,
        -0.06875652819871902,
        0.0017830987926572561,
        -0.06017105281352997,
        -0.09757330268621445,
        0.010794373229146004,
        0.03872577100992203,
        -0.04402817785739899,
        -0.009199216961860657,
        0.00688182283192873,
        0.014637279324233532,
        -0.00997973047196865,
        -0.018113618716597557,
        -0.026000620797276497,
        0.042088449001312256,
        0.037151630967855453,
        -0.11575016379356384,
        0.013771545141935349,
        0.006428329739719629,
        -0.020664390176534653,
        0.019571902230381966,
        0.08804740756750107,
        0.033066123723983765,
        0.04216042533516884,
        0.10883772373199463,
        0.06963048875331879,
        -0.02603890746831894,
        0.06584750860929489,
        -0.021064352244138718,
        0.08028250932693481,
        -0.04324862360954285,
        0.0626697763800621,
        -0.03904557228088379,
        0.023610277101397514,
        -0.033989403396844864,
        -5.4543761507375166e-08,
        0.027540577575564384,
        -0.0037025443743914366,
        -0.00996207445859909,
        0.007805491331964731,
        -0.02708328329026699,
        -0.02316819131374359,
        -0.006924104411154985,
        0.048942141234874725,
        0.16032783687114716,
        0.07084832340478897,
        0.030172796919941902,
        -0.06134286895394325,
        -0.11526159942150116,
        0.07273615896701813,
        0.014960741624236107,
        0.05479700118303299,
        -0.017646020278334618,
        0.0306659284979105,
        0.005751742050051689,
        0.029358532279729843,
        -0.060660164803266525,
        0.06729192286729813,
        0.05385705828666687,
        0.014180845580995083,
        -0.01713450811803341,
        -0.06635808944702148,
        -0.06092626973986626,
        0.03745076060295105,
        -0.0005685660871677101,
        -0.04468068853020668,
        -0.008609229698777199,
        0.014358783140778542,
        -0.1093849390745163,
        -0.005033368244767189,
        -0.08634968101978302,
        -0.04862163960933685,
        -0.015120567753911018,
        0.017763758078217506,
        0.05638822540640831,
        0.026994088664650917,
        0.07851096242666245,
        -0.10421204566955566,
        -0.0902300775051117,
        0.004692498128861189,
        0.014311239123344421,
        -0.04778647422790527,
        -0.032403696328401566,
        -0.13623233139514923,
        -9.421541471965611e-05,
        0.05840715393424034,
        0.0014372614677995443,
        -0.02613571286201477,
        -0.024800283834338188,
        -0.050669167190790176,
        0.03728992119431496,
        -0.01388958003371954,
        0.03314240649342537,
        0.03615489602088928,
        0.003056590911000967,
        0.017581462860107422,
        0.04046839848160744,
        0.016163507476449013,
        0.017894381657242775,
        0.08129657804965973
    ]
}