{
    "id": "uhbDfi7Ee7k",
    "title": "Awnings: a simple cooling tech we apparently forgot about",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2024-07-15T14:55:02Z",
    "video_url": "https://www.youtube.com/watch?v=uhbDfi7Ee7k",
    "category": "Science & Technology",
    "tags": [],
    "views": 1511990,
    "likes": 78356,
    "comments_count": 8150,
    "description": "Seriously - where'd they go? Links 'n' stuff:  Technology Connections on Mastodon:   Technology Connections on Bluesky:   Have you ever noticed that I've never done a brand deal? That's all thanks to people like you! Viewer support through Patreon keeps this channel independent and possible. If you'd like to join the amazing folks who fund my work, check out the link below. And thank you!",
    "description_links": [
        "https://mas.to/@TechConnectify",
        "https://bsky.app/profile/techconnectify.bsky.social",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "You ever reach way back into your brain anduncover something from the not-too-distant past that seems weirdly obvious yet isnt popularanymore? Thats right, Im talking about window awnings! You used to see these everywhere,especially on those cute brick ranches kitty corner to the house where you grew up - Imsure thats a universal experience. But lately, theyve fallen out of fashion. And I would liketo make the case that we should get them back. Quick programming note, Im not gonna be recommending any specific kind of awning or product line or anything like that. I am not hereto sell you anything ...YouTube ads notwithstanding... though I do like spreading ideas. And awningsare one of those ideas that our ancestors figured out but as far as I can tell we justdecided were too cool for these days. Which is ironic because window awnings keep you cool. Thats their point! Or at least, a central point. See, we like windows. [WIndows XP error sound] Maybe not that kind, butthat kind is pretty universally liked. They let in natural light and allow us to look outside andsee things. But windows are also great big holes in walls which we only plugged with thin sheetsof glass. While they have gotten surprisingly good over the years at keeping heat energy frommoving through them, theyre still nowhere near as good as the thick walls which surround them. And, heres the important bit to this video, they become a major source of heat gain whenthe sun shines through them. Ever heard of the greenhouse effect? That doesnt just happenin greenhouses, it happens any time the suns energy makes it through a transparent windowand into an enclosed space. Like your house. Once sunlight makes its way into your home, it lands on the stuff inside like flooring, furniture, et cetera. That stuff absorbs the sunslight energy which is then re-radiated into your home as heat energy. This heat gain from solarirradiance, in the context of buildings, is called insolation. Not insulation - but insolation. Dontlook at me, I just work here. Thanks to recent innovations in coatings on the glass, a lot ofthis energy is reflected away and kept out of your home. But, fun fact, the sun is extremely powerfulso even with really fancy windows theres a lot of energy getting inside that ultimately becomesheat. Dont take my word for it, just ask a cat. In the winter months this warmth can be a prettynice benefit, but in the summer months - it sucks. And our ancestors knew this. They figuredout that if you designed a structure so that the windows couldnt be in direct sunlight, then there would be no greenhouse effect and the interior of that structure would staymuch cooler. Those grand covered porches you see on fancy old houses throughout much of theSouthern US werent just for enjoying the breeze, they kept the windows entirely shaded. In fact they kept pretty much the entire structure shaded. And it wasnt just plantationhouses - the galleries attached to historic French Quarter buildings also help keep thebuildings cool. Notice how the building is in direct sunlight here but almost the entire structure (other than the roof) is in shade. Of course, those examples have multiplepurposes. I cant earnestly say that shading windows was the point of a covered porch. It also created a pleasant outdoor space and protected windows and doors from the elements,allowing you to leave them open in a rainstorm. But we did recognize the value of that coverage. So much so that in the not-too-distant past, there were popular products for your home whichprovided the shade and cover of an opulent wraparound porch but with minimal materialsand easy installation. What products, you ask? Awnings! It appears these reallycame into vogue in the 1920s. This 1927 article in Building Age andNational Builder comes out swinging: A Beautiful home which is devoid ofawnings resembles a well dressed man without a necktie. The awnings give thatfinishing touch, just the last point to complete the proper taste. Seems like the author really likes awnings! But why? Its all about keeping comfortable! An awning on the porch permits the use of the porch when the hot afternoon sun is shining. They will keep the porch shady and pleasant, and this also reduces the temperature of therooms adjoining the porch. And heres my favorite part: The fact that the awning excludes the sunfrom the window glass is quite an important asset in reducing the temperature of the room, and inpreventing the fading of wall paper and carpet. Sure seems like awnings are the cats meow! In 1925, Hal and Helen Davis wrote in Better Homes and Gardens Awnings - they have suchpossibilities, such delightful possibilities, that foolish indeed is a house to go withoutthem, if they can be afforded. Thats right, we just got called fools by the Davis family! Honestly this article is a useful tool for understanding how they were spreading. It even breaks down the differences in awning configurations by locale and the pros and consof various types. This used to be a big deal! And they were a selling point for your home - real estate firms are beginning to learn the value! Plus theyre just a fun accent piece. I mean, who wouldnt want to flaunt their unusually picturesque nature with a cool setof Arabian Awnings? The spears really sell it. But hundred year old magazine articles are one thing andthe real world is another. How big were awnings really? Well, if you dingle around on the olStreetview and visit practically any old Chicago neighborhood, youll find plenty of houses whichstill have exterior window awnings providing that overhang for shade, especially on South andWest-facing windows. You can see in this image how effective they are: this side of the houseis being hit with direct sunlight, but the awning is almost entirely shading the window below it. Thanks to thatawning, the old front room is staying much cooler than it would without it. Many of these productsalso allowed you to leave windows open in the rain - at least if they were installed correctly and you hadthe right kind of window. They offered a lot of benefits! Yet despite remaining extant in various styles, the functional purpose of window awnings seems to have almost entirely left the publicconsciousness. Whyd this happen? Im gonna say its a mix of two factors: air conditioning andfashion. The advent of mechanical air conditioning diminished the importance of the passive trickswe used to rely on to keep cool. As more and more people started hooking up energy-consuming airconditioners to the power grid (boy I hope it can keep up with all that sorry wrong topic). As moreand more people got air conditioning, suddenly the temperature in their home was controllable. Andso long as those air conditioners were powerful enough to overcome the heat gain of solarirradiance, the awnings that previously helped keep us cool in a heatwave didnt seemnecessary any longer. And, technically, they werent. So, fast forward a decade or two, and newhomes are getting built without them. No need for awnings when we can pump the heat right out! That meant that all the older homes with awnings started to look dated. And if theres one sin inthe fashion world, its looking dated. As you can tell I take this very seriously. Beyond fashion,though, awnings on a home may very well have been a sign that the home didnt have air conditioning, and Ill bet many a realtor in the 1960s suggested taking them down. \"No one wants a housewith awnings,\" theyd say, \"those are for old fuddy duddies. And poor people.\" And now, other than thatone infomercial, awnings are largely forgotten. But dang it, I think its time for us to consider bringing them back. For one, I actually think window awnings are prettycute. Maybe not the aluminum ones that you still run across sometimes, though hey - theysure proved their longevity. But there are so many different styles of awning out there, plus many moreto be discovered. And like those 1920s people, I think window awnings offer a real way toput a personal touch on a home. And whats cooler than a way to express yourself that alsoliterally keeps you cool? Theres a lot to like about them! Heat waves would be a lot moremanageable with window awnings keeping the suns heat outside your home, and day today they save money on electricity bills. How much money? Well, unfortunately, thats not the easiest thingto answer. It's annoyingly hard to get an idea of how much heat energy is actually coming througha window when the sun shines through it. It depends on so many factors: your location on theplanet, the direction the window faces, the time of the year, time of day, and of course the performanceof the window itself all matter a lot. Still, I wanted to give you some useful information so Ireached out to someone who has access to modeling software which can predict the energy needs ofa home. They took a typical house in Chicago and ran some numbers for heating and cooling demandwhile tweaking a few variables. Theres a lot of interesting stuff to cover here but what I want tohighlight first is this: Doing nothing to the house but adding window overhangs reduced the annualcooling energy needed by 20%. Thats a big deal! But youll notice that other things had animpact, too. And if you notice even harder, youll see that those impacts were alldouble-edged. In the past, Ive mentioned Low-E windows. Thats kind of a catch-all termand doesnt mean a whole awful lot on its own, but broadly it just means high-performancewindows. And one of a windows performance metrics is the solar heat gain coefficient. You can think of this as the percentage of the suns heat energy that makes it through theglass. There are windows on the market now with exceptionally low SHGCs: some windows donteven let a quarter of the suns energy through, and those are great to have in warm climates where you rarely ever need to heat buildings. But theyre often not a great fit for us up Northbecause over the course of a year we need more heat energy than we need cooling, and blocking thesuns free heat doesnt make much sense. Notice that in our modeling, swapping out just theSouth facing windows to a lower SHGC dropped cooling demand a pretty similar amount toadding overhangs. But look what it did to the heating demand. It went up significantlybecause those windows are actually working against us in the winter. Our winters suck and some freeheat from the sun is a very welcome thing. So theres a tradeoff to changing the windowsthermal performance characteristics. And have you noticed what the lowest total annual power figure came from? Windows with high solar heat gain coefficients for free heating in the winter but which hadoverhangs to block sunlight in the summer. Thats the beauty of awnings. We dont haveto make the choice between winter and summer performance when buying a window. We could use a window best-suitedfor winter heat gains and then in the summer just block the sun from hitting it with an awning. The reason why Im making this video now is that, well, it occurred to me that there isnt reallya difference between a properly-installed window awning and some of the rather advanced home designtechniques we see today. Those with lots of money to spend when designing their new custom homes might getfancy and install different window types. One method Ive talked about before is installinghigh heat-gain windows below an overhang so they provide that free heat in the winter but not in the summer. And then use low-heat-gain windows elsewhere in the house. Thats a cool idea but its a lot of work compared toslapping on an awning! And the best thing about slapping on an awning (besides how fun that is tosay) is that it can be done cheaply and anywhere! Speaking of anywhere, heres a clunky voiceoveredit. Im worried that I fixated too much on the scenario we face here and not enough on warmand hot climates. Because even if youve got the best dang windows on the market with anSHGC of .2, five average-sized West-facing windows (Im calling 3 by 5 feet average) aregoing to let in more than a kilowatt of heat for several hours every afternoon. Thats notfar off from running a space heater on high, and when its 100 degrees outside thats not thesmartest move. For giggles I decided to look at some new homes getting built around Phoenix,Arizona and its frankly astonishing to me that in that climate theres apparently no focuspaid on window overhangs. Sure, back in the day we didnt have the fancy glass we do now, butif window awnings were popular here in Chicago, where its really only hot 4 maybe 5 monthsof the year, it seems to me like theres a lot of energy and money being wasted by notthinking of ways to keep windows in the shade. Now, there's a couple of notes I want to add. Both myselfand the person who helped me with the modeling here are a bit skeptical of some of the data it spat out. Theimpact of dark closed drapes when theres already a 2.5 foot overhang seems really high, and thefact that those drapes by themselves are lowering cooling power more than the overhangs seemsimpossible. Drapes on the inside of a window dont stop sunlight from passing through thewindow glass. At best, if theyre very reflective, they can push some of the sun's energy back out but havingstood next to a West-facing window with a white roller shade, I can say from experiencethat that shade gets pretty stinking hot on summer afternoons. It is always better to keep the sun from comingthrough the glass in the first place, that waythere is no greenhouse effect, so how this modelis considering those factors seems a bit off. Really, if theres one call to action I wantto make here it would be that there needs to be more study on the effectiveness of window awnings. Its quite strange how little information there is on this topic, and most of what Ive found are claims from awning manufacturers so Im not exactly taking them seriously. But it does seem pretty obvious to methat if you can eliminate direct sunlight transmission through a window, then youre effectively turning anywindow into a North-facing window no matter which side of your house its on. And that could make adramatic difference in the warm parts of the year. Unless youre in the Southern hemispherein which case, strike that - reverse it. Now, its not like awnings dont come withany drawbacks. Most obvious is that they make the interior of your home much darker during the day. If the awning is made of a translucent material you could still get plenty of filtered light comingthrough the window, but its entire purpose is to eliminate direct sunlight and if thats something youor your cat appreciates, well a proper awning is going to eliminate it. Although, I am quitecurious about the potential effectiveness of a transparent awning made from glass with a really low solarheat gain coefficient. That might be a way to have the best of both worlds. And it wouldleave your view of the sky mostly unimpeded. Then theres maintenance. The aluminum ones thatstill hang around were designed in response to the fiddle factor of fancy fabrics. Those fabricswould fade with time and required periodic cleaning, and depending on the design of thesupport structure, removing the fabric from the awning could be a pain in the butt. A rigid awning made of aluminummostly took care of these problems, and thats most likely why they started spreading. Then again, materials science has improved dramatically since awnings went out of fashion, and some fabric awnings can be selectively deployed. A roller-awning can be retracted whenyou dont need or want it, and dont look now but throw some Wi-Fi and actuators into the mix and youve got yourself a Smart Awning that could deploy exactly as much as needed and stayretracted on cloudy days or in inclement weather. The last main drawback to awnings that Ican think of is pests. Through providing shelter for your window youre also providingshelter for living creatures, and while Id be pretty cool with a robins nest outside mywindow, a wasp nest is less cool. Then again, if the window is screened its not like thatreally matters all that much but Ive dealt with my share of wasp nests and usuallyits best to not have to deal with them. But to be honest, all of those drawbacksseem pretty minor to me, and many of them arent even a thing all the time. I can tellyou that I would freaking love some awnings on my home - particularly on the West side. Im still doing that thing where I only run the air conditioning in the overnighthours and one of the most interesting things that technique has revealed is thedramatic effect of the sun. On cloudy days, even though it might be quite hot outside, my home only heatsup by 5 or 6 degrees Fahrenheit over the course of the day. But if its a sunny day at the same temperature,that just about doubles. Of course, not all of that is heat from the windows - the attics also getting stupid hot from the sun, and so are the walls. So its not easy to isolatethat variable. But I can say it is truly remarkable how quickly the rooms on the West side start toheat up once the sun reaches those windows. Awnings arent the only solution, of course. Theres been a whole bunch of Europeans just champing at the commenting bit to let you knowall about those exterior roller shutters theyve had over there for a while. Those are interesting,and theyre starting to be sold here, but Im curious to know how hot those shutters get in thesun. When closed they seem to trap a bit of air between them and the window glass, so while I haveno doubt theyre blocking the sun, it seems to me like the window will be getting quite warm as theshutters radiate their absorbed heat into that airspace. Id rather have an awning, then thatheat isnt trapped and I can still look outside! Then there are exterior blinds. Im startingto see these spread, often on porches. Theyre basically the same idea as Rolladen but usually fabric and not integrated intothe window frame or anything. Again, those willabsolutely do the job of blocking sunlight from hitting the window, but they also blockthe view when in use which awnings dont, at least not the view out. IfI seem gung-ho about awnings, well I am! I think theyre cool and have beentragically overlooked for the past half-century. Which brings me to one last thing. I live in a townhome which means if I wanted to install window awnings, Id need to get theHOA involved. And thats not fun. So - circling back to that earlier call to action where Isaid we should do more research on them, if it turns out that window awnings actually could reduce a typical homes cooling costs by 20%, then whaddya say we go ahead and neuter an HOAs ability to forbid their installation? Or, if that sounds too extreme, at the very least force HOAs to offer an assortment ofapproved styles and colors. Something tells me were going to want to find more and differentways to keep cool as these heat domes keep happening, and if something as simple as a window awningis as useful as it seems to be, uhh we should probably encourage their use. Alright, well thats it! If anyone out there isinvolved in evaluating building energy codes and all that fun stuff, please chime in with any infoyou might have on this topic. I really didnt find anything specifically about awnings and how muchthey could reduce cooling costs, and from what Ive heard there really isnt much attention paid to the effects of window overhangs at all outsideof hyper-nerd circles. If window awnings werehelpful before air conditioning, then surely theyre still helpful now. And given how a lot ofnew housing stock, even in places like Arizona, is getting built without window overhangs atall, either these new windows are miraculous marvels or we just kinda forgot the tricks ofthe past. Heres to giving some of them another go. blisteringly smooth jazz pretty universally liked. They let in naturallight and allow us to look outside and see things! But what was that? Probablynothing you heard but I stopped anyway. Theres gotta be two good takes inthere. I forgot how to tie a tie, I had to look it up! Its been too long. Those grand covered porches you seeon fancy I am restarting this line. An awning on the porch permits the use of the porch when the hot afternoon sun is shining. They will keep the porch shaft and pleasant, and this also reduces the temperature - I can skip the rest of this line because Ialready recorded the thing with the tie. That might be a way to have the best of bothworlds. And it wood pfftehh. [falls apart] [angry sigh] OK, so we gotta come up with some sort of pitch. Oooh, pitch. Baseball! Awnings: like a baseball cap for your house! Or maybe.... AWWWWWW nings.",
    "transcript_keywords": [
        "window awnings",
        "window",
        "awnings",
        "windows",
        "awning",
        "heat",
        "home",
        "energy",
        "sun",
        "heat energy",
        "window overhangs",
        "cool",
        "lot",
        "window awnings keeping",
        "exterior window awnings",
        "heat gain",
        "window awnings providing",
        "window awnings offer",
        "install window awnings",
        "porch"
    ],
    "transcript_entity_values": [
        "Northbecause",
        "hundred year old",
        "the 1920s",
        "the year",
        "the suns energy",
        "Isaid",
        "the winter months",
        "the years",
        "5 feet",
        "1925",
        "afternoon",
        "a Smart Awning",
        "Davis",
        "Chicago",
        "the summer months",
        "6 degrees Fahrenheit",
        "two",
        "SHGC",
        "Better Homes and Gardens Awnings",
        "1920s",
        "100 degrees",
        "3",
        "Phoenix",
        "the winter",
        "notthinking",
        "North",
        "several hours every afternoon",
        "Ican",
        "cloudy days",
        "West",
        "South",
        "Ireached",
        "winter",
        "the day",
        "1927",
        "YouTube",
        "today",
        "Dontlook",
        "20%",
        "Arizona",
        "Wi-Fi",
        "the 1960s",
        "awnings werehelpful",
        "winters",
        "Southern",
        "Europeans",
        "US",
        "Awnings",
        "Helen Davis",
        "Building Age andNational Builder",
        "first",
        "one",
        "4",
        "Rolladen",
        "Andso",
        "IfI",
        "these days",
        "the summer",
        "Ialready",
        "Imsure",
        "a decade",
        "5",
        "One",
        "summer afternoons",
        "the past half-century",
        "five",
        "French Quarter",
        "Arabian Awnings",
        "2.5 foot",
        "a year",
        "more than a kilowatt",
        "summer",
        "days",
        "a sunny day",
        "Hal",
        "theSouth"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "DATE",
        "GPE",
        "LOC",
        "TIME",
        "NORP",
        "DATE",
        "LOC",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "PERCENT",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "NORP",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "EVENT",
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON"
    ],
    "vector": [
        -0.07647884637117386,
        -0.015724074095487595,
        0.09173696488142014,
        -0.0036531989462673664,
        0.08666661381721497,
        -0.061417654156684875,
        0.033103372901678085,
        -0.010578331537544727,
        -0.04011054337024689,
        -0.012309708632528782,
        0.02919209748506546,
        0.053603846579790115,
        0.026361357420682907,
        -0.01052009966224432,
        0.03670598194003105,
        0.01167660765349865,
        -0.013397370465099812,
        -0.033315062522888184,
        -0.10892698168754578,
        0.008063121698796749,
        -0.08241643011569977,
        -0.01563432812690735,
        -0.047330860048532486,
        -0.005757143255323172,
        -0.02529088780283928,
        0.029840487986803055,
        -0.04172375425696373,
        0.033618684858083725,
        -0.0145493783056736,
        -0.00011425908451201394,
        -0.054247401654720306,
        0.06377902626991272,
        -0.04898829385638237,
        0.006193118169903755,
        0.0461413748562336,
        -0.015548878349363804,
        -0.003586859442293644,
        -0.057198457419872284,
        -0.09232624620199203,
        0.010222818702459335,
        0.00523458793759346,
        -0.061613090336322784,
        0.008723716251552105,
        -0.07870470732450485,
        -0.03330656886100769,
        0.003388530109077692,
        0.06803442537784576,
        -0.05519158020615578,
        0.020260000601410866,
        -0.03483578562736511,
        -0.048311952501535416,
        -0.09353829175233841,
        0.015277492813766003,
        -0.004802307579666376,
        -0.10292987525463104,
        -0.0004517509078141302,
        -0.023173704743385315,
        -0.026413479819893837,
        0.05125932767987251,
        -0.015207594260573387,
        0.12293443828821182,
        -0.06513932347297668,
        -0.04151168093085289,
        0.007994788698852062,
        0.012060283683240414,
        0.010192136280238628,
        -0.04625247046351433,
        0.0719895213842392,
        0.049201544374227524,
        -0.020705480128526688,
        -0.06101706996560097,
        -0.0007021143683232367,
        -0.0580696165561676,
        0.08109018206596375,
        0.021954189985990524,
        -0.046830181032419205,
        0.12532973289489746,
        -0.031115029007196426,
        -0.009712187573313713,
        -0.0075399805791676044,
        0.014522671699523926,
        -0.04134349152445793,
        -0.04638640955090523,
        -0.050360437482595444,
        -0.05637571960687637,
        0.008464239537715912,
        0.02180042676627636,
        0.021289795637130737,
        0.0073958286084234715,
        0.030056726187467575,
        -0.08647529035806656,
        0.02307473123073578,
        -0.0022513470612466335,
        -0.032230135053396225,
        -0.005014924332499504,
        -0.016062689945101738,
        -0.04560007154941559,
        -0.002335302997380495,
        -0.008084084838628769,
        0.06690532714128494,
        0.012238184921443462,
        -0.024200281128287315,
        0.0517209991812706,
        -0.019454963505268097,
        -0.030082158744335175,
        0.003941211383789778,
        -0.07432228326797485,
        0.12803779542446136,
        0.10359688103199005,
        -0.021479295566678047,
        -0.08535604923963547,
        0.015299295075237751,
        -0.03954299911856651,
        0.019485954195261,
        -0.02444978430867195,
        -0.09819155931472778,
        -0.05265924707055092,
        -0.01696491800248623,
        0.053563449531793594,
        0.028702395036816597,
        0.0909615159034729,
        0.014308429323136806,
        0.03772926703095436,
        -0.030239678919315338,
        0.03845620155334473,
        -0.033012811094522476,
        -0.056259024888277054,
        3.1160426694879524e-33,
        0.039700496941804886,
        0.1037934422492981,
        -0.03831358253955841,
        0.01818322204053402,
        0.1429494023323059,
        0.06997468322515488,
        -0.061616238206624985,
        0.07730279862880707,
        -0.039006881415843964,
        0.07572818547487259,
        0.019961519166827202,
        0.05340372398495674,
        -0.05506854131817818,
        0.008743689395487309,
        0.06947298347949982,
        -0.12233120948076248,
        -0.03778838738799095,
        -0.0727604329586029,
        -0.010155768133699894,
        -0.0043204003013670444,
        -0.04598957300186157,
        -0.010049030184745789,
        -0.007641023490577936,
        0.0012613072758540511,
        -0.00035859725903719664,
        -0.060278989374637604,
        0.04037977010011673,
        -0.005317169241607189,
        0.04746995121240616,
        0.04955653101205826,
        0.021809089928865433,
        0.03300724923610687,
        -0.0013380419695749879,
        -0.045769982039928436,
        -0.03464702144265175,
        -0.04322848841547966,
        -0.05956224724650383,
        -0.11858630925416946,
        0.05379846692085266,
        0.009521262720227242,
        0.012448254972696304,
        0.037202514708042145,
        -0.05078376457095146,
        0.07234538346529007,
        -0.003285452490672469,
        0.025557003915309906,
        0.1210956946015358,
        0.059803497046232224,
        -0.0007463401416316628,
        0.007386049255728722,
        -0.005388278979808092,
        0.012584679760038853,
        -0.01159740425646305,
        -0.05289050191640854,
        -0.031771570444107056,
        0.0015116205904632807,
        -0.0025358772836625576,
        -0.0287058986723423,
        0.0010156786302104592,
        -0.0049180928617715836,
        -0.030986860394477844,
        0.02716253139078617,
        0.05622909590601921,
        -0.048163026571273804,
        -0.07281218469142914,
        0.00905916653573513,
        0.0772513821721077,
        0.12708671391010284,
        -0.08680848032236099,
        -0.004420438781380653,
        -0.05468865856528282,
        0.006172385532408953,
        0.015809256583452225,
        -0.05536174029111862,
        -0.0022714543156325817,
        -0.007557714357972145,
        -0.03381012752652168,
        0.0825008675456047,
        0.03159026801586151,
        0.0321614071726799,
        -0.006595923099666834,
        0.014358114451169968,
        0.025316627696156502,
        0.029333215206861496,
        -0.006413388065993786,
        -0.05733583867549896,
        0.06845271587371826,
        -0.04575904831290245,
        -8.09101857157657e-06,
        0.010925279930233955,
        -0.06427505612373352,
        0.06543894857168198,
        0.005880231037735939,
        -0.0017825132235884666,
        0.006508953403681517,
        -4.131783664613645e-33,
        0.027271322906017303,
        -0.007342496886849403,
        -0.0075243753381073475,
        -0.011259897612035275,
        0.028766192495822906,
        0.03950393199920654,
        0.01965039223432541,
        -0.024097641929984093,
        -0.010741028934717178,
        -0.026602232828736305,
        0.015308739617466927,
        0.024769345298409462,
        -0.02825414575636387,
        -0.06686993688344955,
        -0.012040230445563793,
        -0.04149199649691582,
        0.07417839020490646,
        -0.07934878766536713,
        -0.05053243041038513,
        -0.00945196021348238,
        0.07150373607873917,
        -0.011818178929388523,
        -0.08457464724779129,
        0.0165314432233572,
        0.02579958736896515,
        0.03754842281341553,
        0.002177300164476037,
        0.04114871099591255,
        0.02500075474381447,
        0.012910941615700722,
        -0.051610711961984634,
        0.0027714353054761887,
        0.008930031210184097,
        0.01828773505985737,
        0.025911400094628334,
        0.053789302706718445,
        0.10057235509157181,
        -0.03986316919326782,
        -0.10045810788869858,
        -0.12911640107631683,
        0.057865239679813385,
        0.022685913369059563,
        -0.03201320767402649,
        0.0061757368966937065,
        -0.04554186388850212,
        0.01729498617351055,
        -0.07471645623445511,
        0.02099785953760147,
        -0.10205312818288803,
        0.040452439337968826,
        0.005540482699871063,
        -0.009406744502484798,
        -0.012559189461171627,
        -0.04276396334171295,
        -0.06974796950817108,
        -0.017252441495656967,
        0.05788596719503403,
        0.08375857770442963,
        -0.040844548493623734,
        0.013044376857578754,
        0.04924321547150612,
        -0.03598539158701897,
        -0.008563265204429626,
        -0.0777149572968483,
        -0.022533945739269257,
        -0.06976232677698135,
        0.10158676654100418,
        -0.001901331590488553,
        -0.03181534633040428,
        -0.031517282128334045,
        0.06517728418111801,
        0.01974002830684185,
        -0.026062017306685448,
        -0.12421578913927078,
        -0.03666239231824875,
        0.08009219169616699,
        0.1493382453918457,
        -0.10652676224708557,
        -0.06445623189210892,
        -0.009417012333869934,
        0.013766702264547348,
        0.059289269149303436,
        0.048492997884750366,
        -0.00515746371820569,
        0.11188199371099472,
        0.031679414212703705,
        -0.05332159623503685,
        0.0818302258849144,
        -0.009698008187115192,
        0.02500574290752411,
        -0.06399988383054733,
        0.011509227566421032,
        0.029698072001338005,
        0.07542697340250015,
        0.008289283141493797,
        -6.306835587110982e-08,
        -0.05565933138132095,
        0.03306310251355171,
        0.05343841388821602,
        0.04258980229496956,
        0.011085559614002705,
        0.001355985295958817,
        0.007561403326690197,
        0.02452782355248928,
        -0.030764607712626457,
        -0.10604562610387802,
        -0.056576918810606,
        -0.0450596883893013,
        -0.022410495206713676,
        0.15831175446510315,
        0.05132939666509628,
        -0.010435642674565315,
        -0.010780436918139458,
        -0.02831028401851654,
        -0.024454914033412933,
        0.025165729224681854,
        -0.10803766548633575,
        0.02843191660940647,
        0.11166627705097198,
        0.03815102204680443,
        -0.04062763229012489,
        0.06737435609102249,
        0.0016269362531602383,
        0.031248116865754128,
        0.07333260029554367,
        -0.008273419924080372,
        -0.10591461509466171,
        -0.03148578852415085,
        0.034361258149147034,
        -0.015132296830415726,
        0.04178093373775482,
        -0.09166865050792694,
        -0.08348005264997482,
        0.010108107700943947,
        -0.050820622593164444,
        -0.013192195445299149,
        0.06893417984247208,
        -0.06278851628303528,
        0.027048403397202492,
        0.06849951297044754,
        0.036845821887254715,
        0.016634996980428696,
        0.020259594544768333,
        -0.002903562504798174,
        -0.011479206383228302,
        0.04712251201272011,
        0.044295236468315125,
        -0.057103242725133896,
        -0.01776411570608616,
        0.018708622083067894,
        0.01837303675711155,
        0.029752975329756737,
        0.02666316367685795,
        0.0023495906498283148,
        0.022257067263126373,
        0.081107959151268,
        -0.015577812679111958,
        -0.045864224433898926,
        -0.12220979481935501,
        0.05206680670380592
    ]
}