{
    "id": "uhIdijSrnVc",
    "title": "NEW M1 Max MacBook Pro Reaction: The Ports are Back!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-10-18T23:54:43Z",
    "video_url": "https://www.youtube.com/watch?v=uhIdijSrnVc",
    "category": "Science & Technology",
    "tags": [
        "M1 Pro",
        "M1 Max",
        "MacBook Pro",
        "New MacBook Pro",
        "2021 MacBook Pro",
        "MKBHD",
        "MacBook Pro 2021",
        "Macbook",
        "MacBook Pro vs",
        "Apple silicon",
        "review",
        "M1 Pro vs M1 Max"
    ],
    "views": 5463315,
    "likes": 199168,
    "comments_count": 13547,
    "description": "Apple's finally created what we've all been waiting for. I hope you didn't get the last one. The M1 Mac Review:  That shirt:   MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://youtu.be/f4g2nPY-VZc",
        "https://bit.ly/2XnHyJm",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) Ugh - All right, what's up? MKBHD here, and today was a pretty exciting day. Today was Apple's October event. And really, I'm just gonna call it their MacBook Pro Event. Now, of course, I'm gonna try to stay neutral and measured about all of this stuff. I'm not about to just jump right in and say, \"Hey, this is the greatest laptop ever made,\" because it's very expensive, and clearly, it's not for everybody. But, for me, as a Final Cut editor, this was a laptop that I was waiting for the most. This is the one that applies to me the most and my workflow and the stuff that I do here at the studio every week, so I was excited for it. So let's just go right through everything. First of all, it did open up the event. It wasn't just MacBook Pros; there was some audio stuff too. So there's a new Apple subscription service, basically a lower tier of Apple Music through Siri that's five bucks a month. There's some new HomePod mini colors, and also there's a new third generation AirPods. So there's a new design that basically looks just like AirPods Pro but without the silicone tips and a noise cancellation. And they have a new wider case with MagSafe wireless charging and a longer battery life, and they're 179 bucks. Definitely get subscribed to stay tuned for that full review when I get those in my hands here. But then, we got right to the good stuff, right into the new Apple silicon. So the M1 chip, which seems like pretty recent, but we've had it for a little while now, was a pretty huge jump, right? From all the Intel stuff that was in Macs before. This was the first time we were getting Apple silicon inside Apple machines, and all that integration gave us much better performance and much better efficiency in the MacBook Air in the MacBook Pro 13, in these iMacs, in the Mac mini. It was even in an iPad Pro. But after all that stuff came out, all of this baseline stuff is covered and it left us wondering, when are we gonna see this stuff at a pro level? Some higher-end Apple silicon for the really intense workflows. 'Cause we still had Intel chips in the higher-end MacBook Pro, and so we were looking for higher-end Apple silicon for the higher-end bigger machines. And so that's what we finally got. We actually got two new chips. There's M1 Pro and M1 Max. Kinda cheesy names at first, but they do make sense. So this is the upgrade. This is Apple silicon unleashed, you might say. So the M1 Pro chip has a 10-core CPU, 8 high-performance with 2 high-efficiency, and a 16-core GPU with up to 32 gigs of RAM, which doesn't sound like a lot, but keep in mind, this is just the first tier Pro chip. Same shared memory architecture, still built on the five-nanometer process, but it's basically, simply, a physically scaled up M1 chip, as expected. They're saying it will deliver 70% faster CPU performance and 100% faster GPU performance over the M1, the already really good M1, which was a head and shoulders over the Intel chips that came before it, which is pretty crazy. But then, now, there's also M1 Max, which, again, scaled up even further, and it's mostly in the GPU department, so it's a bigger system on a chip. Look at the size of that chip. And this time it's the same 10-core CPU but up to 32 cores of GPU and up to 64 gigs of shared memory. So now you have four times the M1's graphic capability. So this answers the question I first had when we first started getting M1 Max, which is, \"Okay, those are replacing all the systems with integrated GPU, but what about when they get to the bigger systems that have dedicated graphics cards? Are they gonna continue to have dedicated graphics cards or will they build it all in?\" And, of course, in the laptop world, it makes sense for efficiency's sake to just build it all in. So that's what they've done, and that's where we see really impressive performance per watt numbers with M1 Pro and M1 Max. So Apple spent a healthy amount of time drawing graphs, comparing these new chips to the M1 and to PCs. And at least this time, I think they heard a lot of talk about those old graphs, this time they actually name-dropped the exact PC laptop they're comparing it to every time. But yeah, this is still a tough graph to draw any real world conclusions from. Basically, I think what we're all gathering here is this is a really powerful, really efficient set of chips at the high-end. Significantly faster than any of the fastest Intel MacBook Pros and with potential to still have really great battery life. And so, naturally, that is when we switched from new silicon to unveiling the new hardware, the new laptops, the new 14-inch and 16-inch MacBook Pro with all of the, quite frankly, too good to be true sounding rumors surrounding them, which all turned out to be true, which is kind of awesome. So they basically went backwards on three years in a row of very questionable to bad hardware decisions and just said, \"Oh, we've been listening. You guys didn't like that, so we fixed it.\" So these redesigned laptops, number one, brought back MagSafe, a magnetic pin-based reversible charging connector on the side of the laptop. Safe, beloved. 67 or 96 watts on the 14-inch, depending on if you have the baseline or the 10-core, and 140 watts on the 16-inch for faster charging. You can still charge via USB-C if you want to, though. Then they also got rid of the Touch Bar and put back real function keys at the top of the laptop. Full-sized buttons too. And there's a fingerprint Touch ID sensor on the top right-hand corner, you can see there as well. And whole keyboard is now in this black keyboard well, which is it's subtle, but it's a really nice touch. I think it looks really good. And then they also brought back ports. Real ports. They added ports that they had previously removed from MacBook Pros. I don't know when the last time Apple did this is, but I'm happy to see it. And it's funny, because this is the part of the event where they got really preachy and basically pat themselves on the back for a solid amount of time for bringing back ports and how great it would be to have real ports on these machines for Pros, but they're the ones that got rid of the ports in the first place. Nevertheless, I won't get mad at that part; I'm just glad they actually listened and brought them back. So they brought back the HDMI port, number one, which is great to see. Then they also dropped in three Thunderbolt 4 ports. And then they brought back the SD card slot. Why they ever got rid of it? I'll never know. But, hell yes, it's back. And then the headphone jack, which is still here, also now supports higher impedance headphones, which will be really interesting to test with some more pro wired headphones. So, okay, it was a great start. They've brought back real keys, they've brought back real ports, and then we'll get to the new improved display on these laptops. So at this point, you've looked at it, you've probably already noticed the notch, which we'll get to in a second, but the actual display itself is also much improved. It might be the most pro part of this laptop, especially for people like me, video creators. So both sizes now have 120 hertz ProMotion Liquid Retina XDR display, so up to 1600 nits of peak brightness for HDR. So now having real HDR screens, high-res screens is a massive unlock for creators looking to jump into an HDR workflow, like I've been thinking about for a while. So instead of having to buy a separate HDR display, you can all do that on the laptop, which is great. But also now just having HDR makes HDR content look better and having 120 hertz ProMotion display, of course, just makes everything, generally while you're using it, much faster and smoother and great too. It's been around in the world of $3,000 laptops for a while, but it's good to finally see the first ever high refresh rate Mac be this MacBook Pro. But we can't ignore that notch up there. So these are always fascinating design decisions from Apple. The laptop does not have Face ID. You saw the fingerprint reader on the power button, there's your Touch ID right there, that's it for your biometric authentication. I would have been totally down if they did put in Face ID for just an extra layer of security. It would have been more secure than Windows Hello, which just uses a webcam. But that's all that's up here. Just a webcam. It is a 1080p webcam actually; it's also about time. But, yeah, I'm not sure why the notch is so big. I don't know why it's this wide. Now, I love the extra screen real estate you're getting. They thinned up all the bezels, and it's awesome that it's a 16 x 10 display underneath this notch. And the extra screen real estate up top here is basically where the menu bar can permanently live and not overlap your content. But, I don't know. I just don't know why the notch has to give us Pixel 3 XL vibes. It is pretty massive. There are other laptops with thin bezels out there, some of them thinner than the MacBook Pro. And usually they don't have a notch. Some of them have some weird creative solutions. I remember there's a Zenbook that has a sort of reverse notch up at the top. And there's even some weirder ones. There's a HUAWEI MateBook that avoided that altogether and just put the webcam underneath one of the keys in the keyboard. So Apple chose a notch. They chose kind of a big notch. Not sure why. I think this is probably one of those things where we'll get used to it once we start using the laptop and looking at the rest of the huge HDR display. And I wouldn't be shocked if laptops in the future also start to do the notch thing. And I also wouldn't be shocked if a future version of this laptop did have Touch or Face ID, but it doesn't. At this point, it's just one of those weird design decisions, Apple has just done a notch this year. Now these laptops also have an improved battery life, 17 hours of video playback on the 14 and 21 hours on the 16, which is now the longest battery life ever in any Apple laptop. And the fast charging with MagSafe is gonna give you up to half battery in half an hour. It's not bad. And they also improve the speakers and the microphones on both laptops, which I'll have to give a shot when we get them here and test them out. But they were both already really good on the last one, so it could be even better. Yes, these are the laptops that a lot of people were waiting a long time for. So, yeah, I've told you guys already, ever since I started editing 8K video from these RED cameras, I haven't edited any videos on my laptop. I've given it a shot, but that workflow has been really constrained. And there are plenty of other workflows that have been really constrained on laptops, too. Even if you do get a high-performance laptop, it's not gonna be smooth running After Effects, running Cinema 4D with those big projects and lots of layers. That's still not fun, so we end up going to the desktop most of the time. But this could be a game changer. This could be very different. It seemed like every time Apple showed any sort of numbers or comparisons in this keynote with especially M1 Pro and M1 Max looked pretty good. I mean, M1 Pro should be awesome. M1 Max should be even more awesome, and with all the optimizations around macOS and ProMotion, it should be a pleasure also to use in just regular use if you're not in your creative workflow. But, yeah, to me, these laptops finally really feel like great, much better pro laptops for professionals. And I keep saying that word, but for people who have a workflow in some way that really takes advantage of this stuff. I don't know, even a lot of the little details, it's there. Even with the headphone jack supporting higher impedance wired headphones that draw more power, that's something you wouldn't ordinarily see. They'd just want you to use AirPods Max and get it over with. But people who are actual pros will use their own wired headphones and will wanna to plug them in, and they'll get more now out of that with the DAC. So it's stuff like that. It's stuff like the HDR display, and obviously 16 x 10 aspect ratio now. Lots of little things on top of the redesign. And the SD card slot, every pro I know uses an SD card slot in some way, I'm recording audio to an SD card right now. Love that. And also, the fact that you can max out basically the 14-inch or 16-inch to be the same best version of the computer: same chip, same storage, same memory, at the highest-end of both is pretty sweet. So you're basically just choosing a size at that point. There may be small differences due to thermal efficiency, but that's pretty cool too. Now they're expensive, of course. You could probably guess that halfway through the keynote. We were all thinking, \"Oh God, these are gonna be very expensive machines.\" So it's starting at 1999 for the 14-inch and starting at 2499 for the 16. That doesn't surprise me at all. We knew it was coming. But note that the baseline 14 is also a cut down 8-core CPU and 14-core GPU, so you have to spend 500 more dollars for two more CPU cores and two more GPU cores. Now I am a little bit surprised that we didn't also see more M1 silicon in an iMac, like an M1 Max iMac or or Mac mini. I was surprised there weren't more M1 Max Macs. Oh, wow, that's a tongue twister. But, that's just something we'll have to stay tight for. Also, I am trying to be very patient for the eventual Apple silicon Mac Pro. That's the big one that I'm eventually gonna be probably most excited for, but that's all future stuff. But, either way, shout out to Apple for listening to how much we hated almost everything they did with the laptops for the past three years and giving it back, fixing it, making it way better. Us pros really appreciate that. Either way, that's been it. Stay tuned for the reviews and a lot more coming 'cause it's Techtober, you already know. Thanks for watching. See you guys later. Peace. (upbeat music)",
    "transcript_keywords": [
        "Pro",
        "Apple",
        "MacBook Pro",
        "Apple silicon",
        "laptop",
        "laptops",
        "Apple October event",
        "Max",
        "Pros",
        "stuff",
        "time",
        "Intel MacBook Pros",
        "back",
        "HDR",
        "silicon Mac Pro",
        "Apple silicon Mac",
        "Pro chip",
        "higherend Apple silicon",
        "GPU",
        "time Apple"
    ],
    "transcript_entity_values": [
        "five bucks",
        "Apple",
        "every week",
        "Cinema 4D",
        "four",
        "half an hour",
        "three years in a row",
        "Intel MacBook Pros",
        "140 watts",
        "Today",
        "this MacBook Pro",
        "first",
        "the MacBook Pro 13",
        "First",
        "Pros",
        "AirPods Pro",
        "96 watts",
        "ProMotion",
        "17 hours",
        "16 x 10",
        "up to half",
        "120",
        "M1",
        "M1 Max",
        "today",
        "Thunderbolt 4",
        "179 bucks",
        "64",
        "iMac",
        "iPad Pro",
        "14 and 21 hours",
        "10",
        "M1 Pro",
        "M1 Max iMac",
        "1999",
        "USB-C",
        "ProMotion Liquid Retina XDR",
        "67",
        "October",
        "500 more dollars",
        "the MacBook Air",
        "32",
        "16-inch",
        "Apple Music",
        "Siri",
        "two",
        "100%",
        "2",
        "70%",
        "three",
        "Us",
        "Mac",
        "number one",
        "MacBook Pro",
        "M1 Max",
        "Intel",
        "this year",
        "HUAWEI MateBook",
        "SD",
        "14",
        "GPU",
        "MagSafe",
        "second",
        "Macs",
        "RAM",
        "the MacBook Pro",
        "the Touch Bar",
        "jack",
        "MacBook Pros",
        "Zenbook",
        "M1 Max Macs",
        "3,000",
        "five-nanometer",
        "14-inch",
        "1600",
        "webcam",
        "8",
        "Pixel 3 XL",
        "2499",
        "14",
        "iMacs",
        "MagSafe",
        "AirPods Max",
        "HDMI",
        "Final Cut",
        "Windows Hello",
        "HomePod",
        "max",
        "a pretty exciting day",
        "Mac",
        "CPU",
        "16",
        "the past three years",
        "Techtober"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "DATE",
        "LAW",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "FAC",
        "ORDINAL",
        "FAC",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG"
    ],
    "vector": [
        -0.018163586035370827,
        0.007916477508842945,
        0.10868696868419647,
        -0.049397312104701996,
        0.11991693079471588,
        -0.013569989241659641,
        -0.002923680003732443,
        0.033796049654483795,
        0.022413549944758415,
        -0.0005253910203464329,
        0.006865381263196468,
        0.01804261840879917,
        0.006247487384825945,
        -0.0783989429473877,
        0.0002407982392469421,
        -0.010535274632275105,
        0.09042933583259583,
        -0.14172612130641937,
        -0.08312619477510452,
        0.017233198508620262,
        -0.045142654329538345,
        -0.021609295159578323,
        -0.00449077133089304,
        0.03895936161279678,
        -0.030447205528616905,
        0.08768349885940552,
        0.03222521394491196,
        0.0023923334665596485,
        -0.0803946852684021,
        -0.015925083309412003,
        -0.028445135802030563,
        0.04289715737104416,
        0.05815530940890312,
        0.003776582656428218,
        0.0551411509513855,
        -0.042276788502931595,
        0.037223994731903076,
        -0.046596672385931015,
        -0.026759883388876915,
        -0.14523069560527802,
        -0.04608052223920822,
        -0.06907355785369873,
        0.10288111120462418,
        0.07714870572090149,
        0.03782888129353523,
        -0.049261655658483505,
        0.06095581501722336,
        -0.10869131237268448,
        -0.03281371295452118,
        0.03873404860496521,
        -0.012608963064849377,
        -0.06841792166233063,
        -0.06118975952267647,
        -0.023671036586165428,
        0.03495219722390175,
        0.08430255949497223,
        0.07917330414056778,
        -0.06031232327222824,
        0.038599297404289246,
        -0.017421649768948555,
        -0.006950687617063522,
        -0.07343245297670364,
        -0.02848421037197113,
        0.021413030102849007,
        0.02195987105369568,
        -0.06073779985308647,
        0.038356855511665344,
        0.0076042842119932175,
        -0.02866579219698906,
        0.11660176515579224,
        0.04833848774433136,
        0.006653206888586283,
        0.027689488604664803,
        0.07324738800525665,
        -0.006914663594216108,
        -0.024538706988096237,
        -0.02023455500602722,
        0.0060278791934251785,
        -0.0017808855045586824,
        0.03390251845121384,
        0.007659542839974165,
        -0.030242731794714928,
        -0.036502525210380554,
        -0.012820553034543991,
        -0.052967771887779236,
        -0.03159484267234802,
        -0.02012205868959427,
        -0.0031813899986445904,
        -0.014830386266112328,
        0.0018220895435661077,
        -0.024365680292248726,
        0.006303403992205858,
        0.030001165345311165,
        -0.003959576599299908,
        0.0029464378021657467,
        -0.010870556347072124,
        -0.03493257611989975,
        0.010804619640111923,
        0.022002270445227623,
        0.05784803256392479,
        0.03933669999241829,
        0.08176315575838089,
        0.03820495679974556,
        -0.06963207572698593,
        0.0057265255600214005,
        -0.08556251227855682,
        -0.0063447002321481705,
        0.055206071585416794,
        -0.021909639239311218,
        0.009891325607895851,
        0.0004756331618409604,
        -0.007319267839193344,
        -0.03448224440217018,
        0.03940282762050629,
        0.027130695059895515,
        0.0393555723130703,
        0.020437823608517647,
        0.0750967487692833,
        0.058203548192977905,
        0.11401183158159256,
        -0.008726664818823338,
        0.07418125122785568,
        0.03458089753985405,
        -0.0036567754577845335,
        -0.07986199855804443,
        0.04174220189452171,
        0.024287836626172066,
        2.5985446895208794e-33,
        0.06463579088449478,
        -0.015984149649739265,
        -0.019953515380620956,
        0.03157443925738335,
        0.020902611315250397,
        -0.032178979367017746,
        0.02427198365330696,
        0.027404680848121643,
        0.012974133715033531,
        0.026440784335136414,
        -0.06452896445989609,
        0.07662029564380646,
        -0.058700039982795715,
        0.01623387448489666,
        0.059842582792043686,
        -0.05371132865548134,
        -0.11236809939146042,
        0.0070208278484642506,
        -0.08040953427553177,
        -0.002379166893661022,
        -0.023620346561074257,
        -0.02791592851281166,
        -0.025433210656046867,
        -0.11459724605083466,
        0.05442821606993675,
        0.04141255468130112,
        0.03246873617172241,
        0.005316430237144232,
        0.015953972935676575,
        0.015921609476208687,
        -0.11767689883708954,
        -0.03236253187060356,
        0.027628624811768532,
        -0.10319240391254425,
        -0.05365433543920517,
        -0.005862903315573931,
        -0.03532328084111214,
        -0.0989324077963829,
        0.05949102342128754,
        -0.06280478835105896,
        -0.10292956978082657,
        0.007041065488010645,
        -0.09377780556678772,
        -0.05680907517671585,
        0.004821306094527245,
        0.06122443825006485,
        -0.013748458586633205,
        0.01488143764436245,
        0.010476653464138508,
        -0.017604980617761612,
        -0.023624304682016373,
        -0.023864982649683952,
        0.09929317235946655,
        0.0011861167149618268,
        -0.0967722162604332,
        -0.026024486869573593,
        0.0741092637181282,
        0.027848491445183754,
        0.10745920985937119,
        0.06970081478357315,
        0.061709750443696976,
        0.034627389162778854,
        0.031240183860063553,
        0.06782343238592148,
        -0.05704900994896889,
        0.13690581917762756,
        0.05047818645834923,
        0.019497854635119438,
        0.009851894341409206,
        0.019227398559451103,
        -0.07314057648181915,
        -0.06200484186410904,
        0.012529077008366585,
        -0.07011206448078156,
        0.047578539699316025,
        0.0007635173387825489,
        -0.09176461398601532,
        0.0019040601328015327,
        -0.028015609830617905,
        -0.03828027471899986,
        0.010336711071431637,
        0.0007438904722221196,
        -0.041202303022146225,
        0.029497481882572174,
        -0.02497692219913006,
        0.06133727729320526,
        0.00829026848077774,
        -0.057476501911878586,
        -0.039693307131528854,
        0.07274692505598068,
        -0.0696883425116539,
        0.009728662669658661,
        0.002148945815861225,
        0.0027850307524204254,
        -0.041945137083530426,
        -4.431470806568002e-33,
        0.059307318180799484,
        -0.040798332542181015,
        0.05912476032972336,
        0.028676245361566544,
        0.013453315012156963,
        -0.01805284060537815,
        -0.043240707367658615,
        -0.03086785413324833,
        -0.04800114780664444,
        -0.014491408132016659,
        0.036839235574007034,
        0.048166871070861816,
        -0.04189663007855415,
        -0.061941057443618774,
        -0.05902707204222679,
        -0.05146994814276695,
        -0.0028169078286737204,
        -0.09396930783987045,
        0.05726170912384987,
        -0.02719402126967907,
        0.036889392882585526,
        0.03687142953276634,
        0.03094908781349659,
        -0.026889165863394737,
        -0.07891787588596344,
        0.019003232941031456,
        0.014111917465925217,
        -0.017701294273138046,
        0.021332519128918648,
        -0.06257429718971252,
        0.001695261336863041,
        -0.03491925448179245,
        -0.005028068087995052,
        0.023647790774703026,
        0.07377315312623978,
        0.027497151866555214,
        0.016599643975496292,
        0.017998261377215385,
        0.0005391373415477574,
        0.02761678956449032,
        0.06074059009552002,
        0.04035055264830589,
        -0.06402292102575302,
        0.03379768505692482,
        0.005396335385739803,
        -0.02597064897418022,
        -0.0464615523815155,
        -0.0429370254278183,
        0.06920446455478668,
        -0.042378898710012436,
        -0.057697370648384094,
        -0.007997926324605942,
        0.0008827387937344611,
        -0.028354136273264885,
        -0.04993508383631706,
        -0.03792821988463402,
        -0.04061368480324745,
        -0.024925485253334045,
        0.04169426113367081,
        0.05042130500078201,
        -0.03854856267571449,
        0.009541015140712261,
        -0.014181540347635746,
        -0.07532552629709244,
        -0.020608309656381607,
        -0.008555732667446136,
        0.04945230856537819,
        -0.021944532170891762,
        -0.035628072917461395,
        0.046339016407728195,
        -0.022610250860452652,
        0.06537364423274994,
        -0.06416063010692596,
        -0.04938792064785957,
        -0.021927962079644203,
        0.020664528012275696,
        0.03314487636089325,
        -0.07295320183038712,
        -0.005946453660726547,
        0.008578854613006115,
        0.007574183400720358,
        0.0795016661286354,
        0.001769102644175291,
        -0.0201152004301548,
        0.033448655158281326,
        0.07301770150661469,
        -0.004037275444716215,
        -0.012780110351741314,
        -0.059250377118587494,
        -0.001828047214075923,
        -0.04250574856996536,
        0.002056332305073738,
        -0.07283326983451843,
        0.054260220378637314,
        -0.06792910397052765,
        -6.044373179747708e-08,
        0.01229232456535101,
        0.035294294357299805,
        -0.007396476808935404,
        0.07657681405544281,
        0.03510735183954239,
        -0.05247814580798149,
        -0.023508159443736076,
        -0.010258505120873451,
        0.0657970979809761,
        0.02056160382926464,
        0.10264822095632553,
        -0.1081443801522255,
        -0.08916985243558884,
        0.057240985333919525,
        -0.016879437491297722,
        0.0656077191233635,
        -0.02938440628349781,
        0.019971642643213272,
        -0.04844345152378082,
        -0.027547599747776985,
        0.07773016393184662,
        0.07942342013120651,
        0.09380290657281876,
        -0.05755922943353653,
        0.03004956804215908,
        -0.0043381862342357635,
        -0.014065206050872803,
        0.05970679223537445,
        0.029361002147197723,
        0.025312647223472595,
        -0.05632125213742256,
        -0.029574917629361153,
        -0.049424346536397934,
        0.03990395739674568,
        -0.007343054283410311,
        -0.07969558238983154,
        -0.01957678608596325,
        0.04303150996565819,
        0.1109369546175003,
        0.0799020528793335,
        -0.0505266934633255,
        -0.08646277338266373,
        -0.04995807260274887,
        0.027880001813173294,
        -0.019580872729420662,
        0.0003167654213029891,
        -0.06072468310594559,
        -0.018394071608781815,
        -0.11841374635696411,
        0.06241486221551895,
        0.010564493015408516,
        -0.0921616181731224,
        0.058783575892448425,
        0.08506109565496445,
        -0.0024551982060074806,
        0.065042644739151,
        -0.025308294221758842,
        0.0705672949552536,
        -0.064170241355896,
        0.013732921332120895,
        0.12501080334186554,
        -0.08143317699432373,
        -0.0772089958190918,
        0.08441697061061859
    ]
}