{
    "id": "UhO7MLntkDE",
    "title": "This Gaming PC has a Dirty Secret - Build Redux",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-06T20:31:46Z",
    "video_url": "https://www.youtube.com/watch?v=UhO7MLntkDE",
    "category": "Science & Technology",
    "tags": [
        "PC",
        "Gaming",
        "Pre-Built",
        "Intel",
        "AMD",
        "NVIDIA",
        "3080",
        "Power",
        "Value",
        "Unboxing",
        "Linus"
    ],
    "views": 970678,
    "likes": 38340,
    "comments_count": 1763,
    "description": "Thanks to Redux for sponsoring this video! Start your build at   System builders can sometimes have multiple various levels of fee's but Redux wants to do it differently. No Markup on the PC parts and they'll build + optimize the PC for just $75.  Buy Razer Huntsman Keyboard On Amazon (PAID LINK):    On Newegg (PAID LINK):    On Best Buy (PAID LINK):   Buy ASUS 360hz Gaming Monitor PG259QN On Newegg (PAID LINK):      On B&H (PAID LINK):      On Best Buy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.buildredux.com/linus",
        "https://geni.us/p7IvIX",
        "https://geni.us/HK2T",
        "https://shop-links.co/1725432053106517443",
        "https://geni.us/DBjexh",
        "https://geni.us/kZzXjLQ",
        "https://shop-links.co/1725431996266458255",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Opening up with our sponsor disclosure. This video is brought to you by Digital Storm. But Linus you might say, \"Ah, that's not a Digital Storm box.\" And I would reply, Yes, this (grunts) is a brand new PC gaming brand called Redux. Their pitch is simple, they build you a custom gaming rig with off the shelf premium quality parts. Like for example, this prime Z490P motherboard from ASUS and only mark up the system, $75. That's right, 75 bucks gets you the build, two years of warranty. And do you get any tech support? (grunts) Hasty, overhead raining. (objects cluttering) Oh shoot. I'm fine, oh wait our team of in-house gamers will get you back up and running if you run into any issues. So, I guess that includes tech support as well. Ouch, that really hurt. I just pulled the full boat and my hands under it. I'll be very interested to see what kind of build quality we can expect from a $75 build machine. You know, what's interesting is this is very similar to the model that we had for NCIX PCs way back in the day it was $25 to just put the hardware together, no validation, no operating system install, $50 to install the OS and configure drivers and all of that. And then I think we actually upped it to like 75 and a hundred later on down the line. So $75 for a completely assembled system. We also only offered a one-year warranty at that price. With two-year warranty looks very attractive especially if the sponsor of this video Digital Storm has anything to do with it. To start with, this is a pretty, attractive looking chassis seems to be a variation of the TD500 mesh from cooler master with a little bit of custom branding on it. So you can see they've got a custom badge on the front. I can tell you for $75 per build, you actually cannot afford to do a whole lot of custom branding but they still manage to spend a couple of bucks on one of these expanding, foam packing pieces to hold your graphics card in place. And ooh look at that. They've actually customized the AIO cooler as well as, Oh, did they do the fans too? Where's my packing material at? you know what, I'm kinda surprised at this. I was all ready to say Oh, well, you know, maybe they should have spent a bit more on the packing, but this might just be a case where the courier drop kicked it because you can see one of the back thumb screws got kind of bashed in but Redux is actually using a nice high quality foam here. So, double boxing might've solved it or just having thumb screws that stick out a bit less. You can see there's kinda like a spacer on this that makes it so they stick out quite a lot. That would probably be the solution to that. Either way it's not the kind of thing that affects the aesthetics of the build once it's in place. It's just something that is a bummer when you get a new system. And one of the firm's crews is kinda bopped into the back. Okay, you can definitely see some of the pedigree here. Like that is some pretty nice cable management. included with this case is an RGB... Wait no, not included with this case. How very interesting DS PCB. I wonder what DS is short for, hold on a minute. No, this seems to be customed, if I had to guess I'd say it's either for Digital Storm or DesignSpark which is a PCB making company. So, could be either way. I'm actually, just gonna pull it off. Look if they didn't want it torn down they wouldn't send it to me. No markings on the back, all right. It doesn't tell us anything useful. Then let's go ahead and put this stuff back in. Yes, Brandon, that is an RTX 3080. These are rarely seen out in the wild certainly a coveted addition to any gaming PC that is at least for the time being. At the time of shooting this video AMD had announced, but not yet actually released their rDNA to Radian RX 6000 graphics cards. So we'll have to see how that goes over the next little bit. But there's a couple of note worthy things about this bill. Aside from the cable management being well, frankly, excellent. The attention to detail is just outstanding. So we've got a positive air pressure configuration with three intake fans at the front one exhaust fan at the back. And then we're gonna have passive exhaust at the top of the case. That's all pretty normal other than just being done correctly. But look at this has Digital Storm been watching Gamers Nexus look at the orientation of this all in one cooler, got them tubes at the bottom. So just in case there's any air bubbles that are stuck in the loop from filling at the factory, they're gonna settle here in this tank at the top of the reservoir instead of getting stuck in your pump causing it to be louder and potentially have a shorter lifespan. Also note worthy is the appropriate amount of slack on cables like these front panel connectors and this CEDA cable here. One of the, just sort of classic blandas that we made back in my NCIX days was having technicians that would go, \"Okay, I've got everything plugged in. Now I'm gonna put my zip ties on, right? I'm gonna do a great job of cable managing the system.\" And they cinch the zip ties tight. And what they would actually do is they would put so much tension on the plug that what would happen in shipping is you wouldn't believe the amount of flex that even something as rigid looking this will undergo. During shipping the system would flex it would actually pull them out and the customer would get it and go, \"Did you guys not ship me a hard drive or what?\" 'Cause the system wouldn't boot or wouldn't turn on because the power plug had been pulled out So you can see that Redux has actually gone and put an appropriate amount of slack on all of the cables here to make sure that they don't accidentally just pop out during shipping. In terms of accessories ah there we go. I found them, Oh, this is interesting. It's like a, an acrylic GeForce RTX Sag reduction doodad. Oh cool, we should put that on. I've got some extra screws, motherboard manual power cord for the power supply, as well as any additional modular cables we might want. Oh, there's a little nubbin in here that's kinda getting in the way. Okay, these are not for cutting acrylic. Watch the whole thing cracked now, there's even a pretty successful caitilin looks pretty clean This one here, I think I got it, it's fired up. Oh, they're RGB fans, nice, was it pretty looking? Here is cooler master fans, this little things like you can see even this back fan it runs like under the VRM heat sink. So you can't really see it running down to the K-fan header back here, a brown back plate on this PNY accelerator is a bit of a shame PNY if you're watching brown, like. Now let's try to figure out the point of this RGB controller. I have to assume that 'cause I know Digital Storm uses these just like a RGB remotes for their systems still, just so that you don't have to have any ugly bloody software. I have to imagine that this just accidentally ended up I think, cause it's part of this tendon package. I'm sure they'll have that sorted out before they're shipping Redux systems off the website. There's nothing to really see Brandon. There's no bloat whatsoever. The closest thing to bloat would be the Microsoft Solitaire Collection which is included with windows. I don't even have any like a candy crush, king.com nonsense in here. So we've got GeForce experience, Microsoft edge. Wow not bad. And then homepage is obviously a website that's not launched yet so by the time you guys go to build redox.com it will actually be something Oh, I guess now it's a good a time as any to talk specs on this thing. It's a Core i7-10700K with an RTX 3080 So I am expecting to be able to max out the 360 Hertz refresh rated to this display. It's got 16 gigs of 3200 Megahertz memory. It's kind of a custom build from them. 'Cause it's got an upgraded graphics card compared to their high-end spec. So it's got a 500GBm.2 from a data as well as two terabytes of mechanical storage. So that'll cover all of your gaming needs. And then it's got a 600 watt power supply which might seem like an odd choice for an RTX 3080. But, if you bear in mind that this is supposed to have an RTX 3070 in it, then it's probably fine. Now what I wanna know, is if this is even gonna work. because we've seen 750, even 850 watt units just buckle under the momentary current spikes from these RTX 3000 series cards. So guess we'll find out sooner though. I am really big into the tinted glass with RGB look. Oh, that poor power supply. I was trying to figure out why it was running so loud. 'Cause most RTX 3000 cards, they're pretty reasonable. And it's got like a dual one 20 milli IO on it. It's that poor 600 watt power supply, okay. I wouldn't expect to have that issue on a final system though. What are we looking at here? 350-400fps and 75 bucks to build a machine like that. Not too shabby. Now for some random, honestly I would look at it and I'd go, ah, they gotta be cutting corners somewhere. But knowing who, (clears throat) well is, behind the scenes 75 bucks right? when now obviously when they say \"No mark up\" they mean compared to a retail price at another store where presumably they're making at least some margin but that's still very competitive with building it on your own. Obviously, especially when system integrators are... As far as I can tell the only ones that can actually get access to these bloody video cards right now. So if you're looking for a gaming rig no matter what game it is, once their website's up they're gonna have a feature where you can basically just plug in what games you play and what kind of performance you want. And it'll suggest a rig for you. Makes the whole experience much, much simpler than configuring everything on your own. Again for 75 bucks like, okay, where's that blow up thing? Dang it, I missed it. Oh yes, subscribe to short circuit. Sorry I got distracted playing video games.",
    "transcript_keywords": [
        "Digital Storm",
        "back",
        "kind",
        "build",
        "RTX",
        "system",
        "Digital",
        "Storm",
        "video Digital Storm",
        "Digital Storm box",
        "pretty",
        "RGB",
        "put",
        "power",
        "Redux",
        "custom",
        "thing",
        "bit",
        "power supply",
        "case"
    ],
    "transcript_entity_values": [
        "850 watt",
        "DS PCB",
        "the day",
        "GeForce",
        "one-year",
        "Hertz",
        "three",
        "One",
        "one",
        "king.com",
        "two years",
        "a couple of bucks",
        "3200 Megahertz memory",
        "25",
        "two-year",
        "PNY",
        "3000",
        "3070",
        "75 bucks",
        "Digital Storm",
        "350",
        "AIO",
        "3080",
        "IO",
        "max",
        "Gamers Nexus",
        "Redux",
        "Microsoft",
        "Brandon",
        "DesignSpark",
        "AMD",
        "Radian RX 6000",
        "16",
        "NCIX",
        "600 watt",
        "Redux",
        "TD500",
        "Linus",
        "RGB",
        "75",
        "the Microsoft Solitaire Collection",
        "50",
        "500GBm.2",
        "PCB",
        "ASUS",
        "750",
        "a minute",
        "CEDA"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG"
    ],
    "vector": [
        -0.025194076821208,
        -0.06602666527032852,
        -0.030168766155838966,
        -0.03908349201083183,
        0.07221571356058121,
        0.025328529998660088,
        0.0025860986206680536,
        0.05760293826460838,
        0.015762783586978912,
        0.04130467027425766,
        0.00063991395290941,
        0.014950038865208626,
        -0.00021228575496934354,
        -0.05829300731420517,
        0.02181609906256199,
        -0.01097928173840046,
        0.06467822939157486,
        -0.035761989653110504,
        -0.04896272346377373,
        -0.07348280400037766,
        -0.03685151785612106,
        -0.15329177677631378,
        -0.025392532348632812,
        -0.05477742478251457,
        0.04272065311670303,
        -0.051423732191324234,
        0.03987723961472511,
        -0.011040370911359787,
        0.025201765820384026,
        -0.05769797042012215,
        -0.007245971355587244,
        0.008902346715331078,
        0.028862733393907547,
        -0.005296771414577961,
        -0.061339668929576874,
        -0.007573382463306189,
        0.002847161842510104,
        -0.10493828356266022,
        -0.173848956823349,
        -0.07989910989999771,
        -0.03891795873641968,
        0.038596011698246,
        -0.0024459685664623976,
        0.14271289110183716,
        0.004499122034758329,
        -0.013717926107347012,
        -0.008556724525988102,
        -0.007268989458680153,
        0.00703122653067112,
        0.049576569348573685,
        -0.058680079877376556,
        -0.008137407712638378,
        0.02061995305120945,
        -0.0527041032910347,
        -0.07794851809740067,
        0.032637663185596466,
        -0.04874884709715843,
        -0.05855986103415489,
        0.05803278833627701,
        -0.016879713162779808,
        0.07434845715761185,
        -0.11972387880086899,
        -0.08907408267259598,
        0.00738001661375165,
        0.002102944767102599,
        0.017790747806429863,
        -0.008000580593943596,
        -0.05409672483801842,
        -0.053484007716178894,
        0.0007771016680635512,
        0.026706930249929428,
        -0.040712736546993256,
        0.05034951865673065,
        -0.03136654943227768,
        -0.046354617923498154,
        0.005240526515990496,
        0.0899723619222641,
        0.0068588461726903915,
        0.059267718344926834,
        0.012981737963855267,
        -0.005862416699528694,
        0.004827869590371847,
        0.018176961690187454,
        -0.00964310858398676,
        0.07134636491537094,
        0.03304338827729225,
        0.05018728971481323,
        -0.010590658523142338,
        0.02534399926662445,
        -0.09873054176568985,
        0.0061555225402116776,
        0.04547742009162903,
        0.07178302854299545,
        -0.01532550249248743,
        0.0011101070558652282,
        0.002629332710057497,
        0.04711969196796417,
        -0.025322750210762024,
        -0.04506630077958107,
        0.07905313372612,
        0.005697703920304775,
        0.004123322665691376,
        0.1305341273546219,
        0.03209064155817032,
        -0.08422573655843735,
        -0.040995992720127106,
        -0.07305703312158585,
        0.10864529013633728,
        -0.04587678238749504,
        -0.0015535446582362056,
        -0.0242760106921196,
        0.03916624188423157,
        -0.030249111354351044,
        0.006344239227473736,
        0.02067011408507824,
        0.09329193830490112,
        -0.07560711354017258,
        -0.041165899485349655,
        0.1193164512515068,
        -0.007189431227743626,
        0.011138719506561756,
        -0.0005163155146874487,
        -0.055051516741514206,
        0.01808186247944832,
        0.017903367057442665,
        -0.02372116968035698,
        -0.10269315540790558,
        7.341838698860517e-33,
        -0.04913526773452759,
        0.060076016932725906,
        -0.05110824853181839,
        -0.07045941054821014,
        0.007586061023175716,
        0.03461349010467529,
        0.07427015900611877,
        0.07490819692611694,
        -0.05777070298790932,
        0.08088222146034241,
        0.0018605184741318226,
        0.0871276780962944,
        -0.06731341779232025,
        0.07942399382591248,
        0.06181846559047699,
        -0.06232772767543793,
        0.029647529125213623,
        0.06061340868473053,
        -0.003618543269112706,
        0.009968619793653488,
        0.007011197507381439,
        -0.013186963275074959,
        0.025969330221414566,
        -0.03346182778477669,
        0.022718725726008415,
        -0.013314349576830864,
        -0.04028389975428581,
        -0.002529364312067628,
        0.01798560470342636,
        -0.0020513199269771576,
        -0.03990863263607025,
        -0.026196008548140526,
        0.02728239819407463,
        0.03191519156098366,
        -0.043132320046424866,
        -0.040762003511190414,
        -0.03502562642097473,
        -0.0801938846707344,
        -0.025225380435585976,
        0.005528975743800402,
        -0.023896096274256706,
        0.042703427374362946,
        -0.09662976861000061,
        -0.14271685481071472,
        -0.01657245121896267,
        -0.009423539973795414,
        -0.026418613269925117,
        -0.08456004410982132,
        0.024547550827264786,
        0.034474391490221024,
        -0.11341986060142517,
        0.07473532855510712,
        -0.00835694745182991,
        -0.003393038408830762,
        -0.01093029510229826,
        -0.09932630509138107,
        0.01079249382019043,
        0.036076903343200684,
        0.06321994960308075,
        0.05190487205982208,
        -0.004834092687815428,
        -0.017407316714525223,
        0.002816196996718645,
        0.05477716773748398,
        -0.09274917095899582,
        0.04002317413687706,
        0.10739246755838394,
        0.0005484404973685741,
        -0.038761675357818604,
        -0.005072678904980421,
        -0.038240816444158554,
        -0.00879861693829298,
        0.06438064575195312,
        -0.020963232964277267,
        0.010250120423734188,
        0.008382639847695827,
        -0.07780309021472931,
        0.023762909695506096,
        0.02037038467824459,
        -0.040067050606012344,
        -0.06052577123045921,
        0.06171127036213875,
        -0.025054488331079483,
        0.07870315760374069,
        0.0007724588504061103,
        0.010406307876110077,
        -0.08375692367553711,
        -0.0076632085256278515,
        -0.010134070180356503,
        -0.02126443386077881,
        -0.06677117198705673,
        -0.05170351639389992,
        -0.04764890670776367,
        0.00642800098285079,
        -0.00978232454508543,
        -8.620766266979596e-33,
        -0.10463869571685791,
        -0.0738164409995079,
        -0.06278986483812332,
        0.054275792092084885,
        0.030410002917051315,
        0.03464770317077637,
        0.0164997186511755,
        -0.024554308503866196,
        0.06928682327270508,
        -0.055294014513492584,
        0.01825137250125408,
        0.09231334924697876,
        -0.009425872936844826,
        0.015495747327804565,
        0.00902599934488535,
        -0.03152381256222725,
        0.05457472801208496,
        -0.04947356507182121,
        0.06649082154035568,
        -0.061270132660865784,
        0.02884341962635517,
        0.081490159034729,
        -0.031279612332582474,
        0.05477716773748398,
        0.031674593687057495,
        0.0008941067499108613,
        0.06637807190418243,
        -0.0004685622698161751,
        -0.0093274200335145,
        0.05871889367699623,
        -0.01000314112752676,
        0.05998608469963074,
        -0.03788355365395546,
        0.034611791372299194,
        0.013735344633460045,
        -0.001329269027337432,
        0.02440880611538887,
        0.10641863197088242,
        -0.023011473938822746,
        0.016732195392251015,
        0.060049254447221756,
        0.0009818098042160273,
        0.03421524912118912,
        0.016532398760318756,
        0.04796270653605461,
        -0.05737980827689171,
        -0.02073267102241516,
        -0.1432129591703415,
        0.010482960380613804,
        -0.021744370460510254,
        0.016804732382297516,
        -0.07767249643802643,
        0.06530140340328217,
        -0.053128208965063095,
        -0.1538049429655075,
        -0.028515569865703583,
        -0.0396224781870842,
        0.056560952216386795,
        0.06241569668054581,
        0.02005268819630146,
        0.08110607415437698,
        0.021663013845682144,
        -0.08188016712665558,
        -0.012019953690469265,
        0.024156564846634865,
        -0.01216262485831976,
        0.0017947047017514706,
        0.034881189465522766,
        -0.00935804471373558,
        0.016889043152332306,
        -0.05146002396941185,
        0.033646807074546814,
        -0.012540118768811226,
        0.01659189537167549,
        -0.04243079945445061,
        0.04271233454346657,
        0.03669673949480057,
        0.008674964308738708,
        0.018173884600400925,
        -0.01326918788254261,
        0.03259899467229843,
        -0.03432316705584526,
        0.07982190698385239,
        0.009947655722498894,
        0.0382988341152668,
        0.006349697709083557,
        -0.012983480468392372,
        0.015062950551509857,
        0.010231678374111652,
        -0.040405068546533585,
        -0.03157082572579384,
        0.003541829762980342,
        -0.057587429881095886,
        0.09001616388559341,
        0.018597107380628586,
        -6.289660348102188e-08,
        0.07906193286180496,
        0.02002912200987339,
        -0.023446012288331985,
        0.008485560305416584,
        0.02446998842060566,
        -0.06297895312309265,
        0.028525318950414658,
        -0.011505499482154846,
        -0.00900629535317421,
        0.017237983644008636,
        0.0023318585008382797,
        -0.07436484098434448,
        -0.027168570086359978,
        -0.007964028045535088,
        -0.005520565900951624,
        0.07745689153671265,
        -0.06350599229335785,
        0.08397696167230606,
        -0.026052815839648247,
        -0.03325837850570679,
        0.0017392846057191491,
        0.03720111772418022,
        0.07321278005838394,
        -0.03585138916969299,
        -0.030473053455352783,
        -0.027624284848570824,
        0.052126694470644,
        0.041480422019958496,
        0.08843846619129181,
        0.0032068919390439987,
        -0.018036745488643646,
        0.031306445598602295,
        0.07875285297632217,
        -0.02803814224898815,
        0.02733064815402031,
        -0.07795031368732452,
        0.017874520272016525,
        0.07663150876760483,
        0.10460665822029114,
        0.008020407520234585,
        -0.08736243844032288,
        -0.024002647027373314,
        -0.008333307690918446,
        -0.023722132667899132,
        -0.03537077456712723,
        0.04856128618121147,
        -0.1604803204536438,
        -0.11786442250013351,
        0.05131189525127411,
        -0.011829545721411705,
        -0.020215705037117004,
        0.018866224214434624,
        -0.0682554692029953,
        0.005791052710264921,
        0.04912446811795235,
        -0.014679163694381714,
        -0.0039914995431900024,
        0.036848586052656174,
        0.04600067064166069,
        0.015790799632668495,
        0.03704826533794403,
        -0.0797286182641983,
        -0.025773240253329277,
        0.037518054246902466
    ]
}