{
    "id": "uI4KYzG0yss",
    "title": "Mi 9 Durability Test! - Is the Camera Lens Sapphire?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-03-13T17:13:03Z",
    "video_url": "https://www.youtube.com/watch?v=uI4KYzG0yss",
    "category": "Howto & Style",
    "tags": [
        "Xiaomi Mi 9",
        "Mi 9",
        "Sapphire mi 9",
        "durability test mi 9",
        "Xiaomi",
        "Smartphone",
        "best smartphone",
        "budget smartphone",
        "M9 review",
        "m9 hands on",
        "me 9 durability test",
        "Mi 9 unboxing",
        "Sapphire Glass",
        "Sapphire camera lens",
        "Sapphire crystal"
    ],
    "views": 2493260,
    "likes": 57352,
    "comments_count": 4735,
    "description": "Xiaomi just released their flagship Mi 9 smartphone. A powerful colorful fairly priced device. But is the Mi 9 durable? The only way to find out is with a durability test. We will be scratching the 'sapphire glass' camera lens cover to find out if the sapphire is real or not. I also have a diamond selector tool to test the thermal conductivity of the gemstone like material.   Sapphire crystal is a super premium material. Its hardness level is right next to diamonds on the hardness scale. But when sapphire is not pure... it does not maintain the level of hardness that a pure form would. Sapphire should not start scratching until a level 8 or 9 on Mohs Scale of Hardness.   In depth review on Apples Sapphire:  HTC Sapphire:  Kyocera Sapphire:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/Zx4hRmuW6TM",
        "https://youtu.be/yvlYOOLmxgw",
        "https://youtu.be/qNAlQ786cmM",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Xiaomi Mi 9 the more expensive premium smartphone in the Xiaomi line up, but at the same time, still pretty fairly priced for the specs and power it brings to the table. And the box looks legit. Xiaomi is claiming to have added a sapphire glass protective layer on their camera lens. Sapphire is an ultra hard, ultra premium product with superior scratch protection, right there next to diamonds. But not all sapphire is created equal. Today we'll see if Xiaomi is using real quality sapphire like HTC, Tissot, and Kyocera, or if they are using junk sapphire like Apple. Let's get started. [Intro] You got to hand it to Xiaomi for this color scheme. This is the Holographic Ocean Blue. It's definitely a deeper blue than I anticipated, with hints of purple and basically all of the other colors. The phone feels pretty lightweight, but we'll get to that in a second. Let's start with the scratch test. I have a set of Mohs hardness mineral picks that are used to differentiate between different minerals and gemstones, and they let us know exactly what kind of materials we are dealing with. Glass and sapphire, while both optically clear and at first glance might look the same, are completely different materials. Plastic scratches at a level 3. Glass scratches at a 5 or a 6, and pure sapphire would scratch at a level 8 or 9. Diamonds, of course, are the hardest mineral and scratch at a level 10. The screen of the Mi 9 scratches at a level 6, with deeper grooves at a level 7. Xiaomi is advertising Gorilla Glass 6 on the screen of this phone, so those numbers are pretty typical for what we find on tempered glass screen flagships. Xiaomi has the teardrop notch up here at the top, hiding a 20 megapixel selfie camera. The small sliver of a speaker grill is also tucked up here in the top bezel. It's very secure. The build quality of this Mi 9 is off to a good start. The phone is made from anodized 7,000 series aluminum. It's pretty normal of the glass sandwich style phones these days. The volume and power buttons are also metal. Down here at the bottom of the phone next to the USB-C we have no headphone jack. But over here on the left side we do have a fully customize-able side button that can take pictures, open apps, or start a voice assistant. The dual SIM card tray has no expandable storage. It does have a rubber ring around the tip, but unfortunately, just a light touch of my SIM removal tool popped the low quality rubber band from around the SIM card tray opening. There's no official IP rating on this phone, which is good because this rubber is totally worthless and shouldn't be officially protecting anything. Xiaomi's flagship Mi line does not have the SD card slot or headphone jack anymore, but the budget Redmi line does include those extra features. If the Redmi line is cheaper and has more features, it's honestly worth considering even if the phone is plastic. Up at the top of the Mi 9, along with more metal, is the infrared remote control which is a fun little addition to this smartphone. The Mi 9 does have a plastic layer between the screen and metal frame of the phone which is good. It helps absorb some of the impact between two brittle layers if it's ever dropped. Xiaomi has advertised over and over about their new sapphire glass camera cover on top of the triple camera setup. The first problem with that sentence is that it's never actually called sapphire glass. Glass is glass, and sapphire is crystal. Two totally different materials. Both materials should be impervious to my level 5.5 stainless steel razor blade. Glass won't start scratching till right above that at a level 6. The reason sapphire is so valuable and premium is because of it's scratch resistant properties. It should hold out till a level 8 before it gets damaged. Unfortunately though, I can start to feel my level 6 pick grind on the surface of Xiaomi's sapphire, leaving permanent marks. The level 7 pick also leaves marks on the sapphire lens cover when it should definitely not. And finally, the point when we should start seeing scratches, level 8, we get some pretty hefty gouges. Things aren't looking good. I'll pull out my level 6 one more time to double check, and indeed we see more scratches. I'm not impressed. This is not the good stuff. Before we pull out any pitchforks though, let's see if it registers as sapphire. You can see here the glass lens of my Galaxy S8 Plus has no reaction with my electronic gemstone detector tool. But when I place the same tool up against the sapphire lens of the Mi 9, the tool does indeed have a reaction. The selector can detect the thermal conductivity that sapphire and diamonds have, but that same conductivity is not found in glass or fake gemstones. So Xiaomi is indeed using sapphire, just not a quality version of it. Maybe Xiaomi found a way to combine sapphire and glass, and that's why they called it sapphire glass instead of the correct sapphire crystal. Either way, Xiaomi has just joined Apple's ranks with sub-par inferior sapphire that should not be compared with the real stuff. There are a few companies that are doing it right like Tissot, HTC, and Kyocera. So if you want real premium quality sapphire, head over to those guys. Xiaomi is using an under screen fingerprint scanner, an optical fingerprint scanner just like the one found in the OnePlus 6T. We'll have to take a look at it from the inside if this phone survives the bend test. But first we'll scuff up the surface of the glass with level 7 scratches to see if Xiaomi's fingerprint scanner can function due to the unrealistic exorbitant amounts of abrasion....and indeed it can. Scratches are definitely not an issue for this optical fingerprint scanner. Thumbs up for that. Optical scanners only work with LED displays and not LCDs, since LED panels are slightly opaque allowing the under screen camera to see through the display. We can verify that indeed it has the characteristics of AMOLED by using this highly scientific Bic inflammatory device I obtained at a gas station. The Mi 9 has a 6.4 inch 1080p AMOLED display that turns white after about 30 seconds. But then the pixels do end up turning back on and recovering. If you think the burn test is extraneous, you are definitely not wrong. Now for the bend test. The last Xiaomi phone I tested, the Redmi Note 7, did not do so well. It's plastic frame eventually succumbed to the pressure and fractured into unusable bits. This Mi 9 however, with it's metal frame, survives the first bend from the back, and second bend from the front. The thin phone slightly flexes each time, but no permanent damage is done to the frame, the display, or the glass on either side. The Xiaomi Mi 9 is a survivor. Yeah, I'm not a huge fan of the sapphire glass attempt, or the lack of headphone jack and expandable memory card slot, but Xiaomi has built a solid phone and I can't get too mad at the guys building flagship phones for hundreds of dollars cheaper than Apple and Samsung. If you do buy this phone, it's more for the cool kaleidoscope of colors and not for the sapphire on the camera lens. Come hang out with me over on Twitter and Instagram, and let me know what phone you want to see tested next down in the comments. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Xiaomi",
        "sapphire",
        "glass",
        "sapphire glass",
        "phone",
        "level",
        "pretty fairly priced",
        "Xiaomi sapphire",
        "sapphire glass camera",
        "scratches",
        "Xiaomi phone",
        "fairly priced",
        "screen",
        "camera",
        "start",
        "quality sapphire",
        "sapphire glass protective",
        "sapphire lens",
        "scratch",
        "pretty"
    ],
    "transcript_entity_values": [
        "HTC",
        "about 30 seconds",
        "Redmi",
        "OnePlus",
        "The Mi 9",
        "this Mi 9",
        "Galaxy S8 Plus",
        "6.4 inch",
        "9",
        "Tissot",
        "6",
        "8",
        "Xiaomi",
        "SD",
        "7,000",
        "Instagram",
        "Tissot",
        "two",
        "Bic",
        "Glass",
        "jack",
        "the Mi 9",
        "6",
        "Mi",
        "Two",
        "Xiaomi Mi",
        "Xiaomi's",
        "SIM",
        "hundreds of dollars",
        "6 one",
        "10",
        "Redmi",
        "5",
        "Apple",
        "Kyocera",
        "first",
        "second",
        "Sapphire",
        "Xiaomi",
        "Samsung",
        "5.5",
        "these days",
        "Today",
        "the Holographic Ocean Blue",
        "3",
        "20 megapixel",
        "AMOLED",
        "7",
        "Twitter",
        "IP"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "PERSON",
        "PRODUCT",
        "ORG",
        "EVENT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "LAW",
        "PERSON",
        "PERSON",
        "FAC",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.1382119506597519,
        -0.07837756723165512,
        0.05413857847452164,
        0.03598784655332565,
        0.00921428669244051,
        -0.0795266330242157,
        0.07050531357526779,
        0.08119089901447296,
        -0.13539394736289978,
        -0.055967263877391815,
        0.0322422981262207,
        -0.02059064991772175,
        -0.03993704169988632,
        0.14130166172981262,
        -0.0398816280066967,
        -0.009609973058104515,
        0.08048360794782639,
        -0.03650505095720291,
        -0.042237382382154465,
        0.09087350964546204,
        0.07203541696071625,
        -0.04140062257647514,
        0.01472026202827692,
        0.00395341357216239,
        0.050105344504117966,
        0.016467731446027756,
        -0.024507563561201096,
        0.002259699860587716,
        -0.00573013536632061,
        -0.01842874102294445,
        -0.01173387560993433,
        0.030679600313305855,
        0.026002958416938782,
        0.06807077676057816,
        0.03857962042093277,
        -0.05901668965816498,
        0.006946978624910116,
        -0.056971874088048935,
        -0.06461965292692184,
        -0.002553764497861266,
        -0.11000429093837738,
        0.01694948785007,
        -0.0018696326296776533,
        0.042392831295728683,
        0.04731539636850357,
        -0.03185596317052841,
        0.15943728387355804,
        -0.06982502341270447,
        -0.06991741061210632,
        0.0009142222115769982,
        -0.05570985749363899,
        -0.014997650869190693,
        0.03778057172894478,
        -0.04213256761431694,
        0.06275531649589539,
        -0.011362236924469471,
        -0.02682124823331833,
        -0.06582092493772507,
        0.05104556679725647,
        0.00033568497747182846,
        0.007982923649251461,
        0.034102026373147964,
        -0.007596226874738932,
        0.04127918928861618,
        0.03952978178858757,
        0.03173953294754028,
        0.033505477011203766,
        -0.0839226096868515,
        0.029645197093486786,
        -0.01142609491944313,
        0.05360855907201767,
        0.030273273587226868,
        -0.06087592616677284,
        -0.01707235351204872,
        -0.022703371942043304,
        0.07312729954719543,
        0.02382298931479454,
        -0.05226486176252365,
        -0.10879214107990265,
        0.011806964874267578,
        -0.01806192845106125,
        -0.05604258179664612,
        0.05194154009222984,
        0.029554355889558792,
        0.04297815263271332,
        -0.02211448736488819,
        0.010792860761284828,
        0.11699505150318146,
        -0.06904902309179306,
        -0.0516512468457222,
        0.05207575485110283,
        0.16979868710041046,
        -0.15501795709133148,
        0.06306686997413635,
        0.0067031062208116055,
        -0.0199851356446743,
        -0.015446578152477741,
        -0.04392104968428612,
        -0.07195436954498291,
        0.04004022106528282,
        -0.023420318961143494,
        -0.012066007591784,
        -0.022759122774004936,
        0.07101855427026749,
        0.03173019364476204,
        -0.0333557091653347,
        0.03378627821803093,
        0.011317787691950798,
        -0.03902731090784073,
        0.03691776096820831,
        0.04742155596613884,
        0.0002947444445453584,
        -0.06264687329530716,
        0.028849132359027863,
        -0.015154310502111912,
        -0.006318849511444569,
        -0.061160407960414886,
        0.12283948808908463,
        0.04575498774647713,
        0.07182109355926514,
        0.007429071702063084,
        0.019073225557804108,
        -0.04468126595020294,
        0.006478974130004644,
        -0.032988134771585464,
        0.018220677971839905,
        -0.028094826266169548,
        3.179647934126977e-33,
        0.04721764102578163,
        0.09306931495666504,
        -0.0006577468593604863,
        -0.03774479776620865,
        -0.1357887089252472,
        -0.06373753398656845,
        -0.01294274628162384,
        0.04477259889245033,
        -0.021006783470511436,
        -0.01779530942440033,
        0.023341968655586243,
        0.05125170201063156,
        -0.05315132066607475,
        -0.008600694127380848,
        0.055635567754507065,
        0.04838613048195839,
        -0.010092846117913723,
        -0.04276351258158684,
        -0.03683279827237129,
        0.04612420126795769,
        -0.03013444133102894,
        -0.03862081095576286,
        -0.014623387716710567,
        0.019071869552135468,
        -0.013480265624821186,
        0.07587675005197525,
        0.06406135112047195,
        0.014157962054014206,
        0.02065933682024479,
        0.03361814469099045,
        -0.009303239174187183,
        -0.02123846858739853,
        -0.04624267295002937,
        0.0219985730946064,
        0.0011319553013890982,
        0.09799616783857346,
        -0.010379387997090816,
        0.03685755282640457,
        -0.03370262309908867,
        -0.037199389189481735,
        -0.03028305247426033,
        -0.004897850099951029,
        0.043955154716968536,
        0.0013071853900328279,
        0.09658999741077423,
        -0.032018449157476425,
        -0.08716368675231934,
        0.0280138049274683,
        -0.07179462909698486,
        -0.004605700261890888,
        -0.03953007236123085,
        -0.05145058408379555,
        0.02668267861008644,
        0.024712765589356422,
        -0.05748990923166275,
        0.0037507321685552597,
        0.043754953891038895,
        -0.0032460668589919806,
        0.06397173553705215,
        0.0233202762901783,
        0.02108663134276867,
        -0.11197475343942642,
        -0.05431384593248367,
        0.06788258254528046,
        -0.046031203120946884,
        0.07960277795791626,
        -0.06749764829874039,
        0.018060797825455666,
        -0.07633726298809052,
        0.010902910493314266,
        -0.006444386672228575,
        -0.014696030877530575,
        -0.016298485919833183,
        -0.025682775303721428,
        0.016603684052824974,
        -0.034803442656993866,
        0.011716268956661224,
        -0.04925547167658806,
        0.02670815959572792,
        0.035028573125600815,
        -0.06822125613689423,
        0.05714466795325279,
        0.0413629524409771,
        -0.0937994122505188,
        -0.06519903242588043,
        0.03148604929447174,
        0.04537380114197731,
        -0.03077181614935398,
        -0.00531951105222106,
        0.043442629277706146,
        0.016503293067216873,
        -0.06664722412824631,
        0.006225415505468845,
        -0.05354071408510208,
        0.009176487103104591,
        -2.4739029827413613e-33,
        0.019586117938160896,
        -0.054508887231349945,
        0.043819062411785126,
        0.06102622672915459,
        -0.04392813891172409,
        -0.053328726440668106,
        0.026014622300863266,
        0.08128522336483002,
        0.024106698110699654,
        -0.0699138268828392,
        -0.0119295883923769,
        0.00847200769931078,
        -0.008949251845479012,
        -0.07574162632226944,
        -0.04484269767999649,
        -0.021784448996186256,
        -0.012731315568089485,
        -0.042818862944841385,
        0.014311568811535835,
        0.039232801645994186,
        0.029866602271795273,
        0.10105419158935547,
        0.030542781576514244,
        0.008359638042747974,
        -0.04307303577661514,
        0.014078790321946144,
        -0.03993988037109375,
        -0.0787074938416481,
        0.016682077199220657,
        -0.023136457428336143,
        0.051840461790561676,
        -0.03522726893424988,
        -0.04737041890621185,
        0.015084788203239441,
        -0.01664872094988823,
        0.058296479284763336,
        0.04719700664281845,
        -0.02254682220518589,
        0.011677009053528309,
        0.06868700683116913,
        0.05910944566130638,
        -0.0002987486368510872,
        -0.015141965821385384,
        -0.004921993240714073,
        -0.007474021520465612,
        0.07253916561603546,
        0.08265845477581024,
        0.055670179426670074,
        0.016460558399558067,
        0.025101082399487495,
        0.055792491883039474,
        0.015261313877999783,
        -0.08216673135757446,
        0.02723049186170101,
        0.002516321139410138,
        0.010857722721993923,
        -0.0006316935177892447,
        -0.012768955901265144,
        -0.04199451208114624,
        0.02285027876496315,
        0.07845369726419449,
        0.05962391197681427,
        -0.03122042678296566,
        0.014690284617245197,
        -0.05601947382092476,
        0.0334777869284153,
        0.09870581328868866,
        0.0680600181221962,
        0.008618426509201527,
        0.04603181779384613,
        0.010957748629152775,
        0.01615867018699646,
        -0.024256814271211624,
        -0.05912035331130028,
        0.06403720378875732,
        -0.028719834983348846,
        -0.08425245434045792,
        0.009354577399790287,
        -0.00096389144891873,
        -0.053527526557445526,
        0.09690142422914505,
        0.007834317162632942,
        0.008338287472724915,
        0.05695303902029991,
        0.106247678399086,
        -0.05421236529946327,
        -0.013374045491218567,
        0.0256451815366745,
        -0.0024534668773412704,
        -0.008762541227042675,
        0.01162299606949091,
        0.003432753961533308,
        -0.024407560005784035,
        -0.0434052012860775,
        -0.050495244562625885,
        -4.172191481188747e-08,
        0.06201094761490822,
        0.013512480072677135,
        -0.01090879738330841,
        -0.005141841247677803,
        -0.06454238295555115,
        -0.06618357449769974,
        0.06305950880050659,
        -0.012273646891117096,
        0.031904641538858414,
        -0.03226488456130028,
        0.04409949481487274,
        -0.0730389803647995,
        -0.07307940721511841,
        -0.016424816101789474,
        -0.05450268089771271,
        -0.015731092542409897,
        0.017914554104208946,
        0.0637306421995163,
        0.00868825800716877,
        0.010264846496284008,
        0.004440728109329939,
        -0.016392145305871964,
        0.10238894820213318,
        0.003423514077439904,
        -0.10730564594268799,
        0.08536915481090546,
        -0.08837436884641647,
        -0.06747995316982269,
        0.05964430049061775,
        -0.011415884830057621,
        0.08841003477573395,
        -0.02342606894671917,
        0.03427424281835556,
        0.028332732617855072,
        -0.04874250665307045,
        0.01243867352604866,
        -1.6984551621135324e-05,
        0.04878367483615875,
        0.032264478504657745,
        -0.012567716650664806,
        -0.037384264171123505,
        -0.0855410248041153,
        -0.02313954383134842,
        0.02283756621181965,
        -0.012941854074597359,
        -0.043749403208494186,
        -0.006678743287920952,
        -0.11863566935062408,
        -0.015695562586188316,
        0.039074573665857315,
        -0.0019379064906388521,
        -0.00023377055185846984,
        -0.03198602423071861,
        -0.0205844733864069,
        -0.07961908727884293,
        0.00987960770726204,
        0.13112832605838776,
        0.00909023080021143,
        -0.09365622699260712,
        0.01629934087395668,
        0.09228005260229111,
        -0.11297409981489182,
        -0.016490625217556953,
        0.022578991949558258
    ]
}