{
    "id": "ujoAWANEUsw",
    "title": "I'm Building a Backyard BUNKER Part 1 - THE BIG TUBE",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-11-08T15:35:00Z",
    "video_url": "https://www.youtube.com/watch?v=ujoAWANEUsw",
    "category": "Howto & Style",
    "tags": [
        "Bunker",
        "How to build a bunker",
        "Backyard bunker",
        "apocalypse",
        "jerryrig bunker",
        "conduit bunker",
        "shipping container bunker",
        "bomb shelter",
        "underground bunker",
        "nuclear fallout",
        "off grid",
        "bomb shelter build"
    ],
    "views": 1299473,
    "likes": 58668,
    "comments_count": 2449,
    "description": "Welcome to my DIY GroundX Bunker project. Get 3DEXPERIENCE SOLIDWORKS for Makers (20% Off $99USD/year!):   Learn more about 3DEXPERIENCE SOLIDWORKS for Makers:   I've always wanted to put a bunker in my residential backyard. Ever since I was a little kid Ive wanted a cool place to just hang out. And today we start the build process to make it happen! People have suggested using a shipping container for a bunker - but thats actually a terrible idea. The real strength comes from using a corrugated storm water drainage pipe.  Get The GroundX Bunker Shirts HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://r1132100503382-eu1-my3dexperience.3dexperience.3ds.com/welcome/compass-world/3dexperience-works/design-engineering/shape-and-style/3d-sculptor/buy/offers/Influencer20/offer?utm_campaign=202308_glo_cnbmks_JerryRigEverythingDiscount_en_%20",
        "https://discover.solidworks.com/3dexperience-solidworks-makers?utm_campaign=202308_glo_cnbmks_JerryRigEverythingDiscover_en_%20",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "Full disclosure, I started planning this project about a year ago so it is in no way related to current world events. However, world events have been off the charts for quite a while now. My goal here is to build the most cost effective bunker in my residential backyard and build it in way that can be repeatable should others wish to do so as well. Some people might think my methods are cheap, others will think it's expensive, but we already know are some millennials calling their parents to see if they can hobbit hole their first home out from their parents' lawn. It is free real estate. Bunkers can protect against all kinds of things, whether it's solar flares, nuclear fallout, hiding zombies. Apocalypses come in all different flavors. However, it's been a dream of mine ever since I was a little kid to just have an awesome hideout of technology and accessories where a man can just chill. I'm incredibly excited for this project. Make sure you're subscribed. It is free. Let's get started. There are a lot of different bunker options that I looked at when I was starting this project. My first thought was that I could use a shipping container and bury that in my yard instead. Turns out that's a terrible idea Shipping containers are designed to be stacked on top of each other but not have any weight on the walls themselves or it'll collapse. And if you're going to add structure, you might as well pick option number two which is designing engineer some kind of underground basement of sorts encased in concrete. But that got super expensive super fast. Definitely a valid option though if you want something super custom. I however decided to go with a culvert bunker design made out of 12 foot diameter helically stormwater drainage pipe. These things are so massive. I picked these massive metal pipes for a few reasons. First of all, they have a service life of 100 years, meaning my grandkids' grandkids will be able to use this bunker. And of course, I'll keep a running tally on how much this whole thing cost me as we build it just case someone else wants to try and imitate my process. Also, feel free to take my ideas, And give me some of your own suggestions down in the comments. Unloading it off a semi truck was pretty intense since each 20 foot section of pipe weighs close to 4000 pounds. It requires a full size telehandler, and even then we were maxing out its capabilities. We used two giant machines, but you can probably get away with using just one by lifting up one sliding straps underneath, and setting the tube back down. Then lifting up from the center of the pipe like you see here. Together these two pieces of pipe cost me exactly $31,959 here in 2023. I picked the helically corrugated storm pipes because of their ridiculous strength. They might not look it right now, but the shape and ribs of these pipes allow them to be buried up 100 feet. And since this pipe is used regularly all over the world for storm water runoff in large cities, The installation and engineering is already super well known, vetted, and documented. Entire freeways are built on top of these pipes that people drive over every day. They also come in widths of up to 15 feet wide, but that required special shipping permits, and the foot diameter versions are more than enough for what I need. I mean, look at this. It'll be close to 5,000 cubic feet of beautiful bunker space when we're done. To get inside the bunker that is underneath the ground in my backyard, we will need a 20 foot tall entry shaft at one end, and a 20 foot tall emergency exit shaft at the other. I'm calling my bunker the Ground X Project since not everyone can afford a ticket to Mars. The whole thing is designed to sleep 6 people, And everything is currently drawn digitally in solid works. Each metal sheet and each structural member is meticulously laid out beforehand. Since this isn't really the type of project, I can wing on a whim and we need to be super efficient with the construction. We have to move really fast to get it in the ground before it starts snowing, and the longer these sit in my yard, the more suspicious my neighbors are going to get. If you want to design your own bunker solid works has been a channel sponsor for a while now. They have something called 3D Experience Solidworks for makers an incredibly affordable way to anything you can imagine. Great for fabricating, designing, rendering even programming CNC machines or 3D printers. Both connected to the cloud or locally installed. Great for hobbies, personal projects, or, you know, making a backyard bunker. This isn't our completely final version just yet. We still need to design an elevator in the entry shaft and probably add some more air vents. But we should be finished by the time we're finished. If you want to use professional design tools on a personal level, I'll leave a 20% discount off the usual $99 a year for the 3D Experience Solid works down in the description. Elevate your design game or submerge an entire structure, whichever you prefer, all within your means. However, the 3D Experience Solidworks for makers is not for professional use. If your side hustle makes more than $2,000 a year, you've got to buy the professional version. I don't make the rules, I just leave the links in the description. The CAD file from Solidworks is also what we put on the back of our shirts. I will leave a link for that in the description as well. As far as burying the pipe goes, some of these culverts can be placed just a few feet below the ground. However, I've decided to go 6 feet underground because that's where we start to take advantage of thermal insulation of the earth. At that depth, any hobbit will tell you that's where things start to get cozy and consistent, Maintaining about 60year round, which is especially beneficial here in Utah where we have really cold Winters. Plus, the more dirt that I can put on top of the pipe, the more structurally sound the pipe will a point of course. The whole thing is kind of like this empty pop can. The thin walled aluminum can is a suspiciously similar shape to the large pipe, and me being able crush it with two fingers isn't very confidence inducing. But if we dig a hole, support the tube with earth from underneath and dirt on the sides, and then the can, the same thin walled, empty soda can can now hold my full body weight in multiple with no issues. An empty pop can that's buried can survive extreme loads fully intact. Once my bunker's in the ground, it can survive whole semi-trucks driving over the top, giant bomb or even a zombie the size of your mom. So if we're going to be sitting 6 feet below the surface, And we have a 12 foot diameter pipe, that means we need an 18 foot deep hole. We better get to digging. This might take a while. Do you hear that? I hear reinforcements. Big things are coming. If you want to help support this project, you can always buy a JerryRigEverything knife, 15 bucks, jerryrigknife.com. Incredibly useful during any cataclysm. And if for whatever reason it does not survive the apocalypse. Just send me an email. See you next week.",
    "transcript_keywords": [
        "current world events",
        "pipe",
        "world events",
        "bunker",
        "related to current",
        "foot",
        "current world",
        "project",
        "feet",
        "pipes",
        "Experience Solidworks",
        "ground",
        "world",
        "super",
        "design",
        "foot diameter",
        "things",
        "Experience",
        "Solidworks",
        "year ago"
    ],
    "transcript_entity_values": [
        "18 foot",
        "Solidworks",
        "Winters",
        "100 feet",
        "the Ground X Project",
        "6",
        "100 years",
        "about a year ago",
        "6 feet",
        "2023",
        "CAD",
        "two",
        "3D Experience Solidworks",
        "20%",
        "up to 15 feet",
        "just a few feet",
        "15 bucks",
        "CNC",
        "next week",
        "20 foot",
        "31,959",
        "12 foot diameter",
        "close to 5,000 cubic feet",
        "about 60year",
        "first",
        "First",
        "Mars",
        "12 foot",
        "more than $2,000",
        "Utah",
        "99",
        "one",
        "every day",
        "4000 pounds"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "LOC",
        "QUANTITY",
        "MONEY",
        "GPE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "QUANTITY"
    ],
    "vector": [
        -0.02740408480167389,
        0.059347111731767654,
        0.042785875499248505,
        -0.042278457432985306,
        0.04014182463288307,
        -0.06905542314052582,
        0.059987518936395645,
        0.10874052345752716,
        -0.09671515226364136,
        0.007778474595397711,
        -0.04506673663854599,
        -0.061314914375543594,
        -0.002890294184908271,
        0.07856782525777817,
        0.02466200292110443,
        0.01088147982954979,
        0.08753983676433563,
        0.05524390563368797,
        -0.06619328260421753,
        0.03045344538986683,
        -0.0364583395421505,
        -0.002460905583575368,
        0.051025621592998505,
        -0.018685556948184967,
        0.011374925263226032,
        0.04421607777476311,
        -0.04744141548871994,
        0.07363993674516678,
        -0.008672638796269894,
        -0.030470149591565132,
        0.06505598872900009,
        -0.01778518408536911,
        -0.04051889106631279,
        -0.0012283207615837455,
        0.12263963371515274,
        0.08898336440324783,
        0.07129166275262833,
        0.00853870902210474,
        -0.019727841019630432,
        0.02135409787297249,
        -0.048207055777311325,
        0.007392046041786671,
        0.03361507132649422,
        -0.016338592395186424,
        -0.004874416161328554,
        -0.054564181715250015,
        0.08428151160478592,
        -0.05586401745676994,
        0.03865600377321243,
        -0.034864626824855804,
        0.010582963936030865,
        -0.04429696127772331,
        -0.0002560252614784986,
        0.006735707633197308,
        -0.05785481259226799,
        -0.018379760906100273,
        0.012309588491916656,
        -0.033282581716775894,
        -0.01441211812198162,
        -0.009956943802535534,
        0.08408568799495697,
        0.014370325021445751,
        -0.039438627660274506,
        -0.021305862814188004,
        0.06262217462062836,
        -0.016301607713103294,
        -0.005022237077355385,
        0.019433187320828438,
        0.018936630338430405,
        0.057849060744047165,
        -0.027767669409513474,
        0.06835857778787613,
        -0.01955513097345829,
        -0.02743157558143139,
        -0.03651206195354462,
        0.027482088655233383,
        0.0037180681247264147,
        0.01428783405572176,
        0.0417075976729393,
        0.05269292742013931,
        0.04817404970526695,
        0.04735390469431877,
        0.035916127264499664,
        -0.053511351346969604,
        -0.11045074462890625,
        0.065275639295578,
        0.052727844566106796,
        0.1034320741891861,
        -0.022037800401449203,
        -0.033085424453020096,
        0.004645911511033773,
        -0.027252407744526863,
        -0.011113671585917473,
        0.10161854326725006,
        0.050901345908641815,
        -0.05546141043305397,
        -0.04886150732636452,
        -0.07859781384468079,
        -0.03996242955327034,
        0.01744975708425045,
        0.059255119413137436,
        -0.049542371183633804,
        0.014121458865702152,
        -0.026087302714586258,
        0.024883493781089783,
        -0.07969342172145844,
        -0.0553547739982605,
        0.017232730984687805,
        -0.0014760326594114304,
        0.03704354912042618,
        -0.03454072028398514,
        0.005159798078238964,
        -0.03449162840843201,
        0.0040701995603740215,
        -0.10096654295921326,
        -0.007991894148290157,
        -0.03692593052983284,
        -0.01744859479367733,
        -0.012704494409263134,
        -0.03685547038912773,
        0.09331342577934265,
        -0.018261106684803963,
        0.04836079478263855,
        0.02566337212920189,
        0.0627862811088562,
        -0.02533254399895668,
        -0.016795355826616287,
        4.971385280134264e-33,
        -0.01445744838565588,
        0.055933237075805664,
        -0.06412114202976227,
        0.07403866946697235,
        0.08790438622236252,
        -0.03990348055958748,
        0.03790682926774025,
        0.01844882033765316,
        -0.03957140073180199,
        0.07304054498672485,
        -0.03419315814971924,
        -0.005649229511618614,
        -0.04633631929755211,
        0.059521473944187164,
        -0.04512793943285942,
        -0.038691867142915726,
        -0.06699386984109879,
        -0.04964114725589752,
        -0.018564119935035706,
        0.011140969581902027,
        -0.0343979075551033,
        -0.13959768414497375,
        5.0125829147873446e-05,
        0.009373562410473824,
        0.13500259816646576,
        -0.0687515139579773,
        0.04609671235084534,
        0.04319283738732338,
        -0.04420983046293259,
        0.006117202341556549,
        -0.01378061156719923,
        -0.0392996147274971,
        0.07163376361131668,
        0.04480128362774849,
        -0.008038053289055824,
        -0.005640590563416481,
        -0.034655291587114334,
        -0.06507573276758194,
        -0.05005652457475662,
        0.0011916818330064416,
        0.004684537649154663,
        -0.02706405706703663,
        -0.002725240308791399,
        -0.004578087478876114,
        0.07865021377801895,
        -0.030505649745464325,
        -0.029007956385612488,
        -0.061200227588415146,
        -0.06945623457431793,
        -0.11629657447338104,
        0.042570676654577255,
        0.04537471756339073,
        -0.03438001498579979,
        0.014367517083883286,
        -0.059404127299785614,
        -0.06954661011695862,
        0.06251249462366104,
        -0.026512039825320244,
        0.045947857201099396,
        0.016717158257961273,
        -0.025339070707559586,
        0.06635923683643341,
        0.020377330482006073,
        0.04345838353037834,
        -0.03500799462199211,
        0.003361895913258195,
        0.014827634207904339,
        0.11755462735891342,
        -0.029955396428704262,
        -0.010199828073382378,
        0.012206978164613247,
        0.02624071016907692,
        0.0242117028683424,
        -0.05806553736329079,
        -0.00780307874083519,
        -0.03027091920375824,
        0.014654640108346939,
        0.007723058573901653,
        0.05907377228140831,
        -0.015582309104502201,
        -0.0236037690192461,
        -0.0006766744772903621,
        -0.0009433074155822396,
        0.0022166140843182802,
        -0.04044565185904503,
        -0.06651461869478226,
        -0.037908654659986496,
        -0.03755655512213707,
        -0.028448373079299927,
        6.839052366558462e-05,
        -0.0203343965113163,
        -0.0657203420996666,
        -0.052397508174180984,
        -0.04805846884846687,
        0.010540826246142387,
        -5.867211525138682e-33,
        0.010672306641936302,
        0.012976168654859066,
        -0.043047454208135605,
        -0.035181351006031036,
        0.05665360391139984,
        0.017645783722400665,
        0.0691412016749382,
        -0.022590141743421555,
        0.06668421626091003,
        -0.022242987528443336,
        -0.1549730747938156,
        0.09473316371440887,
        0.016949929296970367,
        0.05105341225862503,
        0.01652456633746624,
        -0.057982876896858215,
        -0.04698103293776512,
        -0.1077241525053978,
        -0.02454538457095623,
        -0.0032278692815452814,
        -0.021254638209939003,
        0.019030675292015076,
        -0.01726602017879486,
        0.074923075735569,
        -0.04449830949306488,
        0.010863074101507664,
        -0.0186842642724514,
        -0.025458861142396927,
        0.05406124144792557,
        -0.023601336404681206,
        0.025286052376031876,
        -0.04645044729113579,
        0.0410025492310524,
        -0.02564617246389389,
        -0.0364101268351078,
        0.018320690840482712,
        0.029274465516209602,
        0.06433991342782974,
        -0.007095115724951029,
        -0.1126730665564537,
        -0.021428372710943222,
        0.04692854359745979,
        -0.04034696891903877,
        -0.044864069670438766,
        -0.045189063996076584,
        -0.0370061993598938,
        0.05161594599485397,
        -0.11095502227544785,
        0.01669222302734852,
        0.04123299941420555,
        -0.009457135573029518,
        0.020706484094262123,
        -0.04442842677235603,
        0.0387766994535923,
        0.015646792948246002,
        -0.0015750856837257743,
        -0.022610021755099297,
        0.0022165572736412287,
        -0.049757376313209534,
        0.05152885988354683,
        0.018365226686000824,
        0.028682345524430275,
        0.016802694648504257,
        0.015825945883989334,
        0.014461884275078773,
        -0.01885833591222763,
        -0.06793880462646484,
        0.04700528830289841,
        -0.09042150527238846,
        0.12615346908569336,
        -0.0029395786114037037,
        0.02539912797510624,
        0.05427038297057152,
        0.0047684721648693085,
        0.05772494897246361,
        -0.05748468264937401,
        0.015119235031306744,
        0.07096417248249054,
        0.003279936034232378,
        0.04972988739609718,
        0.015177544206380844,
        -0.002620312152430415,
        -0.06665153801441193,
        0.0817079171538353,
        0.13680662214756012,
        -0.03733675926923752,
        0.035885196179151535,
        0.041506219655275345,
        0.005838800687342882,
        -0.005983323790132999,
        0.0429128035902977,
        -0.006036408711224794,
        -0.06784225255250931,
        0.011333347298204899,
        -0.0009909366490319371,
        -6.26895655386761e-08,
        -0.0028842322062700987,
        0.037873800843954086,
        -0.06062094867229462,
        -0.0238559078425169,
        -0.10263161361217499,
        0.004681203048676252,
        0.0847712904214859,
        0.0007120727095752954,
        0.0506042055785656,
        -0.09515758603811264,
        -0.060909442603588104,
        -0.0455876849591732,
        -0.09324567764997482,
        0.08005065470933914,
        -0.1064964085817337,
        0.0013789285439997911,
        -0.06208347529172897,
        0.01179172657430172,
        -0.03280897065997124,
        -0.06598122417926788,
        -0.05762634053826332,
        -0.013796800747513771,
        0.05987207964062691,
        0.09259496629238129,
        -0.05303611978888512,
        0.050563912838697433,
        -0.03025936707854271,
        -0.08259439468383789,
        0.10039132088422775,
        0.08265551179647446,
        -0.055230144411325455,
        0.011422107927501202,
        -0.09114847332239151,
        0.07673788070678711,
        -0.006812903564423323,
        0.010985048487782478,
        0.009762552566826344,
        0.03765011206269264,
        0.008898532949388027,
        0.07165729999542236,
        0.001879903837107122,
        -0.07136236876249313,
        0.036225058138370514,
        -0.017719395458698273,
        0.031329359859228134,
        0.0772739052772522,
        -0.14242428541183472,
        -0.06345552206039429,
        -0.015899471938610077,
        0.033710628747940063,
        0.09626208990812302,
        -0.026056809350848198,
        -0.07410324364900589,
        0.08894073218107224,
        0.09805881977081299,
        0.07415683567523956,
        -0.06056353822350502,
        -0.06766210496425629,
        0.06837434321641922,
        0.04179172217845917,
        -0.0705285519361496,
        -0.02303149923682213,
        0.017641637474298477,
        0.04218900203704834
    ]
}