{
    "id": "UkIzknP8MG4",
    "title": "Week with MacBook Pro 16\"! I LOVE IT!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-11-25T18:14:32Z",
    "video_url": "https://www.youtube.com/watch?v=UkIzknP8MG4",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "MacBook pro",
        "16 inch",
        "macbook"
    ],
    "views": 518190,
    "likes": 14821,
    "comments_count": 1041,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) - 16-inch MacBook Pro, here it is. So I've already made a video kind of talking about it a little bit. The unboxing. But now here we are, over a week later, and I wanna say that this has completely replaced my iMac because I'm still using it 'cause I have projects that are already saved on it, but for the most part I've almost entirely moved everything over to the MacBook. When I was talking before about my editing process and my workflow, everything pretty much ran through portable hard drives, and that is because I would be traveling a lot, so I would be editing on my iMac. I would just take that drive when I leave and continue editing on my MacBook. Something else that happened this week with this MacBook was I took part in an editing challenge. It was a Mac verse PC editing challenge with Linus Tech Tips. I'm sure some of you guys are familiar with him, but one of his editors, Taran, he edits on a PC in Adobe Premiere and he has all of these crazy keyboards and macros and shortcuts. He's an extremely, extremely talented editor, so this was a really fun challenge to do. That was really stressful for me because it was one of the first times that I felt like I was really being pressured. We had four hours to create this video, so during that time I was definitely pushing this thing to its limits. Thankfully, this was only a one-camera shoot with some extra B rolls so it wasn't too intensive, but a lot of times, videos like this, I'm using all 4K footage shot directly from the A73's, and I'm editing in a multi-cam timeline, just like this. And it's fast. I just can't stress enough, I mean, yeah, this thing now has 64 gigs of RAM, it better be freaking fast. And that, to me, I think is one of the most shocking things because the price of this computer, I know a lot of people were saying, it's really expensive. Yes it is, but when you think about it, this completely spec'd out machine is like $6,100. That is far less than any of the other machines that I've ever spec'd out for any MacBook, ever. I normally would completely spec them out just because yes, I'm crazy, and this is what I choose to spend all of my money on. This computer now is replacing the 15-inch MacBook Pro. It's basically replacing it in price, too, so I think that that was a really great idea from Apple, not to just add on a 16-inch. They basically have this whole family, and this now is the new Pro machine, and I think it could not be more fitting. One of the things that I haven't yet tested out but I'm excited to do so in this video is I'm gonna test out Apple Arcade using an Xbox controller, so stay tuned for that. So obviously this is a 16-inch retina display, and the display, it's been really great. So where I've really noticed a difference in the screen size is when I'm editing, 'cause I like to have all of this stuff open, even though it's probably not the best way to edit. But I like to have access to everything when I'm editing and I like to be able to see everything. I'm able to have a larger viewer here, so I'm able to see also more of my timeline, so that's already made a huge difference. And then let's talk about the hard drive. The fact that this can go up to eight terabytes is incredible, but to add on to the eight terabytes, that's $2,200 extra dollars, which is quite a lot, but I feel like the fact that this has the option of an eight terabyte storage is pretty amazing because I haven't seen very many eight terabyte portable storage options. I mean, I guess maybe I haven't been looking in the $2,000 range, so maybe that's the reason why. The RAM also starts at 16 gigs, which is so incredible. That's what my previous MacBook was able to be maxed out to. Extra $800 for 64 gigs of RAM, uh, worth it. The speakers sound amazing. (peaceful music) I edit without headphones, a lot of the times, and it's incredibly annoying to everyone else around me, but that's how I edit. It's not great. This is also running Catalina, which gives us access to Sidecar, and I've never used Sidecar until today. And of course everyone thinks that me being an Apple fan girl, I'm always super hyped about everything. Initially I wasn't really that excited 'cause I didn't think that it would be something that I would ever really use, even though in theory it sounds like a great idea, but for whatever reason, I wasn't into it, so I never tried it. And today I tried it and guess what? I'm into it. To get Sidecar to run you have to be on the same wifi network and have both devices be on the same Apple ID. I'm gonna go up here to AirPlay. Within seconds, this is my mirrored desktop. So when I'm editing I can use the Apple Pencil, this is my browser, I can use that to select ranges, put it into a project, and that whole thing just goes right here into our timeline. You can also set this up to be a viewer, so I can use this to edit, this could be my viewer off to the side, like this. I'm just glad that I finally tried out Sidecar because it's pretty great. So let's test out Photoshop here. Right now I have the displays being mirrored. It's also got some shortcut keys here to the side so you have a nice undo there, which always use undo way too much, especially when I'm in Photoshop. Look at that beautiful work of art. I can use all the menu items with my Apple Pencil. (relaxed music) Here it is, my work of art. So they say you're gonna get about an 11-hour battery life, which is about an hour more than the previous 15-inch, and it's crazy because obviously this does have a bigger battery. It has the largest possible capacity battery that you can legally carry onto an airplane. I have noticed that the battery life has been significantly increased. Now I will never, ever get 11 hours of battery life because I'm always doing things that require a lot more processor, so for me to get 11 hours of battery life I think I'd probably just have to be looking at my computer. Even editing that first video that I did of the review of this, I was on a plane, I was in Ubers, I was in cars, I was working out of coffee shops, I was working in restaurants. That first video for me was a perfect scenario to really test this out. The battery life was great. It got me from basically New York to Nashville. I thought maybe because the computer was a little bit bigger that I would notice a difference when I'm on a plane, but I had no issues at all. The overall size of it is a little bit bigger than the previous 15-inch. They did a really great job of decreasing the bezel sizes on the display so that they were still able to keep this as small as possible, and not make it that much larger than the previous computer. It is 0.3 pounds heavier. I didn't really notice a weight difference. I mean, obviously this is a pretty beefy computer. The 15-inch also isn't exactly the lightest thing ever. When you have it in a backpack full of other gear, of course I would wish that it was lighter, but the amount of power, I'm 100% willing to sacrifice that 0.3 pounds. (relaxed music) One of the things that I wanted to make sure I did in this video, I wanna show you guys a size comparison of the 16-inch MacBook Pro to the 15-inch MacBook Pro. So you guys can see the slight difference between the 15-inch and the 16-inch. There is a size difference. I think a lot of people thought that it was gonna be the same footprint as the 15-inch. This really isn't that much bigger. When you think about the 17-inch MacBook Pro, that was a monster of a machine. I'd always wanted one of the 17-inch MacBooks but they were just so huge that there was no way that I would ever be able to lug that thing around. But this is such a small difference that if you are used to carrying this around, carrying the 16-inch is not gonna make much of a difference at all. When you're looking at both of these screens side by side, obviously you can tell that this one is larger, the bezels are a little bit smaller. There's still a big, black bar up here that houses your FaceTime camera, iSight, I still call it iSight even though I don't think it's been called that for 10 years. One of these days, I'll be waiting for a nice 4K built-in camera, but until then, I really don't use it that often so I guess it doesn't matter that much. The cooling on this MacBook has been amazing. I know I mentioned it already. The new fans, the new cooling mechanic, it's made a really big difference. (fan blowing) Do you hear it? What are you even doing? Oh, you're doing some updates. That's sweet. (relaxed music) Apple TV looks amazing on this thing, and of course if you do buy a Mac or an iPhone, you do a get a year free subscription. I definitely recommend watching The Morning Show. The screen looks great. The keyboard is also something that I haven't talked about yet. It's a new keyboard. It's a scissor mechanic, which kind of goes back to their previous version of their keyboards, like the 15-inch 2015, then they switched to the butterfly mechanic, which was the past few versions of the MacBook that they had. I still love the butterfly keyboard. I had no problems with mine and I do feel like this keyboard, there's a little more travel in the keys so you do have to press a little bit more. It also has a separate escape key, so that is no longer digital and attached to the touch bar. I think this MacBook has addressed a lot of the concerns that many people had. Keyboard, screen real estate size, storage, RAM, basically I think anything that we may have wanted in a Pro MacBook, I think we got it. I just want to document this moment in time on the internet. This is the first time that I am playing with an Xbox controller on my brand new MacBook, in Catalina, and we're playing the hot lava game. I'm also recording this using QuickTime. This is so exciting. So when I first started this up, it gave me a little system preferences thing. The game kept covering it up, so my Xbox controller wasn't working initially. So I had to go into the preferences into the privacy settings and make sure I granted access to my Xbox controller. So if you guys ran into this at all, this is probably the dialogue that you would see. Look at me. Doing parcours, oh gosh. Have any of you guys played Apple Arcade? If so, oh gosh, what games have you played? Go, okay, the floor is lava. It is very hot, so jump. What a great concept. I could play this with a mouse and keyboard, but, crouch or jump to let go of a pipe. Well I clearly figured that out already. I appreciate. I have these little gym mats in my gym. Jump at the correct time on trampolines to go higher. That's not a trampoline. Oh, oh, oh, oh gosh! (screams) This is so nerve wracking! This is fun if you play it on the iPad or the iPhone 'cause you can use the accelerometer. I'm getting really good at this, so I think that I might be going pro. I'm gonna be the next eSports champion of The Floor is Lava. I will see you, oh, just as I got cocky, I died. Is that a friend over there? Can I hurt you? Are you my friend, are we friends? Hi. Oh my gosh, hello friend. Okay well, go away. Where do I wanna go now is the question? I guess I'll just jump down here. I think I broke my leg. If you guys wonder why sometimes I might not post videos here in the future it's probably because I'm now playing The Floor is Lava. I can't think of anything negative to say. I was really trying because I know you guys always wanna hear me say something negative. I'm sorry, I don't have any problems with this so far. I can't even think of another, oh, one thing I have thought of something. The iSight camera, that definitely could have been something that was upgraded, even though I rarely ever use that anymore. A really fun fact, some of my first YouTube videos that I ever shot, I shot them using an iSight camera and a really good microphone. Let me just go pull that out. I just wanna show you guys where we started. Or at least where I started. This was a few laptops ago. Still has the light up MacBook. I'm not actually sure what year this one was even to find a plug to power it up, but it's interesting because I was talking abut the keyboard. So this was probably like a, maybe a 2015. Okay, it's definitely not exactly the same. It does feel a little bit like in between the butterfly keys and the scissor. What I really wanted to show you is this beast. This was, I think, the first MacBook Pro. A really beautiful machine. Can you just take a look at how small that track pad is compared to this one. This also has the same size track pad as the previous 15. That is quite a type. But this computer right here, this is what I made some of my first YouTube videos on. Little iSight. So if anybody ever tells you that you can't do something, that's not true. I basically built my entire career off of this. I know I'm sitting here talking about a very expensive top-of-the-line computer, but I will never be able to stress this enough to you guys, that whatever you have is good enough to get started on. And when you feel it's time to upgrade, that's when you do it. I do love this keyboard. It's just so great, how it's all silver, it blends perfectly in with the MacBook case. If you guys would like to see a Justine reacts to what's on her old MacBook, give me a thumb's up and leave me a comment below and let me know. So I think when you think about where we came from, where we are now, it's pretty impressive. This thing was such a beast. I spent all of my money, when I had quit my job, to buy this computer. It was probably the worst decision, but also the best decision I ever made. Could I pay my rent? Absolutely not. Did this get my career started and I owe so much to this little guy, I'm starting to get a little emotional now. So that's been my initial reaction to the new MacBook Pro. I just don't know what else to say other than, it's perfect. I'd love to hear what you guys think in the comments below. What have you seen from other people's reviews, and if you have one yourself, what do you think? So for everything I need, this is it, it can do it. I do plan on doing another video within a month or so after I've really been using it as my day-to-day computer. I do wanna see how it holds up after I have everything installed. I pretty much have most of the things that I need, but I love it. (curious music)",
    "transcript_keywords": [
        "MacBook Pro",
        "MacBook",
        "Pro",
        "editing",
        "Apple",
        "guys",
        "thing",
        "great",
        "computer",
        "difference",
        "lot",
        "keyboard",
        "video",
        "Apple Pencil",
        "battery",
        "things",
        "Apple Arcade",
        "Pro MacBook",
        "battery life",
        "Xbox controller"
    ],
    "transcript_entity_values": [
        "2,000",
        "17-inch",
        "MacBook",
        "AirPlay",
        "$2,200 extra dollars",
        "6,100",
        "MacBook",
        "One",
        "iMac",
        "one",
        "Catalina",
        "New York",
        "Apple TV",
        "iPad",
        "15-inch",
        "a few laptops ago",
        "Taran",
        "Apple",
        "Justine",
        "800",
        "0.3 pounds",
        "Linus Tech Tips",
        "Apple Arcade",
        "Pro MacBook",
        "11 hours",
        "four hours",
        "4",
        "100%",
        "iPhone",
        "The Floor is Lava",
        "16",
        "10 years",
        "2015",
        "The Morning Show",
        "MacBook Pro",
        "eight terabyte",
        "the Apple Pencil",
        "Nashville",
        "FaceTime",
        "Xbox",
        "iSight",
        "Photoshop",
        "RAM",
        "Apple Pencil",
        "iSight",
        "this week",
        "today",
        "a week later",
        "iMac",
        "11-hour",
        "MacBooks",
        "the past few",
        "a month or so",
        "YouTube",
        "seconds",
        "first",
        "Ubers",
        "Mac",
        "Adobe Premiere",
        "MacBook Pro",
        "about an hour",
        "the previous 15",
        "16-inch",
        "64"
    ],
    "transcript_entity_types": [
        "MONEY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL"
    ],
    "vector": [
        -0.011302187107503414,
        -0.06565455347299576,
        -0.027575187385082245,
        -0.12818589806556702,
        0.04984608292579651,
        0.010396266356110573,
        0.011026579886674881,
        0.04904342442750931,
        -0.029166599735617638,
        0.07381196320056915,
        0.05437184125185013,
        -0.017398951575160027,
        -0.015210667625069618,
        0.012206303887069225,
        0.00782434269785881,
        0.07641344517469406,
        0.033250633627176285,
        -0.049995195120573044,
        0.004263549577444792,
        0.05256595090031624,
        -0.028443044051527977,
        -0.08280366659164429,
        0.011481663212180138,
        -0.0015229851705953479,
        -0.012943102046847343,
        0.07810596376657486,
        0.07384654879570007,
        0.027932506054639816,
        -0.11895397305488586,
        -0.04695366695523262,
        -0.008333584293723106,
        0.01804635301232338,
        0.09963013231754303,
        -0.010219224728643894,
        0.04882362112402916,
        -0.08786376565694809,
        0.0712377056479454,
        -0.042895544320344925,
        -0.05663961172103882,
        -0.0678236335515976,
        -0.01880013756453991,
        -0.007634503301233053,
        0.04449805989861488,
        0.004299747757613659,
        -0.049660954624414444,
        -0.07884332537651062,
        0.033484186977148056,
        -0.05214393138885498,
        0.10363592952489853,
        0.04864313080906868,
        -0.054827552288770676,
        -0.03802066668868065,
        0.006446944084018469,
        0.05339224636554718,
        -0.03156444430351257,
        0.02812999114394188,
        -0.10489640384912491,
        -0.031050892546772957,
        0.0844205692410469,
        -0.058842435479164124,
        0.011974683962762356,
        -0.07356191426515579,
        -0.009658816270530224,
        0.06045880168676376,
        -0.07032524794340134,
        -0.06919491291046143,
        0.04419516399502754,
        0.009041661396622658,
        -0.02606968767940998,
        0.018817683681845665,
        -0.07289094477891922,
        0.03886093199253082,
        -0.012792970985174179,
        0.04468183591961861,
        -0.01695370115339756,
        0.05940135195851326,
        0.020022375509142876,
        -0.07173240929841995,
        -0.0024607994128018618,
        0.05523879826068878,
        -0.005622803699225187,
        -0.012063661590218544,
        -0.058674219995737076,
        -0.010043385438621044,
        0.0058306241407990456,
        -0.027281036600470543,
        0.02160770073533058,
        -0.031001511961221695,
        -0.036923591047525406,
        -0.0009554250864312053,
        -0.06088275462388992,
        -0.029107384383678436,
        -0.010119499638676643,
        -0.0035905928816646338,
        -0.04436517879366875,
        -0.07702285796403885,
        0.0009942565811797976,
        -0.06800956279039383,
        -0.02171621285378933,
        0.052814092487096786,
        0.0049997600726783276,
        -0.03209590166807175,
        0.03154288977384567,
        -0.06712911278009415,
        -0.014253991656005383,
        -0.10625118017196655,
        -0.035257820039987564,
        0.043498169630765915,
        0.019608860835433006,
        0.04663212224841118,
        -0.002311501419171691,
        0.03713167831301689,
        -0.05488841235637665,
        -0.02532038278877735,
        0.06326586753129959,
        0.11517590284347534,
        -0.018444687128067017,
        0.060426101088523865,
        0.028795508667826653,
        0.038629863411188126,
        0.0254146009683609,
        -0.05340392887592316,
        4.406285370350815e-06,
        0.049447424709796906,
        0.014938076958060265,
        0.014513393864035606,
        -0.03485046327114105,
        1.0996258148367062e-32,
        -0.009712249040603638,
        0.025409242138266563,
        0.013179820962250233,
        0.04065423086285591,
        -0.0012061125598847866,
        -0.06085875630378723,
        -3.1493287679040805e-05,
        0.10211101919412613,
        -0.04306171461939812,
        0.012785245664417744,
        -0.06552133709192276,
        0.013139246962964535,
        -0.08320529758930206,
        0.04472304880619049,
        0.026084106415510178,
        -0.03967669606208801,
        0.00668306415900588,
        -0.06110947206616402,
        -0.07240591198205948,
        0.05238253250718117,
        0.027614673599600792,
        0.0006267288699746132,
        0.04074205830693245,
        0.05649188160896301,
        0.09409010410308838,
        0.08939620852470398,
        0.06911905854940414,
        0.011761601082980633,
        0.0875498428940773,
        0.015534598380327225,
        -0.0692417323589325,
        -0.04740053415298462,
        -0.04070441052317619,
        -0.10635208338499069,
        -0.006705759558826685,
        0.014372025616466999,
        -0.03765348717570305,
        -0.015392007306218147,
        0.0036930390633642673,
        -0.0289048720151186,
        -0.03875438868999481,
        -0.016504183411598206,
        -0.07661629468202591,
        -0.07653436809778214,
        0.1213468536734581,
        0.03539736196398735,
        0.022575482726097107,
        0.06054706871509552,
        -0.021942196413874626,
        0.021080492064356804,
        -0.03722286596894264,
        -0.00031950813718140125,
        -0.010916627012193203,
        0.016041535884141922,
        -0.06134024262428284,
        -0.055448926985263824,
        -0.024330491200089455,
        0.04101262986660004,
        0.05598633363842964,
        0.05994856730103493,
        0.031227322295308113,
        0.006897611077874899,
        -0.006052550859749317,
        -0.02579530142247677,
        -0.06300178915262222,
        0.10507331788539886,
        0.061198391020298004,
        -0.04723403602838516,
        -0.01892457716166973,
        0.04245869442820549,
        -0.016340291127562523,
        0.01844472438097,
        0.04302692040801048,
        -0.03777513653039932,
        0.034674566239118576,
        0.037165045738220215,
        -0.11006336659193039,
        -0.037484459578990936,
        -0.01579892635345459,
        0.01202092319726944,
        -0.07505761831998825,
        0.055322229862213135,
        -0.015616921707987785,
        0.09250197559595108,
        -0.029736338183283806,
        0.007721077650785446,
        0.06690644472837448,
        -0.020592326298356056,
        -0.04097280651330948,
        0.03606189042329788,
        -0.028060907498002052,
        0.08859136700630188,
        -0.06445350497961044,
        -0.02669931948184967,
        -0.06057612970471382,
        -1.1342635191252111e-32,
        0.08056096732616425,
        -0.025761766359210014,
        0.021467216312885284,
        -0.013064279220998287,
        0.029370253905653954,
        -0.012418045662343502,
        0.020333437249064445,
        0.10657413303852081,
        0.023678570985794067,
        -0.11003204435110092,
        0.04791765287518501,
        -0.09381183236837387,
        -0.12291904538869858,
        -0.021867038682103157,
        -0.024490632116794586,
        -0.020389720797538757,
        -0.08386272937059402,
        -0.037425823509693146,
        -0.01028362475335598,
        -0.07365314662456512,
        0.05866776406764984,
        0.11738713830709457,
        0.10819984972476959,
        0.004264804068952799,
        0.004142168443650007,
        -0.035917978733778,
        0.02266106754541397,
        0.05932244285941124,
        0.03226802125573158,
        0.05954974517226219,
        -0.010382124222815037,
        -0.014961767010390759,
        -0.017730088904500008,
        -0.0044769165106117725,
        0.04899679496884346,
        0.06226062402129173,
        -0.017747359350323677,
        0.06993856281042099,
        0.04344579949975014,
        -0.037661295384168625,
        0.049364544451236725,
        0.011427418328821659,
        -0.005482979118824005,
        -0.028991488739848137,
        0.001499607809819281,
        -0.06610968708992004,
        -0.060249485075473785,
        0.05009886622428894,
        0.022238170728087425,
        -0.05098911374807358,
        -0.07851885259151459,
        -0.0367279052734375,
        -0.016506219282746315,
        -0.047469403594732285,
        0.011182833462953568,
        -0.02179628610610962,
        -0.0753088891506195,
        -0.013051223941147327,
        0.06507778912782669,
        -0.004114283248782158,
        0.006697439588606358,
        -0.0468788743019104,
        -0.04830517619848251,
        -0.1139964610338211,
        0.03335243836045265,
        -0.052948180586099625,
        0.041980721056461334,
        -0.03111354634165764,
        0.013186260126531124,
        0.058507032692432404,
        0.004501736722886562,
        0.02164618670940399,
        0.014026850461959839,
        -0.006623576395213604,
        0.043096259236335754,
        0.019700339064002037,
        -0.047901835292577744,
        -0.014441661536693573,
        0.06127817928791046,
        -0.0006850973586551845,
        -0.03149870038032532,
        0.030830156058073044,
        0.049687523394823074,
        0.07512009888887405,
        0.05264672636985779,
        0.10863558948040009,
        0.09375525265932083,
        -0.04965269938111305,
        -0.00013259098341222852,
        0.0787544772028923,
        -0.000761607603635639,
        0.029122421517968178,
        0.02989720180630684,
        0.061058159917593,
        -0.14128033816814423,
        -5.5692002121077167e-08,
        -0.011971408501267433,
        0.04693739861249924,
        -0.011109612882137299,
        0.03523992747068405,
        0.02092691697180271,
        -0.08569535613059998,
        -0.0020846384577453136,
        -0.008739471435546875,
        0.10590206831693649,
        -0.01690840721130371,
        0.12534217536449432,
        -0.036696985363960266,
        -0.03248310461640358,
        0.0862722098827362,
        0.012978442944586277,
        0.009543788619339466,
        -0.06969740241765976,
        0.1083194762468338,
        -0.024098537862300873,
        -0.06892740726470947,
        -0.027571188285946846,
        0.0731542557477951,
        0.029825298115611076,
        -0.005831127054989338,
        0.0489356704056263,
        0.003239730605855584,
        -0.03792918473482132,
        0.01957397721707821,
        0.00840726401656866,
        0.01462518610060215,
        -0.08758272230625153,
        -0.007322417106479406,
        -0.02985493838787079,
        0.0061972616240382195,
        -0.05135616660118103,
        -0.0654909685254097,
        -0.07345666736364365,
        0.02625775709748268,
        0.04131484404206276,
        0.0004617336380761117,
        -0.02627398818731308,
        -0.1244467943906784,
        -0.06947777420282364,
        -0.030792158097028732,
        -0.004709864500910044,
        -0.046326249837875366,
        0.04183170571923256,
        -0.02928129956126213,
        -0.06983651965856552,
        -0.007625360041856766,
        0.0052941045723855495,
        0.039128076285123825,
        0.06397180259227753,
        -0.019277313724160194,
        0.046496808528900146,
        0.019529249519109726,
        0.05199041962623596,
        0.02212231233716011,
        -0.06695529073476791,
        -0.020100189372897148,
        0.06041496619582176,
        -0.03778111934661865,
        -0.09940976649522781,
        0.05001058429479599
    ]
}