{
    "id": "UlPgvoobVPM",
    "title": "I can't believe THIS killed my PC...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-07-31T16:01:30Z",
    "video_url": "https://www.youtube.com/watch?v=UlPgvoobVPM",
    "category": "Science & Technology",
    "tags": [
        "gaming pc",
        "pc build",
        "gaming pc build",
        "pc gaming",
        "pc",
        "intel",
        "sleeper pc",
        "building the ultimate",
        "nvidia",
        "computer",
        "ken",
        "ken bolido",
        "gaming computer",
        "windows",
        "project",
        "diy",
        "this is",
        "austin evans"
    ],
    "views": 2251660,
    "likes": 57413,
    "comments_count": 2376,
    "description": "I almost rage quit this video lol Check out the Ultimate Switch build-off:  The original Old Boi gaming PC build:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=-e5sTKSx5c0",
        "https://www.youtube.com/watch?v=wAffD2aAQ1Q",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin, and you might remember this guy. So last year, we tried to rebuild a super old-school desktop with some proper, oh, I got that on really tight, some proper internals, so with a RTX 2080 TI, Core i7 9th Gen. It was very exciting. However, one of the problems we had was that because I gave myself eight hours to do the entire build, it technically works, but, well, with no cooling inside and all this hardware, it runs toasty. By toasty, I mean, like, it's obscenely warm. So today, we're going to try to fix that and actually rebuild this thing properly. All right, so some of my parts are in. I'm actually still waiting for Amazon to deliver a few more things, but, first step, I want to take everything out of this case because, as you can see, it is pretty filthy. And to be fair, this system does work, so right now it is fine. The big issue though is especially with that 2080 TI, it was incredibly warm. Like, way, way too warm that I would never want to run a system that was throttling pretty heavily. Now I did order a Blu-ray drive, so at least we'll be able to cover this hole, but I'll definitely keep the CD drive there just because it looks cool. - [Ken] Did we not order a white one? - [Austin] No, I couldn't find a white one. Wait, wait, does that look janky enough that it actually looks okay? - [Ken] No, that's actually fine. - Okay, so we've got our WD Black. We'll put that back in a little bit. - [Ken] I actually don't remember building this thing at all, so, you'd-- - It was, like, December. It was, like a few months ago. It was, like, six months ago. You don't remember the video at all? - [Ken] And we're overclocking this? - Yes. So I think we're gonna actually be able to reuse almost everything on this board. So we have 16 gigs of RAM? Yes, 16 gigs of RAM, so that should be fine. Wait. No, I think I lied. Oh, it's eight gigs of RAM. Wow, we really got lazy. I'll find some more RAM. Oh, look at that, beautiful thermal paste application by Past Austin. - [Ken] At least we did one thing right, right? - Hey! Dude, I'm so excited for that case speaker. - [Ken] 'Cause it actually worked. - It does, I like the beeping when I turn on my system. All right, I think that is about as clean as that's going to get. That's actually way shinier than it used to be. So, with our i7 9700K out, we pretty much got this entire thing disassembled, which means that, I guess let's try to figure out how we could put fans in here first. So, if we take this out... (drive bay rattling) - [Ken] Yeah? (drive bay rattling) Scratches build character. - [Austin] Wait, we're just gonna have an exposed fan here? No, look at it from the front. Do we have some kind of grill or grate or something we can put on top of it? - [Ken] You know what we could do? - What can we do? - [Ken] I can go to Target and make one. - So we finally have, a day later, our Amazon package with not only the cooler for the system, which I really, really hope fits, but importantly, we also have our brand-new Z390 motherboard. Now this is important for a couple of reasons. First of all, there's no extra real reason why we have this ITX. We have a much larger board now. But importantly, since this is Z390, we'll be able to overclock this a little bit better. So my thought is that we should split this up. So I'll work on getting the motherboard and the cooler built if you want to figure out how to get the actual 80 mil fans installed in here. We don't have, oh, we barely have clearance for the power supply. Oh man, that's close, all right. So that's gonna be a little flashier than I like. This actually does have LEDs on board, or rather, it has RGB. I might turn that off 'cause I definitely don't want any RGB coming out. But, I mean, there's no window or anything, so we should be okay. - All right, so I got a bunch of things that look like they're overkill for that one vent, but Home Depot doesn't exactly sell, you know, this big of whatever hardware cloth, wiring, whatever you want to call it. It's like very complicated model building. Hey, look at that! Cool! So I added the mesh, and I glued it in place, and most of it is all set and the glue's dried and stuff. In the meantime, while I let that dry, we can actually add the 80 mil fan to the inside now. (fan rattling) Yeah, like that. - Hey, Ken, we may have overlooked something. Where's our hard drive gonna go now? Okay, let's put it here for right now above the Blu-ray drive? - Look, it would actually look really nice right here. - That doesn't look really nice, that looks dumb! It looks like you forgot your hard drive. Another day, another chance to work on the Old Boi PC. So, last night, we got this thing actually set up. It is posting and I've got Windows and everything installed. I did some very minor cable management, but the main thing is that we're still waiting on the bracket to actually put our normal one terabyte hard drive in so we can pair this with Optane. I will say this thing does look pretty sleepery. So besides the black power supply which is a little bit of a giveaway, everything else back here looks pretty standard. I mean, if you look at the motherboard, obviously, DisplayPort wasn't around in 2001, but with our PCI covers onboard, it looks fairly low-key, but especially if you come around front. I'm pretty happy with just how old-school this system looks. I will say, this looks a little bit more jank (laughing) than I think I had hoped it would be. I don't really know what else we can do with it. We can overclock the 2070, but I'm-- (record scratching) Wait, what? Where did the 2070 come from? Well, originally, I had something different in mind. The main thing I'm going to do here is swap out that 2080 with this RTX 2070. This should give me a much more reasonable TDP inside this case. So I was noticing this was running a little bit slower than I expected, and I open it up to find that the fan's not spinning. It's like, oh, that's weird. Well, the fan is oversized. It's literally stuck on the battery on the motherboard. So this is a passively-cooled RTX 2070 right now. Through a weird coincidence, we may have to put the 2080 TI back in here because that's probably our best option. Okay, so the 2080 TI is up and running. I'm currently running through my first run of Time Spy. It's toasty, like, it's no doubt that there's a lot of heat coming out of the back not only because of the power supply, but also because of the rear exhaust fan, both of which are dumping heat this way. So we're throttling somewhat, although, actually, it's not too bad. So I think now what I'm going to do is I'm going to manually spin up the fans a little bit more and then we can start overclocking. I'm not gonna touch that 2080 TI. It's already throttling as is, but what I do think is we do have some headroom on the processor. So normally I would overclock manually or sometimes I'll give the motherboard auto-tool a try, but Intel now has a performance maximizer tool. So this is not something you can use on all Intel CPUs, so you need a Z390 and you need a 9th Gen processor. So that actually took about an hour. The screen went black for almost that entire time, so I wasn't sure if it was working, but it looks like it did. Let's see what our results are. So we got 200 megahertz more. A'ight, I mean, that's not exactly the largest overclock in the world, but it's better than it telling us that we don't have enough cooling to run it at stock speeds, right? - [Ken] You know, I actually have a mod that I think can help us. - Okay. - [Ken] You want to hold the camera for a second? - I will hold the camera. (panel rattling) (Austin laughing) - Problem solved. - I mean, that actually does solve the problem, but it kinda ruins the aesthetic! Now you can tell it's clearly not a stock-looking system. - We can turn off the LEDs or tape over them, and we have beige in it. (tense music) - Powered everything. - [Ken] So, what is happening? - Okay, so it's been a couple days since we've finished Old Boi. We're trying to shoot the conclusion, and for some reason it's no longer posting or booting whatsoever. So this is the point in the video where I was going to give you an update, and like, \"Hey, look, Old Boi is done! \"We installed our hard drive and a new enclosure! \"It's all up and running and perfect!\" - [Ken] Wait, you installed the hard drive. Were you wearing your anti-static ankle bracelet? \"Let's revisit Old Boi,\" you said. - No, no, it's fine, it's fine. - [Ken] \"Let's reshoot the ending,\" you-- - It's fine, it's fine! - [Ken] You know, this video was done. (PC beeping) - Come on, Old Boi. You don't have to be so smug about it, you know. - [Ken] I'm not smug, I'm just... - Right? So I'm gonna reseat the memory. But I just don't understand what changed. It's literally been two days. I hear friendly beeps, whirring and wishing and whooping and-- (PC beeping) VGA? It's a VGA problem, wow. Okay, so let me reseat the graphics card. I think the cable was just tension 'cause I'm, like-- (metal rattling) - Oh, god. - What was that? - [Ken] (laughing) What did you do? - It was like a thump! (PC beeping) All right, so let me put a different graphics card in now. - [Ken] All right, so we have the new card in. - I just put a 1650 in just to see if it's a 2080 TI issue or it's a motherboard issue or what. (PC beeping) (heavy sighing) - You'll probably lose-- - This was fine before. Wait, should we try a different monitor? There's no way the monitor would keep it from posting. - [Ken] Okay, so, just put it up here. We'll just rely on integrated graphics and see if that works. - Just pull the graphics card out all altogether? - Just pull the graphics card altogether. - Okay, so, we can't even boot on integrated graphics. What could've gone wrong? Did you unplug something to make this video more interesting? - [Ken] No. Why would I do that? - Wait-- - No, why would I do that, (laughing) you're really-- (Austin laughing) - So I've cleared the CMOS now, and now-- (PC beeping) Nope. And the CPU comes up. VGA, and it sits on VGA. It just can't get any kind of graphics, though. We know everything is plugged in. We've tried different GPUs. We've even tried running on the integrated graphics. - [Ken] Hold on, I have a plan. I have a plan. - What plan might that be? - You want to hold the camera. Now, I don't know if you did this when you were a kid, 'cause you had a TV when you were a kid, right? - A TV? - Yeah. - Yeah. - Right, this is off, right? Yeah, it's off. - Ah, I guess. - So something that we did growing up to get the TV to work... (fist thudding) (PC beeping) So it was a shot. (laughing) - It is now supposedly fine. By switching to HDMI, let's actually pull this monitor, 'cause the monitor's the only thing that's changed. If the monitor is enough to keep this entire system from posting. Just gonna find my inner zen right now. My inner Ryzen. - [Ken] So they plugged in a line from the PC to our TV over here just to see-- - Oh, not coming up, though. - [Ken] No? - Anything coming on that? I'm not getting the beeps anymore when we unplug the DisplayPort. Let's try HDMI with the integrated graphics. That's the only thing left. If this doesn't fix it, I'm literally at a loss for what happened. Something must've broken. - [Ken] All right, moment of truth. - I don't think this is gonna work. (PC chiming) Okay, goes straight to boot, pretends it's fine. Oh, are you (beep) serious right now? - Wow! - I don't understand how this monitor can keep the entire system from posting. Like, that, to me, is crazy. All right, just gonna drop this in slot one like it was before. So now, in theory-- (PC beeping) Oh, what? - [Ken] Moral of the story? - What is the moral of the story? The moral of the story is life is not fair sometimes, and there are just no answers to life's mysteries. Or I did something dumb and I don't know, but I can't imagine what did it, I can't. - [Ken] The moral of the story, if it ain't broke, don't fix it. - I swear, if that's the end of the video, I'm gonna be so mad. So, Ken, what do we have up right now? - [Ken] So, we're in Windows. We were in Windows. Okay, now we're in Windows again. So right now we're plugged into HDMI on the 2080 TI-- - GPU. It's literally set up the way it was. The issue the entire time had nothing to do with the computer. It was the display which kept it from posting and kept us from getting any signal. - [Ken] 'Cause this is a 1080 display over HDMI. That's 4K, no, so's this, so I think it's-- - So you're trying to tell me that the issue to our entire problem here is that our 2080 TI can't push a 4K signal? That's the whole problem? - [Ken] That's my theory. - That's a dumb theory. Well, why don't we do this before we do that? Why don't we take the DisplayPort and plug it into this monitor? - [Ken] Oh, there it is, oh. - System just restarted. - Oh. - What, why did... What? How is unplugging the DisplayPort-- (PC beeping) Hold on, hold on, hold on. Let me compose myself for a second. So the issue we're having right now is that if we plug anything DisplayPort in regardless of the display into the graphics card or the integrated graphics, our system no longer boots. I've never seen plugging a DisplayPort cable into a graphics card reboot a system. I cannot (grunting) imagine that. Do we have some weird cable shorting it? - [Ken] I mean, it's crazy because-- - No, no, I'm, no, no. - You're committed? - This will not stand. This will not stand. (rock music) - [Ken] Oh, it's on. - Wait, it was the cable? It was... SO the problem the entire time was that we had a long DisplayPort cable, and that was enough to kill the system. A DisplayPort cable? I'm gonna lose my (horn honking) mind. Are you-- - So, wait, so, if we plug in that cable (laughing) into here, will it work? - Yeah, I'm sure it will. I'm sure, 100% sure it will. - [Matt] In hindsight, I felt like we probably should tried that an hour ago. (Ken laughing) - (laughing) Thanks, Matt! I'm sure this is just gonna magically show up, okay. (Ken laughing) (Matt laughing) Let me see this cable. I'm actually really curious to see what kind of evil cable caused this many problems. It's a long DisplayPort cable, but I've never seen a cable cause this many issues. Here you go, you can take it and just, see how long it is, see? Look how far apart we are right now. This is enough to kill the system regardless of what graphics card we plugged it into, regardless of integrated graphics. - [Ken] It restarted the system! - We plugged this in and it restarts it! - [Ken] Here. - [Austin] Where did you put the cable?",
    "transcript_keywords": [
        "graphics",
        "system",
        "graphics card",
        "cable",
        "thing",
        "integrated graphics",
        "Wait",
        "put",
        "fine",
        "DisplayPort",
        "drive",
        "card",
        "entire",
        "DisplayPort cable",
        "hold",
        "Boi",
        "hard drive",
        "monitor",
        "RAM",
        "work"
    ],
    "transcript_entity_values": [
        "a few months ago",
        "last night",
        "Optane",
        "2001",
        "2080 TI",
        "CMOS",
        "Ken] Wait",
        "2070",
        "200 megahertz",
        "Blu-ray",
        "2080 TI-- - GPU",
        "1650",
        "1080",
        "first",
        "Windows",
        "RAM",
        "Amazon",
        "a couple days",
        "Core",
        "eight",
        "Ken",
        "the Old Boi PC",
        "a day later",
        "TI",
        "Austin",
        "ITX",
        "RGB",
        "Z390",
        "Home Depot",
        "Windows",
        "jank",
        "Matt",
        "100%",
        "4",
        "one",
        "9th",
        "second",
        "Time Spy",
        "Another day",
        "80 mil",
        "one terabyte",
        "16",
        "Intel",
        "about an hour",
        "DisplayPort",
        "VGA",
        "CPU",
        "PCI",
        "80 mil",
        "last year",
        "two days",
        "Target",
        "Ryzen",
        "six months ago",
        "2080",
        "an hour ago",
        "eight hours",
        "today",
        "First",
        "2080 TI",
        "2070",
        "December"
    ],
    "transcript_entity_types": [
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "FAC",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "TIME",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE"
    ],
    "vector": [
        0.0028255258221179247,
        -0.014421521686017513,
        0.09158874303102493,
        0.015263436362147331,
        0.05768050253391266,
        -0.11943457275629044,
        -0.007727653253823519,
        -0.0452643558382988,
        -0.07342610508203506,
        -0.019869353622198105,
        -0.04530702158808708,
        0.04503169655799866,
        0.0076287491247057915,
        -0.0010475418530404568,
        0.028048450127243996,
        0.028519386425614357,
        0.04885135591030121,
        -0.10184680670499802,
        -0.08168017864227295,
        0.016206830739974976,
        -0.07819632440805435,
        -0.030142126604914665,
        -0.07506678253412247,
        0.012637169100344181,
        0.00336753623560071,
        0.05435138940811157,
        0.10555010288953781,
        0.008283359929919243,
        -0.05996796861290932,
        0.0025383553002029657,
        -0.006675644312053919,
        0.008916809223592281,
        -0.042474761605262756,
        -0.026051877066493034,
        0.041296448558568954,
        0.003111199475824833,
        -0.008932082913815975,
        -0.08683658391237259,
        -0.02322029136121273,
        -0.1016610711812973,
        -0.0036606215871870518,
        0.029916061088442802,
        -0.01813347451388836,
        0.03769269213080406,
        0.040197961032390594,
        -0.001927139237523079,
        0.008492459543049335,
        -0.08614334464073181,
        0.03929971158504486,
        -0.01469531562179327,
        -0.017301684245467186,
        -0.0014229174703359604,
        0.04648897424340248,
        -0.024681275710463524,
        -0.045734405517578125,
        0.09113951772451401,
        0.02540331706404686,
        -0.08201803267002106,
        0.044019296765327454,
        -0.038926757872104645,
        0.08882099390029907,
        -0.08187133073806763,
        0.02946334332227707,
        0.0015303787076845765,
        0.04939448833465576,
        -0.028247160837054253,
        0.03661445155739784,
        0.011866351589560509,
        0.038131553679704666,
        0.05364105477929115,
        -0.0029831314459443092,
        0.058317337185144424,
        -0.01554116141051054,
        0.05021984875202179,
        0.027241449803113937,
        0.0025182480458170176,
        0.047066036611795425,
        -0.12752707302570343,
        0.03996532782912254,
        0.01099647767841816,
        0.06036613881587982,
        -0.003372302744537592,
        0.014717587269842625,
        -0.036005649715662,
        -0.01487742643803358,
        0.006306914612650871,
        0.10772683471441269,
        0.02344382181763649,
        0.06439197063446045,
        -0.054901231080293655,
        -0.015319758094847202,
        0.04776015132665634,
        0.13633717596530914,
        0.046055715531110764,
        0.062254805117845535,
        -0.018640384078025818,
        0.01477979589253664,
        -0.08500730246305466,
        -0.05313337221741676,
        0.032117802649736404,
        -0.01703900285065174,
        -0.02786518819630146,
        0.07171770185232162,
        0.013441300950944424,
        -0.03179903328418732,
        -0.04458574950695038,
        -0.11366081237792969,
        0.06931483000516891,
        -0.08551502972841263,
        -0.052061595022678375,
        -0.020682547241449356,
        0.028474655002355576,
        -0.02987436205148697,
        0.028810692951083183,
        0.07932901382446289,
        -0.04963550344109535,
        -0.04552973434329033,
        0.006323544308543205,
        0.03151329979300499,
        0.038456760346889496,
        0.021163824945688248,
        0.031222259625792503,
        0.002529653487727046,
        0.03705636039376259,
        0.11110662668943405,
        0.05277753248810768,
        -0.021053889766335487,
        2.6520216009596316e-33,
        0.07680380344390869,
        0.09066833555698395,
        -0.05900558829307556,
        0.01057023648172617,
        -0.0031144667882472277,
        0.020692694932222366,
        0.03237414360046387,
        0.05125082656741142,
        0.013672325760126114,
        0.07244201749563217,
        0.015496892854571342,
        0.04070352390408516,
        -0.016573503613471985,
        0.017815617844462395,
        0.06091533228754997,
        -0.08628643304109573,
        0.003269044915214181,
        0.06843598932027817,
        -0.09149089455604553,
        0.025914151221513748,
        0.009622348472476006,
        0.0012346975272521377,
        0.004404745530337095,
        -0.02064201980829239,
        -0.012438226491212845,
        -0.00347685138694942,
        0.012396201491355896,
        -0.020705055445432663,
        0.007719629909843206,
        -0.0020287937950342894,
        -0.010152592323720455,
        -0.02824391797184944,
        -0.009591888636350632,
        0.031006615608930588,
        -0.043186552822589874,
        -0.030589288100600243,
        -0.07634950429201126,
        -0.024228191003203392,
        0.023579277098178864,
        0.061734408140182495,
        -0.06431244313716888,
        0.07607731968164444,
        -0.007909104228019714,
        0.027474533766508102,
        -0.021054642274975777,
        0.021182376891374588,
        0.01139695756137371,
        -0.01427651196718216,
        -0.05601634830236435,
        0.0050676860846579075,
        -0.03911142796278,
        0.03587733581662178,
        0.06655895709991455,
        0.04490511864423752,
        -0.06761344522237778,
        -0.052293870598077774,
        0.10819968581199646,
        -0.03359709307551384,
        0.1399177461862564,
        0.03611704707145691,
        0.054814413189888,
        -0.004763377830386162,
        -0.04208996891975403,
        -0.030064662918448448,
        -0.11148461699485779,
        0.04773229360580444,
        0.07369150966405869,
        0.0051907640881836414,
        -0.060860104858875275,
        -0.05637118220329285,
        -0.005863329395651817,
        -0.0757635086774826,
        0.019064977765083313,
        -0.07978493720293045,
        0.06015632674098015,
        0.025223620235919952,
        -0.08502309769392014,
        -0.05805165693163872,
        -0.11874876916408539,
        -0.07014843821525574,
        0.02973564900457859,
        -0.014130896888673306,
        0.015641625970602036,
        0.009488632902503014,
        0.022262146696448326,
        -0.03171924129128456,
        -0.05990280956029892,
        0.016892878338694572,
        0.04816293716430664,
        0.013633979484438896,
        -0.07351890206336975,
        -0.03866477310657501,
        -0.007152426987886429,
        0.044116538017988205,
        0.03788837045431137,
        -1.591941877275884e-33,
        -0.016177628189325333,
        -0.11136133223772049,
        0.02150033414363861,
        0.026636792346835136,
        -0.04258592054247856,
        -0.041948672384023666,
        0.005057353060692549,
        0.008572034537792206,
        0.018217241391539574,
        -0.08123045414686203,
        0.028135200962424278,
        0.008387195877730846,
        -0.021550729870796204,
        -0.033077217638492584,
        -0.04200398176908493,
        -0.015099387615919113,
        0.03414878249168396,
        -0.02925903908908367,
        0.009607299230992794,
        -0.042384423315525055,
        0.028193391859531403,
        0.028402863070368767,
        -0.03638108819723129,
        -0.011200138367712498,
        -0.03135441988706589,
        0.07183101773262024,
        0.04648445174098015,
        0.013391719199717045,
        0.11361890286207199,
        0.04185973480343819,
        -8.560343849239871e-05,
        -0.00805053859949112,
        0.05188306048512459,
        0.08256132900714874,
        0.06240438297390938,
        0.08472657948732376,
        0.04741247743368149,
        0.02940979041159153,
        -0.01851750910282135,
        -0.0810917392373085,
        0.04820768162608147,
        0.06717660278081894,
        0.022721610963344574,
        0.09590906649827957,
        -0.02963964454829693,
        0.006025856360793114,
        0.002753290580585599,
        -0.0991479679942131,
        -0.008978614583611488,
        0.0710512027144432,
        0.021256469190120697,
        -0.049468543380498886,
        0.053008485585451126,
        -0.019209571182727814,
        -0.019149957224726677,
        -0.12356456369161606,
        -0.025178641080856323,
        0.013361596502363682,
        0.007103698328137398,
        -0.07112820446491241,
        0.05612523481249809,
        0.013709118589758873,
        0.04038261994719505,
        -0.02917560562491417,
        0.014069052413105965,
        -0.03665461763739586,
        0.08030075579881668,
        -0.0037867489736527205,
        0.05811426788568497,
        -0.03318668529391289,
        -0.03573755547404289,
        0.011106369085609913,
        -0.05718252807855606,
        -0.06594226509332657,
        0.05487788841128349,
        0.06156349182128906,
        0.004364758729934692,
        -0.02331417240202427,
        0.026434192433953285,
        -0.02178473398089409,
        -0.05327869579195976,
        -0.06012309342622757,
        0.00036255334271118045,
        0.02398093231022358,
        0.10825605690479279,
        -0.022453168407082558,
        -0.023588450625538826,
        0.00695704435929656,
        -0.00756928650662303,
        -0.05636487528681755,
        -0.020506607368588448,
        0.011047672480344772,
        0.0011490731267258525,
        0.024251321330666542,
        0.025032557547092438,
        -5.4426767093218587e-08,
        0.0536356121301651,
        -0.06875501573085785,
        -0.0020152227953076363,
        0.09627243876457214,
        0.03855171054601669,
        -0.06180480122566223,
        0.02471739985048771,
        0.03492695465683937,
        0.07525257021188736,
        -0.03566734492778778,
        0.0018250126158818603,
        -0.019108178094029427,
        0.06538058072328568,
        -0.030966436490416527,
        -0.016698580235242844,
        -0.01204611361026764,
        -0.05042462423443794,
        0.028168166056275368,
        -0.03642698749899864,
        -0.07356073707342148,
        -0.021792564541101456,
        -0.0029143239371478558,
        0.12275804579257965,
        -0.0486072413623333,
        0.03077959269285202,
        0.042066168040037155,
        0.03771159052848816,
        0.029115820303559303,
        0.05240955948829651,
        -0.00917060673236847,
        -0.10836850851774216,
        -0.0581466369330883,
        -0.03119528479874134,
        -0.04293767735362053,
        0.028683127835392952,
        -0.04881403222680092,
        0.05094495043158531,
        0.09293004125356674,
        0.04812401160597801,
        -0.017781849950551987,
        -0.0600602924823761,
        -0.09825024753808975,
        -0.049242645502090454,
        -0.0005149627686478198,
        0.008811487816274166,
        -0.06091676652431488,
        -0.1227794662117958,
        -0.04335226118564606,
        0.06570880860090256,
        -0.0021635284647345543,
        -0.005385497119277716,
        0.01529178861528635,
        -0.015734504908323288,
        0.07383275777101517,
        0.006467027589678764,
        -0.07577088475227356,
        -0.03689328208565712,
        0.06515073031187057,
        0.09762894362211227,
        0.09493740648031235,
        0.03543926402926445,
        -0.10137207806110382,
        -0.14107480645179749,
        0.008504408411681652
    ]
}