{
    "id": "ULYHJ5bnBFY",
    "title": "Are the 2019 MacBooks Worth It?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2019-07-12T22:01:42Z",
    "video_url": "https://www.youtube.com/watch?v=ULYHJ5bnBFY",
    "category": "Science & Technology",
    "tags": [
        "macbook",
        "macbook pro 2019",
        "macbook pro",
        "macbook air 2019",
        "macbook air",
        "apple",
        "macbook pro 13 inch",
        "macbook air review",
        "apple macbook",
        "apple macbook air",
        "apple macbook pro",
        "new macbook pro",
        "new macbook air",
        "2019 macbook pro",
        "touch bar",
        "review",
        "laptop",
        "tech",
        "2019 macbook air",
        "best laptop 2019",
        "macos",
        "macbook 2019",
        "this is",
        "is it worth it",
        "why does this exist",
        "austin evans"
    ],
    "views": 853944,
    "likes": 18529,
    "comments_count": 1661,
    "description": "The cheaper MacBook Air 2019 on Amazon:  Apple's new 2019 base MacBook Pro 13\" on Amazon:  The higher end 4 port MacBook Pro 13\" on Amazon:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Check out our new channel!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/mbair19",
        "http://austin.tech/mbp2port",
        "http://austin.tech/mbp4port",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. Here is something I did not expect to say. Today, Apple has not only made their cheapest MacBook better, but they've also cut the price. (electronic music) There was a time, not all that long ago, that Apple was the undisputed leader in laptops. Now, their touchpads are still the top of the class, but even 10 years ago the MacBook had a better touchpad than a lot of PC's today. Think back to the original MacBook Air, it was so ahead of its time. Now, sure, today we take thin and light laptops for granted, but it by far the first Ultrabook and that was years before that became a normal thing on the PC side. But when it comes to the Mac today, Well, it's complicated. So one one hand we have systems such as the Mac Mini as well as the iMac Pro, which are pretty solid packages. We even have things like the Mac Pro coming out, which while it is incredibly expensive, looks like a monster. Just a very expensive monster. On the laptop side though, I love the build and the form factor of the current generation MacBook Pro, but the issue here is that it just can't keep up on the performance side. There are serious throttling issues, especially when you get up to the 15\" with that Core I9. I mean yeah, it sounds like a great idea. But the issue is that it barely is able to keep up with the base clock speeds while stock, and as soon as you start uploading any kind of graphics workload, the entire performance suffers. It's a good machine and it is about as good as you can expect for something that's this thin. But it just can't keep up with Window's laptops with similar specs. Then there's the keyboard. So I've actually been fairly fortunate with it. So I've been using a MacBook Pro since 2016 as my work laptop, and I've only had one single issue with a sticky key. But a lot of people such as Dave as well as Lou, have had much much bigger issues with keys double pressing, not working at all. I mean, very quickly some of these keyboards have been completely useless. And the problem is that if you do have something like this, it's not as simple as blowing it out with some compressed air. I mean the keyboard is straight up useless, and requires a very, very expensive repair. Which up until fairly recently, was something that you usually had to pay for. Now it did take Apple a while to respond to this however, they have redesigned the keypad actually a couple of times on these MacBooks. So, theoretically the version in this new MacBook Pro as well as the new Air, is better, but still. Not exactly reassuring when you spend well over $1000 on a laptop, and something like a broken key means that you need a $800 repair. That's just not a good look. But today we have some upgrades to check out. And that starts with the MacBook Air. It just got a much needed redesign late last year. However today, we also see price cuts go along with that. It goes from $1200 down to $1100. Now it's not $999 like the old MacBook Air. Which by the way as of today is now discontinued. So you have to go with the Retina guy. But there are some very very minor upgrades with this new version. So first of all, it does add a true tone display. Cool, I guess. It also does have that updated keyboard, which theoretically should be a little bit more durable. Now time will tell whether this keyboard is actually better. So there's only been a few months since this keyboard went out into the wild with the 15\" MacBook Pro, but the good thing is unlike in the past where you had to pay for a very expensive upgrade to kind of repair the entire thing, instead now Apple does cover you for four years from when the MacBook comes out. So even if you buy one of these Airs today, you know that you'll be covered for quite a while if you do have any keyboard issues. What we've also seen is the death of the 12\" MacBook. Man, this is such a weird tiny little laptop. Well, I guess we did ask why it existed. And they killed it. - Just like when we asked, \"Why does the iPod still exist?\" And they killed that, like right after. This came out back in 2015 and it was absolutely tiny. At a time when a MacBook air was way out of date, this is something which is significantly smaller and it also included the retina display, it had the interesting butterfly keyboard. Which of course has been a little bit of a problem over the years. But this legitimately was way ahead of its time. And even today, I still feel like this is my favorite ultra portable hardware that I've ever used on a laptop. So tiny, so lightweight, but there are, of course, some sacrifices that had to be made. With only a single USB C Port, there was a lot of shall we say, complaining on the internet? I may have done some of this complaining myself. But the issue here was two fold. First of all, having only one port on the laptop meant that you couldn't charge and use anything else at the same time unless you were using a dongle, sort of a big deal. But on the top of that, this is really the first laptop or one of the first devices straight up that used USB C. Now today, it's actually fairly ubiquitous, it's not that hard to get a lot of accessories. But back in 2015 when this first came out, USB C was pretty much nowhere. Which meant that you had very limited options to do anything besides charge your MacBook, and use like one Apple Dongle, which was $80 bucks and it was very, very limited. Yeah, you still have to deal with a dongle. And yes, I still wish this did have multiple ports, but I've gotta say, I'm actually kind of a little bit sad to see the 12\" MacBook go. Rest in peace little guy. As far as I'm concerned though, the most interesting new Mac is the MacBook Pro 13\". Now previously, there were two versions of this laptop. The base model which did not have a touch bar, started at $1300, and the model with the touch bar was $1800. That $500 worth of savings sounds like a big deal, but you lost a lot for it. So first of all, not only do you go down from four thunderbolt ports to two, but of course you loose the touch bar and with it the T2 chip as well as touch id. And on top of that, you had an older dual core processor, instead of a much faster quad core chip in the higher end model. Very clear decision, the lower end model was pretty much worst across the board. However, as of today, that's really not the case. Now at the same $1300 price, you can buy this. So this is the new base model of the 13\" MacBook. And it takes everything that was great about the previous version, and adds the touch bar. Which, is not the biggest deal in the world. But with the touch bar we get not only touch id, but also that T2 chip, and importantly, we also upgrade to a quad core processor. Really the most obvious sort of downside to this guy, is that we are still limited to two thunderbolt three ports. But honestly, I think that's a pretty reasonable trade off considering that this is a full $500 cheaper than the higher end model. Now I know it doesn't sound like a big deal, but they T2 chip actually does make a pretty big difference to these MacBooks. Not only does it speed up things such as video and coding with things like H265. John did a great video talking about just how powerful this is for editing. For most people though, the jump to a quad core processor is really where the sweet spot happens. Now previously the dual core was fine for basic use, but this is a MacBook Pro after all. So if you start doing, especially photo and really when it comes to video editing, it started to fall down a little bit right? But now with the quad core processor and the pretty decent Iris graphics, this is straight up a system that you can use for real pro work. At least within reason for a 13\" laptop. What's really interesting is that now when you look at the base two port model versus the four port model, that $500 difference seems like a decent thing on paper. So this model does have a slower processor clocked at 1.4 gigahertz compared to 2.4 on the higher model the both quad core. But as soon as I actually started getting into this, I realized that's actually not really accurate. So, if you look at the model number it's almost the exact same on this Core I5, and when you start running it through benchmarks, the performance is nearly identical. Really, the only place that I saw any significant difference was it's a little bit slower in multi thread, especially in bigger applications such as Cinebench, but even though it looks like a huge difference on paper, this, for almost all intensive purposes has the same performance as that much more expensive Macbook. Don't let that spec fool you. All of this begs the question of which Macbook makes sense in 2019? With the 12\" no longer in the picture, it really does come down, at least on the lower end, to the 13\" Macbook Pro, or the 13\" Macbook Air. And something important to know is that the two laptops are very, very similar. If you look from a lot of angles, they look almost identical right? The screens are the same size and resolution. You've got the same keyboard, you have the same touchpads, same speakers, I mean these footprints are essentially identical here. Really, the main advantages to the Macbook Air is that it's a little bit cheaper, and it is very, very slightly thinner. For $200 less, you're getting only a dual core processor, which is a lower wattage than what you're finding on the quad core chip with the Macbook Pro. The main difference is just that performance. So many other aspects of these systems are identical, that it comes down to whether or not you actually need it. Now, as far as I'm concerned, if you're doing anything more than like light web browsing, the Mac quad core processor is going to make a difference, especially as time goes on. This just feels a little bit slow right now, and it's certainly not going to feel as snappy three, five, seven years from now, as the Pro does. When it comes to picking between the Pros, I mean sure the higher end version does come with a little bit more storage, as well as two extra thunderbolt ports, but beyond that there's still a minimum of a $300 price difference. As far as I'm concerned, that is incredibly hard to justify. Yeah, more ports is nice, but is it $300 nice? These updates don't fix the Macbook line, but it's nice to see them get a little bit cheaper, a little bit better, and importantly, Apple's getting a little bit closer to being on top of their game. Honestly, it's been a long time since I've been able to say that the Macbook line makes sense, but today it's actually pretty balanced. (electronic music)",
    "transcript_keywords": [
        "MacBook Pro",
        "MacBook",
        "MacBook Air",
        "Pro",
        "Core",
        "Today",
        "quad core",
        "Air",
        "bit",
        "core processor",
        "model",
        "laptop",
        "quad core processor",
        "Apple",
        "Mac",
        "keyboard",
        "time",
        "Mac Pro",
        "generation MacBook Pro",
        "Mac quad core"
    ],
    "transcript_entity_values": [
        "15",
        "the Macbook Pro",
        "MacBook",
        "first",
        "four years",
        "2015",
        "USB C",
        "two",
        "four",
        "five",
        "1300",
        "one",
        "500",
        "well over $1000",
        "Core I9",
        "MacBook Air",
        "Iris",
        "the Macbook Air",
        "only one",
        "T2",
        "MacBook",
        "Austin",
        "1.4 gigahertz",
        "2016",
        "the MacBook Pro 13",
        "Apple Dongle",
        "Macbook",
        "John",
        "Macbook Pro",
        "the iMac Pro",
        "2.4",
        "today",
        "13",
        "1200",
        "1800",
        "late last year",
        "800",
        "a few months",
        "USB C Port",
        "Macbook Air",
        "Air",
        "the Mac Mini",
        "300",
        "Apple",
        "Dave",
        "MacBook",
        "the years",
        "10 years ago",
        "years",
        "Macbook",
        "the MacBook Air",
        "MacBook Pro",
        "200",
        "seven years from now",
        "iPod",
        "Mac",
        "First",
        "keypad",
        "MacBooks",
        "three",
        "2019",
        "Window",
        "this Core I5",
        "USB C. Now",
        "Ultrabook",
        "Retina",
        "12",
        "Today",
        "Airs",
        "$80 bucks",
        "Lou",
        "Pros",
        "Mac",
        "a MacBook Pro",
        "Cinebench",
        "MacBook Pro",
        "999",
        "1100"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "FAC",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "FAC",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "FAC",
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "MONEY",
        "MONEY"
    ],
    "vector": [
        -0.012747359462082386,
        -0.06924313306808472,
        0.049725502729415894,
        0.004630118142813444,
        0.0605107918381691,
        -0.0021392740309238434,
        -0.039733342826366425,
        0.07950189709663391,
        0.043366461992263794,
        0.020271578803658485,
        0.09222331643104553,
        0.08115869760513306,
        0.043632980436086655,
        -0.06483323872089386,
        0.07868187129497528,
        0.0546635165810585,
        0.038345206528902054,
        -0.11869272589683533,
        -0.0375107005238533,
        0.018322451040148735,
        -0.06774065643548965,
        0.010629961267113686,
        -0.011655834503471851,
        -0.02213851362466812,
        -0.0023061982356011868,
        0.03591709956526756,
        0.026252567768096924,
        -0.09602700173854828,
        -0.05633365735411644,
        0.04494062066078186,
        -0.029004156589508057,
        0.06467258930206299,
        0.018416959792375565,
        -0.0045030731707811356,
        0.038025710731744766,
        -0.092082679271698,
        0.07297045737504959,
        -0.04929365962743759,
        -0.043325044214725494,
        -0.08300193399190903,
        -0.05573396384716034,
        -0.04084691405296326,
        0.08354892581701279,
        0.05407506227493286,
        0.03130291774868965,
        -0.06152796745300293,
        0.05785765126347542,
        -0.015623827464878559,
        0.08560219407081604,
        0.024530716240406036,
        0.018384095281362534,
        -0.11129549145698547,
        0.08207142353057861,
        -0.05655665695667267,
        0.03679822385311127,
        0.06704550236463547,
        -0.02399001270532608,
        -0.033925678580999374,
        0.06558597832918167,
        0.007911636494100094,
        0.02063109166920185,
        -0.08142899721860886,
        -0.03348034992814064,
        -0.0091902706772089,
        0.06718602776527405,
        -0.072323277592659,
        0.038961686193943024,
        -0.05632294341921806,
        0.0008857616339810193,
        0.03251893073320389,
        0.020150788128376007,
        0.00344126857817173,
        0.04103565588593483,
        0.0475122407078743,
        0.0024688916746526957,
        0.002789671765640378,
        0.05489319935441017,
        -0.038216482847929,
        0.004414325580000877,
        0.038991529494524,
        -0.028801731765270233,
        -0.05539397895336151,
        -0.00740504264831543,
        -0.06175971403717995,
        -0.02739919349551201,
        -0.08664441108703613,
        0.041870489716529846,
        -0.057758625596761703,
        -0.014173407107591629,
        0.03650347888469696,
        0.09223519265651703,
        0.03428087383508682,
        -0.012641037814319134,
        -0.01654531992971897,
        -0.027301399037241936,
        -0.05306147038936615,
        0.003356318920850754,
        0.04138919711112976,
        -0.014264946803450584,
        -0.013656454160809517,
        0.007423850707709789,
        0.0823611468076706,
        0.09333387762308121,
        -0.07735029608011246,
        0.0237582977861166,
        -0.06736886501312256,
        0.030862906947731972,
        0.027567625045776367,
        -0.008522741496562958,
        0.06982764601707458,
        0.008426671847701073,
        -0.06691495329141617,
        -0.10809116810560226,
        0.049944136291742325,
        0.010912211611866951,
        -0.003815265605226159,
        0.012445555999875069,
        0.00687102135270834,
        0.06384146213531494,
        0.04618579149246216,
        0.018766656517982483,
        0.017735555768013,
        0.0020125824958086014,
        0.00988815724849701,
        -0.0051265498623251915,
        -0.02709544636309147,
        -0.03855367377400398,
        3.082415816872758e-33,
        -0.033941540867090225,
        0.032800961285829544,
        -0.031465157866477966,
        -0.10318436473608017,
        -0.02387365885078907,
        -0.07887902110815048,
        0.014412671327590942,
        -0.007502052001655102,
        0.00257269199937582,
        0.0012596072629094124,
        -0.07154661417007446,
        0.0017971460474655032,
        -0.05294245108962059,
        6.127174128778279e-05,
        0.1202763170003891,
        -0.04559320583939552,
        -0.11365506052970886,
        -0.06139686703681946,
        -0.0249188095331192,
        0.06401637196540833,
        0.007665444631129503,
        0.022303959354758263,
        0.04014986753463745,
        -0.06898248940706253,
        -0.05394592881202698,
        -0.039282482117414474,
        0.01974661462008953,
        0.007982752285897732,
        -0.018976520746946335,
        0.013024658896028996,
        -0.08842287212610245,
        -0.0332278236746788,
        -0.02148502506315708,
        -0.06582489609718323,
        -0.08575307577848434,
        0.02339547500014305,
        0.04421863704919815,
        -0.0831761583685875,
        0.06799311190843582,
        -0.03455522656440735,
        -0.12524597346782684,
        0.044709205627441406,
        -0.021148359403014183,
        -0.02876115031540394,
        0.10841131955385208,
        0.016532301902770996,
        -0.007629051338881254,
        0.041072167456150055,
        -0.03409996256232262,
        -0.027145713567733765,
        -0.110330730676651,
        -0.016384374350309372,
        0.04244391992688179,
        0.0024171972181648016,
        -0.048027154058218,
        -0.019250985234975815,
        -0.020231805741786957,
        0.01332339458167553,
        0.0700795128941536,
        0.09741686284542084,
        0.025774257257580757,
        0.004686173051595688,
        0.0010193884372711182,
        0.017072318121790886,
        -0.046740591526031494,
        0.08097167313098907,
        0.11193117499351501,
        0.04867885261774063,
        -0.043590765446424484,
        0.05208825692534447,
        -0.02972821146249771,
        -0.0653979480266571,
        0.0044219051487743855,
        -0.08311602473258972,
        0.03415363281965256,
        -0.03989250957965851,
        -0.02496255561709404,
        -0.03653759881854057,
        -0.02555142343044281,
        0.01980622112751007,
        0.021266143769025803,
        0.07599835842847824,
        0.05622774362564087,
        0.034543633460998535,
        0.0020769499242305756,
        0.1080705001950264,
        0.027535773813724518,
        0.019785821437835693,
        -0.01379590854048729,
        -0.004284991417080164,
        0.00438753142952919,
        0.03433898463845253,
        -0.0653185173869133,
        0.004092238377779722,
        0.009400068782269955,
        -4.6664998817553795e-33,
        0.032921962440013885,
        0.005232508759945631,
        -0.007398971822112799,
        0.07104909420013428,
        -0.04386848956346512,
        -0.011664909310638905,
        -0.010463769547641277,
        0.029850488528609276,
        -0.08666609972715378,
        -0.07692363858222961,
        0.004304577596485615,
        0.06931179016828537,
        -0.06604602932929993,
        -0.04419788345694542,
        0.0035302299074828625,
        -0.002210794948041439,
        -0.1002626046538353,
        -0.06174234673380852,
        0.0013972929446026683,
        -0.12731686234474182,
        0.05549861863255501,
        0.031115956604480743,
        0.03350919112563133,
        -0.029646508395671844,
        -0.09883930534124374,
        -0.03646606206893921,
        -0.04185004532337189,
        0.010443025268614292,
        -0.04577263072133064,
        -0.007841979153454304,
        -0.024017656221985817,
        0.035097263753414154,
        0.0828605592250824,
        0.010371457785367966,
        0.0917075127363205,
        0.026878876611590385,
        -0.012770279310643673,
        0.02260664850473404,
        0.04083254933357239,
        0.06948145478963852,
        0.02768576331436634,
        0.04733225330710411,
        0.0001984187838388607,
        -0.011124420911073685,
        0.055742617696523666,
        0.025754297152161598,
        -0.03951585292816162,
        0.005425319075584412,
        0.06907746195793152,
        -0.05198018252849579,
        0.02867267094552517,
        0.0216186735779047,
        0.01288920734077692,
        -0.003478563856333494,
        -0.032675813883543015,
        -0.07816262543201447,
        -0.019151177257299423,
        0.02447255700826645,
        0.052575644105672836,
        0.031465038657188416,
        -0.06279955059289932,
        0.013488276861608028,
        0.01520452555269003,
        -0.05317726731300354,
        0.02199385315179825,
        -0.004778299946337938,
        0.040465038269758224,
        0.01920044608414173,
        0.035835642367601395,
        0.01387039478868246,
        -0.027201760560274124,
        -0.030885349959135056,
        -0.06309547275304794,
        -0.07565805315971375,
        -0.024566613137722015,
        0.10242410749197006,
        0.06524211913347244,
        -0.025768475607037544,
        -0.05160501226782799,
        0.02376806177198887,
        0.008398921228945255,
        0.08041877299547195,
        0.012736013159155846,
        -0.011270556598901749,
        0.010304919444024563,
        0.06569606065750122,
        0.04022299870848656,
        -0.06804197281599045,
        -0.11072240769863129,
        0.07490862905979156,
        -0.028358062729239464,
        -0.07602519541978836,
        -0.0327000617980957,
        0.003190927905961871,
        -0.08164379745721817,
        -5.025996330232374e-08,
        0.0012910078512504697,
        0.015861069783568382,
        0.06965841352939606,
        0.05780146270990372,
        0.01637362502515316,
        0.017454974353313446,
        0.04204867035150528,
        0.057253312319517136,
        0.03924551233649254,
        0.10933711379766464,
        0.04843158647418022,
        -0.07861900329589844,
        -0.040674373507499695,
        0.044928207993507385,
        0.03160427510738373,
        0.09110656380653381,
        -0.06360458582639694,
        0.06448639929294586,
        -0.03339570015668869,
        -0.02535354532301426,
        0.04375852644443512,
        0.04923899844288826,
        0.05213947594165802,
        0.0047735837288200855,
        -0.014547712169587612,
        0.056991979479789734,
        -0.07614161819219589,
        0.034244339913129807,
        -0.022145645692944527,
        0.0322587713599205,
        -0.06448113918304443,
        -0.05818943306803703,
        -0.004749272018671036,
        0.006317915394902229,
        -0.004136576782912016,
        -0.12326991558074951,
        -0.0626603215932846,
        0.00751921022310853,
        0.011076146736741066,
        0.0478641539812088,
        -0.06830623745918274,
        -0.07621333003044128,
        -0.09005047380924225,
        -0.007494378834962845,
        0.05174748972058296,
        -0.042317792773246765,
        -0.08152806758880615,
        0.03997322916984558,
        -0.07632484287023544,
        0.05935767665505409,
        0.01898520439863205,
        -0.029920250177383423,
        0.022268563508987427,
        0.0005424574483186007,
        -0.02985847182571888,
        0.016432151198387146,
        -0.02373414859175682,
        -0.015100468881428242,
        -0.0903085395693779,
        0.04459649696946144,
        0.0796632170677185,
        -0.10816023498773575,
        -0.011849742382764816,
        0.09158216416835785
    ]
}