{
    "id": "uNP5o8dLja4",
    "title": "I've Driven my Rivian 1500 Miles! - And something already broken...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-05-31T15:59:49Z",
    "video_url": "https://www.youtube.com/watch?v=uNP5o8dLja4",
    "category": "Howto & Style",
    "tags": [
        "Rivian r1t",
        "rivian",
        "rivian review",
        "electric truck",
        "cybertruck",
        "ev",
        "electric vehicle",
        "best electric vehicle",
        "tesla",
        "ford lightning",
        "R1T",
        "owners review",
        "rivian truck",
        "hummer EV"
    ],
    "views": 3189560,
    "likes": 90072,
    "comments_count": 6371,
    "description": "Its time to see how the Rivian Holds up with daily use and trucky situations... Get a free shaker from HUEL here:  Huge thanks to Huel for sponsoring this video.  I'm a huge fan of electric vehicles - and ive been looking forward to this Rivian R1T for the past 3 years. How does it hold up after 2 months of doing real world truck stuff though? Today we find out. Unfortunately something is already broken...   Get 6 Months of free charging on the Rivian Adventure Network HERE:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://jlinks.io/jerryrigeverything",
        "https://www.rivian.com/configurations/list?reprCode=ZACK1594426",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "It is now time for the 1,500 mile update on my Rivian R1T that I got two months ago. The honeymoon period is still here but on its way out. And there's some things that I need to mention, not all of which are positive. I have a few suggestions for Rivian, as well as we have to talk about the thing that's already broken. But like all of my other Rivian videos, we're going to film this one on top of a mountain. Let's get started. [Intro] [Music playing] And just like that, once again we are back on the mountain. Fifteen hundred miles is quite a lot. It's enough to kind of break the truck in, and get a feel for how the tool handles in everyday life. Because a truck definitely is a tool. And I haven't just been driving this, I've been doing all kinds of trucky things like taking 1,000 pounds of off-road tire liners to our new warehouse. Took a literal truckload of cardboard to the recycling bin. These are some of the boxes my Jerry Rig Everything Knives come in. Link down in the description. I also dropped off some massive wooden tables. These, as well, are for the new warehouse, which I'll talk about in a different video. I brought home one and a half yards of dirt for our planter boxes, cuz, you know, trucks are supposed to get dirty. And a little bit of dirt never hurt nobody. I even transported an 800 pound mechanical horse that my wife bought. Happy wife, happy life. I don't ask a whole lot of questions. And speaking of horses, in the last two months I did tow a 5,000 pound horse trailer about 80 miles. The towing hitch is built underneath the truck and has an aerodynamic covering, If you remember from my EV Humvee video, aerodynamics is a huge factor when it comes to range. At about 50-60 miles per hour, the vehicle is using more energy just fighting the wind than it is propelling itself forward. Which is why most EV's have super aerodynamic bodies the Rivian is no exception. The rearview cameras made lining up the hitch to the horse trailer pretty simple. And then I can put the truck in towing mode which is where we find the adjustable brake gain. The trailer brake gain changes how much work the trailer brakes are doing so your truck isn't trying to slow down the whole load by itself. That would be sketchy, especially if we're maxing out the Rivian's towing capacity at 11,000 pounds. As soon as I put it in towing mode the range does decrease to a realistic estimate of how far I can go with the load behind me, dropping my distance by about half. So we drove around for about one mile and it looks like it's already recalculated our range giving us a little bit more, and it says that when we arrive it is a 78 mile tow, one hour and twenty two minutes, and we'll have 84 miles when we get there. It's interesting that it's already preemptively planning for the less range while we have so much weight behind us. Now let's see how that calculates in real life. We towed the horse trailer for about 78 miles, most of which were freeway or canyon miles which is a bit less than half of what Rivian can total tow. However, while the trailer is behind me, it did feel effortless. Accelerating onto the freeway still felt like I was driving a sports car, even with the extra 5,000 pounds. Remember, there's a video on YouTube of a Rivian racing a Ford Raptor while towing a 6,000 pound trailer and still winning. So the performance is pretty incredible, but overall decreased our range by about half. So if you do plan on towing 5,000 pounds more than 100 or 150 miles every single day, just plan on stopping to charge a little more often. But towing that much for that long is definitely not a normal scenario for the vast majority of people. The nice thing though is that we only used about $7 in electricity for the whole trip. And a bonus of towing with an electric vehicle is that we used the regenerative braking to slow the trailer down instead of using the brakes and rotors and calipers. Taking that extra weight and putting it back into the battery instead of having wear and tear on our hardware. Science is pretty cool. There's also a super icy morning that you might find interesting. If you remember, the door handles recess into the truck to improve aerodynamics, but that also means that ice can form over the door handles when it's winter, which you would think might lock the truck shut until springtime, but the handles do rock back and forth allowing the ice to be broken so it's not too big of a deal. Overall it's been a pretty good experience. Rivian hasn't left me with much to complain about, but I do have some suggestions...plus we gotta point out that thing that broke. And I'm not just talking about the windshield, which did crack from a rock chip on my second day of owning it. But that can happen to any vehicle. The Rivian's windshield does cost $1600 to replace and my insurance wants me to pay $1,000 of that as a deductible. And it seems rather excessive for a piece of glass, so I just filled the crack with resin for about $50 which stopped the spread and reduced the crack's appearance, and we're just going to leave it for now. One thing I haven't done yet, before we get to the negatives, is I've never used the exterior power outlets on this thing. I am a bit disappointed that we don't have the 240 volts for rescuing other EV's or welding, like we see on the Ford F150, but this does have 4 regular power outlets, two of which are in the bed. Plenty of juice to boil some water and try out some yellow coconut curry from our video sponsor, Huel. Eating right is one of the hardest parts of staying healthy. Like do I cook some vegetables, or do I eat an entire sleeve of Oreo's? Decisions, decisions. Too many times I've turned to the Oreo's just for convenience. Huel, though, helps by making nutritionally complete, convenient, affordable food super accessible. There's no tricks or fads, just balanced plant based foods packaged with 27 vitamins and minerals, ready in just minutes. They're high in proteins, low in carbs, with not a lot of sugar. And no artificial sweeteners. With plenty of options great for breakfast, lunch, or dinner. Huel comes in a variety of flavors. This is the yellow coconut curry. It definitely tastes healthy, but it's still one of my favorites. It's actually pretty good. If you're not after a warm meal, or just need something even quicker, Huel also has shakes where all you have to do is add water. It's also super quick, easy, with 27 essential vitamins and minerals, and 40 grams of protein. You'll also get a free shaker bottle with your first order with the link down in the description. Plus, it has a 13 month shelf life, meaning it will last quite a bit longer than the bananas on your counter. I'll leave a link down in the description. And thanks to Huel for sponsoring this video. Now let's get to the nitty gritty. After driving this truck for two months, I have 6 mild inconveniences that have come to my attention. Don't get me wrong, it's a great truck, but there is always room for improvement. The first of which is the cameras. The Rivian R1T does have exterior security cameras that can tick on if someone is getting too close to the truck. Rivian calls it Gearguard. There are 11 cameras surrounding the outside, but there's nothing recording while driving. My wife's Model X uses the exterior cameras to act as a dash cam, which I think is almost more important than using the cameras while it's parked. My mom has a Model Y and she even had to use the dash cam footage once when someone hit her while she was driving. And I'm no expert on the statistics but I feel like more accidents happen while you're moving. So hopefully Rivian does allow us to use the exterior cameras as dash cams in the future. Which could happen with an over-the-air update. The second thing I would like to see updated is the dashboard. We need to see a little bit more information. Rivian has a cute little graph over on the side that lets you know how efficient you're driving, which is great. But, when driving downhill the graph goes entirely green and becomes entirely unhelpful. And I might be stereotyping here, but I feel like truck guys and sports car guys are good with numbers and can handle the information. And since this truck is a sports car hybrid, having more information available would be pretty awesome. Rivian is going for a minimal aesthetic, and out of all of the electric trucks, Rivian is my favorite. But they have my least favorite display. I think Hummer is a good example of going overkill with the available information, which isn't a bad thing. It does feel like you're driving in a video game. But Fort and the F150 Lightning are a bit more realistic, with coolant and motor temperature graphics, along with side regen and how much torque the dual motors are putting out. Even Tesla has more information on their graph with the watt hours along with the acceleration and regen inside the Model X. I think Rivian should either add some numbers to their graph or add an entire stats for nerds page next to the driving modes so we can numerically see what this truck is capable of. Amps, volts, watt hours, how much torque is coming from each of the quad motors. This truck has an insane amount of power and it doesn't have to be front and center. We don't want to confuse grandma, but at the same time I know Rivian has all that information in their truck somewhere and it would just be cool if we could access it. I know I'm not the only person interested in the numbers. As of now, the numberless graph and the quarter-sized regen bar are just meaningless fluff. The third thing is something that kind of only pertains to me. I did put it in a preorder for this truck about 3 years ago, and when you order the truck they ship the accessories separately. Like the roof rack, as well as the rubber mats that go inside of the cab. And they sent that to my 3 year old address that I don't live at anymore. So they were a bit hard to get to, but at least they got the truck in the right spot. Also, the roof racks do make a considerable amount of noise over 70 miles an hour and so I will be taking those off and just leaving them on a shelf in my garage until I actually need them. The fourth thing is I can't actually drive the truck with the door open, and I didn't realize how often I do this. But when I'm connecting to a trailer or backing up to a loading dock I usually crack open the door so I can make sure I'm not hitting anything. And Rivian just will not let you drive if any of the doors are open. Which brings me to the 5h thing: the doors are actually pretty hard to close. Anytime that I've had anybody jump in the truck to give them a test ride, I usually have to tell them to re-shut their door because it hasn't closed all the way. It takes an above average amount of force to close these doors. And I'm sure it has to do something with the sound proofing, since the truck is more quiet there is more soundproofing for anything that opens. But it is definitely still a minor inconvenience and makes the list. And lastly, before we get to the thing that broke, the 6th thing is that the truck will constantly adjust itself at stoplights. I'll be...because it has air suspension on each of the 4 tires, and it can adjust anywhere from 9 inches to 15. And even though I'm not adjusting between modes, it'll, like, settle itself which is a little unnerving and discombobulating when you're not expecting your truck to be moving underneath you. Usually it's just one of the shocks that will raise and lower an inch, but it's mildly inconvenient enough that it makes the list. Which finally brings us to the thing that is absolutely broken on this truck and I kind of thought that it would break from the very first time I used it. But it's this truck cover right here. It opens fine, but when it comes time to close it....that. Something has caught inside of the gear mechanism and won't allow it to close, leaving a foot of it exposed over my truck bed. This happened after recycling the cardboard, but before putting a bunch of dirt in the back. So it wasn't the dirt. It's definitely not something I'm going to lose sleep over, but it did break during the first 1,500 miles of driving so it makes the video. So far, after the first 1,500 miles these are all pretty minor things. It is a very expensive truck so it's held to a little higher bar than I would normally. But I also run my own off-road wheelchair business where I interact with customers on a daily basis and I know on a much smaller scale how difficult production can be. I'm still mind blown that people can accomplish something this complex. [Whistles] One of the perks of being an electric vehicle is that nature's not scared of them. We're so quiet, or sneaky. Out of all the trucks on the road right now, the Rivian R1T is still my favorite. I'm still very glad I purchased it. The power, the clearance, the size...10 out of 10 I would buy the truck again. The only massive downside is once again, the cost. But that's how new technology goes. If you remember way back in the day over 10 years ago, Tesla started off selling cars that were $250,000 a piece. And now as time progressed, they are selling cars for $40,000. And I assume the price of Rivians and their lineup will just go down over time as well. I'll make another video probably around the 10,000 mile mark. We'll see if Rivian has fixed any of these issues I brought up. And we'll see if anything else is broken. Kind of a long term durability test. Hit that subscribe button if you haven't already so you don't miss what's coming. And let me know down in the comments if there's any specific tests you want to see run. I have not done a road trip with this yet and I do plan on doing that. Make sure to check out Huel down in the video description. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "truck",
        "Rivian",
        "thing",
        "miles",
        "driving",
        "trailer",
        "video",
        "towing",
        "bit",
        "pretty",
        "Huel",
        "cameras",
        "Rivian videos",
        "Rivian towing",
        "mile",
        "trucks",
        "horse trailer",
        "time",
        "information",
        "door"
    ],
    "transcript_entity_values": [
        "Fifteen hundred miles",
        "Model Y",
        "15",
        "1,500 mile",
        "two months",
        "9 inches",
        "two",
        "Huel",
        "my Jerry Rig Everything Knives",
        "Rivian R1",
        "about one mile",
        "about $7",
        "about 50-60 miles per hour",
        "Fort",
        "Oreo",
        "Model X",
        "6,000 pound",
        "first",
        "Ford",
        "1,000 pounds",
        "70 miles",
        "my second day",
        "the day",
        "5h",
        "more than 100",
        "84 miles",
        "every single day",
        "Hummer",
        "a half yards",
        "the watt hours",
        "13 month",
        "Humvee",
        "about half",
        "1600",
        "11,000 pounds",
        "800 pound",
        "EV",
        "daily",
        "Tesla",
        "1,500 miles",
        "third",
        "5,000 pound",
        "less than half",
        "fourth",
        "F150",
        "40,000",
        "about 78 miles",
        "Instagram",
        "78 mile",
        "about $50",
        "11",
        "the last two months",
        "150 miles",
        "250,000",
        "6th",
        "second",
        "two months ago",
        "One",
        "Rivians",
        "about 80 miles",
        "Twitter",
        "Rivian",
        "1,000",
        "6",
        "about 3 years ago",
        "240 volts",
        "40 grams",
        "3 year old",
        "27",
        "quarter",
        "just minutes",
        "4",
        "5,000 pounds",
        "10",
        "one hour and twenty two minutes",
        "10,000 mile mark",
        "winter",
        "10 years ago",
        "Raptor",
        "Huel"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "FAC",
        "NORP",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "QUANTITY",
        "TIME",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "ORG",
        "NORP",
        "MONEY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.10572212189435959,
        -0.004845788702368736,
        0.011221119202673435,
        -0.04198159649968147,
        0.10558946430683136,
        -0.07482810318470001,
        -0.015430768951773643,
        0.03200699761509895,
        -0.06135103851556778,
        0.022657902911305428,
        0.059798192232847214,
        -0.01725628413259983,
        0.007748719770461321,
        -0.02071334794163704,
        0.03953814506530762,
        -0.002762911142781377,
        0.024392953142523766,
        -0.059324610978364944,
        -0.014872932806611061,
        0.07220581918954849,
        0.008772558532655239,
        -0.030665060505270958,
        0.01629393920302391,
        -0.013504141941666603,
        0.014048089273273945,
        0.0924481526017189,
        0.06960052251815796,
        0.008020803332328796,
        -0.07535247504711151,
        -0.16788995265960693,
        0.05485016107559204,
        0.02866210788488388,
        -0.089412622153759,
        -0.06193270906805992,
        0.0007787584909237921,
        0.10401235520839691,
        -0.004865172319114208,
        -0.03571251034736633,
        -0.04756781831383705,
        -0.006705863866955042,
        -0.03966890275478363,
        -0.04769390448927879,
        0.008935024961829185,
        -0.028765983879566193,
        -0.04624704644083977,
        -0.05102713033556938,
        0.0763508677482605,
        -0.01015222817659378,
        0.11289424449205399,
        -0.040219731628894806,
        -0.032629966735839844,
        -0.03993396833539009,
        0.07767792791128159,
        -0.04964465647935867,
        -0.0758657455444336,
        -0.008955765515565872,
        -0.08483477681875229,
        -0.016833016648888588,
        0.018254505470395088,
        -0.08857309818267822,
        0.03163476288318634,
        0.005855662748217583,
        -0.024743078276515007,
        0.037355005741119385,
        -0.05015980452299118,
        -0.013225543312728405,
        0.017555663362145424,
        -0.05074094608426094,
        -0.041601210832595825,
        -0.029635444283485413,
        -0.009495875798165798,
        0.0011217005085200071,
        -0.04510342702269554,
        -0.003844213904812932,
        0.013157648965716362,
        0.04867086559534073,
        0.12274196743965149,
        0.07555955648422241,
        0.030241364613175392,
        -0.02030201070010662,
        0.007758757099509239,
        -0.008387407287955284,
        0.026849158108234406,
        -0.00667636189609766,
        0.030960436910390854,
        0.043408479541540146,
        0.05205247923731804,
        0.01184681337326765,
        -0.009399517439305782,
        -0.04843002185225487,
        0.07318302989006042,
        0.047406286001205444,
        0.05612305551767349,
        -0.09016451984643936,
        -0.05636977776885033,
        0.009560263715684414,
        -0.10590982437133789,
        -0.026995832100510597,
        -0.05610712617635727,
        0.07403688877820969,
        0.030060160905122757,
        0.06217377632856369,
        -0.023301463574171066,
        -0.05851519852876663,
        -0.06769080460071564,
        0.030511073768138885,
        -0.019927456974983215,
        0.050405871123075485,
        0.02476993389427662,
        0.004337583668529987,
        0.025919541716575623,
        0.03211350739002228,
        -0.02850140444934368,
        0.018515782430768013,
        -0.03131797909736633,
        0.05540166050195694,
        -0.11350306123495102,
        0.021109282970428467,
        0.06349262595176697,
        -0.001837811665609479,
        0.0319979302585125,
        -0.013168866746127605,
        -0.062117088586091995,
        0.03129682317376137,
        0.02177630551159382,
        0.10032900422811508,
        0.026835788041353226,
        5.10486229632815e-33,
        -0.06523445248603821,
        0.07107677310705185,
        -0.021717306226491928,
        -0.019164972007274628,
        -0.032223403453826904,
        0.020831728354096413,
        -0.020785553380846977,
        0.09153087437152863,
        -0.03648301959037781,
        0.005822025239467621,
        0.005559058394283056,
        0.06853310763835907,
        -0.0392068512737751,
        -0.04882657155394554,
        -0.044669851660728455,
        -0.070821613073349,
        0.00044890507706440985,
        -0.055707089602947235,
        -0.019232993945479393,
        -0.03852870315313339,
        -0.05981637164950371,
        0.012019108980894089,
        0.04827078431844711,
        0.02903921529650688,
        0.06938014924526215,
        0.06065605953335762,
        0.07603196799755096,
        0.0029775663278996944,
        0.06163576617836952,
        0.05343841016292572,
        -0.07457541674375534,
        0.05931686982512474,
        0.05082033947110176,
        0.013572108931839466,
        -0.11319521069526672,
        0.033314526081085205,
        -0.043147653341293335,
        -0.08132276684045792,
        -0.06393251568078995,
        -0.05119611695408821,
        -0.06368281692266464,
        0.054663777351379395,
        -0.08841196447610855,
        -0.0004941168008372188,
        -0.08370686322450638,
        -0.04023917019367218,
        0.08336860686540604,
        0.020231623202562332,
        -0.03764287754893303,
        0.008916771039366722,
        -0.09437727183103561,
        -0.033645473420619965,
        -0.03437886759638786,
        0.0012597247259691358,
        -0.05534711852669716,
        -0.002203717827796936,
        0.01751769334077835,
        -0.04562104865908623,
        0.02944924496114254,
        0.02498249150812626,
        0.09391175955533981,
        0.022480657324194908,
        0.03959118202328682,
        -0.000470263505121693,
        -0.0740172266960144,
        0.050880804657936096,
        -0.01692706160247326,
        0.031570300459861755,
        -0.04747696593403816,
        0.03901834413409233,
        0.003177048172801733,
        -0.06165919080376625,
        0.05559032782912254,
        -0.03481891751289368,
        0.03725861385464668,
        0.03308442607522011,
        -0.02200738899409771,
        -0.023858508095145226,
        0.056067563593387604,
        0.011940979398787022,
        -0.1292930245399475,
        -0.05374196916818619,
        0.054889604449272156,
        0.008648699149489403,
        0.09028975665569305,
        -0.06992965191602707,
        0.024196870625019073,
        -0.06012400612235069,
        0.008872302249073982,
        0.013258392922580242,
        0.01287433598190546,
        -0.009867530316114426,
        -0.019335629418492317,
        -0.008977956138551235,
        0.0038394038565456867,
        -6.034712857975135e-33,
        0.02185721881687641,
        0.021573111414909363,
        -0.00491715082898736,
        0.003156814258545637,
        0.04914233088493347,
        -0.009173491038382053,
        0.02564224787056446,
        0.10498715937137604,
        -0.0016412950353696942,
        -0.0655323714017868,
        -0.06850218027830124,
        0.03415437787771225,
        -0.08305376023054123,
        -0.03086855821311474,
        0.10051017254590988,
        -0.07307299971580505,
        0.10050000995397568,
        -0.04514529928565025,
        -0.03437693789601326,
        -0.005688322242349386,
        0.057058610022068024,
        0.028832070529460907,
        0.04538542404770851,
        0.010150478221476078,
        -0.0004523055977188051,
        0.04152628406882286,
        0.018251970410346985,
        -0.0019891199190169573,
        -0.01614878885447979,
        -0.007450340315699577,
        -0.0395796000957489,
        -0.06467452645301819,
        -0.0025920376647263765,
        0.014273113571107388,
        -0.03247746825218201,
        0.031628500670194626,
        0.04664384573698044,
        0.03632594645023346,
        -0.03780047968029976,
        -0.10883783549070358,
        0.02602112852036953,
        -0.03504977747797966,
        -0.05567286163568497,
        0.06951580196619034,
        -0.060734041035175323,
        -0.12161891162395477,
        -0.049308374524116516,
        -0.005044152494519949,
        -0.005418239627033472,
        0.00647470960393548,
        -0.04725896567106247,
        -0.006017763167619705,
        0.026388486847281456,
        0.046895988285541534,
        -0.08681537955999374,
        0.01325020007789135,
        0.06367632746696472,
        0.02248685248196125,
        -0.0763748437166214,
        0.03793734312057495,
        -0.048499446362257004,
        0.014290637336671352,
        -0.013999370858073235,
        0.05682048574090004,
        0.06792864948511124,
        -0.07566773891448975,
        0.059720080345869064,
        0.0074041495099663734,
        0.05139615386724472,
        0.02501850388944149,
        0.020894695073366165,
        -0.0026533117052167654,
        0.005402592942118645,
        -0.062026605010032654,
        -0.05172227695584297,
        0.054428134113550186,
        -0.02686374820768833,
        -0.08911553770303726,
        0.06240794062614441,
        -0.05743212625384331,
        0.006490651052445173,
        -0.05646863952279091,
        -0.044462427496910095,
        0.04970826953649521,
        0.04402773082256317,
        0.05675653740763664,
        0.07015546411275864,
        0.009607044979929924,
        0.06005122512578964,
        0.03349040076136589,
        0.026109512895345688,
        0.03394380956888199,
        -0.0404314361512661,
        0.14510628581047058,
        0.017854418605566025,
        -6.365153382148492e-08,
        -0.001720463391393423,
        0.050479404628276825,
        -0.031066177412867546,
        0.011840753257274628,
        0.1005382165312767,
        -0.022404752671718597,
        0.031505655497312546,
        0.040119756013154984,
        -0.1249803900718689,
        0.0940193310379982,
        0.047989413142204285,
        0.033901479095220566,
        0.038257237523794174,
        -0.011280256323516369,
        -0.013806603848934174,
        0.05935169756412506,
        0.06972813606262207,
        0.12978635728359222,
        -0.06818223744630814,
        -0.000634289812296629,
        -0.049672260880470276,
        0.004184504505246878,
        0.04030115157365799,
        -0.015673818066716194,
        0.023096643388271332,
        0.00042824726551771164,
        -0.03731805086135864,
        0.025751814246177673,
        0.04674525558948517,
        -0.028920041397213936,
        -0.10274261236190796,
        -0.016184940934181213,
        0.020059790462255478,
        0.02880333550274372,
        -0.022760514169931412,
        -0.08371935039758682,
        -0.07583114504814148,
        0.045924242585897446,
        0.03387953341007233,
        -0.0057810586877167225,
        -0.03687625005841255,
        0.05705089494585991,
        -0.0027957067359238863,
        0.0217968188226223,
        -0.03263343498110771,
        0.028260668739676476,
        -0.06636368483304977,
        -0.09190446138381958,
        -0.022859955206513405,
        0.011021302081644535,
        -0.04851503670215607,
        -0.029238691553473473,
        -0.04084937646985054,
        0.06639489531517029,
        0.020182019099593163,
        0.002753131790086627,
        -0.08317150920629501,
        0.0326276458799839,
        -0.03334993124008179,
        0.028033489361405373,
        0.05381045117974281,
        -0.08323260396718979,
        -0.036603689193725586,
        0.05739259719848633
    ]
}