{
    "id": "UO54_uXiG0Y",
    "title": "Surface Duo Review - Bad Software, Good Hardware - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-09-18T19:59:21Z",
    "video_url": "https://www.youtube.com/watch?v=UO54_uXiG0Y",
    "category": "Science & Technology",
    "tags": [
        "Surface Duo Review - Bad Software Good Hardware - Krazy Ken's Tech Talk",
        "Surface Phone",
        "Surface Duo Phone",
        "Mobile Phone",
        "Microsoft Surface Duo Phone",
        "Microsoft Surface Duo",
        "Surface Duo",
        "Microsoft",
        "Android",
        "Tablet Computer",
        "Krazy Ken",
        "Tech",
        "Bugs",
        "Glitches",
        "Computer Clan",
        "Review",
        "Krazy Ken's Tech Talk"
    ],
    "views": 26644,
    "likes": 1280,
    "comments_count": 189,
    "description": "Microsoft Surface Duo is a dual-screen phone erm tablet phablet! It's beautiful, thin, and light, but at $1,400, is it worth it? Let's find out, and enjoy all the bugs that happened, too. Wink.  Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Watch my first impressions of the Duo   Join our channel and get cool stuff   Subscribe for more tech videos!   Watch more videos like this!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - Surface Duo Review - Bad Software, Good Hardware  Like my wallpaper I used on the Duo? I have more available for download:    Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!   Contact Us    Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "https://bit.ly/clan35sTg77",
        "https://bit.ly/clan2JGWYhz",
        "http://subscribe.thecomputerclan.com",
        "http://bit.ly/clan2UrG7G5",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://thecomputerclan.com/wallpapers",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Sponsored by Artgrid. (lively upbeat music) Hey guys, how are you all doing? Really, that's just great. You know I'm doing pretty great today too. If you're new here, welcome. My name is Krazy Ken, and this is the Microsoft Surface Duo. Now keep in mind, it is a first generation device priced at... $1,400. So it's definitely not for everybody, but that's okay. I think the industry needs companies that will be bold and take chances and release these new products into the market, which will help push things further. And, I can't wait to see where they go with this in the future. So I bought this device knowing there would be problems. But honestly, there's some great things about it, but there's also some not so great things. In short, there's just a lot of sacrifices being made, so they can achieve the foldable design. But we'll talk about more of that stuff through out the whole review. So let's dive in. First impressions, I absolutely loved the design. Microsoft, you did a great job with the hardware here. I know some people complained about the bezel thickness, but I didn't notice that as an issue when it was open. When I folded into single screen mode, then yeah, the bezels do look a little bit THICC. But other than that, it's just really fun to open and close and it's really fun just to hold it, it just feels good in your hand. And I handed it off to some other people just to get their impressions and they all love the way it felt. One person even said he couldn't put it down and it just felt so good. And I agree. It does look nice, it feels nice and it's crazy thin. When open, it's only 4.8 millimeters thin. And when closed, only 9.9 millimeters thin, so, super thin and it pretty much just floats away. It's pretty lightweight. It's only 250 grams. For people that use other measuring systems, that's about 8.81 ounces. So very thin, very light, nice job Microsoft. The hinge by far is the biggest marvel in this design. You can tell Microsoft put a lot of effort into engineering it because it opens and closes so smoothly. It's never stuttered, it's never felt sticky, it rotates all the way around, and it holds. Like, when you open it, it's smooth, but it actually knows how to hold in place. It has never jiggled or anything. So, props to you Microsoft for making that so good. Like I talked about earlier, the design feels nice, but it is all glass screen and back. So I guess it could be a bit fragile, because Microsoft included a bumper, that you can put onto the device. So, I guess that's nice if you want just a little extra protection there. Personally, I think that removes some of the elegance and I'll be honest, I haven't used a case on my phone in, say at least four years, I like carrying it naked. So, I'm okay just with this. Spec wise, there are two batteries on the inside totaling 3577 milliamp hours. Now, on paper that gives you about 10 days of Standby Time, 15 and a half hours of Local Video Playback. But keep in mind, your battery life may vary depending on if you have the two screens on or the one screen on, so just to keep an eye on that. You can have 128 gigabytes of storage or 256 gigabytes that's UFS 3.0 storage by the way. Six gigabytes of Ram, Nano SIM with eSIM as well, and a Qualcomm Snapdragon 855. For data and charging, there's a single USB 3.1 port. It barely just fits on that thin edge there. And the Duo ships with the USB-C cable, plus an 18 watt power block. Each display is 5.6 inches diagonal, at 1800 by 1350 resolution. So that gives you 401 pixels per inch for a really sharp picture. And when you open the device, you get an 8.1 inch viewing area, at 2,700 by 1800. And these are also AMOLED displays with the wider P three color, and Gorilla Glass. You also have a fingerprint scanner on the side for unlocking your device, and an 11 megapixel camera which we will definitely talk about more in a minute. So, the Surface Duo runs Android 10 with Microsoft software stacked on top of it, including Microsoft Launcher, Microsoft SwiftKey and pre-installed apps like OneNote and Edge. And the big feature this UI offers is Microsoft's version of multitasking, which is great for the dual screens. You can launch an app on one screen, and the other screen gives you a fully functional home screen still. So you can open up an app on the second screen for side-by-side app use, and you can flick at the apps at the bottom of the screen and quickly move them to the opposite display. And you can also use these apps in portrait or landscape orientation. And if you want, you can maximize a single app, so it spans across both screens. If apps are optimized for dual screens, they can be quite functional, but if an app isn't optimized, you can still maximize it. But keep in mind those center bezels might cover up part of the interface. One thing I really like is how the keyboard aligns for easy one handed thumb use, but even better, if you rotate into compose mode, or compose posture, the keyboard can fill the whole second display, while the top screen is uninterrupted, and you can make app groups. So two apps can launch side, by side with one tap. This is handy for when I need to research the Duo in Microsoft Edge, but also write a script about it in OneNote. How meta. Anyway, if you don't wanna use the Surface Duo in book mode with the two screens out, you can fold one of the screens over and just use it in single screen mode. So that's an option, but it's not really the best for one handed use. So keep that in mind. You'll probably have to use two hands on this thing, unless you have really big hands, and it's kind of big for your pocket. I found it to be just a little too big. I got used to it, but it's still a bit bulky. So just keep that in mind. But that's trade-offs, you're carrying more with you. You're basically carrying two devices with you in one. So, just bear that in mind. And here's another thing I had a lot of fun doing. All these different postures you have, you know, compose mode, book mode, you also have this little tent posture, so you can just prop it up like that and, you know, watch your movies or stare at a clock, whatever you wanna do. So I think that's kinda cool. So the camera is well, it's there. It's better than nothing I suppose, but in terms of picture quality, fine details do not capture well. There's lots of softness and splotchiness. Sometimes the shutter button would also lag when I tap on it. And it was also kind of hard to get the tap to focus, to actually focus on a subject. I would have to tap the screen multiple times and still not have any luck. However, the video stabilization was kind of decent. So that's a small plus. But quality aside, the bigger problems have to do with the cumbersome process required to take a photo. But I'll cover that in a sec when I talk about the negative traits of the Duo. Before we get into the not so good stuff, I would like to thank our Artgrid and Artlist for sponsoring today's episode. The footage you saw on the Surface Duo earlier was provided by Artgrid, and most of the music I use on my YouTube shows, is solely from Artlist. So if you need royalty free music and royalty free stock footage for your videos, you have to use Artgrid and Artlist. Because stock footage and stock music licensing can be very complicated and expensive, but these guys make it easy. A single annual subscription to either Artlist or Artgrid, gives you tons of access to clips or music, and you can download anything you want throughout the whole year with no limits. And you can keep the licenses forever. So when you're working on your next video, be sure to add some awesome Artgrid clips, and Artlist music into it. And if you sign up through my link, you'll get two extra months free added to, one of your subscriptions, you can choose to subscribe to both if you want. And when you do that, you'll also be supporting the channel. So thank you very much, everybody wins. Okay so we covered the good stuff, but now let's talk about the, not good stuff. Buckle in. So, there are some usability issues that make this device quite cumbersome. For example, if you have it folded closed, and you want to briefly take it out of your pocket to check the time, you can't do that without using two hands. Then you have to open it slightly to trigger the peak mode. I thought that was kind of tedious and inconvenient for such a simple task, so I found myself just carrying it around in my pocket with the screen flipped around. So I could just take it out, click the button, and then put it back in my pocket. And a weird bug with the peak mode is sometimes when it gets triggered, it'll stay on. The wallpaper will vanish, most things go black. And if I try to swipe apps over to the other screen, they just kind of fizzle into the ether. And sometimes when the bug happens, I also get locked out of my phone. I try using the fingerprint scanner and I try swiping up for the pin code, but nothing works. I'm stuck on the lock screen. Another issue I had is sometimes part of my wallpaper would just vanish, so I thought that was pretty odd. And sometimes when the icons move around in the launcher, depending on what screen orientation you have set up, it just kinda blends the icons together and they get all mixed and it looks weird, but I'm assuming a software update can fix this stuff. So I'm not too concerned, but right now this is the state of things. But the most frequent issue I had was just trying to swipe up to go to the home screen. That's a very common and simple thing that you need to do a lot, but sometimes I'd have to swipe maybe like four or five times just to get to the home screen. So that definitely needs to be fixed. Also video playback in the camera app drops frames for me at least. So that's another weird bug, but I'll be enough if you watch your videos in Google Photos, it's fine. Okay, so here's another funny thing I noticed about this device. We all use our phones as flashlights, right? We turn the little flash on the back. Well, this does have a light you can use it as a flashlight and there's a button on the home screen. But if you don't know which way you have the device folded and you go to turn on that light, it's just gonna beam you right in the face. So I think that's weird. The software should know which screen is facing you. That's kind of one of the points of the device, and it should disable that when it's facing you, 'cause what's the point of flashing the light in your eyes. That's just kind of silly. But perhaps the worst usability issue I noticed with this thing, is with the camera. It's just way too cumbersome to use. I'm actually kind of discouraged. Like I don't feel like I wanna use it to actually take pictures, 'cause it's just too complicated. So, let's say you have it folded up and it's in your pocket. Something's going on, you wanna take a picture of it. So you gotta take it out of your pocket, and you gotta unfold it. And you have to fold it the right way where the camera's facing outward. If you fold it like this way, now the camera's facing you and it triggers selfie mode. So you have to make sure you fold the right side out, then, if you're lucky, 'cause sometimes it does not trigger properly. The camera viewfinder will show up here and then you can take a picture. But if the camera viewfinder does not show up here. Now it's on the other screen, and you have to like find a way, sometimes the accelerometer needs they'll be like shaken or something to get it to reset and go on the right screen and just, oh my gosh, by the time you figure that out, the moment's over, or you just don't care anymore. So they gotta fix that somehow. I still think it's decent for video chatting, especially if you just put it in this compose mode, and you point the camera toward you, that's kinda convenient, but other than the typical like web conference call or whatever, I wouldn't really use the camera for much more. So at the beginning of this episode, I mentioned there's a lot of trade offs or sacrifices being made for this $1,400 hardware. So keep in mind Microsoft started working on this, I think about a year ago. So it is lacking some things that you would expect from a 2020 phone, for $1,400. And those things got traded off probably because they had to find a way to get the folding features and everything to work. So, for example, you don't have 5G. You do have a slightly older processor, the 855, and you don't have a higher refresh rate display, if anybody cares, I know some people do, it is 60 Hertz. And you also don't have wireless charging so, it may not be worth it for a lot of people. Personally not worth it to me. That's missing out on quite a bit, especially at that price. I've never paid $1,400 for a phone. Now, if you combine how much I paid for a phone and a tablet together, it would probably be about $1,400. And then this would cover that. But, you have to still think, you're missing out on some things, like I said the 5G, you're missing out on a much better camera system. So, that's kind of the weird trade off situation going on right there. But it's a first gen device. This is Microsoft's first foldable phone. Heck it's the first Android phone, period. Yeah, the guys that made Windows Mobile and Windows 10 Mobile and all that stuff, they're not using that anymore. It's Android. So, although I can't personally recommend this to anybody right now, it is a good start. Like this is setting the stage for an awesome Surface Duo 2.0 release. And whenever Microsoft does that, I would love to show it to you. So definitely keep an eye on this. I think Microsoft has a good idea brewing here. Lemme know what you think about the Microsoft Surface Duo. Feel free to leave a comment down below. And, if you wanna support the channel, plus get some awesome perks, feel free to click the join button below too. And if that button doesn't work for some reason, there's a handy link in the description. If you like this episode, you know what to do. Thanks for sticking with me. Catch the crazy, and pass it on. (lively upbeat music)",
    "transcript_keywords": [
        "Microsoft Surface Duo",
        "Microsoft",
        "screen",
        "Surface Duo",
        "Duo",
        "Microsoft Surface",
        "kind",
        "camera",
        "device",
        "mode",
        "screens",
        "things",
        "Surface",
        "home screen",
        "Artgrid",
        "single screen mode",
        "app",
        "good",
        "open",
        "thing"
    ],
    "transcript_entity_values": [
        "3.0",
        "Local Video Playback",
        "USB",
        "2,700",
        "128 gigabytes",
        "Gorilla Glass",
        "annual",
        "UFS",
        "2020",
        "Windows Mobile",
        "Android",
        "Hertz",
        "about 8.81 ounces",
        "3577 milliamp hours",
        "Windows 10 Mobile",
        "only 9.9 millimeters",
        "about 10 days",
        "Artgrid",
        "two",
        "15 and a half hours",
        "the Surface Duo",
        "OneNote",
        "Edge",
        "two extra months",
        "at least four years",
        "Microsoft Launcher",
        "Ram",
        "the Microsoft Surface Duo",
        "only 4.8 millimeters",
        "Nano",
        "sec",
        "the whole year",
        "Duo",
        "today",
        "Six gigabytes",
        "Krazy Ken",
        "YouTube",
        "1800",
        "about a year ago",
        "855",
        "Google Photos",
        "1,400",
        "first",
        "one",
        "four",
        "5.6 inches",
        "Microsoft Edge",
        "Microsoft",
        "10",
        "5",
        "about $1,400",
        "One",
        "18 watt",
        "401",
        "11 megapixel",
        "1350",
        "8.1 inch",
        "five",
        "First",
        "only 250 grams",
        "second",
        "256 gigabytes",
        "Artlist",
        "60",
        "UI",
        "Qualcomm",
        "three"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ],
    "vector": [
        -0.1697469800710678,
        -0.06455457955598831,
        0.043252620846033096,
        -0.12320806086063385,
        0.059276118874549866,
        0.010551375336945057,
        0.034697361290454865,
        0.04508652165532112,
        -0.020764613524079323,
        0.004871008917689323,
        0.03976009786128998,
        -0.011838200502097607,
        -0.010841750539839268,
        0.004858305677771568,
        0.06427212059497833,
        0.004592754412442446,
        0.09390409290790558,
        -0.03759827837347984,
        -0.0038906915578991175,
        0.02448907680809498,
        -0.009693052619695663,
        -0.0987304300069809,
        0.016758039593696594,
        -0.09403600543737411,
        0.033627111464738846,
        0.013300866819918156,
        -0.018403073772788048,
        0.023013019934296608,
        -0.017834702506661415,
        -0.08031493425369263,
        -0.03548206016421318,
        0.04228352755308151,
        -0.01146361418068409,
        0.02581862546503544,
        -0.016356589272618294,
        -0.1165713220834732,
        -0.02021363005042076,
        -0.02314256876707077,
        -0.13063158094882965,
        -0.05956138297915459,
        -0.07585471123456955,
        -0.012211808934807777,
        -0.03337744250893593,
        -0.008617028594017029,
        0.09456653892993927,
        -0.038406576961278915,
        0.05384707450866699,
        -0.032505739480257034,
        0.04658650606870651,
        0.025669680908322334,
        -0.013062425889074802,
        -0.07257381826639175,
        0.06971854716539383,
        0.013725092634558678,
        -0.05256708338856697,
        0.05931631848216057,
        -0.006625678855925798,
        0.06127693131566048,
        0.04929633066058159,
        -0.021804621443152428,
        0.0432777963578701,
        -0.035878293216228485,
        -0.014804689213633537,
        0.036806270480155945,
        0.01311021950095892,
        -0.03412209078669548,
        0.03175976872444153,
        0.017283663153648376,
        0.01036459393799305,
        -0.0912831649184227,
        -0.10413939505815506,
        0.0052099768072366714,
        0.00309142773039639,
        0.03407655283808708,
        0.039178572595119476,
        -0.018932830542325974,
        0.004621288739144802,
        -0.07086631655693054,
        -0.04964001849293709,
        -0.07943455129861832,
        0.030738642439246178,
        -0.00022011341934558004,
        -0.08786103129386902,
        0.021492963656783104,
        0.04910526052117348,
        -0.04191383346915245,
        -0.0013881245395168662,
        0.06738152354955673,
        -0.04564214125275612,
        -0.03886264190077782,
        -0.010675069876015186,
        0.11945466697216034,
        0.007772043813019991,
        -0.019469572231173515,
        -0.017533114179968834,
        -0.038951314985752106,
        0.013421513140201569,
        -0.07509297877550125,
        -0.07683032006025314,
        0.07384089380502701,
        0.00844825990498066,
        0.020217854529619217,
        0.05010230839252472,
        -0.06052941083908081,
        0.00873461551964283,
        -0.1123865395784378,
        0.01295417733490467,
        0.023525793105363846,
        0.05569598078727722,
        0.03459674119949341,
        0.01563168875873089,
        0.005535756703466177,
        -0.0959925726056099,
        -0.046546392142772675,
        0.04609246179461479,
        0.04986724257469177,
        -0.047806259244680405,
        0.00825625192373991,
        0.14854545891284943,
        -0.07491043955087662,
        0.003172772005200386,
        -0.0422239676117897,
        -0.07507726550102234,
        -0.03406262770295143,
        0.029192253947257996,
        -0.02052943967282772,
        0.0029152841307222843,
        4.907623527809786e-33,
        0.028328653424978256,
        0.1273418813943863,
        -0.09021643549203873,
        -0.03189954534173012,
        -0.022103456780314445,
        -0.01849789172410965,
        -0.011359848082065582,
        0.04405379295349121,
        -0.0785970389842987,
        0.007335851434618235,
        -0.08690490573644638,
        0.0008579285931773484,
        -0.05803936347365379,
        0.053606968373060226,
        0.012039657682180405,
        -0.04519488662481308,
        0.0012287768768146634,
        -0.02668193355202675,
        -0.03224445879459381,
        0.06162545830011368,
        0.04581163823604584,
        0.021619943901896477,
        0.030265217646956444,
        -0.0031898680608719587,
        0.0300064068287611,
        0.02220723405480385,
        -0.01900758035480976,
        0.019822685047984123,
        0.13587842881679535,
        0.029034798964858055,
        -0.08347219973802567,
        -0.02864682674407959,
        0.06443140655755997,
        -0.01756112091243267,
        -0.017866209149360657,
        -0.08429655432701111,
        -0.0839717835187912,
        -0.10276240110397339,
        0.0698879286646843,
        -0.026904404163360596,
        -0.06913404166698456,
        0.04646562039852142,
        -0.01658656634390354,
        -0.03333866968750954,
        0.00047863982035778463,
        -0.032369859516620636,
        0.037754714488983154,
        0.07352463901042938,
        0.04693225771188736,
        0.021397706121206284,
        -0.013580302707850933,
        -0.006349057890474796,
        -0.04308224469423294,
        0.04522344097495079,
        -0.028447451069951057,
        -0.03827160596847534,
        0.03847643733024597,
        -0.02639915980398655,
        0.051644738763570786,
        0.030345970764756203,
        0.05681631341576576,
        0.05414222925901413,
        0.02344215102493763,
        0.02033793367445469,
        -0.08996936678886414,
        0.018196698278188705,
        0.10694681107997894,
        0.1017216369509697,
        -0.054274022579193115,
        -0.022906998172402382,
        -0.04623847082257271,
        -0.033005498349666595,
        0.08255862444639206,
        -0.053019557148218155,
        0.06136522442102432,
        -0.029946617782115936,
        -0.0007478592451661825,
        -0.0012322543188929558,
        -0.051136136054992676,
        0.029400842264294624,
        -0.07917976379394531,
        0.01908804103732109,
        -0.002159168478101492,
        0.00704012019559741,
        -0.07624048739671707,
        0.012735017575323582,
        0.014685779809951782,
        -0.01588210090994835,
        -0.02000095136463642,
        0.0610063411295414,
        -0.00491690170019865,
        -0.020431051030755043,
        -0.007416923530399799,
        0.041194330900907516,
        -0.014661265537142754,
        -5.0770750792426496e-33,
        -0.010759562253952026,
        -0.021277079358696938,
        -0.03798099234700203,
        -0.021240804344415665,
        0.02269546128809452,
        -0.02816249430179596,
        0.07490230351686478,
        0.0001562565448693931,
        -0.024570785462856293,
        -0.029787316918373108,
        0.07127011567354202,
        0.029629113152623177,
        -0.04888707771897316,
        -0.027043549343943596,
        0.049176763743162155,
        -0.022624637931585312,
        -0.04531712085008621,
        -0.0161824319511652,
        0.06708259135484695,
        -0.02142087183892727,
        0.0880536213517189,
        -0.0035416418686509132,
        -0.014184616506099701,
        0.0713595598936081,
        -0.011875459924340248,
        0.009636261500418186,
        0.01570301502943039,
        0.02601570263504982,
        0.03392058610916138,
        0.09034327417612076,
        -0.004357016645371914,
        0.001137512386776507,
        -0.023501183837652206,
        0.040022291243076324,
        0.05704152211546898,
        0.02794370800256729,
        0.05520161613821983,
        -0.06734749674797058,
        -0.07839975506067276,
        -0.08076945692300797,
        0.07516621053218842,
        0.03833501413464546,
        -0.07319723069667816,
        0.00946762040257454,
        0.021865839138627052,
        -0.00426148809492588,
        -0.03599993512034416,
        -0.0060723526403307915,
        -0.05961233004927635,
        -0.007585522253066301,
        0.021400010213255882,
        0.03967320919036865,
        0.019139116629958153,
        -0.07615859061479568,
        -0.02991519309580326,
        -0.010443177074193954,
        0.02160288579761982,
        0.04221687093377113,
        -0.0018040303839370608,
        0.006486631464213133,
        0.014924551360309124,
        -0.02461371384561062,
        -0.050399284809827805,
        -0.04908904805779457,
        0.011075637303292751,
        0.07822935283184052,
        0.11662973463535309,
        0.05868959426879883,
        0.015355014242231846,
        0.044388022273778915,
        -0.07514701038599014,
        -0.001627882826142013,
        0.07367100566625595,
        -0.07957973331212997,
        -0.010930159129202366,
        0.06045134365558624,
        -0.02180822566151619,
        0.0062038651667535305,
        0.007828908041119576,
        -0.055587589740753174,
        0.023402562364935875,
        0.002377966418862343,
        0.11464440822601318,
        0.0411817729473114,
        0.04724092409014702,
        0.03407982736825943,
        -0.01300533302128315,
        0.04865057393908501,
        -0.06497214734554291,
        0.04907980188727379,
        -0.011021479032933712,
        -0.01595999114215374,
        0.028944682329893112,
        0.12247338145971298,
        0.004659145139157772,
        -6.542944674947648e-08,
        0.025799421593546867,
        0.05166062340140343,
        0.08013324439525604,
        -0.0646994560956955,
        -0.019131794571876526,
        -0.08418817818164825,
        0.03583194315433502,
        0.04080000892281532,
        0.028463225811719894,
        -0.050207048654556274,
        -0.01045934110879898,
        -0.10354740172624588,
        -0.052932258695364,
        0.05975792929530144,
        0.09296707063913345,
        0.1278592199087143,
        -0.01789448782801628,
        0.07052109390497208,
        -0.030756862834095955,
        -0.08376872539520264,
        -0.011132510378956795,
        -0.018903004005551338,
        0.05846060439944267,
        -0.07236078381538391,
        0.03647448495030403,
        0.06209675595164299,
        -0.04250841587781906,
        0.10320666432380676,
        0.051843203604221344,
        -0.0890364721417427,
        -0.03592262417078018,
        -0.04517192766070366,
        -0.0057532512582838535,
        -0.00919949822127819,
        0.04417075961828232,
        -0.07839249819517136,
        -0.05731967091560364,
        -0.027256935834884644,
        0.06367127597332001,
        0.008775902912020683,
        0.00014258081500884145,
        -0.03480357676744461,
        -0.021652571856975555,
        -0.0032528704032301903,
        0.05165686458349228,
        -0.00621868297457695,
        -0.004846309311687946,
        -0.12183070182800293,
        0.020544657483696938,
        -0.025139395147562027,
        -0.030724981799721718,
        -0.049223411828279495,
        -0.022403040900826454,
        0.04925522208213806,
        0.023467116057872772,
        -0.0013256509555503726,
        0.0020053975749760866,
        -0.013342086225748062,
        0.05611270293593407,
        0.0719854086637497,
        0.022316619753837585,
        -0.04710262641310692,
        -0.0491759367287159,
        0.05750858038663864
    ]
}