{
    "id": "UpuLysPeihI",
    "title": "Should you be using WiFi 7 or WPA3? Best Wi-Fi setup?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2024-03-10T14:30:16Z",
    "video_url": "https://www.youtube.com/watch?v=UpuLysPeihI",
    "category": "Science & Technology",
    "tags": [
        "wifi",
        "wpa",
        "wpa2",
        "wpa3",
        "ehakau",
        "kali linux",
        "kali",
        "nethunter",
        "kalihunter",
        "kali nethunter",
        "wifi hacking",
        "scanner",
        "wifi scanner",
        "hacking",
        "hackers",
        "ethical hacker",
        "ethical hacking",
        "hacker",
        "hacking course",
        "learn hacking",
        "how to hack",
        "wifi password",
        "wi-fi",
        "alfa adapter",
        "wifite",
        "hashcat wpa2",
        "how to hack wifi password",
        "penetration testing",
        "wpa2 cracking",
        "wifi password hacker",
        "wifi password hacker app",
        "hashcat wifi cracking",
        "wireless security",
        "wpa2 hacking",
        "wifi cracking",
        "slow wifi",
        "fast wifi"
    ],
    "views": 75121,
    "likes": 2454,
    "comments_count": 133,
    "description": "Is your WiFi good Or bad? Is it secure? Are you making these mistakes?  Big thanks to Ekahau for sponsoring this video! Learn more here:   // Matts SOCIAL //  X:   LinkedIn:    // Macs SOCIAL // X:   LinkedIn:    // David's SOCIAL //  Discord:   X:   Instagram:   LinkedIn:   Facebook:   TikTok:   YouTube:   // MY STUFF //     // SPONSORS //  Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  // MENU // 00:00 - Coming up 00:59 - WPA3, why should we use it? 02:41 - Which security certification standards to avoid 04:37 - Best practises when using WPA2 05:33 - Alternatives for PSK 08:06 - Simultaneous Authentication of Equals (SAE) explained 09:06 - Even more security with WPA3 11:04 - Management Frame Protection explained 11:58 - Deauth attacks won't work on WPA3 13:20 - Summary of WPA3 15:07 - 6GHz and bands explained 17:57 - WiFi 7 explained 21:13 - WiFi 6 vs WiFi 7 22:12 - Home & Enterprise WiFi 24:05 - \"Client devices are the problem\" 24:55 - Ekahau Sidekick 2 explained 26:26 - Reach out to Matt and Mac on socials 26:50 - Conclusion  wifi wi-fi wifi 7 wifi 6e wifi 6 wifi 5 wireless iphone android kali linux kali linux 2020.4 wifite wpa wep wps wpa2 wpa3 hack hacker hacking ethical hacking kali  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.  #wifi #iphone #android",
    "description_links": [
        "https://www.ekahau.com/learn/david-bombal/",
        "https://x.com/mattstarling",
        "https://www.linkedin.com/in/matthew-starling-03913633",
        "https://x.com/macderyng",
        "https://www.linkedin.com/in/macderyng",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/@davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "WPA3 is the latest and greatest but we've also got WEP and WPA, WPA2. Can you tell us like what we should not be using and what we should be using? So very short answer to this question never use WEP and WPA original WPA1. It's called the WPA without the one but don't use that stuff because it's crackable in seconds today. This device that you see right here is actually called our Sidekick 2 and it's our all-in-one measurement device for Wi-Fi so it scans everything in Wi-Fi in the 2.45 6 gigahertz frequency bands but not just Wi-Fi it also has an inbuilt super fast high resolution spectrum analyzer so as you walk around your environment not only will it detect your Wi-Fi access points your neighbor's Wi-Fi access points but if you have any interferers are getting attacked by a fly it will pick up if you've got any microwave ovens passive infrared devices bluetooth wireless non-Wi-Fi cameras and captures everything at the same time as you move around your environments. I'm here with my Wi-Fi expert Mack and Mack from Ekahau. Now this is a technical video I'm going to ask you a bunch of technical questions that I get. So you'll be throwing us under the bus every five minutes then. That's about right yes so looking forward to it. First question right WPA3 why is it better and should I be using it today? Okay so WPA3 is the newest latest and greatest security suite. It was introduced and forced to use in 6 gigahertz bands so the reality is if you have 6 gigahertz you have to be using WPA3 it's mandatory and the legacy bands they don't have to use WPA3 it's optional so now let's talk about if it's more secure than WPA2. What's your take on it Matt? Yeah so WPA3 is the successor to WPA2 and it offers us extra encryption and it's stronger than WPA2. Why would we not use it? Well you may have some older devices in your environment that don't support it so you have to think about how you're going to be configuring your wireless networks in 2024 and beyond because if you just decide to blanketly configure your SSID that's broadcasted across your frequency bands across 2.45 and 6 gigahertz with WPA3 and you have new devices come in like your iPhone your iPad MacBook some Windows devices they may support WPA3 and can connect to the network no problem at all but if you've got some older devices that may be a bit legacy or not been around for the last few years they then come in the following day and try and connect to the wi-fi they may not be able to associate at all and you're going to be getting a lot of support calls or people calling you in the middle of the night saying David my wi-fi doesn't work how can you help me? There wasn't a call David there was a call you. That's right. And I'll be calling it to David. David said turn on WPA3 so. Okay so WPA3 is the latest and greatest but we've also got WEP and WPA2. Can you tell us like what we should not be using and what we should be using? So very short answer to this question never use WEP and WPA original WPA1. It's called the WPA without the one but don't use that stuff because it's crackable in seconds today and by crackable I mean it has an encryption so your traffic is encrypted when you send it over the air and when I capture your traffic from the air I can't decrypt it as easily but with WEP and WPA I can find an encryption well I can decrypt your traffic very very easily so don't use that. WPA2 is still considered secure for as long as your key is long and now don't use spiderman as my password right? Yeah so you're actually unless you put an exclamation on the end because then that makes it really secure. Okay that's a joke right? Just so everyone doesn't get it. And then one two three is the most common so password then exclamation then one two three. Is that the most common password right? Yeah well don't use that so guys for as long as you have password that is not in WPA2 that is non-dictionary that is fairly long and it has different characters then you're good okay because you can't brute force it really because it will take you years or tens of years and it's not really practical and you can't guess it so you're you're good to go. However if you know password in WPA2 when you're using personal PSK I can put in this password in Wireshark for example and take the decryption off from all your wi-fi frames so probably not the brightest idea is it? No so the problem with pre-shared key is kind of in the name that is pre-shared so if David you know the key and I know the key and Mac knows the key we can then use that and any widest traffic that is sent to somewhere that's unencrypted perhaps if you go to a website that's HTTP rather than HTTPS then anything that is sent to that could be easily decrypted and seen by anybody. Clear text basically right. So give us some best practices you said password must be of a certain length right must be like good like mixed characters any other good practices if I'm using non-dictionary and also there are actually quite a few nice practices so WPA2 for as long WPA2 PSK I mean personal is secure for as long as the password is secure and it's not shared between different people or groups of people so long password not known you can distribute it to your devices using MDM apps QR codes we can even use something like IPSK MPSK PPSK. Wait what is that so I was about to say that so that's the same thing named differently by different vendors but basically it means that people or groups of people they can be using their own dedicated pre-shared keys so if a key for me is compromised maybe yours is still cool so your traffic is still encrypted so that adds to security quite massively. So you mentioned PSK what's the alternative for because I mean PSK seems correct me if I'm wrong is okay perhaps for home but not the best for business right? Yeah so if you're running a business you have a corporate environment the most likely type of authentication you're probably going to use is something that's called radius or 802.1x authentication and what that basically means is that you're going to have some sort of radius server somewhere maybe in your network or somewhere else that you can authenticate users either by doing a certificate based authentication or they're logging in with that username and password so it adds extra layers of authentication and encryption so it makes it much more challenging for bad actors to get access to the wireless network or to intercept any of that traffic but then there are some caveats and things you want to think around with radius authentication because big thing in wi-fi is being mobile and being able to move around an environment like where we are now Cisco live and easily switch between different access points we're in your office your warehouse you want to be able to roam fast the thing is when you do a radius authentication when you do that initial connection it can actually take quite a long time because you're not just going from your wireless client device to the wireless access point and to the controller to you know exchange a set of passwords for a pre-shared key when there's radius server involved there's a lot more steps that's in place so you go from the wireless client device to the access point access point forwards that onto the controller that falls onto the radius server radius server checks your credentials your certificate possibly and the radius server can be in a different country or on a different continent and you can take like a second or two or four yeah right exactly and then if you when you roam what would happen if you don't have anything turned on from like a roaming a fast roaming amendment what would happen is each time you go from access point to access point you have to do that full radius authentication that can take anywhere up to a second a couple of seconds and in wi-fi that's a really long time so you want to try and reduce that as much as you can by using something called 802.11r bash transition if you're in the Cisco world like we are today and what that basically does it'll speed up that roaming time between going between access point and access point because you don't have to do that full authentication to the radius server each time it's cached and stored locally on the access points and there's other ways the brand we can do it too that's a very good point so what we've discussed so far is the psk that's a personal right wpa2 psk you have a key and then wpa2 enterprise that uses the radius for backend authentication of users and also that it's great to use something that we call 802.11r fast transition ft to make sure that you don't have to go back to radius every time you switch from ap to ap when you walk around your premises but you mentioned something offline about the instead of using psk there's a new thing is that right there is there is so psk appreciate key is the wpa and wpa2 thing and that means if i know your password i can decrypt your wi-fi wi-fi traffic right so that's a little bit risky doesn't have to be too bad if your password is strong but in wpa3 we've replaced the psk with sae simultaneous authentication of equals and sae is a direct successor to psk we don't have psks anymore now we have just sae and sae is quite cool because even if i know your password i won't be able to decrypt your traffic so your password in sae is used for authentication of user of you you use your password but it's not used for encryption anymore encryption is derived automatically from a very simple sounding wi-fi helmet algorithm that basically means that it works in one way so i can encrypt your traffic but i can't use the same password to decrypt your traffic so that's quite fascinating isn't it i believe there's even more security with wpa3 because with wpa2 the way that you crack it is you deal with the clients you capture the handshake right and then you just run brute force against that and try and decrypt it is that solved in wpa3 yeah exactly that so um something that's enforced with wpa3 is also management frame protection or protected management frames depending on what vendor or how you're talking to somebody in industry how they'll be referring to that and that is to kind of mitigate exactly what you just mentioned has happened there about clients getting de-authenticated from the management frames and then re-associate into a malicious or rogue access point that they shouldn't be connecting to or honeypot ap and then they uh share their credentials which is what we want to try and avoid as much as possible so basically your question was how to exploit ip peep authentication method using wpa enterprise either wpa1 or two or three actually enterprise is pretty much identical between between wpa2 and wpa3 the only difference between these two is the encryption length of a key optional but yeah so that was ip peep requires users credentials to authenticate to the wireless network and it's easier to use than certificate based authentication so ip peep requires username and passport and it's still validated against the radius server in the back end and the easy thing about it is that you don't have to install a certificate on your user device installing a certificate on your user device is can be quite complicated you need to have an infrastructure for it you need to upload it somehow install it somehow if you ask the user they probably won't so that's why we are using ip peep and ip peep asking you for credentials is risky because as you said without management frames protection we can de-authenticate all the users and force them or encourage them to connect to an attacker's ap and harvest their credentials and then have access to their i don't know an email or whatever other services they're using so yeah good question did the author attacks work against wpa3 then was that solved uh this attack will work against wpa3 as well because we are not trying to decrypt the traffic we are just harvesting users credentials so if i if i send a bunch of like de-auth messages to the ap i can kick the users off even in wpa3 in w well wpa3 you're probably asking about the mfp and mfp or pmf management friends protection is enforced now so if you are using wpa3 you will be using pmf or mfp so you cannot do the off attack so you can attack the users that are just connecting to the network they might be coming to your access point but you can't de-authenticate existing users so it is of course more secure however you can configure mfp pmf on alt legacy bands on 2.4 and 5 as well but then you are risking compatibility right all their devices they simply won't be able to connect to an ssid that uses mfp pmf whatever you call that and if they don't support it they won't connect guys i'm a bit slow right people call me a boomer on my videos even though i'm not but yeah i'm a bit slug i'm a bit slow so just make it clear for me in some of my videos that i've done in the past with WPA2 i've had a wi-fi watch that can de-auth clients so that doesn't work anymore in wpa3 is that is that correct that is correct because monitor band friends protection or protection of management frames mfp pmf will stop you from de-authentication attack and it's as simple as that and if i try to de-auth i mean that's not going to work but let's assume that even if i could capture the management frame in the past with wpat i'd de-auth the client would connect i'd capture that and then i would use a gpu or the cloud to try and crack the password that also doesn't work so that might work because pmf behavior it doesn't change between wpa2 and wpa3 okay but is that something that you can configure to stop those kind of attacks i don't think you really can okay so in a lot of my videos and i'm talking about like psk so like a home device i had like a little tp link router and i got an iphone to connect to it so what i'd use is carly linux to de-auth the the the phone right it would reconnect i'd capture the handshake and then i'd use a gpu to crack it that's no longer possible if i understand right in wpa3 so sae now it's not possible now because of difficult one-way algorithm you can encrypt it but you can't decrypt it so do you guys have like a summary about wpa3 like what's the the the sales deck if you like to an executive why you want wpa3 the quick 30 second picture okay so the simple answer is it's a lot more secure because you have management frame protection so if David's around your environment which you may or may not want trying to deal with your client devices they're going to be protected from not wearing a watch we're safe we're safe okay now his watch is not wearing his day but even if he was if we're using wpa3 with management frame protection we are going to be safe because we can't get de-authenticated from the watch because the management frames protection is going to be enabled for by default so that's safe much better than wpa2 that doesn't have it turned on or wpa1 from before and then also you asked if somehow you were able to de-authenticate the device and it did connect to one of your honeypot access points or rogue APs and you were able to capture that four-way handshake with wpa3 it doesn't use psk anymore it uses sae simultaneous authentication of equals which uses diffie hellman so even if you were to capture the device you wouldn't be able to decrypt it using one of your fancy kali linux boxes and gpus to try and bracket so basically look cannot brute force the encryption key on wpa3 personal sae not possible just for the people who don't have wpa3 yet best practice for wpa2 is make it long so the gpus even if you had big gpus it wouldn't be able to crack it right that's correct so if i capture your wpa psk personal traffic i am able to use the dictionary attacks to guess your password if that doesn't work i can start doing a brute force attack with my gpus against your encrypted traffic and if the password is short i will be able to crack it if it's longer then there is no way i would be able to crack that if i don't know the password already you guys mentioned six a band six gigahertz right so can you explain the bands and what six gigahertz is and why it's important totally i'd love to so in wi-fi since like the very late 1990s and early 2000s we've had access to two wi-fi frequency bands 2.4 gigahertz and 5 gigahertz and the thing with 2.4 gigahertz is we only have a small chunk of usable spectrum so there's uh inside of these wi-fi frequency bands we use something that's called channels and in the 2.4 gigahertz frequency band we only actually have depending where you are most places three channels that don't overlap with each other and the 2.4 gigahertz frequency band is so susceptible to non-wireless interference you're going to find things like microwave ovens bluetooth wireless non-wi-fi video cameras happening in your environment causing you interference so it's just not that much usable spectrum there however however with five gigahertz we have a lot more usable spectrums are actually up to like depending on where you are 500 megahertz of spectrum and we have a lot more non-overlapping channels so depending where you are up to 25 non-overlapping 20 megahertz wide channels which is fantastic because more spectrum but there's a whole bunch of rules we have to follow on some of those channels that could be impacted by what's called radar or dfs activity and the amount of wireless devices that are now connecting to the network if you think how many millions of billions of devices there are if you think about wi-fi in the term of you're driving along a highway or a motorway 2.4 and 5 gigahertz that gives us access to the two lanes to drive down and we have got our cars on the motorway why we need to have six gigahertz is because we got to the point where these motorway lanes are just getting too congested there's even with the five gigahertz band too many devices connecting so we needed six gigahertz but mac why do we need six gigahertz so much yeah good question so six gigahertz not only gives us more frequency band more lines on the motorway but also is less congested so it means we'll have less cars on that motorway so we not only have bigger motorways but we can also go faster on these motorways so that's very basically six gigahertz more frequency is always better and how about the europe versus states yeah so uh depending on where you are in the world you may have slightly more access to the six gigahertz frequency band so over in the u.s they actually go up to 1.2 gigahertz with additional wider spectrum they can use however us over here in europe we get an additional 500 megahertz unlucky yeah still amazing we needed that extra motorway to be able to be driving along to get us the extra capacity we need for all of these wireless devices that are coming out there so yeah it's fantastic we've got access to this but six gigahertz does bring us some more challenges because we have to think around different device classifications that's a lot of wireless channels now that we have to scan for our client devices so how do we discover wi-fi right how do we discover wireless networks there's so many channels to scan across all those frequency bands so yeah lots of uh lots of challenges with six gigahertz as well for a lot of people watching wi-fi 7 a lot i see vendors already releasing wi-fi 7 but can you guys explain like like what's important today like wi-fi 6 wi-fi 5 maybe even i don't know wi-fi 67 yep totally so to to make it quite quite short a wi-fi 5 is still relevant and wi-fi 5 is 802.11 ac it works in five gigahertz frequency bands only five gigahertz okay and then in 2021 we ratified wi-fi 6 standard and the standard from i triple e is called 802.11 ax and it defines wi-fi operation in 2.45 and six gigahertz frequency bands okay so now we have three bands it's it's a lot of bands so that's 80.11 ax to make things simple we have an organization called the wi-fi alliance that tests interoperability based on a subset of functionality from i triple e standards i know it can be quite confusing but it really isn't well it is a little bit okay i like wi-fi 6 is the wi-fi alliance interoperability name for 802.11 ax and it tests interoperability across two frequency bands 2.4 and 5 only but then since six gigahertz is available to us in most countries around the world we now can start testing interoperability of devices ax devices on six gigahertz bands and that's what wi-fi alliance calls wi-fi 6e it's still wi-fi 6 but e stands for extended and it captures six gigahertz band so again wi-fi 6 works on 2.4 5 and 6 gigahertz bands okay well wi-fi 6 tests interoperability on 2.4 and 5 wi-fi 6e on 6 gigahertz and all of them wi-fi 6 and wi-fi 6e it's the same standard 802.11 ax okay and 7 wi-fi 7 is the latest new standard of wi-fi that will be getting ratified at some point this year and what wi-fi 7 will be it actually work across 2.4 5 and 6 gigahertz so there will be big benefits to wi-fi 7 but the main benefit being is that it still supports 6 gigahertz 6 gigahertz is the future of wi-fi so wi-fi 7 the fact that it operates in the 6 gigahertz frequency band as well as 2.4 5 gigahertz that is still the main benefit of wi-fi 7 i've seen some vendors like i know we won't mention names like wi-fi 7 is the best we've got a wi-fi 7 router should i buy wi-fi 7 devices today fantastic question so the reality is that you might buy order some wi-fi 7 APs but you don't have pretty much any wi-fi 7 capable devices so if you are thinking about buying wi-fi today think about wi-fi in more 6 gigahertz categories so 6 gigahertz is still the most important thing so buying 6e today is more mature it's nothing wrong with buying 6e today and then five years from now or seven years from now whatever your cycle is to replace your APs go for wi-fi 7 or wi-fi 8 it doesn't matter as much as people think because wi-fi 6e we have six gigs already so now wi-fi 6 plus wi-fi 6e both of them combined is pretty much the wi-fi 7 wi-fi 7 adds some new functionality but basically it's almost the same slightly faster slightly more advanced functionality like in wi-fi so what's the biggest advantage of wi-fi 7 versus wi-fi 6e might being honest most likely you're going to see the biggest benefits of wi-fi 7 at home in the enterprise maybe not so much because there's this new thing called mlo which stands for multi-link operation where you're going to be able to send your traffic out of the different radios and the frequency bands of the device from the access point to the client device but how often we're going to see that in the enterprise i highly doubt it so we are going to be getting faster data rates more complex modulation so it means we can send our wireless data faster in wi-fi 7 but again just a few percent faster so now we are using 4k quam versus 1k quam exactly still the biggest benefit is going to be six gigahertz the access to the additional highway motorway lane that you get to drive down your nice six gigahertz capable cars we're talking about the future how about wi-fi 8 what's going to be great about wi-fi 8 is it coming anytime soon not anytime soon but we start to have a glimpse into what it can consist of so i wanted to but let i wanted to differentiate between home and enterprise because i think that's a good differentiation so at home if i'm going to buy a wi-fi router today or ap would i try and get a wi-fi 7 or wait if you're purchasing a wireless device now for your home or even for the enterprise you would go with the latest that you can get so at home you're probably going to find consumer grade wireless users that support wi-fi 7 but there's not many enterprise grade wireless access points out available right now that support wi-fi 7 so going for the latest that's supported with six gigahertz capabilities wi-fi 6e is still the main thing but for home it might be a little bit different with wi-fi 7 we have the mlo as you mentioned multiple link operation and it can combine multiple non-adjacent channels even across different frequencies into one massive giga channel so think of it i can have like a one channel 20 megahertz on five gigahertz two channels or six gigahertz combine them into one massive motorway and i can send my traffic that way but most clients most likely will not support it but what will support it is the home mesh systems so think about like having a main router in your living room and then satellites in your like you know bedroom one and bedroom two that's where the mlo will will be super beneficial for 7 so if you can leverage that that's that's fine but the reality is wi-fi 6 6e is fantastic okay so nothing wrong with going with wi-fi 6 and 6e today it's probably a redundant question is it worth ripping out wi-fi 6e in the enterprise for wi-fi 7 or should i just wait i wouldn't be ripping out wi-fi 6e 6gb for wi-fi 7 yeah i had a short answer i would just wanted to say no and at home no no if you have a much older device that if you can give a wi-fi 4 or previous or even wi-fi 5 then i would consider it but if you've just upgraded to wi-fi 6e and you've got six gigahertz then for me personally i don't see the benefit right now and i mean you guys have said it a few times i think i want to drive it home the piece that some people seem to forget is it's not the APs it's all the client devices that's a problem right yeah so your wireless network only works the best as your worst devices that you support on the network so if you can have wi-fi 7 access points everywhere but you bring an old really uh legacy device that's a scanner or phone that supports just 802.11n which is wi-fi 4 then when your client device connects to the access point it's only going to be leveraging wi-fi 4 technology so you have this fancy wi-fi 7 but your wireless is only going to be operating a wi-fi 4 with the worst case of the device that you've got connected to the network if you've got an home enterprise that's got just wi-fi 7 access points and and wi-fi 7 capable client devices then fantastic but there's not that many of them around right now you guys are from Ekahau you've got this fancy device here what is it and you know what does it do and what do you guys do like professionally sure so this device that you see right here is actually called our psychic 2 and it's our all-in-one measurement device for wi-fi so it scans everything in wi-fi in the 2.456 gigahertz frequency bands but not just wi-fi it also has an inbuilt super fast high resolution spectrum analyzer so as you walk around your environment not only will it detect your wi-fi access points your neighbor's wi-fi access points but if you have any interferers and getting attacked by a fly it will pick up if you've got any microwave ovens passive infrared devices bluetooth wireless non-wi-fi cameras and captures everything at the same time as you move around your environment what else is inside this device mac well the biggest battery we can take into commercial airplane so that's quite cool like a full day surveying battery life kind of thing but also it's extremely easy to take a sidekick for a walk just connect it to your phone and today you don't even need to use a map you know you don't need to scale up the map with any laser measure tools you just connect it to your phone hit the button walk around and your phone will find out the layout of your building as you walk around it will bark the walls create a floor pan for you and then a sidekick will be measuring all the wi-fi and electromagnetic rf energy stuff all around you and place all the information on the map that you can then use not only to design your new network on but also to optimize your existing wi-fi so it's never been easier i would say easy peasy lemon squeezy so last question can people reach out to you if they've got wi-fi questions and where's like twitter x where can they reach you guys yeah of course the any questions you have we would love to hear from you so you can find myself on twitter linkedin x tiktok whatever you like my user account is just at matt starling how about you and my handle is at mac daring but reach out to matt okay and also his email is so we won't yet well done so for everyone watching i'll put their links below also links to Ekahau big thanks to echo for sponsoring this video and supporting the community let me know in the comments if you enjoy these types of videos these guys really know wi-fi so i want to answer you get your questions answered so put them below and hopefully we can get you guys back for more tips and tricks on wi-fi thanks for having us mate yeah thank you davis so much for bringing us on we love to be here",
    "transcript_keywords": [
        "WiFi",
        "gigahertz",
        "WiFi access points",
        "gigahertz frequency bands",
        "access point",
        "access",
        "gigahertz frequency",
        "device",
        "devices",
        "wifi frequency bands",
        "frequency bands",
        "WiFi access",
        "bands",
        "wifi wifi traffic",
        "password",
        "wireless",
        "Yeah",
        "gigahertz bands",
        "frequency",
        "point"
    ],
    "transcript_entity_values": [
        "wi-fi 6",
        "three",
        "every five minutes",
        "wpa2",
        "2.45",
        "wpa",
        "early 2000s",
        "MDM",
        "6e",
        "2.4 and",
        "Cisco",
        "wi-fi 7",
        "wi-fi 4",
        "europe",
        "two",
        "four",
        "wpa psk",
        "1.2 gigahertz",
        "five gigahertz",
        "second",
        "wi-fi 5",
        "davis",
        "matt starling",
        "Mack",
        "2.4 gigahertz",
        "twitter linkedin",
        "wi-fi",
        "2024",
        "Wi-Fi",
        "4k",
        "giga",
        "millions of billions",
        "6 gigahertz",
        "only five gigahertz",
        "1k",
        "4",
        "the last few years",
        "2.4 5",
        "today",
        "ap",
        "wpa",
        "SSID",
        "one",
        "diffie hellman",
        "kali linux boxes",
        "2.45 6 gigahertz",
        "Sidekick 2",
        "wi-fi",
        "ac",
        "2.456 gigahertz",
        "matt",
        "Windows",
        "quam",
        "just 802.11n",
        "2.4 5 gigahertz",
        "6",
        "wi-fi 8",
        "Mac",
        "80.11",
        "WPA",
        "WEP",
        "wi",
        "IPSK MPSK PPSK",
        "Wi-Fi",
        "iPad MacBook",
        "wi-fi 6e",
        "years",
        "mlo",
        "500 megahertz",
        "this year",
        "WPA2",
        "iPhone",
        "pmf",
        "David",
        "2021",
        "WPA2",
        "seven years from now",
        "2.4 gigahertz",
        "five years from now or",
        "just a few percent",
        "5 gigahertz",
        "u.s",
        "6 gigahertz 6 gigahertz",
        "five gigahertz two",
        "First",
        "5",
        "30 second",
        "de-auth",
        "wi-fi 7",
        "wi-fi 8",
        "WPA2",
        "carly linux",
        "wi-fi",
        "up to 25",
        "six",
        "psk",
        "six gigahertz",
        "wi-fi 7",
        "Ekahau",
        "PSK",
        "an additional 500 megahertz",
        "wpa2 psk",
        "wi-fi alliance",
        "seconds",
        "HTTPS",
        "Matt",
        "2.45 and 6 gigahertz",
        "a couple of seconds",
        "802.11r",
        "Cisco",
        "Wireshark",
        "late 1990s",
        "20 megahertz",
        "wi-fi 6",
        "twitter",
        "2.4",
        "APs",
        "tens of years",
        "7"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "NORP",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "LOC",
        "FAC",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "FAC",
        "PERSON",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "LOC",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "LOC",
        "PRODUCT",
        "LOC",
        "DATE",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "FAC",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "LOC",
        "NORP",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL"
    ],
    "vector": [
        -0.05856385827064514,
        -0.03747532516717911,
        -0.037027932703495026,
        -0.04744908958673477,
        0.0664481595158577,
        0.015649251639842987,
        0.01412262860685587,
        -0.034464724361896515,
        0.030430257320404053,
        0.047649361193180084,
        0.04039160907268524,
        0.05457990616559982,
        -0.006406715139746666,
        0.02309967763721943,
        0.0722067728638649,
        -0.034802213311195374,
        0.02251073718070984,
        -0.08758068084716797,
        -0.05740121006965637,
        -0.07903286069631577,
        -0.006074809469282627,
        -0.09664200246334076,
        0.04989498481154442,
        0.020375467836856842,
        0.05164948105812073,
        -0.0033300796058028936,
        0.040052711963653564,
        0.08535383641719818,
        -0.021594958379864693,
        0.0113160265609622,
        0.006235761567950249,
        -0.015519674867391586,
        -0.05046354979276657,
        -0.07076043635606766,
        -0.023142561316490173,
        -0.11086457967758179,
        -0.03903175890445709,
        0.025647906586527824,
        -0.08638240396976471,
        -0.015648845583200455,
        -0.008367754518985748,
        -0.0590258426964283,
        -0.005556442774832249,
        0.052698004990816116,
        -0.0773732140660286,
        0.0007045163074508309,
        -0.0219077467918396,
        0.0041634622029960155,
        0.037669721990823746,
        -0.032710105180740356,
        -0.011482367292046547,
        -0.03666309639811516,
        0.009364490397274494,
        0.05729633942246437,
        -0.03204485401511192,
        -0.08050136268138885,
        -0.04546961933374405,
        0.03973130136728287,
        0.07773817330598831,
        -0.02142321690917015,
        0.04072050005197525,
        -0.06714428216218948,
        -0.013499677181243896,
        0.033460620790719986,
        0.008920768275856972,
        -0.019390510395169258,
        -0.023928534239530563,
        0.04468030110001564,
        -0.008853946812450886,
        0.037414517253637314,
        -0.037471868097782135,
        0.025054581463336945,
        0.007248053327202797,
        0.06729131937026978,
        0.024823226034641266,
        -0.005956640467047691,
        0.01844976097345352,
        0.0030186583753675222,
        -0.01947922259569168,
        -0.05210576206445694,
        0.10990794003009796,
        0.012374195270240307,
        0.005210596602410078,
        -0.049012355506420135,
        0.09407259523868561,
        -0.010380806401371956,
        -0.0708669126033783,
        -0.021023539826273918,
        -0.031811535358428955,
        0.05292767286300659,
        -0.04052344709634781,
        0.09524325281381607,
        0.08539321273565292,
        0.010729221627116203,
        0.08156704902648926,
        0.05336130037903786,
        -0.055920396000146866,
        -0.0015014044474810362,
        -0.07440884411334991,
        0.09338054060935974,
        -0.07326869666576385,
        0.026417436078190804,
        -0.04429708048701286,
        -0.01845649816095829,
        0.05690261721611023,
        -0.013805226422846317,
        0.016062866896390915,
        0.05770360305905342,
        0.1256137192249298,
        0.025815119966864586,
        -0.043186116963624954,
        -0.0430489145219326,
        -0.06652295589447021,
        0.026351341977715492,
        -0.0011469617020338774,
        0.07062855362892151,
        0.026464881375432014,
        0.08635557442903519,
        0.07131542265415192,
        0.00729103060439229,
        0.022951418533921242,
        -0.014346227049827576,
        0.07298432290554047,
        0.004913400858640671,
        -0.00485072610899806,
        -0.024701451882719994,
        0.046522289514541626,
        5.735878684109093e-33,
        0.02621285244822502,
        0.0992373451590538,
        -0.12226194888353348,
        -0.004123488906770945,
        0.011650524102151394,
        -0.050189025700092316,
        0.03171341121196747,
        -0.024539096280932426,
        -0.08472755551338196,
        -0.009691327810287476,
        -0.05564451217651367,
        -0.07059800624847412,
        -0.024407608434557915,
        -0.053789831697940826,
        0.06010640785098076,
        -0.015019564889371395,
        -0.022262146696448326,
        0.04378797858953476,
        -0.011184025555849075,
        0.13082772493362427,
        0.10364851355552673,
        -0.09655046463012695,
        -0.017183521762490273,
        0.03065602295100689,
        0.061155688017606735,
        -0.01744958758354187,
        0.007349269464612007,
        0.02327297069132328,
        0.05993795394897461,
        0.001540887402370572,
        -0.04627348482608795,
        -0.040528178215026855,
        -9.41677499213256e-05,
        -0.04386386275291443,
        0.02227272279560566,
        -0.014749284833669662,
        -0.12324731051921844,
        -0.09430105239152908,
        -0.02999872714281082,
        -0.06738324463367462,
        -0.025143785402178764,
        -0.010049552656710148,
        -0.02688046731054783,
        0.00974810030311346,
        0.05988591909408569,
        -0.0034524614457041025,
        0.01959730125963688,
        0.04718196392059326,
        -0.04289194568991661,
        0.05943961814045906,
        -0.040237974375486374,
        0.05058863386511803,
        -0.00828601699322462,
        -0.0038740665186196566,
        -0.032199468463659286,
        -0.03934971243143082,
        0.04584558308124542,
        0.039977461099624634,
        0.003704371629282832,
        -0.06252069771289825,
        0.03481060639023781,
        -0.032693833112716675,
        -0.021826013922691345,
        -0.018600694835186005,
        -0.048169467598199844,
        -0.00794574897736311,
        -0.008103283122181892,
        0.04924991354346275,
        -0.0032335466239601374,
        0.027234621345996857,
        -0.03819059580564499,
        0.007263027597218752,
        -0.003221335355192423,
        0.02239132858812809,
        -0.008152570575475693,
        -0.008356859907507896,
        -0.002925320528447628,
        0.11099530756473541,
        -0.05172581225633621,
        0.01703955978155136,
        0.01183386705815792,
        0.03103911504149437,
        0.028593884781003,
        0.06567725539207458,
        -0.08434431254863739,
        0.011998382396996021,
        0.009891063906252384,
        -0.09173144400119781,
        -0.06700705736875534,
        0.0952804833650589,
        0.04521113634109497,
        0.17206844687461853,
        0.040927380323410034,
        0.0920976772904396,
        -0.03865582495927811,
        -5.363717539980741e-33,
        -0.032713476568460464,
        0.04687494784593582,
        0.10855097323656082,
        -0.01465251762419939,
        -0.01701478287577629,
        -0.030713651329278946,
        -0.01655953750014305,
        0.004012520890682936,
        0.06935418397188187,
        -0.0037301876582205296,
        0.11107836663722992,
        -0.07395022362470627,
        -0.002501711016520858,
        -0.08713638037443161,
        0.007315909024327993,
        -0.05627976730465889,
        0.02835564874112606,
        -0.06153789162635803,
        0.010851527564227581,
        -0.10891319066286087,
        0.07964947819709778,
        0.1008395180106163,
        -0.004170052707195282,
        -0.0347297266125679,
        0.031954076141119,
        -0.013565750792622566,
        0.04807469993829727,
        0.02639189176261425,
        0.023245979100465775,
        0.04025145247578621,
        0.004059504251927137,
        -0.04005790874361992,
        -0.026256810873746872,
        -0.0158787053078413,
        0.047755081206560135,
        0.020938748493790627,
        0.0045431992039084435,
        0.05629163607954979,
        -0.0349922850728035,
        -0.019497444853186607,
        0.11476671695709229,
        0.09220315515995026,
        -0.08045350015163422,
        -0.01911298930644989,
        -0.00887149665504694,
        -0.06395149976015091,
        0.006842880975455046,
        -0.02208521030843258,
        -0.11085895448923111,
        -0.022047506645321846,
        0.0797702893614769,
        -0.013009478338062763,
        0.013901627622544765,
        0.013659763149917126,
        -0.009620674885809422,
        0.07481813430786133,
        0.02221258357167244,
        0.00736197829246521,
        0.015471224673092365,
        -0.0006781762349419296,
        0.03668291121721268,
        0.014672210440039635,
        0.028192944824695587,
        0.12075828015804291,
        0.022081956267356873,
        -0.02303510345518589,
        0.017882157117128372,
        0.10281118750572205,
        -0.039232224225997925,
        0.04957425221800804,
        -0.05342024564743042,
        -0.053310882300138474,
        -0.016266223043203354,
        0.013842988759279251,
        0.07098041474819183,
        -0.05855334922671318,
        0.05071965232491493,
        0.05737921968102455,
        -0.08503597974777222,
        -0.011784697882831097,
        -0.05136888101696968,
        0.08775926381349564,
        -0.05827188119292259,
        -0.010356913320720196,
        0.03506837785243988,
        0.03327610343694687,
        0.11593709141016006,
        0.020595047622919083,
        -0.02015274576842785,
        0.02724781259894371,
        -0.024615801870822906,
        0.008576194755733013,
        -0.04267192631959915,
        0.036773983389139175,
        0.022021843120455742,
        -5.270684866331976e-08,
        -0.0925632193684578,
        -0.005187307484447956,
        -0.03556929901242256,
        0.03114837221801281,
        -0.0618671253323555,
        -0.0030151752289384604,
        -0.04514792561531067,
        -0.1262703388929367,
        0.02695675753057003,
        -0.020842768251895905,
        -0.0037367278710007668,
        0.021497655659914017,
        -0.09672227501869202,
        -0.0336373895406723,
        -0.042786139994859695,
        -0.06626022607088089,
        -0.05788372829556465,
        -0.05338664352893829,
        -0.0200368519872427,
        0.003877698676660657,
        -0.01152075082063675,
        -0.0448431521654129,
        0.017875317484140396,
        -0.03224213793873787,
        -0.03244037553668022,
        0.0762920007109642,
        0.001812392263673246,
        0.04306362196803093,
        -0.003147606272250414,
        -0.041965171694755554,
        -0.1434575468301773,
        -0.005758484359830618,
        -0.006012325175106525,
        -0.02833997830748558,
        -0.0821244940161705,
        0.04792186617851257,
        -0.07056240737438202,
        -0.06107091158628464,
        -0.042245034128427505,
        0.06405925750732422,
        -0.024126695469021797,
        -0.01978408172726631,
        0.09701144695281982,
        -0.0006835703388787806,
        -0.0259691271930933,
        0.036895330995321274,
        -0.034759458154439926,
        -0.0015095197595655918,
        0.05109843239188194,
        -0.022675439715385437,
        -0.025824805721640587,
        -0.03408047929406166,
        0.028182273730635643,
        -0.02104380540549755,
        0.03724243864417076,
        -0.015013856813311577,
        0.08031851053237915,
        -0.06454707682132721,
        0.04407855495810509,
        -0.01972905918955803,
        0.08353797346353531,
        -0.061375778168439865,
        -0.0306992270052433,
        0.04583518207073212
    ]
}