{
    "id": "uSuySqZcEpg",
    "title": "Did HP make a Dell XPS 15 killer??? - Envy 15",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-08-26T20:25:46Z",
    "video_url": "https://www.youtube.com/watch?v=uSuySqZcEpg",
    "category": "Science & Technology",
    "tags": [
        "Dell",
        "HP",
        "Envy",
        "XPS",
        "Laptops",
        "Review",
        "Nvidia",
        "Gaming",
        "OLED",
        "Screen",
        "Resolution",
        "2060",
        "Intel",
        "10th Gen",
        "Affordable",
        "Budget"
    ],
    "views": 996067,
    "likes": 29554,
    "comments_count": 1857,
    "description": "So we subtly have stated the Dell XPS 15 is the king of laptop this year, but HP released the HP Envy that is technically better... and CHEAPER?!?!   Buy HP Envy 15 On HP (PAID LINK):  On Amazon (PAID LINK):  On Newegg (PAID LINK):  On BestBuy (PAID LINK):   Buy Dell XPS 15 On Amazon (PAID LINK):     On BestBuy (PAID LINK):   On Newegg (PAID LINK):  On B&H (PAID LINK):    Buy iFixit Pro-Tech Toolkit on Amazon (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/0R3LlH",
        "https://geni.us/6Geu5NV",
        "https://geni.us/PEdQEG",
        "https://geni.us/rAtJFv",
        "https://geni.us/YU50V",
        "https://shop-links.co/1725431986576159797",
        "https://geni.us/2Y1AP6k",
        "https://geni.us/NbAOx",
        "https://geni.us/pALf",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- This is the Dell XPS 15 and in many ways, it's my favorite laptop. I've actually been using it since the review, but HP thinks that they can beat it. Or I think HP might be able to beat it with this right here. It's the ENVY 15 and it has an RTX 2060, an i7-10750H. And ,it's $500 cheaper than this guy. So let's get into it. I think it should be good. Or maybe not, I don't know. It's always scary comparing it to like an XPS 15 this is awesome. You can see it right there, right from the get go. How much power can we expect? All right, right off the bat, we have a 200 watt charger. So, that's really great. Cause this has very similar specs to the XPS 17, which only comes with a 130 watt charger that actually isn't able to keep up with the RTX 2060 and the i7 that's in there. I think this right here won't have that problem though. Aside from that, there's not a whole lot in here. We have, your computer has a pre-installed battery, plug in the adapter before you power it out. Okay I can't do that. Here we are, ENVY 15. How heavy is this? It feels surprisingly light given that it's not exactly small. Turns out it's 2.1 kilograms or 4.6 pounds, which is actually the exact same weight pretty much as the XPS 15, for whatever reason, it feels slightly lighter in my hands. It's less dense I guess, has a very nice, I think it's all aluminium. We'll see when we open it up, but there might be some plastic around, but I think it's mostly aluminum. You get a lot of ports. So on this side you have two Thunderbolt, three, a full sized HDMI and a USB type A, along with a micro SD slot, I do kind of wish that they had a full size one, but then again, you get this other stuff here, so can't complain too much. And on this side, you just get a single USB type A and a headphone combo, jack yes. That's actually very impressive IO. I'm almost, I'm surprised they don't have little floppy thing on the side, given how thin the whole thing is, but anyway, let's get into it. There it is. It's a laptop, It actually has, I think it was 82 and a half screen to body ratio, which is pretty good. It's obviously not going to be quite like the XPS 15, which does have the 16 by 10, that brings it all the way down here. But, the screen does have, you know, it has that extra little bit of good, good, because it is a 4K OLED touch, even though you might not be getting, you know, the full 16 by 10 goodness, you are going to have just the deepest blacks that you can find on any screen. So just initially looking at it, the track pads, it's a pretty good size, especially compared to some of HP's older stuff, but it's not massive like what you get in the XPS 15. Like if we look in the top down here. Yeah, It's, it's dwarfed. That said, I think that this is big enough that as long as it tracks well, you're not gonna really have any issues with it. It's a bit. Not ideal, overall though. Chassis stiffness is excellent. The actual rigidity of the screen is great. Just the, the feel of the laptop overall. Yeah, no twist at all. It's very solidly built and we do have to remember that this is HPS ENVY lineup, which is not quite there like top tier ball and specter stuff. This is, their more like you have just a couple of small compromises in order to get something that's, you know, well, it's 1500 bucks. Like that's not cheap, but at the same time, what you're getting, it seems like it's not bad. Oh, I didn't even notice before, there's barrel connector right here for power instead of delivering it over USB C. So that is mildly annoying. Cause one of the things that I love on certain laptops stability to like plug in right there or, you know, charge it from the other side. It's awesome. But at the same time, you know, we also have a 200 watt power brick and it's not gonna lose battery life while you're doing heavy stuff. Oh, fans are definitely announcing their presence. OLED screens just look so good. It just never fails. Actually this is like kind of one of the worst showcase wallpapers I've ever seen. I don't know if you'll be able to pick up on it here, but it's, it's just kind of grainy and awful and it makes the OLED screen look, not nearly as good as actually as like, if you look at these icons here, they're just so crisp and perfect. Whereas all of up here, it just kind of looks like whoever made this, just took the ice out and was like, let's try and get something better there. Okay, now I'm confused. I'm not totally sure if something's wrong, but just looking at the screen, it kinda looks almost dirty in some spots. I think it's a problem with the screen, because this is something that I saw on some of the earlier, OLED's from like razor and Dell. They had just kind of odd artifacts. I think it has to do with the way the pixels are aligned up. I'm going to grab a microscope and come back. I wanna actually figure this out. Okay, so it does seem like this is the same Samsung panel that we would have found on the other like Dell and Razer laptops that I found a similar problem like this too. So let's just have a little gander here under the microscope. Okay, so we can now see the pixels that are on this display. And I'm curious if they're doing some sort of a cheating or if it's just that the actual like, OLED pixels are just too small for how close I am to the display. You can very clearly see if there's a bunch of little like black areas. And also that the blue pixels are much larger and then they have more red and green ones because I think your eye is more like attuned to those frequencies. Does that make sense, Brandon? So now let's take a look at the XPS 15. There we go, so you can very clearly see this is at the same magnification as the last one, that on the Dell, there's a lot less general space and gaps. So I feel like that the sort of like dirtiness that I'm seeing on this screen is just simply a result of how the panel is laid out, voiceover Alex here. So it turns out the problem I was experiencing was the screen door effect. This is when you're too close to a display and you're able to see the individual sub pixels instead of your brain, just thinking it's a solid color. This is really common in VR headsets. Looking at the microscope footage, we can see the individual pixels on the ENVY's OLED panel are a lot smaller and have a lot more black space around them than the Dell XPS's IPS panel. This combined with mediocre gray uniformity is why the OLED panel looked dirty while displaying solid colors. Getting back on track here, let's look at something that you might actually do on this instead of just like pixel peeping, a gray screen. It does, It just doesn't look as good as I want though. I'm guessing it's not an issue at all. Once you start watching something. Oh yeah, this looks awesome. So in a darker scene like this, where you have just like a lot of darkness and then just like little bits of light, the image is just popping out. You're not actually going to be able to see it because it's like looking at a screen through a camera on your screen. That's probably not an OLED, but either way it looks awesome just trust me on that. Yeah, on something like this, when it's not just a full screen of like mostly solid colors. You can't tell that like they kind of cheated on those blue pixels. Given how good HP speakers have been in their like little 13 inch laptops. I'm hoping that these are excellent, but we'll see soon. (lively music) The clarity at first. Is awesome. Damn, yeah. I can dig that. Oh, the Dell's better. Well, that didn't last long. This is still excellent though. It just doesn't quite have the deep like the Dell has and the Dell also loses the marks. So, you know, it's probably like third place, which isn't bad. It's still on the podium. Now this is short circuit. So we're not going to do any detailed benchmarks. If I had to guess this is going to be very similar to the XPS 15 and like CPU benchmarks. So that's, you're like rendering, if you wanna do Photoshop or most video editing as well, it's going to perform very similar on the two. Whereas the HP ENVY 15 is going to definitely beat out the XPS 15 when it comes to GPU benchmarks because that 2060 is just, it's just more powerful. That's the fact and it's cheaper. But anyway, I'm really excited to see the cooling system in this cause apparently, they just went in straight up thief the cooling system from their HP OMEN line of gaming laptops. So let's see what it's like. Yup, that's aluminum. Very nice, It's not, you know, like a super solid piece, but at the same time, it's still very impressive. Especially given the price point of this thing. Anyway, in here, the upgradability looks great. So we have our one M.2 SSD over here. And then on this side, there's easy expansion for another one. You also get an 83. Yeah, an 83 watthour battery. So that should be, they claim you'll be able to get 18 hours of battery life. If I had to guess it's 10, 10, nine, or something like that. And, do we have upgradable Ram right here? We do, there's one, and another one right under there. This actually looks like it's the graphite cheating that we did a video on a little while ago that works terribly for CPU cooling, but this is where you might actually wanna use it. The real star of the show though is right here. Actually I'm gonna take it off, screw it. We have a big old vapor chamber from all the way up here, over and across they cool CPU and the GPU. I'm just really surprised actually, that HP was able to cram a big old vapor chamber and a more budget notebook like this one. Oh, I'm doing this completely out of order. Actually you should get subscribed to LTT if for whatever reason, you're not because we have a whole video on why vapor chambers are just awesome coming up fairly soon. Well, not, not super soon. I haven't written it yet. So it's a while out. Oh yes. Huh. Wow, that's kinda weird. It looks like they added in, extra little heat sync stuff here. That's not actually connected to anything. It must just be, so it has a more uniform look when you sort of open it up, or just like, whatever cool, I guess, but the real star of the show is this guy right here. I'm just, it's so awesome that they're able to fit vapor chamber cooling in a laptop, this slim, and also just like not targeted at gamers. Like it's awesome to be able to see the like ,gaming notebook influence making its way into professional designs like this. So you're able to actually like get that power and really harness it in ways that a lot of the times there was kind of like, yeah, whatever. It's not a gaming notebook screw you, you don't get that much power. It's funny way, yeah. I think this is an awesome little laptop. It's so cool they're able to fit this much power into something for one like this small and also into, you know, something that's okay. It's, it's not cheap guys, It's not cheap. It's 1500 bucks, but at the same time, this is 2100 bucks and it's not as fast. So, there you go. You kind of depends on what you're looking for. I wouldn't say that one's necessarily better than the other, but this is a really strong option. If you're looking for just like a good old windows machine to do all of your stuff. So hit like, get subscribed. Yeah, have a fantastic day. I'm about to unbox another very powerful laptop.",
    "transcript_keywords": [
        "XPS",
        "screen",
        "Dell XPS",
        "OLED",
        "Dell",
        "Dell XPS IPS",
        "kind",
        "good",
        "Yeah",
        "awesome",
        "ENVY OLED panel",
        "ENVY",
        "pixels",
        "power",
        "lot",
        "laptop",
        "stuff",
        "OLED panel",
        "ENVY OLED",
        "OLED screens"
    ],
    "transcript_entity_values": [
        "500",
        "82 and a half",
        "XPS 15",
        "15",
        "Thunderbolt",
        "three",
        "HP",
        "4",
        "one",
        "USB",
        "17",
        "4.6 pounds",
        "Alex",
        "2100 bucks",
        "LTT",
        "XPS",
        "2060",
        "IO",
        "USB C.",
        "130 watt",
        "13 inch",
        "Samsung",
        "nine",
        "IPS",
        "third",
        "18 hours",
        "2.1 kilograms",
        "10",
        "Brandon",
        "first",
        "2060",
        "16",
        "Razer",
        "two",
        "a fantastic day",
        "Ram",
        "OLED",
        "GPU",
        "a little while ago",
        "10",
        "200 watt",
        "XPS",
        "SD",
        "1500 bucks",
        "CPU",
        "jack",
        "83",
        "ENVY",
        "Dell"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ],
    "vector": [
        -0.12361317127943039,
        0.02086651138961315,
        0.05424971133470535,
        -0.047690924257040024,
        0.09242847561836243,
        0.019725967198610306,
        -0.00561608886346221,
        0.021897027269005775,
        -0.018251998350024223,
        -0.008480386808514595,
        0.08183880895376205,
        0.07685225456953049,
        0.10142160952091217,
        -0.02817581780254841,
        0.04103203862905502,
        0.040634218603372574,
        0.05296066030859947,
        -0.08763300627470016,
        0.011926739476621151,
        -0.027600955218076706,
        -0.07008707523345947,
        -0.10082058608531952,
        -0.011376459151506424,
        0.029399532824754715,
        0.06011867895722389,
        -0.03700866922736168,
        0.014453032054007053,
        -0.06238899379968643,
        -0.07120295614004135,
        -0.01782761514186859,
        -0.0404500775039196,
        0.05845586955547333,
        -0.029187187552452087,
        -0.03204536810517311,
        0.020348023623228073,
        -0.04954995959997177,
        0.022064927965402603,
        -0.08877265453338623,
        -0.04146267846226692,
        -0.1058821901679039,
        -0.031058432534337044,
        -0.07832510024309158,
        -0.11281067132949829,
        0.07178515940904617,
        0.05112466216087341,
        -0.030439794063568115,
        0.01297491043806076,
        0.0195819940418005,
        -0.0534188374876976,
        0.017796771600842476,
        -0.04427425563335419,
        -0.06184873729944229,
        0.08679334819316864,
        -0.0499170683324337,
        -0.010688764974474907,
        0.015467572957277298,
        -0.018821856006979942,
        0.013731319457292557,
        0.025820080190896988,
        -0.01752694696187973,
        0.014460286125540733,
        -0.10570723563432693,
        -0.08186012506484985,
        0.05097891762852669,
        0.0031827916391193867,
        -0.032138802111148834,
        -0.0325283519923687,
        -0.002826874842867255,
        -0.11231641471385956,
        0.028486574068665504,
        0.030202580615878105,
        -0.012217242270708084,
        0.07238893210887909,
        0.049099478870630264,
        0.014948064461350441,
        0.022622238844633102,
        0.04876238852739334,
        -0.031113285571336746,
        0.04088364541530609,
        0.03840053454041481,
        -0.0378275066614151,
        -0.021679524332284927,
        -0.037244949489831924,
        0.0063696918077766895,
        -0.015791280195116997,
        -0.031065061688423157,
        -0.0026438443455845118,
        -0.006366366986185312,
        0.003118176246061921,
        -0.04948366805911064,
        0.043443743139505386,
        0.07755197584629059,
        -0.00870401132851839,
        0.034984782338142395,
        0.0023363581858575344,
        0.007716902531683445,
        -0.0015718094073235989,
        -0.003316887654364109,
        0.006020143162459135,
        -0.03824928030371666,
        0.04983310401439667,
        0.05145132914185524,
        0.06571321934461594,
        -0.10023608803749084,
        -0.036861930042505264,
        -0.09164481610059738,
        0.013735482469201088,
        0.08035627007484436,
        0.041624341160058975,
        -0.025221921503543854,
        -0.06363674998283386,
        -0.04468658193945885,
        -0.0015175050357356668,
        -0.07584206759929657,
        -0.04118671268224716,
        0.04379713535308838,
        -0.03737355023622513,
        -0.01523579191416502,
        0.10778772830963135,
        -0.04650820791721344,
        0.022288255393505096,
        0.03497341275215149,
        0.009830145165324211,
        0.026497120037674904,
        -0.018347125500440598,
        0.02839934080839157,
        -0.11812687665224075,
        1.3077060575501088e-33,
        -0.0053377896547317505,
        0.0570102259516716,
        -0.05962267518043518,
        -0.09820098429918289,
        -0.03134629875421524,
        0.0357520617544651,
        0.04725953936576843,
        -0.026740696281194687,
        -0.07876574993133545,
        -0.013528933748602867,
        -0.08480887115001678,
        -0.02832946553826332,
        -0.04431135579943657,
        -0.027055835351347923,
        0.05535285919904709,
        -0.02176562137901783,
        -0.03060462325811386,
        0.030330440029501915,
        -0.012478469870984554,
        0.009974352084100246,
        0.028121666982769966,
        -0.009882212616503239,
        0.04668735712766647,
        -0.07418633997440338,
        -0.018643217161297798,
        -0.05433361977338791,
        -0.07796089351177216,
        0.007760534528642893,
        0.05282767489552498,
        0.016621317714452744,
        -0.0407276526093483,
        0.013575668446719646,
        0.0008145979372784495,
        -0.01369543094187975,
        -0.04038116708397865,
        0.007683084346354008,
        -0.00631666136905551,
        -0.08005547523498535,
        0.03865527734160423,
        -0.03822238743305206,
        -0.032430119812488556,
        0.07806511968374252,
        0.0208828654140234,
        -0.08922047168016434,
        0.044584523886442184,
        0.056262824684381485,
        -0.11195105314254761,
        -0.01340092159807682,
        0.051764581352472305,
        0.018443889915943146,
        -0.07129143923521042,
        0.017372800037264824,
        0.014201290905475616,
        -0.045022591948509216,
        -0.04163629934191704,
        0.07366836816072464,
        0.04109647870063782,
        0.006291360128670931,
        0.06390530616044998,
        0.07753998041152954,
        0.04041703790426254,
        0.010305140167474747,
        0.04003551974892616,
        -0.06546151638031006,
        -0.07331445068120956,
        0.03339868411421776,
        0.11165609955787659,
        0.026269474998116493,
        -0.10244591534137726,
        0.08574483543634415,
        -0.020656729117035866,
        -0.005220741033554077,
        -0.009740501642227173,
        -0.07008478045463562,
        0.05719196796417236,
        -0.008733276277780533,
        -0.09292244911193848,
        0.02620932087302208,
        0.040517766028642654,
        -0.00806758739054203,
        -0.04858839884400368,
        0.05068684741854668,
        0.037519942969083786,
        -0.007302161306142807,
        0.02353684790432453,
        0.004277486354112625,
        -0.04137615114450455,
        0.020524291321635246,
        0.03208683058619499,
        0.011502457782626152,
        -0.014736730605363846,
        -0.060246799141168594,
        -0.040912315249443054,
        0.05433664843440056,
        -0.002137618139386177,
        -5.0155901125389205e-33,
        -0.07626505941152573,
        0.017385881394147873,
        0.0516241118311882,
        0.04940853640437126,
        -0.03809785470366478,
        -0.010904975235462189,
        -0.013929466716945171,
        -0.01237966027110815,
        0.028153223916888237,
        0.004984165541827679,
        0.06236854940652847,
        0.08357503265142441,
        -0.04940761253237724,
        0.02919706329703331,
        0.05236048996448517,
        -0.014009750448167324,
        0.011500723659992218,
        -0.10615580528974533,
        0.044955428689718246,
        -0.032573383301496506,
        0.041899122297763824,
        0.017497405409812927,
        -0.01591133326292038,
        0.061948012560606,
        -0.011601689271628857,
        -0.0002748454571701586,
        -0.011539156548678875,
        -0.015262512490153313,
        0.02284427545964718,
        -0.009499575942754745,
        0.046143051236867905,
        0.0006999843171797693,
        -0.0002702927158679813,
        0.08718588203191757,
        0.11772029846906662,
        -0.03149555251002312,
        -0.018999814987182617,
        0.03497665375471115,
        0.06853596866130829,
        -0.037999704480171204,
        0.05798161029815674,
        -0.05338019132614136,
        -0.012423929758369923,
        0.01731816865503788,
        0.029448650777339935,
        -0.012027214281260967,
        -0.0013617174699902534,
        -0.14820826053619385,
        0.043046966195106506,
        0.014050365425646305,
        -0.0544842928647995,
        -0.03424643725156784,
        0.034005306661129,
        0.03984128311276436,
        -0.09389086812734604,
        -0.06178513914346695,
        -0.08888711035251617,
        0.07953351736068726,
        0.05264594778418541,
        -0.057615481317043304,
        -0.0016855946741998196,
        0.05008874088525772,
        -0.025787994265556335,
        0.03122062236070633,
        -0.032972387969493866,
        0.020409131422638893,
        0.018460476770997047,
        -0.029063783586025238,
        -0.015744317322969437,
        -0.050265081226825714,
        -0.0764198899269104,
        0.0015588204842060804,
        -0.07772622257471085,
        -0.11524651944637299,
        -0.09263259172439575,
        0.03245173767209053,
        -0.00043715749052353203,
        0.011848348192870617,
        -0.07319782674312592,
        -0.006546161603182554,
        0.012314737774431705,
        0.01731214113533497,
        0.03661232069134712,
        -0.036010608077049255,
        -0.00615356769412756,
        0.005935339257121086,
        -0.03301982954144478,
        -0.04372308403253555,
        -0.05203926935791969,
        -0.004263465292751789,
        -0.028793644160032272,
        -0.015245039947330952,
        -0.03812330216169357,
        0.04188660904765129,
        -0.02035043016076088,
        -5.4000448557189884e-08,
        -0.010248051024973392,
        0.01990656368434429,
        0.04371191933751106,
        0.05360168218612671,
        0.05665736645460129,
        -0.09104308485984802,
        0.007261347491294146,
        0.08941857516765594,
        0.07686055451631546,
        0.12954337894916534,
        0.04301626235246658,
        -0.11839286237955093,
        -0.051352474838495255,
        -0.05237504839897156,
        0.022063598036766052,
        -0.029681535437703133,
        -0.009493488818407059,
        0.07265116274356842,
        0.019511930644512177,
        -0.03569045290350914,
        0.009400761686265469,
        0.06266031414270401,
        0.10445228964090347,
        -0.0212013591080904,
        0.039594925940036774,
        0.02247712016105652,
        -0.018155254423618317,
        -0.07047750800848007,
        0.06593240797519684,
        -0.06395089626312256,
        -0.01651114597916603,
        -0.012445516884326935,
        0.0643559992313385,
        0.02095591090619564,
        0.04022706300020218,
        -0.047846805304288864,
        -0.0022203789558261633,
        0.062104564160108566,
        0.08997783064842224,
        0.04354111850261688,
        -0.025296097621321678,
        -0.015009544789791107,
        -0.038509663194417953,
        -0.008997281081974506,
        0.07657548040151596,
        0.026078447699546814,
        -0.04725681245326996,
        -0.12773804366588593,
        0.0351712629199028,
        0.018607955425977707,
        -0.00924233440309763,
        -0.042940784245729446,
        0.0706881433725357,
        -0.04630844295024872,
        0.032897692173719406,
        -0.0267388503998518,
        -0.015360094606876373,
        0.07126788049936295,
        0.035268787294626236,
        0.063724584877491,
        0.08908400684595108,
        -0.14754877984523773,
        0.019654732197523117,
        0.07236099988222122
    ]
}