{
    "id": "uUkEbcVU9eM",
    "title": "I Upgraded His Car While He Was On Vacation",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-05-07T17:01:09Z",
    "video_url": "https://www.youtube.com/watch?v=uUkEbcVU9eM",
    "category": "Science & Technology",
    "tags": [
        "Honda",
        "Civic",
        "Power Windows",
        "Power Locks",
        "Sound Deadening",
        "Dynamat",
        "Kilmat",
        "Xenon Headlights"
    ],
    "views": 1391932,
    "likes": 60767,
    "comments_count": 3049,
    "description": "Try Pulseway FREE today, and make IT monitoring simple at:   For the cost of a single monthly payment on a new 2024 Civic we upgraded Plouffe's 2004 Civic with a bunch of modern amenities.. plus special Linus surprise.  Thank you to RetrofitLab for supplying the Honda Civic 2001-2005 Bi-Xenon HID Light Upgrade Kit. Buy it here!   Discuss on the forum:   Buy a Biltek Power Window Conversion Kit:  Buy Kilmat Car Sound Deadening Mats:  Buy Dynamat Car Sound Deadening Mats:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 0:55 - Pulseway! 1:08 - The Plan 1:54 - Cabin Air Filter 2:39 - Headlights 4:14 - Sound Deadening 5:50 - Power Locks 7:24 - Power Windows 8:28 - Painting 12:12 - Finishing up Montage 13:00 - The Reveal 16:14 - Pulseway! 17:02 - Outro",
    "description_links": [
        "https://lmg.gg/LTT23",
        "https://lmg.gg/CyuAa",
        "https://linustechtips.com/topic/1569451-i-upgraded-his-car-while-he-was-on-vacation/",
        "https://geni.us/z75m",
        "https://geni.us/4y1c0",
        "https://geni.us/HMMvVh",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Plouffe from the writing team is about to go on vacation for a week, and Honda Canada has graciously offered to lend him a 2024 Civic Touring. Now, of course, he doesn't get to keep it unless he spends a lot of money, and Plouffe here does not like to spend money. Unless it's on his PC. But that got us thinking. Now that he's added taste to modern features like remote keyless entry, power windows, and a quiet, comfortable ride... It's gonna be such a disappointment for him to come back to his reliable sh*t box. Thankfully, Alex here has generously agreed to help me bring his old Civic up to speed by the time he returns. Though, you can't have something for nothing, and to keep the rest of the company from getting jealous, his upgrade is gonna come with a catch. Oh boy, these are really big chunks. Like I \"catched\" this segue to our sponsor. . Pulseway. They're the headache-free IT monitoring and management software with instant alerts, auto remediation, plus server and mobile device management. Try it for free and get 40% off all plans, including month-to-month options. Modern cars are packed full of cool features and shopping for them can be a lot of fun, but with a block of cheese costing an arm and the interest on it demanding one of your legs these days, there's a pretty good chance that you're gonna go straight from the online configurator to Figuring out how to keep your beater alive for a couple more years, but that doesn't mean that you need to live without modern amenities Last time we added Android Auto and a backup camera to Plouffe's 2004 Civic and this time we're gonna be adding new headlights Acoustic dampening, power windows and remote keyless entry all for less than one Monthly payment on a 2024 model at that budget things are obviously gonna get a little bit diy and janky and we're gonna get to that in a moment but first we want to make his old civic smell like the new civic it's about to become with a cabin air filter if you don't remember the last time you replaced one of these by the way do it now while the exact mechanism for this might vary a little bit it's pretty standard to find the filter inside your glove box or rather in behind it let me just get this out whoa hey and all we got new is open this little panel boy here and you is that a bug how did chunks this big get in it though to be clear i'm not judging him i don't think i ever replaced this on my old civic with all of that said the activated carbon filters that we went with were only 13 dolars which is a pretty small price to pay to not be inhaling that diesel particulate from the coal roller in front of you next up is something you might not think of as a tech upgrade unless you watched the recent veritasium video on the development of the blue led that's right headlights now our first plan was to just buy some cheap led lamps chuck them in there polish the housing and realistically that would have made a world of difference but it also would have risked blinding other drivers on the road and we really didn't want to recommend that so we're going to upgrade to some xenon lights instead The only challenge is that in order to use these we needed to remove the front bumper in order to remove the existing headlights We were concerned that would take a very long time But as it turns out it was held on by two bolts and a bunch of zip ties Thank You Plouffe's cars previous owner What we need to do now that it's all taken apart is remove the lenses from the lights using this box and a heat gun Which has been sitting here for about 15 minutes now, I think let's see if the adhesive is sufficiently loosened Shout out retrofit lab, by the way for these replacement lights. These look flippin like space-age technology compared to what's in there Hello, how you doing? This was the point where we realized that our projector lenses were for a JDM Civic So we ended up needing to modify the housing slightly with a step drill the covers also need a little bit of trimming but we expected that once we knew what we were doing the second conversion only took about 15 minutes after getting the lens off and looked a little something like this it's pretty sick oh my god now it's time to turn our attention to the old-fashioned window rollers and the lack of power locks and while we're in this panel anyway it's a perfect time to throw in some sound deadening for about 100 bucks and an afternoon of work you can sound dead in your trunk and doors which makes a huge difference to the comfort of your ride the best part is that not only is this going to help with road noise but it'll help improve the performance of your existing audio system without needing to perform any other upgrades and somewhat unintuitively it'll help improve the performance of your hvac system because it happens to be an insulator dynamat is a really great premium option but jake and alex have both used cheaper stuff in their car and found that it works nearly as well for about half of the price so we're going to be using this killmat and the first thing we need to do is clean any surface where we're planning to apply it using isopropyl alcohol and a rag or in our case quite a few rags because Plouffe's trunk was quite dirty next up figure out where you're going to apply it if you have an unlimited budget then by all means put it everywhere but otherwise alex recommends just kind of giving her some little knocks and finding the spots oh yeah where it really resonates and focusing on those first we peel the adhesive backing off just be careful with the aluminum it can cut you and i guess it doesn't have to be like perfect perfect right i mean it's Plouffe's car we put this boy in here and give her a little rolly roll to make sure she's stuck down in tricky spots i like just the back of a trim removal tool it's worth noting that getting into the trunk to do this is entirely optional now it's time to address one of Plouffe's biggest pain points with this car the lack of power locks and we're going to be using this kit from Audiovox that attaches to the locking mechanism or at least that was the plan my notes say honestly kind of janky seems like it won't work costs a hundred dollars you we ct scanned it we ct scanned it and i don't really know how much i want to use it anymore like if you look first of all everything in there's plastic and uh this is the shaft that does the actuating yes as we go through it here oh it's got air bubbles in it 40% of its air we have seen in some reviews that they have a bit of problems with failing it's pretty clear why the installation at least on the front doors is a literal nightmare to deal with you'll have to stick it in behind this panel here and we gotta somehow bolt it into here and then attach this rod to the stock rod here so we can retain the stock locking mechanism at the same time which will require a bunch of custom bending to the rod that's attached to the actuator a lot of work for something that's potentially going to break within a couple of months so the proper way to do this would have been to just go to the junkyard and get the door cards and basically the entire door from a civic that has central locking and power windows but that was going to be kind of expensive so that's why we wanted to try and do it the cheap way which has burned us do you think he can do it oh yeah it can be done how much overtime do you want to pay us how bad are the back doors are the back doors are dead simple it's just the price i'm leaning try and if it kind of sucks then maybe he should have paid for his car to be fixed by someone qualified or just paid for a better car i mean all of this seems like Plouffe problems right now the other big thing we promised Plouffe was power windows so we'll show you that on the other door which um this is what like just vapor barrier yeah it's a vapor barrier so it kind of keeps moisture in the door not in your car we're just pulling it off like yes but at the same time like look at how much is left of this one oh it's been cut yeah this car's had a lot of people in it already with that out of the way it's time to look at our power window kit which we got off amazon for 100 bucks it comes with a variety of different toothed gears you just pick the one that works with your car door and then insert it into the end put in a little locking screw and find a spot for it somewhere Now we're at the point in the video where Alex's expertise ends and mine begins. It's time to paint. I do have enough expertise to know that this is not prepped well enough. No, it's really not. This scuff sand is good enough to make sure that our primer coat is going to adhere to the previous paint, but it is not enough that we're going to get a perfect mirror finish on the car. Realistically though, it's gonna be better than what he started with. Yeah, it's not hard. Another thing that Alex knows very well is that the first step of painting is to put that painting equipment away and focus on prep. Even though we don't need this to be the most perfect job in the world, we don't want to paint over his tail lights. So with the combination of masking tape, paper, and plastic, we'll be blocking off all the areas that we don't want to paint. Now, this. is not the right tape for this. I asked for contouring tape. I ended up with this. So enjoy your paint job, Nick. Also, we were planning on taking these out, but they're also among the things that are not original and they are just silicone in there all the hell. It's horrible. They're not coming out. I think one of the most important things for painting is accepting early on that it isn't gonna be a perfect job. When you do that though, it's just a completely different set of expectations. It's more fun. Yeah. Now I'm sure at this point at least a few of you have noticed that we are standing next to a DIY paint booth You're probably wondering why we're not using it. Well in a perfect world we would I've got a HEPA filter in here and Positive air pressure that prevents any shmoo from landing on the piece of work that's being painted while it's drying Which results in a much better looking job. Unfortunately This is for my motorcycle. It is not car sized so Sorry, Plouffe. Hey, at least we didn't do it outside like we were planning. Yeah. Are you guys ready for the moment of truth? I think so. How many feet feet because it's not gonna be a five- foot job 12. That's pretty good I was expecting 20 this morning. I'm feeling better We're referring of course to the distance from which you'll be able to make out the obvious imperfections in the workmanship I mean overall not too bad But there are gonna be some flies in this ointment 1.8 to 2 millimeter nozzle Good gravy. This stuff must go on thick. Hold on. Let me have a look at my primer Screw it. We're using your primer. This is my primer. Okay Damn boy. She's thick. It might be a 20-foot job It's like high build primer is something that I have never used before and have not researched at all because for my project I'm doing all the finishing first before I prime now most of my painting experience is painting houses not cars this is my first time spraying a car so if you're an expert thanks for your comment telling me all the things that I could do better when I do my bike I'll be sure to do all those things all right let's see how it goes oh boy well it's a good thing please doesn't care about his car looking good I wish I'd used the other primer but we're committed now Well, even if it's not going to be pretty, it's not going to come off, so that's something. All right, whether it's the settings or the material we're using or the technique, it's not that even, but on the plus side, it's a product that'll adhere better than the last time we painted a Civic. And it's probably more even than rolling it on. At least our customer's not picky. We're back from Linus's and the paint job looks better than I expected after the first layer of primer at least, but we have a lot to do. First of all, secure the light ballast, aim the headlights, the locks, we need to get those working. Right now they're just not working at all, but the two systems individually are working. I don't know, we have an electrical engineer here. We also need to clean up the wiring, install the back seat, top up the oil, do the door cards, trunk liner, the other stuff that needs to go into the trunks, the rear lights, those need to be hooked back up, random trim pieces, those all need to get on, outside trim needs to go on, hubcaps. Ensure that it won't catch on fire. Just, you know, do a little look and make sure that everything is fused properly and a bonus, EQing the stereo. Plouffe, we'll see you soon. I am nervous, but I am excited. Tell me when Oh my God, what an absolute unit. Can I look? Yep, you can look. What? It's beautiful, isn't it? I love purple. How did you, oh my God. Purple and gold flake. That's amazing. I thought it was gonna be like pink and green or something. I love how textured this is too. What'd you guys use? We got some filler primer. Yeah. And the filler primer, you're supposed to use 20 PSI of line pressure. Okay. And Linus only has nine. So that's why it's textured. You know what? It adds to it. Yeah. Did you look here? Ooh, they look much more clear than they usually were. Beyond that, look in. Oh, the HID? Xenon. Xenon! What brighter this thing's gonna get? So I can be like the on the F*** other side of the road that blind me. I can blind them back. No, we just aimed them. Like up? No, down. You won't blind people. I wanna blind people. Okay. Well, yeah, that's a good, you should calibrate them. I mean, all right. I got racing stripes. Oh yeah. Where's the key? Amazing. Look at this. Whoa! It can lock and unlock? Okay, I'm gonna try it. The locks work! It's all four too? Yeah. So now when like some spooky homeless guy walks by, I can just lock all my doors. Yeah, probably. I don't know how much I trust it, if I'm honest. Yeah. Oh my God, you actually, I mean, it's, look, it's very slow to go up. Yeah, we need to grease it a bit. Okay, but it works. This one's much better. Okay, so that's how it could be. Amazing. Do you want to open up the trunk and just have a little look? Sure, what's in the trunk? Quiet. There's not much. All of the panels. It's all done. Why? Kill a mat, we're cheap. Killmat, we're cheap. All right, let's take her for a ride and see if you can notice any NVH difference. Oh my God, okay. It's hard because I haven't driven in it almost like three weeks. How does it compare to the 2024 Civic? It's actually pretty similar. And I thought that that sounded a lot better than this thing. So kudos, it seems to have worked. It'll probably be more noticeable when you're on like a slightly rougher road. Yeah, or even just like the highway and I'm doing like a hundred or something like that. I am genuinely like thrilled, honestly. I thought for sure it was gonna be like a hot pink and like a lime green. So honestly I love purple this feels this is great. It sparkles so much too. Does it really? I'm excited. This is the first time I've seen it in the sun and it's great. It's beautiful. What a magnificent beast you guys have created. With what we've done I'd say those power windows super easy they just worked and they weren't super hard to install. I would do that. Those locks oh my god I hate them and I think they're going to just stop working at some point in the near future. Don't do that. Dynamat just do it and this paint job. Even though it was two car payments instead of the one for the rest of the stuff, man, worth it. It looks amazing. I have zero complaints. You know, everyone, people saying stuff like, oh, you're gonna hate it, blah, blah, blah. Had me worried, but no, you guys crushed it. The headlights, you almost forgot about the headlights. They look amazing. Well, I don't know yet, but when is it dark out? Now I'll be the one blinding people. Just like this blinding segue to our sponsor. Pulseway. It's the old ball and chain dragging you down. Talking, of course, about your desk. Experience IT freedom with Pulseway's remote monitoring and management software. They offer real-time alerts and notifications so you can tackle issues right away. That is, unless, of course, their amazing automations have already taken care of them for you. So now with Pulseway, you can enjoy a nice brunch at your favorite diner without having to stress about something going wrong with your systems back home or at the office. Server overheating? No worries. Switch them off and enjoy some dessert. And the best part is all you need is your phone. So you can enjoy peace of mind with that piece of pie. They offer month to month plans, yearly or no commitment at all. So click the link and sign up for a trial today to get 40% off on all of the available Pulseway plans. Huge thanks for watching. Hit like, get subscribed and just have a great old day. Maybe watch our GR Corolla review. Great car. Is it better than this? Oh yeah. It f*** kills this car.",
    "transcript_keywords": [
        "Honda Canada",
        "Civic Touring",
        "time",
        "Plouffe",
        "Canada has graciously",
        "yeah",
        "car",
        "Civic",
        "power windows",
        "power",
        "primer",
        "back",
        "paint",
        "Plouffe cars previous",
        "pretty",
        "job",
        "Plouffe cars",
        "thing",
        "good",
        "god"
    ],
    "transcript_entity_values": [
        "nine",
        "40%",
        "2004",
        "alex",
        "one",
        "Acoustic",
        "second",
        "HEPA",
        "four",
        "first",
        "a hundred",
        "JDM",
        "amazon",
        "Monthly",
        "sh*t",
        "Nick",
        "yearly",
        "a week",
        "First",
        "2 millimeter",
        "zero",
        "a couple more years",
        "Android Auto",
        "20 this morning",
        "chuck",
        "afternoon",
        "a hundred dollars",
        "today",
        "Alex",
        "less than one",
        "Pulseway",
        "Xenon",
        "Plouffe",
        "Honda",
        "GR Corolla",
        "2024",
        "2024",
        "20 PSI",
        "only 13 dolars",
        "about 100 bucks",
        "almost like three weeks",
        "about 15 minutes",
        "a couple of months",
        "Canada",
        "about half",
        "20-foot",
        "12",
        "month-to-month",
        "Linus",
        "1.8",
        "100 bucks",
        "two",
        "DIY",
        "month",
        "Civic",
        "Audiovox"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "PERSON",
        "TIME",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "DATE",
        "TIME",
        "DATE",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG"
    ],
    "vector": [
        -0.044935278594493866,
        -0.005741309840232134,
        0.02730635367333889,
        -0.07864750176668167,
        0.06410764157772064,
        0.011899759992957115,
        0.013257133774459362,
        0.05133836343884468,
        -0.04815367981791496,
        -0.01035259012132883,
        0.007379871793091297,
        -0.046758364886045456,
        -0.0036032970529049635,
        -0.0734415128827095,
        0.027799291536211967,
        0.01936502568423748,
        -0.0050249965861439705,
        0.03387213125824928,
        -0.053453635424375534,
        0.00481761060655117,
        0.025690486654639244,
        -0.05724584311246872,
        0.006307509262114763,
        -0.027504200115799904,
        0.01601482182741165,
        -0.0535721555352211,
        0.02736094407737255,
        -0.03241962566971779,
        0.029149815440177917,
        -0.08156583458185196,
        -0.015086820349097252,
        0.033823005855083466,
        -0.0347125306725502,
        -0.07119859009981155,
        -0.0074627394787967205,
        -0.07432084530591965,
        0.035005100071430206,
        0.009481307119131088,
        -0.045858271420001984,
        -0.02744804322719574,
        0.029701894149184227,
        -0.06495363265275955,
        -0.06930667906999588,
        -0.060722965747117996,
        -0.029618604108691216,
        -0.027728095650672913,
        0.009353386238217354,
        -0.08819950371980667,
        0.019874868914484978,
        0.006247519049793482,
        -0.002396463882178068,
        -0.03605704754590988,
        0.059830281883478165,
        -0.007920928299427032,
        -0.10323585569858551,
        0.01915045827627182,
        -0.02753601223230362,
        0.04369959980249405,
        0.042152926325798035,
        -0.06918096542358398,
        0.011185575276613235,
        -0.018877163529396057,
        -0.03378865122795105,
        -0.007101136259734631,
        -0.04575037956237793,
        0.004290577955543995,
        -0.08883889019489288,
        0.04770738631486893,
        0.017503831535577774,
        -0.04185991734266281,
        -0.021461958065629005,
        -0.02200295962393284,
        0.08725125342607498,
        0.00890821497887373,
        -0.020588474348187447,
        -0.019220389425754547,
        0.06958018988370895,
        0.0016345562180504203,
        -0.010973703116178513,
        -0.04319033771753311,
        0.041606493294239044,
        0.013292527757585049,
        -0.08880656957626343,
        -0.034862421452999115,
        0.05443757772445679,
        0.05160338059067726,
        0.022835681214928627,
        0.0024684728123247623,
        -0.046713925898075104,
        -0.01985858753323555,
        -0.01158707682043314,
        0.05379021167755127,
        0.07135961949825287,
        0.004687742330133915,
        0.022584659978747368,
        0.09530434757471085,
        -0.01649024337530136,
        -0.0230112224817276,
        -0.001028753351420164,
        0.08528108894824982,
        0.020604582503437996,
        0.01178340706974268,
        0.008176245726644993,
        -0.020407306030392647,
        -0.1553526669740677,
        -0.051502734422683716,
        -0.057569120079278946,
        0.10029148310422897,
        -0.0016606918070465326,
        -0.03962751105427742,
        -0.04155053570866585,
        -0.03312560170888901,
        -0.02964114211499691,
        -0.04149856045842171,
        0.02130957692861557,
        -0.013459807261824608,
        -0.02837418206036091,
        -0.05122636258602142,
        0.02306998334825039,
        -0.04474422335624695,
        0.04894506186246872,
        -0.04957764968276024,
        0.0027581006288528442,
        0.03736065700650215,
        0.0244283527135849,
        0.02776573970913887,
        0.04081181064248085,
        5.870811109246091e-33,
        -0.046620924025774,
        0.10521268099546432,
        -0.05396159365773201,
        -0.0050524636171758175,
        0.009676900692284107,
        0.022999297827482224,
        -0.0043515395373106,
        -0.014960343949496746,
        0.017904790118336678,
        -0.010293644852936268,
        -0.014050365425646305,
        0.06976808607578278,
        -0.10396761447191238,
        -0.07045138627290726,
        -0.004820592701435089,
        -0.0214991457760334,
        -0.08671463280916214,
        0.06665511429309845,
        -0.017574606463313103,
        -0.04396246746182442,
        -0.03151842951774597,
        -0.05052153393626213,
        0.02536429464817047,
        0.05293926224112511,
        0.12261437624692917,
        -0.020269284024834633,
        0.09612078219652176,
        -0.022107047960162163,
        0.005512430798262358,
        0.014780056662857533,
        -0.05629529058933258,
        0.07660794258117676,
        0.07826204597949982,
        0.0007856920128688216,
        -0.08597604185342789,
        0.01269188430160284,
        -0.06905575096607208,
        -0.06266575306653976,
        -0.006475923582911491,
        -0.017561083659529686,
        0.01004808023571968,
        -0.0060366117395460606,
        -0.038131099194288254,
        -0.03711836040019989,
        -0.016222462058067322,
        -0.01779242232441902,
        0.01228351891040802,
        0.1203625500202179,
        0.10004397481679916,
        -0.007617286406457424,
        0.0007496768375858665,
        -0.007924946956336498,
        -0.13216957449913025,
        0.035556670278310776,
        -0.01657743938267231,
        -0.007891016080975533,
        0.0034162814263254404,
        -0.013193804770708084,
        0.04890551045536995,
        -0.010092128999531269,
        0.04689430445432663,
        0.02063371241092682,
        0.06039397791028023,
        -0.06426902115345001,
        -0.046092476695775986,
        0.015151475556194782,
        -0.04390249028801918,
        0.006200786679983139,
        -0.042566847056150436,
        -0.06464706361293793,
        -0.03146464005112648,
        -0.08480068296194077,
        -0.056935228407382965,
        0.00981405284255743,
        0.06580016762018204,
        -0.009939049370586872,
        -0.07326403260231018,
        0.02172878198325634,
        -0.009915422648191452,
        0.01222225371748209,
        -0.03613130375742912,
        0.04089793935418129,
        0.027850402519106865,
        -0.013361101038753986,
        0.14067532122135162,
        0.001226187334395945,
        -0.036435384303331375,
        0.008194400928914547,
        -0.09260343015193939,
        0.01073226798325777,
        0.05606898292899132,
        0.034702368080616,
        -0.08094099164009094,
        0.0245851781219244,
        -0.03563624247908592,
        -7.375445347666557e-33,
        0.012862144969403744,
        0.028418436646461487,
        -0.009145625866949558,
        0.06781496107578278,
        0.13418491184711456,
        0.024961020797491074,
        -0.04196205735206604,
        -0.02326255850493908,
        0.062124501913785934,
        0.02102627232670784,
        0.024734552949666977,
        -0.0040266928263008595,
        -0.03743475675582886,
        0.018702492117881775,
        -0.04351881518959999,
        -0.04551741108298302,
        0.06182543560862541,
        -0.05768485367298126,
        -0.00047012639697641134,
        -0.024822672829031944,
        0.08859571814537048,
        0.04657945781946182,
        -0.04462895169854164,
        0.0330868661403656,
        -0.0647529810667038,
        0.011518952436745167,
        -0.033014535903930664,
        0.11605745553970337,
        0.003624628996476531,
        0.007092990446835756,
        0.002825044561177492,
        -0.03402997925877571,
        -0.06118360534310341,
        0.019620772451162338,
        0.05552775785326958,
        -0.047013793140649796,
        0.14842505753040314,
        0.03854655846953392,
        -0.07818546891212463,
        -0.008598476648330688,
        -0.009972007013857365,
        -0.025580383837223053,
        0.04439898580312729,
        0.022647645324468613,
        -0.0403594933450222,
        -0.10130589455366135,
        -0.048063505440950394,
        -0.049517180770635605,
        -0.010449078865349293,
        0.023434698581695557,
        0.11615575850009918,
        -0.013925808481872082,
        0.057716432958841324,
        0.05417316034436226,
        -0.08119957149028778,
        0.039954282343387604,
        0.0963834673166275,
        0.07090289145708084,
        -0.060061004012823105,
        0.03198658674955368,
        0.016234837472438812,
        -0.011393549852073193,
        -0.02247541770339012,
        -0.05423643812537193,
        0.0034912521950900555,
        -0.09697650372982025,
        0.09173988550901413,
        -0.013984806835651398,
        -0.04048258066177368,
        -0.03624708205461502,
        0.08089864253997803,
        -0.028302716091275215,
        -0.038771651685237885,
        -0.05233512446284294,
        -0.06418488174676895,
        0.017507502809166908,
        0.028319992125034332,
        -0.01503246184438467,
        0.08980177342891693,
        -0.08322799950838089,
        -0.04465900734066963,
        -0.0025990784633904696,
        0.08533801883459091,
        -0.013680136762559414,
        0.030995303764939308,
        0.05500410869717598,
        0.033163126558065414,
        -0.06505198776721954,
        0.05445243418216705,
        0.01906789094209671,
        -0.05338108912110329,
        0.037742968648672104,
        -0.0505514070391655,
        -0.0005965750897303224,
        0.03985203430056572,
        -6.695913867815761e-08,
        -0.0073328809812664986,
        0.06606116890907288,
        -0.06959405541419983,
        -0.028016194701194763,
        -0.006010236218571663,
        -0.08168166130781174,
        -0.006999494507908821,
        0.029154861345887184,
        -0.05802708491683006,
        -0.05467423051595688,
        0.07523650676012039,
        -0.06985235959291458,
        0.05499889701604843,
        0.03208952769637108,
        0.055202268064022064,
        -0.023434659466147423,
        -0.011977218091487885,
        0.1682194322347641,
        -0.06916876882314682,
        -0.06144653260707855,
        0.0006550349644385278,
        0.005557920318096876,
        0.05904649570584297,
        0.07241146266460419,
        0.05572659894824028,
        -0.028949681669473648,
        0.05691514536738396,
        0.08639546483755112,
        0.14954687654972076,
        -0.0365552119910717,
        -0.04950574412941933,
        0.0010194634087383747,
        0.07166029512882233,
        -0.02882024087011814,
        0.0246296264231205,
        -0.002262385794892907,
        -0.10012473165988922,
        0.03194349631667137,
        -0.008333875797688961,
        0.04196735844016075,
        0.03207375109195709,
        -0.05610526725649834,
        -0.07388374954462051,
        0.012111453339457512,
        0.027288291603326797,
        -0.021036667749285698,
        -0.05519230291247368,
        -0.12333687394857407,
        -0.030531559139490128,
        0.04703176021575928,
        0.023810256272554398,
        -0.024009281769394875,
        0.0015597953461110592,
        -0.002727779559791088,
        0.023799080401659012,
        -0.04170702025294304,
        -0.09398896992206573,
        0.07934693247079849,
        -0.003199297236278653,
        0.03837276250123978,
        -0.008092300966382027,
        0.024070290848612785,
        -0.04146751016378403,
        0.10720755904912949
    ]
}